{"url": "Gamorr/Legends", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Galactic Empire planets", "Category:Gamorr locations", "Category:Infinite Empire planets", "Category:New Republic planets", "Category:Opoku system planets", "Category:Sith planets", "Category:Triellus Trade Route", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Gamorr"}, {"tag": "p", "text": "Gamorr was an agrarian planet located in the Opoku system of the Outer Rim Territories. It was the homeworld of a porcine sentient species, the Gamorreans. Its varied terrain ranged from frozen tundra to deep forests, and was considered quite pleasant by off-worlders. Nevertheless, tourism was highly discouraged to Gamorr because of the vicious lifestyle of ferocious, bloody warfare constantly being waged between rival Gamorrean clans. Prominent mushrooms were also found on Gamorr, as were native coolsap trees."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Gamorr occupied the third orbit from the star Opoku in the Opoku system, which was itself located in the Galov sector of the Outer Rim Territories region of the galaxy. It was also within the region known as the Slice and situated on the Triellus Trade Route, a hyperlane that connected it to Arami and Lyran."}, {"tag": "p", "text": "Gamorr was a terrestrial world with a diameter of 15,520 kilometers and was orbited by two moons. Its day lasted 28 standard hours and its year consisted of 380 local days. It featured a breathable atmosphere, a moderate hydrosphere, a temperate climate, and standard gravity. The free water in Gamorr's atmosphere was slightly high, and as a result, severe weather and rain forests were both common on the world. Gamorr's terrain included icy tundra in the north and equatorial inland seas, as well as deciduous forests, mountains, jungles, fungus groves, frozen plains, and swamps. Wugguh was a continent on Gamorr."}, {"tag": "p", "text": "The forests and jungles of Gamorr covered a high percentage of its land mass, often overgrowing mountainous areas, and boasted a diverse variety of flora and fauna. Gamorrean forests were typically dense and damp, with hardwood trees that provided shelter for fungi that lived on the dark forest floors. Snoruuks, mobile mushrooms which collectively crept across the forest floor, were native to Gamorr, and algark stalks produced a dangerous fungus found in the deep forests."}, {"tag": "p", "text": "No animals larger than one meter long or high were known to inhabit the forests, but smaller animals, including birds, rodents, and primates, could be found in the upper levels. Morrts and dwoobs were among the animals present on Gamorr, as well as quizzers, which lived in the forests of Gamorr. Watch-beasts were another species that originated on Gamorr. Larger animals may have existed on Gamorr at some point before being hunted to extinction by the Gamorreans."}, {"tag": "p", "text": "Gamorr featured a clan-based and feudal system of government. A preindustrial agricultural world, it was largely self-sufficient and its inhabitants traded little with offworlders. Nevertheless, it exported mercenaries and slaves and imported foodstuffs, technology, and melee weapons. The mercenaries produced by Gamorr were considered to be some of the most violent in the galaxy. The Gamorreans were unable to prevent the Hutts from visiting Gamorr and coercing the natives into servitude. Scrapped hardware originating from weapons, vehicles, and gear acquired by Gamorrean mercenaries accumulated in swamps and junk heaps across Gamorr."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The history of Gamorr was characterized by warfare and violence, with conflicts so numerous that almost no historians other than the Gamorreans themselves could genuinely understand them. The first trade ship to land on Gamorr caused a dispute between five Gamorrean clans, who warred over the right to approach the ship. After two days of combat, the victorious Gamorreans destroyed the craft. This incident was followed by six similar events, after which the traders sent a heavily-armed vessel with orders to capture a number of Gamorreans instead of opening trade. The region of space surrounding Gamorr was explored during the period between 5000 and 4000 BBY."}, {"tag": "p", "text": "Gamorr had received visitors from offworld many times by the time of the Great Sith War, and the first Humans who arrived on Gamorr enslaved large numbers of the native population. During the Great Sith War, Gamorr was considered to be under Sith occupation. The Galactic Republic later drove the Sith forces away from Gamorr, and the world returned to a state of primitive isolation that continued until after the Jedi Civil War. The Mandalorians avoided Gamorr, but it was absorbed into the Sith Empire of Darth Revan, and during the Dark Wars, the planet fell under the dominion of nearly a dozen Sith warlords at various times."}, {"tag": "p", "text": "During the New Sith Wars, a Sith academy was located on Gamorr, which fell within both Hutt Space and space controlled by the Sith. While the Galactic Republic ignored Gamorr during the Clone Wars due to the primitive nature of its inhabitants, the Confederacy of Independent Systems gave special attention to the world, transporting thousands of Gamorreans offworld and employing them as mercenaries. Although a number of small space battles occurred in nearby star systems, the surface of Gamorr was never the site of combat during the conflict."}, {"tag": "p", "text": "Gamorr was within Hutt Space during the Clone Wars, but by 14 BBY, the region's borders had shifted, leaving Gamorr outside of Hutt Space. Attempts by the Galactic Empire to civilize Gamorr resulted in failure, with Imperial representatives staying in a small number of fortified trading ports."}, {"tag": "p", "text": "During the Yuuzhan Vong War, Hutt Space was attacked by the invaders. Many Hutts fled to Rodia, Tatooine and Gamorr."}, {"tag": "p", "text": "Gamorr remained largely unchanged throughout the rise and fall of galactic powers as late as the time of the Empire of Darth Krayt, which interfered little in Gamorr's affairs due to the difficulty of convincing nobles and bureaucrats to move to the planet. By 137 ABY, Gamorr was within the region of space known as the Hutt dependencies."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Gamorr's population of 500 million consisted entirely of Gamorreans, a porcine sentient species native to the world, and the unceasing clan wars fought by the Gamorreans brought fame to their homeworld. While most Gamorreans who left Gamorr did so when they were sold into slavery by their clans, others found employment as bodyguards, mercenaries, and professional soldiers elsewhere in the galaxy, and some emigrants were simply unusually intelligent. The Gamorrean and Basic languages were spoken on Gamorr. Gamorr possessed a single colony, the nearby world of Pzob."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Gamorr was the site of at least one spaceport–a landing field–and lacked a capital city. The most powerful and prestigious clans on the planet controlled about a dozen large fortresses, which resembled townships. Offworlders sometimes conducted trade with natives at such settlements. Jugsmuk Station, a landing field with a cluster of pre-fabs and longhouses abutting Jugsmuk Clanhome, was a major port on Gamorr."}, {"tag": "p", "text": "Around 1002 BBY, the Brotherhood of Darkness operated a Sith academy on the world that specialized in the training of Sith Warriors and Marauders. Gamorr was also a site for podracing; the events were made safe by the Hutts. One podracing event was located in the ruins of the ancient Gamorrean Carnuss Gorguul's citadel. Under the Galactic Empire, it was the site of a NAMIS disaster. However, the planet was never united under a single government, and remained unaligned after the fall of the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Gamorr in the Dufilvan sector (a misspelling of the true Dufilvian sector), which is actually located in the Mid Rim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}