{"url": "Gampassa", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Wookieepedia Good articles under probation", "Category:Cut content from Star Wars: The Clone Wars", "Category:Aquatic creatures", "Category:Creatures of Glee Anselm", "Category:Creatures of unspecified diet", "Category:Species of undefined sentience", "Category:Turtles"], "nodes": [{"tag": "h1", "text": "Gampassa"}, {"tag": "p", "text": "The Gampassa was a species of turtle native to the planet Glee Anselm's oceans. Their skin was wrinkled and gray, while their bodies were round and elongated. A ponderous head and tiny tail grew from the creature's front and backside, respectively. The turtles had six pointed flippers, the two forelegs growing longer than the others. At least one Gampassa was 2,310 meters long, and the species' large size allowed for the Nautolans, another of Glee Anselm's native species, to use their shield-like shells as locations for their villages. Alternatively emerging above and submerging below the ocean every couple of centuries, different generations of native Nautolans would either be born above or below water."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Gampassa, a species of turtle, had wrinkled, gray skin and a rounded, oblong body that included a brown shield shell. The creatures had six triangular flippers that ended in points; those limbs were situated symmetrically on both the left and right sides, and their forelegs grew much longer than the others. A short tail adorned the species' anterior, and nostrils were located between the eyes on the creatures' bulbous heads. At least one specimen was 2,310 meters long."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Members of the Gampassa species swam in their homeworld's oceans such that their shells stuck out of the water like islands, and every couple of centuries they would either rise above or submerge themselves below the ocean's surface."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Gampassa species was native to the oceans of the Mid Rim planet Glee Anselm. Due to the creatures' enormous size, the Nautolans, another native species of Glee Anselm, used the species' shells as locations for their villages, complete with landing platforms built atop the shells. Every couple of centuries, the turtles would alternate with going above or below the ocean level, and entire generations of the species' native Nautolans would either be born above or below water accordingly."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gampassa species was intended to appear in Star Wars: The Clone Wars' second season episode \"Children of the Force\", released October 9, 2009, although it was cut from the final episode. Concept art for the species was included in the extra features of the 2010 Star Wars: The Clone Wars The Complete Season Two Blu-ray release. One of the images was signed by concept artist Jackson Sze, dated to December 12, 2007."}, {"tag": "p", "text": "The species was further discussed in 2012's Star Wars: The Clone Wars The Complete Season Four. In that, Supervising Director Dave Filoni discussed more details surrounding the turtles' intended inclusion in the series, including showing concept art and Maya 3D models for landing platforms aboard the creatures' backs. Lead character designer Kilian Plunkett also asked Filoni what the turtles were eating, given their size, and Filoni imagined it would be difficult for them to find food sources in their environment. The 2013 Star Wars Blog article \"Drawing from the Imagination: Mythological Creatures in Star Wars, Part 2,\" written by Tim Veekhoven and Kevin Beentjes, included the Gampassa and noted its resemblance to the Hah-nu-nah turtle island of Native American oral legend. The plural form of the species' name was never established."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}