{"url": "Alfonso_Luiz_Obota", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance Military officers", "Category:Humans", "Category:Impersonators", "Category:Males"], "nodes": [{"tag": "h1", "text": "Alfonso Luiz Obota"}, {"tag": "p", "text": "Alfonso Luiz Obota, also known as Al, was a Human male native of the Adega system. A graduate of the Merchant Academy, Obota joined the Rebel Alliance and became the Second Officer on the Alliance Special Operations transport Pride of Aridus. During an infiltration mission on an Imperial planet, a Special Ops team fell under heavy fire from the Imperial forces, and the ship's commanding officer, Captain Nord, wished to leave them behind. Obota did not agree to do so and led a mutiny against Nord, confining him in his cabin and taking control of the ship. Obota was able to extract three SpecOps members, but during the escape from the planet, five crew members were lost when TIE Fighters attacked the Pride of Aridus."}, {"tag": "p", "text": "For his rebellious actions, Obota was court-marshaled and imprisoned in Military Correction Facility 63 on the planet Milagro, where he spent several months. In 5 ABY, he was visited by two Rebel agents, Jan Ors and Kyle Katarn. The two secured Obota's release so he could help them land on the planet Ruusan, which was under the control of the Imperial Inquisitor Jerec's forces. Obota was to impersonate the Imperial deck officer Hortu Agar in charge of the transport High Hauler, which was carrying a cargo of defective proton torpedoes that would attract the Imperials' attention. Having reached Ruusan, Obota gave the torpedoes to Jerec's troops, and soon the High Hauler blended with the rest of the force. As members of the transport's crew, Ors and Katarn were then able to land on Ruusan in their ship, the Moldy Crow."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mutiny and imprisonment"}, {"tag": "p", "text": "The Human male Alfonso Luiz Obota—referred to as \"Al\" by his friends—was a native of the Adega system who studied at the Merchant Academy and graduated fourth in his class. By 4 ABY, he qualified as third officer on a freighter but soon resigned and joined the Rebel Alliance. Obota was commissioned as second lieutenant and became the Second Officer on the Pride of Aridus, an Alliance Special Operations transport commanded by Captain Nord. Approximately six months after Obota had been commissioned, the Pride of Aridus participated in a Special Ops operation on an Imperial-controlled planet. Under the guise of discharging a legitimate cargo, the ship landed a twelve-man team of commandos, who—according to the insertion plan—were supposed to come back in exactly six hours."}, {"tag": "p", "text": "The team's cover, however, was blown, and the group was late by two minutes. Nord was almost ready to leave without them when the commandos finally raced toward the ship under heavy fire from the Imperials. As the Pride of Aridus fell under fire as well, Nord gave the order to take off, intent on leaving the SpecOps team behind. Not willing to abandon his fellow Rebels, Obota punched Nord in the face and confined him in his cabin. Obota then seized control of the ship and waited for the commandos, three of whom were able to reach the ship and were successfully extracted thanks to Obota's actions. However, when the Pride of Aridus finally lifted off and reached the planet's atmosphere, it was attacked by several TIE Fighters. In the ensuing battle, five crew members were killed, and the ship suffered serious damage, barely escaping by making a jump to hyperspace."}, {"tag": "p", "text": "For his mutiny, Obota was court-marshaled and sentenced to Military Correction Facility 63 on the planet Milagro, where he was given the serial number \"Prisoner 272-20-136\" and assigned to digging work under the watchful eye of detainment droids. Obota spent the following six months working and contemplating his past actions. In 5 ABY, the Correction Facility was visited by two Rebel agents—Kyle Katarn and Jan Ors—who requested an audience with Obota. The two questioned him about the SpecOps operation and asked if, knowing the consequences of his actions, he would have made the same decision again. Without a second thought, Obota answered that he would, and his answer satisfied Ors. She proceeded to offer Obota a pardon and a reinstatement as a lieutenant, in exchange for his services as a deck officer during a secret Rebel mission: the infiltration of the planet Ruusan, which was controlled by the forces of the Imperial Inquisitor Jerec. The Inquisitor was intent on harnessing the power of the planet's Force nexus located in the Valley of the Jedi, and Katarn wanted to prevent him from doing so. Believing that the mission could not be worse than his imprisonment on Milagro, Obota accepted the offer."}, {"tag": "h3", "text": "Scam"}, {"tag": "p", "text": "Jerec's forces had established a blockade around Ruusan and did not allow anyone near the planet without required recognition codes, which were unknown to Katarn and Ors. The two, however, formulated a plan to infiltrate Ruusan as part of the crew of the Imperial transport High Hauler, which would be carrying a cargo of proton torpedoes. Katarn and Ors hoped that Jerec's troops would not miss a chance to receive additional ordnance and would permit the transport to reach Ruusan without the recognition codes. To explain the absence of those codes and the transport's appearance near the planet, a fake story was formulated, according to which, the High Hauler had been carrying the torpedoes to the planet Byss, but had been caught in a battle with the Rebels, had suffered heavy damage, and had escaped to Ruusan. During the \"battle,\" the ship's commanding officer, Captain Drax, and the majority of the bridge crew had been killed, and the engineering officer, Lieutenant Hortu Agar—whom Obota was to portray—assumed command. Since recognition codes were issued on a need-to-know basis and engineering officers were not cleared to receive them, that would have explained their absence to the Imperials."}, {"tag": "p", "text": "To accommodate this story, the entire ship was given a battle-weary look, complete with makeshift patches, dangling cables, and fire-blackened control consoles. Reflecting \"heavy casualties,\" the transport was crewed with only twelve men out of the intended twenty-five. The crew members, including Obota, wore blood-stained bandages and carefully applied makeup. After running more than twenty simulations, the transport embarked on the actual mission. Having reached Ruusan, the crew of the High Hauler witnessed a large battle group orbiting the planet. The battle group consisted of three frigates, about two dozen picket ships, and Jerec's personal flagship, the Super Star Destroyer Vengeance. Although he had been expecting to see something similar to this, Obota was still frightened by the size of the enemy force. Nevertheless, when the Vengeance hailed the High Hauler, Obota answered the call and played his part, telling the Imperials the fabricated story."}, {"tag": "p", "text": "Although the Imperials initially wanted to destroy the High Hauler, the mention of the proton torpedoes forced them to change their mind. They dispatched a boarding party to inspect the ship's condition and secure the torpedoes, which, in fact, were defective and would explode in the launch tube if used. After the boarding party, led by an Imperial lieutenant, finished its cursory inspection and left, a lighter arrived and took all the torpedoes. After that, Obota signaled to Jerec's troops that he was going to make necessary repairs to his vessel and dispatched Katarn and Ors aboard their ship—the Moldy Crow—on a series of errands to the surface of Ruusan. Those errands included the delivery of spare parts, the securing of food rations, and a fictional training \"mission\" that allowed the two agents to pass through Ruusan's heavily guarded northern hemisphere."}, {"tag": "p", "text": "In fact, the objective of such missions was to help Katarn and Ors familiarize themselves with the Imperial operation and establish the Moldy Crow within the pattern of the battle group's comings and goings. Sixteen hours later, the High Hauler was ready to leave and received all necessary clearances to do so. While preparing for a jump to hyperspace, Obota steered the ship toward a restricted Class I security zone at Ruusan's atmosphere, where the Moldy Crow, with Katarn and Ors on board, left the transport's hangar and set off for the planet's surface. Although Obota's maneuver had been noticed by the fleet operations officer, he did not report it and wrote it off to the commanding officer's lack of experience. Eventually, Katarn was able to reach the Valley of the Jedi, where he confronted and killed Jerec."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Obota was an experienced deck officer and was caring toward his fellow Rebels. His unwillingness to abandon the Special Ops team led him to start a mutiny, although Captain Nord implied that Obota showed a fair amount of disobedience since the beginning of his service aboard the Pride of Aridus. Obota fully realized the results of his decision and spent countless days and nights on Milagro thinking about it. He remembered the faces of the five crew members who had died and wished that he had died instead of them. Overall, however, he did not regret his actions and thought that he would have done the same thing even if he had known the outcome. Even on Milagro, Obota still displayed defiance by taking an unauthorized break from his work. When a detainment droid noticed this and gave him a warning, Obota behaved sarcastically toward the machine. He also did not like to be addressed as \"Prisoner 272-20-136\" and unsuccessfully tried to make the droid call him by his real name."}, {"tag": "p", "text": "After running many simulations of the Ruusan operation, Obota expected to find an Imperial battle group above the planet but was nevertheless scared by the sight of it. During the inspection, he could not help but like the lieutenant in charge of the boarding party, who was very friendly and talkative. Still, Obota listened carefully to everything he said, as he realized that every bit of information could be important. He was cautious and did not allow the pilots of the lighter to step aboard the High Hauler. He did so by leaving the hangar open to space, thus forcing the Empire to rely on droids during the loading of the torpedoes. Obota had some acting talent, which allowed him to play the role of Hortu Agar. He had dark brown hair a tattoo on his right shoulder. After the Imperials finished loading the torpedoes from the High Hauler, Obota wished to remain near Ruusan long enough to see the damage the defective ordnance would cause, but he complied with Ors' order to leave the planet as soon as he received all clearances."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alfonso Luiz Obota first appeared in Dark Forces: Jedi Knight, a 1998 novella written by William C. Dietz. He later appeared in the audio adaptation of the novel, voiced by Emil Herrera."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}