{"url": "Gannis_Ducain", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Character stubs", "Category:Kajain'sa'Nikto", "Category:Males", "Category:Resistance members", "Category:Smugglers", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Gannis Ducain"}, {"tag": "p", "text": "Gannis Ducain was a Kajain'sa'Nikto male gunrunner who stole the Millennium Falcon from Han Solo, only to have it stolen from him later by the Irving Boys. He later had a change of heart and joined the Resistance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Stealing the Falcon"}, {"tag": "p", "text": "Gannis Ducain was a Kajain'sa'Nikto male who worked as a janitor in Takodana Castle for Maz Kanata. In need of help due to his usual First Mate, Chewbacca, being busy with family business, Captain Han Solo hired Ducain to help with a job to the planet Christophsis, taking him aboard the Millennium Falcon, which Ducain knew from its role in events before and during the Galactic Civil War. Although Solo had given the young man advice on choosing to fight for what was right in the galaxy, Ducain elected to steal the starship while Solo left to meet his contact, using the legendary freighter to make a name for himself as a gunrunner."}, {"tag": "h3", "text": "Enemy of the First Order"}, {"tag": "p", "text": "Ducain added a rotating core to the ship's gun well. Gaining the help of a mysterious contact, his legend grew throughout the galaxy for years until he met with his contact on the world of Vardos. Really an officer of the emerging First Order, Ducain's contact attempted to recruit him to their emerging effort. Supposedly agreeing but really planning to run, Ducain believed he needed to return the Falcon to Solo, only to lose the ship to the Irving Boys before he had the chance. Nevertheless, after the Falcon was again stolen by junk boss Unkar Plutt, Solo and Chewbacca recovered the Falcon after it had been taken by defecting stormtrooper Finn and the Force-sensitive Rey. In 34 ABY, after Solo's death during the Battle of Starkiller Base, Chewbacca started to fix the unadvised modifications made by Ducain whilst Rey was trained by Jedi Master Luke Skywalker on Ahch-To."}, {"tag": "p", "text": "During her search for the Falcon, Bazine Netal was told by Lady Proxima to travel to Jakku to speak with Ducain about the ship. By the time Netal found him, Ducain had officially changed his ways and decided to join the Resistance. Ducain eventually accompanied Finn to Horizon Base to attempt to recruit the Oru resistance. They were found by stormtroopers, but managed to slip away. They were then captured by the Oru forces, but Finn and Ducain convinced them of the righteousness of the cause. Mezlo used a candori to aid their escape. Mezlo declined their offer to join, but affirmed that they are honorable and will join in the fight if called."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ducain was first mentioned in the 2015 novel Smuggler's Run: A Han Solo & Chewbacca Adventure, as part of Journey to Star Wars: The Force Awakens. His first appearance was in Star Wars Adventures comic book series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}