{"url": "Gardens_of_T%27alla/Legends", "categories": ["Category:Legends articles", "Category:Ossus locations", "Category:Parks and gardens"], "nodes": [{"tag": "h1", "text": "Gardens of T'alla"}, {"tag": "p", "text": "The Gardens of T'alla were a place of reflection and peace overlooking the Great Jedi Library on the planet Ossus. Consisting of flowered gazebos, rock gardens, fountains, and pillars, the Gardens were one of the most peaceful places on Ossus."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Millennia before the Great Sith War, the Neti Jedi Master T'alla founded the Gardens high in the mountains of Ossus to serve as a place of reflection and philosophical discourse. When her project was completed, T'alla planted herself at the heart of the Gardens and stood sentinel for thousands of years of the peaceful grounds. A the Gardens grew around her, visitors sought this peaceful retreat to contemplate the Force and learn from the great Masters of the era. The Jedi Agricultural Corps built greenhouses in the Gardens where they studied plants and experimented with new seeds. Constructing vast hedge mazes and exotic flower beds, the rock garden would eventually inspire the Muntuur stones that would be found in the Jedi Temple on Coruscant after 4000 BBY."}, {"tag": "p", "text": "At the beginning of the Great Sith War, the Jedi Exar Kun spoke to a crowd of fellow Jedi gathered in the Gardens to join him in his journey to Yavin 4 on an expedition for greater understanding of the Force. Beguiled by Kun's charm, the unsuspecting Jedi that followed him were quickly seduced to the dark side of the Force and helped Kun form his Brotherhood of the Sith through which he attempted to bring the Jedi Order to its knees. Like everything else on the surface of Ossus, the Gardens of T'alla were destroyed when the Cron Supernova washed across the planet and ended the Jedi's dominion over the world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}