{"url": "Garral/Legends", "categories": ["Category:Legends articles", "Category:Canines", "Category:Creatures of Wayland", "Category:Genetically-engineered creatures", "Category:Predatory creatures", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Garral"}, {"tag": "p", "text": "The garral was a canine pack hunter genetically engineered by Imperial scientist Luthos Garral, who crossed the genes of the Mantessan panthac with those of several other creatures. The Galactic Empire deployed them to supplement Human security forces, for example to the forests of Wayland to protect the Mount Tantiss facility. According to Mara Jade, these animals used to be used as watchdogs for the Empire."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Garrals looked almost identical to their genetic template, Mantessan panthacs, but larger. They had a speckled coat of gray fur along their backs, thick manes around their necks and shoulders, and long, tufted tails."}, {"tag": "p", "text": "Garrals were attracted to the ultrasonic noises created by repulsorlifts; they could hear one from hundreds of meters away. Such sounds nearby drove them into a killing frenzy to attack any unrecognized living or moving thing."}, {"tag": "p", "text": "Genetically engineered by Imperial garrison commander Luthos Garral, they had a good temper for a pack hunter animal. The main template was combined with several less vicious predators and a few domesticated creatures. The resulting animal eventually was perfected as a loyal, alert, easily handled animal common in many Imperial outposts in the fringe worlds. Closer to the Core Worlds, Imperial reliance on technology made garrals less common because of their acute repulsor sensitivity."}, {"tag": "p", "text": "The garrals had litters of two to eight cubs and were very protective of their young. Only a trusted and experienced handler could get near a garral mother. Garrals grew to their full length of two meters in three years and had a life span of 30 years."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Garrals lived in packs, defending the pack leader. They often treated their handlers as pack leaders, following and protecting them even when not directed to do so."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Mara Jade encountered garrals somewhere in the Empire, but even in her work as the Emperor's Hand never saw a reference to where the creatures originated. She was familiar enough with them, however, to know that garrals were usually radiotagged with a collar which would inform their controllers of the presence of a repulsorlift. Han Solo and Chewbacca never saw them before, but encountered Mantessan panthacs at some point when visiting Mantessa."}, {"tag": "p", "text": "Mara, Han, and Chewbacca, along with Luke Skywalker and Lando Calrissian, ran into several garrals on Wayland during their trek to Mount Tantiss when they first attempted to activate their speeder bikes. After this first encounter, however, the Noghri who were trailing them disposed of any other potential attackers."}, {"tag": "p", "text": "By the time of the New Jedi Order, scavengers, mercenaries, crime lords, and even the New Republic occasionally used them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}