{"url": "Garris_Shrike", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Bounty hunters", "Category:Con artists", "Category:Crime lords", "Category:Humans", "Category:Males", "Category:Smugglers", "Category:Swoop racers", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Garris Shrike"}, {"tag": "p", "text": "Garris Shrike was the man who raised Han Solo. As a young man, he was a bounty hunter, but his quick temper kept him from collecting many live bounties. Instead, he turned to crime, collecting a group of orphans whom he used in confidence tricks and thefts, based aboard the decommissioned troopship Trader's Luck in orbit over Corellia. One of those orphans was Han Solo. Shrike rescued Solo from the streets, raised him, trained him, and beat him profusely when aggravated."}, {"tag": "p", "text": "In 10 BBY, Solo fled from Trader's Luck after a showdown with Shrike in which Shrike's brother Larrad was injured and Shrike killed Dewlannamapia, the Wookiee who had served as Solo's mother figure. After Solo accumulated a large bounty due to his actions as a smuggler for the Hutts, Shrike set out to track him down. He caught up with Solo on Coruscant and captured him, but after a brawl with Solo, Shrike was shot to death by a competing bounty hunter."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Harsh master"}, {"tag": "p", "text": "A hard-edged young man with a quick draw and a deadly aim, Garris Shrike turned to bounty hunting as a career. Impatient and quick-tempered, he lost many live bounties to an overactive trigger finger, a fact that ultimately convinced him to retire from the profession."}, {"tag": "p", "text": "Shrike found a new career as the leader of a ring of criminals. He kept a close eye on the streets of Corellia and approached orphans to adopt them into his group of thieves and con artists if they appeared to show promise. He programmed a droid, F8GN, to train the children in pickpocketing techniques. Some, such as Danalis, he strung along with promises of future aid which would never come; others he simply beat into compliance. With older crew members, he carried out smuggling operations and more complicated con games. Shrike spent as little as possible on his child-thieves, including medical care, in his quest to make a profit, and also kept them from getting anything beyond an elementary education; nonetheless he saw himself as a beneficent figure to the orphans and street urchins he picked up."}, {"tag": "p", "text": "He acquired the decommissioned Liberator-class troopship Guardian of the Republic, renaming it Trader's Luck and parking it in orbit over Corellia. There he housed his \"clan\" of traders and criminals, which grew to approximately one hundred individuals by 10 BBY. As their leader, he ruled absolutely and demanded total obedience as well as proper shipboard procedure. Only his officers—among them his brother Larrad, the ship's navigator Nooni Dalvo, and the Elomin Brafid—were allowed to carry weapons, in order to preserve Shrike's control. While aboard the Trader's Luck, he wore a military uniform of his own design, patterned after that of a Moff and festooned with elaborate imitation decorations. A ring featuring a Devaronian blood-poison gem allowed him to inflict lingering damage on those he punished, a feature he enjoyed."}, {"tag": "p", "text": "At times, Shrike took the Trader's Luck out of Corellian orbit, visiting various worlds. There, he sent the young children to the surface. Most of them picked pockets, while especially deformed ones went begging. All had quotas to meet, with thrashings the result if they failed to perform. Older children and crew members worked aboard the ship, helping move cargo. Intermittently, Shrike would run a major scam on Corellia, setting up several children to pose as families in rented estates. Shrike would pose as the patriarch of the family, gain the confidence of other rich Corellians, and gain investments in false businesses before making off with the credits."}, {"tag": "p", "text": "In 27 BBY, Shrike learned of a two-year-old orphan begging on the streets of Corellia—Han Solo. He watched Solo and, deciding that he was a valuable prospect, approached him on the street and brought Solo into his group, having him trained along with the many other orphans. He dangled the hope of Solo's last name and past before him, promising to tell him those secrets eventually; he never did. Shrike found much to like in Solo, who grew into a very useful thief and con man. Shrike also found that Solo had talent as a swoop racer, and he trained Solo to fly swoops, making use of the prize money brought in by the young champion."}, {"tag": "p", "text": "Around 20 BBY, the Wookiee exile Isshaddik joined Shrike's crew, only to be killed a year later in the course of a smuggling run to Nar Hekka. Isshaddik's widow, Dewlannamapia, had done some cooking aboard Trader's Luck, and Shrike enjoyed her dishes. He invited her to stay on as the ship's cook, despite the fact that she had children on Kashyyyk to whom she could return. As she had become a sort of surrogate mother to Solo and wanted to protect him from Shrike, she agreed to remain."}, {"tag": "p", "text": "Solo was by far the boldest and hardest to control of the youths under Shrike's thumb, and as a result Shrike found himself having to discipline Solo frequently. As a child, Solo attempted to run away several times, leading to intense beatings, as when Solo once went missing for over a month before being turned in by his cousin, Thrackan Sal-Solo. The resultant battering was one of the worst Shrike ever administered to the boy. After Solo won the Jubilar Free-For-All in 12 BBY, he took a swing at Shrike, feeling confident; Shrike immediately knocked him out of the fight and proceeded to beat him nearly to death before Larrad and the other officers had to pull him away from the boy. Another drubbing in 11 BBY left Solo unable to walk for two days."}, {"tag": "h3", "text": "Showdown with Solo"}, {"tag": "p", "text": "One night in 10 BBY, Shrike's sabacc game with his officers was interrupted by a flicker in power on the weapons locker's status board. Shrike determined that the locker had been broken into and immediately suspected Solo. He hurried with Larrad and Brafid to the galley, where he found Solo saying his goodbyes to Dewlannamapia. Infuriated with Solo's acting up, he decided to teach the rebellious youth, who had stolen a blaster and was planning to escape, a serious lesson in obedience."}, {"tag": "p", "text": "Dewlannamapia moved to protect Solo and Shrike drew his blaster; the terrified Solo lashed out at Shrike, knocking him down. The Wookiee proceeded to snap Larrad's arm, and Solo shot Brafid. Shrike was able to draw a bead on Solo and force the surrender of both the insubordinates. Pronouncing a death sentence on Solo, he prepared to fire, but Dewlannamapia leaped in the way of the bolt. Solo tackled Shrike, knocking him unconscious. By the time Shrike awoke, Dewlannamapia was dead, and Solo had escaped."}, {"tag": "h3", "text": "Rematch"}, {"tag": "p", "text": "After his injury, Larrad never quite recovered, and the crew of the Trader's Luck began to see harder times. Later that year, Shrike heard that the Besadii Hutt kajidic was offering several bounties for Vykk Draygo, also known as Jenos Idanian and a slew of other aliases. Shrike immediately recognized them as Solo's. Seeing a chance for a large payday and revenge against his former ward, Shrike returned to his bounty hunter roots, tracking down Solo."}, {"tag": "p", "text": "Shrike found him on the rooftops of Coruscant one night, celebrating his acceptance into the Academy of Carida—a long-held dream that Shrike had frequently mocked. Getting the drop on the young cadet, he held Solo at blaster-point and began gloating. Solo was able to knock the blaster out of Shrike's hand and flee, forcing Shrike to pursue Solo across the rooftops, finally landing a stun shot that incapacitated the younger man. Shrike dragged his prize back to a turbolift, in which Solo, having recovered from the stun blast, sprang at Shrike. They kicked and gouged at each other before Solo got the better of Shrike and recovered the bounty hunter's blaster. With Solo training the gun on him, Shrike tried to talk the younger man down as he moved in closer, confident Solo would not shoot him in cold blood. He held out the promise of telling Solo his background, but as he closed in on the wavering Solo, Shrike was shot to death by another bounty hunter seeking the same target, who had followed Shrike in the knowledge that the older man could find Solo. After his death, the Trader's Luck crime ring fell apart, and the ship was abandoned."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Garris Shrike was a man accustomed to control. As leader of the Trader's Luck clan, Shrike tolerated no dissent and enforced his rule absolutely. Hot-tempered and impatient, he was quick to resort to violence when frustrated, resulting in the end of his bounty hunting career and abundant, vicious beatings for those children under his control. He had high expectations of those serving him and ran a tight ship; those who disappointed him in that regard were quick to feel his anger. He saw himself as a grand benefactor to the children he took in, making his anger all the greater when they let him down."}, {"tag": "p", "text": "Few things brought Shrike pleasure, among them the suffering of others, good luck gambling, and Alderaanian ale. The last two were frequently combined and could lead to tremendous exuberance. He also liked to have his ego stroked, wearing an elaborate military uniform and insisting that he be given full and proper deference by his subordinates."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Garris Shrike was created by author Ann C. Crispin for the novel The Paradise Snare, as a domineering and abusive authority figure against whom Han Solo revolted. Their conflict was resolved at the climax of the book with Shrike's death. Crispin has stated that she was told by Lucasfilm authorities when writing the novel that Solo had been raised by a roving gang of thieves who forced him into crime, and she thus conceived of Shrike as the head of that gang."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}