{"url": "Ali%27ane", "categories": ["Category:Canon articles", "Category:Females", "Category:Lupr'or"], "nodes": [{"tag": "h1", "text": "Ali'ane"}, {"tag": "p", "text": "Ali'ane was a female Lupr'or who lived in her home on the planet Luprora. She had a great granddaughter who wore a necklace salvaged from a Lupr'or starship. Shortly after the Battle of Starkiller Base, her great granddaughter visited Ali'ane with Captain Phasma, TN-3465, and Dar'en to speak about a necklace."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ali'ane was the oldest living Lupr'or by the time of the Battle of Starkiller Base in 34 ABY. She was born in the stars. She gave a necklace salvaged from a Lupr'or starship to her great granddaughter. During the hunt for the First Order fugitive Sol Rivas, Captain Phasma questioned Ali'ane and her great granddaughter about where they had acquired the necklace from."}, {"tag": "p", "text": "Regarding technology as evil, she refused to reveal the location of the last Lupr'or starship, claiming that it came from the \"old world\". At Phasma's prompting, her great granddaughter claimed that Phasma had been sent by the gods to save them from the R'ora and the Tsw'ells. Ali'ane responded that the ancestors had forbidden technology, which descried as the soul killer."}, {"tag": "p", "text": "Despite her efforts, her great granddaughter secretly revealed the location of the Lupr'or starship to Phasma. This allowed her to obtain generators which the Lupr'or used to electrocute the tsw'ells in the lake surrounding the R'ora stronghold. While the Lupr'or fought the R'ora, Phasma took the opportunity to kill Rivas, concealing her role in the destruction of Starkiller Base. Having outlived their usefulness, Phasma then abandoned the Lupr'or to the R'ora and rising sea levels."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ali'ane was an elderly Lupr'or woman with green skin, gray hair, and gray eyes. She was the oldest living Lupr'or and had a great granddaughter. Due to her venerable age, she was bedridden. She regarded technology and starships as a source of evil that belonged to the time before the Lupr'or had settled on Luprora."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ai'ane first appeared in Star Wars: Captain Phasma, a 2017 four-issue comic published by Marvel Comics as part of the Journey to Star Wars: The Last Jedi promotional material. She was created by Kelly Thompson, illustrated by Marco Checchetto, and colored by Andres Mossa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}