{"url": "Garven_Dreis/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:Red Squadron personnel"], "nodes": [{"tag": "h1", "text": "Garven Dreis"}, {"tag": "p", "text": "Garven \"Dave\" Dreis was the commander of Red Squadron, and a T-65 X-wing starfighter pilot for the Alliance to Restore the Republic. Hailing from the planet Virujansi in the Inner Rim, Dreis originally served with the Rarefied Air Cavalry, fighting in the Clone Wars that took place from 22 BBY to 19 BBY. During the Battle of Virujansi, Dreis had the opportunity to fly alongside the \"Hero With No Fear,\" Anakin Skywalker. In the wake of the Clone Wars and the subsequent Declaration of a New Order, Dreis joined the Rebel Alliance—an organization dedicated to shaking the Galactic Empire's hold on the galaxy—after seeing the Empire commit atrocities on his homeworld."}, {"tag": "p", "text": "Dreis served the Alliance in numerous battles, adopting a fatherly approach to commanding his men, and supervised the instruction of new recruits personally. In 0 BBY, he was posted at the Alliance's base on Dantooine, leading Dantooine Squadron, and was transferred to Yavin 4's Great Temple shortly afterward. Placed in command of Red Squadron, Dreis took the call sign \"Red Leader,\" and the nickname \"Boss.\" From there, he led Red Squadron in an attack on the Empire's Death Star superweapon, which was moving to destroy the Alliance base. When an attack run on the battlestation's vulnerable thermal exhaust port from pilot Jon Vander's Gold Squadron failed, Dreis was forced to make his own attempt. He almost succeeded, but his proton torpedoes failed to enter the Death Star's exhaust port. Dreis was subsequently shot down by the Sith Lord Darth Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Garven Dreis, a Human male, was born on the planet Virujansi in the Inner Rim. Growing up on the family farm, Dreis spent much of his youth flying in the giant borecrawler caves, and knew every inch of the area. During the pan-galactic conflict known as the Clone Wars, which broke out in 22 BBY and raged for three years, Dreis served with his homeworld's Rarefied Air Cavalry. When Virujansi was occupied by the Confederacy of Independent Systems, the Rarefied Air Cavalry fought alongside the Republic Navy to liberate the planet. Much of the air-based combat was fought in the borecrawler caves, where Dreis—who had only just graduated from flying T-16 skyhoppers to Z-95 Headhunters—was given the opportunity to fly alongside the heralded \"Hero With No Fear,\" Jedi Knight Anakin Skywalker, who was leading the Republic air forces in the battle. Dreis was considered to be the hottest pilot on Virujansi despite his youth, until Skywalker arrived. On Skywalker's first trip through the borecrawler caves, Dreis had flown in the lead position, and wondered if the Jedi would be able to keep up. After two minutes, Dreis' musings were answered when Skywalker snap-rolled his Delta-7 and took over the lead. Dreis struggled to keep up, and his astonishment at Skywalker's feat was acknowledged back at base by a smile from the Jedi. Thanks to the efforts of the Rarefied Air Cavalry and the Republic, Virujansi was successfully liberated. In his later life, Dreis would hold Skywalker in great esteem."}, {"tag": "h3", "text": "The Rebellion"}, {"tag": "p", "text": "With the rise of the Galactic Empire following the end of the Clone Wars, Dreis remained on Virujansi and was witness to several Imperial atrocities. His village was burned, and the fields of his family's farm were torched by the Empire. He watched TIE fighters destroy transports with only the bare minimum of reasons. Eventually, Dreis decided to take a stand against the Empire and joined the Alliance, serving as starfighter pilot. He served in numerous campaigns flying X-wings, Y-wings, and R-22s. At some point, he gained the nickname \"Dave\"."}, {"tag": "p", "text": "In his work, Dreis participated in the recruitment of new pilots for squadrons other than his own, such as Ryle Torsyn of Gold Squadron. For a considerable amount of time, Ord Mantellian smuggler Theron Nett flew as Dreis's wingman. In addition to his use of the T-65, Dreis amassed over a thousand hours of experience in the T-16 skyhopper, which featured similar controls to the X-wing. In 0 BBY, he was assigned to the Alliance base on the world of Dantooine, where he commanded Dantooine Squadron. On Dantooine, Dreis was joined by an old comrade, Davish Krail of Gold Squadron. The Rebels were forced to abandon that base, however, when Torsyn discovered a hidden Imperial tracking device, and as a result, they relocated to the Great Temple on Yavin 4."}, {"tag": "p", "text": "On Yavin 4, Red Squadron was hastily assembled from pilots from Dantooine Squadron, the Tierfon Yellow Aces, and the Griffon Flight Wing. Dreis was assigned to command the new squadron, flying the lead X-wing starfighter under the call sign of \"Red 1\" or \"Red Leader.\" Most of the pilots in his squadron had been trained by the experienced Dreis, who, along with his pilots, was tasked with the protection of Alliance High Command. When commanding Red Squadron—or as he referred to them, \"Red Boys\"—he adopted an almost fatherly approach, and was well-respected for it. He also earned the nicknames \"Boss\" and \"Chief\" from his squadron, but to the younger pilots he was only ever known as \"Red Leader.\""}, {"tag": "h3", "text": "The Battle of Yavin"}, {"tag": "p", "text": "When Princess Leia Organa delivered the plans of the Empire's new planet-destroying Death Star battlestation to General Jan Dodonna on Yavin 4, preparations were made for a decisive strike against the weapon that would totally obliterate it. Accompanying Organa was Luke Skywalker—the son of Dreis's former Clone Wars comrade Anakin Skywalker. Pilot Biggs Darklighter programmed a simulator run for Skywalker to fly before he could join Red Squadron and the assault on the superweapon. Together with Commander Vanden Willard, Dreis reviewed Skywalker's performance, which was impressive—the young Human had only been shot down twice when pitted against an entire starfleet. Dreis approached Skywalker, congratulated him on his run, and subsequently accepted him into Red Squadron under the callsign \"Red 5.\""}, {"tag": "p", "text": "Shortly afterward, Dreis accompanied his men at Dodonna's briefing. The plan was to launch snubfighters against the gargantuan weapon, and subsequently fire proton torpedoes down a two-meter wide thermal exhaust port that was situated at the end of a long and narrow trench. The torpedoes would then travel down the port and hit the Death Star's main reactor, destroying the station. Gold Squadron would move to attack the port, while Red Squadron flew interference, keeping any Imperial resistance at bay during the run. Making the situation more dire was the fact that the Death Star had entered the Yavin system and was already moving against the fourth moon itself. Following the briefing, the pilots began making their final preparations. Even after the simulator run, Dreis was not entirely sure that Skywalker was up to the task. Darklighter, however, who was a childhood friend of Skywalker's, vouched for the newcomer's skills, which satisfied Dreis."}, {"tag": "p", "text": "Without further ado, Dreis and the X-wings of Red Squadron launched from the Great Temple, accompanied by Jon Vander's Y-wing Gold Squadron, and Merrick Simms' Blue Squadron. As they rounded the gas giant Yavin Prime, the Death Star came into view. In preparation, Dreis ordered his pilots to report in before giving the order to lock S-foils in attack position. As he flew through the station's magnetic field, Dreis advised his men to set their deflector shields to double front, and then reprimanded a particularly informal Red Two for extraneous chatter. Leading the assault, Dreis ordered Red Squadron to accelerate to attack speed, and soon afterward received word from Vander that Gold Squadron was moving to make their run on the Death Star's trench."}, {"tag": "p", "text": "In an attempt to draw the station's defensive fire away from Vander's men, Dreis flew across the Death Star's axis. Red Squadron followed suit, prompting the Imperials to open fire, beginning the first exchange of the Battle of Yavin. As Dreis and his men began attacking the station's deflection towers, Red Squadron sustained its first casualty when Jek Porkins perished. Soon afterward, they were contacted by Del Goren, who was at the Great Temple monitoring the battle. Goren advised Dreis, Vander, and Simms that enemy fighters were moving to intercept them."}, {"tag": "p", "text": "When Skywalker protested, claiming that there was no indication of enemy fighters on his scope, Dreis quickly ordered his men to pick up their visual scanning. As expected, TIE/LN starfighters from Black Squadron entered the fray, engaging in various dogfights with Red Squadron. Pilot John D. Branon was killed shortly thereafter, but through cooperation, Dreis's men were able to hold their own against the Imperials. Finally, Vander and his two wingmen started their trench run, but were quickly pursued and shot down by the Sith Lord Darth Vader, who was piloting a prototype TIE Advanced x1. Davish Krail, Dreis' old friend and the last of the three to be killed, advised Dreis that Vader's attack had come from the rear, before perishing himself."}, {"tag": "h4", "text": "Trench run and death"}, {"tag": "p", "text": "In the wake of Gold Squadron's failure, Dreis had his men regroup. He then received orders from General Dodonna to split his group in two, and then make an attack run on the trench. With only six pilots left, Dreis ordered Skywalker, Darklighter, and Wedge Antilles to wait behind until they were given the signal to start their own attack on the trench, should Dreis fail. Entering the trench with Theron Nett on his wing as always, and Puck Naeco flanking him, Dreis was met by heavy turbolaser fire. When the fire stopped, Dreis cautioned his wingmen to watch out for Vader and Black Squadron."}, {"tag": "p", "text": "Sure enough, Skywalker informed Nett and Dreis that Vader and his wingmen were moving to intercept. Before Vader had the opportunity to begin harassing the half of Red Squadron that was making the run, Dreis came within range and began using his targeting computer as he bore down on the exhaust port. As they hurtled down the trench, Vader swiftly picked off Naeco, while another Imperial shot down Nett. The sacrifice of Red Leader's pilots bought him time to fire his proton torpedoes at the exhaust port, and it was initially thought that his attack had succeeded. Dreis soon realized, however, that his warheads had merely impacted on the battlestation's surface, and had failed to enter the port."}, {"tag": "p", "text": "Making matters worse for Dreis was the fact that Vader was still bearing down on him. Skywalker offered to cover for him, but the man refused when he noticed that he had lost his starboard engine. Ordering Skywalker, Darklighter, and Antilles to start their run, Dreis was fired upon by Vader, who caused substantial damage to the Alliance pilot's craft. Yelling as his craft fell toward the Death Star's surface, Garven Dreis perished upon impact with the battlestation. What he never realized was that the man who had shot him down, Darth Vader, was in fact his Clone Wars comrade, Anakin Skywalker."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Despite also being harried by Vader, Luke Skywalker succeeded in destroying the Death Star, and in doing so, saved the Alliance. The vacancy left by Dreis' death would be filled by Commander Arhul Narra of Renegade Flight. Leadership of the squadron would eventually fall to Skywalker himself, who would reform it into the elite Rogue Squadron. For the majority of the time after the Battle of Hoth, leadership of Rogue Squadron would fall to Antilles. For the Battle of Endor, however, in which the Death Star II was destroyed, Rogue Squadron was called \"Red Squadron\" once more, in honor of those who had perished at Yavin. Nichos Panib, a noble from Dreis' homeworld, joined the Alliance and was stationed at Echo Base on the planet Hoth in 3 ABY. Dreis had been a friend of Panib's family on his mother's side, and Panib painted his helmet to match Dreis' to honor the fallen pilot."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A capable and well-respected pilot, Dreis took an affectionate, almost paternal approach to commanding his \"Red Boys.\" He tried to look out for his new recruits, and when in mortal danger would not allow his men to risk their lives for him. Over the years, he had borne witness to and suffered through great injustice, and this inspired him to fight. Although committed to the cause of the Alliance, his prior experiences were the more apparent catalyst for his actions, rather than the fervor of rebellion. Before a battle, Dreis would be desperately eager to begin the engagement, but he did not let it show to his pilots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Garven Dreis was created for George Lucas's Star Wars: Episode IV A New Hope, but technically made his first appearance in Alan Dean Foster's novelization of the film. Both Foster's novelization and Roy Thomas' comic adaptation, Star Wars 5, identify Red Squadron as \"Blue Squadron\" and as such Dreis' character was known as \"Blue Leader.\" In the novel, the character is also identified as \"Dave.\""}, {"tag": "p", "text": "For Lucas' film, the character was portrayed by British actor Drewe Henley, who was mistakenly credited as \"Drewe Hemley.\" Henley interpreted the character as an experienced one, and so decided to play Red Leader as a man who did not give away his excitement in his voice. Lucas disagreed with the interpretation, however, leading the actor and director to come to a compromise—Red Leader would at first be more formal, and then as the battle progressed, would become more and more enthused and excited. Using an American accent for the part, Henley realized that his performance would be almost entirely in his voice. This was due to the fact that he would not be given the opportunity for much physical movement, since he was in a relatively small space for most of his scenes. Henley found it difficult to act in the \"cockpit\" scenes, as he was totally isolated from the rest of the actors and couldn't interact with them. Unlike many of the actors in A New Hope, Henley's performance was not dubbed over by another actor in post-production."}, {"tag": "p", "text": "The performance would prove to be Henley's final one on film, as he was diagnosed with manic depression shortly after shooting had finished, and decided to retire from acting. Henley would later reflect upon A New Hope as the most interesting film he had ever been involved with. The 1997 Special Edition release of A New Hope featured several scenes that had been cut from the original theatrical version of the film. One of the scenes showed Henley, as Red Leader, talking briefly with Luke Skywalker and Biggs Darklighter, played by Mark Hamill and Garrick Hagon, respectively. Henley was pleased with the inclusion of the scene, even though the Special Edition had failed to correct his name in the credits."}, {"tag": "p", "text": "Although the scene had been mostly restored, a line delivered by Henley in the middle of the sequence remained cut from the Special Edition. The line, which implied that Red Leader knew Anakin Skywalker, and the accompanying footage was omitted from the release, and to mask the cut, another character walks in front of the shot. The line, however, had originally featured in both Foster's novel and the Marvel Comics adaptations. The connection between Red Leader and Anakin Skywalker was later brought back into continuity by Raymond L. Velasco's A Guide to the Star Wars Universe in 1984, and was elaborated upon by Abel G. Peña in the article Vader Tech, included in Vader: The Ultimate Guide. The Star Wars Encyclopedia identified \"Dave\" as a nickname of the character, since he had been identified as \"Garven Dreis\" by the \"Premiere Limited\" set of the Star Wars Customizable Card Game in 1995. The character's craft appeared briefly in Empire 13, as did one of his lines from A New Hope, as that comic portrayed the conclusion of the Battle of Yavin from another perspective. Dreis also appears in his craft in the game Star Wars: Empire at War, as a part of the Red Squadron unit. In the game, Dreis' actions are not anchored to the plot, and therefore are not canon. Dreis also received a war portrait in The Essential Guide to Warfare, which Jason Fry wrote as if it were a missing page from Foster's A New Hope novelization."}, {"tag": "p", "text": "Dreis' helmet used in the film was carried by a pilot (later named Nichos Panib) on Hoth in The Empire Strikes Back and on Home One in Return of the Jedi . The film prop was reused for the character Ina Rece and another, unidentified female pilot in Rebel Assault II: The Hidden Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}