{"url": "Gas-processing_vane", "categories": ["Category:Canon articles", "Category:Incomplete lists", "Category:Mining technology"], "nodes": [{"tag": "h1", "text": "Gas-processing vane"}, {"tag": "p", "text": "Gas-processing vanes, also known simply as a processing vanes, were large devices located in the airborne metropolis, Cloud City on the Outer Rim planet Bespin, used to purify, stabilize and preserve Tibanna gas mined from the atmosphere of the gas giant."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Gas-processing vanes were large, round-pointed triangular shaped devices used for the purification, stabilization and preservation of Tibanna gas mined from the atmosphere of the Outer Rim gas giant, Bespin. Each vane was suspended in a cavernous reactor shaft deep in the center of Bespin's airborne Cloud City, and connected to the end of a long transportation tunnel leading to the edge of the shaft. After being forced through an opening at the bottom of the city's reactor bulb by tractor beams, the gas was transported through the reactor stalk and stored at low-pressure in reactor shafts. Once there, the processing vanes used large turbines to suck up the gas and transport it to purification devices. The purified gas was then sent to a carbon-freeze chamber, where it was admixed with carbonite for flash-freeze preservation."}, {"tag": "p", "text": "When used in weaponry and hyperdrives, the energy produced by the purified Tibanna gas outperformed that of other competing gases."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime after the Battle of Hoth, the Galactic Empire froze Rebel smuggler Han Solo using a processing vane's carbon-freeze chamber, and gave him to bounty hunter Boba Fett. Shortly after, Luke Skywalker arrived to rescue Solo and Princess Leia Organa, but instead encountered Darth Vader and proceeded to engage him in a lightsaber duel. The fight concluded on the vane's sensor balcony, where Vader cut off Skywalker's arm and revealed to him he was his father. Choosing to die rather than join the dark side of the Force, Skywalker let go of the end of the balcony, causing him to fall into the shaft below and get sucked up by a gas-exhaust pipe."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A gas-processing vane first appeared unnamed in the second Star Wars film, Star Wars: Episode V The Empire Strikes Back, released in 1980. The vane played an important role in the film's plot as the location where Han Solo was frozen in carbonite and where Luke Skywalker dueled Darth Vader, which concluded in the reveal that the Sith Lord was Skywalker's father. The device was first identified as a gas-processing vane in the Legends reference book Inside the Worlds of Star Wars Trilogy, released in 2004, with the name being made canon in the 2016 reference book Star Wars: Complete Locations, the re-issue of 2005's Star Wars: Complete Locations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}