{"url": "Gascon", "categories": ["Category:Legends articles", "Category:Terrestrial planets", "Category:Trans-Gascon sector planets"], "nodes": [{"tag": "h1", "text": "Gascon"}, {"tag": "p", "text": "Gascon was a wealthy and powerful planet located in the Mid Rim's Trans-Gascon sector. Ruled by a king and his queen, Marilla, following the formation of the New Republic Gascon remained neutral yet strategically important during the Galactic Civil War between the New Republic and the Galactic Empire. At one point, the pro-New Republic Marilla, who had given a unique ring as a gift to her lover, the Prime Minister of the planet Demigue, tasked a group of individuals with retrieving the ring in time for a ball given by Gascon's king so that her affair would not be exposed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Gascon was a planet located in the Gascon system, a part of the Trans-Gascon sector in the Trans-Hydian portion of the Mid Rim. One hyperlane the planet was situated on, the Demigue Terror, linked it to the distant Outer Rim Territories planet Demigue. The terrestrial Gascon was an excellent source of a specific type of resource."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the formation of the New Republic in 4 ABY, Gascon was neutral in the Galactic Civil War between the New Republic and the Galactic Empire but had vital importance to both sides of the conflict due to the planet's strategic location on hyperspace routes, its wealth and natural resources, and its excellent sites for military bases. At the time, a grassroots pro–New Republic movement emerged on the planet, with Gascon's Queen Marilla also favoring the Republic's cause, and the New Republic felt ready to attempt to convince the planet's government to formally ally with it."}, {"tag": "p", "text": "A group of individuals eventually visited Gascon. Queen Marilla subsequently tasked the group with traveling to Demigue and retrieve a unique, valuable ring from the planet's Prime Minister. Marilla had given the ring as a gift to the Prime Minister, with whom she had an affair. However, Gascon's king, who had originally gifted the ring to the queen, had announced a ball, in which the queen's infidelity would come to light unless the ring was brought back from Demigue in time for the event, which was to be held in one week."}, {"tag": "p", "text": "Given the time restraint for their task, the individuals were forced to travel the pirate-infested Demigue Terror. The Gascon king's pro-Empire Holy Advisor, who sought to ruin Marilla, learned of the mission to Demigue and dispatched numerous spies and cutthroats after the queen's agents."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Gascon was a powerful, independent, and wealthy world that did not fear pacification by the Galactic Empire. The planet was governed by a monarchy, embodied by a king and his queen following the Battle of Endor of 4 ABY. The king's Holy Advisor represented Gascon's powerful Akol religion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gascon was created by Bill Olmesdahl as one of the settings for \"Envoy to the Queen,\" a roleplaying adventure hook published in the 1992 supplement Star Wars Gamemaster Screen for use with West End Games' Star Wars: The Roleplaying Game. \"Envoy to the Queen\" suggests that the player-characters can either be dispatched to the planet as New Republic diplomats or contacted by Queen Marilla's servants and recruited as guardians of the monarch."}, {"tag": "p", "text": "In addition, the scenario provides several possible reasons for Gascon's strategic importance during the Galactic Civil War. Since they do not contradict each other, this article assumes all of the suggested reasons apply to the planet. The 2009 reference book The Essential Atlas placed the Gascon system, and therefore Gascon itself, in grid square P-8."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}