{"url": "Gastrula", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Rayter sector planets"], "nodes": [{"tag": "h1", "text": "Gastrula"}, {"tag": "p", "text": "Gastrula was a planet in the Rayter sector of the Outer Rim Territories. The homeworld of the Gastrulan species, it was the terminus of the short-lived Great Bantha Breakfast Biscuit Run during the Galactic Civil War. Captain Bungo Bung had established the trade route in an effort to make credits by selling the popular snack Bantha Breakfast Biscuits to the locals. However, when combined with certain elements in the environment of Gastrula, preservatives in the biscuits caused the snacks to mutate into the Giant Amorphous Bantha Breakfast Biscuit. The resulting lifeform was a ravenous creature that set out to consume the entire planet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Gastrula was a planet located in the Gastrula system in the Rayter sector of the Outer Rim Territories, and was the homeworld of the Gastrulan species. At least two moons orbited the world, and it had an atmosphere that could support carbon-based lifeforms such as Sullustans. The environment also reacted with the preservatives used in Bantha Breakfast Biscuits—a popular snack marketed by the restaurant chain Biscuit Baron—which resulted in the mutation of the foodstuff into the Giant Amorphous Bantha Breakfast Biscuit, a ravenous amoeboid creature resembling a bantha."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, Gastrula became the terminus of the Great Bantha Breakfast Biscuit Run, a trade route established by the Sullustan Bungo Bung and his droid co-pilot 42-RST. Captain Bung made several runs to the world, shipping the popular snack food known as Bantha Breakfast Biscuits aboard his starship, the Chubby Gundark, after realizing that there were many worlds that had no access to the snack. Importing them from the planet Sullust, Bung made several hundred thousand credits over a two week period. However, unknown to both the crew of the Chubby Gundark or the Gastrulans, certain preservatives used in creating Bantha Breakfast Biscuits reacted negatively with Gastrula's atmosphere. The interaction of the two elements caused the Bantha Breakfast Biscuits to mutate into the Giant Amorphous Bantha Breakfast Biscuit. This amoeboid lifeform was a ravenous creature that sought to devour anything in its path. At least one of these creatures evolved on Gastrula, and began eating everything it could find."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Gastrula was home to the Gastrulans. They were a race of four-armed sentient gastropods with spotted, bulbous heads that had eyestalks protruding from either side."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gastrula was created by Jim Anderson for his comic strip Bungo n' Rusti Get Carry-Out, which appeared in issue 11 of the Star Wars Adventure Journal published by West End Games in 1996."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}