{"url": "Gastrulan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Gastropod sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Gastrulan"}, {"tag": "p", "text": "Gastrulans were sentient gastropods native to the planet Gastrula in the Outer Rim Territories. Standing just taller than Sullustans—who averaged a height of 1.5 meters—Gastrulans sported four short arms and spotted, bulbous heads. They had eyestalks on either side of their heads, located just above the neck. During the Galactic Civil War, the Gastrulans became the sole clients of Captain Bungo Bung's Great Bantha Breakfast Biscuit Run, an endeavor to earn credits for the Sullustan by selling Bantha Breakfast Biscuits, a popular snack food, to those unable to obtain them. Two weeks after the Run was established, the Gastrulans were threatened by the ravenous Giant Amorphous Bantha Breakfast Biscuit, a mutated version of the snack that evolved when the preservatives in the biscuits came into contact with Gastrula's atmosphere."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Gastrulans were sentient gastropods that stood slightly taller than a Sullustan of average height—around 1.5 meters—and possessed four short arms attached to their torsos that ended in paddle like hands with opposable thumbs. Their heads were bulbous, with a thin mouth that stretched across their faces and slightly down their necks. Gastrulans had dark spots across the back and front of their heads, as well as down the backs of their necks. While they had no visible nose or ears, they did have eyestalks that protruded from the sides of their head, near to where it joined their necks."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Gastrulans hailed from the planet Gastrula, located within the Outer Rim Territories. Gastrulans had knowledge of both clothes and weapons, as the two Gastrulans encountered by Bungo Bung, a Sullustan freighter captain, during the Galactic Civil War, wore clothing and wielded long armed pikes. Other beings in the galaxy were aware of the existence of the Gastrulans, and also the location of their homeworld. For their part, the Gastrulans knew of the outside galaxy, especially being aware of the popular foodstuff called Bantha Breakfast Biscuits."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, the planet Gastrula was visited by the Sullustan Captain Bungo Bung and his droid co-pilot, 42-RST. They had come up with a scheme to make money by selling Bantha Breakfast Biscuits, produced by the galaxy-spanning restaurant chain Biscuit Baron, to those worlds that had no access to them. Upon landing in their ship, the Chubby Gundark, 42-RST struck a deal with the native Gastrulans to sell them their cargo of a single box of the biscuits. Over a two-week period, Bung and 42-RST cleared several hundred thousand credits working the route between the planets of Sullust and Gastrula, which they named the \"Great Bantha Breakfast Biscuit Run.\""}, {"tag": "p", "text": "However, unknown to both the crew of the Chubby Gundark or the Gastrulans was the fact that the preservatives used in creating Bantha Breakfast Biscuits reacted negatively with certain environmental conditions, such as stale air and the atmosphere present on Gastrula. These conditions caused the Bantha Breakfast Biscuits to mutate into the Giant Amorphous Bantha Breakfast Biscuit, a ravenous amoeboid creature that set out to devour anything in its path. At least one of these creatures evolved on Gastrula, where it began eating everything it could find."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gastrulans were created by James Anderson for his comic strip Bungo n' Rusti Get Carry-Out, which appeared in issue 11 of the Star Wars Adventure Journal, published by West End Games in 1996."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}