{"url": "Gauntlet_(Pre_Vizsla)", "categories": ["Category:Canon articles", "Category:Gauntlet fighters", "Category:MandalMotors products", "Category:Mandalorian starships"], "nodes": [{"tag": "h1", "text": "Gauntlet (Pre Vizsla)"}, {"tag": "p", "text": "The Gauntlet was a Kom'rk-class fighter/transport that was used by the leader of the Death Watch, Pre Vizsla, as his personal ship. During the Clone Wars, Vizsla used the starfighter to bring the Dathomirian brothers Maul and Savage Opress to Death Watch's camp on Zanbar after finding them unconscious in an escape pod. After forming an alliance with them called the Shadow Collective, the trio used the ship during their recruitment of the Black Sun and Hutt Clan crime syndicates. They later travelled to Sundari, the capital of Mandalore, prior to its takeover, before Vizsla left the city aboard the ship."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Kom'rk-class fighter/transport, the Gauntlet was equipped with a Class 1 hyperdrive, four engines and four laser cannons, two mounted on its nose, and two facing the aft. The ship could be crewed by two pilots, and measured 68 meters in length. Like other ships in its class, the Gauntlet could reach a top speed of 1,000 kph."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the Mandalorian Civil War, the surviving members of the Mandalorian warrior caste were exiled to the moon Concordia, where they formed a splinter group known as Death Watch that was led by Pre Vizsla, a member of Clan Vizsla. Engineers and technicians loyal to the group designed the Kom'rk-class fighter/transport for them, using the factories supervised by Vizsla there to build the ships. One of the fighters was christened the Gauntlet and was utilized by Vizsla as his personal ship."}, {"tag": "p", "text": "During the ongoing Clone Wars in 19 BBY, Vizsla and the Death Watch encountered a drifting escape pod in space while aboard the Gauntlet, which was escorted by two other Kom'rk-class fighters. Within the pod, the soldiers discovered the unconscious Dathomirian brothers Maul and Savage Opress, who were subsequently loaded into the Gauntlet on Vizsla's orders as he wished to learn their stories. Following the encounter, the three ships returned to the Death Watch camp on the swamp moon Zanbar. After Maul and Opress joined forces with Vizsla at the camp, the group traveled to the volcanic planet of Mustafar aboard the Gauntlet in order to  recruit the Black Sun criminal syndicate into their alliance, the Shadow Collective. Successful in the endeavor, they returned to Zanbar."}, {"tag": "p", "text": "After the Pyke Syndicate joined the alliance, Vizsla, Maul, and Opress boarded the starfighter and traveled to the planet Nal Hutta in an attempt to persuade the Hutt Clan criminal syndicate to join them. After failing to convince them, Vizsla took the Gauntlet and his forces to the desert planet Tatooine and attacked the palace of the crime lord Jabba Desilijic Tiure, forcing the Hutts to join the Collective."}, {"tag": "p", "text": "With the Shadow Collective fully assembled, Vizsla and the group traveled to the homeworld of the Mandalorians, Mandalore, and entered its capital city of Sundari after planning its takeover. While leaving the city aboard the Gauntlet, Vizsla contacted Maul via hologram. The Dathomirian informed him that it was time to begin the next stage of their plan, which was to have the Collective to wreak havoc on Sundari while the Death Watch, posing as rescuers, arrived and protected the city from attack. Though Death Watch successfully took over the planet's government, Vizsla was killed in a duel with Maul, who gained leadership of Death Watch."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Gauntlet served as Vizsla's personal ship during the Clone Wars. Accompanied by Maul and Opress, he used the starfighter when traveling to various locations when recruiting crime syndicates into the Shadow Collective. Two members of the Death Watch piloted the Gauntlet when it departed Sundari, while Vizsla, who stood in the back of the ship, spoke with Maul."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gauntlet first appeared in \"Eminence,\" the fourteenth episode of Star Wars: The Clone Wars fifth season that aired on January 19, 2013. It was identified in the new Star Wars canon in the sixty-eighth issue of the Star Wars: Build the Millennium Falcon magazine, released in 2016. In the Star Wars Legends continuity, the Gauntlet first appeared in an adaptation of \"Eminence,\" titled The Clone Wars: Darth Maul: Shadow Conspiracy, that was written by Jason Fry and released on January 1, 2013."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}