{"url": "Gauntlet_of_Red_Flight", "categories": ["Category:Legends articles", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Gauntlet of Red Flight"}, {"tag": "p", "text": "The Gauntlet of Red Flight occurred during Red Flight's diplomatic visit to Adumar. The New Republic pilots found themselves arrayed against the entire nation of Cartann, whose citizens could legally kill them by any means possible. With the odds against them, they endured shootouts on the ground and a lopsided air battle before managing to escape to the neighboring nation of Yedagon."}, {"tag": "h2", "text": "Declaration of the Gauntlet"}, {"tag": "p", "text": "A day after announcing the new world government of Adumar, which he himself would lead, the perator of Cartann hosted another party where he asked the pilots of Red Flight and 181st Imperial Fighter Group to lead the attack against the rogue nations who refused to submit to his rule."}, {"tag": "p", "text": "Wedge Antilles declined the offer while Turr Phennir of the 181st accepted. New Republic diplomat Tomer Darpen, in order to cover his plot, then convinced the perator that Antilles was forced to refuse the offer due to orders from his superiors. He added that Antilles was begging the perator to end his life so that he may ease his shame and the next batch of pilot-diplomats would be sent without restricting orders."}, {"tag": "p", "text": "The perator believed the lies and declared the pilots of Red Flight as exiles and ordered them to leave Cartann by gauntlet to a nearby air base."}, {"tag": "h2", "text": "Ground hunt"}, {"tag": "p", "text": "After being provided blastswords by a few sympathetic nobles, the pilots went out of the perator's palace and reclaimed their blasters. A sizable crowd was already waiting beyond the gates which prompted the pilots in commandeering a repulsorlift transport. A shootout commenced where the mob found their numbers reduced due to the pilots' more accurate shooting."}, {"tag": "p", "text": "The pilots managed to escape the palace grounds but the engines of their transport suffered damage from the shootout. They abandoned the transport and leaped to a nearby balcony. Surprising the dining family, they left their distinctive dress uniforms behind and changed into dark cloaks. Ironically the family thanked them for honoring their home instead of reporting them to the authorities."}, {"tag": "p", "text": "Deciding that the best option was to proceed to the air base instead of trying to seize privately owned Blades, the pilots made a false footage of themselves using a flatcam which was broad casted on the public flatscreens. Deeming the footage authentic, a good number of the mob guarding the Giltella Air Base left their posts and went to the pilot's supposed location. Disguising themselves with women's clothing, Red Flight then charged towards the guarded air base in their wheeled transport and successfully entered the base without suffering casualties."}, {"tag": "h2", "text": "Air Hunt"}, {"tag": "p", "text": "After being informed by one of the guards that the first part of the gauntlet was over, he took the pilots to the Lovely Carrion Flightknife hangar where four red Blade-32 superiority fighters were waiting for them. A mechanic informed them that the fighters were seized from Yedagon pilots and were in good condition, for to sabotage their craft was to sabotage their killer's own honor."}, {"tag": "p", "text": "Using the effective strategy of not doing what was expected of them, Red Flight blasted through the hangar's rear with their missiles. A dogfight ensued where they found themselves against thirty fighters. They managed to defeat the entire lot by superior flying and taking advantage of the Cartann pilots obsession with killing the most prestigious enemy."}, {"tag": "p", "text": "Unfortunately Wes Janson's fighter was shot down and Derek Klivian was ordered to see him in his ejector seat down safely. With Antilles' and Tycho Celchu's damaged starfighter remaining, a pair of flightknifes approached their position. Readying themselves to take down as many enemies they could, they were surprised when one of the flightknives suddenly engaged the other. It turns out the friendly flightknife was the Strike the Moons Flightknife, one of the groups that Red Flight taught in their informal flight school."}, {"tag": "p", "text": "With both their fighters too damaged to withstand space and reach the Allegiance, they went to ground instead and regrouped in Iella Wessiri's apartment on Cartann. It was there where Cheriss ke Hanadi informed that some political figures from the other nation states wanted to meet them. With help from their operatives, Red Flight successfully escaped the nation of Cartann."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Owing to the success of their gauntlet, many nations that were undecided in joining the fight against Cartann immediately joined the growing confederation once they learned that Antilles was leading the combined forces. As Tycho Celchu said: Antilles' name was similar to a bank full of credits."}, {"tag": "p", "text": "The combined forces of all those nations eventually succeeded in defeating the numerically superior forces of Cartann in their brief civil war. The coalition would then form the Adumari Union along with Cartann, which by then was ruled by the son of the former perator."}, {"tag": "h2", "text": "Appearances"}]}