{"url": "Gayla_Riemann", "categories": ["Category:Legends articles", "Category:Artists", "Category:Females", "Category:Humans", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Gayla Riemann"}, {"tag": "p", "text": "Lieutenant Gayla Riemann was a female Human native of Aldraig IV who was an artist of interstellar renown before the Galactic Empire took a disliking to her art, forcing her to flee from her home and become a fugitive where she eventually joined the Alliance to Restore the Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Riemann was a child prodigy in art, studying under the tutelage of some of the finest artist in the Empire. Growing tired of snobbishness of the Core Worlds, she returned to Aldraig IV. Upon her return, she discovered the picturesque countryside had been spoiled by the Imperial war machine as a AT-AT production facility had been built in several of the counties and the agricultural nature of the planet was changed to war production. She was particularly upset about a TIE fighter hull assembly facility that was being constructed in the southern pole region of the planet. A rare species of bird was located there and the construction threatened to lead to their extinction. Riemann arranged a peaceful protest in an attempt to save the birds, but it was broken up by the Imperial Governor Talloryn who had her arrested. She was informed that agitation was a capital offense, and released on probation. The artist began to secretly fund revolutionary activities. The local rebels managed to sabotage the TIE facility, but a captured operative was interrogated and revealed Riemann's involvement in the movement. She was arrested again and forced to produce propaganda for the Empire. One of her jobs was to create a series of paintings of the TIE facility to show the \"beauty of Imperial progress\". She used the opportunity to examine the plant and create a detailed schematic of the plant which she secretly provided to the underground forces on the planet. They used this knowledge to successfully destroyed the facility. She was then smuggled off the planet and joined the Rebel Alliance. She initially served as a supply pilot, ferrying goods to the Rebel Fleet. Because of her natural piloting ability, she was promoted to Lieutenant and trained as a starfighter pilot."}, {"tag": "p", "text": "She eventually served as an X-wing pilot in Rogue Squadron, and fought in the Battle of Endor and the Bakura Incident. After the conflict, she was tasked with training pilots for the Bakuran Defense Fleet."}, {"tag": "p", "text": "She was later transferred out of Rogue Squadron, but temporarily rejoined when Brevet Captain Derek \"Hobbie\" Klivian and Lieutenant Wes Janson formed an auxiliary Rogue Squadron during the Bacta War. She flew as part with this Rogue Squadron and Wedge Antilles' original Rogue Squadron for the Coruscant celebration of the defeat of Ysanne Isard."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Riemann was highly skilled and determined. She opposed the Empire for their dedication to destroying beauty in the Galaxy."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "She typically wore a flight suit and carried a DL-18 Blaster Pistol."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}