{"url": "Gearshift", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Character stubs", "Category:Clone troopers", "Category:Members of the 212th Attack Battalion"], "nodes": [{"tag": "h1", "text": "Gearshift"}, {"tag": "p", "text": "\"Gearshift\" was a clone trooper who served in the Grand Army of the Republic during the Clone Wars as a part of the 212th Attack Battalion. He was killed during the Second Battle of Geonosis by undead Geonosians under the hive of Queen Karina the Great."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Prisoners on Caliban"}, {"tag": "p", "text": "\"Gearshift\" was a clone trooper in the Grand Army of the Republic. Early in the Clone Wars, Jedi General Obi-Wan Kenobi and several members of the 212th Attack Battalion, including Gearshift, were captured by General Grievous on the frozen moon Caliban, located in the Outer Rim Territories. Grievous ordered the Galactic Republic troops to rebuild a bridge that had been destroyed in the Separatist invasion of the moon, or he would kill them."}, {"tag": "p", "text": "After an altercation between Kenobi and Grievous, they finally agreed to Grievous' terms. However, they came up with a plan to purposely sabotage the bridge, but these plans were discarded when they realized that one of the moon's natives, the Qubey, had been separated from the others. They were able to cooperate with the Qubey and come up with a plan to escape."}, {"tag": "p", "text": "When the bridge was completed, Grievous revealed that he was planning on leaving the prisoners on the moon. Then the Qubey attacked, which distracted Grievous and his forces, allowing the clones to steal the E-5 blaster rifles from the B1-series battle droids. The Qubey caused an avalanche, burying General Grievous and his forces. Kenobi and the clones escaped from the moon in their LAAT/i gunship, destroying the bridge as they departed."}, {"tag": "h3", "text": "Second Battle of Geonosis"}, {"tag": "p", "text": "After Republic forces destroyed the Geonosis primary droid foundry, the search began for Separatist leader Poggle the Lesser. When Jedi Master Luminara Unduli and clone trooper \"Buzz\" failed to come back from patrol, Jedi Generals Anakin Skywalker and Obi-Wan Kenobi gathered a rescue party to help. Gearshift was chosen alongside Clone Commander CC-2224 \"Cody\" to enter the Geonosis catacombs to find the missing soldiers."}, {"tag": "p", "text": "When they arrived, they discovered Buzz, who had been killed, and Unduli's lightsaber and decided to search the catacombs in hopes of finding Unduli. As they searched the catacombs, they encountered undead Geonosians. Alarmed by the discovery, Kenobi sent Gearshift and another trooper to the surface to make contact with their forces, but Gearshift and his companion were overwhelmed and killed before they could make it."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "On Caliban, Gearshift wore HT-77 Cold Assault Armor with orange markings, signifying his place in the 212th Attack Battalion. On Geonosis, he used Phase I clone trooper armor, and utilized a DC-15A blaster carbine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}