{"url": "Gearshift%27s_comrade", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Articles with conjectural titles", "Category:Members of the 212th Attack Battalion", "Category:Unidentified clone troopers"], "nodes": [{"tag": "h1", "text": "Gearshift's comrade"}, {"tag": "p", "text": "A clone trooper was part of the 212th Attack Battalion and ventured to the catacombs of Geonosis during the Second Battle of Geonosis. He was ordered to return to the surface by Jedi General Obi-Wan Kenobi with fellow trooper Gearshift to get a signal and call General Ki-Adi-Mundi for reinforcements, but the two were ambushed and killed by undead Geonosians."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Cloned from the Mandalorian bounty hunter Jango Fett on the water world of Kamino, the trooper was assigned to the 212th Attack Battalion under Clone Commander Cody and Jedi General Obi-Wan Kenobi during the Clone Wars. In late 22 BBY, he fought in the Second Battle of Geonosis. During the battle, General Luminara Unduli and another clone went to hunt the Geonosian Poggle the Lesser, and lost communications in a sandstorm at the Progate Temple. After the sandstorm cleared, Cody, Obi Wan, and Anakin Skywalker assembled a clone group to go hunt for them which this trooper was a part of."}, {"tag": "p", "text": "Arriving at the temple, they found Buzz's body and Luminara Unduli's lightsaber. The team then entered the catacombs of the temple, and not long after they entered, they encountered a group Geonosian zombies. The clones and the Jedi narrowly escaped; deciding they needed reinforcements, they sent the trooper and a clone named Gearshift to get help from Ki-Adi-Mundi. After heading out to the surface, the two clones were surrounded and killed by zombies, and their bodies were later found by the Jedi and remaining clones."}, {"tag": "h2", "text": "Personality and Traits"}, {"tag": "p", "text": "Like all Jango Fett clones, this clone stood at 1.83 meters. When his companion Gearshift got attacked and pulled into the air, this clone tried to save him and was killed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "This clone wore Phase I clone trooper armor with orange markings representing his battalion. He utilized a standard DC-15A blaster carbine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}