{"url": "Gearshift/Legends", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Members of the 212th Attack Battalion"], "nodes": [{"tag": "h1", "text": "Gearshift"}, {"tag": "p", "text": "\"Gearshift\" was the nickname of a clone trooper who served in the 212th Attack Battalion, under the command of Clone Commander Cody and High Jedi General Obi-Wan Kenobi. During the Second Battle of Geonosis, he was part of the platoon sent with the Jedi Kenobi and Anakin Skywalker to search for the missing Jedi Master Luminara Unduli in the catacombs under the Progate Temple. However, Gearshift was killed along with another clone by Geonosian zombies when the pair attempted to return to the surface and call General Ki-Adi-Mundi for reinforcements."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gearshift was the nickname of a clone trooper who served in the 212th Attack Battalion of the Grand Army of the Republic during the Clone Wars against the Confederacy of Independent Systems. Like all clone troopers he was a clone of the Mandalorian bounty hunter Jango Fett. In 22 BBY, the planet Geonosis, site of the first battle during the war, was lost from Republic control and new droid factories were built by the Geonosian ruler Poggle the Lesser. The Republic sent a task force led by Jedi Generals Obi-Wan Kenobi, Anakin Skywalker and Ki-Adi-Mundi to recapture Geonosis and destroy the factories. Gearshift, serving under Commander Cody, was part of the Republic troops. After successfully landing on Geonosis, the Republic destroyed the prime factory of the Geonosians, although Poggle escaped. Jedi Knight Luminara Unduli who was searching for Poggle went missing and Gearshift and his platoon accompanied Kenobi, Skywalker and Cody to the Progate Temple, where Unduli was last contacted."}, {"tag": "p", "text": "Upon arriving at the temple, the group soon found the dead body of a clone trooper who had accompanied Unduli as well as the Jedi's lightsaber. Intent on finding Unduli, Skywalker, Kenobi, Cody, Gearshift and the other troopers entered the caverns through the temple's entrance, using lightsabers and headlamps to light the way. While approaching farther under the temple, Unduli contacted Kenobi and hailed him not to follow her. Kenobi, however, insisted on searching further for the Jedi Master. Soon after Gearshift and the group encountered undead Geonosian zombies and were unable to kill them. Soon several troopers were killed and Kenobi ordered a retreat. After taking down the tunnel's support, Kenobi tried to contact Mundi via comlink for reinforcements. Because the group was too deep underground to get a signal, Kenobi sent Gearshift and a fellow clone back to the surface to contact Mundi. Gearshift and his comrade were soon surrounded by undead Geonosians and quickly killed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gearshift obeyed the orders given to him by General Kenobi. He was glad to get back to surface when ordered so, because he found the Progate Temple's tunnels creepy. In combat he used a DC-15S and wore orange Phase I clone trooper armor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gearshift first appeared in Legacy of Terror, an episode of the second season of the Clone Wars TV series. Like all clone troopers in the series, he was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}