{"url": "Geegee", "categories": ["Category:Canon articles", "Category:Droids of the Jedi Order", "Category:Droids of unspecified degree"], "nodes": [{"tag": "h1", "text": "Geegee"}, {"tag": "p", "text": "Geegee was a droid who served at the temple of the rebuilt Jedi Order, led by Jedi Master Luke Skywalker. Geegee operated aboard the Grimtaash, the vessel of Skywalker's nephew Ben Solo."}, {"tag": "p", "text": "After destroying Skywalker's temple in the aftermath of a confrontation with the Jedi Master, Solo boarded the Grimtaash, intending to leave. Geegee was unaware of the temple's destruction, questioning Solo on his intended destination. Solo took the Grimtaash to a space station to meet Supreme Leader Snoke, who he had been in contact with for some time."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By 28 ABY, Geegee was one of several droids who served at the temple of Jedi Master Luke Skywalker's rebuilt Jedi Order. In that year, after a confrontation between Skywalker and his nephew and student Ben Solo, Solo destroyed the temple. Geegee noticed the fire caused by the destruction, but did not suspect that anything was wrong, instead completing a full tune-up of Solo's starship, the Grimtaash. After a brief conflict with Hennix, Tai, and Voe, three of Skywalker's other Jedi students who had been offworld when the temple was destroyed, Solo departed from the ruins, boarding his ship. Geegee greeted Solo, informing him of the vessel's tune-up and inquiring about the fire at the temple, but Solo insisted that there was no trouble, wishing to leave."}, {"tag": "p", "text": "Solo piloted the Grimtaash away from the temple, but was pursued by the surviving students. Destroying the main engines of the students' vessel, the Verity, Solo left his pursuers stranded. Upon noticing that Solo had not selected a destination, Geegee questioned if he needed a route calculated, suggesting his homeworld of Hosnian Prime. At that point, Solo was contacted by Snoke, Supreme Leader of the First Order, who had communicated with and manipulated him for some time. Solo disregarded Hosnian Prime, instead choosing to travel to the space station where Snoke resided. The Jedi survivors intended to follow Solo, tracking his location through Geegee. Solo subsequently traveled to the planet Elphrona, where his fellow Jedi caught up to him, and then to Varnak, where he left the Grimtaash behind after joining the dark side group known as the Knights of Ren."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Geegee was a silver-plated droid with yellow photoreceptors. Like other droids of Skywalker's Jedi temple, Geegee was configured to automatically transmit a transponder signal when away so that the vessel it was aboard could be located. The droid's plating had several gaps where wiring was exposed. Geegee was unsuspecting of Solo's escape from the Jedi temple, presuming he was merely embarking on a trip."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Geegee appeared in the comic The Rise of Kylo Ren 1, written by Charles Soule, illustrated by Will Sliney, and published by Marvel Comics on December 18, 2019. Geegee was designed to have exposed wires as a reference to the lightsaber that Solo would wield as Kylo Ren."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}