{"url": "Geentech", "categories": ["Category:Legends articles", "Category:Droid manufacturers", "Category:Medical companies"], "nodes": [{"tag": "h1", "text": "Geentech"}, {"tag": "p", "text": "Geentech was a small medical research company that manufactured medisensor. In partnership with Industrial Automaton, the company produced the 2-1B surgical droid, which was considered to be the most commercially successful medical droid in the galaxy. However, name copyright issues with the larger Genetech Corporation forced the smaller Geentech out of business."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Geentech, formerly known as Geentech Laboratories, was a small company that was involved in using medical droids to develop holistic gene therapy treatments, manufacturing medisensors, and droid production. Originally, Geentech was a subsidiary of Chiewab Amalgamated Pharmaceuticals Company, along with several other companies, including the Corellian Chemical Corporation, Chiewab Nutrition, Degan Explorations, and The Vernan Group. Eventually, though, Chiewab allowed the company to operate independently."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While known as Geentech Laboratories, and under the control of Chiewab Amalgamated Pharmaceuticals Company, the company pursued gene therapy research and constructed medisensors. Eventually, Chiewab relinquished direct control and the company became independent, becoming known simply as \"Geentech.\" In partnership with Industrial Automaton, Geentech developed the 2-1B surgical droid. The intelligent, flexible-thinking droid was a success with medical institutions across the galaxy, and was considered to be the first truly commercially successful surgical droid ever marketed."}, {"tag": "p", "text": "Several years after the debut of the 2-1B, Geentech became entangled in a series of legal battles with the similarly named Genetech Corporation, a much larger droid manufacturer. Claiming copyright infringment based on the company's similar names, Genetech's lawyers tied Geentech up in expensive litigation, and the smaller company fought off corporate takeover attempts from their opponents. Eventually, the matter came to court during the reign of the Galactic Empire. With little interference from the Imperial Courts, Genetech won the litigation, and Geentech was forced into bankruptcy. Rumors circulated that the Empire had found in favor of Genetech due to the offer of discounts and trade inducements; these claims were, however, unsubstantiated. Genetech acquired all of Geentech's assets cheaply, apart from the rights to the 2-1B which were sold by Geentech to Industrial Automaton. Following the legal battle, Geentech ceased to exist."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}