{"url": "Gektl", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Core Worlds species", "Category:Gektls", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Gektl"}, {"tag": "p", "text": "Gektls—occasionally spelled Gecktls—were a sentient species of bipedal reptilians native to the planet Hoszh Iszhir. They were regarded as tough survivors, and members of the species were capable of sloughing off their skin and even tails as a means of escaping danger. They were a long-established part of galactic society, known for their artistic and literary skill. Their painted eggs in particular were regarded galaxywide as beautiful and highly collectible artworks. The Gektl homeworld was protected with a planetary shield to defend its bounty of strategic metals from would-be invaders."}, {"tag": "p", "text": "Major Stafuv Rahz of the Imperial Military was a member of this species. Rahz betrayed his planet to the Empire, providing them with the codes necessary to breach Hoszh Iszhir's shield in exchange for his commission; he was later placed in charge of an operation designed to lure and trap Rebels by executing a schoolteacher and her students."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Gektls were a species of sentient, bipedal reptiles that stood with a hunched, knee-bent stance. Their dorsal scales were green, while the scales on their underbellies were yellow. Their four-fingered hands were clawed and their feet had three clawed toes and a clawed heel. They had long, sinuous tails wrapped in concentric scales that peaked on top, giving them a jagged appearance. Gektl faces were long and slightly flattened, and the tops of their heads possessed three small crests of scales. They had yellow eyes and a long, narrow, pink tongue."}, {"tag": "p", "text": "The Gektl homeworld, Hoszh Iszhir, was a dangerous place; one hemisphere was a barren desert, the other was covered with a poisonous atmosphere, and both sides were filled with deadly predators. As a result, Gektls were by necessity born survivors. The reptilians were hardy and physically resilient creatures. A Gektl's natural defenses included the ability to shed skin that had been grabbed, revealing the lighter green skin beneath; they were also able to break off their tails. The sloughed skin could even be used to create decoys."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Despite their aptitude for survival, Gektls were renowned for millennia for their literature and other artistic endeavors. Particularly valuable were Gektl painted eggs, which were some of the most highly prized collectibles in the galaxy. Each egg, when lit properly, conveyed scenes of significant Gektl historical events. When Gektls showed their teeth in what appeared to be a smile, the expression was considered to be a challenge."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Gektls were natives of Hoszh Iszhir, a planet in the Gekto system. Located in the Uoti sector in the Core Worlds, the planet became a part of wider galactic civilization in the early years of the Old Republic. The planet was rich in precious metals such as guerrerite, and the Gektls established a planetary shield system to defend their world and its riches many generations before the Galactic Civil War."}, {"tag": "p", "text": "After Palpatine's rise to Emperor, he desired the resources of Hoszh Iszhir. He was given the opportunity to fulfill his desire when Stafuv Rahz, maintainer of the planet's shield system, traveled to Coruscant and sought an audience with the Emperor. Rahz offered Palpatine the codes to the shields in exchange for a position of power; Palpatine granted him an Imperial Military commission and an assignment to keep the planets in the Gekto system in line. The Emperor then sent a fleet of Star Destroyers to bombard Hoszh Iszhir into submission, enslaving the Gektls and forcing them to mine the world's resources."}, {"tag": "h2", "text": "Gektl in the galaxy"}, {"tag": "p", "text": "During the Cold War following the signing of the Treaty of Coruscant, the female Gektl Dao Stryver, a Mandalorian, attended an auction held by the Hutt Tassaa Bareesh, where the Hutt was holding a navigation computer and another mysterious object up for sale. Stryver fought with the other attendees for the prize, eventually taking the navicomp and locating the world of origin from which the other mysterious object—by then revealed to be a nest of hex droids, a dangerous and deadly type of droid—had come. There, the Gektl convinced the Republic and Sith Imperial forces to ally for a mission to destroy the hexes before they could take control of the galaxy. The mission proved to be a success, and the hex droids were eliminated."}, {"tag": "p", "text": "During the reign of the Galactic Empire, many Gektls were enslaved and put to work pulling ore from their homeworld's mines. One exception was Rahz, who, following the betrayal of his people, became a major in the Imperial Military. He supervised a raid of the mist-enshrouded world of Kar'a'katok and the capture of a native Shimholt, Ampotem Za, who eventually became the slaver known as the \"Suprema.\""}, {"tag": "p", "text": "Rahz continued serving in the Empire, and he became embroiled in an Imperial operation on Harix. Darth Vader sent him to kidnap the teacher Myoris Lin and her students, but her son Berd escaped with Luke Skywalker. Vader ordered Rahz to broadcast word that the captives would be executed as bait for a trap intended to capture members of the Rebellion. Skywalker brought Berd to a Rebel-allied spaceport, where the child recruited Rebel smugglers to carry out a rescue plan that used target drones as decoys to lure the Imperials out of position. Berd also warned the Rebels of the Imperials' plans to trap them after he was made aware of it through a dream, and Skywalker and Han Solo destroyed Rahz's ambush force hidden behind the Talhu Slotted Peaks. Rahz, faced with the loss of this force and the jamming of comm channels, attempted to carry out the executions with his sonic projector weapon, but he was jumped by Skywalker and restrained by the Rebel smugglers, who had defeated Rahz's stormtroopers. Rahz shed his clothes, skin, and tail to escape them, and rushed to the projector. Berd rephased the power of the weapon, though, and when Rahz attempted to fire it, he was killed."}, {"tag": "p", "text": "Other Gektls became criminals. One such criminal claimed to have been the target of the bounty hunter IG-88; he managed to escape by shedding his skin, allegedly inspiring IG-88 to fabricate decoy shells to fake his destruction."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gektls were created by Russ Manning in the form of Imperial Major Rahz in Bring Me the Children, an arc of the Star Wars comic strip published in 1980 and reprinted in Classic Star Wars: The Early Adventures 7 in 1995. Other than reprints of Manning's comic, Gektls were referred to only once in two and a half decades, as a brief aside in the second edition of Galaxy Guide 3: The Empire Strikes Back in 1996; in that book, the species was spelled \"Gecktl.\""}, {"tag": "p", "text": "In 2007, Aliens in the Empire, an article written by Abel G. Peña and Rich Handley, was released in two parts in the online supplements to Star Wars Insider 96 and 97. The first part briefly revisits Stafuv Rahz in the context of his capture of Apotem Za, the Suprema; part two includes a full write-up of Rahz, which includes information on the Gektl homeworld and culture. These details, like much of Rahz's biography, were the creations of Handley. The species is mentioned in The Complete Star Wars Encyclopedia, published in 2008, and a Gektl character, Dao Stryver, appeared in the novel The Old Republic: Fatal Alliance in 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}