{"url": "Gel_Marcolf", "categories": ["Category:Legends articles", "Category:Force-sensitives", "Category:Males", "Category:Mirialans", "Category:Nobility"], "nodes": [{"tag": "h1", "text": "Gel Marcolf"}, {"tag": "p", "text": "Gel Marcolf was a male Force-sensitive Mirialan who was installed as the Reeve of the tree-city of Quolas by the Jedi Knight Suljo Warde. The keeper of one of Warde's three kyber crystals, Warde had promised to return to Arbooine and complete Marcolf's training. When Warde never returned and the Jedi Order was destroyed at the end of the Clone Wars, Marcolf's good nature soured and he became a cruel overlord of the city which he governed."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and discovery"}, {"tag": "p", "text": "An orphan, Gel Marcolf longed to be powerful and prevent those he cared about from being harmed. A youthful Mirialan, Marcolf's Force-sensitivity was first detected by Jedi Knight Suljo Warde on the planet Eriadu when Marcolf assisted the Jedi in avoiding an assassination plot. Noting Marcolf's considerable potential, Warde invited the youth on his journey to Arbooine with the hopes that the Jedi High Council would permit him to take the boy as his Padawan."}, {"tag": "p", "text": "When Warde was reassigned by the High Council and beckoned offworld, the Jedi Knight decided to leave Marcolf behind in his stead to govern and protect the people of Quolas from descending into war. While Warde noted Marcolf's ambition, he hoped that the burden of governance, in addition to his natural belief in fairness, would temper that ambition into the qualities of a good leader."}, {"tag": "h3", "text": "An abandoned leader"}, {"tag": "p", "text": "Learning to govern the tree-city of Quolas as interim magistrate, Marcolf waited patiently for Warde to return to Arbooine with Republic reinforcements. Keeping in mind the lessons that Warde had instilled in him, Marcolf attempted to govern in such a way that would make the Jedi Knight proud. As the years pressed on, however, Marcolf grew bitter and resented Warde for abandoning him and robbing of the chance to become a Jedi himself. Battling the urge to hunt down Warde and make him answer for abandoning him, Marcolf established himself as the Reeve of Quolas, cementing his hold on the tree-city and its people. While he had hoped to find fulfillment in this position of power, Marcolf was dissatisfied and bored, leading him to lash out against the citizens of the town with harsh, cruel punishments and draconian laws. Believing himself to be a strong leader, Marcolf unwittingly used the Force to instill loyalty and fear among his citizens which enabled his rule to be uncontested despite his cruelty."}, {"tag": "p", "text": "Settling into the Reeve's manor, Marcolf expanded the compound greatly to accommodate his growing sense of self-importance. Despite his lack of training in the Jedi arts, Marcolf continued to train with an ancient cortosis blade that Warde has left in his care. Establishing the sword as a badge of office, Marcolf wore it prominently on his hip as a reminder to his citizens that insolence was a dangerous game. Garbed in purple armor and robes, Marcolf was an imposing figure amid the tree-city and command respect; though his face was shadowed after years of unwittingly drawing upon the powers of the dark side of the Force. An avid hunter, Marcolf often journeyed into the Arbooinian wilds with his personal guard of eighteen warriors that accompanied him everywhere in groups of three."}, {"tag": "p", "text": "Circa 0 ABY, after twenty years of rule, Marcolf was confronted by an individual that came in search of the kyber crystal the Mirialan possessed. Believing that he alone was entitled to the power that the crystal could unlock, Marcolf refused to part with it and set his guards upon the one who had come seeking it. Despite wearing the crystal on a chain draped around his neck, Marcolf was parted from the crystal as it fell into the hands of the new heir to Warde's legacy."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A clever individual, Gel Marcolf was strong of will and character, but lacked insight. Despite holding great potential, Marcolf failed to see his own strengths and instead focused solely on his shortcomings, which drove him to constantly attempted to eliminate his weaknesses. This contributed to his greatest flaw: his expectation of others and in himself was one of disappointment and failure, making him predictable in his manner and attack."}, {"tag": "h2", "text": "Power and abilities"}, {"tag": "p", "text": "While an untrained Force-sensitive, Gel Marcolf was able to harness the power of the Force unwittingly during his reign of terror on Arbooine. Utilizing a kind of battle meditation, Warde was able to instill both fear and loyalty within the hearts of his subjects and stabilize his claim to power without threat of rebellion."}, {"tag": "h2", "text": "Appearances"}]}