{"url": "Alien_construct", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Kathol sector space stations"], "nodes": [{"tag": "h1", "text": "Alien construct"}, {"tag": "p", "text": "The alien construct was a unique space station located within the Kathol Rift."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed several thousand years before the rise of the New Republic, it was used by an unidentified alien species as a staging point for their colonization programs. Large and bulbous, the construct was dotted with docking domes across its exterior. Each docking dome would open to admit a ship, and be guided in by docking tendrils. By 8 ABY, the station was abandoned, and there was no trace of the alien species that constructed it."}, {"tag": "p", "text": "Despite being thousands of years old, the technology of the station was well above Imperial levels of science. The station had once been self-sufficient, generating its own water and food, and there were no signs of weapons, indicating that it was a civilian outpost. The construct was also the resting place of the Codex, a powerful Force-imbued artifact."}, {"tag": "p", "text": "In 8 ABY, a shuttle from Moff Kentor Sarne's forces and the New Republic CR90 corvette FarStar were captured by the construct's docking tendrils which had malfunctioned over the years. Both crews sought a way to escape, and eventually encountered each other. Both crews were able to escape, however."}, {"tag": "p", "text": "The station was considered to be a holy site by the Aing-Tii, and their own beliefs forbade them to set foot on the construct. However, their desire to retrieve the Codex forced them to brainwash the navigator, Makezh into doing their bidding. When the Codex was removed from the construct in 8 ABY by the crew of the FarStar, Makezh eventually stole it from them and gave it to the Aing-Tii on Demonsgate."}, {"tag": "h2", "text": "Level plans"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}