{"url": "Gen%27Dai", "categories": ["Category:Legends articles", "Category:Gen'Dai", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Gen'Dai"}, {"tag": "p", "text": "The Gen'Dai were a seemingly immortal, formless species which originated on an unidentified planet in the galaxy. Devoid of any bones, the Gen'Dai typically wore heavy armor to give themselves a humanoid structure."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A boneless species (with large fangs), the Gen'Dai were virtually a formless jumble of corded muscle and nerve bundles. Because of this, Gen'Dai typically inhabited heavy armor made for humanoids to give themselves a form which passed for any number of species in the galaxy. The only distinct feature of the Gen'Dai were their heads; typically bald, the Gen'Dai faces were humanoid with two eyes, a nose, and a mouth full of razor-sharp teeth. Two large, wing-like ears protruded from the sides of their heads; Gen'Dai typically tucked their ears under their jaw-line when wearing helmets to hide any distinguishing features. Lacking the vulnerable vital organs of most species, including hearts, and lungs, Gen'Dai could take extreme injuries and even complete dismemberment, and survive which gave them the reputation of being immortal. In fact, they could regrow lost limbs or other body parts in only a few minutes. Unlike most species, Gen'Dai had a nervous system which was distributed throughout the body in the form of millions of nerve clusters. This fact gave the species near instantaneous reflexes as well as the ability to sustain a high volume of injuries without any overall damage. So high was their sensory acuity, that the Gen'Dai were able to feel a Human's heartbeat from ranges of up to 200 meters."}, {"tag": "p", "text": "As the Gen'Dai did not possess a heart, their circulatory system functioned by way of a series of capillaries and muscular contractions which pushed blood through the body. If the Gen'Dai received a cut, that area could easily be cut off from heavy blood-flow to prevent bleeding to death while the body regenerated itself. One of the Gen'Dai's few weaknesses was that they could be forced into an extended period of hibernation if they took too many severe injuries across their entire form. During this time the Gen'Dai's regenerative abilities replaced the body mass which was lost. Ultimately there were only two ways a Gen'Dai could be permanently killed. The first was the complete vaporization or incineration of one's body; such was case with Durge when he was sent into a star. The second was the death of a Gen'Dai's brain via physical destruction, as it was the only aspect of their bodies that could not be regenerated. Notably, the brain also degenerated over time like most species, which caused a form of psychosis to develop in Gen'Dai of advanced age."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The peaceful Gen'Dai homeworld was discovered sometime after the Great Hyperspace War by the Sith Empire. The Gen'Dai species was decimated in the ensuing battle, with an unknown number escaping the planet before it was lost to history. Leaving their world behind, the remaining Gen'Dai were scattered to the stars, seeking out a nomadic existence from planet to planet."}, {"tag": "p", "text": "Over the course of galactic history, the Gen'Dai were largely absent from many of the great wars which plagued the established central government, only appearing time to time as the leaders of crime syndicates or bounty hunters. These individuals typically suffered from psychosis stemming from the degeneration of brain tissue due to advanced age."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "A peaceful species, the Gen'Dai practiced a philosophy of \"perfection of permanence\", a belief that all change is an illusion. Because of this, the Gen'Dai philosophers preached that taking an active role in anything was pointless and detrimental. Having no official government or organization structure following the destruction of their homeworld, the Gen'Dai embraced the spirit of nomadic living and journeyed the stars largely in isolation. As their lifespans were so long, ranging from 4,000 years to over 7,000, Gen'Dai rarely reproduced and had an exceptionally low birth rate."}, {"tag": "p", "text": "While the population as a whole was made up of philosophers, the older population suffered from mental deterioration which led to a pronounced increase in violent tendencies. These rogues tended to take jobs as mercenaries and bounty hunters, poorly representing the species as cruel, heartless savages."}, {"tag": "h2", "text": "Gen'Dai in the galaxy"}, {"tag": "p", "text": "Rarely seen in the galaxy due to their low numbers, those few Gen'Dai encountered generally masked themselves in full armor to not only give them form, but also to blend in as a nondescript humanoid. Those who knew about the species thought of them as long-lived and hard to kill, and also wrongly associated them with vicious killers. This erroneous generalization stemmed from the fact that the most famous Gen'Dai in the galaxy had succumbed to an age-related psychosis which brought out violent tendencies."}, {"tag": "p", "text": "Active during the events of the Cold War, two other Gen'Dai were recorded by the galactic history: the leader of the Nar Shaddaa anti-Imperial resistance the Flame and the Locust on Taris. During the Conquest of Makeb, a Cartel Warlord named Sunder raised an army with other Cartel Warlords on Darvannis."}, {"tag": "p", "text": "Arguably history's best known Gen'Dai was the bounty hunter and Confederacy of Independent Systems commander, Durge. Active during the Clone Wars between the Confederacy and the Republic, Durge was completely insane by the time of the war and possessed an unequivocal blood lust. Durge was responsible for the slaughter of Gungan colonists on the moon Ohma-D'un and the deaths of several members of the Jedi Order, such as Jedi Masters Glaive and Jon Antilles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}