{"url": "Gender", "categories": ["Category:Canon articles", "Category:Incomplete lists", "Category:Reproduction", "Category:Society and culture"], "nodes": [{"tag": "h1", "text": "Gender"}, {"tag": "p", "text": "Multiple genders, or sexes, existed in the sentient species of the galaxy. Many beings were designated \"female\" or \"male\" or were non-binary; at least eleven genders existed. Genders could also change or be chosen, and beings could be genderless. Some species had defined social roles based on genders. Many droids had personality programming that corresponded to the notions of gender among sentients."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Various genders, or sexes, existed among the sentient species of the galaxy. Many species used the designations \"female\" or \"male,\" or had cultural equivalents for that binary pair of terms. At least eleven genders existed throughout the galaxy, as well as beings who were genderless."}, {"tag": "p", "text": "In Galactic Basic, singular pronouns used by individuals who did not identify as one of the binary genders included \"zhe,\" which was used by the pirate Eleodie Maracavanya, and \"they,\" used by individuals such as the human Jedi Master Kantam Sy in the High Republic Era, the Alderaanian pilot Taka Jamoreesa, and the Mirialan pilot Keo Venzee of the New Republic. Gender-neutral personal pronouns also existed in other languages, including Shyriiwook. \"Neutrois\" was a term used within the Galactic Empire to describe individuals of a gender other than male or female. Some individuals of the Sabetue species were genderless and could be identified by their pure white skin."}, {"tag": "p", "text": "Starships were often referred to with feminine pronouns, although many people considered that habit old-fashioned by the time of the First Order/Resistance War. Although droids were artificially intelligent mechanical creations rather than organic lifeforms, many were designated with \"he\" or \"she\" pronouns, and others with \"it.\""}, {"tag": "h2", "text": "Genders by species"}, {"tag": "p", "text": "Some species would change their genders or choose new ones at different times in their life. Individuals of the Xidelphiad species had protogynic phases and entered a chrysalis when changing from female to male, a process that took years before they emerged. Dianogas were physically capable of multiple reproductive roles and chose the gender they wished to be. Their most common gender was diangous; a female named Omi met several other females and more who were diangous, but did not meet a dianoga who identified as male for many years. The Chalhuddan species had five genders through which they shifted at different life stages. In their native language, their pronoun cases reflected their current gender, two or three of their previous genders, and sometimes the gender they felt most likely to be next. Due to the lack of equivalent pronouns in Galactic Basic Standard, \"you\" and \"they\" were substituted."}, {"tag": "p", "text": "Species could have divided roles and expectations for their genders. The Tusken Raiders of the desert planet Tatooine formed clans or tribes in which the males served as warriors who protected the tribe and attacked trespassers, and females raised the children and protected the home. Tuskens completely clothed their bodies, but Tusken females were identifiable by their jeweled masks. Warrior initiation rites included giving each individual a bantha of their gender to care for, creating a lifelong bond between the bantha and the Tusken. Members of the Gamorrean species lived in clans ruled by a Clan Matron who selected a male Warlord to rule with her based on his combat skills and strength. The primary duty of the sows was farming while the boars warred against other clans. Boars may have been responsible for hunting, but sows may have hunted in addition to farming."}, {"tag": "p", "text": "Among the avian and matriarchal Lanai on the planet Ahch-To, the female Caretakers passed down their titles and roles from mother to daughter, and maintained the sacred structures of the First Jedi Temple. The male Visitors spent much of their time fishing in sea, but when they returned with the month's catch, they joined the Caretakers for several days of celebration. Accounts are unclear regarding the species of the planet Crul, though they agree that Crolutes were native to the planet. Some said that Crolutes were divided into \"cows\" and \"bulls,\" and others that Crolutes were an entirely male species with a counterpart female species, Gilliands."}, {"tag": "p", "text": "Some species had differing appearances in addition to differing roles for their genders. An example of this is the Dathomirian species. On the planet Dathomir, female Nightsisters and male Nightbrothers lived separately. The Nightsisters became witches who wielded magick that was enhanced by the power of their planet. When they wished to reproduce, they would visit the Nightbrother village to select a suitable mate; the Nightbrothers were subservient to the Nightsisters. While the Nightsisters had pale or white skin that they often tattooed with subtle or monochrome designs, the Nightbrothers used bold tattoos to enhance their colorful skin and natural striping. The government on Devaron was matriarchal. Devaronian males were not permitted to hold office as they were considered less serious-minded and more inclined to wander the stars than females, who would remain on the planet. Males were bald and had horns, but females had small bumps instead along with hair on their heads."}, {"tag": "p", "text": "During the Imperial Era, it was rare for a Chiss to be Force-sensitive. Almost all of those with the ability of Third Sight were girls, and it would fade as they aged into adulthood. While it remained strong, they were employed as navigators called ozyly-esehembo in Cheunh, which translated as \"sky-walker\" in Basic."}, {"tag": "p", "text": "Some species, such as the Paccosh of the Unknown Regions, held one gender in particularly high regard. Senior Captain Mitth'raw'nuruodo insisted on bringing a Chiss woman with him to an asteroid mining station in the Rapacc system, having surmised from the clothing and body positions of Paccosh corpses he encountered that that species held women in high regard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In interviews before and after the release of the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, actress Carrie Fisher discussed femininity in regards to her character, Leia Organa. \"The third one was very challenging because I had to integrate being feminine and powerful without being angry all the time,\" Fisher said at the 42nd World Science Fiction Convention."}, {"tag": "p", "text": "Author Claudia Gray has mentioned on her Tumblr blog that there are brand new genders in the Star Wars galaxy. Though her novels have not named new genders, she first indicated their existence in 2016 with Leia Organa's observation of four or more genders in Bloodline, a novel which was released on May 3. Gray introduced the multi-gendered Chalhuddans in the 2017 novel Leia, Princess of Alderaan."}, {"tag": "p", "text": "Later in 2016, the novel Aftermath: Life Debt by Chuck Wendig was the first Star Wars work to feature an explicitly genderqueer character who identified as neither male or female, the non-binary pirate Eleodie Maracavanya. Following Maracavanya's introduction, zhe was followed by additional non-binary characters, such as a Black Sun agent in the 2016 novel Ahsoka by E. K. Johnston, Taka Jamoreesa in the 2018 novel Last Shot by Daniel José Older, and Keo Venzee in the 2020 video game Star Wars: Squadrons. In honor of the International Transgender Day of Visibility in March 2021, the Star Wars Instagram account posted that Terec and Ceret, two Kotabi Jedi Knights from the Star Wars: The High Republic comic book series, are trans non-binary."}, {"tag": "p", "text": "Several characters in the multimedia project Star Wars: The High Republic have had their genders inconsistently depicted, rather than intentionally portraying gender transitions. Shai Tennem's first appearance in the short story \"Starlight: Part One - Go Together,\" written by Charles Soule and published in Star Wars Insider 199, portrayed Tennem with masculine pronouns; however, Soule's 2021 novel The High Republic: Light of the Jedi referred to Tennem with feminine pronouns. Estala Maru is erroneously referred to as \"her\" in Light of the Jedi; the Insider short story \"Starlight: First Duty,\" written by Cavan Scott, uses masculine pronouns, and Maru is portrayed as male in The High Republic comic book series. Upon the initial publication of Light of the Jedi, Teri Rosason, whose first name was not revealed in the book, was first mentioned with masculine pronouns and Adampo first appeared with feminine pronouns. In The High Republic: Into the Dark by Claudia Gray, Rosason's first appearance stated the character was \"a human woman of advanced years,\" and Adampo received masculine pronouns. E-book editions of Light of the Jedi were later corrected to reflect Rosason as female and Adampo as male."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}