{"url": "Gender/Legends", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Reproduction", "Category:Society and culture"], "nodes": [{"tag": "h1", "text": "Gender"}, {"tag": "p", "text": "Most beings in the galaxy had a gender or a sex, such as \"female\" or \"male.\" Sexual characteristics and gender roles differed by  species for reasons such as reproduction, culture, or labor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Most beings and creatures in the galaxy had a gender or a sex. The physical and behavioral characteristics, such gender roles and secondary sexual traits, associated with particular genders differed among species for reasons such as reproduction, culture, or labor. Many genders and sexes existed; \"female\" and \"male\" were common to many species, but what defined those genders varied. Some beings were not gendered and some species did not have a concept of gender. Others alternated or changed their physical traits over time."}, {"tag": "p", "text": "Droids, which were self-aware automata designed to perform tasks for organic beings, could have masculine programming or a feminine personality; if so, they would be addressed as and refer to themselves with the associated pronouns instead of \"it.\" A restricted intelligence profile of SCORPIO, who had an 9-NIX rating on the Wreyn-Tsatke Cyber-Psychology Scale, noted that she may have identified herself as female."}, {"tag": "h2", "text": "Genders by species"}, {"tag": "h3", "text": "Humanoids"}, {"tag": "p", "text": "Some Humans believed that females achieved maturity at a quicker rate than males. During the Yuuzhan Vong War, Jaina Solo teased her twin brother, Jacen, about being more mature than him to lighten the mood as they discussed their futures. In the primarily Human Mandalorian culture, any gender was welcome in their ranks, and their Mando'a language did not have gender-specific terms."}, {"tag": "p", "text": "Excargans were genderless until around thirteen years old, when their bodies changed and their gender was determined. They did not know in advance what their future gender would be. Ten-year-olds Boba Fett, a Human clone, and Garr, an Excargan, once discussed Garr's frustrations with how other children treated everyone as a boy or a girl instead of just a person. Fett said the others were stupid, and he would treat Garr as a friend. Later in life, Fett was aware of around a dozen genders among alien species."}, {"tag": "p", "text": "Tusken Raiders had distinct gender roles that included their clothing and behavior. For instance, female Tuskens would tend to the banthas while the males fought."}, {"tag": "p", "text": "Some humanoid species had genders not found in others, such as the Fnessians that had one called thos."}, {"tag": "h3", "text": "Non-humanoids"}, {"tag": "h4", "text": "Insectoids"}, {"tag": "p", "text": "The Vratix were hermaphroditic insectoids that each played different reproductive roles throughout their life cycle, but it was inappropriate to address them as a particular gender or as individuals. Since they had hive minds, they used the names of their hives and plural pronouns. Every three years, an adult X'Ting cycled between male and female through a three-month-long metamorphosis in sexual phase called the Change. During the Change, wealthy X'Ting could consume viptiel to ease their emotional and physiological instability. Because gender was variable, it was not a factor in the X'Ting caste system. As the Xi'Dec evolved, they developed 180 different appearance types and hundreds of specialized sexes, each with adaptive abilities that suited their rapidly-changing planet, Stic. Six percent of the population were of the most common variety, Xi'Alpha."}, {"tag": "p", "text": "Several insectoid species had a gender consisting of worker drones, such as the non-reproducing Flakax drones, the wingless Geonosian drones, and the facilitator drones of the Rakririans."}, {"tag": "h4", "text": "Other non-humanoids"}, {"tag": "p", "text": "Many Hutts maintained one lifelong gender, most often male; however, some male Hutts would be regarded as female during a pregnancy. Hutts possessed multiple sex organs simultaneously,  and they could reproduce with another Hutt or conceive a Huttlet without a partner. Rotta's father, Jabba Desilijic Tiure, was his sole parent. The Human male Han Solo had met Jiliac Desilijic Tiron prior to her pregnancy, and was subsequently admonished by Jabba for incorrectly referring to her as if she was still Lord Jiliac. Solo quickly apologized to Lady Jiliac, and she did not take offense at his mistake."}, {"tag": "p", "text": "The Filordi reproduced asexually and did not have genders as a species; however, some individuals such as Verkul Seimbo  and Nui Gneppe were considered male."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Several Star Wars video games allowed the player to choose the gender of the main character during gameplay, then that character later received a specified gender in other sources or appearances. Characters later identified as male include Rookie One, Jaden Korr, and  Revan; the Jedi Exile was later canonized as female and named Meetra Surik."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}