{"url": "GeneTech_Syndicate_Lab", "categories": ["Category:Legends articles", "Category:Laboratories", "Category:Talus locations"], "nodes": [{"tag": "h1", "text": "GeneTech Syndicate Lab"}, {"tag": "p", "text": "The GeneTech Syndicate Lab was a laboratory owned by the GeneTech Syndicate on Talus and in operation during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The GeneTech Syndicate Lab was located on the planet Talus, just outside the city of Dearic. Although it was listed as engaging in legitimate genetic manipulation on animals, the GeneTech Syndicate used this laboratory to conduct illegal experiments. While a building is visible from the surface, most of the laboratory is located underground."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Battle of Yavin, the GeneTech Syndicate was secretly developing an illegal and dangerous bioengineering project in the GeneTech Syndicate Lab, Dubbed Parasophic Arachne, the objective was to create an intelligent and deadly form of arachnes for the use of the Galactic Empire. The project was led by Doctor Vigh, the chief scientist of the GeneTech Syndicate."}, {"tag": "p", "text": "However, around 1 ABY, the arachnes overwhelmed their creators and slaughtered most of the staff of the lab. The Genetech Syndicate issued an emergency evacuation of the laboratory and all the surviving scientists quickly fled to avoid being arrested and charged with illegal biological experiments. Jana T'bayr was the sole scientist to remain in the lab. She initially wanted to save the project but she then tried to find a way to prevent the parasophic arachnes from destroying the planet Talus."}, {"tag": "p", "text": "The Corellian Security Force eventually discovered the situation and dispatched a CorSec crew to clear the lab. Agent Taarna dispatched spacers to eliminate the creatures in the lab. With the help of 6-POC, the project manager's protocol droid, the spacers managed to delete all scientific data that could be used to restart the program. They also retrieved a self-destruct intron virus, a virus designed specifically by the GeneTech Syndicate scientists to kill the arachnes. The spacers applied this virus to every arachne eggs they found in the lab. Agent Taarna later tasked the spacer to eliminate the arachne queen, the arachne responsible for breeding the parasophic arachnes. The spacers found the queen, a gigantic arachne, at the lowest level of the lab and finally killed her. Taarna thought that the new arachne species was doomed with the death of the queen. However, Jana T'bayr revealed that another arachne, the queen's mate, was still posing a threat. The queen's mate was much larger and stronger than other arachnes and designed for combat. Furthermore, if the queen's mate was the only arachne left, he could morph into a breeder and could repopulate the species by himself. A group of spacers found the queen's mate in another part of the lab and, after an intense fight, managed to kill the dreadful creature. The destruction of all the breeding arachnes and eggs eliminated the Parasophic Arachne threat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The GeneTech Syndicate Lab was a location in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The GeneTech Syndicate Lab was added to the game as part of the \"Deifying Decisions\" arc with the release of \"Chapter 2: The Talus Incident\", on August 1, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}