{"url": "General_Grievous%27s_theme", "categories": ["Category:Real-world articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "General Grievous's theme"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "\"General Grievous's theme\" is a piece of music written by John Williams for the soundtrack of the 2005 film Star Wars: Episode III Revenge of the Sith and its respective score. It represents the character of the Separatist General Grievous and was performed in 2005 by the London Symphony Orchestra and the London Voices, the choir used for the previous two prequels. The theme appears three times in Revenge of the Sith and twice in its soundtrack. \"General Grievous's theme\" prominently features a number of strings, French horns playing the melody, and the London Voices. The composition also makes an appearance in the Revenge of the Sith video game, LEGO Star Wars: The Complete Saga, and Star Wars: The Old Republic, as well as in the 2017 version of Star Wars Battlefront II."}, {"tag": "h2", "text": "Conception and development"}, {"tag": "p", "text": "Composer John Williams wrote the score for Star Wars: Episode III Revenge of the Sith, as he had done for all five previous Star Wars films. In 2005, he worked with the London Symphony Orchestra and the London Voices choir to perform the score, as he had done for the two previous prequels. Both the Orchestra and choir were used in \"General Grievous's theme,\" the main theme utilized to identify with the Separatist character General Grievous, the cyborg leader of the Separatist Droid Army following the death of Count Dooku. The soundtrack was released on May 3, 2005 and again on May 24 as an MP3 download. On September 25, 2015, Sony Classical announced it would be releasing the Revenge of the Sith soundtrack along with the other five films' soundtracks in three new sets: the Star Wars: The Ultimate Vinyl Collection, the Star Wars: The Ultimate Soundtrack Edition, and the Star Wars: The Ultimate Digital Collection on January 8, 2016."}, {"tag": "h2", "text": "Summary"}, {"tag": "p", "text": "\"General Grievous's theme\" appears twice on the Revenge of the Sith soundtrack. The track \"Grievous Speaks to Lord Sidious\" has the most discernible and complex form of the theme. The piece is generally polyphonic, meaning that sections play their own unique parts dissimilar in rhythm and pitch to those of other instruments or groups. In this track, the theme starts off with a rapid string part. Trumpets then come in, followed by horns playing the main melody, which is broken into three sections by short rests. This is repeated once, before the London Voices enter, singing between the brass phrases. The theme ends suddenly as the chorus and orchestra drop off all at once. The theme also appears in the track \"Star Wars and The Revenge of the Sith.\" This version is simply a tuba soli—a part that features a single section rather than an individual musician—which is followed by the beginning of the theme, replacing the horns with tubas."}, {"tag": "h2", "text": "Use"}, {"tag": "h3", "text": "In the soundtracks"}, {"tag": "p", "text": "\"General Grievous's theme\" is featured for the first time four minutes and forty-six seconds into the track \"Star Wars and The Revenge of the Sith,\" the first track on the Revenge of the Sith soundtrack. It is also heard at the beginning of \"Grievous Speaks to Lord Sidious,\" the soundtrack's thirteenth track."}, {"tag": "h3", "text": "In the movies"}, {"tag": "p", "text": "\"General Grievous's theme\" is exclusively used in Revenge of the Sith. It appears in the scene aboard the Invisible Hand, General Grievous's flagship, when Grievous is seen for the first time in the film. It appears a second time in the scene showing Grievous arriving on the sinkhole planet Utapau in a Sheathipede-class transport shuttle. This scene contains the theme's most complex appearance. The theme is heard for a third time during the lightsaber duel between Grievous and Jedi Master Obi-Wan Kenobi in the hangar in Pau City, the capital city of Utapau, which results in Grievous's death. The theme is also used in the chapter menu on the film's DVD that uses the hangar scene as the screen background."}, {"tag": "h3", "text": "In the Expanded Universe"}, {"tag": "h4", "text": "Legends"}, {"tag": "p", "text": "The theme appears in the 2005 video game Star Wars Episode III: Revenge of the Sith, in the level \"Showdown with Grievous.\" It also appears in the level \"General Grievous\" in the Episode III section of the 2007 non-canon video game LEGO Star Wars: The Complete Saga."}, {"tag": "p", "text": "Additionally, the 2011 BioWare massively multiplayer online role-playing game Star Wars: The Old Republic included the theme, played during player combat against non-player characters as well as during the Huttball player-versus-player warzone instance. In the 2016 digital expansion Star Wars: The Old Republic: Knights of the Eternal Throne, the theme is played as the Eternal Fleet razes the planet Voss and the Eternal Alliance arrives over the world to protect and liberate it."}, {"tag": "h4", "text": "Canon"}, {"tag": "p", "text": "The theme is played in the 2017 version of Star Wars Battlefront II whenever the player spawns as General Grievous, as well as when the player is defeated."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}