{"url": "General_Grievous_2", "categories": ["Category:Real-world articles", "Category:Star Wars: General Grievous"], "nodes": [{"tag": "h1", "text": "General Grievous 2"}, {"tag": "p", "text": "General Grievous 2 is the second issue in the Star Wars: General Grievous series of comics, and was released April 27, 2005."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "General Grievous and his forces invade the planet Gentes and take it's population and their production facilities as trophies of war. Meanwhile, Flynn Kybo and the Jedi, who seek to kill Grievous, team up with a grizzled band of space miners who hope to see Grievous dead as well. But they're unaware that the General holds hostage a group of Padawan children captured during a raid on a Republic fleet. And what Grievous has planned for the Padawans is a fate far worse than death…"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "General Grievous leads an assault on Gentes in the Anoat system, with several B1-Series battle droids behind him. Within minutes, Grievous destroys the Administration Hub, disabling the planet's defenses, and takes the entire Ugnaught population prisoner."}, {"tag": "p", "text": "Meanwhile, a man named Stellskard seeks out Flynn Kybo, who is meditating in a field somewhere. He asks him about the search for General Grievous he's conducting, and says he can give him \"people who harbor more hatred for Grievous than you can imagine.\""}, {"tag": "p", "text": "Back on Gentes, Grievous discusses with a Neimoidian merchant and two Geonosians what to do with the Ugnaughts. Grievous suggests putting them to work in the battle droid factories, but the merchant claims the Geonosians prefer to have droids build droids."}, {"tag": "p", "text": "Elsewhere, three younglings taken captive during Grievous's raid on a Mon Calamari ship; a Nautolan and two Humans named Banz and Allara; are escorted off their transport and onto Gentes."}, {"tag": "p", "text": "On Bryndar, Flynn Kybo introduces Stellskard to B'dard Tone, who doesn't seem to trust him very much. B'dard says they came there to find those who hated the Confederacy, but no one's stepped forward to help them. Flynn asks where they might go to find such people, and Stellskard leads them in the Cohasset Rover to his home of Banvhar Station, an asteroid mining colony that has been struck hard by the Trade Federation in the past."}, {"tag": "p", "text": "Meanwhile, General Grievous speaks to Count Dooku on Gentes via hologram. Dooku tells Grievous to turn the captive Padawans from the Mon Calamari ship over to the Sith, but Grievous asks to keep them out of curiosity. Dooku agrees to let him hold them, if only for a while."}, {"tag": "p", "text": "At Banvhar Station, a local named Rini picks up a Separatist subspace chatter code on his computer, and assures Flynn Kybo that he can break it, if given a year or so. Flynn, understandably not that patient, brings in an astromech droid, CB-3D, to assist. CB plugs himself in to the machine, and tells Flynn of Padawans and the Sith, and that one of the participants in the conversation is General Grievous. Grievous suggests to Count Dooku that he may be able to interweave the Dark Side potential in these Padawans with the Geonosian technology, as he was himself. Dooku shows interest in this experiment, and signs off."}, {"tag": "p", "text": "Rini traces the transmission to the Anoat system in the Ison Corridor, and unveils one of three Trade Federation probe droids left over from Banvhar Station's battle with the Federation to help them track Grievous. B'dard doesn't seem thrilled with the idea, but Flynn assures him that CB-3D will wipe their memory, to ensure they don't betray them. Rini sends the probe droids out to do their duty."}, {"tag": "p", "text": "On Gentes, General Grievous speaks to the group of six Padawans, and indirectly begins talking them into joining the Sith. Allara sees through the guise however, and Force grabs one of the General's many lightsabers, and kills all three of the B-1 battle droids watching them before Grievous grabs her by the wrist and decides to show her a demonstration of his power. He points to an assembly hall in the distance, in which the entire Ugnaught population of the city stands, and orders his droids via comlink to fire. Within moments, a blast comes down from the sky, utterly obliterating the assembly hall and all of its occupants."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "External links"}]}