{"url": "Generationals", "categories": ["Category:Legends articles", "Category:Imperial Military", "Category:Planetary Security Forces"], "nodes": [{"tag": "h1", "text": "Generationals"}, {"tag": "p", "text": "Generationals was a term given to members of families that had long traditions of military service in the Republic Navy and (after the Ruusan Reformations) the Planetary Security Forces of the Galactic Republic. Such families included the Holts, the Tagges, the Wermises, and the Ozzels."}, {"tag": "p", "text": "After the Declaration of a New Order, the Republic Navy was replaced by the Imperial Navy of the Galactic Empire and the Planetary Security Forces were nationalized and taken over by the Imperial Military. In the armed forces of the New Order, a philosophical divide emerged between the Generationals, who were mostly Core Worlds families as represented by men like the Tepasi-born General Cassio Tagge, and new up-and-coming officers, as represented by Admiral Conan Antonio Motti and Grand Moff Wilhuff Tarkin of Eriadu. The Generationals saw the Empire as an improvement on the ideals of the Republic and saw the military as a tool for establishing stability and order, and so peace. The true believers of the New Order, however, saw the Old Republic as decrepit and sought to rule by fear, best represented by the policy of state terror set out in the Tarkin Doctrine and the investment of billions of credits in superweapons like the Death Star."}, {"tag": "p", "text": "By 0 BBY, this divide had led to many career Generational officers being marginalized and crowded out by second rate officers loyal to the New Order owing to the latter's political connections, rather than their command ability. This led a number of disillusioned Generationals to retire early or even defect: many of the Alliance to Restore the Republic's finest military commanders, among them Adar Tallon and Jan Dodonna, were in fact disaffected Generational officers."}, {"tag": "p", "text": "Despite this, a number of these Generationals managed to remain within the Imperial Navy but had to, at least by appearance, abandon the traditions of the past and instead adapt to the backstabbing, as well as duplicitous, environment within the Imperial military command structure. Instead of being honorable officers, they were forced to become motivated by political ambitions and were required to do what was expected rather than what was right. Those incapable of following this new chain of command were replaced by more loyal members of the New Order."}, {"tag": "h2", "text": "Sources"}]}