{"url": "Genetech_Orbiting_Research_Lab", "categories": ["Category:Legends articles", "Category:Gorsh system", "Category:Laboratories", "Category:Orbital stations", "Category:Wild Space space stations"], "nodes": [{"tag": "h1", "text": "Genetech Orbiting Research Lab"}, {"tag": "p", "text": "The Genetech Orbiting Research Lab, also known as the Genetech Laboratories Orbital Research Station or the Genetech Research Lab, was a small space station that orbited the Wild Space planet Gorsh. It was owned by Genetech Laboratories and housed forty personnel of the company, including thirty research scientists."}, {"tag": "p", "text": "Teams of the researchers regularly visited the surface of Gorsh in the station's shuttles. The scientists used the natural compounds obtained on the planet to develop useful pharmaceuticals and medicines aboard the Genetech Orbiting Research Lab. The station's personnel also used automated, remote-controlled research probes to investigate Gorsh."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Genetech Orbiting Research Lab, also known as the Genetech Laboratories Orbital Research Station or simply the Genetech Research Lab, was a space station occupying a geosynchronous orbit around the planet Gorsh. The latter was a waterworld with swamp-covered volcanic islands and was the only habitable world in the Gorsh system of Wild Space."}, {"tag": "p", "text": "The small orbital facility, which had a cargo capacity of 300 metric tons, was 53 meters tall and measured 22 meters in diameter. It consisted of two cylindrical sections, the smaller of which housed the living quarters of the station's occupants and the larger of which contained the facility's four power cells. The two cylinders were joined by a pair of mutually inverted conical sections."}, {"tag": "p", "text": "Another cone, located at the bottom of the larger cylinder of the lightly-armed station, housed dual fire-linked laser cannons on its exterior. The conical section gave way to a single large docking bay with four large solar collectors placed at its very bottom. A sensor array was situated atop the smaller of the two cylindrical sections. In addition, the cylinder housing the power cells was emblazoned with the logo of Genetech Laboratories, the owner of the space station."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the reign of the Galactic Empire, Genetech Laboratories financed the first extensive explorations of the Gorsh system, and the Empire granted the company ownership of everything within the system. Subsequently, the Genetech Orbiting Research Lab, which was not for sale and served as the only lifeline between the system and the rest of the galaxy, was established in an orbit around the planet Gorsh."}, {"tag": "p", "text": "Teams consisting of one dozen Genetech research scientists and a few armed guards regularly traveled from the station to the surface of Gorsh. There, the scientists gathered unique natural compounds that were later used aboard the orbital laboratory to develop successful pharmaceutical and medicinal products for the company. The Genetech Orbiting Research Labs also dispatched to Gorsh remote probes that could be controlled directly from the station, with followup teams being sent to the planet's surface to investigate if the probes discovered anything unusual."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The crew of the Genetech Orbiting Research Lab, which was owned by Genetech Laboratories, numbered five, including one gunner. The station also housed forty passengers, of which thirty were research scientists and ten were Genetech guards. The facility had the bare minimum of necessary supplies, although it did have enough consumables aboard to supports its personnel for 6 months. The researcher teams that traveled from the station to the surface of Gorsh were equipped with survival gear, medicines, breath masks, weapons, specimen containers, chemical analyzers, pocket computers, biochem synthesizers, and additional necessary field gear."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The top section of the cramped, spartan Genetech Orbiting Research Lab contained the living quarters of the station's personnel and included staff quarters, a kitchen, and a lounge. Further down, the conical section attached to the largest cylindrical portion of the facility contained fifteen research labs and specimen facilities."}, {"tag": "p", "text": "That same cylinder also housed a launch tube for the station's twelve automated research probes that could be controlled directly from the station. The docking bay of the Genetech Orbiting Research Lab, which serviced the facility's complement of four three-person drop-shuttles and one ten-person research shuttle, was equipped with a docking hood."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Genetech Orbiting Research Lab was introduced in Planets of the Galaxy, Volume One, a 1991 sourcebook for West End Games' Star Wars: The Roleplaying Game. John Paul Lona provided an illustration of the station for the book."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}