{"url": "GenoHaradan", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Criminal organizations", "Category:Pre-Republic", "Category:Secret societies", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "GenoHaradan"}, {"tag": "p", "text": "The GenoHaradan was a secret bounty hunter guild that manipulated galactic political events through assassination."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Xim the Despot created the GenoHaradan as a sort of secret police, using it to eliminate his most powerful enemies and rivals. Even with its agents under his complete control, however, Xim was defeated after a mere 30 years at the Third Battle of Vontor during the Xim Wars. It was believed that the GenoHaradan died with him, and this is the point at which common knowledge of the ancient guild ends."}, {"tag": "p", "text": "In actuality, the GenoHaradan merely disappeared from the public eye and reshaped its existence. Without a governing body to defer to, the Guildmasters hired their agents to the highest bidders, becoming a powerful assassination tool for the wealthy and ambitious."}, {"tag": "p", "text": "Centuries passed, and the GenoHaradan slowly reshaped further. Its leadership realized that some individuals and governments were more beneficial to the guild than others, and it gradually learned to discriminate between those it sold its services to. The guild was evolving a sense of self-interest and becoming an influential faction in its own right. To balance the power of this new identity, it was decided to divide leadership among four Overseers instead of a single Guildmaster."}, {"tag": "p", "text": "The foremost of those the GenoHaradan saw as beneficial was the Galactic Republic since the end of the Tionese War in which Tion presumably became the capital. The Republic's democratic system of succession presented the GenoHaradan a stable entity with which to work, and its democratic system of representation presented them a wealth of corruptable bureaucrats. In time, the GenoHaradan would work almost exclusively for the Republic, operating in the shadows and quietly doing the government's dirty work, even without the government's knowledge, profiting from the secret relationship all the while. It was a perfect symbiosis. The Galactic Republic would grow to become the foremost power of the galaxy, and those few who knew of the GenoHaradan would attribute this growth almost exclusively to the guild's involvement."}, {"tag": "h3", "text": "Fate"}, {"tag": "p", "text": "3,956 years before the Battle of Yavin, the four Overseers of the GenoHaradan were Hulas the Rodian, Vorn Daasraad the Gamorrean, Rulan Prolik the (possible) shapeshifter, and Ithorak Guldar the Selkath. Of course, since all Overseers kept their identities secret, no one knew of this information, except Hulas. Hoping to become sole commander of the GenoHaradan, a position that had not been taken since the days of the Guildmasters, Hulas spied and worked to uncover the identities of his peers; having succeeded, he lacked only a means to eliminate them from the picture. This means presented itself when Calo Nord was killed by a powerful but relatively obscure Jedi."}, {"tag": "p", "text": "Not realizing this man was the infamous Revan, Hulas invited the mind-wiped Jedi to meet with him personally on Manaan, at which point he attempted to recruit Revan into the GenoHaradan. Hulas undoubtedly intended to have Revan kill his fellow Overseers as common criminals, leaving Hulas the sole head of the GenoHaradan."}, {"tag": "p", "text": "Revan did not accept any of Hulas's initiation bounties, assassination being a morally questionable act. Hulas did not believe he could have found an alternative agent capable of defeating the other three Overseers and Revan refused, so all his work in uncovering their identities may have very well been fruitless."}, {"tag": "p", "text": "Around 3640 BBY, the GenoHaradan attempted to capture the Grand Champion of the Great Hunt, who was falsely labeled the Republic's Most Wanted, capturing Torian Cadera to lure their prey into a trap on Hoth. Despite also being outnumbered, the bounty hunter swiftly managed to kill the entire squad of GenoHaradan."}, {"tag": "p", "text": "In the later stages of the Galactic War, the GenoHaradan tipped off Supreme Chancellor Leontyne Saresh regarding the Hutt Cartel recruiting dangerous mercenaries on Darvannis. Saresh would later contract the GenoHaradan to assassinate Sith Empress Darth Acina and The Outlander on Dromund Kaas as part of an attempted coup to take over The Alliance, only for the two to survive.\nThe GenoHaradan continued to exist at least until the final decades of the Galactic Republic."}, {"tag": "p", "text": "Tac-Spec Corporation, a droid manufacturer that operated into the last few centuries of the Old Republic, claimed to have originated as a GenoHaradan front-company. Their exclusive automata for the Republic's aristocracy, such as the FIII Footman droid, would have been ideal agents for the organization's policy of subtly influencing Galactic politics."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Secrecy was the GenoHaradan's prime concern; its power derived from shaping events through peripheral actions. As such, its bounty hunters, while perceiving themselves as more skilled than their contemporaries, strove to remain in obscurity and never attained the fame of hunters such as Calo Nord. A GenoHaradan agent's objective was not only to eliminate the target, but to eliminate the target in such a way that it would seem the agent had no involvement whatsoever in the death or disappearance. Since this left agents with no ability to produce proof of their success, other agents would be assigned to monitor them and report results to superiors."}, {"tag": "p", "text": "To most, the guild was entirely unknown, and any who attempted to betray the group's existence would have generally been derided as a crackpot conspiracy theorist. The idea that the Republic had only survived so long because of a secret society keeping it alive sounded fantastical, and the GenoHaradan relied on this doubt to maintain its anonymity. Still, a handful of government leaders and perceptive Jedi did learn of the GenoHaradan, and this was how the guild found bounties—when it wasn't determining its own targets."}, {"tag": "p", "text": "Whenever the GenoHaradan transformed into a faction with its own interests, the power of its Guildmaster increased; guild leadership was becoming much more than a simple go-between for elite bounty hunters and rich customers. The GenoHaradan governing system was therefore reformed: it became led by a cabal of four Overseers. Like anything else in the GenoHaradan, the Overseer system relied on secrecy. The four Overseers would consult with each other on all guild business, but they did so through agents and messengers so as to protect each Overseers' identity. In this way, the individual ambitions of all four Overseers would serve to balance each other out, theoretically resulting in the overall best interest of the GenoHaradan. The method for choosing and replacing an Overseer was a complicated process that required ensuring each candidate's anonymity; other than this, details of the process were unknown."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hulas claims that the GenoHaradan were created 5,000 years before the Galactic Republic (30,000 BBY), but Xim the Despot's reign began at only 25,130 BBY, so this founding year is not possible unless the GenoHaradan existed thousands of years before Xim's time."}, {"tag": "p", "text": "In a series of dark side quests in Star Wars: Knights of the Old Republic, Revan can take part in assassinating dangerous elements to the Galactic Republic on behalf of the GenoHaradan. He had to eliminate various targets on Manaan, Tatooine, Kashyyyk and Dantooine (if the planet had not been razed previously)."}, {"tag": "p", "text": "Revan receives an automatic dark side shift upon the death of any of his targets, regardless of whether the target is actually evil or whether the target attacks Revan without provocation. In the case of the shapeshifter, Revan merely has to present proof that he is not who he appears to be, and has in fact killed the Wookiee hunter he is impersonating. The shapeshifter immediately attacks."}, {"tag": "p", "text": "The award for each successful hit is a powerful and advanced piece of equipment. If the player chooses to accept the assassination missions, Revan eventually learns that Hulas had tricked him into killing the other leaders of the GenoHaradan, giving him sole control. The player then has the option to kill Hulas on Tatooine for his betrayal."}, {"tag": "p", "text": "The GenoHaradan had a part in the sequel to Knights of the Old Republic, Star Wars: Knights of the Old Republic II: The Sith Lords, in which one chapter of the GenoHaradan was hunted down (and presumably killed) by Meetra Surik and her party on Nar Shaddaa, but it was one of the many things that were cut from the game. See Cut content from Star Wars: Knights of the Old Republic II: The Sith Lords for more information on the cut parts of the GenoHaradan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}