{"url": "Geonosian_(language)", "categories": ["Category:Legends articles", "Category:Language stubs", "Category:Incomplete lists", "Category:Articles needing additional sources", "Category:Geonosian culture", "Category:Languages"], "nodes": [{"tag": "h1", "text": "Geonosian  (language)"}, {"tag": "p", "text": "Geonosian was the language of the Geonosian species native to Geonosis. It consisted of click consonants, possible through the dual mandibles of Geonosians—one moving vertically, and a second, internal set moving horizontally."}, {"tag": "p", "text": "Aristocrat Geonosians were also able to understand Basic fluently, unlike the lesser castes. It is unknown if they were all physically unable to speak Basic (much like Wookiees), or if they simply preferred their own language. The Queen Karina was known to be capable of speaking Basic. An off-world Geonosian, Tookra, could also speak Basic."}, {"tag": "p", "text": "The language was mostly spoken by Geonosians, but there were instances of offworlders understanding Geonosian without the immediate need of a translator; Count Dooku, Shu Mai, Senator Padmé Amidala, Lott Dod, and Ysanne Isard were notable examples. Marmio Mio also learned the language while on the planet."}, {"tag": "p", "text": "Human vocal cords were apparently capable of reproducing the Geonosian sounds. Infected clones were able to reproduce the sound fairly simply and authentically."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In a Hyperspace online chat, Matthew Wood said that the sound of the Geonosians was one of the weirdest he had ever recorded for a Star Wars movie. It consisted of a penguin mating call as well as fruit bats fighting over a banana."}, {"tag": "p", "text": "In Attack of the Clones, when Anakin, Obi-Wan, and Padmé are taken into the Geonosian execution arena to be killed, the Geonosians in the arena make noises that sound like Human cheering instead of Geonosian-sounding noises, even though nearly everyone in the arena is a Geonosian with the exceptions of Count Dooku, Jango Fett, Boba Fett, Nute Gunray, Rune Haako, Anakin Skywalker, Obi-Wan Kenobi, and Padmé Amidala."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}