{"url": "Geon_Justic", "categories": ["Category:Legends articles", "Category:Bureaucrats", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Geon Justic"}, {"tag": "p", "text": "Geon Justic was a Human male who served as head of the Elesa Mining Union in the small mining town of Elesa, in Ando Prime. At that point, Justic had some professional relation with Feena Ghel, a local Rodian who owned a repair shop."}, {"tag": "p", "text": "Justic was in his post when Kaeline Ungasan began his project of the Ungasan Cross Country podracing course. Ungasan, an agent of the Corporate Sector Authority and prospective crime lord, intended to use the Cross Country as a cover for his illegal mining operation. He sent his minion, Ree, to Elasa to meet with Justic. Ree pretended to be the leader of a zoological research team when dealing with other Elesans."}, {"tag": "p", "text": "Ree met with Justic at the Miner's Union Hall, and bought specially-customized scanning equipment using surplus items from the CSA that Ungasan had provided—even then, Justic believed that Ree worked for criminal Ungasan, but was unaware of Ungasan's connections with the CSA. Ree also convinced Justic to keep his and Ungasan's activities in secret in exchange for the bribe. When Ree asked him about a nearby location, the Juaka Canyon, Justic neglected to mention its hostile Talid inhabitants: He hoped the Talids would kill Ree, releasing Justic from any promise of help."}, {"tag": "p", "text": "Soon afterward, some unbeknownst agents of Ungasan's rival Hutt crime lords went to Ando Prime looking for Ree and questioned Justic about him, as Justic was the last person to talk with Ree. Justic was then successively questioned by a hit team of the Hutts led by bounty hunter Davon Gitta; by Ungasan himself who was looking for his business partner; and by aggressive CSA operatives who were following Ungasan. Justic led all of them to the Canyon, and then decided to leave Elesa for a while."}, {"tag": "h2", "text": "Sources"}]}