{"url": "Geonosian/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Enslaved species", "Category:Geonosians", "Category:Insectoid sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Geonosian"}, {"tag": "p", "text": "Geonosians, often called Geos or bugs in clone trooper slang, were an insectoid species native to the planet Geonosis. Geonosians resided in catacomb-like hive colonies beneath the organic-looking spires."}, {"tag": "p", "text": "Notable Geonosians included Poggle the Lesser, Gizor Dellso, and Sun Fac, who all held important roles in the Confederacy of Independent Systems."}, {"tag": "p", "text": "The Geonosians, with their long snouts and spindly limbs, bore a certain resemblance to B1-Series battle droids, which they manufactured for some time before the outbreak of the Clone Wars."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Like many insectile species, Geonosians had a hard chitin exoskeleton that provided protection from physical impacts and bouts of radiation that occasionally showered their world, elongated faces and multi-jointed limbs. Geonosians were strong despite their thin builds, and were capable of constructing massive hives and factories in concert.[source?] They were classed as a semi- or quasi-insectoid sentient species. The physical attributes of a Geonosian tended to vary depending on the caste that they were born into. The head of a Geonosian was elongated and large with their skulls ridged on the top and by the side where they had bulbous, thick-lidded eyes. Typically, they had two varieties, the leading aristocrats and the warrior drones. Both were physically strong and covered with bony ridges which protected their arms, legs, and vital organs. Normally, their skin was reddish, and they had a slender frame. They were somewhat resistant to the radiation that struck their homeworld, but tended to live underground to escape this phenomenon."}, {"tag": "p", "text": "They were bipedal and walked on two legs. Their toe structure allowed them to cling to rock crags. However, most also possessed leathery rapid-fluttering wings that emerged from their bony shoulder blades. In some specimens, the wings were not used after their youth, and service drones had vestigial wings. Geonosians stood 1.6 to 1.8 meters in height."}, {"tag": "p", "text": "Geonosians between the ages of one and six were classed as children, whilst those seven to ten were young adults. An adult was between 11 and 35, whilst middle age was 36 to 50 and old age was 51 to 64. A venerable age for a Geonosian was over the age of 65 years."}, {"tag": "p", "text": "The Ur-Greedle were close evolutionary cousins of the Geonosians and developed from the same insectoid forebears. No Force-users were known to exist amongst this species."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The majority of Geonosians were content to remain within their caste until they died, though some did develop some ambition. Workers were conditioned to loathe even the concept of separation from their hive and the system of control. A low-ranking worker's normal life was one of endless toil and labor to satisfy the aristocracy, who were known to make spectacular demands. The warrior caste tended to be highly competitive and were eager to prove themselves. They were born with an abnormal level of intelligence, and one of their only hopes of escape from their rigid duty was entering voluntarily into gladiatorial combat. Should such aberrations survive, they were granted life, but exiled where they needed to find refuge elsewhere. Ultimately, their society existed to benefit those few members that resided in the upper caste. Members of the aristocratic classes were known to be ambitious, domineering, and manipulative. They constantly moved towards improving their standing and holdings, yet at the same time they worked to eliminate or ruin their rivals. Legions of such drones served the aristocracy and thus lived within the dictates of their rigid society. Generally, Geonosians were reluctant to leave their hives, which was one of the reasons they were rarely encountered offworld. Despite this, a few managed to purchase their way off their home planet. Some among their number included aristocrats and warriors."}, {"tag": "p", "text": "Geonosians tended to live underground to escape the radiation that affected their world; this form of existence was also attributed to a hive's desire to hide from their rivals as well as the predators that lived on their homeworld. Such underground Geonosian hives were traditionally concealed in the landscape and had natural forms to blend with the environment. Their dwellings were considered spectacular realms of architecture composed of soaring rocky spires that were carved from the landscape on the surface of their world. These hives used a rock paste that was cultivated from farms where the parasitic Phidna insects were found. This process allowed the construction of soaring spires with an organic look that gave the appearance of melted bone. Newer spires were based on the mounds used by the aboriginal ancestors of the Geonosians. The hives were connected to one another by kilometer-long populated tunnels that extended beneath the surface of the planet. Each of the hives guarded their own tunnels with vigilance. Great wars were fought periodically for control of the great hives with such engagements being fought within the tunnels networks. Such warfare often included sabotage, with sonic mines being deployed within a rival's tunnel. Geonosian sentries were often on the lookout for invaders against the hive, from native animals to drones from a rival. The motivations of such intruders were anything from raids, sabotage, or assassination."}, {"tag": "p", "text": "They relished battle and public executions. To the Geonosian masses, visits to the execution arenas were dramatic and festive events. The arenas seated vast numbers of drones. In fact, their society allowed the lower castes to escape the everyday drudgery of their lives by engaging in gladiatorial combat. These arenas were also used as an alternative to holding prisoners, which saved a hive's resources. Any captives served as public entertainment, where they were forced to fight ferocious beasts or one another. The practice had two effects; firstly, it reinforced the rule of the aristocrats, and secondly, it pacified the masses of drones by entertaining them with violence. As such, those captured by Geonosians were sent to the arenas where they were meant to provide amusement for the masses. These arenas were part of a network of gladiatorial societies."}, {"tag": "p", "text": "Those of the lower castes who voluntarily engaged in battle in the arena were afforded a level of status if they distinguished themselves in combat. Such acts afforded them fame, fortune, and the right to be seen as aristocrats, though they were never treated as equals. The majority of these used their accumulated wealth and prestige to purchase their way off Geonosis, after which they never returned to their homeworld. One of the subgroups within their society associated with the arenas was the Picadors. In their mythology, there existed a group of figures known as the hive overlords who resembled gigantic Geonosians with these towering beings representing both great strength and wisdom. They had been angered by the inter-hive rivalries and conflict to the point that the overlords fought one another in open combat that was waged over the surface of their world and in front of the awed Geonosians. It was this event that inspired the use of gladiatorial combat which developed into the art known as Petranaki."}, {"tag": "p", "text": "Petranaki involved a set of weapons called the \"petranaki array,\" which included such weapons as the confessor's whip, caster's net, petranaki scimitar, picador's spear (also known as a static pike), and the beastwarden's shield. This form of arena combat was considered a noble, high-class profession. Petranaki gladiators were thus given a level of distinction beyond the limits of their caste (although never equal to the aristocrats). They considered 33 a lucky number, and if a larva was born the 33rd egg of his clutch, it was taken to be a good omen.[source?]"}, {"tag": "p", "text": "The violent nature of their civilization was reflected within their art that typically depicted blade-like imagery as part of its contents. Their kind tended to show contempt towards other species, though those that escaped their caste-dominated society quickly learned tolerance when meeting alien races. Whilst Geonosis was close to the Corellian Run trade route, the Geonosians themselves received few visitors. It was only the presence of the Geonosis droid foundries that attracted clients, and this industry they maintained was considered the finest and most productive in the galaxy. These factories were excavated by large teams of worker drones and were kilometers underground. Such facilities had grand entrances that served as examples of hive architecture. Their underground factories were maintained by a slavish workforce consisting of flightless drones. Safety regulations in these factories were minimal, and many drone workers were killed, maimed, or crushed by the exposed machinery. During receipt of a client's droid units, Geonosians were particularly vigilant."}, {"tag": "p", "text": "Their kind spoke and read a language that was also known as Geonosian. It was spoken with clicks and whistles and written using the Geonosian alphabet.[source?] Common Geonosian names were Deetle, Eorlax, Krylla, Lysslo, Mazzag, Qorn, Sollas, and Vikkal."}, {"tag": "p", "text": "Due to their biology and appearance, Geonosians had poor relations with insect-eating species such as the Kubaz."}, {"tag": "h2", "text": "Castes"}, {"tag": "p", "text": "The Geonosians were a caste-dominated civilization. Geonosian society had two main types of Geonosians: the wingless drones that mostly worked as laborers and the winged aristocracy, which included royal warriors serving as scouts and providing security to the hive. Geonosian society existed for the benefit of the elite of Geonosians. Their caste system had evolved over millennia. Geonosians were born into specific castes divided along the lines of their physical attributes. Though most Geonosians were content to live within their assigned castes, a few developed ambition and aspired to ascend socially. Even those with the capacity to depart rarely left Geonosis. The importance of the hive was strongly ingrained in the Geonosian mind, and they were also contemptuous of other species. The few that ventured offworld usually left as work groups that ultimately benefited their home hives. Geonosian contractors could be found at Baktoid Combat Automata plants across the Outer Rim Territories.[source?]"}, {"tag": "p", "text": "The three biologically distinct castes of drones had further been altered by way of genetic modification and selective breeding. Such a process produced specialized drones that served a variety of roles within a hive. These drone castes included service, labor, soldier, farmer, maker, and overseer drones, with the last managing the other ones."}, {"tag": "h3", "text": "Queen Caste"}, {"tag": "p", "text": "A queen's body and head somewhat resembled regular Geonosians, although it had six limbs instead of four, and its abdominal section was a massively bloated ovipositor with which to lay eggs. The queen could lay an egg roughly every eight seconds. The head was larger and had a giant crest. Queens kept the hive running and were the central link of the Geonosian hive mind. In fact, some queens had such a powerful link with the hive mind that they could actually control dead warriors."}, {"tag": "p", "text": "One Geonosian queen was Karina the Great. Karina was capable of speaking some Basic and could control sentient beings via brain worms. This implied that Karina and maybe other queens had high intelligence and were able to use some type of telepathy."}, {"tag": "p", "text": "The caste was largely unknown to the Republic in the beginning of the Clone Wars. It was only discovered when Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker went on a search mission for Jedi Master Luminara Unduli, who was tracking Poggle the Lesser."}, {"tag": "h3", "text": "Warrior caste"}, {"tag": "p", "text": "Such soldier drones grew rapidly to adulthood and were combat ready as early as six standard years of age. They were tough, single minded, and biologically adapted to a life of warfare. In addition, they were conditioned to act en masse whilst showing a fearless stubborn mentality. Such traits made them good defenders and strong fighters."}, {"tag": "p", "text": "Like their society at large, the warrior caste was divided between the elite and the regulars. The elite warriors were genetically superior to the regulars, having greater abilities in the art of war, and appeared to be equipped with cybernetics. While the regulars were only equipped with weak force pikes or sonic blasters and barely any protective gear, the elite were given beam weapons capable of cutting through the personal shields and plating of Katarn armor. These beam weapons, like their pilots and ships, were intricately connected to create the Geonosians' brand of a perfect warrior, unified and highly dangerous. They also, for reasons unknown, had a second pair of walking legs and longer abdomens than normal Geonosians, perhaps due to genetic engineering or selective breeding."}, {"tag": "p", "text": "Geonosians did not have a formal standing military, although they had basic security and law-enforcement forces. They instead used their droid foundries to build armies or large numbers of droids for corporate interests wealthy enough to afford them—entities such as the Trade Federation and the Techno Union. They oversaw the creation of the spectacular architectural realm in which they all lived, adapting forms they once built by instinct into more refined, spire-like structures."}, {"tag": "h3", "text": "Worker caste"}, {"tag": "p", "text": "The members of the worker, or lesser, caste were wingless Geonosians that formed the lower class of Geonosian society. They were oppressed by the warrior caste, most of which thought nothing of compelling thousands of workers to toil under harsh conditions regardless of any dangers. They constructed spires and droid foundries, as well as more complicated architectural feats, such as the Petranaki arena. Some of the members of this caste were known to have non-functioning wings."}, {"tag": "p", "text": "The only hope a worker might have of escaping his lowly status lay in gladiatorial combat. Geonosians of lower-caste were often pitted against other Geonosians, other sentients, or fierce creatures in large arenas. If the Geonosian survived, he achieved status and ascended socially, or gained enough wealth to leave Geonosis altogether."}, {"tag": "p", "text": "Poggle was once a member of that caste, hence his epithet \"the Lesser.\""}, {"tag": "h3", "text": "Other castes"}, {"tag": "p", "text": "One Geonosian subgroup to emerge was a separate caste raised to be fighter pilots. These hardy specimens required no sleep. In training, each pilot pupa paired with a fighter's flight computer, and they developed an idiosyncratic, coordination-enhancing rapport. The pilots lacked wings."}, {"tag": "p", "text": "Another subgroup was the picadors, which operated the Geonosian gladiatorial arenas. The picadors were trained to ride orrays and use static pikes to direct and wrangle arena beasts. The arena picadors were actually drones from other castes who had proved themselves worthy in the arena. They were given slightly more dignity than a typical worker drone."}, {"tag": "p", "text": "Yet another caste was the zombie caste, some queens' personal cadre of undead servants whose brain worms permeated death and forced them into unquestionable loyalty. These undead were able to take more damage than their living brethren and bounce back even after dismemberment."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The species was native to the rocky planet of Geonosis located in the Outer Rim Territories. Eons ago, during a prehistoric age, this world suffered a great cataclysm which forever affected it: a comet crashing into their homeworld's largest moon. This created a debris field that constantly rained onto the surface and exterminated 99% of the native species across the globe. The few hardy species that survived in this new environment moved to reclaim their world across millions of years. Amongst these were insectoid forebears of the Geonosians who eventually became the most cunning and vicious to survive Geonosis's harsh environment. A combination of their greater intelligence and the efficient hive-based societal structure allowed them to dominate their homeworld. This led to the Geonosians being considered the planet's higher lifeform who were forced underground."}, {"tag": "p", "text": "In time, the inhabitants made contact with the wider galaxy in the form of scouts and traders. This, in turn, led to the establishment of commerce ventures in the Outer Rim with business groups. This introduced galactic-level technology to the Geonosians, which captivated their technical- and mechanical-minded intellects. Such an event saw the establishment of droid factories located deep underground, where they constructed machines based on their own form. This saw Baktoid Armor Workshop, which was affiliated with the Techno Union, create a distribution deal with the Geonosians. The arrangement allowed for Geonosian droids to be sold throughout the Rim. In time, Baktoid moved much of its droid production to Geonosis, circumventing any restrictive legislation from the Galactic Republic."}, {"tag": "p", "text": "During the Great Galactic War, the arenas of Geonosis saw the rise of a promising Mandalorian gladiator who drew the attention of the Geonosian authorities. This warriors career rapidly grew to the point that many within the crowd made allegations of cheating. In actuality, Imperial Intelligence had propped up the young warrior to install him as the new Mandalore. Eventually, his victories meant that there was low chances of his defeat to the point that the Geonosians were unable to earn more credits. Before this young Mandalore the Lesser could be forcibly retired, he departed Geonosis and began rallying the Mandalorian clans for a campaign against the Republic."}, {"tag": "p", "text": "By the Cold War, a group of Geonosians led by Kyvax were known to had settled on the planet Tatooine where they established an encampment in an abandoned town outside Anchorhead. During this time, they were hired by Colonel Gorik of the Sith Empire to serve as construction crew for a series of bombs designed by Fuse. These bombs were installed within droids and sent to a site where Gorik's forces retrieved them as part of a bombing campaign to test their effectiveness against the native populace. Such an event attracted the attention of Havoc Squad who terminated Kyvax thus ending the threat of further construction of bomb droids."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 24 BBY, during the reign of Archduke Poggle the Lesser, Geonosis became a member of the Confederacy of Independent Systems, which used the planet's factories to build its Droid Army. Two years later, in 22 BBY, Poggle scheduled a private meeting of the Confederacy leaders on Geonosis. It was expected that during this meeting the organizations that formed the backbone of the Separatist movement would put their resources at the disposal of Count Dooku, the Head of State of the Confederacy."}, {"tag": "p", "text": "Unbeknownst to the Separatists, their plans of waging war against the Galactic Republic were heard by Jedi Knight Obi-Wan Kenobi, who had followed Jango Fett, a bounty hunter employed by Dooku, to Geonosis. Kenobi managed to transmit his discoveries to his Padawan, Anakin Skywalker, who was on Tatooine, before being caught by the Separatists. After retransmitting the information to the Jedi Council, Skywalker and Padmé Amidala, the senator of Naboo, decided to rescue Kenobi, but ended up imprisoned themselves."}, {"tag": "p", "text": "Eventually, Kenobi, Skywalker and Amidala were taken to the Geonosian execution arena, but managed to free themselves. The Separatists, in turn, introduced battle droids to the arena, triggering the First Battle of Geonosis, the first battle of the Clone Wars, as Jedi reinforcements, led by Master Mace Windu, revealed themselves among the public and entered the arena to confront the droids."}, {"tag": "p", "text": "After the Confederacy's defeat at the Battle of Geonosis, the planet was occupied by the Republic."}, {"tag": "p", "text": "Months later, Geonosians overthrew Republic control of the planet, and Poggle the Lesser began constructing new ray-shielded droid factories. When the Republic discovered this, they launched a massive invasion. The forces of Jedi Generals Skywalker, Kenobi, and Ki-Adi-Mundi faced heavy resistance by the Geonosians, who were utilizing proton cannons, sonic cannons, and destroying gunships and dropships with their starfighters. Despite this and the swarms of Geonosians, the Republic destroyed a fortress and the factory shield generator."}, {"tag": "p", "text": "As Republic forces approached the primary factory, Poggle ordered a force of battle droids to defeat the forces of Skywalker and Jedi General Unduli. A swarm of Geonosians attacked the clones from behind, killing many. Underground, Padawans Ahsoka Tano and Barriss Offee were going through the catacombs to access the factory and destroy it. A Geonosian trailed them, however, and notified Poggle. After setting Super tanks on the Republic forces, he sent a group of Geonosians and a tank led by TX-21 to stop the Jedi. They failed, however, and the factory was destroyed."}, {"tag": "p", "text": "During the retaking of Geonosis, a temple was discovered in the Republic's search for Poggle the Lesser, where they found that Queen Karina the Great of the Geonosians lived in the catacombs beneath the temple. She utilized a parasite that enabled her to control the victim's mind."}, {"tag": "h3", "text": "Post-Clone Wars"}, {"tag": "p", "text": "As the Clone Wars ended with the Republic victorious and restructured into the Galactic Empire, Geonosis remained under Imperial control. Geonosian Gizor Dellso and several other Geonosians formed a Separatist holdout during the aftermath of the Mission to Mustafar, but the organization was dissolved during the Battle of Mustafar. Geonosian scientists and slaves also played a role in the construction of the Death Star. During the Galactic Civil War, Geonosian scientists set up a bio-lab on Yavin 4."}, {"tag": "p", "text": "After the Clone Wars, battle-droid use was frowned upon, and Geonosian fortune waned when they were primarily used for slave labor by the Empire. However, in 0 BBY, a Geonosian revolt was instigated by Rebel forces, who had built a secret base on Geonosis. Darth Vader, leading an invasion force, was sent to crush the revolt in what became the Subjugation of Geonosis. Although the Geonosians and the Rebels, fighting side by side, put up a good deal of resistance, the Imperials emerged victorious, destroying all present Rebel operatives, and killing the revolting Geonosians and destroying their homes."}, {"tag": "p", "text": "After the first death of Emperor Palpatine, Geonosis established an isolationist policy, not wishing to repeat what happened at the beginning of the Clone Wars. The Geonosians were spared the horrors of the Yuuzhan Vong during their invasion of the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Geonosians were based primarily on concept art originally developed for the Neimoidians when George Lucas wanted to make them a computer-generated creation. When Lucas decided to use animatronic masks instead, the Neimoidian design was refined further into the Geonosians."}, {"tag": "p", "text": "The sound of the Geonosians was created from the sounds of flying foxes and the mating cries of penguins."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}