{"url": "Geonosian_Bio-Lab", "categories": ["Category:Legends articles", "Category:Laboratories", "Category:Yavin 4 locations"], "nodes": [{"tag": "h1", "text": "Geonosian Bio-Lab"}, {"tag": "p", "text": "The Geonosian Bio-Lab, also known as the Geonosian biogenics research laboratory, was a laboratory hidden on Yavin 4 used by the Geonosians. The lab was used to test experiments on many creatures, causing them to mutate to hideous beasts, for use in the Geonosian Execution Arena on Geonosis."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, Bothan spies intercepted transmissions from an Imperial officer named Harmon Vintollo on Kaadara and an undercover Rebel operative named Teraeza Furloti in a hotel in Tyrena on Corellia. They both spoke of a hidden biogenics lab run by the Geonosians. The information was later leaked to the HoloNet. Information was also revealed when Geonosian named Ikvizi who was being held prisoner on Kashyyyk gave the coordinates to get a domesticated bolotaur within the lab to a helpful traveler."}, {"tag": "p", "text": "Following the Battle of Yavin, rumors began circulating around the galaxy about the hidden laboratory. Other, more sinister creations such as mutated Kwis and Klikniks with Force powers were being developed for use."}, {"tag": "p", "text": "Seismic events compromised the base's integrity, disabling the holo-generators that hid the entrance to the complex. The tremors also caused minor cave-ins, structural collapses and sporadic power losses, resulting in mass chaos throughout the complex."}, {"tag": "p", "text": "The base's security system soon malfunctioned. The sentry droids guarding the complex were confused and proceeded to attack any unlucky adventurers who happened to stumble upon the exposed laboratory."}, {"tag": "p", "text": "It is not known what became of the lab after the Galactic Civil War. Rumors persist that some small groups of spacers journeyed bravely to the very bottom of the lab to kill the numerous acklays that were lurking there, in order to loot valuable materials about the creature that could potentially be used in various weaponry."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Geonosian Bio-Lab was a \"theme-park\" in Star Wars Galaxies, introduced a few months after the game's initial release. Its purpose was to introduce some new elements from Attack of the Clones into the game, such as Geonosians and an acklay."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}