{"url": "Geonosian_Industries", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederacy of Independent Systems organizations", "Category:Droid manufacturers", "Category:Geonosian culture", "Category:Techno Union corporations"], "nodes": [{"tag": "h1", "text": "Geonosian Industries"}, {"tag": "p", "text": "Geonosian Industries was a Geonosian company controlled by Poggle the Lesser during the time of the Clone Wars. It was responsible for manufacturing thousands of battle droids and other Geonosian-made weapons for the Confederacy of Independent Systems. It was also a member of the Techno Union."}, {"tag": "p", "text": "Gordarl Weaponsmiths and Huppla Pasa Tisc Shipwrights Collective fell under the umbrella of Geonosian Industries. Baktoid Combat Automata's subcontracted Geonosian foundries were also likely part of the greater company."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Geonosians, who viewed all sentients without wings as inferior castes, were always slighted by Republic's refusal to accept supremacy of their queen. As a result, when Count Dooku expressed great deference toward the queen caste, the Archduke Poggle the Lesser gladly pledged each one of the planet's underground factories to the Separatists' cause and offered his planet as a meeting place for other Separatist representatives. The Republic, however, soon learned of the meeting after receiving a message from Jedi Master Obi-Wan Kenobi, which had been retransmitted by his Padawan Anakin Skywalker on Tatooine. Kenobi was captured during the end of his transmission, and so the Republic sent a force of Jedi to rescue him, commencing the Battle of Geonosis. As battle droids pinned down the surviving Jedi, the Republic's new clone army arrived and the battle turned in favor of the Republic. The droid army, as well as the newly formed Separatist Council was forced into retreat and Geonosis fell into Republic hands."}, {"tag": "p", "text": "Despite this, the resistance from the Geonosians was stronger than the Republic anticipated and they were soon able to regain control of their planet. Poggle then attended a meeting with Trade Federation Senator Lott Dod and InterGalactic Banking Clan senator Rush Clovis in the former's palace on Cato Neimoidia in order to arrange a deal to rebuild the lost Geonosis droid foundries. Clovis' guest, Padmé Amidala, discovered the true intentions of the meeting, however, and returned the readouts of Poggle's new droid foundry to the Jedi Council. A full-scale planetary invasion was soon prepared by the Republic to regain Geonosis."}, {"tag": "p", "text": "Poggle later personally administered the Separatist defense from his primary droid foundry, alongside his personal T-series tactical droid, TX-21. When Jedi Generals Anakin Skywalker and Luminara Unduli mounted an offense on the foundry, they sent their Padawans, Ahsoka Tano and Barriss Offee through the catacombs below the factory in order to destroy it from the inside. The two managed to commandeer a super tank and destroyed the foundry's main generator, causing it to explode. Poggle, however escaped to the Progate Temple to hide in the company of Queen Karina the Great, who planned to use a brain worm to control a newly capture Luminara. Anakin and Obi-Wan Kenobi managed to track down Poggle to the temple and fought their way through legions of Geonosian zombies being controlled by brain worms. The duo captured the Archduke and freed Unduli, escaping as the ceiling collapsed and presumably killed the queen. Poggle was transported to a Venator-class Star Destroyer and held in Republic captivity."}, {"tag": "p", "text": "Poggle managed to escape Republic custody and joined the Separatist Council for its last meetings on Utapau and Mustafar, where he and the rest of the Council were killed by Darth Vader, bringing and end to Geonosian Industries for good."}, {"tag": "p", "text": "With rise of the Galactic Empire, the Geonosians were enslaved and played a key role in the construction of the Death Star/Legends."}, {"tag": "h2", "text": "Associations"}, {"tag": "h3", "text": "Notable members"}, {"tag": "h3", "text": "Soldiers"}, {"tag": "h3", "text": "Artillery"}, {"tag": "h3", "text": "Starfighters"}, {"tag": "h3", "text": "Capital ships"}, {"tag": "h2", "text": "Sources"}]}