{"url": "Geonosian_elite", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Geonosian culture", "Category:Geonosians", "Category:Separatist military units", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Geonosian elite"}, {"tag": "p", "text": "Geonosian elites were an elite subspecies of the Geonosians. They were heavily armored and carried an elite beam weapon which were powered by fluids. Delta Squad encountered many of them on Geonosis and Kashyyyk during the Clone Wars. These were considered the best of the best warriors on Geonosis, rivaling clone troopers and even clone commandos."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Geonosian elites were among the higher echelons of the Geonosian caste system, showing their status with their superior armor and armament, in addition to a larger build overall. Their high position within the caste system made them the leaders of sort with various warrior patrols, which they sometimes led into battle."}, {"tag": "p", "text": "Though rarer than their more common brethren, Elites were not exclusive to any one location. They were known to travel with similar sentient races in sympathy with Separatist aims, such as the Trandoshans on Kashyyyk, and were most commonly spotted fighting alongside their allies on the battlefield. They generally preferred to fight while airborne, a characteristic distinct from the lower warriors' tendencies to return to land from flight when close to their targets, and shoot their enemies with their beam weapons from above. These Geonosians possessed very durable armor, and due to their aerial fighting methods, proved to be difficult targets. Their unprotected heads were vulnerable, and a single blast could fell them."}, {"tag": "p", "text": "However, the fluids they secreted to fuel their Elite Beam Weapons was highly volatile. Should they be killed while firing the weapon, the fluid within their bodies would ignite, setting off a chain reaction that would blow the Elite to pieces once it reached a critical level. Only if they were killed before they begin powering up and discharging their weapons would their body survive intact, otherwise the only thing left would be a few blown-off limbs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}