{"url": "Alisande", "categories": ["Category:Legends articles", "Category:Calians", "Category:Females", "Category:Shiva IV residents"], "nodes": [{"tag": "h1", "text": "Alisande"}, {"tag": "p", "text": "Alisande was a female Human who was the wife of Aron Peacebringer, Warlord of the Calian Confederacy on Shiva IV, and mother to their children during the time of the Galactic Civil War. Alisande and Peacebringer had a happy, loving and passionate relationship for a number of years, and lived together in a palace in the city of Illyriaqüm. In 3 ABY, Alisande recognized her husband's attraction to visiting Rebel leader Leia Organa, but trusted that Peacebringer would choose their marriage in the end—ultimately, she was proven right."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female native to the remote planet Shiva IV, Alisande was the wife of Aron Peacebringer, a powerful warrior who became Warlord of the Calian Confederacy. In 2 ABY, Alisande's husband signed the Concordat of Peace that ended generations of war with the Twelve Tribes of T'Syriél. By that point, Alisande and Peacebringer already been married for a number of years, having several children—their firstborn, a daughter, died in infancy—and living together in a well-appointed palace in the city of Illyriaqüm. In 3 ABY, Alisande's husband went out to investigate the sudden destruction of the city of K'avor, and returned with Leia Organa, an important Rebel leader who had recently crashed on Shiva IV."}, {"tag": "p", "text": "Alisande forged a close friendship with Organa, even as her husband grew attracted to the young offworlder—an attraction that Alisande recognized, but trusted Peacebringer to not act upon. As they attempted to get to the bottom of the destruction of K'avor, they were attacked by an Imperial force led by General Bentilais san Sk'ar, coinciding with the one-year anniversary celebration for the Concordat of Peace. With the help of Alliance reinforcements Luke Skywalker and Chewbacca, along with Peacebringer's blood brother Kéral Longknife, Peacebringer and Organa managed to defeat S'kar and fight off the Imperial menace. Peacebringer returned to Alisande afterwards, having let go of his feelings for Organa, and the two happily resumed their loving marriage."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although Alisande's marriage to Aron Peacebringer had lasted long by 3 ABY, their relationship was still extremely passionate, with the two taking every opportunity to steal away for private encounters. Their marriage brought Alisande a lifetime of happiness, and she held her husband's personal qualities of honesty and integrity in extremely high regard. However, Alisande began to notice a change in Peacebringer after her husband met Leia Organa—he became forgetful, more distant, and seemed distinctly uncomfortable around their Alderaanian guest. She quickly realized his attraction to Organa, with whom Alisande had become close during her time on Shiva IV, considering her something akin to a daughter. However, Alisande did not hold it against her husband, considering it natural to be tempted, and trusting that Peaebringer would return to her once he sorted his feelings out."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alisande first appeared in Star Wars 53: The Last Gift from Alderaan, written by Chris Claremont and released in 1981. Alisande made two appearances in the original Marvel Star Wars comic run, and her name was spelled differently in each appearance: \"Alisande\" in Star Wars 53, and \"Alysande\" in Star Wars 54. Ultimately, Aron Peacebringer's entry in the Star Wars Databank set her name at the original spelling."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}