{"url": "Geonosian_spire", "categories": ["Category:Legends articles", "Category:Geonosis locations", "Category:Outer Rim Territories structures"], "nodes": [{"tag": "h1", "text": "Geonosian spire"}, {"tag": "p", "text": "Geonosian spires were tall, hollowed-out rock formations constructed by the Geonosians and used as hive-mounds, located on the planet Geonosis."}, {"tag": "p", "text": "The spires were built by the Geonosians as both permanent hive dwellings and as temporary refuge from the planet's dangerous radiation storms. Geonosian workers constructed the vast towers from a rocky paste substance; which in turn was derived from a mix of crushed stone and the excrement of parasites called Phidna."}, {"tag": "p", "text": "Upon hardening, the reddish spires would look like an extension of the terrain, camouflaging the insectoid species' dwelling from outsiders and making the planet appear uninhabited. In the fierce ecosystem of Geonosis, these spires also served as protection against aggressive native predators. The intentionally rough exterior belied an elegant and graceful interior architecture, consisting of flowing curves and vault-like windows."}, {"tag": "p", "text": "These massive hives often extended deep underground, frequently housing vast CIS droid foundries and weapons-manufacture facilities. Below these were Geonosian birthing chambers. Even below this was the massive living areas and the Queen's chamber. The catacombs extended many miles beneath this."}, {"tag": "p", "text": "There were several notable spires on Geonosis: the Stalgasin hive, which was the primary (and therefore ruling) hive, the Gehenbar hive, and the Golbah hive."}, {"tag": "p", "text": "Just prior to the outbreak of the Clone Wars, Obi-Wan Kenobi stealthily entered one of the Geonosian spires, where he overheard CIS leaders discussing top-secret plans. Later, another spire was used by the CIS as a command post during the Battle of Geonosis, housing a battlefield holomap and presided over by Poggle the Lesser, Count Dooku, and several Neimoidian leaders. The members of Delta Squad broke into a Geonosian hive and destroyed a droid factory. During the battle, a clone trooper force assaulted another spire near a force of Hardcell-class transports and Separatist bunkers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}