{"url": "Geonosis/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with elements from unlicensed sources", "Category:Confederacy of Independent Systems planets", "Category:Desert planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Geonosis locations", "Category:Geonosis system planets", "Category:Low-gravity planets", "Category:Mandalorian planets", "Category:New Republic planets", "Category:Separatist holdouts planets", "Category:Trade Federation planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Geonosis"}, {"tag": "p", "text": "Geonosis, called Geonosia by some natives, was a ringed, rocky planet in the Arkanis sector of the Outer Rim Territories. The home planet of the insectoid Geonosians, it was known for its droid factories and violent gladiatorial games. The desert world was the Confederacy of Independent Systems' first capital, hosting its major droid foundries. It was the site of the Battle of Geonosis, the opening conflict of the Clone Wars, in 22 BBY."}, {"tag": "h2", "text": "Geology and geography"}, {"tag": "p", "text": "Geonosis had a large diameter but light gravity and dense atmosphere. With a weak magnetic field, harsh solar radiation storms and massive sandstorms were common, and on occasion, mass extinctions occurred. The most persistent surface organisms were humble red rock algae while the semi-insectoid Geonosians were driven underground. The planet consisted of a diminutive molten core with a rocky mantle forming a rocky, desert world subject to flash floods that carved great highland canyons. Water made up 5% of the surface."}, {"tag": "p", "text": "During the time of the Geonosian rule, much of the planet's architecture was similar in appearance to termite mounds, consisting of domes and buildings built into caverns and rock spires. Therefore, one could easily mistake Geonosian buildings for natural formations and the planet to be uninhabited, a great asset during war."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "In the distant past, Geonosis's largest moon was hit by a rogue comet, sending out a massive debris field, which hammered the surface into ruin before settling into a ring of orbiting rock. This event killed off more than 99% of Geonosis's native species. Over millions of years, the few creatures who survived the devastation slowly reclaimed the planet. Random meteor impacts constantly weeded out the weaker species, leaving only the truly cunning, hardy, and ruthless species alive. The insectoid Geonosians, the dominant life form on the planet, constituted all three. Ruled in various independent hives, great wars would periodically break out on the planet's surface."}, {"tag": "p", "text": "Geonosis was first explored by the greater galaxy when miners settled nearby Tatooine around 4000 BBY. The technically-minded Geonosians were fascinated by the outsiders' technology and proved adept at finding new efficiencies in devices' function and production. This period saw the foundation of the first droid foundries, and the Geonosians developed labor droids in their own image."}, {"tag": "h3", "text": "Great Galactic War"}, {"tag": "p", "text": "During the time of the Great Galactic War, Geonosis was famous for the gladiatorial games held on the planet. Many of the combatants were Mandalorians, among them a young fighter. He rose to fame, eventually declaring himself the new Mandalore. He allied the Mandalorians with the Sith Empire, striking against the Galactic Republic."}, {"tag": "p", "text": "Years later, after his eventual death at the hands of another Mandalorian, it was revealed that Imperial Intelligence had been infiltrating the gladiatorial arenas around the galaxy as sponsors, managers, and gladiators. They had chosen the young Mandalorian as their champion, rigging his fights, using tactics such as drugging the opponent."}, {"tag": "p", "text": "In 3645 BBY, the Republic evaluated the planet as a possible defense stronghold. A Sith warship crash-landed there, and Rojo Trace was sent by the Jedi Order to investigate."}, {"tag": "h3", "text": "Recessional"}, {"tag": "p", "text": "Contacts between the Republic and the Arkanis sector proved fleeting, however, and the Geonosians' advances were soon copied by corporations closer to the Core Worlds. Additionally, contact with outsiders caused a deep rift among the hives that soon erupted into yet more savage warfare. Geonosis was abandoned by the greater galaxy and it was not until the Republic's final centuries that scouts and merchants reestablished contact. The hives eventually struck a distribution deal with the Baktoid Armor Workshop that returned their labor droids to the galactic market."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Prelude to war"}, {"tag": "p", "text": "In the final decades of the Galactic Republic, Geonosis came to the attention of the Dark Lord of the Sith Darth Sidious, who was impressed by the Geonosians' engineering skills. He ensured the rise of the Geonosian rebel Poggle the Lesser to the position of Archduke, and then used the planet's connections to the Trade Federation through Baktoid to create an army of battle droids."}, {"tag": "p", "text": "In 24 BBY, under the leadership of Poggle the Lesser, Geonosis became a member of the Confederacy of Independent Systems, which used the planet's factories to build its droid army. This resulted in the formation of the Geonosian Industries."}, {"tag": "p", "text": "Two years later, in 22 BBY, Poggle scheduled a private meeting of the Confederacy leaders on Geonosis. It was expected that during this meeting the organizations that formed the backbone of the Separatist movement would put their resources at the disposal of Count Dooku, the Head of State of the Confederacy."}, {"tag": "h4", "text": "First battle of the Clone Wars"}, {"tag": "p", "text": "Unbeknownst to the Separatists, their plans of waging war against the Galactic Republic were overheard by Jedi Knight Obi-Wan Kenobi, who had followed Jango Fett, a bounty hunter employed by Dooku, to Geonosis. Kenobi managed to transmit his discoveries to his Padawan Anakin Skywalker, who was at that time located on Tatooine, before being caught by the Separatists. After retransmitting the information to the Jedi Council, Skywalker and Padmé Amidala, the Senator of Naboo, decided to rescue Kenobi, but ended up imprisoned themselves."}, {"tag": "p", "text": "Eventually, Kenobi, Skywalker and Amidala were taken to the Petranaki arena and were faced against an acklay, a reek, and a nexu respectively, but managed to free themselves. The Separatists, in turn, introduced battle droids to the arena, triggering the Battle of Geonosis, the first battle of the Clone Wars, as Jedi reinforcements, led by Master Mace Windu, revealed themselves among the public and entered the arena to confront the droids. After a long battle between the droids and the Jedi, Grand Master Yoda arrived with the newly-formed Republic army and rescued the defeated Jedi forces. Following the Confederacy's subsequent defeat on the planet, Geonosis was occupied by the Republic, and kept under strong control."}, {"tag": "p", "text": "Jedi Knight Barriss Offee was working on Geonosis during the Clone Wars."}, {"tag": "h4", "text": "Second Republic assault"}, {"tag": "p", "text": "Some time later, plans for a new droid foundry funded by Senator Rush Clovis and the Banking Clan were uncovered by Senator Amidala, leading up to another battle on the planet. Jedi Masters Ki-Adi-Mundi, Obi-Wan Kenobi, and Jedi Knight Anakin Skywalker led an assault on Geonosis to destroy Poggle the Lesser's new droid foundry. However, the factory turned out to be very heavily guarded, and the assault met with heavy losses of men and material.The Geonosians deployed several squadrons of Nantex-class territorial defense starfighters that decimated the landing force, even before landing. Shot down and cut off from each other, Skywalker, Kenobi, and Mundi were forced to fight their way to their first prime objective: an assault staging area."}, {"tag": "p", "text": "Skywalker and Ahsoka Tano ended up going through a canyon where a fortress had been erected, destroying it in the process. They discovered Master Mundi, who had made his way through a tunnel that ended with him losing many men. Kenobi was no better off. His perimeter was being actively destroyed by the Geonosian forces and AAT tanks. Skywalker called in reinforcements and destroyed the Geonosian forces. From there Skywalker and his Padawan destroyed the shield generator with one swift stroke."}, {"tag": "p", "text": "Luminara Unduli and Barriss Offee showed up to help take the factory down. They lead a full frontal assault while the Padawans found their way through the catacombs under the factory where Poggle and a new \"super tank\" found them and went to take their bombs that they had set on the Main Reactor. Outside, the tactical droid had sent out a dozen tanks to rupture them. They were all destroyed by a sense of ingenuity by the Jedi Masters. The Padawans took the Reactor out with a Super Tank missile and almost sacrificed themselves to do it. They were rescued in the end by their masters."}, {"tag": "p", "text": "Towards the later stages of the war, construction of the Death Star began by the Geonosian's under orders of Sidious, secret leader of the CIS."}, {"tag": "h3", "text": "Post-Clone Wars"}, {"tag": "p", "text": "As the Clone Wars ended with the Republic, restructured into the Galactic Empire, victorious, Geonosis remained under Imperial control. Geonosian Gizor Dellso and several other Geonosians formed a Separatist holdout during the aftermath of the Mission to Mustafar, but the organization was dissolved during the Battle of Mustafar. Geonosian scientists and slaves also played a role in the construction of the Death Star, and the Death Star's test bed was once moved temporarily to Geonosis. During the Galactic Civil War, Geonosian scientists set up a bio-lab on Yavin 4.[source?]"}, {"tag": "p", "text": "At some point after Geonosis was made a testing center for the Death Star, the StarSpeeder 1000 transport, SF 1401, exited hyperspace to deliver a Rebel agent to the Rebel Alliance, near Geonosis. However, the Imperials and Boba Fett ambushed them, which eventually cumulated in a dogfight in the interior of the Death Star before escaping to the Home One."}, {"tag": "p", "text": "Geonosians and Rebels fought side-by-side in the Subjugation of Geonosis. The Geonosians were primarily used for slave labor by the Empire. However, in 0 BBY, a Geonosian revolt was instigated by Rebel forces, who had built a secret base on Geonosis. Darth Vader, leading an invasion force, was sent to crush the revolt in what became the Subjugation of Geonosis. Although the Geonosians and the Rebels, fighting side by side, put up a good deal of resistance, the Imperials emerged victorious in the end, destroying all present Rebel operatives, and killing the revolting Geonosians and destroying their homes."}, {"tag": "p", "text": "As the Clone Wars ended and the Republic transformed into the Empire, Geonosis began to be under Imperial control in 19 BBY. Later, the former clone trooper X2 rescued a squad of Rebel spies from an Imperial base on Geonosis. In 3 ABY, while chasing an Imperial carrier that had interfered with the Rebel Alliance's raid on the Empire's operations on Bakura, Wedge Antilles visited Geonosis and found several completely operational B1-Series battle droids left over from the war, as well as a Jedi starfighter, which he used to escape the planet. Soon after, the droid operations were put down by the Galactic Empire, which ultimately brought an official end to the Geonosian Separatist holdouts. During that battle, three Imperial escort carriers ended up being destroyed. Sarkli took cover from the battle droids in a crashed, but working, LAAT/i. The surviving stormtroopers were killed by the battle droids. After the death of Emperor Palpatine, Geonosis established an isolationist policy. This would explain the lack of activity the Geonosians would play in future galactic affairs.[source?]"}, {"tag": "p", "text": "The planet was spared by the Yuuzhan Vong during their invasion."}, {"tag": "p", "text": "Around the time of the Second Galactic Civil War, Boba Fett returned to Geonosis to exhume his father's remains and bury them next to his daughter, Ailyn Vel, on Mandalore."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The concept of a rock planet in the Star Wars saga could be traced back to early story ideas for The Empire Strikes Back. In a story conference, George Lucas had named the concept planet \"Ttaz.\" He described it as a \"Rock planet with cavemen\"."}, {"tag": "p", "text": "Geonosis made its first appearance in Star Wars: Episode II Attack of the Clones and related material. Season Two of Star Wars: The Clone Wars contains a story arc about the Republic recapture of Geonosis."}, {"tag": "p", "text": "Geonosis is the only planet featured in the Star Wars films to have a natural ring system. In the novel Wild Space, it is mentioned that Geonosis was an arid planet whose \"moist green beauty [was] long burned away\", possibly meaning that sometime in its history Geonosis was a more habitable planet."}, {"tag": "p", "text": "The Geonosian rings serve as a location for multiple Versus Mode matches in Star Wars: Rogue Squadron III: Rebel Strike."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}