{"url": "George_Alec_Effinger", "categories": ["Category:Real-world articles", "Category:Short story authors"], "nodes": [{"tag": "h1", "text": "George Alec Effinger"}, {"tag": "p", "text": "George Alec Effinger (January 10, 1947 – April 27, 2002) was an American science-fiction author, who wrote The Great God Quay: The Tale of Barada and the Weequays."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "He was a part of the Clarion class of 1970 and had three stories in the first Clarion anthology. His first published story was \"The Eight-Thirty to Nine Slot\" in Fantastic in 1971. During his early period, he also published under a variety of pseudonyms."}, {"tag": "p", "text": "His first novel, What Entropy Means to Me (1972), was nominated for the Nebula Award. He achieved his greatest success with the trilogy of Marîd Audran novels set in a 21st century Middle East, with cybernetic implants and modules allowing individuals to change their personalities or bodies. The novels are in fact set in a thinly veiled version of the French Quarter of New Orleans, telling the fictionalized stories of the transvestites and other people Effinger knew in the bars of that city. The three published novels were When Gravity Fails (1987), A Fire in the Sun (1989), and The Exile Kiss (1991). He began a fourth Budayeen novel, Word of Night, but completed only the first two chapters. Those two chapters were reprinted in the anthology Budayeen Nights (2003), which has all of Effinger's short material from the Marîd Audran setting."}, {"tag": "p", "text": "His novelette, \"Schrödinger's Kitten\" (1988), received both the Hugo and the Nebula Award, as well as the Japanese Seiun Award. A collection of stories was published posthumously in 2005 entitled George Alec Effinger Live! From Planet Earth and includes the complete stories Effinger wrote under the pseudonym \"O. Niemand\" and many of Effinger's best-known stories. Each O. Niemand story is a pastiche in the voice of a different major American writer, all set on the asteroid city of Springfield."}, {"tag": "p", "text": "Other stories he wrote were the series of Maureen (Muffy) Birnbaum parodies, which placed a preppy into a variety of science fictional, fantasy, and horror scenarios."}, {"tag": "p", "text": "Throughout his life, Effinger suffered from health problems. These resulted in enormous medical bills which he was unable to pay, resulting in a declaration of bankruptcy. Because Louisiana's system of law descends from the Napoleonic Code rather than English Common Law, the possibility existed that copyrights to Effinger's works and characters might revert to his creditors, in this case the hospital. However, no representative of the hospital showed up at the bankruptcy hearing, and Effinger regained the rights to all his intellectual property."}, {"tag": "p", "text": "Effinger met his first wife, Diana, in the 1960s. He was married from the mid-1970s to the mid-1980s to artist Beverly K. Effinger, and for a few years shortly before his death to fellow science-fiction author Barbara Hambly."}, {"tag": "p", "text": "Effinger died in New Orleans, Louisiana."}, {"tag": "h2", "text": "Star Wars bibliography"}, {"tag": "h2", "text": "External links"}]}