{"url": "George_Lucas", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Real-world articles", "Category:Semi-protected articles", "Category:Move protected articles", "Category:Articles in need of major additions", "Category:Incomplete lists", "Category:Directors", "Category:Movie screenwriters", "Category:Producers", "Category:Star Wars voice actors", "Category:Star Wars: Episode III Revenge of the Sith actors", "Category:TV screenwriters"], "nodes": [{"tag": "h1", "text": "George Lucas"}, {"tag": "p", "text": "George Walton Lucas, Jr. (born May 14, 1944) is an American film writer, director, editor, and producer. The creator of Star Wars, he executive-produced its original trilogy and the prequel trilogy. Close friends with fellow filmmakers Steven Spielberg and Francis Ford Coppola, George Lucas worked on the Indiana Jones franchise with Spielberg after meeting him through his own directoral debut, THX 1138, and the films The Rain People and Apocalypse Now, directed by Coppola. With the latter's backing, Lucas made American Graffiti, and subsequently relied on its success to create Star Wars. Although it suffered significant setbacks and failed to achieve what Lucas wanted, the film was an immense success. George Lucas thus continued to tell his mythology, producing the third saga film in 1983."}, {"tag": "p", "text": "However, Lucas was then divorced by his wife, Marcia, and was left with a three-year-old daughter. Lucas thus decided to prioritize raising his family, leaving his company, Lucasfilm Ltd., to manage the popular Star Wars franchise. In the 1980s, filming technology developed under Lucasfilm's Industrial Light & Magic division, whose employee John Knoll co-created Photoshop and whose computer division spawned EditDroid and Avid and developed into Pixar. George Lucas also became close acquaintances with mythologist Joseph Campbell, often speaking with his \"Yoda\" at Skywalker Ranch up until Campbell's death. In the 1990s, Lucas resumed active participation in the film industry, working on The Young Indiana Jones Chronicles and joining fellow film directors such as Martin Scorsese, Woody Allen, Clint Eastwood, and Stanley Kubrick alongside Spielberg, and Coppola on the Film Foundation's board of directors. Lucas also founded Edutopia, an education organization, and continued to push the boundaries of filmmaking technology to create the Special Editions. Faced with a decision to either go back to directing films that are more pure cinema and more visually-oriented and possibly never return to Star Wars, or to finish Star Wars by telling the backstory, which was never intended to be done, was not written as a movie, and yet was now a feasible project with new technology. From the late 1990s to 2005, Lucas returned with much of the film crew from The Young Indiana Jones Chronicles to complete the Star Wars saga with the prequel trilogy, where he would be able to tell the story of Darth Vader, as intended at first with the original trilogy, without any frustrations with technology."}, {"tag": "p", "text": "After working on Star Wars: The Clone Wars television series with Dave Filoni, George Lucas desired to return to experimental films, and sold Lucasfilm to The Walt Disney Company in 2012 to prevent risking the company's financial standing and the livelihoods of his employees. Following his remarriage and having another daughter in 2013, Lucas spearheaded the development of the Lucas Museum of Narrative Art, which is being constructed in Los Angeles, California."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "George Walton Lucas Jr. was born in Modesto, California to George Walton Lucas, Sr. (1913–1991) and Dorothy Ellinore Bomberger Lucas on May 14, 1944. His father was mainly of British and Swiss-German heritage, and his mother was a member of a prominent Modesto family (one of her cousins is the mother of former U.S. Secretary of Agriculture and director of UNICEF Ann Veneman) and was mainly of German and Scots-Irish heritage."}, {"tag": "h3", "text": "American Zoetrope and Star Wars"}, {"tag": "p", "text": "Lucas co-founded the studio American Zoetrope with Francis Ford Coppola—whom he met during his internship at Warner Brothers—hoping to create a liberating environment for filmmakers to direct outside the perceived oppressive control of the Hollywood studio system. Following the success of American Graffiti, Lucas proposed a new Flash Gordon film adaptation, but the rights were not available. Under the American Zoetrope banner Lucas developed Apocalypse Now to direct following work on Star Wars. As work on Star Wars dragged on, Coppola took over directing Apocalypse Now, leading to the breakdown of the American Zoetrope partnership."}, {"tag": "p", "text": "In 1976, Lucas published a novelization of A New Hope, which was initially (like the film) titled just Star Wars. Although Lucas was credited as author of the book, it was later revealed that the book was actually ghostwritten by Alan Dean Foster, who would also write Splinter of the Mind's Eye, the first original Star Wars novel and, in many respects, the first Star Wars sequel."}, {"tag": "p", "text": "On a return-on-investment basis, Star Wars proved to be one of the most successful films of all time. During the filming of Star Wars, Lucas waived his up-front fee as director and negotiated to own the licensing rights—rights which the studio thought were nearly worthless. This decision earned him hundreds of millions of dollars, as he was able to directly profit from all the licensed derived products created for the franchise. In 2006 Forbes Magazine estimated Lucas's personal wealth at U.S. $3.5 billion. In 2005 Forbes.com estimated the lifetime revenue generated by the Star Wars franchise at nearly $20 billion."}, {"tag": "p", "text": "Some considered Star Wars to be the first \"high concept\" film, while others feel the first was Steven Spielberg's Jaws, released two years prior. In fact, Lucas and Spielberg had been acquaintances for some time and eventually worked together on several films, notably the first Indiana Jones, Raiders of the Lost Ark, in 1981. Along with Spielberg, Lucas is credited with (and even blamed for) establishing the blockbuster approach to filmmaking."}, {"tag": "p", "text": "The Directors Guild of America fined Lucas for refusing to have a standard title sequence in his Star Wars films. After paying the fine, he quit the guild. This made it hard for him to find a director for some of his later projects. According to some, he wanted his friend Spielberg to direct some of the later Star Wars movies, but as a member of the guild Spielberg may have been unable to do so. Other directors Lucas pursued to aid him were David Lynch and David Cronenberg, both of whom declined."}, {"tag": "h3", "text": "Return to Star Wars"}, {"tag": "p", "text": "On October 3, 1994, Lucas started to write the three Star Wars prequels, and on November 1 that year, he left the day-to-day operations of his filmmaking business and started a sabbatical to finish the prequels."}, {"tag": "p", "text": "At some point, he wanted to produce a TV series about Star Wars, which would take place between episodes III and IV. Lucas purportedly also announced that he plans on making two additional Star Wars films that will take place after Return of the Jedi, but this rumor was debunked at Celebration IV in Los Angeles, California, in May 2007. When Stephen J. Sansweet, Director of Content Management and Head of Fan Relations at Lucasfilm, was asked about the proposed two films post–Return of the Jedi, he stated that it was a misunderstanding of what Lucas was explaining. According to Sansweet, Lucas was referring to the two Star Wars television projects then in production: Star Wars: Clone Wars, which is a CG animated show that debuted October 3, 2008, and a yet-to-be-titled Star Wars live-action show that was set to premiere in 2009, the development status of which is currently uncertain."}, {"tag": "h3", "text": "Semi-retirement"}, {"tag": "p", "text": "Seeing that his personal projects, amongst them the film Red Tails, which had an all-black cast, costed Lucasfilm significant amounts of money, George Lucas decided to sell the company in order to negate the risk that his thousands of employees would become jobless. Thus, and having a history with The Walt Disney Company and its CEO, Bob Iger, Lucasfilm was sold by Lucas as a Disney subsidiary."}, {"tag": "p", "text": "After the Disney acquisition of Lucasfilm, the company's animation department produced the film Strange Magic, which was released in early 2015. Based on a story developed by George Lucas for over fifteen years, Strange Magic was Lucas' feminine counterpart to Star Wars."}, {"tag": "p", "text": "George Lucas provided story material for the seventh Star Wars saga film, which was released on December 18, 2015, titled Star Wars: Episode VII The Force Awakens. Disney, however, ultimately chose not to use Lucas's story ideas in the final film. In interviews regarding the matter, Lucas stated that Disney wanted to make something for the fans instead. George Lucas further said that most people did not know that Star Wars is a soap opera—a saga of family problems, not spaceships. Nevertheless, Lucas concluded by saying \"fine…I'll go my way and I let them go their way.\""}, {"tag": "p", "text": "George Lucas directed a scene between Alden Ehrenreich and Emilia Clarke in the 2018 film Solo: A Star Wars Story, which was directed by Ron Howard. Lucas also directed a scene between Clarke and Kit Harington in the first episode of the television series Game of Thrones's Season 8, released in early 2019."}, {"tag": "h3", "text": "Innovations in film"}, {"tag": "p", "text": "Besides his directorial and production work on movies, Lucas is one of the most significant contemporary contributors to modern movie technology. In 1975 Lucas established Industrial Light & Magic (ILM) in Van Nuys, California, which was responsible for the invention of the special computer-assisted camera crane \"Dykstraflex\" that was used for most of the space fight sequences in the Star Wars movies (technology which was later adopted by most other visual effects production units, such as those responsible for Battlestar Galactica and Star Trek: The Next Generation). Through ILM, Lucas spurred the further development of computer graphics, film laser scanners, and the earliest use of 3D computer character animation in a film, Young Sherlock Holmes. Lucas sold his early computer development unit to Steve Jobs in 1988, which was renamed Pixar. Lucas is also responsible for the modern sound systems found in many movie theaters. Though Lucas didn't invent THX, he is responsible for its development."}, {"tag": "p", "text": "Lucas spearheaded digital photography for movies. Though personal digital photography is now mainstream, most movie studios still use traditional cameras and film for movie production. Lucas departed from this model by filming Star Wars: Episode II Attack of the Clones completely digitally. He showed the result to a select audience of the Hollywood elite, before the movie's general release. For the presentation, Lucas used a special digital projection system. The attendees said the movie had the clearest and sharpest presentation they had ever seen."}, {"tag": "h3", "text": "Recognition"}, {"tag": "p", "text": "Lucas was nominated for the Best Directing and Writing Academy Awards for Star Wars."}, {"tag": "p", "text": "The American Film Institute awarded Lucas its 2005 Life Achievement Award on June 9, 2005. This was shortly after the release of Star Wars: Episode III Revenge of the Sith, to which he jokingly made reference in his acceptance speech, stating that, since he views the entire Star Wars series as one movie, he could actually receive the award now that he had finally \"gone back and finished the movie.\""}, {"tag": "p", "text": "Today, Lucas is one of the American film industry's most financially successful independent directors/producers, with an estimated net worth of more than five billion dollars."}, {"tag": "h3", "text": "Personal life"}, {"tag": "p", "text": "In 1969, Lucas married film editor Marcia Lou Griffin, who went on to win an Oscar for her editing work on the Star Wars: Episode IV A New Hope. They adopted a daughter, Amanda (b. 1981), before divorcing in 1983. Lucas subsequently adopted two more children as a single parent: daughter Katie (b. 1988) and son Jett (b. 1993)."}, {"tag": "h2", "text": "Foundations of Star Wars"}, {"tag": "h3", "text": "Encapsulation of psychological motifs in mythology"}, {"tag": "h4", "text": "Inspiration"}, {"tag": "p", "text": "George Lucas said that he took social, political, and spiritual issues from the real world and encapsulated all such stories in one single story, Star Wars. Addressing the universal question of \"am I a good person\" in the fundamental conflict between good and evil, George Lucas' Star Wars encompassed the core of all religions and spiritual beliefs from all time and space in the real world, being an \"easy to deal with\" metaphor for what humanity's beliefs are. The Force in Star Wars, an energy field that bound all life and reality together, is the essence of all religions in the real world, and originates from the first beliefs of humankind—life force—which flows through rocks and animals and brings humans to worship them. As Lucas explains, the belief in the Force—in a thing that could explain the unknown that \"has some kind of power over us [humans] and/or that we have power over it\"—stems from the psychological needs of humans that have been put together to in order to form a society."}, {"tag": "p", "text": "Drawing from Lucas' interest in the psychological motifs that underlie the beliefs of the old, which is also known as mythology or \"psychological archaeology,\" as well as his interest in what connects all humans in their interpersonal relationships, Star Wars was constructed mainly from Buhddism and Methodism, the latter being the religion Lucas was brought up in. George Lucas also saw Methodism to be the same as Christianity, Islam, and Judaism—their differences are simply artificial and ultimately superficial contructs; humans distorted their core belief in the Force into different religions for the sake of preserving the existence of their own society."}, {"tag": "p", "text": "Crucially, George Lucas refined his modern fairy tale with the works of comparitive mythologist Joseph Campbell. After nearly dying in a car crash, George Lucas entered a period of self-reflection that led him to the discovery of Campbell. Subsequent to attending an anthropology class by Campbell in college and studying his works, Lucas became interested in mythology because through it, as a form of what he calls \"psychological archaeology,\" he could understand human actions and the psychological underpinnings of what people were thinking—what they feared, what they felt about their parents—their psyche. In studying Campbell, George Lucas made efforts to take the psychological motifs from mythology from across the world and condense them into Star Wars, with his films taking ideas that resonate through \"all societies\" and \"through all the ages\" as a result. With Joseph Campbell's seminal publication, The Hero with a Thousand Faces, Lucas incorporated archetypal characters and the monomyth structure to Star Wars in the aim of bringing the core of humanity to the fore of the modern world using a \"modern fairy tale\"—his new form of mythology. Joseph Campbell later became a close acquaintance of Lucas' after the release of his first Star Wars films. and the filmmaker regarded the mythologist as his \"Yoda,\" his mentor figure."}, {"tag": "p", "text": "George Lucas was also inspired by the mythology of his childhood, including the Western genre of films as well as Alex Raymond's Flash Gordon Saturday night television series. Akira Kurosawa's films, to which Lucas was exposed to in film school, served as key inspiration for the Star Wars films as well. The short film 21-87, a commentary on a machine-dominated society directed by Arthur Lipsett, inspired George Lucas to make the film THX-1138. 21-87 explores happiness and the relation of humans with reality, and was referenced in the form of Cell 21-87 in Lucas' first Star Wars film, A New Hope."}, {"tag": "h4", "text": "Teachings of Joseph Campbell"}, {"tag": "p", "text": "Mythology, as defined by Campbell, is humanity's metaphor for the transcendent; for eternity; for God—a greater power ungraspable by humans. Referencing the Hindu trimurti Sadashiva sculpture of the Elephanta Caves, Campbell states that one enters a field of opposites whenever one moves out of the transcendent, that all things in the field of time is dual. The mythologist lists the opposites past and future, dead and alive, male and female, good and evil, and light and dark as examples of the dichotomous nature of reality as perceived by humanity. However, Joseph Campbell said that most humans put their minds on the side they saw as good, and that one of the problems of life is to live in the realization of the terms good and evil; for one to know the center and for one to know that the two dichotomous terms are simply temporal apparitions. Campbell saw that man's mythology is based on the inside of duality, leading to religions having a tendency to be ethical—sin and atonement, right and wrong. The Bible draws a distinction between God and nature, pitting nature against man and differentiating man from God. The condemnation of nature, Campbell observed, originates from Zarathustra's time and is shared by Islam, yet it is not shared by Shinto, basic Hinduism, or Buddhism. Philosopher Friedrich Nietzsche records his personal characterization of Zarathustra in his novel Thus Spoke Zarathustra, where he posits the Übermensch as a goal for humanity, the eternal recurrence through space and time—which is echoed by the rhyming, recurring motifs in the course of events in Star Wars—and criticizes the dichotomous morality of good and evil. The Japanese culture of being in harmony with nature fascinated Campbell, and acting on instinct and being one with one's instincts, with nature, with the present, with the Living Force, is taught by Jar Jar Binks and subsequently the Jedi Qui-Gon Jinn, as well as Jinn's students Obi-Wan Kenobi and Yoda. The protagonists of Star Wars and their associated locations are dressed in natural colors of green and brown, while the antagonists and their associated locations are dressed in the mechanical black and white, with hints of red that George Lucas associates with evil. Through color, Lucas thus created a rigid world of absolutes for the antagonists as opposed to the natural world the protagonists live in."}, {"tag": "h3", "text": "Love, life, and letting go"}, {"tag": "p", "text": "George Lucas explained one of the the core values of Star Wars, one of the problems of the struggle in Star Wars, is about passion against compassion; which is greed against giving and letting go. Compassion is defined by Lucas as joy, an everlasting emotion attained from being selfless—the light side of the Force—and is one of two components of happiness. Compassion is love, the core of all religions and spiritual traditions, and the Force is the amalgamation of the essence of all such beliefs. All humans have a compassionate side and a selfish side, asserts Lucas, and the main idea is to keep the two in balance by recognizing their coexistance, reject the dominance of selfishness, and be compassionate in order for a person to do good things. In the legal, financial, and political systems of the American society, Lucas sees that they are based on a flawed, \"winner-take-all\" culture that arose from a \"cave-man\" mentality. Instead, Lucas wants a society based on compassion, where every person in society is cared for and everything is done for the best of all of society. Anakin Skywalker lusted for power over all life and thus became evil in his greed—inability to let go of the inevitable death of his lover. As said through Lucas' works, death is a natural part of life, and that which maintains the harmonious, symbiotic relationship between all life and reality—the Force. Skywalker violates the natural order of the Force in choosing to pursue immortality, becoming consumed by his own hatred and selfishness, the dark side. The son, Luke Skywalker, later confronts the father, who pities the self-sacrifice of Luke in affirming his stance as a Jedi in service to the Force and the galaxy and atones for his sins by letting go of himself to fulfill the will of the Force and bring balance to it."}, {"tag": "h2", "text": "Filmography"}, {"tag": "h3", "text": "Feature films"}, {"tag": "h3", "text": "Television"}, {"tag": "h2", "text": "Published works"}, {"tag": "p", "text": "Lucas also served as a producer on the video game Star Wars: The Force Unleashed, and many Expanded Universe and fan productions have one form or another of the credit \"Special thanks to George Lucas.\""}, {"tag": "h2", "text": "Appearances in Star Wars"}, {"tag": "p", "text": "In addition to his cameo role as Baron Papanoida, Lucas has made two Expanded Universe appearances. His name was modified for Egroeg Sacul, a character paged on the Star Tours ride, and his likeness was used for a limited-edition action figure of a character called Jorg Sacul."}, {"tag": "p", "text": "Lucas also appears twice in the Tag & Bink comics. He appears in Tag & Bink: Revenge of the Clone Menace in Dex's Diner and is depicted among the many characters chasing Tag Greenley and Bink Otauna on the back of the Tag & Bink Were Here trade paperback. Lucas also appears in the third part of the Star Wars: X-Wing Rogue Squadron: The Phantom Affair comic."}, {"tag": "p", "text": "On June 5, 2005, Lucas was named the 100th \"Greatest American\" by the Discovery Channel."}, {"tag": "p", "text": "In Star Wars: Episode II Attack of the Clones, a bust of George Lucas is in the Jedi Archives."}, {"tag": "p", "text": "In the non-canon special LEGO Star Wars: The Padawan Menace, George Lucas makes an appearance, where he has to herd Darth Vader off screen after Vader interrupts scenes by inserting himself into them. He eventually tells Vader to get off of the set."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}