{"url": "George_Roubicek", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Wookieepedia former Featured articles", "Category:Star Wars: Episode IV A New Hope actors"], "nodes": [{"tag": "h1", "text": "George Roubicek"}, {"tag": "p", "text": "George Roubicek (born May 25, 1935) is an actor, as well as a dialogue director and script adaptor for English-language versions of foreign films and television shows. Roubicek portrayed Nahdonnis Praji in A New Hope, although his voice was dubbed by a different actor. Prior to that, the Austria-born actor appeared in small film roles throughout the 1950s, '60s and '70s, including parts in The Dirty Dozen (1967) and two James Bond films: You Only Live Twice (1967) and The Spy Who Loved Me (1977). He appeared in The Tomb of the Cybermen, a four-part Doctor Who serial, as well as two episodes of The Avengers, playing different roles each time."}, {"tag": "p", "text": "Although he continued acting in small parts well into the 1990s, Roubicek's later career was more focused on dubbing foreign films and television shows into English-language productions. He directed the dubbing of previously unaired episodes of the cult Japanese series Monkey, as well as such films as Odin: Photon Sailer Starlight (1985), Asterix and the Big Fight (1989), X (1996), Roujin Z (2006) and Azur & Asmar: The Princes' Quest (2008)."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 1976, Roubicek was cast in Star Wars, the first film in the original Star Wars trilogy, where he played the small role of a commander in the Galactic Empire, who was later given the name Nahdonnis Praji. He appeared early in the film, after the Imperial forces seize the Rebel Alliance starship Tantive IV and capture Princess Leia Organa. However, his lines were dubbed by an American actor, so the character's voice did not at all resemble that of Roubicek. He appears in only seventeen seconds of the film, and his role consists of three sentences of dialogue spoken to Darth Vader. Identified in the script only as \"Second Officer,\" the character was not given the name Praji until nearly two decades later with the 1995 release of the Premiere Limited set of Decipher, Inc.'s Star Wars Customizable Card Game. The character's first name, Nahdonnis, was not identified until September 2007, when it was featured in the Star Wars Insider article \"The Empire's Finest: Who's Who in the Imperial Military.\""}, {"tag": "p", "text": "Roubicek's scene was filmed over a three-day period in July 1976, around the final days of principal photography. Roubicek did not anticipate at the time that Star Wars would become such a cultural phenomenon—his first impression of the franchise was wondering what it was \"all about.\" During a 2007 interview, Roubicek indicated that he had had no idea of the cultural impact the Star Wars film would eventually have, nor had he believed anyone else involved quite understood it either. In 2007, three decades after the first theatrical release of Star Wars (later renamed A New Hope) in 1977, Roubicek's image was used for a Commander Praji 12-inch action figure issued by Sideshow Collectibles. In a review of the figure, the designer toy website Plastic and Plush noted the sculpt mostly resembled the actor, but that it was difficult to capture his likeness because he did not have a very distinctive look. Roubicek has participated in and signed autographs at several Star Wars conventions, including Celebration IV in Los Angeles, California in 2007, and Celebration V in Orlando, Florida in 2010."}, {"tag": "h2", "text": "Filmography"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}