{"url": "Gerak_Vurtimis", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Gerak Vurtimis"}, {"tag": "p", "text": "Gerak Vurtimis was a Human male."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During 1 ABY, Gerak Vurtimis resided in Bestine on Tatooine. During his time here, he encountered a spacer, and ranted to him about how nasty the city had become. When the spacer asked what the problem was, Gerak pointed out the various creatures and bandits swarming around town. He expressed concern about his son visiting him in Bestine, feeling as though you had to have a blaster rifle to survive in Bestine. While Bestine was comparatively safer than most other cities on Tatooine, it was still riled with problems. So the spacer told Gerak he would be willing to help with any problems."}, {"tag": "p", "text": "Gerak was happy to hear this, and first tasked the spacer with clearing out the worrt population in Bestine. Given the exploding numbers of worrts in Bestine, clearing them out was no simple task, but the spacer succeeded. Gerak transferred credits to the spacer's account, but still had work for him to accomplish. The next step was to clear out the rills, which were infesting the town. Once again, the spacer succeeded."}, {"tag": "p", "text": "By now, Gerak realized the spacer was quite skilled, and felt he was ready to take on a more serious mission. Gerak explained to the spacer that about a week ago, a gang of thugs ambushed a caravan of people moving to Bestine. Gerak sadly revealed that there were no survivors. The spacer felt terrible about the incident, and wanted to know if there was anything he could do. Gerak explained that at the very least, he could kill the gang members, and retrieve the possessions they had stolen from the caravan. Gerak felt the possessions should be returned to the victim's family's, so that they could at least pay off debts, or remember their lost children. The spacer agreed to help, and was dispatched to the brigand camp, where he killed many gang members. Fortunately, the spacer recovered most of the stolen possessions, and returned them to Gerak."}, {"tag": "p", "text": "However, the brigands were not giving up that easily. Angered by the spacer's attack, the brigands began massing en force. The spacer, feeling they needed to be shoved into hiding, wanted to once again help. Gerak believed that their leader was at the source of this build-up, and that the spacer would need to go to the brigand's other camp to find more information. Fighting his way through the large numbers of brigands guarding the camp, the spacer recovered a datadisk that was believed to have important information on it. The spacer returned the datadisk to Gerak, who took the time to analyze it for information. Fortunately, the datadisk analysis yielded positive results. Gerak discovered the location of the brigand leader, and quickly dispatched the spacer to find him. Though the leader was guarded by a few cronies, the spacer succeeded in eliminating them all."}, {"tag": "p", "text": "The spacer returned to Gerak to deliver the good news. Gerak was thankful, and had no further tasks for the spacer. Though Bestine was still not perfect, he had succeeded in making it just a little safer for his son."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gerak Vurtimis is a Non-Player Character in the MMORPG Star Wars Galaxies. In the game, players may receive a series of quests from him, which involve eliminating various foes from the city of Bestine."}, {"tag": "p", "text": "Although Gerak Vurtimis was consistently generated as a Human male during each server reset, his general appearance was randomized."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}]}