{"url": "Gerevick", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Bounty hunters", "Category:Humanoids", "Category:Individuals of unidentified species", "Category:Males", "Category:Scavengers"], "nodes": [{"tag": "h1", "text": "Gerevick"}, {"tag": "p", "text": "Gerevick was a male Humanoid who earned a living as a salvager and bounty hunter. He was living on the world of Dantooine some five years after the end of the Jedi Civil War. A rough-and-tumble fellow who possessed a violent streak and aloof, superior attitude, he was involved in a number of disturbances around the sole remaining community of colonists, Khoonda."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gerevick, a Humanoid male, was a salvager and a bounty hunter who lived on the planet Dantooine in the year 3951 BBY. When a Jedi exile named Meetra Surik came to the Khoonda Outpost on Dantooine that same year, Gerevick verbally accosted her during her exploration of the outpost's headquarters. She later learned that some residents believed that Gerevick was an assassin; however, he was more interested in acquiring rich salvage from the ruins of the Jedi Enclave, particularly its sublevel, without actually having to perform the necessary work to obtain them. He was involved in a dispute amongst a number of the other salvagers and the Khoonda Militia that revolved around a large cache of relics, which included Jedi artifacts and the possibility of a lightsaber. The controversy began when a group of four such salvagers, hoping to work as a team to better their chances of survival, attempted to penetrate the laigrek-infested Enclave basement. Two of them didn't make it back out; of the ones that made it, however, one died of his wounds shortly thereafter and the other played Gerevick in a game of pazaak for the salvage. After the game the two opponents fought a death-duel, with Gerevick coming out on top. The dispute, according to Militia Captain Zherron, arose from the fact that no one seemed to remember the two actually playing pazaak."}, {"tag": "p", "text": "Gerevick encountered Surik again at the entrance to the sublevels of the Jedi Enclave as she and her companions attempted to leave the mostly-intact ruins. Having heard that she had gone there to seek artifacts. Gerevick, accompanied by a squad of thugs made up of Humans and Nikto, attempted to capture her as well as any artifacts she might have taken. This proved to be his undoing; having underestimated what the former Jedi Knight and her party were capable of, he and his entire party were killed in the brief but violent brawl that followed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gerevick was, generally-speaking, an impulsive and unpleasant man who did not wish to be bothered by anyone. He spoke in a slow, sinisterly calm voice, and was described by Berun Modrul as being very dangerous, a notion that was backed up by the many fights and disagreements in which he was involved in. It seemed to most in the outpost that it was difficult to tell whether or not Gerevick was a salvager or one of the mercenaries working for Azkul, that had camped out on Dantooine near the ruins of the old Rakatan temple."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gerevick first appeared in the 2004 video game Star Wars: Knights of the Old Republic II: The Sith Lords. His dialogue while within the Khoonda outpost differs depending on whether or not Surik manages to hide her status as a Jedi from the populace. However, regardless of the result of that particular sidequest, he eventually finds out about Surik's bounty and tracks her to the sublevel, precipitating the fight that kills him. Although he somewhat resembles a Human, he takes care to address Surik as \"Human,\" and as such, this articles makes no assumption about his species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}