{"url": "Ghadi", "categories": ["Category:Canon articles", "Category:Governors of the Galactic Empire", "Category:Humans", "Category:Males", "Category:Moffs of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Ghadi"}, {"tag": "p", "text": "Ghadi was a human male who was an Imperial Moff, governor of the Tangenine sector in the Core Worlds. He had a bitter rivalry with Grand Moff Wilhuff Tarkin and tended towards paranoia regarding his position and personal interests. When the Lothalite senator Domus Renking tried to send falsified data in a data card to Moff Ghadi, Ghadi instead blackmailed Renking's aide Arihnda Pryce. Ghadi also disliked the Chiss Imperial Navy officer Thrawn and sought to lure his aide Ensign Eli Vanto away through his aide Culper."}, {"tag": "p", "text": "After smugglers disrupted his mining operations and gain access to his financial records, Moff Ghadi attempted to coerce Pryce into spying on her new employers, the Higher Skies Advocacy Group. Seeking to break free of Moff Ghadi, Pryce tempted him with Higher Skies' stolen files on his rival Tarkin. Coveting power and prestige, Ghadi demanded the stolen data, which Pryce obliged. However, Pryce exposed his opportunism to Grand Moff Tarkin in return for immunity."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A human male, Moff Ghadi served as Imperial Sector Governor of the important Core World Tangenine sector, and held a high position of power and influence within the Imperial hegemony, with at least one contact planted within the Imperial Security Bureau. He had a suite on the 5,000th floor of the upmarket Alisandre Hotel in Coruscant's prestigious Federal District."}, {"tag": "h3", "text": "Blackmailing Pryce"}, {"tag": "p", "text": "In an attempt to defraud Moff Ghadi, the Lothalite Senator Domus Renking dispatched his aide Arihnda Pryce to pass a data card containing false data to Ghadi. Per Renking's instructions, Pryce told Ghadi to slot the card into his secure datapad inside his suite at the hotel. However, Ghadi checked the card and ascertained that it was storing fake data."}, {"tag": "p", "text": "Returning to his living room, Moff Ghadi passed a different card to Pryce. When Pryce noticed the card was different, he remarked that it was a shame she hadn't simply taken the wrong card back to Renking. He then sprayed her with a bottle of polstine spice, an illegal spice punishable by life imprisonment. After exposing Renking's fraud, Ghadi ordered her to bring the new card to back to her employer Renking. He threatened to turn her into the authorities if she refused."}, {"tag": "p", "text": "Following Ghadi's instructions, Pryce returned the data card to Senator Renking's office data slot. As a result, Senator Renking's office was placed under investigation for financial irregularities. Due to a cut in funding, the Lothalian senator was forced to close down several of his citizen assistance offices. Scapegoating Pryce for his own debacle, Renking sacked Pryce; earning the enmity of the latter."}, {"tag": "h3", "text": "Tempting Vanto"}, {"tag": "p", "text": "At around the same time, Ghadi used his aide, Culper, to approach Eli Vanto and offer him a position with a local Inner Rim security force so as to isolate and undermine Thrawn. Ghadi disliked the alien officer and blamed Thrawn for not preventing insurgents from stealing hundreds of thousands of credits worth of tibanna gas during the Dromedar incident. After Vanto saw through the ploy and rejected the offer, Ghadi used his influence to block Vanto from being promoted, leaving him an ensign for a long period of time."}, {"tag": "h3", "text": "Reunion with Pryce"}, {"tag": "p", "text": "Moff Ghadi also hired a bodyguard named Ottlis Dos, who was supplied by the Yinchom Dojo, which specialized in training bodyguards for Imperial government officials and senators. One of the dojo's instructors Juahir Madras recruited bodyguards to spy on their employers, gathering information for her friend Driller MarDapp in the Higher Skies Advocacy Group; which was a front for the insurgent Nightswan's spy ring on Coruscant. Using this information, Nightswan's operatives disrupted Moff Ghadi's mining operations and obtained some of his confidential financial information."}, {"tag": "p", "text": "Ottlis Dos subsequently became a double agent who supplied Ghadi with information about Higher Skies' operations. Believing that Higher Skies was working behind the scenes for one of his enemies, Ghadi got Ottlis, who had befriended Pryce, to arrange a meeting with Pryce; who now worked for Higher Skies as their mining expert. Under the pretext of offering combat training, Ottlis led Pryce into Moff Ghadi's office."}, {"tag": "p", "text": "Using his past leverage over Pryce, Ghadi blackmailed her into spying on the organization in order to find out who was attacking his mining interests. Under Ghadi's instructions, Pryce contacted her boss Driller. Based on the conversation, Ghadi and Pryce ascertained that Driller had not been responsible for the recent attacks on Ghadi's mining activities. Threatening to blackmail Pryce for stealing documents if she refused to cooperate, Ghadi instructed Pryce to spy on Higher Skies. He instructed her to copy all of Higher Skies' files, report on all their conversations, and make lists of all their contacts."}, {"tag": "h3", "text": "Coveting power"}, {"tag": "p", "text": "Though Pryce complied with Moff Ghadi's orders, she sought to break free of the Moff's grasp. Pryce secretly met with Commander Thrawn and copied Higher Skies' files and records into a neat package. At the advice of Commander Thrawn, Pryce agreed to spy on both Higher Skies and Moff Ghadi for the Imperial Security Bureau and to exploit Ghadi's jealousy of his rival Grand Moff Wilhuff Tarkin."}, {"tag": "p", "text": "Complying with Thrawn's advice, Pryce learned that Higher Skies had an encrypted file on Tarkin. Telling Ghadi about her discovery, Pryce offered to copy them. Seeking to dig dirt on his rival, Ghadi instructed Pryce to download the files onto a data card and to bring it to his Whitehawk Tower address. In secret, Pryce recorded Ghadi's conversation as evidence against him."}, {"tag": "p", "text": "After Driller managed to arrange a meeting between Pryce and Grand Moff Tarkin, Pryce revealed Higher Skies' espionage activities and Moff Ghadi's willingness to use Higher Skies' stolen files on Tarkin to gain advantage over the Grand Moff. She also provided Tarkin with Higher Skies' stolen file on Tarkin as well as her secret recording of Moff Ghadi. This allowed Tarkin\nto politically undermine Ghadi's position and to initiate a crackdown against Higher Skies. In return for services, Pryce convinced Tarkin to appoint her as Governor of Lothal and to promote Eli Vanto; undoing Ghadi's attempt to sabotage the latter's career."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Moff Ghadi was an ageing human male with white hair. As an astute political player, Ghadi realized that Senator Renking was trying to lower his guard by sending his female aide Arihnda Pryce to deliver a data card containing false data. Ghadi was willing to play dirty including threatening to frame Arihnda Pryce for drug possession if she refused to comply with his instructions. Ghadi had a dim opinion of the Lothalian Senator Domus Renking, regarding him as insipid."}, {"tag": "p", "text": "Ghadi also harbored xenophobic feelings towards the Chiss Imperial Officer Thrawn, unfairly blaming him for the insurgents escaping with stolen tibanna during the Dromedar incident. Moff Ghadi also sought to protect his business interests and took offense that someone was leaking information on his financial records and mining operations to insurgents. In order to protect his business interests, Ghadi was willing to use threats to coerce Pryce into spying on her employers Higher Skies."}, {"tag": "p", "text": "Pryce was however able to exploit Ghadi's ambitions and jealousy of Grand Moff Tarkin by offering him data on the Grand Moff which Higher Skies had obtained through espionage. Ghadi's desire to gain an advantage over Tarkin made him willing to break the law by accepting stolen information. Pryce turned the tables on the unscrupulous Ghadi by exposing his opportunism to Grand Moff Tarkin, currying his favor in the process."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Moff Ghadi first appeared as a secondary antagonist in Timothy Zahn's 2017 novel Thrawn, a rebooted Canonical origins story of the eponymous character. Most of his lines are told through the point of view of the tritagonist Arihnda Pryce."}, {"tag": "p", "text": "He was first illustrated in the Marvel Comics Thrawn 3, a comic adaptation of the novel which debuted on April 11, 2018. Ghadi was drawn and inked by Luke Ross, and colored by Nolan Woodard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}