{"url": "Ghest/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Aquatic creatures", "Category:Creatures of Rodia", "Category:Non-sentient species", "Category:Oviparous species", "Category:Predatory creatures", "Category:Reptiles", "Category:Swamp creatures"], "nodes": [{"tag": "h1", "text": "Ghest"}, {"tag": "p", "text": "Ghests, also known as swamp demons, were a large reptilian species native to the swamps of the planet Rodia. Instead of bone, the species had cartilaginous skeletons. The sentient Rodians, who feared the predators because they sometimes attacked entire primitive Rodian villages, originally believed ghests to be responsible for carrying away the souls of the dead. Ghests hunted by swimming slowly along the surface of the water and lashing out at their prey, usually large herbivores, often swallowing them in one bite. When mating, ghests performed a courtship ritual that proved their strength to the partner. A ghest mother guarded her young after reproduction, as the sire would simply eat them on sight."}, {"tag": "p", "text": "As Rodian culture developed, the ghest population diminished both as a result of hunting, particularly by those Rodians known as ghestslayers, and the industrialization of Rodia's environment. By the time the Galactic Republic made contact with Rodia, the predators were nearly extinct. In an attempt to save the species, some wealthy Rodians attempted to introduce ghest populations onto other worlds. A ghest attacked the crew of the New Republic CR90 corvette FarStar on the planet Danoor in 8 ABY."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Ghests were a non-sentient species of predatory reptile with cartilaginous skeletons. They possessed a pair of bulbous, featureless eyes and a maw full of razor-sharp teeth surrounded by a patch of bumpy, differently shaded skin. Their head was located at the end of a long, slender body, which was, on average, six meters in length. They possessed slick skin, a tail, and four relatively thin limbs: two forelimbs and two larger hindlimbs, all ending in four thick, clawed digits. Where the forelimbs attached to the body beneath the head, the skin was particularly wrinkled. The species had two sexes and reproduced sexually; indeed, the females could even extract and use sperm from dead male members of the species. Once fertilized, a female laid hundreds of eggs. These eggs developed into juvenile ghests, which appeared as much smaller versions of their parents. Juveniles grew into a pre-adult stage before reaching full maturity."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Ghests lived in the swamps and bayous of their homeworld of Rodia, where they usually hunted large species of herbivore. They could walk on their hind limbs while on land but hunted and mated while submerged in water. Ghests swam slowly when hunting, keeping all but their eyes and forehead submerged below the surface until they spotted prey. Upon seeing a target, a ghest sprang forward, attacked with teeth and claws, and generally consumed the prey in a single bite. However, it was not unknown for ghests to attack small settlements belonging to the sentient Rodian species, also native to Rodia; during some such attacks, the ghest devoured all residents within a few hours. The ghests had no natural predators on Rodia, although Rodians did sometimes hunt them."}, {"tag": "p", "text": "When mating, ghests performed a courtship ritual that was a mixture of dance and combat. Both ghests involved tried to prove they were of equal strength to the other, as only individuals of matching prowess made suitable mates. Behavioral zoologists hypothesized that the fighting was at least partially due to each ghest's urge to stop other ghests from reproducing, which conflicted with their own desire to mate. Female ghests generally fought harder than males, and if a female killed her partner, she could still extract his sperm and reproduce. If a female died in a fight, though, no reproduction could take place. After mating, the pair split apart and moved away from each other at top speed due to a natural instinct to prevent the male from meeting and devouring his offspring. Alone, the female laid her eggs in a small pool and then protected them while they developed. Upon hatching, juvenile ghests fed on each other, ensuring only the strongest survived to the pre-adult stage. Those that lived then buried themselves in mud to hide from their mother, who would consume any juvenile ghests she saw outside the pool in the event that it was not one of her own offspring. Once all of the ghests in a pool were dead or hidden, the mother lost interest and departed. At that point, the pre-adults were free to emerge safely and leave."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early development of the Rodian species, ghests stood above the sentient Rodians in the food chain, as Rodians could not match the predators in size or ferocity. Due to the danger ghests posed over the centuries of the Rodians' early history, the predators came to hold an important place in Rodian myths and legends. Rodians sometimes knew ghests as swamp demons, and ancient Rodians believed that ghests captured the spirits of the dead; thus, sightings of the species were considered bad omens. Killing a ghest was believed to remove a curse, such as a drought or famine, so groups of male Rodians sometimes banded together to ritually hunt down a ghest and kill it. As Rodians could not physically compete with the beasts, they instead outsmarted them, eventually developing weapons and tools that could be used to stake out areas of jungle and defend them from ghests and other predators."}, {"tag": "p", "text": "As Rodian culture developed, much of the folklore surrounding the ghest was diminished, but they were still often used as demons in Rodian Theater, with an entire genre named \"Ghest\" focusing on the ancient attacks on Rodian villages. Hunting ghests became more common as Rodian civilization developed, and some Rodians came to work as ghestslayers; the ghestslayer Kalon Lenitor was considered legendary. Due to such hunting and the industrialization of Rodia, ghests slowly became less common in their natural habitat as the Rodians became more advanced. By the time that scouts from the Galactic Republic first discovered Rodia and introduced the Rodians to space travel, the ghests were on the verge of extinction. To combat the decline of the ghest population on their homeworld, some wealthy Rodians attempted to introduce populations of juvenile ghests to other planets, where they might survive. During the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire, the Rodian Entukan Yesosko was the leading actress in ghest plays."}, {"tag": "h2", "text": "Ghests in the galaxy"}, {"tag": "p", "text": "The Trandoshan hunter Qyzen Fess, who lived during the Cold War between the Republic and the Sith Empire, hunted several ghests during his career. Over three thousand years later, by 8 ABY, at least one ghest had been transplanted to the planet Danoor in the Kathol Outback region of the galaxy. The ghest lived in the murky rainwater that filled a series of durasteel tunnels once used as an irrigation system for farmland but abandoned after the city of Eror Zeen was built on the fields. At one point, the creature attacked several crew members of the New Republic CR90 corvette FarStar while they were making their way through the tunnels with the navigator Makezh. Also during the New Republic's reign, the big-game hunter War'qi claimed to have fought a ghest on Rodia using a BlasTech Firearc49 Speargun, an experience he supposedly enjoyed. The claim was included as a note posted on an entry for the weapon in an arms datalog created by the Corellian arms dealer known as Gundark."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ghests were first mentioned in Creatures of the Galaxy, a sourcebook released in 1994 for West End Games' Star Wars: The Roleplaying Game. Ghests were first designed by Peter Venters, who created the illustration shown in the book, which was then given to writer Chuck Truett so he could create the creature's backstory and rules based on the image. Ghests also made an appearance in The Kathol Outback adventure Galaxy's Edge, released in 1996, in which one was illustrated by Dan Day and David Day. In the adventure, a ghest attacks the players, although they are left with the decision of whether to kill it or simply escape from it, with no preferred method indicated."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}