{"url": "Ghorman_Massacre/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Battles of Ghorman", "Category:Battles of the early Imperial campaigns", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Ghorman Massacre"}, {"tag": "p", "text": "The Ghorman Massacre was an incident committed by Captain Wilhuff Tarkin, c. 18 BBY."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the Declaration of a New Order, the galaxy was ruled with absolute power by Emperor Palpatine. Many people of the new Empire enthusiastically supported the vision outlined in the Declaration of a New Order, largely due to the violence that had plagued the galaxy for so long. Many senators wholeheartedly supported the new government."}, {"tag": "p", "text": "But the Empire's policy became increasingly despotic in nature. Non-Humans and women were excluded from much of this New Order, and atrocities committed by powerful regional governors became common. Peaceful demonstrations were organized against the Empire's policies throughout the galaxy."}, {"tag": "h2", "text": "The Massacre"}, {"tag": "p", "text": "A group of activists were protesting Imperial taxation on the planet Ghorman in the Sern sector. Captain Wilhuff Tarkin's warship was blocked by peaceful protesters who stood on the ship's landing pad and refused to move. With implied permission from Palpatine, Tarkin landed the ship right on the protesters. An overwhelming majority were killed instantly, while hundreds were severely injured, many of them later dying from the resulting injuries. Only a lucky few escaped the ordeal with their lives intact, but almost all sustained horrific psychological damage."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The members of the former Delegation of 2000 were prompted by the tragedy to begin plotting open rebellion against the Empire, culminating in the formation of the Alliance to Restore the Republic seventeen years later. For the Empire's opponents, no incident better encapsulated Imperial cruelty until the Destruction of Alderaan."}, {"tag": "p", "text": "The massacre was commemorated every year on its anniversary by citizens throughout the galaxy."}, {"tag": "p", "text": "The Alliance later named a Corellian gunship, the Ghorman's Honor, after the massacre's victims. Among the battles the Ghorman's Honor participated in was the Battle of Endor, which led to the downfall of the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}