{"url": "Ghost_(clone_trooper)", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Confederacy of Independent Systems individuals"], "nodes": [{"tag": "h1", "text": "Ghost  (clone trooper)"}, {"tag": "p", "text": "Ghost was a male clone trooper in the Grand Army of the Republic. In 22 BBY, seeking a life away from the war, he joined a plot by the Galactic Republic Commander Griebs Kishpaugh to defect to the Confederacy of Independent Systems. Together, they attempted to pay for their defection by causing the planet of Oznek to erupt in warfare, but their plan was foiled by Sergeant Banks, who killed Ghost for his treachery."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Ghost was a male Human clone trooper, bred on Kamino for the Galactic Republic. When the Clone Wars broke out in 22 BBY, Ghost was one of millions of clones who made up the Republic's Grand Army of the Republic, though he differentiated himself by painting his armor with blue designs on the shoulders and helmet and growing a beard. He suffered a wound at some point, and had a long scar over his right eye, and the back of his helmet was damaged as well. Ghost was one of the eldest clones in the army, and already considered himself to be growing old by some point in the first year of the war. He grew weary with a life of war, and was no longer willing to sacrifice himself for the Republic."}, {"tag": "h3", "text": "Mission to Oznek"}, {"tag": "p", "text": "Later in 22 BBY, Ghost partnered with Commander Griebs Kishpaugh, who also wished to leave the Republic. The two contacted the Confederacy of Independent Systems and were told the price of their escape—the CIS wanted the planet of Oznek, a world that would allow them to conquer the surrounding sector. Ghost and Kishpaugh put together a mission to Oznek and assembled a squad of clone troopers under the command of Sergeant Banks, a \"shiny\" clone on his first mission who they both believed would follow their orders without question."}, {"tag": "p", "text": "Soon, the squad was flying over the forests of Oznek aboard a Low Altitude Assault Transport, on a seemingly routine reconnaissance mission. One of the other clones, Syke, mocked their new sergeant for cleaning his armor and weapons, which Ghost found amusing. Banks admonished Syke for his behavior, threatening him with being forced to write an in-depth report on regulation protocols. Shortly after that, their ship came under heavy fire. The area was supposed to be unoccupied by Confederate forces, but they discovered a large droid army, which blasted them out of the sky. This was the first of many intelligence falsifications that Ghost and Kishpaugh forced upon Ghost's teammates."}, {"tag": "p", "text": "The LAAT crashed, killing the pilot and several other clones on impact. Syke escaped from the wreckage via a hatch, only to find hundreds of B1 and B2 battle droids bearing down on them. Wielding his blaster rifle, Ghost and the other clones fought off the attacking droids while trying to protect their wounded and burying their dead. Eventually, the waves of unending droids ceased, and the remaining seven clones covered their tracks by detonating a thermal detonator. Setting up camp in the woods, Syke attempted to repair and use a communications array to no avail. After Crazy Legs asked and Syke urged him on, Banks then demonstrated the origin of his nickname— an unusual ability to calculate angles and bank his blaster bolts off of objects without losing their strength and still hitting his target. They were then contacted via holoprojector by Commander Kishpaugh after Syke managed to get the array working. Kishpaugh informed them that there was a droid command center twenty kilometers away, and that they were to secure it despite their losses. He then ordered Ghost and the rest of the clone troopers from the shelter, speaking with Banks alone."}, {"tag": "p", "text": "Ghost and the others moved out before sunrise, leaving Crazy Legs behind, as he'd broken one of his legs in the crash. They moved through the forest, encountering dangerous terrain and creatures everywhere, and lost another clone, who was eaten by an animal. As they traveled, Syke told a war story from early in the conflict, then asked Ghost for a story of his own, noting a point of damage on the back of Ghost's helmet, but the older clone demurred. Cutter, leading the way, then brought the others' attention to an ancient city in ruins. The clones remarked that their scanners hadn't picked up any trace of the large settlement—another one of Kishpaugh's deceptions—and suddenly found themselves surrounded by Toma, the native sentient species of Oznek. With their hands bound, the clones readied themselves for death after the Toma's leader ordered their executions, but were discovered and attacked by droids once again. Banks asked the Toma to cut their binds so they could fight together, and the Toma did so. Ghost and the others picked up their weapons and held back the droids, but Cutter realized that Banks had to complete their mission. He told the sergeant to take Ghost and Syke, while he and the other surviving clone trooper held off the droids. Banks said that he wouldn't leave Cutter behind, but when Cutter pointed out that the Toma couldn't be allowed to live either, Ghost and the others fled."}, {"tag": "p", "text": "They made their way to the facility that Kishpaugh had targeted, and once there Ghost sniped the two guards outside, allowing them to sneak inside. They made their way through the corridors, encountering little resistance, which Banks would later remark that they should have found suspicious. Once inside the main part of the facility, Banks ordered Syke and Ghost to spread out and look for signs of Separatist technology. Syke quickly noticed that something was awry, and that the facility didn't look anything like what they were told it would be. Ghost immediately shot Syke in the back."}, {"tag": "p", "text": "Banks was shocked, and Ghost nonchalantly told him that Syke had to die because he didn't know of their true orders, and that they were to destroy the facility, not secure it. The building was not a droid command center at all, but rather a power plant. Banks continued to question Ghost, saying that he wanted to help stop wars, not start them. Ghost whirled around and fired his blaster rifle at Banks, saying that he didn't need him after all. Bank fell backward, the blast bolt grazing his helmet across the visor. Banks attempted to shoot Ghost using his \"banking\" ability, but the elder clone had already slipped out of sight. Banks wanted to know why Ghost would betray his training and brothers, asking if his mind had gone defective from age, but Ghost told him that he had merely gained clarity and no longer wished to die."}, {"tag": "p", "text": "Banks sneaked up on Ghost, but Ghost was ready and threw a grenade at the sergeant, which detonated right in front of him. Battered and wounded, Banks was still alive, but Ghost was not willing to let him survive. As he explained that their sabotage would drive Oznek into the arms of the Separatists, he climbed atop Banks and pulled a garrote from his gauntlet and began to choke Banks with it. Banks managed to grab his blaster, however, and fired, ricocheted around the turbines and slamming into the back of Ghost's head, killing him."}, {"tag": "p", "text": "Banks then deactivated Ghost's bombs and wore his painted helmet as he contacted Kishpaugh, claiming the mission was completed. When Kishpaugh picked him up in a shuttle, he realized Banks wasn't Ghost, but it was too late. The clone overpowered the commander and arrested him. Though Banks faced a military tribunal, they found no issue with his actions, and he was reassigned to a new unit under the command of Jedi General Bultar Swan."}, {"tag": "h2", "text": "Appearances"}]}