{"url": "Ghostling", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Ghostlings", "Category:Inner Rim species"], "nodes": [{"tag": "h1", "text": "Ghostling"}, {"tag": "p", "text": "Ghostlings were a species of ethereal humanoids indigenous to the planet Datar. While mostly Human-like in anatomy, Ghostlings had key differences from that species. The Ghostlings' shiny, tan-colored skin radiated an aura of light. Their lower limbs ended in five-toed feet that gave the species a tip-toe posture. Because they were accustomed to the low gravity of their homeworld, Ghostlings were quickly overexerted on planets with higher gravitational pull. They were easily injured in such conditions, with a mere touch enough to cause a bruise and with even a slight blow potentially proving fatal."}, {"tag": "p", "text": "They lived in villages made up of nests, which hung from creeper vines in Datar's forests of bayah trees. There the Ghostlings defended themselves from intruders with simple weapons and traps. Nevertheless, they were often troubled by slavers, especially during the latter years of the Galactic Republic. In that time period, Ghostling children were sought after as pets or slaves by individuals who valued the Ghostlings for their extreme beauty and rarity. Indeed, in 32 BBY, Gardulla the Hutt bought a cargo of Ghostling children from the Dug Podracer pilot Sebulba so that she could place them in her personal pleasure garden. The children, among whom was Princess Arawynne, were freed by the Human slave boy Anakin Skywalker and his friends. Ghostlings and Humans found each other mutually fascinating and attractive. However, due to the fragile structure of the Ghostlings, sexual relations between the two species inevitably proved fatal to the Ghostling partner."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Ghostlings were sentient humanoids who largely resembled Humans but for their faun-like characteristics and otherworldly beauty. Their bodies featured two arms, two legs, and a head. Iridescent, tan-colored skin covered the thin and delicate frame and emitted a soft glow. Their wiry bodies were adapted to the light gravity of their homeworld, Datar. Each limb terminated in five digits; their fine fingertips were topped by gold-colored fingernails, and their feet were designed such that they always walked digitigrade with a quick and nimble gait. Ghostlings were less surefooted in heavier-gravity environments, which they found cumbersome and tiring. Running was especially difficult and caused a Ghostling to be winded quickly. Ghostling children were especially susceptible to the ill-effects of higher gravity, which made respiration difficult and fatigued them unless they lay prone."}, {"tag": "p", "text": "The Ghostling head featured a nose, mouth, and two sparkling, wide eyes, which came in shades of blue, violet, green, and black. Their ears lay flat against the skull, narrowing to pointed tips. The species' hair grew long and fine from the top of the head, curling in some specimens, and surrounding the head like an aura. Ghostlings sported locks of greenish-gold, silver, or black. Their eyesight and hearing were keen, although their intelligence was otherwise not exceptional."}, {"tag": "p", "text": "The Ghostling species was divided into both male and female sexes, who reproduced by sexual intercourse. Their young were still considered juveniles at eight standard years. Members of the species seemed to radiate a faultless beauty that species as diverse as Bothans, Dugs, and Sakiyans found inspiring. Fear was one of the few things that could mar a Ghostling's beauty by flushing the face of color. Humans especially found Ghostlings sexually attractive. However, members of the low-gravity species were extremely fragile. Merely touching a Ghostling could leave a purple bruise, and striking one with a light blow might break a bone. Thus, sexual intercourse with a Human was certain to cause the Ghostling partner's death. Members of the species required food and water to live, and lack of nourishment caused the stomach to rumble. Ghostlings were diurnal creatures, sleeping at night."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Ghostlings were native to the planet Datar, where they lived in villages made up of several nests. The nests were immense bowl-shaped structures woven from creeper vines that hung from the native bayah trees. A mouth on each such dwelling afforded its inhabitants entry and egress. While some Ghostlings placed their nests about two meters from the ground, others chose to nest high in the trees. Ghostlings were expert weavers, able to fashion objects not only from vines but also from reeds. Their arboreal homes made them expert climbers."}, {"tag": "p", "text": "Ghostling parents inhabited the same nest as their children. The young learned the location of their nest well enough to find it easily even after nightfall. Ghostling mothers sang lullabies to put their children to sleep."}, {"tag": "p", "text": "While members of the species were not known for their martial prowess, they defended their settlements with simple weapons and traps. For instance, Ghostlings knew how to place trip wires to keep away intruders, and how to lay pit traps lined with pointed sticks. Ghostling warriors fired small bows and arrows, hurled native fauna known as blaze bugs, or fired small stun blasters at enemies. Blaze bugs were also repurposed as natural light sources."}, {"tag": "p", "text": "Ghostlings were capable of speaking Basic. They otherwise communicated through gestures and involuntary actions, such as crying when distraught. Ghostling toddlers were prone to suck their fingers. Names found among the species included the female name Arawynne, the male names Borofir, Conno, and Coniel, as well as the name Alamar. Princess was a recognized rank in Ghostling society; such individuals were considered leaders among their people. Appropriate garb for a Ghostling princess included an elaborate dress, a shawl, and a belt, all embellished with jewels."}, {"tag": "p", "text": "Despite the two species' sexual incompatibility, Ghostlings found Humans mesmerizing. Their natural beauty made Ghostlings experts at seduction as well. They knew of the Jedi and respected the members of its Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Ghostlings evolved on Datar, a low-gravity world in the Inner Rim, where the forests encouraged them to develop into expert climbers with keen eyes and ears, and a tip-toe posture. The planet became part of the known galaxy at some point between 15,000 to 8000 BBY."}, {"tag": "p", "text": "By 1004 BBY, the Ghostling homeworld fell within the confines of the Galactic Republic, and Datar was allied with that government by 32 BBY. The Ghostlings had become highly desired commodities in the galactic slave trade, however, so Ghostling settlements on their homeworld were susceptible to raids by outsiders. In 32 BBY, for example, the Sakiyan bounty hunter Djas Puhr and his Abyssin partner, Gondry, on orders from their employer, the Dug Podracer Sebulba, invaded a Ghostling village, evaded the inhabitants' attempts to fight them off, and kidnapped a group of Ghostling children. Among those they abducted was the seven-year-old Princess Arawynne."}, {"tag": "p", "text": "When the Clone Wars broke out in 22 BBY, the Ghostlings sided with the Republic. After the rise of the Galactic Empire and the eruption of the Galactic Civil War, Datar hosted a Rebel Alliance base. In 0 BBY, however, Imperial forces conquered the installation in a Pyrrhic victory. The species found themselves in Imperial Space in 8 ABY, and their homeworld formed part of the Imperial Grand Admiral Thrawn's core territories during his campaign against the New Republic in 9 ABY. Circa 25 ABY, the Ghostling home system had a population of one to ten million. By 137 ABY, their planet was within the bounds of Darth Krayt's Sith Empire."}, {"tag": "h2", "text": "Ghostlings in the galaxy"}, {"tag": "p", "text": "By the latter years of the Galactic Republic, Ghostlings were highly valuable as slaves and pets due to their exotic looks and rarity. However, they were hard for slavers to come by, which made them expensive when they came to market. For instance, a typical Ghostling sold for 30,000 wupiupi at the time—still less than rarer species, such as Columi, but three times the going rate for a Bothan."}, {"tag": "p", "text": "After kidnapping the Ghostling Princess Arawynne and other Ghostling children, Djas Puhr and Gondry brought their captives to the planet Tatooine, where their boss, Sebulba, was preparing for the Boonta Eve Classic of 32 BBY. The crate holding the Ghostlings came to the attention of the enslaved Human children Anakin Skywalker, Kitster Banai, and Amee, as well as their Rodian companion W. Wald and Twi'lek friend Pala Kwi'teksa. Skywalker vowed to free the children before Sebulba could implant slave transmitters within the Ghostlings, devices that exploded should a slave run away. Meanwhile, Arawynne, eldest of the group of captured Ghostlings at seven years of age, assumed a leadership position and consoled her younger companions, who included Alamar, three-year-old Borofir, five-year-old Conno, and three-year-old Coniel."}, {"tag": "p", "text": "Sebulba sold the Ghostlings to Gardulla the Hutt, who wanted them to act as living lawn ornaments—and prey for roving carnivores—in the underground pleasure garden of her palace on the outskirts of Mos Espa. Skywalker and his companions, now joined by the Bothan Dorn, infiltrated the compound and freed the captives, using the unimplanted slave trackers as bombs to blast their way out of the palace on Arawynne's suggestion. Tatooine's standard gravity impeded their escape, however, so Banai led them into the pleasure garden to hide until he and his friends could bring help. Arawynne hid the children in the garden's forests, which were similar to those of Datar. There she befriended the Ho'Din gardeners and the Wisties Gardulla had imprisoned there. The Ghostlings learned how to avoid the dangers of the pleasure garden as well as how to turn the hostile terrain to their advantage. They wove themselves a hideaway from reeds and set up simple traps to ward off intruders."}, {"tag": "p", "text": "When Skywalker and his accomplices returned to mount a rescue, the smaller Ghostling children sneaked into the fan control room and turned off the exhaust ports to allow the group to escape through the pleasure garden's ventilation system. With Wisties acting as lookouts, Arawynne confronted Djas Puhr in a forested area, leading him into a pit trap with the scouting help of a Wistie companion. Nevertheless, at the last moment, Sebulba appeared in the desert outside the group's intended exit vent and forced the Ghostlings to retreat into Djas's clutches. An enraged Gardulla scheduled the group for execution in the Mos Espa Grand Arena. However, Skywalker escaped, sneaked into the arena's holding cells, freed the children, and led them outside. Using a stolen landspeeder, Skywalker flew the freed Ghostlings to a formation called Bantha Rock, and, with money he and his friends had collected, he paid the Human smuggler Rakir Banai to transport the Ghostlings away from Tatooine."}, {"tag": "p", "text": "In 14 ABY, a female Ghostling gave up a life of seducing Humans to become a devotee of the extra-dimensional being Waru. She confronted the Corellian smuggler Han Solo at Crseih Station to preach about her faith, although Solo dismissed her with the assumption that she was soliciting him for sex—which he knew would kill her. The Ghostling admitted his assumption would have been correct in the past, but that Waru had shown her a new way of life."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Vonda N. McIntyre introduced the Ghostling species in her 1994 novel, The Crystal Star, which established the species' basic physical appearance, extreme beauty, and sexual attraction to Humans. Both Stephen J. Sansweet's Star Wars Encyclopedia and Bill Slavicsek's A Guide to the Star Wars Universe, Third Edition, Revised and Expanded, published in 1998 and 2000, respectively, include entries for the species that draws from McIntyre's novel. Author Dave Wolverton largely ignored the seductive aspects of the species and instead emphasized the Ghostlings' ethereal beauty in his young-adult novels and game books published in 2000 as part of the Episode I Adventures series. The Complete Star Wars Encyclopedia, published in 2008, incorporates material from both McIntyre's and Wolverton's works. In one entry, that for the Ghostling Borofir, the book claims that Gardulla the Hutt intended to sell her Ghostling captives on the Mos Espa slave market. As this differs significantly from the plot of the young-adult novels, the encyclopedia seems to be in error."}, {"tag": "p", "text": "The game book for Episode I Adventures 8: Trouble on Tatooine allows readers to take on the role of several different characters, including the Ghostling Princess Arawynne, as that character crawls through the sand tunnels under the Mos Espa Grand Arena to free the Ghostling children before they are executed. However, the novel version of the story attributes this deed to Anakin Skywalker, as does The Official Star Wars Fact File 12, thus indicating that only the selection of Skywalker reflects the official events of the Star Wars Legends continuity. Trouble on Tatooine also includes a card that features an illustration of Arawynne, the first graphical depiction of the species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}