{"url": "Ghosts_of_Kashyyyk,_Part_3", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "Ghosts of Kashyyyk, Part 3"}, {"tag": "p", "text": "\"Ghosts of Kashyyyk, Part 3\" is an comic story featuring Chewbacca helping defend Kashyyyk from a First Order attack. The story was written by John Barber, illustrated by Derek Charm, and published on Star Wars Adventures 29 on December 18, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "During the First Order blockade of Kashyyyk, Daz Crano flew over the Black Forest in her X-wing starfighter, hoping of locating Chewbacca. Her porg then pointed out something it noticed in the forest. Crano reported to Beaumont Kin was leading a ground team in the search but he did not believe that the porg had spotted Chewbacca and ordered Crano to continue the search."}, {"tag": "p", "text": "At a First Order encampment, Wookiees were being held captive in large glass cells. The stormtrooper commander ordered a pair of his stormtroopers to go look for SN-1208 who had not returned back to the encampment."}, {"tag": "p", "text": "The stormtroopers patrolled the river bank when they encountered Terbus the porg. Realizing it wasn't the scary Wookiee they thought they were looking for, one of the stormtroopers, BT-9093 began to chase after the porg. They both tripped and fell down a mudslide and were tossed into the raging river. Chewbacca looked down from a tree and Trebus was happy to help."}, {"tag": "p", "text": "More waves of stormtroopers were sent after the duo but each time Chewbacca and Trebus used the land to their advantage and defeated each stormtrooper. The commander had enough of Chewbacca's games and ordered for the perimeter around the encampment to be secured. He then ordered for his troopers to hold out until the First Order Navy came to pick them up, then they would take the Wookiees with them. But then Trebus tripped the alarm and the stormtroopers raced towards them. But the commander knew it was a trick and went the to the Wookiee prisoners."}, {"tag": "p", "text": "Chewbacca was attempting to free the prisoners but the commander stopped him. He planned to send Chewbacca with the rest of the Wookiees to mine on Jabiim. But Chewbacca was not done yet. As the commander was speaking, Trebus went behind him and ate the wire that controlled the prison cell the Wookiees were in. The angry Wookiees attacked the stormtroopers as the Resistance ground team arrived. Kin gave Chewbacca his bowcaster and he fought off the commander into the forest. A group of porgs then attacked the commander."}, {"tag": "p", "text": "Later on, everyone returned and celebrated their victory. They thanked Chewbacca for being brave and saving the Wookiees but they knew their fight was not over and were ready to fight on every planet to stop the First Order. As long as they did it together."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}