{"url": "Ghosts_of_the_Sith", "categories": ["Category:Real-world articles", "Category:Short story stubs", "Category:Articles that need plot summary", "Category:Legends short stories from Star Wars Insider", "Category:Star Wars: The Official Magazine articles"], "nodes": [{"tag": "h1", "text": "Ghosts of the Sith"}, {"tag": "p", "text": "Ghosts of the Sith is a short story appearing in Star Wars Insider 88 and Star Wars: The Official Magazine 65. It is written by Jude Watson and illustrated by Linh Ngo. It details a visit to Korriban by Ferus Olin."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Ferus Olin flies a star cruiser through a debris field. Beyond the debris field lies Ferus' destination: Korriban, the home planet of the ancient Sith Order. Ferus could sense the dark side around him. He feels like an outside force is drawing him to the planet, though he had made the decision to come on his own."}, {"tag": "p", "text": "Though Ferus had trained under Siri Tachi, he had left the Jedi Order before completing his training. Ferus was not truly a Jedi. Although he was able to feel the Force, he had difficulties accessing it. Now he was on his way to Coruscant to investigate a rumored imprisoned Jedi. Along the way he decided to stop at Korriban for fuel—something had called him there."}, {"tag": "p", "text": "Trever Flume, a boy of thirteen who is traveling with him, approaches Ferus and notes his unease about the planet, saying that the clouds are \"the color of pain.\""}, {"tag": "p", "text": "Ferus lands the ship at the Dreshdae spaceport. An Imperial officer informs them that Dreshdae only allowed emergency fuelling and that they must stay by their ship. Ferus assesses his surroundings. He feels dark-side energy coursing through the air. Ghosts of the Sith whisper to Ferus and tempt him, saying they can teach him the ways of the Force."}, {"tag": "p", "text": "Ferus notices that the structure of the hanger somehow reverses the origin of sounds—he hears a voice behind him, yet a woman appears a short distance away in front of him. She tells a nearby Imperial officer that she wished to go to the Valley of the Sith. Her name is Jenna Zan Arbor, a scientist who would cure societies of diseases only to expose them to a virus and save them again. She would charge more money the second time. She obsessed over learning about the Force."}, {"tag": "p", "text": "Ferus wants to stay to follow her—and he is convinced that he could outsmart the ghosts of the Sith—but he knows he would only be staying for his own reasons. He is very tempted: the ghosts of the Sith dangle prospects of power in front of him."}, {"tag": "p", "text": "Trever calls out his name, disrupting Ferus' thoughts. Ferus focuses his energy and fights against the temptation of the dark side. Jenna Zan Arbor abruptly turns around and looks at him. Ferus and Trever turn and board their cruiser."}, {"tag": "p", "text": "In the seconds he spends waiting for clearance, Ferus realizes how tempted he had been to stay. The dark side had effectively exploited his weakness and offered him power. Ignoring a \"Contact Ground Control\" signal, Ferus takes off and speeds away from the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}