{"url": "Ghosts_of_Kashyyyk,_Part_2", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "Ghosts of Kashyyyk, Part 2"}, {"tag": "p", "text": "\"Ghosts of Kashyyyk, Part 2\" is a comic story featuring Chewbacca helping defend Kashyyyk from a First Order attack. The story was written by John Barber, illustrated by Derek Charm, and published on Star Wars Adventures 28 on November 27, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the planet Kashyyyk during the First Order blockade of the planet, Resistance operatives Beaumont Kin and Daz Crano were deliberating on how to locate Chewbacca in the Black Forest. Kin had noted that Chewbacca had ran off into the forest when a fellow Wookiee whispered to him. Kin believed that Chewbacca knew what he was doing and he knew how to take care of himself."}, {"tag": "p", "text": "Out in the Black Forest, Chewbacca and the porg, Terbus were hiding from the First Order stormtroopers looking for them. As they were moving around, Trebus stepped on a stick, alerting the stormtroopers to their location. Chewbacca hid from them, trying to cover Trebus's mouth from screaming. Realizing he had no choice, Chewbacca made a run for it as the stormtroopers opened fire on him. A stormtrooper tracked him down on a 125-Z treadspeeder bike but Chewbacca threw him off the speeder bike and drove it himself. Another stormtrooper on a speeder bike charged right at the Wookiee but Chewbacca abandoned the speeder before they collided into each other."}, {"tag": "p", "text": "The Resistance began its search for Chewbacca with Crano searching in her X-wing starfighter and Kin leading a search team. Kin translated the Shyriiwook that the Wookiees spoke and discovered that Chewbacca was indeed looking for something important in the forest. Nien Nunb then located Chewbacca's bowcaster on the ground and the group realized that Chewbacca was in more trouble than previously believed."}, {"tag": "p", "text": "Back in the Black Forest, Chewbacca and Trebus hid underneath a wrecked walker as the stormtroopers searched all around for them. When he had the chance, Chewbacca climbed up a Wroshyr tree to see where the stormtroopers were going. Nearby, stormtroopers were rounding up enslaved Wookiees and taking them incase the First ORder could not hold it's blockade. This angered Chewbacca who planned to rescue them. But then Crano flew overhead in her X-wing. Chewbacca and Trebus called out to her but she did not see them and kept flying by. Chewbacca realized that he would have to take matters into his own hands, so he jumped from the tree and took out the stormtroopers near him. He then looked down at Trebus who saluted him, willing to help in the cause."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}