{"url": "Gideon%27s_Imperial_remnant", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Pages needing citation", "Category:Imperial remnants", "Category:Members of Gideon's Imperial remnant"], "nodes": [{"tag": "h1", "text": "Gideon's Imperial remnant"}, {"tag": "p", "text": "A remnant of the fallen Galactic Empire led by Moff Gideon was active in the galaxy's Outer Rim Territories during the time of the New Republic. Around the year 9 ABY, the Imperial holdout came into contact with Din Djarin, a Mandalorian bounty hunter whom \"the Client\" hired on Nevarro to locate and retrieve an asset named Grogu."}, {"tag": "p", "text": "Although the Mandalorian delivered Grogu to the Client, he later had a change of heart and rescued Grogu. The Imperial remnant subsequently occupied the local town but was driven off when Djarin returned and joined forces with Greef Karga, Carasynthia Dune, Kuiil, and IG-11, defeating Moff Gideon in the process. Gideon survived his defeat, however, and regrouped with his fleet in space, from where he continued to seek Grogu, still in the care of the Mandalorian, to use him as part of an ongoing series of experiments being conducted by his remnant."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "For a period of time following the end of the Galactic Republic, the Galactic Empire reigned over the galaxy, enforcing Emperor Sheev Palpatine's rule with an iron fist through a massive technological military force. However, the Alliance to Restore the Republic rebelled in the Galactic Civil War and achieved a series of decisive victories, culminating at the Battle of Endor in 4 ABY, where the Emperor was killed alongside his chief enforcer, Darth Vader, and the second planet-destroying Death Star battle station was destroyed. Without a leader to keep the Empire united, the remnants of the Empire began to fracture into Imperial holdouts. However, across space, Imperial Moffs and regional governors still had control over their sectors, star systems, and planets,[source?] while Imperial fleets and armies remained scattered across the galaxy. In wake of the chaos after Endor, Moffs and regional governors began vying for power and jockeying against each other for position and control in the power vacuum left behind by Emperor Palpatine's death."}, {"tag": "p", "text": "The Imperial Military was unable to be reined in, but after the Battle of Jakku, the Imperial armed forces were shattered, and the Empire formally surrendered to the New Republic, the government established by the Rebel Alliance. The weakened Empire signed a truce and peace treaty with the emboldened New Republic, ending the Galactic Civil War and dissolving the Galactic Empire. Nevertheless, remnants of the Empire continued to persist in the form of Imperial holdouts, fragments of the former regime which gained footholds on distant worlds, after the Empire's collapse. Former Imperials became warlords while remnant stormtroopers dissolved into mercenary bands in service to the ex-Imperial warlords. One such Imperial remnant was led by Moff Gideon, a former officer in the Imperial Security Bureau during the Mandalorian Great Purge, who formed his faction out of the remains of the Imperial Army and Imperial Navy to achieve his ends."}, {"tag": "h3", "text": "Post-Empire"}, {"tag": "p", "text": "By 9 ABY, during the New Republic Era, Moff Gideon's Imperial remnant had clandestinely established operations on the Outer Rim planet Nevarro, including a facility in the local town and a restarted Imperial base on another side of the planet. Gideon further commanded a fleet and Imperial scientists and engineers like Doctor Pershing. On Nevarro, Gideon used an ex-Imperial, \"the Client,\" and his stormtrooper guards as fronts for his operation. The Bounty Hunters' Guild also maintained a presence on Nevarro, where former magistrate Greef Karga acted as an expeditor for the guild, running the bounty hunting trade in the sector from Nevarro."}, {"tag": "h3", "text": "The hunt"}, {"tag": "p", "text": "As part of a series of ongoing experiments involving blood transfusions overseen by Doctor Pershing, Gideon and his forces sought to acquire a mysterious Force-sensitive alien youngling known as Grogu. Gideon used the force of the remains of the Imperial Army to acquire it. Around 9 ABY, the Client hired a Mandalorian bounty hunter named Din Djarin, having been sent by Karga, to locate and acquire a highly valuable \"asset\" on Arvala-7. In return, the Client offered Djarin a substantial reward in the form of beskar, a metal alloy traditionally used to forge ancestral Mandalorian armor which the Empire had stolen from Mandalore as spoils of the Purge. Aside from the age of the asset, which was approximately fifty years old, the Client offered little else to help the Mandalorian. Nevertheless, he was confident that such a highly skilled and expensive warrior would complete the task."}, {"tag": "p", "text": "After returning from Arvala-7, the Mandalorian fulfilled his commission by handing over the asset, which he had discovered to be Grogu, to the Client and Dr. Pershing. Once the Mandalorian was gone, the Client and Pershing argued about the infant, with the Client demanding he simply remove the material that they needed from Grogu even if the procedure resulted in his death. Pershing refused, reminding the Client that they had orders to deliver him alive, after which the Client warned Pershing that his safety was no longer assured. Soon after, the Mandalorian returned to rescue Grogu, having had a change of heart, resulting in a firefight with the remnant stormtroopers. Though outnumbered, the Mandalorian defeated the troopers and ultimately escaped from the facility with Grogu"}, {"tag": "h3", "text": "Coaxing the Mandalorian"}, {"tag": "p", "text": "Following the theft of Grogu, the Client and his forces installed a renewed Imperial authority across the city on Nevarro. A number of bounty hunters tried and failed to recapture the Child, and so a plan was put in place for Karga to lure the Djarin back to the planet to kill him in order to free Nevarro from the Imperial presence. However, after Grogu saved Karga's life, Karga killed his accompanying bounty hunters and sided with the Mandalorian and his allies, Cara Dune and Kuiil."}, {"tag": "p", "text": "Planning to kill the Client instead, Karga and Dune escorted a handcuffed Djarin through the city with a decoy of Grogu, eventually reaching the cantina. Upon arriving, the Client expressed his admiration of the Mandalorian's new armor and questioned him as to why Mandalore had resisted Imperial expansion, claiming that the Empire improved every system it touched. Their discussion was interrupted when the Client was contacted by Moff Gideon via hologram, who then ordered a squad of death troopers outside to fire on the cantina, killing the Client and his stormtrooper guards. Gideon then flew down beside the cantina in an Outland TIE fighter, backed by his death trooper guard and the rest of his stormtrooper battalion. Meanwhile, scout troopers were able to track down and retake Grogu, killing his guardian, Kuiil."}, {"tag": "h3", "text": "Skirmish on Nevarro"}, {"tag": "p", "text": "At the cantina, Gideon began talking across to the Djarin, Karga and Dune from outside, emphasizing Grogu's importance to him. He gave the three until nightfall to surrender, threatening to use an E-Web heavy repeating blaster cannon on them if they failed to do so. At the same time, the scout troopers who had acquired Grogu rendezvoused near the city. They listened in on transmissions as Gideon killed one of his officers out of anger. The pair were suddenly approached by the bounty hunter droid IG-11, which Kuiil had reprogrammed for nursing and protection. In the ensuing confrontation, the droid neutralized both scout troopers and then took Grogu with him on one of their 74-Z speeder bikes."}, {"tag": "p", "text": "IG-11 rode into Nevarro city on the seized speeder bike, carrying Grogu in a bag hanging over his front and shooting nearby stormtroopers he passed. When the droid reached the clearing next to the cantina where Djarin and his comrades were pinned down, IG-11 jumped off of the speeder bike, allowing it to crash into the stormtroopers and Death troopers ahead. As IG-11 proceeded to fight his many adversaries, Djarin, Dune and Karga joined the battle, killing many troopers in the firefight. As Djarin used the E-Web blaster cannon to mow down more stormtroopers, Gideon arrived, and shot an explosive object near the Mandalorian, injuring him. Subsequently, IG-11 and the rest of Djarin's comrades helped him back inside the cantina under fire. Gideon ordered an incinerator trooper to burn the cantina with Djarin and the others inside. However, Grogu used the Force to turn the fire back to the trooper, killing him."}, {"tag": "p", "text": "Djarin's group then retreated into the sewers and visited a covert. By the time stormtroopers arrived at the enclave, Djarin and his comrades had left, leaving The Armorer, who fought and defeated the troopers. Another group of stormtroopers awaited Djarin's group at the end of a tunnel. IG-11, though, self-destructed to defeat the squad. As the rest of the group left the tunnel, they were attacked by Gideon in his Outland TIE fighter. Djarin chased the TIE with his jetpack and planted a detonator on it, damaging it and causing it to crash. With Gideon defeated, Djarin parted ways with Dune and Karga and departed Nevarro with Grogu."}, {"tag": "h3", "text": "Skirmish on Trask"}, {"tag": "p", "text": "After successfully helping a passenger and her eggs reach Trask and reunite with her husband, Djarin was recruited by Bo-Katan Kryze, Axe Woves, and Koska Reeves to help them raid a Gozanti-class Assault Carrier belonging to the remnant in order to capture some weapons being exported from the black market port. The quartet of Mandalorians fought through several units of stormtroopers to reach the cargo hold."}, {"tag": "p", "text": "The quartet were temporarily stopped by a remnant officer who trapped them in the cargo control area. The officer and a group of stormtroopers that accompanied him in defending the hold were jettisoned. After Kryze revealed to the captain that he had captured the cargo hold, the captain stated that even if they jettisoned the crates of cargo, they would comb the area and kill them. Kryze revealed that her true objective was to fully capture the ship and storm the bridge even to the distraught and shock of Djarin. Djarin eventually agreed to help Kryze storm the bridge and fully capture the ship, in return Kyrze would reveal the whereabouts of a Jedi."}, {"tag": "p", "text": "The captain of the Gozanti contacted Gideon informing him of pirates who previously raided their past shipments, he informed him of the loss of the cargo hold and requested reinforcements. This only prompted Gideon to order the captain to scuttle the ship via the phrase \"Long live the Empire,\" he proceeded to kill his own bridge personnel and personally piloted the ship to scuttle into the ocean of Trask."}, {"tag": "p", "text": "With the Gozanti on a crash course with the ocean, the quartet of Mandalorians were slowed down by the suppressive fire of stormtroopers armed with heavy repeating blasters with the altitude of the ship dropping, Djarin drew two grenades and ran at the stormtroopers while being covered by the others. After heavy fire and falling to the group, Djarin hurled the two grenades at the stormtroopers killing them."}, {"tag": "p", "text": "Upon reaching the bridge, Djarin and Koska piloted the ship away from the ocean and Bo-Katan interrogated the captain, asking if Gideon had the Darksaber. The captain informed her that she should already have known of this by asking the question. Kyrze threatened to keep him alive but the captain simply stated that while she would let him live, Gideon would not. He killed himself via an electric suicide pill killing him instantly."}, {"tag": "p", "text": "After Kyrze revealed the location of the Jedi at the city of Calodan on the forest planet Corvus. Djarin and the Mandalorians parted ways, with Bo-Katan, Woves, and Reeves maintaining control of the captured cruiser."}, {"tag": "h3", "text": "Capturing the Child"}, {"tag": "p", "text": "At one point, Gideon received a hologram message from Dr. Pershing, who was apologizing to him for failing an experiment involving the Child and Strand-Casts. He also reported that he had exhausted their supply of Grogu's blood samples, and that he required more genetic material from the donor in order to continue his work."}, {"tag": "p", "text": "Three days later, Djarin went back to Nevarro in need of repairs and was recruited by Karga, Dune, and a Mythrol to join them on their own mission to destroy the Imperial base. As the four undertook the mission, a Mimbanesse worker and placed a tracking device on Djarin's ship. At the base, Djarin and the others viewed the hologram of Pershing and realized that the Imperials were performing experiments, hence their pursuit of Grogu. The worker later contacted a comms officer on Gideon's light cruiser informing her that the tracking device had been planted. The officer subsequently informed Gideon, who smiled to himself and continued to supervise the work of his scientists on his dark troopers."}, {"tag": "p", "text": "Gideon's forces tracked Djarin's ship to Tython. From high atmosphere, two Imperial transports carrying stormtroopers launched from Gideon's light cruiser. As the stormtroopers did battle with Djarin and his allies, Boba Fett and Fennec Shand, four dark troopers were readied and launched from the cruiser and landed near the seeing stone where Grogu had been meditating. There, one of the dark troopers seized Grogu and flew upwards back to the cruiser with the other three dark troopers while Fett pursued them from his ship. Upon seeing the cruiser, Fett remarked in disbelief that the Empire was back. Once the dark troopers returned to the cruiser with the captured child, Gideon's cruiser jumped to hyperspace, though not before blasting Djarin's grounded ship, the Razor Crest, destroying it. While still in hyperspace, Gideon briefly talked to the child in his prison cell, walking in on the child attacking two stormtroopers. Letting Grogu tire himself out battling the two troopers, Gideon showed Grogu the Darksaber before having his stormtroopers stun him and place him in shackles. Gideon then ordered his comms officer to send an encrypted message to Doctor Pershing informing him that they had their donor for his experiments once they exited hyperspace."}, {"tag": "p", "text": "Din Djarin and his crew infiltrated Gideon's cruiser, and they split, Bo-Katan searching for Gideon, and Djarin searching for the child. Gideon was prepared, and tried to trick the Mandalorian to lower his guard with promises of returning the Child, claiming to no longer need him, having already taken his blood. He attempted to strike at Djarin from behind, and proceeded to battle the Mandalorian, who fought back with his Beskar spear. Gideon was defeated, and Djarin brought him to Bo-Katan, and tried to return the Darksaber to her. Gideon laughed, knowing that she could not take the saber without winning it through combat. Then the dark troopers, which Djarin had ejected into space, returned via their rocket boosters. Confident that everyone besides himself will be killed by the dark troopers, he did not anticipate the arrival of Luke Skywalker. After watching the Jedi destroy the dark troopers, Gideon tried to eliminate the child, and then kill himself. He failed to do both and was knocked unconscious."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "Formed from the Empire's disbanded armed forces, the Imperial remnant inherited assets from it and used them as a well established military force to achieve its objectives. They had the capability to occupy and maintain order on Nevarro and maintained at least one battalion. The remnant's frontline infantry were comprised of stormtroopers, scout troopers, at least one incinerator trooper, and one Mortar Stormtrooper. Local stormtroopers on Nevarro were of lower class and quality, merely serving as bodyguards for important high ranking Imperial officials or to maintain the occupation of Nevarro city. Additionally, the remnant led by Moff Gideon utilized elite death troopers, which formed a guard unit protecting Gideon, as well as dark troopers. Imperial officers also served within the remnant, serving in various capacities including captaining a starship, acting as security officers, deck officers, pilots,, communications officers and gunnery officers."}, {"tag": "p", "text": "Weapons used by the remnant included the typical E-11 blaster rifle, SE-14r light repeating blaster, E-22 double barrel blaster rifle, or the DLT-19 heavy blaster rifle. Scout troopers used the EC-17 hold-out blaster, and death troopers used the E-11D blaster carbine. They also used E-Web heavy repeating blaster cannons."}, {"tag": "p", "text": "Furthermore, Imperial forces were bolstered by armored units including a K79-S80 Imperial Troop Transport, at least three 74-Z speeder bikes in the skirmish on Nevarro, a Trexler 906 Armored Marauder, multiple speeder bikes, armored transports, and other vehicles. Their leader, Moff Gideon, also used a personal Outland TIE fighter, a model of the Sienar Fleet Systems' TIE line, with wings that folded when landing on a leveled surface, allowing for ease of access to the cockpit. They also owned at least two RA-7 protocol droids, one of whom served the Nevarro cantina as the bartender after the remnant's occupation of the planet, while another served on Gideon's cruiser."}, {"tag": "p", "text": "A fleet also served under Moff Gideon's command, as part of his Imperial remnant. The fleet included a modified Gozanti-class Assault Carrier, a Class 546 light cruiser, several Outland TIE fighters, and TIE/ln space superiority starfighters, several Imperial transports and a Lambda-class T-4a shuttle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gideon's Imperial remnant first appeared in \"Chapter 1: The Mandalorian,\" the debut episode of Jon Favreau's Disney+ television series The Mandalorian, which was directed by Dave Filoni and aired on November 12, 2019."}, {"tag": "p", "text": "For the episodes \"Chapter 7: The Reckoning\" and \"Chapter 8: Redemption,\" Favreau and Filoni enlisted the help of the 501st Legion fan organization as the crew of the series did not have enough stormtrooper costumes on set. As such, many of the stormtroopers who were seen reinforcing the death troopers were portrayed by members of the organization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}