{"url": "Gideon_Tarkin", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Bureaucrats", "Category:Coruscanti", "Category:Eriaduans", "Category:Galactic Empire admirals and generals", "Category:Galactic Republic military officers", "Category:Humans", "Category:Judicial Forces officers", "Category:Males", "Category:Tarkin family"], "nodes": [{"tag": "h1", "text": "Gideon Tarkin"}, {"tag": "p", "text": "Brigadier Gideon Tarkin was a member of the powerful Tarkin family of Eriadu who had a successful military career but was overshadowed by his elder brother, Grand Moff Wilhuff Tarkin. Wilhuff and Gideon Tarkin both attended the same military academy before graduating and entering the Republic Outland Regions Security Force. Gideon Tarkin attained the rank of brigadier before returning to Eriadu, as Wilhuff did, to enter a career in government. Tarkin became the planet's Minister of Security, in which capacity he served until the outbreak of the Clone Wars."}, {"tag": "p", "text": "During the Clone Wars, Tarkin returned to Republic service, taking a position in the Republic Military and commanding the Republic's efforts to defend Eriadu in the embattled Seswenna and Sluis sectors. Tarkin's military success gained him praise as he continued to loyally serve Palpatine under the rule of the Galactic Empire, but Wilhuff outstripped his younger brother, rising meteorically to the lofty rank of Grand Moff. In 5 BBY, Tarkin died in the course of the Erhynradd Mutiny. He was survived by his teenage daughter, Rivoche, who went on to defect to the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Service to the Republic"}, {"tag": "p", "text": "Gideon Tarkin was born into the prestigious and powerful Tarkin family of Eriadu in the waning days of the Galactic Republic. He had an older brother, Wilhuff Tarkin. The two youths entered a prestigious military academy and, on graduating, joined the Republic Outland Regions Security Force, an anti-piracy task force which served to defend the area around Eriadu. Tarkin eventually left military service to enter government on Eriadu. There, Brigadier Tarkin served as the Minister of Security for Eriadu's government as of 22 BBY."}, {"tag": "p", "text": "At that time, as the Separatist Crisis grew, Gideon Tarkin was a visible public figure in the Republic's efforts to counter the secessionist movement. Tarkin appeared on the Eriaduan news program and talk show Essence for an interview with host AndroosinLiann, and he later announced Eriaduan port authorities' seizure of a shipment of InterGalactic Banking Clan Hailfire droids destined for the Separatist world Praesitlyn in the nearby Sluis sector, a major coup which sparked an investigation of whether the InterGalactic Banking Clan was secretly aiding the Separatists. As Separatist activity spread into Eriadu's Seswenna sector, Tarkin negotiated with the Jedi Order to bolster the sector's defenses, managing to get a squadron of Jedi Delta-7 Aethersprite-class light interceptors assigned to Eriadu. Tarkin personally welcomed the Jedi detachment to the Eriadu Planetary Security Launchport in a public ceremony before speaking with Jedi Master Hyris-Well Madorin, the leader of the contingent, concerning increasing security for the vital Rimma Trade Route, on which Eriadu lay and which was threatened by Separatist strength in the neighboring Sluis sector."}, {"tag": "p", "text": "In short order, the Clone Wars erupted between the Republic and the Separatist Confederacy of Independent Systems. Tarkin returned to Republic service, serving once more as a brigadier in the newly formed Republic Military. Eriadu soon became the center for operations in that area of space, which was highly contested. It was Tarkin who oversaw the theater of war, commanding a fleet at Eriadu, which he made a bastion against the Confederacy and used as a staging point for attacks against enemy forces. Working with several squadrons of Jedi, Tarkin held out against the Separatists, but his situation was made much worse when, just over a year into the war, Sullust, the area's other major Republic stronghold, defected to the Confederacy. Tarkin responded to the secession by calling up planetary defense forces, merging them into \"priority theaters\", and coordinating their offensive deployment from Eriadu. Tarkin's strategy was set back by a betrayal from within which saw the Republic lose the Battle of Sullust, but his forces still managed to recapture much of the Sluis sector."}, {"tag": "h3", "text": "Imperial"}, {"tag": "p", "text": "When Supreme Chancellor Palpatine reformed the Republic into the Galactic Empire, Tarkin eagerly gave the new, authoritarian government his allegiance, as did Wilhuff. As Wilhuff rose through the ranks of the Empire, eventually becoming a Grand Moff, Gideon Tarkin found himself outshone by his brother's successes. Nevertheless, the younger Tarkin still found success under the Empire, being known as a talented commander and maintaining a high-class lifestyle. He also had a family, siring a daughter, Rivoche Tarkin, around 18 BBY. Tarkin split his time between Eriadu and the galactic capital, Coruscant, moving among the elite."}, {"tag": "p", "text": "In 5 BBY, Tarkin died in the Erhynradd Mutiny. In honor of his brother, Wilhuff took young Rivoche into his home. Rivoche eventually betrayed the Empire, serving Airen Cracken as a spy for Alliance Intelligence. She rejected her father and uncle's deeds as oppressive, instead supporting the Alliance to Restore the Republic. She eventually defected fully, joining the Rebellion which became the New Republic, and married Rebel propagandist and New Republic historian Voren Na'al. They had children together, continuing Gideon Tarkin's line if not his beliefs. One of them, Gideon Na'al, was named for his maternal grandfather."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gideon Tarkin was loyal to the Galactic Republic, and was willing to support the Jedi in that capacity. When Galactic Emperor Palpatine imposed the New Order on the galaxy, however, Tarkin willingly allied himself with the new government and carried out its policies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gideon Tarkin originated in the sourcebook Cracken's Rebel Operatives, as part of the background for operative Rivoche Tarkin. The HoloNet News website, set up in advance of Star Wars: Episode II Attack of the Clones as a notionally in-universe news site, made use of Tarkin a handful of times, generally providing comment within news stories set on Eriadu. The only other source to make major expansions to the character was The New Essential Chronology, in which author Daniel Wallace inserted Tarkin as the commander of an offensive around Eriadu in one of the few instances in which the guide added wholly original events to the continuity. Tarkin has never actually appeared as a character in any narrative source, only in source material and in-universe news reports. John Hazlett's article The Written Word indirectly referenced Gideon Tarkin by naming the character Gideon Na'al, Tarkin's grandson, after him."}, {"tag": "p", "text": "In The New Essential Guide to Characters, Tarkin is said to have attended the \"Imperial Academy\" before serving in the military. This would have occurred long before the formation of the Galactic Empire, and so Tarkin would have to have attended one of the military academies operating under the Republic, and the reference to the Imperial system would be in error."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}