{"url": "Gigoran/Legends", "categories": ["Category:Legends articles", "Category:Enslaved species", "Category:Gigorans", "Category:Outer Rim Territories species", "Category:Primate sentient species"], "nodes": [{"tag": "h1", "text": "Gigoran"}, {"tag": "p", "text": "The Gigorans were a species of bipedal, sentient primates indigenous to the planet Gigor in the Outer Rim."}, {"tag": "h2", "text": "Biology and Appearance"}, {"tag": "p", "text": "Gigorans were similar in appearance to primates found on other worlds, their bodies covered in fur, having evolved from cave-dwellers on their arctic home planet. They had clawed hands with four fingers and an opposable thumb. Gigorans were exceptionally strong and hardy, which made them a target for slavers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Gigorans lived in relative peace on Gigor even after being discovered before the reign of the Empire. However, after the rise of the New Order, a group of smugglers began using their homeworld as a base of operations. After encountering the noncombative species, they began capturing Girgorans to sell into slavery, finding their physical characteristics and peaceful nature advantageous. Gigorans were sold throughout to many disreputable groups for a handsome profit, leading the Mytaranor Slaving Council to hire bounty hunters to capture Gigorans instead of purchasing them."}, {"tag": "p", "text": "One Gigoran became a loyal business partner to Human entrepreneur Reina Gale after destroying an Imperial slave camp, traveling with her after the Battle of Endor."}, {"tag": "h2", "text": "Society"}, {"tag": "p", "text": "Gigorans lived in a family-based tribal society on their home planet, with each home-clan led by the most talented hunter and were fiercely loyal to these familial groups. Despite their appearance and strength, they were normally peaceful and docile in their native environment, however, when necessary, Gigorans were powerful and effective opponents. An empathic species, Gigorans could speak Basic but often preferred their language of grunts. Gigorans had not developed any technology more complex than stone-age tools."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}