{"url": "Gigoran", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Gigorans", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Gigoran"}, {"tag": "p", "text": "Gigorans were a sentient species of tall, hairy humanoids that hailed from the planet Gigor. They were often enslaved for their strength and typically used as bodyguards."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Gigorans were a species of furry giants, in many ways similar to the Wookiees. They had fur ranging in color from white to grey or light brown. They could learn to understand other languages, but could not themselves speak Galactic Basic Standard. In order to communicate with species that did not speak their language, Gigorans often wore translating vocoders on their mouths to speak other languages besides Gigoran."}, {"tag": "h2", "text": "Gigorans in the galaxy"}, {"tag": "p", "text": "Gigorans were often enslaved and exploited for their strength."}, {"tag": "p", "text": "Moroff, a Gigoran mercenary, was active during the Age of the Empire. Some Gigorans were members of the Rebel Alliance. The Cerean Soo-Tath was protected by two Gigoran bodyguards. Another Gigoran bodyguard, Sluncan, served Jayyar Lu-wehs, a wealthy weapon merchant's son. Ymmoss was a Gigoran who, along with Cost Niktur, was captured by the First Order in 34 ABY. Baheeoo, a member of the Nihil marauder group, was present aboard the Gaze Electric in 232 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gigorans originated in the 1994 Legends role-playing game article \"It's a Gambler's Life,\" published in the Star Wars Adventure Journal 4. They were canonized through their inclusion in a 2016 update to Star Wars: Commander. The first named Gigoran in canon was Moroff in Rogue One: A Star Wars Story."}, {"tag": "p", "text": "Unlike their canon counterparts, the Legends Gigorans did not require vocoders to speak Galactic Basic Standard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}