{"url": "Gil_Cassel", "categories": ["Category:Legends articles", "Category:Bastion residents", "Category:Fel Empire military personnel", "Category:Humans", "Category:Imperial Army officers of Darth Krayt's Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gil Cassel"}, {"tag": "p", "text": "Gil Cassel was a Human male born on Bastion to a pro-Imperial family. He was the brother of Jared Cassel, who, like Gil, joined the Imperial Army."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gil reached the rank lieutenant and served in the 407th Stormtrooper Division. His brother, who held the rank of Captain, served in the 908th Stormtrooper Division. During the Second Imperial Civil War, in 137 ABY, the 407th remained loyal to the Imperial faction ruled by Darth Krayt, Dark Lord of the Sith. Meanwhile, the 908th, including Jared, defected to the side of the deposed Emperor Roan Fel."}, {"tag": "p", "text": "As a result of the defection, the 407th, stationed in Yinchorr, was sent to Borosk to eliminate the 908th to the last man and woman. Despite the presence of his brother in the enemy's side, Gil nonetheless led his troops in battle."}, {"tag": "p", "text": "In the midst of the battle, with the 407th already winning ground to the 908th, Gil and Sergeant Ran Harkas of Joker Squad, discussed the possibility of offering the defecting Division a chance to surrender. However, Darth Maleval, the Sith Lord overseeing the 407th on behalf of the Emperor, refused the plan and ordered the complete elimination of the 908th. Despite objections from Jes Gistang and Hondo Karr, both members of Joker Squad, Lieutenant Cassel chose to follow Lord Maleval's orders."}, {"tag": "p", "text": "After the 407th's victory, Darth Maleval brought the captured Jared Cassel to be executed by Gil as a test of his loyalty to the Sith Empire. However. Gil refused to kill his own brother, for which both were decapitated by the Quarren Sith Lord."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}