{"url": "Gilder_Varth", "categories": ["Category:Legends articles", "Category:Alderaanian Resistance members", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Males", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Gilder Varth"}, {"tag": "p", "text": "Gilder Varth was a male Human who served as an admiral in the Imperial Navy during the early years of the Galactic Empire. Around 17 BBY, Varth was tasked by the Empire with exposing the seditious behavior of Bail Organa, a leading Imperial senator from the world of Alderaan. Varth established contract with Organa and passed him intelligence regarding the Sarlacc Project, a secret Imperial project to construct a prototype Super Star Destroyer. To assist the deception that Varth was a traitor to the Empire, the admiral was interned in a remote prison on the planet Felucia."}, {"tag": "p", "text": "Varth was broken out of prison by agents of Organa and adopted a command role within the senator's Alderaanian Resistance movement, operating aboard the EF76 Nebulon-B escort frigate Resurgence. While covertly seeking proof of Organa's support of the insurgent group, Varth oversaw several operations by Alderaanian Resistance operatives to obtain further information on the Sarlacc Project. Varth later betrayed the rebels to the Empire and engineered in an Imperial attack on the Resurgence. The admiral subsequently took up command of the under-construction Super Star Destroyer prototype in the Beshqek system and was killed when the vessel was assaulted and destroyed by the Alderaanian Resistance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "Gilder Varth was a male Human who lived during the latter years of the Galactic Republic and forged a career as a naval officer. Varth fought during the Clone Wars, a tumultuous conflict between the Republic and the separatist Confederacy of Independent Systems. In 19 BBY, he commanded a ship during the Battle of Coruscant, a clash for control of the Republic capital world Coruscant. Varth was subsequently promoted as a result of the bravery that he displayed during the battle."}, {"tag": "p", "text": "Following the rise of the Galactic Empire, the successor government to the Republic, Varth attained the position of admiral in the Imperial Navy. Varth became involved with the Sarlacc Project, a secret Imperial endeavor to construct a prototype Super Star Destroyer warship, and was tasked with channeling funding and resources into the scheme. The admiral had responsibility for transferring funds to the Hutt crime lord Darga in return for slaves to use in the construction of the vessel. As work on the project progressed, Varth received reports of high rates of fatalities connected to the operation ."}, {"tag": "h3", "text": "Imprisonment on Felucia"}, {"tag": "p", "text": "Around 17 BBY, Varth was tasked by the Empire with gaining proof of the disloyalty of Bail Organa, a prominent Imperial senator from the planet Alderaan who was clandestinely backing the nascent Alderaanian Resistance anti-Imperial insurgent movement. To that end, Varth made contact with Organa and over a period of several months passed secret information about the Empire to the senator. As a cover story, the admiral portrayed himself as a previously steadfast Imperial supporter who become disillusioned by how the Empire had warped the values of the old Galactic Republic. In addition, he feigned concern over discoveries that he had made regarding secret activities that the Empire was engaged in."}, {"tag": "p", "text": "As the next step in his scheme to expose Organa, Varth conspired with Valin Draco of the Empire's Inquisitorius order of Dark Jedi to infiltrate Varth into the Alderaanian Resistance. In a plan known only to Varth and Draco, the admiral was arrested and imprisoned on the planet Felucia at the remote Vanishing Place prison deep in the Felucian jungle, to lure Organa into arranging his rescue and thereby provide Varth an opportunity to insinuate himself into the rebel movement. Varth was incarcerated in Detention Block F-1A, a small, cramped communal detention center within the prison facility. Over the next few days, Varth received no preferential treatment from the prison guards and suffered minor injuries including a swollen and bruised right eye and blood stains around the side of his mouth, while his Imperial uniform became tattered."}, {"tag": "p", "text": "Organa received word from his agents of Varth's internment on Felucia. Just over a week after the admiral's imprisonment, Organa dispatched a team of freelance agents to rescue Varth, in hope that the information possessed by the admiral would allow the Alderaanian Resistance to strike a major blow against the Empire. As a ruse to give further credence to Varth being a genuine traitor to the Empire, Valin Draco arranged for a transmission to be sent to the Vanishing Place prison advising that Draco would be arriving on Felucia to take personal custody of Varth aboard the Imperial I-class Star Destroyer Assiduous for transportation to the Citadel Inquisitorius, the Inquisitor headquarters on the planet Prakith. Draco's message also instructed that Varth should be administered interrogation chemicals between 27 and 54 minutes prior to transfer to a shuttle and that the prison's medical technicians should ensure Varth was well rested and in good strength."}, {"tag": "p", "text": "The operatives sent by Organa made their way into the Felucian prison and freed the admiral. Varth was confused by the presence of the freelancers as he had expected Organa to send Resistance forces rather than independent agents to rescue him, but he nevertheless agreed to accompany the team. The agents ushered Varth to a secret entrance to the prison in the facility's ventilation system where they sought to make their escape. However, the way out was blocked by Imperial stormtroopers and the operatives instead fought their way through the prison and  escorted Varth onto the building's roof. From there, Varth and his rescuers were picked up by the Baudo-class star yacht Banshee. The admiral was then transported to a rendezvous point at a secure location in the uninhabited Zandrax system and taken aboard the Alderaanian Resistance EF76 Nebulon-B escort frigate Resurgence. Varth was greeted by the vessel's captain Adrian Verana and led away by several Alderaanian Security agents to be questioned."}, {"tag": "h3", "text": "Serving the Alderaanian Resistance"}, {"tag": "p", "text": "The Resurgence served as a mobile safe house for Varth, and remained in deep space, away from hyperlanes and inhabited worlds. Over the next few weeks, the admiral was debriefed by the Alderaanian Resistance, with Captain Verana personally overseeing Varth's safety and cross-examination. A concerted effort was made by the Resistance to avoid mentioning Organa's name in Varth's presence, so as not to corroborate to Varth the senator's support of the rebels until the admiral's true loyalties were determined. Demonstrating his sincerity, Varth revealed information about the Empire's clandestine activities including his peripheral involvement in the Sarlacc Project. However, he claimed to be ignorant of the true purpose of the Sarlacc Project and asserted that he had been reassigned away from the operation by Empire due to concerns that his morals made him an encumbrance."}, {"tag": "p", "text": "Directly supporting the efforts of the rebels, Varth took to wearing the uniform of an Alderaanian ship's officer  and was tasked by Verana with discovering more information about the Sarlacc Project. To that end, Varth planned out a mission to investigate Darga the Hutt's connection to the scheme and determine the nature of the goods that Darga was trading with the Empire. With permission from Verana, Varth engaged the services of the team of agents who had rescued him from Felucia and received authorization to pay the operatives a moderate amount of credits in return for their services. The admiral convened a briefing aboard the bridge of the Resurgence and instructed the operatives to identify Darga's whereabouts on the planet Cato Neimoidia and gather intelligence about the nature of the Hutt's criminal operation. The mission was a success and led to the Resistance identifying that Darga was supplying tibanna gas from the planet Bespin for use in the Sarlacc Project."}, {"tag": "p", "text": "Several months later, the team of Alderaanian Resistance agents who had assisted Varth previously uncovered data on the planet Nizon identifying that the Sarlacc Project was being directed from Coruscant. Varth, Verana and the crew of the Resurgence spent the next couple of days analysing the information, leaving the admiral weary. Varth and Verana devised to dispatch the team of Alderaanian Resistance agents to Coruscant to locate and infiltrate the headquarters of the Sarlacc Project to obtain further information on the nature of the Imperial operation. In preparation for the mission, Varth procured the proper licenses and permits for the agents to land their starship at Cloudscape Platforms, a private Coruscant starport. Once the preparations were made, Varth and Verana summoned the operatives for a meeting in a briefing room aboard the Resurgence and instructed them on the particulars of their mission. The agents then departed, bound for Coruscant."}, {"tag": "h3", "text": "Betrayal"}, {"tag": "p", "text": "The operatives dispatched by the Alderaanian Resistance to Coruscant located and destroyed the headquarters of the Sarlacc Project. In the aftermath of the operation, Varth plotted to lure the agents into a trap, considering them to be too talented to be permitted to continue to serve the Resistance. The admiral arranged for the Imperial Security Bureau agent Tavik Moern to pose as an Incom Corporation weapons technician named Pavel Trenol who it was purported was a survivor of the destruction of the Sarlacc Project headquarters. Varth then sent a message to the operatives a message via a pirated HoloNet signal tasking them with making contact with \"Trenol\" at a flophouse in the Gnawer's Roost district of Coruscant, claiming that the technician sought to defect to the Alderaanian Resistance in return for providing information on the offensive specifications of the Super Star Destroyer prototype. The admiral also instructed the agents to signal him once they had rendezvouzed with \"Trenol\" so that Varth could arrange their return to the Resurgence. Moern was then to ambush and kill the Alderaanian Resistance operatives when they tracked him down."}, {"tag": "p", "text": "With his plan to eliminate the Resistance agents set in motion, Varth chose his moment to betray the Alderaanian rebels and return to the Imperial fold. Varth provided the location of the Resurgence and its supporting flotilla to the Empire, triggering an attack by two Imperial Star Destroyers against the Alderaanians. Varth abandoned the Resurgence amid the chaos of the battle and joined the Imperial forces, donning a pristine Imperial uniform. The agents whom Varth had attempted to ensnare on Coruscant survived the admiral's trap and returned to the stricken Resurgence. As the operatives fled the floundering frigate, Varth sent a transmission to their starship, revealing to them his true loyalty to the Empire and ordering the agents to stand down and allow their vessel to be boarded. The operatives did not heed his instruction and fled into hyperspace."}, {"tag": "h3", "text": "Downfall"}, {"tag": "p", "text": "Following his return to Imperial service, Varth continued to work closely with Inquisitor Draco. With Draco's agreement, the admiral assumed command of the skeleton crew of the partially-completed Super Star Destroyer prototype at its construction site in orbit of the planet Byss in the Beshqek system. Varth also gained oversight of a Golan space defense platform assigned with protecting the incomplete Star Destroyer. Mistrustful of allowing an exclusively Human crew, Varth ensured that the majority of the space station's retinue were droids, in order the minimise the Human presence aboard. He did however allow a contingent of hand-picked elite agents of Emperor Palpatine—the leader of the Galactic Empire—to join the Golan platform's company."}, {"tag": "p", "text": "After an encounter with the Alderaanian Resistance on the planet Prakith, Inquistor Draco fled to the under construction Super Star Destroyer over Byss. With Varth's acquiescence, Draco took charge of the Golan defence platform that guarded the Star Destroyer. The Inquisitor sought to take command of the Super Star Destroyer and its ancillary fleet when it was completed and considered the admiral to be his main rival for control of the gargantuan vessel. Draco experienced a vision that his final confrontation with the Alderaanian rebels would take place over Byss but deliberately withheld this knowledge from Varth because the Inquisitor hoped that victory over the insurgents would allow him to outshine the admiral and would prove Draco's worthiness to command the Super Star Destroyer."}, {"tag": "p", "text": "A short time later, as Draco had foreseen a fleet of Alderaanian Resistance ships and allied smuggler forces traveled to the Beshqek system to assault the Super Star Destroyer prototype. From the bridge of the Super Star Destroyer, Varth directed the Imperial defence and ordered his supporting fleet to engage the attacking forces. Suspecting a trap, Varth sent orders to the Golan defence platform that defended the Super Star Destroyer to power down the tractor beam holding the vessel in place so that the prototype Star Destroyer could join the battle. However, before tractor beam could be lifted the Alderaanian Resistance agents who had previously rescued Varth from Felucia boarded the station and were confronted by Draco. Varth sent a communication to the Golan platform to demand an explanation for the delay in deactivating the tractor beam and observed via a display screen as Draco was defeated and killed. Afterward, Varth spoke to the agents through the display screen, lamenting their survival of the attack on the Resurgence and foretelling that they would not survive to witness his victory over the rebels."}, {"tag": "p", "text": "Upon Varth's instruction, the still-incomplete Super Star Destroyer powered up its turbolasers and fired at the anchoring platform of the Golan platform to free it from the tractor beam holding it in place. The admiral then had the Super Star Destroyer conduct a micro-jump through hyperspace, transporting it into the forefront of the battle. Shortly thereafter, Alderaanian starfighters flew through a gap in vessel's superstructure and detonated the Super Star Destroyer's main reactor, causing the ship to explode and resulting in Varth's demise. The admiral's defeat and the loss of the prototype vessel represented the first significant victory of a resistance group over the Galactic Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gilder Varth was slightly overweight and had closely-cropped blond hair, blue eyes, fair skin and a bushy moustache. A brusque though not unfriendly man of action, he was no fool and became impatient if he was forced to wait around. He preferred to keep meetings short and succinct, allowing little time for small talk in his interactions with others."}, {"tag": "p", "text": "Varth was an honorable individual and displayed significant valor during his Clone Wars naval service. He went on to demonstrate utmost loyalty to the Galactic Empire. He was fully committed to his ruse to infiltrate the Alderaanian Resistance and was eager to gain the trust of Bail Organa so as to lure the senator and his agents into a trap. When sprung from imprisonment on Felucia, Varth was initially guarded about the specifics of his feigned capture and was reluctant to reveal much information because he was unsure of the allegiance of the freelance agents who had rescued him."}, {"tag": "p", "text": "The admiral outwardly presented himself to the Alderaanian Resistance as a genuine defector though the body language that he displayed while serving with the rebels left his true intentions unreadable. His deceit came naturally to him and he found it easy to convince the insurgents of his sincerity. However, he did not adjust easily to life outside the rigidity of the Imperial Navy and felt uncomfortable wearing the Alderaanian uniform assigned to him by the resistance group, though his professionalism prevented him from expressing any objection to his new attire. He found it hard to renounce some of his old Imperial habits while undercover; as a hint of his true loyalty to the Empire, while briefing the team of Alderaanian Resistance agents that he was dispatching to investigate the Sarlacc Project on Coruscant he inadvertently referred to the world as \"Imperial Center,\" the proper Imperial name for the world, rather than as \"Coruscant,\" the name used conventionally for the planet by the rebels."}, {"tag": "p", "text": "The Alderaanian Resistance operatives that Varth dispatched to Coruscant exceeded his expectations by successfully uncovering the true nature of the Sarlacc Project. This led him to feel a begrudging respect for the resourcefulness that the agents had demonstrated. Following his betrayal of the rebels to the Empire, Varth was full of bluster and during the Imperial attack on the Resurgence he attempted to coerce the team of Alderaanian Resistance operatives into allowing themselves to capture despite him not being in a position to prevent their escape. He was later disappointed at his failure to kill the agents during the ambush of the Alderaanian Resistance fleet. During the battle with the rebels over Byss, Varth was confident of victory and eager to crush his assailants, considering the Alderaanian Resistance's revolt against the Empire to be farcical."}, {"tag": "h2", "text": "Talents and abilities"}, {"tag": "p", "text": "Varth was a trained pilot and he was as proficient in vehicular combat, the operation of blaster pistols and the usage of other simple weapons. In addition to Basic, he was also fluent in the language High Galactic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gilder Varth appeared as a recurring character in the Dawn of Defiance campaign, a series of role-playing adventures set within Star Wars Legends continuity that was published on Wizards.com between 2007 and 2009 as a tie-in to the Saga Edition of Wizards of the Coasts' Star Wars Roleplaying Game. Varth was first mentioned in Dawn of Defiance: Gamemaster Primer, an outline of the Dawn of Defiance campaign by Rodney Thompson published on October 4, 2007, and made his first appearance in the opening instalment of the campaign, The Traitor's Gambit, also by Thompson. He went on to feature in in Dawn of Defiance modules A Wretched Hive, The Core of Corruption, A Reckoning of Wraiths and Jaws of the Sarlacc, receiving his first visual depiction in The Core of Corruption, in an illustration by Elizabeth McLaren."}, {"tag": "p", "text": "In The Traitor's Gambit, it is noted that Varth participated in the Battle of Coruscant, a battle fought between the forces of the Galactic Republic and the Confederacy of Independent Systems, but it is not specified which side of the battle he fought on. An inconsistency exists regarding Varth's hair color; The Traitor's Gambit states the admiral's hair color to be grey whereas the image of Varth that appears in the The Core of Corruption portrays him as having blond hair. This article assumes his hair to be blonde since The Core of Corruption is the later of the two sources."}, {"tag": "h3", "text": "Dawn of Defiance roleplaying outcomes"}, {"tag": "p", "text": "In the Dawn of Defiance campaign, the player characters roleplay as the agents of the Alderaanian Resistance who rescue Varth from imprisonment on Felucia and later undertake various missions for the Resistance at his behest. When the player characters help Varth to break out from the Vanishing Place prison in The Traitor's Gambit, Varth is reluctant to engage in combat against the Imperial guards and offers tactical support only. However, it if pressed by the players the admiral does reluctantly brandish a blaster and assist in the fighting. If the players are unable to identify an escape route from the prison, Varth remarks that he had overheard his guards referring to a command center on the second floor of the facility and recommends that the operatives head there and make their way to the prison roof."}, {"tag": "p", "text": "At the start of the setting of A Wretched Hive, Varth has not obtained confirmation that Bail Organa is supporting the Alderaanian Resistance and was the orchestrator of his rescue from Felucia unless the player characters provide him confirmation of the senator's involvement. The adventure also recommends that Varth appear in roleplaying adventures set between the events of The Traitor's Gambit and A Wretched Hive, to allow the players further opportunities to familiarize themselves with his character."}, {"tag": "p", "text": "In The Core of Corruption, Varth assigns the player characters to investigate the Sarlacc Project on the planet Coruscant and is possible for him to offer the player characters remuneration of up to 5,000 each and access to equipment and weapons from the stores of the Resurgence in return for undertaking the mission. He also extends the players the temporary use of a light freighter for use in the assignment if they lack access to a starship. If the player characters have their own vessel, Varth offers to arrange for any necessary repairs to the ship to be completed prior to the agents undertaking the mission. In A Reckoning of Wraiths, Varth sends a transmission to the player characters to reveal that his defection to the Alderaanian Resistance had been a deception and he converses with the agents only while their exchange stays productive and courteous."}, {"tag": "p", "text": "The conclusion of Jaws of the Sarlacc, the final instalment of the Dawn of the Defiance campaign confirms that Varth is killed during the battle over Byss and the Super Star Destroyer prototype eviscerated. This article therefore assumes Varth's death in the battle to be the official outcome. The adventure does however advocate that if the player characters fail to destroy the Super Star Destroyer prototype during the battle over Byss then this could act as a crux for a new roleplaying campaign with Varth as an antagonist. It is suggested that in this scenario, the existence of the new Star Destroyer is not publicly disclosed by the the Empire and Varth resolves to keep awareness of the new vessel secret until the Emperor demands otherwise. Under Admiral Varth's command, the Super Star Destroyer strikes unseen against targets throughout the galaxy. The player characters then lure Varth and his ship into a trap and attempt to eradicate the Super Star Destroyer once and for all."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}