{"url": "All_Terrain_Anti_Aircraft", "categories": ["Category:Canon articles", "Category:All Terrain variants", "Category:Galactic Empire walkers", "Category:Rothana Heavy Engineering products"], "nodes": [{"tag": "h1", "text": "All Terrain Anti Aircraft"}, {"tag": "p", "text": "The All Terrain Anti Aircraft (AT-AA) was a heavily armored walker produced by Rothana Heavy Engineering in the final year of the Clone Wars as part of its AT-series walker, and utilized by the ground forces of the Galactic Empire for anti-air purposes."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The All Terrain Anti Aircraft was a tough walker that was still fielded by the Imperial Army as a mobile heavy air-defense vehicle. The walker's design was rare among other designs, built long and low-to-ground, it was equipped with four short legs that were able to extend from the sides of the walker's hull rather than straight down in comparison to the much larger All Terrain Armored Transport or All Terrain Scout Transport, which gave it a lizard-like, rather than mammal-like, gait and appearance. It was operated by a crew of three—pilot, gunner, and commander—housed in a cramped, forward-mounted control pod. The rest of the vehicle was given over to its power, drive, and fire-control systems."}, {"tag": "p", "text": "Heavily armored for a walker of its size, the AT-AA was a slow, plodding vehicle that was better suited to rear echelon, over-the-horizon artillery support and air-defense than front line combat. The AT-AA was armed with either a turret-mounted twin light flak cannon or a turret-mounted concussion missile launcher. Its armament, when combined with the walker's sophisticated air-defense targeting system, allowed squads of AT-AAs to deny remarkably broad swath of sky to enemy airspeeders and starships, and while they were capable of keeping entire squadrons at bay with flak bursts and concussion missiles, the walker lacked secondary armament and thus were woefully susceptible to attack from ground assault. Despite being equipped with firing ports from which the crew could fire their personal weapons, the vehicle had minimal defenses against a determined ground-based enemy, and as a result, the AT-AA was often paired with infantry and AT-ST support."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The All Terrain Anti Aircraft served as an air-defense walker, targeting aircraft in the vicinity. A formation of AT-AAs was referred to as a squad."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The All Terrain Anti Aircraft was manufactured in the final year of the Clone Wars, and subsequently deployed during the Imperial Era by the Galactic Empire for Imperial Army usage. At one point, one such walker was accompanied by scout troopers on All Terrain Reconnaissance Transports."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The All Terrain Anti Aircraft was introduced in the new Star Wars canon in the 2020 Fantasy Flight Games' Star Wars: The Roleplaying Game supplement book Starships and Speeders."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}