{"url": "Gilramos_Libkath", "categories": ["Category:Legends articles", "Category:Clerical workers and assistants", "Category:Confederacy of Independent Systems individuals", "Category:Males", "Category:Neimoidians", "Category:Slavers", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Gilramos Libkath"}, {"tag": "p", "text": "Gilramos Libkath was a conniving male Neimoidian, with an unusually deep voice and wearing a large miter, who served as Trade Federation Viceroy Nute Gunray's aide and Contract-Scribe. Libkath was exiled on Tatooine, a sun-scorched world in the Outer Rim Territories. During his time on that arid planet, the Neimoidian built up a small criminal business, using a group of kidnapped children in thefts. At that time, he was known to his young slaves as \"the Master.\" Libkath's criminal activities were brought to an end in 22 BBY, when the crime lord Jabba the Hutt put a price on his head. Two bounty hunters, the Gen'Dai named Durge and the ten-year-old Boba Fett, were responsible for Gilramos Libkath's demise."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gilramos Libkath was a male Neimoidian, a Near-Duros species that hailed from the planet of Neimoidia in the Colonies Regions of the galaxy. In the last decades of the Galactic Republic, Libkath came to be affiliated with the Trade Federation, a Neimoidian-dominated trade cartel and megacorporation, serving as an assistant and Contract-Scribe to its leader, the Viceroy Nute Gunray. For unspecified reasons, Libkath was exiled from his homeworld and, by 27 BBY, he lived on the desert world of Tatooine in the Outer Rim Territories. Despite his eviction, the Contract-Scribe retained connections with the Federation."}, {"tag": "p", "text": "On Tatooine, Gilramos Libkath became a minor personality in the underworld of Mos Espa, one of the planet's expansive spaceports. The Neimoidian would kidnap younglings and street urchins whom he called his \"children.\" In exchange for a roof over their heads and protection against the gangsters, \"Master Libkath\" forced the younglings to steal for him. He kept them under control using devices implanted in their hands that released toxins in the body if the children left the planet. Those who failed Libkath or refused to obey him were sold as slaves or indentured servants. One of its little victims was Ygabba, the daughter of the Tatooinian chef Gab'borah Hise."}, {"tag": "p", "text": "Libkath even went as far as to steal weapon and spice shipments from Jabba Desilijic Tiure, the Hutt crime lord of Tatooine, that he would sell to his old friends of the Trade Federation. By that time, the Federation had joined the Separatist Confederacy, an alliance that advocated the secession of worlds from the Galactic Republic. Such bold actions earned Libkath the Hutt's hatred."}, {"tag": "p", "text": "In 22 BBY, intent on getting rid of that Neimoidian busybody, Jabba sicced two bounty hunters on Libkath: a young Human named Boba Fett as well as the Gen'Dai hunter Durge. \"The Master\" was well-protected, however, rarely appearing in person and instead communicating with his thieving children via holographic transmissions. He also owned a personal complement of battle droids to take care of potential attackers."}, {"tag": "p", "text": "The bounty hunters, despite attempting to kill one another every step of the way, managed to discover the Neimoidian's hideout. They caught Libkath off guard and cornered him in the hull of a heavily damaged Theed cruiser. Fett then smashed Libkath in the head twice with a brick before swooping in and stealing his miter. When Libkath tried to flee, Durge shot a crate of weapons, provoking an explosion that blew up the Neimoidian's lair. \"The Master\" and all of his attending battle droids perished in the blaze, while Fett successuflly escaped the burning hideout in the derelict Theed cruiser, taking the enslaved children with him. The Neimoidian's miter was given to Jabba as a proof that he was dead. Jabba then unceremoniously dropped the miter in a fire, letting the flames destroy the last trace of Gilramos Libkath for good."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like most Neimoidians, Libkath was tall and thin, a racial trait due to the heavier gravity on their home planet of Neimoidia. He had a long, noseless head and, because of his species' iron-based sclera pigmentation, he sported orange eyes that reminded the young Boba Fett of Tatooine's twin suns. Compared to many of his kind, Libkath had sickly white skin. Those traits, along with his gnarled hands, made him frightening to his young slaves. In order to further enhance his towering height and scary composure, Gilramos Libkath wore a tall, crown-like black miter and a set of deep-blue shimmering robes. He shared many physical traits and tastes in fashion with three other important Neimoidians: Captain Daultay Dofine, Settlement Officer Rune Haako, and a representative of the Confederacy during the Battle of Muunilinst. Libkath had an unusually deep voice sounding like a low, yet smooth hiss. Like all Neimoidians, Gilramos Libkath was extremely vain. He placed huge value on his hat, which was a symbol of power and social prestige."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "For a Neimoidian, Libkath had a firm grip, strong enough to clutch and hold the young Boba Fett. Although Fett was only ten years old at the time, he had received basic Mandalorian training in combat skills. The Neimoidian was also capable of firing bolts of red lightning with his hands. However, it is unknown whether it was a real manifestation of the Force known as Force lightning—in which case Libkath would have been Force-sensitive—or just an elaborate trick, like the one used by the self-proclaimed Emperor Trioculus about thirty years later. While Fett did witness the Neimoidian throwing a salvo of crimson lightnings, he was unable to determine how he had achieved it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Gilramos Libkath was originally intended to be the Neimoidian seen with Nute Gunray on Geonosis in Attack of the Clones and in CIS Shadowfeed Dispatch 14:10:05 Edition in Star Wars Insider 71. He was named after costume supervisor Gillian Libbert and production controller Kathryn Ramos. Libkath was also identified by name in Star Wars: Attack of the Clones: The Visual Dictionary."}, {"tag": "p", "text": "However, the published version of the Attack of the Clones script attributed Libkath's dialogue lines to Rune Haako, a character who had appeared alongside Gunray in Star Wars: Episode I The Phantom Menace, whereas the movie credits identified him as Senator Lott Dod, another Neimoidian from the previous movie. Still, the Neimoidian shown in Attack of the Clones neither resembled or sounded like Haako or even Dod. The official explanation by Lucasfilm Ltd. was that Rune Haako's original mask had been lost between the two movies and his character was attributed Daultay Dofine's mask instead."}, {"tag": "p", "text": "At the end of the day, despite his previous identification as Gilramos Libkath, it has since been firmly established that the Neimoidian with Gunray at Geonosis was indeed Rune Haako. With the release of Star Wars: The Complete Visual Dictionary, the mislabeled picture showing the two Neimoidians together was altered to reflect the change. Nonetheless, that retcon did not stop Gilramos Libkath from being established as a different character in Boba Fett: Hunted, the fourth book in a series of young reader novels that chronicled the adventures of a young Boba Fett."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}