{"url": "All_Terrain_Armored_Cargo_Transport", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:All Terrain variants", "Category:Galactic Empire walkers", "Category:Kuat Drive Yards products"], "nodes": [{"tag": "h1", "text": "All Terrain Armored Cargo Transport"}, {"tag": "p", "text": "The All Terrain Armored Cargo Transport (AT-ACT) was a larger version of the standard All Terrain Armored Transport combat walker that featured a dedicated cargo bed for the transportation of heavy building materials or combat munitions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The All Terrain Armored Cargo Transport was deployed at major Imperial construction projects, such as shipyards and sprawling research installations. Although the AT-ACT was not built for combat it was still capable of posing a formidable threat to infantry as discovered by Rebel troopers during the Battle of Scarif. The walker's taller profile gave it a faster stride than an AT-AT, although at the expense of structural stability. To give the knee joints extra strength when carrying cumbersome loads, an electromagnetic tensor field kept the overstressed motive assembly in smooth alignment. The cargo module housed within the AT-ACT's frame encompassed nearly 550 cubic meters of space and was capable of carrying raw material. Loads were carefully managed by stevedore droids who divided up partial holds of ultradense materials into manageable trips. Powerful engines and tensor field-supported legs kept the massive AT-ACTs moving forward, from mining sites to processing facilites, carrying cargo in situations where repulsorfields were unreliable or not suitable due to material incompatibilities."}, {"tag": "p", "text": "Despite the existence of AT-ACT drivers, the AT-ACT's design did not boast a specialized driver corps, as it was not technically designated a battlefield assault vehicle. Imperial combat assault tank pilots, AT-AT pilots, and other imperial combat drivers in the Imperial Military were all qualified to operate it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A number of AT-ACTs were stationed at the construction site of Fortress Vader. When an army of Mustafarians attacked the newly built fortress, the walkers defended it until a trio of Force-sensitive Mustafarians used the Force to flood the place with lava. Darth Vader was the sole Imperial survivor, using a fallen AT-ACT to escape the flooded plains."}, {"tag": "p", "text": "At least four AT-ACTs were present on Scarif in a battle against a squad of Rebel soldiers. When the Rebel incursion threatened the security of the Imperial security complex, Director Orson Krennic ordered the beach secured, and the ground crews seized this initiative to move their AT-ACTs into action. They proved resistant to the weapons of the Rebel troops, but took losses when faced with X-wings and U-wings. They, along with all the other Imperial and Rebel forces in the area, were destroyed when Wilhuff Tarkin ordered the Death Star to fire on Scarif."}, {"tag": "p", "text": "After the Battle of Endor, the walkers were among the forces deployed to defend Kuat Drive Yards during the New Republic's siege against the shipyards."}, {"tag": "p", "text": "At least one walker was stationed on the Mid Rim planet of Kashyyyk in the Black Forest before its liberation by the New Republic. By two years after the Battle of Jakku, the walker had fallen and was covered in fern and flowers, with plant stalks and small trees sprouting from its blown-open metal belly."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first footage of the AT-ACT was shown in the Rogue One: A Star Wars Story teaser trailer on April 7, 2016. The walker was identified as AT-ACT in a preview of the canceled reference book Rogue One: A Star Wars Story: The Official Visual Story Guide on May 17, 2016. The full name was first revealed in the third episode of The Star Wars Show on May 25, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}