{"url": "Gilthos_Uksaris", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Businesspeople", "Category:Individuals of unspecified species", "Category:Males", "Category:Twisted Rancor Trio Band Members"], "nodes": [{"tag": "h1", "text": "Gilthos Uksaris"}, {"tag": "p", "text": "Gilthos Uksaris was the founder and manager of The Twisted Rancor Trio."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gilthos Uksaris originally founded the Twisted Rancor Trio to earn a date with a young singer named Elinda. Scrambling to find musicians to complete the band, he discovered the Bith Ujaa, hiring him alongside his brother Ujii to form the first incarnation of the group."}, {"tag": "p", "text": "The band struggled in its early days due to Ujaa's mediocre skills as a musician. The frustrated Elinda eventually threatened to quit if Ujaa was not dismissed. Unwilling to lose her, Uksaris acquiesced, firing Ujaa and replacing him with another Bith Loopa. This development displeased Ujii who followed his brother out of the band. To fill this vacancy, Uksaris agreed to Loopa's recommendation Fodo."}, {"tag": "p", "text": "This new composition of the Twisted Rancor Trio proved far more successful than its predecessor, and it soon began to rise in prominence. On Taris, its homeworld, the band was especially popular, as the public greatly admired Elinda's voice."}, {"tag": "p", "text": "Such was their growing reputation that around 3956 BBY they attracted the attention of the powerful businessman Davik Kang, who was in actuality the head of the crime syndicate the Exchange. Kang invited the band to play at his estate, but while Kang's connections to the Exchange were not expressly known to the public, enough rumors abounded that Elinda became fearful of performing for him. Indeed, Elinda and Uksaris both knew that if the band did not perform to the satisfaction of Kang, the crime lord's infamous temper could have dire consequences for their lives. Unlike Elinda, however, Uksaris was not intimidated by this prospect, believing that the opportunity of being propelled to stardom by Kang's sponsorship far outweighed the risks. Nevertheless, he was unable to dissuade Elinda from abandoning the band in the face of this invitation, and the group's existence threatened to crumble."}, {"tag": "p", "text": "As a last minute solution, Uksaris replaced Elinda with her sister Ashana on the eve of the scheduled performance."}, {"tag": "p", "text": "In 3956 BBY, Uksaris was in the process of writing a book detailing the history of the band titled Guts and Glory: A Chronicle of The Amazing Story of The Twisted Rancor Trio. That same year, a friend delivered a package to him containing 50 credits and a suit of Echani fiber armor, all of which was placed inside a security crate protected by a Holo-Sec Corp anti-theft explosive at an apartment in the Lower City. With this delivery was a message from the friend reminding him that to disarm the trap and open the box safely, he only had to activate the surrounding holoprojectors of the members of the Twisted Rancor Trio in order of their recruitment, a task meant to be easy for him as he was the band's manager. The friend also expressed apprehension over Uksaris's choice to replace Elinda with Ashana, in light of the danger of incurring Kang's wrath should Ashana ultimately prove to be unable to fill in for her sister, and wished him good luck on his band's performance."}, {"tag": "p", "text": "Unfortunately for Uksaris, the Republic soldier Revan during the Sith quarantine of the planet discovered the crate himself and retrieved its contents for his own use when he visited the apartment. The draft of Guts and Glory left on a datapad on a nearby table easily provided him with the correct order of the band to disarm the trap."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gilthos Uksaris's existence and life is known only through the draft of Guts and Glory: A Chronicle of The Amazing Story of The Twisted Rancor Trio found by the player, Revan, in the video game Star Wars: Knights of the Old Republic. The unfinished chronicle only details up until the eve of the band's scheduled performance for Davik Kang, and as such the success or failure of Uksaris's plan to replace Elinda with Ashana is unknown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}