{"url": "Gimlet", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Individuals of unidentified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gimlet"}, {"tag": "p", "text": "Gimlet was the partner of \"Weapons Master\" Giles Durane. He and his partner Durane had been hired by Bail Organa to train his daughter, Leia Organa, in the use of weapons. Traveling to Challon after her training was complete, he was killed by Torgas, an assassin, when he attempted to warn Princess Leia that Durane was now out to kill her."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During Princess Leia Organa's first term as Imperial senator, Gimlet was the partner of Giles Durane. They were hired by Bail Prestor Organa to train Leia with weapons on Challon. Upon Princess Leia's arrival they discovered that the reporter for the Holopix News recording her visit was actually an assassin. They killed him before he could kill Leia. Once they showed her the weapon that was almost used to kill her, they explained that they were hired by her father."}, {"tag": "p", "text": "They started training Princess Leia shortly thereafter. Gimlet, having a strong sense of smell, noticed three assassins on board their ship when they got on. Giles wanted to give Leia some hands-on training, so they let the assassins think they were getting the jump on them. Once Giles and Gimlet took care of the assassins, Gimlet got upset by the grenade used to kill the last one. After Leia was done with her training, she went back to Challon. Between the training and the party being held by Tchai, Giles was hired by General Emir to kill Leia himself, as well as the leader of the Assassins Guild, Torgas. During the party with Tchai Leia received word that Gimlet wanted to talk to her. On her way to meet him, she was attacked by Torgas. Gimlet ran into the battle and was shot and killed by Torgas. Leia then attempted to get his blaster, when Giles killed Torgas. Leia and Giles briefly mourned Gimlet's death, but then Giles attempted to assassinate Leia himself and was killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although most of the panels in The Weapons Master! show Gimlet having red eyes with black pupils, one panel (the one shown here) shows him with more conventional eye coloration."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}