{"url": "Gina_Moonsong", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance Fleet officers", "Category:Blade Squadron personnel", "Category:Coruscanti", "Category:Females", "Category:Humans", "Category:New Republic Defense Fleet officers"], "nodes": [{"tag": "h1", "text": "Gina Moonsong"}, {"tag": "p", "text": "Gina Moonsong was a human female who was a smuggler on Coruscant and later served in the Alliance to Restore the Republic during the Galactic Civil War as a pilot. She was a member of Blade Squadron and was in a secret relationship with Lieutenant Braylen Stramm. She participated in the climactic Battle of Endor, flying a B-wing fighter, and succeeded in her mission to destroy the Imperial-class Star Destroyer Devastator."}, {"tag": "p", "text": "She later got promoted to the rank of lieutenant and was awarded the Medal of Bravery. She participated in the Battle of Malastare. In the battle, Moonsong disobeyed Stramm's orders and along with two other pilots destroyed Moff Valco Pandion's palace on Malastare."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Endor"}, {"tag": "p", "text": "Originally a smuggler, Gina Moonsong became a part of Adon Fox's Blade Squadron, in the waning days of the Galactic Civil War, with the rank of cadet. She was in a secret relationship with Lieutenant Braylen Stramm, which Fox suspected. When the Alliance decided to attack the Galactic Empire at Endor and destroy its unfinished superweapon, the DS-2 Death Star II Mobile Battle Station, the Blade Squadron was assigned to a rearguarding mission, much to Moonsong's annoyance."}, {"tag": "p", "text": "However, as soon as the Alliance Fleet made its entry in the Endor system from hyperspace, it became evident that the Empire had sprung a trap, as an armada of Imperial Star Destroyers had been waiting there. The rearguarding mission was immediately aborted, and Moonsong got an occasion to go into the kill-zone. When Blade Squadron faced the Star Destroyer Devastator, which had once killed Fox's wife, Moonsong's commander ordered to start an attack run on that ship."}, {"tag": "p", "text": "Moonsong along with her squadron engaged in a battle with a large number of incoming TIE/IN interceptors. After a long fight she thought of a plan to attack the Devastator and send the data to Stramm and Fanty, two of the few remaining members of the squadron. However Fanty's targeting system had crashed so he told Moonsoong to go on without him. The TIE Interceptor's that were on her tail were blown up by Stramm. She locked flight paths with him and together they launched proton torpedoes which hit the weak points in the Devastator's navigation shielding. This resulted in the destruction of the Star Destroyer."}, {"tag": "h4", "text": "After Endor"}, {"tag": "p", "text": "After the Battle of Endor, Moonsong got promoted to the rank of lieutenant. She, along with other B-wing pilots who had survived the Battle of Endor, was awarded the Medal of Bravery, but she felt that the medals should be given to the pilots who had lost their lives in the battle. She continued her relationship with Stramm who was made the commander of Blade Squadron. Some time later three new cadets - Yori Dahn, Jordan Karls, Cutter Poole - joined Blade Squadron. She interviewed them and got in a little argument with Poole. She then introduced Fanty to them and told them that their training would start the next day at oh-six hundred."}, {"tag": "h4", "text": "Malastare"}, {"tag": "p", "text": "Sometime later, Stramm told her that their next target was an Imperial communications hub on the planet Malastare. When Moonsong observed on the map that Malastare was shielded, he told her that the shield generator was next to the target and according to Admiral Ackbar's technicians they could take them both out at the same time by creating a temporary aperture. Gina asked him about the locale planetside on the map, and Stramm told her that it was the vacation palace of Moff Valco Pandion, who was the head of a slaver cartel. Moonsong insisted that they should destroy the palace, but Stramm disagreed, saying that they should be disciplined and careful. He added that they weren't sure whether the Moff was in the palace, and he didn't want to put anyone's life at risk going after him. When Moonsong continued arguing, Stramm told her to follow her orders."}, {"tag": "p", "text": "According to the plan, Blade Squadron attacked Malastare and successfully passed through the planetary shield; however, Karls's B-wing caught the electromagnetic surge of the shield and exploded. Poole reported that he counted at least a dozen TIE Fighters inbound. Stramm and his B-wings peeled off from the rest of the squadron to attack the shield generator while Moonsong led them toward the incoming TIE Fighters. In the battle that followed, Poole was shot down by a TIE Pilot whom Moonsong in turn killed. However, the payback didn't bring her any solace."}, {"tag": "p", "text": "Stramm succeeded in destroying the shield generator and the communication hub and ordered the squadron to head to the rendezvous point. Moonsong told Fanty to take Yori to the rendezvous, but he told her that he was staying with her. She told them her plan to attack the Moff's palace, and she along with Fanty and Yori plunged towards the ground. Stramm ordered her to return but she ignored him. The three pilots launched the proton torpedoes at the palace and destroyed it. Gina's instruments went dark, and she kept accelerating upwards, thinking of the reception she would get from Stramm if she made it back."}, {"tag": "h4", "text": "Kuat"}, {"tag": "p", "text": "Following the action at Malastare, Blade Squadron was assigned to participate in the assault on Kuat Drive Yards, a major shipwright and military supplier for the Empire. The battle lasted for several days with neither side being able to gain an advantage. After Blade Squadron's commanding officer Captain Tane was reassigned to Combat Operations Planning, Lieutenant Moonsong was made the new acting leader of Blade Squadron."}, {"tag": "p", "text": "Gina and her fellow pilots attended a briefing aboard the MC80 Star Cruiser Amalthea chaired by her former lover Commander Stramm, who had ended the relationship to avoid being in a position of having to send her to her death in combat. Since the New Republic fleet lacked the firepower to overwhelm the Imperial defense fleet with a single strike, Stramm proposed launching surgical strikes on key parts of the shipyard's infrastructure including fuel dumps, supply monorails and sensor arrays. For the mission, Gina's Blade Squadron would be escorted by X-wing starfighters led by Lieutenant Sandara Li. Meanwhile, the rest of the New Republic fleet would engage the Imperial Star Destroyers to keep them occupied."}, {"tag": "p", "text": "Following the briefing, Gina led the assault on a supply monorail, which was defended by several Imperial walkers. Against Gina's orders, Lieutenant Li and her X-wing's peeled off from the B-wing bombers to attack an area covered with turbolaser batteries and walkers. Li's armament was unable to destroy the targets, so Moonsong and her fellow B-wing flyers were forced to sacrifice her ordnance to save her less experienced comrades. During the bombing run, one of Moonsong's fellow B-wing pilots was killed. After disabling the monorail, Gina and her fellow flyers returned to the Amalthea."}, {"tag": "p", "text": "Back at the Amalthea, Moonsong confronted Li and reprimanded her for disobeying her orders to protect the B-wings from the TIE fighters. When Li suggested that Moonsong was made acting squadron leader because her boyfriend Tane handed her the command, Moonsong responded that she had been given this command in spit of Stramm's recommendation. She explained that she had stepped up to lead her squadron after Tane was transferred to planning operations. Gina told Li that she was good pilot but that she lacked the experience to have known that her armament would not have scratched the walkers. Gina reminded Li that they were fighting together to defeat the Empire and the two made peace with a handshake."}, {"tag": "p", "text": "Later in the campaign, Moonsong's Blade Squadron and two other B-wing squadrons attacked the Imperial command hub while the rest of the New Republic fleet engaged the Imperial fleet above Kuat's north pole. Despite New Republic efforts to draw the Imperial fleet away from the command hub, the Imperials managed to scramble enough TIE fighters to deal with the B-wing attack force. While Lieutenant Li's X-wings engaged the TIEs, Moonsong and her B-wings attacked the command hub with laser-guided bombs and torpedoes."}, {"tag": "p", "text": "After returning to the Amalthea, Gina learnt that her former boyfriend Commander Stramm would be flying an X-wing for their next mission since the X-wing pilot Johan Volk was in the infirmary. Despite the bitterness stemming from their breakup, Gina accepted Stramm's request to fly together for their next mission. During the next engagement, the New Republic and Imperial fleets engaged in battle formation. Escorted by Stramm and Li's X-wings, Moonsong and her fellow Blade Squadron flyers bombed the hangar of an Imperial light carrier."}, {"tag": "p", "text": "Moonsong and her comrades were about to aid the beleaguered carrier Amalthea when they learned that Kuat Drive Yard's commander Moff Pollus Maksim had surrendered. Gina and her fellow pilots returned to their ship to regroup and rest."}, {"tag": "h4", "text": "Jakku"}, {"tag": "p", "text": "In 5 ABY, Moonsong led Blade Squadron in the Battle of Jakku. Although she and her wingmates managed to destroy the engines of the Executor-class Star Dreadnought Ravager, Moonsong's craft was badly damaged and she crashed on the surface of the planet below."}, {"tag": "p", "text": "After joining forces with Phantom Squadron's Temmin Wexley and a depleted group of Rebel soldiers, she led an attack on an Imperial supply convoy and used the vehicle's transmitter to call for assistance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}