{"url": "All_Terrain_Armored_Transport_(Galactic_Civil_War)", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:All Terrain Armored Transport variants", "Category:Galactic Empire walkers", "Category:Kuat Drive Yards products"], "nodes": [{"tag": "h1", "text": "All Terrain Armored Transport  (Galactic Civil War)"}, {"tag": "p", "text": "This model of All Terrain Armored Transport was used during the Galactic Civil War. It replaced its larger predecessor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The All Terrain Armored Transport was an imposing, heavily armored, quadrupedal combat walker of the All-terrain vehicle line that stood 22.5 meters tall and could move 60 kph. Its impressive appearance made it useful as much for psychological effect as for tactical reasons. It also served as transport for combat personnel. The vehicle's cockpit and sensor array were located in the \"command pod\" or \"head\" part of the walker, which also carried spotlights and the main armaments: dual Piperii-Cerlurn R-90C medium blasters located on the sides or \"temples,\" and a pair of heavier Taim & Bak MS-1 heavy blaster cannons fitted on the \"chin.\" Inside the cockpit stood a vehicle commander behind two AT-AT pilots who controlled the walker's movement. Other standard personnel included an engineer and loadmaster. AT-AT pilots and personnel wore specialized suits in case the walker's pressurized cockpit was smashed open in hostile environments. However, the neck and joints were weak spots and could be damaged by blaster cannons and other heavy weaponry. The entire walker was vulnerable to other AT-AT fire if one happened to be hijacked and turned against the other."}, {"tag": "p", "text": "Connecting the \"head\" to the \"body\" was what was dubbed the \"tunnel,\" which led to a troop compartment capable of ferrying numerous soldiers, along with a vehicle bay at the walker's rear that held five 74-Z speeder bikes. The main, rectangular troop hatch was located in the middle of the walker's side, two smaller escape hatches were located both to the main hatch's immediate left and right, and the auxiliary hatch was located in the walker's underside. The walker's tail end consisted of filtered atmosphere intakes on its upper part, while a blaster cannon energizer was located within. At the bottom of the behemoth was the walker's fuel slug tank, which had a reputation of being dangerous. The walker's four legs were aided by ankle drive motors, while inside the giant footpads were several terrain scanners."}, {"tag": "p", "text": "The Elite AT-AT, a more heavily armored variant with a darker color scheme, was based on the body of this version."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "This model succeeded the model used in the pre–Galactic Civil War conflict against the rebellion. Plans for this version existed as early as 4 BBY."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Following the Battle of Yavin, the Alliance to Restore the Republic stole a number of AT-ATs and provided them to Saponza's Gang."}, {"tag": "p", "text": "During the Rebel assault on the Imperial weapons factory moon of Cymoon 1, a group of Rebels led by Han Solo and Leia Organa stole an AT-AT from Weapons Factory Alpha. They used the walker to escape from the factory after they sabotaged its main power core to explode. During their escape, Solo fired a shot that nearly killed the Sith Lord Darth Vader, using the AT-AT's powerful quad laser cannons. Soon after, Vader overtook the Rebels in their escape and cut down the massive walker's back left leg. The AT-AT fell tremendously, and its passengers barely escaped the wreckage before fleeing Cymoon 1 entirely for the safety of the Alliance Fleet."}, {"tag": "p", "text": "During the Battle of Hoth, General Maximilian Veers led a squadron of at least five AT-ATs on the icy fields of Hoth to knock out the shield generator that protected Echo Base, the Rebel headquarters. The triumph of Veers' squadron allowed the Imperials to invade Echo Base and rout the Rebels, striking a major blow in the war. However, the battle also revealed that the AT-ATs could be toppled by a cable wrapped around their legs. Although that weakness had been used effectively by the Alliance on Hoth, the Empire continued to use these mechanical behemoths in the later stages of the war, employing them in several skirmishes on Tatooine."}, {"tag": "h3", "text": "Rise of the First Order"}, {"tag": "p", "text": "Decades after the war, a young scavenger named Rey used one of the downed AT-ATs, designated Hellhound Two, as her home on Jakku."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}