{"url": "All_Terrain_Attack_Pod/Legends", "categories": ["Category:Legends articles", "Category:All Terrain variants", "Category:Alliance to Restore the Republic vehicles", "Category:Galactic Alliance vehicles", "Category:Galactic Empire walkers", "Category:Galactic Republic walkers", "Category:Hutt Cartel vehicles", "Category:Kuat Drive Yards products", "Category:Zann Consortium vehicles"], "nodes": [{"tag": "h1", "text": "All Terrain Attack Pod"}, {"tag": "p", "text": "The All Terrain Attack Pod (AT-AP), or Pod Attack Walker (PAW), was a tripedal walker that evolved from the AT-PT and AT-TE walkers towards the end of the Clone Wars. They were used by the 327th Star Corps, 91st Reconnaissance Corps, 41st Elite Corps, 282nd Regiment, 121st Regiment, 96th Regiment, 76th Regiment, 212th Attack Battalion, among other units in Grand Army of the Republic and Imperial army."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The AT-AP (All Terrain Attack Pod) was conceived as a means of transporting a piece of heavy artillery across the battlefront. Its main function was to serve as a mobile gun platform used for shelling enemy positions, rather than attacking troops or other vehicles. It featured highly-advanced targeting systems that led to it being nicknamed the \"sniper tank.\" Although classified as a two-legged walker, the AT-AP did have a third leg hanging from underneath the fuselage designed to help stabilize the walker. It would extend and deploy at the operator's discretion: typically when overcoming rough terrain or firing its main gun."}, {"tag": "p", "text": "The AT-AP was armed with a mass-driver cannon fixed to the front of the craft, a heavy blaster cannon mounted on a turret (which had an open-cockpit, making the gunner susceptible to enemy infantry fire), and a medium laser cannon at the bottom of the main fuselage. Behind the main weapon's gunner's saddle was a supply cage filled with tools necessary for repairing any mechanical failure to the walker's articulation assembly."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "As the Clone Wars raged on, the Galactic Republic's army commanders recognized a need to build up and diversify their walker armor. One of the new designs that emerged from the Republic's think-tanks was the AT-AP, an artillery walker based off the fore compartment of the AT-TE."}, {"tag": "p", "text": "Although armored, the AT-AP was too specialized to be used on its own in direct combat. It and other gun batteries of this type would usually be accompanied by heavier equipment, such as AT-TEs, Tridents and HAVw A6 Juggernauts on the battlefield. In the waning days of the Clone Wars, the AT-AP found extensive use in multiple Outer Rim theaters."}, {"tag": "p", "text": "A great number of these walkers were attached to the 41st Elite Corps in the Battle of Kashyyyk, where they helped defend the city of Kachirho alongside the A6 Juggernaut. They found similar application on planets like Saleucami and Felucia, the former under the command of Stass Allie and the latter with Aayla Secura alongside AT-OTs and ISPs."}, {"tag": "h3", "text": "Later use"}, {"tag": "p", "text": "During the Galactic Civil War, some of the Galactic Empire's AT-APs were manufactured by formerly abandoned factories out on the fringe, leading to Rebel forces hijacking lines and getting some of the walkers."}, {"tag": "p", "text": "Some AT-APs also fell into the hands of pirates, the Hutt Cartel, and other groups such as the Zann Consortium, leading to skirmishes and outright battles against either Rebels or Imperials. Hutt Palaces were also known to keep the walkers among their stocks of Clone Wars surplus."}, {"tag": "p", "text": "AT-APs saw extensive use on Kashyyyk, fighting alongside AT-KTs in the ongoing conflict with Wookiee insurgents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "LEGO has released three versions of the AT-AP Walker with green markings in 2008, 2014, and, most recently, in 2019, with set numbers 7671, 75043, and 75234 respectively."}, {"tag": "p", "text": "The AT-AP was also the first \"Air Support\" vehicle to be available in 2011's Lego Star Wars III: The Clone Wars video game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}