{"url": "Giran", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Character stubs", "Category:Desilijic servants", "Category:Kadas'sa'Nikto", "Category:Males"], "nodes": [{"tag": "h1", "text": "Giran"}, {"tag": "p", "text": "Giran was a male Kadas'sa'Nikto who served in Jabba's Palace on Tatooine. He, along with Malakili, was very fond of Jabba's rancor, Pateesa. Both Giran and Malakili, were stationed by the rancor's pen when Luke Skywalker entered Jabba's Palace and attempted to negotiate with the Hutt Crime Lord. When this failed and Luke was thrown into the pit, he tried to escape through a door on the other side of the confines. Upon opening it he found it barred from the other side."}, {"tag": "p", "text": "Giran and Malakili were on the other side play fighting over some food. When they saw Skywalker both of them drove Luke back (with a spear and knife respectively) so that Pateesa could feast upon the prisoner. Unfortunately, as the rancor ambled towards him, Skywalker noticed a panel on the adjacent wall, which controlled the gate used to contain the beast. The pair could only watch helplessly as, using a nearby skull in conjunction with the Force, Luke destroyed the panel, causing it to short circuit and bring the gate crashing down on Pateesa's skull. The rancor cried out in shock, struggled for a second and then died quickly."}, {"tag": "p", "text": "Upon seeing this and with Malakili urging him to hurry via silent jabbing, an enraged Giran opened the gate and rushed to restrain Skywalker, cursing him all the while. Malakili pushed the two apart in a desperate bid to get the rancor, but Giran quickly restrained Luke again and handed him over to another of Jabba's guards."}, {"tag": "p", "text": "By now Malakili had confirmed that the beast was dead. Giran saw as much on his friends face. Distraught by this, all Giran could do was put his arm around his friend, whispering words of comfort as the pair openly wept for the Rancor that was killed by Luke Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}