{"url": "Givin/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Givin culture", "Category:Givin", "Category:Inner Rim species", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Givin"}, {"tag": "p", "text": "The Givin were the indigenous sentient species of the planet Yag'Dhul. They were best known for their natural mathematical ability which made them expert starship builders and astrogators. Other notable features of the Givin were their skeletal appearance, and their ability to survive in a vacuum."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Givin appeared to be living humanoid skeletons, because of their hard, pale white \"skin\" and deep sunken black eyes. Though they had four- or five-fingered hands, they had three-toed feet. They carried their arms and legs \"held out\" from their bodies, making their appearance even more bizarre. Some likened their stance to Twi'lek string puppets."}, {"tag": "p", "text": "Due to a complex system of moons that created atmospheric tidal upheavals on Yag'Dhul, the Givin evolved a hard exoskeleton that could seal all external orifices to protect against sudden depressurization and temperature changes. It also provided protection from physical harm. Thus, Givin had a phobia of exposed skin, and would avoid seeing it in others whenever possible. In order to maintain this sealed system, Givin needed to eat approximately three times more than Humans of the same mass. Givin could easily survive in a total vacuum for a standard day."}, {"tag": "h2", "text": "Culture"}, {"tag": "p", "text": "Givin were highly intelligent, and had such a propensity for mathematics that their society was ruled over by a mathematical theocracy, or mathematocracy, with the greatest mathematicians serving in the ruling Body Calculus. Their mathematical skills were, like their sealed exoskeletons, adaptations to Yag'Dhul's complex tidal systems—their mathematics were developed to predict Yag'Dhul's randomly shifting oceans and atmosphere. The planetary governor of Yag'Dhul was decided by contests that involved calculations of complex multidimensional differentials, and all political decisions were based on null-modal probability."}, {"tag": "p", "text": "They spent as much time designing their starships mathematically as it took to build them,[source?] and so created some of the most impressive, complex, and sleek ships in the galaxy. Often, other species would need to modify a purchased Givin starship, installing a navicomputer or pressurization system which would often be left out as unnecessary by the Givin, who could survive in a vacuum and mentally calculated navigational vectors."}, {"tag": "h3", "text": "Sample Givin names"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Givin lent their mathematical, engineering, and navigational talents to the Confederacy of Independent Systems, producing such designs as the Wavecrest-class frigates. Givin theoretical astrogators were highly sought after and some were recruited by the Republic during the conflict. The shipyards of the Givin were apparently destroyed during or after the Clone Wars.[source?] By the time of the Yuuzhan Vong War, the Givin shipbuilding industry had recovered and was producing highly advanced ships for both military and civilian purposes. Yag'Dhul was attacked once by the Yuuzhan Vong, but never again. Afterward, ambassadors to the planet made sure they underwent extensive education in mathematics before negotiating with the Givin."}, {"tag": "h2", "text": "Givin in the galaxy"}, {"tag": "p", "text": "While they respected other shipbuilding species such as the Verpine and the Duros, they disliked the Mon Calamari due to differences in design philosophy. They also tended to be subtly arrogant toward other species who could not survive in a vacuum (Duinuogwuin being the major exception). Finally, since non-Givin often failed to solve the simple quadratic equations used as introductions in polite Givin society, Givin found most aliens to be rather rude."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to the Elis Helrot action figure by Hasbro, the Givin physiology features three-toed feet."}, {"tag": "p", "text": "The PC game Star Wars: Rebellion refers to the species as \"Yag'Duhls.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}