{"url": "Gizka/Legends", "categories": ["Category:Legends articles", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Reptiles", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Gizka"}, {"tag": "p", "text": "Gizka were small reptiles that could be found all across the galaxy."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Whatever their native world, their extraordinary reproduction rate led to a fair amount of gizka on many worlds, even including uncharted planets such as Lehon, finding their way from the wreckage of crashed starships. It has been alternatively postulated that they came from that planet originally, spreading along with the Infinite Empire. Their exponential population growth led to them being considered pests on almost as many worlds as they inhabited, as they commonly ate electrical wiring."}, {"tag": "p", "text": "They were the source for the delicacy gizka steak. Some species of sentient carnivores, like Trandoshans, seemed to think that gizka were one of those kinds of animals that \"everything tastes like.\""}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Ebon Hawk once played host to a temporary colony of gizka, in an incident involving mishandled cargo, an Aqualish and a Tatooine shipping company."}, {"tag": "h2", "text": "Gameplay"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic, the gizka can be eliminated on board the Ebon Hawk using a pellet called Gizka poison. This poison can be obtained from various traders, most notably the alien trader at the Tatooine dock. Feed one gizka with the poison and it will attack and spread the lethal effect to its species-mates, and the \"Trouble with Gizka\" quest is complete."}, {"tag": "p", "text": "Another way to get rid of the gizka is to pay Nubassa in the docking area on Manaan to help remove the gizka. A dark-sided character can force their way to getting him to take them for free, or to pay you for them. If the player is patient enough to wait until they arrive on the Unknown World, the gizka will leave the ship on their own, presumably due to the planet possessing a favorable environment for them."}, {"tag": "p", "text": "A gizka can be found on Yavin Station even before they are on the player's ship. It can be killed for dark side points."}, {"tag": "p", "text": "Revan can interact with the gizka on the Ebon Hawk. If you chose to strangle them, they reproduce quickly."}, {"tag": "p", "text": "In Star Wars: The Old Republic gizkas of different colours can be obtained by players as passive non-combat pets from various Cartel Market packs."}, {"tag": "h2", "text": "Continuity issues"}, {"tag": "p", "text": "In the The Complete Star Wars Encyclopedia, gizka are referred to as a \"fish\" which was prized by the Selkath of Manaan rather than a reptilian species. The species, according to the encyclopedia, is said to have possibly evolved from a more rabid native on Lehon about four millennia prior to the Galactic Civil War. This time frame would place the evolution of the gizka about the time Revan encountered them during his travels. Additionally, the encyclopedia states that Lehon was possibly the homeworld of the gizka. While the latter statement does not directly contradict canon, it canonizes the unknown origins of the species and the in-universe speculation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"The Trouble with Gizka\" is a play on the classic Star Trek episode \"The Trouble with Tribbles\", where Tribbles also have a very fast reproductive rate."}, {"tag": "h3", "text": "Team Gizka"}, {"tag": "p", "text": "The term \"gizka\" has been used outside the Star Wars universe, as the animal became the mascot and namesake of Team Gizka, the organization responsible for the Sith Lords Restoration Project, a modding project for Star Wars: Knights of the Old Republic II: The Sith Lords. It appears the team has indefinitely disbanded."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}