{"url": "Glas", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:IPV-1 System Patrol Craft", "Category:Ripoblus starships"], "nodes": [{"tag": "h1", "text": "Glas"}, {"tag": "p", "text": "The Glas was an IPV-1 System Patrol Craft that was used by the Ripoblus during the Imperial era. In 3 ABY, it was hijacked by a group of Ripoblus scientists who were growing disenchanted with the Sepan Civil War, and wished to seek asylum with the Galactic Empire. Since the Glas had no hyperdrive, the Victory I-class Star Destroyer Protector arrived in the Sepan system to dock with the craft. Though the Ripoblus sent their own fighters to stop the scientists from escaping, the Glas docked successfully with the Imperial warship, and was abandoned."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As an IPV-1 System Patrol Craft, the Glas was 150 meters in length, and could reach speeds of up to eighty megalights per hour. In terms of defense, its deflector shield strength was at 150 SBDs, with hull integrity at fifty RU. The Glas was also armed with three laser cannon turrets, and one rear-mounted turbolaser. To the disadvantage of the scientists who hijacked it in 3 ABY, it was not equipped with a hyperdrive."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The system patrol craft Glas was owned by the Ripoblus government, and was in their service during the Imperial era. In 3 ABY, during Admiral Harkov's attempts to diffuse the Sepan Civil War, a select group of scientists from Ripoblus grew weary of the conflict and wished to distance themselves from it as much as possible. They were mainly dissatisfied with the manner in which their research was being used by their government, and no longer wished to contribute to the war. Hijacking the Glas and the shuttles Nazaar 1 and Nazaar 2, the scientists sought refuge with the Imperial forces in the sector. As the Glas had no hyperdrive system, Harkov's flagship, the Victory I-class Star Destroyer Protector, journeyed to its location. The scientists arranged to have the Glas dock with the Protector to allow a transfer of personnel, but before the stolen patrol craft could reach the Star Destroyer, fighters sent by the Ripoblus government entered the system."}, {"tag": "p", "text": "As Ripoblus BTL Y-wing starfighters from Able Squadron, as well as the Lambda-class T-4a shuttles of Lambda Group bore down on the Glas, the Protector launched TIE/IN interceptors to fend them off. Eventually, the Dimok, enemies of the Ripoblus, sent their own fighters to attack the Glas. Their attack force mirrored that of the Ripoblus, as they dispatched Y-wings from Baker Squadron and shuttles from Sigma group. The Dimok were also intercepted by the Imperial fighters, one of which was piloted by ace Maarek Stele. The Glas successfully docked with the Protector, transferring the scientists, while placing a set of decoys aboard the starship. Abandoned, the patrol craft was set on autopilot and sent out into space, though it was still considered a potential target by the enemy. Delta-class JV-7 escort shuttles from the Ripoblus arrived, but they were far too late to capture the scientists. Meanwhile, Nazaar 1 and Nazaar 2 successfully entered the hangar of the Imperial warship. Due to his role in protecting the Glas, Stele was given a promotion to lieutenant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Glas first appeared in Lawrence Holland's Star Wars: TIE Fighter, written by David Wessman. It was also mentioned in TIE Fighter: The Official Strategy Guide, written by Wessman, Rusel DeMaria and David Maxwell. The ship was later given an entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}