{"url": "All_Terrain_Missile_Platform/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:All Terrain variants", "Category:Galactic Empire walkers", "Category:Kuat Drive Yards products"], "nodes": [{"tag": "h1", "text": "All Terrain Missile Platform"}, {"tag": "p", "text": "The All Terrain Missile Platform (AT-MP) was a bipedal walker similar to the standard AT-ST."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Despite its stunted appearance compared to the AT-ST, the AT-MP more than compensated for its awkward proportions with its firepower, which consisted of 8 missile launchers and a centrally-mounted rotary chaingun."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The AT-MP was in service by 2 BBY, with Rebel forces encountering them at the Battle of Corrdair. The somewhat comical appearance of the AT-MP was initially a source of amusement for the Rebels. However the Rebels stopped laughing when the AT-MPs unleashed their missiles."}, {"tag": "p", "text": "A number of these walkers were part of the Imperial garrison on the planet Kamino. Two of these remained at the landing pad of Darth Vader's TIE Advanced x1 in order to guard it, but were destroyed by a clone test subject of Galen Marek during his escape from Kamino."}, {"tag": "p", "text": "When the clone Marek landed on Cato Neimoidia at Tarko-se, several AT-MPs were dispatched by Baron Merillion Tarko to attack the Force-sensitive, but were destroyed when their missiles were deflected back at them by Marek during his attempt to rescue his predecessor's Jedi mentor, Rahm Kota."}, {"tag": "p", "text": "Marek also encountered AT-MPs during the Assault on Kamino. AT-STs and AT-MPs were brought on board the Salvation through the use of Imperial Boarding Pods which clamped themselves on the side of the Salvation, but Marek destroyed them all. He also faced them in Timira City on Kamino in his search for Darth Vader and the captured Juno Eclipse."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The AT-MP bears a resemblance to the Clone Personal Walker from Star Wars: Galactic Battlegrounds: Clone Campaigns - the cockpit area in particular - which may indicate the AT-MP is descended from that design."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}