{"url": "Glee_Anselm", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Glee Anselm locations", "Category:Jungle planets", "Category:Mid Rim planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Glee Anselm"}, {"tag": "p", "text": "Glee Anselm was an ocean planet located in the Jalor system of the galaxy's Mid Rim that was the homeworld of the Anselmi and Nautolan species. Star Tours, a tour company, offered vacation tours of Glee Anselm during the Clone Wars. During the reign of the Galactic Empire, senators representing the planet in the Imperial Senate were fiercely loyal to the Empire. Glee Anselm was also the homeworld of the criminal Tobias Beckett and the Jedi Master Kit Fisto."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Glee Anselm was a planet located in the Jalor system within the galaxy's Mid Rim. The planet's surface was covered in water, and it had no major landmasses. No light reached the depths of the world's oceans, making the Nautolan people evolve to have dark eyes that could see details in the oceans' darkness. The small islands dotting its oceans held jungles, mountains, beaches, and grassy fields."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "According to legend, Glee Anselm used to have a continent with life until it sank to the seabed thousands of years before the fall of the Galactic Republic."}, {"tag": "p", "text": "Prior to the start of the Clone Wars, Grand Master Yoda of the Jedi Order helped to organize a test for Jedi Master Obi-Wan Kenobi and his Padawan, Anakin Skywalker, which involved the pair searching for him on Glee Anselm."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Glee Anselm was the home to two sentient species, the Anselmi and Nautolan. The Anselmi lived on land while the Nautolans lived in the water. The Anselmi resented their aquatic cousins, whom the Anselmi referred to as \"gill heads,\" and sought to dominate. The planet was also inhabited by humans and creatures including lizard-gulls, whales, and the wooriid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Glee Anselm was first mentioned in the Star Wars Legends novelization and junior novelization of Star Wars: Episode II Attack of the Clones, which were written by R. A. Salvatore and Patricia C. Wrede, respectively, and were both released in 2003. The world was confirmed to be canon in the Star Wars: The Clone Wars episode \"Children of the Force,\" in which it was mentioned by Mace Windu and later was shown in hologram in the Xanadu Blood's fuel computer."}, {"tag": "p", "text": "The Clone Wars team had considered showing Glee Anselm in physical form in the episode: concept art was drawn depicting the Nautolans living in cities on the backs of enormous turtles that surface for breath every few centuries."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}