{"url": "Glenk", "categories": ["Category:Legends articles", "Category:Kubaz", "Category:Males", "Category:Sith of the New Sith Wars", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Glenk"}, {"tag": "p", "text": "Glenk was a male Kubaz Sith who was a member of Lord Odion's Novitiates during the Republic Dark Age. However, he actually worked for the Sith Lord Daiman and infiltrated the Novitiates in order to keep an eye on Kerra Holt for Daiman. His team of Novitiates was handpicked by Odion to resume Project Pandemonium which sought to recover the ancient Sith artifact known as the Helm of Ieldis; a superweapon capable of driving sentient beings into a homicidal frenzy. He was present during the fighting on Skarpos and the invasion of Sarrassia. He disappeared following the invasion of Sarrassia and reported his intelligence findings to Daiman, who sought to claim the Helm for himself. Glenk was present during the three-way Second Battle of Skarpos where he fell under the effects of the Helm and tried to kill Daiman. However, Daiman struck him with Force lightning and he plummeted to his death beneath the Morbollon Mesa."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Glenk was a member of Lord Odion's Novitiates, an elite corps of dark side-wielders who adhered to Odion's nihilistic ideology. In reality, he was an agent of the Sith Lord Daiman, Odion's estranged younger brother who was locked in a family feud with his older brother. In 1032 BBY, he was assigned by Daiman to follow the Jedi Knight Kerra Holt and to keep an eye on her for Daiman. With Daiman's cooperation, Kerra had infiltrated the Odionate under the disguise of a young Novitiate named \"Mercy\". Daiman had experience apocalyptic visions of a tribulation emanating from Odion's realm and needed help to stop him, even from his nominal Jedi opponents."}, {"tag": "p", "text": "Glenk participated during the invasion of Skarpos, a bleak desert world which had been ruled by Lord Malakite, who ruled a realm in the Grumani sector known as the Menagerie. During the battle, he was seen jumping out of a ship alongside Kerra Holt. Following the battle, he and his team of Novitiates were recalled to Odion's capital Jubalene where they were reassigned with recovering the Helm of Ieldis, an ancient Sith artifact created by Lord Ieldis prior to the Great Hyperspace War. The Helm was capable of driving sentient beings into a homicidal frenzy. Earlier, Odion had commissioned a task force known as Project Pandemonium to recover the Helm but its trail had dried up on Sarrassia in 1039 BBY."}, {"tag": "p", "text": "During the Invasion of Sarrassia, Glenk participated in a mopping-up operation led by the Feeorin Novitiate Doyan against Grumani Hierophants at Mount Diligence. He and his team explored the underground tunnels but were separated from \"Mercy\". They then stumbled on a temple which was destroyed by the Hierophant Zoojoo who detonated it, burying herself under it and denying the Sith access to its secrets. However, Mercy survived and revealed that the Helm of Ieldis was on Skarpos. Glenk and his comrades survived the explosion and he took advantage of the traveling preparations to slip away and report back to Daiman. However, his absence was noted by his team-mates who suspected that he was trying to reach the Helm first so that he could take all the glory for himself."}, {"tag": "p", "text": "His duplicity was later revealed to Beld Yulan and the rest of the Novitiates when he was seen beside Daiman on a chariot. Glenk was present during the Second Battle of Skarpos which became a three-way battle between the armies of three rival Sith Lords: Odion, Malakite, and Daiman. Despite Glenk's and Kerra's best efforts, Lord Odion was still able to reach the Helm of Ieldis before his rivals could acquire it. Odion then donned the Helm and activated it, unleashing it one the armies battling beneath the mesa. Immediately, the three armies descended into a mad homicidal frenzy. Glenk himself fell under the influence of the Helm and attempted to kill Daiman with his lightsaber. Daiman struck back with Force lightning, causing Glenk to fall from the chariot and plummet to his death beneath the Morbollon Mesa."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Little is known about Glenk's personality and thoughts since he plays a small role within the events of Star Wars: Knight Errant: Escape. However, he was known to have been regarded as elusive and opportunistic by his fellow Novitiates particularly Doyan following his disappearance during the invasion of Sarrassia. They thought that he wanted to reach the Helm of Ieldis first so that he could take all the glory for himself. As a double agent working for Odion's estranged younger brother Daiman, Glenk had a \"poker-face\" personality which allowed him to evade suspicion, in contrast to the Jedi Knight Kerra Holt who struggled to maintain her secret cover since Odion's Sith teachings were completely antithetic to those of the Jedi Order. Glenk was a loyal servant to his true master Daiman, and the Kubaz regarded serving the Sith Lord as the sole purpose for his existence in life. However, Glenk's loyalty was insufficient to enable him to resist the maddening, homicidal feelings induced by the ancient Sith artifact known as the Helm of Ieldis. Under the thralldom of a Force-induced madness, Glenk lost control and attempted to kill Daiman but was instead killed by the Sith Lord."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "He wore a cape and mask on his snout in combat and wielded a red lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Glenk was first introduced as a minor antagonist in Star Wars: Knight Errant: Escape, the third arc of the Star Wars: Knight Errant comic series. His character was first named in Knight Errant: Escape 2. He was killed off in the fourth issue of that comic arc."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and citations"}]}