{"url": "Glitch", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Glitch"}, {"tag": "p", "text": "Glitch was a clone trooper who believed that he had an ability to use the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Glitch was a clone trooper who served in the Grand Army of the Republic. Glitch believed that he was different to other clones and that he had an affinity for the Force, but he was often mocked by his comrades for his claims. During the Clone Wars, Glitch was among a group of clones who accompanied the Jedi B'ink Utrila and Rennax Omani to the planet Draay 2, on a mission to locate the ancient Sith artifact the Gauntlet of Kressh the Younger."}, {"tag": "p", "text": "The party discovered a Jedi Temple in which the artifact was purportedly stored, but as they made their way into the depths of the building, Glitch inadvertently triggered the activation of a guard droid, which attacked the Jedi and the clones. Utrila was soon able to deactivate the droid, and they moved on and made their way to the central chamber of the temple, in which the gauntlet was situated. However, there they were attacked by hordes of sarl creatures, which had been rendered invulnerable by centuries of exposure to the Sith artifact. Utrila was unable to recover the artifact, because of its strong dark side presence, so the Jedi, Glitch and his comrades retreated and made camp within the temple."}, {"tag": "p", "text": "That night, Glitch sat with Omani on watch outside the temple and he asked her whether it would be possible for a clone such as himself to use the Force. However, the pair were interrupted by an attack by several members of the Mandalorian Death Watch, whom sought to seize the gauntlet for themselves. The Mandalorians captured Omani and forced Utrila and the clones to put their weapons down by threatening to kill the young Jedi, and the Mandalorian leader Pre Vizsla offered to let the trooper Horns, who had decorated his helmet with the Death Watch emblem, to join them. Horns refused and just as Vizsla was about to shoot the clone, Glitch confronted the Death Watch leader while holding one of Omani's lightsabers. Vizsla ignited his own lightsaber and the pair engaged in a duel."}, {"tag": "p", "text": "Vizsla pushed the clone back and forced him down onto the floor, so Glitch responded by re-activating the temple's guard droid. Vizsla berated the clone for pretending to be a Jedi, but Glitch activated a trap that caused the entire temple to collapse, and the building began to fall apart and plunge into a canyon below. By putting on the gauntlet, Glitch was able to survive the fall, protected by its powers, although his clone comrades believed him to have died in the collapse and they commended him as having been a great man. When he regained consciousness, Glitch emerged from the rubble of the temple's remains and he disposed of the artifact by throwing it into a nearby river."}, {"tag": "h2", "text": "Appearances"}]}