{"url": "Glitterstim/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Spice variants"], "nodes": [{"tag": "h1", "text": "Glitterstim"}, {"tag": "p", "text": "Glitterstim was a potent variety of the drug family \"spice\" that was mined on Kessel. It gave the user a brief, yet pleasurable, telepathic boost and heightened mental state. It was a very valuable spice and tightly controlled by the Galactic Empire."}, {"tag": "p", "text": "It was produced from the webs of spice spiders. The spice was photoactive, so it had to be mined in total darkness or it would be ruined. After it was mined, it had to be packaged in an opaque paper to prevent accidental activation. Glitterstim was quite addictive—casual use could quickly lead to full-blown addiction. \"Cutters\" prepared the spice for sale. Glitterstim addicts were sometimes called \"glit-biters.\""}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the reconstituted Sith Empire, Getzo claimed to have invented glitterstim."}, {"tag": "p", "text": "The Republic first made use of glitterstim, considering it a medicinal substance, and volunteers mined it on Kessel. With the fall of the Republic, criminal organizations diverted it to the black market."}, {"tag": "p", "text": "Sources gave varying accounts of the true effects of glitterstim. It has been widely lauded to give a temporary telepathic boost, but many, such as Corran Horn, felt that the increased abilities were merely imagined by the spiced users. Others, such as Han Solo, felt their effects firsthand and knew the telepathic powers to be true. Excessive use, however, degenerated the nerves in the brain, resulting in loss of sight, twitching, nervousness, and paranoia."}, {"tag": "p", "text": "Glitterstim played a key role in convincing Bria Tharen to abandon her religious life on Ylesia. She was given a vial of the drug by Han Solo, who suggested she use it to read his surface thoughts and verify he was telling the truth about the fraudulent nature of the Ylesian priesthood. Instead, Bria ingested the spice during the Exultation ceremony; despite being bombarded by the induced pleasures of every worshiper around her, she read the mind of the t'landa Til priest Teroenza and found there no religious belief at all, but the thoughts of a swindler. Teroenza reacted to the telepathic presence, and Bria fled."}, {"tag": "p", "text": "Glitterstim users frequently overdosed on the spice, sometimes resulting in death. This led to at least one dubious casualty: HoloNet News and Entertainment current-affairs pundit Hirib Bassot was found dead at home from alleged abuse of a contaminated batch of glitterstim shortly after questioning the accuracy of the Republic's inflated estimation of Separatist battle droids during an HNE broadcast."}, {"tag": "p", "text": "Glitterstim was the basis for other spice variants, such as glitteryll and tempest."}, {"tag": "p", "text": "Grand Admiral Miltin Takel and the Bith musician Figrin D'an were glitterstim addicts. Figrin readily accepted contracts where glitterstim was available nearby."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}