{"url": "All_Terrain_Scout_Transport/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Articles with non-canon elements", "Category:All Terrain Scout Transport variants", "Category:All Terrain Scout Transports", "Category:Alliance to Restore the Republic vehicles", "Category:Balmorran Arms products", "Category:Galactic Empire walkers", "Category:Galactic Republic walkers", "Category:Imperial Department of Military Research products", "Category:New Republic vehicles", "Category:Rothana Heavy Engineering products"], "nodes": [{"tag": "h1", "text": "All Terrain Scout Transport"}, {"tag": "p", "text": "The All Terrain Scout Transport (AT-ST), also known as the chicken walker for its two-legged design, was a bipedal walker used by the Galactic Republic during the late Clone Wars and, later and more extensively, by the Galactic Empire during the Galactic Civil War. It was a successor of the AT-XT."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Main design"}, {"tag": "p", "text": "Colloquially known as a \"chicken walker\" because of its shape and walking motion, the AT-ST was a light, heavily-armed, ground combat vehicle, and able to trek various environments. The stock model was equipped with a chin-mounted, double blaster cannon, a light E-Web twin blaster cannon on the port side, a concussion grenade launcher on the starboard side of its head, two clawed feet, and was encased with 9095-T8511 grade durasteel."}, {"tag": "p", "text": "The AT-ST was designed to be a recon, hit-and-run vehicle. It was lighter than its bigger brother, the AT-AT, and could withstand standard blaster fire, but was vulnerable to heavy laser fire and missiles, as well as physical attacks to the legs and the side of the head. The latter weakness was witnessed during the Battle of Endor, when the Ewok tribal warriors destroyed an AT-ST by using logs to ram the sides of the walker's head. The AT-ST could also be infiltrated by species with great physical strength. At Endor, the Wookiee, Chewbacca, forced his way through the top hatch and took control of the walker in this manner."}, {"tag": "p", "text": "The AT-ST's chin blasters had an effective range of two kilometers and were used for anti-vehicle attacks, while the armor-shielded blaster cannon and grenade launcher provided close-range protection against infantry and light emplacements. Like the AT-AT, the AT-ST utilized a holographic targeting system, allowing a 360-degree view of its position. The armor was not sufficient to withstand blasts from starship cannons, but was impervious to small-arms fire. In addition, according to Leia Organa Solo, the area behind the angled viewport visors was weak enough to be susceptible to missile fire, although Han Solo wondered with surprise how she knew that."}, {"tag": "p", "text": "The 8.6-meter-tall walkers were piloted by a crew of two Imperial Army pilots and carried 200 kilograms of cargo, which had to be loaded and unloaded via the single hatch located atop the superstructure accessible using a series of handholds placed on the sides of the walker. However, for practicality, the preferred method of entry inside military bases was to use a loading platform."}, {"tag": "p", "text": "The bipedal propulsion system was one of the primary weaknesses of the AT-ST. On even terrain, the walker could achieve over 90 kilometers per hour, but on uneven or shifting terrain, a walker could quickly become unbalanced enough to fall over. In rare cases, AT-STs are even capable of leaping when in combat with an enemy."}, {"tag": "p", "text": "An advanced gyro system, located beneath the command module, provided the balance needed, but could be easily damaged. Following the Battle of Hoth, Rebel tacticians learned to ambush and immobilize AT-ST's; once trapped, a well-placed rifle shot could destroy the walker's gyro system."}, {"tag": "h3", "text": "Modular attachments"}, {"tag": "p", "text": "The AT-ST was a highly modular walker design, being able to switch weapons slots and additional tools to fulfill a variety of roles on the battlefield."}, {"tag": "p", "text": "Known modifications included a top-mounted, shielded gun turret for soldiers standing on lookout, mortars bolted to the upper side of the turret, side-mounted six-slot rocket launchers instead of laser cannons, and grenade launcher mounts on the walker's lower cheeks."}, {"tag": "p", "text": "Other modifications included communications antennae, using additional armor plates to cover the battery packs and having a winch system underneath the chin gun. During the construction of the Imperial base on Endor, several AT-STs had their chin guns replaced with metal clamps and were used to tear down trees and make clearings for future construction."}, {"tag": "h2", "text": "Variant models"}, {"tag": "h3", "text": "AT-ST/A"}, {"tag": "p", "text": "The Assault version of the AT-ST featured longer legs, a heavy, chin-mounted blaster cannon and a reinforced gyro balance system."}, {"tag": "h3", "text": "AT-KT"}, {"tag": "p", "text": "This variant was equipped with large weapons-mounts fitted to the upper portion of each leg of the walker. They were used in guerrilla warfare against Wookiees."}, {"tag": "h3", "text": "AT-CT"}, {"tag": "p", "text": "The AT-CT variant was an AT-ST walker fitted with arms for use in construction. Though not designed for combat, the AT-CT could use the anti gravity beams on the side of the cockpit to lift an object and hurl it, repulsing it with enough force to make it a potent anti infantry weapon, as it could use the surrounding environment as a weapon."}, {"tag": "h3", "text": "AT-RCT"}, {"tag": "p", "text": "During the Clone Wars, the first AT-RCTs were developed. They had an open cockpit design, where the pilot and gunner sat one in front of the other."}, {"tag": "h3", "text": "AT-MP"}, {"tag": "p", "text": "This variant looked a bit like a squat AT-ST but boasted 8 missile launchers and a single rotary chaingun."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Early on in the Clone Wars, engineers at Rothana were busy developing a new bipedal walker, known as the All Terrain Scout Transport, following their construction and testing of the AT-XT. The AT-XT enjoyed moderate success during its somewhat brief operational time, but was rarely used during the war. At the end of the war, the Confederacy of Independent Systems constructed some of these weapons on the planet Diado. This production ceased when Saesee Tiin destroyed the factory."}, {"tag": "p", "text": "The earliest models were deployed by the Grand Army of the Republic during the latter stages of the Clone Wars. The conflict also saw the debut of several other bipedal walker designs, like the AT-RT."}, {"tag": "p", "text": "Under the Empire, Balmorra was the center of AT-ST production. The AT-ST was later viewed by Imperial commanders as a highly versatile weapon, excelling against infantry and lightly armored vehicles, but also useful for protecting vital units and patrolling hostile areas. At least two AT-STs were stationed near an erected statue of the Emperor in Naboo's capital, Theed, on Empire Day as part of the holiday festivities on the planet."}, {"tag": "p", "text": "AT-STs were used by Blizzard Force during the Battle of Hoth. The Blizzard Force AT-ST was specially modified for polar climates, as were all the vehicles used on Hoth. It was equipped with ground-penetrating sensor equipment that could detect instabilities in the permafrost and relay information back to the heavier vehicles, thus ensuring they avoided unstable ground. The walkers had a unit insignia consisting of a horned helmet."}, {"tag": "p", "text": "Wedge Antilles hijacked an AT-ST during the Battle of Dubrillion as a means to infiltrate an Imperial Superlaser facility. He took out several enemy AT-ST's and stormtroopers. He then hijacked an AT-AT with which he destroyed the facility."}, {"tag": "p", "text": "In the Battle of Endor, AT-STs were deployed by the Empire against Rebel and Ewok ground troops. The walkers were very effective against these troops, until many of them were destroyed by Ewok traps and another AT-ST was hijacked by Chewbacca with the help of some Ewoks."}, {"tag": "p", "text": "The AT-ST's problem with shifting terrain, despite the designation \"All-Terrain,\" was demonstrated during the Battle of Endor, when Ewoks released a large pile of logs and stones to roll down the hill into the path of an AT-ST. The walker was unable to handle the rapidly shifting ground and, despite attempts by the pilot to stabilize the vehicle, it fell on its side and was destroyed. The Ewoks also used strategically positioned logs hanging from trees to eliminate several other walkers. As a direct result of the losses inflicted on the Empire in Endor, AT-STs were later forbidden from being deployed onto worlds composed extensively of forests or natives with primitive weaponry."}, {"tag": "p", "text": "The Imperial Remnant would go on to use AT-STs, though not as extensively."}, {"tag": "p", "text": "Following the Galactic Civil War, AT-STs and AT-ATs were also used by the New Republic. They were considered as quite old vehicles and were relegated to local planetary defense forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An early scout walker concept was used in the Revenge of the Sith comic adaptation. This was derived from Episode III concept art made by Ryan Church."}, {"tag": "p", "text": "The Revenge of the Sith script referred to the AT-RT walker as a \"modified scout walker,\" which may imply that this two-man design was the basis."}, {"tag": "p", "text": "In the June 27, 1982 issue of the Star Wars comic strip arc \"The Return of Ben Kenobi,\" the Star Wars scrapbook section depicted a walker called a \"Two-Man Imperial Scout Walker.\" However, it bore a resemblance closer to half of the AT-AT Walkers than to the AT-STs used in the film."}, {"tag": "p", "text": "More scenes with the AT-ST were filmed for the original trilogy movies, but George Lucas decided that the AT-ATs would be more impressive and that the AT-ST would look better in close quarters."}, {"tag": "p", "text": "The original model for the AT-ST was created by members of the Industrial Light & Magic team, and George Lucas thought it was \"neat\" and decided to include it in The Empire Strikes Back alongside the AT-AT, so the ILM model shop disassembled it and added a metal stop-motion armature.[source?]"}, {"tag": "p", "text": "The AT-ST model received some cosmetic changes for its extensive appearance in Return of the Jedi, thus explaining the minor differences in the models used for the two films."}, {"tag": "p", "text": "A mini-game where the player can use an AT-ST is available in the 1998 video game Star Wars: Rogue Squadron, unlocked through a cheat code."}, {"tag": "p", "text": "In the 2001 video game Star Wars: Galactic Battlegrounds and its 2002 expansion pack Clone Campaigns, the AT-ST serves as the Galactic Empire's heavy mech destroyer unit. They are produced at mech factories in single-player or multi-player."}, {"tag": "p", "text": "In the 2003 video game Star Wars: Rogue Squadron III: Rebel Strike's tutorial mission, \"Tatooine Training,\" some Imperial recruiters on Tatooine will allow the player (Luke Skywalker) to test-ride an AT-ST near Tosche Station, after Luke arrived there in a landspeeder. After getting adjusted to the steering of the AT-ST, the player is then deployed on a droid hunt as a way to identify whether the player is a good shot. After destroying enough droids, the recruiters then stated that, as part of the completion of the training procedure, the player is to \"dispatch your application to: Screening Office, Imperial Space Academy, your sector.\""}, {"tag": "p", "text": "AT-STs were also seen in the 2006 video game LEGO Star Wars II: The Original Trilogy and its 2007 compilation re-release."}, {"tag": "p", "text": "In 2010, LucasArts released a non-canon continuation of the dark side storyline of Star Wars: The Force Unleashed II as downloadable content. In the storyline, the Dark Apprentice was ordered by his master, Darth Vader, to hunt down the Rebels on Endor."}, {"tag": "p", "text": "Chewbacca took control of an AT-ST and attempted to stop the Dark Apprentice from gaining access to the Endor shield bunker. Han Solo used his rocket launcher to attack the Apprentice, but he used the Force to redirect the rocket into Chewbacca's walker. He then jumped to the top and pried open the top hatch, forcing Chewbacca to come out and grapple with him. The Dark Apprentice bested Chewbacca only to use him as a shield from Solo's blaster shots, killing the Wookiee. The Apprentice then jumped onto the roof of the bunker and impaled Solo on his lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}