{"url": "All_Terrain_Tactical_Enforcer_(cargo_transport)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:All Terrain Tactical Enforcers", "Category:Galactic Empire walkers", "Category:Unidentified vehicles"], "nodes": [{"tag": "h1", "text": "All Terrain Tactical Enforcer  (cargo transport)"}, {"tag": "p", "text": "Some of the Galactic Empire's All Terrain Tactical Enforcer walkers were modified into open-air cargo transports that functioned in a support role, similar to the All Terrain Open Transport."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "They were often used in conjunction with Imperial mining operations, as well as carrying troops and materials for bases and outposts. There were chairs fitted for 8 passengers, but with no cargo, it could accommodate dozens of troops."}, {"tag": "p", "text": "Since these walkers did not have any fixed weaponry of their own, they had to rely on other armored units for protection. Even so, the walker had room enough to carry several E-Web repeating blasters and their support equipment. The cargo space had to be cleared and the weapons had to be installed before they could be used to defend the walker."}, {"tag": "p", "text": "AT-TE cargo walkers were equipped with several useful appendages, including a front wire that could be attached to vehicles that were stuck and help pull them free. Craft as big as HAVw A5 Juggernauts would come to benefit from this accessory, and recovery of other vehicles was a role that the AT-TE cargo walker performed admirably. To hoist cargo to and from the walker, the AT-TE cargo walker was equipped with a loading arm."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The walker was also used during various repair operations. Following the Battle of Kalist VI, AT-TEs of this kind helped clean up the ruins of an Imperial base and installed new components using a crane-appendage."}, {"tag": "h2", "text": "Appearances"}]}