{"url": "Glowen_Faquidde", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Humanoids", "Category:Individuals of unspecified gender"], "nodes": [{"tag": "h1", "text": "Glowen Faquidde"}, {"tag": "p", "text": "Glowen Faquidde was a white-skinned humanoid alien who spent time in the Canto Casino on the planet Cantonica circa 34 ABY. Faquidde sat near one of the casino's bars with a diminutive alien and a drink while several galloping fathiers caused the casino to shake as they raced on the nearby Canto Bight racetrack."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Glowen Faquidde was an alien who was present in the city of Canto Bight on the planet Cantonica in the year 34 ABY. Faquidde sat with a drink next to a diminutive alien at a table near a bar inside the Canto Casino while the Resistance agents Rose Tico and Finn searched the establishment for the Master Codebreaker. While the alien pair sat together, the casino shook around them as several fathiers raced past on the nearby Canto Bight racetrack."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Glowen Faquidde was a member of a humanoid alien species with white skin and at least two arms ending in hands, each with at least four fingers. Faquidde's head included two blue, front-facing eyes with large pupils, and a series of pink tendrils hanging down below the chin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Faquidde wore patterned black robes with a hood and white lining while in the Canto Bight casino."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Glowen Faquidde was portrayed by creature performer Lynn Robertson Bruce and first appeared in the 2017 sequel trilogy film, Star Wars: Episode VIII The Last Jedi, and was identified in the accompanying reference book Star Wars: The Last Jedi: The Visual Dictionary, which was written by Pablo Hidalgo. Concept art of the character, titled \"King 29,\" was produced for the film by senior sculptor Ivan Manzella."}, {"tag": "p", "text": "Faquidde also appeared in the children's activity book Star Wars: The Last Jedi Look and Find, which was illustrated by Art Mawhinney. That book incorrectly depicts the character with brown, two-fingered hands rather than the white-skinned hands with at least four fingers that the character has in the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}