{"url": "Gloyd", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Houk", "Category:Males", "Category:Sith in the Lost Tribe of Sith", "Category:Sith military officers"], "nodes": [{"tag": "h1", "text": "Gloyd"}, {"tag": "p", "text": "Gloyd was a male Houk officer in the navy of the Sith Empire, and later one of the top ranking members of the Lost Tribe of Sith. Gloyd was originally a member of a crew of brigands, who stumbled across the Sith Empire while searching for treasure in the Stygian Caldera. While most of his team did not survive their discovery, Gloyd's experience as a foot soldier and gunner made him useful to the Sith Empire, and he eventually became a gunnery officer in the Sith Navy. Gloyd served under Captain Yaru Korsin on the Sith dreadnaught Omen, and the two became lifelong friends. In 5000 BBY, on a mining mission to a moon of the planet Phaegon III, the Omen was attacked by Jedi, causing the Omen to veer off course as it jumped to hyperspace and crash-land on the remote world of Kesh. After several harrowing nights trapped in the mountains, the Omen's crew made it to civilization, where they posed as the gods of the native Keshiri and took over the planet. Despite Gloyd's best efforts, no way off the planet could be found, and he instead served for years at the side of his friend Korsin, now Grand Lord of the Lost Tribe of Sith. In 4975 BBY, Gloyd and Korsin were attacked by a force led by Yaru's wife Seelah, who wanted to avenge the death of her former husband Devore at Yaru's hands and to install her son Jariad as Grand Lord. Gloyd was killed during the fighting, setting off a proton detonator he had kept for the previous twenty-five years, instead of falling to his enemies. The explosion also gravely wounded Seelah, and her plot was soon foiled."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Bandit turned naval officer"}, {"tag": "p", "text": "The Houk male known as Gloyd was born in the era before the Great Hyperspace War. Originally a member of a team of brigands, Gloyd led the life of a gunner and foot soldier, doing combat with Jedi many times along the way. At one point, Gloyd found himself on the wrong end of a Jedi's lightsaber, which just missed taking his head off and permanently scarred his face. Gloyd's crew eventually learned of the mysteries of the Stygian Caldera region, which was generally avoided by outsiders. Figuring something wondrous had to be there, they journeyed forth, only to discover the might of the hidden Sith Empire. While most of his team was wiped out, Gloyd survived and eventually became a member of the Sith Empire's Navy, rising to the rank of gunnery officer. By 5000 BBY, Gloyd was the gunnery officer on the Sith dreadnaught Omen, leading his own torpedo crew under a captain named Yaru Korsin, who was on his first command. Sharing a similar acidic wit, and an interest in their job uncommon among the other, more ambitious Sith, the two became close friends and by 5,000 BBY had worked together on the Omen for decades. That year, Gloyd accompanied Korsin and the Omen on a mission to Phaegon III's largest moon, in an attempt to mine Lignan valuable to the Sith efforts in the Great Hyperspace War against the Galactic Republic. However, a Jedi attack caused the Omen's sister ship, the Harbinger, to hit the Omen as the latter jumped to hyperspace. Bumped off course and en route to parts unknown, the Omen ran into a gravity well that grievously damaged the ship. When the Omen reverted to realspace, it was listing toward a mysterious planet named Kesh."}, {"tag": "p", "text": "While the Omen's bridge erupted in chaos, Gloyd, although privately worried, remained calm and even smiled and joked with his equally cool-nerved friend, Yaru Korsin. The damaged Omen eventually drifted into Kesh's atmosphere, which was found to have breathable air, although Gloyd saw this positive development as just a reprieve from what was to come. In a desperate attempt to slow the ship's descent, Korsin, after consulting Gloyd, opened the Omen's torpedo doors with the Force, succeeding in his task. However, the Omen was still destined to crash, and after everyone took cover, the dreadnaught slammed into a granite ridge. Korsin was caught out of position and was thrown forward and nearly impaled on a shattered viewport, and though Gloyd tried to pull his friend to safety, the continuing movement of the Omen impeded his progress. The Omen slid to a halt on a precipice high in the mountains—Gloyd was one of 355 survivors of the disaster, including Korsin. Many had died, and twenty-one more perished on a perilous journey through a narrow mountain pass away from the shattered Omen to a clearing below. After the Sith set up camp, an incident occurred where the Omen's elderly navigator, Boyle Marcom, was attacked and killed by Korsin's spice-addicted half-brother Devore, who blamed Marcom for the ship's crash. Shaken by the incident, Korsin sought Gloyd's counsel. Gloyd, who had missed the violence, surmised that they only had two choices: to either find a way off-planet, or hide until everyone else killed one another. Gloyd figured that the only chance they had was to force the crew members to follow Korsin's lead, and push aside anyone who would not abide."}, {"tag": "h3", "text": "Life on Kesh"}, {"tag": "p", "text": "Although Korsin decided to follow Gloyd's advice, the situation did not immediately improve for the stranded Sith. The high altitude and bitter cold combined to kill more wounded crew members, and Gloyd was forced to rely on bitter roots for sustenance. Later on, Gloyd witnessed a large six-legged mammal vault into the camp, gruesomely killing one of the injured Sith before it could be taken down. Salvation for Gloyd and the other Sith came from an unexpected source, as a native Keshiri woman, Adari Vaal, stumbled across their isolated camp while fleeing from religious trouble. Although her presence was a source of discomfort for Gloyd, Vaal was convinced to help the Sith escape their predicament. Vaal brought the Sith to the Keshiri city of Tahv, where they posed as the native gods and earned the complete devotion and subservience of the Keshiri. Gloyd, along with all the other Sith, was feted by the Keshiri, who allowed them to move into homes previously occupied by their ruling council, the Neshtovar. Once they were settled down, Gloyd set out with Korsin on a mission to dig up metals necessary to repair the Omen. Gloyd first oversaw an effort to clear a new path through to a nearby peninsula, a route needed to bring materials to the Omen. That phase was successful—however, as they would soon find, the metals they sought were nowhere to be found. For better or for worse, the Sith were stuck on Kesh."}, {"tag": "p", "text": "Over the next fifteen years, Gloyd continued to faithfully serve his friend, now the Grand Lord of the new Lost Tribe of Sith, Yaru Korsin. However, Gloyd remained ever anxious to leave Kesh, and frequently pitched different escape plans to Korsin in the new Sith temple built in the mountains at the Omen's crash site. In 4985 BBY, Gloyd came to Korsin with his latest plan: using one of the Omen's surviving boring lasers to fire signals into space, hoping to catch the attention of a passing freighter. Gloyd's idea was quickly dismissed as ludicrous by Korsin's science advisor, Ermon Parrah, and ultimately rejected by Korsin. Not long after Gloyd's pitch to Korsin, gruesome news rolled into the temple—the entire population of the southern town of Tetsubal, recently visited on an ecological survey by Korsin's Sith pureblood advisor Ravilan Wroth, had mysteriously died. Along with Korsin and his wife Seelah, the widow of the by-now-deceased Devore, Gloyd rushed to Tetsubal to observe the grisly scene, finding only Wroth alive amidst a sea of Keshiri corpses. Fearing that an airborne biological agent was responsible, Korsin sent a shaken Gloyd back to Tahv, to make sure that his daughter Nida made it safely back to their mountain temple. The deaths in Tetsubal, as well as similar incidents in other nearby towns, were ultimately judged to be caused by Wroth and his compatriots, due to manipulation by Seelah as part of a plot to eliminate the pureblood Sith from the Lost Tribe to open the way for an all-Human version. As a result, the Korsins led a wholesale purge of the forty-five Sith purebloods on Kesh, leaving the Houk Gloyd as the only non-Human remaining in the ranks of the Tribe."}, {"tag": "h3", "text": "Last stand"}, {"tag": "p", "text": "The deaths at Tetsubal caused a stir amongst the Keshiri, and the Lost Tribe feared that they could lose their support entirely. However, Gloyd was instrumental in retaining the devotion of the natives, thinking up a stunt where a known Keshiri dissenter was brought to Tahv's Circle Eternal plaza to proclaim against the Sith, only to suddenly die, mysteriously choking to death on his own words. This display of dark side power was a complete success, and with the belief of the Keshiri reaffirmed, the mass deaths of the Tetsubal region were effectively passed off as the result of the residents' lack of faith in the divinity of the Lost Tribe. By 4975 BBY, with all attempts to find a way off Kesh having failed, the Lost Tribe decided to stay there for good—with no reason to stay by the Omen, they committed to remove themselves from their mountain temple and live amongst the Keshiri. Their intentions were revealed in a massive ceremony at the site of the Circle Eternal, in front of thousands of cheering Keshiri. An aged Gloyd served as Yaru Korsin's ceremonial bodyguard, personally introducing Adari Vaal, who was feted as the \"Daughter of the Skyborn,\" and lastly High Lord Jariad Korsin, son of Devore and Seelah, one of the top candidates to succeed Yaru Korsin as Grand Lord. While Jariad was believed to be Korsin's heir, he was not the true choice—for years, Gloyd had helped Korsin hide his daughter Nida's training in the dark side, which Seelah had tried to suppress, as the Grand Lord groomed her for his position."}, {"tag": "p", "text": "Unbeknownst to Gloyd, Seelah and her son Jariad were plotting to overthrow Korsin, as revenge for the death of Devore twenty-five years earlier—although the circumstances of his death were kept secret, during the Sith's time stranded in the mountains Devore had tried to usurp control of the group, leading to a lightsaber duel and his death at the hands of Korsin. By chance, the event had been witnessed by Adari Vaal, and it was through her that Seelah learned how her husband had died. For decades she and Jariad planned to kill Yaru Korsin, and they finally struck soon after the ceremony. Unfortunately for Gloyd, he was with his friend Korsin at the time, and they and four bodyguards were ambushed as they walked in the temple. Although outnumbered four-to-one and encircled by Jariad and his contingent of Sith Saber warriors, Gloyd and Korsin resolved to fight. Luckily, they got a timely distraction, as a Keshiri resistance group, secretly led by Adari Vaal, stole the temple uvak beasts as part of a plan to destroy the Lost Tribe's hold over their planet. The theft of the uvak gave Gloyd and crew a chance to make a run for it, and make a stand on better ground. Gloyd eventually became separated from Korsin, and was chased into another part of the complex by Seelah's warriors. Gloyd fought back with all his might, ably holding out against wave upon wave of enemies despite his old age. However, his and Korsin's time was running short."}, {"tag": "p", "text": "As Gloyd's last stand drew near its end, Korsin played his trump, as Nida Korsin and her Skyborn Rangers uvak-riding club arrived on the scene as reinforcement, turning the tide of the battle. While Seelah's plan fell apart before her eyes, Gloyd brought the fight to her chamber. Cornered, Gloyd knew his time had come, and he wanted to take everyone else with him. Gloyd produced a proton detonator, a weapon he had had up his sleeve since the crash of the Omen twenty-five years earlier. Gloyd set the detonator off, killing himself but bringing the entire room down on his enemies. In the end, Seelah's coup was a complete failure—Jariad died in combat with Nida and Yaru Korsin, and although Seelah survived, Gloyd's proton detonator had severely wounded her, and she permanently lost the use of her legs. Although Yaru died from his injuries, Nida Korsin lived to take over the Lost Tribe. By 3000 BBY, 2000 years after the arrival of the Sith on Kesh, Gloyd was still remembered amongst the Keshiri and the Lost Tribe. In that era, Gloyd was revered by a political faction known as Force 57, comprised of disfigured Humans who revered the \"Fifty-seven\" non-Humans of the early days of the Lost Tribe. Gloyd was remembered as a figure to be pitied, the one non-Human that the Korsins let live, like a pet. Gloyd was also remembered in the form of the exclamation \"Gloyd's blood!,\" used most notably by Grand Lord Varner Hilts."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A massive Houk, Gloyd was a gruff but amiable individual with a lively sense of humor and a voracious appetite, able to joke even in the most dire of situations. Gloyd had an acidic wit, the only one able to match that of his close friend, Yaru Korsin. Over his years as a bandit and Sith soldier, Gloyd became adept in combat, to go along with his physical strength, and as a gunnery officer he was quite knowledgeable about torpedo systems. Gloyd was completely loyal to Korsin, serving faithfully by his friend's side for decades, and always referring to him respectfully as \"Commander.\" Gloyd's brutish tendencies belied his intelligence and astuteness, and in those early days on Kesh when so much was uncertain, Gloyd proved himself an incredibly valuable advisor to his captain. Unlike other Sith, Gloyd was not concerned with ambitious pursuits, instead focusing on his job, a dedication he shared with Korsin. Gloyd could also be extremely imaginative, thinking up dozens of wild plans to facilitate the Lost Tribe's escape from Kesh, although every single one was dismissed as unfeasible. In addition, he thought up the idea to kill the Keshiri dissenter through the Force, a move which regained the devotion of the natives. Gloyd never was truly comfortable on Kesh, used as he was to a life spent in battle, and at his end, he proved a resoluteness never to surrender, and a valiance in battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gloyd first appeared in John Jackson Miller's 2009 eBook Lost Tribe of the Sith: Precipice, the first in the nine-part Lost Tribe of the Sith series. Gloyd was then featured in the next three installments of the series, Skyborn, Paragon, and Savior. In addition, Gloyd was mentioned in a later installment of the series, Pantheon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}