{"url": "Glurrg", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Creatures of Naboo", "Category:Creatures of unspecified biology", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Gungan culture", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Glurrg"}, {"tag": "p", "text": "Glurrgs were a species of non-sentient, bipedal creatures that were employed as workers for the Gungan civilization of the planet Naboo. Although glurrgs typically did not communicate in Galactic Basic Standard, they were skilled in a variety of areas, including farming, construction, fishing, hunting, and mining ores and nova crystals for use in building and maintaining Gungan settlements. Besides being capable of harvesting carbon from trees for conversion into duraplast at carbon processing centers, glurrgs were efficient laborers who compared favorably with the labor droids used by contemporaneous civilizations."}, {"tag": "p", "text": "Glurrgs were a pivotal part of Gungan society since at least 3000 BBY. During the War of the Gungan tribes, the creatures were used as laborers by all of the Gungan tribal factions involved in the conflict. Glurrgs continued to contribute valuable labor to Gungan society up to and during the Invasion of Naboo in 32 BBY by the Trade Federation cartel. Glurrgs helped construct a monument at the recapture of Spinnaker to rally Gungan forces against the invading Trade Federation Droid Army and assisted in the Liberation of Harte Secur, which drew battle droid forces away from Naboo's capital city of Theed in a diversionary assault."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Glurrgs were a tan-skinned, bipedal species that generally stood shorter than 1.9 meters, the average height of their sentient masters, the aquatic humanoid Gungan species. Their upper pair of appendages did not end in defined limbs with individual digits, but instead resembled fins or flippers. Despite this, they could still handle machinery and farm implements without the need of fingers or opposable thumbs. They could swim, even in deep waters, and were proficient at fishing. Glurrgs possessed two eyes, which protruded above their heads on stalks. Glurrgs stood and walked in a hunched-over stance, propping their arms against their legs when idle. Glurrgs had slender thighs, but their lower legs were bulkier, with broad, oblong feet. Other characteristic features of glurrgs were a rounded, squat body, thin forelimbs, and a large mouth. They were also known for having frail constitutions. Glurrgs were non-sentient, although they were capable workers that could use a variety of implements to perform their tasks."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "Glurrgs were native to the planet Naboo, where they played a key role in Gungan society. Their labor skills meant that they were used to construct and gather resources for many Gungan settlements. Large amounts of technology or resources were not required to sustain the glurrg population at a given settlement; they required merely food to eat and sufficient shelter in which to live."}, {"tag": "p", "text": "Glurrgs were adept in a wide range of skills, including hunting creatures such as shaaks, fishing, repairing Gungan war machinery and buildings, farming, foraging for muja fruit, harvesting carbon from trees and mineral deposits for conversion into duraplast at carbon processing centers, and mining for ore and nova crystals. Being versatile laborers, glurrgs were skilled enough to swiftly change between their various tasks upon command. When hunting, unlike Gungan warriors, glurrgs used small blasters rather than booma-based or similar weaponry, although they did not use such weapons in self-defense. Glurrgs could construct any building required by the Gungans, whether they were simple prefab shelters, sizable fortresses, or command centers. Despite their relatively basic role in Gungan society, glurrgs were able to use technology such as beamdrills and heavy carbon extractors, and to learn the blueprints of increasingly more sophisticated buildings over time. As such, their efforts were invaluable to the Gungan military arm, the Gungan Grand Army, particularly when constructing a new base or outpost. Without glurrgs, the Gungans would have been hard-pressed to collect enough resources from the surrounding environment to maintain a war effort and construct additional structures."}, {"tag": "p", "text": "Glurrgs were not used for construction of Gungan underwater settlements; Gungans instead preferred to use utility trawler vehicles for the creation of buildings beneath the surface of Naboo's oceans. Furthermore, glurrgs were not well suited to combat—their relatively frail constitution and lack of armor and self-defense abilities limited them to attacking a target with their bare fins."}, {"tag": "p", "text": "Glurrgs communicated audibly through chirps, whistles, and grunts, but they could not speak Galactic Basic Standard or the Gunganese dialect of Basic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Glurrgs were domesticated by the Gungans by the year 3000 BBY, over two millennia prior to the Invasion of Naboo. One settlement that employed glurrgs as the primary source of labor in 3000 BBY was Otoh Sancture, a city governed by the Gungan Boss Gallo. When the village was destroyed by carnivorous bursa creatures incited by Gallo's rival, Boss Rogoe, Gallo was left stranded in the woods, lacking resources save for five nerfs that he had captured. Gallo traded the nerfs to a local leader named Marsune in exchange for worker glurrgs, then tasked the creatures with the construction of a new outpost and the harvest of materials needed for the army that he would later use to retake Otoh Sancture."}, {"tag": "p", "text": "Glurrgs remained a valuable source of labor for Gungan factions throughout the conflict denoted as the War of the Gungan tribes. They were used by both Gallo and Rogoe during the conflict's Battle of Spearhead for constructing buildings and harvesting resources, as well as by the neutral Bongomeken Collective manufacturing group, which later provided seagoing bongo vessels to Gallo. Gallo ultimately prevailed over Rogoe. The ubiquitous glurrg remained in use by Gungans for at least the next three thousand years."}, {"tag": "p", "text": "When the galactic cartel known as the Trade Federation invaded Naboo in 32 BBY with its Droid Army, glurrgs were still employed for construction and collection, much as they had been at the rise of Gungan civilization. Boss Rugor Nass, the leader of the Gungans of the settlement Otoh Gunga at the time, used a group of glurrg workers in his attack on the Federation-occupied city of Spinnaker. In this assault, the glurrgs not only provided the resources to keep Nass's army fighting against the Trade Federation, but they also constructed a Gungan Temple monument on the ruins of a Neimoidian Throne, a Trade Federation monument that the Gungan Grand Army destroyed in a bid to rally more Gungans to Nass's aid."}, {"tag": "p", "text": "In the events leading up to the conflict's Battle of Grassy Plains, glurrgs were employed in the liberation of another key occupied town, Harte Secur, as well as the freeing of fambaa beasts confined nearby. As Nass amassed a Gungan army with which to attack the town, glurrgs provided resources such as ore, carbon, food, and nova crystals for the war effort, which was aimed at drawing the Trade Federation's battle droid army away from the Naboo capital city of Theed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Glurrgs only appear in the 2001 video game Star Wars: Galactic Battlegrounds, in which they fulfill the worker role for the Gungan civilization, with similar behavior as that of Imperial ASP-7 labor droids or Royal House of Naboo PKN-49 worker droids. Unlike the majority of these civilizations, aside from the Wookiees, Gungan glurrgs are biological in nature rather than droid-based. The release of The Complete Star Wars Encyclopedia in 2008 confirms that they are non-sentient."}, {"tag": "p", "text": "Glurrgs resemble concept art provided for Gungans on the StarWars.com Databank, as drawn by Terryl Whitlatch. The same concept art was later used in 2012 as the basis for the Zilkin character Meebur Gascon, who made his first appearance in \"Secret Weapons,\" an episode of the fifth season of the Star Wars: The Clone Wars TV series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}