{"url": "Allandria_Evlan", "categories": ["Category:Legends articles", "Category:Alliance Intelligence members", "Category:Females", "Category:Humans", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Allandria Evlan"}, {"tag": "p", "text": "Allandria Evlan was a female Human who worked as a spy for the Alliance to Restore the Republic around 0 ABY. She was the twin sister of Allexia Evlan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Evlan lived in the Kuat system, along with her widowed aunt and her twin sister Allexia Evlan. The twins spent most of their time in school and many of their classmates were the children of Imperial officers and workers at Kuat Drive Yards. The twins gained a lot of attention from their male classmates and would both date different boys every few days. However, they chose dates who had parents in important positions and would try to steer conversation to how Kuat Drive Yards was doing, in an attempt to learn information about the shipyards. They often gathered information about naval deployments and shipyard schedules which they passed on to to an old friend of theirs, who was a member of a Rebel Alliance cell."}, {"tag": "h2", "text": "Personality and triaits"}, {"tag": "p", "text": "Allandria and Allexia were attractive and dressed in the latest styles. They were cunning and used their wits and charm to pry information out of their boyfriends."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Despite being a teenager, Allandria and her sister were incredibly gifted and flirting with their classmates to manipulate them for the Alliance's needs. They were also talented pick pockets and had skills with security systems, searching, investigations, and intimidation."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As students Allandria and her sister only carried data notebooks and data book cartridges."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Allandria Evlan was designed by Peter M. Schweighofer for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. She was illustrated by Mike Vilardi."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}