{"url": "Goethar_Kleej", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Duelists", "Category:Gotals", "Category:Males", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Goethar Kleej"}, {"tag": "p", "text": "Goethar Kleej was a male Gotal who was kidnapped by Crucible slavers around the time of the Mandalorian Wars to compete in swoopdueling matches for the Franchise entertainment firm. Despite having his sensory cones severed by his abductors, Kleej performed well in training, and by 3963 BBY, he had won the Solo Aerials four times in succession. At the end of his fourth victory, he tried to tell the event's spectators about the slaving operations behind the Franchise, but a harmless pre-recorded speech was played over his words. The operator of the events, a Krish named Bardron, assaulted Kleej for attempting to expose the Franchise, but he later made an offer of retirement to Kleej provided that the Gotal and his son, Aubin, won the forthcoming Tandem Open event. Aubin was hindered by his inability to filter electromagnetic signals received through his cones, so he would be unlikely to progress without help. As Kleej would not be in the same round as his son until the final round, he intimidated fellow competitor Zayne Carrick into protecting Aubin. Father and son both advanced to the final round, where Carrick, now wanting to help Kleej, set in action a plan for them to escape. Deliberately crashing out of the arena, the Gotals were then smuggled out of the venue in a trash bin. Upon reaching the safety of the planet below, Kleej saw that one of Carrick's companions had been a Crucible slaver and fled with his son."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Goethar Kleej was a male Gotal who, around the time of a war fought between the Galactic Republic and Mandalorian Neo-Crusaders, was abducted by The Crucible slaving organization and was forced to train as a competitor for swoopdueling matches run by the Franchise entertainment firm. Early on during his stay in The Crucible's training pits, Kleej's slaver, Chantique, became angry with him and ordered his cones to be severed. The removal of the sensory organs, unique to Gotals, that picked up electromagnetic signals was a heinous act in Gotal culture. Kleej later had false cones implanted to disguise the fact but still had to rely on his other senses to live. While in the slave pits, Kleej had a son, Aubin, with another Gotal. Aubin's mother was able to help him filter out the electromagnetic signals he received, but she was later killed, leaving Aubin helpless."}, {"tag": "p", "text": "Kleej performed well in training and was put through to the top swoopdueling events, participating in the Solo Aerials at Jervo's World—a massive space station run by the Franchise over the planet Pantolomin—and, as of 3963 BBY, he had won it four times consecutively. Kleej's popularity was such that he did advertisements and endorsements, had a toy line, and was used as a mascot for the events. Kleej won his fourth Solo Aerials by defeating one of the D'qell Sisters and, at the end of the match, attempted to inform the crowds of spectators about the hidden slaving practices that provided duelists for the Franchise. However, a pre-recorded speech was played over his pleas for help to the spectators in which he instead announced his retirement. In return for threatening to reveal the slavery behind the game, Kleej was physically beaten by two underlings of Bardron—the Krish in charge of the actual games themselves—and was threatened with being sent back to the training pits. Kleej noted that, if sent back to the pits, he would at least be able to see his son, not having done so since the start of the season. Expecting the emotional attachment to Aubin, Bardron revealed that the Gotal's son had been put in the upcoming Tandem Open and that the other competitors had been told to avoid him. Bardron made Kleej the offer that if both he and Aubin won the Open, they would both be able to retire fully. However, the two Gotals would not be in the same round unless they both advanced to the finals. Meanwhile, former Jedi Padawan Zayne Carrick had entered the same Tandem Open round as Aubin and also managed to advance to the next round. Kleej approached the Human after the round and ordered him to protect Aubin so that he would make it through to the finals, threatening Carrick with death if he failed to do so."}, {"tag": "p", "text": "In the semi-finals, Carrick successfully got himself and Aubin through to the next round, though the Gotal struggled throughout the match. Kleej had meanwhile returned to the sport in the same semi-final round and fought with another contender, \"Spikes,\" the \"Mandalorian miscreant.\" The two exchanged blaster fire before Kleej leaped at \"Spikes\" from his bike, proceeding to engage him in unarmed combat. The pair then quickly turned and simultaneously shot a Night-Soarer competitor, leaving them as the last two standing and putting them through to the final round. After the match, when Kleej explained to Carrick how he was tied to the Franchise, and thus couldn't simply leave, Carrick offered to help expose the slaving practices. Meanwhile, on another part of the station, Bardron and Jervo Thalien, a prime investor of the Franchise, plotted to remove Kleej permanently by fixing the match."}, {"tag": "p", "text": "In the final round, several of the safety mechanisms in place were disabled on Bardron's orders to put Aubin, Goethar, Carrick, and \"Spikes\" at a disadvantage. Shortly after the start, the brakes failed on Kleej's swoop bike and the accelerator jammed, forcing him to transfer Aubin, who had been riding with him, from his bike to Carrick's. When a Mandallian Giant competitor attacked Aubin and Carrick, Kleej leaped to protect his son and dispatched the fighter. Remounting his swoop, Kleej followed Carrick's plan and crashed his bike through a window in the side of the arena with Carrick and Aubin following suit. To distract the crowd, the event's musician played his data cube, not knowing that Marn Hierogryph—one of Carrick's companions—had replaced its contents with parts of Kleej's original speech exposing the Franchise as well as part of the conversations between Bardron and Thalien that Hierogryph had eavesdropped upon earlier. Using the uproar that this generated in the crowd as cover, Carrick smuggled Kleej and his son to a spaceport on Pantalomin below in a large trash bin. Once on the planet, Carrick assured Kleej that he could take the Gotal to someone who would be able to act on Kleej's revelations about the Franchise, as well as help Aubin with his difficulties. One of Carrick's other companions, Jarael, soon appeared, and Kleej recognized her facial tattoos signifying her as a slaver for The Crucible. Pushing her away and berating Carrick for associating himself with the former slaver, Kleej fled with his son."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "After suffering poor treatment at the hands of The Crucible when in training, Goethar Kleej dedicated himself to swoopdueling in the hopes that it would be able to get his son out of the fighting. Kleej also held himself responsible for not being able to help his son Aubin deal with the myriad of electromagnetic signals he received. When Aubin was put into the Tandem Open, Kleej strove to protect him by making death threats to Zayne Carrick and later dispatching a competitor who was attacking Aubin. Despite the difficulties that he was faced with, Kleej remained optimistic with a saying from the training pits that \"false hope was better than none.\" Kleej also had an extreme fear of the slavers who had trained him, a fear that made him get himself and Aubin away from Jarael as soon as he recognized what she was."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Goethar Kleej was an exceptional swoop rider and duelist, ably winning the Solo Aerials four times. Such was his success and popularity that swoop manufacturer Lhosan Industries awarded a specially painted bike to the winner of Kleej's last Tandem Open. The Gotal also successfully managed to cope with the loss of his cones, relying on his other senses to compensate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Goethar Kleej's first and only appearance was in the 2009 story arc of the Knights of the Old Republic comic book series, Dueling Ambitions, penciled by Brian Ching and written by John Jackson Miller. When planning the story arc, Miller decided upon Kleej's species by first trying to find a suitable species that would fit Aubin's predicament of struggling with his sensory perception, finding that Gotals fitted his needs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}