{"url": "Golan_I_Space_Defense_Platform", "categories": ["Category:Canon articles", "Category:Galactic Empire space station classes", "Category:Galactic Republic space stations", "Category:Golan Arms products", "Category:Space station classes"], "nodes": [{"tag": "h1", "text": "Golan I Space Defense Platform"}, {"tag": "p", "text": "The Golan I Space Defense Platform, or simply the Golan I station or Golan I, was a class of space station that was used by the Galactic Republic and following Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Golan I Space Defense Platform, or known simply as the Golan I station or Golan I, was a class of space station that was manufactured by Golan Arms, and was the first of its series. The Golan I was armed with fourteen port and fourteen starboard turret-mounted medium turbolasers, three dorsal and two ventral turret-mounted proton torpedo launchers, and three port and three starboard heavy tractor beam projectors."}, {"tag": "p", "text": "Although the Golan I was able to suffer combat punishment a modest enemy fleet could overwhelm the station, regardless of the Golan I's twenty-four TIE line starfighter complement. Also in its complement was four patrol boats and four shuttles. The station held consumables for two years and was crewed by 5,000 officers and personnel, and could accommodate 10,000 other individuals. As a stationary platform, it had no navigation computer and no hyperdrive, although it did carry a long-range sensor."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Golan I served as a planetary defense station initially to free up resources for combat, and later continued to serve in that capacity until it was replaced and relegated to protecting locations of secondary importance and as a customs station."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Golan I station was deployed during the Clone Wars between the Galactic Republic and the Separatist Alliance and allowed the Republic Navy to free up naval assets for the war effort. After the war, the Golan I continued to serve in the Galactic Empire's Imperial Navy, but was surpassed by the Golan-II and the Golan III in both armament and size. As such, the Golan I was relegated to defend less critical planets and secondary locations."}, {"tag": "p", "text": "The Imperial Office of Customs acquired a large number of Golan Is to serve as systems stations outside of the Core Worlds, coordinating operations for ships and personnel across a wide area and serving as customs stations. At one point, one station was surrounded by several Interdictor-class Star Destroyers while located above a celestial body."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Golan I Space Defense Platform was first introduced in Star Wars canon in the 2020 Fantasy Flight Games supplement Starships and Speeders."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}