{"url": "Golan_II_Space_Defense_SpaceGun", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Defense platforms", "Category:Galactic Empire starship classes", "Category:Golan Arms products", "Category:Space station classes"], "nodes": [{"tag": "h1", "text": "Golan II Space Defense SpaceGun"}, {"tag": "p", "text": "The Golan II Space Defense SpaceGun, also known simply as the Golan II, was the second space station in Golan Arms' series of space defense platforms."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Golan II was the successor to the original Golan platform, which was judged to be insufficiently powerful to counter the threat of larger ships such as Star Destroyers. Though the Golan II was based on the same general principles of design and function, the hull was built with a unique crossbeam structure to increase the station's durability, and more efficient power generators allowed for a significant increase in shield power."}, {"tag": "p", "text": "The Golan II station was armed with 35 turbolaser batteries, 10 proton torpedo launchers, and 8 tractor beam projectors. Like the Golan I, they also contained a hangar for small vessels, capable of launching at least 13 starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Golan II platforms were used to defend more valuable targets, like the Imperial shipyards in the Bilbringi system. At the Battle of Bilbringi, it took the combined efforts of Rogue Squadron and two New Republic assault frigates to neutralize one Golan II."}, {"tag": "p", "text": "Despite their impressive firepower, even the Golan II eventually seemed inadequate, and they were succeeded by the Golan III Space Defense NovaGun stations."}, {"tag": "p", "text": "During his leadership of the Imperial Navy, Grand Admiral Thrawn had a Golan II refitted with a cloaking device, it would later be discovered during the Second Battle of Bilbringi."}, {"tag": "p", "text": "As late as the final stages of the Yuuzhan Vong War, Golan IIs were still in service."}, {"tag": "h2", "text": "Known units"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}