{"url": "Allara", "categories": ["Category:Legends articles", "Category:Bergruutfa Clan", "Category:Females", "Category:Humans", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Allara"}, {"tag": "p", "text": "Allara was a female Human Jedi Initiate who studied in the Jedi Order during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "A Force-sensitive female Human, Allara was a member of the Jedi Order, strong in the Force and a firm believer in the Jedi Code. Having trained at the Order's academy for years as a member of the Bergruutfa Clan, Allara and her peers were still quite young when the Clone Wars erupted across the galaxy. In an unorthodox move, Jedi Master Quarmall abducted the clan in 20 BBY and declared that each member was his Padawan. Traveling aboard a Mon Calamari starship along with her clan and new master, their ship was attacked while in transit by General Grievous and a Separatist fleet. With its engines heavily damaged, the crew could do nothing but defend their ship. Despite their efforts, the Mon Calamari crew were cut down by boarding parties of B1-Series battle droids, with Grievous following close behind."}, {"tag": "p", "text": "Quarmall destroyed many of the droids who attacked him, but he was eventually surrounded and confronted by Grievous. The general discussed the possibility of dueling Quarmall, but claimed that he had grown tired of killing Jedi and ordered him killed by the droids instead. The droids turned their weapons on him and blasted the Jedi, seemingly killing him—unknown to all, Quarmall had survived, but would not resurface until years later. Grievous was brought further into the ship by his droids, stepping over the bodies of fallen Mon Calamari on the way. There he found a closed room, and within it, Allara and her fellow Padawans, including Banz and Tak-tak. Grievous ignited his lightsaber and took the Padawans as captives."}, {"tag": "h3", "text": "Captivity on Belsus"}, {"tag": "p", "text": "Soon after, Grievous and the Trade Federation conquered the planet of Gentes and its moon, Belsus. After a brief and one-sided battle, the native Ugnaughts were captured and forced to convert their own factories for use by the Confederacy of Independent Systems. The Padawans arrived on Belsus aboard a C-9979 landing craft, with B1's guarding them closely. Though the other Padawans worried over their fate, Allara was stoic about their situation, and Banz told the others to bury their fear and face the future with courage. The younglings were then brought to meet Grievous once more, on a balcony overlooking the city. Grievous then informed them that they were to become warriors for him, trying to convince them that this fate was not that different than that of being a Jedi. Allara, however, knew that this meant they would become servants of the Sith, and told the cyborg they would never do so."}, {"tag": "p", "text": "She pulled one of Grievous' lightsabers to herself, igniting it and destroying the two battle droids beside her. Grievous, amused by her defiance, simply grabbed her arm and knocked the weapon from her grasp. He then carried her to the edge of the balcony and dangled her over the drop, intent on teaching her a lesson. Pointing into the distance, he drew her attention to a domed assembly hall, which he told her contained the entire surviving Ugnaught population of the city. With a word to a ship in orbit around the moon, Grievous ordered the crew to fire upon the assembly hall, massacring all within. He then asked Allara if she now understood the meaning of his power."}, {"tag": "h3", "text": "Rescue"}, {"tag": "p", "text": "The Padawans were then sent to a holding cell four stories below the city, where they remained for a time. Allara was determined to escape, however, and rallied her fellow Padawans' help. She urged them to reach out with the Force, seeking to open the door with their combined powers. She admonished Banz for his negativity and Tak-tak for his foolishness, but before they could continue trying, one of the stones in the floor moved and revealed a data probe. Allara claimed that she didn't sense any danger from the device, so she poked at and spoke to it. The data probe reacted by withdrawing into the floor, which then began to shake a fall apart. Tak-tak believed Allara's senses had been wrong, but then an Ugnaught miner appeared from the hole in the floor and motioned for the Padawans to follow him below. They joined him and another Ugnaught in a long, narrow tunnel, escaping from their cell."}, {"tag": "p", "text": "Levels above, Grievous showed Commander Vulpus his plans for the Padawans. He intended to make them into versions of himself—complete with limb amputation and organ removal—melding their powers in the Force with cybernetic armor similar to his own. He then brought Vulpus to where the Padawans had been held captive, and discovered they were missing, quickly sending a group of B1 battle droids into the tunnel after them. Allara soon discovered their presence, however, and turned to face them. Angry and humiliated, Grievous ordered the Padawans killed immediately. In the face of oncoming blaster fire, Allara used the Force to collapse the tunnel on the battle droids, destroying them and covering their escape."}, {"tag": "p", "text": "Likely in anticipation of an attack, the Ugnaughts had recently created caverns beneath their city, complete with food, shelter, and water, and it was here they took the rescued Padawans. Their hidden homes were precariously close to flowing magma and the geothermal power plant that fueled the facility above, and many walkways had been erected to provide safe passage. A Zabrak Padawan with the group pointed out that the Ugnaughts believed them to be full Jedi, who could help save them. Allara told the others that the Force does not recognize size, and with a smile, she noted that the Ugnaughts were smaller than even them, which made them seem like heroes."}, {"tag": "p", "text": "Just as it seemed they were safe, however, Grievous blasted through the rock wall above, furious with the Padawans for betraying the \"gift\" he had planned for them. He then descended upon them, lightsabers ignited, with battle droids following him into the hidden city. Banz asked Allara what they should do, and she responded simply that they would fight, defending the Ugnaughts who had saved their lives. Allara once more used the Force to throw rocks in the droids' path, allowing the heroic Ugnaughts to flee. Grievous then confronted the Padawans on the walkway, intent on killing them, until an Ugnaught drove a bulldozer-like machine into the battle, distracting Grievous. The Padawans fled again, running down a path through the rocks and finding themselves at the core of the geothermal plant. When Banz asked Allara where they should go, she replied that they should hide and create a plan, but they realized that they had run out of room and the bridge ahead of them was now cut off by battle droids. Turning back, they found an eager Grievous behind them, blocking their path once again."}, {"tag": "p", "text": "Allara taunted Grievous, saying that he was stooping below himself to kill them. Grievous asked if she was begging for her life, and she responded that she was asking for a chance. Grievous, impressed and amused, tossed her one of his lightsabers, which she caught and ignited. The two began to duel, with Grievous remarking on her concurrent courage and lack of skill, and Allara was quickly disarmed by the superior duelist. He knocked her to the ground and prepared to take her life."}, {"tag": "p", "text": "Unknown to Allara and the Padawans, three other Jedi had set out on a mission to assassinate Grievous. Jedi Master B'dard Tone, his Padawan Codi Ty, and lone Padawan Flynn Kybo had been searching for the general in order to put an end to the threat he posed to the galaxy. Kybo and Tone had seen Grievous' deadly talents up close, with Kybo losing his Master and Tone losing his right arm and the left side of his face. The Jedi Council had forbid this course of action, and told the Jedi they would be expelled from the Order if they pursued it, but the three of them were determined to follow through. With the help of the miners of the Banvhar Combine, who had also suffered the predations of Grievous in the past, the Jedi were able to track Grievous to Belsus and make their move. As they neared the moon, they detected transmissions regarding Padawans, and believed their mission to be compromised. Once they realized that it was in fact a different group of Jedi the Separatists were referring to—Allara and the others—they altered their goals to both kill Grievous and rescue the Padawans. Due to Allara's strong connection with the Force, while they could not sense the others, Master Tone was able to easily pick up Allara's location."}, {"tag": "p", "text": "Finding the Padawans, Kybo jumped in front of Grievous' lightsaber, deflecting the strike with his own blade. Tone and Ty joined Kybo, with Tone ordering Ty to take the Padawans to safety. Kybo and Tone began to duel Grievous, attempting to complete their mission to kill him. Taking up the lightsaber Grievous had given her once more, Allara told Ty she would do better than just follow him, and joined Ty in fighting the battle droids in their way. They reached a ladder and hatch, escaping from the underground, but as they ascended, Ty sensed his master's death and despaired. Allara urged him to honor Tone's final command and continue, pointing out that otherwise his sacrifice would be meaningless. Once in the facility's hangar, they found the Banvhar miners defending their ship, overwhelmed and preparing to leave. The Padawans joined the miners aboard their ship, and they quickly fled as the facility detonated around them, Kybo's duel with Grievous ending in the ignition of the building's fuel supply. Ty told the others that Grievous must have died as well."}, {"tag": "h3", "text": "Return"}, {"tag": "p", "text": "Ty brought the rescued Padawans back to the Jedi Temple on Coruscant, bringing Allara before the Jedi High Council. Ty reported the events on Belsus to the Council, and made it clear that although he believed Grievous to be dead and had rescued the Padawans, he wanted nothing for himself. Allara pleaded for leniency for Ty, but he was prepared to take his exile without regrets. Grand Master Yoda told Ty he indeed had much to regret, and banned the young Togruta from the Order forever."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}