{"url": "Golas_Aram", "categories": ["Category:Canon articles", "Category:Architects", "Category:Males", "Category:Siniteen"], "nodes": [{"tag": "h1", "text": "Golas Aram"}, {"tag": "p", "text": "Golas Aram was a hover chair-bound Siniteen male who worked as a prison architect for the Galactic Empire and various other organizations. He helped the Empire build several prisons and helped with the conversion of the ancient prison ship Ashmead's Lock on the planet Kashyyyk into something suitable for the Empire's purposes. He eventually retired to the planet Irudiru, where he built himself a heavily defended compound away from other life forms, most of whom Aram considered idiotic. Aram was eventually captured from his compound by a group lead by the smuggler Han Solo and the New Republic pilot Norra Wexley, who were searching for the Wookiee Chewbacca, a prisoner of Ashmead's Lock. The former Imperial loyalty officer Sinjir Rath Velus then interrogated Aram, and after threatening to damage the Siniteen's intelligence, successfully got him to share what they wanted to know about the prison. Aram was then let free, and the group traveled to Kashyyyk, where they discovered Aram had not shared Ashmead's Lock's password and had to fight their way through its defenses."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The prison architect"}, {"tag": "p", "text": "Golas Aram was a freelance Siniteen architect who specialized in designing prisons. During his career he created such structures for various criminals groups including Kanjiklub, the Junihar Cartel and Splugorra the Hutt and also designed several prisons for the Galactic Empire, including the Lemniscate on the planet Coruscant, the asteroid prison Orko 9 and the Goa Penal Colony. He also did work for the Empire on the prison ship known as Ashmead's Lock, which was a relic of a ancient civilization known as the Predori found on the planet Kashyyyk. With Arams aid, the Empire converted the alien vessel into a functioning prison which they used to incarcerate various dissidents. He eventually chose to retire to the planet Irudiru, where he built a compound near the town of Kai Pompos with heavy defenses and stocks of animals such as morak for hunting."}, {"tag": "h3", "text": "A not-so-quiet retirement"}, {"tag": "p", "text": "Following the capture of the Wookiee Chewbacca by the Empire and his confinement, the smuggler Han Solo traveled to Irudiru in the hopes of gaining information from Aram about the prison so that he could free Chewbacca. Solo watched Aram's compound for X days, noticing that the Siniteen regularly swept his property for listening devices. A group led by the pilot Norra Wexley then arrived and also began scoping out the compound, having been led to it by intelligence from the Black Sun and the captive Imperial Adviser Yupe Tashu while searching for Solo. Unaware of Solo's presence, the group then observed Aram's compound for several days, in which time Aram did not venture outdoors. Wexley's group then attempted to remotely bug Aram's home, but were stopped by Solo, who drove a herd of Aram's morak toward them before they could fire the listening device at the house."}, {"tag": "p", "text": "Solo and Wexley's team then devised a plan together to capture Aram for questioning, initiating it under the cover of night. First, the bounty hunter Jas Emari began shooting the land mines that surrounded Aram's compound. The explosions acted as a signal for Wexley's son Temmin Wexley and his B1-series battle droid Mister Bones to cut the conduit that connected Aram's compound to the wind farm that powered it. This deactivated the turret-droids and laser fences that also protected Aram, and allowed Sinjir Rath Velus to enter the compound. Alerted to the intrusion, Aram set his many droid protectors on the trespassers and then destroyed half of the his computer systems and attempted to flee using tunnels buried beneath his home. He found Solo waiting for him in the tunnels and shocked him with his hover chair before continuing on to a landing platform with a solar shuttle he planned to use to flee to family he had on the planet Saleucami. Wexley however, was waiting for him at the shuttle and knocked him out."}, {"tag": "h3", "text": "Under interrogation"}, {"tag": "p", "text": "Wexley's group picked up Aram in their SS-54 assault ship Halo and Sinjir then began interrogating him on board for information about Ashmead's Lock. Aram refused to divulge anything under the threat of physical torture, instead complaining about the damage his captors had caused to his property and insulting their intelligence. He finally broke when Sinjir threatened to drive a small antennae through Aram's ear, damaging his brain and his intelligence. The Siniteen quickly shared all he knew about the jail, but failed to tell the group about the password they would need to safely enter. Satisfied, the group let Aram free and traveled to Kashyyyk, where upon reaching the prison they were nearly captured by its defenses due to their lack of a password. Ultimately the group managed to free those imprisoned in Ashmead's Lock, and later went on to liberate all of Kashyyyk from the Empire's control."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Aram was a Siniteen male who was bound to a hover chair due to the state of his legs by the time he retired. He considered making inescapable, self-sustaining prisons his art and believed that Wexley's team only managed to break into his personally designed compound by luck. While living on Irudiru, Aram was extremely paranoid, hiding behind an unusually high number of defenses and regularly sweeping his home for bugs. When captured he cared little for threat to his physical form, and was happy to insult and criticize his captors, who he considered far inferior in intelligence. This changed when they threatened his brain and intellect, and he quickly gave them most of what they wanted, although still leaving a trap for them by omitting the need for a password at Ashmead's Lock."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Golas Aram first appeared in the novel Aftermath: Life Debt, which was written by Chuck Wendig and released in 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}