{"url": "Gold_Squadron_(Rebel_Alliance)/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Gold Squadron personnel"], "nodes": [{"tag": "h1", "text": "Gold Squadron  (Rebel Alliance)"}, {"tag": "p", "text": "Gold Squadron was an Rebel Alliance squadron consisting of Y-wing starfighters during the Galactic Civil War. The squadron most famously fought at both the Battle of Yavin and the Battle of Endor."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Aboard Independence"}, {"tag": "p", "text": "A Gold Squadron was stationed aboard the Mon Calamari Star Cruiser Independence during the build up to the Battle of Yavin. Many members were transferred to Yavin Base and reassigned to different squadrons for the Death Star assault."}, {"tag": "h3", "text": "Battle of Yavin"}, {"tag": "p", "text": "During the Battle of Yavin, Gold Squadron under the command of Jon \"Dutch\" Vander was tasked with attacking the Death Star's thermal exhaust port while Red Squadron flew cover. The entire squadron was wiped out except for Keyan Farlander, after which Red Squadron made the final successful trench run."}, {"tag": "h3", "text": "After Yavin"}, {"tag": "p", "text": "In the months following the Battle of Yavin, General Crix Madine led a Gold Squadron of Y-wings working closely with Rogue Squadron on a number of bombing raids, including the Liberation of Gerrard V."}, {"tag": "p", "text": "Following the Battle of Hoth, several Gold Squadron Y-wings attempted to attack an Imperial space station, Outpost D-34, but were defeated by Maarek Stele and several TIE squadrons."}, {"tag": "p", "text": "A Gold Squadron flying X-wing fighters was stationed aboard the cruiser Liberty during operations against Imperial Task Force Vengeance in the Airam sector."}, {"tag": "p", "text": "In the lead up to the Battle of Endor, a Gold Group consisting of multiple starfighter types was posted to the cruiser Defiance, and later, the Independence."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "Gold Squadron's Y-wings fought in the Battle of Endor—in which it was also referred to as Gold Group and as Gold Wing—under the command of General Lando Calrissian piloting the YT-1300 light freighter Millennium Falcon. Assigned the task of destroying the second Death Star, the battle group was hit hard early in the engagement, with its surviving pilots—including \"Gold Wing\"—following the Falcon into the Death Star's superstructure. Through attrition and attempts to draw away the pursuing TIE fighters, the number of Rebel craft inside the space station dwindled until only the Falcon, \"Gold Wing\", and Red Leader Wedge Antilles remained. While \"Gold Wing\" was shot down by an Imperial fighter, Calrissian was able to enter the reactor core, firing on it with Antilles and causing the destruction of the second Death Star."}, {"tag": "h3", "text": "After Endor"}, {"tag": "p", "text": "The day after the victory at Endor, the squadron—without Calrissian—joined the Alliance's Bakura task force, combatting the planet's invasion by the Ssi-ruuvi Imperium in response to an Imperial distress message. Arriving in-system to reinforce Imperial Commander Pter Thanas, Gold Squadron joined Rogue Squadron in an attack on a Ssi-ruuvi Wurrif-class light cruiser."}, {"tag": "p", "text": "Gold Squadron continued to serve in the newly-formed Alliance of Free Planets, fighting Nagai forces in the Second Battle of Endor, with Calrissian flying as Gold Leader in the Cobra. It later engaged the Tof forces in the Battle of Saijo, destroying half of their Tof starfighters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}