{"url": "Allegiance_(Allegiance-class)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Allegiance-class battlecruisers", "Category:Flagships", "Category:Starships of the Dark Empire"], "nodes": [{"tag": "h1", "text": "Allegiance (Allegiance-class)"}, {"tag": "p", "text": "The Allegiance was an Imperial Allegiance-class battlecruiser that participated in the Battle of Calamari in 10 ABY. When the Allegiance began transmitting images of Calamari's destruction to the Deep Core, the New Republic Star Destroyer Emancipator intercepted the transmissions and tracked the Allegiance's location. Once the Emancipator dropped out of hyperspace above Calamari, it attacked and destroyed the Allegiance."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Allegiance was a Super Star Destroyer that served the Galactic Empire after the rebirth of Emperor Palpatine. The vessel served as the Imperial command ship during the Battle of Calamari, where it transmitted images of Calamari's destruction to the Deep Core through a hyperspace communications channel. The Allegiance was also equipped with deflector shields."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 10 ABY, the Allegiance commanded a fleet orbiting the world Calamari. It transmitted images of Calamari's subjugation by the Emperor's latest superweapons, the World Devastators, through a hyperspace communications channel to the Imperial fortress world Byss in the Deep Core. These transmissions were intercepted by the New Republic Star Destroyer Emancipator under the command of Generals Wedge Antilles and Lando Calrissian. The Emancipator, already on its way to Calamari with a fleet of its own, recalculated its exit from hyperspace two degrees from the source of the transmissions."}, {"tag": "p", "text": "As the Emancipator and its fleet dropped out of hyperspace, a crew member aboard the Allegiance attempted to contact the World Devastator Silencer-7, but his transmission was cut off mid-sentence as the Emancipator opened fire on the Super Star Destroyer. The Allegiance, caught with its deflector shields down, was easily destroyed, alongside its two Procursator-class Star Destroyer escorts, by concentrated fire from the Emancipator's forward weapons, manned by Zevulon Veers, and its wreckage was left to drift in space above Calamari."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "At least one crew member served aboard the Allegiance. This crew member sent a transmission to Silencer-7, warning Commander Titus Klev of the New Republic attack on the Imperial fleet above Calamari. However, the crew member's message was cut short as the Emancipator fired on the Allegiance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Allegiance was created for the third issue of the 1991-1992 comic book series Star Wars: Dark Empire, written by Tom Veitch and illustrated by Cam Kennedy. It later appeared in the audio adaptation of Dark Empire, released in 1994. The Allegiance, compared with the other Star Destroyers surrounding it in issue three of Dark Empire, is notably small for a Super Star Destroyer and resembles an Imperial-class Star Destroyer in appearance. At one point, the audio drama refers to the Allegiance as an \"Imperial Star Destroyer,\" while it is called a Super Star Destroyer in all other instances."}, {"tag": "p", "text": "The Allegiance's ship class was originally supplied by fan artist Ansel Hsiao, who labeled it as the Allegiance-class heavy Star Destroyer on his personal art gallery. The class was eventually made canon due to Lucas Licensing using Hsiao's artwork for the ships in The Essential Guide to Warfare. The class name was also added into the Holocron's continuity database during this process, according to the artist."}, {"tag": "p", "text": "The use of \"heavy\" in the class-name on his gallery was Hsiao's own invention. According to him, it is not part of the canonical name which was submitted to the Lucas Licensing continuity database. The term \"heavy star destroyer\" was kept in canon as a nickname for the ship's class, according to author Jason Fry in his endnotes for the book. Although he refers to it as appearing in Dark Empire II, the class name used in his endnotes is the same one Hsiao submitted. Fry used the \"Anaxes class designation\" for the ship, rather than the designation Hsiao has on his 3D model site. A similar change was made with the Bellator-class dreadnought, which was originally listed as a Star Battlecruiser on Hsiao's site."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}