{"url": "Golden_Lichen", "categories": ["Category:Canon articles", "Category:Batuuan food", "Category:Lichen"], "nodes": [{"tag": "h1", "text": "Golden Lichen"}, {"tag": "p", "text": "Golden Lichen, also known as gold dust, was a type of lichen native to the Outer Rim planet Batuu. It could be used in food and as a dye. It often grew on the sides of the planet's petrified spires as well as on the sides of buildings."}, {"tag": "p", "text": "The crime lord Oga Garra had a monopoly on the cultivation and exportation of Golden Lichen. Many residents of Surabat Vicinity were involved in the dangerous process of harvesting it for her."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Golden Lichen was a species of bright golden lichen\nuniquely found on its homeworld of Batuu. The lichen could grow over trees, rocks and man made structures. It had a variety of uses, including use in paint and dye or as an exotic garnish or ingredient in cooking. Chef Strono Tuggs published his recipe for a type of tuile called Golden Lichen Tuile in his cookbook."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the war between the First Order and the Resistance, Golden Lichen could be found widespread through Black Spire Outpost on Batuu, where it was called gold dust by the locals who discovered the many uses of the lichen. It grew across the outpost's stone spires, trees, rocks and man made structures."}, {"tag": "p", "text": "The crime lord Oga Garra had a monopoly over the cultivation of Golden Lichen on Batuu as well as over its exportation to other planets. Many of the residents of Surabat Vicinity on Batuu were involved in the dangerous process of harvesting Golden Lichen for Garra, as it grew on the gigantic spires that surrounded their settlement."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Golden Lichen was created as a themed element prominent throughout the theme park land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}