{"url": "Goluud_Minor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Arrowhead planets", "Category:Mining planets"], "nodes": [{"tag": "h1", "text": "Goluud Minor"}, {"tag": "p", "text": "Goluud Minor was a mining world located within the Goluud Minor system of the Core Worlds. By 5000 BBY, a new mining colony had been established on the planet, and merchant lord Ssk Kahorr sent the drone ship Zeta Five to deliver much-needed mining technology and equipment to the colony and sell them to the wealthiest miners. However, the Zeta Five never arrived at Goluud Minor, as it was destroyed by a solar flare from the unstable red supergiant star Primus Goluud during a stopover in the Primus Goluud system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Goluud Minor was a mining world that was located within the Goluud Minor system of the Arrowhead, a region in the Slice portion of the Core Worlds."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the year 5000 BBY, a new mining colony had been established on Goluud Minor, and the Cha'a merchant lord Ssk Kahorr of the planet Koros Major had become one of the colony's major investors. In that year, the excavators on Goluud Minor were in need of mining technology components and equipment, so Kahorr sent his Cha'a drone ship, the Zeta Five, to deliver the supplies to the colony and sell them to the wealthiest of the competitive miners."}, {"tag": "p", "text": "However, the Cha'a merchant chose to send the Zeta Five along the Goluud Corridor, a recently discovered hyperspace route that involved a navicomputer-recalibration stop in the Primus Goluud system. Upon arriving in that system, the drone ship was destroyed by an unexpected solar flare originating from the unstable red supergiant star of Primus Goluud, and the vessel never arrived at Goluud Minor as a result."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Goluud Minor was created for the Star Wars: Tales of the Jedi comic book series and was mentioned in the first issue of The Golden Age of the Sith story arc. The issue was published on October 1, 1996, and was written by Kevin J. Anderson and penciled by Dario Carrasco, Jr. The Goluud Minor system, and therefore Goluud Minor, was placed in grid square L-10 by The Essential Atlas, a 2009 reference book co-authored by Jason Fry and Daniel Wallace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}