{"url": "Gondara", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Aqualish", "Category:Females", "Category:Shroud Team members", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Gondara"}, {"tag": "p", "text": "Gondara was an Aqualish female from the planet Ando. She was raised by her older brother, Karlon, after their parents were killed by the Galactic Empire. Karlon went on to join the Alliance to Restore the Republic, and Gondara spent time on an Alliance safe world to avoid potential Imperial reprisals over her brother's actions. When Gondara was seventeen, Karlon was killed in battle on Bresnia. Karlon's best friend, the Carosite medic Tamo Lan, took responsibility for the teenager, and she joined him in serving with Shroud Team, a unit of Foster Agents—tasked with assisting stranded operatives in returning to the Alliance—in Corint City on the planet Pirik. An able thief, Gondara trained under Lam to be his medical assistant."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gondara was a female Aqualish born between 17 BBY and 13 BBY on the planet Ando. Her parents were killed by Imperial soldiers, leaving her to be raised by her elder brother, Karlon. Several months after the death of their parents, Karlon joined the Alliance to Restore the Republic, an insurgent movement dedicated to overthrowing the Empire. Gondara was sent to live on an Alliance safe world so that she would be protected from any Imperial attempt to use her to get to Karlon while he served with the Alliance during the Galactic Civil War."}, {"tag": "p", "text": "Sometime after 0 ABY, when Gondara was seventeen, Karlon was killed in the line of duty fighting Imperial forces on the planet Bresnia; Gondara chose to enter active service with the Alliance following her brother's death. Karlon's best friend, the Carosite medic Tamo Lan, took responsibility for Gondara, taking her under his wing as his charge. Lan was serving under the Jin Lieutenant Dutra Zeneta as part of Shroud Team, a unit of Foster Agents responsible for helping stranded operatives return to the Alliance, in Corint City on the planet Pirik. Despite not being a veteran agent, Gondara was a skilled thief when she joined the unit. She served as a Foster Agent alongside the rest of the team, which also included the Rodian Dheendo and the Ishi Tib Thilis-Brin."}, {"tag": "p", "text": "Gondara's assignment was one of the most dangerous roles in the entire Alliance; Foster Agents were constantly threatened with exposure from Imperial forces, as their names and locations were common knowledge to Alliance operatives in the field who may have need of their services. If an operative was to be captured and reveal the name of the Foster Agent under interrogation, the Agent was compromised. Gondara also assisted Lan in his medical duties, and she began to develop the skills needed to operate as his assistant."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gondara was an adolescent Aqualish training to be an effective member of the Alliance, although she was considered to be an adult of her species. Already a skilled thief and pickpocket by the time she was assigned to Shroud Team, she also began to develop the necessary skills to serve as a medical assistant. She had some knowledge of other alien species and languages, and was well informed about the inner workings of Corint City itself. Capable of driving repulsorlift vehicles, Gondara could also operate security equipment. She was able to defend herself from attack, and carried a club for self-defense and a comlink."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gondara first appeared in \"Cracken's Rebel Operatives,\" an article series that appeared in issues of West End Games' Star Wars Adventure Journal. Gondara was profiled in the article published in the tenth issue, released in 1996, written by C. Robert Carey. An illustration of Gondara by Kathy Burdette accompanied her capsule. In 2003, Gondara was name-checked in Wizards of the Coast's Ultimate Alien Anthology as an example name for Aqualish characters."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}