{"url": "Gor-kooda", "categories": ["Category:Canon articles", "Category:Enforcers", "Category:Herglics", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gor-kooda"}, {"tag": "p", "text": "Gor-kooda was a Herglic male who served the Sullustan crime lord Surat Nuat as an enforcer on the planet Akiva. After the junk dealer Temmin Wexley stole a shipment of goods from Nuat, Gor-kooda accompanied his employer to the dealer's shop in search of the stolen objects; however, they instead found the bounty hunter Jas Emari, whom they captured after realizing she planned to kill one of their Imperial allies. Upon bringing their captive back to Nuat's bar the Alcazar, Gor-kooda and Nuat were confronted by the former Imperial, Sinjir Rath Velus, whom they also took captive after he tried to persuade them to give him Emair."}, {"tag": "p", "text": "Gor-kooda then returned to Wexley's shop in order to try and recover the stolen shipment, but after an hour of searching discovered Wexley himself, who had fallen from a nearby roof while observing the enforcer dig through his shop. The Herglic brought Wexley to Nuat, who had the enforcer stay while he questioned the junk dealer in his office at Alcazar. When the crime lord decided he would torture the thief, Gor-kooda was tasked with dragging Wexley to the cistern where Nuat would inflict pain on him. En route, the Herglic was attacked by Velus and Emair, who had escaped the dungeons of Alcazar and intended to rescue Wexley. Velus at first proved ineffective at fighting the large thug, but Emair was able to defeat the Herglic by punching him in the nose, allowing the trio to escape."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sometime after the Battle of Endor, the Herglic Gor-kooda worked as an enforcer for the Sullustan crime lord Surat Nuat on the planet Akiva. Shortly prior to the Rebellion on Akiva, he accompanied Nuat and five other thugs to the shop of Temmin Wexley, a local junk dealer who had recently stolen from Nuat. They found no trace of Wexley in his establishment, but instead discovered the bounty hunter Jas Emari napping on a bench in the back of the building. Nuat woke Emari and recognized her, questioning her as to why she was in the shop and on Akiva. After working out that she was on the planet to take out and Imperial target for the New Republic he had one of his men stun her as she tried to flee. Gor-kooda then lifted her over his shoulder and carried her out of the shop, bringing her back to Nuat's bar the Alcazar. Upon entering the bar, Gor-kooda, Nuat and the other thugs were approached by the former Imperial Sinjir Rath Velus, who recognized Emari from a previous encounter and hoped to save her. He initially offered to buy her from Nuat, but upon learning that the crime lord intended to gift her to the Empire pretended to be an Imperial who had been sent to collect her. As Nuat had not yet informed the Empire of Emari's capture he realized the man was an imposter and ordered his thugs to kill him. Velus attempted to flee across the bar from the thugs, but was knocked unconscious by the establishment's bartender and captured."}, {"tag": "p", "text": "After Sinjir and Emari were placed in Nuat's cells, Gor-kooda returned with several other thugs to Wexley's shop in order to search for Nuat's stolen goods. The Herglic and the Abednedo Toomata Wree spent an hour throwing junk from the shop into the street while several of their colleagues attempted to drill through the shop's basement into a secret sub-layer where Wexley stored his most valuable goods. Wexley himself, who had returned to try and secure his goods, spent the hour watching them from a nearby rooftop using binocs. As the junk dealer tried to work out a plan to re-enter his shop, he was attacked by a pair of Kowakian monkey-lizards who wanted to steal the binocs he was using. The two creatures successfully managed to steal their prize, and in the scuffle for it, Wexley fell from the roof, drawing Gor-kooda's attention. Before the junk dealer could get up, the Herglic hooked his ax into the boys nose and tugged his head up to face him. After realizing who he had found, Gor-kooda called to the other thugs and the group brought Wexley back to Nuat as a prisoner."}, {"tag": "p", "text": "Nuat had Gor-kooda bring Wexley to his office in the Alcazar, where he questioned the junk dealer with the Herglic present. At first Nuat stood with his boot upon Wexley's back as the boy lay prone, but the crime lord then had Gor-kooda lift the prisoner to his feet so he could strangle him. Once he had released Wexley's throat, Gor-kooda kicked him to the floor again as Nuat continued to speak, explaining how he had killed his own family and then revealing that he intended to torture Wexley. When Nuat decided to take his tongue, the prisoner tried to flee, but Gor-kooda swiftly kicked him to the floor again, after which Nuat ordered the Herglic to take Wexley to the cistern where the torture would take place."}, {"tag": "p", "text": "As Gor-kooda dragged the boy through the Alcazar's corridors, he was suddenly confronted by Velus, who had managed to escape from Alcazar's dungeons with Emari. In an attempt to rescue Wexley, the former Imperial kicked the Herglic in the knee, but to little effect, only causing the thug to laugh. Gor-kooda then dropped Wexley and grabbed Velus, who slipped out of his grip and unsuccessfully attempted to strangle his opponent despite the Herglic's lack of a neck. Gor-kooda then slammed him into a nearby wall two times, after which Emari emerged and hit Gor-kooda hard in the snout, causing the thug great amounts of pain. Letting go of Velus, he flailed around blindly with his eyes closed in pain, giving his three opponents a chance to flee. As the trio tried to escape the bar, Nuat and his thugs gave pursuit, with Gor-kooda leading the charge out the building's door after recovering. The criminals were too late however, as Wexley and his new allies managed to escape with the aid of his mother Norra Wexley on a bala-bala speeder. Nuat's thugs later fought alongside the Imperials against the New Republic in the Rebellion of Akiva, but ultimately lost, forcing Nuat to flee the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gor-kooda was a heaving, seething Herglic with slick, shiny black skin and many rows of tiny serrated teeth within a huge mouth within a huge head. He had huge, meaty hands, big enough to bend a speeder bike in knots. He lacked a neck or chin, making it difficult to strangle him and was barely bothered by a kick to the knee from a fully-grown human; however, his nose was his weak point and once hit he would be incapacitated, spewing a saline-snot like substance from his nasal perforations and howling in pain with his eyes closed. While standing in Wexley's shop with Nuat his blow-hole puffed out and hissed gouts of breath and spit. He smiled a sinister grin upon catching Wexley, and the sound of his teeth running together made a sound similar to a rasp running across wood. During his fight with Velus, the Herglic was initially confused by the former Imperial's appearance, but laughed when the former Imperial tried to hurt him and quickly fought back."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Gor-kooda carried a particularly large ax."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gor-kooda first appeared in the novel Aftermath, which was written by Chuck Wendig and released in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}