{"url": "Gorak_Khzam", "categories": ["Category:Legends articles", "Category:Criminals", "Category:FarStar crewmembers and personnel", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Gorak Khzam"}, {"tag": "p", "text": "Gorak Khzam was a Rodian male who was once a member of the Sabiador Slavers. In 8 ABY, he became the security officer, and later first officer, of the FarStar."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Slaver"}, {"tag": "p", "text": "Khzam was originally a member of the Sabiador Slavers, a syndicate that operated in the Kathol sector and surrounding space. He was in charge of security for the group. After the group disbanded, he found himself on Kal'Shebbol prior to the New Republic's liberation of the planet."}, {"tag": "h3", "text": "Onboard the FarStar"}, {"tag": "p", "text": "Following the liberation of Kal'Shebbol, Khzam decided he needed to get off the planet to escape any possible retribution from the former slaves that had been freed from Moff Kentor Sarne's detention blocks. The FarStar was the only way off the planet, and the only ship going in his direction. Despite the fact that some of the former slaves would be a part of the crew, Khzam was not generally known as a slaver, and his identity could remain undiscovered."}, {"tag": "p", "text": "Khzam claimed to have extensive knowledge of the Kathol sector due to his time as a free-trader in the area, and have extensive contacts on several planets. He was assigned as the FarStar's security officer, and worked mainly on the bridge overseeing operations. Captain Ciro and Kaiya Adrimetrum often solicited his advice and suggestions."}, {"tag": "p", "text": "Following the capture of Captain Ciro at the Battle of Kolatill, Khzam was promoted to First Officer of the FarStar. After an encounter with a former member of the Sabiador Slavers in the Kathol Republic, Uta T'Cha, Khzam eventually defected, departing with fellow crewmember Nizzal on the shuttle Muvon."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Personal quirks"}, {"tag": "p", "text": "Khzam avoided physical contact with other beings, and refused to engage in hand-to-hand combat. He was very protective of his personal space, and anyone coming within half a meter of him was told \"Kozak lo neets-ka\" – \"keep to your own space.\""}, {"tag": "p", "text": "His attitudes towards species officially regarded as slaves by the Empire were condescending because of his time as slaver. He considered anything beautiful or exotic to be a lesser being, and something to be enslaved. He did not expect any former slaves to be among the crew of the FarStar."}, {"tag": "p", "text": "Although Khzam was often asked for advice, he rarely gave it off his own back, preferring to be asked directly. On occasion, it would seem like he had an opinion to voice, but suppressed it until asked."}, {"tag": "p", "text": "Khzam's main goal was always self-preservation. He shot first and then justified his actions later, and always had an alibi ready. Part of his time spent on ground missions were scouting out potential hiding places should his past be revealed, and he always had a back-up plan ready. He often avoided settled worlds or Imperial installations for fear of being recognized."}, {"tag": "h3", "text": "Personal relationships"}, {"tag": "p", "text": "The being Khzam considered a friend is the Defel, Kl'aal. The two often shared hunts on uninhabited planets during the voyage. He also knew of Jessa Dajus' true past, but kept it quiet until he felt the need to reveal the information."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}