{"url": "Gorax/Legends", "categories": ["Category:Legends articles", "Category:Mammalian sentient species", "Category:Non-native Endorian species", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Gorax"}, {"tag": "p", "text": "The Gorax were a species of behemoths found on the forest moon of Endor who frequently preyed on the Ewoks."}, {"tag": "h2", "text": "Biology and culture"}, {"tag": "p", "text": "It was unknown if the Gorax were actually native to Endor, although Lyrre T'enna\nseemed to favor this theory, believing that the gravitic pull of the planet Endor on its moon allowed for native species to grow to incredible sizes. Other scientists believed the Gorax originated on the homeworld of the Phlogs, another gigantic species found on the moon, and that both the Gorax and Phlogs were introduced to the moon by the crashed slave caravel Sickly Tremor."}, {"tag": "p", "text": "Humanoid in appearance, adult Gorax were usually over six meters tall. Some specimens were recorded that were up to 30 meters in height. Their bodies were covered in thick, matted fur, which was black, brown, or sometimes gray. Their hairless faces were dominated by protruding lower jaws and heavy brows. Inexplicably, some Gorax had hoof-like feet, while others had long toes, and either a long, narrow heel, or a backward-pointing fourth toe. Though they were omnivorous, their pointed teeth were well adapted to eating meat. They had wide, long, and pointed ears that were highly sensitive to noises made by small animals. Though their hearing was strong, their eyesight was weak. Bright light pained them, making them nocturnal hunters."}, {"tag": "p", "text": "Powerful but primitive, and albeit demonstrating signs of developing sentience, their technology was crude even in comparison to the Ewoks. They were limited to simple items such as clubs, stone axes, animal-skin clothing, and the like. They communicated by making grumbling noises. Gorax were solitary creatures, but they did domesticate boar-wolves (usually by killing a mother boar-wolf and stealing a newborn pup). They also raided Ewok villages, where they smashed through walls to capture Ewoks. Gorax took Ewoks both for food and to be kept in a hanging cage in a Gorax lair as pets. Luckily for the Ewoks, Gorax were not a common species, with fewer than two dozen estimated to reside on Endor."}, {"tag": "h2", "text": "Gorax in the galaxy"}, {"tag": "p", "text": "One particular Gorax dwelled on high crags beyond the Desert of Salma, which was far from the Endor forests. His home was a rearing spider-infested cavern built beneath a mountain fortress. It is unclear who built the fortress, if it was not built by the Gorax himself. This Gorax kidnapped two Humans who had crash-landed on Endor, Catarine and Jeremitt Towani. Their children, Mace and Cindel, rescued them with the help of a group of Ewoks from Bright Tree Village (including Deej Warrick and his sons Wicket, Willy, and Weechee Warrick). During the rescue mission, the Towani children and the Ewok warriors killed the giant by making him fall into one of the many chasms in his fortress."}, {"tag": "p", "text": "A Gorax head could be found in the trophy room of Imperial Captain Ozzik Sturn on Kashyyyk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to Industrial Light & Magic: The Art of Special Effects, Jon Berg portrayed the Gorax in Caravan of Courage."}, {"tag": "p", "text": "Gorax shares basic similarities with the Bobog, the Grudakk, and the Red Nebula temple guardian, notably a prolific stature, but it is unknown if any of them share genetic ancestry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}