{"url": "Gorax", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Creatures of Endor", "Category:Mountain creatures", "Category:Semi-sentient species"], "nodes": [{"tag": "h1", "text": "Gorax"}, {"tag": "p", "text": "Gorax were a semi-sentient species of seldom-seen giant humanoids native to the mountains of Endor. They sometimes attacked the villages of the Ewoks, who were among the sentient inhabitants of the moon."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Gorax were humanoids of gigantic proportions. One particular specimen was more than five times taller than Luke Skywalker, a human who measured 1.72 meters. A Gorax's ocher skin was covered in thick, matted dark fur, except on the face, hands and feet. Its head featured two forward-facing eyes with bushy brows, a mouth full of sharp fangs, and slit nostrils. Its limbs terminated in four fingers, including an opposable thumb. All of these digits ended in sharp nails. In his hand-drawn map of Endor, however, the Ithorian artist Gammit Chond depicted a Gorax with three-fingered hands, and feet with two large toes. Their large ponted ears offered them a highly sensitive hearing."}, {"tag": "p", "text": "Gorax had immense strength; they were capable of uprooting a large tree effortlessly with both hands."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "Gorax lived in mountainous areas and rarely showed themselves. Although notoriously aggressive, cruel, and rather stupid, they displayed a capacity to use objects as crude tools—for example, using an uprooted tree as a blunt weapon. Moreover, some wore crude pieces of clothing, like a sash made of furs and skulls, or a belted loincloth."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Gorax dwelled on Endor, a forested moon of the Outer Rim Territories that orbited a planet of the same name. Occasionally, they emerged from their habitat to attack the villages of sentient Ewoks who also lived on Endor. The Ewoks of Bright Tree Village posted watchers in the forest canopy above their homes to look out for such marauding Gorax. In fact, Gorax raids were one of the reasons why the Ewoks built their villages high in the trees, and why they created a variety of traps, catapults and other large weapons."}, {"tag": "p", "text": "When Chief Buzza still led Bright Tree Village, a male Gorax lived near Mount Krana. Makrit, the village's shaman at the time, had come to worship the giant, whom he called \"Great Devourer.\" Makrit intended to sacrifice kidnapped woklings in the Gorax's honor, but ended up being eaten instead."}, {"tag": "p", "text": "In 4 ABY, the Gorax traps the Bright Tree Ewoks set up as a defense were re-purposed for taking out the All Terrain Scout Transport units deployed by the Galactic Empire during the Battle of Endor. Shortly after the battle, Luke Skywalker and Leia Organa helped the Ewoks Kneesaa and Wicket stop a rampaging Gorax by resetting those traps."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gorax were originally created for the Star Wars Legends television film Caravan of Courage: An Ewok Adventure, which was released in 1984 and included a member of the species as a major villain. The species was confirmed to be canon in the reference book Ultimate Star Wars, which was released in 2015."}, {"tag": "p", "text": "In \"Survivors on Endor,\" a walker assault map included in a DLC of the video game Star Wars Battlefront, the players enter a cavern containing giant spiders and what appears to be the lair of an immense creature, complete with an empty cage hanging from the ceiling. This evokes the Gorax lair in Caravan of Courage. A similar cave system can be found in the map for the mode \"Ewok Hunt\" in Star Wars Battlefront II."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}