{"url": "Gorc", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Dark Side Adepts", "Category:Gamorreans", "Category:Males", "Category:Mutants", "Category:Named Sithspawn", "Category:Seven Dark Jedi"], "nodes": [{"tag": "h1", "text": "Gorc"}, {"tag": "p", "text": "Gorc was a Force-sensitive Gamorrean male native of the planet Pzob. After leaving his homeworld with his older brother Thok, Gorc traveled the galaxy, serving first as a test subject for a scientist named Pineas Pontak, and later as an enforcer for the Hutt crime lord Jabba Desilijic Tiure on the planet Tatooine. However, when the brothers found themselves in trouble after a cantina fight, Gorc was sold out to the Galactic Empire by Thok. The Gamorrean was subsequently mutated into Sithspawn by Galactic Emperor Palpatine's \"monster-maker\" Cronal. As a result of his mutation, Gorc shared genes, abilities, and characteristics and had a symbiotic link through the Force with his fellow test subject, the Kowakian monkey-lizard Picaroon C. Boodle. Because of that connection, Gorc and Pic were eventually dubbed \"the Brothers of the Sith.\" The \"twins\" were pressed into service of the Miraluka Inquisitor Jerec and, as part of his Dark Jedi team, helped him in the search for the long-lost Valley of the Jedi, the source of great power which Jerec hoped to use for his own needs."}, {"tag": "p", "text": "In 5 ABY, Jerec sent Gorc and Pic to deactivate the droid information broker 8t88—a mission which the brothers easily completed aboard Jerec's personal cargo ship, the Sulon Star. However, 8t88 was tracked by an aspiring Jedi, Kyle Katarn, who was trying to stop Jerec. Gorc tried to attack Katarn with his huge lightclub, but was killed by a shot in the face from Katarn's Bryar pistol."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Gorc was a male Gamorrean native of the Gamorrean colony world of Pzob. A member of the Skunnt clan, Gorc and his older brother Thok both shared a rather uncommon trait among their species—they were Force-sensitive. The two were initially oblivious to their powers, but Thok, generally regarded as the smarter of the two, eventually realized their true potential when he accidentally belched out a ball of fire into the snout of his rival Scumbo. Believing that they would be able to put their powers to good use and make fortune, Thok acquired a universal transliterator and took Gorc offworld. Gorc and his sibling first found work as guinea pigs for a scientist named Doctor Pineas Pontak on the planet Zlarbv IV. As part of his development of the Pontak Hypergland, Pontak performed painful experiments on the pair, infusing their bodies with alien secretions, which had an unexpected side-effect of making Gorc's and Thok's muscles swell when they were enraged. Fed up with the Doctor's methods, the brothers eventually left him and moved to the desert planet of Tatooine. There, Gorc and his brother met a fellow Gamorrean named Ortugg, who recruited them to serve as bodyguards for a notorious local crime lord, the Hutt Jabba Desilijic Tiure. The two spent some time in Jabba's employ until one night in Mos Eisley's Red Moon Saloon. During an incident that erupted there—which involved Thok, Gorc, seven barrels of Zelosian wine, and a Kloo horn—three Gungans were bludgeoned to death and five Ugnaughts ended up being fricasseed."}, {"tag": "p", "text": "Gorc and Thok were captured and ended up in the custody of a local Imperial darksider named Sariss, who was better known as the \"Prophetess\". Gorc's older brother betrayed him in an effort to save his own life and told Sariss about Gorc's Force-sensitivity. However, this only piqued the Prophetess' interest and she took Gorc away. Gorc ended up in Imperial scientist Tuzin Gast's Project Chubar, a research effort intending to provide super-intelligent, loyal, and Force-sensitive non-Humans to serve the Empire as spies. However, Gorc and the Kowakian monkey-lizard Picaroon C. Boodle were soon taken by Lord Cronal, who needed two Force-sensitive \"animal\" subjects for his latest experiment. Cronal experimented on the pair using powerful Sith alchemy and eventually turned them into Sithspawn. Both Pic and Gorc were mutated beyond the point of recognition, and they each shared the other's genes, abilities, and characteristics, and had a symbiotic link through the Force."}, {"tag": "p", "text": "After being mutated and experimented on, Gorc and his \"twin\" were handed over to the Miraluka Inquisitor Jerec, who, alongside Sariss, trained the two Sithspawn in the ways of the dark side of the Force. The twins became members of Jerec's cadre of Dark Jedi, which, besides Sariss and Jerec himself, also included the young Epicanthix Yun, the former Jedi Maw, and the Twi'lek Boc Aseca. Jerec was amused with Gorc and Pic and found them \"quite an interesting pair\". Gorc then constructed for himself a lightclub variant of the lightsaber which resembled the traditional Gamorrean thogk club, as well as a set of M'uhk'gfa armor for Pic."}, {"tag": "h3", "text": "Search for the Valley of the Jedi"}, {"tag": "p", "text": "The \"Brothers of the Sith\" assisted Jerec in his search for the long-lost Valley of the Jedi, a Force nexus containing numerous Jedi and Sith souls. Jerec, who hoped to harness the valley's power in order to rebuild the collapsing Galactic Empire, eventually discovered that the Jedi Master Qu Rahn might have some clues as to its location. In 5 ABY, Jerec finally tracked Rahn to the planet Dorlo, where the Jedi Master was on a mission alongside several members of the Rebel Alliance. Jerec sent Maw, Sariss, and Yun to capture Rahn, but the Jedi Master escaped on a CR90 corvette. However, Rahn's ship was soon captured in the tractor beam of Jerec's personal Super Star Destroyer, the Vengeance."}, {"tag": "p", "text": "Boc then docked a shuttle with the corvette, used coma gas to render everyone aboard unconscious, and transferred Rahn and the Rebels to the Vengeance. Before Rahn woke up, Pic stole his lightsaber, which—unbeknownst to the monkey-lizard—had once belonged to Jedi Grand Master Yoda. Rahn and his Rebel companions were then escorted to the Vengeance's bridge, where Jerec started questioning them about the valley. One of the Rebels, the Klatooinian technologist Rolanda Gron defied Jerec, and the Miraluka ordered Gorc and Pic to kill him. Just as Gorc was ready to strike the Rebel with his club-like lightsaber, Pic lunged unexpectedly at Gron, stabbing him in the throat with his Sith dagger."}, {"tag": "p", "text": "The remaining two Rebels—the linguistics expert Nij Por Ral and the young pilot Duno Dree—were executed by Yun and Boc. Rahn was left alone and was beaten to his knees by the Dark Jedi. Still, the Jedi Master refused to tell anything, so Jerec used the Force to rip information from Rahn's mind. Rahn then unexpectedly Force-pulled Yun's lightsaber and charged Jerec's Dark Jedi, quickly defeating Boc, Maw, and Sariss. When Gorc tried to attack the Jedi, Rahn easily knocked Gorc's lightsaber out of the Gamorrean's hands. At that moment, Jerec intervened and killed Rahn."}, {"tag": "p", "text": "From Rahn's mind, Jerec discovered that the man he had killed years ago, a farmer named Morgan Katarn, had found the valley and hidden the map leading to it in his home on the planet Sulon. To this end, Jerec hired the droid information broker 8t88 to find and decipher the map. After the droid completed his objective, Jerec told him to go to Jerec's personal cargo ship, the Sulon Star, to receive his reward. In reality, Jerec sent Gorc and Pic to dispatch the droid, and the twins were also ordered to kill Kyle Katarn, the son of Morgan Katarn and an aspiring Jedi, who was trying to stop Jerec. 8t88 soon arrived to the Sulon Star on a shuttle and met Pic and Gorc in a dark corridor, asking for his pay. Pic sardonically told him they had it before decapitating the droid."}, {"tag": "h3", "text": "Showdown"}, {"tag": "p", "text": "Under the tutelage of the late Rahn's spirit, Kyle Katarn defeated Yun and tracked 8t88 to the Sulon Star, looking for the information which would lead him to the Valley of the Jedi and Jerec. Katarn arrived at the corridor 8t88 had been beheaded in, where Gorc and Pic were hiding in the shadows. As Katarn moved toward the droid, its head fell off its shoulders, landing on the floor, where 8t88's pet Hornagaunt lunged forward and digested it. Gorc then emerged from the shadows and attempted to crudely attack Katarn with his large weapon. However, Gorc overestimated the ease with which he would be able to defeat his foe and showed his lack of intelligence by standing in the way of Katarn's Bryar pistol. Katarn shot Gorc in the face, destroying the Gamorrean's brain and killing him instantly. Gorc's death drove Pic insane, and he attacked Katarn with his Sith dagger, but was killed shortly thereafter when Katarn threw 8t88's heavy head at him, crushing Pic's skull."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Katarn ultimately managed to kill Jerec and free the spirits of the Jedi trapped in the valley. The young Jedi Knight regarded his duel with Pic and Gorc as extremely difficult and felt angry at the Rebel Alliance's leader Mon Mothma for not fully recognizing his effort. Katarn left Gorc and Pic's bodies on the Sulon Star, which eventually crashed near the valley. Years later, when Jedi Master Luke Skywalker discovered that Pic had been in possession of one of Yoda's lightsabers, he sent a squad of Jedi to retrieve it."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In many ways a typical representative of his species, Gorc was a mean individual with a love for fighting and a distaste for droids. A blue-eyed Gamorrean, Gorc was very heavy and slow, being over three meters in height and weighing 200 kilograms. In contrast to his size, Gorc was somewhat dim-witted, even more-so than his older brother, a trait he displayed by standing in the way of Katarn's blaster. Gorc preferred not to engage in conversation, which he usually left to Pic. He was the less aggressive of the pair, but that did not make him any less dangerous, as he was not afraid to slaughter his enemies. Over the years, Gorc and Pic's closeness became more than just a dark side connection—it could almost be described as friendship. Pic, who considered himself the \"older\" brother, deeply cared about his slower sibling and protected him from abuse. In return for his kindness, Gorc gave Pic the set of M'uhk'gfa armor which he had crafted himself."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Gorc and Thok's Force-sensitivity manifested itself even back when they lived on Pzob. Their skin tended to acquire a unique reddish tint when they boiled with rage. Later, as a side-effect of Doctor Pontak's experiments, Gorc's muscles also started to swell dramatically whenever the Gamorrean became enraged. Trained by Jerec and Sariss in the ways of the dark side, Gorc and Pic—despite their nearly comical appearance—were a deadly pair. Pic was quick, agile, and intelligent and Gorc was extremely powerful. Gorc rarely moved or spoke, though when Pic stirred him up, the duo worked together as a team, covering all angles as well as each other's weaknesses. Gorc had a long and thick orange-bladed lightclub and used it to deliver slow yet powerful strikes at his enemies, whom he preferred to immobilize with Force Grip first. When hit, Gorc was able to use the Force to heal himself. Gorc could also hide his presence within the dark side, thus avoiding being detected by other Force-sensitives. He displayed this ability on the Sulon Star while hiding from Katarn."}, {"tag": "p", "text": "The bond between Pic and Gorc allowed them to be aware of each other's location, sense, and feelings at any given time. It also boosted their powers when the twins were near each other. However, such bond also had negative effects; every time one brother used the dark side, he further corrupted the other one, and vice versa. Also, every time one Sithspawn was injured, the other was forced to share his pain."}, {"tag": "p", "text": "Although he rarely communicated, Gorc was able to speak three languages—Basic, the Vregg dialect of the Gamorrean language, and the Sith. Apart from his usage of the lightclub, Gorc was also proficient with a wide variety of other weapons, including blaster pistols, blaster rifles, vibroweapons, and even some primitive and simple weapons. Despite his slow wit, Gorc was also a masterful craftsman, single-handedly constructing Pic's suit of M'uhk'gfa armor and his own lightclub."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gorc first appeared in the 1997 LucasArts video game Star Wars: Jedi Knight: Dark Forces II, where he was realized entirely by computer-generated imagery. Gorc is the only Dark Jedi in the game that does not speak. In the game's credits, he is credited as \"himself.\" Gorc later appeared in the 1998 novella adaptation of the first part of the game, Dark Forces: Rebel Agent, and its audio drama adaptation. Gorc's silent nature is preserved in the novel, where he only grunts. In the audio drama, however, Gorc has several lines and is voiced by Gary Groomes. Additionally, Gorc was briefly mentioned in the second part of the game's adaptation, the Dark Forces: Jedi Knight novel and audio drama. Gorc's backstory was expanded in The Dark Forces Saga, a series of game scenarios released by Wizards of the Coast on their web site."}, {"tag": "p", "text": "Gorc's death is different in Jedi Knight: Dark Forces II and in Dark Forces: Rebel Agent. In the game, Katarn fights both Gorc and Pic with his lightsaber and any one of them can be killed first. In the novel, Katarn shoots Gorc in the face with his blaster, just as Gorc emerges from the shadows."}, {"tag": "p", "text": "According to Abel G. Peña, Pic and Gorc may have been inspired by Danny DeVito and Arnold Schwarzenegger in the 1988 comedy Twins, with one of the villains being tiny and the other huge."}, {"tag": "p", "text": "When Abel Peña was writing the backstory for Gorc and his companion for the Dark Forces Saga, he re-used the term Sithspawn, originally a curse word used by Corran Horn in X-Wing: Rogue Squadron which was revealed to mean a monstrosity created though dark side magic in Tales of the Jedi Companion. Peña brought back the concept of Sithspawn, coupling two of the aliens seen in Jabba's Palace during Star Wars: Episode VI Return of the Jedi to create the \"Brothers of the Sith.\""}, {"tag": "p", "text": "The article Building a Better Jedi that appeared in Star Wars Insider 31 provided Gorc's height as 8 feet, which roughly equals 2.4 meters. However, his entry in The Dark Forces Saga later contradicted that information, stating that Gorc was over 3 meters tall. This article uses the more recent The Dark Forces Saga's height."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}