{"url": "Gordus_Grime", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Athletes", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gordus Grime"}, {"tag": "p", "text": "Gordus Grime was a famous shockball star who purportedly used a muscle-exercising myostim unit during his athletic career to stay in shape with little effort. Once, following a shockball exhibition game on the planet Kaal, Grime suddenly went berserk, murdering seven people and mutilating seventeen others. Scientists often cited Grime's case as proof that prolonged use of myostim units was dangerous to mental health."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gordus Grime was a famous shockball athlete who resorted to using myostim units. Muscle-massaging devices, myostim units became popular among bodybuilders and athletes, who favored the technology as a way to keep in shape with minimal effort and without wasting time resorting to \"tedious\" training routines, all while still leaving time to attend to life's other entrepreneurships, such as public endorsements."}, {"tag": "p", "text": "During his athletic career, Grime purportedly depended on a myostim unit, like many, to maintain his physique while pursuing his other business affairs. However, while attending a reception in his honor following the conclusion of a shockball exhibition game on the world of Kaal, Grime snapped and went on a rampage. He murdered seven socialites and mangled seventeen more before authorities finally put him down."}, {"tag": "p", "text": "Grime's incident gave credence to scientific theories regarding the dangers of extended use of myostim units. Although the theory was never proven by medical examiners, many often cited Grime's sudden violent behavior as proof that the extensive use of myostim units caused psychological damage in subjects during tense situations requiring sudden bursts of physical activity. They believed the subject would then become enraged and uncontrollable, as had happened to Grime."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gordus Grime was created for the 1996 Shadows of the Empire Sourcebook, written by Peter Schweighofer for Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}