{"url": "Gorga_Desilijic_Aarrpo/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Crime lords", "Category:Hutt Council", "Category:Hutts of the Desilijic clan", "Category:Kajidiis", "Category:Nal Hutta residents"], "nodes": [{"tag": "h1", "text": "Gorga Desilijic Aarrpo"}, {"tag": "p", "text": "Gorga Desilijic Aarrpo was the nephew of Jabba Desilijic Tiure, and a powerful Hutt crime lord of the Desilijic kajidic in his own right. Around the time of the Clone Wars, he became the leader of his clan, along with Jabba, and represented it on the Hutt Ruling Council. Eventually, after his uncle's death, Gorga took over his criminal empire and expanded it farther than even Jabba himself ever did."}, {"tag": "p", "text": "During the Rebellion/New Republic era, Gorga married Anachro, the daughter of Orko the H'uun, and had one Huttlet with her."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gorga was born at an unknown date on Nal Hutta to an unknown sibling of Jabba Desilijic Tiure, an infamous crime lord who controlled a major criminal empire in Hutt Space. At some point in his life, Gorga became the leader of the Desilijic clan—along with Jabba—and earned a position on the Hutt Ruling Council. Despite being Jabba's nephew, Gorga's voice was given equal measure on matters brought before the council though it was not as weighty as Jabba's."}, {"tag": "p", "text": "Sometime during or prior to the Clone Wars, Gorga established a black market operation on the planet Nothoiin, which lasted for years and brought Gorga huge profits."}, {"tag": "h3", "text": "Time in the Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, the Hutt Ruling Council hired Cad Bane to hunt for Ziro the Hutt, due to his possession of potentially damaging information about Hutt activities. At that time, the council consisted of Jabba Desilijic Tiure, Gorga Desilijic Aarrpo, Arok Besadii, Oruba, and Marlo Qunaalac."}, {"tag": "p", "text": "Several months later, Gorga traveled to the planet Zygerria to browse its slave markets. While he was inspecting the captured slaves, Gorga shoved a nearby Zygerrian guard and voiced his disappointment in the selection of slaves completely unaware the guard was in reality Jedi Master Obi-Wan Kenobi who was undercover to find kidnapped Togruta colonists."}, {"tag": "p", "text": "A short time later, Gorga visited the Bilbousa Bazaar along with two female Twi'lek slaves who hung onto the Hutt's arms. As he made his way down the main street, Gorga smirked as he saw several of the locals being harassed by the Nikto guards the Hutts employed. Once again, Gorga passed by a disguised Obi-Wan Kenobi, this time pretending to be the wanted bounty hunter Rako Hardeen."}, {"tag": "p", "text": "A year later, Darth Maul, Savage Opress, and Pre Vizsla of the Death Watch came to the Hutt Council Chamber in a Hutt Palace to form an alliance with the elder Hutts. Maul asked for Hutt territories and everything in it's borders, in exchange for the Hutts' lives. They merely laughed, and Jabba sent bounty hunters after them. While Gorga and Jabba were seen as holograms, the other Hutts, except for Oruba, escaped. Gorga was later seen with Jabba at his uncle's palace, when Maul and company launched an attack on Jabba's palace. Gorga watched as his uncle was forced to join the Collective."}, {"tag": "p", "text": "Sometime later, the Galactic Republic and the Confederacy of Independent Systems brought the Clone Wars to Nothoiin, ending in a Republic victory, which resulted in Gorga going out of business. Gorga then hired several Trandoshans mercenaries, nicknamed Team Dosho, and a bounty hunter named Zatch. The bounty hunters disguised themselves as Nothoiins and stole Nothoiin swoops. Gorga then had the Trandoshans attack the captured Separatist Heavy Speeder carrying Anakin Skywalker and Obi-Wan Kenobi. Gorga soon contacted the Jedi Generals and told them that he was trying to cause a civil war on Nothoiin to bring back his business to the planet. However, Zatch was soon defeated and the Jedi rammed their speeder into Gorga's vehicle. Gorga was then arrested by the Jedi and taken to a Republic prison."}, {"tag": "p", "text": "Sometime later, Gorga was freed from prison and traveled to the base of the Pyke Syndicate on Oba Diah. He was seen in the throne room of Minister Lom Pyke, along with fellow Kajidii Arok during Jedi Generals Anakin Skywalker and Obi-Wan Kenobi's visit."}, {"tag": "h3", "text": "Jabba's treasure"}, {"tag": "p", "text": "After Jabba's death, Gorga had already been released from Republic prison and sought to take possession of his late uncle's treasure ship Spirit of Jabba and all the valuable objects on board. However, Gizman and Spiker, former Swoop riders for Jabba, reached the vessel first and took off. They were waylaid briefly by a security holotape, giving one of Gorga's armed freighters a chance to catch up. In an effort to lighten the vessel's load and escape, as well as strike back at Gorga (whom they suspected had something to do with the tape triggering), Gizman and Spiker flew low and threw Jabba's priceless collection of Mendacian Funeral Urns at the Hutt. The loss of one of the most valuable treasures aboard the ship horrified Gorga."}, {"tag": "h3", "text": "Hiring Boba Fett"}, {"tag": "p", "text": "While on Tatooine, a Hutt named Anachro caught Gorga's eye. Gorga found her to be beautiful. Unfortunately for him, Anachro was the daughter of Orko the H'uun, an enemy of his. Deciding that a gift might placate Orko, Gorga hired Boba Fett to kill Bar-Kooda, a pirate kingpin that had been harassing Orko's freighters. Fett succeeded, and Gorga, Anachro, and Orko celebrated Gorga and Anachro's impending nuptials by eating Bar-Kooda's corpse."}, {"tag": "p", "text": "While on his honeymoon, slavers kidnapped Anachro on Skeebo, causing Gorga to hire Fett to get her back. Orko accused Gorga of staging the event, and the two Hutts might have come to blows, had Fett not arrived with Anachro. Gorga and Orko made a public reconciliation. However, Gorga soon found his father-in-law insufferable."}, {"tag": "p", "text": "He hired Fett to assassinate Orko, but asked him to make it look accidental, so that Anachro's suspicions were not aroused. However, when he learned that Anachro was pregnant, he ordered the assassination called off. Unfortunately, Ry-Kooda, Bar-Kooda's brother, had murdered Orko in a particularly brutal fashion. Anachro accused Gorga of the murder, and in grief went back to her father's. Ry-Kooda attacked Anachro's transport, but Gorga stopped him, and Boba Fett ultimately killed Ry-Kooda. The turmoil of the event caused Anachro to give birth."}, {"tag": "h3", "text": "Profitable business ventures"}, {"tag": "p", "text": "Boba Fett's charges put Gorga in debt for two years, but his shrewd business skills paid off. Gorga managed to attain quite a fortune, including casinos, restaurants, and \"cargo haulers\". His family life was also prosperous and happy. Gorga sold precious ulikuo gemstones from Kip on the black market with a silent partner. He thought that his wife didn't know about this, but she of course did, being more keen and ambitious than she seemed. Gorga also had a palace on Tatooine very similar to his late uncle's."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gorga was a money watching and scheming Hutt of the Hutt Council. Gorga was fully aware of the scheming nature that the Hutts took deep pride in. Gorga ably accounted for skimming along with outright theft while ensuring the criminal enterprise remained able to thrive. Gorga regularly met with his fellow Hutt councilors in the halls of the Hutt Council on the Hutt homeworld of Nal Hutta, where he stood by closely to his uncle, Jabba."}, {"tag": "p", "text": "Gorga had an average Hutt build, standing at 2.11 meters in height, and 3.7 meters in length. Gorga appeared to have a squarish head with tan and green skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Clone Wars, Gorga wore an unique headset that was a combination of a speaker and monocle.The monocle was placed over his right eye and both it and the comlink where hinged so they could be rotated. The monocle's lens would often give Gorga's eye a distorted look."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "He is voiced by Kevin Michael Richardson in Star Wars: The Clone Wars."}, {"tag": "p", "text": "Gorga was also identified in the 9th edition of the Star Wars: The Clone Wars Magazine as Jabba's nephew. Also, in the 21st edition, the magazine states Tatooine as Gorga's homeworld, whereas his homeworld is actually Nal Hutta, which is stated on the official Star Wars website."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}