{"url": "Gorge", "categories": ["Category:Legends articles", "Category:Business owners and executives", "Category:Gamorreans", "Category:Guards", "Category:Males", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Gorge"}, {"tag": "p", "text": "Gorge was a Gamorrean. Along with his brother, Greel, he owned the Broken Tusk on Reuss VIII, a planet in Portmoak sector. While his brother managed the business, Gorge was in charge of security."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gorge and his brother Greel were slaves of Var'Rotha Fin'Rotha who were constrained at all times except when the bounty hunter needed them for physical labor."}, {"tag": "p", "text": "While en route from Coruscant to the Outer Rim after delivering a high-priced bounty, Fin'Rotha let Greel out of his cage to clean the ship's interior. Greel broke the ship's hyperdrive and while Fin'Rotha was busy making repairs Greel freed Gorge and the two took over the ship, forcing their former master into an escape pod."}, {"tag": "p", "text": "The pair piloted their new ship, the Tolan's Tusk until its fuel cells ran out and the ship crash landed on Reuss VIII. The brothers then converted the crashed ship into a cantina."}, {"tag": "p", "text": "He used to fight regularly in the Dool Arena but he almost never fights anymore."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Despite his appearance as a large, scarred, menacing Gamorrean Gorge was not a mindless beast. He picked fights carefully and tried to resolve fights before they started with a menacing growl."}, {"tag": "p", "text": "His right front tusk was slightly broken, the tip having broken off in his crash-landing."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As expected of a Gamorrean, Gorge was incredibly fearsome in hand-to-hand combat. He could lay out opponents with his fists just as easily as he did with his vibromallet. He was surprisingly adept with blaster pistols as well."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Gorge carried two BlasTech DL-44 heavy blaster pistols as well as a two-handed vibromallet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gorge was designed by Paul Danner and Bill Smith for Wretched Hives of Scum & Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}