{"url": "Gorgon", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Flagships", "Category:Imperial I-class Star Destroyers of the Galactic Empire", "Category:Ships of the Maw fleet"], "nodes": [{"tag": "h1", "text": "Gorgon"}, {"tag": "p", "text": "The Gorgon was an Imperial I-class Star Destroyer and the flagship of Admiral Natasi Daala. Constructed by Kuat Drive Yards over Kuat in 1 BBY along with its sister ships Hydra, Basilisk, and Manticore, these Star Destroyers were part of the Maw fleet, stationed at Maw Installation, a secret asteroid research facility under Admiral Daala's command. With her second-in-command, Commander Kratas, Daala drilled the crew of the Gorgon until the vessel became, in Daala's opinion, one of the best performing Star Destroyers in the Imperial Fleet. Daala and the Gorgon were stationed at Maw Installation without any outside contact for a decade before a lone 500-X shuttle entered the Maw after departing from Kessel and was captured by the Gorgon's tractor beams. From the shuttle's crew, Daala learned that the Empire was near defeat following Emperor Palpatine's death in 4 ABY, and took it upon herself to launch a guerrilla war against the New Republic in 11 ABY."}, {"tag": "p", "text": "Intent on destroying the New Republic, Daala engaged the opposition in battles such as the attack on Mon Calamari, where she was soundly defeated, and soon forced to retreat. Daala fled back to the Maw with the Gorgon, her lone remaining Star Destroyer, where she encountered New Republic forces. In an effort to prevent the New Republic from gaining top-secret Imperial data, the Gorgon destroyed the Installation by firing upon its unstable reactor core. The New Republic believed that Daala had crashed the ship into the Installation in a suicide effort, although the Gorgon had actually fired upon the facility with its turbolasers before jumping to hyperspace under cover of the explosion. The irreparably damaged Gorgon jumped to the Deep Core. There, Daala met up with the Imperial warlords, highly-ranked officials who had assumed control of what was left of the Empire. The Star Destroyer was later dismantled by the warlords for use in the construction of newer vessels."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Gorgon was 1,600 meters long, the standard length for an Imperial I-class Star Destroyer. Heavily armed, with sixty turbolaser batteries and sixty ion cannons, Natasi Daala considered her vessel powerful enough to lay an entire planet to waste. The Star Destroyer also possessed ten tractor beam projectors and a sizable hangar. For support craft, the Gorgon was capable of carrying up to six full squadrons of TIE/LN starfighters and two Gamma-class assault shuttles, one of which was the shuttle Edict, used personally by Daala, who often piloted it herself. The Gorgon was unusual in that it possessed a smaller complement of assault and support craft than was standard for a Star Destroyer. Similarly, the Gorgon did not carry any TIE/sa bombers. The Star Destroyer also held twenty AT-AT walkers and thirty AT-ST walkers for ground warfare. The Gorgon was crewed by less than 45,000 men, the standard crew. Daala once described her ship as being run by a skeleton crew. Finally, the Gorgon had been designed with a special throne room aboard for explicit use by the Emperor, in accordance with all Imperial-class Star Destroyers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Construction and deployment"}, {"tag": "p", "text": "The Gorgon was commissioned by Grand Moff Wilhuff Tarkin in 1 BBY, and constructed over Kuat alongside three other Imperial I-class Star Destroyers: the Hydra, the Basilisk, and the Manticore. Tarkin intended these vessels to guard his secret military research facility, Maw Installation, where superweapons such as the Death Star, Sun Crusher and the World Devastators were designed. The Gorgon and the rest of the Maw fleet were put under the direct command of Tarkin's mistress, Natasi Daala, the first female to become an admiral under the Galactic Empire. Daala personally oversaw the construction of the Gorgon, which would serve as her flagship, from its early stages and was bent on turning it into a model of Star Destroyer perfection."}, {"tag": "p", "text": "Tarkin placed the Maw fleet in a gravitational island at the center of the Maw, a cluster of black holes, with no outside contact and a strict mandate to remain and guard the facility at all costs. Known only to Tarkin and the Emperor, the Maw Installation was unknown to the outside galaxy and the Empire at large. Therefore, Tarkin chose individuals with no ties to the outside galaxy for Daala's fleet, so that they would not be missed from isolation in the Maw, and no one would raise questions. He and Daala also took into consideration the skill of the crewers they picked for service on the Gorgon, choosing those whom they believed to be highly qualified. However, Daala feared that a lack of active service would cause her crew's skills to deteriorate. This, and the fear that her crew would resent being commanded by a woman, led her to drill her crew constantly, and she executed several officers to show her crew that she would stop at nothing to keep them in line. In the depths of the Maw, the Gorgon sat at full battle readiness, waiting for a chance to prove itself, its crew constantly put on edge by its relentless commander and her second-in-command, Commander Kratas. But as the crew slowly grew bored over the next decade, despite their commander, they yearned for a chance to break free of the Maw and return to active duty. Having exhausted the entertainment libraries and with no opportunities to transfer to a new station or advance in rank, discontent was rife. Furthermore, with a ten-year-long deployment, the crew began to age, with the reflexes of some of the stormtroopers and fighter pilots beginning to dull as they moved beyond the typical age threshold for those positions."}, {"tag": "h3", "text": "Leaving the Maw"}, {"tag": "p", "text": "The Gorgon's departure from the Maw came in 11 ABY, when a lone 500-X shuttle, Endor, entered the Maw. When its crew, New Republic personnel Han Solo, Chewbacca, and Kyp Durron, failed to provide the correct security code, the Gorgon used its tractor beam projectors to pull the shuttle into one of its hangar bays. Because of the inability to transmit signals through the HoloNet from the Maw due to the ionized gases around the black holes, the crew of the Gorgon, especially Daala, was unprepared for the news the outsiders brought with them. While the Gorgon was in isolation, Grand Moff Tarkin had died on the first Death Star, and Emperor Palpatine and Darth Vader had both perished on a second Death Star. Due to the latter two deaths, the Empire was tearing itself apart in a civil war, while the Rebel Alliance had transitioned into the New Republic and had become a dominant power in the galaxy."}, {"tag": "p", "text": "Dumbstruck by the news, Daala decided that since Tarkin was dead, she was no longer held down by his orders and could fight her own guerrilla war against the New Republic. Imprisoning the shuttle's crew and declaring to the Maw scientists that she was leaving, Daala scrambled her forces and prepared to depart. During the departure preparations, the prisoners escaped with the Installation's latest project, the Sun Crusher superweapon, aided by Maw scientist Qwi Xux."}, {"tag": "p", "text": "The four Star Destroyers scrambled to stop the escapees from leaving the Maw. However, since the Sun Crusher's hull was practically invulnerable to harm, the most the fleet could do was physically smother the superweapon with TIE Fighters. Meanwhile, the Hydra positioned itself to block the Sun Crusher from escaping through the only direct route out of the Maw. Undaunted, the Sun Crusher sped out of the TIE Fighter swarm and through the Hydra's bridge. The crippled Star Destroyer was drawn in by the gravitational force of a nearby black hole. The way cleared, the Sun Crusher fled into hyperspace."}, {"tag": "p", "text": "Vowing that the Sun Crusher had to be recovered at all costs, Daala ordered the Gorgon and its two remaining sister ships to follow the superweapon out of the Maw. The Gorgon caught up with its quarry as it exited the Maw but ran straight into the mercenary fleet of Moruth Doole, which was looking for friends of Han Solo, who had been searching for him and Chewbacca since their disappearance from Doole's prison on Kessel in the Endor. The confused fleet fired on the imposing Star Destroyers, but their shots failed to significantly harm the Imperial warships. Daala's fleet quickly mopped up the rag-tag force, albeit with losses, and the Gorgon sustained minimal damage. With the latest unexpected threat out of her way, Daala ordered the Gorgon to conduct a campaign of piracy on New Republic shipping."}, {"tag": "h3", "text": "War against the New Republic"}, {"tag": "p", "text": "Their first merchant target was a small CR90 corvette. After firing several shots at the ship before it surrendered, the Gorgon pulled the corvette into its hangar. From the captured captain, T'nun Bdu, Daala learned that the vessel was delivering relief supplies to a \"peaceful\" colony on Dantooine. The Gorgon's crew, however, found a large cache of high-grade weapons and communications equipment aboard. Daala had thermal detonators placed among the corvette's engines, and then ordered the ship to be released. After it sent out a distress call, which Daala was sure would distract the New Republic, the thermal detonators were triggered, destroying the vessel. The Gorgon then set course for the colony on Dantooine."}, {"tag": "p", "text": "Despite Dantooine being a vital communications outpost, the Gorgon's sensors showed that the small colony possessed few means of defense. Nevertheless, the Gorgon launched several AT-AT walkers with which to obliterate the colonists. The operation succeeded and, recalling her men to the Gorgon, Daala set her eyes on the vital shipyards of the ocean world of Mon Calamari."}, {"tag": "p", "text": "Daala laid out what she considered a fool-proof plan, based on a tactic created by Tarkin himself. The battle would start with the Gorgon and Basilisk opening fire and launching an attack on the floating cities of the Mon Calamari, thus drawing forces away from the shipyards, while the Manticore would come out from the shadow of the planet's moon and destroy the helpless starship construction facilities. The plan was going well until a former slave of Tarkin's, retired New Republic Defense Fleet Admiral Gial Ackbar, recognized the tactic and, using a Mon Calamari code, remotely took control of the half-finished MC90 Star Cruiser Startide and used it to crash into the Manticore. Accepting her first major defeat in her guerrilla offensive, Daala's two remaining Star Destroyers fled to the safety of the Cauldron Nebula."}, {"tag": "p", "text": "While there, Daala made plans to use Basilisk in a suicide crash attack on Coruscant, the capital planet of the New Republic. However, just prior to the launch of the assault on Coruscant, Kyp Durron, one of the escaped Maw prisoners, arrived with the Sun Crusher and attacked the Gorgon. Daala rushed to reclaim her lost prize, but she soon realized that it was just a stall tactic, and Durron had already instigated a supernova in several of the nebula's stars. Daala ordered the Gorgon and the Basilisk to make an emergency hyperspace jump. As the burst of energy radiated out from the supernova explosions, the Gorgon barely escaped the nebula. The Basilisk was not so lucky, however, and it was incinerated."}, {"tag": "h3", "text": "Final battle"}, {"tag": "p", "text": "With the Gorgon severely damaged by the destruction of the Cauldron Nebula, Daala realized that she should have never abandoned her station at the Maw, and in disobeying her mandate, she had caused the deaths of many of her best soldiers. She then commanded the Gorgon to retreat to Maw Installation, where she realized two things. First, she saw that the Death Star prototype, a semi-permanent fixture around the installation, was missing. Second, a small New Republic fleet was now orbiting the asteroids comprising the installation. Realizing that the New Republic had seized Maw Installation, Daala vowed to destroy the facility, or die trying. The Gorgon unleashed a punishing turbolaser volley on the station from its remaining gun emplacements."}, {"tag": "p", "text": "The New Republic fleet scrambled to meet the Gorgon. Soon, to add to the mounting confusion, the Death Star prototype, under the command of Maw Installation administrator Tol Sivron, entered the Maw. Despite the fact that Sivron would not fire the prototype's superlaser, the looming threat of his weapon made the New Republic frantic. Daala took advantage of the situation by using the Gorgon's computers to extract information from Maw Installation's archives. With the vital schematics in hand, she ordered the Gorgon to fire on the installation's by-now unstable reactor core. As a bright explosion filled the viewports of the New Republic ships, the Gorgon made its escape and fled to the remnants of the Empire in the Deep Core, seeking refuge. However, the New Republic believed that Daala had crashed the Gorgon into the facility in a suicidal effort to prevent them from gaining top-secret information contained in the Installation. It was not until a year later that the New Republic would learn she had survived."}, {"tag": "p", "text": "Damaged nearly beyond repair, the Gorgon was seized by the various Imperial warlords who had domains in the Deep Core and dismantled in 11 ABY, using the parts for construction of other warships. Daala's remaining crew was scattered across the Deep Core. Daala herself, along with Kratas, roamed from warlord to warlord in an attempt to unify the fractured Empire, an effort that ultimately succeeded in gaining Daala command of a unified Imperial war machine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gorgon was one of four Star Destroyers created by Kevin J. Anderson for the The Jedi Academy Trilogy, and it recurred throughout the series as Admiral Daala's flagship. The Gorgon was mentioned briefly in the novel Darksaber, where its final fate was explained."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}