{"url": "Gorgodon/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Creatures of Ilum", "Category:Mountain creatures", "Category:Non-sentient species", "Category:Omnivorous creatures", "Category:Predatory creatures", "Category:Reptiles", "Category:Snow and tundra creatures"], "nodes": [{"tag": "h1", "text": "Gorgodon"}, {"tag": "p", "text": "Gorgodons were a species of large, furry, non-sentient reptile that lived on the snow-covered world of Ilum. They possessed blaster-proof hide, a strong bone structure, and three rows of sharp teeth, all of which made them dangerous foes in combat. Gorgodons had excellent senses of smell and hearing, which they relied upon due to poor vision. Despite being able to survive on eating just plants, gorgodons spent most of their time hunting live prey in groups, preferring to kill it by suffocating or crushing it with an embrace. Members of the species lived in camouflaged nests of shelter, which they held together with their saliva."}, {"tag": "p", "text": "Gorgodons sometimes encountered members of the Jedi Order, who traveled to Ilum to find crystals with which to build their lightsabers in the Crystal Caves. Jedi Master Obi-Wan Kenobi and his Padawan, Anakin Skywalker, fought a group of gorgodons outside the Crystal Caves when they traveled to the creatures' homeworld in the year 28 BBY, as did the ex-Jedi Ferus Olin around the year 18 BBY. The gorgodons that fought Olin were later killed by stormtroopers of the Galactic Empire."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Gorgodons were a non-sentient species of hulking reptilian predators that were native to the icy world of Ilum. Large in size, their backs and forearms were partially covered in gray fur. The rest of their bodies were covered with gray hide thick enough to prevent blasters from killing them, except for the head, which was yellow in color. The face of a gorgodon consisted of two yellow eyes with pupils, four nostrils, and a mouth filled with three rows of yellow teeth. Due to poor eyesight, the predators relied mostly on their hearing and sense of smell to locate prey or other food—which could include vegetation or carrion, as the species was omnivorous."}, {"tag": "p", "text": "Gorgodons had a bipedal stance, with a tail and four limbs, standing on their hind limbs and using their forelimbs for attack, although they could also walk on all fours. Each limb ended in a paw that could be equal in size to a gravsled and included several sharp claws. The creatures had incredibly strong bone structures that were covered by thick layers of muscle and fat, making them fairly resistant to blunt force attack, though they had a soft, vulnerable point on the back of the neck. Striking this weak point was the only way to kill the beasts, as doing so would sever their spine and paralyze them. Their large size provided them with power when striking against their prey but also made them clumsy and at times slow. Members of the species were capable of producing a thick, brown, rubbery saliva, which they used in the construction of their nests."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Gorgodons were most commonly found on the lowland areas of their homeworld of Ilum, where they survived on a diet of lichen, scrubs, and carrion, although it was not uncommon for them to venture into the planet's mountainous regions. They did, however, most commonly hunt live prey, traveling together in family groups of four to eight and using their senses of smell and hearing to locate other animals. When they attacked, they snapped their jaws and rolled their eyes, usually killing their prey by crushing or suffocating them in a hugging motion with their huge forelimbs, although they could use their claws, teeth, and tails to injure their opponents as well."}, {"tag": "p", "text": "When they attacked or were injured, the creatures would roar or howl loudly, and if one of their number was killed, a pack would retreat upon picking up the scent of their fellow's death. Gorgodons could also use their claws for climbing the frosted cliffs and mountains of Ilum, at which they were extremely skilled. Gorgodons constructed nests with shelters inside using boulders, sheets of ice, and snow as well as their saliva, which acted like mortar and held the structures together. The shelters were about fifty meters in height and were similar in appearance to a hunched gorgodon's back. The nests could be camouflaged to blend into the surrounding environment, mimicking the steep slopes of the mountains on which they were built."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 22,800 BBY, the planet Ilum was discovered by members of the Jedi Order, who found an abundance of crystals in the world's Crystal Caves. The crystals, as it turned out, could be used to make lightsabers. As such, the Order made journeying to Ilum to find such a crystal part of the ceremony that almost all Jedi underwent on their way to Knighthood. As natives of Ilum, gorgodons occasionally encountered Jedi who were on such quests, often leading to the beasts attacking the Force-sensitives. Jedi Master Qui-Gon Jinn, who was active during the final decades of the Galactic Republic, left a note warning future students of the danger of gorgodons in his copy of the book The Jedi Path: A Manual for Students of the Force. Jinn later passed down the book to his Padawan, Obi-Wan Kenobi, who also left a message of his own regarding the gorgodons."}, {"tag": "p", "text": "In the year 28 BBY, Kenobi traveled with his Padawan, Anakin Skywalker, to Ilum to help him find a crystal for his lightsaber. The pair encountered a group of sleeping gorgodons in front of the entrance to the Crystal Caves, and their scent woke the beasts, causing the group to attack the two Jedi. One gorgodon managed to grab Kenobi and attempted to crush him. Skywalker saved his Master by stabbing the predator in the vulnerable point at the back of its neck, killing it and causing the rest of the group to flee by climbing further up the mountain. Skywalker later claimed to have killed three gorgodons on Ilum in a note he left in his copy of The Jedi Path, which Kenobi had given him. When Skywalker's apprentice, Ahsoka Tano, inherited the book, she added a note claiming that gorgodons were simply hungry and could be avoided if they were given rations instead of attacked."}, {"tag": "p", "text": "Later, in about 18 BBY, after being warned about the gorgodons by Kenobi, the former Jedi Ferus Olin traveled to Ilum, hoping to craft a lightsaber and find the Jedi Master Garen Muln. He sought to enter the Crystal Caves through a secret entrance at the back of a gorgodon nest, which he located despite it being camouflaged. After trying and failing to sneak past the sleeping gorgodons in the nest, Olin attempted to flee from them, but one of the group caught him and beat him around. The former Jedi eventually managed to paralyze the gorgodon by driving a vibroblade into its vulnerable spot, which allowed him to escape. The gorgodons' nest was later burned and destroyed by stormtroopers of the Galactic Empire, who used flamethrowers and flechette launchers to open fire on the nests in an attempt to prevent Olin leaving through the secret entrance. The gorgodons fought back but were quickly defeated and killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gorgodons first appeared in 2001 in Jedi Quest: Path to Truth, a novel written by Jude Watson as part of the Jedi Quest series. The events of the book, including Skywalker's encounter with the gorgodons, were later referenced in the 2002 novel Anakin: Apprentice, which provided a summary of what had happened to Skywalker between Star Wars: Episode I The Phantom Menace and Star Wars: Episode II Attack of the Clones. The book also provided the first illustrations of the species, drawn by artist Tommy Lee Edwards. The species was then given statistics for Wizards of the Coast's Star Wars Roleplaying Game in the 2004 sourcebook Ultimate Adversaries, which included an illustration by Andrew Jones."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}