{"url": "Gorin", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gorin"}, {"tag": "p", "text": "Gorin was a human male who served as an admiral in the naval forces of the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic. He commanded the Imperial I-class Star Destroyer Intimidator and served as Orbital Command for the Imperial forces stationed above the planet Scarif, including the Shield Gate that allowed access to the world."}, {"tag": "p", "text": "In 0 BBY, the Alliance Fleet attacked Gorin's forces in order to aid rebel forces that had already infiltrated the surface of Scarif. In the ensuing battle, the Star Destroyer Persecutor was disabled by rebel ion charges and then rammed toward the Intimidator by the Alliance Sphyrna-class Hammerhead corvette Lightmaker. Although Gorin ordered his Star Destroyer to evade the Persecutor, the two ships collided, and the Intimidator was sheared in two. Gorin later ceded control of his forces to Grand Moff Wilhuff Tarkin when the latter arrived on the scene aboard the Death Star battle station."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "An unexpected attack"}, {"tag": "p", "text": "Gorin was a human male admiral in the officer corps of the Galactic Empire's Imperial Navy during the Galactic Civil War. From aboard the Imperial I-class Star Destroyer Intimidator, he served as commander of the space above the planet Scarif in the Scarif system. Gorin acted as Orbital Command while General Sotorus Ramda was Surface Command, controlling the Imperial Army's Scarif Deployment at the Citadel Tower on the planet below. An Imperial transmission concerning the Empire's Shield Gate above Scarif and mentioning Gorin was intercepted by the Alliance to Restore the Republic and included in the collection of documents known as The Rebel Files. The Shield Gate was the sole point of access through a planetary shield to the planet's surface and was defended by the Intimidator and the Persecutor, the second Imperial-class Star Destroyer under Gorin's command."}, {"tag": "p", "text": "In 0 BBY, a rebel squad slipped past Gorin's forces above Scarif using a stolen Imperial cargo shuttle, passing through the Shield Gate and reaching the planet's surface. Aiming to steal the plans to the Imperial Death Star superweapon from the Citadel Tower, the rebel team engaged Ramda's garrison while some of its members infiltrated the tower. After Imperial transmissions concerning the conflict on the surface began to be sent, part of the Alliance Fleet under the command of Admiral Raddus arrived above Scarif to support its ground forces. Upon the arrival of the enemy fleet, Lieutenant Casido ordered from the bridge of the Intimidator for someone to inform Gorin."}, {"tag": "h3", "text": "The Battle of Scarif"}, {"tag": "p", "text": "As the battle above Scarif began, Gorin positioned his ships over the Shield Gate to prevent the unlikely possibility of the rebels blasting their way through the weak point it presented in the shield. He then contacted Ramda and alerted him and Director Orson Krennic to the arrival of the rebel fleet but claimed that it should not pose a threat to the ground forces. On Krennic's orders, the Shield Gate above Scarif was closed, separating the rebel and Imperial fleets from their respective ground forces. Gorin's forces then battled those of Raddus above the planet until the rebel admiral ordered the Y-wings of Gold Squadron to launch ion charges at the Persecutor, disabling the vessel."}, {"tag": "p", "text": "Needing to take the down the Shield Gate, Raddus ordered the rebel Sphyrna-class Hammerhead corvette Lightmaker to ram into the side of the Persecutor and push the powerless vessel off course toward the Intimidator. Attempting to maneuver his ship to avoid the collision, Gorin ordered the Intimidator to reverse at full power but failed to evade the incoming Star Destroyer. The Persecutor smashed into the Intimidator, shearing the admiral's Star Destroyer in two and destroying the bridge. The Persecutor then continued on into the Shield Gate, destroying it and allowing the rebels on the planet's surface to transmit the Death Star plans to the fleet. After the rebel fleet received the transmission, the Death Star arrived above Scarif, and Gorin ceded his authority over the engagement to the battle station's commander, Grand Moff Wilhuff Tarkin. Ultimately, a portion of the rebels escaped with the plans after their forces sustained heavy losses."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "When the rebel fleet first attacked above Scarif, Gorin incorrectly believed that they posed no threat to the Imperial forces on the planet's surface. Gorin had light skin, gray hair, and blue eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Gorin wore a standard gray Imperial officer's uniform with three code cylinders and a rank insignia plaque showing six blue squares during the Battle of Scarif."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gorin was portrayed by Michael Gould in the 2016 Anthology film, Rogue One: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}