{"url": "Gorm_(cyborg)", "categories": ["Category:Legends articles", "Category:Articles with unencyclopedic tone", "Category:Bounty hunters", "Category:Cyborgs", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gorm  (cyborg)"}, {"tag": "p", "text": "Gorm, also known as Gorm the Dissolver, was a cyborg assembled by the Renegades of the Arkanian Revolution. One of the few beings to survive the Arkanian battlefield, Gorm went on to have a long and tumultuous career as a bounty hunter, during which he survived multiple encounters with the Jedi Knights, including one particularly brutal fight with Mace Windu."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Fifty years before the Battle of Yavin, a vicious civil war broke out on Arkania. Widely known for their brilliant—though sometimes morally questionable—scientific work, Arkanian geneticists began a program of implanting cybernetics in the Yaka, a species from a neighboring system, in order to bring them up to what the Arkanians deemed a more appropriate level of intelligence. While sanctioned by Arkania's Dominion government and ignored by the Galactic Republic, the program was strongly opposed by many of Arkania's more conservative scientists. Ultimately, these opponents launched a coup against the Dominion, constructing what was meant to be an unbeatable army to bring down the planet's government."}, {"tag": "p", "text": "Though the Dominion proved to be no match for the Arkanian Renegades' ruthless cyborgs, the Arkanian Revolution, as it became known, would end in utter failure. Not only did the Republic quickly send an intervention force—including a young Mace Windu—to aid the Dominion, but the rebellious Jedi Master Aqinos soon joined in on the fighting with his controversial cadre of Iron Knights in tow. The Renegades were crushed swiftly and with little fanfare, but some of their fantastic creations would survive the fighting and disperse throughout the galaxy. One of them, perhaps the most fearsome, was known as Gorm."}, {"tag": "h3", "text": "Exploits"}, {"tag": "p", "text": "The brutal fighting on Arkania behind him, Gorm elected to pursue a career as a bounty hunter. In seemingly no time at all, his name became synonymous with doom amongst those he might someday be employed to hunt down. Rumors connecting him to the indefatigable army of cyborg Arkanian warriors only served to heighten his menace. Gorm's most legendary battles, however, still lay ahead."}, {"tag": "p", "text": "One of Gorm's earliest targets was a Trandoshan criminal known as Vultar the Ugly, who had a bounty placed on him after inciting a bloody power struggle among his local underworld. How Vultar met his end was unknown; suffice it to say that one of Gorm's most conspicuous modifications to his original form was the addition of a battered left arm of Trandoshan origin."}, {"tag": "p", "text": "It was unclear whether the recycler appendage that earned Gorm his moniker \"The Dissolver\" was present from the beginning, or added voluntarily later on, but what was known for certain was that Gorm developed a fondness for quickly reducing many of his early targets to their constituent molecules, and he became all the more feared for it. Also unclear were the exact circumstances surrounding his loss of the appendage, though a team of Jedi including Mace Windu—whom Gorm had fought against in the Revolution years before—was known to be involved. By then, however, the sobriquet Gorm the Dissolver had stuck."}, {"tag": "p", "text": "In 39 BBY, eleven years into Gorm's career, he joined a group of bounty hunters arranged by Magus to assassinate a group of twenty prominent leaders, all political enemies of Corporate Alliance Magistrate Passel Argente. The job was a disaster. A boy named Talesan Fry caught wind of their plans and the group was forced to divert their attention to his apprehension, and by the time they had Fry in their hands, two Jedi Knights—Qui-Gon Jinn and Adi Gallia—and their Padawans were on their trail. Magus's team planned to hit the leaders during a conference on Rondai-2, but the Jedi forced them into open confrontation. Two of the hunters were killed, and only Magus himself would escape the battle entirely."}, {"tag": "p", "text": "Gorm was taken into custody for a time, but eventually he found his way to freedom and continued his work. As the Republic crumbled and the Empire rose in its place, Gorm continued to work actively, though few details of this time period ever came to light. Not until shortly before Yavin did he resurface, this time on Nar Shaddaa, where he ran afoul of a young Greedo while attempting to collect a debt from Spurch Goa and Dyyz Nataz. Looking to insinuate himself into the local bounty hunter circles, Greedo took it upon himself to interrupt the argument—which had by then turned violent—by shooting Gorm in the back of the head, taking him out of the fight. Though he was soon back in working order, Gorm could arguably be counted as Greedo's first, and last, kill."}, {"tag": "p", "text": "After regaining function, Gorm headed to Tatooine, possibly in pursuit of Nataz and Goa, but was sidelined by Jabba Desilijic Tiure, who offered him the most valuable contract he had running at the time: fifty thousand credits for another bounty hunter named Zardra. Zardra had been a victim of simple bad luck; while trying to collect a bounty herself, she had been forced to kill a Hutt named Mageye, and had thus incurred Jabba's ire. It appeared that Gorm was unable to apprehend Zardra, however, because she soon resurfaced in pursuit of ex-Republic officer Adar Tallon."}, {"tag": "p", "text": "No one could say what became of Gorm after his hunt for Zardra, but few doubted that a being as resourceful as him would continue to live—if, indeed, he could be said to have ever lived—for years to come."}, {"tag": "h2", "text": "Composition"}, {"tag": "p", "text": "Gorm stood a full two-and-a-half meters tall and was designed to be the ultimate warrior."}, {"tag": "p", "text": "His body included parts from no fewer than six biological species and seven generations of droids and machines. It was unknown what his original form was.. An ancient Ithullan infantry helmet concealed whatever form his head may have taken; the only clues to what lay beneath were two glowing red photoreceptor eyes. Perhaps Gorm's most perplexing aspect, however, was his personality. While few of the beings he came into contact with lived long enough to tell of his character, Gorm was in actuality a coarse and boisterous being, even known to laugh callously at his prey before ending their lives. While loutish droids were not without precedent, this seemed to indicate that Gorm possessed the mind, at least, of a biological. For the most part, however, it was a rare individual who could conclusively identify a piece of Gorm. What few components were known are as follows:"}, {"tag": "h3", "text": "Biological"}, {"tag": "h3", "text": "Mechanical"}, {"tag": "p", "text": "Also worth noting were a set of calcified tentacles that bridged the gap between Gorm's Trandoshan limb and his left shoulder. Evidence suggested that the tentacles were in fact biological in nature, but their origin was a mystery. All in all, Gorm's creators were nothing if not creative. After losing the aforementioned recycling droid arm in combat early in his career, Gorm soon reappeared with a more standard mechanical arm as a replacement, confirming suspicions that he was capable of repairing and upgrading himself autonomously. It was said that the only way to kill him was, fittingly, to dissolve him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}