{"url": "Gorlan_Palladane", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi healers", "Category:Jedi of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gorlan Palladane"}, {"tag": "p", "text": "Gorlan Palladane was a former Human male Jedi who stayed on Chelloa after the Sith conquest in order to help his people, living as a relief worker and miner. On Chelloa, he married Roah with whom he had two children, Aneese and Jalen. Unlike most other Jedi, Gorlan was disinterested in combat and preferred non-violent means like healing and helping poor civilians. During the Sith occupation, Gorlan played a leading role in the anti-Sith Chelloan resistance and relayed intelligence about Daiman's baradium mining operations to the Galactic Republic and Jedi Order in Operation Influx. Despite the failure of the operation, he managed to rescue the Jedi Knight Kerra Holt."}, {"tag": "p", "text": "Gorlan and the young Jedi woman would subsequently undertake further operations against both Daiman and his rival Odion, whose nihilistic tendencies posed a threat to Chelloa. His efforts to save the Chelloan people led him to send false intelligence about Chelloa's mining operations. However, his involvement in the anti-Sith resistance led to his incarceration and torture at the hands of Daiman. Following his rescue by Kerra, Gorlan would play an important role in helping coordinate the evacuation of refugees during the Destruction of Chelloa. He would ultimately die during a climatic duel with Lord Odion but not without saving the lives of sixty thousand sentients who escaped Chelloa aboard a fleet of commandeered transports known as the Freedom Fleet."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Operation Influx"}, {"tag": "p", "text": "Gorlan Palladane was a former Jedi who worked on the mining colony of Jenith on the planet Chelloa during its occupation by the Sith Lord Daiman in 1032 BBY during the Sith civil war of the Republic Dark Age. Using his cover as a relief worker and the leader of the Jenith mining community, he supervised baradium mining and export operations while simultaneously aiding the Jedi Master Vannar Treece in planning Operation Influx which aimed to the Daimanite war effort by disrupting supplies of baradium to the frontline. He and his wife Roah Palladane ran a soup kitchen for the impoverished miners. Palladane and his Rodian co-worker Skodo communicated with the Jedi using a transmitter to reactivate an interstellar routing station. However, the transmission was intercepted by the rival Sith Lord Odion, who sought to utilize the baradium to fuel his war effort."}, {"tag": "p", "text": "When the day arrived, he gathered up a group of miners and prepared for a rendezvous with his Jedi contacts at Jenith Spaceport. While Daiman's forces were unloading baradium at the port, they were ambushed by Treece's Jedi team which had commandeered a captured Daimanate Heavy-Lift Starcrosser. The Jedi quickly overwhelmed Daiman's security troops and quickly secured the port. Cornered by Sith troops at the South Work Yards, Palladane was rescued by the female Jedi Knight Kerra Holt. She knocked out a T'surr Daimanate Sith trooper with her lightsaber while Gorlan incapacitated a human officer. While the Jedi were welcomed by the slaves, celebrations were quickly cut short by disagreements between Treece and Palladane over the mission's objectives. While Treece envisioned the raid as a hit-and-run operation, Palladane had hoped for the Jedi to liberate Chelloa from the Sith occupation."}, {"tag": "p", "text": "However, this short-lived victory was interrupted by the arrival of an offensive force of ships at Squatter's Hill under Daiman's older brother and rival—Lord Odion. During the raid, most of the Jedi task force with the exception of Holt were killed. Many workers and guards alike were killed during an explosion triggered by Odion's kinetic corruptor which freed the baradium gases from shale by igniting the veins. Palladane and several of the workers survived because they were sheltering within the Starcrosser transport. Later, he revived the unconscious Holt before informing her that she was the only remaining Jedi on Chelloa. A significant proportion of the wounded were burn victims due to the vast baradium deposits on the ground."}, {"tag": "h3", "text": "An uneasy relationship"}, {"tag": "p", "text": "While the survivors began attending to the wounded, Lord Daiman arrived on a repulsorcraft. He was unconcerned at the loss of lives and the wounded, demanding to see Palladane, the spokesman for the workers. Palladane pleaded for help in treating the wounded but Daiman was more concerned with wanting to know how his rival Odion and the Jedi discovered his secret baradium mining operations. When Palladane expressed his ignorance of the matter, Daiman used Force choke to strangle the former. However, Kerra intervened and tried to force Daiman to stop tormenting Palladane at gunpoint. Amused by her courage and dismissing her as an orphan, Daiman relinquished his grip on Palladane and fondled with her. He mockingly told her to embrace her anger as a diversion and released her since he was preoccupied with the threat of Odion to his goals."}, {"tag": "p", "text": "Showing little concern for the well-being of his subjects, Daiman ordered them to erect up one of his statues in the village square before dismissing the crowd. Following the erection of Daiman's statue, Palladane held a public meeting out his Jenith home, instructing his fellow workers to use the runoff water from the electric fuel cells on the excavators for basic consumption like washing food, clothes and bathing. Due to poor infrastructure and the damage sustained from Odion's raid, water supplies were limited. During a discussion with Holt, he reprimanded her for foolishly challenging Daiman and nearly blowing her cover. After introducing his soup kitchen operation and family, Palladane outlined his reasons for leaving the Jedi Order."}, {"tag": "p", "text": "As a native of Chelloa, Palladane had refused to leave prior to the Jedi withdrawal from his planet. He and Master Treece also disagreed over Jedi strategy in Sith space. While Treece focused on the strategy of the entire war, Palladane was more concerned with helping civilians. Since the Jedi outlined that no Jedi could achieve anything alone, Palladane left the Order. Following the Sith conquest, he survived by hiding most of his Force talents except his Force healing. Concerned about the effects of Daiman's mining on children, Palladane had contacted Treece for assistance by using Skodo's transmitter. Despite his efforts to dissuade the young Holt, she remained determined to eliminate Daiman out of her hatred of the Sith and embarked on a lone mission to assassinate Daiman."}, {"tag": "h3", "text": "Incarceration"}, {"tag": "p", "text": "Meanwhile, Daiman's Sith troopers had apprehended Skodo who was tortured with Force lightning by an enraged Daiman, demanding to know who contacted Odion. For refusing to disclose information on Palladane, Skodo was murdered and his body was dumped in the plaza in the morning. Figuring that Daiman was still ignorant of his role, Palladane found the transmitter in Skodo's house and told Odion that all mining operations on Chelloa were offline. Unknown to him, Daiman had replaced the transmitter with one of his own and had troops waiting nearby. Palladane was quickly apprehended and taken to Daiman's alpine compound where he was beaten and tortured by a livid Daiman. Believing Palladane to be Odion's spy, he challenged his estranged brother to war and ordered a security crackdown on the ten mining settlements of Chelloa."}, {"tag": "p", "text": "After outlining his narcissistic philosophy to Palladane, Daiman agreed to spare Palladane's life. However, if a second Jedi was revealed, he vowed to destroy the entire population of Chelloa. Daimanate security forces pillaged and burnt Jenith while others rounded up the other community leaders for an audience with Daiman. However, Kerra Holt returned from her confrontation with Odion and saved Palladane's young family from being murdered by Sith troopers. Learning of Palladane's incarceration, Holt hitchhiked on a shuttle carrying the Chelloan community leaders and infiltrated Daiman's compound a second time, killing the guards and freeing the prisoners. Kerra rescued the wounded Palladane from Daiman's dungeons. Gorlan revealed that his attempts to contact the Jedi with a transmitter had attracted the attention of Odion who had intercepted the interstellar transmission. Initially he had thought that Odion's attack was a coincidence until the death of Skodo at the hands of Daiman."}, {"tag": "p", "text": "Kerra comforted Palladane by telling him that he sacrificed himself to save the Chelloan people by contacting Vannar and Odion. Palladane also revealed that Odion was bringing a fleet of kinetic corruptors and that Daiman was preparing for a showdown with the rival Sith Lord. By this stage, Holt realized that her true mission was to evacuate the Chelloan people rather than seeking to eliminate the two Sith Lords Daiman and Odion. However, before departing with Palladane and the village leaders on their shuttle, she personally beheaded all of Daiman's statues as a gesture of defiance."}, {"tag": "h3", "text": "Martyrdom"}, {"tag": "p", "text": "Later, Palladane, Holt and the other village leaders fled to a safehouse in the town of Arboth where he was reunited with his family. Meanwhile, Holt spied on the vast transports transporting workers to Daiman's mobile munitions plants and discovered they were empty. Coming to the conclusion that Daiman was not planning to invest more into his mining and industrial projects on Chelloa, she suggested to Palladane that they use the empty transports to evacuate the entire population of Chelloa: 60,000 sentients scattered across ten mining towns. Aware that Odion was planning to conquer Chelloa, Daiman had allowed Holt to escape to Odion and thus leak intelligence on the mobile munitions plants. Odion planned to utilize the factories for his own goal of defeating Daiman's faction. Seeking to aid a fellow Jedi in what he regarded as a noble endeavour, Palladane offered his services to Holt and reactivated his lightsaber, signifying his re-commitment to the Jedi cause."}, {"tag": "p", "text": "Meanwhile, Lord Odion invaded Chelloa with a planetary assault force consisting of elite Lightning Guards. Following his earlier duel with Holt, Odion had been dissuaded from his plan to destroy Chelloa with his kinetic corruptors with intelligence that Daiman was expanding baradium mining operations with mobile munitions complexes. Desiring an industrial base for his war effort, Odion changed his plans to capturing these factories. However, this played into Daiman's plan to eliminate both the Jedi and his estranged brother. In reality, the mobile factories were actually disguised kinetic corruptors which would incinerate Odion's forces while destroying Chelloa's surface, rendering it uninhabitable. As planned, Odion's forces descended on the surface and overwhelmed a poorly-trained detachment of Daimanate troops. They arrived at the pyramidical factories only to discover too late that they were actually Kinetic corruptors. The corruptors initiated an explosion which ignited the volatile gases beneath Chelloa's surface, killing many Odionate and Daimanate combatants alike. Meanwhile, Daiman and his forces made preparations to escape using a fleet of transport ships."}, {"tag": "p", "text": "Putting their plans into action, Holt and Palladane organized a mass evacuation of Chelloa's people by organizing the villagers into teams. These teams infiltrated the spaceport at Arboth and seized control of the transport fleet, overpowering the crew and guards. By the end of the battle, they had managed to evacuate most of Chelloa's population on a hastily-assembled fleet known as the Freedom Fleet. Facing death from lava flows triggered by the kinetic corruptors, Odion and his surviving troops fled for Daiman's transports at Arboth but were prevented from boarding by Kerra and Gorlan. Having achieved their objective and with all teams safely aboard, the Freedom Fleet departed into space."}, {"tag": "p", "text": "Meanwhile, Kerra and Odion engaged in heated lightsaber pursuit in the upper atmosphere above Chelloa. The Jedi Knight commandeered an airspeeder while her Sith opponent donned a jetpack. Kerra managed to reach one of the ascending cargo liners but Odion caught up with her. However, this duel was interrupted by Gorlan who opened one of the entry hatches while fastened to a cable. Armed with a lightsaber, Palladane took on the Sith Lord and drove him to the engine thrusters, expressing his desire for retribution. During the confrontation, both men were severely burnt but Odion managed to escape because of his jetpack. Mortally wounded, Palladane crawled back up to the entry hatch with the assistance of Holt. In his last moments, Palladane commented that Kerra was dying for the wrong thing while he himself was living for the wrong thing. Kerra promised to bring the Chelloan people back into Republic space but Palladane reminded her they were now her people and that she had a responsibility to save billions of other sentients living under Sith domination. The Freedom Fleet then made its way to the Daimanate world of Nilash where they liberated the native slave workers before making their way to Aquilaris, Holt's former homeworld."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gorlan Palladane was a natural leader who was concerned with safeguarding the well-being of his community. His leadership skills led him to assume de-facto leadership of the Chelloan resistance against the Sith occupation. He had a gentle and calm demeanor which helped him conceal his identity as a Jedi Knight during the Sith occupation of Chelloa. His primary concern of looking after ordinary sentients brought him into conflict with Vannar Treece who viewed military action against the Sith Lords as the Jedi Order's primary objective in ending the protracted New Sith Wars. He also disagreed with other members of the Order that they were impotent when alone and felt that his contemporaries were more concerned with fighting the Sith than the consequences of their actions."}, {"tag": "p", "text": "Gorlan's concern with the greater good resonated with Kerra Holt's desire to alleviate the plight of civilians in Sith occupied Space but contradicted with Sith Lord Daiman's narcissistic outlook and the nihilism of Odion. His sense of righteousness and selflessness led him to endure both torture at the hands of Daiman. Ultimately, these traits combined with the desire to become one with the Force led him to willingly die trying to defeat Lord Odion."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Jedi Knight, Gorlan Palladane was trained in the arts of lightsaber combat but rarely displayed his combat prowess during the Daimanate occupation. Still, he used the Force to heal other sentients and to hide his Force abilities from Lord Daiman who sought to eradicate the Jedi within his feudal fiefdom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gorlan Palladane was first introduced as a supporting character in the new comic Knight Errant comic series which debuted in August 2010 with the release of Knight Errant 0 during Celebration V. His story background was developed by John Jackson Miller, drawn by artist Federico Dallocchio and colored by Michael Atiyeh. He appeared in the series' first five issues but was killed off in Knight Errant: Aflame 5, the conclusion of the Star Wars: Knight Errant: Aflame story arc."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}