{"url": "Gormak", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Gormak", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Gormak"}, {"tag": "p", "text": "The Gormak were sentient humanoids native to the planet Voss, a world in the Voss system of the Allied Tion sector in the Outer Rim Territories. They were the more populous of their homeworld's two native sentient species—and they were extremely hostile toward the other, a species known as the Voss, as well as the off-worlders, whom they viewed as allies of the Voss. The Gormak possessed an innate comprehension of technology, although they did not develop spaceflight capability prior to contact with off-worlders. When the planet Voss was discovered by non-natives shortly around 3645 BBY, the Gormak were exposed to the technology of the Sith Empire and the Galactic Republic, gaining the capabilities to construct more advanced weapons and even attempt to build their own starship. During that time, the Voss learned that they were actually descended from Gormak and began an attempt to reconcile between two species. By the time the Eternal Empire of Zakuul invaded Voss in 3630 BBY, the Voss and Gormak ended their hostilities, uniting to defend their homeworld against the invaders."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Gormak were sentient humanoids with green skin. They had flat, noseless faces adorned with frills that swept away from their eyes and mandible, collecting in whorls on the sides of their heads behind the jaw. The eyes of a Gormak varied in color, with red, orange and blue varieties observed. The Gormak had clawed, three-fingered hands—also adorned with frills—and tended to possess a muscular build. The Gormak possessed a sexual dimorphism, with females being slightly shorter than males and lacking a whorl located above their nose. The Gormak also had a natural mental acuity for understanding and employing technology."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "An aggressive species, the Gormak held an innate love of warfare and competition, and were extremely hostile toward the other natives of their planet, the Voss species. The Gormak held a cultural belief that in order for them to prosper, the Voss—whom they viewed as an unnatural plague on the planet—must be destroyed. To achieve that goal, Gormak warriors repeatedly assaulted the Voss capital city of Voss-Ka over the course of centuries; however, despite their far greater numbers, they were never successful as their warlike nature has kept them from uniting against their enemy. After the Sith Empire and the Galactic Republic established embassies in Voss-Ka, the Gormak viewed both factions as enemies, seeing the off-worlders as no different from the Voss. Although their tribal society and basic speech patterns were considered primitive by galactic standards, their innate talent with technology rivaled the capabilities of the top minds of the Republic. From bits of scavenged electronics and discarded equipment, the Gormak constructed advanced tools, heavy machinery, specialized weapons and even cybernetic implants. However, despite their incredible affinity for technology, the Gormak remained a pre-spaceflight culture confined to their homeworld, which caused them to be viewed as a backward species despite being perfectly capable of repairing, modifying and improving tech created by more advanced cultures."}, {"tag": "p", "text": "The Gormak population was numbered in millions and their society was tribal in structure, with Gormak spread throughout the wilderness of Voss in numerous nomadic clans numbering roughly a hundred individuals each. Within each tribe the position of responsibility to maximize the value of all salvaged equipment was held by a Shaman with a particularly strong affinity for technology, to whom the other Gormak looked for guidance not just in matters of technology, but in their daily lives. By far the most populous sentient species on the planet, the Gormak settled in camps, sometimes fortified by stolen off-world technology and actively avoided the forest known as the Nightmare Lands due to its mysterious corruptive influence. The largest Gormak settlement on the planet was Gorma-Koss in the Gormak Lands, where tens of thousands of Gormak have united their tribes at the base of an unnamed mountain under the leadership of Jokull, the Gormak King. The Gormak constructed mines to strip the land of valuable resources for the construction of their machines and weapons, leaving desolation and monolithic structures behind. Apart from working with existing technology, the Gormak also experimented heavily with organic-cybernetic hybrids, using Voss fauna as test subjects. Gormak hunting parties set out at regular intervals to trap mawvorrs, shaclaws and even the deadly vorantikus alive so that the creatures could be implanted with cybernetic upgrades. These monstrous cyberbeasts became faster, stronger and far more dangerous and could be programmed with specific instructions, making them into excellent guardians. The Gormak considered the meat of the insectoid shaclaw a delicacy, and became skilled at capturing and cooking them alive since the giant insects' flesh would become contaminated with toxins within minutes after death. The Gormak would only dine on the shaclaws during special coming of age feasts, and the capture and preparation of such meal was considered an essential part of the ritual celebration. The Gormak revered the local alpha predator vorantiki for their power and fearlessness, often depicting them in crudely scrawled pictures found inside Gormak domiciles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In ancient times, the Sith came to Voss, where the Gormak were the only one native sentient species. The Sith viewed Gormak as primitive and ignored them as they began to harvest the world's resources. However, the planet and the Gormak were irrevocably changed when the Jedi arrived and attempted to drive the Sith off Voss. Seeking allies among the natives, the Jedi agreed to teach some of the Gormak tribes on how to use the Force, but the Gormak were unprepared for the knowledge. Those tribes underwent radical evolutionary changes in the course of a few generations, becoming a new species named the Voss. The Jedi attempted to teach the Voss how to control their emotions and new powers, but the Voss instead attacked the Sith on the planet, bringing the new species in contact with the dark side of the Force. This caused the dark side to become manifest in a Sith structure on the planet, and this entity came to take the name Sel-Makor as it gained intelligence. Sel-Makor began to feed on violence and suffering, fueling its dark side powers and spreading corruption across the surrounding area, which became known as the Nightmare Lands, and the ancient Sith complex that the entity inhabited was known as the Dark Heart. Not long after his creation, Sel-Makor captured the spirits of two of the Gormak who had been taught by the Jedi, Damek-Ol and Nemok-Ta, and imprisoned their spirits in slave bodies. Damek-Ol was imprisoned in the body of a Dashade, while Nemok-Ta was placed in the body of an Abyssin, and the two became avatars of Sel-Makor's power. After the extermination of the Sith, the Voss forgot their origins and founded the city of Voss-Ka atop the planet's highest peak, while the Jedi eventually died out or departed. Sel-Makor, meanwhile, influenced the Gormak's bloodlust and drove the far more numerous species to attack their cousins throughout the centuries so that he could feed off of their dark emotions."}, {"tag": "p", "text": "For centuries between the sundering of the species and the re-discovery of Voss by non-native off-worlders, the Gormak settled across the planet and engaged in a seemingly endless war against the Voss species. Though restricted at the time to pre-flight technology, the technological aptitude, viciousness, and superior numbers of the Gormak made them a formidable opponent to the Voss. Despite that, the Gormak were held at bay by the training of the Voss commandos, the Force visions of the Voss Mystics, and the fortifications of the Voss mountain-top city of Voss-Ka. Following the Treaty of Coruscant that ended the Great Galactic War between the Sith Empire and the Galactic Republic, Voss was accidentally rediscovered by the larger galaxy around 3645 BBY. An operative of the Star Cabal named Albathius arrived on Voss shortly after its discovery, and gained great influence among the Voss Mystics, becoming known as the \"Shining Man\" and convincing the Voss to stay neutral from the Cold War between two governments. The Shining Man soon died, but his starship remained in the Chamber of Ashes of the Dark Heart, where it was guarded by a Gormak named Xanar for years afterwards."}, {"tag": "p", "text": "At some point during the Cold War, a Gormak by the name of Jokull entered the Nightmare Lands and traveled to the Dark Heart, entering the cave known as the Dark Hollow where Sel-Makor was most powerful. Instead of consuming the Gormak's mind like he had done to so many others, Sel-Makor instead chose to awaken within Jokull his species' natural ability—the power to see visions as the Voss did. Horrified that he had been corrupted and seeing all Voss as being marked with evil because of their powers, Jokull returned to the Gormak Lands and became king of his people in order to wage war upon the Voss—so that the Gormak would never be corrupted like he was. Under his leadership dozens of Gormak tribes united in Gorma-Koss, where thousands of Gormak set to work together on a massive project. Using pieces and equipment salvaged from the offworlders and the Voss, the Gormak constructing a Gormak cannon to threaten Voss-Ka and a starship named Gormegan-1 which they intended to use to travel to the stars. These constructions were supported by the Tela Mining Operations, while Jokull stored treasures and trophies from his conquests in the underground vault known as the King's Hall. In the Pelath-Ri Marches the Gormak settled on the Fest Otur Island and began to cut down many of the trees in the region."}, {"tag": "p", "text": "Trying to gain an alliance with the Voss, both the Republic and the Empire lent them aid in their fight against the Gormak. The Sith aided the Voss in destroying Gormegan-1 while the Republic helped the Voss to destroy the Gormak cannon. In the process, Jokull was captured, and the Voss discovered Jokull's ability to see the future. They enlisted the aid of outsiders in retracing the Gormak king's steps in the Nightmare Lands, soon learning the truth of their species' creation. After Jokull and neutralized, a new leader named Raklann took charge of Gormak in the Pelath-Ri Marches, trying to destroy the Shrine of Healing from below and attempting to excavate and repair the ancient starship named Evuk-Nosk. In 3636 BBY the galaxy was invaded by the Eternal Empire of Zakuul, who after defeating both the Republic and the Sith Empire, placed dozens of massive battlestations called Star Fortresses in orbits of subjugated worlds to watch for possible uprisings. The Voss Star Fortress was protected by a shield bunker located in the Pelath-Ri Marches, and the Gormak saw it as a source of the disease that affected their young, old and weak. In the face of a larger threat, the Voss and Gormak soldiers had united to defend their homeworld during the Invasion of Voss, ending the centuries-long war between two species. Their alliance has proven surprisingly effective, with the meditative reserve of the Voss complimenting the ferocious strength of the Gormak to form a formidable army."}, {"tag": "h2", "text": "Gormak in the galaxy"}, {"tag": "p", "text": "In 3640 BBY a Gormak named Hadrik, who was tired of the fighting between Voss and Gormak, learned the art of the dream-walking. While traversing the Spirit World, Hadrik met with the Sith Lord Kallig and in exchange for freeing his physical body from captivity and the passage offworld agreed to perform the Forbidden Ritual to heal Kallig's mind. Hadrik traveled with Kallig into the Nightmare Lands, where they found the dream-rock, containing the spirit of a Voss named Dal-Rin. Dal-Rin instructed Hadrik on how to use the rock on the ghosts inside Kallig's mind and defeat them. The pair proceeded to strip away the ghosts' disguises and bested them one-by-one, after which Kallig used the rock to heal themselves. Upon returning to the Voss Orbital Docking Station, Kallig and Hadrik found Voss commando Sor-Nak waiting for them, who declared that for taking a Gormak off Voss, his people would reject the Empire. To preserve Imperial interests, Kallig used a mind trick to make Sor-Nak forget about Hadrik, with Hadrik becoming the first known Gormak to leave his homeworld."}, {"tag": "p", "text": "In 3631 BBY a Gormak warrior Rokuss teamed up with the Commander of the Alliance that opposed the Eternal Empire of Zakuul to take down the Star Fortress in orbit of Voss. Rokuss assembled a strike team of Gormak and joined the Commander in an assault on the shield bunker protecting the Star Fortress, after which they traveled on the Alliance base on Odessen. From there, the Commander infiltrated the Voss Star Fortress and destroyed it by overloading the Sun Generator, after which Rokuss and his warriors remained to fight for the Alliance's cause in gratitude, though they later returned to Voss to fight in the defence of Voss-Ka during the assault by the Eternal Fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gormak are a new species created for Star Wars: The Old Republic, an MMORPG video game by BioWare, and were first mentioned in The Holonet, a promotional media web feature. The Gormak are found only on Voss, where multiple quests and codex entries elaborate on their society and culture. Knights of the Fallen Empire expansion later introduced the Gormak Rokuss as a companion character for players, available through the Star Fortress missions. Fred Tatasciore did most of the voice work for them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}