{"url": "Gorneesh%27s_tribe", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Articles to be expanded", "Category:Dulok tribes"], "nodes": [{"tag": "h1", "text": "Gorneesh's tribe"}, {"tag": "p", "text": "Gorneesh's tribe was a large group of Duloks from the Dulok Swamp on the Forest Moon of Endor. Their village was located close to the Ewoks of Bright Tree Village, and the two groups had a long history of animosity. Over several encounters, the Duloks attacked the Ewoks' Soul Trees, attempted to cut down the Tree of Light, and kidnapped young Ewoks to row a battleship. In other situations, the Duloks found themselves pawns in the schemes of other enemies of the Bright Tree Ewoks, such as Morag and the Stranger. Gorneesh's Duloks maintained an uneasy alliance with Morag due to their mutual hatred of the Ewoks."}, {"tag": "p", "text": "Prominent members of the tribe included King Gorneesh, his wife, Urgah, and his son, Boogutt. The king was advised by his medicine man, Umwak, and the oracle Murgoob. He employed several bodyguards, including Duloks that painted symbols on their bellies, such as an X, an O, and a diamond."}, {"tag": "h2", "text": "Members"}, {"tag": "p", "text": "Gorneesh's tribe was a relatively large band of Duloks who lived in the Dulok Swamp near Happy Grove. The members of the tribe all displayed similar markings: green body fur, brown brows, gray masks around the eyes, and gray lips."}, {"tag": "p", "text": "By 3 ABY, the tribe had come under the rule of King Gorneesh, a hulking, one-eyed Dulok who died his feet red and carried a large club. The Dulok frequently led raiding parties against the Ewoks and hatched schemes against them to steal their harvest, kidnap their woklings, and take over their village."}, {"tag": "p", "text": "Gorneesh was joined in these endeavors by his tribemates, including his wife, Queen Urgah, and son, Prince Boogutt. Gorneesh was advised by the shaman Umwak, who also acted as a liaison with Morag and worked with his nephew. The oracle Murgoob was an elder member of the tribe who occasionally offered ideas to help defeat the Ewoks. The king frequently surrounded himself with bodyguards, including Duloks marked by an X, O, and a diamond on their fur."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The tribe had a long history of conflict with the Ewoks of Bright Tree Village. Three generations before 3 ABY, the tribes were already embroiled in the Ewok–Dulok wars. During one important battle, Duloks from the tribe marched on the Ewoks' Soul Trees to cut them down. Their plan was stymied, however, when the Ewok Erpham Warrick counterattacked in his Ewok battle wagon. The Duloks retreated to their swamps."}, {"tag": "p", "text": "By 3 ABY, Duloks from the tribe often found themselves compelled to do the bidding of other, more powerful enemies of the Ewoks. In one instance, Morag ordered the tribe to keep watch over the Phlog infant Nahkee, whom she had kidnapped from his family. When a band of young Ewoks freed the child, the enraged Phlog parents rampaged through the Dulok Swamp. In another encounter, an otherworldly being known as the Stranger compelled the Duloks to raid Bright Tree Village and create a distraction to cover him stealing the Ewoks' Sunstar. That same year, Gorneesh's tribe stole shadowroot soap from the Ewoks, invaded their village, helped destroy the sun crystal, and kidnapped young Ewoks to care for the Dulok pups' and clean the Dulok Swamp."}, {"tag": "p", "text": "Gorneesh's tribe learned that the Ewoks' sacred Tree of Light had weakened and needed to be renewed. He rushed with a band of his warriors to cut it down before the Ewoks could reach it. The two sides clashed at the site, and the Ewoks Wicket Wystri Warrick and Kneesaa a Jari Kintaka turned the tide against Gorneesh's forces, who were forced to retreat."}, {"tag": "p", "text": "Eventually, the tribe learned that the Wicket W. Warrick was rebuilding his great-grandfather's battle wagon. On the advice of the Dulok oracle, Murgoob, Gorneesh ordered the battle wagon stolen so that it might be turned against the Ewoks' Soul Trees. Warrick and another Ewok, Malani, foiled the plot when they caused the battle wagon to collapse."}, {"tag": "p", "text": "Gorneesh and his warriors later stole a sacred fish carving from their Bright Tree rivals and used it on a Dulok battleship. Nevertheless, some Ewok slaves used to row the vessel escaped and managed to recover the item for the Ewoks."}, {"tag": "p", "text": "The Dulok king finally offered to end the war later in 3 ABY, proposing a peace treaty. This was but a scheme, however, for as soon as the Ewoks under Chief Chirpa reached the site of the peace summit, Gorneesh ordered his warriors to cut the bridge the Ewoks were crossing."}, {"tag": "p", "text": "Gorneesh's tribe was later enslaved by the Galactic Empire, with their village destroyed. Only one member of the tribe, Agluk, managed to escape captivity, costing him his right arm in the process. His escape alerted the Ewoks to the Imperial presence on the moon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "King Gorneesh and his tribe first appeared in the Ewoks animated series, which began airing in 1985. They feature in 8 of the 13 episodes of the first season and 3 of the 35 of the second. Critics and Star Wars authors have singled out some of these episodes as examples of the series at its best. Jon Bradley Snyder, for instance, has identified \"Asha\" as a first-season highlight, \"Wicket's Wagon\" as well animated, and \"Rampage of the Phlogs\" as one of the more humorous episodes thanks to the scene in which King Gorneesh has to change the diaper of a baby Phlog. Dan Wallace and Robin Pronovost have named the episodes \"The Tree of Light,\" \"Wicket's Wagon,\" and \"Asha\" as those that best show the villainy of Gorneesh and his tribemates."}, {"tag": "p", "text": "A variety of tie-in items were released during the run of Star Wars: Ewoks, including Dulok action figures from Kenner and storybook adaptations. Three Dulok-themed books were released: The Red Ghost: An Ewok Adventure from Random House in 1986 (based on the episode \"Asha\"), and The Haunted Village and Wicket's Wagon from Dragon Picture Books in 1987, based on the episodes of the same name. While The Red Ghost includes all-new artwork, the Dragon volumes use images taken directly from the cartoons. The Dragon volumes misspell the species' name Dulock. In 1986, Dulok characters took to the ice as part of \"The Ewoks and the Magic Sunberries.\" Lucasfilm repackaged several episodes of the animated series as the feature-length films The Haunted Village and Tales from the Endor Woods in 2004. Works that mention Duloks published in the years since the series' cancellation, such as A Guide to the Star Wars Universe, the Star Wars Encyclopedia, and the various Essential Guides, simply summarize events from the television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}