{"url": "Gorog", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Killik hives", "Category:Secret societies", "Category:Sith organizations"], "nodes": [{"tag": "h1", "text": "Gorog"}, {"tag": "p", "text": "The Gorog or Dark Nest was a secret nest of Killiks that was hidden from the rest of the Colony. It was also the most violent—it sought to use the rest of the nests against the Chiss after the Killiks absorbed the three Force-sensitives who escaped from Myrkr in 27 ABY during the Yuuzhan Vong War: Lomi Plo, Welk, and Raynar Thul. The first two were absorbed by the Dark Nest: Lomi became the Unseen Queen of the Gorog while Welk became the nest's Night Herald, thus giving Gorog its qualities of secrecy and manipulation. Raynar was absorbed by Yoggoy, eventually became UnuThul and forming Unu so that the rest of the Colony took on his respect for life."}, {"tag": "h2", "text": "Organization and philosophy"}, {"tag": "p", "text": "This nest shared many of the characteristics that were absorbed from the Joiner Lomi Plo. The Dark Jedi's fear and desire to hide translated into the Yoggoy nest which had absorbed her into their hive-mind. As a result, the Dark Nest, known as Gorog, was created. This nest shared Lomi Plo's personality traits and desire to remain hidden from everyone else. Thus, members of the nest were noted for being very secretive and able to infiltrate other Killik nests. As a result, their social structure was believed to be quite different from other nests and had the potential to be numerous parasite cells hidden among other nests."}, {"tag": "p", "text": "Similar to the other nests, the Gorog had different breeds of Killiks such as Membrosia givers that produced black Membrosia. These six tubular legged Killiks were watched over by a number of tiny attendant Gorogs. The Dark Nest's soldiers were bluish in color and they fought by finding a way to pierce the skin, then spit out a highly acidic brownish poison. Certain breeds of Gorog were also noted for being Force-sensitive and had the capacity to shield their presence in the Force. Gorog larvae were birthed in large hexagonal cells and fed on immobile captives that were brought into their chambers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This hidden nest started the Dark Nest Crisis in 35 ABY when it began subtly influencing the rest of the Colony to begin encroaching on Chiss space, even though the Killiks were not running out of room. Their motives were to provoke a war between the Killiks and the Chiss, thus providing motive for the Killiks to expand into the rest of the galaxy to bring all of the sentient beings under the influence of the hive mind—which would give Lomi Plo ultimate power."}, {"tag": "p", "text": "The Dark Nest was stopped in its plans by Luke Skywalker, Mara Jade Skywalker, Han Solo, and Leia Organa Solo. They tracked the Dark Nest to its hiding place on Kr, where they destroyed it—or so they thought."}, {"tag": "p", "text": "In actuality, the nest survived and continued manipulating the rest of the Colony, even after they moved to the Utegetu Nebula. Lomi convinced the Killiks to build fifteen nest ships, massive vessels capable of carrying virtually all of the nests inside of them. This fleet met a task force of the Galactic Alliance Fifth Fleet at the Murgo Choke, where several of the nest ships escaped into the galaxy proper—unfortunately for the Dark Nest, the hyperdrive of their ship was damaged by Mara's Jedi shadow bomb and unable to leave."}, {"tag": "p", "text": "The Dark Nest stole the Victory-class Star Destroyer Admiral Ackbar and Lomi Plo nearly killed Luke in a battle with the nest, which led to the Swarm War in 36 ABY."}, {"tag": "p", "text": "Although it was trapped in the Nebula during the war, the Dark Nest continued manipulating the Colony, directing them to stage coups on the homeworlds of most of the Galactic Alliance's insectoid species. Most of these attempts were foiled by the Jedi, although the Killiks were able to take over Thyferra, cutting off the galaxy's supply of bacta."}, {"tag": "p", "text": "The Jedi then went after the Dark Nest hive ship within the nebula. Although they were successful in destroying the ship, some Jedi were lost, and Lomi Plo escaped after wounding Mara and Jacen Solo."}, {"tag": "p", "text": "The Dark Nest's influence was finally ended after the death of Lomi Plo and the supposed death of Alema Rar during the Battle of Tenupe. With the Dark Nest destroyed, Lumiya's Sith became the last surviving remnant of the Order of the Sith Lords in 36 ABY."}, {"tag": "p", "text": "During the Second Galactic Civil War in 40 ABY, it was discovered that the Gorog hive mind lived on in the Twi'lek Dark Jedi Alema Rar, only to presumably perish completely when Alema was killed later that year by Jagged Fel, a former member of the Chiss, whom the Gorog pressured during the Dark Nest Crisis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: The Clone Wars, Karen Traviss consistently misspells \"gorg\" as \"gorog.\""}, {"tag": "p", "text": "In the apocryphal novella Supernatural Encounters: The Trial and Transformation of Arhul Hextrophon, the Gorog nest was created in ancient times by the evil goddess Tharagorrogaraht the Night Spirit, who was herself sometimes called Gorog. The Dark Nest warred against the other Killiks on Alderaan in the prehistoric Twilight Wars, and after Tharagorrogaraht's destruction by Wutzek, they were forced into hiding until the Dark Nest Crisis; the Thuruht was an offshoot of the Gorog who wished to repent their evil ways. This history contradicts the Dark Nest Trilogy, in which the Gorog was first created by Lomi Plo in 27 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}