{"url": "Goron", "categories": ["Category:Canon articles", "Category:Garnac's hunting guild members", "Category:Males", "Category:Pilots", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Goron"}, {"tag": "p", "text": "Goron was a Trandoshan male hunter who hunted sentient beings on the moon of Wasskah during the year 20 BBY as a member of a Trandoshan hunting guild. Goron, along with fellow Trandoshan Clutch, also served the guild as pilots, flying a Trandoshan prisoner ship across the galaxy to kidnap potential prey. After kidnapping the Wookiee Chewbacca whom they got took as captive, the freighter was attacked by stranded Jedi younglings when the Trandoshans attempted to drop Chewbacca off on a Wasskah island. Goron climbed out onto the freighter's hull to repel the Jedi directly and was nearly successful in the ensuing fight. However, Clutch had dueled the Padawan Ahsoka Tano in the starship's cockpit. The damage to the controls and electrical systems caused the ship to crash into the hunting island, with Goron falling from the ship to his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Hunt on Wasskah"}, {"tag": "p", "text": "Goron was a Trandoshan male game hunter and pilot who was a member of a hunting guild and catch group led by the Trandoshan Garnac. As a guild-member, Goron piloted a Trandoshan prisoner ship across the galaxy to kidnap sentient beings to bring back to the moon of Wasskah, where they would be hunted for sport aswell as hunting on the surface of Wasskah like the other Trandoshan hunting members through their relishing sport."}, {"tag": "p", "text": "Shortly after two different pilots returned to Wasskah with a slew of new prey during the year 20 BBY—including the Jedi Padawan Ahsoka Tano—Goron was present on the guild's floating base of operations for both the official beginning of a new catch hunting day and for the initiation ceremony of Dar, guild boss Garnac's son. Sometime later, Goron and and the pilot Clutch left Wasskah on the Reugot freighter to hunt for potential prey."}, {"tag": "h3", "text": "Jedi counterattack"}, {"tag": "p", "text": "Goron and Clutch returned with the freighter to Wasskah's Island Four after acquiring one prisoner, a Wookiee named Chewbacca. As it happened, Tano had survived the past several days of Trandoshan pursuit, and had banded together with two kidnapped Jedi younglings, O-Mer and Jinx. Tano had inspired the younglings into fighting the Trandoshans, and had waited at Island Four's beach in order to take the Trandoshan freighter for themselves. Using the Force, Tano and the Jedi leaped high into the air and onto the ship, with Tano landing directly on the windshield, making her presence known to the Trandoshans."}, {"tag": "p", "text": "On orders from Clutch Goron climbed out onto the long hull of the ship, blaster rifle in hand, and attempted to shoot the younglings while Tano climbed into the ship behind him. Goron was disarmed, and resorted to hand to hand combats. Although stronger than either O-Mer or Jinx individually, the two Jedi working together proved to be a handful. Meanwhile, Tano engaged Clutch in the cockpit, which caused severe damage to the ship's controls and electronics, which caused the vessel to spin wildly and nearly throw Goron and O-Mer off of the ship. Both managed to hang on, with Goron hanging from a ledge just below the young Cerean Jedi. Goron grabbed O-Mer's leg in an attempt to drag him down, but the ship bucked and Goron lost his grip on the ship. Hanging from O-Mer's leg, Jinx intervened and kicked Goron away, sending the Trandoshan to his death below."}, {"tag": "p", "text": "Clutch was killed by Tano, and the ship crashed on the beach. Goron's fate was learned the next day, leading the hunter Lo-Taren to conclude that the Jedi had become bolder in their efforts in escaping. Subsequently leaving Garnac conclusions the Jedi youngling companions were significantly organized since having Chewbacca and too bold to give chase following the crash of the Trandoshan prisoner dropship on the hunting island shortly after the deaths of Clutch and Goron themselves."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Goron was a large, green-scaled Trandoshan with yellow eyes. Goron expressed excitement when Garnac announced the start of a new hunt, and partook and chanted Dar's name during the young hunter's induction ceremony. During the Jedi's attack on the freighter, Goron quickly followed Clutch's orders to climb onto the ship's long hull. In the following fight with the younglings, Goron proved to be a dangerous foe, but he was unable to keep his balance as the ship bucked wildly after taking damage, and Goron eventually fell to his demise as a result."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Along with Clutch, Goron piloted the hunting guild's Trandoshan prisoner ship that was customized with a \"jaws\" design on the front end of the ship."}, {"tag": "p", "text": "During his brawl with the Jedi younglings, Goron was armed with a long, thin sniper rifle that he was quickly disarmed of during the fight. Goron also wore a bandolier that was wrapped around his body over his gray-colored fatigues. Like all of the Trandoshans in the hunting guild, Goron wore an electronically powered gauntlet around his wrist."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Goron was created for the Star Wars: The Clone Wars television series, and first appeared in the episodes \"Padawan Lost\" and \"Wookiee Hunt,\" the twenty-first and twenty-second episodes of the show's third season, respectively. Goron's voice was provided by Dee Bradley Baker in \"Wookiee Hunt,\" who was also responsible for voicing all of the clone troopers throughout the series' run."}, {"tag": "p", "text": "Goron's name is derived from the Gorn, an alien species from the 1960s sci-fi television series Star Trek."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}