{"url": "Alliance_Army", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles to be expanded", "Category:Cleanup", "Category:Incomplete lists", "Category:Alliance to Restore the Republic military units"], "nodes": [{"tag": "h1", "text": "Alliance Army"}, {"tag": "p", "text": "The Alliance Army, also known as the rebel army, was a military branch containing the ground forces of the Alliance to Restore the Republic. Ranking members of the Rebel army could be identified by a pips with green markings. Eventually, it was replaced by the New Republic army."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Alliance army was the ground forces of the Alliance to Restore the Republic, which had been founded by Mon Mothma in 2 BBY to organize the various rebel cells and factions scattered across the galaxy. In 0 BBY, General Davits Draven assigned various rebel ground units including a platoon of Special Forces marines led by Lieutenant Taidu Sefla and the Pathfinders to support Operation Fracture depending on what happened on Jedha. Members of the Special Forces' Extraction Team Bravo later rescued Jyn Erso from the Imperial prison on Wobani."}, {"tag": "p", "text": "Rebel ground forces including the 61st Mobile Infantry or \"Twilight Company\" saw action against General Maximilian Veers' elite Blizzard Force during the Battle of Hoth in 3 ABY. Rebel infantry, artillery, and snowspeeders fought in the defense of Echo Base but were overwhelmed by Blizzard Force's AT-AT walkers. Twilight Company also saw action during several campaigns of the Galactic Civil War including the Mid Rim Retreat, Operation Ringbreaker, and the Siege of Inyusu Tor. During the Mid Rim Retreat, the Bitter Pill Company, Twenty-First company, and the aquatic Sixty-Eighth Infantry were deployed in various diversionary actions against the Imperial Army."}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "Theoretically, all Rebel soldiers were trained the same way, using. a field guide known as the White Book. According to the White Book, training was to be divided into three to four phases; the first two were identical for every soldier, while the third had two types, one for ground forces and another for space forces. The fourth phase was used to train special forces."}, {"tag": "p", "text": "In reality, only base troops actually underwent a formal training as suggested by the White Book. In Twilight Company, for example, training consisted of little more than being shown how to use a blaster."}, {"tag": "p", "text": "Alliance Special Forces training taught a number of skills, including using antique slugthrowers, disarming proximity mines, and rappelling off of ray shields. According to Kryndal, about a third of the personnel at Echo Base had undergone the Special Forces training."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "During the Battle of Endor, General Han Solo led a strike team to Endor to disable the second Death Star's shield generator. Solo's strike team forged an alliance with local Ewok tribes and succeeded in storming the Imperial base and destroying the shield generator. This turned the tide of the battle against the Empire, leading to the death of Emperor Palpatine and Darth Vader. The morning after the Battle of Endor, General Solo led the Pathfinders on an attack against an Imperial outpost on the far side of Endor. Though the Pathfinders and their Ewok allies eliminated the Imperial holdout, Solo warned that the war was far from over."}, {"tag": "h3", "text": "Wretch of Tayron"}, {"tag": "p", "text": "Solo later led the Pathfinders on a raid against an Imperial Security Bureau black site at the Wretch of Tayron. As a result of the raid, the Alliance obtained intelligence about the Emperor's posthumous Operation: Cinder."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In the months following the Battle of Endor, the Rebel army transitioned into the New Republic's army as the Alliance took steps to restore the Republic."}, {"tag": "h2", "text": "Groups"}, {"tag": "h3", "text": "Branches"}, {"tag": "h3", "text": "Regiments"}, {"tag": "h3", "text": "Companies"}, {"tag": "h3", "text": "Platoons"}, {"tag": "h3", "text": "Strike teams"}, {"tag": "h3", "text": "Squads"}, {"tag": "h3", "text": "Unspecified"}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Army troopers"}, {"tag": "p", "text": "The rebel army was composed of a variety of different soldiers and mercenaries. The Imperial occupations of many species' homeworlds resulted in an abundance of warriors native to those worlds to enlist in the rebel army. Such warriors included Drabatan Saboteurs, Iakaru Warriors, Wookiee warriors, and Gigoran Fighters. The rebel trooper was one of the standard types of trooper used by the army."}, {"tag": "h4", "text": "Elite units"}, {"tag": "p", "text": "The rebel army maintained several elite troopers for their operations. Such troopers included the Ithorian Infiltrator, the Bufopel Protector, the Rebel pathfinder, the Rebel Commando the Rebel Honor Guard and the Rebel Marine."}, {"tag": "h4", "text": "Environment"}, {"tag": "p", "text": "The rebel army maintained several troopers that specialized in a specific environment, such as the Cold-weather Soldier and the Desert Soldier. Members of \"Fisheye Company\" were specialized to fight in aquatic environments."}, {"tag": "h4", "text": "Specialized"}, {"tag": "p", "text": "The army of the Alliance was composed of a wide array of specialized soldiers that specialized in certain weapons, missions, or tactics. For heavy ordnances, the Alliance's army employed the Heavy Soldier, the Cold-weather Heavy Soldier, the Heavy Desert Soldier, the Rebel Vanguard, the Quarren Heavy Gunner, the Sullustan Demolition, and the Special-weapons flamethrower. The army also utilized jetpack-equipped soldiers such as the Jetpack Trooper, the Arctic Jetpack Trooper, the Desert Jetpack Trooper, the Forest Jetpack Trooper, the Ishi Tib Jetpack Trooper, and the rocket-jumper."}, {"tag": "p", "text": "The army also made use of several types of sniper-equipped troopers, including the Rebel Marksman, the Rodian Sniper, and the Sullustan Recon Sharpshooter. The rebel army also had mounted troopers, which consisted of the Bantha Rider and the Tauntaun Rider."}, {"tag": "h3", "text": "Mercenaries"}, {"tag": "p", "text": "To bolster their forces, the army's mercenaries consisted of Dowutin Hunters, Fathier Riders, Gamorrean Warriors, Luggabeast Munitioneers, Tognath Marksmen, and Twi'lek Incinerators."}, {"tag": "h3", "text": "Other"}, {"tag": "p", "text": "Combat engineers were also used by the rebel army, and specialized in engineering operations on the battlefield."}, {"tag": "h2", "text": "Vehicles and machinery"}, {"tag": "p", "text": "The vehicles of the rebel army originated from varied sources. In addition to their own vehicles, the rebel army obtained several that dated back to the Clone Wars to both the Galactic Republic and the Confederacy of Independent Systems, and the army also supplemented its forces with stolen Imperial vehicles such as the All Terrain Armored Transport, the All Terrain Scout Transport, the All Terrain Defense Turret, and the TX-225 GAVw \"Occupier\" combat assault tank. Clone Wars-era vehicles included the Republic's All Terrain Tactical Enforcer, the All Terrain Reconnaissance Transport, the All Terrain Attack Pod, TX-130 Saber-class fighter tank, and the Confederacy's Armored Assault Tank and IG-227 Hailfire-class droid tank. In addition, the Clone Wars-era and Imperial vehicles were supplemented by the army's Arrow-23, Heavy Tracker, Freerunner, Ultra-Light Assault Vehicle, Juggernaut, A-A5 Speeder Truck, T2-B Repulsor Tank, Enhanced T2-B Repulsor Tank, MLC-3 light tank, the Endor Forest Ranger, the 74-Z speeder bike, X-34 landspeeder, T-47 airspeeder, and the V-4X-D ski speeder."}, {"tag": "p", "text": "In addition, the rebel army also heavily modified vehicles to better suit their purposes. Several of these modified vehicles included the Elite AT-TE, the Anti-Vehicle Skiff, the Cold-weather Hailfire Droid, and the Enhanced AT-AP Walker. Also in its arsenal, the army utilized stationary artillery pieces. Such weapons included the 1.4 FD P-Tower, the DF.9 turret placement, the V-232 artillery emplacement, the V-120 artillery emplacement, and the v-150 Planet Defender."}, {"tag": "h2", "text": "Weapons and equipment"}, {"tag": "p", "text": "The rebel army was well equipped with a variety of infantry weapons such as blaster rifles, which included the A280 blaster rifle, the A280C blaster rifle, the A-300 blaster rifle, the A280-CFE blaster, the A310 rifle, the DH-17 blaster rifle the E-5C, and at times the stolen E-11 blaster rifle. Members of the rebel army also used the DH-17 blaster pistol, the A180 pistol, the DLT-20A blaster rifle, the M-45 repeating ion blaster, the Vulk TAU-6-23 \"Blastmill\" rotary blaster cannon, the Z-6 rotary blaster cannon, and the Mark II EWHB-10."}, {"tag": "p", "text": "For heavy ordnance, the rebel army was equipped with the PLX-1, the RPS-6 rocket launcher, the HH-12 rocket launcher, and the Smart Rocket."}, {"tag": "p", "text": "The Alliance had rank insignia, though they were rarely seen in smaller cells or units such as mobile infantry companies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}