{"url": "Goroth_Prime", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Goroth Prime locations", "Category:Low-gravity planets", "Category:Trans-Nebular sector planets", "Category:Type II atmosphere planets", "Category:Type III atmosphere planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Goroth Prime"}, {"tag": "p", "text": "Goroth Prime, also simply known as Goroth, was the Gorothite homeworld, located on the border with the Mid Rim. The Aqualish knew this world under the name Celleballen, which meant \"wasteland.\""}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Astrography"}, {"tag": "p", "text": "Located in the Trans-Nebular Zone of the Trans-Nebular sector, Goroth was far away from regular, short or safe hyperspace routes, a fact which left the planet hidden from the rest of the galaxy for a long time."}, {"tag": "p", "text": "Goroth had a perihelion orbit of 7.1 light minutes and was the only planet in the system to develop sentient life. The planet had three moons, all with a stable orientation, 120 degrees apart. The moons themselves, called Telar, J'Mel and V'Sar, were airless rocks, with no magnetic fields or volcanic activity. The planet's axis of rotation was perfectly perpendicular to its orbital plane, making day and night the same length and seasons nonexistent."}, {"tag": "p", "text": "Although a standard terrestrial planet from the outside, Goroth had an unusually strong magnetic field and a slower speed of rotation. A standard day lasted thirty-six hours and a year 300 local days (450 standard days or 1.22 standard years). The strong magnetic field, combined with the fact that the magnetic poles were offset with axis of rotation by 20 degrees, caused heavy lightning storms with electromagnetic pulses."}, {"tag": "p", "text": "Many tons of hyperbarides had diffused within the star system at concentrations of a few molecules per cubic meter. For reasons not fully understood, the hyperbarides created a strange mass shadow. Ships approaching Goroth Prime needed drop out of hyperspace early and spend days approaching at sublight speeds; an especially fast ship could make the trip in 24 hours. Alternately, brave or foolish captains could approach the planet by hyperdrive as normal, but the shock of reverting to realspace inside the hyperbaride 'halo' would disable their ships. When leaving Goroth Prime, captains either made the long sublight trip out of the halo or jumped to hyperspace - a much more difficult navigational process than normal."}, {"tag": "h3", "text": "Geology"}, {"tag": "p", "text": "Goroth Prime was a rocky planet with a mean density 5.5 times that of water and had a small nickel-iron core. Goroth Prime was built like many other planets, but was unusual in that hyperbarides and other heavy elements like osmium and iridium were naturally found in high concentration."}, {"tag": "p", "text": "The inner core of Goroth had a temperature of around 7,500°C, 1,000°C higher than that of a similar terrestrial planet, and consisted of nickel and iron. Because of the high pressure and densities of 13, the core remained solid despite the high temperatures. Hyperbarides in the core had an estimated concentration of around 0.25%. The outer core was a semi-rigid shell with a density of 10, a thickness of around 2,000 km and, like the inner core, was made up mostly of nickel and iron."}, {"tag": "p", "text": "From a depth of 2,800 km to 100 km came the semi-solid inner mantle. It had a temperature of 1,500°C and a hyperbaride concentration of almost 0.1%. The outer mantle reached up until several kilometers under the planet's crust and had a thickness of around 100 km. Hyperbarides here had a concentration of around 0.001%, with the most common being ilinium trioxide. The planet's crust had a thickness ranging from several hundred meters to up to two kilometers."}, {"tag": "p", "text": "Goroth had a much higher tectonic activity than most other planets, because the core had a much higher temperature and the increased radioactivity in the mantle, which resulted from the breakdown of radioactive isotopes and meta-stable hyperbarides. Goroth's continental plates moved 40–80 cm a year, but sometimes could reach up to 2 meters."}, {"tag": "h3", "text": "Original climate"}, {"tag": "p", "text": "Around 10,000 BBY, when the Gorothites had reached a feudal level of civilization, the climate of Goroth was very benign: The planet's soil was fertile, food, resources and animals were abundant and there were very few predators. The shallow oceans featured a rich wildlife and had a temperature of 1 to 12°C. Among the Gorothites their world was seen as \"paradise.\""}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The first life on Goroth developed around 5 billion years before the Battle of Yavin, but sentient life emerged relatively late on a galactic scale, around 1,000,000 BBY. The first civilization emerged around 10,000 BBY."}, {"tag": "p", "text": "The native Gorothites developed similar to other civilizations, first forming hunter-gatherer bands, later developing agriculture and fishing and finally formed larger cities. Due to the abundance of natural food resources and good climate, the Gorothites developed techniques to increase the output of their fields and how to domesticate animals. When they had reached a feudal state, however, further development stopped."}, {"tag": "p", "text": "Living under benign climate conditions, the Gorothites maximized the yield of their farming and fishing and animal husbandry techniques. The present religious belief during this period saw Goroth as a \"paradise\" to which the Gorothites had earned entrance through good deeds in previous incarnations."}, {"tag": "h3", "text": "Republic era"}, {"tag": "p", "text": "Goroth's location near several nebulae made it hard to discover from outside. Around 8000 BBY, a band of Corellian pirates found the system during their escape from Galactic Republic ships. They made use of the Gorothite's gullibility and sold them their goods, often stolen loot or cheap technological products, in exchange for \"worthless\" rocks—heavy metals that were abundant on Goroth."}, {"tag": "p", "text": "The pirates' exploits of the Gorothites came to an end when an Ithorian herdship discovered Goroth too and revealed the planet's existence—as well as the deeds of the pirates to the rest of the galaxy."}, {"tag": "p", "text": "Soon after the initial contact with the Republic, Goroth became a candidate for membership. The Bureau of Acculturation oversaw the task of bringing the Gorothite civilization to galactic standard. Around five centuries after Goroth had been discovered, it joined the Republic. However, due to its poisonous environment for any non-Gorothites, the planet maintained a certain amount of autonomy."}, {"tag": "h3", "text": "Corellian-Aqualish war"}, {"tag": "p", "text": "The Trans-Nebular sector had been settled by Corellians as well as Aqualish Barralenal pilgrims, between whom a war erupted in 4000 BBY. While other planets in the sector took sides in the conflict, Goroth remained neutral, mainly due to its now profitable location: It was not too close to disputed areas, yet also close enough to serve as staging area for both sides."}, {"tag": "p", "text": "The head of the Gorothite government was Rel'Kan J'Kek. He used the planet's position to sell concessions to the warring factions, but he never favored one side. These concessions reached from mining rights for the system's gas giants to surface leaves for soldiers. J'Kek's popularity skyrocketed for these policies, and he was elected for a fifth term—unprecedented in Gorothite history. A notion to make him \"President-for-Life\" was voted down by a narrow margin. Philosophers led by J'Kek M'hoy Trinia argued that the president's actions were too risky and demanded he withdraw all concessions, but their calls fell on deaf ears."}, {"tag": "p", "text": "During the whole conflict, Goroth managed to remain neutral and unaffected by the war, although several smaller brawls and fights broke out between soldiers on leave. It was at this time that the government created the D'Jar'Min, Goroth's planetary defense force."}, {"tag": "p", "text": "However, Rel'Kan J'Kek and his government got too greedy, and buying concessions from the Gorothites became too costly for both sides. Goroth was too valuable for one side to leave, but neither side had the resources for an occupation. In the end, one side decided to launch five asteroids at Goroth to devastate the planet. The Bl'Era Har branch detected the asteroids around a day before impact, but Goroth possessed no weapons or ships to stop them. Over 16 hours the asteroids crashed into the planet, two into the oceans and three on the land, one hitting P'Dar'Ken, the capital."}, {"tag": "h3", "text": "Recovery"}, {"tag": "p", "text": "Out of five billion inhabitants, only two million survived. On a galactic scale, the system was believed to be destroyed and the planet—as well as the war—was soon forgotten."}, {"tag": "p", "text": "However, in areas were that had been the least affected by the impacts and the cataclysms that followed, some Gorothites had survived in shelters. These enclaves, called o'beki (\"havens\"), were often isolated from each other, and most technology had been lost in the Scouring, while the planet itself had been turned into a fiery, toxic wasteland."}, {"tag": "p", "text": "Nonetheless, the Gorothites were able to rebuild their society and civilization. By a thousand years after the cataclysm, the population had reached ten million and by the time of the Galactic Civil War around 500 million."}, {"tag": "h3", "text": "Imperial era"}, {"tag": "p", "text": "Around 17 BBY, the Moff of the Trans-Nebular sector had declared himself warlord, but was quickly subdued by a Star Destroyer task force. The new Moff, Nebin Cray, found a mention of Goroth and its rich metal resources in some documents and sent out the Nastion to investigate."}, {"tag": "p", "text": "The Imperial Navy rediscovered the planet and was surprised to find a functioning civilization. Also, it discovered the now unusual high concentration of hyperbarides in Goroth's crust. The Empire recognized the value of Goroth and was faced with the same choice as the warring factions millennia ago: It had not enough forces to occupy the planet, but could not go the planet unused, either. Nebin Cray made the move to invite the galaxy's mega-corporations and auction off mining rights."}, {"tag": "p", "text": "The corporations that acquired mining rights included Tagge Company, Karflo Corporation, Trigdale Metallurgy, Vaufthau Processing Industries and several smaller companies. Under Imperial Governor Marsh Limoth, they began mining the hyperbarides. Since repulsorlifts and droids did not function on Goroth due to the high radiation levels, the corporations lobbied and got permission to use the natives Gorothites as \"client workers\"—meaning slaves."}, {"tag": "p", "text": "The P'Dar'Ken remained intact, but became a puppet government under the governor and the corporations. In opposition to the enslavement, several resistance groups arose on Goroth, the moderate Gor'Jen'Ar, the militaristic T'B'Dellyi'Mai, the religious K'Len J'Bar Kasoon and the Imperial-controlled Night Wind. The Rebel Alliance long ignored Goroth and started an information-gathering mission around 0 BBY under Lieutenant Jered Pole, who posed as a gambler. Shortly after the Battle of Yavin, the Rebel Alliance saved Night Wind from destruction by Limoth in Operation: Starbird."}, {"tag": "p", "text": "The Empire classified Goroth as a strategically important planet and thus kept a large garrison to protect the world: Two Imperial-class Star Destroyers were in orbit above the planet. The Valor under Admiral Val DeGoort in equatorial orbit was permanently assigned to Goroth. The second Star Destroyer slot was rotated every two months to another ship and maintained a polar orbit. General Anderton Kloff commanded the ground forces, and several of the Valor's TIE/LN starfighters were assigned to him. Additionally, the Goroth Planetary Police maintained public security."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}