{"url": "Gorro", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Bounty hunters", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Gorro"}, {"tag": "p", "text": "Gorro was a Rodian bounty hunter and Supreme Hunter living on Rishi. He was present in the Blaster's Path cantina, instigating an unprovoked fight with an individual believed to be a \"notorious pirate\". Gorro was killed in the resulting firefight and his brother Grumm would seek to avenge his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Gorro was hired by smuggler Kai Zykken to take out a newly-arrived pirate since the bounty hunter's rate was cheaper than repaying Zyykken's alleged debt to the pirates in full. After exchanging insults and ignoring warnings to back down, Gorro and his gang of thugs were defeated. The cantina owner Kareena emerged from her hiding place behind the bar and revealed information concerning the mark on the notorious pirate's head. When the pirate left, Kareena wryly paid her respects to the fallen Gorro, hoping that his brother would not blame her for the Rodian's death."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gorro was a particularly belligerent individual who did not need any clear reasons to start a fight. He believed that defeating opponents would increase his reputation and thus elevate his fees, which made his duels more economically motivated than personal. Gorro was known to frequent cantinas on Rishi as these were good locations for searching out other ruffians to challenge, as well as provide an audience for Gorro's ego. He was often accompanied by several cronies, including an unidentified Rattataki female and large Zabrak. Gorro was not a popular patron in the eyes of local cantina owners like Kareena since his brawls tended to wreck the establishment and frighten off customers."}, {"tag": "p", "text": "Despite being known as a bully, Gorro enjoyed a fair degree of success in his profession, indicating some degree of skill with a blaster. He chose to challenge opponents who had built up infamous reputations of their own rather than weak opponents he could assuredly beat. Gorro's close bond with the Whiphid Grumm suggests the Rodian did have positive qualities, though his public demeanor and trash talking was intended to garner fear and respect."}, {"tag": "p", "text": "The Rishii Qaraah offhandedly remarked that Gorro's motivation was that he probably just wanted bragging rights for defeating the notorious pirate. Gorro claimed to be two-times Supreme Hunter of the Goa-Ato."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}