{"url": "Gorvin_snu", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Creatures of Arvala-7", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Gorvin snu"}, {"tag": "p", "text": "Gorvin snu were a species of small lizard-like creatures that inhabited the desert planet Arvala-7. Skittish quadrupeds, they could be found on the world around 9 ABY, a time in which the Mandalorian bounty hunter Din Djarin encountered them."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Gorvin snu were small, about the size of a human foot. Lizard-like beings, they had no hair, instead being covered in an orange scaly skin. Their heads featured brown eyes and a snout-like mouth, with pointed spines protruding from the back of the head and proceeding down along the abdomen. The small beings could be found within the canyons and deserts of the planet Arvala-7."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Gorvin snu were often found in groups, scampering across the sandy surface of Arvala-7. The quick-moving creatures were skittish beings, often running away when approached by other lifeforms. Despite their jittery nature, they were known to display signs of curiosity, tailing after beings they were unfamiliar with and watching them from a distance with their bobbing heads."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 9 ABY, the Mandalorian bounty hunter Din Djarin traveled through a canyon on Arvala-7, where he walked past a group of gorvin snu. Although initially startled by the mercenary, the creatures took an interest in Djarin and the small child he carried, following him through the rocky path. After noticing a gang of Trandoshan hunters preparing to ambush the Mandalorian, however, the group quickly scurried away."}, {"tag": "p", "text": "Sometime later, the Ugnaught moisture farmer Kuiil began repairing the IG-series assassin droid IG-11, a droid destroyed by Djarin during his time on the planet. While Kuiil attempted to reteach IG-11 his fine motor skills, a small group of gorvin snu sat nearby at his farm. As the rebuilt droid attempted to move a crate on the farm to another location, he unceremoniously dropped the box on top of one of these creatures, crushing it. This elicited a shocked expression out of the Ugnaught, who chastised IG-11 for his killing of the animal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gorvin snu first appeared in \"Chapter 2: The Child,\" an episode of first season of Jon Favreau's television series The Mandalorian. The episode was directed by Rick Famuyiwa and aired on Disney+ on November 15, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}