{"url": "Gos_Hutta_system", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bootana Hutta star systems"], "nodes": [{"tag": "h1", "text": "Gos Hutta system"}, {"tag": "p", "text": "The Gos Hutta system, also called Gos Hutta, was a Hutt Space star system that lay within the Bootana Hutta area. The system contained three planets and several space stations, and it served as a gateway to the Bootana Hutta, being frequently patrolled by warships of the Hutt species. The system was used at some point by Hutt clan leaders to meet privileged foreigners."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Gos Hutta system, also referred to as Gos Hutta, was a star system that was located within the Bootana Hutta area of the Hutt Space and the Slice regions. Gos Hutta lay on a hyperlane called the Pabol Hutta that connected it to the Mulatan and Varl systems. A series of smaller hyperspace routes linked the system to the worlds of Kor Desilijic, Kor Oktanivii, and Kor Usilic. The Gos Hutta system contained three lush planets and multiple orbiting space stations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Similarly to the world of Mulatan, the Gos Hutta system served as a gateway to the Bootana Hutta, with warships of the Hutt species being commonly sighted there, including regular patrols by the fleet of Troonol, a commander of the Hutt Qunaalac clan. Anyone wishing to enter the Bootana Hutta had to traverse the system first, and the warships patrolling the system persuaded travelers passing through from lingering too long. At some point in Gos Hutta's past, the leaders of Hutt kajidic clans would summon especially powerful or favored foreigners there, meeting them on the space stations in-system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gos Hutta system was first mentioned in the 2009 reference book The Essential Atlas, which was co-authored by Jason Fry and Daniel Wallace, and placed the system in grid square S-11."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}