{"url": "Gossam/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Colonies species", "Category:Enslaved species", "Category:Gossam", "Category:Oviparous species", "Category:Reptilian sentient species", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Gossam"}, {"tag": "p", "text": "Gossams were a small saurian species native to the planet Castell in the Colonies region of the galaxy, with colonies on the Outer Rim worlds of Felucia and Saleucami. Averaging slightly over one meter in height, Gossams had wrinkled skin, with narrowing, shriveled heads on elongated necks. Physical appearance was considered important in Gossam society, and females often curved their hair up from the back of their heads. They were bipeds, balancing their frail bodies on small feet, and had long three-fingered hands. The average lifespan of a Gossam was about seventy-five years."}, {"tag": "p", "text": "Known for their shrewd and cunning nature, most Gossam on Castell served the Commerce Guild, which was headed by the Gossam Shu Mai during the Separatist Crisis and the Clone Wars. Due to their intelligent and scheming nature, Gossams could be found all over the galaxy, acting as either legitimate merchants or as law-breaking pirates and smugglers, while Force-using Gossam were extremely rare."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Gossam stood roughly 1.25 meters high, had pebbly green or blue skin, elongated necks, wide yellow eyes and a tapered head that sloped back on an incline. Gossam balanced their thin bodies on two three-toed feet, and had long, graceful three fingered hands."}, {"tag": "p", "text": "Gossams developed at a reasonably standard rate. Considered younglings until around the age of ten, society regarded them as full adults by the age of fourteen. Gossam reaching around sixty standard years were considered old, while those living past the age of seventy-five were considered venerable."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Like most reptiles, Gossam young were hatched from eggs. Gossam mothers watched over the eggs more for the status than for any practical purpose. Because the species was so appearance driven, Gossam families would build nests of elegant warm fabrics and cushions to show off their young before they were even hatched. They would also throw egg parties where the eager parents would receive gifts from their friends and relatives. The higher the status of the parents, the larger the gifts. The parties were thrown late in the eggs' incubation period in the hope that the egg would hatch during the event."}, {"tag": "p", "text": "Gossams held their appearances as extremely important, and dressed in elaborate clothing in an attempt to impress other sentients. Females used oil-based creams to mold their hair into a wave that traditionally swept up from the back of their heads. Wealthy Gossam aristocrats and trade negotiators often wore elevated footwear to appear taller when dealing with other species, in addition to the exotic robes and finery favored by most Gossam."}, {"tag": "p", "text": "Most Gossam were selfish, scheming beings skilled at the art of business. Though most Gossam were intelligent and independently minded, many spent much of their lives working for the Commerce Guild, who offered them food, housing and a decent income for a ten year exclusive contract. Gossam goods were generally cheap to manufacture, and overpriced. Always looking for an angle they can play to come out on top, Gossam were considered untrustworthy by other beings."}, {"tag": "p", "text": "The Gossam had a military in the form of Gossam Commandos, a group of male Gossam soldiers who wore heavy armor and used heavy repeating blasters. They also used a heavy shoulder-mounted cannon that took two Gossams to operate—one to fire and one to reload. Commerce Guild Presidente Shu Mai personally authorized their use in the Outer Rim Sieges during the Clone Wars."}, {"tag": "p", "text": "Gossam spoke a language of the same name. It consisted of lispy vocalizations, croaks and trills. Written Gossam had a jagged alphabet that combined into short words and long sentences. Due to their industrial relationships with many offworld companies, most Gossam also spoke Galactic Basic."}, {"tag": "p", "text": "Gossam names were usually quite short—both first names and surnames usually only had three or four letters. Common Gossam names were Min Cho, Xiri Gan, Zim Li, Shan Sien, and Mei Tran."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Circa 27,000 BBY, the Gossam experimented and developed the tumble hyperdrive which allowed them to colonize several distant worlds including Felucia . Due to the aggressive plants and animals on that world, colonization was limited and the planet was used as a resort for wealthy Gossam and their servants."}, {"tag": "p", "text": "For ten years before the Invasion of Naboo, the Gossam homeworld of Castell suffered a devastating economic depression due to the heavy taxation of trade routes. This resulted in a loss of profits and little demand for goods from Castell. Many Gossam resorted to fighting over food, jobs and passage offworld, until the Commerce Guild appointed Shu Mai as its president. Mai almost single-handedly helped Castell out of this depression due to her aggressive business practices, her support of the Gossam workforce, and her taciturn negotiation tactics. Mai had each able Gossam serve as an indentured servant of the Commerce Guild for a portion of their lives. In return, they were offered food, housing and a modest income. Most Gossam saw this as the dreary reality. Once Castell grew out of its economic depression, this tradition continued, with most young Gossams taking indentured contracts to gain business experience before venturing out into the corporate world alone. Many Gossam made large profits by investing their credits in offworld bank accounts, not trusting their own people. Still others built offworld estates on Saleucami and Felucia, thus starting Gossam colonies on those Outer Rim worlds."}, {"tag": "p", "text": "Just before the outbreak of the Clone Wars, Shu Mai secretly pledged her support to the Confederacy of Independent Systems, despite realizing that it would amount to treason. Her reasons were simple—she couldn't resist a potentially profitable venture. The Commerce Guild pledged massive amounts of DSD1 dwarf spider droids, as well as the Gossam Commandos. The Gossam as a species did not pledge their support to the CIS, but as they were considered the property of the Commerce Guild, they were expected to help the war effort whenever possible. Due to this, during the Clone Wars, Gossam were banished from Coruscant. Amita Fonti, a Gossam senator, attended a convening of the Separatist Parliament on the planet Raxus, where she supported a motion to open peace negotiations with the Republic."}, {"tag": "p", "text": "In the months after the Clone Wars, many Gossam on Coruscant joined Whiplash, a resistance movement working against the Galactic Empire. The Gossam were ultimately enslaved by the Galactic Empire, and very few were able to join the Alliance to Restore the Republic after its formation. Due to their former alliance with the CIS, the Gossam and their planet were a primary target of Palpatine's reign of terror against non-Human species. Not until after the Alliance's victory did they receive their freedom; however, Castell still had not fully recovered as of the end of the Yuuzhan Vong War."}, {"tag": "p", "text": "After the Yuuzhan Vong War, several Gossam worked for the Galactic Federation of Free Alliances. It was unclear whether the Gossam joined the Confederation after the Corporate Sector Authority allied itself with the Confederation. However, this was unlikely because several were seen working for the Galactic Federation of Free Alliances with a supply company."}, {"tag": "h2", "text": "Gossam in the galaxy"}, {"tag": "p", "text": "Many Gossam established offworld estates for recreational purposes, on planets like Felucia and Saleucami. Gossam were well known as some of the shrewdest business people in the known galaxy. Their products were nearly always inexpensive to manufacture in mass, and extremely overpriced. Gossam were excellent barterers, although their self-centered and greedy nature often led them to cheating and lying to amass as many credits as possible. A Gossam's word was rarely valued, both by Gossam and those with whom they were doing business. Some members of the species were legitimate merchants—although most were quite the opposite."}, {"tag": "p", "text": "Large numbers of Gossam were involved with piracy and smuggling operations. Due to their size and calm demeanor, Gossam were frequently underestimated—a perception they were happy to exploit. Most freighter captains paid little heed to reports of Gossam piracy- until blaster--wielding Gossam raided their ships. However, Gossam rarely rose to positions of power, with Shu Mai being one of very few exceptions. This was largely due to the fact that their innate independence and lust for profits seems to prohibit the long-term planning needed to achieve real influence."}, {"tag": "p", "text": "Force-sensitive Gossam were extremely rare, though at least one Gossam was initiated in the Jedi Order as part of the Soaring Hawkbat Clan studying at a training facility on Bogden 3 at the end of the Clone Wars in 19 BBY. Those Gossam who were not pirates or merchants often worked as tech-specialists. One group of Gossam worked as bussers at the Corusca Gem casino on Coruscant during the New Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gossam species were created for Star Wars: Episode II Attack of the Clones, and first appeared in The Approaching Storm, by Alan Dean Foster. In both Attack of the Clones and Star Wars: Episode III Revenge of the Sith, Shu Mai and the other Gossam characters are entirely computer-generated. The history and culture of the species has since been expanded upon by numerous sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}