{"url": "Gowski", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Bounty hunters", "Category:Gamorreans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gowski"}, {"tag": "p", "text": "Gowski was a male Gamorrean bounty hunter who worked with the Ithorian hunter Fissol. During the reign of the Galactic Empire, the pair learned of a Jedi on the planet Lothal from a Duros bounty hunter and traveled there in order to claim the bounty on the Jedi. Gowski and Fissol managed to locate and capture the Force-sensitive boy Ezra Bridger, however, they were then defeated by his Master Kanan Jarrus. Jarrus mind tricked the pair to make them believe they had been misled and sent them to settle the score with the Duros, who they now believed had tricked them."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Gamorrean Gowski worked as a bounty hunter during the reign of the Galactic Empire. Around five years before the Battle of Yavin, he and a Ithorian bounty hunter named Fissol scared a Duros bounty hunter into revealing that he knew of a Jedi on the Outer Rim planet Lothal. The Duros had hoped to claim the bounty himself, as the price on Jedis' heads was incredibly high, but claimed he would let the two other hunters take it."}, {"tag": "p", "text": "The pair agreed to go after the Jedi and traveled to Lothal, where they met with a local contact who worked with Fissol and learned the location of the Force-sensitive street urchin Ezra Bridger. Gowski then knocked out the contact and the two bounty hunters traveled to a cave where Bridger was trying to train himself to better use the Force. They at first observed him from a nearby ridge before confronting Bridger in the cave while the target was practicing jumping with the Force. Using Gowski's jetpack they then pursued the boy when he tried to escape, with Fissol following him through a crack in the wall that Gowski could not fit through. Fissol became stuck trying to fit his weapon through, but the Gamorrean circled round and caught Bridger by surprise, knocking him out with an electric shock."}, {"tag": "p", "text": "Having subdued their quarry, the pair made to leave with Gowski carrying Bridger. Before they could exit the cave however, they were confronted by Bridger's Master Kanan Jarrus who beat both of them using his fists. Jarrus then placed the pair in stuncuffs and used a Jedi mind trick to make them both believed they have been tricked by the Duros and that they should go and settle the score. The pair then left Lothal in a YV-666 light freighter and found the Duros so they could took vengeance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gowski first appeared in \"Eyes on the Prize,\" a comic strip published in the sixth issue of the Star Wars Rebels Magazine, which was released in 2015. The comic was written by Jeremy Barlow and illustrated by Bob Molesworth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}