{"url": "Gozanti-class_Assault_Carrier", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Carrier classes", "Category:Galactic Empire starship classes", "Category:Gozanti-class cruisers"], "nodes": [{"tag": "h1", "text": "Gozanti-class Assault Carrier"}, {"tag": "p", "text": "The Gozanti-class Assault Carrier, also known simply as the Imperial assault carrier, was a variant of the Imperial Gozanti-class cruiser used by the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Gozanti-class Assault Carrier, also informally known as the Imperial assault carrier, was a sub-variant of the Imperial Gozanti-class cruiser, itself a modified version of the civilian Gozanti-class armed transport. The Gozanti-class Assault Carrier was upgraded with a reinforced hull and more powerful repulsorlift engines that allowed its four ventral magnetic docking claws to carry a cargo of four All Terrain Defense Pods, two All Terrain Armored Transports, or four All Terrain Scout Transports, or carry four TIE line craft, similar to the standard Imperial Gozanti-class cruiser."}, {"tag": "p", "text": "The Gozanti-class Assault Carrier was armed with two twin laser cannon turrets, both located in the rear dorsal and ventral parts of the ship. It had three engines and a dorsal rectenna."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early Rebellion"}, {"tag": "p", "text": "The Gozanti-class Assault Carrier was introduced by the Galactic Empire by the time of the early rebellion against the Galactic Empire. The Spectres, a group of insurgents headquartered on the planet Lothal stole illegal T-7 ion disruptor rifles to prevent the Empire from getting control of them. After a skirmish on Garel, the Spectres rendezvoused with the criminal and arms smuggler Cikatro Vizago to sell the weapons. Unknown to the group, however, Imperial Security Bureau Agent Alexsandr Kallus became aware of the exchange and used a Gozanti-class Assault Carrier to deploy four AT-DP walkers, then deploying from the ship himself with a squad of stormtroopers. After the carrier deployed the Imperial forces, it proceeded to leave the area. Eventually, Imperial forces were pushed back and defeated."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Lothal Skirmish"}, {"tag": "p", "text": "Shortly after the Battle of Garel during the early Galactic Civil War, a senatorial convoy of the Alderaanian fleet arrived on Lothal, with three Sphyrna-class Hammerhead corvettes being ordered to land in the city of Jalath for inspection. There, Imperial Lieutenant Yogar Lyste arrived with stormtrooper forces with gravity locks to secure the ships, while a Gozanti-class Assault Carrier deployed two AT-AT walkers, including AT-AT 36, to provide perimeter security and prevent rebel forces from stealing the trio of corvettes, as Alderaanian ships were infamous for being stolen by rebel forces. Eventually, rebel forces managed to defeat the Imperials, and successfully stole all three ships."}, {"tag": "h4", "text": "Battle of Hoth"}, {"tag": "p", "text": "In 3 ABY, at the Battle of Hoth, Imperial General Maximilian Veers used several Gozanti-class Assault Carriers to deploy the walkers of Blizzard Force instead of Y-85 Titan dropships, as he was wary that enemy starfighters would swarm the dropships before they had a chance to reach their landing zone."}, {"tag": "p", "text": "The carriers were initially spotted by Rebel trooper and Twilight Company member Roja, who was posted at Echo Base's Perimeter Outpost Delta. His squadmate Beak identified the Gozanti-class Assault Carriers and deduced that they were bringing walkers to deploy on the surface of Hoth. First Sergeant Hazram Namir ordered Beak to report their presence as a result."}, {"tag": "h4", "text": "Skirmish on Vardos"}, {"tag": "p", "text": "After the death of Emperor Palpatine at the climactic Battle of Endor in 4 ABY and the launch of his final command, Operation: Cinder, Imperial forces led by ISB Admiral Garrick Versio and Moff Raythe initiated the operation on the loyal Imperial world of Vardos. The operation called for the destruction of Imperial worlds, in a self-destructive scheme to tear down the remnants of the Empire, as Palpatine believed it did not deserve to outlive him. Early on, as the operation's climate disruption arrays began altering the climate and creating catastrophic storms, Gozanti-class Assault Carriers were present in the capital city of Kestro, with one deploying an AT-AT near the Archive. An ensuing skirmish erupted when two members of the Imperial Special Forces Inferno Squad defected and hijacked the AT-AT in a bid to help evacuate civilians."}, {"tag": "h4", "text": "Battle of Theed"}, {"tag": "p", "text": "In accordance with Operation: Cinder, Captain Lerr Duvat from the Imperial II-class Star Destroyer Torment deployed the climate disruption arrays above Emperor Palpatine's homeworld of Naboo. The Battle of Theed began when members of the Naboo Royal Space Fighter Corps and the Rebel Alliance engaged the Torment in orbit and destroyed the arrays. After a naval engagement resulted in the destruction of the Torment, several landing forces launched from the Star Destroyer and headed towards the capital city Theed. The Imperial contingent included at least two Gozanti-class Assault Carriers that deployed AT-ATs in the center of the city. With fierce fighting occuring in the streets and starfighter combat above the city, the AT-ATs advanced towards the Theed Royal Palace in an effort to defeat the Alliance forces. An ion burst from the palace, however, thwarted Imperial efforts as it disabled all of their equipment and forced an Imperial surrender."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "Around 9 ABY, with the help of Din Djarin, Bo-Katan Kryze, Axe Woves, and Koska Reeves infiltrated an Imperial Gozanti-class cruiser transporting weapons. Intending to capture a weapons shipment, the warriors secured the cargo before taking the bridge and hijacking the ship. Djarin would depart their company after their successful mission."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}