{"url": "Gozanti-class_cruiser", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Cruiser classes", "Category:Gozanti-class cruisers"], "nodes": [{"tag": "h1", "text": "Gozanti-class cruiser"}, {"tag": "p", "text": "The Gozanti-class cruiser, also known as the Gozanti-class armed transport, was a class of armored starship used by various factions, and as such had many modified sub-variants, including the Black Sun frigate, the Imperial Gozanti-class cruiser, the C-ROC Gozanti-class light cruiser, the IGV-55 surveillance vessel, and the Gozanti-class Assault Carrier. During the First Order/Resistance War, the Gozanti Armed Transport shared a similar name."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Gozanti-class cruiser was a starship that could act as a freighter and cruiser. It could be modified to accommodate a twin laser turret in a dorsal mount and a heavy laser cannon on its ventral side. The Gozanti also had a loading elevator on the bottom near the nose and docking ports to the side near the cockpit section. The ships had a hyperdrive and three engines."}, {"tag": "p", "text": "Over the years, there were numerous variants of Gozanti-class cruisers produced. Several variations used by the Galactic Empire included the Imperial Gozanti-class cruiser, Gozanti-class Assault Carrier, and the IGV-55 surveillance vessel. The C-ROC Gozanti-class light cruiser was a modified version that was designed to hold more cargo space. It was commonly used by criminal organizations. The Separatist Gozanti-class cruiser was a modified Gozanti used by the Separatist Alliance for their own purposes. The Black Sun cartel used Black Sun frigate, a modified Gozanti for their criminal activities."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Twilight of the Republic"}, {"tag": "p", "text": "Gozanti-class cruisers were introduced by the Corellian Engineering Corporation around 34 BBY, and they proved to be one of the major starship success stories of the late Republic Era."}, {"tag": "p", "text": "Shortly before Anakin Skywalker won the Boonta Eve Classic, a Gozanti-class cruiser with red markings was seen in the spaceport of Mos Espa on Tatooine."}, {"tag": "p", "text": "At some point prior to the Clone Wars, a Gozanti-class cruiser crashed into the canyons on the planet Balnab. The surviving crew were pit droids that used the ship to create a large hologram of Albee Dewaw. They used the hologram to rule over the Balnab denizens near the crashed cruiser."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, the cruiser was adopted by various factions, including the Confederacy of Independent Systems. At least three were in the fleet led by the super tactical droid Aut-O. One cruiser was on Zygerria as Dooku arrived to discuss the execution of Anakin Skywalker with Miraj Scintel."}, {"tag": "p", "text": "After the Battle of Patitite Pattuna, C-3PO and R2-D2 arrived on the planet Balnab and discovered that the Balnab denizens were being ruled by pit droids using the control room of a Gozanti-class cruiser. R2-D2 showed this to them, so they destroyed the control room, which caused the cruiser to explode."}, {"tag": "p", "text": "The Black Sun crime syndicate also used modified Gozanti-class cruisers. They were forced into joining Darth Maul's Shadow Collective and took part in the takeover of Mandalore. Several joined with Maul's forces after the battle of Zanbar. These ships were painted black with gold highlights, including a stylized rim of a star placed over the cruiser's front, taken from the syndicate's emblem."}, {"tag": "p", "text": "While using a malfunctioning Joben T-85 speeder bike, former Jedi Padawan Ahsoka Tano nearly collided with a Gozanti in an underworld portal, but she regained control of the speeder in time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gozanti-class cruiser first appeared in Star Wars: Episode I The Phantom Menace. It was later added to Star Wars: The Clone Wars TV series to add more ship models.[source?]"}, {"tag": "p", "text": "The young readers book Star Wars Rebels: Head to Head, written by Pablo Hidalgo and featuring various match-ups from the series, placed an Imperial Gozanti cruiser against an Auzituck anti-slaver gunship, with the gunship damaging the cruiser and escaping."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}