{"url": "Gozzo", "categories": ["Category:Canon articles", "Category:Avian and airborne sentient species", "Category:Gozzo"], "nodes": [{"tag": "h1", "text": "Gozzo"}, {"tag": "p", "text": "The Gozzo were a sentient species that were native to the planet Drahgor III which was located in the galaxy. Han Solo negotiated with a group of Gozzo living on Troiken during the Galactic Civil War. Flix, Flanx, and Floog were also members of this species."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "The Gozzo were bird-like sentients characterized by their rotund bodies covered in white feathers. Their thin arms and long legs were bare, revealing the yellow skin beneath. Each hand had four long fingers capped with sharp nails. Two fleshy antennae sprouted from the tops of their heads, and they had a small beaked mouth with two red wattles hanging from either side. They were capable of speaking Galactic Basic Standard and a non-Basic language."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A Gozzo was part of the group of war refugees sheltered on the planet Retta by the Segredo Kreeda during the Clone Wars. They were discovered by Jedi Yoda and Anakin Skywalker, who tricked General Flebek's forces into aborting their mission on the world."}, {"tag": "p", "text": "A community of Gozzo lived in the forests of Troiken as of the Galactic Civil War. Han Solo encountered the group after dropping a number of Rebel supply crates into the forest to evade Imperial forces. He later returned to recover the crates, but several Gozzo held him and Chewbacca up with stolen blasters, demanding payment for their discovery. Han reluctantly agreed to hand over his reward money from the rescue of Leia Organa, and retrieved his vital supplies."}, {"tag": "p", "text": "Flix, a Gozzo resident of the Colossus platform, was a member of a flock from Drahgor III that ran a fuel refinery."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A Gozzo first appeared in the Star Wars Resistance episode \"The Recruit.\" The species was designed for the series, and was based on concept sketches of an Ewok by Ralph McQuarrie during the making of Star Wars: Episode VI Return of the Jedi. The more bird-like designs inspired the Gozzo, while others were used as the basis for the Yuzzum species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}