{"url": "Graador", "categories": ["Category:Legends articles", "Category:Graador sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Graador"}, {"tag": "p", "text": "Graador was a Mid Rim planet that featured caverns large enough to fit entire fleets of starships in them. The caverns were home to both immense exogorths and mynocks that could survive in the planet's atmosphere. Graador was also inhabited by two sentient species, the agrarian Graadorians and a mutated type of intelligent mynocks."}, {"tag": "p", "text": "During the Galactic Civil War, a group of Rebel Alliance agents surveyed Graador's caverns, which they initially deemed a suitable location for a new Rebel base and the Alliance Fleet. However, after making contact with the local exogorths and sentient mynocks who intended to feed on the Rebels' starships and power generators, respectively, the agents were forced to evade members of both species until the fleet could be warned of the threat posed to it by Graador's inhabitants."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Graador was a remote terrestrial planet located in the Graador system, a part of the Mid Rim's Graador sector. It featured several immense caverns inside which multiple fleets of starships could easily fit."}, {"tag": "p", "text": "The caverns of Graador were home to a large population of a variant of the mynock—a species of ergovorous creature that, although presumed to have originated from the Outer Rim Territories planet Ord Mynock, usually inhabited the vacuum of outer space and for whom planetary atmospheres frequently were lethal. The Graador type of mynocks, however, could tolerate the world's air, and they shared their habitat with colossal exogorths, which were also typically well-adapted for the rigors of living in space."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, a group of Rebel Alliance agents were tasked with finding a suitable location for a new main Alliance base in the wake of the evacuation of the facility on the Outer Rim Territories moon Yavin 4. Following several unsuccessful attempts, the Rebel General Airen Cracken dispatched the team to Graador."}, {"tag": "p", "text": "There, the Rebels deemed that the planet's caves could be adapted for use both by Rebel personnel and the entire Alliance fleet. The team also discovered the native population of non-sentient mynocks but considered them to be merely a minor nuisance. The creatures did, however, consume the agents' transceiver equipment after they had contacted Cracken to tell him that the Rebel fleet could be brought to Graador."}, {"tag": "p", "text": "The group of Rebels subsequently came into contact with both the planet's exogorths and the group of mutated, intelligent mynocks that controlled them, discovering that the latter intended to feed on the Rebels' power generators while letting their enthralled exogorths consume the Alliance starships. When the Rebel agents killed several of the mutant mynocks, the exogorths went on a rampage, and the team was forced to evade both them and the rest of the mynocks until the agents' communications array could be repaired and used to warn the Alliance fleet of the trap that awaited it at Graador."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Overall, Graador offered little beyond basic sustenance to living beings on it, which included the agrarian Graadorians. Other natives of Graador included a type of mynocks that had mutated and evolved sentience. The intelligent mynocks possessed the means to control the exogorths that lived on Graador."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Graador was introduced in the 2009 sourcebook Rebellion Era Campaign Guide, which was published by Wizards of the Coast for use with the Star Wars Roleplaying Game. In the book, the planet serves as the setting for a roleplaying game adventure hook that this article assumes plays out as described. The StarWars.com Online Companion to the 2009 reference book The Essential Atlas placed the Graador system, and therefore the planet Graador, in grid square I-17."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}