{"url": "Grael", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance to Restore the Republic members", "Category:Ewoks", "Category:Force-sensitives", "Category:Hunters", "Category:Males", "Category:Musicians", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Grael"}, {"tag": "p", "text": "A Force-sensitive Ewok, Grael was a warrior, a master hunter, an exceptional musician, and an agent of the New Republic. A native of Tribe Panshee village on the Forest Moon of Endor, he was named after an Ewok deity, and was a devout follower of the way of the Tree Spirits. He was a skilled hunter, often leading expeditions or hunting solo with great success. Although he did not know it, the Force guided him while hunting, letting him know his prey's location."}, {"tag": "p", "text": "In 4 ABY, he encountered Rebel Captain Junas Turner by chance while hunting, and the two were captured by Imperial stormtroopers. They were transported to the prison facility at Balis-Baurgh, where Grael slowly learned Basic from Turner and several of his Rebel allies. Eventually, Grael realized he was able to use his flute to command the droids who maintained the prison, and he had them free himself and Turner, though he could not rescue the other Rebels. They commandeered a starship and traveled to Sullust, hoping to warn the Rebel fleet of the second Death Star. By the time they arrived, however, the Rebels had already engaged the Death Star at Endor, and destroyed it. Grael returned home to his family, before partaking in many Rebel and New Republic missions with Turner."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Force and the Tree Spirits"}, {"tag": "p", "text": "Grael was an Ewok native to the Forest Moon of Endor during the reign of the Galactic Empire. His name was common among Ewoks, as Grael was a deity in Ewok mythology, believed to be the wind that carried the scent of smoke to Ewoks, warning them of fires on their native moon. Grael the Ewok was a member of Tribe Panshee, and lived in Tribe Panshee village, built high on the trees for protection from the predators who stalked the surface. A revered warrior, he led many tribal hunts into the depths of the Endor forest, clashing with fierce creatures; he was usually successful, and those under his command rarely lost their lives during his regular expeditions. Before long, he had fashioned himself a personal spear and became one of the leading males of his tribe; he married, and fathered a child named Ponto."}, {"tag": "p", "text": "Grael often went on solo hunts for days at a time, despite the fact that few Ewoks survived such expeditions. He thought his abilities as tantamount to those of at least five Panshee warriors; unlike most of his comrades, he was possessed of cunning and intelligence uncharacteristic of the simple Ewoks. However, these were not his only talents: he was blessed with a latent Force-sensitivity, which allowed him to view glimpses of the future and to locate his prey with ease. He knew nothing of the Force, and believed that it was the Tree Spirits of Ewok lore who guided him. Thus, he was devoutly religious, attending all ceremonies and rituals conducted by Shaman Rakra and his comrades and staying strict to the path of the Tree Spirits. He was also a talented musician, often performing after a successful hunt. He carried with him a flute everywhere he went. Despite his standing among his peers and clan, Grael had never met a member of another sentient species well into his adult years, and remained completely unaware of the greater galaxy."}, {"tag": "h3", "text": "Chance encounter"}, {"tag": "p", "text": "Around 4 ABY, Grael went on a solo hunt, hoping to capture a Yootak, one of Endor's most deadly predators, to bring back to his village. After two days of traveling, he picked up the scent of a Yootak and pursued it for a time. When that was unsuccessful, he opted to set a trap for the predator, catching a gunlabird, one of the Yootak's favored prey, and tethering it to a snare trap located in the center of a small clearing. Grael hid in a nearby bush and waited for his prey to arrive. He eventually sensed the creature approaching through the Force, but it was cautious, slow, and he suspected that it had detected the trap. Before it came into his line of sight, however, another creature arrived at the clearing from the opposite side: twice the height of the Ewok, it was smooth-skinned, and holding a small black stick. It was Captain Junas Turner, a Human, and he was holding a blaster, though Grael had never witnessed Humans or blasters before, and was unaware of the capability of either."}, {"tag": "p", "text": "The Yootak arrived moments later, attacking Turner; Grael, hoping to take advantage of the creature's distraction, charged at it with his spear, though the powerful Yootak sent Turner sprawling toward him. In an effort to avoid colliding with the Human, Grael inadvertently snared himself in his own trap. He and his prey clashed, but Turner killed the Yootak by firing his blaster at its chest. Unfamiliar with such advanced technology, Grael assumed it had been his weapon to deal the killing blow. He cut himself free, and he and Turner attempted to communicate, though they only got as far as telling each other their names—Grael spoke only Ewokese, and Turner Basic. Grael's thoughts started to wander toward killing Turner and eating him, though he decided that a \"talking animal\" may have been an omen sent by the Ewok deities, and he chose to bring him to Shaman Rakra at the village for examination. If he wasn't an omen, Grael figured, then at least the village could see what he tasted like."}, {"tag": "p", "text": "With little effort, he persuaded Turner to follow him toward Tribe Panshee village, offering him water and rations along the way. They journeyed till dusk; Grael slept in his hammock high up on tree branches, while Turner—who was afraid of heights—opted to sleep in his tent. They continued on their journey in the morning, though things soon went awry: the duo were ambushed by what Grael perceived as shiny, white talking creatures, who were in actual fact Imperial stormtroopers. Turner surrendered his weapon, and the Imperials bound the two travelers and took them to their camp. Grael was shocked by the lack of trees and vegetation in the area, before realizing that the trees had been cut down by \"black creatures with long arms\"—huge machines that tore down the trees en masse. It appalled him that they were cutting down trees without having first performed the compulsory Ritual of the Children, though his attempts to break his bonds failed."}, {"tag": "h3", "text": "Imprisonment"}, {"tag": "p", "text": "Grael and Turner were placed on a starship—which the Ewok warrior erroneously believed to be a flying hut—and transported to a prison facility in the Balis-Baurgh system. There, he was introduced to a golden protocol droid, which was fluent in Ewokese. Grael told the droid who he was, trying to explain that his capture was all a mix-up, and asked the droid if it would sort it out. The protocol droid informed him that he was an enemy of Tribe Empire, and that he was being imprisoned; if he performed as requested, injury would not be inflicted upon him. He was separated from Turner and escorted to his cell. From there, he was able to look through a grated window into a large chamber beyond, where a 4xB Programmer Droid was issuing instructions to L2 Base Labor Droids and K5 Enforcer Droids. Grael watched with interest as the Programmer Droid used short musical tunes to instruct the others, before eventually succumbing to his fatigue and drifting asleep in his cell."}, {"tag": "p", "text": "He was given breakfast in the morning, though the fetid bread he was given did little to sustain his appetite. He noticed one of the Labor Droids bring a large chunk of meat to another cell with dismay, yearning to have some proper food for himself. Later in the day, an Enforcer Droid took him to the exercise chamber, where he saw a multitude of alien species, none of which he had seen before. Grael spotted Turner across the chamber, and waved to him; in doing so, however, he inadvertently made contact with a large creature's tentaclepit, which caused a brawl between the creature and another, tusked being. Grael took the chance to sneak over to Turner, who was with two other Humans, Becker and Lon. Turner welcomed Grael and allowed him to listen in on their conversations in an attempt to pick up Basic when he was not completing tasks assigned to him by the droids."}, {"tag": "p", "text": "Grael's routine continued for many days, until he could communicate with his Human friends in reasonable Basic. Turner explained to him that the three of them were members of Tribe Rebellion, who opposed Tribe Empire and attempted to stop them committing what they saw as heinous crimes. He also informed Grael that he had discovered that the Empire was constructing the second Death Star on Endor, and wished to return to the Rebel fleet at Sullust to warn them. Grael sympathized with the Rebellion, and hoped that he could persuade his tribe to help in the struggle against the Empire."}, {"tag": "h3", "text": "Escape from Balis-Baurgh"}, {"tag": "p", "text": "Though he had been stripped of his weapons, Grael still had possession of his flute, and over time he began to mimic the tunes used by the Programmer Droid to assign tasks to the other droids. When he was confident he had replicated the tune to command the droids to bring the meat to the one cell who was allowed it, he attempted to get the droid to bring the meat to him, though his initial attempt failed. He tried again, though, in the morning, on the way to the exercise chamber, ambushing the droid in the corridor. The droid did not react, and he believed that he'd outsmarted it; halfway through his meal, however, one of the security droids aimed a blaster at him. He offered his food to the droid, though it refused and stated that he was out of bounds; the appropriate punishment was execution."}, {"tag": "p", "text": "Fortunately for Grael, he managed to play the right tune just in time, deactivating the droid. From his cell, Turner saw an astromech droid enter the chamber, and realized that a ship must have docked with the prison complex. Grael was able to release Turner by ordering the droid to open the door to his cell with his flute, though he did not know the right tunes for Becker and Lon's cells. Turner, realizing there would not be time to learn the correct notes, opted to try to escape and to return to Balis-Baurgh at a later time, with help from the Rebellion. They made their way toward the ship, but were pursued by security droids and stormtroopers. Grael eventually used his flute to order the droid pilot to lift off, and they escaped, bound for the Rebel fleet at Sullust."}, {"tag": "p", "text": "They arrived at Sullust to find the Rebel fleet missing; they tracked it to Endor, where a great battle had just ended, with the Alliance victorious against the Empire, with the help of the Ewoks. Grael and Turner participated in the celebrations that followed, before the Ewok warrior returned to his village to tell his family and tribe of his exploits. He told Ponto his story many, many times, though they eventually had to part ways. Turner and Grael organized a commando mission to Balis-Baurgh to rescue the remaining Rebels. They were successful, and Grael continued to serve the New Republic with Turner many times. He did not forget his family, though, and often returned home to tell his son his tale yet another time."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Grael was a talented and respected hunter, known for his guile and intelligence. He was able to deal with creatures far larger than himself without serious harm, and he considered his abilities to be equal to or better than that of five lesser Ewok warriors. Like many Ewoks, he was also very curious and inquisitive, as well as religious: he attributed all good luck that came his way to have been sent by the Ewok gods, and thought that the Humans he encountered in the forest were omens. He cared deeply about his family, both his son and his wife, and felt bad when leaving them, though his primary concern was his stomach. His first impulse when he encountered Junas Turner was to see how he tasted, and he later risked his life on Balis-Baurgh for a thick slice of juicy meat."}, {"tag": "p", "text": "Living in such a primitive and isolated society, Grael had virtually no knowledge about the outside universe, and he believed things such as blasters and droids to all be part of nature. However, he was a fast learner, picking up Basic and the droid melodies in just a few days. He was also naïve, believing that his capture might have simply been a mistake. Grael was mildly Force-sensitive, and could sense other life forms often before he could see them. However, his abilities were untrained and unfocused, and no one fully understood them—least of all Grael himself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Grael was created by Paul Balsamo, appearing in the short story Escape from Balis-Baurgh, which was published in the Star Wars Adventure Journal 1 and later online at StarWars.com's Hyperspace section. The story is lighthearted, written from the point of view of Grael, an Ewok who had never encountered advanced technology or other sentient species in his life. Wizards of the Coast's Galactic Campaign Guide later established that \"Grael\" is an Ewok deity and a common name for the species, and the character was briefly mentioned in the Balis-Baurgh system's entry in The Complete Star Wars Encyclopedia, though did not receive an entry of his own."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}