{"url": "Alliance_Elite_Guard", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic military units"], "nodes": [{"tag": "h1", "text": "Alliance Elite Guard"}, {"tag": "p", "text": "The Alliance Elite Guard was an elite Rebel trooper unit in the Alliance to Restore the Republic that was tasked with defending high ranking officials, such as Alliance High Command, during the Galactic Civil War. It is possible they were reformed as part of the New Republic Honor Guard after the Battle of Endor."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Early in the Galactic Civil War, the Alliance to Restore the Republic was without a clear command chain. To clear up the confusion, important Rebel battles often required a Field Commander. They would provide the link between ground forces and high ranking generals."}, {"tag": "p", "text": "Since the Alliance was a guerrilla force, without clearly defined territory, field commanders would most often be leading an attack, as opposed to defending from inside a base. Field commanders were, therefore, major targets."}, {"tag": "p", "text": "In order to protect valuable officers, commanders were accompanied by a squad of four Alliance Elite Guards. These guards would stay with them at all times, protecting from enemy counterattacks."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After the deaths of Galactic Emperor Palpatine and Darth Vader over Endor, aboard the Death Star II, it is possible that they were reformed and merged with the New Republic Honor Guard."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "These forces were given the same training as standard Alliance soldiers. They had a higher emphasis on defensive fighting and maintaining a tight squad. Certain members were also trained for specific environments, in case fighting took place on special types of planets. They were given the same equipment as normal soldiers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Alliance Elite Guard appears in Star Wars: Empire at War as the counterpart to the Imperial Elite Guard. Essentially the same as ordinary Rebel troops, they possess higher hit points and attack."}, {"tag": "h2", "text": "Appearances"}]}