{"url": "Graf_Yonna", "categories": ["Category:Legends articles", "Category:Alliance Intelligence members", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Graf Yonna"}, {"tag": "p", "text": "Graf Yonna was a native of the planet Bront and fought with the Rebel Alliance against the Empire around 0 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Graf Yonna was born on the planet Bront around 35 BBY. He witnessed the atrocities of the Galactic Empire when they destroyed his homeworld and killed his family. He suffered a mental break and assumed the identity of Parsol d'Ahndole, an adventurer and hero from the time of the Galactic Republic."}, {"tag": "p", "text": "He joined the Alliance to Restore the Republic and became a top operative for them as he would charge recklessly into battle and has saved countless Rebel lives. On Baes Logia the Rebels attempted to trap an Imperial General but Yonna arrived too early and ended up killing the general without hesitation or remorse."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Yonna was driven insane when the Empire destroyed his family and home. He developed an alternate personality modeled after a Republic heroe's romanticized persona. In particular, this personality exhibited by Yonna was melodramatic, had an extreme intolerance toward those he perceived to be evil and drove him to perform heroic feats."}, {"tag": "p", "text": "Alliance psychologists attempted to restore Yonna's original personality to a moderate degree of success. When he was in his 'Graf' personality he was prone to fits of depression and drunkenness, anger, and rage all directed towards the Empire."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Despite his willingness to charge head first into danger, Yonna was not too skilled in combat. He was decent with his fists and with a blaster but his tremendous success in helping the Rebels would appear to be more with dumb luck and the element of surprise then overwhelming skill and tactics."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Yonna was a walking arsenal and would carry a heavy blaster pistol, light repeating blaster, a sniper rifle with macrobinocular interface, a hold-out blaster, two thermal detonators, a blast vest and macrobinoculars with a headstrap for hands free and night vision operations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Graf Yonna was designed by Chuck Truett for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Mike Jackson."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}