{"url": "Alliance_Fleet/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Alliance to Restore the Republic fleets"], "nodes": [{"tag": "h1", "text": "Alliance Fleet"}, {"tag": "p", "text": "The Alliance Fleet, also called the Rebel Fleet, referred to the various spacecraft operated jointly by the Rebel Alliance in their struggle against the Galactic Empire. Although it was minuscule in size compared to the Imperial Navy, and in many cases its ships were of non-military design, the fleet proved to be a thorn in the Empire's side throughout the Galactic Civil War."}, {"tag": "p", "text": "Following the Battle of Endor and the creation of the New Republic, the Rebel fleet was renamed into the New Republic Defense Fleet."}, {"tag": "h2", "text": "Overview"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "For the bulk of the Rebel Alliance's early history, the acquisition of a legitimate Navy seemed impossible. The Rebel Alliance fleet was originally quite small, comprising of small to mid-sized cruisers, converted freighters, and outdated starfighters. Much of the war material had been scavenged from fleets of the former Confederacy of Independent Systems. The Alliance's main sources for its fleet were defection, theft, or salvage. Genuine construction would take place, but the limited locations made building huge ships difficult."}, {"tag": "p", "text": "In terms of organization, the Rebel fleet was scattered and under various command structures. All ships in service of the Rebel Alliance in the early years before the Battle of Yavin were owned and operated by each individual Alliance member, such as the Sullustans, Corellians, or Chandrilans."}, {"tag": "p", "text": "These scattered units would work with each other from time to time, such as during the Battle of Ylesia, but overall the space forces of the Alliance were not properly organized and equipped to seriously oppose the Imperial Navy."}, {"tag": "h3", "text": "A proper fleet"}, {"tag": "p", "text": "As the Galactic Civil War wore on, the ragtag fleet began to grow, as disaffected Imperials switched sides and numerous planets declared their support for the Alliance. When the Mon Calamari chose to join the Rebel Alliance, they brought with them their Star Cruisers, giving the Alliance the firepower needed to contend with Imperial warships."}, {"tag": "p", "text": "Mon Mothma realized the need for a single and organized Rebel armada, and decided to appoint the Mon Calamari Gial Ackbar to the rank of Admiral. With the rank came the position of Supreme Commander of the Alliance Fleet."}, {"tag": "h3", "text": "Father of the Alliance Navy"}, {"tag": "p", "text": "Under Ackbar, the once scattered Rebel space forces organized and assembled into an actual fleet, broken down into battle lines and task forces. Ackbar standardized training and created new line rear admirals to help command the elements of the fleet. With Ackbar came the Mon Calamari's sizable shipyards, which began producing new Star Cruisers, frigates, and corvettes."}, {"tag": "p", "text": "Mon Mothma gave Ackbar seven orders: the first was 'Avoid Battle.' The second was 'Send a Detailed Report on the State of the Fleet.' The third was 'Complete the Training of the Fleet.' The fourth 'Reorganize Fleet Replenishment.' The fifth 'Maintain a High Level of Morale in Your Command.' The sixth was 'Organize Raiding Forces'. The seventh, and final order was 'Be Prepared to go to Battle within a Month's Notice'."}, {"tag": "p", "text": "While the fleet was never committed to full battle, elements and battle lines of the fleet were regularly detached from the main fleet to raid Imperial installations, attack isolated convoys, and ambush small detachments of the Imperial fleet. This tactic of seasoning a fleet through many small engagements served Ackbar well. Years later during the Yuuzhan Vong War, a retired and ailing Ackbar organized a similar plan to train the newer units of the New Republic fleet before they had to commit to a major engagement."}, {"tag": "h3", "text": "Yavin to Hoth"}, {"tag": "p", "text": "A considerable bulk of the Rebel fleet was ambushed nine months after the Battle of Yavin by a large contingent of the Imperial Navy under the command of Darth Vader. Vader had hoped to end the Galactic Civil War in a single, decisive battle. Although several transports and smaller capital ships were quickly destroyed, starfighters commanded by Wedge Antilles, including Rogue Squadron, were able to hold off the Imperials long enough to allow the Rebel fleet to scatter into hyperspace."}, {"tag": "h3", "text": "Between Hoth and Endor"}, {"tag": "p", "text": "To keep the location of the Rebel base a secret from the searching Lord Vader, the Alliance fleet was ordered away from Hoth, dispersed around the galaxy, prior to the evacuation, though some isolated and detached units did aid in the evacuation or create diversions. This conformed to a tactical doctrine that Ackbar and the High Command had adopted—that the Alliance High Command should remain separated from the Alliance Fleet, since the Alliance could probably withstand the loss of either the Fleet or High Command, but not both."}, {"tag": "p", "text": "After the defeat at the Battle of Hoth, Alliance High Command and a portion of the Rebel fleet regrouped at the secret rendezvous point beyond the rim of the galaxy. Later, when the Alliance had established itself on Arbra, the fleet was kept hidden within the corona of Arbra's sun. For much of the following year, the Rebel fleet remained hidden from the Empire, slowly building itself up and preparing for the inevitable conflict with a full Imperial fleet. Such a conflict would happen over the forest moon of Endor."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "Following the discovery of the Death Star II, the majority of the fleet gathered at Sullust. Following a summit on the Rebel flagship Home One, the fleet launched towards Endor, intent on destroying the superweapon before it was completed. In what became known as the Battle of Endor, the Rebel fleet distinguished itself in facing down a sizable Imperial battle fleet, consisting of the Star Dreadnought Executor and around forty Star Destroyers."}, {"tag": "p", "text": "The fleet prevailed at Endor, largely due to the fact that the Imperial fleet had become dependent on the emperor's battle meditation, and their organization and resolve disappeared after he was killed. After the battle, one-fifth of the fleet was destroyed, but was able to rebuild itself when more worlds left the Galactic Empire once word of Emperor Palpatine's death had spread."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Headquarters"}, {"tag": "p", "text": "The fleet was controlled under the auspices of Fleet Command, the branch of the Alliance military that oversaw all fleet operations. Fleet Command was headed by the admiral of the fleet, which was Ackbar for the entire history of the Rebellion. While Ackbar was head of the fleet, he was assisted in command by a series of line admirals, who each were responsible for components of the fleet. Due to the importance of the fleet to the Alliance, Fleet Command was considered one of the most important Supreme Allied Commands."}, {"tag": "p", "text": "When the Alliance became the New Republic, the Rebel Alliance Fleet became the New Republic Defense Fleet. Also under the New Republic military structure, starfighters were under Starfighter Command."}, {"tag": "h3", "text": "Tactical organization"}, {"tag": "p", "text": "The Fleet's starships were organized into lines of battle. Each line of battle was composed of four elements: heavy cruisers, support ships, picket craft, and starfighter squadrons. A battle line's size and composition differed depending on available units or the mission. In practice, the standard line consisted of three heavy warships like MC80 Star Cruisers, supported by several escort frigates, corvettes and starfighter wings. Yet, battle lines ranged in size from as few as one and as many as ten heavy warships."}, {"tag": "p", "text": "By direct order from Mon Mothma, the Rebel fleet was never to have more than one quarter of its forces deployed as roving battle lines, such as the 14th Roving Line. All lines were commanded by line admiral appointed directly by Admiral Ackbar, though in reality there were few Alliance admirals. To remedy this, battle lines not possessing of an admiral were commanded by the senior captain of the line's cruisers."}, {"tag": "p", "text": "The Fleet also maintained Fleet Regiments to assist in ship security, boarding actions and supplement Alliance and Sector Forces in ground actions. Fleet Regiments wore gray coveralls, black vests and white streamlined blast helmets."}, {"tag": "p", "text": "The Fleet also maintained marines for ship-to-ship defense and assault when two ships engaged in one-on-one combat or for tactical assault on a key ship."}, {"tag": "p", "text": "Elements are a force encompassing a single starship, commanded by a captain."}, {"tag": "p", "text": "Sections were forces encompassing a small number of starships, typically light capital ships working alongside and commanded by the senior captain in the section. Sections that are made up of capital ships and close support vessels as \"flotillas\" in reference to ancient seagoing tradition."}, {"tag": "p", "text": "Squadrons are the most typical Alliance fleet detachment, and are made up of three to four sections working in a concert, including a line of capital ships supported by a section of escort ships and a flotilla acting as a picket line. Squadrons are commanded by either a senior captain, a commodore, or a line admiral."}, {"tag": "p", "text": "Battle groups consisted of two to four squadrons, and were mostly theoretical due to the Alliance being rarely spare as large of a single detachment. In practice, battle groups were maintained by a few Allied Commands, and were commanded by line admirals."}, {"tag": "p", "text": "Fleets were composed of three to six battle groups and were led by a line admiral."}, {"tag": "h2", "text": "Battle tactics"}, {"tag": "p", "text": "The Alliance Fleet was known for its use of several battle tactics, many of which were very different than those of their Imperial counterparts. For instance, while the Empire stressed quantity over quality, preferring to use weak unshielded craft to beat down opposition through sheer numbers, the Rebels used strong, multi-purpose, shield- and hyperdrive-equipped craft."}, {"tag": "h3", "text": "Ackbar Slash"}, {"tag": "p", "text": "The Ackbar Slash was a space warfare tactical maneuver devised by Admiral Ackbar. It involved a fleet's ships forcing their way into the middle of an enemy formation. The desired result was that, with enemy gunners running a high risk of shooting their own forces, they would be hesitant to fire. The ships in the middle would have no such risk, and be able to cause higher damage to their enemy. If the enemy ships did choose to fire, the risk of friendly fire still worked to the advantage of the attacking fleet."}, {"tag": "h3", "text": "Rogue Doctrine"}, {"tag": "p", "text": "Rogue Doctrine was the name given to the three battle tactics designed by Luke Skywalker and Rebel Alliance tactician Beryl Chiffonage, with help from Risiev Credal, for use by the T-47 airspeeders stationed at Echo Base on the planet Hoth."}, {"tag": "h4", "text": "Attack Pattern Delta"}, {"tag": "p", "text": "The first tactic involved a group of snowspeeders attacking an AT-AT in a single-file formation in order to give the enemy gunners a single target. After reaching optimal firing range, the lead speeder would fire before breaking off. With the AT-AT only able to track one target at a time, the remaining speeders would have a clear shot at the walker."}, {"tag": "h4", "text": "Bantha Decoy"}, {"tag": "p", "text": "The second tactic was a variant of a trick used once used by Luke Skywalker to target banthas in his T-16 skyhopper on his homeworld of Tatooine. Two speeders would approach a walker from behind while flanking it. The lead speeder would cut across the walker's line of sight to draw its fire, while simultaneously veering across the second speeder's flight vector, which would then expose the vulnerable neck of the AT-AT to the second speeder"}, {"tag": "h4", "text": "Harpoon and Tow Cables"}, {"tag": "p", "text": "The third and final method used the harpoons and tow cables of the T-47 to entangle the walker's legs, which would trip the massive AT-AT, bringing its own weight crashing down upon itself. This plan of attack worked most effectively during the Battle of Hoth, during which several AT-ATs were brought down using this method."}, {"tag": "h3", "text": "Space Denial"}, {"tag": "p", "text": "Due to the expense of keeping starfighters operational and the lack of resources available to the Alliance in comparison to their enemies, space denial was the only viable alternative to wresting control of space from the Empire.\nSpace denial was a means by which the Rebellion could deny the free movement of Imperial forces within Imperial-controlled space without significant protection, thus it was never meant to take and hold territory. The strategy behind space denial focused on small units of starfighters, usually at the squadron level, operating from hidden bases established near known Imperial supply routes and employing hit-and-run tactics and convoy harassment."}, {"tag": "h3", "text": "Scissors Technique"}, {"tag": "p", "text": "The scissors was a very difficult, timed maneuver aimed at bringing an attacking starfighter into the sights of the defending craft during a dogfight. The move, consisting of sharp, twisting turns, was generally executed immediately after the attacker overshot during a head-to-head engagement or following a successful breaking maneuver."}, {"tag": "h3", "text": "Trench Run Defense"}, {"tag": "p", "text": "Trench Run Defense (TRD) was an anti-capital ship tactic modeled after the success of Rebel Alliance starfighters against the First Death Star known as the trench run. Rebel pilots colloquially referred to targets vulnerable to the tactic as being susceptible to \"Trench Run Disease\"."}, {"tag": "p", "text": "Pilots facing large starships would fly very close to the surface of a ship's outer hull, using trenches to avoid enemy fire. Starfighters could thus deliver their payload with impunity to sensitive ship segments, assuming a successful escort against enemy starfighters."}, {"tag": "h2", "text": "Ships"}, {"tag": "h3", "text": "Capital ship classes"}, {"tag": "h4", "text": "Space stations"}, {"tag": "p", "text": "Although the Alliance Fleet was small, it did possess some space stations. Throughout the Galactic Civil War, it utilized Alliance Space Stations, of which it had five levels of design. They also had some Deep Space Manufacturing Facilities. In addition, they also utilized Rebel Platforms and Repair Yards. They also utilized Telgorn shipyards. They also used the XQ1, XQ2, XQ3, XQ4, XQ5, and XQ6 Platforms."}, {"tag": "p", "text": "By 7 ABY, the Rebel Alliance managed to procure their own Empress-class space station."}, {"tag": "h4", "text": "Battleships"}, {"tag": "p", "text": "The Alliance fleet made use of several battleships. The most notable is the MC80 Home One type Star Cruiser, of which its most well known model was the flagship, the Home One. It also utilized Lucrehulk-class battleships."}, {"tag": "h4", "text": "Battlecruisers"}, {"tag": "p", "text": "The Alliance Fleet utilized Bulwark-class battle cruisers for their Battlecruisers."}, {"tag": "h4", "text": "Cruisers and destroyers"}, {"tag": "h4", "text": "Carriers and assault ship"}, {"tag": "h4", "text": "Frigate"}, {"tag": "h4", "text": "Corvettes and gunships"}, {"tag": "h3", "text": "Starfighters"}, {"tag": "h3", "text": "Support craft"}, {"tag": "h4", "text": "Logistics vessels"}, {"tag": "h4", "text": "Dropships and landing craft"}, {"tag": "h4", "text": "Shuttles"}, {"tag": "h4", "text": "Transports of unknown class"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}