{"url": "Grakkus_Jahibakti_Tingi", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Collectors", "Category:Cyborgs", "Category:Hutts", "Category:Males", "Category:Nar Shaddaa residents"], "nodes": [{"tag": "h1", "text": "Grakkus Jahibakti Tingi"}, {"tag": "p", "text": "Grakkus Jahibakti Tingi, also known as Grakkus the Hutt, was a male Hutt crime lord who lived on Nar Shaddaa during the Age of the Empire. He ruled Hutta Town, and like many other Hutt kingpins, controlled an extensive network of bounty hunters and spice smugglers. Grakkus was an avid collector of artifacts of the Jedi Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Auction of a Padawan"}, {"tag": "p", "text": "At some point prior to the Invasion of Naboo, Grakkus Jahibakti Tingi attended an auction hosted by Xev Xrexus in the Drazkel system, which offered assorted illicit goods to invited buyers. The items available for purchase included several droidekas and a captured Jedi Padawan. At an unknown point, Grakkus met with the explorer Lor San Tekka, who shared his interest in ancient Jedi lore and artifacts."}, {"tag": "h3", "text": "Capturing Luke Skywalker"}, {"tag": "p", "text": "Grakkus resided on Nar Shaddaa, the \"smuggler's moon\" during the reign of the Galactic Empire. He, like many other Hutts, controlled a vast criminal network of various criminals such as bounty hunters, smugglers, and thieves. As such, Grakkus became extremely wealthy and powerful. Grakkus, unlike most other Hutts, used his influence and fortune to procure antiques, particularly artifacts relating to the Jedi Order. The Empire had purged the Jedi from the galaxy during its inception, and destroyed nearly all of the Order's records and artifacts relating to the peacekeeping Knights. Over the years, Grakkus came to control Hutta Town, a section of Nar Shaddaa's unending city. Within Hutta Town, Grakkus's palace was located, which was where he stored his collection of Jedi artifacts, such as Jedi lightsabers, statues, holocrons, a Delta-7B Aethersprite-class light interceptor, and even the bones of several deceased Jedi Knights. By the time of the Galactic Civil War, Grakkus considered his collection to be all that remained of the Jedi. Also during that time, Grakkus hired the Gamemaster, a red-skinned humanoid, to train the gladiators that fought in the Hutt's arena. Unknown to Grakkus, the Gamemaster was actually Sergeant Kreel of the Imperial Military, who had been dispatched by the Sith Lord Darth Vader to infiltrate Grakkus's palace to look for Jedi prospects so Vader could destroy them; further erasing the Jedi from the galaxy."}, {"tag": "p", "text": "During that time, some weeks after the Battle of Yavin, Luke Skywalker, a secret Jedi Padawan, traveled to Nar Shaddaa in order to seek charter to the Jedi Temple on the Empire's capital planet of Coruscant. Unknown to Skywalker, the temple had been transformed by Galactic Emperor Sheev Palpatine into his personal palace. Skywalker possessed a lightsaber that he was forced to reveal when he was attacked in a cantina, an act that was witnessed by one of Grakkus's agents. On Grakkus' behalf, the being stole the lightsaber and led Skywalker on a chase into Hutta Town."}, {"tag": "p", "text": "A short time later, the agent succeeded in his task and he and Skywalker crashed down into Hutta Town, where Grakkus confronted the young human, telling him that he owned Skywalker and his weapon because they were in an area of the moon that Grakkus controlled. Skywalker prepared to fight back against the Hutt, so Grakkus set a pair of his antique Holowan Laboratories IG-100 MagnaGuards that were used by the Confederacy of Independent Systems during the Clone Wars two decades earlier to combat Jedi, to challenge him with their electrostaffs. The battle droids greatly weakened Skywalker, but Skywalker adamantly refused to surrender, so Grakkus knocked him unconscious and dragged him to his collection room."}, {"tag": "p", "text": "Grakkus woke Skywalker and told him to open a holocron using the Force or be killed. Skywalker was awed by the Hutt's collection, but insisted that he knew not how to activate the holocron because he had never seen one before. Skywalker did manage to awaken the device and at least twenty-three others spread throughout the chamber by concentrating on the Force. Jedi Masters from millennia passed appeared from the holocrons, offering their knowledge to the individual who had activated them. Grakkus was very pleased with Skywalker's performance—believing him the last Jedi in the galaxy, and was pleased that Skywalker was under his control."}, {"tag": "p", "text": "Grakkus then turned Skywalker over to the Gamemaster so he could be trained to fight to the death in Grakkus's arena. A short while later, Grakkus checked on Skywalker's improvement with the Gamemaster. The Gamemaster assured the Hutt that the boy would be ready to fight and die in the arena. Grakkus then showed the Gamemaster what Skywalker would fight: Kongo the Disembowler, a massive monster that Grakkus had shipped in on special order from volcanic Mustafar. The Gamemaster was shocked by the beast's size."}, {"tag": "h3", "text": "Into the arena"}, {"tag": "p", "text": "The fight was set to begin, and the arena was packed full with criminals and gamblers from all over Nar Shadaa. Some scavengers located Skywalker's T-65 X-wing starfighter, looted it, and brought \"The Journals of Ben Kenobi\" to Grakkus. Grakkus then told Skywalker he had better fight well in the arena, or be killed slowly in punishment for defying the Hutt. Skywalker continued to rebel, so Grakkus taunted Skywalker with Ben Kenobi's journal and forced the \"last of the Jedi\" into the spotlight of the arena to fight Kongo. Grakkus retreated to his prime seat in the stands and watched Skywalker dodge the beast's attacks. The Hutt informed the Gamemaster that he was his favorite slave, and that it was a pity that Skywalker could not be the same: the last of the Jedi needed to die. The Gamemaster left Grakkus to watch the fight alone."}, {"tag": "p", "text": "Shortly thereafter, Kongo's shock collar was triggered by none other than the Gamemaster, who brandished a lightsaber and destroyed Grakkus's MagnaGuard bodyguards. Grakkus did not understand the betrayal, and was even more confounded when Imperial TIE fighter pilots poured into the arena and put the Hutt under arrest. The Gamemaster walked Grakkus into the arena and revealed that he had always been an Imperial spy for the 501st Legion, Darth Vader's personal contingent, known as \"Vader's Fist.\" At blaster-point, Grakkus activated an emergency EMP blast that rendered anything electronic—including blasters—useless. He then attacked the Imperial pilots with his bare hands, tossing them around the arena. The crowd began to take bets on whether Grakkus would survive the Gamemaster and Imperials. The electronic pulse blast also deactivated Kongo's shock collar, and the beast was set loose, prompting the crowd to scatter, and allowing Grakkus to regain his composure. In a fury, Grakkus grabbed the Gamemaster around the neck and threatened to feed him to his pet lizards. The Gamemaster used a lightsaber to sever two of the Hutt's mechanical legs, knocking the Hutt to the ground, just as a legion of Imperial stormtroopers stormed the arena."}, {"tag": "p", "text": "Skywalker escaped with the help of his friends and Kongo wrecked havoc on Hutta Town, destroying buildings and killing civilians. Grakkus was put in stuncuffs by the 501st Legion and escorted away from the Smuggler's Moon. Darth Vader arrived and took personal possession of Grakkus's collection in order to erase even more traces of the Jedi from the galaxy. The Gamemaster—Kreel—was subsequently promoted by Vader for his efforts in undermining Grakkus."}, {"tag": "h3", "text": "Imprisonment"}, {"tag": "p", "text": "Grakkus was incarcerated for the rest of the Galactic Civil War, and most of the subsequent rule of the New Republic, in Megalox, a prison city on Megalox Beta governed by prisoners trapped within its artificial gravity field. Grakkus established himself as de facto ruler of the city, where he, along with several other similarly cybernetically augmented Hutts known as the Grakks, maintained control from a castle-like structure that towered over the rest of Megalox. During this time, or possibly before, he encountered and began a \"history\" with Terex."}, {"tag": "h3", "text": "Meeting Poe Dameron"}, {"tag": "p", "text": "Approximately thirty years after the end of the Galactic Civil War, shortly before the start of the Cold War, Poe Dameron visited Megalox in his search for Lor San Tekka, who had visited Grakkus after leaving Ovanis. Grakkus and his posse detained Poe and the rest of Black Squadron in his fortress' compound. He agreed to allow Poe into his residence in return for surrendering their weapons. When Poe asked how Grakkus already knew the reason for his visit, Grakkus revealed that the First Order Security Bureau Agent Terex was already at his dwelling. When Poe objected to Terex's presence, Grakkus countered that he had met Terex a long time ago."}, {"tag": "p", "text": "While Grakkus bathed in a moisturizing bath, Poe demanded to know why Terex was here. Grakkus responded that he knew that both men were interested in the explorer Lor San Tekka. Seeking to escape the prison, Grakkus offered to reveal the information to whoever would break him out first. When Terex protested that Grakkus was breaking their deal, the Hutt responded that he had made lots of deals in the past and that he wanted to escape. Terex departed the palace, leaving Poe behind to warn the Hutt that he had complicated the situation. Despite Poe's warnings, Grakkus underestimated Terex's vindictiveness. Seeking retribution, Terex hired the rival crime bosses Kan Be, Papa Toren, and Isin to muster their gangs for a combined assault on Grakkus' fortress. Terex planned to interrogate Grakkus and then kill him."}, {"tag": "p", "text": "When the mob arrived, Grakkus thought that the prison riot was a fine cover for an escape attempt. When Poe warned that he could not trust Terex, Grakkus retorted that he did not want a good guy to break him out of prison and expressed his belief that Terex would provide results. Grakkus taunted Poe for not not delivering results. Despite Grakkus' lack of cooperation, Poe and his fellow pilots helped Grakkus' guards fight off the mob. As the mob advanced into the compound, the Black Squadron pilot L'ulo L'ampar pleaded for Grakkus to let them in. Grakkus refused to help, claiming that Terex had promised them more and adding that the riot would eliminate the competition. Grakkus was unaware that Terex, Papa Toren, and his Ximpi were discussing ways to cannibalize the Hutt."}, {"tag": "p", "text": "Unknown to Grakkus, Poe had an escape plan which involved getting his astromech droid BB-8 and the other droids to deactivate Megalox's gravity shield, exposing the prison to Megalox Beta's high gravity. This incapacitated Grakkus and the other inmates with the exception of Black Squadron, who donned gravity belts. Poe found Grakkus, who accepted his escape plan. After fitting Grakkus with a gravity belt, Poe contacted Warden Luta and offered to restore the gravity shield if she would allow them to leave with Grakkus; which she accepted. They then headed to the orbital space station, where Black Squadron's starfighters were parked. Since Grakkus could not fit inside their X-wings, he took a shuttle. Poe agreed to escort him to safety on the condition that he give the data he owed them once they had departed Megalox Beta."}, {"tag": "p", "text": "Before they could leave the system, a vengeful Terex reappeared with his starship Carrion Spike. Terex used his ship to attack the station, damaging the gravity shield generator and then attacked the station's shuttles. While Grakkus was unconcerned about the plight of others, Temmin Wexley managed to convince Poe and his fellow pilots to attack Carrion Spike, allowing the prison staff to evacuate their prisoners to safety. Following the dogfight, Grakkus provided all the information on the worlds that Lor San Tekka had visited in return for the squadron running hyperspace calculations for him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Grakkus was a male Hutt who was more physically active than the average Hutt. Aside from his much more muscular frame, he had a set of cybernetic legs to move in a more agile fashion. He also had an interest in collecting Jedi lore and artifacts. By 34 ABY, Grakkus' skin had become dry and he needed regular moisture baths to keep his skin moist and healthy."}, {"tag": "p", "text": "Grakkus displayed a selfish streak and was solely concerned for his own well-being and safety. He resented his long imprisonment and sought every opportunity to escape. Grakkus had a habit of breaking deals with even friends like Terex at his own whim. Despite breaking the deal, Grakkus believed that his old friendship with Terex would last. He underestimated Terex's vindictive and ruthless nature. Grakkus liked Terex because of his criminal streak and despised \"good guys\" like the Resistance pilot Poe Dameron and his Black Squadron. After Poe outmaneuvered Terex, Grakkus was savvy enough to accept Black Squadron's offer to help him escape. Grakkus' selfish streak manifested again when he expressed indifference to Terex's attack on the Megalox Beta space station and shuttles. He was willing to have other sentient beings die if he benefited from the situation. Poe exploited Grakkus' selfish nature by withholding access to hyperspace coordinates until he provided the necessary information on Lor San Tekka."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Grakkus knew how to pilot a shuttle. However, he did not know how to run hyperspace calculations by himself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Grakkus Jahibakti Tingi first appeared in the canon comic book Star Wars 9, which was written by Jason Aaron, illustrated by Stuart Immonen, and published in 2015. He was first identified as Jahibakti Tingi in the 2018 reference book Star Wars: Smuggler's Guide. In Star Wars Legends, Jahibakti was a kajidic introduced in the 2001 book Secrets of Tatooine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}