{"url": "Alliance_High_Command/Legends", "categories": ["Category:Legends articles", "Category:Alliance High Command personnel", "Category:Alliance to Restore the Republic military units"], "nodes": [{"tag": "h1", "text": "Alliance High Command"}, {"tag": "p", "text": "The Alliance High Command, also known as Alliance Command, was the military nerve center of the Rebel Alliance and Alliance of Free Planets, consisting of Mon Mothma, the Alliance Minister of War, the Chief of Staff (CoS) and her closest military advisors, including Bail Organa, Leia Organa and Jan Dodonna. Beneath Mothma, the Minister of War, and the CoS were the Alliance Supreme Allied Commanders, such as Admiral Gial Ackbar (in charge of the Alliance Fleet), and Crix Madine (in charge of the Alliance Special Forces)."}, {"tag": "p", "text": "The High Command was responsible for setting over-all strategy for the Alliance, direction operations of the Alliance Fleet and Alliance Forces, command of all Alliance ground forces, and coordinating the Alliance Sector Commands."}, {"tag": "h2", "text": "Structure"}, {"tag": "p", "text": "In large part, the brainchild of Bail Organa and his considerable knowledge of military matters from serving on the Galactic Republic Senate Military Oversight Committee, the Alliance High Command was flexible enough to wage coordinated insurgent warfare on a galactic scale, while still remaining under civilian control."}, {"tag": "p", "text": "At the top of the High Command was the Commander-in-Chief Mon Mothma. Directly below her in the chain of command was the Alliance Minister of War, the duties of whom were to keep the Commander-in-Chief (CinC) informed of military matters on a day-to-day basis. In the event the CinC became incapable of fulfilling her duties, the Minister of War would assume command of the war effort, until the CinC could return to her duties or the Alliance Civil Government could name a successor."}, {"tag": "p", "text": "Below the Alliance Minister of War in the chain of command was the Alliance Chief of Staff (CoS), whose main duty was to act as a buffer between the CinC and lower echelons, deciding which problems required her attention, and which could be handled at lower levels. In the event either the CinC or Minister of War were indisposed, the CoS was authorized to act in their names."}, {"tag": "p", "text": "Below the Chief of Staff were Supreme Allied Commanders, who were each responsible for an individual command, such as Ordnance and Supply, and SpecForces Command. High Command was advised by an Advisory Council."}, {"tag": "h2", "text": "High Command headquarters"}, {"tag": "p", "text": "The infrastructure of High Command typically operated from a planetary base, from where the majority of the Alliance operations throughout the galaxy were overseen. One of the first locations High Command used as their headquarters was a prefabricated base established in the ruins of the Jedi Enclave on the planet Dantooine. It was from the Dantooine base that the Alliance launched the starfighter strike that saw the acquisition of the technical data to the first Death Star."}, {"tag": "p", "text": "From Dantooine, High Command relocated to the newly built Massassi Station inside the ruins of the Great Temple on Yavin 4. Much of the Alliance's activities during this time were under the direction of General Jan Dodonna, operating from Yavin Base. After rescuing Princess Leia Organa from the first Death Star, Luke Skywalker and Han Solo delivered her and the Death Star plans to the base. It was there that the battlestation data was analyzed, and from where the assault on the Death Star was launched. The Empire soon responded with a blockade of the Yavin system, and within six months of the Death Star's destruction, High Command was forced to evacuate the moon and relocate elsewhere."}, {"tag": "p", "text": "Following the evacuation from Yavin, High Command was forced to become increasingly mobile as the Empire intensified its efforts to destroy them. To greater protect them, the newly formed starfighter squadron Rogue Group was permantly assigned to the roving High Command group. In accordance with policy established by Mon Mothma, the bulk of the Alliance Fleet was to operate separately from High Command in order to avoid a catastrophe that would potentially destroy both. It was decided the Alliance could survive the loss of either its fleet or High Command, but not both. While reconnaissance teams were dispatched in an effort to locate a suitable site for High Command to permanently relocate to, they temporarily settled on the planet Thila in the Outer Rim Territories. The Thila base was only used for a period of a few months before it too was evacuated in the face of the threat of its location having been compromised. Rogue Group performed admirably during several skirmishes in the Thila campaign, helping High Command to evacuate. Fortunately, High Command had already decided on relocating more permanently to the ice planet Hoth. When construction on the new Echo Base was completed in 2 ABY, they moved their operations there under the command of General Carlist Rieekan. It was a mark of their true desperation that they were forced to hide themselves within the ice caverns of the remote and desolate Hoth."}, {"tag": "p", "text": "High Command operated out of Echo Base for about one year before it was discovered in 3 ABY by Darth Vader's Death Squadron, his personal armada of Star Destroyers. Vader launched a crushing ground assault that severely crippled the Alliance's war efforts. Only with another heroic effort by Rogue Group was much of High Command able to narrowly avoid destruction at the hands of the Empire and evacuate the ice planet. The surviving members of High Command, now without a planetary base, relocated to the predetermined rendezvous point with the Alliance Fleet beyond the galactic rim."}, {"tag": "p", "text": "With the Alliance facing a situation more desperate than ever before, High Command transferred their operations to the Alliance Fleet, using Admiral Ackbar's Mon Calamari Star Cruiser Home One as their mobile base of operations for the following year. When High Command discerned the location and details of the second Death Star, still under construction above the forest moon of Endor, they ordered the majority of the Alliance Fleet to convene above the planet Sullust, where they planned the assault on the battlestation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}