{"url": "Grand_Audience_Chamber", "categories": ["Category:Legends articles", "Category:Great Temple locations", "Category:Rooms"], "nodes": [{"tag": "h1", "text": "Grand Audience Chamber"}, {"tag": "p", "text": "The Grand Audience Chamber, also known as the Ceremonial Hall or the Temple throne room, was part of the Great Temple on the jungle moon of Yavin 4. Measuring approximately 200 square meters, the Grand Audience Chamber almost entirely occupied the fourth and topmost level of the Great Temple."}, {"tag": "p", "text": "Its walls were dark green blocks of stone, and this huge room was considered an example of classical beauty. The Grand Audience Chamber was originally built at the end of the Hyperspace War, by the Massassi warriors who accompanied Naga Sadow during his exile on the fourth moon of Yavin Prime. Along with the whole Great Temple, it was abandoned for millennia before being reinvested by the Alliance to Restore the Republic and the New Jedi Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Grand Audience Chamber was part the Great Temple, a structure erected on Yavin 4 by the Massassi who worshipped Naga Sadow, a Sith Lord in exile. The throneroom occupied the fourth and uppermost level of the pyramid, complete with skylights and raised platform. Roughly a thousand years later, when Exar Kun eliminated the Massassi by absorbing their life-force, the Temple and the Chamber went into disuse for thousands of years."}, {"tag": "p", "text": "During the Galactic Civil War in 0 BBY, it was used as a ceremonial hall by the Rebel Alliance garrison. The members of the Alliance didn't refurbish the room with new materials, as they did in other parts of the Temple. They merely cleaned weathered debris and uprooted overgrown weeds, committed to restore the Chamber to its former magnificence. In this very room, Princess Leia Organa presided over the Royal Award Ceremony, during which the Medal of Bravery was given to those who partook in the battle over the first Death Star. For the first time in millennia, that vast chamber was full, with hundreds of rebel troops and technicians gathered together to celebrate their major victory against the Galactic Empire. After the medal ceremony, a celebration was held in the Grand Audience Chamber, with toasts coming often and exhuberantly. During the Empire's invasion of Yavin, one of the minor battles that occurred on the moon within the six months after the destruction of the Death Star, General Jan Dodonna and several Rebel personnel were also trapped within the Grand Audience Chamber by stormtroopers, although they were rescued by rebel heroes Luke Skywalker and Wedge Antilles of Red Squadron."}, {"tag": "p", "text": "When Master Luke Skywalker established the Jedi Praxeum in 11 ABY, the Grand Audience Chamber was used as a teaching space for the Jedi cadets. Unlike with many other rooms, the New Jedi Order left the Audience Chamber mostly untouched, as it was deemed to beautiful to be rebuild. The Jedi would place rows of polished wooden benches and a small platform was positioned in front of the chamber for the speaker. Upon this, when Master Skywalker was in a coma because of Kyp Durron, who was under the influence of Exar Kun, he was put on a stone platform on the stage of the chamber. He looked as if dead, which caused his students to feel grief and dismay. But with their help and the spirit of Master Vodo-Siosk Baas, they were able to defeat Kun's wicked spirit with the Force. And Luke had awakened with his spirit back in his body."}, {"tag": "p", "text": "During Second Imperium/Shadow Academy assault on the Jedi Praxeum, Imperial Commander Orvak set up his detonators in the chamber but he was bitten by a crystal snake. Orvak woke up just in time to see what it was that caused his unconsciousness, and just before the detonators he set in the Grand Audience Chamber exploded. The explosion killed Orvak and destroyed much of the Chamber though it would be rebuilt."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the Conclave on Yavin 4 was held here. Later, during the Yuuzhan Vong/Peace Brigade conquest of Yavin 4, the Great Temple along with the Grand Audience Chamber was flattened by a Damutek."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Measuring approximately thirteen by sixteen meters, the Grand Audience Chamber was accessed through a large wooden doorway carved with symbols that curved and twirled in a beautiful pattern. The Chamber itself was a huge echoing room—according to Jedi Lore Keeper Tionne Solusar, the acoustics of the Chamber were good for singing—the long sloped floor of which was paved with with rectangular slabs. The slanted outer walls came together above the floor to form the room's squared-off ceiling. Most of the flagstones were a dull grey, while shimmering stone lozenges ornamented the chamber with bright ochre, vermilion or dark green. The high roof was equipped with skylights open to the sun, and aligned with solstice and equinox."}, {"tag": "p", "text": "At the far end of an open aisle, there was a raised dais reached by a flight of stairs made of fourteen steps. The back wall boasted five large window-slits that insured an abundant supply of fresh air and natural light. Behind the dais, a small hidden stairway led to an observation platform at the roof of the Temple.\nWhen the young Anakin Solo began his apprenticeship, the stone walls were of a deep tan color, and they had worn smooth over the years. Electric blue blueleaf shrubs grew in the cracks throughout the stones and released a spicy perfume in the room."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Grand Audience Chamber first appeared during the triumphant end sequence of Star Wars: Episode IV A New Hope in 1977.\nWhile most of the interior scenes of the movie were filmed at Elstree Studios, just outside of London, the triumph ceremony required a stage far larger than anything Elstree could offer. Thus, the massive Stage H at Shepperton Studios was used to portray the Grand Audience Chamber. The Rebel Briefing Room and the monitoring of the attack on the Death Star scene were also shot at Shepperton."}, {"tag": "p", "text": "The filmmakers originally intend to use a matte painting to create the vast assembly present for the triumph ceremony. However, this proved too difficult, and the extras were filmed at the near end of the stage, then relocated into the middle and filmed again, and finally moved to the far end of the room and filmed one last time. During the filming of this final scene, the extras whispered insults and openly mocked Mark Hamill and Harrison Ford for starring in a movie that they believed would be a flop."}, {"tag": "p", "text": "The layout of the Chamber has been portrayed consistently throughout the Expanded Universe, with only minor differences. For example, in the 2003 video game Star Wars: Jedi Knight: Jedi Academy, the stairs leading to the dais are made up of eight steps instead of fourteen. The back wall also has several rows of window slits on top of another instead of the usual single row. In case of inconsistencies, this present article follows the depiction of the movie, due to its absolute level of canonicity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}