{"url": "Alliance_Intelligence", "categories": ["Category:Legends articles", "Category:Rebel Alliance stubs", "Category:Alliance to Restore the Republic intelligence organizations"], "nodes": [{"tag": "h1", "text": "Alliance Intelligence"}, {"tag": "p", "text": "Alliance Intelligence was a branch of the Alliance to Restore the Republic responsible for obtaining and analyzing military, diplomatic and economic information and reporting such information to the relevant branches of the Alliance."}, {"tag": "p", "text": "The Chief of Intelligence oversaw Intentions, Operations and Counter-Intelligence branches, which contained departments of Analysis, Cryptology, Interrogation, and Equipment; Systems Operations, Passive Operations, and Coordinate; and Security and Retrieval respectively. Through the organization's many Field agents, analysts and personnel, information was channeled up to Senior Intelligence Officers, who presented the Chief with daily briefs on the most crucial topics. The Chief in turn reported to the Commander-in-Chief and Supreme Commanders, and advised them in their strategic planning."}, {"tag": "p", "text": "General Vernan served as the first Chief of Intelligence, and was replaced after his death by General Airen Cracken, who filled the post until the organization evolved into the New Republic Intelligence Service."}, {"tag": "p", "text": "Some of the missions performed by Alliance intelligence were similar in nature to those of Alliance Special Operations. SpecOps agents, however, tended to be cocky, energetic and not necessarily best suited to operations that required patience and discipline. Indeed SpecOps missions groups were often sent to worlds to draw attention away from existing Intelligence agents who's cover was endangered. Mission Groups were sometimes attached to Alliance Intelligence's Operations department and SpecOps free agents often reported directly to the Chief of Intelligence."}, {"tag": "h2", "text": "Glossary of Intelligence slang"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}