{"url": "Grand_Convocation_Chamber", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Coruscant rooms", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:New Republic locations", "Category:Senate Building locations"], "nodes": [{"tag": "h1", "text": "Grand Convocation Chamber"}, {"tag": "p", "text": "The Grand Convocation Chamber, also referred to as the Senate Rotunda,the Senate Arena, the Senate Chamber, and the Great Rotunda, was the central chamber of the Senate Building in the Senate District on planet Coruscant. The heart of the Galactic Senate, it was the very core of every galactic governments dating back to 25,000 BBY. The chamber stood at 100 meters tall and consisted of 1,024 repulsorpods for the various senatorial delegations that hailed from every corner the galaxy. Ringed by the canyon-like Grand Concourse, the interior of the chamber was bathed in lavender, a color which was selected by ancient designers as it was the only shade that had not historically been associated with mourning, anger, or war."}, {"tag": "p", "text": "In the center of the convocation chamber, a thirty-meter-tall podium sprouted from the floor that was able to lower down into a series of offices containing the holding office of the Supreme Chancellor, the elected leader of the Galactic Republic. On this podium, the Supreme Chancellor would be accompanied by the Vice Chair and the Chancellor's Staff Aide on the upper level, with the Senate scribe, journal clerk, parliamentarian, and Sergeant at Arms seated on the lower level."}, {"tag": "p", "text": "Several major events took place in this room throughout the history of the Galactic Republic, namely the passage of the Ruusan Reformation in 1000 BBY, the Military Creation Act in 24 BBY, and the Declaration of a New Order in 19 BBY. Following a refurbishment during the reign of the Galactic Empire, the chamber continued to serve as the seat of the rechristened Imperial Senate for two decades before that body's dissolution in 0 BBY."}, {"tag": "p", "text": "After the New Republic liberated Coruscant during the Galactic Civil War, the Senate of the New Republic occupied the chamber. After a terrorist bombing in 17 ABY, the chamber underwent reconstruction. During the Yuuzhan Vong War, the Grand Convocation Chamber was converted into the Well of the World Brain and was the home of the World Brain, a massive Yuuzhan Vong beast that oversaw the Vongforming operations on the world. After the defeat of the extra-galactic invaders in 29 ABY, the chamber was once again restored to its original form and served as the seat of the Senate of the Galactic Alliance."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "Erected by the Galactic Republic circa 3996 BBY in the wake of the Great Sith War, the Senate Rotunda was built on the remains of the former Senate Hall, which had not been used after the duel between Jedi Master Vodo-Siosk Baas and Sith Lord Exar Kun."}, {"tag": "p", "text": "At the close of the Republic's Golden Age, the Vote of No Confidence in Chancellor Finis Valorum was accepted by the Senate and Senator Palpatine of the Chommell sector became Chancellor. During his term, the Separatist Crisis tore the Republic apart; as more worlds broke away, tensions rose. Dark Jedi Granta Omega attacked the Senate during this time, killing several senators with a dangerous air-borne toxin developed by scientist Jenna Zan Arbor."}, {"tag": "p", "text": "Eventually the conflict in the Senate evolved into the Clone Wars. As thousands of star systems withdrew from the capital and the Jedi Order suffered calamitous losses in the war, arguments in the Senate chamber became as heated as the Republic's battlefields. After three years of death and destruction in the name of peace, Chancellor Palpatine announced the end of the war and the Declaration of a New Order, the first Galactic Empire. Disbanding the Jedi Order, Palpatine, in fact the mysterious Dark Lord of the Sith Darth Sidious' alter-ego, was confronted by the Order's Grand Master, Yoda, in the Convocation Chamber. Hurling over a dozen repulsorpods with the Force and damaging countless others during the confrontation, the newly christened Emperor Palpatine fought Yoda to a draw, and the latter fled into exile."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "The magnitude of damage in the building's convocation chamber caught the eyes of the Senators. Closing the chamber for repair did not put an end to the spread of rumors that Grand Master Yoda had led an attack on Emperor Palpatine himself, and that the ancient Jedi Master had been killed. After repairs were made the newly appointed Imperial Senate began meeting in an advisory fashion, holding what amounted to largely elaborate meetings with the Grand Vizier, who would later report back to the Emperor on the result of the deliberation. The Emperor, whose scars prevented frequent public appearances, would use the views of the Senate to temper his own and then act with finality, leaving no room for debate or prolonged discussion. In 0 BBY, nearly two decades after the rise of the Empire, the Imperial Senate was dissolved after Senator Leia Organa of the Alderaan sector was revealed as a member of the Rebel Alliance. Three years later, the former Grand Convocation Chamber was used as an opera hall, housing a performance of The Kallea Cycle, a famous Brentaalii drama on the life of Freia Kallea and the founding of the Hydian Way."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "Following the death of the Emperor in 4 ABY, warring factions within the quickly collapsing Empire waged destruction upon Coruscant. The Senate Building, along with the nearby Imperial Palace, sustained heavy damaged but proved resilient never-the-less. As the New Republic settled into its role as leader of the galaxy, the Senate Building was repaired and the New Republic Senate convened with its halls. It was within this room that Jedi Master Luke Skywalker made his plea before the assembly to allow him to reform the Jedi Order and begin searching for new recruits. With a majority backing, Skywalker pledged that the new Order would serve as protectors of the Republic, much as the Jedi had for millennia before the Empire."}, {"tag": "p", "text": "While the structure had proven sound when attacked from the outside in the past, the same could not be said about an internal assault. In 17 ABY during a full session of the Senate, several detonations rocked the tower, hurling rubble onto the Plaza outside and collapsing the central speaking podium. After removing the dead and wounded, it was eventually discovered that the Dark Jedi Kueller was responsible for the attack. After the issue of the bombing was cleared up, the Senate Hall was gutted and new architects swept into the building and reworked the interior, so much so that many considered it a new complex all together."}, {"tag": "p", "text": "While the New Republic struggled to establish itself, the galaxy was invaded by an alien race called the Yuuzhan Vong. As attacks against Republic worlds increased, Yuuzhan Vong representative Nom Anor addressed the Senate and encouraged the assembly to denounce the Jedi and hand them over to the invaders. Then Chief of State Borsk Fey'lya rebuffed Anor's plea and had him escorted off Coruscant. However, Anor was successful in increasing the anti-Jedi sentiment among the senators and many Jedi were turned over to the Yuuzhan Vong across the galaxy. As the Senate continued to debate how best to deal with the new threat to the Republic, the Yuuzhan Vong attacked Coruscant in force, breaking through its orbital defenses and smashing through into the skylanes of the city world. As mass evacuations ensued following a crushing victory by the invaders, the Senate Building was left relatively intact if abandoned."}, {"tag": "h3", "text": "Well of the World Brain"}, {"tag": "p", "text": "Following the fall of Coruscant, the Yuuzhan Vong selected the ruins of the Senate Building to serve as the home of their World Brain, a massive dhuryam which would transform Coruscant into the legendary homeworld of the invaders, Yuuzhan'tar. Referred to as the Well by the Yuuzhan Vong, the Senate Building ruins were hollowed out while the exterior was quickly digested by yorik coral and hardened into an impenetrable substance. Appearing as a rotting skull from the outside, the Well was further protected by a deadly hedge maze that was planted over the Senate Plaza. Despite the defenses, Jedi Knights Jacen Solo and Ganner Rhysode were able to enter the Well on the pretense that Solo would consult with the World Brain before sacrificing Rhysode to the True Gods. Within the Well, Jedi Rhysode sacrificed himself while protecting Solo as he consulted with the World Brain, convincing it to subtly sabotage the Yuuzhan Vong's terraforming of the planet."}, {"tag": "p", "text": "In an effort to retake Coruscant, members of the Jedi Order planned to destroy the World Brain. As Republic heroes Han and Leia Solo entered the former Atrium with defected Yuuzhan Vong Harrar, a band of Shamed Ones, the lower class of the alien invaders, stormed the building as part of a heretical movement to overthrow the Yuuzhan Vong caste system. Aided by Jedi Masters Kenth Hamner, Mara Jade Skywalker, and Jedi Tahiri Veila, the Jedi and Republic fighters were able to convince the World Brain to surrender and, through other events elsewhere on the planet, retake Coruscant for the Republic."}, {"tag": "h3", "text": "Galactic Alliance"}, {"tag": "p", "text": "With the defeat of the Yuuzhan Vong, the New Republic was reorganized into the Galactic Alliance and, after having met on Dac in the Alliance's formative years, the Senate returned to Coruscant after the Swarm War and took up occupancy in the restored Senate Building. Having been stripped of all remnants of the Yuuzhan Vong invasion, the complex was reopened and the Senate quickly went into session discussing the second Corellian insurrection with vigor. While debate rang out in the Grand Convocation Chamber, protesters from across the galaxy gathered in the Plaza in support of Corellia."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Occupying the majority of the building central mass was the cavernous Grand Convocation Chamber, a tiered chamber sometimes referred to as the Senate Arena. The slightly sloping walls of the funnel-shaped room were lined with repulsorpods arranged in concentric circular patterns from floor to ceiling, which soared over a hundred meters high. The center of the vast chamber was dominated by a podium used by the Supreme Chancellor, the Vice Chair and the Senior Administrative Aide to coordinate the sessions. The chamber contained a total of 1,024 repulsorpods, which could be used by delegations from member systems and large voting blocs. When a Senator or representative wished to address the body they were able to detach their pod from its magnetic berth and move out into the open space of the chamber on an automated path. From there, their address would echo throughout the room, translated into hundreds of different languages instantaneously and piped into the other pods for ease of understanding. Small hovercams constantly hovered around the chamber, recording the words of the speakers and broadcasting them onto the ceiling-mounted vidscreens to allow the congregation to view up close visuals of the orator. Because sessions tended to grow long and last into the night, natural light and air was not used to fill the room. Instead, an artificial glow kept the room lit so as to diminish the senators' sense of time."}, {"tag": "p", "text": "The main control panel for the chamber's repulsorpods was located on Senate Tier 125. A smaller version of the Convocation Chamber could be found in the 20-tiered Senate Hearing Chamber, also located within the Senate Building."}, {"tag": "p", "text": "Directly beneath the Convocation Chamber was a series of rooms known as the Chancellery Secretariat, a set of offices used by the Chancellor and his aides while at the Senate Building. At the heart of the Secretariat was the holding office, located directly below the Senate Chamber and home to the Chancellor's podium when it was not in use. Before the start of a session of the Congress, the Chancellor and his aides would board the podium and the ceiling would dilate and the hydraulics driving the chamber would raise it into arena. A turbolift was also installed under the Chancellor's seat, able to evacuate him from the podium without having to lower it."}, {"tag": "p", "text": "Access to the chamber was granted through a small antechamber where the ceremonial, blue-robed Senate Guard stood at attention. The upper tiers of repulsorpods of the Senate Chamber were each assigned a permanent delegation. These senators represented large voting blocs in the Senate or held long tenures in the Republic, such as the representatives of the Core Worlds. These delegations were afforded permanent wedge-shaped offices, which included a multi-room preparation chamber adjoined to the delegation's platform and a separate, larger set of chambers which stretched to the outer edge of the building and served as a place for each delegation's countless aides to toil endlessly without need of travel."}, {"tag": "h4", "text": "Remodeling"}, {"tag": "p", "text": "Following the Declaration of a New Order, the Galactic Republic Senate was reformed into the Imperial Senate, which continued to make use of the Senate Building. Gone were statues of the Jedi Order, as were certain privacy buffers in the Senate pods and offices. Many high level Imperials moved their offices to the Imperial Palace and the number of planets petitioning for admittance into the Empire paled compared with the Republic. Following the highly destructive duel between Emperor Palpatine and Grand Master Yoda, the Emperor instructed the architects to install an extensive crystal ceiling, replacing the old holomonitors and casting a shimmering light on the central podium. The senior members of the Senate were seated at the lower levels of the chamber during this time, with the newer and less powerful Senators seated in the upper tiers."}, {"tag": "p", "text": "The Senate Building stood largely unchanged after the fall of the Empire and the occupation of the Building by the New Republic Senate. This would change in 17 ABY when the Dark Jedi Kueller bombed the structure, collapsing the Chancellor's podium and ripping out chunks of the chamber and killing many members of the Congress. By the time of Ponc Gavrisom's term as Chief of State, the building itself was rebuilt, which saw the internal fittings of the auditorium completely replaced, and the Grand Convocation Chamber was thought of by many contemporaries as an entirely \"new\" structure, distinct from the old rotunda. The chamber was extensively redecorated; the Chief of State's podium was lowered to ground level, and most strikingly of all, in place of the former geometric arrangement of repulsorpods, the seating for delegates was organized into clusters of differing size and shape arranged around the rotunda, connected to each other by ramps and stairways, and capable of holding more than 2,000 delegates. The upper levels were randomly pitted with large chambers to seat other senators or representatives temporarily visiting the planet. It was said that they may have replaced some of the rooms with repulsorlift pods, but by the time of the Yuuzhan Vong's taking of the planet, that plan had been long abandoned. The overall effect of the design was to create a complex arrangement of contrasting forms and details, combined nevertheless into a clear, coherent harmony. As membership in the New Republic grew, new balconies were added to the existing clusters to accommodate the growth; rumors about reincorporating the repulsorpods spread during Borsk Fey'lya's administration, but never came to fruition under the New Republic."}, {"tag": "p", "text": "Following the Battle of Coruscant during the Yuuzhan Vong invasion, the Convocation Chamber was filled with a pool of nutrients and became the home of the giant World Brain, the controlling organ behind the invaders terraforming project. Still accessible from the former Atrium of the Senate, a long corridor cut half a kilometer into the building and onto a bridge that spanned half the convocation chamber. The holding office below was transformed into a secret bunker, where a single escape craft was preserved for Nom Anor."}, {"tag": "p", "text": "Following the defeat of the Yuuzhan Vong, the Galactic Alliance restored the Building to its pre-Imperial form. The Chief of State's Suite was placed at the summit of the building, and repulsorpods were reincorporated into the Grand Convocation Chamber. The Chief's podium was not recreated however; instead they would occupy their own floating platform to make addresses to the Senate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Counter to all prior sources stating that the Grand Convocation Chamber was erected following the duel in the old Senate Hall between Exar Kun and Jedi Master Vodo-Siosk Baas during the Great Sith War, Timeline 12: The Great Hyperspace War depicts the Chamber in operation nearly one thousand years prior to when it should first make an appearance. An explanation for this discrepancy has not yet been offered."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}