{"url": "Grand_Galactic_Tour", "categories": ["Category:Legends articles", "Category:Events", "Category:Galaxy Tours"], "nodes": [{"tag": "h1", "text": "Grand Galactic Tour"}, {"tag": "p", "text": "Some time during the Galactic Civil War, the interstellar travel agency Galaxy Tours commenced a four-week Grand Galactic Tour holiday package to four planets, with the Kuari Princess acting as the luxury vessel ferrying its patrons across the galaxy. The destinations included Tatooine, Endor, Bespin, and Imperial City, each stay lasted a week."}, {"tag": "h2", "text": "Tatooine"}, {"tag": "p", "text": "The first week and first stop was at Tatooine, where the guest were to stay at Castle Bocce. Activities during this time included sunbathing at one of the resort hotel's 10 multi-species swimming pools and watching live-action Karuki dances at night. Guests were also issued landspeeders to go shopping at Anchorhead and could also go on bantha rides to ancient ruins. Some guests could also go Krayt dragon hunting with professionals, although this required a liability waiver. On the last evening, guests could go on an elegant sail barge through the Dune Sea for a gala cocktail party."}, {"tag": "h2", "text": "Endor"}, {"tag": "p", "text": "The second stop was at Endor. The guests were given the option of observing the pristine beauty of Endor's forests from the Kuari Princess, or observing it directly from the ground as a guest of honor among the Ewoks, including living in a rustic tree house hundreds of feet from the ground. Activities included hunting, fishing, hiking, various outdoor activities, and taking part in the nightly fireside revelry. Guests could also take a Skyhopper to observe the planet surface from the air to make the trip complete."}, {"tag": "h2", "text": "Bespin"}, {"tag": "p", "text": "The third stop was at Bespin and Cloud City. Guests had a private suite awaiting them in the cityscape. Activities during this time included evenings of gourmet dining, dancing, and games of chance at Cloud City's various nightspots, as well as para-wing gliding or skysailing the Tibanna gas thermals. In additon, guests could also take a Cloud City car to observe the gas clouds directly, and even watch the Bespin sunset."}, {"tag": "h2", "text": "Imperial City"}, {"tag": "p", "text": "The final stop was at Imperial City, where guests could spend the week luxuriously in the cultural center of the galaxy. The guests could observe the arts and entertainment of Imperial City, which was described as the finest, attend a performance of the Imperial Ballet Company, visit museums containing priceless artifacts and works of art in the Galactic Empire, witness the changing of the Emperor's Royal Guard, and experience a rare tour of the Palpatine Gardens at the Imperial Palace."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}