{"url": "Grand_Hutt_Council", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Grand Hutt Council", "Category:Hutt organizations", "Category:Legislatures"], "nodes": [{"tag": "h1", "text": "Grand Hutt Council"}, {"tag": "p", "text": "The Grand Hutt Council, also known as the Hutt Grand Council and the Hutt Council, was the ruling body of the Hutts located on the Hutt world of Nal Hutta and included a number of high profile and influential Hutt leaders, they had control over the Hutt Clan crime family. During the Clone Wars, Jabba the Hutt and Marlo both led the Hutt Council. It was during the war that the Grand Hutt Council allied themselves with Maul and his Shadow Collective, assisting the organization with its takeover of Mandalore."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the Galactic Republic's arrest of Ziro the Hutt for the kidnapping of his great nephew Rotta, the Council feared that Ziro would reveal the Council's records to the Republic Senate. The Hutt Council hired bounty hunter Cad Bane to free Ziro and turn him over to them. After Bane's successful rescue of Ziro, Gardulla and the Council demanded that Ziro hand over the records. Ziro refused to do so and was imprisoned. After Ziro made his escape, the Council hired Bane to track him and the records down. Though Bane failed, Sy Snootles was able to give Jabba himself the records after she killed Ziro."}, {"tag": "p", "text": "When Maul and his Shadow Collective arrived on Nal Hutta, Jabba and the Council refused to join them, merely laughing at them. However, after defeating a large group of bounty hunters and killing one of the council members, Oruba, Jabba and Gorga agreed to join Maul."}, {"tag": "p", "text": "After the Rebel Alliance destroyed the Death Star, Nal Hutta Kal'tamok reported that the Grand Hutt Council had issued an earnings announcement on that day which contained a peripheral acknowledgment of the Alliance's victory at Yavin."}, {"tag": "p", "text": "Following Jabba's death, the Council was left to determine who would fill Jabba's seat as leader of his empire. Several months after Jabba's demise, a decision had yet to be made."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}