{"url": "Grand_Plan", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Grand Plan"}, {"tag": "p", "text": "The Grand Plan, also known as the Great Sith Plan, was a long-percolating plot hatched by the Sith. Originating with the Sith Lord Darth Bane, who had emerged victorious from a devastating conflict among his peers, its aim was to corrupt the Galactic Republic from within, discredit and diminish the Jedi Order, and ultimately rule the galaxy. A millennium after its creation, the Grand Plan was fulfilled by Darth Sidious."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Prelude"}, {"tag": "p", "text": "The Jedi-Sith War ended in the near annihilation of the Sith due to both infighting, caused by their greed for power, and their conflict with the Jedi Order. Unbeknownst to the Jedi, the Sith Lord Darth Bane survived the destruction of the ancient Sith Order. In the shadows of the galaxy, Bane used tricks, tactics and schemes to destroy the Sith's enemies, conjuring a plan that would corrupt the Galactic Republic from within, diminish the Jedi, and allow the Sith to conquer the galaxy once more."}, {"tag": "p", "text": "Desiring revenge and wanting to avoid the Sith being destroyed by greed again, Bane created the Rule of Two, which would allow the Sith to operate in secret. His rule mandated that only two Sith Lords could exist at any given time; a Sith Master and a Sith apprentice, and one had to die in order for another to come. Either the apprentice would grow more powerful with each subsequent succession, which was facilitated by the apprentice killing the master and then becoming the master of an apprentice they choose, or the master would train another student to kill and replace their outgoing student. Bane was inspired by his personal experiences, ancient Sith documents, and the idea of a dyad in the Force, a Force-bond as strong as life itself that paired two individuals strong in the Force into one in the Force. Even so, however, the Rule of Two was but a pale imitation of the older, purer doctrine of the dyad in the Force.  Following Bane's death at the apparent hands of his apprentice, Darth Zannah, she and subsequent Sith continued his plan."}, {"tag": "h3", "text": "The rise of Darth Sidious"}, {"tag": "p", "text": "Around a millennium after the time of Darth Bane, the Sith Lord's legacy was inherited by Darth Sidious, who learned the ways of the dark side of the Force as the apprentice of Darth Plagueis. Ultimately, Sidious replaced his mentor by killing Plagueis and taking Darth Maul as his apprentice."}, {"tag": "p", "text": "Sidious facilitated his rise to power through his public visage as Sheev Palpatine, the Senator of Naboo. As a result, he was able to infiltrate the Galactic Senate while hiding his Sith identity from the Jedi."}, {"tag": "h3", "text": "Naboo Crisis"}, {"tag": "p", "text": "Using his influence over the Trade Federation, Sidious orchestrated the blockade and invasion of his homeworld. His goal was to generate sympathy for the people of Naboo in order to become the next Supreme Chancellor. Although Queen Padmé Amidala escaped with the help of the Jedi Qui-Gon Jinn and Obi-Wan Kenobi, she fled to the Republic capital of Coruscant seeking Senator Palpatine's counsel. Palpatine convinced the Monarch of Naboo to call for a Vote of No Confidence in Supreme Chancellor Finis Valorum. Amidala returned to Naboo to liberate her planet while Palpatine secured his election as the Republic's new chancellor."}, {"tag": "p", "text": "Despite the loss of Maul, who was believed to have been killed by Kenobi on Naboo, the crisis presented a new opportunity in the form of a vergence in the Force—Anakin Skywalker, a child whom the Jedi believed to be the Chosen One, destined to bring balance to the Force. Sidious took a great interest in Skywalker; as Palpatine he influenced the young Padawan's views even as Skywalker trained with Kenobi, who was newly-knighted for defeating Maul."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "A secret army"}, {"tag": "p", "text": "Sidious chose Count Dooku, a Jedi Master who renounced the Order, as his new Sith apprentice. The former Jedi converted to the ways of the dark side and became the Sith Lord Darth Tyranus. Sidious and Tyranus learned that a former member of the Jedi High Council, Jedi Master Sifo-Dyas, secretly commissioned a clone army to protect the Republic. To ensure Sifo-Dyas' silence, Dooku contacted Lom Pyke of the Pyke Syndicate, and as Tyranus, paid the Pykes to kill Sifo-Dyas. However, unbeknownst to Tyranus, the Pykes kept Chancellor Vallorum's aide, Silman, alive as insurance against the Sith Lord."}, {"tag": "p", "text": "Following Sifo-Dyas' death, Tyranus recruited and paid bounty hunter Jango Fett to be the clone template for the Kaminoans. Tyranus also supplied the Kaminoan cloners with a behavioral modification biochip, but told them to keep its \"safeguard\" order a secret from the Jedi."}, {"tag": "h4", "text": "The galaxy aflame"}, {"tag": "p", "text": "Tyranus, as Count Dooku, continued to recruit corporations and star systems into the Separatist movement. With the outbreak of war on Geonosis in 22 BBY, the Jedi took up arms and led the newly-found clone troopers against the onslaught of the Separatist Droid Army. Thus began the Clone Wars, and as the conflict raged on and more Jedi fell to battle, Darth Sidious continued to amass economic and political power for the Office of the Chancellor, allowing himself, as Palpatine, to sway ever more support in the Senate and rule the InterGalactic Banking Clan that supplied financial aid to both the Republic and the Separatists."}, {"tag": "h3", "text": "A New Order"}, {"tag": "p", "text": "The Grand Plan came to fruition when the Dark Lord of the Sith, Darth Sidious, successfully seduced Anakin Skywalker to commit fully to the dark side of the Force and anointed him as the Sith Lord Darth Vader after Skywalker killed Tyranus during the Battle of Coruscant. Together, they commanded the clones of the Republic to turn against their Jedi commanders under whom they had served for three years, thereby initiating the Great Jedi Purge. As thousands of members of the Jedi Order were slaughtered, Sidious addressed the Galactic Senate as Supreme Chancellor Palpatine. Adopting the title of Galactic Emperor, he proclaimed that the reorganization of the Republic into the First Galactic Empire."}, {"tag": "p", "text": "With an unrivaled military and a loyal bureaucracy under his grip, Emperor Palpatine had conquered the galaxy,[source?] destroyed the Jedi Order, and fulfilled the revenge of the Sith. Having achieved his goal of restoring the Sith to dominance, the Emperor dispensed with the persona of Sheev Palpatine and chose to live as Darth Sidious only."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Return of the Jedi"}, {"tag": "p", "text": "Although the Great Plan was realized, the New Order and the reign of the Sith did not last. Darth Sidious' Galactic Empire was toppled by the Alliance to Restore the Republic and surviving Jedi in the Galactic Civil War. Masters Obi-Wan Kenobi and Yoda of the fallen Jedi Order trained the offspring of Anakin Skywalker, Luke Skywalker, in the Jedi ways, ensuring the return of the Jedi. Confronting his father and Darth Sidious, Luke Skywalker's plead for help against the wrath of the Emperor convinced Darth Vader—the Chosen One, Anakin Skywalker—to save Luke and overthrow Darth Sidious; the Dark Lord was destroyed as he fell into an abyss aboard his new battle station, and balance was restored to the Force."}, {"tag": "p", "text": "However, death was not the end for Sidious; the Sith's spirit retreated to the hidden Sith redoubt of Exegol on the fringes of the galaxy, joining with Sith Eternal cultists through new clone bodies. From Exegol, Sidious manipulated the New Republic and forged the remnants of his fallen Empire into the First Order, something unbeknownst to even the highest echelons of First Order leadership. Sidious created Snoke, who went on to rule the First Order as Supreme Leader, his origins unknown to the First Order's leaders. Meanwhile, the Cosmic Force—an aspect of the Force that bound all things and communicated to living sentient beings, and which formed a balanced, symbiotic relationship with the Living Force, the energy of all life—became dormant after the Galactic Civil War, only to be reawakened with certain individuals' realization of their latent Force abilities in 34 ABY. Such individuals included Rey, a scavenger on Jakku, who did not know that she was, in fact, the granddaughter of Darth Sidious."}, {"tag": "h4", "text": "End of the Sith"}, {"tag": "p", "text": "In 35 ABY, with the New Republic having been decapitated and large swathes of the galaxy having fallen to the First Order during their war against the Resistance, Darth Sidious returned to reconquer the galaxy in full force. With an armada of planet-destroying warships, the Final Order, the Sith Lord and cultists intended to establish a New Empire. As the Sith fleet prepared to strike at the embattled galaxy, the Dark Lord made efforts to corrupt Jedi into his minions, reaching out to the heir of the previous war's heroes—Ben Solo."}, {"tag": "p", "text": "When the Jedi student Rey guided Ben Solo back to the light thanks to her newfound understanding with him—which was formed by their Force dyad, the power of which was unseen for generations—and surfaced to the Emperor's attention, the Sith sought to abandon his crippled body and transfer his essence over to his granddaughter. However, with her affinity to the Force and the support of the Jedi before her, Rey willed against Darth Sidious, ultimately obliterating the Sith Lord's physical vessel and putting an end to the threat of the Sith. Rey fell, but was resuscitated from death by Ben Solo, who gave his life for hers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Grand Plan first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. It was first identified in the new Star Wars canon as the Great Plan in Star Wars Helmet Collection 2, released by De Agostini in 2016, and was identified as the Grand Plan in Star Wars Helmet Collection 44, released by De Agostini in 2017. It was originally identified as the Grand Plan in the 2012 Star Wars Legends novel Darth Plagueis, authored by James Luceno."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}