{"url": "Grand_Republic_Medical_Facility", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Coruscant medical facilities", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Locations of the Sith"], "nodes": [{"tag": "h1", "text": "Grand Republic Medical Facility"}, {"tag": "p", "text": "The Grand Republic Medical Facility, also known as the Grand Medical Facility, was a towering medcenter located on Coruscant, the capital planet of the Galactic Republic. During the Clone Wars, the facility was used as a hospital to treat badly injured Republic Military personnel. In addition, the facility treated patients from across the galaxy. One such patient was the Sith Lord Darth Vader, who required cybernetic reconstruction as a result of the injuries he sustained on Mustafar. Darth Sidious, the secret persona of Supreme Chancellor Sheev Palpatine, used the facility as his retreat prior to proclaiming himself Galactic Emperor."}, {"tag": "p", "text": "The facility remained in use during the reign of the Galactic Empire, although its secret role as Sidious' Sith haven was transferred to the Imperial Palace. During the Galactic Civil War, Sidious brought Vader to the facility to be rebuilt following his journey to Exegol."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Galactic Republic medcenter known as the Grand Republic Medical Facility was a skyscraping tower in Galactic City, the planet-wide ecumenopolis of the Republic capital Coruscant. The facility's lower levels were restructured to accommodate Darth Sidious' new Sith lair, and also housed a meditation chamber for the Sith Lord's use."}, {"tag": "p", "text": "The facility was regarded as a high-value target during the Clone Wars due to its role as a Republic treatment center, and therefore fortified with strong defense systems and powerful weaponry. Its security forces comprised the clone shock troopers of the Coruscant Guard and Supreme Chancellor Sheev Palpatine's Red Guards."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Grand Republic Medical Facility was operated by the Galactic Republic during the Clone Wars. Following a premature activation of Clone Protocol 66 on Ringo Vinda, and a subsequent investigation on Kamino, Jedi Master Shaak Ti and Doctor Nala Se traveled to the facility bringing with them two inhibitor chips and ARC trooper CT-5555 as instructed by Supreme Chancellor Sheev Palpatine. However, the clone trooper fled the facility for attempting to assassinate the chancellor, an act motivated by the revelation of Palpatine's involvement in a conspiracy to destroy the Jedi Order."}, {"tag": "p", "text": "In the aftermath of the incident with the renegade clone, Palpatine—a secret Dark Lord of the Sith known as Darth Sidious—moved his collection of Sith relics and artifacts from an abandoned tower in The Works district to the Grand Medical Facility, fearing they would be discovered by the Jedi."}, {"tag": "p", "text": "After the rise of the Galactic Empire, a severely damaged Darth Vader was taken to the facility by the now-anointed Emperor Palpatine. Utilizing a team of medical droids, Sidious had his apprentice surgically reconstructed and placed within a cybernetic suit in order to survive his wounds. Vader revisited the facility, which was still operational at the time of the Galactic Civil War, to be repaired after his excursion to Exegol."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}