{"url": "Grand_Temple%27s_throne_room", "categories": ["Category:Canon articles", "Category:Great Temple locations", "Category:Rooms"], "nodes": [{"tag": "h1", "text": "Grand Temple's throne room"}, {"tag": "p", "text": "The Grand Temple's throne room was a ceremonial hall located within the Great Temple, on Yavin 4. On the morning after the Battle of Yavin, the throne room housed the Royal Award Ceremony, during which heroes of the Alliance to Restore the Republic were saluted."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The throne room was a part of the Great Temple, an edifice constructed by the Massassi people on the fourth moon of Yavin over 5,000 years before the Battle of Yavin."}, {"tag": "p", "text": "Long after the temple was left derelict by its original builders, it was rehabilitated by the Alliance to Restore the Republic, a freedom-fighting movement that liked to use preexisting structures on remote planets to better hide its activities against the Galactic Empire. After the Alliance led a successful assault on the Empire's Death Star battle station, the heroes of that victory were saluted in a Royal Award Ceremony that took place in the Temple's throne room."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The throne room was a vast chamber whose long sloped floor was paved with rectangular slabs of translucent precious stone. Its towering stone walls and high ceilings were carved with intricate patterns. The roof of the chamber was pierced by tall skylights aligned with solstice and equinox. At the back of the room, across from the entrance, there was a ceremonial podium reached by a flight of stairs. The back wall also boasted five large window-slits that insured an abundant supply of natural light. When the jungle outside was in full bloom, the air within the chamber became filled with floral scents. Behind the podium, a small hidden stairway led to an observation platform at the temple's apex."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}