{"url": "Alliance_Military/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic military units"], "nodes": [{"tag": "h1", "text": "Alliance Military"}, {"tag": "p", "text": "The Alliance Military was the military arm of the Alliance to Restore the Republic (later Alliance of Free Planets) charged with the task of defeating the Galactic Empire's vast military forces and defending the Alliance's operations to foment rebellion against Emperor Palpatine's iron fist rule."}, {"tag": "h2", "text": "Leaders"}, {"tag": "p", "text": "The Commander-in-Chief, a title held by Chief of State Mon Mothma, her Chief of Staff, the Minister of War and the Supreme Allied Commanders formed the Alliance High Command, which formed the central nervous system of the Alliance Military. High Command oversaw both the centralized Alliance Special Forces and the semi-autonomous Sector Forces."}, {"tag": "p", "text": "The structure of the Alliance military was designed by Bail Organa, who used his experiences on the Old Republic Senate Military Oversight Committee to aid in setting up the Alliance High Command. The Alliance military was separated into two distinct branches: Alliance Forces and Sector Forces."}, {"tag": "p", "text": "In 4 ABY, Ackbar was appointed Supreme Commander of the Alliance Military. That year, the Alliance Military changed into the New Republic Defense Force."}, {"tag": "h3", "text": "High Command"}, {"tag": "p", "text": "The High Command was the mind of the Alliance military. It was composed of the Chief of State, who was also Commander in Chief, the Minister of War, the Chief of Staff, and the various Supreme Allied Commanders. The High Command directed all Alliance military forces in a coordinated effort. For this reason, Alliance tactical doctrine dictated that the High Command and the Alliance Fleet were generally not to be in the same place at the same time, since the Alliance could withstand the loss of either the Fleet or the High Command but not both. The most important members of the High Command were the various Supreme Allied Commanders, who had direct command and control of each facet of the Alliance military. Notable members of High Command were Gial Ackabar,Jan Dodonna,Crix Madine,Bail Organa, and Leia Organa."}, {"tag": "h2", "text": "Alliance Forces"}, {"tag": "p", "text": "The Alliance Forces were the part of the Rebellion's military that was directly controlled by the Alliance and High Command. This included the Alliance Fleet and attached starfighter wings, as well as the small but powerful ground forces that composed SpecForces, fleet regiments and small ground units."}, {"tag": "h3", "text": "Fleet"}, {"tag": "p", "text": "The majority of the strength of the Alliance Forces was concentrated in the Rebel fleet. While only consisting of a small fraction of the ships available to the Imperial Navy, the Rebel fleet was the most powerful single military unit available to the Alliance High Command. Due to the scarcity of funds for the Rebellion, most warships employed in the Rebel fleet were either captured or donated by friendly/allied individuals and worlds, the vessels that were openly bought were usually cheap and/or outdated such as the GR-75 medium transport. The fleet was under the direct command of Admiral Gial Ackbar, the Supreme Commander of Rebel space forces."}, {"tag": "h3", "text": "Starfighter Corps"}, {"tag": "p", "text": "The Alliance Military had a unit of starfighters separate from the navy, essentially becoming its own military branch."}, {"tag": "h3", "text": "Ground forces"}, {"tag": "p", "text": "While the bulk of the ground forces operated by the Rebellion consisted of various Rebel cells and Sector Forces, Alliance Command did maintain a small but powerful ground force. The Rebel SpecForce operated ten ground combat divisions and was a prominent part of the Alliance Army; its duties included protecting the High Command from assault, as took place on Hoth. While smaller than the Imperial Army, the Alliance Army often used hit-and-run tactics to infuriate Imperial officers."}, {"tag": "h3", "text": "Aquatic navy"}, {"tag": "p", "text": "The Alliance had an aquatic Navy supported by R2-D5 labor droids and its vehicles were constructed at shipyards."}, {"tag": "h2", "text": "Sector Forces"}, {"tag": "p", "text": "The Sector Forces were semi-autonomous military units that were responsible for maintaining the Rebellion on local levels. These were the Alliance affiliated resistance movements that resisted the Empire in their own respective sectors. In most cases these were small sized local armies that conducted regular day to day business independently, though they technically partially subordinate to the High Command. Sector Forces were at times augmented by Alliance starfighter and ground forces."}, {"tag": "h2", "text": "Branches"}, {"tag": "h3", "text": "Supreme Allied Commanders"}, {"tag": "p", "text": "The Supreme Allied Commanders were the chiefs of each branch of the Alliance military. Each Supreme Allied Commander and their staff was expected to run their departments smoothly and efficiently. Efficiency was most important, as time and funds were always in short supply for the Alliance. There were seven Supreme Allied Commanders, broken down as follows:"}, {"tag": "h3", "text": "Fleet Command"}, {"tag": "p", "text": "This department was responsible for the most important aspect of the Alliance military—the Fleet. Fleet Command was headed by the admiral of the fleet itself. The admiral of the fleet, besides being the operation combat commander, also oversaw the training, organization, and deployment of the fleet, giving the Fleet Command supreme power over the Alliance fleet."}, {"tag": "h3", "text": "Ordnance and Supply"}, {"tag": "p", "text": "The Procurement and Supply department was responsible for providing adequate supplies for the military, such as foodstuffs, fuel, spare parts, weapons, etc. In practice, Ordnance and Supply maintained only the Fleet and starfighter units, leaving each Sector Command responsible for maintaining their own local ground forces. OaS worked very closely with the Minister of Supply in the civil government."}, {"tag": "h3", "text": "Starfighter Command"}, {"tag": "p", "text": "This department oversaw the control of all Alliance starfighter squadrons. In was responsible for training new pilots, assigning squadrons to the fleet, and loaning squadrons to Sector Commands for important missions. This command was considered one of the more difficult, as it regularly had to deal with multiple requests for squadrons while faced with limited available resources. Jan Dodonna was placed in charge of this entire branch and all rebel starfighter operations by Mon Mothma."}, {"tag": "h3", "text": "Support Services"}, {"tag": "p", "text": "Alliance Support Services oversaw the small number of transport and cargo craft maintained by the Alliance. Support Services also maintained all Alliance hospital ships and safe worlds. While not as glamorous as Fleet or Starfighter Command, it was nonetheless one of the most crucial."}, {"tag": "h3", "text": "Intelligence"}, {"tag": "p", "text": "Alliance Intelligence was responsible for keeping track of all Imperial units and maintaining undercover operatives. It was considered the most dangerous of all branches of the Alliance, including the fleet. Intel also maintained the Alliance's small fleet of deep space surveillance vessels and probe droids. The operatives of Intel often had to compile information from hundreds of sources just to put together a reliable picture on the activities of the Empire."}, {"tag": "h3", "text": "Special Forces"}, {"tag": "p", "text": "Composed of the Alliance ground forces. Small in number, due to the fact that most armies were local forces under Sector Forces, the SpecForces were elite forces marked by excellence of training, brilliant leadership, and high morale. SpecForce units defended High Command, were attached to the Fleet, and aided Sector Forces across the Galaxy."}, {"tag": "h3", "text": "Sector Command"}, {"tag": "p", "text": "This branch was tasked with coordinating the various Sector Forces, assigning assets, and ensuring that each sector worked in line with Alliance policy. There were thousands of Sector Forces scattered across the galaxy, making this task extremely difficult."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}