{"url": "Grand_Vizier", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Bureaucrats of the Galactic Empire", "Category:Political titles"], "nodes": [{"tag": "h1", "text": "Grand Vizier"}, {"tag": "p", "text": "The Grand Vizier was the head of the Imperial Ruling Council and chief deputy to the Emperor of the Galactic Empire. Acting as an intermediary between the Emperor and high-ranking officials in the Imperial Military as well as the government, the office of Grand Vizier was established in the aftermath of the Clone Wars and the Galactic Republic's transformation into the Empire. Mas Amedda, a Chagrian bureaucrat who served as Vice Chair of the Galactic Senate under two Supreme Chancellors, Finis Valorum and Sheev Palpatine, in turn, was granted the title of Grand Vizier after Palpatine's ascension as Emperor. Having consolidated his rule over the galaxy, Emperor Palpatine all but retreated to the privacy of the Imperial Palace, leaving the day-to-day affairs of state to Grand Vizier Amedda. Additionally, Amedda had the authority to rule as a proxy during the Emperor's absence from the Core World Coruscant, the Empire's capital planet."}, {"tag": "p", "text": "During the Galactic Civil War, Palpatine was killed at the Battle of Endor in 4 ABY, leaving the Empire without an Emperor. As the next highest-ranking official in the New Order, Grand Vizier Amedda assumed command of the Empire by default. However, he was unable to secure the greater galaxy beyond the capital, and could do little to prevent ambitious warlords from dividing the Empire into several remnant states, such as Governor Ubrik Adelhard's territory in the Anoat sector. Not even the throne world of Coruscant universally acknowledged the Grand Vizier's authority, having fallen into a state of civil war between Imperial loyalists and rebel sympathizers."}, {"tag": "p", "text": "Amedda would ultimately spend the final months of the war as a prisoner of Fleet Admiral Gallius Rax of the Imperial Navy. Using the Grand Vizier as a figurehead for propaganda purposes, Rax declared himself Counselor to the Empire, and therefore, became Emperor in effect while Amedda was sealed within the Imperial Palace. When a group of Coruscanti youths infiltrated the palace intending to assassinate the Grand Vizier, Amedda convinced them to rescue him instead, promising to end the war in return for his life. With the death of Rax and the defeat of the Empire at the Battle of Jakku in 5 ABY, Amedda signed the Galactic Concordance treaty, officially surrendering the Empire to the New Republic. In exchange, he was granted amnesty and allowed to resume his position as Grand Vizier on Coruscant, but in appearance only. Placed under the surveillance of Republic overseers, Amedda became the figurehead leader of a powerless provisional government on Coruscant."}, {"tag": "h2", "text": "Role and powers"}, {"tag": "p", "text": "During the era of the Galactic Empire, the Grand Vizier was a position of high prestige. Mas Amedda, formerly the Vice Chair of the Galactic Senate, bore the title during his time as one of Galactic Emperor Darth Sidious' most influential servants. However, the office's authority was curtailed as a result of the Empire's decline and subsequent fall in 5 ABY. Consequently, the role of Grand Vizier was reduced to a figurehead."}, {"tag": "p", "text": "As chief deputy, the Grand Vizier acted as an intermediary between the Emperor and his subordinates. His authority and duties included the right to summon high-ranking military officials; to receive visiting dignitaries such as governors; and to oversee the Empire's bureaucratic system as head of the Imperial Ruling Council. Additionally, the post wielded influence over the Imperial Security Bureau to the extent that ISB agents deviated from their routine on Vizier Amedda's recommendation. The Vizier's office was located in the Imperial Palace, the Emperor's headquarters on Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to the Age of the Empire, Mas Amedda served as Vice Chair of the Senate during the final years of the Galactic Republic. By the end of the Clone Wars in 19 BBY, Supreme Chancellor Sheev Palpatine anointed himself Emperor of the Galactic Empire. Amedda continued to serve Palpatine—who was the Sith Lord Darth Sidious—in the New Order, supplanting his title of Vice Chair with that of Grand Vizier."}, {"tag": "p", "text": "One of Amedda's earliest actions as Grand Vizier was to give a public demonstration on Coruscant, during which he trumpeted the end of the so-called tyranny of the Jedi Order and burned a collection of lightsabers from fallen Jedi."}, {"tag": "p", "text": "In 14 BBY, Vizier Amedda informed Moff Wilhuff Tarkin that he would undertake a mission to Murkhana alongside the Sith Lord Darth Vader. Around the same time, a group of insurgents stole the Carrion Spike, Tarkin's personal starship, and used it to attack Galidraan Station. Believing that the Empire could not afford to risk leaving acts of dissidence unpunished, the Grand Vizier rejected the Imperial Security Bureau's recommendation to let the Carrion Spike escape."}, {"tag": "p", "text": "Prior to the Galactic Civil War, Governor Arihnda Pryce of Lothal traveled to Coruscant, the galactic capital, to discuss her homeworld's industrial and mining sectors. Her arrival on the city-wide planet was greeted by the Emperor's Grand Vizier."}, {"tag": "p", "text": "By 4 ABY the reign of Emperor Palpatine ended with his death at the Battle of Endor. In the Emperor's absence, Vizier Amedda tried to hold the Empire together as a proxy emperor. However, the resultant succession crisis and simultaneous rise of the New Republic served to further destabilize the Empire, causing multiple remnants and rump states to emerge while Coruscant descended into rioting and civil war under Amedda's leadership."}, {"tag": "p", "text": "Within a year following the Emperor's death, the Grand Vizier was all but powerless while Fleet Admiral Gallius Rax consolidated the Empire's military under his leadership as Counselor to the Empire. At Counselor Rax's command, Amedda was imprisoned in the Imperial Palace and forced to broadcast propaganda speeches in support of his captor. Following Rax's death at the Battle of Jakku, the vizier was free to sign the Galactic Concordance. For his part in ending the war, the Republic allowed Amedda to resume his rule on Coruscant as the leader of a provisional government. However, to ensure that neither Amedda nor his government posed a threat to the new democracy, Republic overseers were stationed on the former galactic capital."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}