{"url": "Grande_Game", "categories": ["Category:Legends articles", "Category:Casinos", "Category:Genarius locations"], "nodes": [{"tag": "h1", "text": "Grande Game"}, {"tag": "p", "text": "Grande Game was a casino in the city of Depatar, in the gas giant Genarius."}, {"tag": "p", "text": "The casino was managed by Kelko, a Rodian entrepreneur. Unhappy with his profits, Kelko tended to be on his hall, to make sure people were spending money instead of talking to each other or other unproductive activities. He also took measures, including cheating, to stop any individual from winning too much in the same day—although Kelko did own permits to cheat."}, {"tag": "p", "text": "Although the Grande Game attracted working class customers, Kelko would rather attend richer people, so he decorated his club with the furnishing and signs he considered would do the trick; however, he did not manage to get the great sellouts he intended."}, {"tag": "p", "text": "The Game used a protocol droid, S2-36B, as the general translator for customers; the size of her tips affected the accuracy of her translations."}, {"tag": "p", "text": "A female silver-haired Near-Human, Aria, acted as if she worked in the Game by changing chips and serving drinks, as a way to convince Kelko to hire her. Kelko, however, was happy with his free worker and saw no reason to change her status."}, {"tag": "p", "text": "In 31 BBY, Jedi Knight Alec went to the Grande Game disguised as a Great White Wookiee Jedi. In the casino, he won so much money in the chance cube that Kelko retired the table for maintenance, and then left to put his gains in Box 113. Alec was with his pilot, Danil, and his permitor, Delan. Alec questioned other customers about the local industry; although Kelko disapproved of this, he could not stop him as he had all the required permits to question anyone."}, {"tag": "p", "text": "At that time, customers included Brute, the Gungan shoe salesman; Farfer, the Ithorian compulsive gambler; and Fritz, the Sullustan pilot."}, {"tag": "h2", "text": "Appearances"}]}