{"url": "Grappa_(Hutt)", "categories": ["Category:Legends articles", "Category:Crime lords", "Category:Hutts", "Category:Males"], "nodes": [{"tag": "h1", "text": "Grappa  (Hutt)"}, {"tag": "p", "text": "Grappa was a Hutt criminal who lived on Genon. At one point, he owned the starship Moldy Crow and employed the smuggler Roark Garnet."}, {"tag": "p", "text": "After the final death of Galactic Emperor Palpatine in 11 ABY, Grappa allied himself with the Imperial Ruling Council and its two leaders, Carnor Jax and Xandel Carivus. He helped supply the latter with bounty hunters and was engaged in business dealings with Boss Banjeer. He was also involved with Nom Anor. He kidnapped Feena D'Asta and had her replaced with a clone."}, {"tag": "p", "text": "Throughout all of his dealings with Black Sun and the Galactic Empire, Grappa's ultimate goal was galactic domination."}, {"tag": "h2", "text": "Criminal life and empire"}, {"tag": "h3", "text": "A new bounty hunter"}, {"tag": "p", "text": "In his palace on Genon, Grappa racketeered and profited from illegal business. He would throw underlings who failed him into a cage with a monster and watch them die. He employed various smugglers, bounty hunters, and pirates. One such group at his disposal was Sol Mon's pirate group, who hijacked and stole various ships' values and riches for Grappa. The group included a droid-loathing Gamorrean guard named Tront, who frequently caused Grappa to get his protocol droid, 4/NG, fixed by his \"techs\"."}, {"tag": "p", "text": "When an unknown bounty hunter, Kenix Kil, arrived at Grappa's docking bay, Grappa had him feathered in a room prepared for his arrival. Grappa had cameras installed in the room to find out Kil's true identity; however, Kil found one and jammed the other, which only angered Grappa more."}, {"tag": "h3", "text": "Deals with the Empire"}, {"tag": "p", "text": "Grappa met with Macus Kayniph during his reign. He gave Macus gree spice for Feena D'Asta, a clone of whom was made to decoy the fiendish plot. They drank to their deal. Little did Grappa know that his new court member, Mirith Sinn, heard the entire plot."}, {"tag": "p", "text": "After his deal with Macus, Grappa sent his new prisoner, Tarrant Snil, with his associates, the Zanibar, and started a party for the success of Kil. The party ended too soon when Grappa received an unwanted communication from \"the faceless one\"."}, {"tag": "p", "text": "Macus came to visit Grappa and another party ensued. During the party, Mirith Sinn went to free Feena. On her way out, Grappa stopped her in her tracks and introduced her to an old acquaintance, Massimo. Knowing that they both had knowledge of his hijackings, he sent them with the Zanibar. When one of the Zanibar could not find Kil, Grappa took his gun and shot him. Macus interfered, and Grappa, in a fit of rage, shot him in the chest and killed him. That was a mistake, for Y'ull Acib ordered that nothing happen to Macus, for if it did, it would go on Grappa's head. To explain his death to Acib, Grappa had all of his court killed in an \"accidental\" ship explosion. It failed to enthuse Acib."}, {"tag": "p", "text": "When the Zanibar brought in Kir Kanos, Grappa recognized him as Kil himself. When Acib told him to make sure nothing happened to Macus before his arrival, Grappa was ready to make a run for it."}, {"tag": "h3", "text": "His last mistake"}, {"tag": "p", "text": "When a New Republic strike force raided his palace, Grappa was surprised to see that Mirith Sinn escaped the Zanibar. Sinn forced Grappa into one of his own cells, where he remained until he was released by Schmood, a court member who did not go on Grappa's ill-fated ship. In return, Grappa pushed Schmood into the cell and locked it because Schmood did not help him when he was put into the cell in the first place."}, {"tag": "p", "text": "While getting ready to set sail for Tatooine to catch up with Sol Mon, Grappa was confronted by the Zanibar. When he refused to pay the price they agreed on for bringing in Kir Kanos, they chained him up to be used in their next \"ceremony\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}