{"url": "Grappling_spike_launcher", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Climbing equipment", "Category:Jedi equipment", "Category:Weapon attachments"], "nodes": [{"tag": "h1", "text": "Grappling spike launcher"}, {"tag": "p", "text": "The grappling spike launcher, also known as a liquid-cable launcher, was a device that launched a liquid that immediately solidified into a tough yet lightweight and flexible monofilament cable upon exposure to most habitable atmospheres."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "This grappling spike launcher could attach to grappling hooks or be used for swinglines. They were found across the galaxy for a price of about fifty credits, and were often used by bounty hunters, soldiers, mercenaries, explorers and emergency rescue teams. The Jedi also fabricated their own grappling spike launchers in their workshops on Coruscant, for use by Jedi Knights on field operations."}, {"tag": "p", "text": "The standard design featured a dual-strand liquid-cable reservoir, launching twin cables that wrapped around one another to create a much stronger line. During the Clone Wars, Jedi such as Anakin Skywalker and Obi-Wan Kenobi carried simple fibercord grappling hooks in their utility belts as opposed to liquid-cable launchers."}, {"tag": "p", "text": "The grappling spike launcher was a small device commonly carried in a Jedi's utility belt. It comprised a central unit containing a liquid-cable reservoir, a grappling hook in one end, and a spike launcher in the other end. The liquid-cable reservoir was large enough to form up to 200 meters of cable. When launched, the spike's liquid-cable would solidify, and would be fired with enough momentum to embed the spike in most surfaces—excluding materials such as tough metals or particle shielded surfaces. The hook could then be attached to a solid object to secure the line."}, {"tag": "p", "text": "Grappling spike launchers could be used by themselves or as attachments for blasters and blaster-rifles. When attached to blasters and/or blaster-rifles, this assembly (and sometimes the grappling-spike-launchers themselves) were called ascension guns."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Qui-Gon Jinn and Obi-Wan Kenobi were equipped with grappling spike launchers during their mission to Naboo in 32 BBY. When their Gungan bongo became caught in the current of the Virdugo Plunge in Theed, the Jedi used their grappling spike launchers to escape the doomed craft and reach dry land. Later, during the Second Battle of Theed, Captain Quarsh Panaka and Padmé Amidala used ascension guns that contained these devices to scale the Theed Royal Palace."}, {"tag": "p", "text": "Luke Skywalker and Mara Jade Skywalker used liquid-cable launchers during their explorations aboard Outbound Flight. In 44 ABY Luke Skywalker used a cable launcher on Pydyr in the hunt for Abeloth to descend to the cave by the sea."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}