{"url": "Alliance_Special_Operations", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic intelligence organizations"], "nodes": [{"tag": "h1", "text": "Alliance Special Operations"}, {"tag": "p", "text": "Alliance Special Operations, or SpecOps, was the organization that the Rebel Alliance assigned its most capable recruits. It had two levels of operation: Mission Groups and Special Ops Teams. Both were categorized by personnel that were exceedingly skilled, talented, and prone to cockiness."}, {"tag": "h2", "text": "Mission Groups"}, {"tag": "p", "text": "Mission Groups were the basic unit of SpecOps, with a nebulous position within the Alliance hierarchy. They \"floated\" between Alliance command, standard forces, and Sector Forces, capable of being \"loaned\" to the latter if needed but typically operating on a galaxy-wide level to perform their duties. Individual Mission Groups were often headquartered on Alliance starfighter bases, such as those at Tierfon, Cathis, Ansarra, and Dalastine, allowing them to refuel and resupply their galaxy-trotting starships (often light freighters of some sort) without interference; in return, the base got the often exceptional piloting abilities of the SpecOps personnel. This was not the only possible arrangement, however; some Mission Groups worked as roving agents, changing their base of operations as circumstances demanded. Yet other Groups were attached to Ordnance and Supply and Support Services."}, {"tag": "p", "text": "Though some missions they performed were similar to those of Alliance Intelligence, the patience and discipline often required by Intell operations tended to be the weak link among the cocky, energetic natures of typical SpecOps personnel. In fact, Mission Groups were often sent to worlds in which the cover of existing Intell operations were endangered to draw attention away from them. However, despite this, Mission Groups were sometimes attached to Alliance Intelligence's Operations department. Wookiee warriors often formed the muscle behind mission groups attached to Intell. Certain trusted mercenaries, hired by the Rebel Alliance, would often work as SpecOps personnel and were, formally at least, given the same status and privileges. This was the case of, for example, the mercenaries Kyle Katarn and Jan Ors."}, {"tag": "h2", "text": "Special Ops Teams"}, {"tag": "p", "text": "Special Ops Teams were \"advanced Mission Groups\" that had been cut off from the Alliance's command structure, answerable to only the highest echelons of the Alliance and receiving no support from other branches. Extremely capable, they rarely needed such assistance. Since they were authorized to act in the interests of the Alliance without orders from higher up the chain of command, when they were needed by a sector intelligence cell or Rebel outpost, Special Ops Teams received polite requests rather than actual orders. Mostly, they developed and executed their own operations on behalf of the Alliance without prompting."}, {"tag": "p", "text": "Some Special Ops Teams engaged in deep-cover missions, tapping into existing supply caches when necessary; just as often, they established their own network of supply caches, often as a prelude to establishing new Rebel cells in a new sector. Others roamed freely, doing that which they saw as needing doing. For the most part, the Alliance allowed these teams to wreak havoc upon the Empire without supervision, though in the uncommon cases where contact needed to be made, the Alliance could rely on mail drops, contacts, and even personal ads to get messages to Special Ops Teams in the field."}, {"tag": "h2", "text": "Special Operations and Special Forces"}, {"tag": "p", "text": "Though bearing similar names, Special Operations and Alliance Special Forces were two completely different groups. While Special Forces (SpecForce) were highly trained active military professionals, tasked with performing specific, carefully planned operations, Special Ops agents engaged in murky undercover missions and chaotic, unplanned operations with only minimal input from Alliance Command. Though SpecForce personnel recognized the need for SpecOps, and vice versa, rivalry between the two groups ran deep; SpecOps personnel viewed SpecForces as arrogant, uptight, and overtrained, and SpecForce personnel viewed SpecOps (or \"spooks,\" as they liked to call them) as amateurs who relied on luck to carry the day."}, {"tag": "p", "text": "SpecForces sometimes used Mission Group personnel as \"other specialists\" such as transportation specs, pilots, communication experts, translators, medical technicians, supply specialists, and so on. Such personnel were often referred to as \"recovering spooks\" by the SpecForce units they were attached to."}, {"tag": "p", "text": "Conversely, sometimes Special Forces troops were assigned to Special Operations units; these individuals were referred to as \"specters\" by other SpecForce personnel."}, {"tag": "h2", "text": "Special status"}, {"tag": "p", "text": "The SpecOps had special status within the Rebellion, which also meant that they had special privileges. For example, medical frigates would often reserve entire wards for SpecOps personnel. This was the case of the hospital ship Mercy, where ward 114 was reserved exclusively for Alliance SpecOp personnel and for mercenaries working as Rebel agents."}, {"tag": "h2", "text": "Notable SpecOps members"}, {"tag": "h2", "text": "SpecOps terms and jargon"}, {"tag": "p", "text": "This is a list of terms, jargon, and slang used by members of the Alliance to Restore the Republic SpecOps."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "See also"}, {"tag": "h2", "text": "Notes and references"}]}