{"url": "Alliance_Starbird", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Alliance to Restore the Republic", "Category:Galactic Alliance", "Category:New Republic", "Category:Symbols"], "nodes": [{"tag": "h1", "text": "Alliance Starbird"}, {"tag": "p", "text": "The Alliance Starbird, also known as the Phoenix, was the insignia of the Alliance to Restore the Republic. It adorned the flight helmets of a number of Rebel pilots during the Galactic Civil War. It adopted the Marek family crest."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Rebels adopted the symbol from the family crest of the Marek family in honor of Galen Marek, Darth Vader's former apprentice, who sacrificed himself protecting the three founders of the Alliance. However, by some accounts, the insignia had been taken from the seal of the Old Republic. And indeed, a similar winged seal had been used by the Republic at the time of the Great Galactic War."}, {"tag": "p", "text": "Often described as a rising phoenix, the Starbird represented the Alliance's goal of setting the stage for the Galactic Republic to rise again from the ashes of the Galactic Empire that it swore to topple. The Starbird most often appeared in bright red or blue but was also sometimes displayed in yellow, black, or gray."}, {"tag": "p", "text": "When the Alliance became the New Republic, the Starbird was retained as the central image of the new government's insignia.\nAdar Tallon's family crest resembled an altered Starbird symbol."}, {"tag": "p", "text": "Ultimately this symbol was used for a variety of different governments, including: the Alliance to Restore the Republic, the Alliance of Free Planets, and the New Republic. A modified version existed that was used by the Galactic Federation of Free Alliances, the Alliance-in-exile, and over a century after Marek's death, the Galactic Alliance Remnant and the Galactic Federation Triumvirate. What's more, the Starbird was very similar to the emblem of the Old Jedi Order, if somewhat modified, and later it became the symbol of the New Jedi Order and then of the temporary Jedi Coalition."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A panel in Republic 78 shows a dark Starbird painted on the bow of a Dreadnaught-class heavy cruiser. This might indicate either the Starbird was in use by the Republic during its late days, or that the vessel was serving under the auspices of the Marek family."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}