{"url": "Grath_(dark_trooper)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Dark troopers", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Grath  (dark trooper)"}, {"tag": "p", "text": "Grath was a male dark trooper assigned to Dark Jedi Zasm Katth and Baddon Fass during their search for the starship Millennium Falcon on the moon Nar Shaddaa in 10 ABY. When the two Dark Jedi sensed the presence of Jedi Knight Vima-Da-Boda in the crowds of Nar Shaddaa, Fass ordered Grath to unleash fire upon the civilians with his turbocannon. The dark trooper complied with the order, killing a large number of innocent bystanders but failing to execute the elusive Jedi."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The elite of the Empire"}, {"tag": "p", "text": "Grath was a male stormtrooper who served the reborn Galactic Emperor Palpatine's Dark Empire during the Galactic Civil War. At some point, Grath was inducted into the ranks of dark troopers, an elite group of black-armored stormtroopers empowered with the dark side of the Force. In 10 ABY, Grath and a number of other dark troopers and regular stormtroopers were dispatched on a mission to the moon Nar Shaddaa."}, {"tag": "p", "text": "Commanded by Zasm Katth and Baddon Fass—two of Palpatine's Dark Jedi and members of the Dark Side Elite—the Imperial forces were assigned a set of missions to accomplish on the moon. Grath and the rest of the troops under the Dark Jedi's command were to contact the bounty hunter Boba Fett and recruit him on a search for the Millennium Falcon, the starship belonging to the New Republic heroes Han Solo and Leia Organa Solo. Additional objectives included reporting on any potential sightings of the Millennium Falcon to the leader of the Dark Side Elite, Executor Sedriss QL, and eliminating the fugitive Jedi Knight Vima-Da-Boda, who had taken shelter on Nar Shaddaa."}, {"tag": "h3", "text": "Massacre on Nar Shaddaa"}, {"tag": "p", "text": "After Katth and Fass failed to recruit Fett to their cause, they received intelligence from dark trooper team two, which had spotted the Millennium Falcon landing inside the hangar of the local mechanic Shug Ninx and had engaged the New Republic starship. Grath then accompanied the two Dark Jedi and several other stormtroopers as they navigated through the streets of Nar Shaddaa to reinforce team two and to seize the Millennium Falcon. However, as Katth and Fass were passing through one of the crowded streets, they both sensed the presence of Vima-Da-Boda nearby."}, {"tag": "p", "text": "Following their orders from Sedriss to kill the elderly Jedi woman, Fass ordered Grath to arm his turbocannon and fire at the crowd. Grath followed the orders without question, unloading a barrage of fire at innocent bystanders. The indiscriminate attack killed a large number of people, yet it failed to harm Vima-Da-Boda, who escaped into the lower levels of Nar Shaddaa, where she was eventually found by the Solos."}, {"tag": "p", "text": "Grath's superiors soon reached Ninx's hangar, where they found the Millennium Falcon abandoned and the entirety of the Imperial forces wiped out. Taking the bodies of their fallen soldiers, Fass and Katth returned to the Imperial-class Star Destroyer Invincible in orbit of the moon, leaving only a small detachment of stormtroopers to guard the Millennium Falcon. However, that team was also killed by Solo and his allies when they returned to reclaim their ship."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Grath followed the orders of his superiors, Fass and Katth, on Nar Shaddaa, massacring multiple unarmed civilians just to try and kill the elusive Jedi Vima-Da-Boda, although he failed to achieve that goal."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a dark trooper, Grath's skills were augmented with the dark side of the Force, and he received limited Force training to become a more deadly combatant than his compatriots in the Stormtrooper Corps."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Grath wore a set of black-colored stormtrooper armor on Nar Shaddaa. During the mission to the moon, he wielded a turbocannon, strapped over his shoulder."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Grath first appeared in the comic book Dark Empire II 2, written by Tom Veitch and illustrated by Cam Kennedy. It was published by Dark Horse Comics on January 24, 1995."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}