{"url": "Grav-ball", "categories": ["Category:Canon articles", "Category:Stub", "Category:Grav-ball"], "nodes": [{"tag": "h1", "text": "Grav-ball"}, {"tag": "p", "text": "Grav-ball was a popular sport throughout the galaxy. The sport was often played on the planet Lothal and was big at the Junior Academy of Applied Sciences, which hosted a team called the AppSci SaberCats. During his time at this academy, Zare Leonis was selected as center striker for the team, with his girlfriend Merei Spanjaf playing as the kicker."}, {"tag": "p", "text": "In the time of the Resistance and the First Order, collecting grav-ball badges was a popular pastime among youths."}, {"tag": "p", "text": "In some versions of the sport, hover boots were worn while playing, but these were not used under Corellian rules or on the planet Lothal."}, {"tag": "h2", "text": "Rules"}, {"tag": "p", "text": "Grav-ball had several positions—the center striker, two strikers, wing attackers, a kicker, two fullbacks, two defenders and a keeper. The game had several different sets of rules, such as Corellian rules. It was played on a 64-meter grid which was divided into eight octets. The roll of a chance cube determined which team would start at the center line dividing the fourth and fifth octets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Grav-ball first appeared in the comic X-Wing Rogue Squadron 25 and was later featured in a number of other stories in the continuity of Star Wars Legends. Though these stories are no longer considered canon, grav-ball was featured in the Star Wars Rebels story Servants of the Empire: Edge of the Galaxy, which featured a detailed description of the sport along with depictions of grav-ball matches. The title's author describes the sport as depicted as \"like American football with a bit of net-ball and a touch of hockey.\" He also stated that omitted the use of hover boots from the sport as he did not want it to feel unnecessarily \"spacey.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}