{"url": "Gravcouch", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Furniture", "Category:Gravitational technology"], "nodes": [{"tag": "h1", "text": "Gravcouch"}, {"tag": "p", "text": "A gravcouch, or grav couch, was a type of furniture for individuals to sit upon. During the Galactic Civil War, gravcouches with inertial damping technology were used aboard the Galactic Empire's Spiral-class Assault Ships to protect the crew and passengers when the ship rammed other vessels in order to board them. Additionally, the Iyra sentientologist Tem Eliss had one of the couches in his office at the University of Sanbra."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A gravcouch, also spelled as grav couch, was a type of furniture used as seating. Some gravcouches were used on starships and were designed with inertial-damping technology in order to protect individuals from being injured in collisions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, following the Battle of Yavin, the Galactic Empire's Spiral-class Assault Ships were equipped with gravcouches. The inertial-damping technology in the gravcouches helped protect the vessel's passengers and crew when it rammed into another ship as part of its role as a boarding craft. The two captured Spiral-class Assault Ships used by the Alliance to Restore the Republic to board the Imperial Container Train Black Ice over the planet Refrax were equipped with gravcouches."}, {"tag": "p", "text": "Around 2 ABY, the Rodian pirate Safonne Pendon had gravcouches along the walls of the lounge outside his office on his Corellian Corvette Safonne's Sword when he met with the Ithorian pirates known as the Venithon Twins."}, {"tag": "p", "text": "In addition to ships, gravcouches were also sometimes used in other settings. The Iyra sentientologist Tem Eliss had a gravcouch in his office in the Sentient Studies Department at the University of Sanbra during the Galactic Civil War. When an Abinyshi named S'itl Thirr paid a surprise visit to Eliss one day, the Iyra asked his visitor to have a seat on the gravcouch."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The grav couch first appeared in Black Ice, a 1990 adventure book written by Paul Murphy and Bill Slavicsek for Star Wars: The Roleplaying Game by West End Games. The furniture later appeared with the spelling \"gravcouch\" in the short story \"An Offer They Couldn't Refuse\" in the 1995 West End Games sourcebook Alliance Intelligence Reports and in the short story \"An Extinct Guest,\" which was part of the \"Alien Encounters\" article in Star Wars Adventure Journal 14. As the \"gravcouch\" spelling is more widely used, this article uses the gravcouch spelling for consistency."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}