{"url": "Grave_Tuskens", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Mercenaries", "Category:Sulonese", "Category:Swoop gangs", "Category:Tusken Raider groups"], "nodes": [{"tag": "h1", "text": "Grave Tuskens"}, {"tag": "p", "text": "The Grave Tuskens were a mercenary swoop gang comprising Tusken Raiders. Originally, the Dark Jedi Maw used the Grave Tuskens as a personal strike force."}, {"tag": "h2", "text": "Purpose"}, {"tag": "p", "text": "No one knows how Maw gained the services of the Grave Tuskens. What is known is that they were taken from their home on Tatooine and trained to be Maw's personal strike force. They were only a few hundred in number and strangely, they were trained in the use of modified (so as to be easier to use for weaker beings) Wookiee bowcasters. Maw used them to plunder artifacts from the tombs of both light and dark Jedi, which was how they earned their grisly name."}, {"tag": "p", "text": "When Maw joined Jerec on his search for the Valley of the Jedi, the Grave Tuskens were stationed on Sulon at the insistence of Boc, who felt that \"something wasn't right.\" They roamed the wastelands outside of Barons Hed. Boc was correct, but didn't find out until much later when 8t88 and Yun reported that Morgan Katarn's son had come after them, cutting a swath through the Tuskens as he went."}, {"tag": "p", "text": "The survivors of Sulon found their way off the agricultural moon, and, finding their master dead, became rare and sought after bounty hunters and bodyguards for crimelords all over the galaxy."}, {"tag": "p", "text": "Rogg became the Grave Tusken leader in 2 ABY, with Bordo being his second-in-command. Both were killed in an incident in 5 ABY involving also Kyle Katarn and WeeGee, along with their employers, leaving the Grave Tusken leadership in doubt."}, {"tag": "h2", "text": "Apparel"}, {"tag": "p", "text": "Their uniforms were different from the traditional cloth wrappings of the Sand People, being bluish gray uniforms or sandy brown armor. Their masks only covered half their faces which defied the traditional law of the Sand People not to show skin, resulting in being banned or beaten to death if doing so."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Tusken warriors appear in Mysteries of the Sith in and around Ka'Pa's palace. They are identical to the Grave Tuskens of Star Wars: Jedi Knight: Dark Forces II (they are seemingly based on the same CGI model) and also carry bowcasters. It is never clear, however, whether these are indeed Grave Tuskens or ordinary Tusken Raiders, since it is never clear what planet Ka'Pa's operations are based on."}, {"tag": "p", "text": "In Star Wars: Jedi Knight II: Jedi Outcast, the Weequay mercenaries fight in the same style as these warriors. They even wear the same style of armor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}