{"url": "Gravestone", "categories": ["Category:Legends articles", "Category:Eternal Alliance", "Category:Frigates", "Category:Iokath technology"], "nodes": [{"tag": "h1", "text": "Gravestone"}, {"tag": "p", "text": "The Gravestone was a massive alien combat frigate that was able to defeat the Eternal Fleet, a fleet of droid-controlled warships that was systematically destroying all life within Wild Space, with its powerful Omnicannon. The Gravestone disappeared after the battle with the fleet, scuttled in the Endless Swamp of the planet Zakuul. Centuries later, it was discovered by the crew of the Outlander, who repaired the starship and used it to escape Zakuul. The Gravestone became the mobile base of the Outlander's group prior to the establishment of the Alliance on Odessen."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The Gravestone was a combat frigate built by a group of scientists in the planet of Iokath, centuries before the Galactic War between the reconstituted Sith Empire and the Galactic Republic. The Gravestone's powerful Omnicannon was capable of targeting an enemy starship and spreading the damage to other nearby vessels, which proved incredibly useful against the Eternal Fleet—a massive fleet of unstoppable warships controlled by sentient droids that was decimating all life it encountered. In a massive battle, the Gravestone defeated the Eternal Fleet and deactivated it, leaving the ships dormant somewhere in Wild Space. The Gravestone was believed lost, though in actuality its builders scuttled the frigate and set it down in the Endless Swamp of the planet Zakuul, where it remained for centuries."}, {"tag": "h3", "text": "Rediscovery"}, {"tag": "p", "text": "It was finally rediscovered by Koth Vortena, Lana Beniko, HK-55 and the Outlander after crashing in the swamp following a rescue mission to free the Outlander from the Spire. The group repaired the vessel and managed to escape Zakuul in the Gravestone, using the Omnicannon to punch a hole in the Eternal Fleet—now under the control of Arcann, Emperor of the Eternal Empire. The Gravestone managed to limp to the nearby shadowport Asylum, where the ship was repaired and Vortena's old crew joined the vessel. The droid intelligence SCORPIO joined the Outlander's crew in order to speak with the Gravestone's central computer, seeing it as an intelligence that rivaled her own; upon connecting with the ship, she was able to repair and revitalize many of its systems—just in time to use them during the Battle of Asylum, when the Outlander's crew escaped the Eternal Fleet's blockade and assault upon Asylum. The Gravestone traveled to the planet Odessen, where it remained docked with the Outlander's fledgling Alliance constructed base in the cliffs nearby."}, {"tag": "p", "text": "The Alliance inner circle later took the Gravestone on a mission to seize an Eternal Fleet warship in hopes of using GEMINI Prime to take control of the whole network. The Gravestone kept the battlecruiser occupied as a boarding party, composed of the Outlander, Lana, Senya Tirall, SCORPIO and Theron Shan, managed to board the ship. However, the mission went south as the GEMINI captain broadcast a distress signal. After getting the boarding party, sans SCORPIO, along with two pods of prisoners, the Gravestone escaped into hyperspace as Arcann's flagship and the Eternal Fleet arrived. While in hyperspace, the Gravestone received a transmission from SCORPIO, who had faked her destruction and had taken control of most of the Eternal Fleet."}, {"tag": "h3", "text": "The Battle of Odessen"}, {"tag": "p", "text": "The Gravestone later defended Odessen against Arcann after SCORPIO leaked its location. With Theron manning the omnicannon, the Gravestone fired two shots that destroyed a portion of Arcann's support ships, enabling the Outlander and a strike team to board and disable the Eternal Flagship's weapons and shields. The omnicannon soon malfunctioned as SCORPIO attempted to remotely take control of the ship, but was shut out by Koth. Subsequently repairing the omnicannon, the Gravestone fired at the Flagship just as the Eternal Fleet grouped together to charge up a powerful energy attack, causing a massive explosion that destroyed the Flagship and the Fleet, saving the Alliance from annihilation."}, {"tag": "h3", "text": "The Invasion of Voss"}, {"tag": "p", "text": "The Gravestone later saw action over the planet Voss, defending the planet from being decimated by the Eternal Fleet, before the arrival of the Sith Empire drove off the enemy."}, {"tag": "h3", "text": "Return to Iokath"}, {"tag": "p", "text": "The Gravestone later responded to a distress call from a cargo freighter called Ridala, which was under attack by two Eternal Fleet ships. Koth allowed the Ridala to dock aboard the ship, unaware that it secretly contained Empress Vaylin and SCORPIO, who had taken advantage of the Outlander's apparent demise on Dromund Kaas to seize the Gravestone. Koth managed to remain at large while the rest of his crew were taken captive by Vaylin, and managed to send a distress call to Odessen. With the bridge controls and weapons locked by a special passcode of Koth's, preventing Vaylin and SCORPIO from taking control of the ship, the Empress interrogated his second, Len Parvek, who revealed under torture that the passcode was based on Koth's war record on the soldiers who died under his command."}, {"tag": "p", "text": "As the Alliance fleet engaged the Eternal Fleet, the Outlander and Lana Beniko boarded the Gravestone to retake the ship. Koth then informed them that he had secretly placed a quantum bomb onboard the ship that would go off if SCORPIO unlocked the bridge control without his secondary passcode. The Outlander and Koth worked to disable three bomb fuses before heading to the bridge, finding the latter's crew left alone. A hologram of SCORPIO revealed she knew of the quantum bomb, as she wished to preserve the Gravestone, and that Beniko was fighting Vaylin in the dark sanctum of the ship, where Koth hid the bomb."}, {"tag": "p", "text": "As the Outlander fought Vaylin, their fight accidentally set the bomb off on a three minute timer. Just as Vaylin had the advantage over her foe, Valkorion directly intervened, activating his daughter's mental conditioning with the phrase, \"Kneel before the dragon of Zakuul\", forcing the Empress to retreat. With the bomb about to go off, the Outlander destroyed any nearby power relays, allowing Koth to defuse the bomb. Soon after, Theron Shan brought a small Alliance squad with him aboard the ship. Unfortunately, with the Gravestone no longer in danger, SCORPIO, revealed to be operating under her own agenda, seized control of the ship and discovered the location of Iokath, in which she promptly set a course"}, {"tag": "p", "text": "As the Gravestone entered Iokath's superstructure, the occupants were soon incapacitated by a planetary energy weapon fired by ARIES, the only sentient droid caretaker of the planet, who then spread both the Outlander and Vaylin's crews across the planet to place in impossible \"tests\" to determine who was worthy of inheriting Iokath. The Gravestone was then impounded at a fleet spire along with the Eternal Fleet."}, {"tag": "p", "text": "Theron repeated attempted to scan for the Gravestone's location with no success before deciding to scan for his shuttle docked in its hanger. He then remotely piloted his shuttle to the Outlander's party's location and after dropping their leader off at ARIES' base, flew to the Gravestone's location. The Gravestone then returned to ARIES base to retrieve the Outlander and managed to escape Iokath before the energy weapon overloaded and flooded the planet with lethal radiation. Upon their return to Odessen, the Alliance got to work upgrading the Gravestone with datafiles recovered from Iokath to improve its combat abilities, rendering it inoperative for the time being."}, {"tag": "h3", "text": "The Second Battle of Odessen"}, {"tag": "p", "text": "The new upgrades were nearly complete when Vaylin led a second assault on Odessen. The Outlander, who had returned after chasing Vaylin to Nathema, defended the Gravestone, giving the crew enough time to finish the upgrades so the frigate could join the battle."}, {"tag": "h3", "text": "The Battle of Zakuul"}, {"tag": "p", "text": "Following Vaylin's defeat, The Outlander headed to Zakuul to seize the Eternal Throne. The Gravestone's omnicannon allowed the strike group to break the blockade around the Spire and land on the surface of the planet."}, {"tag": "h3", "text": "Nathema Conspiracy"}, {"tag": "p", "text": "Upon the Alliance mission to Nathema, the Gravestone was hijacked by Zildrog and used to destroy the Eternal Fleet. Afterword, it was poised to destroy Odessen, but was thankfully stopped after the Alliance Commander destroyed Zildrog, destroying the Gravestone and Eternal Throne in the process."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gravestone first appeared in BioWare's 2016 expansion Knights of the Eternal Throne to its 2011 massively multiplayer online role-playing game, Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}