{"url": "Gravity", "categories": ["Category:Canon articles", "Category:Articles needing additional sources", "Category:Gravity", "Category:Physics"], "nodes": [{"tag": "h1", "text": "Gravity"}, {"tag": "p", "text": "Gravity was the attraction between two bodies, dependent on their mass and the distance between them. As all planets, moons, and stars exerted gravity, the larger a body was, the more gravity it had, and the harder it \"pulled\" other objects towards its center. As such, gravity was what allowed living beings and other species to regard it as what kept things \"down,\" or empirically allowed them to stay on their feet and caused dropped objects to fall. In realspace there was no apparent gravity, so starships and space stations needed to artificially generate it. Satellites and other orbiting objects maintained their positions by finding the perfect balance between gravity and the object's forward motion toward the gravitational source."}, {"tag": "p", "text": "Throughout modern galactic civilization, the reliance on gravity-manipulating technologies that had existed for millennia allowed for interstellar travel and basic flight. Repulsorlifts allowed a craft to hover or fly over a planet's surface by pushing against its gravity, thereby producing thrust, while acceleration compensators kept starship crews alive during high-speed maneuvers. Other technologies such as tractor beams manipulated gravitational forces to push or pull objects."}, {"tag": "p", "text": "Despite the banality of many gravity-based technologies, many factions throughout galactic history attempted to increase the military and civilian applications of the force, with the Galactic Empire developing gravity well projectors which could pull a ship out of hyperspace by creating interdiction fields and thus gravitational shadows in the direction of an oncoming vessel. During the Clone Wars, clone troopers were equipped with magnetized boots to traverse environments with zero gravity."}, {"tag": "p", "text": "Most humans and humanoid species were able to deal with an average amount of gravity, with less allowing greater movement—such as the ability to jump higher than normal—and more hindering mobility by requiring greater energy to move about. Sirpar was a planet with higher gravity than what humans were generally used to, which made conditions challenging for human Imperial cadets participating in training exercises. Species that evolved on planets with heavy gravity tended to develop dense muscle fibers and fast reflexes that made them formidable adversaries on worlds with standard gravity."}, {"tag": "p", "text": "Vessels traveling in space generated internal artificial gravity which kept occupants from experiencing weightlessness and drifting inside."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}