{"url": "Gravity_well_projector/Legends", "categories": ["Category:Legends articles", "Category:Gravitational technology", "Category:Gravity"], "nodes": [{"tag": "h1", "text": "Gravity well projector"}, {"tag": "p", "text": "A gravity well projector was an apparatus used to create interdiction fields. By simulating the gravity shadow of a planet or other celestial body, often called a gravity well, a ship's travel through hyperspace could be halted or their jump to hyperspace could be rendered impossible within the simulated gravity shadow. These generally large gravity well generators were most often used to counteract hit-and-run tactics and pin outmaneuvered or outnumbered enemies in place. Through history, however, other strategic uses for the technology have been seen."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Since the advent of the hyperdrive the ability to interdict hyperlane traffic forcibly was seen as an obvious strategic goal. Hyperlane interdiction technology however has had a tumultuous history. Thousands of years before the Battle of Yavin, the peak of interdictor technology was represented by the warship Leviathan. Although it could stop the hyperdrives of its day, the Leviathan was considered grossly inefficient by later standards due to the widespread use of improved hyperdrive sensors and null quantum field generators. As of 27 BBY, the interdiction technology of the Leviathan hadn't been used by the Galactic Republic for centuries, and indeed many had forgotten that the technology even existed. However gravity well projection technology was reapplied by Republic scientists during the Clone Wars. In the eras of the Empire and the New Republic, the Immobilizer 418 was the most commonly used interdictor, such that in common usage the term \"interdictor\" became synonymous with that specific class of ship."}, {"tag": "h3", "text": "Vagaari"}, {"tag": "p", "text": "The nomadic Vagaari also utilized gravity well projectors, which were used to prevent targets of their conquest from escaping. It is unclear whether the Vagaari actually developed the technology, or stole it from one of the races they conquered. One of their projectors was captured by Force Commander Mitth'raw'nuruodo of the Chiss Expansionry Fleet in 27 BBY, allowing the Chiss Ascendancy to study the technology. The captured projector was installed in the small Chiss cruiser Whirlwind with no mention of existing equipment being removed to accommodate it, indicating that Vagaari gravity well projectors were relatively small. On the other hand, it was relatively primitive by Republic standards, as it required to have several easily destroyed stations deployed separately for optimum effectiveness, and so could not be built into a ship."}, {"tag": "h3", "text": "Centerpoint"}, {"tag": "p", "text": "One of the many functions of the ancient Centerpoint Station in Corellian system was to produce a colossal artificial gravity well. This ability was first revealed in the early stages of the First Corellian Insurrection in 18 ABY, when an interdiction field spanning the entire Corellian system was activated, making immediate intervention by the New Republic impossible. This made Centerpoint the most powerful gravity well projector in Galactic history. It was even theorized that Centerpoint could, by networking the Corellian system's planetary repulsors and tapping the gravitic potential of Corell itself, create an interdiction field spanning the entire Galaxy, and thus make all hyperspace travel impossible."}, {"tag": "h3", "text": "Hapes"}, {"tag": "p", "text": "The Hapes Consortium's pulse-mass mines were a related technology. Hapan Battle Dragons were equipped with 16 pulse-mass mine launchers, and could launch hundreds of the mines to prevent hyperspace travel. While these mines had the distinct advantage of being more difficult to eliminate than an Interdictor cruiser (they presented much smaller targets, and each individual mine had to be located and destroyed), the downside was that they could not be deactivated by the Hapan vessels. This meant that even if the Hapan ships were being overwhelmed by the enemy force, retreat was impossible until the mines' power was depleted. Thus, Hapan commanders would only utilize their pulse-mass mines if they were confident that victory was assured, or when retreat was not an option. Pulse-mass mines were vital to the Hapan victory in the Battle of Dathomir."}, {"tag": "h3", "text": "Other"}, {"tag": "p", "text": "One year after the Battle of Yavin, Alliance High Command learned that the Empire apparently was experimenting with gravity well projectors on a planetary surface. As a gravity well projected on a planet's surface could cause severe earthquakes or even deform the entire globe, the Alliance decided to send a strike team to destroy the facility housing the projector."}, {"tag": "p", "text": "An Empress-class space station named Yag-prime was built by the Rebel Alliance over Yag'Dhul during the Galactic Civil War. Warlord Zsinj held the station in 6 ABY. However, the station was captured from his forces by the New Republic, and became (with the permission of the Givin government) the site of Rogue Squadron's orbiting base for training during the Bacta War. It was during this time that Booster Terrik, the manager of the station, acquired a gravity well projector from Talon Karrde and had it installed on the station. It was later used in conjunction with the station's tractor beams to trap the Lusankya when it arrived in system."}, {"tag": "h2", "text": "List of gravity well projector-equipped starship classes"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the game Star Wars: Empire at War, there existed orbital stations that possessed gravity well generators which would prevent an enemy fleet from escaping the battlefield, but whether these were common or not is unknown."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}