{"url": "Gray_Jedi", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Gray Jedi"], "nodes": [{"tag": "h1", "text": "Gray Jedi"}, {"tag": "p", "text": "The term Gray Jedi, or Gray, had two meanings. First, it was used by Jedi and Sith to describe Force-users who walked the line between the light and dark sides of the Force without surrendering to the dark side, and second, it described Jedi who distanced themselves from the Jedi High Council and operated outside the strictures of the Jedi Code. However, those who were considered to be true Gray Jedi met both qualifications and did not belong to any particular Force tradition. One example was Jolee Bindo, a former Jedi Padawan and a Gray Jedi that served the Old Republic."}, {"tag": "p", "text": "Although the term did not directly refer to those who were capable of using both light and dark side Force abilities, all Gray Jedi could do so. The term was similar to that of \"Dark Jedi\" in that it could refer to any Force-user, and not only to Jedi."}, {"tag": "p", "text": "The term was sometimes used to refer to unorthodox or dissident Jedi who did not meet the strictest requirements of being a Gray Jedi. For example, the Jedi Qui-Gon Jinn was thought of by some members of the Jedi Order as a Gray Jedi for his disagreements with the High Council. A group of renegade Jedi called the Gray Paladins used the term this way to describe themselves - they advocated minimal reliance on the Force and the use of blasters, but otherwise held to the Jedi Code."}, {"tag": "p", "text": "The term dated back as far as the Old Sith Wars, when the High Council attempted to consolidate their power and centralize the Order. Some Jedi felt that the Council did not have the authority to reinterpret the Jedi Code, and considered themselves beholden only to the Force. These early Gray Jedi clashed with the Council over new strictures of the Code, such as those barring attachment or restricting training. During this time period, Gray Jedi became associated with a certain variety of robe; Bindo wore a version of these robes. The term was later used by the New Jedi Order to refer to entire Force traditions that held views which differed from that of the Jedi, but did not embrace the dark side. The Jensaarai and the Imperial Knights were two such organizations."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Great Sith War – Cold War"}, {"tag": "p", "text": "In the days of the Old Republic, the Jedi Order was largely decentralized. At this time, Jedi academies were spread throughout the galaxy. Jedi were also trained by individual Masters without the benefit of an academy. This decentralization meant that Jedi were accepted into the Order, trained, and Knighted without ever having to visit the galactic capital, Coruscant. Unlike the Jedi of later years, the Jedi at this time were fractious and unwilling to bow to their own central authority—the Jedi High Council."}, {"tag": "p", "text": "However, between the beginning of the Great Sith War in 4000 BBY and the end of the Dark Wars in 3951 BBY, the Jedi went from the height of their power to a mere remnant of their existence. As war repeatedly spread across the galaxy, some Jedi came to believe that a strong central authority was necessary. The Council, including such members as Vrook Lamar and Atris, revised the Jedi Code in order to consolidate their control over the Jedi Order and institute stricter standards on the conduct of its members. Despite the Council's actions, not all Jedi adhered to the revised Code. Some objected to several of the new strictures, such as those that barred the training of any Jedi hopeful over the age of four, that prevented Jedi from having families, and that restricted the use of Force abilities associated with the dark side. These individuals frequently clashed with the Jedi Council, and were known as Gray Jedi to the Jedi and the Sith."}, {"tag": "p", "text": "The Jedi Padawan Jolee Bindo fought for the Galactic Republic in the Great Sith War against the Sith Lord Exar Kun, who sought to establish a new Golden Age of the Sith. After the war ended in 3996 BBY, Bindo abandoned the Jedi Order and became a Gray Jedi. In 3956 BBY, Bindo again took part in major galactic events when he joined the amnesiac Jedi Revan and fought against Dark Lord of the Sith Darth Malak's Sith Empire until the end of the Jedi Civil War, after which he was officially recognized by the Galactic Republic for his actions. Some Old Republic Gray Jedi wore custom, gray robes. Bindo once wore a unique version of these robes."}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the reconstituted Sith Empire, shortly after the implementation of the Treaty of Coruscant in 3653 BBY, the Voss species was discovered on the planet of the same name. Voss society, isolated in the mountain-top fortress of Voss-Ka, was led by the totalitarian control of the Voss Mystics, who were considered to be Gray by the Jedi and the Sith. Led by the visions of the Mystics, the Voss had been defending their capital city from the assault of the hostile Gormak species for centuries before they revealed themselves to the larger galaxy by foiling occupation plots by both the Republic and the Empire. Both galactic governments then established embassies in Voss-Ka. The Voss Mystics rejected the offering of teaching from the Jedi and Sith in favor of their own dogma."}, {"tag": "h3", "text": "New Sith Wars – Second Imperial Civil War"}, {"tag": "p", "text": "Shortly after the end of the New Sith Wars and the Ruusan Reformations in 1000 BBY, the Jedi Chief Librarian Restelly Quist wrote about Gray Jedi in the Jedi training manual The Jedi Path. Quist described Gray Jedi as mavericks and classified them as a threat to Jedi teachings."}, {"tag": "p", "text": "Centuries later, during the Stark Hyperspace War in 44 BBY, some Jedi were considered as Gray simply for clashing with the High Council, not necessarily for experimenting with the dark side. The Jedi Qui-Gon Jinn was thought of as a Gray Jedi by some members of the Order for his frequent disagreements with the Council. Jedi Master Tyvokka expressed concern over this and Master Obi-Wan Kenobi confessed that he could see why some might view Jinn as a Gray Jedi. A faction of dissident Jedi at this time used the term \"gray\" to describe themselves despite their dedication to the Jedi Code. This group, the Gray Paladins, was an offshoot of the Teepo Paladins."}, {"tag": "p", "text": "Around 19 BBY, near the end of the Clone Wars, a new sect of Gray Jedi was inadvertently created when Jedi Master Nejaa Halcyon led a strike team to Susevfi to confront the fallen Jedi Nikkos Tyris and his followers. Tyris had been studying the writings of Larad Noon, a Sith follower of Kun's during the Old Sith Wars. Tyris and his most elite followers were killed by the Jedi strike team, but there were other members of the cult of whom the Jedi had not been aware and who survived the attack. These survivors were unable to interpret the advanced dark side teachings in Noon's writings and instead developed a unique Force tradition known as the Jensaarai. When the Galactic Empire came to power, some Jensaarai offered their services to Emperor Palpatine and were slain. In response, the Jensaarai retreated into hiding. They re-emerged in 11 ABY and became allies with the New Jedi Order. While the New Jedi Order was willing to accept Jensaarai students at the Jedi Praxeum, they considered the entire order to be Gray Jedi, although the Jensaarai outwardly denied these claims. Kelbis Nu, a Jensaarai who was later trained as a Jedi, participated in the Yuuzhan Vong War in 26 ABY."}, {"tag": "p", "text": "Some time after 41 ABY, when Jagged Fel was selected as the Head of State of the Galactic Empire, a sect of Force-users modeled after the Jedi Order and loyal to the Empire was established. The members of this organization became known as Imperial Knights, and were considered to be Gray Jedi by the Jedi Order. The Imperial Knights served the Empire for three generations. During the Sith–Imperial War in 127 ABY, Emperor Roan Fel refused to allow the Imperial Knights to participate in the conflict for fear that they would fall to the dark side, and they instead served as his personal bodyguards. When Darth Krayt, leader of the One Sith, plotted to assassinate Fel at the conclusion of the war, four Imperial Knights acted as decoys for the Emperor and were killed as Fel made his escape. Seven years later, Emperor Fel reappeared on the planet Bastion, where he founded the Empire-in-exile and initiated the Second Imperial Civil War, in which the Imperial Knights were a major factor. Imperial Knights participated in the assassination attempt against Darth Krayt on Had Abbadon."}, {"tag": "h2", "text": "Traits and techniques"}, {"tag": "p", "text": "Gray Jedi called on the dark side of the Force, but were not corrupted by it and did not embrace it entirely. In fact, some Gray Jedi opposed those who embraced the dark side; Bindo fought against the Sith Empire during the Great Sith War and again during the Jedi Civil War. While Gray Jedi displayed a lack of adherence to the light side of the Force, they were free of dark side corruption; beings who were corrupted by the dark side were not considered to be Gray Jedi—nor were Jedi who fell to the dark side and were later redeemed. Still, some Jedi thought that Gray Jedi carried the dark side's influence within them, even if the Gray Jedi did not always realize it. The term did not refer to Force-users who believed there was no dark side of the Force, as such individuals were instead followers of the Potentium."}, {"tag": "p", "text": "All Gray Jedi displayed the use of both light and dark side Force abilities and demonstrated skill with techniques common to Jedi and Sith, such as the ability to construct and wield a lightsaber, as well as some unique Force talents. Bindo acquitted himself for being talented with Jedi mind tricks and was capable of using dark side techniques such as Force lightning. The Voss Mystics were healers, and were also extremely adept at prophecy, although they could not control when they would receive their Force visions. The Jensaarai were capable of masking their presence in the Force, which allowed them to evade Jedi, as well as Palpatine's Jedi hunters. They were also capable of a unique form of Force throw that allowed the user to hurl small objects toward enemies at near-lethal velocity. The Imperial Knights were just as capable in the use of the Force as Jedi Knights, though their training concentrated more on martial prowess. Imperial Knights displayed various Force abilities, such as self-levitation, telekinesis, and mind tricks. Both the Jensaarai and the Imperial Knights utilized armor in combat, and were familiar with the process of manipulating cortosis ore. Other Gray Jedi wielded powers such as Ionize, a technique that deactivated and destroyed machines, and Force thrust, a telekinetic attack similar to Force push."}, {"tag": "p", "text": "However, the use of both light side and dark side powers was not, in itself, evidence of the individual being a Gray Jedi. Shortly after the Stark Hyperspace War in 44 BBY, Plo Koon, a light side Kel Dor Jedi Master and member of the Jedi High Council, spontaneously used a Force technique that bore a striking similarity to the dark-side-aligned Force lightning, which he coined Electric Judgment. Koon struggled with the morality of the use of this power, and acknowledged the concern of other Jedi over the matter, but ultimately deemed it acceptable. Similarly, Kyle Katarn, a light side Jedi who later became a member of the New Jedi Order's High Council, freely used light and dark side abilities, and encouraged his students—Rosh Penin and Jaden Korr—to think of Force powers as mere tools."}, {"tag": "h2", "text": "Relationship with the Council"}, {"tag": "p", "text": "While the term was used to refer to Force-users who walked the line between light and dark, Jedi were also labeled as Gray Jedi for distancing themselves from the Jedi High Council. This practice dated back to the days of the Old Republic, when the High Council was attempting to consolidate power. Jedi who frequently clashed with the will of the Council were sometimes thought of as Gray, even if they did not necessarily walk the line between the light and dark sides of the Force. Around 44 BBY, Jedi Master Qui-Gon Jinn was thought of as a Gray Jedi by some members of the Order for his frequent opposition to their demands."}, {"tag": "p", "text": "One group of renegade Jedi described themselves as \"gray\" even though they held to the same views as the Jedi Council on the subject of the dark side. The Teepo Paladins were Jedi who were removed from the Order for advocating the use of a wide variety of weapons—including blasters—rather than restricting the weaponry of Jedi to lightsabers, and from them splintered a group that called themselves the \"Gray Paladins.\" This group preached minimal reliance on the Force and advocated a more militaristic lifestyle than either the mainstream Jedi Order or the Teepo Paladins. Despite these differences, some non-Jedi, such as the Jedi Hunter Aurra Sing, viewed Gray Paladins simply as Jedi."}, {"tag": "p", "text": "It was difficult for unorthodox Jedi—especially those labeled as Gray Jedi—to join the Council or ascend to any position of real leadership within the Order. As the High Council chose its own members, they tended to select more traditionalist Jedi, such as the group described as the Old Guard. Jinn's candidacy as a member of the High Council was rejected first in favor of Plo Koon, and later the Cerean Ki-Adi-Mundi, both of whom were more in line with the Council's way of thinking."}, {"tag": "h2", "text": "Gray Jedi"}, {"tag": "h3", "text": "Jolee Bindo"}, {"tag": "p", "text": "Jolee Bindo was a Human male Jedi who lived circa 4000 BBY. In his youth, Bindo developed a relationship with a Human female mercenary named Nayama and married her against the Order's Code. This infraction led to the creation of the phrase \"pulling a Bindo.\" Bindo realized that Nayama was strong in the Force and attempted to train her despite still only being a Padawan in the Jedi Order himself. When the Sith Lord Exar Kun initiated the Great Sith War, Nayama asked Bindo to follow her in joining Kun's Brotherhood of the Sith. When Bindo refused, she attacked him. Realizing that Nayama had fallen to the dark side, Bindo dueled and defeated her, but could not bring himself to kill her. She went on to kill many Jedi during the war until she was slain in the war's final battle on Yavin 4."}, {"tag": "p", "text": "Bindo was put on trial by the Jedi Council after the war, both to explore his culpability in regard to Nayama's actions, and to evaluate his place in the Order. When they forgave him of any blame and attempted to elevate him from the rank of Padawan to that of Knight, the guilt-ridden Bindo felt that the Order had failed him, and he separated himself from the Jedi Order entirely. He operated as a smuggler in the Outer Rim Territories until he crashed on Kashyyyk, where he remained in self-imposed exile. Near the end of the Jedi Civil War, he met the Jedi Revan in the Shadowlands of Kashyyyk and joined him in the campaign against the Dark Lord Darth Malak. Bindo was awarded the Cross of Glory for his part in the defeat of the Sith Empire. He was a self-described Gray Jedi."}, {"tag": "h3", "text": "The Jensaarai"}, {"tag": "p", "text": "The Jensaarai were an order of Force-users from the Suarbi system who arose during the Clone Wars from the teachings of an Old Sith Wars–era Sith named Larad Noon. Formed by the fallen Jedi Nikkos Tyris, the Jensaarai's philosophy and methodology was a blend of Sith and Jedi teachings, although they maintained the discipline necessary to resist corruption by the dark side and focused mostly on defensive tactics and Force abilities. After the death of Tyris at the hands of the Jedi Nejaa Halcyon, the succeeding leader of the Jensaarai—a Human female apprentice of Tyris' who went by the title Saarai-kaar—was unable to interpret the higher dark side teachings that Tyris had been studying. The Saarai-kaar taught her fellow Jensaarai what she did know, emphasizing the values of community defense and of avoiding confrontation. In doing so, she unwittingly led the Jensaarai away from darkness. At first, the Saarai-kaar opposed the Jedi, viewing them as an aggressive off-world threat due to the actions of Halcyon's strike team. However, after the fall of the Galactic Empire, the Jensaarai made peace with the New Jedi Order, and even sent students to learn at Master Luke Skywalker's Jedi Praxeum on Yavin 4. They were still considered Gray Jedi—by both the Jedi and the Sith—for the practices of certain members; however, the Jensaarai themselves outwardly denied these claims."}, {"tag": "h3", "text": "The Imperial Knights"}, {"tag": "p", "text": "The Imperial Knights were an order of Force-practitioners loyal to the Emperor of the Fel Empire. They were fully trained in the ways of the Force and rejected the dark side of the Force, unlike some of the Force-based organizations of Emperor Palpatine's Galactic Empire, such as the Prophets of the Dark Side. In contrast to the Jedi, who believed strongly in meditation and introspection, the Imperial Knights took a pragmatic view of the Force. To an Imperial Knight, the Force was a powerful tool that required care and respect. Although they did not adhere to the dark side, they followed the light side indirectly through the figure of the Emperor, and were viewed as \"Gray\" by the Jedi Order. During the Second Imperial Civil War circa 137 ABY, the Imperial Knights made alliances with both the Galactic Alliance Remnant and the Jedi Council to oppose Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The term \"Gray Jedi\" was first used to describe the Jedi Qui-Gon Jinn in Star Wars: Republic: The Stark Hyperspace War, although the source did not confirm that Jinn was a Gray Jedi and did not provide an exact definition of the term. Jolee Bindo was later introduced in the Star Wars: Knights of the Old Republic video game as a self-described Gray Jedi. In the game, Bindo's \"Force alignment\" was an even balance between the light and dark sides of the Force. However, an item called \"Gray Jedi Robe\" appeared in the game's sequel, Star Wars: Knights of the Old Republic II: The Sith Lords, which gave a definition for Gray Jedi that did not require a \"balanced\" Force alignment and instead focused on Jedi who operated independently of the Jedi Council without fully embracing the dark side."}, {"tag": "p", "text": "Later sources conflicted with each other over the defining characteristic of a Gray Jedi. Star Wars: Legacy 0, the Knights of the Old Republic Campaign Guide, and The Jedi Path: A Manual for Students of the Force gave definitions that focused on separation from the Jedi High Council. Also, the Coruscant Nights I: Jedi Twilight novel introduced a group of renegade Jedi called the \"Gray Paladins\" that was portrayed as removed from the Order yet devoid of dark side influences or practices. However, Star Wars: Legacy 0½ and the Jedi Academy Training Manual claimed that the term was used to describe those who dabbled in the dark side without becoming corrupted by it."}, {"tag": "p", "text": "A definition for \"true Gray Jedi\" that appeared in the Jedi Academy Training Manual described them as those who did not belong to any Force-based organization and who explored both the light and the dark sides of the Force without becoming corrupted by the dark side. Despite this, it was also stated in the Jedi Academy Training Manual that the New Jedi Order considered the entire Force tradition of the Jensaarai to be Gray. Additionally, the Imperial Knights were confirmed to have been considered as Gray by the New Jedi Order in Star Wars: Legacy 0 and Star Wars: Legacy 0½, and the Voss Mystics were verified to have been Gray in the \"Creating Worlds\" developer blog for the Star Wars: The Old Republic video game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}