{"url": "Gray_Squadron_(Rebel_Alliance)/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starfighter squadrons", "Category:Gray Squadron personnel"], "nodes": [{"tag": "h1", "text": "Gray Squadron  (Rebel Alliance)"}, {"tag": "p", "text": "Gray Squadron, also known as Gray Wing or Gray Group, was a Rebel starfighter squadron that flew A/SF-01 B-wing and BTL Y-wing starfighters at the Battle of Endor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Active by 4 ABY, Gray Squadron was a mixed starfighter unit led by Colonel Horton Salm serving the Alliance to Restore the Republic in the Galactic Civil War. Although the squadron was equipped with modern A/SF-01 B-wing starfighters, Salm and other veteran pilots chose to fly venerable BTL Y-wing starfighters, citing their reliability with the comment that \"they've always gotten me home in one piece.\" The unit's B-wings and some of its Y-wings were marked with gray striping to reflect their squadron affiliation, while other Gray Squadron Y-wings bore yellow markings. For the Battle of Endor, Gray Leader Salm and his wingman Lieutenant Telsij, Gray Two, were assigned Rogue Squadron pilots Kin Kian and Karie Neth as their Y-wing gunners."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "Assigned a key role at Endor by Admiral Gial Ackbar, Gray Squadron, otherwise identified as Gray Wing or Gray Group, was one of four main Rebel battle groups present for the conflict. Ordered to disable any capital ships between Gold Leader Lando Calrissian's Millennium Falcon and the Death Star, Colonel Salm responded to the general's call for all wings to report in. Approaching the space station, Gray Squadron was ambushed by Imperial fighters, with Telsij remarking on their overwhelming numbers. The squadron took heavy casualties early in the battle, including Gray Three, Lieutenant Ekelarc Yong, who was hit by fire from a TIE/LN starfighter, triggering explosions in his Y-wing's cockpit before he was killed in a collision with an Imperial-class Star Destroyer. As General Calrissian entered the Death Star's superstructure to destroy its reactor core, he encountered a blockage in the primary access tunnel, and was forced to take an alternative route. On Calrissian's orders, Gray Group unblocked the primary route, allowing the Falcon and Red Leader Wedge Antilles to escape the exploding space station and bring the Rebel Alliance to victory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Contrary to the film, in the novelization of Return of the Jedi, \"Gray Leader\" is interrupted while reporting in, and is destroyed with the rest of Gray Wing. However, the apparent death of Gray Leader was contradicted by his later establishment as Horton Salm, a character active in the post-Endor era. Similarly, Karie Neth, another Gray Squadron member, can be seen alive on Endor following the battle in Return of the Jedi."}, {"tag": "p", "text": "The 1999 video game Star Wars: X-Wing Alliance uses the spelling \"Grey Group\" to refer to this unit, while most other sources, including that game's Official Strategy Guide use the spelling \"Gray\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}