{"url": "Great_Battle", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Keshiri religion"], "nodes": [{"tag": "h1", "text": "Great Battle"}, {"tag": "p", "text": "In the Keshiri religion, the Great Battle was the eons-long clash between the enemy races known as the Skyborn and the Otherside in the stars above the planet Kesh, mirroring the Hundred-Year Darkness conflict between the Jedi Order and its Dark Jedi brethens. Riding colossal crystal uvak beasts, the Skyborn ultimately achieved victory, although not before being wounded by the Otherside. The injured Skyborn dripped blood onto Kesh's oceans, creating all of the world's landmass. Eventually, the Great Battle came to be revered as one of the main facets of the mythology of the Keshiri species."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "According to the Keshiri religion, in the ages before the dawn of the Keshiri civilization, two races came into being—the benevolent Skyborn and the nefarious Otherside, who came \"from below.\" Eventually, the Skyborn and the Otherside came into conflict with one another, and they met for battle in the stars above the planet Kesh, which was then entirely covered by roiling black seas."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Skyborn came into battle riding gigantic crystal uvak beasts against the Otherside, and the Great Battle, as it came to be called, raged for eons. Eventually, the Skyborn vanquished their enemies and were victorious, although they were wounded during the fighting. Drops of Skyborn blood fell onto Kesh's oceans, creating new land."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Keshiri species eventually evolved on Kesh, living on the same landmass that was supposedly part of the Skyborn. At some point, a group of uvak-riders known as the Neshtovar brought back the knowledge of the Great Battle from Kesh's Cetajan Mountains, and the tales of the Skyborn and the Otherside became the center of the prevalent Keshiri religion. The common tale of the Great Battle stood up somewhat to scientific criticism, as the lands of Kesh that had been mapped by 5000 BBY showed a highly irregular and asymmetrical coastline—reinforcing the belief that the land had been formed from dripping Skyborn blood. In 5,000 BBY, geologist Adari Vaal discovered evidence contradicting the account of the Great Battle, and she began teaching students that the Keshiri landscape had in fact been formed naturally by lava flow. Vaal was called to testify before the Neshtovar, who had by then become the ruling council of Kesh. Vaal was accused of heresy and spreading lies about the Great Battle. Shortly afterward, Vaal discovered a group of crash-landed Sith in the Cetajan Mountains, who claimed to be the Skyborn and took their place as rulers of the planet. By 4985 BBY, the myths of the Skyborn and the Otherside, and therefore the Great Battle, had been all but eliminated from Keshiri life by the Sith, in favor of earlier tales of the Protectors and the Destructors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Great Battle was given its first, and so far only, mention in the Star Wars canon in John Jackson Miller's 2009 eBook, Lost Tribe of the Sith: Skyborn. In 2012, Troy Denning's novel Fate of the Jedi: Apocalypse confirmed the canonical existence of the Protectors and Destructors, the successors to the Skyborn and the Otherside. As the Protectors and the Destructors constantly warred, the possibility that the Great Battle may have been an actual event occurs—however, as the full extent of the connection between the Protectors/Destructors and the Skyborn/Otherside stories has not been fully fleshed out, it is impossible to say for certain."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}