{"url": "Great_Beast", "categories": ["Category:Legends articles", "Category:Named creatures", "Category:Terentatek"], "nodes": [{"tag": "h1", "text": "Great Beast"}, {"tag": "p", "text": "The Great Beast was a terentatek that lived in the Shadowlands of Kashyyyk until the amnesiac Jedi Revan slew it in 3956 BBY. During the long years that preceded its demise, the Great Beast killed many individuals who had come to challenge it, including the Jedi Guun Han Saresh and the Wookiee Chieftain Rothrrrawr."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Beast of the Shadowlands"}, {"tag": "p", "text": "The creature that came to be known as the Great Beast was a terentatek, a species that fed on the blood of those who were strong in the Force. Such beasts were originally created by the Ninûshwodzakut, or \"Knotters of Entrails,\" a group of Sith priests who engineered monstruous animals through arcane alchemical processes."}, {"tag": "p", "text": "Long before the Jedi Civil War that pitted the Jedi Order and the Galactic Republic against the Sith Empire, the creature found its way to the Shadowlands of Kashyyyk, the dark and dangerous ground level that lay at the foot of the mile-high wroshyr trees found on that planet. Eventually, the presence of the terentatek sparked the interest of the Wookiees, a race of hairy mammals native to the arboreal world. In their society, warriors were tasked with raiding the Shadowlands to protect the civilians from the predators that roamed below their treehouses. On rare occasions, the Wookiees also visited the Shadowlands for ritual reasons such as coming-of-age tests. Dubbed \"the Great Beast,\" the Kashyyykian terentatek was made the central piece of a ritual battle. The warriors who wished to prove their worth in combat would travel to the creature's lair and lure it out by tying the corpse of a viper kinrath to a dangling kshyy vine. Attracted by the smell of blood, the Great Beast would turn up, eat the bait and attack the warrior who had summoned it. Although many ambitious Wookiees attempted to kill the creature, few survived the encounter. Despite its dangerousness, the ritual was formalized, as a marker bearing precise instructions was placed under the dangling vine."}, {"tag": "h3", "text": "Killing the hunter"}, {"tag": "p", "text": "In 3997 BBY, a young student of the Jedi Order named Exar Kun discovered the teachings of the nefarious Sith sect and was seduced by them. With a group of fellow defrocked Jedi Knights, he founded his own Sith Empire. Kun started to wage war against the Jedi Order and the Galactic Republic, the galaxy-spanning governement that the Jedi strove to protect. In hopes of winning the war, Kun engineered various mutant creatures through arcane alchemical processes. Among those dreaded Sithspawns were terentateks similar to the Great Beast. When the war was over, several Jedi Knights participated in the Great Hunt, a collective Jedi effort to eliminate those creatures. In that context, a young Jedi named Guun Han Saresh traveled to Kashyyyk, having heard that a Great Beast lived in the Shadowlands. The Great Beast, however, had been fought by many generations of Wookiees prior to Saresh's arrival, proving that it had been born long before the rise of Kun's Sith Empire."}, {"tag": "p", "text": "Regardless the creature's true origins, Saresh attempted to take it down. The Jedi, although he did use a bait trick similar to the one described in the Wookiee ritual, did not use the ritual marker and hung a freshly killed batlike mykal instead of a kinrath. The Great Beast still fell into the trap, ready to feast on the corpse. At the beginning, the creature could not see Saresh, who had been waiting for its arrival on some high rocks. The Jedi, armed with a Force-imbued blade, emerged from his perch and stroke a piercing blow to the terentatek. The blade, however, was not solid enough for the creature's thick hide, and it was shattered to the hilt. Taking advantage of Saresh's surprise, the Great Beast dropped down on the young Jedi and killed him."}, {"tag": "h3", "text": "Breaking the Blade"}, {"tag": "p", "text": "About a generation before the end of the Jedi Civil War, the Great Beast found a new opponent in the person of Rothrrrawr, the Chieftain of the Wookiee capital Rwookrrorro. The chieftain followed the ritual to summon the creature and confronted it, holding the Ceremonial Blade of his ancestor Bacca. However, Rothrrrawr had been blinded by ambition, and the beast proved to be too strong for him. The chieftain managed to lodge his sword on the creature's side, which gave it great pain but only caused surface damage. Rothrrrawr survived the battle, proving luckier than the late Saresh, but losing the blade of his ancestral weapon. From that day on, the Great Beast was forced to live with an injury even as skin started to regrow around the blade."}, {"tag": "h3", "text": "Meeting its doom"}, {"tag": "p", "text": "In the year 3956 BBY, as the Jedi Civil War was drawing to a close, an amnesiac Revan visited Kashyyyk in search of a Star Map that would help him find the Star Forge. During his journey in the Shadowlands, he discovered the ritual marker and followed its instructions, which prompted the Great Beast to appear. For the first time in its long existence, the terentatek met its match. With the help of two companions, Revan slew the Great Beast and recovered the blade of Bacca's sword."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As with all Terentatek, the Great Beast had a hulking frame and was armed with prominent tusks and claws. Although non-sentient, the creature was still crafty, as it avoided to appear before more than one potential adversary at a time."}, {"tag": "h2", "text": "Power and abilities"}, {"tag": "p", "text": "Thanks to the venomous claws of his species, the Great Beast could poison its adversaries by simply slashing at them. When swiping violently at its opponent, the terentatek could knock him or her backwards."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}