{"url": "Great_Council_(Tapani_Federation)", "categories": ["Category:Legends articles", "Category:Legislatures", "Category:Tapani sector culture"], "nodes": [{"tag": "h1", "text": "Great Council  (Tapani Federation)"}, {"tag": "p", "text": "The Tapani Great Council or Grand Council and its associated sub-councils was the ruling political body of the Tapani Federation."}, {"tag": "p", "text": "The Great Council consisted of over 2,000 members from the noble families of the Expanse, each of which were associated with one of the noble houses. The houses gained power and influence by forming coalitions within the Great Council in order to obtain enough votes to carry their policies. For approximately twenty years prior to the Battle of Yavin, the House Mecetti-controlled coalition held the power within the council. The proportion of votes each house had within the Great Council was based on the total population within each province and not the number of worlds or systems. The Great Council was led by a Prime Minister elected by majority vote within the chamber. It was the prerogative of the council to call for new Prime ministerial elections at any time but by tradition this was only done every five years."}, {"tag": "p", "text": "The Great Council was made up of a number of sub-councils. Some of the Great Council's functions were to elect the Prime Minister and representatives to the Galactic Senate. The Great Council had become very exclusive over time, and did not admit new families when old ones died out as it had done earlier during the Dynastic Era. Representatives affiliated with the Freeworlds or the petty knights were admitted into the Great Council only very rarely, and were never trusted with positions of authority."}, {"tag": "p", "text": "The Great Council had a number of executive and judicial responsibilities as well as its role as the primary legislative body of the Expanse. Therefore, in addition to passing laws, the council would sit in judgments over some court cases, confer offices and grant pardons. In reality the council was too large to effectively attend to all of its duties and therefore it was mainly concerned with electing officials and reviewing the decisions of the many smaller councils and committees under its control."}, {"tag": "p", "text": "The Great Council met in a huge capitol building on Estalle Island on the planet Procopia."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}