{"url": "Great_Crisis", "categories": ["Category:Legends articles", "Category:Battles of Kesh"], "nodes": [{"tag": "h1", "text": "Great Crisis"}, {"tag": "p", "text": "The Great Crisis was a two-week period of riots and killings which broke out on the planet Kesh immediately after Testament Day in 3000 BBY. During that Testament Day, the Lost Tribe of Sith rediscovered the fact that Humans had once been servants to another species. This discredited the popular myth that the ancestors of that Human Sith tribe had been from a race of great conquerors. The ensuing riots led to many deaths."}, {"tag": "p", "text": "The Great Crisis was ended by Varner Hilts, a historian and Caretaker of the Tribe's historical lore. During a trip to the Kesh Sith Temple, Hilts discovered a large map which proved the existence of another continent beyond Keshtah Minor which was known as Keshtah Major or Alanciar. Using this information, Hilts was able to convince the other Sith factions to put aside their differences and to work together to reach and conquer Keshtah Major. As a result, the other Sith elected Hilts as their new Grand Lord. Hilts then went on to rebuild Keshtah Minor and succeeded in annexing Alanciar in 2975 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "The Great Crisis was rooted in the Time of the Rot, a period of civil war and unrest on Kesh's continent of Keshtah Minor which had lasted 960 years. The Time of the Rot had been sparked by the death of the ruling Grand Lord Lillia Venn during the Night of the Upside-Down Meteor in 3960 BBY. For centuries, rival Sith factions had fought over the leadership of the Sith Tribe which ruled Keshtah Minor, one of the two main continents on Kesh. This conflict devastated much of Keshtah Minor and led to the decline of much of its infrastructure and buildings. By 3000 BBY, there were over twenty rival factions and the Tribe had dwindled to a few thousand individuals. This threatened the survival of the Tribe."}, {"tag": "p", "text": "The only time and place that the various Sith factions met peacefully was at the Sith capital building in the Sith capital Tahv's Circle Eternal during Testament Day. Testament Day commemorated the passing of the Tribe's founder Yaru Korsin and was when his testament was read to the Sith Tribe. This festival was held every twenty-five years. In 3000 BBY, the Sith historian and Caretaker Varner Hilts was in charge of safeguarding the holocron which contained Korsin's Testament."}, {"tag": "h3", "text": "An Inglorious Past"}, {"tag": "p", "text": "Twelve days prior to that year's Testament Day, the Sisters of Seelah, a Sith faction which revered Yaru Korsin's estranged wife Seelah Korsin, occupied the Kesh capitol building and attempted to force Hilts to produce a fake Testament that would be sympathetic to Seelah. Hilts refused to cooperate and revealed that the Testament was actually read from a holocron recording of Yaru himself. The Sisters' presence eventually attracted the attention of several rival Sith factions including Force 57, Korsinite League, and the Golden Destiny. Eight days prior to Testament Day, these two factions attacked and fought the Sisters within the Circle Eternal's atrium."}, {"tag": "p", "text": "Hilts was able to bring peace to these factions by offering to read the Testament of Yaru Korsin. Using his Keshiri assistant Jaye Vuhld's calculations of the city's Sandpipe, Hilts revealed that the Keshiri calendar was actually eight days behind the Galactic Standard Calendar. Thus, Hilts was legally obliged to convene the Pantheon's Peace and begin a reading of Korsin's testament. Yaru Korsin's Testament failed to present any solutions to ending the internecine conflict between the Sith. While adjusting the holocron, Hilts discovered that it had been recorded over an earlier transmission."}, {"tag": "p", "text": "The Sith leaders quickly learnt that their ancestors were not \"great conquerors\" but were merely lowly slaves, miners, and soldiers of the ancient Sith Lord Naga Sadow. The Tribe did not come willingly to Kesh but had instead become stranded during a mission to deliver Lignan crystals to Sadow's forces during the Great Hyperspace War. This revelation of the Tribe's \"inglorious past\" horrified the various Sith attendees. In an attempt to hide their \"inglorious past\", Iliana destroyed the holocron with her lightsaber."}, {"tag": "h3", "text": "The Crisis"}, {"tag": "p", "text": "Despite efforts by the Sith leaders to hide their true origins, word of the recent Pantheon reached their Human supporters within the Lost Tribe. Unable to cope with the \"inglorious history\" of their ancestry, the Sith began killing each other and anyone who got in their way. The various Sith factions fought each other before fighting among themselves. During the Great Crisis, Iliana Merko severed the left hand of Korsin Bentado, the leader of the Korsinite League, with her Sith lightsaber. She eventually fled on her uvak to the Kesh Sith Temple to hide from the other Sith factions. Within eight days, several of Keshtah Minor's cities had been burnt to the ground."}, {"tag": "p", "text": "Many Keshiri were killed during the fighting. Rioters also destroyed the Circle Eternal's historical archives and the Sandpipe, an ancient machine which had been used to record and measure time on Kesh. While many other Sith had given up any hope of saving the Tribe from destruction, Varner Hilts recalled that Yaru Korsin's Testament had mentioned that the late Grand Lord had kept some secrets from his people and that his descendants should turn to the \"true power\" behind his throne should \"disaster befall\" the Tribe. Korsin's throne was located aboard the Omen, the ancient Sith starship which brought the ancestors of the Lost Tribe to Kesh. The Omen was buried beneath a mountainside Sith temple."}, {"tag": "p", "text": "Hilts and his trusted Keshiri assistant Jaye Vuhld then travelled to the Sith Temple in order to find this secret which Hilts hoped would be able to save the Tribe. Nobody had visited the Sith Temple for several centuries since the Tribe's founder Yaru Korsin's daughter Nida Korsin had ordered the Tribe to evacuate the Temple in 4975 BBY. After much difficulty navigating the difficult terrain, Hilts and Jaye managed to enter the Temple's compound. Shortly later, they encountered Iliana and convinced her to join their quest."}, {"tag": "h3", "text": "The Secret Continent"}, {"tag": "p", "text": "The three explorers eventually made their way to the derelict Omen, the ancient starship which had brought the ancestors of the Lost Tribe to Kesh. The Omen was buried beneath the Keshiri Sith Temple. However, the explorers found that Korsin's command throne had been removed from the ship's bridge. Hilts and his companions also discovered the presence of other Sith including Korsin Bentado, Edell Vrai, and Neera. These Sith had been vicious rivals during the Time of the Rot but had come together after much blood-letting to destroy the Omen in order to purge the \"inglorious history\" of the Tribe."}, {"tag": "p", "text": "Hilts and his companions eventually reached the the cupola above the Sith Temple's roof where they discovered Korsin's throne. They discover that the cupola's ceiling was a planetarium and also found a piece of transparent film which contained an old cant in the Tapani language. This document was a message from Yaru Korsin's mother Takara Korsin to her son prior to his fateful mission to Phaegon III. She predicted that Korsin's descendants would rule over a great people one day and be free of the Red Sith. However, Hilts argued that this text was not actually Korsin's secret and contended that the planetarium was intended to mislead future explorers into thinking that Korsin had intended the Tribe to return to the stars."}, {"tag": "p", "text": "Using their knowledge of the Lost Tribe's history, Hilts and Jaye reasoned that the dying Korsin had recorded his final Testament in a chamber beneath the Sith Temple. Hilts and his companions eventually reached the chamber and discovered both Korsin's throne and a map room. The other Sith eventually discovered their presence and killed Jaye. Before they could kill the others, Hilts used the Force to remove the blank slates cover the walls and revealed a large map which showed the existence of a second continent beyond Keshtah Minor. This unknown continent was several times the size of Keshtah and was separated by a vast ocean. In the end, Hilts was able to use the discovery of 'Keshtah Major' to unite the Tribe and end the centuries-long infighting that has nearly destroyed them. Out of deference, the other Sith leaders elected Hilts as Grand Lord and Iliana became his Grand Consort."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "In the successive years, the Great Crisis became merely a memory. Under the leadership of Grand Lord Hilts, the Sith Tribe committed itself to rebuilding Keshtah Minor and discovering a way to reach Keshtah Major. As part of the Hilts Restoration, Hilts also allowed Force-sensitive members of the Keshiri, a purple-skinned humanoid species indigenous to Kesh, to join the Lost Tribe as Sith Tyros and Sith Sabers. For the next twenty-five years, the Tribe began researching ways to cross the ocean and reach Keshtah Major. Hilt's wife Iliana was placed in charge of the Tribe's military forces while the High Lord Korsin Bentado was tasked with developing technology that would enable the Sith to travel safely to that continent."}, {"tag": "p", "text": "Following the failure of long-distance uvak reconnaissance flights and attempts to develop a fleet of wooden sailing ships due to the poor quality of Keshtah's timber, Vrai succeeded in developing airships in 2975 BBY. These airships were held afloat by glass vessels containing methane and hydrogen, which were protected by fabric-covered gondolas. The Tribe's airships also relied on uvaks to guide the vessel through the jetstream. That year, Vrai led a reconnaissance mission to Keshtah Major, known to its locals as Alanciar, to collect intelligence on its society and military capabilities. However, his three airships were shot down by the Alanciari military."}, {"tag": "p", "text": "Vrai and several other Sith survived and managed to capture two Alanciari locals: the soldier Jogan Halder and his lover Quarra Thayn. Vrai later coerced Thayn into serving as a guide for a reconnaissance mission into Alanciar's interior. Through Thayn, Vrai learnt that the Alanciari Keshiri were a militaristic society which had prepared for a Sith invasion for millennia. Two millennia ago, the Keshiri woman Adari Vaal had escaped from Keshtah with three-hundred Keshiri followers following a failed attempt to drive out the Tribe. Vaal became the founder of the Alanciari Keshiri civilization which was built upon defending their society from the Sith."}, {"tag": "p", "text": "Despite the failure of Vrai's mission, his rival High Lord Korsin Bentado invaded Keshtah Major with the Ebon Fleet, which consisted of sixty airships. As before, the Sith forces were decimated by the Alanciari military. However, Bentado and several Sith warriors survived. These infiltrated the Alanciari capital of Sus'mintri and slew the entire War Cabinet, Alanciar's military government. Bentado then rebelled against Grand Lord Hilts and attempted to destroy Hilts' approaching airship Good Omen. He planned to create a second Tribe on Alanciar using its industrial base. However, he was thwarted by Vrai, Thayn, and his own Keshiri servant Squab, who personally killed Bentado."}, {"tag": "p", "text": "Following Hilts' arrival in Sus'mintri, the Alanciari submitted to Sith rule after Halder convinced them that the Sith Tribe did not actually pose a threat to Alanciar. Instead, he claimed that they were the legendary Protectors, deities in Keshiri religion, and that the malevolent Destructors had been responsible for killing Alanciar's War Cabinet. He claimed that Vrai's forces had been pursuing the \"Destructors\" and their leader Bentado. Following the conquest of Alanciar, the Tribe was able to put the legacy of the Great Crisis and the Time of the Rot behind them. They then embarked on a mission to explore and conquer the rest of the planet Kesh. By 44 ABY, the Lost Tribe of Sith had realized their goal of returning to the galaxy."}, {"tag": "h2", "text": "Appearances"}]}