{"url": "Great_Families", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Chiss culture", "Category:Chiss Great Families"], "nodes": [{"tag": "h1", "text": "Great Families"}, {"tag": "p", "text": "The forty Great Families of the Chiss Ascendancy were a political ruling group of Chiss families within the Aristocra of the Chiss Ascendancy. The Great Families ranked below the Nine Ruling Families in hierarchy, power, and influence, but above families that were in neither group. The Great Families were also referred to as the Forty Great Houses."}, {"tag": "p", "text": "Certain members of the Chiss Great Families were once members of the Ruling Families. Conversely, at times in the history of the Ascendancy, certain Great Families could be made members of the Ruling Families. The Great Families who aspired to join the Ruling Families could send officials to meetings of the Syndicure. Notably, the number of Great Families was not fixed at 40, and neither was the number of Ruling Families fixed at nine."}, {"tag": "p", "text": "When disputes ensued between Great Families and families that were neither among the Great nor Ruling Families, the poorer family often had little hope for a resolution in their favor. Evroes'pu'titor declared as much to Mitth family Syndic Prime Mitth'urf'ianico, who had been sent to settle a dispute between the Great Xodlak family and the commoner Evroes family. Syndic Prime Thurfian responded by declaring that the Evroes deserved equal justice with every other family of the Chiss Ascendancy."}, {"tag": "h2", "text": "Member families"}, {"tag": "p", "text": "During the Nikardun conquests and Nikardun campaigns of around 18 BBY, the Great Families included the following member families. Some members were:"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Some of the Great Families were once members of the Ruling Families of the Ascendancy. The Stybla family was known to have been a Ruling Family of great military renown, and further rumored to have once been the only Ruling Family. The Coduyo family was removed from the Ruling Families around 150 BBY. The Xodlak family was removed from the Ten Ruling Families around 68 BBY, leaving Nine Ruling Families."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}