{"url": "Great_Hunt_(c._3643_BBY)", "categories": ["Category:Legends articles", "Category:Events during the Cold War (Galactic Republic–Sith Empire)", "Category:Great Hunts"], "nodes": [{"tag": "h1", "text": "Great Hunt  (c. 3643 BBY)"}, {"tag": "p", "text": "During the Cold War, a new edition of the Great Hunt was started, a competition held for hunters across the galaxy.\nHowever this time was a deadly match between Braden's protégé and the Alderaanian turned Mandalorian Tarro Blood."}, {"tag": "h2", "text": "Qualifications"}, {"tag": "p", "text": "First the Hunter faced and killed a Corellian fugitive named Vexx on Nal Hutta but Tarro at the same time killed most of Braden's team, depriving the Hunter of the support needed to enter the Great Hunt. The Hunter managed to win sponsorship from Nem'ro the Hutt despite proxies sent by Blood.\nArriving on Dromund Kaas, capital of the Sith Empire, the Hunter and Mako, last surviving member of Braden's team, met up with their contact at the Mandalorian Enclave, Crysta Markon, who sent them on bounties across the planet to earn a spot in the final melee. But again, Blood continued to interfere by dispatching freelance Imperial mercenaries and later claimed that the Hunter died within the Dark Temple. Ultimately, the Hunter managed to win the final melee and became a Great Hunt competitor. Blood attempted to denounce the Hunter but the Huntmaster had already made his decision. Enraged that he could not get his enemy disqualified, Blood promised to see the Hunter dead."}, {"tag": "h3", "text": "The Great Hunt"}, {"tag": "p", "text": "Crysta then instructed the Hunter to steal a D5-Mantis Patrol Craft from the spaceport, but Blood had alerted the port authorities to the upcoming theft. But not even that could stop the Hunter, who killed the Imperials and the ship's Neimoidian owner."}, {"tag": "h4", "text": "Balmorra"}, {"tag": "p", "text": "The first Hunt target for the Hunter was Admiral Ivernus on Balmorra, an important Imperial official who never leaves his ship. However, Mako was able to determine a weak link through Major Pirrell, who looking for help. But upon disembarking, they was accosted by Vexx's siblings, who were told by Blood that the Hunter shot Vexx in the back and killed Braden when he discovered the Hunter's \"crime\". The Hunter was able to convince the two that Tarro was deceiving them."}, {"tag": "p", "text": "The Hunter soon met with Pirrell, who was looking to discredit his superior and gain the favor of Ivernus. He had the Hunter run jobs across Balmorra to that effort, ultimately succeeding in bringing Ivernus away from the protection of his warship. But much to Pirrell's surprise, Ivernus was looking to execute him for his incompetence, before Pirrell's Cathar slave was revealed to be a rival bounty hunter after Ivernus. The Hunter is able to kill both the rival and Ivernus at the same time. The Hunter also chose to spare Pirrell, considering his cowardice. The Imperial promised to put all the blame on the Cathar."}, {"tag": "h4", "text": "Nar Shaddaa"}, {"tag": "p", "text": "The second target was a private security consultant called the Eidolon, who was an avid Republic supporter, on Nar Shaddaa. The Hunter and Mako got in contact with Geleren, a Twi'lek slaver, and Mako's old friend Anuli, who assisted them in sabotaging Eidolon Security. Unfortunately, the Eidolon retaliated, killing both Geleren and Anuli before facing the Hunter to a duel. The latter prevailed. Despite the Hutt Cartel was offering a significant sum for the live capture of the Eidolon, the Zabrak pleaded to be granted a mercy killing, rather than be subjected to the mercies of the Hutts. The Hunter granted his wish."}, {"tag": "h4", "text": "The auction"}, {"tag": "p", "text": "The Hunter was soon called upon by Assistant Huntsmaster Lek to retrieve a list of Great Hunt targets being auctioned on Hutta. The Hunter managed to interrupt the auction and retrieved the list, as well as learning that Blood had leaked the list."}, {"tag": "h4", "text": "Sands of Tatooine"}, {"tag": "p", "text": "The next target was a Devaronian fugitive named Tyresius Lokai, who ran afoul of many criminal cartels. Unfortunately, Tyresius was tipped off by Blood and was shot down over Tatooine. The Hunter eventually cornered the sly Devaronian at his ship. Tyresius offered a compromise: the Hunter can shoot a double, which could fool even Lek, and Tyresius can work for the Hunter under a new pseudonym, Gault Rennow. The Hunter accepted."}, {"tag": "h4", "text": "The Durasteel Duke"}, {"tag": "p", "text": "The fourth target was Duke Corwin Organa, aka the Durasteel Duke. The Hunter sought out the assistance of the House Girard in tracking down Corwin, the same house which ensure the downfall of his rival. Ultimately, the Hunter cornered the Duke at an Organa estate. But much to the Hunter's surprise, Corwin was discovered to be dead and his sister was posing as him. The Organas then handed over Corwin's body."}, {"tag": "h4", "text": "Return to Nar Shaddaa"}, {"tag": "p", "text": "The Hunter was soon contacted by Hedarr Soongh, a previous Champion of the Great Hunt, who informed the Hunter that Blood's allies are gathering on Nar Shaddaa to discuss how to deal with the Hunter. The Hunter and Mako came face-to-face with Braden's murderer, and, with Soongh's supervision, engaged in an honorable death duel that the Hunter won. Unfortunately, the other Mandalorians refused Soongh's demand to let the Hunter finish the Great Hunt in peace, and shot the elderly man in the chest. After the Hunter finished off the rest of Blood's lackeys, with his dying breath, Soongh pleaded the Hunter not to let the Mandalorian fall off the path of honor."}, {"tag": "h4", "text": "The final round"}, {"tag": "p", "text": "The last target of the Great Hunt was Jedi Master Kellian Jarro, who was renowned for the most Mandalorian kills during the Sacking of Coruscant. Crysta instructed the Hunter to eliminate Jarro and disable the Republic cruiser Aurora's hyperdrive output regulator, which would cause the ship to be destroyed once it jumps to hyperspace. She also let slip that Blood is already on his way to taking on Jarro."}, {"tag": "p", "text": "The Hunter located the Aurora was the Hunter's ship was caught in a tractor beam. Meeting with a Republic security team, the Hunter learned that Blood was captured by Jarro and convinced him that the Hunter was his accomplice. The Hunter refused to be taken into custody and fought through the ship, before finding Blood in the brig. Blood demanded that he be released so they can settle their feud, claiming that it's what both Soongh and Braden would've wanted. Mako retorted that Braden would've wanted to see Blood just as he is, undeserving of an honorable death. The Hunter agreed to leave Blood in his cell and walked away, ignoring the screams of the pathetic Mandalorian."}, {"tag": "p", "text": "The Hunter came face-to-face with Jarro on the bridge, who then attempted to use a mind trick to subdue the Hunter just as he did Blood, but found that his opponent had a much stronger will. The Jedi then attempted reasoning, stating that there's no profit in revenge but the Hunter wouldn't back down. After the Hunter killed Jarro, his Padawan Thendys Noori encouraged the Hunter to kill her as well but the Hunter decided to spare her, though it may be a decision to be regretted."}, {"tag": "p", "text": "After narrowly escaping the Aurora's destruction, the victorious Hunter returned to Dromund Kaas and was proclaimed a Grand Champion of the Great Hunt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}