{"url": "Great_Hunt_(competition)", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Mandalorian stubs", "Category:Great Hunts", "Category:Mandalorian culture", "Category:Sporting events"], "nodes": [{"tag": "h1", "text": "Great Hunt  (competition)"}, {"tag": "p", "text": "The Great Hunt was a competition for glory that originated among the Mandalorians as a test of skill on the jungle moon of Dxun. Over time, the Hunt became an open competition in which any of the galaxy's warriors could compete. A total of three Great Hunts were called during the Great Galactic War, and another three were held during the subsequent Cold War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally a test of skill among the Mandalorian warrior culture on the jungle moon of Dxun, the Great Hunt developed into a competition open to all warriors and bounty hunters in the galaxy. Hedarr Soongh was the youngest bounty hunter to ever win a Great Hunt, claiming the title of Grand Champion during a Great Hunt held around 3708 BBY. During the Great Galactic War between the Galactic Republic and the Sith Empire, a total of three Great Hunts were held, and Mandalore the Lesser called for another Hunt not long after the Treaty of Coruscant in 3653 BBY. The Grand Champion of that Hunt, Artus Lok, challenged Mandalore to a duel and killed him, claiming the title of Mandalore the Vindicated. He would hold another Hunt during the Cold War, which was won by Jewl'a Nightbringer, and a third Hunt around 3643 BBY that was won by a young bounty hunter. The Defenestrator, and Bloodworthy were among the winners of the Hunts during the Great Galactic War, and the third Grand Champion from the war served as Huntsmaster of the most recent Hunt. The Hunts during the Cold War consisted of thirty-two contestants sponsored by various patrons, and the competitors were narrowed down over four rounds. Contestants were only permitted to kill each other if they were competing for the same bounty, and any violations or attempts to rig the odds from the outside resulted in kill-on-sight bounties."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}