{"url": "Great_Hyperspace_Disaster", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Artificial disasters", "Category:Astronomical events", "Category:Events during the High Republic Era"], "nodes": [{"tag": "h1", "text": "Great Hyperspace Disaster"}, {"tag": "p", "text": "The Great Hyperspace Disaster, also known as the Great Disaster or the Legacy Run disaster, was an event that occurred during the High Republic Era, in 232 BBY. Several moons in the Trymant system, including Korbatal, were destroyed in the disaster. The Hetzal system was especially threatened, with large amounts of debris set on collision courses for all of its inhabited bodies, sparking a massive rescue effort."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h3", "text": "The Legacy Run"}, {"tag": "p", "text": "The Class A modular freight transport Legacy Run was constructed by Kaniff Yards well over a century prior to 232 BBY. Over its years of service, the starship came to be owned by the Byne Guild, and eventually fell under the captaincy of retired Malastare-Sullust Joint Task Force officer Hedda Casset, who kept the Run in optimal shape across many journeys. However, the Legacy Run was still approaching, or possibly beyond, the end of its working life. On what would become its final journey, the Run was transporting around nine thousand colonists from the Core Worlds and Colonies to the Outer Rim Territories. It was also carrying some cargo, including a shipment of supercooled liquid tibanna."}, {"tag": "h3", "text": "The Starlight Beacon"}, {"tag": "p", "text": "At the time, the Galactic Republic was headed by Supreme Chancellor Lina Soh, who had an expansionist vision for the galaxy that involved greater outreach for the Republic and the Jedi Order. To that end, the space station Starlight Beacon was constructed in the Outer Rim's frontier. After the station had been completed, the Republic and Jedi hosted a conclave at the station, with many luminaries in attendance, including Jedi Master Avar Kriss and Admiral Pevel Kronara of the Republic Defense Coalition. After the conclave had ended, the departure of dignitaries including Kriss and Kronara, as well as the admiral's cruiser, Third Horizon, was delayed because Shai Tennem, who had been the overseer of the station's construction, insisted upon giving her guests an extensive tour, to Kronara's particular irritation."}, {"tag": "h3", "text": "The Nihil"}, {"tag": "p", "text": "The Nihil were a pirate band from the Outer Rim which had been growing in notoriety in recent years. With their ability to traverse the rare hyperspace Paths, they could strike at will and vanish without a trace using their Path engines. Although the group was still merely marauders otherwise, Eye of the Nihil Marchion Ro had plans for the group, and intended to strike at the Republic and Jedi, for reasons connected to his family history."}, {"tag": "h2", "text": "The disaster"}, {"tag": "h3", "text": "Destruction of the Legacy Run"}, {"tag": "p", "text": "The Legacy Run was traveling through hyperspace along a well-established hyperspace route when disaster struck. Captain Casset had just resumed control of the bridge from her first officer, Jary Bowman, when the navigator, Cadet Kalwar, alerted her to an obstacle that had suddenly appeared in the middle of the hyperlane, with only seconds to impact. Unbeknownst to the starship's crew, the obstacle was a Nihil Stormship traversing a hyperspace Path. Although Casset was startled, as the lane was well-traveled enough that such a thing should have been extraordinarily unlikely, she took control of the Legacy Run and sought to pilot it out of way to avoid a collision. She nearly succeeded, but the Legacy Run's age caught up with it, causing the ship to tear itself apart. Casset and her bridge crew managed to seal off the various compartments of the ship before they died when the bridge was torn open, not knowing if they had managed to save any of the passengers. Parts of the Legacy Run were propelled throughout hyperspace and eventually back into realspace as a result, causing widespread disruption."}, {"tag": "h3", "text": "The Hetzal system"}, {"tag": "h4", "text": "Evacuation signal"}, {"tag": "p", "text": "The Hetzal system, a trinary star system in the Outer Rim Territories, came under particular threat from enormous numbers of hyperspace anomalies. The anomalies were first detected entering the system by two scantechs, Merven Getter and Vel Carann, at a monitoring station on the ecliptic in the outer reaches of the system. Confused as to what was happening, Getter and Carann sent out a system-wide alert, but were then killed when their station was destroyed by debris ejected from hyperspace, preventing them from further explaining what they had observed."}, {"tag": "p", "text": "The signal caused confusion throughout the Hetzal system, as no one knew the reason for the alert. In the Ministerial Residence on Hetzal Prime, the system's leader, Minister Zeffren Ecka, and his advisors attempted to figure out what was happening. Eventually, Keven Tarr from the Ministry of Technology was able to pull together a map showing the debris and the havoc it was already causing in the system, which prompted Ecka to issue a system-wide evacuation order. The order caused panic, as there were not enough starships to evacuate the forty billion-strong population of the system, and most people still did not know what was going on. Some residents of the system chose to ignore the order, assuming it was some kind of hoax. Ecka and his government also sent out a distress signal, although they believed that no one from the Republic was close enough to offer aid in time."}, {"tag": "h4", "text": "Rescue mission"}, {"tag": "p", "text": "The Hetzalian distress signal was picked up by the Third Horizon, which was in transit with the various dignitaries whose departure had been delayed by Tennem, causing the craft to divert to the imperiled system. Along with Republic personnel, at least one hundred Jedi were involved in the rescue effort. With Master Kriss placed in charge of coordinating the mission, she sent a message to Hetzal Prime en route, telling Minister Ecka that help was on the way. Republic Longbeams and at least 53 Jedi Vectors were prepared."}, {"tag": "p", "text": "The Third Horizon arrived in the Hetzal system quite close to its suns, setting a course for the prime world. The Longbeams and Vectors were launched, heading for any place where their help was needed. Kriss, staying on the Third Horizon's bridge, used the Force to coordinate the Jedi efforts."}, {"tag": "p", "text": "As the Jedi and Republic personnel rushed to offer their aid, they did not initially realize the true nature of the anomalies tearing their way through the system at such speed. They headed throughout the system to wherever their assistance was needed. The Longbeam Aurora IX, commanded by Captain Finial Bright, headed to assist Solar Array 22-X, which had been damaged by debris before the crew could evacuate. Jedi Master Loden Greatstorm and his Padawan Bell Zettifar found the Ranoraki compound on Hetzal, where the wealthy Ranoraki family's security force was threatening a crowd of frightened civilians who wanted to board the family's yacht to escape."}, {"tag": "p", "text": "Three Jedi Knights, Te'Ami, Mikkel Sutmani, and Nib Assek, along with a Longbeam piloted by volunteers Joss and Pikka Adren, were preparing to destroy an anomaly bearing down on Hetzal's Fruited Moon when they were halted by Assek's Padawan, Burryaga Agaburry, after he sensed lifeforms inside it and realized it was starship debris. After Te'Ami relayed this information to Kriss through the Force, she cast her senses wide and located a total of ten anomalies with lifeforms aboard. She relayed this information to Admiral Kronara and his crew, changing the objective to rescue not only the Hetzalians, but those individuals trapped in the debris, before relaying this new goal to the rest of the Jedi present."}, {"tag": "p", "text": "The Adrens, Te'Ami, Sutmani, Assek and Burryaga were able to rescue the passenger compartment hurtling towards the Fruited Moon through a tactic which involved the Jedi using telekinesis to form a \"lasso\" of sorts to slow the container down, whereupon the Adrens fired the grappling cables of their Longbeam, the Aurora III. They successfully captured the container and brought it to a halt, averting a collision and saving the individuals inside."}, {"tag": "h3", "text": "Elsewhere in the galaxy"}, {"tag": "p", "text": "The Byne Guild transport Vessel, dispatched to carry four Jedi to the Beacon, was forced out of hyperspace on route and subsequently stranded in deep space. The ship's captain and copilot, Leox Gyasi and Affie Hollow, recognized the wreckage screaming through hyperspace as belonging to the Legacy Run and were concerned, as Guild leader Scover Byne, Hollow's adoptive mother, was known to regularly travel aboard the ship. As the disaster unfolded, transmissions for help rang out from across the galaxy. One transmission was from a ship stranded in the Bespin system. The Trymant system was also affected, with several moons, including Korbatal, destroyed by hyperspace debris."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the Hetzal system had been saved, fragments of the Legacy Run continued to exit hyperspace at seemingly random points, beginning a series of Emergences. The danger was such that Chancellor Soh ordered an interdiction on hyperspace travel through large swathes of the Outer Rim while a task force worked to contain the situation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Great Hyperspace Disaster is an event that was created for the ongoing Star Wars: The High Republic multimedia project. It was first unveiled in the trailer announcing The High Republic initiative on February 24, 2020."}, {"tag": "p", "text": "More details were provided on June 23, 2020 when the first excerpt of Charles Soule's The High Republic: Light of the Jedi, the first novel of The High Republic, was debuted by IGN. In an interview with IGN, Soule described it as a \"galaxy-wide disaster\". In December 2020, he further described the creative process surrounding the Great Disaster's place as The High Republic's catalyst: the five writers (Cavan Scott, Claudia Gray, Justina Ireland, Daniel José Older, and Soule himself) and other executives decided to create it to subvert the traditional format of Star Wars' galactic wars, and introduce a problem that would prove not just a test of martial skill, but also a test of the system's ability to handle it.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}