{"url": "Great_Jedi_Purge/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with non-canon elements", "Category:Conflicts of the Colonies", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Expansion Region", "Category:Conflicts of the Greater Javin", "Category:Conflicts of Hutt Space", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Unknown Regions", "Category:Conflicts of Wild Space", "Category:Early Imperial campaigns", "Category:Galactic Empire", "Category:Genocides and massacres", "Category:Jedi", "Category:Jedi Purge", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Great Jedi Purge"}, {"tag": "p", "text": "The Great Jedi Purge, later also known as the Second Jedi Purge or Palpatine's Purge, referred to the efforts initiated by the Sith Lord Darth Sidious, upon his creation of the Galactic Empire, in 19 BBY, to eradicate the Jedi Order. It resulted in the near-annihilation of the Jedi, as it had been with the First Jedi Purge that occurred after the Jedi Civil War."}, {"tag": "p", "text": "The purge officially began with Order 66, following a botched attempt by Mace Windu and three other Jedi to arrest Sidious, who was the Supreme Chancellor. The Jedi were declared the enemies of the Republic, and the Grand Army of the Republic was ordered to turn on them."}, {"tag": "p", "text": "Sidious, now Emperor of the Galactic Empire, used his new apprentice, Darth Vader, and other agents of the Empire to hunt down and kill the remaining Jedi. Some Jedi fought the Empire until their deaths, like Roan Shryne, and those at the Conclave on Kessel. Others hid from the Empire, like Obi-Wan Kenobi and Yoda."}, {"tag": "p", "text": "In the nineteen years that followed Order 66, many Jedi fell to Vader, Inquisitors, Emperor's Hands, Dark Jedi, and even bounty hunters. By 1 BBY, so few Jedi remained that the Emperor, no longer considering the Jedi a threat, ended the Purge."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The \"Jedi Rebellion\""}, {"tag": "p", "text": "After Anakin Skywalker discovered that Supreme Chancellor Palpatine was Darth Sidious, the elusive Sith Lord whom the Jedi had sought for more than a decade, Jedi Master Mace Windu led a small group of Jedi Masters, comprising himself, Agen Kolar, Kit Fisto, and Saesee Tiin, to apprehend Sidious. Sidious killed Agen Kolar immediately, followed by Saesee Tiin, and, with some greater effort, Kit Fisto, forcing Windu to face the Sith Lord alone."}, {"tag": "p", "text": "In the ensuing battle between Windu and Sidious, the latter was defeated and disarmed mere moments before Anakin entered the room. He then shot Force lightning at Windu, who deflected the lightning back, twisting Palpatine's face, making it appear yellowed and ravaged by the dark side. Windu then prepared to finish off Sidious."}, {"tag": "p", "text": "Anakin was driven to incapacitate Windu in order to save Palpatine, whom Anakin believed was the only one with sufficient knowledge of the dark side of the Force to save his wife, Padmé Amidala, from death. He drew his lightsaber to parry Windu's swipe at the Chancellor and through his action, cut off the Jedi Master's saber hand. Then Sidious, who had begged Anakin for help, and had pleaded with Windu not to kill him for his apparent weakness, immediately regained enough strength to blast Master Windu with Force lightning and send him out of the window to his death."}, {"tag": "p", "text": "Anakin was immediately horrified by what he had done, but despite his guilt, or perhaps because of it, he could not overcome the temptation of the dark side, nor could he simply allow Padmé to die when Sidious (allegedly) had the ability to save her. Anakin swore fealty to Sidious, becoming his new apprentice, and was given the Sith name Darth Vader."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "Palpatine wasted no time in declaring that the Jedi's attempt to take him into custody constituted a betrayal to the Republic by the Order, and used it to justify his ultimate goals. Palpatine ordered the Grand Army of the Republic to execute Order 66—the total annihilation of all Jedi \"traitors\" throughout the entire galaxy as a sign that the age of the Jedi had ended and the New Order was now in place."}, {"tag": "p", "text": "In addition to the Jedi's attempt to arrest Palpatine, another reason cited for wiping out the Order was the argument that they were complicit in starting the Clone Wars to destabilize the galaxy and overthrow the government. Facts cited in support of this argument included the Jedi involvement in initiating the creation of the clone army without authorization from the Senate, and the role of former Jedi Count Dooku in forming the Separatist movement."}, {"tag": "h4", "text": "Assault on the Jedi Temple"}, {"tag": "p", "text": "Simultaneously, Palpatine dispatched Vader and the 501st Legion to eradicate all the Jedi in their Temple on Coruscant. The newly titled Emperor justified his purge with an elaborate conspiracy tale of the Jedi's attempt to take control of the Republic by assassinating the head of government, usurping the clone army's control, and even killing all members in the Galactic Senate, using misleading audio recordings of his battle with Mace Windu as evidence."}, {"tag": "p", "text": "The Empire estimated that fewer than one hundred Jedi escaped the betrayal of Vader and the clone troopers that they were leading during the war. Because it was estimated that Jedi Knights were more likely to fall victim to Order 66, it is believed that Jedi Masters were more likely to survive the genocide than Jedi Knights, with the exceptions of few survivors like Ylenic It'kla, Rachi Sitra, Corwin Shelvay and Empatojayos Brand, among the few survivors were Jedi Masters: Obi-Wan Kenobi, Yoda, Shaak Ti, Echuu Shen-Jon, Qu Rahn, Rahm Kota, K'Kruhk, T'ra Saa, Tholme, A'Sharad Hett and Quinlan Vos. Many Jedi that did survive, like Kai Hudorra and Roan Shryne, cast aside their lightsabers, realizing that their roles as keepers of the peace were over, only to be cut down by Darth Vader himself. Other Jedi, such as Olee Starstone and Dass Jennir, kept fighting the Empire, and tried to contact the other Jedi. Kenobi and Yoda secretly escaped to Tatooine and Dagobah, respectively. Rahm Kota secretly attacked many Imperial shipments and traveled all over the galaxy being a thorn in the side of the Galactic Empire. However, before hiding, Obi-Wan and Yoda altered a return call being sent from the Temple into a warning to stay away; as a result, several other Jedi survived the immediate purge. Most survivors fell to Vader, but some others fell to Jedi hunters, including the Emperor's Hands, Dark Jedi, and even a handful of bounty hunters."}, {"tag": "h3", "text": "Initial actions"}, {"tag": "p", "text": "About one month after Order 66 was issued, the Jedi Shadday Potkin called for a Conclave on Kessel to discuss options against the Imperial campaign to wipe out the remaining Jedi. A group of seven surviving Jedi, including Bultar Swan and Tsui Choi, gathered on Kessel. However, the conclave was a ruse to trap and kill Vader."}, {"tag": "p", "text": "A false rumor that his former Master, Obi-Wan Kenobi, would be among the Jedi motivated Vader to act. Despite Obi-Wan's absence, Vader demanded his location from the Jedi, threatening them with death. They did not cooperate with his request (in truth, none of them knew where Kenobi was anyway) and, although they put up a valiant fight, no Jedi survived. Potkin's trap for Vader resulted in nothing more than the deaths of more Jedi."}, {"tag": "p", "text": "Rumors spread that the conclave consisted of fifty Jedi, each easily killed by the Dark Lord. In truth, Darth Vader fought only eight with difficulty. However, to cement Vader's image and invoke fear in the remaining Jedi, the Emperor declared the rumors true. Official reports, fabricated by Sate Pestage, stated that some of the Jedi had either been executed for numerous crimes, or that they killed each other in duels for leadership."}, {"tag": "p", "text": "Immediately after Order 66 was issued, Jedi Padawan and survivor Olee Starstone began searching for any surviving Jedi. One destination she investigated was Kashyyyk, where Masters Yoda, Luminara Unduli, and Quinlan Vos had been stationed when the Order was transmitted from Coruscant. She arrived on the planet along with several other Jedi survivors—Siadem Forte, Deran Nalual, Klossi Anno, Iwo Kulka, Jambe Lu, and Nam Poorf, as well as the slicer Filli Bitters. After meeting with Tarfful and Chewbacca, the Jedi learned of Yoda's survival. The Wookiees offered the band of Jedi safe harbor on Kashyyyk, but a CR25 troop carrier arrived at Kachirho, interrupting their meeting."}, {"tag": "p", "text": "Not long after the arrival of the Jedi, the Sith Lord Darth Vader had arrived in the Kashyyyk system, along with the Imperator-class Star Destroyer Exactor, where it joined Wilhuff Tarkin and Executrix. The two planned their attack on Kashyyyk—Vader interested in destroying the fugitive Jedi, Tarkin interested in enslaving the Wookiees for use in the construction of the Death Star. Although the fleet commanders were eager to bombard the planet, Vader overruled them, ordering a direct assault on several cities including Kachirho, Rwookrrorro, Kepitenochan, Okikuti, and Chenachochan."}, {"tag": "p", "text": "At Kachirho, the landed Imperial troops ordered the Wookiees to hand over the fugitive Jedi. The enraged Wookiees attacked the troops, and Starstone and her Jedi soon joined the battle. As more Imperial forces landed, the Wookiee warriors and the Jedi covered the evacuation of Kachirho, as countless Wookiees fled the Imperial troopers, fleeing from enslavement. Imperial landers and gunships were engaged by Oevvaor jet catamarans, retrofitted with rocket launchers and other high-end military hardware, salvaged by the Wookiees from the remnants left over by the earlier Battle of Kashyyyk."}, {"tag": "p", "text": "Meanwhile, Lord Vader piloted a Theta-class shuttle. Eventually making a landing at Kachirho, Vader was confronted by Starstone and her Jedi cadre. Vader killed Forte and Kulka, and injured Lu, Poorf, and Anno, leaving only himself and Starstone in the fight."}, {"tag": "p", "text": "The two briefly faced off, but Jedi Master Roan Shryne and the smuggler Archyr Beil arrived and intervened. Shryne slew Appo while Archyr dealt with the rest of the stormtroopers, and Shryne moved in to engage Vader in a vicious battle, buying Starstone and Archyr more time to escape with the injured Jedi. As Shryne and Vader dueled, the main battle began to drift east of the city, moving closer to the lake, as Imperial gunships and artillery drove the Wookiees down out of the city and towards the ground."}, {"tag": "p", "text": "Abruptly, the Imperial gunships began to retreat from Kachirho, as the orbiting Star Destroyers began their orbital bombardment. Shryne and Vader's duel was interrupted by the strike, and the two moved inside one of the great wroshyr trees. Once inside, Vader used Force throw to throw planks of wood and other debris at Shryne, critically injuring the Jedi in the process and throwing him down from a high bridge. Seeing that Shryne was going to die, Vader chose not to finish off the Jedi, instead revealing his true identity to the man—Anakin Skywalker, who would be redeemed by his son, Luke Skywalker, during the Battle of Endor in 4 ABY."}, {"tag": "p", "text": "As Shryne passed away, Victory-class Star Destroyers began to descend into the atmosphere, finishing the conquest of Kashyyyk. About two hundred thousand Wookiees, including Tarfful, were captured and moved to containment camps on the Wawaatt Archipelago.\nAs a result, the Empire gained control of Kashyyyk, and gained a valuable labor source for the Death Star project."}, {"tag": "p", "text": "Shortly thereafter, another Jedi was discovered taking refuge on Kashyyyk, and Darth Vader led an army, cutting through the forests trying to find him. Kento Marek was found and executed in front of his own son, Galen. Vader sensed potential in the boy, for Galen had actually used his Force abilities to pull Vader's lightsaber out of his hand. When a stormtrooper squad arrived to execute the boy, Vader killed them all, leaving no witnesses, and secretly took the boy under his training."}, {"tag": "h3", "text": "Imperial expansion"}, {"tag": "p", "text": "The monarch of Naboo, Queen Apailana, decided that the situation called for military—not diplomatic—action. She started sheltering fugitive Jedi on the run from the Empire. To crush the uprising on Palpatine's homeworld, the 501st Legion invaded Theed and rushed into the plaza supported by TX-130T fighter tanks after disabling an auto-turret grid. The Jedi were killed by the stormtroopers, and Apailana was shot and killed by a sniper. With Naboo in line, the 501st gained the nickname \"Vader's Fist.\""}, {"tag": "p", "text": "Some years later, a surviving Separatist named Gizor Dellso found refuge on Mustafar. Dellso was the designer of the droid army deactivation signal, and using his knowledge, reactivated a dormant droid army on the planet and planned a revolution. Similarly, the Kaminoan government planned action against the Empire and had grown a clone army. The Clone Wars nearly began again, but Vader's Fist put down both of the revolts."}, {"tag": "h3", "text": "Further actions"}, {"tag": "p", "text": "During the purge, Vader wiped out the farming colony of Talasea for harboring a Jedi. Vader and a number of stormtroopers also killed the last Curator of Records on Toola."}, {"tag": "p", "text": "In 10 BBY, Inquisitor Antinnis Tremayne captured and tortured Jedi Master Darrin Arkanian and his apprentice, Corwin Shelvay, on Coruscant. In an escape attempt, Tremayne killed Arkanian in a lightsaber duel, only to have Shelvay seriously wound him before making it offworld. Tremayne required cybernetics to recover, and was afterward dispatched by Vader aboard Interrogator to scour the Outer Rim for Shelvay. Around this time, Imperial Sentinels were sent off Byss for the first time, to capture Ashka Boda. Bringing him to Coruscant in an Imperial dungeon ship, Palpatine killed him and took the Tedryn Holocron."}, {"tag": "h3", "text": "Rebel foundations"}, {"tag": "p", "text": "Around 17 years into the purge, Jedi survivor Rahm Kota organized a militia and began attacking various Imperial targets. This was an attempt to lure Darth Vader out. Eventually attacking the TIE Fighter Construction Facility over Nar Shaddaa, Vader sent his apprentice, Galen Marek, Starkiller, to eliminate him, rather than coming personally as Kota expected. Kota was presumed dead in the ensuing battle, but somehow managed to survive the duel."}, {"tag": "p", "text": "Starkiller, a tool of Vader's used in his plot to overthrow Palpatine, was sent on two further assassination missions: Kazdan Paratus on Raxus Prime and Shaak Ti on Felucia. Paratus had gone mad and built a junk replica of the Jedi Temple on Raxus Prime, complete with mock statues of each of the Jedi High Council members, but was killed by Starkiller, along with his mock statues of the Jedi Council members being destroyed. Shaak Ti prepared for a possible revolution against the Sith, with her Padawan Maris Brood. She trained the native Jungle Felucians to use the Force and organized them. When Starkiller arrived, the two dueled on a massive Sarlacc pit. Ti warned Starkiller of the nature of the Sith Order before falling into the pit."}, {"tag": "p", "text": "Palpatine's spies had tracked Vader's apprentice back to the Executor. There, Palpatine ordered Vader to kill Starkiller. Palpatine would later find use of Vader's apprentice, and had Vader retrieve his body and bring him back to life, giving him a new mission: gather the enemies of the Empire into one place. Vader disguised this order as another plot to overthrow Palpatine by giving him something else to pay attention to: an army of dissidents and rebels."}, {"tag": "p", "text": "This new mission would lead to Starkiller tracking down an (alive) General Rahm Kota, who was blinded following his duel with Starkiller and became a drunk, supposedly losing his connection with the Force. Kota would lead him to rescue Princess Leia Organa and Senator Bail Organa. Him and Bail talked of rebellion, and would agree that they would need to show other possible rebels that the Empire was indeed vulnerable. This mission led him to destroy a Star Destroyer construction facility over Raxus Prime. This act would inspire senators Mon Mothma and Garm Bel Iblis to join Rahm, Marek, Leia and Bail Organa to sign the Corellian Treaty and officially organize the Alliance to Restore the Republic."}, {"tag": "p", "text": "During this meeting on Corellia, Vader raided, revealing his ruse, and brought the rebel senators to be tortured, interrogated, and executed aboard the Death Star I. Marek would realize his inner Jedi self, traveling to the Death Star and nearly killing both Sith Lords, allowing the senators and Rahm to escape. He would lose his life in the process. The Galactic Civil War had officially started, which began to draw the Empire away from their Jedi hunting and toward destroying the rebellion Palpatine had accidentally created."}, {"tag": "p", "text": "Shortly before the Battle of Yavin, Vader tracked a female Human Dark Jedi down on the planet Dargulli. Despite the fact that she wished to become his Sith apprentice, Vader killed her. Around this time, Vader also killed the Dark Woman, who had been found on Cophrigin V by Mara Jade. Throughout the Purge, CorSec aided Vader and his agents in hunting Jedi within the Corellian sector."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "By 1 BBY, the systematic Purge had concluded, but a few of the survivors would die in the years that followed—including Echuu Shen-Jon, killed by Vader on Krant, and Obi-Wan Kenobi, who sacrificed himself on the first Death Star to ensure the escape of his protégé, Luke Skywalker. As the Galactic Civil War turned in favor of the Rebels, surviving Jedi began to come out of hiding, becoming members of the Alliance, even sacrificing their lives for the return of the Republic and democracy. Famous examples include Echuu Shen-Jon, Rahm Kota, Qu Rahn, Corwin Shelvay and Rachi Sitra."}, {"tag": "p", "text": "Four years after Kenobi's death, Yoda died at the old age of 900 and Anakin Skywalker, formerly Darth Vader, redeemed himself by sacrificing himself to save his son from being killed by his former master, Palpatine, on the second Death Star during the Battle of Endor in 4 ABY. In 5 ABY, one year after the Battle of Endor, Jedi Master Qu Rahn was captured by the Seven Dark Jedi, and after a short but ferocious duel, he was cut down by the former Jedi turned inquisitor Jerec aboard his flagship. The known surviving Jedi would even join the New Jedi Order; in addition, six years after the Battle, Empatojayos Brand sacrificed himself to destroy the spirit of Palpatine on Onderon."}, {"tag": "p", "text": "The Purge was intended not only to symbolically and literally exterminate the entire Jedi Order, but also to consolidate the Jedi's history, knowledge, and technology into Palpatine's possession. Many holocrons, ancient techniques, training materials, and Jedi antiquities were lost. This was primarily due to the efforts of Darth Vader; the Inquisitorius, Dark Jedi whose specific purpose was to seek out and destroy the vestiges of the Jedi Order; and the Imperial Security Bureau, which was responsible for erasing the Order's memories. During his efforts to reestablish the order, Luke Skywalker and his relic hunters did intensive research to locate even the smallest scraps of information pertaining to the old Order, most notably on Onderon where the Jedi artifacts were located during the reign of the reborn Palpatine in 10 ABY. However, not all of the Jedi's writings and teachings were lost forever; in the years after the Second Jedi Purge even up to the events after the Third Jedi Purge, ancient Jedi artifacts were rediscovered by the New Jedi Order across the galaxy, most notably on homeworlds that played a strong role in the history of the Jedi Order, like Tython, Ossus, Ilum, Dantooine, etc."}, {"tag": "h2", "text": "Casualties"}, {"tag": "h3", "text": "Order 66 casualties"}, {"tag": "h3", "text": "Later casualties"}, {"tag": "p", "text": "Many Jedi survived the initial execution of Order 66 and went into hiding. Some succeeded in avoiding the Empire; however, others were eventually tracked down and destroyed."}, {"tag": "h3", "text": "Known survivors or unaccounted Jedi as of the end of the Purge; 1 BBY"}, {"tag": "p", "text": "As of 1 BBY, it was generally accepted that the Great Jedi Purge had concluded after nearly nineteen years of systematic Jedi slaughter. While any surviving Jedi were still to be executed on sight, the Empire was no longer assigning active searches. The Emperor knew there were still survivors, yet they were deemed too few to pose a threat. Though dozens of Jedi were unaccounted for, only around thirty Jedi Masters, Knights, Padawans and Initiates who still followed the Jedi way were definitively known to be alive by this point."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Battle of Shumari, perhaps the most devastating event of the Great Jedi Purge, legions of Imperial troops under Vader's command clashed with a considerable number of Order 66 Jedi survivors. At the end of the battle, all Jedi but one had been killed, many by Vader himself. Shumari had been subjected to heavy orbital bombardment by orbiting Star Destroyers while the planetside battle raged, which devastated the planet completely, rendering it uninhabitable and wiping out all planetside residents. Vader took the lone surviving Jedi as another secret apprentice but was later forced by the Emperor to kill him."}, {"tag": "p", "text": "The details of the Purge are explained in the Expanded Universe. In contrast, the movies show only Yoda and Obi-Wan as survivors while others are either killed or just not mentioned. Some think that this is what George Lucas actually intended, that according to G-canon, the actual survivors were only two, which is supported by Yoda's line to Luke \"The last of the Jedi you will be.\" This statement seems inaccurate if other Jedi were alive as late as after Return of the Jedi, although it could simply refer to Jedi who are still following the teachings of the Order. Many of the survivors ceased to identify themselves as Jedi, despite having Jedi training, in order to exist in the changing galaxy and continue to evade the perpetrators of the Purge—so from a certain point of view, Yoda and Obi-Wan were the last of the open Jedi. Alternately, it could be that Yoda was simply unaware of other Jedi, or that the other Jedi had either already been hunted down or passed away. It is also important to note that during the events of Revenge of the Sith, Obi-Wan changes the beacon in the Jedi Temple to warn any surviving members of the Order away, thus giving them a chance to escape the Purge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}