{"url": "Alliance_to_Restore_the_Republic", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:We're Doomed!", "Category:Alliance to Restore the Republic", "Category:Interplanetary governments", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Alliance to Restore the Republic"}, {"tag": "p", "text": "The Alliance to Restore the Republic (2 BBY–4 ABY), commonly known as the Rebel Alliance, Alliance, the Rebellion, and rarely the Separatists, was a resistance movement formed by Bail Prestor Organa and Mon Mothma to oppose the reign of the Galactic Empire. The Alliance was formed from a less organized movement to oppose the Empire that existed, which was secretly led by Organa. This early group came together from a number of rebel cells, including the crew of the Ghost and the Phoenix Cell. The Atrivis Resistance Group was one of the first cells to join what Mothma began calling \"the Alliance\" before the formal formation of the Alliance to Restore the Republic. The Alliance was publicly and formally declared with the Declaration of the Rebel Alliance."}, {"tag": "p", "text": "The Alliance and the cells before it were born from the overall discontent within the Empire of those who wished the Old Republic restored. Its efforts were led by renegade members in the Imperial Senate such as Mon Mothma, Bail Organa, and later, his daughter Leia Organa, and its members were citizens of the Empire and defectors from the Imperial Military such as Jan Dodonna, Ryder Azadi and Wedge Antilles. Founded and united by Organa and Ahsoka Tano, the early rebels were assisted by surviving Jedi, such as Kanan Jarrus, and his Padawan, Ezra Bridger. Clone Wars veterans such as Captain Rex also assisted in the initial movement."}, {"tag": "p", "text": "As opposed to waging all-out war, the Alliance waged a war of attrition against the Empire, establishing small bases across the galaxy instead of controlling an entire planet."}, {"tag": "p", "text": "When the Alliance stole the plans for the Empire's ultimate weapon, the Death Star, and destroyed the space station in the Battle of Yavin with the help of Luke Skywalker, the tide of the war began to turn, and the Rebel threat began to prove a severe thorn in the Empire's side. The Rebellion continued to engage in battles with the Empire in the Galactic Civil War. However, under the command of Darth Vader, the Imperial forces succeeded in defeating the Alliance on Hoth, forcing the Alliance to scatter its forces in order to survive."}, {"tag": "p", "text": "Eventually, the Alliance prevailed against the Empire and critically damaged it by launching an attack against the second Death Star during its construction in what would become the Battle of Endor. Not only did the Alliance manage to destroy the battle station, but the Imperial Navy was severely crippled by the loss of one of its Super Star Destroyers, and Luke Skywalker redeemed his father, Darth Vader, who killed Emperor Sheev Palpatine, before dying himself in the battle. The Alliance was soon reorganized into the fledgling New Republic, which went on to defeat the Empire at the Battle of Jakku one year after Endor and force the Empire to surrender by signing the Galactic Concordance, effectively ending the war."}, {"tag": "p", "text": "By the time of the Battle of Yavin, the Rebel Alliance had chosen a red starbird as its symbol and logo."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early foundations"}, {"tag": "h4", "text": "Resistance movements aided by the Jedi"}, {"tag": "p", "text": "While the Alliance to Restore the Republic was a resistance movement opposed to the tyranny of the Galactic Empire and its New Order, its roots predated the actual birth of the Empire, when the Galactic Republic was in its last years of existence. During the Clone Wars, a conflict that pitted the Republic against the Confederacy of Independent Systems, the Jedi Order helped create resistance units on Separatist-held worlds as part of a plan proposed by Jedi Knight Anakin Skywalker, one example being the Onderon rebels. However, it was not for many more years that such rebel cells would coalesce into a single Rebellion with a centralized leadership."}, {"tag": "h4", "text": "Delegation of 2,000"}, {"tag": "p", "text": "Also during the Clone Wars, Supreme Chancellor Sheev Palpatine had managed to obtain many emergency powers from the Galactic Senate, which caused certain members of the Chancellor's own Loyalist Committee, including Bail Prestor Organa of Alderaan, Padmé Amidala of Naboo, and Mon Mothma of Chandrila, to start to complain about the chief of state's conduct. The discontented senatorial representatives ended up forming the Delegation of 2,000. They signed the Petition of 2,000, a document that formally expressed its signatories' concerns with Palpatine's rule and called for him to relinquish his emergency powers as soon as possible. Senator Meena Tills of Mon Cala was among the petitioners."}, {"tag": "p", "text": "Shortly thereafter, the Clone Wars was brought to an end. Far from relinquishing his dictatorial status, Chancellor Palpatine unilaterally abolished the Republic in front of the whole Senate and anointed himself the Galactic Emperor, thus transforming the democratic government into an authoritarian regime, the Galactic Empire. Unbeknownst to most of the galactic community, the self-promoted Emperor Palpatine was in fact the Sith Lord Darth Sidious, who had masterminded the Clone Wars so that he could gain power and overthrow the Republic. The Emperor immediately started to subvert democracy in the galaxy and declared the peacekeeping Jedi Knights enemies of the state. In the immediate aftermath of the Clone Wars and Senator Amidala's death at the hands of her husband, Darth Vader, the identity adopted by Anakin Skywalker when he became Sidious's Sith apprentice, Senators Organa and Mothma started working in secret to overthrow the Empire."}, {"tag": "h4", "text": "Age of the Empire"}, {"tag": "p", "text": "In the absence of any major opposition, the Galactic Empire thrived during the early days of Palpatine's reign, amassing a vast military and using it to instill fear in the civilian population. The reformed Senate, being even less effective than it was during the last years of the Republic, did nothing to restrain that massive military expansion. Meanwhile, in the deepest secrecy, the Empire worked on the Death Star, a moon-sized battle station capable of destroying entire planets. Although many people held a grudge against the Empire, few dared to act. Those who did often acted solely in their own interests, which actually made it harder for any kind of real, organized rebellion to appear."}, {"tag": "p", "text": "A rare example of organized resistance against the Empire was that of Cham Syndulla's Free Ryloth Movement, which wanted to end the Imperial occupation on the planet Ryloth. It was formed from the Twi'lek Resistance, which had resisted the occupation of Ryloth by the Separatists during the Clone Wars. Over the years, the movement established hidden bases across the Ryloth system and executed raids against the Imperials."}, {"tag": "p", "text": "Another rebel cell emerged one year after the end of the Clone Wars when the Empire decided to severely punish the world of Antar 4 for its past ties with the Confederacy of Independent Systems. That murderous operation, spearheaded by Wilhuff Tarkin, prompted the former Republic Intelligence agent Berch Teller into founding his own resistance cell. Teller hoped they were contributing to what would eventually grow into a cause against the Empire. Four years after its formation, the insurgents managed to steal the Carrion Spike, the personal starship of Tarkin, to attack various Imperial targets with information provided to them by an Imperial traitor, Vice Admiral Dodd Rancit. Teller's insurgents later launched an attack on an Imperial convoy transporting important parts for the Death Star project. Their plans were soon thwarted by Tarkin's timely intervention, which resulted in the killing of every insurgent except Teller."}, {"tag": "h3", "text": "The early rebellion"}, {"tag": "h4", "text": "Scattered cells"}, {"tag": "p", "text": "However, by 5 BBY, a number of rebel cells had formed, operating all across the galaxy as part of an early rebellion against growing Imperial oppression, especially in light of the Empire's continuing expansion throughout the Outer Rim. One of these cells was the Spectres, which formed on the Imperial-controlled Outer Rim planet of Lothal. Insurgencies began in the Atrivis sector as well, with the Liberators seizing an Imperial garrison, yet being devastatingly defeated by the Imperial Navy soon afterwards. The Atrivis Resistance Group, led by Travia Chan, was also active in the Atrivis sector, and after deliberation, decided to join Senator Mon Mothma, becoming one of the first groups of what Mothma had begun calling \"the Alliance.\""}, {"tag": "p", "text": "Another rebel cell was Phoenix Cell, led by Commander Jun Sato, who were a part of a larger rebel network led by Ahsoka Tano and Senator Organa, who had already opposed Palpatine many years earlier. At that point, members of those cells were not supposed to know they were part of a larger movement known as the rebellion, so if captured, they could not give information on the other rebel cells. The cells were only provided with intelligence on a need-to-know basis by Ahsoka Tano, using the code name of \"Fulcrum.\""}, {"tag": "p", "text": "Due to the increased rebel activities around Lothal, the Imperial Security Bureau dispatched Agent Alexsandr Kallus to hunt down the Spectres. Kallus saw the rebel activities as part of a pattern which could lead to a spark of rebellion. After the Spectres frustrated several Imperial efforts to capture them, Grand Moff Wilhuff Tarkin visited Lothal and warned the Imperial officials and officers that while the various factions, cells, tribes lacked unity, the rebels on Lothal were unique because they in fact had unity, which made them a credible threat to the Empire. Tarkin warned that the failures of Imperial forces on Lothal had allowed the Spectres to represent hope, and ordered The Grand Inquisitor to execute two of the incompetent Imperial officers. He warned the others that failure would have consequences."}, {"tag": "p", "text": "The rebellion's existence was finally revealed to the Empire when they captured Kanan Jarrus after he and the rest of the Spectres were able to hack and send out a rebellious transmission to Lothal and many surrounding systems. His capture prompted his fellow Spectres to launch a mission to rescue him from Tarkin's personal Imperial Star Destroyer, the Sovereign, over Mustafar. In order to save one of their cells and the only other Jedi involved in the movement other than herself, Tano led Phoenix Squadron to assist in their escape. Following the successful rescue, she informed the Spectres that their protocol of secrecy had changed. In response to the transmission sent by the Spectres and the rumors of the rebel action over Mustafar, anti-Imperial unrest began on Lothal and several other worlds. In response, the Emperor dispatched Darth Vader to deal with the issue."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "New alliances"}, {"tag": "p", "text": "Following the Siege of Lothal, the Spectres were forced to retreat from Lothal and Phoenix Squadron was crippled when Vader destroyed their command ship. As a result of their encounter with Vader on Lothal, the Spectres decided to permanently join Phoenix Squadron. Despite the attack, the Spectres were able to recruit retired Clone Captain Rex to their cause. Phoenix Squadron was also able to acquire a prototype B-wing starfighter from Mon Calamari engineer Quarrie. Working with Rex, the Spectres were able to destroy the Imperial Interdictor. The Spectres also prevented members of the Inquisitorius from capturing several Force-sensitive children."}, {"tag": "p", "text": "Later, the Phoenix Squadron suffered a major blow when the Empire learned they were hiding on the planet Garel. The Phoenix Squadron managed to escape but suffered some losses during the Battle of Garel. After Senator Bail Organa learned of their losses, he sent his daughter Princess Leia Organa to deliver three Sphyrna-class Hammerhead corvettes to them on Lothal. In 3 BBY, Phoenix Squadron undertook a mission to seek safe passage for the rebellion through the Concord Dawn system. After meeting resistance from Fenn Rau's Mandalorian Protectors, the Spectres managed to kidnap him and force him to meet their demands for safe passage after a second attempt."}, {"tag": "p", "text": "Afterward, the Spectres and Cham's Free Ryloth movement joined forces to steal a Quasar Fire-class cruiser-carrier above the planet Ryloth. The stolen carrier became the new flagship Phoenix Nest of Phoenix Squadron. With the help of Chopper and the former Imperial RA-7 protocol droid AP-5, Phoenix Squadron established a new base called Chopper Base on the planet Atollon."}, {"tag": "h4", "text": "Eluding Thrawn"}, {"tag": "p", "text": "The Imperial tactician Thrawn was promoted by the Emperor to Grand Admiral for his role in obliterating the rebel insurgency in the Batonn sector and the mastermind vigilante Nightswan. Nightswan had once planned on bringing various rebel and insurgent groups together as an alliance, but, as he had recalled to Thrawn, he stopped because of paranoia, distrust, \"squabbling,\" and pride. Nightswan did not know if any individual would succeed in creating a rebel alliance, simply knowing he was not the man who could."}, {"tag": "p", "text": "Grand Admiral Thrawn believed that the Empire was facing a galaxy-wide insurgency and studied his enemies' philosophy, art, and history in order to defeat them. In response to the activities of the Phoenix Squadron in the Lothal sector, Governor Arihnda Pryce enlisted his help in defeating them. Thrawn was not content with destroying Phoenix Squadron but sought to destroy the entire rebel fleet. Consequently, he allowed the squadron to escape with several stolen Y-wings during a mission to Reklam Station. These Y-wings were sent to General Jan Dodonna's unit."}, {"tag": "p", "text": "The rebellion also received an unexpected ally in the form of Agent Kallus, a former adversary of the Phoenix Squadron and Spectres. Kallus had undergone a change of heart after befriending Zeb Orrelios on the ice moon of Bahryn. Kallus became the rebel spy known as Fulcrum and informed the Phoenix Squadron that several TIE fighter pilot cadets at the Skystrike Academy were planning to defect. Kallus also helped the rebel Sabine escape with the defecting pilots Wedge Antilles and Derek Klivian, who would later join the Alliance's Starfighter Corps."}, {"tag": "p", "text": "After the Imperial Viceroy Gar Saxon massacred the Mandalorian Protectors, Fenn Rau finally joined the rebellion. After the Phoenix rebels evacuated rebel sympathizers from the planet Mykapo, the rebel cell Iron Squadron joined the larger rebellion. The Spectres later undertook a mission with the former Lothal Governor Ryder Azadi's rebel cell to steal Thrawn's plans for a new prototype starfighter from the Imperial Armory Complex on Lothal. During the course of their mission, the rebels were helped by Agent Kallus."}, {"tag": "p", "text": "Later, Rebel Command dispatched Saw Gerrera and his Partisans on a mission to investigate the disappearance of the Geonosian species. With the help of the Spectres and the Geonosian survivor Klik-Klak, the rebels discovered evidence that the Empire had perpetrated genocide against the Geonosians. They used this information to raise awareness of Imperial atrocities and to sway more worlds to their cause."}, {"tag": "p", "text": "Thrawn also embarked on an ambitious program to search for Phoenix Squadron's base by dispatching E-XD-series infiltrator droids to sweep the Outer Rim Territories for signs of rebel activity. One unit, EXD-9, discovered Chopper Base but Zeb, Chopper, and AP-5 reprogrammed him into an improvised bomb that was sent back to its base and destroyed one of Thrawn's Star Destroyers. Despite this setback, Thrawn managed to narrow down the search for Chopper Base to 94 systems. Thrawn also later discovered that Kallus was a rebel spy who was leaking information to the rebellion, and decided to use him against the rebellion."}, {"tag": "h4", "text": "Official formation"}, {"tag": "p", "text": "The Rebel Alliance formally came into existence after Senator Mon Mothma resigned from the Imperial Senate and denounced the Emperor for his role in the Ghorman Massacre. With the help of Phoenix Leader Hera Syndulla and her Spectres, Mothma escaped Thrawn's forces by traveling through the dangerous Archeon pass to reach Dantooine. There, Mon Mothma gave a HoloNet speech calling for the galaxy to rise up in rebellion against the Empire. Mothma's message was heard by the scattered rebel cells throughout the galaxy including Lothal and Atollon. The rebel fleet converged above Dantooine, and the various cells and factions were unified into the Alliance to Restore the Republic, which officially began the Galactic Civil War."}, {"tag": "p", "text": "As part of the planned attack on Lothal, Syndulla dispatched the droids AP-5 and Chopper along with the former Imperial cadet Wedge Antilles to steal clearance codes from the Imperial Security Bureau station on the moon Killun 71. During the course of the mission, Chopper was hijacked by a group of Imperial slicers and intelligence officers led by LT-319, who were based aboard an IGV-55 surveillance vessel. LT-319 tried to use Chopper to kill the Spectres and find the location of Chopper Base. However, Hera managed to reprogram Chopper and transmitted a data surge that destroyed the Imperial surveillance vessel."}, {"tag": "p", "text": "Having obtained the clearance codes, the Phoenix Squadron began training for their mission to Lothal. Ezra Bridger was briefly distracted when he departed with Chopper on an errant mission to Tatooine to save Obi-Wan Kenobi from the former Sith apprentice Maul. Kenobi told Bridger to return to his place with the Rebellion and defeated Maul in combat."}, {"tag": "h4", "text": "Ambush on Atollon"}, {"tag": "p", "text": "As part of the final stage of the planned attack on Lothal, General Dodonna and his Massassi Group traveled to Atollon to rendezvous with Phoenix Squadron. However, Thrawn's spies reported the trajectory of Dodonna's forces to the Grand Admiral. After exposing Kallus as Fulcrum, Thrawn used the trajectories of Massassi Group and Kallus' Fulcrum transmission to determine the location of Chopper Base and Atollon. Thrawn's Seventh Fleet, using Interdictor cruisers blockaded the Atollon system, preventing the rebels from carrying out their attack on Lothal and almost instantly taking EF76 Nebulon-B escort frigate. Trapped in the system, the rebels were forced to attack blockade using a tactic which included bombing runs which would try to break the Imperial positions. Thrawn knew about this and ordered his ships to keep to their positions. He then quickly fragmented Green Squadron as they attempted to cripple his Star Destroyers. He then counterattacked with his TIE squadrons, destroying several rebel corvettes including the Sphyrna-class corvette P2. Realizing his tactic was hopeless, Commander Jun Sato ordered the fleet to charge the blockade, and the Star Destroyers took out a second Nebulon-B frigate and the Braha'tok-class gunship Orion almost instantly."}, {"tag": "p", "text": "Bridger and Chopper managed to escape on the Gauntlet fighter Nightbrother after Commander Sato sacrificed his life to destroy an Imperial interdictor vessel that was blocking hyperspace jumps. Ezra appealed to Mon Mothma for help, but the rebel leader was unwilling to expose the Alliance's true strength to Thrawn. Mothma agreed that Senator Organa was right when he said that the rebels were not yet ready to enter into open warfare with the Empire. With the Rebel Alliance unwilling to help, Ezra solicited the help of Sabine's Clan Wren, who destroyed Thrawn's second interdictor cruiser. As a result, the few surviving rebel forces, under Captain Syndulla and General Dodonna, emerged from the surface taking heavy losses along the way and were able to flee to Yavin 4. Only a few ships, including the Ghost, the CR90 corvette Liberator, two Sphyrna-class corvettes P1 and P3 and an assortment of RZ-1 A-wing interceptors and Y-wings got out."}, {"tag": "h4", "text": "Return to Lothal"}, {"tag": "p", "text": "After their attempt to attack the Lothal factories ended with the loss at Atollon, the Spectres returned to Lothal to help the Lothal resistance and its leader Ryder Azadi. They got information of Thrawn's newly upgraded TIE/D Defender. Ezra Bridger and Sabine Wren stole the prototype but didn't get far thanks to its self-destruct system and had to escape with the hyperdrive. They then sent Hera Syndulla back to the Alliance High Command to call for an attack on the TIE Defender factory on Lothal of which they accepted. Hera returned with a Squadron of X-wing starfighters piloted by Mart Mattin, Cleat, Duke and Secon Daree and many others. But Thrawn was there and he had a trap set for them. One by one they fell, and Hera, Mattin, and Daree were the only confirmed survivors. Thrawn sent his assassin Rukh to find them, and he quickly captured Daree and Hera."}, {"tag": "p", "text": "Shortly after, Ezra, Sabine and Kanan Jarrus went to save Hera. Kanan broke into Governor Arihnda Pryce's office and rescued Hera whilst Ezra and Sabine, disguised as TIE pilots, went to find them a way out. Kanan and Hera escaped on a glider to the Lothal City fuel depot where they were met by Ezra and Sabine in a patrol transport. Pryce then arrived on an All Terrain Armored Transport which fired upon the fuel pod. Kanan sacrificed himself to save the others, and the fuel depot was lost, halting the production of TIE/D Defenders on Lothal."}, {"tag": "h4", "text": "Building the Alliance"}, {"tag": "p", "text": "By 0 BBY, the Alliance had become a full-fledged resistance movement headed by Bail Organa and Mon Mothma, with the latter bearing the title of Chancellor, was established. Now in possession of a respectable starfleet that included T-65B X-wing starfighters, BTL-A4 Y-wing assault starfighter/bombers, A-wing starfighters, and large ships that included MC80 Star Cruisers, at least one MC75 Star Cruiser, EF76 Nebulon-B escort frigate, and various corvettes, gunships, and transports, the Alliance was finally able to fight the Empire on better terms. At the time, the Alliance was headquartered on the lush moon of Yavin 4, in an ancient stone structure known as the Great Temple. At some point, after receiving a distress signal from Tak Base, the Rebellion undertook a mission to Talay."}, {"tag": "p", "text": "Leia Organa, the surrogate daughter of Bail Organa and crown princess of Alderaan, had succeeded her adopted father in the Imperial Senate and was also a secret member of the Alliance. Prominent Alliance war leaders of the time included General Jan Dodonna and Admiral Gial Ackbar. Some of the Empire's Joint Chiefs, like General Cassio Tagge, realized the full threat of what they called \"the Rebellion.\" Others, like Admiral Conan Antonio Motti, believed in the infallibility of the Empire's might. The Imperials, in an attempt to avoid dissent and sympathy for the Rebellion amongst loyal Imperial citizens, ensured that, through the use of propaganda, they did not know how large of a threat the Alliance truly was, assuring them that it was merely an unorganized and vengeful terrorist organization."}, {"tag": "h4", "text": "Victory at Scarif"}, {"tag": "p", "text": "The Alliance's first major battle with the Galactic Empire was on the tropical planet of Scarif, in which the Alliance scored its first large-scale victory in the war. Prior to the battle, Alliance Intelligence intercepted information suggesting that renowned scientist Galen Erso was building an Imperial superweapon capable of destroying entire planets. Alliance leadership sent Galen Erso's daughter, Jyn Erso, and Captain Cassian Andor to learn more about her father's involvement, and their subsequent efforts saw the Alliance discover the existence of the Death Star, as well as a fatal flaw in the design placed there by Galen Erso. During the Battle, the Alliance managed to steal the blueprints of the Death Star, which had just been completed after nearly two decades of work, from the Imperial satellite base on Scarif. The plans to the Death Star were then transported to Princess Leia Organa on the Tantive IV."}, {"tag": "h4", "text": "Victory at Yavin"}, {"tag": "p", "text": "Following the Battle of Scarif, Princess Leia's ship fell under Imperial attack over Tatooine, and she was captured by the dreaded Darth Vader himself, which prevented her from bringing the blueprints to her father back on Alderaan. She still managed to entrust the plans to the droids R2-D2 and C-3PO, who escaped the ship in an escape pod and landed on Tatooine below. After Imperial Grand Moff Wilhuff Tarkin ordered the destruction of Alderaan with the Death Star's superlaser, Leia Organa was rescued from the battle station's jail by the crew of theCorellian YT-1300f light freighter Millennium Falcon, who returned her the two droids. The group—except for Obi-Wan Kenobi, who gave his life battling Darth Vader—escaped the Death Star aboard the Falcon and headed for the Alliance headquarters on Yavin 4, where the plans of Empire's superweapon were analyzed."}, {"tag": "p", "text": "Having traced the fleeing rebels, the Empire discovered the location of the Alliance base, and the Death Star closed into Yavin 4. The Alliance then launched its assault against the battle station, with Princess Leia monitoring in the command center. Luke Skywalker joined the mission in his own way, piloting an X-wing under the call sign of Red Five. As the Empire readied to destroy Yavin 4 and the Alliance with a single blow of its superlaser, Han Solo unexpectedly saved Skywalker by blasting a group of Imperial TIE/ln starfighters that were giving chase. Skywalker managed to fire a proton torpedo into the Death Star's thermal exhaust port, destroying the battle station by exploiting its only weakness."}, {"tag": "p", "text": "In the shadow of Yavin, the Alliance had won its first major tactical victory, but at an enormous cost in lives. In addition to the Alliance pilots who died during the assault, at least millions of Alderaanians had perished with their planet, Bail Organa among them. After an award ceremony during which Princess Leia presented the heroes of the day with medals of Bravery, Alliance General Dodonna made it his priority to have Yavin 4 evacuated. Now that the Empire knew their location, they had to find a new base of operations as soon as possible. Darth Vader became obsessed with finding the young rebel who had destroyed the Death Star right under his nose. Unbeknownst to him, until learning Luke's last name through Boba Fett, and the rebels at the time, he was in fact the biological father of both Luke Skywalker and Leia Organa. Not long after the Battle of Yavin, the Rebel fleet relocated to the Pantora system."}, {"tag": "h4", "text": "Rescuing Drusil Belphorin"}, {"tag": "p", "text": "Luke Skywalker and Nakari Kelen were tasked with rescuing the Givin Drusil Bephorin, who the Empire was watching closely for her expert slicing skills. They met with a Kupohan spy called Sakhet on Denon, who directed them to Drusil. They extracted the Givin and took her to Kupoh, where another one of Sakhet's contacts Azzur Nessin owned a company in the capital of Tonekh city called Nessin Courier & Cargo. He repaired their ship, whilst they kept one of his employees Migg Birkhit from bringing the Empire to them. They managed to contain a Gotal ISB agent called Barrisk Favvin, along with Migg. Then, another employee Ruuf Waluuk called in a Devaronian mercenary and he killed Nessin before Skywalker and Kelen killed them both. They escaped the Kupoh system and went to Omereth, where Drusil's family were waiting after being extracted by Major Bren Derlin. However, bounty hunters intercepted them and they crashed into the ocean and swam to the land where they face the many mercenaries. Kelen died in the fight, but Luke reunited Drusil with her family and she promised to return and help them."}, {"tag": "h4", "text": "Advancement into the Mid Rim"}, {"tag": "p", "text": "Bolstered by the victory at Yavin, the Alliance generals had thousands of ships and hundreds of battle groups, including Twilight Company, advance into the Mid Rim. Many battles broke out and the Alliance gained lots of ground. But nine months in, the Fleet became over-extended and a halt was ordered. This was soon followed by a retreat and the forces began evacuating their bases."}, {"tag": "h4", "text": "Attack on Weapons Factory Alpha"}, {"tag": "p", "text": "Shortly after their victory at Yavin, the Rebels launched an Assault on Cymoon due to it's Imperial weapons factory. Luke Skywalker, Princess Leia, R2-D2 and Han Solo went in undercover to the factory, while Chewbacca served as a sniper and C-3PO stayed on the Falcon as their escape pilot. Despite a run-in with Darth Vader, the Rebels were able to destroy the factory. However, during this brief encounter with Vader, he saw Luke's lightsaber. He recognized it as his old saber and began his hunt to find the origins of Luke."}, {"tag": "h4", "text": "Battle of Vrogas Vas"}, {"tag": "p", "text": "Darth Vader had been getting information on the boy who blew up the Death Star, he had recently found out his name confirming Luke to be his own son. Vader's rival Commander Karbin discovered his location and leaked it to Vader's helper, Dr. Aphra who sent Vader to the location, Vrogas Vas. He instantly ran into three X-wing squadrons, Red Squadron, Blue Squadron and Yellow Squadron of which he began obliterating, before Luke crashed his X-wing into Vader's TIE Advanced and they both crashed onto the surface. The Alliance forces at Vrogas Vas refueling base, then deployed hundreds of troops supported by dozens of tanks and they went hunting Vader. They also deployed the Y-wings of Gray Squadron to attack Vader and he destroyed them by hurling rocks with the Force."}, {"tag": "p", "text": "Vader soon found himself surrounded by the many ground forces but did not fear them. He outsmarted them by activating their grenades and scattering them. He then mowed more of them down, whilst deflecting tank shots and taking out the T-47 airspeeders of Cyan Squadron. Meanwhile, Dr. Aphra had come to Vrogas Vas and captured Luke. Leia Organa, Han Solo, and Chewbacca had also arrived and Han went to save Luke, whilst Leia took a strike team to find Vader. Whilst Han faced off with Dr. Aphra, Vader took out Leia's squad but let her go to attract more rebels to him. Leia sent the Y-wings of Amber Wing to bomb the area, but they were soon stopped by Commander Karbin and his forces and Karbin tried to take Luke. Vader stopped Karbin's men and faced off with Karbin. Vader defeated Karbin, whilst Leia, Han, Luke, and Chewie escaped with a captured Dr. Aphra. With the Empire overrunning them, the Alliance forces were forced to retreat as well."}, {"tag": "h4", "text": "Mid Rim Retreat"}, {"tag": "p", "text": "The Mid Rim Retreat was the Empire pushing the Alliance back from the Mid Rim following their former advancement. Companies such as Twilight Company, Fish Eye Company, Bitter Pill Company and the Twenty-First were either defending, distracting or rescuing. It was part of the Alliance's withdrawal from the Mid Rim."}, {"tag": "p", "text": "Twilight Company launched a campaign on Haidoral Prime as a part of a distraction for the Alliance Fleet to withdraw from the Mid Rim. During the campaign, Sergeant Hazram Namir and his squad extracted the defecting Governor Everi Chalis. She offered herself as a necessary asset to the Alliance, as she knew a lot about the inner-workings of the \"Imperial war machine.\" Captain Micha Evon took an interest in this, but the soldiers weren't having it. One of them, Corbo, took a knife to her holding cell, because he was still grief-stricken after one of her laws had his pet Felinx killed. They then suffered a run-in with an Imperial patrol. But in the Coyerti campaign, Chalis gave them valuable intelligence on a distillery of which Namir and his squad destroyed. Twilight Company then suffered three more attacks in the Metatessu sector and realized the CR90 corvette Thunderstrike's hyperdrive was leaving a trail. Chalis arranged a raid on an Imperial heavy freighter for them to get supplies. Her plan worked flawlessly, but with the loss of two sergeants, Fektrin and Maximian Ajax."}, {"tag": "p", "text": "Meanwhile, the Alliance was taking heavy losses during their withdrawal from the Mid Rim. Whilst the Twenty-First battled on Bestine and Bitter Pill Company lost their transport on a trash heap of a planet, the Alliance lost Unroola Dawn, Talrezan Four and Hope Station, General Amrashad was killed."}, {"tag": "p", "text": "Chalis and Captain Evon then got an invite to Echo Base and they took Namir, Roja and Beak with them. Meanwhile, the rest of Twilight Company went to the Elochar sector where a flotilla, including the Sixmoon, was stationed. Chalis, Evon and the other three got to Echo Base on Hoth, where they met up with General Philap Bygar, who took them to a strategy conference. The other three did jobs around the Base in the meantime and Namir got into a fight with an Rebel Alliance Special Forces soldier called Kryndal, over the ethics of the Alliance. The strategy conference went as planned, but the alarm soon went off that the Empire had found them."}, {"tag": "h4", "text": "Defeat at Hoth"}, {"tag": "p", "text": "In 3 ABY, one of the many Imperial probe droids searching the galaxy ended up discovering the Rebels' presence. The Imperial Death Squadron, Darth Vader's personal armada, headed for Hoth with a contingent of ground troops, ready to crush the rebellion once and for all. However, due to a mistake by the Imperial admiral Kendal Ozzel, the Alliance forces were warned of the Empire's arrival. The Rebels had time to activate the deflector shield protecting Echo Base, rendering orbital bombardment impossible. As the Alliance prepared for evacuation, Imperial troops disembarked on the surface of Hoth, beyond the range of the energy shields. Once there, several legions of snowtroopers advanced on Echo Base. A squadron of All Terrain Armored Transports under the command of General Maximilian Veers was tasked with destroying the massive generators powering the Rebel base's shield. Perimeter Outpost Delta fell first with Sergeant Hazram Namir, Roja and Beak being forced to retreat back to the main base to find Captain Micha Evon and Everi Chalis."}, {"tag": "p", "text": "Luke Skywalker, now a commander, led his Rogue Squadron of snowspeeders against General Veers' armored transports. By using a harpoon gun and tow-cable, the Rebels managed to bring down one of the transports, but Skywalker's snowspeeder was shot down. Unlike his gunner Dak Ralter, the Rogue commander survived the accident. With the help of his lightsaber and a grenade, he still managed to destroy another walker. Despite the Rebels' best efforts to delay Veers' armored transports, the Imperial general successfully blew up the protective shield generator, allowing Darth Vader and his men to enter Echo Base. While the Rebel command personnel and material was loaded into transports and whisked away just in time, the unprepared Alliance soldiers engaged the Imperials in conventional warfare. Namir and his two men got back to the main base to find Chalis with and Captain Evon, who was unconscious. They then encountered Darth Vader who killed Captain Evon, Roja, and Beak. Namir and Chalis escaped on a shuttle with Chalis' clearance codes."}, {"tag": "p", "text": "Unable to reach a transport, Princess Leia Organa, Han Solo, Chewbacca and the droid C-3PO took their flight in the Millennium Falcon. The Alliance delayed the Imperial troops long enough to get its most important staff off the planet, and its ground-based ion cannon temporarily disabled all ships of the Imperial Death Squadron, preventing them from attacking the escaping transports. All in all, the Empire still won a major victory on Hoth, as the Alliance was routed from its base once again and barely escaped Death Squadron's blockade. The Imperial victory left the Alliance scattered and General Philap Bygar was killed during or after the battle when running from the Imperials."}, {"tag": "h4", "text": "Leia and Solo on the run"}, {"tag": "p", "text": "Princess Leia, Han Solo, Chewbacca, and C-3PO were on the run on the Millennium Falcon. They evaded many Imperial-class Star Destroyers before escaping the clutches of Captain Lorth Needa. They then traveled to Cloud City on the gas giant Bespin to meet with Han's old friend Lando Calrissian. Lando had the Millennium Falcon repaired but when the time was right, he betrayed them, handing them over to Darth Vader, who wanted to set a trap for Luke Skywalker. He had Solo frozen in carbonite as Skywalker came to Cloud City with R2-D2. Vader then confronted Skywalker, and after defeating him in a duel, revealed that he was his father. Meanwhile, Lando had his security turn on the Empire and Cloud City descended into chaos. Skywalker ran from Vader and was rescued by the two as they escaped Cloud City with Chewbacca, C-3PO, and R2-D2. Solo was taken to Jabba the Hutt by Boba Fett, who had initially tracked them to Bespin."}, {"tag": "h4", "text": "Operation Ringbreaker"}, {"tag": "p", "text": "Shortly following the Battle of Hoth, the Sixty-First had found itself beheaded with their captain Micha Evon killed on Hoth and the rest of the officers killed in the Elochar sector. They were stranded on Ankhural with vital repairs being done to the Thunderstrike, and they needed a purpose, so Chalis and Namir (who took charge) initiated Operation Ringbreaker, which sought to force Imperial redeployments from the shipbuilding world of Kuat by assaulting worlds such as Obumubo, Naator, Xagobah and the asteroid mines of the Kuliquo belt, thus allowing the Alliance to assault its ultimate goal. This was led by the Alliance's Sixty-First Mobile Infantry, commonly known as Twilight Company. One of the final planets in the chain before the attack on Kuat itself was the mining world of Sullust. The Twilight Company attacked the Inyusu Tor mineral processing facility. The facility was quickly overtaken, and victory seemed sure until Twilight Company's ship, the Thunderstrike, was shot down and damaged beyond repair while attempting to pick up the division."}, {"tag": "h4", "text": "Liberating Sullust"}, {"tag": "p", "text": "Twilight Company was forced to guard the facility until they could find another way off the planet. The Imperial-class Star Destroyer Herald and the ground forces advanced on them. They were aided by the local rebel cell led by Nien Nunb, although the tide of the battle was only truly changed when Governor Everi Chalis disabled the Imperial-class Star Destroyer Herald using a shuttle and ion mines. In the following days, an interim government would be installed in Pinyumb, while heavy losses sustained by the Sixty-First would ultimately cancel Operation Ringbreaker, allowing the company to act as a temporary police force for the Sullustan people. Their Braha'tok-class gunship the Apailana's Promise had barely survived after returning to help them against the Herald. Subsequent pirate broadcasts and intercepted Imperial signals indicated further insurrections across the planet, delaying the inevitable Imperial counterattack."}, {"tag": "h4", "text": "The Second Death Star"}, {"tag": "p", "text": "Sometime between 3 ABY and 4 ABY, the Bothan spynet found information confirming the existence of a second Death Star, DS-2 Death Star II Mobile Battle Station, and immediately began to dig for more information. The Emperor found out about this and sought to set a trap for the Alliance. He let more information be fed more to the Bothans, with many of them dying in order to get it, and hid the fact that the Death Star's superlaser was complete. The new information revealed the location of the Death Star (Endor), the shield protecting it and the shafts within it big enough for starfighters to pass through to the core. When the Alliance High Command got this information, they launched Operation Yellow Moon in order to distract Imperial forces across the galaxy. This was led by Princess Organa and her strike team. Meanwhile, the rebels on the MC80 Star Cruiser Invincible Faith had intercepted a message from Moff Raythe, which would reveal the Emperor's trap if they decrypted it in time, but they had also captured Commander Iden Versio of the Empire's Inferno Squad, who had let it happen so she could get rid of the message. She broke free, forced her way through the ship and deleted the message making sure no-one in the Alliance could know about the trap. Iden escaped with the help of the other members of Inferno Squad."}, {"tag": "h4", "text": "Triumph at Endor"}, {"tag": "p", "text": "In 4 ABY, the Alliance to Restore the Republic was determined to deal a fatal blow to Emperor Palpatine's tyranny. After having learned that the Empire had secretly begun construction on a second Death Star even more powerful than the first one, the Alliance fleet rendezvoused near Sullust to plan an attack. Thanks to its Bothan spies, the Alliance had learned that Palpatine himself was to oversee the final construction stages of the new battle station."}, {"tag": "p", "text": "It was decided that a rebel strike team led by Luke Skywalker, Leia Organa, Han Solo and Chewbacca would land on Endor in a stolen Lambda-class T-4a shuttle, with the mission to deactivate the Death Star's energy defense shield. Little did they know that they had fallen into a trap. When they reached the shield's bunker, the Imperial army was waiting for them. In orbit of Endor, the Alliance fleet was ambushed by a large Imperial armada led by the Super Star Destroyer Executor that emerged from hyperspace. Unable to attack the Death Star until its shield was destroyed, the rebel fleet focused its attack on the Imperial Star Destroyers. Although its starfighters were able to maneuver easily around the Death Star, they were still vulnerable to the battle station's superlaser, which destroyed the Liberty and the Nautilian."}, {"tag": "p", "text": "On Endor, the rebel strike team ended up allying with the native Ewoks, who used their knowledge of their homeworld's forests to take the Imperial army by surprise. The strike team was finally able to destroy the shield generator after a lengthy ground battle, allowing its starfleet to attack the Empire's dreaded superweapon. The Alliance general Lando Calrissian flew the Millennium Falcon into the Death Star with Wedge Antilles, Norra Wexley, Keir Santage, Jake Farrell and another A-wing pilot. They flew through the shafts and were pursued by several TIEs, which gunned down Keir's X-wing starfighter. Lando then ordered the group to split up, and Farrell, Wexley and the other A-wing pilot flew down another shaft to lure TIEs back out. Lando and Antilles then made it to the reactor core and destroyed the battle station's power plant before retreating back out as the Death Star began to detonate. During an attack on the Executor, Green Leader Arvel Crynyd's A-wing was crippled and crashed into the bridge, killing Admiral Firmus Piett and his staff. Having already taken considerable damage from the Alliance's starfighters, the Executor failed and drifted into the Death Star's gravity well, detonating on impact."}, {"tag": "p", "text": "Meanwhile, aboard the station, a blow of an entirely different kind was struck against the Empire. A captive Luke Skywalker, now a Jedi in his own right, appealed to Vader's paternal love, convincing him to turn on his master. Vader—once again Anakin Skywalker—seized the Imperial head of state and hurled him down a shaft to his death, but at the cost of his own life. The Death Star itself soon exploded from the damages to its core. With the loss of both the Emperor and his right-hand man, Vader, the destruction of the Death Star, and significant losses inflicted on the Imperial fleet, the Imperials were forced to withdraw. The Empire had suffered a decisive defeat, leaving the Rebels to celebrate in victory."}, {"tag": "h3", "text": "Founding a New Republic"}, {"tag": "p", "text": "In the days following the Battle of Endor, news of the Emperor's death spread to several worlds across the galaxy including Tatooine, Naboo, Bespin, and Coruscant despite many attempts by the Empire to conceal the fact and declare this information to be false. While there was much celebration, a riot broke out at Coruscant's Monument Plaza. With the Empire in turmoil, the Rebel Alliance launched an assault on an Imperial outpost on the far side of Endor. This attack was led by General Solo and uncovered a lot of data and communications on Imperial plans."}, {"tag": "p", "text": "The Rebel Alliance was eventually reorganized into the New Republic. The new government, however, still had to contend with Imperial holdouts. But luckily, the Emperor's contingency plan had the Empire thrown into chaos with Operation: Cinder turning them on their loyal planets."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "One year after the destruction of the second Death Star, Republic and Imperial forces fought a major battle on the desert world of Jakku, which saw a Republic victory and the end of the Galactic Civil War. The Alliance also dispatched shock troopers to eliminate former Imperials that became warlords. The shock troopers were later assigned peacekeeping roles after the formation of the New Republic."}, {"tag": "p", "text": "The symbol of the Alliance to Restore the Republic was used in the insignia of the New Republic and later became the emblem of the Resistance, a military force founded by Rebel veteran Leia Organa and made up of several Alliance officers, such as Gial Ackbar and Caluan Ematt, to combat the First Order, the successor of the fallen Empire. During the Bail Organa statue-dedication ceremony in 28 ABY, speeches were delivered by Senators Tai-Lin Garr and Leia Organa that reminded the gathered audience of the sacrifices made by the Rebel Alliance, which were further reinforced by an air show performed by Republic X-wings."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Government"}, {"tag": "p", "text": "The Alliance to Restore the Republic was a military resistance movement, headed by the Alliance High Command and dedicated to upholding the ideals of the Old Republic. The political High Command, was separate from the Alliance Military High Command. It was led by a Chief of State and had six cabinet posts: Minister of Education, Minister of Finance, Minister of Industry, Minister of State, Minister of Supply, and Minister of War."}, {"tag": "p", "text": "The Alliance frequently changed its base of operations, ranging from numerous worlds across the galaxy in order to avoid detection or regroup from an attack by its nemesis, the massive Galactic Empire. A diplomatic corps who sought to maintain friendly relations and procure support from various worlds in the galaxy was maintained. Despite this, the Alliance had few worlds openly declare their support for the movement, as those few that did found their worlds cordoned behind Imperial blockades."}, {"tag": "h3", "text": "Military"}, {"tag": "p", "text": "Prior to the Alliance's official founding, the various rebel cells operated their own military forces. As the cells began coordinating, joint military endeavors were often overseen by cell leaders such as Jun Sato of Phoenix Group, Cham Syndulla of the Free Ryloth movement, and Ryder Azadi of the Lothal resistance. Rebel cells received information from \"Fulcrum\" intelligence operatives"}, {"tag": "p", "text": "The formal Alliance Military was served by capable military leaders such as Admiral Gial Ackbar, and received intelligence updates through its own intelligence branch known as Rebel Alliance Intelligence Service. It could also receive information through the Bothan spynet, and maintained the Alliance Fleet and Alliance Army, along with the Rebel Alliance Starfighter Corps. Rebel troopers across the galaxy fought for an end to galactic Imperial rule in units such as the Sixty-First Mobile Infantry and Thirty-Second Infantry, while the Alliance Special Forces was composed of elite commandos of the trooper ranks."}, {"tag": "p", "text": "The Alliance Military was controlled by a Commander-in-Chief  and was divided into seven sections: Rebel Fleet Command, Alliance Starfighter Command, Sector Command, Rebel Alliance Intelligence Service, Rebel Alliance Special Forces, Ordnance and Supply, and Support Services."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dave Filoni, the supervising director of Star Wars: The Clone Wars animated television series, stated that he and George Lucas intended the Onderon rebels, seen in the Onderon arc, to be the first of many militias that were created by the Jedi during the Clone Wars, militias that would be brought together by characters such as Bail Organa and Mon Mothma to become the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}