{"url": "Great_Tree_(Coruscant)", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Individual trees"], "nodes": [{"tag": "h1", "text": "Great Tree  (Coruscant)"}, {"tag": "p", "text": "The Great Tree was an ancient Force-sensitive uneti tree that once grew at the heart of the Jedi Temple on Coruscant, a massive ziggurat that acted both as a school and a monastery for the Jedi Order. After the Clone Wars, when Darth Sidious declared himself Emperor of the galaxy, the temple was converted into the Imperial Palace and the tree was removed. Fragments were kept in a secret Imperial base, from which they were later recovered by Luke Skywalker and Shara Bey. Bey and her husband, Kes Dameron, planted one of the fragments, which Skywalker gifted to them, outside their home on Yavin 4."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Great Tree was an ancient Force-sensitive tree that once grew at the heart of the Jedi Order's temple on Ossus. It was later moved to the newer Jedi Temple of Coruscant, where it was placed in a courtyard used to train Jedi younglings."}, {"tag": "p", "text": "When Darth Sidious, a malevolent Dark Lord of the Sith, took control of the Galactic Republic, he appointed himself Emperor and started exterminating the Jedi. Upon taking over the Jedi temple for himself, the Emperor turned it into the Imperial Palace, and he removed the Force-sensitive tree. Two living twigs, all that remained of the tree, were stored in a secret base installed on Vetine. These fragments were recovered by Commander Luke Skywalker, the last known Jedi Knight, and Lieutenant Shara Bey of the Alliance to Restore the Republic. Skywalker kept one of the fragments and gifted the other to Bey and her husband, Kes Dameron, who planted it outside of their new home on Yavin 4 after concluding their service to the Rebellion."}, {"tag": "p", "text": "Bey died in 10 ABY. Some time after her death, her son, Poe Dameron, who often played on the growing Force tree as a child, rigged a pair of old podracer engines to his father's koyo picker in order to pick their koyo grove. The exhaust from the engines singed the tree, so Kes made his son spend the next year nursing the tree to health."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ancient tree in the Jedi Temple was first seen in \"The Wrong Jedi,\" a fifth season episode of the animated television series Star Wars: The Clone Wars. Concept art for the tree, including the surrounding training ground, was done by Andre Kirk in 2011. Greg Rucka, author of the comic book mini-series Star Wars: Shattered Empire, chose to use the tree in the comic's fourth issue because he wanted Luke Skywalker to pursue a Jedi object that wasn't \"just another holocron.\" Rucka, who received the idea from Pablo Hidalgo and the Lucasfilm Story Group, felt the tree was a strong metaphor for rebuilding the galaxy after the events of Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}