{"url": "Great_Temple_(Korriban)", "categories": ["Category:Legends articles", "Category:Korriban tombs", "Category:Sith temples"], "nodes": [{"tag": "h1", "text": "Great Temple  (Korriban)"}, {"tag": "p", "text": "The Great Temple was a mausoleum as well as a place of reverence located in Korriban's Valley of the Dark Lords, where the remains of many of the most honored Dark Lords of the Sith were interred."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A massive structure built of stone by the Sith, the Great Temple was one of the most prominent structures within the Valley of the Dark Lords on Korriban, and situated at the very rear of the valley itself. Towering over other structures, the mausoleum held the bodies of many deceased Sith Lords, all of which remained untouched by time, preserved by their own power in the dark side of the Force. Tuk'ata hounds prowled the interior of the temple, and served as guardians against tomb-raiders and grave-robbers."}, {"tag": "p", "text": "In 3996 BBY, Jedi Knight Exar Kun was guided to Korriban and into the Great Temple by the spirit of Freedon Nadd. After several tests, Nadd tricked Kun into finally embracing the Force's dark side after the destruction of the Great crystal brought a deadly avalanche of stone down on Kun's head. The Temple would be forgotten for millennia after Kun's visit and, while the Sith Empire would occasionally hold the planet, its Sith Academy was erected in front of the Temple complex as the above-ground portions of the Great Temple became largely uninhabitable and continued to collapse."}, {"tag": "p", "text": "In 23 BBY, a team of Jedi Knights and their Padawans, headed by Obi-Wan Kenobi, entered the Great Temple while on a mission to track down the galactic criminals Granta Omega and Jenna Zan Arbor. Upon entering the ancient ruins, Kenobi felt a distinct Sith presence—the dark shape of a Sith Lord. Though he did not realize it at the time, this later proved to have been Darth Tyranus, the Sith alter-ego of former Jedi Master Dooku, who was there on Korriban to rendezvous with Omega and Zan Arbor. The two criminals were seeking to strike an alliance of power with the galaxy's re-emergent Sith. Anakin Skywalker had fleetingly glimpsed the tall, black-hooded figure of the Sith Lord from behind. Kenobi shuddered at the thought of the thousands, who had come for knowledge and training, who had been trapped within the Sith Temple by their own desires: he seemed to feel each wasted life, each terrible death. So thick and foreboding was the dark side of the Force within the Temple, that it seemed to invade Kenobi's lungs, and he found it difficult to breathe. For 18-year-old Anakin, the surging feeling of the dark side seemed to rise up from the soles of his feet and blast through the crown of his head: its undeniable power was stomach-turning, nerve-splitting—nauseating."}, {"tag": "p", "text": "The Temple would once more be explored by Darth Sidious, a member of the Order of the Sith Lords during the final decades of the Galactic Republic and well into the reign of the Galactic Empire. Sidious saw to the preparation of a tomb for his apprentice Darth Vader within the Temple; Vader would never occupy it as he died embracing his Jedi heritage on the forest moon of Endor. In 11 ABY, the resurrected Darth Sidious visited the Great Temple seeking counsel from the spirits of his Sith predecessors. While some doubted his success and offered him Vader's tomb, other spirits gave Sidious counsel and bid him farewell a final time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Great Temple with its Sith Academy on Korriban is referenced in the final volume of Jude Watson's Jedi Quest series simply as the \"ancient Sith monastery\"—thousands of years old, deserted for hundreds of years, but still a presence of evil. Once a bastion of Sith lore and learning where thousands had once trained \"and thousands of hopefuls had once disappeared forever,\" the Temple was, at once, repulsive and alluring to the Jedi. The original inhabitants of Korriban who had built (and, in later years, re-built) the Sith complex had, of course, long since vanished and nothing thrived there: but if the ancient stones could speak, \"they would talk of blood and terror.\" For though the Temple had had the same goals as did the Jedi Temple—study and learning—this place had been ruled by fear. The high walls that narrowed in harsh lines and pyramidal angles near the top were designed to create a feeling of entrapment; slightly askew, they were meant to intimidate and keep beings off-balance. With no openings to light or air, there were only the massive columns, bleak towering walls, and hard floors of cold gray stone."}, {"tag": "p", "text": "Watson describes the massive Temple structures as having giant exterior walls comprised of great stones that, by 23 BBY, had \"shifted\" over the years, with sundry large slabs propped up against one another, and others that had toppled and crumbled into boulders; within, vast echoing chambers that rivaled the Jedi Temple's Great Hall were shrouded in darkness. An oppressive dread emanated from the ancient cracks and hollows; the walls wept with moisture. Ancient voices could be heard, and spectral images of torture and pain passed, then vanished, like phantoms in the night. In Watson's description, huge statues of terrifying beasts from many worlds marched on either sides of its great corridors. Vestiges of the Sith's greed-torn Order were strewn across a vast, ancient hangar where aggression and technology met—remains of huge hulking ships were witnesses to the Order's own perceived invincibility that, ultimately, was brought down in disaster by vengeance, lust and pride."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}