{"url": "Great_Tree_(Kashyyyk)", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Individual trees", "Category:Kashyyyk locations"], "nodes": [{"tag": "h1", "text": "Great Tree  (Kashyyyk)"}, {"tag": "p", "text": "The Great Tree, also known as the Spirit of Nyenthi'Oris, was located in the Mysess Glade, a sub-region of the Kkowir Forest. The tree was sacred to the Wookiees on Kashyyyk, and was tended to by the people of the Kerritamba Village."}, {"tag": "p", "text": "The tree stood on a small but steep hill on a small isle in the Chenataa river. On a second hill next to the tree there was the Nyenthi'Oris Graveyard, a sacred Wookiee burial ground."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A long time prior to 1.5 ABY, the Wookiees living in the Kkowir Forest region were attacked by large numbers of wild Varactyls. The Wookiees retreated to the vantage point of the Great Tree, from where they were able to fend off the advances of the creatures. In the end, the Wookiees were able to drive the Varactyls out of the Kkowir Forest."}, {"tag": "p", "text": "Sometime during the Galactic Civil War, the tree fell ill. The Wookiees of the Kerritamba Village originally suspected that the Myyydril tribe was responsible for the decay of the Kkowir Forest and the Great Tree that stood within. After being welcomed to the Kerritamba Village, Chief Hosdra of the Myyydril tribe betrayed them, and assassinated the great grandfather of Chief Kerritamba. Even though the rest of the Myyydril did not help Hosdra, the Kerritamba Village banished the tribe to ensure their own safety. After their banishment, mystics in the Myyydril tribe revealed that they had placed a curse on the forest, causing its plants to whither away and die."}, {"tag": "p", "text": "However, Chief Kerritamba was not convinced that the curse was real, and that the Myyydril were directly responsible for destroying the forest and its Great Tree. With the help of a brave individual, Chief Kerritamba was able to determine that the tree was poisoned by small streams of water coming from the Myyydril Caverns. After their banishment, the Myyydril moved into the caverns. The heightened activity in the caverns then caused chemical reactions to set forth a spiral of rot and decay that spread out into the surrounding forest. Kerritamba asked the individual for help in obtaining the ingredients for a cure: an Osera seed, a Ranrt crystal, a Mysess blossom, and webweaver silk. Fortunately, the individual managed to collect the ingredients. Kerritamba then prepared an elixir that could cure the tree. The spacer used the elixir, restoring the Great Tree. Hailed as a hero, Chief Kerritamba thanked the spacer, and pledged that he and his tribe would focus on restoring vitality to the rest of the forest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Great Tree of Kashyyyk appeared in the Rage of the Wookiees expansion to the MMORPG Star Wars Galaxies. Players who performed a series of quests for Chief Kerritamba in the Kerritamba Village had to gather ingredients for an elixir to cure the tree. Although the player could choose not to do Chief Kerritamba's quests, this article assumes 100% game completion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": "Star Wars Galaxies: Rage of the Wookiees (First appearance)"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}