{"url": "Allied_Command", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic"], "nodes": [{"tag": "h1", "text": "Allied Command"}, {"tag": "p", "text": "An Allied Command was the term used to refer to the local planetary and sector governments that allied with the Alliance to Restore the Republic during the Galactic Civil War. Each Allied Command copied the governmental structure laid down by the Alliance Civil Government, and was answerable to the Civil Government on important matters. However, each Allied Command had a degree of freedom and autonomy in prosecuting the war in their sphere of influence."}, {"tag": "p", "text": "Each Allied Command was headed by the Chief Executive, and supported by the Allied Cabinet made up of the Secretary of the Allied Cabinet, and the Secretaries of Education, Finance, Industry, State, Supply, and War. However, while each Allied Command's structure was similar to the Civil Government, the functioning of the Command varied. This was due to a number of political and sociological factors. Some Allied Commands had working governments in place long before joining the Alliance, while some alien species' political structures and mindsets were radically different, meaning that they could not work within the rigid command structure as defined by the Alliance. Existing command structures were retained as much as possible."}, {"tag": "p", "text": "Filling the positions of the Allied Command was left to the Commands themselves, and populating the positions varied greatly. In some Commands, the Chief Executive was the ruler of a planet, and the Cabinet members of the ruler's family. Some were elected by the citizenry of the planet, or appointed to the positions. In one unique case, the positions were chosen by lottery. In some cases, the Chief Executive could be a group rather than an individual, such as a hive intelligence or board of directors. Seats on the Cabinet could be controlled by many beings at once, or one being could be responsible for multiple positions. The Alliance did not care how the executive worked, as long as it worked. If a Minister of the Alliance Cabinet could call their counterpart Secretary on any given Allied Cabinet and get a correct, fast answer to their query, then they did not care if the Secretary was male, female, alien, droid, group, sub-committee, board, or hive."}, {"tag": "h2", "text": "Sources"}]}