{"url": "Greater_Seswenna_raids", "categories": ["Category:Canon articles", "Category:Battle stubs", "Category:Battles in the Outer Rim", "Category:Events during the Republic Era"], "nodes": [{"tag": "h1", "text": "Greater Seswenna raids"}, {"tag": "p", "text": "The Greater Seswenna raids were a large number of attacks in Greater Seswenna on ore convoys owned by Eriadu Mining and Shipping in 46 BBY during the Republic Era. The attacks were done by Q'anah's Marauders led by the Pirate Queen Q'anah and the convoys of unpiloted container ships typically carried lommite. The Outland Regions Security Force could not defend all the convoys, defending mainly the valuable shipments and their warships were constantly being monitored by the pirates so that Q'anah's flotilla could perform raids on certain convoys at the right time. The stolen ores were either sold or given to other companies hiring the pirates. Eriadu Mining attempted the use of dummy containers or hidden explosive and armed parties but none of them worked and were too expensive for the company to carry on using. Eriadu Mining also tried predicting attacks but the analysts soon realised that Q'anah was choosing convoys at random."}, {"tag": "p", "text": "In the Outland's anti-pirate taskforce, Wilhuff Tarkin analysed the raids done by Q'anah and became convinced that there was a pattern. He did eventually find a pattern in how the convoys were attacked. Wilhuff convinced Outlands Security and Eriadu Mining to test his theory but his paternal cousin Ranulph Tarkin had an alternative idea by secreting a virus into the containers hyperdrive motivators. Ranulph had created this years earlier but Eriadu Mining turned the idea down saying it was too expensive. But with a lead on the specific containers Q'anah targeted Eriadu Mining went with it. The attacks however increased in the process putting Eriadu Mining on the brink of financial ruin. But despite the rising tensions, Ranulph's plan worked and the virus got into the main computers of the pirate ships and overrid their navigation computer sending them to the location of a waiting Outland Security fleet. Q'anah and her crew were boarded and captured and were executed by being put in a transport programmed to fly into a nearby sun. With the threat gone, Eriadu Mining was saved and could finally prosper within the future."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}