{"url": "Greater_Tion", "categories": ["Category:Legends articles", "Category:Outer Rim Territories regions", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Greater Tion"}, {"tag": "p", "text": "The Greater Tion was a region of the Outer Rim Territories that surrounded the Tion Cluster and exhibited Tionese influence. This historical designation was used after the area was unified by Xim the Despot circa 25,000 BBY and during the next millennium until this isolated region of the galaxy joined the Old Republic."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Following the region's annexation in 23,900 BBY by the Galactic Republic, the Greater Tion was divided into a number of sectors. The Tion Cluster itself eventually became organized into the Tion Hegemony and the Kingdom of Cron by the time of the Clone Wars, and became a hotbed of Separatism. In retaliation, the Galactic Empire split the Hegemony into the Allied Tion sector and the Tion Hegemony, while renaming the Kingdom of Cron the Cronese Mandate. The Cronese were typically more outward-looking than the rest of the Cluster, and the Allied Tion, though it lacked a historical identity, became known for its manufacturing and trade. The rump of the Tion Hegemony, however, became divided into two very different regions: the mildly-wealthy Livien Worlds at the head of the Desevran Trace near the Perlemian Trade Route, and the poor, culturally-different worlds beyond the Indrexu Spiral along the Tion Trade Route, known as the Back Spiral."}, {"tag": "p", "text": "The Empire reorganized the regions surrounding the Cluster as well, carving the Indrexu sector out of the Hegemony's territory beyond Kanaver. The worlds of the Far Perlemian were of little interest to the Republic during its final years, and slavers, pirates and Separatists often had free reign there. The Indrexu sector — a name that recalled the Indrexu Confederation, a successor state of Xim's empire millennia before — was carved out of the Hegemony in an effort to keep the restive Indrexu worlds from making common cause with their Livien neighbors."}, {"tag": "p", "text": "The Keldrath sector was another attempt by the Empire to create a buffer zone, in this case between the Pakuuni sector and the Tion. The effort was ill-researched and backfired — that part of the Tion Hegemony had always gravitated to Pakuuni, and the new sector immediately fell under its neighbor's sway."}, {"tag": "p", "text": "The Thanium Worlds were conquered by the Tionese during Xim's Expansionist Period and formed the industrial engine of his empire, once stretching to the edges of the Radama Void and including worlds later known as part of the Sith Empire and the Gordian Reach. The northern, rimward portions of the Thanium Worlds were known in Xim's time as the Far Indrexu. Despite the name, the passage of millennia meant that the Thanium Worlds bore little resemblance to what they had been in Xim's time."}, {"tag": "h2", "text": "Sources"}]}