{"url": "Grecker", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Grecker"}, {"tag": "p", "text": "Grecker was a male human member of the Closed that resided on the planet Carnelion IV approximately three years following the Invasion of Naboo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Grecker was a member of the Closed who was participating in a battle on the planet Carnelion IV when Obi-Wan Kenobi and his padawan Anakin Skywalker crash-landed on the planet. While the two Jedi were talking to Pran and Kolara, he attacked the group with his airgun. While the rest took cover, Kenobi destroyed Grecker's ship with a saber throw. As his ship plunged to the ground, he leapt from the wreckage and was saved by Skywalker. Pran and Grecker drew their weapons and faced off, but they were disarmed by Skywalker, who sliced their guns in half. They drew knives and charged at each other, but were stopped by Kenobi. When questioned, he accused the Open of starting the war, while Pran stated it was the Closed who destroyed the planet. Kenobi started to leave, but Greecker pointed out that he and the others would die if left on the mountain. The Jedi agreed to get them to safety."}, {"tag": "p", "text": "As the group descended to the surface, Skywalker suggested salvaging parts from wrecked Open and Closed airships to build a working vehicle, but Greecker didn't think it would work. However, once overhearing the padawan mention a distress signal that was being broadcast off-planet, Greecker and Pran both changed their minds and agreed to work together."}, {"tag": "p", "text": "As the group made their way towards the distress signal, they came across a box attached to a kite. Grecker snatched it out of the air and tossed it to the surface of the planet. He returned to the pilot seat and talked to Kenobi about his relationship with Skywalker. Their airship was attacked by Fishers. Grecker joined Kenobi in attempting to repeal the Fisher's attack. He was fighting the swarming Fishers when Mother Pran, who had escaped the airship on a flyer, blew up the airship."}, {"tag": "p", "text": "Grecker escaped the crippled airship with Kenobi. They were confronted by a group of Fishers on the surface of Carnelion IV, but Kenobi was able to intimidate them and scare them off. Grecker retrieved a pair of breath masks from the wreckage and accompanied Kenobi across the Celadon Sea towards the source of the distress signal. When they arrived at the source of the signal, the two were attacked by several Carnelian dragons. Grecker fired off a flare to call for help. As Kenobi faced off against the creatures, Sera opened a door to her building and bid Grecker to get inside to safety. Once he was in, he tried to make her close the door and leave the Jedi outside, but Sera shot him in the chest with a blaster."}, {"tag": "p", "text": "When the Closed forces arrive, drawn by Grecker's flare, they were confronted by Kenobi. Grecker, wounded but alive, told his clan-mates to kill Kenobi. However, they were interrupted by the Open who had operational mechs. Kenobi tried to convince Grecker to cease hostilities but was attacked by Mother Pran in a mech who killed Grecker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}