{"url": "Gree/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Gree Enclave planets", "Category:Terrestrial planets", "Category:Type II atmosphere planets"], "nodes": [{"tag": "h1", "text": "Gree"}, {"tag": "p", "text": "Gree was a planet located within the Gree Enclave, a small region in the Veragi sector of the Outer Rim Territories. It was the homeworld of the Gree species, a race of six-tentacled cephalopods who, despite having an advanced form of technology, allowed their society to fall into ruin when they began prizing an individual's mastery of their advanced devices over improving them or creating new ones. As the Operator caste became more powerful within Gree society, they guarded the secrets of operating and manipulating their devices, sometimes dying before they could pass the knowledge on to their apprentices."}, {"tag": "p", "text": "Gree served as the capital of the Enclave and was considered to be the cultural center of Gree society, revered by all members of the species as a sacred place. By the time of the Galactic Empire, Gree had fallen into ruin following the near-collapse of Gree society. Only one major city remained, and the rest of the planet was a virtual wasteland covered in barren plains and abandoned ruins. Little was known of the planet to other species; the Gree restricted visitors to the world, with individuals only being permitted onto the world at the behest of the planetary grand council."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The homeworld of the Gree species—an ancient race of six-tentacled cephalopods—Gree was located within the star system of the same name, which lay deep in the Gree Enclave, a small region of space in the Veragi sector of the Outer Rim Territories. The planet was accessible by hyperlane routes from the worlds of Malanose and Lonatro, and was the only world within the Enclave that had a direct route to Licha In. The distance between Gree and these worlds could be traversed by the Rokak'k Baran—a large Gree-designed transport starship with a Class 3 hyperdrive—in two days. Gree had a Type II atmosphere, which meant that life could be sustained on the planet, but due to environmental factors—such as higher or lower atmospheric pressure, ratio of oxygen to other gases, or contaminants in the air—it was suggested that breath masks were worn by species that had evolved in a Type I atmosphere to counter any negative effects they might suffer. It was, however, comfortable for the native Gree. A standard day on the planet was twenty-seven hours long, and a year lasted 360 local days."}, {"tag": "p", "text": "Following the near-collapse of Gree society, the planet was a barren and harsh world by the time of the rise of the Galactic Empire; the surface was predominately wasteland, and covered in the ruins of abandoned cities. Only one city remained habitable, and it was home to 60 million Gree during the years of the Galactic Civil War. The planet was ruled by a grand council, and was also the location of the grandmaster council, the political body that all planetary grand councils answered to."}, {"tag": "p", "text": "Gree was also the destination point of at least two hypergates—devices capable of instantaneous transport of people and objects between two points—based on Asation. Although non-functional by the time of the Galactic Civil War, travel between the two worlds had been common before the decline of Gree civilization."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Gree society reached its apex more than 30,000 years before the Galactic Civil War. The planet Gree was held in high regard by the Gree, who—regardless of whether or not they had visited the planet—considered it a sacred and revered place. As the home planet of their civilization, it was at the center of Gree culture. Non-Gree visitors to the planet were extremely rare, and had to be specially invited by the planet's grand council. This usually occurred when conducting large-scale business with off-worlders on Asation—the gateway world to the Gree Enclave—was undesirable or unacceptable to the Gree themselves. Some time before 3643 BBY, the Gree Enclave was discovered by a scout, Captain Marrix, leading to first contact between the Gree and the Galactic Republic. Marrix was respected by the Gree, and was allowed to visit their homeworld on a single occasion."}, {"tag": "p", "text": "By the time of the Galactic Civil War, the history of Gree, and its native species, was a mystery, even to the Gree themselves. Scholars believed that the Gree species evolved on Gree thousands of years before the Galactic Civil War, and their civilization had slid into ruin before the formation of the Galactic Republic. It was rumored that the predecessor to Imperial Consul-General Skalus was permitted to visit the planet when he negotiated the annexation of Asation into the Empire. Those visitors who were permitted onto the planet conducted scholarly, diplomatic, or trade negotiations."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The planet was inhabited by the Gree, and was the species' homeworld. Non-Gree were not allowed to immigrate to the planet, and off-world visitors were a rarity. The Gree were one of the oldest races that evolved in the galaxy, mastering hyperspace flight before many species had even entered their industrial ages. During this time, they developed a unique form of technology based around the process of material synthesis. Devices constructed by the Gree were individually unique, and emitted musical notes as they were activated—in effect, requiring the operator to \"play\" the device. Each device was attuned to Gree physiology, requiring the use of six tentacles to operate properly. The technology became the cornerstone of Gree society, and was employed throughout the Enclave."}, {"tag": "p", "text": "Originally, the Gree employed a caste system consisting of four professions: the Crafters who produced new devices; the Researchers who designed new devices; the Operators who manipulated and used the devices; and the Administrators who acted as the Gree government. Over time, however, the Gree began focusing on the artistry of actually operating the devices rather than attempting to improve them, or create new ones. As the Gree decided that their technology had reached its apex, the Crafter and Researcher castes, no longer deemed necessary to society, died out. The Operators became more influential in Gree society, with more and more power ceded to them by the Administrators. As masters—those Gree capable of activating and maintaining the Gree devices—died without passing on their expertise, the knowledge to operate many devices was lost. Without the Crafter and Researcher castes, the Gree gradually lost the ability to create and repair their technology as devices failed. By the time of the Galactic Empire, the Gree civilization was a shadow of its former self; although they had access to advanced technological devices, they had no idea how to improve upon them or repair them. Maintenance of the existing devices were of paramount importance to the Gree, and masters from the Operator caste dominated Gree culture and society due to their ability to operate the remaining devices."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Gree capital was the only inhabited city on the planet during the time of the Empire. Situated on a large plain, the city was a sprawling affair, made up mainly of halls and skyscrapers. Although home to 60 million Gree, much of the city was abandoned, and it had no starport of any kind. Incoming ships were required to land on a flat slab in the center of the city. Advanced Gree technology was common in the city; in some cases surpassing the technological level that was standard on Imperial worlds at the time. However, anachronistic technology that was well under the Imperial standard was also in evidence."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Gree was first introduced in The Gree Enclave, an article published in West End Games' Star Wars Adventure Journal 8, in November 1995. It was written by Timothy O'Brien. The information was subsequently reprinted in Classic Adventures: Volume Four - The Best of the Journal, released in 1997, and mention was made of the planet in the Gree entry in Alien Encounters."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}