{"url": "Greeata_Jendowanian/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Max Rebo Band members", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Greeata Jendowanian"}, {"tag": "p", "text": "Greeata Jendowanian was a female Rodian vocalist, musician and dancer for the Max Rebo Band."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on the Rodian homeworld of Rodia, Greeata was considered an outcast by the violent Rodian society for her love of music and dance. The name “Greeata” was a common name for female Rodians meaning “talented.” Rather than focus on hunting, Greeata absorbed any information she could find on the music and dance of many intergalactic cultures. Having rejected the values of Rodian culture, Greeata left her homeworld to perform as a Kloo horn player aboard the intergalactic cruiseliner Kuari Princess. In 19 BBY, she visited Coruscant and was present at the Squid Lake performance at the Galaxies Opera House."}, {"tag": "p", "text": "Greeata developed a friendship with Sy Snootles, lead singer for Kuari Princess's house band. After forcefully rejecting the sexual advances of a male Rodian, Greeata and Sy left the house band to perform as a duo. Evar Orbus discovered the pair performing in the Green Planet nightclub on Tothis. Mesmerized by Snootles' voice, Orbus asked her to audition for his band. While excited, Snootles said that she would only join if Orbus offered Greeata a spot. After learning that Greeata could sing, dance, and play the Kloo horn, Evar signed her on as a dancer on a per diem rate."}, {"tag": "p", "text": "After fifteen years of dancing with Lyn Me and Rystáll Sant, Greeata was first accepted as a full member when Max Rebo founded his own band. During her tenure in Jabba the Hutt's palace, the Rodian wore bracelets that suppressed her pheromones. In 4 ABY, when fellow dancer Oola was fed to the rancor, Greeata was horrified and covered her face with her hands, unable to look. However, it was not long after Greeata began singing with the Max Rebo Band that Jabba was killed and his sail barge destroyed. In the chaos that followed, Greeata's Rodian survival instincts saved the band from a pack of Tusken Raiders."}, {"tag": "p", "text": "Greeata and Rystáll later joined The Palpatones, where they were reunited with Joh Yowza. Greeata attained popularity as the band's lead singer. Notably, she gained fame with her hit song \"Kick the Ranat.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Greeata first appeared in the extended musical number in the Special Edition of Return of the Jedi, where she was played by Celia Fushille-Burke."}, {"tag": "p", "text": "Greeata appears in the directory-tree files for the 2003 massively multiplayer online role-playing game Star Wars Galaxies: An Empire Divided. She never actually appeared on the video game's live servers as a proper non-player character, but on at least one occasion, the events manager for Star Wars Galaxies known as Jason \"Pex\" Ryan did play as Greeata at a special player-made event. However, these player events are considered non-canon within the Legends continuity, so Greeata's appearance in Galaxies remains ambiguous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}