{"url": "Alluuvia", "categories": ["Category:Legends articles", "Category:Elrood sector planets", "Category:Rocky planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Alluuvia"}, {"tag": "p", "text": "Alluuvia was a planet that was located in the Elrood sector. The mining on the planet conducted by Radell Mining Corporation was overseen by an ecologically-mindful Ithorian."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "A scenic ocean world from orbit, the depths of the Alluuvian oceans were discovered to hold a valuable secret. Deep under the waters were dense pockets of metals and minerals of unknown worth. While the minerals made the waters toxic to off-worlders, they were discovered to be worth a great amount of credits."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the planet was scouted out shortly after the Battle of Yavin by an exploration team funded by Radell Mining Corporation, claims on the world were disputed by the pirate gang known as the Scourge. Dispatching the Gray Griffins to follow up on exploration activities, the Radell employees were captured by the Scourge and held for ransom on the planet. Appealing to the Alliance to Restore the Republic for help, the Rebel agents were dispatched an rescued the Gray Griffins."}, {"tag": "p", "text": "When further studies by the Radell Mining Corporation revealed that Alluuvia was also the homeworld of the Anguilla, the Corporation began putting together a diplomatic team to meet with the natives. However, the Galactic Empire's Imperial Mining, Ltd. had discovered the worth of the world and sent a fleet of Star Destroyers to invade the world, establishing a mining outpost on the planet. The native Anguilla were led by Anyar when they opposed the Imperial occupation. With the aid of Alliance operatives, the Anguilla were able to drive the Imperials from the world. Meeting with representatives with the Radell Mining Corporation, Anyar agreed to allow mining operations to commence, with the Ithorian Iych-thae ensuring that environmental ramifications would be limited."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}