{"url": "Grenadier_Droid", "categories": ["Category:Legends articles", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "Grenadier Droid"}, {"tag": "p", "text": "The grenadier droid was a model of battle droid in the Separatist Droid Army that served as an effective short-range artillery platform for the Confederacy of Independent Systems during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Grenadier droids were designed with a small, cylindrical profile and were equipped with four, crab-like legs not unlike those of a droideka. Armed with dual grenade launchers, they were capable of launching a steady barrage of bombs at enemy personnel. They sacrificed firepower for mobility, however, as they lacked the ability to coordinate movement with attack; they could not deploy their weapons without rendering themselves completely immobile. As such, they were relegated to support roles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During his Mission to Mustafar to massacre the Separatist Council, Darth Vader encountered grenadier droids flanking an Armored Assault Tank in the Klegger Corp Mining Facility."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The grenadier droid was created in the early stages of development for the video game adaptation of Star Wars: Episode III Revenge of the Sith. Though it ultimately did not to make the PlayStation 2 version of the game, it was nevertheless present in the Nintendo DS and the Game Boy Advance versions, on the level \"Mustafar Hangar,\" where it serves as support fire for a boss fight against an Armored Assault Tank alongside a B1-Series battle droid armed with an ion rifle. The grenadier droid is essential for passing the level, as the only way to defeat the AAT is by Force pushing the grenades towards the AAT's laser cannons. Consequently, the droid will respawn an indefinite amount of times when destroyed until the AAT's cannons are disabled."}, {"tag": "p", "text": "Though cut from the PlayStation 2 version, concept art of the grenadier droid can be viewed once unlocked."}, {"tag": "p", "text": "As the scenario of Darth Vader fighting his way through the mining facility to the Separatist war room seems to contradict the film and the novelization, this article assumes that while Darth Vader came across grenadier droids in the facility, a conflict did not necessarily take place as he ventured towards the control room."}, {"tag": "h2", "text": "Appearances"}]}