{"url": "Greti", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Females", "Category:Force-sensitives", "Category:Humans", "Category:Lanteebans"], "nodes": [{"tag": "h1", "text": "Greti"}, {"tag": "p", "text": "Greti was a young Lanteeban girl living in the mining town of Torbel during the Clone Wars. A Force-sensitive, she was the daughter of Teeba Bohle.\nAs she had an innate talent for Force healing, she helped Obi-Wan Kenobi heal injured and sick villagers during the siege of Torbel. She asked if she could go to Coruscant with him for Jedi training, but Kenobi, knowing she was too old, sadly refused. After the siege, she went with the rest of her village to live on Naboo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the war, Greti was an only child who lived with her mother Bohle and 300 residents in the village of Torbel on Lanteeb. When the planet was occupied by the Separatists, General Lok Durd ordered the inhabitants to deliver everything in their mine to him. During that day, her mother and several miners caught a terrible illness which they contained from the Damotite. Greti was very worried when she came to visit them in the hospital camp. This was when she made her first encounter with Obi-Wan Kenobi and Anakin Skywalker, who were disguised as villagers in order to put an end to the Separatist occupation. As Obi-Wan met her, he was amazed how Greti had a talent for Force healing, in which Greti developed a close friendship with him."}, {"tag": "p", "text": "The next day, a theta storm moved over Torbel and damaged one of the shields, causing the village to fall into greater danger until Anakin powered the shield with his technical skills and saved the village. However, there were many casualties, including Arrad, who were suffering a terrible illness. Since the Jedi's cover had been blown, Kenobi asked Greti and Sufi to help him treat the victims. Greti didn't know what to do, but Kenobi taught her how to control her emotions and managed to heal several villagers, including her mother, while the rest had already died from the illness. In the following days, Greti learned to meditate through the Force since she had trouble sleeping."}, {"tag": "p", "text": "When Lok Durd learned that the Jedi were hiding in the village, he sent his army to eliminate them. However, Anakin and Obi-Wan planned to deliver themselves to the Separatists in order to protect the villagers. As Greti learned of this, she convinced them to stay and provide refuge. During the siege, a Republic fleet managed to get through the planet and aid the villagers in fighting the Separatists. When Taria Damsin arrived to the village to warn Kenobi and Skywalker, she was severely injured after destroying Durd's laboratory at Lantibba City. Greti was able to heal the young Jedi Master in time before the droid army approached the village. She was able to survive the attack, but Torbel was completely burnt down. On the same day, Greti and the surviving villagers were offered refuge by Queen Jamillia of Naboo. Before leaving, Greti asked if she could go to Coruscant to become a Jedi, but Kenobi, knowing she was too old, sadly refused. She understood what he meant and said her goodbye as she departs for Naboo."}, {"tag": "h2", "text": "Appearances"}]}