{"url": "Gretz_Droom", "categories": ["Category:Canon articles", "Category:Heliost Clan", "Category:Individuals of unspecified species", "Category:Jedi High Council members", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gretz Droom"}, {"tag": "p", "text": "Gretz Droom was a male Jedi Master who sat on the Jedi High Council during the Republic Era. As an initiate, Droom was chosen from Heliost Clan to be the Padawan of Master Jor Aerith. He was later elevated to the rank of Jedi Knight, and eventually to Jedi Master, serving on the Jedi Council."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born in 84 BBY, Gretz Droom was identified as Force-sensitive as a child, and brought to the Jedi Temple on the planet Coruscant to be trained as an initiate in the Jedi Order. He became a member of the Heliost Clan, alongside a number of other initiates, including Qui-Gon Jinn and Ky Narec."}, {"tag": "p", "text": "During a Jedi mission to the planet Asusto in 82 BBY, the Padawan Dooku was given numerous visions after being subjected to torture by the Presagers of Hakotei. In the vision, Droom, as a Jedi Master on the Jedi High Council, declaring that the Galactic Senate had become corrupted and the Jedi needed to take control. Dooku saw Droom kill Supreme Chancellor Palpatine, announcing that the rule of the Jedi had begun. When the vision ceased, Jedi Master Lene Kostana assured Dooku that he visions he had seen were not certainties."}, {"tag": "h3", "text": "Jedi training"}, {"tag": "p", "text": "In 68 BBY, at the age of sixteen, Droom, along with the rest of his clan, were selected to undergo their Initiate Trials. Droom spoke with Narec while they and Jinn watched fellow initiates Ima-Gun Di and Yeeda duel. Droom himself was later picked, chosen to duel Narec, who was dismayed upon hearing his opponent. Both Padawans hoped to be chosen as a Padawan by Dooku, now a Jedi Master, and Droom was confident he could succeed."}, {"tag": "p", "text": "Ultimately, Dooku chose neither, and instead picked Jinn, while Droom was chosen by Master Jor Aerith. When Dooku ordered Jinn to meet him for training almost immediately, Droom taunted Jinn for his Master's strict instruction. Aerith overheard Droom, and ordered him to meet for training in the Hall of Endurance in an even shorter amount of time. Droom began to question the deadline, but stopped himself, and rushed away to avoid being late."}, {"tag": "h3", "text": "Dragonfire Air Rally"}, {"tag": "p", "text": "Droom was eventually elevated to the rank of Jedi Knight. When Aerith was invited to represent the Jedi at the forty-eighth annual Dragonfire Air Rally airspeeder race by the ambassador for Candovant, a meeting was called by the Jedi Council. Aerith asked Droom, Dooku, and Jinn to accompany her, particularly wanting Dooku to join them due to his affinity for interacting with politicians. Master Yula Braylon questioned why the Jedi needed to be displayed at the race, and Droom reminded her of the Candovants' power in galactic politics."}, {"tag": "p", "text": "After arriving at the hospitality platform set up for watching the race, the Candovant ambassador invited the Jedi to join him in his personal hoverpod. Unlike Dooku  and Jinn, Droom looked forward to watch the race, excited at the thought of what a Jedi could do at the controls of a racing airspeeder. Accompanying the ambassador in his hoverpod, the Jedi watched the race. During the race, the Serennian Ramil, who, unknown to Droom and Aerith, was the brother of Dooku, crashed, having been sabotaged by the crime lord Cenevax so that her underground gambling ring could earn profits from those who bet on his victory. Dooku and Jinn rushed to the crash site, leaving Droom, Aerith, and the Candovant ambassador confused."}, {"tag": "p", "text": "While Dooku and Jinn embarked on an investigation behind the crash, Droom attempted to contact them via comlink. Jinn answered it whilst he and Dooku piloted a swoop through The Works, chasing a crew of Trandoshans who had confiscated Ramil's wrecked airspeeder to hide the evidence of the sabotage. Droom asked what Jinn and his Master were doing, and was confused upon hearing blaster fire through the comm. Reprimanding the two Jedi for their interference, Droom requested that they return to the Jedi Temple. Jinn deactivated his comlink, claiming it was interference from the nearby foundries."}, {"tag": "h3", "text": "On the Council"}, {"tag": "p", "text": "In the following years, Droom was granted the rank of Jedi Master, and eventually gained a seat on the Jedi High Council. In 42 BBY, Dooku received a transmission from his sister Jenza, requesting that he provide assistance in fighting an invasion of their homeworld, Serenno. Dooku, along with the House Serenno family protocol droid D-4, met with the Jedi Council, asking that the Jedi help the inhabitants of Serenno. However, as the Galactic Senate had ruled that the invasion was out of their jurisdiction due to Serenno's claimed independence, the Council was unable to assist."}, {"tag": "p", "text": "Droom apologized to Dooku, who protested against the Council's ruling, believing it was the Jedi's duty to help. However, both Droom and Aerith brought up a speech that Dooku had previously given to the Galactic Senate, in which he stated that the Jedi could not police the Outer Rim Territories. Despite Dooku's continued disagreement, Droom affirmed that the Council's decision was final."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Jedi initiate, Gretz Droom was arrogant, believing he would be chosen to become a Padawan, and teasing his fellow initiates, particularly Ky Narec. However, Droom had matured by the time that he had been granted the rank of Jedi Knight, though he did not refrain from joking about the attitude of his Master, Jor Aerith. When Dooku and Qui-Gon Jinn disregarded orders to investigate the sabotage of Ramil in the Dragonfire Air Rally, Droom scolded them, informing the two Jedi that the Jedi Council would not take kindly to their actions."}, {"tag": "p", "text": "By the time that Droom sat on the Jedi Council himself, he strictly adhered to the Council's beliefs, and wished to abide by the rulings of the Republic Senate. When Dooku requested help for his homeworld, Droom believed that the Jedi should not get involved, and that the people of Serenno could not receive support after withdrawing from the Republic."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Like all Jedi, Gretz Droom was sensitive to the Force. As an initiate, Droom believed his skills in lightsaber dueling were above that of his peers. Droom continued to advance his abilities, becoming a Jedi Knight and eventually a Jedi Master. Droom had piloting experience, often flying Jedi interceptors, and commented on the mistakes made by racers during the Dragonfire Air Rally airspeeder race."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Droom possessed a lightsaber, which he used as an initiate in the Initiate Trial duels. On several occasions, Droom piloted a Jedi interceptor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gretz Droom appeared in the 2019 audiobook Dooku: Jedi Lost, written by Cavan Scott, in which he was voiced by Pete Bradbury."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}