{"url": "Grevel", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Aleena", "Category:Colossus residents", "Category:Males"], "nodes": [{"tag": "h1", "text": "Grevel"}, {"tag": "p", "text": "Grevel was a male Aleena who lived on the Colossus during the era of the New Republic. He was a regular patron of Aunt Z's Tavern. At some point, he cheated on a game of holo-darts against Kazuda Xiono, whom did not pay him back. Grevel attempted to collect Xiono's debt at least twice and on the second they were interrupted by a pirate attack. Xiono saved Grevel and he ran to a shelter."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Making enemies"}, {"tag": "p", "text": "Grevel lived on the Colossus, an independent refueling station on the planet Castilon, during the New Republic era. At one point, Grevel was at Aunt Z's Tavern, which he was a regular patron of, and noticed Kazuda Xiono playing holodarts. He challenged the newcomer to a game and made a bet. Xiono threw his and hit all but one of them in the centre. Fearing he would lose, Grevel decided to triple the bet and gave Xiono another dart. This dart was sabotaged, so when Xiono threw it, it flew into the back of the Klatooinian Bolza Grool. Angered by this, Grool threatened Xiono and Grevel attempted to intervene in order to collect his winnings off Xiono. Grool shoved him out the way and when he tried again, the Klatooinian got him by the neck and threw him across the room. Grevel fell into the arms of the Snivvian Nod and, in response, he threw a cup back at Grool. Grool then threw Xiono into a serving droid and after a chain of events, an all out fight broke out in the bar. This fight ensued until Jarek Yeager intervened with his blaster."}, {"tag": "p", "text": "Shortly after the fight, the Nikto Neeku Vozo rushed into the tavern announcing that Xiono was going to challenge in the next race. Aunt Z then began the betting for the race and Grevel and the other immediately began betting. While watching the races later that day, Grevel witnessed the announcement that Xiono was challenging in the races. The commentator, Jak Sivrak, let Xiono choose his opponent, and when he chose Torra Doza, Grevek and the others laughed. Grevel later returned to Aunt Z's to hear the odds of Xiono's race. Grevel came to attend the race and watch as Xiono crashed into the ocean below."}, {"tag": "h3", "text": "Debt collecting"}, {"tag": "p", "text": "The next day, Narb, a Snivvian who worked for Grevel, was confronted by Nod over the credits he owed him from the betting. By the time Grevel arrived to see them, Nod had caught Xiono spying on them. Grevel intervened and tried to get the credits Xiono owed him. Xiono offered him a credit as down payment, but he refused, and Xiono ran. Grevel had Nod and Narb chase Xiono and the two Snivvians chased him into the Colossus marketplace. Xiono managed to get some distance between him and his chasers, and he headed back in Grevel's direction. Grevel pushed a box in front of Xiono, tripping him over, and he jumped on him until Nod and Narb arrived. The Snivvians picked Xiono up and took him into a corner. Xiono tried to escape but dropped his trophy in the process. Grevel bit it and realized it was made of aurodium, an extremely valuable metal. However, as Bolza Grool passed the commotion, BB-8, Xiono's droid companion, shocked him, and his gorgs flew out his box and onto Grevel and the Snivvians. Xiono ran away and although Grevel was able to follow, he and the other two did not find him."}, {"tag": "p", "text": "Still determined to get square with Xiono, Grevel confronted him later on with a blaster. He threatened to shoot Xiono if he did not hand over the aurodium trophy. Unluckily for Grevel, his attempt was intervened by a pirate attack on the Colossus. Two pirate ships immediately shot at them, knocking them back, and Grevel decided to leave Xiono for the time being. The two attempted to make it inside when another fighter shot at their area, blowing them off the platform. Xiono landed on the lead fighter with Grevel latching onto his leg. As the fighter maneuvered, the two fell off and back onto the crate area where they were before. Xiono ran through the receding door leading inside and Grevel soon followed. Xiono used his trophy to hold the door open and Grevel squeezed through and ran to a shelter."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Grevel was a male Aleena with blue eyes and purple skin. He was always willing for a profitable game of holodarts, but was bound to cheat if the wager did not meet his favor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Grevel is a character created and developed for Star Wars Resistance. He is voiced by Dee Bradley Baker who voiced the clone troopers in Star Wars: The Clone Wars and Star Wars Rebels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}