{"url": "Grey_Squadron", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic military units"], "nodes": [{"tag": "h1", "text": "Grey Squadron"}, {"tag": "p", "text": "Grey Squadron was a military unit within the Rebel Alliance which was formed during the Galactic Civil War and were led by former Clone trooper X2. The squadron was named after X2's genetic father, the Jedi Knight Falon Grey."}, {"tag": "p", "text": "Grey Squadron fought in many battles against the Galactic Empire and the Imperial Remnant, including the Battle of Yavin and the Battle of Hoth. Their primary starfighter was the X-wings just like Rogue Squadron, another squadron in the Rebel Alliance. Grey Squadron originated from the Geonosis strike team (Rebel), which failed in their attempt to infiltrate an Imperial outpost there. They were held captive until X2 was sent by Jedi Rahm Kota to rescue them, resulting in the unit's sworn allegiance to X2. They went on to take part in a multitude of battles against Imperial forces and participated in the Battle of Endor where, after discovering the Death Star II was operational, they were tasked with the defense of Admiral Gial Ackbar's flagship, the Home One. During this time, Rahm Kota introduced Shara, a former bounty hunter to the squad."}, {"tag": "p", "text": "During a mission to Dathomir, an Imperial saboteur planted detonation packs on the squadron's X-Wings, resulting in heavy casualties of the unit. X2 nearly killed the Imperial in revenge, but stopped when Shara reminded him that he should not follow down X1's dark path."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The beginning"}, {"tag": "p", "text": "In 2 BBY, the Alliance to Restore the Republic was formed to fight the Galactic Empire. One of the earliest members of the Rebellion was Jedi Master and General Rahm Kota, a survivor of the Great Jedi Purge. Some time later, Kota was sent to the planet Dantooine to recruit his former Padawan, Falon Grey, to the cause. However, upon arrival he discovered only X2, a clone of Grey, while Grey himself had been killed years earlier by another of his clones, X1. Sensing the Force resonating in X2, General Kota offered him to join the Rebellion, and the latter agreed. Around this time, the Alliance dispatched a strike team to the planet Geonosis to infiltrate an old Imperial droid foundry. However, the team was captured on account of their large numbers."}, {"tag": "h2", "text": "Appearances"}]}