{"url": "Grievous%27s_Munificent-class_star_frigate_(outer_corridor_of_space)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Confederacy of Independent Systems starships", "Category:Munificent-class star frigates", "Category:Unidentified frigates"], "nodes": [{"tag": "h1", "text": "Grievous's Munificent-class star frigate (outer corridor of space)"}, {"tag": "p", "text": "A Munificent-class star frigate served in the naval forces of the Confederacy of Independent Systems during the Clone Wars under the command of Kaleesh General Grievous. In 22 BBY, Grievous used the Munificent-class star frigate alongside another Munificent to ambush Jedi Knight Anakin Skywalker during his mission to sweep an outer corridor of suspected Confederate space."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "This Munificent-class star frigate was equipped with a hyperdrive generator and was armed with weapon systems. It also carried several Vulture-class droid starfighters and a passenger complement of several B1-series battle droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime after the Battle of Bothawui in 22 BBY, during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Jedi Knight Anakin Skywalker traveled to an outer corridor of suspected Separatist space. Upon exiting hyperspace in the outer corridor, Skywalker ordered his astromech droid, R3-S6, who was secretly a Separatist spy working for the Kaleesh cyborg General Grievous, to activate his starfighter's long-range scanners, however, the droid instead activated the fighter's tracking beacon. The signal soon alerted Grievous and two Munificent-class star frigates to Skywalker's location, and Skywalker then proceeded to order R3-S6 to prepare to jump to hyperspace, but the droid detached the fighter from the hyperspace ring, negating their chance to escape."}, {"tag": "p", "text": "Soon after, both Munificents deployed several Vulture droids and attacked the Jedi, but Skywalker was able to destroy them with his fighter's blaster cannons, but R3 then disabled them along with the engines, allowing for more Vulture droids to swarm the Jedi. However, Skywalker was saved by his Padawan Ahsoka Tano and Clone Captain CT-7567, nicknamed \"Rex,\" in the G9 Rigger-class light freighter Twilight, and after the astromech droid reactivated the engines, the Twilight, with Skywalker aboard, made its escape to hyperspace through the two frigates' wings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This Munificent-class star frigate appeared in \"Downfall of a Droid,\" the sixth episode of the animated television series Star Wars: The Clone Wars' first season, which originally aired on November 7, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}