{"url": "Grievous/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conflicting sources", "Category:Articles with elements from unlicensed sources", "Category:Pages needing citation", "Category:Cyborgs", "Category:Deities", "Category:Grievous's family", "Category:InterGalactic Banking Clan members", "Category:Jedi hunters", "Category:Kaleesh", "Category:Males", "Category:Separatist admirals and generals", "Category:Separatist leadership", "Category:Sharpshooters and snipers", "Category:Sith minions", "Category:Warlords"], "nodes": [{"tag": "h1", "text": "Grievous"}, {"tag": "p", "text": "Grievous, born as Qymaen jai Sheelal, was the cyborg Supreme Commander of the Droid Army of the Confederacy of Independent Systems for most of the Clone Wars. Grievous was originally a Kaleesh from the planet Kalee, where he lived his early life. During the Kaleesh conflict against the Huk, Qymaen jai Sheelal quickly learned the art of war, specializing in a slugthrower rifle. Quickly amassing a great number of Huk kills, he became a demigod among his people. He eventually met the female Kaleesh Ronderu lij Kummar, a master with the sword. The two became very close before Kummar's death at the hands of the Huk. Heartbroken, Qymaen jai Sheelal renamed himself Grievous and turned all his anger and grief toward the Huk. Aided by his elite, he forced the Huk off Kalee and then swarmed their homeworld, conquering them. The Huk turned to the Galactic Republic for help, and the Kaleesh were forced back to their own world by the Jedi and left to starve."}, {"tag": "p", "text": "Desperate to help his people, Grievous took a job as an enforcer with the InterGalactic Banking Clan. However, after learning that the Huk had attacked Kalee, he headed home to gain vengeance. IGBC Chairman San Hill, after consulting with his ally, Separatist Head of State Count Dooku, arranged for a bomb to be placed on Grievous' shuttle, Martyr. The Kaleesh was critically injured, but lived, and Hill arranged for the final stage of his plan. Grievous was reconstructed as a cyborg and was presented to Dooku as a potential weapon to be used in the upcoming war that the count had planned against the Republic."}, {"tag": "p", "text": "After being made Supreme Commander, Grievous proceeded to wreak havoc on the Republic for the three-year–span of the Clone Wars. The general was trained in the art of lightsaber combat by Dooku himself, who was also a Sith Lord. Grievous was a quick study and eventually came to be recognized as one of the most skilled duelists in the galaxy. Aided by his IG-100 MagnaGuards, Grievous killed many Jedi, and led the Confederacy to victory in many battles. Quickly gaining a reputation as a savage, merciless brute as well as a tactical genius, the cyborg, despite earning the nickname the \"head clanker,\" struck fear into the hearts of many with his flagship, the ion cannon–armed Malevolence, as well as Operation Durge's Lance, a massive strike at the Core Worlds."}, {"tag": "p", "text": "In 19 BBY, Grievous led the Confederate Navy in the Battle of Coruscant, an attack on the Republic's capital. Grievous killed several Jedi and took Supreme Chancellor Palpatine, leader of the Republic, hostage. However, before the general's flagship, Invisible Hand, could jump to hyperspace, the Republic Navy arrived, and the Chancellor was freed by Jedi Knights Obi-Wan Kenobi and Anakin Skywalker, the latter of whom was also successful in killing Dooku. Grievous fled to the Outer Rim world of Utapau and attempted to regain control of the war, though the Confederacy had been dealt a great blow with the loss of Dooku. Grievous was killed shortly after in the Battle of Utapau by Kenobi, and the Confederacy fell soon after. At some point after Grievous's death, his body was used to create the droid warrior N-K Necrosis, who considered himself to be the reincarnation of Grievous. However, the droid was killed shortly after his creation by several spacers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Though he would achieve his greatest infamy as the cyborg General Grievous, Qymaen jai Sheelal was originally an organic Kaleesh, a reptilian native of Kalee, a world torn by famine and war. For generations, Kalee had been assaulted without respite by a technologically superior insectoid species, the Yam'rii (referred to by the Kaleesh as the \"Huk\" or \"soulless bugs\"), who coveted the Kaleesh as slaves. The conflict between the two species was known as the Huk War."}, {"tag": "p", "text": "Sheelal's father, seeking a useful outlet for his son's anger, taught him how to handle a slugthrower rifle. The young Sheelal proved himself an excellent marksman with a mind as finely honed as any weapon; by eight years of age he had already become an expert sniper with more than forty Huk kills to his credit. By the age of twenty-two, he had slain so many Huk that the Kaleesh people considered Sheelal a demigod."}, {"tag": "p", "text": "Sheelal's closest comrade was a fellow Kaleesh warrior and mercenary Ronderu lij Kummar. According to legend, his relationship with this wild and skilled swordswoman had its beginnings in a dream, in which Sheelal saw himself slaying a wild mumuu in the Kunbal jungle with Lig swords. So taken was he with this vision that he set out in his mumuu hunting mask to kill one in reality, but instead of finding a mumuu in the jungle, he saw Kummar. He realized that the slayer in his dream had not been himself, but the woman standing before him in a karabbac mask and wielding twin Lig swords. The two of them were, therefore, considered living manifestations of the cryptic Kaleesh parable Sheelal, or The Dreamer/The Dreamt One."}, {"tag": "p", "text": "The bond of the two Kaleesh was very strong, and they became partners in war against the Huk. Kummar taught Sheelal to wield a sword, and in turn he introduced her to the Czerka Outland rifle. Both clad in masks, Kummar with her karabbac skull and Sheelal with his mumuu skull—inherited from his father, who had died fighting the Huk—became legends, twin demigods blessed by their ancestors. Together they mercilessly cut through the Huk invaders in countless campaigns."}, {"tag": "p", "text": "However, in one engagement on the beaches of Kalee, the two of them were separated. Kummar died violently on the Huks' barbed shears, and her body vanished into the Jenuwaa Sea. Sheelal, unable even to retrieve her from the waters, was driven to despair and a horrible psychotic depression. Inconsolable, he set off on a dangerous journey across the ocean to Abesmi, an island-monolith far from the mainland. There, he beseeched the gods to raise her from her watery grave just so he might see her one final time—but the gods remained silent."}, {"tag": "p", "text": "Sheelal did what he could to bury his grief. He ended up taking ten wives and siring thirty children, but none of them, spouse or child, seemed to be able to fill the void Kummar's death had left in him. Eventually, he realized that it was his destiny to mourn for her as long as he lived. With this realization, Qymaen jai Sheelal cast off his old identity, adopting a name more appropriate to a being destined to grieve forever, and, even more terribly, who was determined that he would not do so alone. He would be Grievous, as well as heart-broken, for the rest of his life."}, {"tag": "h3", "text": "Becoming a cyborg"}, {"tag": "h4", "text": "In the service of San Hill"}, {"tag": "p", "text": "Gathering to his side a group of equally bloodthirsty Kaleesh elite, the Izvoshra, and adopting the title of khagan, Grievous became a warlord and managed to force the Huk from Kalee. But his bitterness did not end with that triumph, and he pushed them further back, storming their colony worlds. His attacks and mass destruction of entire Huk planets ensured Kaleesh victory until the Huk turned to the Galactic Republic for help. Jedi Knights, sent to stop the war, sided with the Huk, and hefty fines and embargoes came down upon the Kaleesh. Kalee ended up in poverty, and hundreds of thousands of Kaleesh starved and died."}, {"tag": "p", "text": "The arrival of San Hill, Chairman of the InterGalactic Banking Clan, brought an opportunity to Grievous. Hill saw Grievous's potential as an IGBC \"collections agent\", and in exchange for his services, the Banking Clan offered to take on Kalee's massive debt, thus helping his people overcome the effects of the embargo. Grievous felt disgust at the notion of being a glorified leg-breaker for a soulless megacorporation, but he understood what the agreement would mean for his people, and besides, there was something in this innate warrior that needed to keep fighting. Eventually he agreed, taking command of the Clan's private army of droid enforcers."}, {"tag": "p", "text": "The IGBC kept its promise, alleviating Kalee's deficit and resuscitating its trade. In exchange, Grievous became an extremely effective enforcer. It was through his efforts that the IGBC aggressively collected overdue credits from Ord Mantell and seized Phlut Design Systems when the company defaulted. But he found he missed the comforts of his former life—he wanted his old elite, the Izvoshra, but apart from himself, the Banking Clan would not hire Kaleesh. He would have to make do with droids, but, having no confidence in the IGBC's basic battle droids, he demanded more intelligent models to take the place of his elite. With Count Dooku's permission, Hill consented and began production on the IG-100 MagnaGuards. Grievous, at first, was disgusted with the droids because they were completely mindless. He soon demanded they be reprogrammed to watch him in combat and learn how to fight like his old comrades in his elite Huk-killing team several years before."}, {"tag": "h4", "text": "The fall of Martyr"}, {"tag": "p", "text": "Soon, however, Grievous learned that the Huk had vandalized sacred Kaleesh burial grounds on the colony worlds, and that the Republic had done nothing. This news reawakened his desire to act directly in defense of his people, so he abandoned his contract with the Banking Clan and returned to Kalee to avenge the desecration. San Hill was far from pleased. He considered ordering Grievous's assassination, but he feared the vengeance the Kaleesh would take if he survived. Instead, Hill conspired with Poggle the Lesser, the Archduke of Geonosis, and with their mutual allies, Darth Sidious and Count Dooku, to arrange Grievous' permanent servitude."}, {"tag": "p", "text": "On Kalee, Grievous was annointed by another Kaleesh to prepare for the renewed conflict before he and his Izvoshra boarded his troop shuttle, Martyr. They set off to resume the Huk War, unaware that Dooku, Hill, and Poggle had planted an ion bomb aboard, and rigged Grievous' pilot seat to enable remote-guided ejection. The resulting explosion sent the Martyr plunging into the Jenuwaa Sea. Dooku's remote command ejected Grievous from the wreck at the last moment, but all his Izvoshra perished in the crash. His body, hemorrhaging and in shock, was dragged from the water, and Dooku used the arcane Sith heart stun technique to keep him from succumbing to cardiac arrest while en route to Geonosis. It was then that Dooku first planted the idea that the Jedi themselves were responsible for this attack in Grievous' mind. Then, MagnaGuards dragged him to a nearby shuttle, where FX-series medical assistant droids worked to stabilize his condition during the journey. Dooku, in the meantime, traveled to his homeworld of Serenno to retrieve one more important component in his plan."}, {"tag": "h4", "text": "Transformation"}, {"tag": "p", "text": "Grievous had suffered near-fatal injuries, rendering the body that had survived many battles useless, or so he was told. Planted evidence pointed to a Republic plot. In truth, Grievous once again proved his resilience, and additional injuries had to be added after the crash to make his body as broken as was claimed. San Hill repeated his proposal, including a promise to replace Grievous's broken body. Desiring vengeance against the Galactic Republic and the Huk, he agreed on the condition that his mind would not be tampered with."}, {"tag": "p", "text": "Dooku provided blood from the frozen body of Jedi Master Sifo-Dyas as a means of keeping Grievous's body alive during his transit to Geonosis, where Poggle the Lesser and his Geonosian scientists implanted his brain and eyes into a duranium alloy body reminiscent of a Krath war droid, complete with LX-44 robotic legs. His vital organs were housed in a synthskin gut-sack impervious to vacuum. The Geonosians would also alter his brain against his wishes, both to trim away disturbing memories—while enhancing his rage centers—and to enhance his equilibrium, allowing him to better employ his newfound agility. Internal implants were also placed in his eyes to sharpen his vision and to protect them from the vacuum of space. While the midi-chlorian-rich blood of Sifo-Dyas may have played a critical role in maintaining Sheelal's life, Grievous saw it as a personal failure that the transfusion did not also give him a degree of sensitivity to the Force. To San Hill and his allies, however, the experiment was a phenomenal success. Qymaen jai Sheelal had become General Grievous in form as well as spirit. The same droids and techniques used to rebuild Grievous would later be used to apply Darth Vader's cybernetic suit."}, {"tag": "p", "text": "The cyborg project was funded by San Hill to create a military leader that could counter Dooku's growing political influence in the Separatist Movement, although he presented the finished General Grievous as a twisted gift to Dooku. Though taken aback by his appearance, Dooku was pleased, and bestowed upon Grievous the title \"Supreme Commander of the Droid Armies,\" planning to use him in his efforts to conquer the Republic. He presented him with his first lightsaber, the weapon of Sifo-Dyas."}, {"tag": "p", "text": "Grievous was disgusted by his new droid body and took Dooku's appointment as Supreme Commander of the Droid Armies as an insult. Immediately after he was presented with Dyas' lightsaber, he slaughtered all the MagnaGuards in his presence in a defiant rage, exclaiming that he was not a droid, which Dooku had referred to him as. He further rebelled by openly displaying his Kaleesh heritage by adorning himself and his MagnaGuards with masks and cloaks in styles closely resembling those found amongst his people, considered by Dooku to be an act of vanity. Grievous, however, would soon come to highly respect both Dooku and Sidious, considering them \"necessary\" political leadership."}, {"tag": "p", "text": "In particular, Grievous bore a great hatred for the Trade Federation Viceroy Nute Gunray, tolerating him only because he was vital to the Confederacy's success. Specifically, Grievous was repulsed by Gunray's arrogance and cowardice, and quietly enraged by Gunray's questioning of his leadership, and his defiant tendency to treat Grievous as a typical mindless droid, even after Grievous' demonstrations to the contrary."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "The beginning of the war"}, {"tag": "p", "text": "Grievous was first let loose in the Geonosian catacombs during the Battle of Geonosis in 22 BBY where he safeguarded the Separatist Council from Jedi Master Ur-Sema Du and clone trooper companies; he left none alive to tell of his existence. Dooku, impressed with the general's performance at Geonosis, trained Grievous in the art of lightsaber combat, which Grievous took to at a rapid pace."}, {"tag": "p", "text": "Learning all the seven classic forms of Jedi arts—including the rarely seen Makashi and Juyo—Grievous quickly surpassed all the other apprentices of Dooku in terms of individual combat. Despite his obvious prowess, and the time and resources expended to creating him, Dooku still viewed him as second to the Chiss general Sev'rance Tann. It was only after Tann's death one month after Geonosis that Grievous truly began to come into his own."}, {"tag": "h4", "text": "The General revealed"}, {"tag": "p", "text": "Grievous's first public appearance against the Republic and Jedi Order was at the Battle of Hypori four months after the Battle of Geonosis. Grievous led a massive detachment of battle droids to attack the Jedi on Hypori, and his tactics resulted in the obliteration of an entire Republic task force. The general cut down Jedi Master Daakman Barrek as he attempted to request reinforcements from the Jedi Anakin Skywalker and Obi-Wan Kenobi, who were simultaneously fighting on Muunilinst. With six other Jedi—Tarr Seirr, Sha'a Gi, Aayla Secura, K'Kruhk, and Jedi High Council members Ki-Adi-Mundi and Shaak Ti—trapped in the remains of a downed Acclamator-class transport, Grievous ordered his B2 super battle droid troops to stand down, effectively surrounding the Jedi. The general addressed the trapped Jedi, stating that he would grant them a \"warrior's death\" and lying in wait for them to move. Once Padawan Gi ran screaming into the unprotected open, Grievous jumped on and killed him. The general then perched himself on the top of the transport and hung from this point, surveying the five remaining Jedi Knights before landing below and engaging them in combat, unleashing vicious dual-lightsaber attacks on his adversaries."}, {"tag": "p", "text": "Grievous first targeted Mundi, advancing toward his opponent with the other Jedi in pursuit. Although Mundi evaded the general's powerful downward slash and released a Force-push at him, Grievous evaded the blast and jumped onto a nearby wall, propelling himself at the Knights and blasting them aside upon impact. Grievous cut down the attacking K'Kruhk down, slashed through the rubble thrown at him by Ti, picked up the advancing Seirr by the head with one of his mechanical feet and slammed him to the ground face first, and grabbed Secura as well, throwing both Seirr and Secura up against the top of the transport's remains above. Grievous then dueled both Masters Mundi and Ti at once. He managed to counter their attacks and eventually kicked Mundi against a nearby pile of rubble. Unfazed, the cyborg general advanced at Ti. Shaak Ti desperately tried to defend herself but was unable to escape his onslaught. Grievous quickly overwhelmed her, knocking her lightsaber out of her hand and kicked her hard against a pile of debris. A recovered Mundi attempted to retrieve his lightsaber with the Force, only to have Grievous trap the weapon beneath one of his clawed feet and pick it up himself. With Grievous in possession of three lightsabers (one in each hand and the third he wielded using his left foot), Mundi stole one of the lightsabers secured at his waist, and Grievous jumped at Mundi, lightsabers blazing."}, {"tag": "p", "text": "As Grievous fought Mundi, an Advanced Recon Commando clone trooper squad led by Captain Fordo arrived in an LAAT/i gunship to rescue the Jedi. While several clones followed the life signs of the surviving Jedi, Fordo led other troopers to rescue Mundi just as Grievous was preparing to kill the disarmed Jedi Master. The ARC troopers opened fire on Grievous, who evaded the blasts, running across the roof of the compound. Grievous then landed on the ground, cutting through several troopers. Fordo brought in the LAAT/i gunship, and Grievous quickly ran from the craft's laser fire and rockets. While Mundi and the ARC troopers escaped with Secura and Ti under treatment to recover from the devastating battle, Grievous stole the fallen K'Kruhk's lightsaber and added it to his collection of trophies around his waist. Grievous watched as the Republic gunship fled from Hypori, taunting the Jedi and stating that they had \"only prolonged the inevitable.\""}, {"tag": "p", "text": "After that battle, Grievous was given a grueling monogram from Jedi Master Plo Koon: the Butcher of Hypori."}, {"tag": "p", "text": "Six months after the Battle of Geonosis, Grievous led an assault on the Outer Rim planet of Nadiem. His armies were able to secure a strong foothold on the world before a Republic detachment, led by Luminara Unduli and Saesee Tiin, arrived to stop his advance. Grievous ordered the movements of the Separatist army from a base far from the front, and though Tiin and a Republic fleet defeated his air support, Grievous made significant gains. Grievous sent his forward armies through a strategic canyon to attack the Republic's main army, where they were ambushed by clone troopers and Barriss Offee, Unduli's Padawan. Though the droids appeared to have defeated the clones, they were only pretending to be dead, and attacked the army from behind when it engaged Unduli's forces at the other end of the canyon. Grievous's forces were outmaneuvered and destroyed, leaving Grievous to abandon the battle in his personal starfighter. The Jedi Master B'dard Tone and his apprentice attempted to stop Grievous, but Tone was wounded and his apprentice was killed."}, {"tag": "p", "text": "Not long after this, Count Dooku tested Grievous by pitting him against fellow Separatist commanders Asajj Ventress and Durge aboard the Count's Trenchant space station. After Durge and Ventress had been lured onto the station, Grievous snuck up on Durge, shocking him from behind with an electrostaff and throwing him across the room through the various trophies there."}, {"tag": "p", "text": "When Ventress jumped onto a dragon hanging from the ceiling and attempted to find Grievous, he instead snuck up on her and knocked her off her perch with the blunt end of his staff. Although Durge caught the falling Ventress, Grievous soon confronted the pair face-to-face. The general threw Ventress into a glass case and was caught around the neck by one of Durge's flails. Ventress then attacked Grievous from behind as he removed the flail, slashing at the cyborg with her paired lightsabers, and Durge contributed to the fight, punching Grievous and slamming him through a statue of Count Dooku. As Durge and Ventress advanced, Grievous activated two of his lightsabers, cutting into Durge and beheading the bounty hunter. Grievous saber locked with Ventress and was slammed into a containment case by the Dark Acolyte. Despite his injuries, Grievous grabbed Ventress in a choke, responding to her probes about his identity by stating that he was \"the future.\" With that, Grievous choked Ventress unconscious."}, {"tag": "p", "text": "The cyborg general brought Ventress's inert body to a meeting with Count Dooku, questioning if he could jettison both bodies. Dooku refused the request and ordered them to be put in bacta tanks, stating that they had proven themselves and citing their loyalty. However, Grievous had successfully humiliated both Separatist commanders, showing Dooku his worthiness of holding the position of Supreme Commander of the Droid Armies. The General's skill at fighting Jedi prompted Republic HoloNet News to nickname him \"The Knight Slayer.\" As Supreme Commander, Grievous normally traveled with a cadre of IG-100 MagnaGuards, who wielded dangerous electrostaffs made from lightsaber-resistant phrik alloy. Grievous quickly became the face of the Confederacy, and was feared by countless citizens loyal to the Republic. His role as Supreme Commander led to the Republic's clone troopers nicknaming him the \"head clanker.\""}, {"tag": "p", "text": "Count Dooku dispatched Grievous to the icy world of Ando Prime to investigate the disappearance of a battle droid army, which had vanished alongside the 313th Legion, the Republic unit that it had been battling. The cyborg general and his droid squad of twelve were initially unable to locate the unit and reported back to the Separatist Head of State, who ordered Grievous to continue searching, as a loss of this magnitude was unaffordable for the Separatists. As the general continued to search for the vanished droid army, he and his squad were ambushed by the Republic unit Excelsior Company, which was also there to investigate the disappearance of the Republic forces. Led by Clone Commander Vargus, the clone trooper detachment eliminated Grievous's droids and forced the cyborg to flee."}, {"tag": "h4", "text": "The Malevolence"}, {"tag": "p", "text": "As the war continued, Grievous took the Subjugator-class heavy cruiser Malevolence as his flagship. The warship possessed two ion cannons that were capable of disabling entire fleets, leaving them vulnerable to the Malevolence's turbolaser fire. Under the general's command, the Malevolence began executing attacks on Republic fleets that left no survivors. After eradicating a Republic task force in the Phu system, Grievous and the Malevolence were stationed in the Abregado system with Count Dooku, who had arrived aboard the warship to supervise Grievous's progress. Jedi Master Plo Koon led a task force to find and destroy the Separatist superweapon, and arrived in the system to engage the warship. Before the Jedi could get in firing range, Grievous ordered the Malevolence's battle droid crew to fire an ion blast at the Republic fleet. After the Star Destroyers' deflector shields were disabled, the Malevolence opened fire and eradicated the fleet, scattering a debris field in the system from the wreckage of the Republic cruisers."}, {"tag": "p", "text": "While Grievous deemed the destruction of the Republic fleet a successful test, Dooku dispatched a Droch-class craft—nicknamed a \"pod hunter\" for its purposes—with rocket battle droids aboard to locate and eliminate the Republic's escape pods. During the craft's hunt for life pods, however, the Malevolence lost contact with the pod hunter, and Grievous mused that perhaps some survivors were putting up a fight. As the Malevolence activated its scanners, the battle droid crew picked up a signal from a non-Separatist droid, and Grievous immediately ordered his warship to assume attack position. The battle droids then picked up the freighter Twilight—carrying Anakin Skywalker and Ahsoka Tano, who had rescued Plo Koon and the survivors of the battle—attempting to escape from the debris field. Dooku reminded his general that he did not want any witnesses, and Grievous ordered the ion cannon to be charged and fired. However, the Twilight evaded the ion blast by jumping to hyperspace, taking the knowledge of the warship's weapons to the Republic. Considering the battle a defeat because of this, Dooku's trust in Grievous was shaken, and the Sith Lord left to discuss plans with his master, Darth Sidious."}, {"tag": "p", "text": "With Count Dooku watching his progress via hologram, Grievous intercepted and eradicated a Republic medical convoy in the Ryndellia system. Dooku had recently met with Darth Sidious and had learned of the Kaliida Shoals Medical Center, the Republic's secret medical facility in the Outer Rim Territories that was treating over 60,000 wounded clones. Dooku assigned the medical center as the Malevolence's new target, seeking to exploit the weakness that the Jedi displayed in their care for their clone troopers. This assignment boosted Grievous's confidence, as it showed that the Count had not completely lost his faith in him since his recent failure at Abregado. As the remaining Republic frigate deployed several escape pods, Grievous ordered the pods to be targeted, stating that he had \"a reputation to uphold.\" To get to the medical station, the Malevolence's navicomputer was forced to calculate a complex hyperspace course around the Kaliida Nebula, which was near the medcenter. Grievous was frustrated with the setback, as he wanted to maximize his casualties and did not want too many wounded clones to be given the chance to evacuate the station before his arrival."}, {"tag": "p", "text": "En route to Kaliida Shoals, Grievous received word from Count Dooku that the Republic had launched a small strike force under the command of Anakin Skywalker to intercept the warship. The Sith Lord advised his general not to underestimate the Jedi, but Grievous maintained that it would be Skywalker who would underestimate the Separatist ship. Skywalker's starfighter squadron took a shortcut through the nebula, and Grievous arrived shortly thereafter. As the Jedi and his fighters approached, Grievous launched Vulture droids from the Malevolence to attack the Republic squadron while the warship itself targeted the medical transports attempting to escape from the medical center. The superweapon made haste with disabling the frigates before tearing them apart with laser fire. Grievous ordered the ion cannon to be charged and targeted at the Republic squadron, despite the fact that his own Vulture droid starfighters would be caught in the blast. The battle droids complied, decimating Skywalker's fighters."}, {"tag": "p", "text": "As the Jedi closed in on the warship with his remaining forces, Grievous targeted the Kaliida Shoals Medcenter, seeking to destroy the medical facility before attending to Skywalker. However, the Republic squadron attacked the ion cannon, and once the Malevolence attempted to fire its deadly weapon at the medcenter, the cannon exploded, triggering a chain reaction that rocked and greatly damaged the ship. With the Malevolence's primary weapons disabled, Grievous ordered a full retreat to Separatist space. General Obi-Wan Kenobi then arrived in the system with a fleet of three Venator-class Star Destroyers and began to attack Grievous's ravaged flagship. As the Malevolence fled under increasing fire from the Republic cruisers, Dooku contacted Grievous and informed the general that Senator Padmé Amidala of the Republic had been tricked into traveling to the nebula; with her as a hostage, Grievous would be able to safely escape. At first, the general believed that such a tactic was unnecessary, but eventually complied with the Sith Lord's plan. Amidala's ship arrived out of hyperspace just off the Malevolence's bow, and Grievous ordered the yacht to be captured with the warship's tractor beam."}, {"tag": "p", "text": "After Senator Amidala had been pulled into the Malevolence's main hangar via the tractor beam, the Republic Star Destroyers ceased their fire. Grievous ordered a repair crew to be brought up to the warship's bridge and proceeded to the landing bay to apprehend his hostage. However, Amidala had overloaded her ship's engines before hiding elsewhere in the hangar. After taking his warship's rail jet to the hangar, Grievous entered Amidala's ship with two B1 battle droids and discovered her exploit. Pushing the battle droids out of the way, Grievous headed for the exit, but the ship exploded before he could run for safety. The general survived the explosion and cleared himself out of the rubble. Leading the battle droids' search for the stowaway Senator through the warship's hallways, Grievous soon received word from his ship's droid crew that the hyperdrive would require less time than originally believed to repair. Ordering his troops to continue the search for the Senator, the general left to inform Count Dooku of this new development. On the bridge, Grievous learned that there had been an unauthorized communication inside the ship, but was angered when he discovered that the battle droids had not caught it in time to intercept it. The general ordered his crew to monitor all internal communications to locate the Senator."}, {"tag": "p", "text": "Taking the Twilight to the warship, Skywalker and Kenobi arrived aboard the Malevolence and rendezvoused with Amidala at the rail jet junction. Kenobi planned to sabotage the warship's hyperdrive, while Skywalker and Amidala would meet him back at the Twilight. However, Grievous intercepted their comlink transmission, and took a squad of battle droids with him to ambush Kenobi. After Kenobi arrived in the hyperdrive room, Grievous's deployed battle droids surrounded the Jedi Master, and the cyborg himself jumped down from a higher level to confront him. Grievous ordered the droids to kill Kenobi, but the Jedi defeated the majority of the droids before using a remaining droideka's deflector shield as protection from Grievous's oncoming blaster rifle fire. Kenobi then Force-pushed the droid toward Grievous. As the Separatist general picked up the droideka and hurtled it aside, Kenobi escaped. Grievous took his frustration out on a battle droid who commented on Kenobi's abilities, ordering his troops to guard the hyperdrive before departing to deal with Kenobi himself."}, {"tag": "p", "text": "Grievous found Kenobi aboard a rail jet car and saberlocked with him, pursing Kenobi after he broke the bladelock. The cyborg knocked Kenobi on his back, but as Grievous prepared to kill the Jedi, Kenobi jumped onto another railjet, saluting the general as he left. Grievous boarded the Soulless One and took a squadron of Vulture droids to attack the fleeing Jedi and Senator, who were returning to the Republic fleet in the Twilight. During the dogfight, a B1 battle droid contacted Grievous and informed him that the Malevolence's hyperdrive was almost completely repaired. The general ordered the Malevolence to retreat to hyperspace, arranging to meet his warship at a Separatist base in Sector Four. However, Skywalker had sabotaged the warship's navicomputer before escaping. As the Malevolence headed toward the nearby Dead Moon of Antar, Grievous ordered the warship's crew to reset the navicomputer. Dooku contacted Grievous, stating that the general and his warship were being awaited at the rendezvous point. Manually cutting off the transmission, Grievous engaged his fighter's hyperdrive and retreated shortly before the Malevolence crashed into the moon."}, {"tag": "h4", "text": "Victories over the Republic"}, {"tag": "p", "text": "As the war progressed, Grievous led Separatists forces to fight on the planet Anoth and battle on the planet Bakura, engaging Jedi Knights Anakin Skywalker and Obi-Wan Kenobi both times. The General also had his battle droid forces on Ord Mantell raze an entire civilian township to divert Republic troops and allow himself to escape. Grievous eventually captured crucial hyperlane routes running to Bespin, Kessel, and Mon Calamari, totaling six Separatist victories that month. The capture of the lanes jeopardized the supplies of tibanna gas and Kessel spice, leading to civilian suffering, and also prevented the Mon Calamari from engaging in an \"ages-old ritual.\""}, {"tag": "h4", "text": "Battle of Bothawui"}, {"tag": "p", "text": "Grievous then planned to capture Bothawui, the strategical world of the Bothans that was critical to Republic Intelligence. When the Jedi Council learned of the general's plan, Anakin Skywalker and his Padawan learner, Ahsoka Tano, were dispatched with a newly-christened fleet of Venator-class Star Destroyers to stop the cyborg. Grievous cut the Jedi out of their hyperlanes and engaged the Jedi three times in open space before Skywalker and his fleet escaped and took a direct course to Bothawui."}, {"tag": "p", "text": "Grievous halted his pursuit of Skywalker's fleet to coordinate attacks on Republic forces on separate fronts. Picking up two more Munificent-class star frigates, Grievous then overwhelmed a Republic battle group stationed at the planet Falleen. With the added aid of Count Dooku and Asajj Ventress themselves, Grievous was able to capture the planet and headed to invade Bothawui. Grievous's fleet of six Munificent-class frigates arrived out of hyperspace in front of Bothawui Prime's asteroid belt, and at the general's order, the ships of the fleet directed all power to their forward shields and proceeded through the asteroids. As soon as it emerged from the asteroid belt, Grievous's fleet attacked Skywalker's three Star Destroyers. However, a squad of Republic AT-TE walkers had been deployed to the asteroids and opened fire on the fleet from behind, giving Grievous a nasty surprise. Frustrated with the failed attack, Grievous left an OOM battle droid in command of the fleet and fled in Soulless One. His starfighter was pursued by Skywalker himself in his Delta-7B fighter, but thanks in part to flying debris that damaged Skywalker's fighter, Grievous was able to jump to hyperspace and retreat. Following the defeat at Bothawui, the Trandoshan scavenger Gha Nachkt contacted Grievous, informing the general that he had salvaged R2-D2, Skywalker's astromech droid, from the Bothawui asteroid belt. Grievous agreed to \"buy\" the droid from the scavenger, but threatened Nachkt when he attempted to raise the arranged price for the droid."}, {"tag": "h4", "text": "Encounter on Skytop Station"}, {"tag": "p", "text": "Grievous's spy droid, R3-S6—who had been assigned to Skywalker as his replacement astromech—soon activated the homing beacon of the Jedi's fighter during a mission to scout ahead for enemy activity. Grievous arrived with two frigates to ambush the Jedi, and Vulture droids were launched from the Separatist fleet to attack Skywalker. However, Tano arrived with Skywalker's personal ship, the Twilight, to rescue her Master, causing Grievous to smack a nearby B1-Series battle droid out of frustration. Grievous then went to the Separatist listening post Skytop Station, located over one of the moons of Ruusan, to rendezvous with Nachkt and retrieve the droid. Once the scavenger had arrived with R2-D2 at the space station, Grievous ordered Nachkt to take the droid apart and access his memory banks. The preceding investigation revealed that R2-D2's mission memory had never been erased, and when Nachkt demanded a higher pay, Grievous replied by impaling the Trandoshan in the back with his lightsaber. The general then learned from his spy, R3-S6, that the Jedi had arrived aboard his station to destroy it, and ordered his IG-100 MagnaGuards to guard R2-D2. Shortly before revealing himself to Tano and a squad of clone troopers, Grievous ordered the astromech droid to be taken to Soulless One."}, {"tag": "p", "text": "Confronting Tano and her clone squad, Grievous batted the Padawan aside before attacking and killing all but two of the troopers. As the general prepared to kill Clone Captain CT-7567, Tano regained consciousness and blocked his lightsaber blow. Grievous was doubtful that Tano would provide a challenge for him, but engaged the Padawan in combat before following her and R3-S6 into a storage room. The two engaged in a game of cat and mouse as Grievous chased and engaged Tano, and with the general occupied, CT-7567 and the other clone were able to plant explosives in the station's reactor room. When R3-S6 received word that Skywalker had arrived to retrieve his R2 unit and was planning to rendezvous with the rest of his men in the landing bay, the general ordered his spy droid to prevent the Jedi and clones from escaping. Hanging from the ceiling, Grievous found Tano and clamped a metal hand around the Padawan's throat, examining her fallen lightsaber with his free hand."}, {"tag": "p", "text": "Despite Tano's claims that her Master would destroy Skytop Station, Grievous believed otherwise. However, Tano's beliefs proved true when the Republic squad detonated the explosives in the reactor room, crippling the listening post's repulsorlift systems. As the station shook from the impact, Tano managed to use her lightsaber to sever the hand clamped around her throat. Although Grievous attempted to slash her with one of his lightsabers, Tano retrieved her weapon and escaped through an air duct. While Skytop Station plummeted from the sky, Grievous escaped in Soulless One empty-handed, lacking the Republic droid or another stolen Jedi lightsaber to add to his collection. At some point during the war, Darth Sidious gave Grievous a set of Republic code keys, giving the Confederate Navy the opportunity to take control of the planet JanFathal in the Fath system. Grievous also launched an assault on the planet Kothlis, a fact which the Republic managed to learn. The Republic sent a fleet to confront Grievous, and was able to drive him away. During a battle at Nexus Ortai against Republic forces, Grievous arrived with a fleet of Munificent-class frigates and a single Providence-class carrier/destroyer to reinforce the Separatist fleet over the planet, forcing the Republic out of the system."}, {"tag": "h4", "text": "Proving his competence"}, {"tag": "p", "text": "Later in the war, Grievous targeted the Republic's cloning facilities on Kamino, intending to stop the production of clone troopers for good. To prevent the Republic from learning of the impending invasion, Grievous sent droid squads to seize all Republic outposts in the sector and hot-wire the stations' \"all-clear\" signals. Despite her rivalries with Grievous, Asajj Ventress made the necessary preparations on Kamino for the general's invasion. A BX-series droid commando squad overran a Republic outpost on the moon of Rishi, and after the droids reported their success to Grievous, Ventress contacted the general with the news that all the preparations on Kamino were in order. As the Separatist fleet approached the Kamino system, Grievous learned that the droid commandos on the moon had stopped responding. Seeking to ensure that the base did not alert the Jedi of his approaching fleet, the general ordered reinforcements to be sent to the station. However, a squad of clone troopers put up a fight and destroyed the base, alerting the Republic to Grievous's presence in the system. The Republic fleet arrived over the moon and opened fire at the Separatist cruisers, and with his fleet outgunned, Grievous and his ships fled the system. The Galactic Senate later issued a \"dead or alive\" warrant on the cyborg general."}, {"tag": "p", "text": "During the war, Grievous held a castle on the third moon of the planet Vassek, where he housed his pet roggwart, Gor—a fearsome creature whom Grievous \"doted on\"—in addition to spare parts and trophies from the Jedi he had murdered. EV-A4-D, his repair droid, also resided in the general's lair. While returning to his castle in Soulless One, Grievous dreamed of his past as a Kaleesh warlord and his transformation into a cyborg. However, when he entered his stronghold, he discovered that his MagnaGuard bodyguards had been shut down. The general was soon confronted by the Jedi Kit Fisto and Nahdar Vebb with a squad of clone troopers. Drawing two of his lightsabers, Grievous engaged the two Jedi in lightsaber combat before splitting his arms and activating two more of his stolen Jedi weapons. The clones fired grappling hooks at the cyborg's legs, and Fisto severed the general's limbs below the cables. Although he felt no pain, the loss of his legs put Grievous at a disadvantage in agility."}, {"tag": "p", "text": "The general jumped up to hold a beam on the roof, but the clones quickly pulled him back down to the ground. Attempting to crawl away, Grievous was confronted by Vebb, and the general's lightsaber spun out of his hand. Grievous again jumped up to hang from the roof, but this time succeeded in severing the cables attached to his legs. Batting a dead clone against Fisto, the general then threw the trooper onto Vebb before sustaining a blaster shot to his face and fleeing. The Jedi and clones gave pursuit, but Grievous attacked two troopers and entered the sanctuary of his hidden command center. Splitting his arms again, the cyborg opened the door to the center by touching its panels in a certain sequence. Learning from EV-A4-D that his droid bodyguards had been remotely deactivated for recharge, Grievous activated his MagnaGuards and ordered them to lock down the perimeter. Watching the Jedi and remaining clones retreat via a droid holocam, Grievous sealed off all the exits from his castle and trapped the squad inside his lair. The general conferred with the Jedi via holotransmission before severing the connection and opening up a molten incinerator pit, dropping one of the clones into its depths. As Grievous continued to watch the Jedi's progress, Fisto drove his lightsaber into the holocam. Undaunted, the general told Gor it was \"time to entertain their guests\" and released him to confront the Jedi before EV-A4-D began repairs on the cyborg."}, {"tag": "p", "text": "After his repairs had been completed, Grievous was temporarily confined to his chair to allow his new legs to set in. Checking on Gor's progress with the Jedi, Grievous discovered that Gor had been killed and that the Jedi had escaped. Angered with the loss of his roggwart and finding it another \"wrong that the Jedi Order would pay dearly for,\" Grievous soon discovered from Dooku that it was the Sith Lord himself who had deactivated his MagnaGuards and let the Jedi into his lair in order to reassess the cyborg general in light of his recent failures at the Jedi's hands. Cutting off the transmission, Grievous stated that he would \"play the Count's little game,\" and resolved to hunt down the Jedi for sport. Although EV-A4-D stated that he required rest in light of his recent repairs, Grievous was determined to find and kill the Jedi. The general left his command center with several MagnaGuards, but was soon alerted by EV-A4-D that the Jedi were about to enter the hidden room. Grievous immediately turned around to confront the Jedi, and while Fisto escaped into the command center, Vebb was determined to fight Grievous and remained outside as EV-A4-D shut the door. Vebb cut his way through Grievous's bodyguards and entered into lightsaber combat with the cyborg. As the two opponents blade-locked, Grievous took out a blaster with one of his free arms and shot the Jedi, taking the fallen Vebb's lightsaber for his own collection."}, {"tag": "p", "text": "Knowing that Fisto was watching from inside the control room, Grievous stated that he was his next target, and pursued the Jedi out to the castle's outer platform. Climbing onto the platform from below, Grievous appeared to Fisto and engaged the Jedi Master in combat. Fisto used the fog to his advantage and deactivated his lightsaber to sneak up on the cyborg. Spinning his four lightsabers in defense, Grievous found himself confronted by Fisto from behind, and the two duelists continued their fight. As Grievous swung a lightsaber at the Jedi, Fisto severed the hand of the cyborg that held Vebb's lightsaber and reclaimed it. Grievous was forced to give ground, but Fisto managed to land a blow on the cyborg and Force-pushed him off-balance. The general quickly got back up and continued the duel with renewed vigor. Suddenly, three of the cyborg's MagnaGuards appeared and attacked the Jedi. With Fisto surrounded and outnumbered, Grievous demanded his surrender. However, Fisto's Delta-7B fighter appeared, piloted by Fisto's astromech droid. Before Grievous or his MagnaGuards could stop him, Fisto escaped."}, {"tag": "p", "text": "Returning to his castle and entering the stronghold's sanctum overlook chamber, Grievous conferred with Dooku via holotransmission and learned that victory over the clones and the young Jedi, Vebb, had been expected. At first, Dooku believed that Grievous had also bested the Jedi Master Fisto and was pleased with this accomplishment. However, Dooku was disappointed when he learned that Fisto had escaped, stating that there was \"room for improvement\" before severing the connection and leaving Grievous alone with his frustration. Grievous eventually had EV-A4-D rebuilt to continue his service as a doctor and adviser."}, {"tag": "h4", "text": "Stands against the Jedi"}, {"tag": "p", "text": "Later in the war, Grievous initiated an assault on the planet Felucia. The Separatists were eventually able to defeat the Jedi-led Republic forces there through sheer numbers, forcing the Republic to pull out from the world."}, {"tag": "p", "text": "Accompanied by EV-A4-D, Grievous also took Separatist forces to attack the planet Dorin, home to the Republic-allied Kel Dors, in order to distract the Jedi from raiding Geonosis, where several secret Separatist droid foundries were in operation. While the general was taking pleasure in decimating the \"Republic filth\" from his command ship, EV-A4-D notified him of an incoming top-level transmission from Asajj Ventress. Grievous initially refused to take the transmission, but agreed to receive it when his medical droid stated that the Dark Acolyte could be reporting information from Count Dooku. The cyborg conferred with Ventress, who verbally toyed with him before eventually informing Grievous that a large Republic fleet under the command of Anakin Skywalker and Ahsoka Tano had left Coruscant to reinforce Dorin. Grievous was confident in his abilities to defeat the Jedi, though Ventress mockingly expressed her beliefs for the contrary. Grievous recalled his forces and prepared his fighters in preparation for Skywalker's arrival, but he was ultimately unable to defeat the Jedi."}, {"tag": "p", "text": "Though the Republic was desperate to capture Grievous, they were unable to predict where he would strike next. In one battle, the General's Separatist destroyer attacked a Venator-class Star Destroyer commanded by the Jedi Eeth Koth. Koth ordered his clone troopers to abandon the ship while he stayed behind to confront the cyborg on the ship's bridge. Grievous boarded the Star Destroyer and plowed through the clone troopers until he reached the bridge. Grievous cut his way through the sealed door, and then stood back, while several of his commando droids assaulted the bridge. However, they were defeated, prompting Grievous to call in his MagnaGuards, who surrounded Koth. Grievous mocked Koth, who in turn called him a coward and a murderer. The two dueled, with Koth using the Force to gain a brief advantage. However, he was then subdued by a MagnaGuard, and taken hostage. Grievous proudly broadcast his victory over Koth directly to the Jedi Temple. In his message, he proudly proclaimed that he had defeated Koth, and swore that he lived to kill the Jedi as he sadistically tortured Koth, promising that the Jedi Master's death would be slow, much to the horror of the Jedi watching."}, {"tag": "p", "text": "Unnoticed to Grievous, Koth was able to use a hand signal as he was being tortured, indicating that the General was in the Saleucami system. The Republic sent a rescue mission led by Obi-Wan Kenobi, Anakin Skywalker, and Adi Gallia in hopes of freeing Koth and defeating Grievous. When the Republic ships arrived at Saleucami, Kenobi broadcast a message to Grievous, knowing that it would entice the cyborg to attempt to board the Republic vessel in hopes of personally killing the Jedi Master. With Grievous distracted, Skywalker and Gallia were able to board Grievous's ship, and make their way to the bridge, where Koth was being held. Meanwhile, Grievous boarded the Republic vessel, and engaged Kenobi in combat. Grievous revealed to him that he was aware that Skywalker was on board his vessel."}, {"tag": "p", "text": "Gallia and Skywalker managed to find Koth, but were then ambushed by a group of BX-series commandos. Despite being outnumbered, the duo were able to defeat the commando droids and TV-94, and rescue Eeth Koth. Back on the Republic vessel, Grievous fled from Kenobi after being unable to defeat the Jedi Master. While running back to his own ship, he ordered his droids to fire on the engines of the Republic vessel docked to his Recusant-class light destroyer. If all went as planned, he would return to his ship just before the Republic ship exploded, killing Kenobi and trapping the other Jedi on board the Separatist vessel. Though Grievous was able to escape, Kenobi was saved from the vacuum of space by Gallia. Skywalker was able to make it back to the Jedi's shuttle with Koth, and then land it in the Recusant's hangar, enabling the Jedi to escape."}, {"tag": "p", "text": "Grievous in turn climbed into a C-9979 landing craft, taking it to Saleucami's surface. The Jedi were informed of this by Admiral Wullf Yularen, and Kenobi decided to follow Grievous, taking with him several AT-TEs. After walking several kilometers to find a non-damaged escape pod, Grievous and his troops were able to send a signal to the fleet, calling for a ship to come pick them up. However, before they could take off, the Republic army caught up to them, and the cyborg once again dueled Kenobi. Nonetheless, he was able to briefly stun the Jedi, and escape, to the chagrin of Kenobi."}, {"tag": "h4", "text": "Attacking Tipoca City"}, {"tag": "p", "text": "Sometime after the destruction of the Rishi moon outpost, Grievous and Ventress combined their forces at the behest of Count Dooku to launch another surprise attack on Kamino. Although Jedi Generals Kenobi and Skywalker intercepted a transmission between the two CIS commanders, this did not hamper Grievous's plans for the destruction of Kamino. When the Separatist fleet attacked the Republic blockade, he started to sacrifice his transports to protect his command ship. Kenobi, knowing that the general would never sacrifice his ships idly, went into a submarine to investigate the debris from Grievous' transports. When Kenobi discovered that the debris contained aqua droids were building assault craft, he was attacked, and the assault on Tipoca City started."}, {"tag": "p", "text": "While aboard of one of the assault craft, Grievous ordered his droids to kill all, no mercy, and advanced on ARC Trooper Commander Colt's units after landing. After Ventress appeared, she Force choked and stabbed the commander with her lightsaber, causing the cyborg to compliment her on her skills, a match for his own, to which Ventress replied that while Dooku may have taught Grievous how to wield a lightsaber, it does not make them equals. The two Separatists then left to take on their objectives: Ventress would attempt to acquire a sample of the clones' DNA, while Grievous assaulted the clones' barracks."}, {"tag": "p", "text": "When the general and his droids got there, they were ambushed by clone cadets and troopers under Captain Rex and Commander Cody. Grievous ordered his droids to scatter the clones, but was confronted by Obi-Wan Kenobi, and the two engaged in lightsaber duel. He managed to disarm the Jedi and tried to squash him with his feet. As he moved in for the kill, he stated to Kenobi that his clone army and Kamino were doomed. Kenobi then Force pushed Grievous, retrieved his lightsaber and pursued the cyborg to an outside landing platform. When the general started twirling his lightsabers, one of the Separatist assault craft wrecked the platform, causing Obi-Wan to slip down into the water once again. Grievous, seeing that Kenobi was seemingly gone, escaped on a shuttle, picked up Ventress and retreated into space."}, {"tag": "p", "text": "Sometime after these events, the Republic Senate and the Separatist Parliament debated on escalating the war and pursuing peace. After the Separatist Parliament decided to pursue peace, Grievous was secretly ordered by Count Dooku to deposit a group of droids disguised as sanitary units on Coruscant to conduct acts of sabotage. Grievous gathered the droids and ordered them to proceed. Grievous's units were successful in destroying the Coruscant power generators, and the peace movement was thwarted. Not long after, Grievous was in charge of a strike force directed at Mon Calamari, which the Republic halted at Iceberg III."}, {"tag": "h4", "text": "Skirmish on Naboo"}, {"tag": "p", "text": "Later in the war, Count Dooku and his agent, Minister Rish Loo, managed to bring Boss Lyonie under their control, alongside the Gungan Grand Army. Grievous soon arrived with with his troops to attack Naboo with the Gungans in support. After his landing craft arrived on Naboo, Naboo Representative Jar Jar Binks (posing as Boss Lyonie), along with Gungan General Roos Tarpals went to distract Grievous from launching his attack. At first Jar Jar was able to do this, but Grievous eventually saw through the trick and attempted to kill him. When the cyborg general chased Jar Jar out of the ship, Grievous saw that his droids had been deactivated and that an entire army of Gungans was waiting for him. Grievous refused the Gungans' offer of surrender and pulled out two of his lightsabers. Grievous then fought the Gungans, easily killing several them. When Tarpals attacked Grievous, the general fatally injured the aged Gungan by stabbing him in the chest. Unfortunately for the general, Tarpals, with the last of his strength, shocked Grievous into submission, enabling his capture. At first this was a success, but Dooku, at the behest of Darth Sidious, had trapped Jedi Knight Anakin Skywalker and contacted Senator Amidala to make a prisoner exchange. Thus Amidala gave Grievous up for Skywalker, and Grievous, restrained by Gungan technology was freed. Grievous and his force then left Naboo and war continued with him still in charge of the Confederate Droid Army."}, {"tag": "p", "text": "Shortly following the events on Naboo, General Grievous executed an attack on Jedi Master Adi Gallia's flagship. Grievous defeated her after boarding the Star Destroyer, and took her prisoner. Shortly after, Grievous encountered a pirate warship nearby. As his gunners fired on it for target practice, Jedi Master Plo Koon attacked Grievous' flagship, and rescued Master Gallia. Grievous escaped, though his flagship was lost."}, {"tag": "h4", "text": "Battle of Dathomir"}, {"tag": "p", "text": "Grievous was then ordered by Count Dooku to wipe Ventress, Mother Talzin and her fellow Nightsisters out on Dathomir. Grievous took a Separatist Fleet to Dathomir and landed his forces. Grievous commanded his forces from inside one of his landing ships. When his droids encountered fierce resistance on the eastern front. Therefore, Grievous decided to use Defoliator Tanks to burn the forest and wipe the witches out."}, {"tag": "p", "text": "After Ventress, the Nightsisters, and an undead army disabled the Defoliators and AATs, Grievous stepped out of his landing ship and accepted Ventress's challenge to single combat. If Ventress defeated Grievous, he and his forces would leave Dathomir, but if Grievous won the Nightsisters would surrender. The two warriors fought each other with their lightsabers. At first, Grievous appeared to have the upper hand and toyed with Ventress, until she surprised him by severing one of his four mechanical arms and knocking him down. Having never intended to honor the terms of their duel, and no longer amused by it, Grievous, laughing, turned the tables on Ventress by ordering his droids to kill her. This time Ventress was knocked to the ground after taking a blast to the shoulder. However, unlike Grievous a few moments prior, who had been far from defenseless and was quickly able to stand and fight, Ventress was wounded and nearly helpless. Grievous towered over Ventress, ready to finish her off, but she was saved when the Army of the Dead rushed Grievous, forcing him to fend off dozens of undead warriors as they set upon him like a flood. While Grievous was distracted, cutting down wave after wave of reanimated Nightsisters, Ventress made her escape."}, {"tag": "p", "text": "Grievous was then contacted by Count Dooku, who was being tortured by Mother Talzin's magic. Dooku ordered Grievous to follow the magic's green mist to Talzin and kill her before she killed him. After finishing off his undead attackers, Grievous and his droids followed the trail of mist, tearing through the Nightsisters' battle lines, slaughtering anyone who stood in their way. Grievous and his droids entered Talzin's village, and traced the mist directly to the cave where Talzin and Old Daka were performing their spells. As Grievous entered, he coldly executed Talzin's Nightsister guards and Old Daka. As he was about to kill Talzin, she seemingly turned into a cloud green smoke and disappeared. Nevertheless, Grievous was able to stop Talzin's spell over the Count. The battle turned into a genocidal massacre and was a near complete success for the Confederacy. When the smoke cleared, Grievous had successfully exterminated the entire coven of Nightsisters and prevented the loss of Count Dooku in the process."}, {"tag": "p", "text": "At some later point, Dooku informed Grievous of Savage Opress and his growing power. While Grievous was quick to dismiss this and scoffed at the idea that Opress could be considered a threat, Dooku apparently thought otherwise, warning Grievous that Opress posed a danger to anyone who crossed his path or was somehow mixed up in his past, including themselves."}, {"tag": "p", "text": "Despite his many victories, Grievous did also face several setbacks. His attempt to capture Anakin Skywalker on the starship Deyvus failed, as did an attack on the Gyndine Moon."}, {"tag": "h4", "text": "Invasion of Florrum"}, {"tag": "p", "text": "After forcing Obi-Wan Kenobi's remaining forces into a retreat after destroying a task group of Star Destroyers, Grievous next set his sights on the Florrum system, which he successfully conquered. Following orders from Dooku, Grievous and his forces landed on the system's namesake planet where the infamous pirate, Hondo Ohnaka, and his gang resided. Grievous forcibly took Ohnaka's base as retribution for previously holding Dooku to ransom. Unbeknownst to Grievous, however, several of Ohnaka's men had been dispatched earlier to capture Jedi Padawan Ahsoka Tano and six Jedi younglings. With the threat of Grievous standing before them, the pirates and Jedi agreed to a temporary alliance. Together they managed to free Ohnaka from captivity and hastily made their way towards the pirate captain's secret cache of stolen and foraged starships, with Grievous in close pursuit. In the midst of the chase, Tano and some of the younglings were separated from their group and confronted by Grievous. As the general cornered his prey, Ohnaka and the others arrived on the scene with a red and green Firespray starship. The younglings managed to board the ship while Tano kept Grievous occupied in a heated duel. Although the Padawan proved herself to be a much more formidable foe than she was during her first encounter with the general, she was still hopelessly outmatched. However, Tano survived long enough to ensure the younglings' safety and narrowly escaped Grievous to join them aboard the starship. Ohnaka used the ship's guns to fire on Grievous but the general was saved by the timely intervention of several AAT's which forced Ohnaka and the Jedi to flee."}, {"tag": "p", "text": "Grievous and his forces demolished Ohnaka's base and left Florrum at some point afterwards."}, {"tag": "h4", "text": "Victorious on all fronts"}, {"tag": "p", "text": "Grievous led the CIS to victories on Banvhar Station and Vandos, among numerous other battles, such as the Battle of Parein II 4, where Jedi Master Sannen was killed. He also helped convince the skilled Togorian warriors to defect to the Confederacy. When the Republic, led by General Waldan Bridger, arrived at Togoria, they were attacked by the people, who wished to remain with the CIS. Grievous challenged Bridger to a duel, killing him in seconds, and kept the planet from the Republic. However, the general was not invincible. The reinforcements he sent Rendili Separatists during the Battle of Rendili were defeated by the combined forces of the Republic and the Rendili Fleet. He also failed to destroy the mines on Viidaav during one battle, and had a number of other defeats throughout the war."}, {"tag": "p", "text": "Months later, Grievous put into motion Operation Durge's Lance, a major Separatist campaign whose goal was the complete conquest of the Core Worlds. Hundreds of planets along the Corellian Trade Spine fell before his forces, including the major world of Duro whose defeat Grievous personally supervised, and forced a public surrender from Hoolidan Keggle in a galaxy-wide HoloNet transmission. Grievous was also responsible for the hour-long orbital bombardment of the heavily populated and urbanized planet Humbarine, one of the founding members of the Galactic Republic, which resulted in the fragmentation of the planet's crust. During the Battle of Loedorvia, he released the Loedorvian Brain Plague into the Weemell sector, which destroyed Republic armies and nearly all Humans on the planet. Due to these acts of wanton destruction, Grievous soon became an avatar of terror in the eyes of the citizens of the Republic, as he won battle after battle."}, {"tag": "p", "text": "In 20 BBY, Grievous baited the Republic forces to Vandos by kidnapping Ambassador Quiyyen. Jedi Knights T'chooka D'oon and Jmmaar sent to rescue Quiyyen were killed in the assault, though the Republic was successful in securing the ambassador. T'chooka's Padawan, Flynn Kybo, was infuriated by this, and, desperate for revenge, gathered a group of other Jedi, including B'dard Tone and Codi Ty, to take revenge on Grievous, something the Jedi High Council disapproved of. During their hunt for him, Grievous captured a Mon Calamari ship, and killed Jedi Master Quarmall and several of his younglings aboard, but also took some hostage. He planned to use them as Human-droid hybrids, with an exoskeleton droid suit, similar to himself. After Grievous conquered Gentes, several probe droids released by the group of Jedi led by Kybo, located him on Belsus. The Jedi were now determined to rescue the younglings and Padawans he was holding hostage, having learned of them with help from the slicer Rini. Though the probe droids attacked him, the cyborg had no trouble destroying them, and thus nothing was accomplished besides alerting their interest in him to the general. With help from an Ugnaught, the Padawans escaped, but Grievous pursued them. He confronted them, but at that moment the Jedi arrived. While Codi led them to safety, Grievous dueled B'dard and Flynn, killing them both after Kybo cut open a gas line, causing a large explosion.\nSome time afterward, Grievous proposed that the Confederacy increase its use of bioweapons in attacks on worlds in the Outer Rim, after seeing the results of the devastation caused by them during the Battle of Honoghr. He sent pictures of Honoghr taken six months after the battle to Vjun to be reviewed by Dooku. After Dooku was forced to leave Vjun, Grievous scheduled a meeting with him. Several months later, on Boz Pity, Grievous led a droid army in opposition to Jedi-led Republic forces that had arrived there. The cyborg general dueled Jedi Master Soon Bayts, surprising the Jedi and crushing his head in his claws before Bayts had time to raise his lightsaber. Grievous then took his lightsaber, using it to combat the clone troopers. Jedi Master Mace Windu arrived at this moment, and, using the Force, smashed a STAP on top of him. Grievous was knocked unconscious but was later rescued by his bodyguards, who took him to escape the planet with Count Dooku."}, {"tag": "p", "text": "During the Battle of Xagobah, Grievous confronted the young bounty hunter Boba Fett, who was on one of his first missions. After the Republic attacked Wat Tambor's fortress, Fett had taken advantage of the chaos to try and collect on a bounty placed on Tambor's head by Jabba the Hutt. He infiltrated the fortress and attacked Tambor, who shot back at him, and called Grievous to help him. The general left the main battle and entered Tambor's private room, where he attacked Fett, despite the young clone pretending to be Durge with the help of a holoshroud. He easily defeated the boy and almost killed him, as Fett survived only by faking death. Grievous then retreated from the planet with Wat Tambor and Asajj Ventress before the Republic's clone troopers burst through the citadel."}, {"tag": "p", "text": "Grievous' hatred of Nute Gunray intensified after several incidents. First, the Viceroy insisted on going back to Cato Neimoidia to recover some of his valuables, allowing Republic forces to follow him to a meeting place, where Grievous was forced to kill the clone pilots pursuing the Neimoidian's ship to save Gunray, though he would have preferred to let them capture the Neimoidian, and allowed them to inflict minor damage on Gunray's shuttle before destroying his pursuers. Later, Gunray lost his mechno-chair, allowing the Republic to learn that Grievous intended to capture Belderone. Grievous led the Separatist fleet into an ambush by a group of Republic warships there before ultimately fleeing. Though he killed 27 Jedi in the ensuing battle, Grievous was furious at someone for allowing the Republic to learn of this, and he suspected Gunray was to blame. He confronted Gunray, who revealed that the Republic must have found his mechno-chair after he had left it on Cato Neimoidia by accident. Grievous threatened him, but stopped short of actually physically harming him."}, {"tag": "h3", "text": "Endgame"}, {"tag": "p", "text": "After learning that the Jedi were onto him, thanks in part to the recordings discovered from the mechno-chair, Darth Sidious, who was actually Chancellor Palpatine, informed Grievous that he had a special mission—to invade Coruscant and kidnap the Chancellor. Grievous was on the Wookiee homeworld of Kashyyyk, leading the Separatists in the opening stages of the battle there, but left for Coruscant. Grievous led the Confederacy starfleet in an all-out attack on the Republic capital, using secret hyperspace routes given to him by Sidious. During the battle, Grievous ordered diversionary tactics, such as sending suicide squadrons of Vulture droids to cause chaos in the city and to terrorize the citizens. While a massive battle raged between Separatist and Republic forces, Grievous led an assault on 500 Republica with intelligence provided by Darth Sidious. During Grievous' search for Palpatine on the surface, he encountered X2, a Force-sensitive clone who served the Republic. They fought each other, but Grievous was unable to defeat the clone, so he left to continue his mission."}, {"tag": "p", "text": "The Jedi, commanded by Shaak Ti, took Palpatine to a secret bunker aboard a maglev train; however, Grievous and his MagnaGuards caught up with them and dueled the Jedi Mace Windu and Kit Fisto on top of the train. The duel ended with Grievous being pushed off the train, although he was saved by a hijacked LAAT/i gunship, unknown to the Jedi. Grievous reached the hardened bunker with six of his MagnaGuards in tow, and accessed it using codes provided by Darth Sidious. Cutting a bloody path of destruction through the bunker, he made his way to Palpatine. He quickly killed four of Palpatine's Jedi protectors: Roron Corobb, Foul Moudama, Roth-Del Masona, and B'ink Utrila, as well as a number of clone troopers before kidnapping the Chancellor. With no threat to him, Grievous threatened Palpatine, who rebuked that he wasn't afraid of the Separatist General. Palpatine asserted that Grievous wouldn't dare harm him and inquired what his masters' would say if any harm came to him. Grievous told Palpatine that he was lucky they wanted him alive, not realizing that Palpatine was one of them. He then dueled Shaak Ti and spared her to inform the Jedi that the Chancellor was gone. As he fled, Jedi Master Mace Windu Force crushed the plates covering Grievous's internal organ sac, causing the duranium steel to cut his lungs, which aggravated the General's already irritating wheezing and coughing problems; a result of his organic form not taking well to his cyborg implants. This crippling blow injured Grievous for the rest of his life—which would not be long."}, {"tag": "p", "text": "Anakin Skywalker and Obi-Wan Kenobi, fresh from a victory on Tythe, got wind of what had happened and set off to rescue Palpatine. After fighting their way through the massive battle, the Jedi boarded the Invisible Hand, killed Dooku, and escaped with the Supreme Chancellor, not knowing that they had walked into an elaborate trap. The two Jedi were soon entrapped in a ray shield and surrounded by droids who brought them before Grievous on the Invisible Hand's bridge. As Grievous gloated, the Jedi managed to un-cuff themselves while R2-D2 provided a distraction. Skywalker and Kenobi then swiftly defeated Grievous's IG-100 MagnaGuards. In an attempt to escape the deteriorating ship and leave the Jedi to die, Grievous shattered the front window of the cruiser with the IG-102's electrostaff. Kenobi, Skywalker, and the Chancellor managed to stay in the ship, but Grievous was sucked into space. Protected from exposure to vacuum, the general survived and used a grappling hook installed in his arm to latch onto the hull of the ship."}, {"tag": "p", "text": "Grievous fled in one of his flagship's escape pods, which was later picked up by a Lucrehulk-class battleship. In fact, he had every single escape pod launched, leaving the Jedi and Palpatine stranded aboard the collapsing Invisible Hand; yet Skywalker used all his skill to bring half the ship down the planet's surface for a safe landing. Realizing that his objective had failed, the cyborg general and his fleet retreated. Grievous boarded his Sheathipede-class transport shuttle and headed for the secured planet of Utapau in the Outer Rim Territories, where the Separatist Council was hiding. He had previously used Utapau as a base as early as 21 BBY, but unbeknownst to him, he was being monitored there by Clone Intelligence units. Now that Grievous was there again, the Null-class Advanced Recon Commandos N-6 and N-10 reported this, and Grievous's presence on Utapau became known by the Republic."}, {"tag": "p", "text": "With Count Dooku's death, Grievous succeeded him as Head of State of the Confederacy of Independent Systems - thus making him both political and military leader of the Separatists. Under the direct order of Dooku's Master, Darth Sidious, Grievous relocated the Council to the planet Mustafar while he stayed on Utapau, waiting for the arrival of Kenobi, of which he had been warned by Sidious. When receiving his orders, he briefly protested when learning that the Clone Wars were going to end soon and that the Separatists would most likely lose due to Dooku's loss, although Sidious reassured him that the former Separatist leader's loss was \"necessary.\" The Sith Lord would soon have a new apprentice: \"one far younger and more powerful.\""}, {"tag": "h4", "text": "Death"}, {"tag": "p", "text": "After the Republic received word that Grievous was hiding on Utapau, General Kenobi was sent to defeat him. Though Nute Gunray and the other Council members doubted Grievous' ability to lead, they followed his orders, leaving just moments before Kenobi's arrival."}, {"tag": "p", "text": "Still weak and injured from his encounter with Windu, he immediately split his arms in four and attacked the Jedi Master, also ordering the other droids present to not interfere on his behalf, as he wanted to deal with the Jedi personally. During the duel, Grievous' craven reflexes kicked in. His inability to penetrate Kenobi's Form III defense even when attacking him at a rate of twenty strikes per second made his offense grow sloppy. Kenobi took advantage of this and altered the angle of his parries to sever Grievous' wrists. Grievous lost two of his hands to Kenobi before Clone Marshal Commander Cody and the 212th Attack Battalion arrived, ambushing the droid army. Fighting broke out all over Pau City between droid and clone forces."}, {"tag": "p", "text": "Grievous fled on his wheel bike, surprised and angered by Obi-Wan's ability to fight and gain an advantage in a one-on-one battle. Pursued by Obi-Wan on a varactyl named Boga, after a prolonged chase and running duel, the two crashed onto Grievous' private landing platform where his personal, customized starfighter, the Soulless One, was docked. As they fought hand-to-hand, Grievous made use of his mechanical body and superior strength, although Kenobi managed to rip open Grievous' previously damaged chest plates, revealing the synthskin gut-sack containing his remaining organs. Angered, Grievous tossed Kenobi off the platform, but the Jedi managed to catch hold of the edge."}, {"tag": "p", "text": "Grievous, deprived of most of his arsenal, picked up the electrostaff and charged at Kenobi, raising the staff to finish him off. Before he could deliver the killing blow, however, Kenobi used the Force to summon Grievous's personal blaster to his outstretched hand. He fired five bolts between the gap in Grievous' chest plate into the general's gut-sack. The oils preserving Grievous' remaining biological components ignited, incinerating the famed cyborg from the inside and destroying him. Listen to Grievous's death cry (help·info)"}, {"tag": "h3", "text": "A partial rebirth"}, {"tag": "p", "text": "Following the Declaration of a New Order, clone troopers recovered Grievous's body, transporting it and his captured starfighter to one of Emperor Palpatine's secret storehouses on Utapau. There, it would remain to collect dust for years, until the cyberneticist Nycolai Kinesworthy used the body of the general for the N-K Project, to create the highly advanced droid N-K Necrosis."}, {"tag": "p", "text": "This war droid enjoyed a brief life in the Myyydril Caverns on Kashyyyk, before being destroyed by an anonymous group of spacers. The combatants looted the droid's remains, taking its weaponry and anything else they deemed valuable."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The cyborg's face mask ended up on the Invisible Market after N-K Necrosis's demise, where it would be purchased for its artistic properties by a high-ranking Imperial admiral—purported to be none other than Grand Admiral Thrawn. As of 25 ABY, at the start of the Yuuzhan Vong War, Grievous had entered into his species' religious pantheon and was worshiped as a deity on Kalee, with a temple built in his honor. He was remembered by the citizens of the wider galaxy as General Grievous, a brilliant commander and a merciless enemy."}, {"tag": "p", "text": "Additionally, two cyborg models named the Terror Trooper and the Terror Biodroids appeared to be based on Grievous."}, {"tag": "p", "text": "At some point after Grievous' death, he was featured in the painting Utapau Surrenders, which depicted the Confederacy's takeover of the planet during the war."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Grievous was a cold, ruthless being. Even as a Kaleesh warlord, he displayed no mercy toward his enemies, a notable example being his brutal counter-offensive against the Huk when they attempted to enslave Kalee. Grievous fought boldly, pushing them back and showing no remorse for the slaughter he caused. When the Jedi interfered, Grievous developed a great hatred for them, and the Republic in general. After his shuttle crash, Grievous was left bitter and felt cheated, having been robbed of a proper warrior's death. When he was offered a chance at continued existence as a cyborg, he took the offer, as he had come to see flesh as weak. However, despite this viewpoint, he remained secretly ashamed of his new robotic body. Though he did not know it, his brain had been tampered with during his reconstruction by the Geonosians, increasing his anger and hatred. After the crash, Grievous also began to compare himself with the Jedi and became determined to equal them. To this end, he constantly submitted himself to improvements to boost himself up to their caliber. Although he initially took Dooku's bestowing of the title \"Supreme Commander of the Droid Armies\" title as a personal insult, Grievous came to highly respect both Dooku and Darth Sidious, considering them the Separatists' only \"necessary\" political leadership."}, {"tag": "p", "text": "On the battlefield, Grievous was an excellent commander and an ingenious tactician, fighting hard to bring down the Republic. He had no qualms with sacrificing civilians to ensure his own survival and exploited the Jedi's compassion for the clone troopers under their command, exemplified during his attack on the Kaliida Shoals Medical Center. He also showed signs of being sadistic, as he seemed to enjoy killing and torturing his foes. Indeed, he even took pleasure in attacking the planet Dorin and its Republic-loyal citizens, believing that they should suffer the consequences for staying loyal to the Republic. His acts of wanton destruction during the war caused him to become an avatar of terror in the eyes of the Republic populace. However, despite these traits—or rather, because of them—Grievous was arrogant. His hubris eventually led to his death at the hands of Obi-Wan Kenobi. In addition to his arrogance, Grievous was also accused of being cowardly, as he usually fled whenever the tide turned against him. Despite injuries dealt to him over the course of his career, Grievous always insisted on fighting the Jedi personally when possible, displaying a mild form of recklessness as well as restlessness. This was displayed by refusing to heed EV-A4D's advice to recuperate after his first bout with Kit Fisto and Nahdar Vebb, as well as desiring to fight Kenobi alone on Utapau while still in his coughing fits. Grievous also showed almost no compassion to even his own allies, as demonstrated during the Battle of Coruscant, where he smashed the Invisible Hand's Neimoidian senior gunnery officer's face with his fist when the latter protested that the ship's turbolaser batteries were reaching critical failure when ordered to fire, and subsequently replaced him with another Neimoidian."}, {"tag": "p", "text": "One of Grievous' most defining features was a complete and utter hatred for the Jedi, and the Republic with them. He blamed them for the suffering of his people and homeworld, believing that they were willfully ignorant of the Huk's pillaging. His hatred increased further when the Republic - with the Jedi's enforcement - levied harsh economic sanctions against Kalee, driving countless Kaleesh to starvation, and that they believed the Huk's lies about the war. After his transformation into a cyborg, his hatred was artificially enhanced. This went to such a level that he made it his entire purpose in the war to kill Jedi, in what he believed to be just retribution from their crimes against Kalee. By contrast, he had considered the Sith as \"the only warriors worthy of [his] respect.\""}, {"tag": "p", "text": "Though Grievous demonstrated incredible brutality and a singular lack of mercy or compassion toward his enemies, he was not completely heartless and did show empathy for a select few. Grievous cared deeply for his people, and fought long and hard to save them from the Huk, and later avenge their mistreatment. In particular, he had feelings for Ronderu lij Kummar. The two were very close, and after her death, Grievous was left distraught and angry. After this his rage only intensified and he became desperate to crush the Huk, if for no other reason than to honor her memory. Though he remarried several times, none of his wives could fill the void Kummar had left."}, {"tag": "p", "text": "Even after his reconstruction as a cyborg, Grievous was not completely emotionless. He was extremely loyal to Count Dooku and Darth Sidious, and even went so far as to display pity toward a few Jedi, allowing B'ink Utrila, one such Jedi, to score a few minor hits on him before killing her. When he did, he took care not to mutilate her body. He also showed a certain amount of attachment to Gor, his pet roggwart, whom he doted on while housing at his lair on the third moon of Vassek. Grievous was visibly angered when Kit Fisto killed Gor, citing it as another crime for which the Jedi Order would pay dearly. He also seemed to have a kind of bond with his caregiver droid EV-A4D: though Grievous did snap or shout at him from time to time, he allowed the medical droid to criticize and even insult him without tearing him apart, as he would with any other droid in a similar situation."}, {"tag": "p", "text": "Grievous despised Nute Gunray with particular passion, although the feeling was mutual. Their relationship had an extremely rocky start when Gunray, who was used to treating droids as utterly disposable and insignificant, treated Grievous as just another in a long line of command drones. Grievous, already humiliated due to his resurrection as a cyborg, absolutely hated being referred to as a droid, and as he later would often lapsed into a violent rage when Gunray referred to him as such. The general saw Gunray as foolish, weak, and arrogant, and often secretly hoped that either Dooku or Sidious would give him leave to kill the Neimoidian. Gunray, in turn, continued to hold the view that Grievous was a servant droid, and even displayed the audacity to stand up to the General and question his orders, though he frequently backed down when the cyborg started resorting to death threats. Grievous also disliked Gunray's long-time associate Rune Haako and the other Separatist Council members, considering them greedy and disgusting."}, {"tag": "p", "text": "Although a natural rival with Asajj Ventress for Count Dooku's attention, Grievous seemed to have a level of respect for her, which at the time of the Battle of Kamino seemed to have evolved into something close to affection. This had drastically changed by the time of the Battle of Dathomir, in which he displayed hatred for her and openly declared himself to have always been superior to her during their duel. However, the two shared a similar trait during their time as Dooku's lieutenants: a dislike and contempt for the mindless battle droids under their command. Finding them weak and stupid and going so far as to call them useless, they became frequent targets for Grievous' frustration. Often he would destroy units either out of rage, for subpar performance, or merely to set an example, something for which he was criticized by Dooku. Grievous made a rare exception for his IG-100 MagnaGuards, whom he personally trained with and garbed in cloaks reminiscent of those found amongst his people."}, {"tag": "h2", "text": "Talents and abilities"}, {"tag": "p", "text": "Grievous was a cold and calculating general, a brilliant strategist, and a powerful fighter. He was known as one of the greatest Jedi hunters and a collector of the lightsabers of fallen Jedi, which he used in battle with his foes. Grievous hunted Jedi for sport, keeping the four lightsabers of his most powerful victims within his cloak as trophies of his superiority. Trained in lightsaber combat by Dooku, he developed a personalized unorthodox fighting form, involving prolonged lightning-fast flurries and power moves designed to overwhelm his enemies. However, his lack of finesse frustrated Dooku. Each of his six-fingered arms could split lengthwise in two, thus giving Grievous the ability to use four limbs, each armed with a lightsaber. Able to spin these arms in a whirling storm of deadly lacerating light that few could withstand, he could attack with as many as 20 strikes per second, enough to overwhelm most Jedi defenses. He was also able to spin his torso and his wrists in a 360 degree motion at extremely fast speeds continuously, effectively becoming a lightsaber buzz-saw. In addition to this, Grievous had repulsorlifts built into his legs, allowing his feet to double as hands. This would allow him to wield six lightsabers all at once. His mechanical enhancements gave him an edge in close-quarter combat, enabling him to battle and hold his own against several Jedi simultaneously."}, {"tag": "p", "text": "Grievous killed dozens of Jedi, from Padawans to Masters, including Roron Corobb, Soon Baytes, Foul Moudama, Pablo-Jill, and Nahdar Vebb, collecting the lightsabers of those he killed. Aside from the Jedi he personally defeated, Grievous's collection was known to include lightsabers belonging to at least five beings he did not personally kill, including K'Kruhk, Sifo-Dyas, and Darth Zannah. Grievous also had a tendency to use unorthodox and underhanded methods in order to win a lightsaber duel; for example, against Nahdar Vebb he used a blaster to kill him while Vebb was defending himself from his lightsabers; and against Eeth Koth, he used his MagnaGuard to shock the Jedi Councilor into submission, since the objective had been to take him alive. His lightsaber combat skills were such that he could duel even Mace Windu evenly despite having limited movement and only using two lightsabers. He could also analyze most of his opponents' attacks and respond in kind due to the advanced combat algorithms in his brain; he was even able to calculate a response to Windu's powerful Vaapad style during their one-on-one showdown on Coruscant."}, {"tag": "p", "text": "Grievous was a skilled tactician and a brutal enemy. He utilized chaotic battle strategies that appeared random, but in fact were carefully calculated to encourage misconceptions. Grievous singled out civilian targets during battles, forcing his enemies to choose between winning the battle or saving lives, a tactic long practiced by the Sith. However, he was arrogant, and sometimes underestimated his enemies. Nonetheless, the cyborg was considered a military genius by many, though some argued that he lacked subtlety. He also had an advantage in that he could directly control his droid armies using the two antennae built into his head, giving him extra control in battle."}, {"tag": "p", "text": "Grievous' mechanical body allowed him to survive in the vacuum of space, and he was also known as a gifted pilot. Mace Windu believed that he was \"almost as adept at handling a ship as he was a lightsaber.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Development and design"}, {"tag": "p", "text": "Grievous was developed for Revenge of the Sith as a powerful new villain on the side of the Confederacy. Director George Lucas's initial instructions for the Art Department were simply to create \"a droid general.\" From there, the artists developed many different looks for Grievous, some purely mechanical and others more organic. One of the early concepts for Grievous was a small child sitting on a floating chair, guarded by two IG-88 droids from Star Wars: Episode V The Empire Strikes Back. George Lucas rejected this look as a child would not be taken seriously as the deadliest hand to hand fighter the galaxy has seen, which is how he wanted Grievous to be portrayed.[source?] Another early concept design featured Grievous as \"a disembodied alien head, trailing a number of prehensile tentacles\". Eventually, the final look for General Grievous' face was inspired by the shape of a bathroom detergent spray nozzle. The initial design for Grievous was done by Warren Fu. That sketch was refined and made into a foot-tall maquette sculpture, which was later made in to a computer-generated model by Industrial Light & Magic. The character's name comes from the word grievous, which means \"causing great sorrow.\""}, {"tag": "p", "text": "The model of General Grievous was one of the most complicated models ever created by Industrial Light & Magic. Grievous is completely computer-generated imagery in the movie. On set, Duncan Young read the lines off-screen, while Kyle Rowling wore a bluescreen or a greenscreen suit to act out the fights with Obi-Wan Kenobi."}, {"tag": "p", "text": "In the audio commentary for Clone Wars Volume II, it is revealed that the inspiration for Grievous's fighting style came from more exotic martial arts such as capoeira."}, {"tag": "p", "text": "The outer color of Grievous's cloak clearly underwent last-minute change. Promotional art, many comic books, the animated series, and action figures all featured a bright white cape with a red interior right up to the release of Revenge of the Sith. The film, however, depicts Grievous's cape to have a very dark gray outer side. It is noteworthy that even two shots of the finished film itself still retain the uncorrected garment: first, when the distant Grievous is stalking along the exterior of Invisible Hand and drops into an escape pod; and then in the following shot in which the General descends through the hatch with his cloak billowing out behind his head. A recent Hasbro Inc. action figure, essentially a repainted reissue of an earlier sculpt, has featured the \"corrected\" dark gray cloak."}, {"tag": "p", "text": "The reason for Grievous's cough actually is more complicated than the initial reason planned during production of the film. During the production of Revenge of the Sith, George Lucas came into work one day with a cough, and decided that it would be amusing to record it and use it on the new Episode III villain. In-universe, the initial reason for the cough was that cybernetic technology wasn't advanced enough at the time. Another reason was given in Star Wars: Clone Wars Volume Two, where Mace Windu crushed Grievous's chest with the Force, and Grievous coughs after the attack. The reason for the cough is a source of great confusion for fans, as either the cough or Grievous's damaged chest were presented in several different Expanded Universe sources. A likely solution is that the cough was always present, as a result of the cybernetic technology used to recreate Grievous being not advanced enough. It then simply grew worse and more frequent, culminating with Windu's strike, which intensified Grievous's cough even more. In the 2007 History Channel program Star Wars: The Legacy Revealed, Grievous animator Rob Coleman revealed that Lucas and his team originally viewed Grievous' cough as a result of a prototype technology that the Vader suit would be the perfection of. The cough also foreshadows the trademark breathing of Darth Vader."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "Grievous first appeared in \"Chapter 20\" of the Star Wars: Clone Wars series, which is set in 21 BBY. It was revealed in that episode (and later mentioned in Labyrinth of Evil) that an unknown foe had been killing Jedi since the beginning of the war, and the Jedi were at a loss as to who was responsible. The series developers originally planned to have Anakin and Obi-Wan fight a regenerated Durge, but George Lucas told them he wanted to introduce a new villain, General Grievous. His backstory was later expanded through novels, comics, and the short stories like The Story of General Grievous: Lord of War and Unknown Soldier: The Story of General Grievous by Abel G. Peña."}, {"tag": "p", "text": "In the Star Wars: Clone Wars animated series, the character was voiced by John William DiMaggio (\"Chapter 20\") and Richard McGonagle (Chapters 21-25); for Revenge of the Sith, the Revenge of the Sith video game, and Star Wars: Battlefront II, he was voiced by Matthew Wood. With Wood's portrayal, Grievous has a stereotypical heavy Russian accent. Wood was also inspired by Béla Lugosi's acting. The character was initially going to be voiced in Revenge of the Sith by actor Gary Oldman; however, he later learned that he was unable to do so, as the movie was being made outside of the Screen Actors Guild, of which he is a member. Grievous is voiced by Matthew Wood in the Star Wars: The Clone Wars TV series, unlike the original series."}, {"tag": "h3", "text": "Contradictions"}, {"tag": "h4", "text": "Clone Wars and The Clone Wars"}, {"tag": "p", "text": "Various contradictions surround Grievous, particularly between the novel Labyrinth of Evil and Clone Wars, and the Star Wars: The Clone Wars TV series and the rest of established canon. In Labyrinth of Evil, Grievous kills the Jedi defending Palpatine quickly, while in the cartoon, he goes on a long chase before finally killing them and capturing the Chancellor. The main contradictions between the animated show and the novel are in regard to the Battle of Coruscant, such as how long the chase lasted. This article attempts to keep it ambiguous when possible, and uses the Labyrinth of Evil description while trying to avoid as many contradictions as possible."}, {"tag": "p", "text": "The 2008 CGI TV show The Clone Wars, as previously mentioned, contradicts much of canon that takes place in or around the Clone Wars. Things pertinent to Grievous include his backstory, as The Clone Wars claims that Grievous wanted to become a Jedi, although he wasn't Force-sensitive, and so chose to have surgery on himself to become a Jedi. This article attempts to incorporate information from The Clone Wars while contradicting as little as possible from the original sources. Following the completion of this series, it is expected that Lucasfilm Ltd.'s Leland Chee will clarify the canonicity of various sources. Until then, confusion remains."}, {"tag": "p", "text": "In the episode \"Lair of Grievous,\" Grievous says that he chose to have himself modified. Dave Filoni, supervising director of the series, says that George Lucas had his own ideas about Grievous's backstory, and that Grievous wanted to become a Jedi, but was unable to because he was not Force-sensitive. However, Filoni has stated that he does not wish to eliminate the shuttle crash story, because he respects the Expanded Universe. Thus, it is left somewhat ambiguous, as it could be interpreted that Grievous simply chose to accept San Hill's offer to become a cyborg rather than die, or that he had chosen to undergo surgery that would give him abilities like those of the Jedi when he was a completely healthy Kaleesh, before the shuttle crash made surgery a necessity. Certain Target products support the claim that Grievous chose to undergo surgery so that he would gain Jedi powers. Because no canonical sources explicitly contradict the original backstory, and some sources released after the 2008 The Clone Wars project was first released corroborate it, this article assumes that the original information is correct."}, {"tag": "p", "text": "In The Clone Wars, Grievous is depicted as having four fingers, instead of six. The Crystal Crisis animation reels depict Grievous with six fingers, suggesting that his body may have received changes. Likewise, in the original Clone Wars series, he had five fingers for most of the series. During the last portions of the series, he was shown to still have five fingers, but when splitting his arms into four, his middle finger would split in half, essentially giving him three fingers on each extended arm."}, {"tag": "p", "text": "As the book The Lost Legion is a Decide Your Destiny book that lacks an established canonical path, Grievous's appearance in the book is unconfirmed and ambiguous. If the reader—from the perspective of clone trooper 18—chooses the role of clone trooper medic, sergeant, or demolitions expert, Grievous will not be included in the storyline. It is only if the reader is assigned to perform reconnaissance on Ando Prime that the general will participate in the plot of the story. If the reader chooses to follow Grievous's droid squad instead of contacting Commander Vargus first, the general's forces will defeat and capture the clone troopers. Should Vargus be contacted, the reconnaissance squad will receive reinforcements and defeat Grievous's own droid forces, and the general will flee. Until a canonical path for the book is established, this article assumes that the latter path is correct."}, {"tag": "h4", "text": "Video game scenarios"}, {"tag": "p", "text": "Grievous was also featured in the Nintendo DS edition of the 2009 video game Star Wars: The Clone Wars: Republic Heroes. The game's storyline, however, is rather confusing and contradicts The Clone Wars series. In the game, Grievous purchases an expensive EG droid, EG-07, which he uses for secret operations beyond the knowledge of the Separatist army during the war. Grievous also learns about a powerful ancient superweapon capable of releasing a deadly virus, which is located somewhere on Mustafar. With its help, Grievous plans to rebel against Dooku (being angry about the \"test\" on Vassek's third moon) and conquer the galaxy all by himself. To this end, he dispatches EG-07 to find the weapon, and the latter locates it beneath an ocean of lava, where it was hidden by the Jedi of the old times. EG-07 reports to Grievous on the progress of its mission, but their transmission is intercepted by R2-D2 on Skytop Station, although this transmission does not reveal the name of the planet Grievous and his droid talk about. After R2 is rescued, the Jedi learn about Grievous's plans, while the General himself is forced to use his own spare parts to repair EG-07, which has suffered serious damage during its mission on Mustafar."}, {"tag": "p", "text": "As Grievous drills to the core of the planet to uncover the superweapon and places a battlesphere similar to Skytop Station above Mustafar, the Jedi start their investigation. They first dispatch Master Luminara Unduli and Commander CC-1004 to steal Separatist recognition codes from an archive in Grievous's castle on Vassek's third moon, which Grievous left after his encounter with Kit Fisto. Using the stolen codes, the Jedi infiltrate the Separatist-controlled space station Juma 9 and use the station's scanners to locate the superweapon on Mustafar. Meanwhile, Grievous finds the weapon and prepares to use the battlestation's superlasers to charge it up, so it can fire and spread the deadly virus which will destroy all population in the system. Having learned of Grievous's intentions, the Jedi dispatch Skywalker, Tano, Fisto and Commander Cody to prevent the battlestation's lasers from charging the weapon, but the strike team is delayed by EG-07 long enough for Grievous's plans to come to fruition."}, {"tag": "p", "text": "As a last resort, Mace Windu and Yoda are sent to Mustafar to stop the droid general. Grievous duels Windu and loses, while Yoda manages to deactivate the weapon. Nevertheless, Grievous escapes and is contacted by Dooku, who has learned of his treachery from Skywalker during their confrontation on the planet Christophsis. The Count tells Grievous that he is going to forgive him as Grievous's actions provided a distraction needed for Dooku to continue the development of another superweapon on the planet Behpour. The second superweapon—the Gravitic polarization beam—and the Republic attempt to stop the Separatists from using it are the main plot points in all other versions of Republic Heroes."}, {"tag": "p", "text": "Grievous was also featured in the video game Star Wars Battlefront: Elite Squadron for the PlayStation Portable and the Nintendo DS. The two versions of the game are very different in their portrayal of the Battle of Coruscant. This article currently describes the events as depicted in the Nintendo DS version. In the PSP edition, Grievous and his MagnaGuards face off against X2 and Mace Windu in the Senate Building, and the General retreats after a brief battle."}, {"tag": "h4", "text": "Backstory"}, {"tag": "p", "text": "Similarly, there was also a contradiction in terms of backstory. One backstory account dealt with his losing his family in the war and being blown up by the Separatists while blaming it on the Republic, and the other was his being a failed force-sensitive and cast aside his humanity (or, in this case, his \"Kaleesh-ity\") to become a cyborg. Jason Fry revealed in the endnotes for The Essential Guide to Warfare that he felt reconciling the differences would have been a cop-out, so he deliberately kept the backstory ambiguous, giving the in-universe explanation of conflicts between historians. In the third issue of the Official Star Wars Fact File remake series, the most recent source pertaining to Grievous' early history, the General's rebuilding by the Separatists after surviving an \"assassination attempt\" was confirmed."}, {"tag": "h3", "text": "Non-canon storylines"}, {"tag": "h4", "text": "Infinities"}, {"tag": "p", "text": "In an Infinities storyline, during the Battle of Kamino, Obi-Wan went after Asajj Ventress while Anakin went after Grievous. Obi-Wan removed Ventress's arm and Force-pushes her other lightsaber away, then having his ARC troopers arrest her. Meanwhile, Anakin dueled Grievous, but found himself unable to make much headway with Grievous's four-spinning arms, and was knocked to the floor. Grievous laughed, and beared over him, and Anakin unleashed his rage, driving the General back and removing all his limbs. Grievous was captured and imprisoned in a low level of Coruscant, while Ventress is kept away as well, and only time would tell if she knew the identity of the second Sith."}, {"tag": "h4", "text": "Dark Jedi"}, {"tag": "p", "text": "At some time after his transformation, Grievous learned that the Dark Jedi Kaa and Lii had stolen his collection of Sith lightsabers. Aware of the Dark Jedi's destination, Grievous piloted his personal craft to the acidic world of Dica. After landing his ship, Grievous spotted the Dark Jedi and confronted one of the twin sisters. When he commanded she reveal her name, her sister appeared and engaged Grievous. Fighting together, the twins were able to sever a part of Grievous's mask and take the upper hand. However, Grievous remained confident and was able to knock the twins' lightsabers out of their hands. Much to his anger, however, the weapons landed in an acid lake. Disarmed and outgunned, the sisters quickly retreated. With Grievous' lightsaber collection now destroyed, he resolved to restart the collection, vowing he would now collect Jedi lightsabers."}, {"tag": "h3", "text": "Non-canon duel"}, {"tag": "p", "text": "In the Star Wars: Head-to-Head book, General Grievous is paired up in a hypothetical duel with Emperor Palpatine, his special move being a Four-armed whirlwind with lightsabers. The outcome is Palpatine, cackling, unleashes a torrent of Force lightning, which immobilizes the general. Then, Palpatine uses the Force to crush his gutsack, killing the General."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}