{"url": "Almak/Legends", "categories": ["Category:Legends articles", "Category:Almak sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Almak"}, {"tag": "p", "text": "Almak was a terrestrial world located in the Almak system, a part of the Mid Rim's Almak sector. It was the homeworld of the sentient Leffingite species and shared its name with the fruit known as the Almakian apple."}, {"tag": "p", "text": "The Leffingite Magaloof hailed from Almak. He traveled to the Core Worlds planet Coruscant by 22 BBY and started a criminal career there. Eventually, Magaloof was imprisoned, and after serving a three-year sentence, he returned home to Almak to start over his life."}, {"tag": "p", "text": "At some point between 19 BBY and 1 BBY, the forces of the Galactic Empire subdued the Leffingites, who were resisting that government, during the Battle of Almak. Doctor Gabrel Treon later mentioned the battle in the 104 ABY article Tinker, Tailor, Soldier, Praji: A Cartel of Genes, published in the Byblos Journal of Historical Science."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Almak was developed as part of the backstory for Magaloof, a character appearing in the 2002 prequel trilogy film, Star Wars: Episode II Attack of the Clones. Gregory Walker, writing as \"NarbFlick,\" submitted an entry for Magaloof through the StarWars.com Hyperspace feature \"What's The Story?,\" and it was added to the site's Databank on August 12, 2005."}, {"tag": "p", "text": "Walker later claimed that Almak's name was simply derived from \"random letters that sounded good together.\" The author also expressed his intention for Almak to be located in the vicinity of the planet Luptoom, which had also been created by Walker via \"What's The Story?\". The 2009 reference book The Essential Atlas placed the Almak system, and therefore Almak itself, in grid square J-17, while placing the Luptoom system in the Outer Rim Territories, grid square M-18."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}