{"url": "Grimoire_of_Syclos_the_Lame", "categories": ["Category:Legends articles", "Category:Artifacts", "Category:Books on the Force", "Category:Force-sensitive objects", "Category:Jedi culture"], "nodes": [{"tag": "h1", "text": "Grimoire of Syclos the Lame"}, {"tag": "p", "text": "The Grimoire of Syclos the Lame was a book of great importance to the people of Weik. An artifact imbued with the Force, the Grimoire held spells and arcane rituals. During the Galactic Civil War, the Grimoire was kept in Fume under the ownership of Sala Vindako."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "A book of unknown origin, the mad ravings within it were attributed to Syclos the Lame, a wizard of Weik who taught the teachings of death. While the spells within the Grimoire were said to unlock power of great amounts, to read the book invited madness. The Force talents within pertained to the use of the Force in regards to creatures and wild things. The Beasts of Syclos, the name for the drawings that topped each page, were copied and replicated by those fascinated with the text, and even rendered in stone as gargoyles atop cathedrals and castles across the planet. During the Feast of Worms, an autumnal celebration, the Beasts were depicted in papier mache and carried through the streets."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A book with 386 pages, the Grimoire was bound in leather and reinforced in bronze. Decorated with gemstones and mystic patterns, the cover was adorned with the symbol of the Jedi Order. The pages of the book were made of eight dozen prepared animal skins with a green-gray coloring. Created from animals not found on Weik, the pages were filled with luminous amber-colored ink, written in a scrawling hand which made it difficult to read. Containing over a half-million individual words, the book's pages were completely filled with the illegible scribbles. The first letters heading the pages of the book were hollow-eyed, many-limbed monstrosities out of nightmares, known as the Beasts of Syclos."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}