{"url": "Grizmallt/Legends", "categories": ["Category:Legends articles", "Category:Core Worlds planets", "Category:Ecumenopolises", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Grizmallt locations", "Category:New Republic planets", "Category:Perlemian Trade Route"], "nodes": [{"tag": "h1", "text": "Grizmallt"}, {"tag": "p", "text": "Grizmallt was an ecumenopolis in the Core Worlds of the galaxy. Situated on the Perlemian Trade Route, rimward of Alsakan, it was a prominent industrial planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Part of the Tetrahedron, or Inner Core, Grizmallt was an ancient, prestigious planet. In the ancient Alsakan Conflicts from 17,000 BBY, fought between Coruscant and Alsakan over the governance of the early Republic, Grizmallt sided with the Alsakan-led Axis coalition."}, {"tag": "p", "text": "In approximately 3950 BBY, Queen Elsinoré den Tasia ascended to the planetary throne and sponsored the scout Kwilaan, who discovered Naboo in the Mid Rim. In 3900 BBY, refugees fleeing from a violent revolution on the planet, led by Kwilaan, fled in an expeditionary fleet consisting of three colony ships: Beneficent Tasia, Constant, and Mother Vima—which lost contact with Grizmallt but found a new home on Naboo. The monarchy of Naboo kept many of the outer regalia of the Grizmallt monarchy, but eventually became elected rather than hereditary."}, {"tag": "p", "text": "Another Grizmallt expedition settled on Renatasia, a planet in what would become the Centrality, spinward of Hutt Space in the Outer Rim. The expedition later lost contact with the wider galaxy. The colony was rediscovered in 13 BBY. A third expedition colonized the harsh world of Nam Chorios. In addition, many other worlds were colonized by Grizmallt natives."}, {"tag": "p", "text": "In the century leading up to the establishment of the Galactic Empire, Grizmallt was one of the galaxy's largest industrial manufacturing facilities, rivaled only by Kuat Drive Yards and Rendili StarDrive. Around 22 BBY, Grizmallt was represented in the Galactic Senate by Senator Tashrikam. At the start of the Clone Wars, the Commissars of Grizmallt ordered engineers and industrial spies to reduce the lead in starship construction Kuat had gained from its secret first contract for the Grand Army's vehicles and warships."}, {"tag": "p", "text": "After the Battle of Endor, Grizmallt, along with Alsakan and Wukkar, surrendered to the New Republic fairly quickly after Admiral Gial Ackbar's fleet entered the Core Worlds in 6 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars Galaxies: An Empire Divided Quick Reference Guide, the planet's name is misspelled \"Grizmalit\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}