{"url": "Grodin_Tierce", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Character stubs", "Category:Humans", "Category:Males", "Category:Royal Guard", "Category:Stormtrooper officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Grodin Tierce"}, {"tag": "p", "text": "Grodin Tierce was a Human male who served as a Royal Guard. During the Thrawn campaign, he was cloned by the Grand Admiral as part of a new project to create super-commandos. He died shortly after. His clone was later involved in a campaign to bring down the New Republic, before being killed in 19 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As with all Royal Guards, Tierce began his military career as a Stormtrooper. Under the designation TR-889, Tierce ostensibly proved himself an exceptional soldier and was chosen for training as a Royal Guard on Yinchorr."}, {"tag": "p", "text": "In 4 ABY, Tierce was embedded in a Stormtrooper unit on Magagran battling a rebel cell. The periodic rotation of Royal Guards back into the Stormtrooper Corps proved vital to Tierce when a large number of Royal Guards perished in the destruction of the second Death Star."}, {"tag": "p", "text": "At some point after the death of Palpatine, Tierce came to serve as a Stormtrooper officer under Grand Admiral Thrawn aboard the Star Destroyer Chimaera. Having impressed Thrawn with his martial skill and physical prowess, Thrawn chose Tierce to act as a template for a new type of clone two months before the Battle of Bilbringi in 9 ABY. Tierce felt responsible for Thrawn's death. He had placed most of his troops near the hangars of the Chimaera, expecting that an attempt on Thrawn's life would come from a commando team landing in the hangars during a battle. Instead, Thrawn was killed by Rukh, after the Noghri had learned of the Empire's treachery toward them. Tierce purportedly killed Rukh on his escape. Tierce died on Generis soon after."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to \"Specter of the Past\" and the StarWars.com Databank entry for Rukh, after he assassinated Thrawn, Tierce killed the Noghri. However, in Vision of the Future, Tierce is said to have died during the assault on Generis that occurred prior to Thrawn's death. It was possible that his clone was the one who led the squad."}, {"tag": "p", "text": "The Essential Reader's Companion misspells Tierce's first name as \"Grodon.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}