{"url": "Groggin", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bespinites", "Category:Engineers", "Category:Males", "Category:Ugnaughts"], "nodes": [{"tag": "h1", "text": "Groggin"}, {"tag": "p", "text": "Groggin was an Ugnaught engineer who supervised Smelting Core D, one of Cloud City's most efficient metal processing incinerators. In 3 ABY, during the Galactic Civil War, Groggin discovered in the refuse awaiting his incinerator a Human hand clutching a strange metal cylinder, which was actually the severed hand and lightsaber of Jedi Luke Skywalker, recently lost during his fateful Cloud City duel with the Dark Lord Darth Vader. When Vader appeared in the smelting chamber demanding the hand and lightsaber, Groggin instead suggested they negotiate for the items, unaware of the Dark Lord's identity. Unamused, Vader killed Groggin and claimed his prize, bound for the personal vaults of the Emperor himself."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A strange find"}, {"tag": "p", "text": "Groggin was the name of the Ugnaught engineer in charge of Smelting Core D within the bowels of the planet Bespin's Cloud City during the Galactic Civil War. Groggin saw to it that his smelting core remained one of Cloud City's most efficient metal reclamation centers. Any manner of clutter that could be melted down and reprocessed, from droid parts to bulkhead fittings, was put through Groggin's conveyor and boiled down into base metals or usable alloys."}, {"tag": "p", "text": "One day in 3 ABY, Groggin discovered a strange item in the steaming heap of rubbish destined for his furnace. To his surprise, he picked out from the refuse a cauterized Human hand clutching a strange metal cylinder—the same severed hand and lightsaber lost by the young Jedi Luke Skywalker during his duel with the Dark Lord of the Sith Darth Vader within Cloud City that same day. Judging by the item's lot number, Groggin discerned that the hand had come from the city's lower air shafts, where apparently the piece of debris had been retrieved by the drones that kept Cloud City's air shaft and piping network free of obstruction."}, {"tag": "p", "text": "Although Groggin did not know how the hand had made it into his smelting chamber, all that concerned him was the value of metal he had found. As he moved toward the incinerator to discard the hand and melt down the odd cylinder, Groggin heard a strange mechanical breathing from behind. He turned to find a menacing, two-meter-tall, black-robed figure in the doorway—Vader himself had come to claim Skywalker's hand and lightsaber."}, {"tag": "h3", "text": "The Dark Lord does not negotiate"}, {"tag": "p", "text": "Utterly failing to grasp the significance of the situation, Groggin immediately countered Vader's demand to give over the hand with one of his own: 2,000 credits, to cover costs, as he noted. He also suggested that they might instead be able to negotiate a trade for Vader's metal helmet, even though, as Groggin again noted, it was not worth much. Momentarily taken aback at Groggin's insolence, Vader, with emphasized threat, once more demanded the hand and lightsaber. When Groggin protested again, Vader instantly caught the Ugnaught in a Force choke, and, with a motion of his wrist, the hand and lightsaber floated to the Dark Lord."}, {"tag": "p", "text": "The other Ugnaughts in the smelting chamber rushed to the gagging Groggin's side, searching for the cause of his mysterious coughing fit, but their leader was already dead before they could reach him. His task completed, Vader stalked from the chamber with his prize, another trophy for the Emperor's collection."}, {"tag": "p", "text": "The severed hand of Luke Skywalker, categorized in Imperial archives as sample B-2332-54, was later used as the genetic template for the creation of a Luke Skywalker clone in 9 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Groggin kept Smelting Core D's furnace, one of Cloud City's most efficient, running day and night. However, the Ugnaught engineer was completely ignorant of galactic affairs. When Lord Darth Vader entered his smelting chamber in search of the hand and lightsaber belonging to Luke Skywalker, Groggin was unaware of whom he was addressing. Vader was surprised by Groggin's unusual display of disrespect before proceeding to kill him and claiming the prize, which the impertinent Groggin refused to simply surrender."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "At the time of his death, Groggin wore a work outfit that included a long-sleeved undershirt, an outer tunic, pants, a belt, footwear, and work gloves."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Groggin appeared in the short in-universe narrative Clone B-2332-54, featured in the March 1994 The Last Command Sourcebook, written by Eric S. Trautmann. The story provides an explanation for how the Empire recovers Luke Skywalker's hand and lightsaber, lost during his duel with Darth Vader on Cloud City, which are eventually used for the purpose of creating a Skywalker clone, as seen in the accompanying novel The Last Command. Artist Tim Eldred provided the sourcebook's illustration of Groggin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}