{"url": "Grogu", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Articles in need of updating", "Category:Foundlings", "Category:Jedi Purge survivors", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Members of Yoda's species"], "nodes": [{"tag": "h1", "text": "Grogu"}, {"tag": "p", "text": "Grogu, known to many simply as \"the Child,\" was a male Force-sensitive Jedi and Mandalorian foundling who belonged to the same species as Jedi Grand Master Yoda and Jedi Master Yaddle. Grogu was born in the year 41 BBY, and was raised at the Jedi Temple on Coruscant."}, {"tag": "p", "text": "Grogu was eventually held at a hideout run by Nikto mercenaries on Arvala-7 during the New Republic Era, having survived the siege of the Jedi Temple decades prior. While still an infant at the age of fifty years, he was sought, on behalf of Moff Gideon, by an Imperial who hired Mandalorian bounty hunter Din Djarin to retrieve him."}, {"tag": "p", "text": "However, Djarin chose not to leave Grogu with the Imperials and rescued him from the Imperial remnant facility. After attempting to hide with Grogu along the fringes of the galaxy, Djarin returned to Nevarro to deal with the Imperials chasing Grogu in hopes of keeping him safe. In the process, Grogu became a Mandalorian foundling and the single other member of Djarin's newly created clan. As a result, Djarin took up a new mission: to deliver Grogu back to the Jedi."}, {"tag": "p", "text": "Djarin, alongside Grogu, would then travel across the galaxy, searching for the few remaining Jedi who were left. As advised by former Jedi Ahsoka Tano, Djarin would eventually travel with Grogu to Tython, where he could reach out through the Force to find another member of his kind. However, Grogu was captured by Gideon's Imperial forces, and Djarin was forced to lead a mission to rescue him. After being reunited with Grogu, Djarin delivered him to Luke Skywalker, a Jedi who agreed to take the child into his care and train him in the ways of the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "Born in approximately 41 BBY, during the era of the Galactic Republic, the mysterious alien known as Grogu was raised in the Jedi Temple on Coruscant and trained by several masters until the Jedi Order fell in the Great Jedi Purge at the end of the Clone Wars. Grogu was rescued from the siege of the Jedi Temple and was taken into hiding after the Galactic Empire rose to power. During the Imperial Era, he remained undetected by concealing his Force powers."}, {"tag": "h3", "text": "Liberation"}, {"tag": "p", "text": "By circa 9 ABY, Grogu had fallen into the hands of a Nikto encampment on Arvala-7. The Mandalorian bounty hunter Din Djarin was dispatched by a member of Gideon's Imperial remnant known as \"the Client\" and Imperial Doctor Pershing to capture Grogu alive, though the Client gave Djarin the option to return Grogu dead for a lower price. The assassin droid IG-11 was also dispatched to terminate him. After working together to storm the encampment the infant was being held in, Djarin and IG-11 found Grogu. IG-11 then attempted to terminate the infant, but Djarin shot the droid before he was able to do so."}, {"tag": "p", "text": "Shortly after, Djarin took Grogu back to his ship, the Razor Crest. On the return journey, they were attacked by a trio of Trandoshan bounty hunters, who attempted to kill Grogu. After Djarin defeated them, he and Grogu camped out in the desert for the night. While Djarin sat by the fire, Grogu ate one of the creatures moving around nearby. He then approached the bounty hunter, raising his hand up to the Mandalorian's wounds. Djarin stopped him and placed him back into his pod. The next day, the pair made it to the Razor Crest only to find it being scavenged by Jawas. Djarin attacked their sandcrawler for the scavenged parts and attempted to climb it while Grogu followed in his pod. However, Djarin was knocked to the ground."}, {"tag": "p", "text": "Eventually, Djarin got the assistance of the local Ugnaught farmer Kuiil to try to convince the Jawas to give back the parts peacefully. The Jawas wanted Grogu and Djarin's armor, but eventually Djarin agreed to retrieve a mudhorn's egg in return for the parts. Djarin fought the mudhorn, but was quickly sprawled across the mud. Grogu then used the Force to lift the beast into the air long enough for Djarin to get up and kill it. After using the Force, Grogu passed out from Force exhaustion. When Grogu eventually awoke, the Razor Crest had been repaired, and they were en route to Nevarro."}, {"tag": "h3", "text": "On the run"}, {"tag": "h4", "text": "Into hiding"}, {"tag": "p", "text": "Upon returning to Nevarro, Djarin took Grogu to the Client's facility. The Client and Dr. Pershing were excited at their arrival and immediately began examining Grogu. Pershing then took him away, and the bounty hunter left wondering what the Client wanted with him. However, shortly before leaving Nevarro to carry out a new bounty, Djarin, having a change of heart, returned to rescue Grogu. Shortly after Djarin stormed the facility, he found Grogu sedated with Pershing. After taking Grogu back, he was forced to defend him from the Bounty Hunters' Guild, who attempted to take him back. However, Djarin's tribe came to his assistance, resulting in Djarin escaping from the Bounty Hunters' Guild with Grogu."}, {"tag": "p", "text": "Djarin took Grogu to the backwater world of Sorgan, where he intended to lie low for several months and avoid the guild. Upon their arrival, the Mandalorian told Grogu to stay put and not touch anything. When Grogu refused to leave his side, he accepted his company. The pair traveled to a settlement and walked through it. Grogu was startled by a Loth-cat which growled at him. Djarin and Grogu stopped at a common house, and Grogu had some soup. One customer, though, caught Djarin's attention, and he exited the common house to find her when she seemingly disappeared. The customer, named Carasynthia Dune, ambushed Djarin, and they fought until Grogu interrupted them by quietly watching them fight and sipping his soup."}, {"tag": "p", "text": "Djarin talked to Dune, who assured him Sorgan was \"taken.\" Thus, he took Grogu back to the Razor Crest, where two krill farmers awaited. They brokered with Djarin for protection of their village against Klatooinian raiders in exchange for residence at the village. Bringing Dune and Grogu with him, Djarin defeated the raiders with the help of Dune and the village. He continued to live there for several weeks, and Grogu became extremely popular with the children, although they were not fond of his attempt to eat a Sorgan frog. Djarin considered leaving Grogu behind in the village where he could have a childhood. However, a bounty hunter came searching for Grogu and attempted to shoot him. After Dune killed the bounty hunter, Djarin changed his mind, and both he and Grogu left Sorgan behind."}, {"tag": "h4", "text": "Tatooine"}, {"tag": "p", "text": "Sometime after leaving Sorgan, Djarin encountered fellow bounty hunter Riot Mar, who engaged him in a dogfight. Grogu, who sat at the cockpit with Djarin, watched him evade his opponent and was thrust forward, as his guardian maneuvered the Razor Crest behind Mar and destroyed his ship. Djarin then took Grogu to Mos Eisley on Tatooine. He left Grogu to sleep on the Razor Crest as he looked for work to gain credits for repairs. Grogu later awoke at the initial alarm of the hangar manager, Peli Motto, who then decided to watch Grogu in exchange for an increased payment from Djarin upon his return."}, {"tag": "p", "text": "After learning of the Mandalorian's actions on Nevarro, inexperienced hunter Toro Calican kidnapped both Motto and Grogu in an attempt to blackmail Djarin. When Djarin arrived, he confronted Calican, who held his captives at gunpoint. Using a flare to blind his foe, Djarin flanked and shot him. Grogu hid in fright but was immediately found again by Motto and Djarin. Djarin then left Tatooine with Grogu."}, {"tag": "h4", "text": "The mercenaries' mission"}, {"tag": "p", "text": "In search of credits, Djarin took on another assignment for an old mercenary friend named Ranzar Malk to rescue a Twi'lek prisoner named Qin, who had been arrested by the New Republic. Requiring the Razor Crest to complete the mission, Ranzar collected a crew of mercenaries made up of a former Imperial sharpshooter named Migs Mayfeld, a Devaronian named Burg, a skilled pilot droid Q9-0, nicknamed \"Zero,\" and Qin's sister Xi'an. While en route to the New Republic Correctional Transport, the Bothan-Five, Djarin hid Grogu within a compartment, which was discovered by the mercenaries. Dumbfounded at what it was, Mayfeld picked up Grogu jokingly claiming that he could keep it as a pet before pretending to drop it. As this happened, the Razor Crest exited hyperspace, and its current pilot, Zero, performed a risky docking maneuver that tossed the crew members around the vessel, including Grogu, who fell face first onto the deck of the Razor Crest before being protected by Djarin and placed back into his compartment before Djarin left with the other mercenaries to board the prison ship."}, {"tag": "p", "text": "As their mission continued, Zero uncovered a hologram from Greef Karga regarding Grogu's initial capture. Possibly realizing the value of Grogu, Zero became intrigued by Grogu. Around this time, the mercenaries had rescued Qin, betraying Djarin in the process, although Djarin retaliated by attacking each of the mercenaries one by one and disabling Zero's ability to contact the crew. While attempting to make sense of the situation, Grogu left his compartment and was encountered by Zero, who attempted to apprehend him. Eventually being chased back into his compartment, Grogu attempted to use the Force in self-defense by raising his hand to Zero, who was aiming his blaster at Grogu. Before anything could happen, Djarin arrived aboard the Razor Crest and shot Zero in the back, destroying the droid."}, {"tag": "p", "text": "With his mission accomplished, Djarin returned to Ranzar's station and delivered Qin, receiving his full payment. As Djarin and Grogu left the station aboard the Razor Crest, Ranzar prepared to deploy a gunship to destroy the ship, but as it prepared to launch, three X-wing starfighters exited hyperspace following a New Republic tracking beacon that had been activated during the mission, and which Djarin had planted on Qin. As the X-wings assaulted the station, the Razor Crest jumped to hyperspace, and during travel, Djarin comforted Grogu by giving him a knob from one of his control sticks."}, {"tag": "h3", "text": "Return to Nevarro"}, {"tag": "h4", "text": "Locating allies"}, {"tag": "p", "text": "Following the extensive manhunt for the Mandalorian, Karga contacted the hunter with an offer: return to Nevarro and help rid it of the Empire, and in return, keep Grogu. After brief consideration, Djarin decided to take Karga up on the offer. Djarin returned to Sorgan, where he picked up Cara Dune to help with the assault. While the two were speaking, Grogu was left alone in the cockpit, and briefly attempted to play with the Razor Crest's controls, causing the ship to go out of control."}, {"tag": "p", "text": "To have someone to keep an eye on Grogu, Djarin, and Dune returned to Arvala-7 to pick up Kuiil, who had also repaired and reprogrammed IG-11. Djarin was hesitant regarding IG-11's presence, afraid he would harm Grogu despite his reprogramming. While the entire crew was on the Razor Crest, Grogu attempted to Force choke Dune as she arm-wrestled with Djarin, much to both Djarin and Dune's horror."}, {"tag": "p", "text": "During the mission, Kuiil helped to care for Grogu, even constructing a new mobile pram for him. Grogu was to be used as bait to lure the Imperials into the trap, and on the way to the city on Nevarro, Grogu healed Karga of a poisonous injury following a run-in with a group of native reptavians. Karga, having originally intended to betray Djarin, reconsidered after witnessing Grogu's power, and murdered the bounty hunters who were with him."}, {"tag": "p", "text": "When creating a new plan, Djarin decided that he would pose as a prisoner, under the guise of having been captured by Karga and Dune. Under suggestion that Grogu still be used as bait, Djarin refused, asking Kuiil to take Grogu back to the Razor Crest, to safety. Later, as the plan fell apart, a pair of Imperial scout troopers discovered Kuiil and Grogu, killing the Ugnaught and kidnapping the infant just as they reached the Razor Crest."}, {"tag": "h4", "text": "Rescue"}, {"tag": "p", "text": "Realizing that the infant had been kidnapped and Kuiil was dead, IG-11 left the Razor Crest to fulfill his programming \"to nurse and protect.\" The Imperial scout troopers stopped at the outskirts of the city while they awaited orders from Moff Gideon, the Imperial leader that wanted Grogu in the first place. In the meantime, they harassed Grogu. IG-11 arrived and rescued the infant by taking out the pair of troopers. The droid, carrying Grogu with him, rode one of the speeder bikes that belonged to the troopers, making its way to the city. As IG-11 drove through the city shooting the stormtroopers that had taken hold of Nevarro, Grogu laughed in delight."}, {"tag": "p", "text": "IG-11 and Grogu regrouped with Djarin, Dune, and Karga. Though they held back the Imperial remnant at first, after Djarin was gravely wounded by Moff Gideon they retreated into the cantina. While trapped inside the building, Gideon sent an Incinerator trooper to eliminate them. Grogu used the Force to contain the flames before throwing them back at the stormtrooper, killing him. However, this weakened Grogu, and he collapsed afterwards, preventing him from helping heal Djarin's wound."}, {"tag": "p", "text": "Djarin asked Dune to take Grogu with her while she and Karga escaped through the sewers to the Mandalorian covert. Djarin, after being healed by IG-11, caught up with them later. At the desolated enclave, the group met the Armorer. As Djarin told his full experience with the infant, the Armorer declared Grogu to be a foundling. As such, Djarin was from then on seen as Grogu's father, until he could train him or otherwise return him to his kind. The Armorer declared Djarin and Grogu to be a clan of two, before branding the Mandalorian's shoulder plate with his new signet: a mudhorn, recalling when Grogu saved him on Arvala-7."}, {"tag": "p", "text": "The group headed further into the sewer system onto a lava river to escape. At the end of the river, Imperial stormtroopers awaited them, so IG-11 sacrificed himself to comply with his programming and save Grogu. When they were attacked by Gideon piloting his TIE fighter, Karga asked Grogu to do the \"magic hand thing,\" referring to the Force, to save them from Gideon. Not knowing what he meant, Grogu just waved his hand. Eventually, Djarin defeated Gideon, causing him to crash his TIE fighter. Afterwards, Djarin buried Kuiil and parted ways with Karga and Dune, leaving Nevarro aboard the Razor Crest, with Grogu as his foundling."}, {"tag": "h3", "text": "Search for the past"}, {"tag": "h4", "text": "Searching for other Mandalorians"}, {"tag": "p", "text": "Djarin and Grogu went to an unknown planet to meet with Gor Koresh who, Djarin was hoping, could tell them about another Mandalorian. Koresh, however, only wanted Djarin's beskar armor and turned on Djarin. As the spectators hurried out of the stadium, Djarin activated his whistling birds, prompting Grogu to close his cradle. After Djarin killed all his associates, Koresh tried to flee but was captured by Djarin. Koresh revealed he had heard of a Mandalorian residing in Mos Pelgo on Tatooine. Satisfied with the information, Djarin left Koresh at the mercy of some local creatures and then left with Grogu."}, {"tag": "h4", "text": "Return to Tatooine"}, {"tag": "p", "text": "Grogu traveled with Djarin to get some information about a Mandalorian who resided on Tatooine. Upon returning to the desert planet, Peli Motto was happy to see Grogu again. Pell quipped that she wished she could have more of Grogu's kind. Djarin explained that he needed her help to find a Mandalorian that lived on the planet. Pelli offered to look after Grogu while he went adventuring, but Din responded that he was on a quest to bring Grogu back to his kind. Pelli replied that she couldn't help him with that because she had never encountered a member of Grogu's kind. After Pelli pointed them in the direction of Mos Pelgo, Djarin and Grogu traveled there using her speeder bike. Upon arriving there, Djarin left Grogu in his side pocket and headed into a small cantina. Grogu was quick to follow him inside and saw Djarin and Cobb Vanth about to fight. Before the two men could fight, they heard a rumbling outside. Grogu hid in a pot as the rumbling intensified. The rumbling turned out to be a krayt dragon that had been terrorizing the village of Mos Pelgo."}, {"tag": "p", "text": "Grogu traveled with Djarin and Vanth, who had agreed to work together to slay the greater krayt dragon that was terrorizing Mos Pelgo, with Vanth promising Djarin his salvaged Mandalorian armor if they succeeded. As they traveled through a canyon, they encountered a pack of massiffs. Grogu hid from the animals until Djarin was able to communicate and made peace with them and the Tusken Raiders that they traveled with."}, {"tag": "p", "text": "The following day, Djarin, Grogu, and Vanth accompanied the Tusken Raiders on banthas to confront the krayt dragon, as they had forged an alliance the previous night. While Din, Vanth, Grogu, and the Tuskens watched from a cliff, a lone Tusken and his steed rode into a large cave, which one of the Tuskens explained is the home of the krayt dragon. The krayt dragon emerged and soon devoured the Tusken Raider, leaving the bantha. As Grogu scurried away in fear, the Tuskens reacted in horror as one of their kind was eaten."}, {"tag": "p", "text": "Djarin volunteered the citizens of Mos Pelgo to aid the cause. Working together, the humans and Tuskens laid explosives as a trap. During the battle with the krayt dragon, Grogu watched from afar as Djarin eventually slew the dragon. After the battle, Grogu eyed a piece of meat from the dragon that Djarin was loading onto the speeder. Djarin and Vanth said their goodbyes before Djarin and Grogu rode off on the speeder bike."}, {"tag": "h4", "text": "Traveling to Trask"}, {"tag": "p", "text": "On his way back to Mos Eisley, Djarin and Grogu were intercepted by bounty hunters seeking to capture Grogu. Grogu was taken hostage by one of the hunters, but after Djarin traded the hunter his jetpack for Grogu, Djarin remotely controlled the jetpack to kill the bounty hunter. Djarin reclaimed his jetpack and carried his gear back to Mos Eisley on foot, with Grogu riding in a cloth. Djarin collaborated with Motto to find another lead on Mandalorians, agreeing to transport \"Frog Lady\" to the estuary moon of Trask, where Frog Lady insisted her husband had seen Mandalorians."}, {"tag": "p", "text": "While traveling sublight toward the planet, Grogu's interest was greatly piqued by the Frog Lady's eggs. Shortly after leaving Tatooine, he began discreetly snacking on them until Djarin caught and reprimanded him, stowing him in the bunk. Later, after crash landing on an ice planet to escape a New Republic patrol, Grogu yet again consumed a number of eggs before Djarin stopped him again. While helping Djarin fix the Razor Crest, they discovered that Frog Lady had wandered off and went to look for her, finding both her and her offspring at a nearby hot spring. Noticing several different eggs nearby, Grogu's snacked experimentally on one of the spiders cocooned inside, and consequently woke all of the ice spiders up. Fighting their way back to the Crest, the trio were nearly overwhelmed by the spiders until the New Republic pilots that pursued them earlier arrived to save them. With the spiders no longer a threat, Djarin managed to repair the Razor Crest just enough for them to escape the planet."}, {"tag": "h4", "text": "Meeting more Mandalorians"}, {"tag": "p", "text": "Upon arriving on Trask, Djarin, Grogu, and Frog Lady managed to enter the planet's atmosphere, only to crash-land in the space port's harbor. After witnessing the reunion of Frog Lady and her husband, Grogu accompanied Djarin and the couple to a tavern. Before discussing his deal with a Quarren captain, Djarin ordered some soup for Grogu, who was surprised when a small tentacled creature attacked him from the broth as he ate. Luckily, Djarin casually removed the creature and told Grogu not to play with his food."}, {"tag": "p", "text": "Later, Grogu accompanied Djarin on a trawler owned by the Quarren, who claimed to know the location of more Mandalorians. This turned out to be a ruse, however, as Grogu was knocked into the mouth of their mamacore and they prepared to kill Djarin for his beskar armor. Fortunately, the duo was rescued by three members of the Nite Owls, led by Bo-Katan Kryze. Grogu was saved from the mamacore, though his crib was damaged beyond repair. Not believing Kryze's claim that he was from a cult-like faction of Mandalorians known as the Children of the Watch, Djarin returned with Grogu to port."}, {"tag": "p", "text": "That evening, after being saved again from another group of Quarren by the Nite Owls, Djarin and Grogu agreed to hear them out, and discussed their plan at the nearby tavern. Knowing the mission would be too dangerous for him, Djarin left Grogu in the care of the Frog couple. Once his business with Bo-Katan was concluded, Djarin returned for Grogu and they departed Trask together."}, {"tag": "h4", "text": "Pit stop on Nevarro"}, {"tag": "p", "text": "The Mon Calamari hired to repair the Razor Crest did a less-than-perfect job. At Djarin's instruction, Grogu tried his best to help with the ship's maintenance, only to electrocute himself by crossing two wrong wires. Afterwards, Djarin decided to stop at Nevarro for some proper repairs and set a course for the planet."}, {"tag": "p", "text": "Upon arrival, Djarin and Grogu were both welcomed by Greef Karga and Cara Dune, who had since become the town's new marshal. Following a tour of the settlement, Grogu was enrolled in the new school while Djarin accompanied Dune and Karga on their mission to destroy the last Imperial base on Nevarro. Rather than listen to the protocol droid's lecture, Grogu asked for a cookie from the student sitting next to him. When the boy refused, Grogu drew on the Force to move the cookie package from the boy's desk to his own."}, {"tag": "p", "text": "Later, once Djarin returned to fetch Grogu, the two took off in the Razor Crest and proceeded to destroy the last three TIE fighters that had been pursuing their friends. Djarin successfully took down the TIEs in a dogfight, but his piloting caused Grogu to regurgitate the cookies he ate. Once Karga and company were safe, Djarin and Grogu left the planet in a fully repaired Razor Crest."}, {"tag": "h3", "text": "Return to the Jedi"}, {"tag": "h4", "text": "Meeting Ahsoka Tano"}, {"tag": "p", "text": "Djarin and Grogu arrived on the forest planet of Corvus, acting on a tip from Bo-Katan that a Jedi, namely Ahsoka Tano, was lodging there. Grogu accompanied Djarin inside the planet's capital, Calodan, as he asked the residents for information, and was present when Djarin \"agreed\" to find and kill Tano for the local Magistrate, Morgan Elsbeth, in exchange for a spear of pure beskar. On their way out of the city, Elsbeth's main enforcer, Lang, asked what Grogu was, to which Djarin simply replied he kept him around for luck."}, {"tag": "p", "text": "Djarin and Grogu proceeded to search the surrounding forest for Tano. Djarin set Grogu down as he scouted ahead, only to be quickly ambushed by the Jedi. Grogu witnessed them briefly fight until Djarin assured her he was a friend. Seeing Grogu behind him, Tano in turn realized why he had come looking for her. That evening, she connected with Grogu through the Force, revealing his name and history to Djarin for the first time."}, {"tag": "p", "text": "The next morning, Tano tried to instruct Grogu by using the Force to move a stone, but he refused to follow her command. When Djarin had more success using the knob from his ship, Tano decided not to train him because she felt that Grogu had developed too strong of a connection to Djarin, and worried that the fear and attachment inside of Grogu would cause him to suffer the same fate as her own master. Grogu stayed on the Razor Crest while Tano and Djarin worked together to liberate Calodan. After the city had been freed, Tano instructed Djarin to find the ruins of an ancient temple on the planet Tython, where Grogu would be able to choose his own destiny, before wishing them both goodbye."}, {"tag": "h4", "text": "Meditation on Tython"}, {"tag": "p", "text": "While on their way to Tython, Djarin called Grogu's name multiple times, finding the child's reaction to his name humorous. Djarin then asked for the control knob from Grogu, who was hesitant to give it back; however, Djarin offered it back to Grogu, who used the Force to pull it back. Djarin then landed the Razor Crest, flying Grogu to the temple via jetpack afterwards."}, {"tag": "p", "text": "Grogu was placed on the seeing stone by Djarin, where Grogu contacted a Jedi who was later revealed to be Luke Skywalker. Djarin asked Grogu to do his job, with some confusion as to how the process worked due to his lack of understanding of the Force. Grogu simply sat on the stone for a few moments, much to Djarin's annoyance, until Slave I broke atmosphere nearby, forcing Djarin to investigate. By the time Djarin spotted Boba Fett exiting the ship, Grogu had begun to meditate, creating an aura around himself, blocking Djarin from reaching him. Djarin eventually gave up trying to retrieve Grogu to escape and left to confront the newly arrived ship. When Djarin confronted Fett, the older bounty hunter threatened Djarin, stating that his accomplice, Fennec Shand, would shoot Grogu if Djarin refused to give his armor back."}, {"tag": "p", "text": "As Grogu continued meditating, stormtroopers of Gideon's remnant arrived on Tython, attempting to storm the temple to reach and capture Grogu. The Razor Crest was also bombarded by Gideon's ship from orbit, destroying their present means of escape. Djarin attempted to reach Grogu once more before the force field around Grogu temporarily incapacitated him. Fett and Shand, however, continued to hold off the Imperial forces in defense of Grogu. Djarin eventually woke up, attempting to reach Grogu once more to no avail, then instead joining Fett and Shand in defense of the child."}, {"tag": "p", "text": "After the Imperial forces were forced to retreat, Gideon ordered that a squad of dark troopers be sent to apprehend Grogu by force. At this point, Grogu was no longer meditating and was incapacitated. Despite Djarin and Shand's efforts to reach Grogu before the dark troopers, the child was nonetheless captured and taken to Gideon's command cruiser. Fett briefly followed the dark troopers in the Slave I to rescue Grogu but fell back after Djarin requested for Fett to refrain from harming him."}, {"tag": "p", "text": "After Gideon's escape with Grogu, Fett and Shand agreed to help Djarin rescue Grogu. The group first went to Nevarro, where Djarin asked Cara Dune, now a marshal of the New Republic, for assistance. Djarin also requested that Dune help him spring Migs Mayfeld from prison, in hopes that the sharpshooter would help him rescue Grogu."}, {"tag": "p", "text": "While on Gideon's command cruiser, Grogu was held in a containment cell, where he held off two Stormtroopers using the Force; however, this act weakened him. Gideon entered Grogu's cell, taunting him with the Darksaber; as Grogu reached for the blade, Gideon pulled back, telling him he was not yet ready to play with such things. Gideon then ordered his troops to place Grogu in binders, before exiting the cell, ordering a nearby officer to contact Doctor Pershing and inform him of the asset's return."}, {"tag": "h4", "text": "Rescue from Gideon"}, {"tag": "p", "text": "Djarin, Fett, Shand, Dune, and Mayfeld soon went on a mission to discover the coordinates of Gideon's ship. The mission was a success, but not without Djarin sacrificing his creed and removing his helmet in front of other living beings to recover the coordinates, showing how much he had come to care for Grogu as a son. Djarin then contacted Gideon and informed him of his intentions to recover Grogu, twisting Gideon's own words back upon him."}, {"tag": "p", "text": "Djarin, Fett, Shand, and Dune captured an Imperial shuttle to board Gideon's ship, where Grogu was being held. In capturing the ship, they took Doctor Pershing as prisoner. Bo-Katan Kryze and Koska Reeves joined in the rescue mission, so that Bo-Katan could take the Darksaber from Gideon in combat. But Fett, successfully boarding the Imperial ship, Din Djarin found Grogu in the brig of the ship with Gideon holding the Darksaber over him. Gideon allowed Djarin to approach Grogu after telling Djarin he already had the blood he needed from the child. Gideon then attacked Djarin with the Darksaber upon him picking up Grogu. Djarin bested Gideon in combat using his beskar staff while Grogu remained in his cell."}, {"tag": "p", "text": "Djarin took Gideon and Grogu to the bridge, which had already been secured by the others in the boarding party. Once on the bridge the ship was boarded by dark troopers who made their way to the blast doors protecting the bridge and began to break them down. Gideon then informed Djarin that the dark troopers would only spare himself and Grogu. Before the dark troopers could break through the blast doors, a mysterious X-wing starfighter landed on the light cruiser."}, {"tag": "h4", "text": "Return to Jedi training"}, {"tag": "p", "text": "A robed figure disembarked the X-wing and drew a green lightsaber, which he used alongside Force powers to defeat all the dark troopers and reach the bridge. Grogu reached out to the footage of this figure on a monitor on the bridge. Djarin recognized the robed figure as a Jedi and opened the blast doors to let him through. The Jedi entered the bridge and removed his hood to reveal himself as Luke Skywalker. Djarin bade an emotional farewell to Grogu, in which he took off his helmet to let Grogu see his face. Grogu was initially hesitant to go with Skywalker until he saw his astromech droid, R2-D2 accompanying him, at which point he walked towards the droid and was picked up by Skywalker. Luke Skywalker left the ship with Grogu to begin training him in the use of the Force."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Grogu formed an attachment to Din Djarin, who became a father figure to him. Ahsoka Tano sensed fear and anger within Grogu as well as his emotional bond to the Mandalorian. Grogu was initially uncooperative with Tano's attempts to test his connection to the Force; Djarin believed it was due to Grogu's stubbornness."}, {"tag": "p", "text": "Though Grogu survived by concealing his powers, he occasionally utilized his connection to the Force to obtain what he wanted, whether it was food or the control knob from the Razor Crest. He was also willing to use the Force to protect his Mandalorian caretaker."}, {"tag": "p", "text": "Grogu's diet was influenced by his taste for a variety of meals, including living creatures. In his time with Djarin, Grogu devoured frogs, unfertilized frog eggs, a spider egg, a creature with tentacles, and cookies."}, {"tag": "p", "text": "Grogu was a male alien who belonged to the same species as Grand Master Yoda. Although he was fifty standard years old when Djarin found him, Grogu had the appearance and behavior of a toddler. At that time, he was a wide-eyed youngling who stood 0.42 meters tall. He also had white hair, brown eyes, and green skin."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Grogu was able to harness the mystical energies of the Force on account of being Force-sensitive. One notable display of his power was when he telekinetically lifted a giant mudhorn into the air for a brief time to save Djarin from the charging beast. However, performing this feat was very strenuous for Grogu as he subsequently fell unconscious for several hours afterward. He could also use the Force when he became angry, such as when he telekinetically strangled Carasynthia Dune because he believed she was harming Djarin while they were arm-wrestling. He later revealed the ability to heal serious injuries and even cure poisoning by touching the injury and then using the Force, though the act, much like levitating the mudhorn, was incredibly draining. In another notable display of telekinesis, Grogu created a strong barrier using the Force to protect his companions by both blocking and redirecting a stream of fire from an attacking Incinerator trooper."}, {"tag": "p", "text": "Grogu had grown more skilled in his use of the Force, as Moff Gideon observed, by the time of his capture on Tython. By then, he was capable of tossing around two stormtroopers with telekinesis until his Force powers ran out. He could also manipulate small, nearby objects with ease, such as pulling cookies towards himself or unscrewing a knob from one of the Razor Crest's levers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Conception and portrayal"}, {"tag": "p", "text": "Grogu first appeared in the first episode of the 2019 Disney+ television show The Mandalorian, which aired on November 12, 2019. The character was inspired by a sketch by executive producer Dave Filoni, and developed into a design by members of the art department. Filoni and co-executive producer Jon Favreau intended to film Grogu as a puppet and then as a blank to later add CGI (in case the puppet was not convincing enough), but Werner Herzog, who played \"the Client\" in The Mandalorian, told the pair to leave it, calling them cowards. During the show's production, Grogu was puppeteered by a team of people. Jason Matthews puppeteered the eyes, Trevor Hensley controlled his gross body moves and head, Hiroshi Ikeuchi controlled the ears and mouth, Mike Manzel puppeteered most of the gross body moves, and Tamara Carlson Woodard worked as a standby operator who also created the costume. It was referred to as \"the Being\" by the actors during filming."}, {"tag": "p", "text": "News reports and social media have widely and affectionately referred to Grogu as \"Baby Yoda.\" According to an article from Vanity Fair, fans were desperate for \"Baby Yoda\" merchandise, although Favreau had wished to hold off on it in case Grogu had been leaked before the release of the first episode. Despite the nickname, Disney was careful to refer to the character only as \"The Child\" in merchandising, and Jon Favreau told off Disney CEO Bob Iger for using the name Baby Yoda. Grogu is also not the first infant member of Yoda's species to be featured in a Star Wars story, as an infant member of the species appeared in a single panel of the Star Wars Legends comic Children of the Force, which was included in Star Wars Tales 13 in 2002."}, {"tag": "p", "text": "On June 30, 2020, it was revealed that Grogu was set to appear in the one-shot Star Wars Adventures: The Mandalorian comic, which was set for a November 2020 release. However, while several other Mandalorian tie-ins were officially cancelled, the comic's status was never addressed despite never being released."}, {"tag": "h3", "text": "Non-canon history"}, {"tag": "p", "text": "On December 12, 2019, a statue of Grogu was added to The Sims 4, following the ongoing release of The Mandalorian's first season. The item is merely a decoration and does not function as either a playable or non-playable character and has no special properties in the game. Grogu was also featured in two LEGO animated products; in \"Snowflake Snack,\" he escapes the Razor Crest to play in the snow, but he accidentally buries himself in a large snowball he created using the Force. He is then rescued by Din Djarin. He also makes a brief appearance in The LEGO Star Wars Holiday Special while Rey Skywalker duels Darth Vader. The pair, along with other characters in the scene, pause their fighting to admire Grogu's cuteness."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}