{"url": "Grom_Zian", "categories": ["Category:Legends articles", "Category:Chagrians", "Category:Galactic Republic senators", "Category:Males", "Category:Sith Empire individuals", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Grom Zian"}, {"tag": "p", "text": "Grom Zian was a male Chagrian senator who represented the planet Solu Five in the Galactic Senate of the Republic. However, during the Galactic War, he was bought off by the reconstituted Sith Empire, and at the behest of General Arkos Rakton he attempted to sideline the Special Forces unit Havoc Squad with a Senate hearing about their activities—only for the unit's commander to expose him using evidence gathered by the Republic Strategic Information Service."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Zian was the Senator of Solu Five. Bought off by the Sith Empire, Zian, with the aid of Imperial Intelligence, slowly gained influence within the Senate. By the start of the Galactic War, Zian, on orders from General Arkos Rakton, launched an inquiry into the activities of Republic Special Forces Division, specifically Havoc Squad, Rakton's arch-enemy. It was Rakton's intention to get Havoc suspended to turn the war in his favor by having Zian portray the squad's commander as a loose cannon."}, {"tag": "p", "text": "During the hearing, Zian began listing allegations against Havoc, including the disappearance of Harron Tavus, the destruction of the Gauntlet superweapon, the initial cause of Rakton's campaign, and their apparent lack of involvement in the war effort. When it came to the Havoc Squad Commander to speak, the Commander presented evidence gathered by the SIS proving Zian's Imperial ties. Zian attempted to dismiss them as \"wild accusations\" or \"paranoid delusions\", but Senator Zorin Krasul, whom Havoc saved on a previous mission, stating that the CO of Havoc Squad deserves more than to be dismissed. After the Senate Committee reviewed the evidence, they ordered the Senate Guard to detain Zian for high treason. As he is hauled away, Zian weakly protested that the evidence was forged as part of some military conspiracy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Fate"}, {"tag": "p", "text": "The player can either choose to present the evidence against Zian or outright kill him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}