{"url": "Gron", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Lasat", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gron"}, {"tag": "p", "text": "Gron was a Lasat male member of the Lasan High Honor Guard. After the near-extermination of his species, Gron rejected violence in his fight against the Galactic Empire, and along with Chava the Wise he searched for Lira San, a legendary refuge for Lasats. In 3 BBY, he and Chava were rescued from Imperial forces by the crew of the Ghost. One of their rebel rescuers was the Lasat Garazeb Orrelios, Gron's former Captain in the Honor Guard. Gron and Chava managed to convince Orrelios and his crewmates to assist in their quest to find Lira San in Wild Space. This quest proved successful and the three Lasat discovered that Lira San was the original Lasat homeworld and was already teeming with millions of Lasat. Gron and Chava chose to start a new life on Lira San while Orrelios rejoined his rebel comrades."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rescue"}, {"tag": "p", "text": "Prior to the Siege of Lasan, Gron was a member of the Lasan High Honor Guard and served under Captain Garazeb Orrelios. Gron and his traveling companion Chava the Wise were among the few Lasat refugees to survive the brutal Imperial pacification of Lasan. In 3 BBY,[source?] Gron and Chava smuggled themselves onto a cargo container which ended up on Nixus Hub 218. However, the Weequay pirate Hondo Ohnaka alerted the Imperial authorities to their arrival and they were captured. Fortunately for the Lasat, Ohnaka had also alerted his former one-time \"business partner\" Ezra Bridger to their arrival. Ezra and his rebel companions assaulted the Imperials and rescued Gron and Chava."}, {"tag": "p", "text": "One of their rebel rescuers turned out to be his former commander Zeb, who had joined a rebel cell that operated from the VCX-100 light freighter known as the Ghost. As Gron and Chava along with their rebel rescuers made their way to the Ghost's hangar bay, Chava told them that she and Gron were searching for Lira San, world described in prophecy as a safe system where the Lasat could begin a new life. While Gron and Chava were optimistic about Lira San, Zeb was skeptical and despondent due to his guilt at failing to protect the Lasan royal family and their former homeworld. On they way, they were ambushed by Imperial stormtroopers and a gunfight broke out. However Gron, Chava, and their rebel allies were able to escape due to some assistance from Ohnaka who sealed the exits; preventing the stormtroopers from apprehending them."}, {"tag": "h3", "text": "Rediscovery of Lira San"}, {"tag": "p", "text": "After Gron, Chava, and their rescuers had escaped aboard the Ghost into hyperspace, Gron and Chava began a ritual to guide the travelers to Lira San, a legendary planet that was not found on the official star charts. According to an ancient Lasat legend, Lira San could only be found if a \"child of prophecy\" saved both the \"fool\" and the \"warrior.\" While Zeb initially refused to participate in the ritual, he agreed to help Gron and Chava at the urging of his fellow crew member Ezra. During the ritual, Zeb activated his bo-rifle in the ancient Lasat style which interacted with Chava's staff. The two devices then produced a surge of energy which interacted with a holographic map of the galaxy activated by the astromech droid Chopper; pointing Lira San's location to a set of coordinates in Wild Space, an uncharted region that lay outside the Outer Rim Territories."}, {"tag": "p", "text": "Together, Gron and his companions traveled to the coordinates in Wild Space but found their path blocked by a collapsed star cluster. Gron and his rebel companions' problems were further complicated when an Arquitens-class command cruiser commanded by the Imperial Security Bureau Agent Kallus arrived to destroy them. Gron along with Chava and the other rebels watched as Zeb fulfilled the Lasat prophecy by assuming the roles of child, fool, and warrior at once. Using his bo-rifle, Zeb guided the Ghost safely through the collapsed star cluster. The Imperial light cruiser attempted to pursue them but was forced back after the ship sustained damage from the cluster's gravitational pull."}, {"tag": "p", "text": "Upon entering the cluster, the Ghost miraculously jumped into hyperspace. Gron and his companions were knocked out by a bright blast of light. When they emerged from hyperspace, Gron and his companions sighted the planet Lira San in the horizon. Gron and Chava traveled down to Lira San with Zeb while the other rebels stayed aboard the Ghost. The three Lasat landed on Lira San and discovered that the planet was the original Lasat homeworld and was home to millions of Lasat. While Gron and Chava decided to settle on their new homeworld, Zeb returned to his rebel companions with the promise to bring more Lasat refugees to Lira San."}, {"tag": "h3", "text": "Reconciliation"}, {"tag": "p", "text": "Following the Battle of Endor, Zeb and his former Imperial foe Kallus, who had defected to the Alliance to Restore the Republic, traveled to Lira San. There, he discovered that he had not exterminated the Lasat. Gron and Chava were among the Lasat that welcomed the former Imperial."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gron was a medium-built male Lasat with purple skin, gray hair and big green eyes. He and the mystic Chava were survivors of the Imperial pacification of Lasan. Following the genocide, Gron and Chava became pacifists and refused to use violence even in self-defense. He and Chava were also staunch believers of an ancient Lasat prophecy around Lira San, a legendary sanctuary where the Lasat species could start anew."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gron first appeared in \"Legends of the Lasat\", the twelfth episode of the second season of the Disney XD television series Star Wars Rebels. He was voiced by Gary Anthony Williams."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}