{"url": "Almas", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Almas locations", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Sith planets", "Category:Terrestrial planets", "Category:Thaere sector planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Almas"}, {"tag": "p", "text": "Almas was a terraformed planet in the Cularin system. Its moon, Dorumaa, was a captured satellite, which underwent its own terraforming."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "An anomaly in itself, Almas was a molten, terrestrial planet orbiting beyond the usual range for its kind, and due to this it received little sunlight. Despite its hot core, Almas was not very geologically active. It had only two small mountain ranges. The planet's atmosphere was initially filled with poisonous gases like phosphorus and methane, until Sith Lord Darth Rivan, aiming to settle there, developed the kaluthin grass to help alter the atmosphere. Almas had no surface water, but there were underground lakes upon which the kaluthin drew and to which settlers would later built wells. The kaluthin was a success, given that all Almas' water was located underground, and continued to thrive there for centuries. On the leaves of the kaluthin were phosphorus deposits that glowed with a faint light. Due to these deposits, when the kaluthin covered the planet, the planet itself radiated an \"aura\"."}, {"tag": "p", "text": "Over the centuries, the kaluthin spread across the planet and created a highly oxygen-rich atmosphere. However, trace elements of phosphorus and methane could still have detrimental effects on those who spent extended periods of time outside without a breath mask. The plants' kilometers-deep taproots also brought up heat from the planet's core, warming the surface. In addition, the purple-green grass gave the planet a distinct aural glow, mainly from the phosphorus it consumed. This living growth was unusually countered by the dark side energy on the planet, which originated in the desert region and slowly spread. The Jedi measured the spread to be one meter per year."}, {"tag": "p", "text": "Darth Rivan built there his Sith fortress, at some point before 1250 BBY. The castle was located on the desert side of the planet. It was built on this planet in hope to gather dark side energy from the Force-dense Cularin system. It was here that Darth Rivan tried to create an corps of Sith battlelords, but he was betrayed by his apprentice before he could do so."}, {"tag": "p", "text": "After decades of living there, Darth Rivan was expelled by the Jedi Knights during the New Sith Wars in the Battle of Almas. Parts of the fortress were destroyed, but its core resisted blaster fire. The Jedi left the planet, ignoring the remains of the building."}, {"tag": "p", "text": "The kaluthin, thriving even without Rivan, kept Almas from being worth mining. It grew everywhere besides near the Sith fortress, and its roots delved deep. What little mineral worth the planet had was not worth the added expense of removing the kaluthin from a mining site. However, the planet became a gardenlike site instead of the nightmare it had been - except around the Sith Fortress, where no life could thrive. The kaluthin also processed the phosphorus and generated a glow that illuminated the planet from itself instead of from the sky."}, {"tag": "p", "text": "After Reidi Artom re-discovered the system in 232 BBY, two Jedi, master Qornah and his Padawan Kibh Jeen, came to Almas to research Rivan's fortress. The Sith fortress corrupted Jeen, who slew his master, took over the asteroid belt pirates, and started the Dark Jedi Conflict (188-181 BBY). After the Conflict ended, a Jedi school was founded which grew into the Almas Academy, the headmaster of which was Jedi Master Nerra Ziveri, and then his former apprentice, Master Lanius Qel-Bertuk."}, {"tag": "p", "text": "The town of Forard grew up around the Academy. The Academy and Forard were built directly upon the kaluthin, which did not seem to affect the plant at all. There was also a kaluthin Forard research station near the town, where possible transplants of kaluthin to other planets were analyzed."}, {"tag": "p", "text": "Almas was the only planet in the system not occupied by clone troopers during the Clone Wars."}, {"tag": "p", "text": "In circa 19 BBY, the Dark Jedi Garth Ezzar attacked Almas and destroyed the Almas Academy, killing most of the Jedi there."}, {"tag": "p", "text": "Months after the Clone Wars, agents of Bail Prestor Organa infiltrated the ruined temple of the Almas Academy, and found it infested by dark side spirits. They managed to retrieve a holocron through which Jedi Master Denia was able to learn Farseeing techniques which enabled her to learn the identity of the Nazren. The ruins and surrounding area were also home to the Dark Lizards of the Sith; a species of Hssiss dragon that was thoroughly permeated with the dark side of the Force."}, {"tag": "p", "text": "During the Galactic Civil War, the Rebel Alliance established a base on Almas, near to the ruins of the Jedi Academy. Rumors of Alliance activity there reached the Galactic Empire, so Admiral Firmus Piett dispatched a group of Imperial agents to Almas, to investigate. Shortly after the agents arrived, the stormtrooper platoon that had been assigned to protect them went missing. The agents soon found the Rebel base, but it was abandoned. It was covered under a large amount of foliage and barricades had been erected by the Rebels, to protect them from attacked by dark lizards, Believers and t'salaks. A rescue party sent by the Alliance then arrived and they assumed that the Imperials had caused the disappearance of all their comrades in the base."}, {"tag": "p", "text": "Years were calculated on the planet and elsewhere in the Cularin system using the \"After Artom\" system of time measurement."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}