{"url": "Grotrugga", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Females", "Category:Force ghosts", "Category:Force-sensitives", "Category:Gamorreans"], "nodes": [{"tag": "h1", "text": "Grotrugga"}, {"tag": "p", "text": "Mother Grotrugga was a Force-sensitive Gamorrean leader of the Nuns of G'aav'aar'oon. She appeared to be a typical Gamorrean female who was motherly (if it was possible to call a 200 kilogram, fanged, pig-like alien motherly), kind, and placidly calm. Though she spoke fluent Basic, she did have an idiomatic turn of speech. When a group of Imperial Scouts posing as Rebel operatives came to their asteroid base on G'aav'aar'oon, Mother Grotrugga was more than happy to meet with them. After the group presented their fake Rebel Alliance ultimatum, demanding that the Nuns turn over complete control of the base to the Alliance, allowing them to arm it as a military base. Of course, Grotrugga refused these terms as she had no intention of allowing anyone to rearm the base."}, {"tag": "p", "text": "Following their orders, the group of Imperials shot Grotrugga dead and, to their surprise, she made no attempt to resist their attack; in fact, she appeared to expect it. The moment she was shot the fatal blow, she collapsed to the floor and her clothing suddenly flattened as the body inside them disappeared. She did what few Jedi had been able to do, and transformed herself into a Force ghost. The other Nuns, however, were stunned by the attack, and so the group of Scouts immediately departed from the asteroid. When they eventually became reorganized, the Nuns attempted to block the corridors of the asteroid to stop the Imperials from escaping. Grotrugga's voice, appearing as if from it was all around the base, ordered the Nuns to cease their attempts and allow the Imperials to escape."}, {"tag": "p", "text": "Once the group of Imperials had left on their ship, and about an hour into their hyperspace journey, Grotrugga appeared to them as a Force ghost sitting in the lounge of the ship. She soon scolded them for their actions, reprimanding them for using violence in a holy place, murdering poor innocent Nuns, impersonating their enemies, and working for \"that awful Darth Vader.\" She informed them that they would be corrupted by the dark side if they were not careful, and also let them know that she would be keeping an eye on them as well as her former convent."}, {"tag": "p", "text": "After her speech, she disappeared and returned to the asteroid base on G'aav'aar'oon to let her sisters know that it had in fact been Imperials and not Rebels who had murdered her. She would continue to both give her successor spiritual guidance, as well as to reprimand the group of Imperial Scouts whenever they performed acts that were particularly despicable."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}