{"url": "Ground_Assault_(PocketModels)", "categories": ["Category:Real-world articles", "Category:Star Wars PocketModel TCG"], "nodes": [{"tag": "h1", "text": "Ground Assault (PocketModels)"}, {"tag": "p", "text": "Ground Assault was the second installment of the Star Wars PocketModel TCGTM trading card game. Released on November 14, 2007, itintroduced an additional one hundred-twenty cards and thirty six styrene sheets—collectively printed with 67 units—to the game. Units included ship classes from the original and prequel films, as well as from the Expanded Universe, representing Rebel, Imperial, Republic, and Separatist forces. A stand-alone release, ownership of the Base Set was not required for game play, although cards and units from both sets were interchangeable. This expansion included ground units, such as AT-ATs and Spider Droids, and new rules for the use of ground units."}, {"tag": "p", "text": "Supplemental products for this expansion included the Battle for Hoth Tin (BHoth), which included a fixed 30 card deck focusing on the Battle of Hoth, and AT-AT, AT-ST, snowspeeder and tauntaun PocketModels (MSRP $19.99). The tin also included an exclusive emplacement to be used with an equally exclusive objective card. Each Ground Assault expansion pack (MSRP $4.99) for this release contained 2 styrene cards (4-8 PocketModels), 6 cards, 2 dice and a rules sheet."}, {"tag": "p", "text": "The pre-release tournament for Ground Assault was held at GenCon 2007. The expansion was originally scheduled for release in September 2007, but the release date was postponed to November. A promotional playmat poster was made available through mail-in offer with the purchase of five packs from participating retailers."}, {"tag": "p", "text": "New gameplay rules and concepts in the Ground Assault expansion included:"}, {"tag": "h2", "text": "Cards"}, {"tag": "h2", "text": "Units"}, {"tag": "h3", "text": "Battle of Hoth Tin"}, {"tag": "p", "text": "This Star Wars 30th Anniversary commemorative Battle of Hoth tin (BHoth) introduced a new type of playable piece called an emplacement that was deployable with an included exclusive Echo Base objective card. Due to factory errors, no rules book/model construction sheet was included, so only the following items were packaged in the tin:"}, {"tag": "p", "text": "Units"}, {"tag": "p", "text": "Cards"}, {"tag": "h3", "text": "Battle of Hoth Playmat"}, {"tag": "p", "text": "A mail-away coupon for a promotional Battle of Hoth-themed playmat (Hoth mat) was available on the official WizKids site, or at an LGS upon the purchase of five booster packs, and redeemable when sent in with five wrappers with the corresponding receipts for them. The playmat was divided into zones for use in playing the game, with other areas labeled for placement of cards and game pieces held in reserve."}, {"tag": "p", "text": "The background image of the playmat featured PocketModel units arranged in an icy landscape to portray a scene from Star Wars: Episode V The Empire Strikes Back during the Battle of Hoth. The zones and fields used in the game were labeled on the map in both Aurebesh and in English."}, {"tag": "h2", "text": "External links"}]}