{"url": "Almas_Academy", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Almas locations", "Category:Jedi academies"], "nodes": [{"tag": "h1", "text": "Almas Academy"}, {"tag": "p", "text": "The Almas Academy on Almas was an unorthodox Jedi training facility founded in 177 BBY. It was headed by the Almas Council."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The re-discovery of planet Almas and the remains of Darth Rivan's sith fortress in 232 BBY led the Jedi Order to send a research team in 188 BBY. Unfortunately, one of the researchers, Kibh Jeen, fell to the dark side and began an orgy of destruction throughout the system that would last for seven years, until the Jedi allied with local power groups to kill their former comrade."}, {"tag": "p", "text": "Four years after this Dark Jedi Conflict, a small Jedi school was established on the other side of Almas to keep an eye on the Sith fortress. Over time, more students arrived, and the school on Almas became a full fledged Jedi academy, with Twi'lek Jedi Master Nerra Ziveri as its headmaster since 119 BBY. He was succeeded in 56 BBY by his former Padawan, Lanius Qel-Bertuk."}, {"tag": "p", "text": "The academy was an experimental one. They accepted older students, a tradition which began with the local Tarasin. Eventually they accepted adults to begin training as Jedi, although those they accepted were carefully screened. The Almas Academy could never accept an applicant that had already been rejected by another praxeum."}, {"tag": "p", "text": "The Almas Academy was kept under scrutiny of the Jedi Council on Coruscant because of this experiment. The Council yearly sanctioned Almas students, occasionally sent Jedi Knights to teach in Almas, and particularly kept an eye on the potentially dangerous situation of the Fortress. Ziveri, on his part, believed that the best place to study the dark side is near it, and so the nearby Fortress was a boon, not a hindrance."}, {"tag": "p", "text": "As the Cularin system was quite isolated, the Academy attracted some Jedi who thrived in meditation and introspection."}, {"tag": "p", "text": "The Tarasins, who had their own traditions, were worried about their youngers studying far away from their local tribes or irstats, even with Ziveri making important changes to the study methods. Initially they believed that Tarasin Padawans would not graduate and the \"Jedi fad\" would disappear. As this did not happen, they decided to send a Force adept and Tarasin religious leader, Mother Missira, to become the resident irstat leader of Almas. Eventually she also became the Academy's chef."}, {"tag": "p", "text": "At some point between 56 BBY and 32 BBY, headmaster Qel-Bertuk bought droid E1-6RA to use her as the administrator of the Academy."}, {"tag": "p", "text": "In 31 BBY, the business conglomerate known as the Metatheran Cartel performed illegal activities in Cularin, but was discovered by locals. The Cartel blamed one individual manager, Velin Wir, for the crimes, and sent a new envoy, Thurm Loogg, to ask for permission to remain in the planet. Governor Barnab Chistor of Gadrin left the matter up to a vote. Several Padawans of the Almas Academy, along with E1-6RA, attended to the celebration, but abstained from voting, although many people had thought that the Jedi Order were going to vote as a block."}, {"tag": "p", "text": "Later that year, the Almas Academy sent representatives to the SoroSuub Anniversary celebration in Genarius. There, several diplomats and Jedi consuls were asked to mediate a conflict between Miim Te'Suub of the SoroSuub Corporation and Thurm Loogg of the Metatheran Cartel."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the first years of the Clone Wars, the Jedi of Almas Academy controlled Darth Rivan's old Almas Sith fortress, in the other hemisphere of the planet. A team of some 20 Jedi were sent to the Fortress, both to investigate the dangerous place and to keep it from the dark side sect known as the Believers. Jedi illusionist Treibeiu was assigned to the Fortress."}, {"tag": "p", "text": "During this time, the Fortress was raided by a team led by slaver Phylus Mon, who killed four Jedi and kidnapped two more. As three of those were missing in action, the Almas Academy organized a search effort, including non-Jedi just in case it was a bait to attract the more powerful Jedi in the Academy. The search was successful: The two kidnapped Jedi were found alive, but without their Force essence. Five other people, including Dark Jedi Karae Nalvas, were found in the same state."}, {"tag": "p", "text": "The Almas Academy was used to research this situation and try to find a solution. Accidentally, Almas Academy librarian Oden Malksch handled a piece of jewelry in Nalvas's body and possessed his body. Malksch/Nalvas now could lead one of the search teams to the place where the Force essences of the victims were being kept, to free them."}, {"tag": "p", "text": "After a successful ending of this mission, the Almas Academy also was the site of a celebration to honor the heroes."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "Near to the end of the Clone Wars, the Dark Jedi Garth Ezzar led an attack on the Academy and succeeded in destroying most of it. The surprise assault was carried out by three starships, only one of which escaped the assault. Ashka Boda and Halagad Ventor coordinated a secret network of the Academy's survivors. Unfortunately for them, most were killed when Ventor gave away their hidden location to Darth Vader during interrogation."}, {"tag": "p", "text": "The absence of the academy strengthened the planet's evil energies, causing the citizens of the surrounding city of Forard to act violently and in some cases simply drop dead. The academy site became a nexus of evil, and the city of Forard was abandoned."}, {"tag": "p", "text": "Soon after the destruction, Inquisitor Valin Draco and his protege Raik Muun explored the deep ruins of the academy in search of Darth Rivan's holocron. They found the holocron, whose Gatekeeper taught them ancient Sith secrets, and also led them to the Qornah Holocron hidden within the academy. With this new dark union, the ruins became plagued by several other evil beings, including Dark lizards, a t'salak, a Nighthunter, Believers, Force illusions, and Force parasites."}, {"tag": "p", "text": "Vhiin Thorla, an Almas instructor absent during the destruction, returned to the ruined academy with his Padawan Dorv'Tilsta to search for survivors after escaping Order 66. Deep in the ruins he dueled Valin Draco. Using the t'salak, Raik Muun sent Dorv into a wild rage, and set him upon his Master Thorla. Thorla was forced to kill his own Padawan in self defense. Broken, Thorla was imprisoned in a Universal Energy Cage."}, {"tag": "p", "text": "A task force of Jedi sympathizers were sent to the academy ruins by Jedi Master Denia to retrieve the Qornah Holocron. They managed to free Vhiin Thorla, defeat Draco and Muun in the lowest levels, escape an ancient k'kayeh dragon and deliver the Qornah Holocron to Master Denia. During this encounter, the academy ruins were further damaged, with the lower levels caving in."}, {"tag": "h2", "text": "Structure"}, {"tag": "p", "text": "The academy's original building was a circular structure architecturally similar to the Jedi Temple on Coruscant. In the decades after its founding, eight rectangular buildings were built gradually around the central structure as more students arrived, especially after the influx of Tarasin students. As with all buildings on Almas, each of the buildings was sealed against the planet's atmosphere. There were sealed walkways connecting each outbuilding to the central building, as well as to the two buildings on either side of it in the octagon. Contemplative gardens of stone, sand, and kaluthin were arranged in the inner courtyards, as well as kitchens, classrooms and the places of trials."}, {"tag": "p", "text": "The outbuildings were used for residences, while the center building was for teaching and utilitarian uses. The student dorms were arranged by age, proceeding clockwise around the octagon. The Jedi instructors also had quarters in the outbuildings, and there were accommodations for visitors and, since Qel-Bertuk's time, places to study skills not directly related to the Force."}, {"tag": "p", "text": "Forard, the only city on Almas, was built around the academy. It was founded to support the academy, though it grew to where many of the residents had nothing to do with the Jedi."}, {"tag": "h2", "text": "Curriculum"}, {"tag": "p", "text": "The Almas Academy's curriculum had a few changes from Coruscant's. There were not as high a teacher to student ratio at Almas, so Nerra Ziveri extended the time that students stayed in the group learning environment. All of the Masters spend time with the younglings. When a student became a Padawan, they did not immediately become an apprentice to a single Master. Instead, they spent time learning from a mentor in the academy, alongside other students. After an amount of time no lesser than three years with a mentor, the Padawan \"graduated,\" and could choose to continue to study at the academy, or apprentice with a Master from outside the academy."}, {"tag": "p", "text": "As the Almas Academy was a very closed environment, and the students were not going on missions with their Masters as Coruscanti Padawans were (specially Tarasins, who were not prone to leave their system for a long time), Ziveri initiated a program called Jedi quests: During their time at the academy, students were required to leave the Cularin system at least three times. Usually these were simple errands assigned by Master Lanius or the student's mentor. Depending on the task's complexity or danger, the mentor might accompany the student. Each student undertook a Jedi quest once per year since he or she was twelve years old. Those students which had graduated but stayed at the academy were required to take a younger student with them on their quests."}, {"tag": "p", "text": "The Almas Academy's placement on the same planet as a Sith fortress was to serve as a constant reminder of the dark side. A part of the academy's curriculum was the annual Ritual Tale of Kibh Jeen. Started by Nerra Ziveri, the Ritual was a yearly recounting of the story of the Dark Jedi Conflict, which also discouraged students from exploring the nearby Sith Fortress. Ziveri eventually started having one of the oldest students tell the story, and over time it evolved into the elder students reenacting it as a drama with one of the Masters portraying Jeen."}, {"tag": "h2", "text": "Individuals"}, {"tag": "p", "text": "Headmasters:"}, {"tag": "p", "text": "Teachers and Masters:"}, {"tag": "p", "text": "Students:"}, {"tag": "p", "text": "Staff:"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The differences between Almas and Coruscant were implemented so as not to restrict the options of Living Force players. So that players could multiclass into a Jedi class after 1st level, the Almas Academy accepted adults. Group learning and Jedi quests helped explain why Padawans would be having adventures without their Masters by their sides."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}