{"url": "Almas_Council", "categories": ["Category:Legends articles", "Category:Jedi Councils"], "nodes": [{"tag": "h1", "text": "Almas Council"}, {"tag": "p", "text": "The Almas Council was a satellite Jedi Council made up of the six head instructors at the Almas Academy, and led by the Academy's Headmaster. While a separate entity, the Almas Council was subject to the orders of the Jedi High Council on Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Four years after the Dark Jedi Conflict and the rediscovery of Almas, a small experimental Jedi academy was established on the planet to oversee the stewardship of the Fortress of Darth Rivan. As the academy expanded, a Council of leading instructors was formed, meeting in a torch-lit chamber in the academy complex's central building. Originally formed in 119 BBY, the Council was overseen by the Twi'lek Jedi Master Nerra Ziveri as the Academy's headmaster. Ziveri was succeeded in 56 BBY by his former Padawan, Lanius Qel-Bertuk as the leader of the Council and the academy's Headmaster."}, {"tag": "p", "text": "The academy was an experimental one. They accepted older students, a tradition which began with the local Tarasin. Eventually they accepted adults to begin training as Jedi, although those they accepted were carefully screened. The Almas Academy could never accept an applicant that had already been rejected at another academy."}, {"tag": "p", "text": "While the Council was charged with overseeing Jedi affairs in the Cularin system, their teaching regimen was subject to scrutiny by the Council of First Knowledge and their policies were overseen by the Jedi High Council on Coruscant. An annual sanction by the High Council ensured that students were receiving approved training, and instructors from Coruscant were often appointed."}, {"tag": "p", "text": "When the Confederacy of Independent Systems and the Republic went to war, many members of the Council rebuffed attempts by Coruscant to gather Almas Jedi to fight in the Clone Wars. While many invoked the Right of Denial, Master Darrus Jeht of Coruscant was able to send many Knights and Padawans off planet to be reassigned. Staying behind on the world to teach, Jeht joined the Council and attempted to ease tension with Coruscant."}, {"tag": "p", "text": "Shortly before the end of the war, a CIS fleet appeared in Almas' orbit and bombarded the planet from orbit. The Council, and most of its members, had been routed and destroyed."}, {"tag": "h2", "text": "Organizations and politics"}, {"tag": "p", "text": "The Almas Council was composed of seven members, five head instructors, a Coruscant emissary and the Academy Headmaster. Meeting in a torch-lit, stone chamber at the heart of the academy, the Council met annually to discuss curriculum, teaching methods, and the knighting of students. The members met around a long table, with a seat at one end for the headmaster, and one at the other for the Coruscant emissary."}, {"tag": "p", "text": "Members of the Council typically held titles within the Order not found outside of Almas. The academy's battlemaster or Mistress of Lightsabers organized the academy's lightsaber instruction courses, while the Master of Visions was the leading Seer. The head of the philosophy department also had a seat on the Council."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}