{"url": "Grounded", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "Grounded"}, {"tag": "p", "text": "\"Grounded\" is a short story in the anthology From a Certain Point of View. The story is written by Greg Rucka, and focuses on the character Nera Kase, a Rebel Alliance mechanic stationed at Base One during the Battle of Yavin."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Prior to the Battle of Yavin, twenty-seven year old Rebel Alliance mechanic Nera Kase reflects on her family. Her parents had raised her in the Phirmist tradition of the Force. They were spacers who traveled throughout the galaxy transporting cargo from the Core Worlds to the Outer Rim Territories and the Mid Rim. Nera had joined the Rebellion after the Galactic Empire had impounded her family's ship. Within the space of seven minutes, Nera Kase had lost her home and family. Due to her dangerous work with machinery, Nera keeps her head bald."}, {"tag": "p", "text": "Following the departure of Red and Gold Squadrons for the strike against the Death Star, Nera listens to audio feedback of the rebel pilots being played over the base's overhead system. Kase thinks about the prospects of the various rebel pilots including Red Leader Garven Dreis, Elyhek Rue, Wedge Antilles, and newbie Luke Skywalker. Due to the heavy losses sustained at the Battle of Scarif, Nera thinks that the Battle of Yavin will be no different. Nera reassures herself that she and her fellow mechanics by caring for the starfighters care for their pilots themselves. Each rebel starfighter is serviced by a ground team of five to six personnel."}, {"tag": "p", "text": "After reflecting on the losses at Scarif, Nera enters the command center. She finds three of her crew chiefs Benis, Ohley, and Wuz watching a map of the rebel assault on the Death Star. She also sees General Jan Dodonna, Princess Leia Organa, and the protocol droid C-3PO. Nera monitors the progress of the battle through the tracking board, recalling each pilot's statistics (flight hours, ace status, number of confirmed kills). She is present when the death of Jek Tono Porkins is reported. For the next seventeen and a half minutes, Kase ticks the name of rebel casualties on her datapad. Besides a few cases of fatal damage from flak, with one unconfirmed loss to it, most of the rebel pilots are shot down by TIE fighters."}, {"tag": "p", "text": "As the Battle of Yavin drags on, the rebel fighters are down to four ships. Nera records the death of Biggs Darklighter. She is also present when the command crew report that Skywalker has switched off his targeting computer. When Skywalker's astromech droid R2-D2 is hit by enemy laser fire, Kase fears that the Rebellion has lost and that Yavin 4 will face the same fate as Alderaan. Nera then hears Han Solo speaking as he comes to Luke's rescue and chases away Darth Vader's TIE Advanced x1 starfighter. Nera is present when the rebel monitor reports the destruction of the Death Star. As her fellow rebel comrades celebrate, Kase goes to her private console and weeps with tears of joy and relief."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}