{"url": "Almec/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Government figures", "Category:Humans", "Category:Males", "Category:New Mandalorians", "Category:Shadow Collective members", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Almec"}, {"tag": "p", "text": "Almec was a male Human Mandalorian from the planet Mandalore, and a member of the peaceful New Mandalorian faction. During the Clone Wars, Almec served in the New Mandalorian government as Prime Minister, taking up residence in the New Mandalorians' domed capital city of Sundari. A supporter of New Mandalorian ruler, Duchess Satine, Almec was a firm believer in the New Mandalorians' peaceful ways and did as he thought best to watch over and represent the interests of Mandalore. His dedication to his people became his undoing, however, as when Mandalore was cut off from Republic aid, Almec took it upon himself to establish a black market trade network of illicit smugglers to bring much needed goods to the New Mandalorian people. These smugglers poisoned the people of Sundari with slabin-tainted tea, putting numerous children in the hospital. Almec was exposed as the leader of the black market network, and therefore one of the parties responsible for the children's poisoning, and was summarily imprisoned for his crimes."}, {"tag": "p", "text": "When Darth Maul took over Sundari around 20 BBY, he broke Almec out of prison and reinstated Almec as Prime Minister over Armatan after Maul disposed of Pre Vizsla."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Human native of the planet Mandalore, Almec was a member of the pacifistic New Mandalorian faction of Mandalorians and a strong supporter of their peaceful ways. By the time of the Clone Wars, Almec had become the New Mandalorians' Prime Minister, serving at the head of the Ruling Council of ministers that comprised the New Mandalorian government. Around the year 22 BBY, he met with Jedi Master Obi-Wan Kenobi upon his arrival on Mandalore, in the New Mandalorian capital city of Sundari. Kenobi had been sent by the Jedi Council to ascertain the truth behind rumors that Duchess Satine Kryze, leader of the New Mandalorians, was building a Mandalorian army to fight for the Confederacy of Independent Systems, although Almec assured the Jedi that these rumors were false. He wholeheartedly believed that Mandalore would never turn against the Galactic Republic, stating that the infamous violence of the Mandalorians was confined to their past. When Kenobi mentioned his encounter with the Mandalorian mercenary Jango Fett, Almec—either unaware of, or unwilling to accept the fact that Fett had been the Mand'alor, the traditional leader of the Mandalorians' warrior clans—dismissed him as nothing but a mere bounty hunter who'd acquired his armor by unknown means."}, {"tag": "p", "text": "During Kenobi's audience with Duchess Satine Kryze, Almec spoke out when the Jedi Master presented a recording of a Mandalorian saboteur responsible for an attack on a Republic cruiser, declaring that no Mandalorian would perpetrate such an attack. Although the Prime Minister expressed interest in the whereabouts of the Mandalorian in question, he appeared quite shocked when Kenobi revealed that the man had chosen suicide rather than submit to questioning. Following the revelation that the saboteur was a member of the resurgent group known as the Death Watch—a Mandalorian splinter-faction intent on returning the Mandalorians their ancient ways, with the ultimate goal of starting another war of conquest—and that the once trusted ally Pre Vizsla, the Governor of Mandalore's moon Concordia, was now leading the Death Watch, Almec was part of the cadre of retainers and guards that escorted Kryze to her personal starship, the Coronet, for her trip to Coruscant. There, she hoped to convince the Galactic Senate that the Death Watch did not represent the views of the entire Mandalorian community."}, {"tag": "p", "text": "While the Duchess spoke on behalf of her people in the Senate chamber, Almec remained on Mandalore. It was there that he received a troubling report from a Mandalorian scout: the Death Watch was amassing an army at their base on Concordia. Almec agreed with the scout's assessment that the Death Watch would be unable to take over Mandalore without the popular backing of its residents, although he also surmised that were the Republic to deploy a military force as they planned to do, it would drive the people to support the Death Watch as liberators standing against foreign oppressors. Left with no other recourse, Almec could only place his trust in Duchess Satine's efforts, trust that was rewarded when the Duchess convinced the Senate against sending an occupying force of clone troops to Mandalore."}, {"tag": "p", "text": "The Duchess' efforts successfully allowed Mandalore to remain free of entanglement in the Clone Wars, but it's neutrality came at the cost of losing vital Republic aid in the form of supply shipments. In response, Almec took it upon himself to establish a network of black market trade in order to ensure the continuing importation of much needed supplies for the New Mandalorian people. At a later point in time, Republic Senator Padmé Amidala came to Sundari to assure the New Mandalorian government that aide would come from sympathetic parties within the Senate. During her stay, Amidala, together with Kryze, discovered the illegal smuggling ring circumventing the previous loss of Republic trade, when it was revealed to endanger the lives of Mandalorian children. The Moogan smugglers moving the goods had diluted imported tea with the chemical slabin, which in the high doses used by the smugglers proved toxic to its consumers. Almec was informed of this development by Amidala and Kryze, though he reflectively implicated the Death Watch as the party behind the illicit activities. When the Duchess and senator shut down the smuggling ring and brought the issue of the corruption growing in the New Mandalorian government to Almec's attention, the New Mandalorians' Prime Minister offered to form a committee to further investigate the issue."}, {"tag": "p", "text": "Not long after, Jedi Padawan Ahsoka Tano was invited to Mandalore in order to lecture at the New Mandalorian Royal Academy on the perils of corruption. She was met at the landing platform in Sundari by Almec, Kryze, and a gathering of New Mandalorian academy cadets. These cadets—Amis, Lagos, Soniee, and Duchess Kryze's own nephew, Korkie—along with Tano, uncovered Almec's involvement in the black market trade network, and thus his complicity with the poisonings of Sundari's school children. Using the New Mandalorian Secret Service, over which the Prime Minister's office held authority, Almec had the cadets and Tano arrested, in addition to Duchess Kryze herself upon learning that she had been informed of his involvement as well. He attempted to have the Duchess sign a confession of conspiracy, but upon being denied, Almec used a shock collar as a means of persuading her. When Kryze refused to yield, he turned his attention to her nephew, Korkie; Tano and the cadets fought back, managing to overpower Almec and his guards until he could be fitted with a shock collar, himself, forcing the Prime Minister to surrender. Almec and his conspirators were placed under arrest, and subsequently imprisoned."}, {"tag": "p", "text": "Some time later, after Death Watch allied with crime syndicates and the Sith brothers, Darth Maul and Savage Opress, Kryze was overthrown in a political coup led by Pre Vizsla and was imprisoned in a cell next to Almec. The former Prime Minister refused to apologize for his past actions and mocked Kryze for her beliefs. He was later recruited by the Nightbrothers, who had been betrayed by Death Watch, to stand as their puppet ruler once they had overthrown Vizsla. Maul then challenged Vizsla to an honorable death match for the allegiance of Death Watch, which he inevitably won. Almec was then reinstalled as Prime Minister and told the general populace that Satine murdered Vizsla. He then began setting up a new administration, and Maul warned that him that he would be held fully responsible for their failures. Almec was later present in the throne room when Obi-Wan Kenobi was brought before Maul and bore witness to Satine's murder by Maul."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Almec was a large man, standing at a height of 1.89 meters, and possessed both blond hair and fair skin, in addition to violet-colored eyes. Almec was a firm believer in the peaceful ways of the New Mandalorians, and took great pride in the success the New Mandalorian government had in renouncing the violent reputation Mandalore had held in the past. He came to resent the opinion of offworlders who associated Mandalore only with the planet's warrior clans rather than the progressive New Mandalorian society, and in keeping with the low opinion the New Mandalorians generally held for Mandalore's warrior clans, he angrily dismissed the former Mand'alor Jango Fett as nothing but a common bounty hunter, when questioned by Jedi Master Obi-Wan Kenobi. While he held a high-ranking office in the New Mandalorian government, Almec was a humble man, preferring simple clothes and considering himself a servant of the people. That did not change the fact that Almec was a talented, dignified diplomat, and shrewd politician, able to correctly deduce the Death Watch's plans to rally favor for their cause by instigating a Republic invasion in order to appear as liberators to the Mandalorian populace. Almec was a friend of the New Mandalorians' leader, Duchess Satine Kryze, and placed a great deal of faith in her leadership abilities."}, {"tag": "p", "text": "When the New Mandalorian people were threatened with starvation after the Republic shut down trade routes to Mandalore in the face of the planet's declared neutrality, Almec took it upon himself to find a solution to the problem plaguing his people. To that end, he established an illegal black market trade network to smuggle the needed goods from the galaxy into Sundari, but in doing so, opened himself up to the risk of greed and corruption. In trying to help his people, Almec instead made it possible for Moogan smugglers to poison innocent children throughout Sundari with toxin-laced tea, and in trying to cover it up, turned on his long-time friend and ally Duchess Kryze and betrayed his pacifist beliefs by torturing Kryze and threatening to do the same to her young nephew, Korkie."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Almec first appeared in the Star Wars: The Clone Wars Season Two episode \"The Mandalore Plot,\" the first in a trilogy of episodes featuring the Mandalorians. He would appear again in the flashback reel at the start of the subsequent episode, \"Voyage of Temptation,\" before making his second true appearance in the final episode of the trilogy, \"Duchess of Mandalore.\" Almec received entries in both the The Complete Star Wars Encyclopedia and The Clone Wars Character Encyclopedia."}, {"tag": "p", "text": "Almec's hair and clothing incorporate the same hexagonal design of the small, center plate of traditional Mandalorian chest armor, and in elements of Sundari's architecture."}, {"tag": "p", "text": "Almec is voiced by actor Julian Holloway."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}