{"url": "Guardian-class_patrol_ship", "categories": ["Category:Legends articles", "Category:Airspeeders", "Category:Galactic Empire vehicles", "Category:Tion Industries products"], "nodes": [{"tag": "h1", "text": "Guardian-class patrol ship"}, {"tag": "p", "text": "Guardian-class patrol ships, also known as XL-5 Guardians, were among the few combat airspeeders used by the Galactic Empire. Though they were in high demand throughout the Imperial Military, most of them were used by Imperial Intelligence."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Though their primarily role was not combat, Guardians were armed with two blaster cannons, mounted on the left side and right-underside. These weapons could be fired individually, with the pilot and co-pilot operating the left and right cannon respectively. When fired individually, each cannon could fire to the side or forwards. They could also be fixed to both fire in the forward arc, and fire-linked together for added firepower."}, {"tag": "p", "text": "Aesthetically, the Guardian's design was similar to the MB-C1 medium transport."}, {"tag": "p", "text": "They came in multiple models, with XL-3 and XL-5 being the most common."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Guardian-class ships were most prominently used as part of the Imperial forces guarding the Imperial Freight Complex on Byss during Operation Shadow Hand, or as patrol craft on other highly urbanized Imperial core worlds."}, {"tag": "p", "text": "The Guardian-class patrol ships' role was observation, rather than combat. On Byss, they patrolled on randomly assigned routes that allowed a few hundred of them to cover the entire planet. They monitored air traffic with sophisticated scanners and probescopes. Each Guardian also acted as coordinating stations for several dozen Hunter-Killer probots. If a Hunter-Killer ran into problems or ceased functioning, the crew of the Guardian would be on the scene in moments to assign backup probots, signal to headquarters for more support, and act as forward observers."}, {"tag": "p", "text": "Some Imperial Intelligence Guardians were disguised as civilian vehicles, and outfitted with more sophisticated sensors. These vessels were used as spy vehicles, covertly observing suspected enemies of the Empire."}, {"tag": "p", "text": "All Guardians could also be used as prisoner transports, with space available for twelve captives."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During a rescue attempt on Byss in 10 ABY, the Millennium Falcon was chased by a Guardian-class ship after entering Security Zone One around the Emperor's Citadel. The patrol ship's gunner was tricked by Leia Organa Solo's Force-powers into believing the ship had disappeared from all sensors, even his viewing screen. His superior lamented the man's idiocy, as he had been unaffected and saw that the ship was fully visible in front of them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}