{"url": "Guardian_(Venator-class)", "categories": ["Category:Legends articles", "Category:Galactic Republic starships", "Category:Venator-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Guardian (Venator-class)"}, {"tag": "p", "text": "The Guardian was a Venator-class Star Destroyer employed by the Republic Navy during the Clone Wars. Under the command of the Human male, Captain Serros, the Republic cruiser engaged the Separatist Supreme Commander of the Droid Armies, General Grievous's fleet and was crippled in the battle. Though severely damaged, with the help of a Jedi General, the Guardian managed to repel its attackers and its crew were able to repair enough of the damages to escape to hyperspace."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Guardian was a Venator-class Star Destroyer that served in the Grand Army of the Republic's navy during the Clone Wars. Marked with red colors, the Guardian was equipped with turbolasers and a hyperdrive, and gravity generators. It also featured a pair of command towers and eight engines."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Guardian was placed under the command of Captain Serros during the galactic conflict between the Republic and the forces of the Confederacy of Independent Systems. In 21 BBY, during the Clone Wars, the Guardian was stationed in the Outer Rim Territories and was engaged in a battle with the Separatist Supreme Commander, General Grievous, where it was heavily damaged. In response, a Jedi General was dispatched to aid the crippled capital ship, only to learn upon arrival that Grievous was attempting to take the cruiser with a large number of battle droids forcefully boarding the ship."}, {"tag": "p", "text": "The Jedi issued orders to the Guardian's clone crew to errect defenses along the ship's damaged hull; the Guardian's gravity generators were even converted into a weapon capable of slowing the advancing droids. The Jedi's plan was a success, and the constructed defenses held firm against the Droid Navy's assault, allowing Republic technicians the time they needed to repair the Guardian's hyperdrive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Republic Venator-class Cruiser, Guardian, first appeared in the Sony Online Entertainment massively multi-player online game Clone Wars Adventures in the Republic Defender stage \"Adrift.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}