{"url": "Guardians_of_the_Republic_Squadron_Pack", "categories": ["Category:Real-world articles", "Category:X-Wing: Second Edition Expansion Packs: Third Wave"], "nodes": [{"tag": "h1", "text": "Guardians of the Republic Squadron Pack"}, {"tag": "p", "text": "The Guardians of the Republic Starfighter Expansion Pack is an expansion to the tactical ship-to-ship combat game Star Wars: X-Wing Second Edition announced by Fantasy Flight Games on November 9, 2018, and released on March 21, 2019. It is a Galactic Republic expansion to the Third Wave of the Core Set for the new stand-alone game, and along with Servants of Strife Squadron Pack, the first of the Clone Wars content for the game."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "War! The Galactic Republic reels from the blow dealt by the the fledgling Separatist Alliance. But even in this age of uncertainty and disunion, heroes arise. Legendary Jedi Knight Obi-Wan Kenobi valiantly leads dedicated clone pilots into battle against the forces of tyranny and chaos in the Guardians of the Republic Squadron Pack for X-Wing!"}, {"tag": "p", "text": "This pack gives you everything you need to begin building your Galactic Republic squadrons, including one Delta-7 Aethersprite miniature and two V-19 Torrent miniatures. The chosen interceptor of many Jedi, the Delta-7 allows them to use their Force-enhanced reflexes to the fullest. Behind them, clone pilots cover them from their V-19 Torrents with coordinated fire, tight formation flying, and salvoes of missilies. In addition to the miniatures, this Squadron Pack gives you the chance to further explore the potential of the Force with several new Force upgrade cards. Meanwhile, a wealth of other upgrade cards—including reprints of many common neutral upgrade cards—provide a wealth of options for customizing your squadrons."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Miniatures"}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Pilots"}, {"tag": "h4", "text": "Upgrades"}, {"tag": "h5", "text": "Talents"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}