{"url": "Guavian_security_soldier", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Guavian security soldier"}, {"tag": "p", "text": "Guavian security soldiers, also known as Guavian Death Gang soldiers or Guavian Enforcers, were cybernetically enhanced humans employed as security soldiers by the criminals of the Guavian Death Gang in operation roughly thirty years after the Battle of Endor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Guavian security soldiers were recruited after swearing loyalty to the Guavian Death Gang in exchange for their cybernetic augmentation. A mechanical reservoir pump acted as a second heart, injecting a secret mixture of chemicals directly into each soldier's bloodstream to boost their physical abilities. The soldiers wore high-impact cybernetic armor and communicated via high frequency data streams transmitted from the central sensor and broadcasting dish in their faceplates. Weaponry used by the soldiers consisted of black market prototype weapons, such as Tostovin Munitions's micro-grenade launcher and percussive cannon."}, {"tag": "p", "text": "A squad of Guavian enforcers accosted Marcus Speedstar during the Platform Classic. They took his mechanic hostage in order to ensure that Speedstar paid back his debt, which he ultimately did after winning the race."}, {"tag": "p", "text": "Guavian security soldiers accompanied Bala-Tik when he confronted Han Solo and Chewbacca the freighter Eravana about the 50,000 credits Solo had borrowed from the Guavian Death Gang and not yet returned. After Kanjiklub joined the confrontation and Bala-Tik recognized BB-8 as the astromech droid wanted by the First Order—having been brought to the ship by First Order fugitives Finn and Rey—Rey accidentally released the three rathtars that Solo was transporting. A skirmish subsequently broke out, which resulted in many security soldiers being killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Guavian security soldiers first appeared in the 2015 film Star Wars: Episode VII The Force Awakens. Their design was based on concept art originally created for the \"Jedi Killer,\" the character who eventually became Kylo Ren."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}