{"url": "Gudb", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:Individuals of unidentified species", "Category:Males", "Category:Members of Bogga's gang"], "nodes": [{"tag": "h1", "text": "Gudb"}, {"tag": "p", "text": "Gudb was a male gangster and scourge of the Stenness star system in the name of Great Bogga the Hutt. He was the primary henchman in Bogga's enforcer gang, a group of beings that exercised Bogga's will throughout Stenness. Gudb had a pet gorm worm named Skritch, with whom he had faced many an opponent, including Jedi on occasion. In 3999 BBY, Gudb and his gang encountered the Human Jedi Andur Sunrider and family on the Stenness Hyperspace Terminal, from whom the gangster was ordered to steal a cache of Adegan lightsaber crystals. He killed Sunrider in the process, but was ultimately driven off without the crystals by the deceased's widow, Nomi, who had taken up his lightsaber and with it slew two of Gudb's companions."}, {"tag": "p", "text": "He returned to Bogga's stronghold defeated, and the Hutt chose to accompany Gudb on his next mission—to the planet Ambria, where the woman had fled to safety and had since become the charge of a resident Jedi Master. Gudb and his thugs were challenged by the Vultan Jedi Oss Wilum upon their arrival, who they overcame and prepared to kill, but were defeated again when Wilum's Master Thon attacked and overwhelmed them with his strength in the Force. Bogga later sent Gudb and his gang back to Ambria, to once again attack the Jedi and retrieve the crystals. Gudb's forces would have succeeded, were they not set upon by the same timid woman from the hyperspace terminal, who confused Gudb's men with Jedi battle meditation and cut them down with her lightsaber. Rather than stay and face Nomi Sunrider again, Gudb chose to flee Ambria in defeat and instead face the wrath of Bogga the Hutt."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Stenness pirate"}, {"tag": "p", "text": "Gudb was a pirate of the Stenness star system in the service of Stenness' resident crime lord, a Hutt known as Great Bogga. Though Bogga himself held court in his private residence on the moon of Vo Dasha, his gang of thugs, of which Gudb was foremost, frequented the local hyperspace terminal. There, Gudb and his partners engaged in various acts of piracy and waited to prey upon unsuspecting travelers who were unfortunate enough to encounter them. He often operated with his pet gorm worm Skritch, whose poisonous bite was a weapon employed by Gudb in combat. Gudb and Skritch encountered many foes in their time together, several of which were Jedi. From these encounters, Gudb learned that by disrupting a Jedi's concentration, they became vulnerable, which made them easier to defeat."}, {"tag": "p", "text": "In 3999 BBY, Gudb and two of Bogga's other enforcers, Quanto and Rek, were monitoring the Stenness space station's comm traffic, scouting for potential victims to take advantage of. Several opportunities presented themselves, including the arrival of a ship containing a considerable load of spice from Kessel, which Quanto expressed interest in. Gudb declined the opportunity, citing the fact that the bay where the ship docked was located on the opposite side of the station, making a timely interception of the vessel virtually impossible. Neither was he excited by the arrival of two aristocrats on board a pleasure yacht out of the Empress Teta system. Gudb's interest peaked when he noticed the arrival of a third ship, whose passengers, Jedi Knight Andur Sunrider and his family, were in possession of precious Adegan crystals. Knowing that Bogga would be particularly interested in the crystals, Gudb ordered Quanto to distract the Jedi, while he set out immediately for instructions from the Hutt."}, {"tag": "p", "text": "Bogga saw the crystals as leverage with which he might broker a deal with a client of his, and so tasked Gudb with stealing them. Gudb was also warned to heed his quarry's Jedi status, but the gangster felt confident in his ability to succeed with Quanto, Rek, and Skritch at his side. He and his team then set out to ambush the unsuspecting family, whose service droid, A-3DO, they encountered first. Gudb fell into the crowd as Quanto and Rek accosted the droid, causing the Jedi to approach in his droid's defense. Gudb positioned himself behind Sunrider, then bid Skritch to fill his poison sacs and attack the Jedi. The gorm worm bit Sunrider on his neck, releasing its stored venom into the Jedi's bloodstream. Sunrider fought briefly to free himself from the lizard's bite before he succumbed to the poison and died. Gudb immediately demanded the crystals from the Jedi's bewildered wife, Nomi, lest she suffer the same fate. The seemingly delusional woman began to converse with someone whom Gudb could neither see nor hear, and she shocked him further when she picked up her fallen husband's lightsaber, first bisecting Quanto, then turning her wrath on Rek and cutting him down as well. With his two comrades killed in a matter of minutes, Gudb recognized that the conflict was now evenly matched and considered his chances of beating the female Sunrider slim at best. Gudb turned and ran instead to report his failure to Great Bogga."}, {"tag": "h3", "text": "Jedi ambush"}, {"tag": "p", "text": "Gudb's empty-handed return was looked upon unfavorably by his Hutt boss. He attempted to explain how the Jedi's wife unexpectedly killed Quanto and Rek, yet Bogga was still unmoved. He considered feeding Gudb to his pet Hssiss dragon, Ktriss, who drooled upon sight of the enforcer. Gudb cowered in fear while begging for another chance to serve Great Bogga, and he was granted one—only next time, Bogga himself would join Gudb on his mission."}, {"tag": "p", "text": "Months passed, and Bogga's sources discovered that Sunrider had fled to Ambria, a desolate planet in the Stenness Node of the Inner Rim. Gudb, along with Bogga and the remaining enforcers, boarded the Hutt's personal dreadnaught, Enforcer One, on a course for Ambria. When they arrived, Gudb and the enforcers immediately set out for the camp where Sunrider had taken up residence. They found and infiltrated her ship, the Lightside Explorer, where Gudb startled A-3D0, the same droid that he had encountered back on Stenness' space station. After his demands for the crystals were refused by the droid, Gudb shot him with his blaster rifle, completely incapacitating him. He surmised that the crystals were not onboard the ship and proceeded to set out for the Jedi's nearby camp."}, {"tag": "p", "text": "Gudb and the enforcers came across a herd of staga beasts outside the Jedi compound and began killing them upon Bogga's orders. This attracted the attention of one of the Jedi inside, the Vultan Oss Wilum, who charged out in defense of his cattle. Gudb fired several shots at him while one of the other enforcers blindsided the Jedi, knocking him to the ground. As Gudb prepared to personally execute the defeated Wilum, his Jedi Master, the Tchuukthai called Thon, charged from the compound. Gudb and the enforcers quickly fired their rifles at the Jedi, only to witness Thon repel their shots with the Force. Bogga then ordered the retreat, recognizing the Jedi's power as one Gudb and his team could not defeat."}, {"tag": "h3", "text": "Return to Ambria"}, {"tag": "p", "text": "In Bogga's palace on the moon of Vo Dasha, Gudb was ordered to prepare Enforcer One for departure, as the Hutt was sending him back to Ambria to recover the crystals. Gudb was also furnished with Mandalorian manacles, believed by Bogga to be capable of restraining even a Jedi Master. Gudb was sworn to success; should he fail again, Bogga threatened to truly feed him to his pet Ktriss. He was then sent with a considerable number of Bogga's enforcer gang, determined to capture both the Jedi and the Adegan crystals in their possession."}, {"tag": "p", "text": "Arriving outside the Jedi's camp in one of Bogga's armored skiffs, Gudb and his team immediately spotted Thon, Sunrider, and her child and attacked, destroying their hut with a barrage of missiles. The enforcers then positioned the skiff between the Jedi and their ship, the Lightside Explorer, and Gudb led the ground assault on the compound in search of the crystals. Their blaster fire successfully chased off the protocol droid and seemingly forced Thon to surrender. After taking him into custody, Gudb announced that he had located the Adegan crystals. When he further alluded to his expectation that Bogga would hold him in favor for completing his mission, the other enforcers grew angry with Gudb, who they felt had accepted credit for a job he barely participated in. Gudb then rebuked them all and seized the crystals as his own, which caused several of the enforcers to stake their own claims and confront Gudb for their share of the booty. Soon Gudb and all of the enforcers were fighting each other, unknowingly suffering from the confusion of Nomi Sunrider's battle meditation technique. Gudb only realized the manipulation as the Jedi woman charged toward them with an ignited lightsaber, and fled before she could cut them down. Gudb, however, believed that Bogga's wrath would be far greater than Sunrider's once he learned that a dozen of his men were bested by two Jedi. He rallied the enforcers for a final charge, but they were soundly defeated by Sunrider and Thon, who was freed in the midst of the enforcers' indecision. Reconsidering his original position, Gudb ordered a full retreat, willing to instead face the anger of Great Bogga over the strength of the Jedi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gudb was a short, rat-faced being, with large ears, black eyes, and tan fur that covered his body. He wore a brown tunic, hat, and loincloth, with a utility belt equipped with his personal blaster pistol on his left side. Gudb could often be seen with his green pet gorm worm, Skritch, curled around his neck. He was witty and loquacious, and regularly spoke in Galactic Standard Basic slang, though he understood Huttese, but was not fluent. Gudb was also bossy, often barking orders at Bogga's other enforcers, such as Quanto and Rek. He valued his pet gorm worm Skritch highly, and occasionally bragged about their joint exploits in the company of others."}, {"tag": "p", "text": "Gudb was an opportunistic criminal, quickly seizing any opportunity he felt would enhance his own position, such as when he attempted to keep the Adegan crystals for himself upon locating them. Before his fellow enforcers, Gudb displayed a tough disposition; however, in the presence of Great Bogga, to whom he was most loyal, Gudb was rendered utterly subservient, going so far as to stutter his words and even grovel when threatened with severe disciplinary action by his Hutt boss."}, {"tag": "p", "text": "Gudb showed no respect for women, children, or anyone whom he considered weaker than himself. He used intimidation when facing those he saw as lesser opponents and resorted to making threats should his victims offer any sort of resistance. He displayed a lack of compassion in refusing to allow Nomi Sunrider a moment of grief, despite her having just witnessed her husband's murder by Gudb's design. Gudb was an aggressive individual, but when faced with odds he felt were not in his favor, he would reconsider his standing and usually make a quick exit. A fair fight to Gudb meant that he was the combatant with superior numbers and superior weaponry; when presented with an opponent who potentially stood on equal ground as him, Gudb preferred to disengage his enemy and make a speedy exit, rather than possibly suffer defeat."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Gudb was able to handle blaster weapons and was skilled in operating communications and starship equipment. Gudb was cunning and bragged about his ability to contend with Jedi, claiming to have encountered and bested them during combat several times in his past. He did possess skills in undermining a Jedi's concentration to defeat them, as done with Andur Sunrider. He would also surprise his enemies with his pet gorm worm Skritch, whose poisonous bite carried the potential to kill its victims. He preferred to keep his pet with him and expressed regret on one occasion for not bringing Skritch along into battle."}, {"tag": "p", "text": "Gudb experienced firsthand what a lightsaber was capable of, having witnessed his colleague Quanto cleaved in two with one. From then on, Gudb recognized the energy blade as a superior weapon and usually retreated when faced with one. He had no ability of his own to manipulate the Force and was ignorant to what it specifically was. He only knew that it was a field of energy of which his attacks were unable to penetrate, such as the Force shield created by Thon; nor was he able to withstand the powerful Force waves projected by the Jedi Master. Gudb was easily influenced by the Force as well and succumbed to the mental suggestions of Nomi Sunrider's battle meditation when she caused the enforcers to fight amongst each other for her Adegan crystals."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gudb first appeared in the third issue of writer Tom Veitch's Tales of the Jedi comic miniseries, titled The Saga of Nomi Sunrider, Part 1. He also appears in the following issue, The Saga of Nomi Sunrider, Part 2. Gudb was later featured in the audio adaptation of the Tales of the Jedi series, where his exploits are explored in more detail. However, as The Saga of Nomi Sunrider progresses, Gudb's role in the events, even his appearance, differ greatly between the printed comic version and that of the audio rendition."}, {"tag": "p", "text": "Initially, the inconsistencies are limited to minor changes in dialogue. The first significant visible difference is how Gudb is drawn. Originally penciled by artist Janine Johnston, Gudb is shown as a short, fur-covered, rat-faced being. The audio rendition seems to agree with at least his proportions as well; at one point of the story, Bogga states that his pet Ktriss, a Hssiss dragon, could swallow Gudb \"in one gulp.\" By his second appearance, Gudb is drawn by David Roach, and his features become more humanoid. He appears much taller and slimmer than before, though still with tan fur. His ears are pointed rather than disc-shaped, and he is also conspicuously without his hat. Along with his utility belt, he wears a bandolier of sorts and is equipped with a combat knife. In The Complete Star Wars Encyclopedia, Gudb's physical traits are canonized as the original short, rat-faced portrayal."}, {"tag": "p", "text": "It is also in the second issue of The Saga of Nomi Sunrider that Bogga commissions a new character, pirate Finhead Stonebone, with the recovery of the Adegan crystals. In the comic, Gudb's story ends here; however, his role is continued in the audio drama, where Finhead Stonebone makes no appearance. Gudb instead retains his position as Bogga's primary henchmen and is sent to Ambria. In the audio version, Gudb's character is given all the dialogue and performs all the activities originally attributed to Finhead Stonebone in the comic."}, {"tag": "p", "text": "In The Essential Chronology, Power of the Jedi Sourcebook, Star Wars: The Ultimate Visual Guide, The Official Star Wars Fact File 67, and Jedi vs. Sith: The Essential Guide to the Force, Gudb is indirectly referred to in conjunction with the rest of Bogga's enforcers as one of the thugs who participated in the murder of Andur Sunrider."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}