{"url": "Gudry", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles needing illustration", "Category:Humans", "Category:Imperial Security Bureau officers", "Category:Males"], "nodes": [{"tag": "h1", "text": "Gudry"}, {"tag": "p", "text": "Gudry, also known by the pseudonym Mattai Daw, was a male human who served as an ISB agent in the Galactic Empire. Under the orders of Colonel Wullf Yularen, Gudry accompanied Governor Arihnda Pryce on an undercover mission to plant explosives at the Batonn insurgents' base during the Siege of the Creekpath Mining and Refining complex. Pryce killed Gudry following a disagreement over evacuating her parents. To conceal her role in his death, she detonated the Creekpath Mining and Refining complex, killing the insurgents and numerous civilians."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Undercover on Batonn"}, {"tag": "p", "text": "Gudry was an Imperial Security Bureau agent who lived during the Imperial Era. At Colonel Wullf Yularen's insistence, Arihnda Pryce reluctantly allowed Gudry to accompany her inside the Creekpath Mining and Refining complex. Posing as a man named \"Mattai,\" Gudry's mission was to scout the insurgents' defenses and to plant explosives under the cover of finding a friend, who purportedly worked as a weapons electronic expert at the mine. Pryce and Yularen travel to Batonn from the planet Dennogra. Admiral Thrawn reluctantly approved Pryce and Gudry's mission."}, {"tag": "p", "text": "Pryce and Gudry managed to enter the mining complex using fake identification. After reuniting with her parents at their Batonn home, Pryce managed to persuade her father Talmoor to accompany her and Gudry into the mine under the pretext of rescuing Gudry's friend. Realizing that Gudry planned to blow up the mining complex, Pryce pretended to help Gudry. However, she decided to plan an escape and borrowed her mother's comm. Pryce was only concerned about her parents' well-being and safety."}, {"tag": "h3", "text": "Pryce's \"betrayal\""}, {"tag": "p", "text": "Pryce, Talmoor, and Gudry managed to enter the mine with her father's help. Inside the mine, Pryce feigned sickness and slipped inside a parked speeder truck. Mimicking her mom's voice, Pryce managed to call Gudry and Talmoor back on the pretext that Talmoor was sick. Arihnda managed to take her father home and left Gudry to search for his friend alone."}, {"tag": "p", "text": "Before Pryce could leave with her parents, Gudry returned and chastised her for not helping his mission. Gudry also revealed that his mission was not a rescue mission but a search and destroy mission to plant bombs near the explosives cache and the shield generator. When Pryce pleaded for him to take her parents with them, Gudry replied that he could not let them draw attention to him. Following a fight, Pryce managed to shoot him dead."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Before leaving with her parents, Pryce found Gudry's comm, which contained the two triggers for the shield and explosives cache bomb. Pryce used the trigger in the explosives cache to destroy the Mining Complex but avoid detonating the shield bomb. While Pryce's actions prevented the explosion from spread, many civilians and insurgents in the complex were killed."}, {"tag": "p", "text": "Following the bombing, Pryce claimed that Gudry had blown himself up to prevent the rebels from capturing him. While the Imperial authorities accepted Pryce's account, Colonel Yularen along with Thrawn were skeptical that Gudry would have deliberately blown up the explosives cache."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Agent Gudry was a human man with fair skin, blue eyes, and black hair. He was skilled at operating undercover and had a talent for explosives. Gudry was willing to kill many insurgents and guerrillas in order to break the siege of the Creekpath mining complex. Gudry came into conflict with the headstrong Arihnda Pryce, who was unwilling to abandon her parents. While Gudry was able to hold himself in combat, he was ultimately killed by Pryce."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Agent Gudry first appeared in Timothy Zahn's 2017 novel Thrawn, a rebooted Canonical origins story of the eponymous character. Most of his lines are told through the point of view of Arihnda Pryce and Thrawn."}, {"tag": "p", "text": "He was first illustrated in the Marvel Comics Thrawn 5, a comic adaptation of the novel which debuted on June 13, 2018. He was drawn by Luke Ross and colored by Nolan Woodard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}