{"url": "Guerrerite/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Metals", "Category:Ores"], "nodes": [{"tag": "h1", "text": "Guerrerite"}, {"tag": "p", "text": "Guerrerite was a valuable ore found in large quantities on the planet Hoszh Iszhir in the Core Worlds. The ore could be turned into a dark gray metal that was used to create technological items. Due to the high value of guerrerite and other metals on Hoszh Iszhir, the native Gektl species had a planetary shield network to protect them from theft. However, Stafuv Rahz, the Gektl responsible for maintaining the shield, let the Galactic Empire take over in exchange for control over his people, who were subsequently enslaved to mine the ores on the planet."}, {"tag": "h2", "text": "Properties"}, {"tag": "p", "text": "A valuable ore found on the Core Worlds planet Hoszh Iszhir, guerrerite could be processed into a metal that was dark gray in color."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Guerrerite was found in large quantities on Hoszh Iszhir, the homeworld of the Gektl species. During the Clone Wars, the valuable material was used in the construction of various technological items. During the time of the Galactic Empire, on Hoszh Iszhir, guerrerite and other precious metals were protected from theft by a planetary shield network owned by the Gektl. The maintainer of the shields, a Gektl named Stafuv Rahz, gave the codes to the shield to Emperor Palpatine in exchange for control over the Gektl species. The Empire sent a fleet of Star Destroyers to bombard the world, and the Emperor gave Rahz a commission in the Imperial Military as well as control over the planets in the system. Under Rahz's control, the Empire took over the mining operations and enslaved the rest of the Gektls to mine the guerrerite and other ores for the profit of the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Guerrerite was first mentioned in the second part of \"Aliens in the Empire\", a StarWars.com Hyperspace exclusive written by Abel G. Peña and Rich Handley that was posted on StarWars.com on December 4, 2007. In 2013, guerrerite was added as a common crafting material in Star Wars: Clone Wars Adventures, an MMORPG produced by Sony Online Entertainment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}