{"url": "Guild_of_Vindicators", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Force-based organizations", "Category:Religious organizations"], "nodes": [{"tag": "h1", "text": "Guild of Vindicators"}, {"tag": "p", "text": "The Guild of Vindicators was a cult of religious fanatics that was known to operate in the region of space containing Cheelit, whose ruler Lady Dhol referred to them derisively as \"those stealers-of-eggs\". Their symbol was a small skull clasp worn at the throat of a rough brown cassock. They were known to have had an eye-for-an-eye belief in which death was the only way to expiate one's sins. Their intolerance of Imperial atrocities and use of assassins like Clat the Shamer led them into direct conflict with the Empire, and they forced Dhol to take part in an attempt to assassinate Darth Vader to punish him for his myriad misdeeds."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Guild was going to be featured in Joe Bongiorno's and Rich Handley's article Cult Encounters of the Star Wars Universe, but Star Wars Gamer was canceled before it could be published. The information that was to be published in the article is outlined below."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Guild of Vindicators was an ancient sect of exiled Jedi Knights who practiced a fanatical, grey philosophy which arose in the wake of the Pius Dea Crusades. After a catastrophic conflict on Garn, the Jedi Vindicators school of thought was deemed heretical and extremist, and Jedi who ascribed to the teachings were exiled."}, {"tag": "p", "text": "Over the millennia, the Guild persisted in small numbers, operating as vigilantes and assassins during the reign of the Galactic Empire."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "What Jedi Guardians achieved through combat, Jedi Vindicators achieved with arcane application of the Force which skirt the boundaries of darkness and light. Once a philosophical school of the Jedi Order, the Guild Members observed a strict moral code which directed them to ride the galaxy of those who misused the Force to evil ends. Opposing dark side cults and acolytes that rose and fell across the millennia, the Vindicators abhorred the Sith and all those who aligned with their philosophy. Members of the Guild were distinguished by their dark, flowing robes clasped by a skull-stone pendant signifying death: the ultimate penalty."}, {"tag": "p", "text": "While Humans and Human-related species comprised the bulk of the Guild's members, all sexes and races were welcome to seek membership in the ancient organization. The Lepi Kezzin was a member during the Galactic Empire's zenith, though he was exiled for murdering a fellow Guildsbeing."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Branches of study"}, {"tag": "p", "text": "Members of the Guild were prompted to study and serve in a branch of the organization that would allow them to best utilize their abilities. All Vindicators learned to use the Force to delve into the minds of sentient beings to unearth memories of criminal behavior, violence, and cruelty. Unlike their Jedi cousins, no branch of the Guild pursues martial arts, relying on their Force abilities to impose judgement without sullying themselves with violent acts."}, {"tag": "h4", "text": "Shamer Branch"}, {"tag": "p", "text": "The largest branch of the Guild was comprised of beings who identified as Shamers. These beings were empaths who utilized the Force to compel wrongdoers to feel an overwhelming feeling of remorse. When a Shamer utilized this power to its full extent, they could compel their adversaries to expatiate their conscious through suicidal action. Believing that self-annihilation was the only way to rid oneself of the taint of evil, Shamers with a true handle on their abilities could override a sentient's natural instinct for self-preservation and convince them to take their own life."}, {"tag": "p", "text": "During the reign of the Galactic Empire, the Shamer Clat served as the leader of the Shamer school and the de facto leader of the entire Guild. Clat sought to punish the Sith Lord Darth Vader for his crimes against civilization but was ultimately destroyed by the Sith Warrior."}, {"tag": "h4", "text": "Unveiler Branch"}, {"tag": "p", "text": "Where Shamers were concerned with an intimate and personal admonition of oneself, Unveilers sought to make a being's sins public knowledge. Using the Force to compel the guilty citizens of the galaxy to seek out a public forum to air their crimes, an Unveiler specialized in manipulating the minds of the damned and weakening them to a state where they eagerly embrace the punishment that the law hands down to them."}, {"tag": "p", "text": "Unveilers were especially active in the Core Worlds during the height of the Galactic Empire. The Imperial Intelligence agent known as Lord Cronal, under his alias Blackhole, was able to identify several Unveilers working in law firms in a delusional attempt to replace all of the galaxy's judges with their own agents. Lord Cronal hoped that the Unveilers secretive work would ultimately benefit the Empire and allowed them to continue their plotting unmolested."}, {"tag": "h4", "text": "Redeemer Branch"}, {"tag": "p", "text": "The Redeemer Branch is the smallest specialized group within the Guild of Vindicators, and the most secretive. Those who follow the path of the Redeemer ascribe to the Jedi teaching that some who have strayed might yet be redeemed. Straying from Jedi dogma, the Redeemer helps a being find this rehabilitated state by scrubbing their mind of all their memories. While the most altruistic of the Guildsbeings, and most in line with the Guild's overall stance on nonviolent methods, the Redeemers' power to strip a being's memories does little to sate the bloodthirsty nature of the Guild's leadership. After the fall of the Galactic Republic at the end of the Clone Wars, many Redeemers quietly sought to break from the Guild and the corrupt leaders who preferred more arduous punishment for criminals."}, {"tag": "h4", "text": "Reflector Branch"}, {"tag": "p", "text": "Dealing with violent criminals who have amassed a high body-count, the Reflectors used Force illusions to reflect the suffering caused by their victim's deeds. A vicious group, the Reflectors spare no murderer the gory details of their own crimes, forcing a bad person to truly suffer from the illusions before they ultimately kill themselves."}, {"tag": "p", "text": "During Lord Cronal's investigation into the school of Redeemers, the Imperial agent discovered a string of missing Imperial officers he deduced had been destroyed by the Guildsbeings."}, {"tag": "h4", "text": "Splinterer Branch"}, {"tag": "p", "text": "Balancing on the edge of the dark side of the Force, the Vindicators who strive to be Splinterers use their abilities to punish those who are not worthy of a quick death. Working alongside members of the other schools, Splinterers isolate their quarry before utterly destroying their conscious mind. Rendered catatonic, these evil people suffer from an unending barrage of nightmarish hallucinations, inflicting psychological trauma that prevents them from every reintegrating into society."}, {"tag": "p", "text": "Because of their affinity for skirting the darker aspects of the Force, Lord Cronal believed that some Splinterers might serve the Empire well as members of the Inquisitorius. The power that the Splinterers exerted on their prey deeply disturbed and intrigued Cronal, as their mastery of the Force's power over the mind far exceeded other schools."}, {"tag": "h4", "text": "Annihilist Branch"}, {"tag": "p", "text": "The smallest group of Guildsbeings, and possibly extinct by the time of the Galactic Empire, the Annihilists projected their illusions onto groups large and small. Able to create feelings of anxiety, paranoia, and intense rage, Annihilists can cause riots and armies to turn on their own compatriots with violent intensity. The Guild bragged that Annihilists had been deployed on various fronts throughout history, secretly causing the downfall of mighty armies and the regimes who governed them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}