{"url": "Guiteica/Legends", "categories": ["Category:Legends articles", "Category:Guiteica locations", "Category:Kadok Regions planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Guiteica"}, {"tag": "p", "text": "Kadok III-D, commonly known as Guiteica, was a harsh planet located in Wild Space's Kadok Regions. It featured forests, mountains, glaciers, and huge waterfalls. The planet possessed rich reserves of metal ores and minerals such as feldspar, yttrium, and Bal'ta'ran crystals. Guiteica was inhabited by creatures such as j'kuutak and roggwart."}, {"tag": "p", "text": "Guiteica was also the homeworld of the Bitthævrians, a warlike yet isolationist sentient species. The sixteen primary continents of Guiteica were each governed by a separate military force, which made up the planetary defense force known as the Guiteica Militia. The dominant army on Guiteica was the m'Yalfor'ac Order of the l'Quar'ta continent."}, {"tag": "p", "text": "The Bitthævrian colonel Quaal Tavier Catharius eventually rose to the leadership of the m'Yalfor'ac Order at a time of strained relations between Guiteica and the Galactic Republic. The physically-imposing escaped slave Aul Tarrus Vishav also joined the Order, becoming one of Tavier's elite bodyguards."}, {"tag": "p", "text": "During a period of Bitthævrian expansion around 65 BBY, the Republic secretly backed an unsuccessful coup against Tavier by Major Jael Ganton Farvash. After Ganton was sentenced to execution for an assassination attempt against Tavier, the former challenged the latter to a duel in a traditional m'Yalfor'ac Order battle arena. Although Ganton attempted to cheat during the subsequent confrontation, he was bested by the combined efforts of Tarrus and the wounded Tavier, with the incident helping to cement both of their reputations as Bitthævrian heroes."}, {"tag": "p", "text": "Following the unsuccessful coup, the Republic attempted to cover its involvement by tricking the Kaleesh of the nearby planet Kalee into thinking the Bitthævrians presented a threat to their homeworld. The Republic trained and outfitted the Kaleesh kolkpravis army, which, aided by a group of Jedi Knights, successfully drove back the Bitthævrian advance, in the process invading Guiteica. As a result of the conflict, the m'Yalfor'ac Order declared eternal enmity toward the Republic and the Jedi."}, {"tag": "p", "text": "When the Republic gave way to the Galactic Empire and the Rebel Alliance was formed, the m'Yalfor'ac Order came to view the Alliance as its new enemy due to it attempting to restore the Republic. The Order, however, was also hostile to the Empire, repulsing the attempts of mining companies to gain access to Guiteica's resources and attacking Imperial patrol craft. Ultimately, the Empire did not pursue any further actions against Guiteica, and the successor of the Rebel Alliance, the New Republic, largely ignored the planet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Guiteica was the common name of Kadok III-D, a planet located in the Tertiary Kadok system, a part of the Kadok Regions of Wild Space. It occupied the fourth orbital position around its star, Kadok III, and was itself orbited by nine moons. A day on Guiteica lasted 27 standard hours, and 306 local days made up the local year, which also consisted of seven seasons: Giil, Quul, Aul, Zoul, Tweil, Jael, and Quaal."}, {"tag": "p", "text": "Possessing standard gravity and a breathable Type I atmosphere, Guiteica was a harsh, terrestrial world with a temperate climate. The planet's surface featured sixteen primary continents and a dry hydrosphere. Guiteica's terrain forms included forests, glaciers, desolate mountains with soaring peaks, and immense waterfalls."}, {"tag": "p", "text": "The planet also had substantial mineral resources, chief among which were rich veins of Bal'ta'ran crystals and extensive subterranean deposits of feldspar and yttrium. Although many species that were less hardy than Guiteica's native Bitthævrians considered the planet to be overly rugged, its natural beauty was rich and featured gorgeous vistas. Guiteica was home to the species of creature known as j'kuutak and roggwart."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The m'Yalfor'ac Order"}, {"tag": "h4", "text": "Rise of Quaal Tavier Catharius"}, {"tag": "p", "text": "The Bitthævrians entered a period of expansion in the Kadok Regions during the reign of the Galactic Republic. The natural predisposition of certain Republic member species, such as the Bothans, toward deceptive scheming and political manipulation, as opposed to direct conflict, was anathema to the warlike Bitthævrians, and for years, the relations between the Republic and the species were strained."}, {"tag": "p", "text": "During that time, Colonel Quaal Tavier Catharius rose to the position of the thirty-first leader of the m'Yalfor'ac Order, the dominant Bitthævrian continental army, through meritorious action in combat against troops allied with the Republic and guerrilla operations against Republic-affiliated corporate complexes. Tavier's leadership let him attain the status of a hero with his people."}, {"tag": "h4", "text": "Slave-turned-bodyguard"}, {"tag": "p", "text": "At some point during the many wars fought by the m'Yalfor'ac Order, Aul Tarrus Vishav, a slave in the crystal mines of the Upper Bal'ta'ran Cluster of islands on Guiteica, was sentenced to be executed by his slave masters, who felt intimidated by Tarrus' great size and strength. Tarrus was bound with manacles and imprisoned in one of the chambers of the u'Tal'ac Range."}, {"tag": "p", "text": "When Tarrus eventually escaped his imprisonment, the carnage he left behind gained legendary status among the other slaves of the Upper Bal'ta'ran Cluster mines. Tarrus eventually joined the m'Yalfor'ac Order and gained the rank of Guardian, one of the few elite bodyguards protecting Quaal Tavier Catharius."}, {"tag": "h3", "text": "Conflict with the Republic"}, {"tag": "h4", "text": "Coup attempt"}, {"tag": "p", "text": "Around 65 BBY, the Republic secretly backed Bitthævrian Major Jael Ganton Farvash, who attempted a coup against Tavier with the intention to declare total allegiance of Guiteica to the Republic. Ganton unsuccessfully attempted to assassinate Tavier, seriously injuring the colonel in the process. When Ganton was subsequently sentenced to be executed, he challenged Tavier to a duel, which the injured leader was forced to accept per Bitthævrian tradition."}, {"tag": "p", "text": "The duel of Tavier and Ganton was held at a m'Yalfor'ac Order battle arena and was presided over by a judge who secretly favored Ganton's bid for power. Breaking the traditional rules of the duel, Ganton attempted to have his Guardians intervene to tip the outcome of the battle to his favor; however, he was ultimately slain by Tavier after Tarrus killed all of the would-be usurper's bodyguards. Following the battle, Tarrus became a Bitthævrian hero and Tavier reached the status of one of the greatest military leaders of Guiteica's history."}, {"tag": "h4", "text": "Enter the Kaleesh"}, {"tag": "p", "text": "Another effect of Ganton's unsuccessful coup was a Bitthævrian rebellion against all representation of the Republic in the Kadok Regions. Intending to keep their involvement in the incident secret, corrupt Republic officials tricked the Kaleesh natives of Kalee, a planet adjacent to the Kadok Regions, into believing their world was in danger of conquest by the Bitthævrians. Republic agents secretly trained the kolkpravis army of Kaleesh as an insurgent force, arming it with Czerka Outland rifles. In addition, a contingent of Jedi Knights, including Dooku and his apprentice, Qui-Gon Jinn, was sent to fight the Bitthævrian advance alongside the Kaleesh, which included the great-grandmother of the future warlord Qymaen jai Sheelal."}, {"tag": "p", "text": "During the ensuing conflict, Guiteica was invaded, and many Kaleesh warlords took baby roggwarts from the planet as trophies. Among those roggwarts was Gor, which, during the Clone Wars of 22 BBY–19 BBY, was kept by Sheelal, known as General Grievous by that time, as a pet and guardian at his castle on the third moon of Vassek."}, {"tag": "h4", "text": "Against the Republic and the Empire"}, {"tag": "p", "text": "Within five years of the beginning of the Bitthævrian-Kaleesh conflict, the latter withdrew in defeat. As a result, the m'Yalfor'ac Order condemned the Republic and the Jedi and declared them both to be perpetual enemies of the Bitthævrian species. The Republic, however, subsequently ignored Guiteica due to the Bitthævrians rarely venturing off-world and only being equipped with outdated military technology. During the Clone Wars, Guiteica was situated outside the borders of the Republic."}, {"tag": "p", "text": "Following the rise of the Galactic Empire in 19 BBY, many mining corporations, both private and those sanctioned by the Empire, attempted to negotiate mining rights on Guiteica with the Bitthævrians, only to be repulsed by the m'Yalfor'ac Order each time. On one occasion, when Vulca Minerals attempted to aggressively negotiate the rights to mine yttrium, the Order almost killed the company's Team Commander. Since the incident, all of Guiteica's exports were managed by the company Kadok Resources."}, {"tag": "h3", "text": "Hating the Alliance"}, {"tag": "h4", "text": "Galactic Civil War"}, {"tag": "p", "text": "The m'Yalfor'ac Order eventually transferred its hatred for the Galactic Republic to the Rebel Alliance, which sought to restore the Republic, and in an Alliance Task Force on Alliance Security SecuriDex datafile on the Order, Lieutenant Ayla Shar recommended the Alliance avoid Guiteica and its surrounding space entirely, viewing the establishment of any diplomatic relations with the Bitthævrians as impossible."}, {"tag": "p", "text": "Despite the hatred the m'Yalfor'ac Order held for the Rebel Alliance, it also condemned the Galactic Empire as an immoral government, and Imperial patrol craft that occasionally entered Bitthævrian space were attacked. Such actions strained the relations between the Empire and Guiteica, although ultimately Guiteica was not deemed to be worth the effort of pacifying operations. Nevertheless, the mere fact that the Bitthævrians were resisting the Empire would have eventually led to the Imperial conquest of their homeworld, but such an event never came to pass due to the preoccupation of the Empire with its conflict against the Rebel Alliance."}, {"tag": "p", "text": "Several years prior to 2 ABY, members of the m'Yalfor'ac Order performed a raid on an off-world pirate starship. The raid marked one of the few instances when the Order traveled off Guiteica and resulted in the army confiscating approximately three dozen All Terrain Personal Transport walkers from the pirates."}, {"tag": "h4", "text": "New Republic"}, {"tag": "p", "text": "Guiteica fell outside the territory controlled by the Pentastar Alignment between 4 ABY and 12 ABY. Following the establishment of the New Republic, the m'Yalfor'ac Order publicly criticized the new incarnation of its hated Republic. The Order also claimed control over a large territory of space outside Guiteica's system, although it possessed neither colonies nor outposts to support its claim."}, {"tag": "p", "text": "At some point years prior to the date 44:9:4:85, the weapons collector known as \"Credman\" visited Guiteica. \"Credman\" stayed on the planet for several years, in the process learning the materials used in the construction of the Bitthævrian traditional dematoil weapon and fashioning a simple version of the dematoil."}, {"tag": "p", "text": "Following the final defeat of the Galactic Emperor Palpatine in 11 ABY, New Republic Captain Zgorth'sth compiled available information on the m'Yalfor'ac Order as part of a threat assessment report focusing on various special units. In the report, Zgorth'sth stated that the New Republic did not have any vital interests on Guiteica and noted the potential necessity for a ban or a heavy tariff on military technology to be sold to Guiteica in order to keep the military ambitions of the Order in check. Between 18 ABY and 35 ABY, Guiteica lay outside the borders of the Imperial Remnant."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "h3", "text": "The native sentients"}, {"tag": "p", "text": "Guiteica was the homeworld of the Bitthævrians, an ancient sentient species. The skin of many Bitthævrian races originating in Guiteica's northern regions was black or dark brown in color—as opposed to the rust-colored brown or ruddy yellow pigmentation common to the majority of the Bitthævrians—and some groups of the natives from the planet's equatorial areas had light tan skin."}, {"tag": "p", "text": "The Bitthævrians were a warlike people, and their society held personal combat in high regard. In addition, the species had a low opinion of the rest of the galaxy, and as a result, the natives of Guiteica became an isolated culture and almost never ventured off-world. Exceptions usually only occurred when a Bitthævrian was hunting down an individual who had either committed a crime or dishonored a Bitthævrian leader."}, {"tag": "h3", "text": "Planetary society"}, {"tag": "p", "text": "Guiteican population numbered 7.8 million, and each of the planet's primary continents was governed by a separate military group, all of which were represented in Guiteica's planetary defense force. That force was known as the Guiteica Militia and was dominated by the army known as the m'Yalfor'ac Order."}, {"tag": "p", "text": "The society on Guiteica had reached the space level of technology, and metal ores and minerals, including the Bal'ta'ran crystals, were exported off-world. In return, medicines and high technology, such as computers and starship components, were imported on a biannual basis. Specifically, the m'Yalfor'ac Order traded the Bal'ta'ran crystals for second-hand military technology. All essential goods needed for the nutritional requirements of the Bitthævrians were procured on Guiteica itself."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "One of the primary continents of Guiteica was l'Quar'ta, the northern portions of which featured steep mountain ranges. The headquarters of the Guiteica Militia were located on l'Quar'ta, and the m'Yalfor'ac Order was also based on the continent. One of the Order's sites was a traditional battle arena used for duels. Just off the northwest coast of l'Quar'ta lay the Upper Bal'ta'ran Cluster, a group of islands that featured crystal mines."}, {"tag": "p", "text": "Other locations on Guiteica included a single standard class starport; the u'Tal'ac Range, at the foothills of which was situated several small chambers; and s'Korth'an, outside of which lay a series of hills that were sacred to the Bitthævrians. Bitthævrian Major Zoul Lavor Xariv Lar buried his best friend and long-time rival, Major Quaal Stavi Giniras, in the hills outside s'Korth'an following the latter's death of old age."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Guiteica was first mentioned in Alliance Intelligence Reports, a 1995 sourcebook for West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas, which misspelled the planet's name as \"Guiteca\" on one occasion, placed the Tertiary Kadok system, and therefore Guiteica, in grid square J-4."}, {"tag": "p", "text": "The September 2009 Wizards of the Coast sourcebook Galaxy at War states that roggwarts were native to the Expansion Region world Vendaxa. However, in October 2009, Star Wars: The Clone Wars – The Official Episode Guide: Season 1 instead designated Guiteica as the species' homeworld, which has been repeated in subsequent sources."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}