{"url": "Guiteica_Militia", "categories": ["Category:Legends articles", "Category:Military units", "Category:Wild Space organizations"], "nodes": [{"tag": "h1", "text": "Guiteica Militia"}, {"tag": "p", "text": "Guiteica Militia was the planetary defense force of Guiteica."}, {"tag": "p", "text": "Almost exclusively formed by native Bitthævrians, the Militia was known for its aggressive stance. It was divided in sixteen continental armies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 50 BBY, the Guiteica Militia rebelled against the Galactic Republic for the perceived interference of the Republic in the Kadok Regions. After this rebellion, the Republic affected the public opinion, so that Republic-aligned species would believe that Bitthævrian were a big threat. Finally, the Republic defeated them with an army of Jedi and Kaleesh. The m'Yalfor'ac Order, one of the biggest Bitthævrian continental armies, defeated and killed several Jedi Knights, but they were eventually defeated."}, {"tag": "p", "text": "The Militia was completely rebuilt around 2 ABY, under the leadership of m'Yalfor'ac charismatic Colonel Quaal Tavier Catharius. At this moment, each of the continents provided gear and troops to the Militia, with each continent being responsible of getting the equipment by any needed means. The m'Yalfor'ac Order, with around 80% of the Militia, was clearly considered the leading organization."}, {"tag": "p", "text": "Even though they had some 875,000 fanatically-devoted troops, most of the gear was obsolete, formerly Republic-used equipment."}, {"tag": "p", "text": "At this time, the Militia performed guerrilla attacks against the Rebel Alliance, considered to be the heir of the hated Galactic Republic, but they also attacked any Imperial ship entering Bitthævrian space (to the chagrin of Moff Rhain Towith). The Militia also hated Force-users, due to their implication in their defeat, and Bothans, due to cultural reasons. They also ensured that mining operations in Guiteica were controlled by Bitthævrian interests, rejecting any Imperial-backed corporation."}, {"tag": "p", "text": "The Rebel Alliance considered the Militia a potential threat to any operative in Guiteica, although, with all of its hatred, they could not threaten the Rebel Alliance as a whole with that equipment."}, {"tag": "h2", "text": "Sources"}]}