{"url": "Gundark", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Carnivorous creatures", "Category:Desert creatures", "Category:Domesticated creatures", "Category:Gundarks", "Category:Mammals", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "Gundark"}, {"tag": "p", "text": "Gundarks were vicious carnivorous desert mammals from the planet Vanqor. Renowned for their power and ferocity, the large creatures had sixteen claws and keen hearing. To tell someone that they \"looked strong enough to pull the ears off a gundark\" meant that they were healthy and strong."}, {"tag": "p", "text": "At some point prior to Anakin and Obi-Wan's assignment of guarding Senator Padmé Amidala from an assassination attempt, Obi-Wan and Anakin fell into a gundarks' nest, although Anakin reminded Obi-Wan that he went in the nest to rescue Obi-Wan. The gang leader Tasu Leech used a gundark bone as his rifle's grip."}, {"tag": "p", "text": "A group of gundarks were present in Lexim's hunting ground on a forest planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During Anakin Skywalker's apprenticeship under Obi-Wan Kenobi, Kenobi fell into a nest of gundarks. However, Skywalker was able to rescue him from the nest. During the Clone Wars, Kenobi and Skywalker pursued Count Dooku to Vanqor. After Dooku escaped, they were then confronted by one. Skywalker was chased by one, until Kenobi knocked it unconscious. The gundark was sealed in a cave by Skywalker's padawan, Ahsoka Tano. After the Jedi Cruiser Endurance crash-landed on Vanqor, Skywalker and Mace Windu, along with R2-D2 and R8-B7 went to examine the crash site for survivors. Unfortunately, a pair of gundarks attacked the two astromechs and R8 was torn apart. As the gundarks attempted to do the same to R2, a bomb went off and killed one of the gundarks. R2 tried to send off a distress signal to Coruscant using Skywalker's interceptor, but was forced to tie a gundark to it in order to pull it away."}, {"tag": "p", "text": "A Ming Po animal trainer used two gundarks to battle Windu on Zardossa Stix. With help from Jar Jar Binks, Windu succeeded in killing one gundark, while the surviving gundark fled."}, {"tag": "p", "text": "Trandoshans, such as Garnac and members of his hunting guild, would hunt Gundarks, skin them for their pelts and put them on display."}, {"tag": "p", "text": "Lor San Tekka wore a belt made of Gundark-hide. Zorii Bliss wore gloves from the same material."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gundarks were first mentioned in Star Wars: Episode V The Empire Strikes Back, though they did not appear in canon until the first season of the Star Wars: The Clone Wars television series. Their first appearance in any Star Wars media was in the 1981 Marvel comic Star Wars 51."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}