{"url": "Aloysius_Kallig", "categories": ["Category:Legends articles", "Category:Force ghosts", "Category:Individuals of unspecified species", "Category:Males", "Category:Sith Lords of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Aloysius Kallig"}, {"tag": "p", "text": "Aloysius Kallig was a male Sith Lord of the Old Sith Empire. Like many ancient Sith, his name was all but forgotten. The only known mention of Kallig was in the writings of the famous Dark Lord of the Sith Tulak Hord, who noted him as the greatest of his rivals. He was the ancestor of the Sith Inquisitor, Darth Nox, whom he met on Dromund Kaas and had an important role supporting Darth Nox's path to power."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Aspiring general"}, {"tag": "p", "text": "A Force-sensitive male, Aloysius Kallig was born into immense wealth yet abandoned his family and his inheritance to train on the Sith Empire's training world Korriban. Ascending to the top of his class, unrivaled in lightsaber combat and strategics, Kallig sought to serve alongside Sith Lord Tulak Hord. During Hord's campaign to take Yn and Chabosh, Kallig approached Hord who dismissed him outright. To prove himself, Kallig defeated Hord's top general and extended his offer of service again. Hord acquiesced and appointed Kallig as his top general."}, {"tag": "p", "text": "Leading Hord's forces to numerous victories, Kallig's influence was frightening to Hord who eventually arranged his murder. When Kallig was assassinated, his family fled and went into hiding while Kallig's body was entombed on Dromund Kaas. Like many ancient Sith, his name was all but forgotten, as more powerful–or at least more visible–Sith Lords had taken their place in the historical record. The only known mention of Kallig was in the writings of his murderer, who noted him as the greatest of his rivals. Paradoxically, and unsurprisingly, Kallig counted Tulak Hord as one of his friends until Hord turned against and defeated him."}, {"tag": "h3", "text": "Restless spirit"}, {"tag": "p", "text": "Despite Kallig's physical death, the Sith Lord's spirit was able to cling to the physical world and roam Dromund Kaas restlessly for millennia. When the Sith Emperor brought the shattered Empire to Dromund Kaas, servants of the Emperor constructed the Dark Temple over the tomb of Kallig as a prison to dead and living enemies of the Empire."}, {"tag": "p", "text": "As the Emperor led the Empire to war with the Galactic Republic, Kallig's spirit became restless within the halls of the Temple. Eventually, rogue Sith breached the Dark Temple, hoping to gain power for themselves. Instead, they stirred Kallig from his slumber. Unaware of his own death, Kallig subsequently began to dominate the Dark Temple as his own kingdom, possessing many Sith and Imperials who had dared to trespass."}, {"tag": "p", "text": "By 3643 BBY, Kallig sensed a disturbance in the Force, the source being his last descendant, a Sith Inquisitor in the Empire, who had just became a Sith apprentice on Korriban and had grasped their first lightsaber. The Inquisitor's strength in the Force woke Kallig from his slumber and made him acknowledge that he was dead. Desiring to meet his descendant, Kallig began to cause disturbances within the Dark Temple in an effort to draw the Inquisitor to him. Though his efforts reached fruition, Kallig's spirit realized that his descendants knew nothing of their heritage, having fallen into slavery after his death. He cautioned the Inquisitor to be wary of the Dashade Khem Val, as well as their master and apprentice and to never be taken by surprise, having confidence that his family's name would be restored to greatness. He then allowed the Inquisitor to take an artifact of Tulak Hord's that Kallig stole before his unfortunate death. He advised caution, stating that betrayal followed the artifact wherever it went."}, {"tag": "p", "text": "Sometime later, Kallig became aware that the Inquisitor's Sith master Darth Zash had sent two new apprentices, Kaal and Corrin, into the Dark Temple to confirm whether or not he was gone. Kallig considered killing them but refrained from doing so when they discussed Zash. Zash herself came by later, performing some sort of ritual. Venturing out of the temple, Kallig warned his descendant of these developments, implying that Zash sought to replace her first apprentice. He then informed his descendant of the location of his mask which would provide protection against Zash, now in the hands of a Sith Lord on Korriban."}, {"tag": "p", "text": "After the Inquisitor had gathered all the artifacts of Hord, Kallig visited once again. He explained that he had discovered the location of his lightsaber, which he entrusted to his last loyal retainer, Jonas Escalus, who promised to keep it safe until the time Kallig's heir would come to claim it. Escalus' last descendant, Mila, was working at a casino on Nar Shaddaa. Unfortunately, her father broke the family pact, having lost it while gambling. Once the Inquisitor claimed their inheritance, Zash declared it time to begin the ritual with Hord's artifacts. However, Kallig became wary of Zash's motives and warned his heir that Zash had been conducting rituals to protect herself from the Force. He urged the Inquisitor to strike at their master before she can and bring an ally who could break through her defenses."}, {"tag": "p", "text": "As it turned out, Kallig was right. Zash's body had rapidly aged from quick corruption from the dark side and her rituals kept her sustained for a finite period of time and she sought to use the ritual to forcibly take control of her apprentice's body. Just before she could complete the ritual, Khem interrupted. Unexpectedly, while Zash's body died, her spirit was forced into the Dashade. As Kallig explained it, through some strange, miraculous trick, neither Khem nor Zash had full control. With the danger to his descendant over, Kallig formally declared the Inquisitor heir to his legacy, and bestowed the name of Lord Kallig upon him."}, {"tag": "p", "text": "Unfortunately, the victory was not to last, for Zash's superior, Darth Thanaton, attempted to send the Inquisitor to their death in the tomb of Darth Andru. Kallig's intervention saved his heir from death at the hands of the blind Sith Lord. Kallig warned his descendant that Thanaton sends his enemies into the tomb to die. However, he believed that this could to work to his descendant's advantage. He explained that the Inquisitor has a rare \"pull among ghosts\", enabling to sense the Inquisitor from great distances and invokes strong emotions. To enable the Inquisitor to gain more power to defeat Thanaton, Kallig directed them to the tomb of the Sith Lord Ergast, to learn a technique known as Force walk, a ritual that can bind a Force ghost and draw on their power. Before Kallig departed, he warned his descendant that he had used up the remainder of his strength and can no longer help them. With this ritual, the Inquisitor bound both Ergast and Andru to gain their power. After binding Andru, Kallig appeared and informed his heir that they should now be able to withstand Thanaton's wrath."}, {"tag": "p", "text": "Unfortunately, Kallig was partially wrong. Thanaton easily incapacitated the Inquisitor, seemingly killing the young Sith. Fortunately, the power of the two ghosts were able to spare the Inquisitor from death. The Inquisitor concluded that more power was needed in order to defeat Thanaton."}, {"tag": "p", "text": "Eventually, the Inquisitor was able to defeat Thanaton and gain his seat on the Dark Council with the title of Darth Nox, restoring Aloysius' bloodline to greatness."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ambitious and talented, Aloysius Kallig cast aside both his wealthy family and the inheritance he was to receive to acquire prestige on his own and to make a name for himself."}, {"tag": "p", "text": "After discovering that his bloodline was lost to history, and that his descendants had fallen into slavery, he was determined to see to it that his name be returned to its former greatness. To see this accomplished, he served as a guide to his distant descendant, Darth Nox, whom he would see rise to power, thus restoring his name."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A very powerful Sith Lord, Kallig was renowned for his skill in lightsaber combat, and had a good understanding of tactics and strategy. He used these talents to prove himself to Sith Lord Tulak Hord, by seeking out his top general and defeating him. Impressed, Hord named Kallig his top general in the place of the newly deceased."}, {"tag": "p", "text": "Kallig also demonstrated amazing understanding of the Force. Kallig transcended death after he was killed by his comrade, Tulak Hord, and continued to exist in the physical world as a Force spirit. Even as a spirit, his Force abilities were extremely powerful, as he was not only able to remain in the physical world as a spirit, but was extremely proficient in telekinesis, demonstrating the ability to influence many individuals at once, ranging from simple laborers and soldiers, to fully fledged Sith."}, {"tag": "p", "text": "After two thousand years of lingering as a spirit, Kallig would assist his very distant descendant, Darth Nox, to see to it that their family name would once again be restored to greatness. He guided Nox to the location of his mask, and of his lightsaber, powerful tools that Nox would use to help him succeed in his endeavors. Regardless of how draining it was to appear to Nox as an apparition, he would not stop until he achieved his goal. With Aloysius's guidance, Darth Nox overcame every obstacle, and after defeating Lord Thanaton, gained a seat in the Dark Council. The bloodline of Aloysius Kallig was restored to the greatness it once held several thousand years prior."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The type of lightsaber obtained by the Inquisitor depends on their advanced class. If the Inquisitor is a Sith Sorcerer, Kallig's weapon is a curved-hilt lightsaber (Kallig's lightsaber); if a Sith Assassin, Kallig's weapon is a double-bladed lightsaber."}, {"tag": "p", "text": "Kallig is mentioned by Lord Alaric in a mission on Dromund Kaas. The mission is available to all classes. Alaric says that the spirits of deceased Sith Lords were released by a group of Imperials by mistake and that one of the more dangerous was Kallig himself. He also mentions that Kallig died by ambush. The mission is located in Outpost Warden just outside of Kaas city and The Dark Temple."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}