{"url": "Gungan_Attack", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Gungan Attack"}, {"tag": "p", "text": "\"Gungan Attack\" is the second episode of the Star Wars: The Clone Wars television series' fourth season. It aired on September 16, 2011 with the previous episode, \"Water War,\" as part of the season's one-hour premiere."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"Anakin Skywalker and the rest of his Jedi team have been overrun by the Separatist surprise attacks led by Riff Tamson while Prince Lee-Char and Ahsoka must evade capture on their own. Unable to summon more Republic aid, Yoda calls upon the help of the powerful and amphibious Gungan Grand Army, but whether they will be enough to stop the Separatist siege is uncertain. An incensed Tamson doubles his efforts in tracking down Prince Lee-Char, unleashing the reinforcements given to him by Count Dooku in an assault that churns the oceans.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "With but the tiniest fighting strength left to operate and only a brief time to tell the Jedi High Council about their predicament before communication is cut off, Anakin Skywalker, Padmé Amidala, Ahsoka, Kit Fisto, and Captain Gial Ackbar decide to get Prince Lee-Char and Mon Cala senator Meena Tills to their ship and out of the system to safety. Fisto manages to overpower a Quarren patrol and appropriate a couple of vehicles to get the fugitives to the surface quickly. However, Riff Tamson has anticipated that move and blows the ship up before the Jedi and Mon Cala can even reach the surface."}, {"tag": "p", "text": "Clinging onto the sinking debris, the fugitives allow themselves to be dragged down to the seabed, where they split up into two groups: Anakin goes with Padmè, Ackbar, and Tills while Ahsoka and Fisto accompany the prince, along with two rescued clone SCUBA troopers. Expecting Republic reinforcements to come here soon, Anakin and his groups proceed to the Mon Calamari central planetary scanner facility, where Anakin uses telekinesis to collapse the entire structure, rendering planetary defenses blind. In the meantime, Lee-Char witnesses from his hiding place how his people are led away into slavery. Desperate to aid them, but advised by Ahsoka to exercise caution in favor of recklessness, Lee-Char uses a seashell horn to inform his people that he is still alive and encourages them to hold on."}, {"tag": "p", "text": "In the meantime, the Jedi Council is faced with the fact that they will have no clone force ready and equipped for underwater battle in time to aid the fugitives. Then Obi-Wan suggests asking the Gungans on Naboo, since they are amphibious creatures. With Jar Jar Binks' fervent support, the Gungan High Council agrees to help at once and sends the Gungan Grand Army to Mon Cala, just in time to render valuable aid to the fugitives. Tamson, however, quickly rallies his own forces and uses his Trident ships to create artificial whirlpools at the two battle sites, disorienting the Jedi and Gungan forces and thus facilitating their capture. Tamson himself goes after the Prince once more, but Kit Fisto manages to engage him in close combat for long enough to allow Lee-Char and Ahsoka to escape."}, {"tag": "p", "text": "As their friends are led into captivity, Lee-Char begins to despair over their loss and that only he and Ahsoka are left to fight on. The young Padawan gently advises him, however, not to give in to his doubts and fear, and re-encouraged, Lee-Char vows to bring an end to this war before he and Ahsoka retreat to a new hiding place."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "During the conversation between Tamson and Count Dooku, the clasp of Dooku's cloak disappears and reappears."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}