{"url": "Gungan_Basic", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Dialects of Galactic Basic", "Category:Gungan culture", "Category:Languages"], "nodes": [{"tag": "h1", "text": "Gungan Basic"}, {"tag": "p", "text": "Gungan Basic, also called Gunganese, was the language spoken by the Gungans of the planet Naboo. It was a language mostly derived from Naboo settlers' language, Basic, spoken in an accent. Occasionally, a word from Old Gungan would appear in dialogue, a term usually without any obvious meaning unless translated."}, {"tag": "p", "text": "Humans could usually understand it and, similarly, Gungans could understand Humans speaking Basic (even in written form). Most one-syllable words pertaining to the self would contain a suffix of -sa, for example, \"We-sa\" and \"You-sa\". Many one-syllable words ending in a consonant would end with -u."}, {"tag": "h2", "text": "Counting in Gunganese"}, {"tag": "h2", "text": "Common altered words"}, {"tag": "h2", "text": "Known phrases"}, {"tag": "h2", "text": "The verb to be"}, {"tag": "p", "text": "* You would use \"my\" if there was a verb after the \"I am\", such as \"I am jumping\" or \"I am going\". For \"I am going\", you wouldn't say \"Mesa going\". But you would say \"My goen\" due to of this rule. (Also, the suffix -ing is replaced by -en. It's \"goen\", not \"going\".)"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Gungan variant of Basic was first heard in the 1999 movie Star Wars: Episode I The Phantom Menace, the first installment of the prequel trilogy. Actor Ahmed Best, who played Jar Jar Binks in the movie, theorized that Star Wars creator George Lucas created the Gungan language based on the way his son Jett, who was six years old at the time, processed language. After the release of The Phantom Menace, writer Ryder Windham created a Gungan glossary for internal use at Lucasfilm. This document provided English-to-Gungan translations of several common phrases and the numbering system, and also set down the rules for sentence construction."}, {"tag": "p", "text": "Numerous commentators noted similarities with the so-called \"Ebonics\" dialect of English and considered \"Gungan Basic\" to be racially or ethnically insensitive towards people of African descent, particularly those of recent Caribbean extraction. Both George Lucas and actor Ahmed Best (who is African-American) refute this assertion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}