{"url": "Gungan_Sacred_Place/Legends", "categories": ["Category:Legends articles", "Category:Gungan culture", "Category:Gungan Swamp locations"], "nodes": [{"tag": "h1", "text": "Gungan Sacred Place"}, {"tag": "p", "text": "The Gungan Sacred Place was the name of a sacred monument on Naboo. It was located north of the Lianorm Swamp, on the foothills of the Gallo Mountains."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Gungan Sacred Place was built by the Elders. It was considered sacred by the Gungans, however, its exact religious or practical significance is unknown."}, {"tag": "p", "text": "It was here where Boss Rugor Nass fled after the assault on Otoh Gunga by the Trade Federation in 32 BBY. Queen Padmé Amidala on her return to Naboo with her escort, was guided there by the Gungan Jar Jar Binks and formed the first alliance and peace treaty between the Gungans and the Royal House of Naboo."}, {"tag": "p", "text": "There, they planned the Battle of Naboo: while the Gungans would divert the Federation forces by amassing the Gungan Grand Army on the Great Grass Plains, Amidala, together with her two Jedi escorts, would attempt to liberate the Theed Royal Palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The scenes set in the sacred place in Star Wars: Episode I The Phantom Menace were filmed in Whippendell Woods. The sacred place was the site of a mission in the Gungan campaign in the 2001 video game Star Wars: Galactic Battlegrounds. The campaign was also included in the game's 2002 expansion pack, Clone Campaigns. The scene also appeared in LEGO form during a cutscene in the 2005's LEGO Star Wars: The Video Game and its 2007 compilation."}, {"tag": "p", "text": "The MMORPG Star Wars Galaxies incorrectly places the Gungan Sacred Place in the Lasay Swamp."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}