{"url": "Gungan_dunk_tank", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Articles with conjectural titles", "Category:Entertainment"], "nodes": [{"tag": "h1", "text": "Gungan dunk tank"}, {"tag": "p", "text": "A Gungan dunk tank was an attraction present during the celebrations held on the planet Naboo in 32 BBY. In the attraction, it was possible to give the Gungan head of state Rugor Nass a dunk in the water contained in the tank."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Gungan dunk tank was an attraction used in funfairs by the Gungan species from the planet Naboo. It consisted of large, clear tank filled with water, over which a person was suspended, sitting on a short horizontal bar hung by two straps. By correctly sorting two-legged timas according to their colors and features, the player would activate a mechanism, making the seat fall into the tank and \"dunking\" whoever was sitting on it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly after the Battle of Naboo in 32 BBY, a series of celebrations was held at both Theed and Otoh Gunga—capital cities of the Nabooian Humans and Gungan people respectively—and the Gungan head of government, Rugor Nass, agreed to sit over the dunk tank. When successfully dunked, Nass would react by making faces. The attraction was installed in Otoh Gunga, inside a temporary hydrostatic bubble known as the \"Dunk Boss Nass Bubble,\" and Rugor Nass himself invited visitors to give it a try."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The dunking of Boss Nass was one of the activities featured in Star Wars: Early Learning Activity Center, a children's game released in 2000 by Lucas Learning. Dunk tanks exist in real-life, although the player has to strike a target to make the seat fall into the tank of water."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}