{"url": "Gungan_bongo_submarine", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Gungan vehicles", "Category:Submarines"], "nodes": [{"tag": "h1", "text": "Gungan bongo submarine"}, {"tag": "p", "text": "Gungan bongo submarines, also known as tribubble bongo submarines or simply as bongos, were submersible vehicles used by the Gungans to traverse the oceans of Naboo which saw use prior to the Invasion of Naboo and during the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Gungan bongo submarines, manufactured by Otoh Gunga Bongameken Cooperative, were a range of semi-organic submarines used by the Gungans to traverse and explore the oceans of Naboo."}, {"tag": "p", "text": "The manta-shaped hull of the bongo was organically grown from coral using techniques kept secret by the Gungans, meaning that no two vehicles were exactly alike. This distinctive hull, combined with the long, electromotive tentacles that flowed from the back of the vehicle and spun for propulsion, gave the bongo an appearance that resembled that of an exotic squid. The hull was also heavily armored against potential attack by dangerous sea creatures found in Naboo's oceans."}, {"tag": "p", "text": "Bongo submarines also possessed long, twisting, tentacle-like turbines which gave the vessel an unusually high speed. The vehicle was also equipped with a number of hydrostatic bubble shields which kept the cockpit and cargo areas dry and filled with air. These shields could be switched on and off to allow access to the vehicle. Bongos apparently have no limit to the maximum depth achievable by one, as they can always withstand the crushing depths of the waterways of Naboo. Despite this, they're usually found to travel at a standard depth of 500 meters."}, {"tag": "p", "text": "A forward driving plane also jutted from the front of the cockpit module. In emergencies, this cockpit module could eject from the vehicle like an escape pod."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Harvesting plasma"}, {"tag": "p", "text": "Thousands of years before the Invasion of Naboo, the Gungans of Mid Rim planet of Naboo were forced to move underwater due to a territorial struggle. However, upon moving underwater, they learned of the mysterious deep-water plant species known as the Locap that took plasma from rocks it burrowed into. Using special harvesting bongos with a front-mounted siphon, the Gungans could then extract plasma from a Locap plant. Even though harvesting the plasma was a dangerous task, the plasma could be extracted and then be put to use in the underwater civilization they would come to develop."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "A Gungan bongo submarine was used in 32 BBY by Jedi Master Qui-Gon Jinn, his Padawan Obi-Wan Kenobi and the Gungan Jar Jar Binks during the early stages of the Invasion of Naboo."}, {"tag": "p", "text": "Jinn and Kenobi, having failed in their attempt to negotiate with the Trade Federation regarding the blockade of Naboo, land on the planet to find an invasion already in progress. They soon encounter Binks and, upon learning of a nearby \"hidden city,\" are taken to the underwater Gungan city of Otoh Gunga. Here, the Jedi meet with Gungan leader Boss Rugor Nass, who is quick to dismiss the invasion happening above the surface. However, Nass speeds them on their way to the Naboo with a bongo submarine."}, {"tag": "p", "text": "Aided by Binks, Jinn and Kenobi travel through the planet's core upon advice from Boss Nass. During their journey, their bongo is latched onto by an opee sea killer, who reels the vehicle in with its tongue and damages the starboard side. The bongo is saved, however, by the appearance of a sando aqua monster, who devours the opee sea killer."}, {"tag": "p", "text": "Further into their journey, the damage sustained to the vehicle causes it to lose power. Upon Kenobi restoring power, they find themselves staring down a colo claw fish, and again only just manage to escape the creature after a sando aqua monster intervenes."}, {"tag": "p", "text": "The trio eventually arrived safely at Theed, and left the bongo behind as they continued on their way to rescue Queen Padmé Amidala from the Trade Federation's troops."}, {"tag": "h3", "text": "Separatist attack"}, {"tag": "p", "text": "During the Clone Wars in 20 BBY, rumors began to spread that Boss Lyonie was calling for the Gungans to help the Confederacy of Independent Systems attack Theed. Wanting to discover the truth, Amidala and Jedi General Anakin Skywalker traveled to Lake Paonga aboard a Naboo scout carrier to meet with Binks. Binks arrived in a bongo submarine. They used the submarine to travel to Otoh Gunga, where they discovered Lyonie was under the influence of minister Rish Loo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The sound made by the Gungan bongo submarine, as heard in Star Wars: Episode I The Phantom Menace and the Star Wars: The Clone Wars episode Shadow Warrior, was used as the sound for CB-23's underwater motor in the Star Wars Resistance episode \"No Escape: Part 1.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}