{"url": "Gungi", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Jedi trainees of the Jedi Order", "Category:Kashyyyk residents", "Category:Males", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Gungi"}, {"tag": "p", "text": "Gungi was a male Wookiee Jedi youngling who was training to become a Jedi in the Jedi Order during the Clone Wars. During the war, Gungi and a group of five other younglings, Petro, Katooni, Byph, Ganodi, and Zatt, were deemed to be at the top of their class and, led by Ahsoka Tano and Jedi Grand Master Yoda, they traveled to Ilum to participate in the Gathering; an ancient Jedi ritual that proved a youngling's readiness to become a Padawan."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Gathering"}, {"tag": "p", "text": "Gungi, who was among the top of his class, was sent to Ilum with four of his fellow Jedi younglings. While on Ilum, the younglings were instructed by Jedi Master Yoda to enter a Crystal Cave and find their kyber crystals, which were necessary for the younglings to construct their first lightsabers. Every crystal in the cave was specific to each individual. Gungi found his crystal on an island across a body of water within the cave. Following Ganodi's advice not go into the freezing water, he meditated to wait for the body of water to freeze so he could cross. He was later commended by Master Yoda on his patience."}, {"tag": "h3", "text": "Captured by pirates"}, {"tag": "p", "text": "While on their way back to Coruscant aboard the Crucible, Gungi and his fellow younglings began creating their lightsabers under the guidance of Professor Huyang when the Jedi's ship was attacked by the pirate Hondo Ohnaka. Hondo and his pirate crew were looking for the kyber crystals the younglings had just collected as they were worth lots of credits on the black market. Though the younglings managed to escape the pirates, Ahsoka Tano was pulled into space along with the pirates because the Crucible had managed to get away from the pirates docking station and had created a vacuum."}, {"tag": "p", "text": "Gungi and his youngling friends were building their lightsabers as they had free time, due to the fact their ship was stranded. After Gungi, Petro, and Byph finished their lightsabers the group decided to go to Florrum to cool their engines (which were at risk of exploding) and to save Ahsoka. Once there, they joined the troupe of the Dug Preigo to infiltrate the base of Hondo before stealing back Ahsoka's lightsabers, freeing Ahsoka and escaping on a stolen speeder."}, {"tag": "h3", "text": "Battle against Grievous"}, {"tag": "p", "text": "After escaping on the stolen speeder, Petro made contact with R2-D2 and Ganodi on board the Crucible, but by the time the Crucible got to them, the speeder was almost at a ravine. The Jedi had to attempt to board the ship hurriedly, with Gungi and Byph hanging off of the edge of the boarding ramp before the pirates shot a missile at the ship, causing it to crash and the pirates to take them hostage yet again. When they reached Hondo's base they found it was under attack by General Grievous and with the common goal to escape the Separatists, the Jedi and the pirates worked together freeing Ohnaka and escaped to his secret private fleet before managing to leave Florrum."}, {"tag": "h3", "text": "Bombing at the Temple"}, {"tag": "p", "text": "Gungi was later seen training outside the Jedi Temple some time after the bombing of the Temple's hangar. Along with his teacher, Tera Sinube, Gungi observed as Anakin Skywalker and Barriss Offee dueled outside until Offee was apprehended."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gungi, like many other Wookiees, was temperamental and expressive. During his trial at the Gathering, he struggled with the concept of patience, and was only able to acquire his kyber crystal after allowing himself to slow down."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Gungi constructed a lightsaber of his own with a wooden hilt that he chose from amongst the Crucible's store of materials."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}