{"url": "Gurlanin", "categories": ["Category:Legends articles", "Category:Canine sentient species", "Category:Force-sensitive species", "Category:Gurlanins", "Category:Mid Rim species", "Category:Shape-shifting species"], "nodes": [{"tag": "h1", "text": "Gurlanin"}, {"tag": "p", "text": "The Gurlanins were a polymorphic species native to the planet Qiilura. At their normal state, they were canines with black fur all over their bodies. They had extremely sharp teeth that ran along the length of their snout, with four fangs protruding over their lower lip, each ending in a double point. This gave them a slight, almost comical lisp. All members of the Gurlanin race had orange eyes that were quite disconcerting to other races. However, the average Gurlanin had the ability to assume almost any form to a maximal Size of a full grown Human. Gurlanins were generally considered to be marsupials, and the females had a pouch on their belly in which they carried their young. Their ears were located in their snouts, so that they could use a loud snuffling as echolocation. Their voices were very smooth, and had been remarked upon as being hypnotically soothing, almost like liquid. In addition, Gurlanins were strongly telepathic to other members of their race, and could communicate without speech among themselves, although they could not read the minds of beings not of their race. This ability was a natural manifestation of the Force among their kind. As a whole the species were long lived; the average lifespan for a Gurlanin was 700 years."}, {"tag": "p", "text": "Although the Gurlanins had no love for the Galactic Republic, they agreed to assist it during the height of the Clone Wars after the Separatists established a base of control on Qiilura. Throughout their history, the Gurlanins had been feared or abused by the settlers of Qiilura, and they viewed the Separatists as the worst of the lot. Their assistance to the Republic's forces was given with the singular goal of removing the Separatists and freeing the Gurlanins."}, {"tag": "p", "text": "After the removal of the Separatists, the Gurlanins then demanded the removal of the Republic settlers (who had helped dislodge the Separatists as well). If the Republic refused to remove the settlers, the Gurlanins threatened to use their natural abilities to sabotage the Republic's war effort. In response, Etain Tur-Mukan led a detachment of clones under Commander Levet to Qiilura to remove the settlers by force if necessary. Complications arose when the settlers — earlier trained and armed by Etain — felt betrayed by the Republic. When two thousand settlers refused to leave after continued deadlines set by Etain, the Gurlanins supplied information to the Separatists which resulted in the loss of a troop transport with over 10,000 men on board. Etain then ordered Levet to remove the settlers by force, an operation that would take several weeks."}, {"tag": "p", "text": "When all the settlers had been removed, all Gurlanin spies also returned to Qiilura."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}