{"url": "Alpha-3_Nimbus-class_V-wing_starfighter", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Republic starfighter classes", "Category:Imperial starfighter classes", "Category:Kuat Systems Engineering products", "Category:New Republic starfighter classes"], "nodes": [{"tag": "h1", "text": "Alpha-3 Nimbus-class V-wing starfighter"}, {"tag": "p", "text": "The Alpha-3 Nimbus-class V-wing starfighter, also known as the Alpha-3 Nimbus or V-wing starfighter, was a starfighter model manufactured by Kuat Systems Engineering."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "The Alpha-3 Nimbus-class starfighter was a sharp and wedge-shaped fighter. Manufactured by Kuat Systems Engineering, the same company that made Jedi starfighters, V-wings were agile and fast, with the ship having a top speed of 1,450 kilometers per hour and maximum acceleration of 5,200G's. Cutting-edge technology was used to give the V-wing maneuverability, and the starship had vertically placed twin ion engine thrusters, allowing for surprisingly fast pitch-turnings. Thrusters were placed at the end of the starfighter, but, like a number of ships made for the Republic, the V-wing was too compact to hold a hyperdrive. However, the V-wing did possess a powerful reactor."}, {"tag": "p", "text": "To maximize power for speed and agility, Kuat produced the starfighter without a pressurized cockpit. This required pilots to wear sealed flight suits equipped with life-support systems. This flight suit also allowed a pilot to eject. A single clone trooper pilot flew the ship, and an independent Q7-series astromech droid backed up the clone. This astromech helped in-flight maintenance and navigation. Close to the astromech were two deflector shield heat sinks. Also included in the ship were repulsorlift vanes, at least one reactant tank, shield projector units, the power lines to the shield projectors, and forward sensors."}, {"tag": "p", "text": "Much like the larger Star Courier of Sienar Fleet Systems, the V-wing had folding radiator wings and laser cannons. The wings, which were located at either side of the V-wing and reached above and below the craft, were the ship's most distinguishing feature and on articulated collars, which let the wings move ninety degrees for landing. During intense activity, the radiator panels on the wings helped heat disposal. The wings radiators remained unfolded while the ship was in flight position. The laser cannons could swivel on and had a rapid fire capability by being placed on both of the wing struts/hubs. The cannons had a power feed and capacitors. There was at least one sub-model, the Alpha-3B \"Besh.\""}, {"tag": "h3", "text": "Role in combat"}, {"tag": "p", "text": "The V-wing starfighter served as a support ship in the Republic Navy during the Clone Wars. The Galactic Republic's warships and carriers deployed furious swarms of V-wings, and the fighters were used to defend fortress worlds and part of fleet actions. Because of the ships's lack of a built-in hyperdrive, the V-wing required transportation into combat zones by carriers such as the Venator-class Star Destroyer. Because of the V-wing's maneuverability, it was more agile than the Republic's Aggressive ReConnaissance-170 starfighter. The ship was also a clone trooper pilot's best choice for a dogfight against the Vulture droid starfighters and droid tri-fighters used in the Confederacy navy."}, {"tag": "p", "text": "Because of its twin laser cannons, the V-wing was a deadly and surprising enemy. They were also a frustratingly elusive target and could be part of a mixed strike-force when used with Eta-2 Actis-class light interceptors and Aggressive ReConnaissance-170 starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Alpha-3 Nimbus-class V-wings were first deployed by the Galactic Republic in the final days of the Clone Wars. Streamlined mass productions techniques let this ship take the V-19 Torrent starfighter's place as the preferred compact space superiority starfighter. V-wings served in the Battle of Coruscant against the Confederacy of Independent Systems and continued to see use under the Galactic Empire. V-wings were also utilized as escort fighters for Emperor Palpatine's personal Theta-class T-2c shuttle. Some even took the V-19 Torrent starfighter's place in guarding Kamino's cloning facilities."}, {"tag": "p", "text": "In the following years, V-wings were gradually replaced by TIE/ln space superiority starfighters. The Alpha-3 Nimbus was little more than a single pilot fuselage pod sitting on vertically stacked ion engines flanked by deployable, heat radiating, stability foils. The V-wing was designed for speed and agility, at the expense of a reliable life support system or hyperdrive. The pilot instead relied on a sealed flight suit in case of ejection."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}