{"url": "Alpha-956", "categories": ["Category:Legends articles", "Category:Empire Reborn members", "Category:Enlisted stormtroopers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Alpha-956"}, {"tag": "p", "text": "Alpha-956 was a male Human who served as a stormtrooper with the Imperial Remnant. In 12 ABY he was stationed at the hidden Cairn Installation as part of the base's large contingent of guards. Alpha-956's obedience to his superiors was somewhat offset by a private contempt for \"know-it-all\" officers who had never experienced the difficulties that stormtroopers were forced to deal with."}, {"tag": "p", "text": "Alpha-956 participated in the ultimately unsuccessful hunt for the Jedi Knight Kyle Katarn, who had infiltrated the stable asteroid in the hopes of boarding the Doomgiver to rescue Jan Ors and foil the plans of Admiral Galak Fyyar and the Dark Jedi Desann. As Katarn came closer to the Doomgiver, Alpha-956 was ordered by an officer to investigate an area containing a pile of crates, as well as an alarm that he could use to summon an overwhelming number of troops in case he spotted Katarn. Although Katarn was quite close to Alpha-956's position when he reported in, his inspection turned up nothing unusual. He suggested to his superior that a thermal scanning team might be more appropriate for the task that he had been given and when the officer reacted negatively to this, he apologized and said that he would continue to keep an eye out for anything unusual."}, {"tag": "p", "text": "After Alpha-956 had terminated his communications link with the officer, he expressed his scorn for the officer's attitude to himself. Though it is known that Alpha-956 never used the nearby alarm control to alert the rest of the facility to Katarn's presence, whether or not he ultimately noticed Katarn remains unclear."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alpha-956's first and sole appearance was in the game Star Wars: Jedi Knight II: Jedi Outcast. Although he appears in a section of the game during which it is heavily hinted in Kyle Katarn's dialogue that the player should avoid being detected by the guards lest he be overwhelmed by more, this requirement only extends to preventing guards from activating specified alarm controls in certain areas. In order to advance in the game, the player is ultimately presented with the choice of sneaking past Alpha-956 and the other guards stationed near him, or alerting them to his or her presence and killing them to keep them from activating the alarm. If one of the alarms is activated by a guard, a cinematic of Katarn sitting in a cell as an interrogation droid enters is played, after which the player is informed that Katarn has been captured and he or she must restart, load a previously saved game, or quit the game."}, {"tag": "h2", "text": "Appearances"}]}