{"url": "Gutkurr", "categories": ["Category:Canon articles", "Category:Creature stubs", "Category:Blaster-resistant creatures", "Category:Carnivorous creatures", "Category:Creatures of Ryloth", "Category:Predatory creatures", "Category:Separatist military units", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Gutkurr"}, {"tag": "p", "text": "Gutkurrs were a species of vicious predatory insect carnivores native to the planet Ryloth, where they maintained hunting grounds. They were pack hunters that could quickly surround careless individuals. During the Clone Wars, the Confederacy of Independent Systems deployed gutkurrs to attack Galactic Republic clone troopers during the Battle of Ryloth. Gutkurrs were resistant to blaster bolts and were said to be the second-most dangerous predator on Ryloth, the first being lyleks. Gutkurrs were also found on the planet Onderon."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Separatists occupation of Ryloth, TX-20 had his troops capture several Gukurrs and had them placed in cages near his proton cannon battery in Nabat. He had his sergeant keep the Gutkurrs starved, planning to use them against Republic forces. In order to confirm that the Gutkurrs would only attack organic lifeforms, TX-20 opened the door to one of the Gutkurrs' cages to let his droid sergeant get mauled by it. The Gutkurr promptly spat him out."}, {"tag": "p", "text": "When the Republic sent General Obi-Wan Kenobi's Ghost Company to secure Nabat for their landing, TX-20's sergeant then released the Gutkurrs. The Gutkurrs attacked and killed several of Kenobi's troopers. However, Kenobi was able to lure several them away from his troopers using the Force and then had his troopers seal them off. Several Gutkurrs also attacked troopers Boil, Waxer, and Numa at her home before escaping through a secret passage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}