{"url": "Alpha-class_Advanced_Recon_Commando", "categories": ["Category:Legends articles", "Category:Alpha-class Advanced Recon Commandos", "Category:Clone trooper variants"], "nodes": [{"tag": "h1", "text": "Alpha-class Advanced Recon Commando"}, {"tag": "p", "text": "The Alpha-class Advanced Recon Clones were a group of 100 Advanced Recon Commandos created from Jango Fett's DNA by the cloners of Kamino."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Alpha-class ARC troopers were developed following the growth of the Null-class Advanced Recon Commandos, whose existence was a closely-guarded secret among the Kaminoans. The lessons learned during production of the Null ARCs helped greatly in refining the Alpha ARCs."}, {"tag": "p", "text": "When the Kaminoans had grown and trained the Alpha ARCs under Jango's personal tutelage, they were unaware that Fett was able to install his own personal orders in all of the Alpha ARCs, such as to destroy all of the younger clones should Kamino ever fall into the hands of the Confederacy of Independent Systems. Alpha-17 nearly carried out this order during the First Battle of Kamino, but the Galactic Republic managed to hold the planet."}, {"tag": "p", "text": "Although the Alpha-class ARCs were created with unaltered independent minds just like their Null-class predecessors, these second generation ARCs were more obedient and reliable to the Jedi because Jango had instructed the Alpha-class ARCs to follow their orders. However, this did not stop the ARCs from voicing their disagreements or even their opinion of a Jedi's order that the ARCs saw as incompetent or lacking of enough strategy."}, {"tag": "p", "text": "There was also a tense rivalry between the Null-class and Alpha-class ARCs during the Clone Wars. Though the Alpha-ARCs naturally inherited Jango's solitary nature, they did carry a sense of pride in the fact that they were part of a great military force. Furthermore, they respected the fighting and leadership skills exhibited in virtually all of the Jedi. The Nulls' blatant disregard for Jedi and Republic authority was seen by the Alpha ARCs as an insult to the entire clone army. Whereas the majority of Alpha ARCs were loyal only to the Galactic Republic and followed the Jedi's leadership, to a certain extent, the Null ARCs swore their loyalty to only Kal Skirata. Hence, the Alpha ARC troopers saw the Nulls as renegade clones and a shame to Jango Fett's legacy."}, {"tag": "p", "text": "Once Order 66 was initiated by Supreme Chancellor Palpatine, the order was not followed by all of the Alpha ARCs. Some did decide to obey the Chancellor's order, but many of the other ARCs chose to disobey Palpatine due to their unaltered independent minds and close experiences with the Jedi during the Clone Wars. Some Alpha-class ARC troopers retired to Coruscant or Kamino and became teachers for the Empire's recruitment camps; others followed in Jango Fett's footsteps and became bounty hunters. Still others joined the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Known Members"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}