{"url": "Guybrush_Threepkiller", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Crossover characters", "Category:Easter Egg articles", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Guybrush Threepkiller"}, {"tag": "p", "text": "Guybrush Threepkiller was a dual-lightsaber-wielding Human male who lived during the reign of the Galactic Empire, before the year 1 BBY. He had blond hair and fair skin, and wore black armor with black boots. The bridge city of Tarko-se on the planet of Cato Neimoidia contained golden statues of Threepkiller in one of the rooms of the city's Western Arch."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Guybrush Threepkiller appears as an easter egg in the LucasArts video game Star Wars: The Force Unleashed II, which was released on October 26, 2010. He is one of many skins that the player can unlock for Starkiller, the playable character in the game. The skin can be unlocked in the room containing the Threepkiller statues in the Western Arch of Tarko-se."}, {"tag": "p", "text": "Threepkiller is based on Guybrush Threepwood, the main character in the LucasArts Monkey Island video game series. The first installment in the series, The Secret of Monkey Island, was released in 1990. Threepwood was created by Ron Gilbert, who was also an extra in the 1985 Star Wars movie Ewoks: The Battle for Endor. The name \"Guybrush\" first came about when artist Steve Purcell saved the character's sprite file in the computer graphics program DPaint as \"guybrush.bbm\" to indicate that it was the brush file for the then-unnamed \"guy.\" From 1997's The Curse of Monkey Island onward, Threepwood was voiced by actor Dominic Armato, who also did voice-overs in several Star Wars video games. A clone trooper from the LucasArts video game Star Wars: The Clone Wars: Republic Heroes also bears the name \"Threepwood.\""}, {"tag": "p", "text": "As stated in the digital art book section of the Starkiller Mimobot, which was included with the Collector's Edition of The Force Unleashed II, Threepkiller was conceived for the game while the design team was looking for new unlockable costumes to add into the product. Although the artists did not think that anyone would take them seriously when they presented the concept art for Threepkiller to the rest of the team, the other members, all Monkey Island fans, agreed to the idea. Although the artists also made concept art for Monkey Island characters Elaine Marley as Juno Eclipse and LeChuck as Darth Vader, Threepkiller was the only one to be added into the game. The artists used bits and pieces of different rough sketches to come up with a Starkiller version of Guybrush Threepwood, whom they also considered naming \"Guy Brushkiller\" or \"Brush Guykiller.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}