{"url": "Gwarrk", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Chiefs", "Category:Heads of government and state", "Category:Males", "Category:Rishii"], "nodes": [{"tag": "h1", "text": "Gwarrk"}, {"tag": "p", "text": "Gwarrk was a male Rishii chieftain during the time of the Clone Wars. Around 21 BBY, Confederate Geonosian forces invaded the world of Rishi in order to get the planet's exonium minerals. After the Separatists successfully captured the mines, the Jedi High Council sent Green Company, a unit of clone troopers, to Rishi in order to retake them. Upon the arrival of the clones, Gwarrk ordered Green Company's Clone Commander to start the battle despite the absence of a Jedi General."}, {"tag": "p", "text": "The Geonosians had the far better position and were able to repel the clones' attacks. After a short time, Jedi General Kit Fisto arrived and called for the Republic troops to retreat. Although Gwarrk asked Fisto why he had recalled the clones and insisted on another attack, Fisto invented an alternative plan. He went to the entry of the mines and used his lightsaber to deflect the laser shots of a sharpshooter, 2242, at the Geonosians. After Fisto had weakened the Geonosian defenses, the Republic forces—aided by Rishii warriors—were able to retake the mines."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Rishii male, Gwarrk served as a chieftain of his species during the Clone Wars. Around 21 BBY, Geonosian forces allied with the Confederacy of Independent Systems invaded the planet Rishi and captured its exonium mines in order to obtain the exonium mineral needed to power their sonic weapons. To foil the Separatist plan and protect the planet's native inhabitants, the Jedi High Council dispatched Green Company, a unit of Galactic Republic clone troopers, to retake the mines. The clone troopers were ordered to not attack until a Jedi General arrived, but Gwarrk assumed command of the troops and commanded them to attack the mines anyway. The Geonosians, however, had prepared a well-entrenched defense, and the attack was beaten back."}, {"tag": "p", "text": "Seeing the troopers pulling back, Gwarrk questioned who had given the order for a retreat, but his query was answered by the Nautolan Jedi Master Kit Fisto, who had just arrived on Rishi. Fisto informed the chieftain that the troops were there to protect the Rishii from the Separatists and stated that no attack should have been made before his arrival. Gwarrk argued that the Jedi had created the Republic Army for warfare, and he had simply put the clones to their purpose, adding that the troops had failed because their power had not been great enough. When Green Company's clone commander informed Fisto that the Geonosians had dug deep inside the canyon leading to the entrance of the mines, Gwarrk stated that his people needed the exonium to prepare their food in the frost time and once again insisted on another attack. Fisto, however, formulated another plan and ordered the clone trooper commander to provide him with the company's best sharpshooter."}, {"tag": "p", "text": "Soon, without informing Gwarrk of his plans, Fisto went to the entrance of the mines. When Gwarrk asked the Clone Commander where the Jedi was, the latter told him that Fisto had apparently began an attack. Meanwhile, Fisto ordered the sharpshooter, 2242 to aim at his shoulder and fire continuously. 2242 obliged, and Fisto started deflecting the laser shots at the Geonosians with his lightsaber. As the Clone Commander rallied his forces and went to help Fisto, Gwarrk stated that the Jedi was either \"very powerful or very dead.\" By this time, however, all Geonosians in the canyon had been killed by Fisto's and 2242's combined efforts. The rest of the Republic forces—along with some of the Rishii warriors—then arrived and attacked the Geonosian troops inside the mines, forcing the remaining CIS forces to flee. Afterward, Gwarrk acknowledged that Fisto was very powerful, to which the Jedi replied that two factors had made this victory possible—the power of his mind and 2242's help."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gwarrk was desperate to reclaim the exonium and ordered the clone troopers to attack without any chance of success. When the troops failed in their mission, he believed that the failure was due to the troopers' lack of strength, not because the enemy troops had a better position. Gwarrk did not care much about the clones, sending them to attack the Geonosians with low chances of succeeding and speaking to the commander with no respect, openly insulting him in front of Fisto. However, he greatly admired Fisto's skills and acknowledged them to him when the battle was over. Gwarrk had yellow eyes and carried the axe-like staff weapon of a Rishii warrior. As a chieftain, he additionally wore a necklace and a crown-like headdress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gwarrk first appeared in the 2009 Free Comic Book Day's comic, The Clone Wars: The Gauntlet of Death, written by Henry Gilroy and illustrated by Ramón K. Pérez."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}