{"url": "Gwellis_Bagnoro", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Forgers", "Category:Males", "Category:Onodones"], "nodes": [{"tag": "h1", "text": "Gwellis Bagnoro"}, {"tag": "p", "text": "Gwellis Bagnoro was a mysterious Onodone male who rarely talked about his past. He worked as an expert forger specializing in transit documents thirty years after the Battle of Endor. He was present in the castle of the pirate Maz Kanata on the planet Takodana in 34 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Gwellis Bagnoro was born on Onod I. He was a mysterious Onodone who rarely talked about his past. At some point, Bagnoro met Han Solo."}, {"tag": "h3", "text": "Life on Ogem"}, {"tag": "p", "text": "At some point before the Galactic Civil War, Bagnoro and his protective pet barghest, Izby, lived in a cave on the planet Ogem. On Ogem, Bagnoro had the third and final droid that contained the treasure of Rane Mahal."}, {"tag": "p", "text": "While Bagnoro was sleeping, Gwarm stole his valuable droid. Before he could escape, Han Solo stole it from Gwarm when Izby attacked him."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "Thirty years after the Battle of Endor, Bagnoro became a forger specializing in transit documents."}, {"tag": "p", "text": "Bagnoro was also present in the castle of the pirate Maz Kanata on the planet Takodana with his pet barghest Izby when the smuggler Han Solo arrived with the astromech droid BB-8, the scavenger Rey and the ex-stormtrooper Finn. Shortly after Solo's arrival, the First Order destroyed the planets of the Hosnian system with their Starkiller Base superweapon, an event which was visible from Takodana's surface and so drew many of the patrons of the castle out to watch in horror. The castle itself was then attacked and destroyed by the forces of the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gwellis Bagnoro was created for Star Wars: Episode VII The Force Awakens, where he appeared briefly as a background character in Maz Kanata's castle. The character was first revealed to the public through an exclusive article on the website of Vanity Fair in May 2015, seven months before the film's release. Neither the article nor the film identified the character, but his name was revealed in the reference book Star Wars: The Force Awakens: The Visual Dictionary, which was written by Pablo Hidalgo and released the same day as the film. Bagnoro was portrayed by an uncredited Arti Shah."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}