{"url": "H%27nemthe_(species)/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:H'nemthe", "Category:Outer Rim Territories species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "H'nemthe  (species)"}, {"tag": "p", "text": "H'nemthe were bipedal reptilian humanoids with four horns and ridges of bone and skin on their faces. They had long, gently curving noses, three-fingered hands, and pink to blue-gray skin. Their homeworld and native language were also named H'nemthe. The H'nemthe loved the arts, particularly music. They were rarely found off H'nemthe."}, {"tag": "p", "text": "H'nemthe society was centered around true love and their unusual mating rituals. Due to a major discrepancy in the number of males compared to females on H'nemthe, the female would kill her mate upon mating. Despite this, the H'nemthe had no reservations about mating, and made finding love the focal point of their culture. Many species saw them as barbaric due to this, although the H'nemthe were otherwise very peaceful."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "H'nemthe were humanoid reptilians. They had three fingers on their hands, and their skin varied between blue-gray and pink. They had long noses, green eyes, and ridged, bony faces. The average H'nemthe stood 1.7 meters tall, the typical height of a Human. H'nemthe were omnivores."}, {"tag": "p", "text": "H'nemthe had four small horns, actually sensory cones, on their heads. These cones were used much like the way Gotals used their cones—to sense electromagnetic fields and weather patterns. Their homeworld H'nemthe had very unusual and irregular weather patterns due to its three moons. These cones had thus evolved as an adaptation to the extreme weather patterns and variable lighting conditions on H'nemthe, helping them cope with the changing conditions. These cones were also able to sense heat differences in their environment as well as the emotional state of other beings, making them skilled hunters like the Gotals. However, the Gotals were not related to the H'nemthe."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The highly structured H'nemthe society was shaped by the natural ratio of the H'nemthe sexes: only one female was born for every twenty males. Despite this imbalance, their culture was based primarily on the search for true love and the creation of new life, which they considered to be the ultimate in spiritual fulfillment."}, {"tag": "p", "text": "When a female H'nemthe consummated her relationship with a male, she eviscerated him with her knife-shaped tongue, considering it a proof of love. As a result, male and female H'nemthe mated very rarely, and then only in the case of true love. Since virgin females were rare, they lived a sheltered existence, and were seldom allowed to leave their homeworld. Strict traditions also restricted virgin females to a vegetarian diet, ensuring that their first lover's flesh was the first meat they tasted. The males of the species were timid and spent a considerable amount of their adult lives looking for true love."}, {"tag": "p", "text": "Many outsiders considered the deadly H'nemthe mating rituals to be a bizarre contradiction in an otherwise peaceful society. H'nemthe philosophers disagreed, however, pointing out that life coming from death was the way of the universe. In their beliefs, death was merely a change in form that paved the way for future generations. H'nemthe believed that a male killed after mating would receive the ultimate spiritual reward by going on to the netherworld to act as a spiritual guardian for his offspring, and males were thus unafraid of the certain death that would come their way if they found this love."}, {"tag": "p", "text": "H'nemthe prized music, and their music in turn was considered pleasant by non-H'nemthe. They also valued calligraphy, and H'nemthe who had either of these skills were given great accord in their culture. Poetry was also very important to the H'nemthe, and it was traditional for lovers to write each other poems. Females especially were expected to be talented in the arts. H'nemthe also enjoyed sciences and history, and studied them to learn more and prepare themselves for potential leadership opportunities. However, the H'nemthe spoken language was considered unpleasant to outsiders, as it was squeaky."}, {"tag": "p", "text": "The H'nemthe had a direct democracy on their planet, generally ruled by a female, as the males often had short lifespans due to the H'nemthe mating ritual. A Senate on H'nemthe consisted of delegates selected by local governments."}, {"tag": "p", "text": "Common H'nemthe names included Garriel, H'rassh, Liakkor, S'Basso, Vir'roc and Vishki."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet H'nemthe had few viable exports save for minerals, and though H'nemthe were known to take jobs in the music industry, they rarely left their home planet. They had few visitors and imported little, occasionally trading for technology or ships. When the Galactic Empire took control of H'nemthe, many left to join the Rebel Alliance on Anoat. Following the Yuuzhan Vong War, the Galactic Alliance made overtures to the H'nemthe leaders in hopes of becoming trading partners with the species. At some point during the New Republic's rule, the Shi'ido anthropologist Mammon Hoole included an entry on the H'nemthe in his publication The Essential Guide to Alien Species."}, {"tag": "h2", "text": "H'nemthe in the galaxy"}, {"tag": "p", "text": "In 22 BBY, a H'nemthe was present on Cavamina Minor, a Mid Rim moon, when the Jedi Aayla Secura traveled there to capture Attuma Duum. In 0 BBY, M'iiyoom Onith was one of the rare virgin females to leave her homeworld as part of an experiment to see how females would fare in finding a mate not from H'nemthe. In Chalmun's Spaceport Cantina on Tatooine, she fell in love with the Gotal Feltipern Trevagg. Trevagg, who was was unaware of the nature of H'nemthe mating rituals, seduced Onith, and was killed immediately afterward. Onith herself returned to her homeworld, where she gained a certain amount of notoriety. Her mating resulted in no progeny, as the Gotal and H'nemthe species were genetically incompatible. Yamnoss was present in the same cantina, during a night shift a few months after, when a mandatory curfew was issued by Imperial decree. A H'nemthe could be found in Jabba's Palace on Tatooine in 4 ABY. One H'nemthe, Dafi, worked as a bounty hunter during Imperial Period, and was an old rival of the Lepi smuggler Jaxxon. During a hunt for the Rebel hero Luke Skywalker, Dafi was gunned down by Jaxxon's partner, Amaiza Foxtrain, on Nar Shaddaa."}, {"tag": "p", "text": "A H'nemthe was also a member of Spiz's gang. H'nemthe could also be found working for Jabba the Hutt as bodyguards or as suppliers for the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The H'nemthe were created for Star Wars: Episode IV A New Hope. Their backstory was later expanded on in several books, such as Tales from the Mos Eisley Cantina, The Essential Guide to Alien Species, and The New Essential Guide to Alien Species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}