{"url": "H-60_Tempest_bomber/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starfighter classes", "Category:Galactic Republic starfighter classes", "Category:Slayn & Korpil products"], "nodes": [{"tag": "h1", "text": "H-60 Tempest bomber"}, {"tag": "p", "text": "The H-60 Tempest bomber was a flying wing-style bomber that was a predecessor of the B-wing starfighter."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Tempest resembled a larger version of the later B-wing starfighter, but lacked its folding wings. There was also a different engine configuration than that of the B-wing, and other design variations, including a cockpit on each end which were detachable for maintenance and repairs."}, {"tag": "p", "text": "It cost 172,000 credits, had medium laser cannons, twin light ion cannons, and a ventral proton bomb bay."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The H-60 bomber was developed for the Republic Navy in the final decades of the Galactic Republic. Naval planners held a dislike for the resource-heavy and unusual twin-cockpit design and the bombers saw little use. Some were stored in Republic scrap yards to be used for spare parts. As the Galactic Empire came to power, bombers were sold off to independent parties in secret and saw some moderate success for several decades. Only a few squadrons worth had been made when the line was scuttled, with the Rebel Alliance purchasing several of them at a drastic discount, being used in conflicts at the Outer Rim."}, {"tag": "p", "text": "Although the design was too inflexible to compete with more modern fighters, the best parts of the H-60 were used in the design of the B-wing starfighter. Around 0 BBY, the H-60 was used by the Rebel Alliance, with some ships from Ord Bueri kept in reserve at their main base on Yavin IV."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "As seen in Dorling Kindersley factbooks, the look of the H-60 Tempest was inspired by early concept art depicting a much sleeker B-wing starfighter, made during the production of Return of the Jedi in the early 80s.[source?] Leland Chee has said that a craft that resembles a B-wing in the Droids episodes \"Escape Into Terror\" and \"The New King\" may be the H-60 Tempest bomber."}, {"tag": "p", "text": "Although the The Force Unleashed Campaign Guide says the craft has a crew of four, Stay on Target says it only has two; a pilot and gunner."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}