{"url": "H.F._Marigand", "categories": ["Category:Legends articles", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "H.F. Marigand"}, {"tag": "p", "text": "H.F. Marigand was an officer who worked for Imperial Intelligence shortly after the formation of the Galactic Empire. As Section Controller J506, Marigand submitted a classified report for the Director of Imperial Intelligence, Armand Isard, outlining unresolved security risks posed to the Empire, among which he named clone deserters from the Republic's Grand Army, Mandalorian mercenaries of the Cuy'val Dar who had worked with the Grand Army's Special Operations Brigade, the Jedi-turned-Mandalorian Bardan Jusik, and the missing Separatist scientist Ovolot Qail Uthan."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "H.F. Marigand was an Imperial Intelligence officer who worked in service to the Galactic Empire in the time shortly after it's formation in 19 BBY. Marigand held the position of Section Controller J506 within the intelligence organization, during which time the officer submitted a classified report to the Director of Imperial Intelligence, Armand Isard, detailing a number of threats to the security of the Empire that still existed following the end of the Clone Wars, along with his recommendations as to how best to deal with them. Among the threats outlined in the report, Marigand named the clone deserters of the Galactic Republic's Grand Army—specifically the six Null-class ARC troopers, Alpha-class ARC troopers Alpha-26 and Alpha-30, and several clone commando squads—along with the Mandalorian Cuy'val Dar sergeants responsible for training the commandos and who had continued to work with the Republic's Special Operations Brigade throughout the war. Marigand also noted the former Jedi Knight Bardan Jusik as a potential threat, due to his departure from the Jedi Order to become a Mandalorian, and the former Separatist scientist Ovolot Qail Uthan, who had disappeared from Republic custody during General Grievous' attack on Coruscant."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Officer H.F. Marigand respected the prowess of the Null and Alpha-class ARC troopers, regarding them as high-level dangers to the young Empire and remarking upon the Alpha ARCs' reputation as \"one-man armies\" in a report to Armand Isard, the Director of Imperial Intelligence. Marigand was also concerned by the prospect of a Force-using Mandalorian, a threat embodied by the former Jedi, Bardan Jusik, though Marigand believed Jusik had become a mercenary when in fact he had not. Marigand also advocated a strike at the planet Gibad, both as a warning to other planetary governments who wished to dissent in the face of the new Empire, and a deterrent against aiding Gibadan native Ovolot Qail Uthan in her research into the FG36 nanovirus bioweapon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}