{"url": "HAVw_A5_Juggernaut", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Alliance to Restore the Republic vehicles", "Category:Galactic Empire vehicles", "Category:Galactic Republic vehicles", "Category:Juggernaut variants", "Category:Tanks"], "nodes": [{"tag": "h1", "text": "HAVw A5 Juggernaut"}, {"tag": "p", "text": "The HAVw A5 Juggernaut was a massive, ten-wheeled combat vehicle produced by Kuat Drive Yards. It was used by the Galactic Republic during the Clone Wars, and the Galactic Empire during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Designed and built by Kuat Drive Yards, the HAVw A5 Juggernaut was a 21.8 meter long wheeled assault vehicle. The main body of the A5 stood ten meters tall, with the separate sentry tower increasing the overall height of the Juggernaut to nearly fifteen meters. Equipped with thick, nearly impenetrable armor, the A5 incorporated dual control cabins, one located at either end of the vehicle. As a result, the A5 was steerable from either end, and the wheels were independently steerable from either control cabin. The dual steering control system was required due to the amount of time required to turn the vehicle completely around; in situations requiring the vehicle to reverse course, it could simply be driven from the other end of the vehicle."}, {"tag": "p", "text": "The A5 Juggernaut was driven by five sets of massive wheels, with large bump flexors providing shock support along with a flexible system of shocks and servos. However, the wheels lacked traction, and the use of independent drive units meant that the A5 lacked the maneuverability or the momentum to overcome certain rough or uneven terrains. The drive system was also awkward to operate, requiring precise coordination between the two pilots to keep the wheels in line during maneuvers to prevent locking the wheels up and immobilizing the vehicle. Juggernauts with damaged drive systems awaiting replacement parts could spend weeks waiting for repairs. A5 Juggernauts could reach a respectable speed of two hundred kilometers an hour in a straight line, but was slow to turn, dropping to a paltry twenty-five kilometers an hour."}, {"tag": "p", "text": "Mounted atop the Juggernaut was a sentry tower incorporating a sensor array that required additional height to function properly, as well as a communications antenna. The information gathered by the sensor array was relayed to the gunnery positions to aid in targeting. Without information from the tower, the A5 was forced to rely on information attained from ground level sensors, which in turn meant that the A5 was vulnerable to attacks from aircraft or vehicles out of direct line-of-sight. Its profile meant it was the most vulnerable and exposed point on the A5, and it was the least wanted posting for an A5 crew member."}, {"tag": "p", "text": "The A5 mounted multiple weapons systems including three Mk 1e/W heavy laser cannons one of which was turret mounted on the roof of the forward command cabin, and one each on either side of the vehicle covering the port and starboard fire arcs mounted on the rear quarter of the A5. The range of the laser cannons were two-thirds that of comparable weapons on a walker. A turret-mounted Mk 3/W medium blaster cannon or double medium blaster cannon was situated on the roof of the A5 on the centerline. Its range and stopping power were better than a walker's chin-mounted weapons. Two Mk 2/W concussion grenade launchers were equipped on the same turret as the medium blaster cannon, located under retractable covers. Each launcher had a magazine of either ten concussion grenades or six Mk 4/W concussion grenades. The firepower mounted on the A5 was comparable to that of an AT-AT walker."}, {"tag": "p", "text": "The A5 required two pilots, one in either command cabin, and six gunners to operate the various weapon systems. Another trooper was required for the sentry tower to provide target information for the gunnery positions. The A5 was primarily a troop transport, and could carry fifty soldiers in power armor along with all necessary equipment. It could also be reconfigured to carry light assault vehicles such as six speeder bikes, two light combat assault speeders, or other small repulsorcraft. The A5's ability to carry troops and small assault vehicles matched or in some cases exceeded that of a walker."}, {"tag": "p", "text": "A5 Juggernauts cost 200,000 credits to purchase new, and 120,000 used. Each vehicle had a cargo storage capacity of one metric ton, and a week's supply of consumables. Design elements for the A5 Juggernaut were incorporated into the later All Terrain Armored Transport."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The A5 Juggernaut was a predecessor to the AT-AT. During the Clone Wars, the Galactic Republic Senate passed a resolution allowing planets in demilitarized systems to create their own local defense forces to assist in repelling Confederacy of Independent Systems incursions. With Republic financial support and backing, Kuat Drive Yards was contracted to supply assault vehicles to the new local planetary defense forces, resulting in the creation of the A5 Juggernaut. Sharing design elements with the All Terrain Tactical Enforcer, the A5 was intended to be a larger, wheeled version of the AT-TE, with identical armor plating and a similar command cabin. Referred to as the \"rolling slab\" by its crew, the A5 inspired fear in those who opposed it. Playing a prominent role in military forces throughout the Outer Rim Territories, the A5 was considered to be a state of the art combat vehicle when it was introduced. The A5 was sold to governors, corporations, and private interests across the Outer Rim, and it also fell into the hands of criminal enterprises, including ones related to the Hutts. The unique drive system of the A5 made them effective combatants over rough terrain and urban environments."}, {"tag": "p", "text": "The A5 Juggernaut was one of the most powerful ground vehicles deployed during the Clone Wars, and were versatile combatants, deployed to spearhead ground assaults or engage in hit and run operations. They could also be employed as mobile command centers, or as anti-aircraft artillery against airspeeders and low-flying starfighters. By 19 BBY, the A5 had been supplanted in the Grand Army of the Republic by the considerably larger A6 model."}, {"tag": "p", "text": "With the rise of the Galactic Empire, many A5s serving in planetary defense forces were commandeered by the Empire for use in the Outer Rim Territories. They were generally deployed when AT-AT walkers were either not available, or terrain considerations prevented their use. During the Galactic Civil War, the Empire owned and maintained more A5 Juggernauts than any other concern. As newer and more modern combat vehicles were introduced, the Empire began retiring their stock of A5s, or abandoned their wrecks on the battlefield. The Empire considered the resources required to recover the hulks to not be worth the money or effort, allowing criminal enterprises, private companies, and insurgent forces to attain them."}, {"tag": "p", "text": "By the time of the Yuuzhan Vong invasion of the galaxy, few A5 Juggernauts remained operational. Those that still saw service required skilled mechanics and constant maintenance to keep them combat-ready."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}