{"url": "HAVw_A6_Juggernaut", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Empire vehicles", "Category:Galactic Republic vehicles", "Category:Juggernaut variants", "Category:Tanks"], "nodes": [{"tag": "h1", "text": "HAVw A6 Juggernaut"}, {"tag": "p", "text": "The HAVw A6 Juggernaut, more commonly known as the Juggernaut, the clone turbo tank, or simply the turbo tank, was a heavily armed and armored ten-wheeled tank manufactured by Kuat Drive Yards. They were used as military transports by the Grand Army of the Republic during the Clone Wars. Following the Galactic Republic's transition into the Galactic Empire, the A6 was used by the Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A massive, ten-wheeled heavy assault vehicle manufactured by Kuat Drive Yards for use by the Galactic Republic's clone army, the HAVw A6 Juggernaut was used as both a troop carrier and a main battle tank. The massive, lumbering Juggernaut was twice the size of the Republic's All Terrain Tactical Enforcer and was one the largest ground vehicles built by KDY, measuring to 49.4 meters in length. It had a boxy hull covered in sloping thermal superconducting armor that could disperse both the heat and energy of incoming fire over a broad area rather than ablating or reflecting damage. A powerful, high-output reactor powered the tank's complex all-wheel drive system that could deliver power to each wheel as needed for a maximum speed of 160 kilometers per hour. Each wheel was independently mounted and suspended, which added a layer of complexity to an already complicated drive system, but allowed for a surprising amount of articulation."}, {"tag": "p", "text": "The Juggernaut's interior was surprisingly spacious and could carry up to a company of 300 fully equipped clone troopers in individual jump seats on two decks. The forward section of the hull contained the vehicle's command deck with positions for the pilot, co-pilot, vehicle commander, navigator, engineer, comms operators, and two forward gunners. Directly aft of the command deck was a small trauma bay staffed by a medic or medical droid for treatment to wounded troopers. An extendable observation pod could be raised on a mast over the command deck to give a spotter an unparalleled view of the battlefield. A small bunker mounted aft of the troop compartment housed a backup command deck and the rest of the gunnery stations."}, {"tag": "p", "text": "Juggernauts also brought the destructive potential of an entire armored regiment to the battlefield. A6 models were armed with a broad array of two anti-personnel laser cannons, a dorsal turret-mounted rapid-repeating rotary laser cannon manned by a clone gunner, two retractable hull-mounted anti-personnel flex ordnance launchers, two twin forward-mounted anti-personnel light blaster cannons, and one dorsal turret-mounted heavy laser cannon. The armament granted the vehicle commander a bit of tactical flexibility."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "An HAVw A6 Juggernaut was deployed at the First Battle of Felucia during the Clone Wars against the Separatist Alliance. During the battle, Jedi Commander Ahsoka Tano's Juggernaut was accompanied by two AT-TEs, on a jungle patrol. Under the leadership of Padawan Tano, the tanks pushed forward against a large Separatist force, and she believed that the droids were in full retreat, when in actually they were regrouping to overwhelm Republic forces. LAAT/i gunships arrived from the 104th Battalion to evacuate Republic forces on Felucia, and after evacuating Jedi Generals Anakin Skywalker and Obi-Wan Kenobi and their forces, they headed to Tano's position. Tano refused to retreat, believing that they were winning over the Separatist forces. Skywalker ordered that the gunships land in front of the Juggernaut and Republic forces, in order to evacuate the clone troopers and convince Tano to retreat from the engagement. After Tano and her troopers evacuated and were airborne, Tano looked on to see her Juggernaut explode in a fiery destruction by the combined forces of Separatist droids and vehicles, which also knocked off nearby Republic vehicles."}, {"tag": "p", "text": "The HAVw A6 Juggernaut again saw action on Felucia during another battle against Separatist forces. During the attack, at least two Juggernauts accompanied AT-TE walkers as they bombarded a Separatist outpost. Juggernauts were also used on the Republic capital of Coruscant and could be seen deployed at the Republic Center for Military Operations. Several HAVw A6 Juggernauts were utilized extensively in the Battle of Kashyyyk alongside AT-APs, AT-RTs, and Infantry Support Platforms, where they faced against Separatist NR-N99 tank droids and DSD1 dwarf spider droids."}, {"tag": "p", "text": "Due to its success in being effective, the HAVw A6 Juggernaut was utilized by the Galactic Empire, the successor of the Galactic Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The HAVw A6 Juggernaut first appeared in Star Wars: Episode III: Revenge of the Sith released in 2005. The Juggernaut originated from a concept of a ten-wheeled tank used by the Empire during the Battle of Hoth by Joe Johnston for Star Wars: Episode V: The Empire Strikes Back before the AT-AT walkers were chosen over tanks. George Lucas later revisited this design when seeking to bridge the designs of the original and prequel trilogies. Unlike the original concept, the HAVw A6 was made larger and was better armored."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}