{"url": "HK-24_series_assassin_droid", "categories": ["Category:Legends articles", "Category:Czerka Arms products", "Category:HK-series assassin droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "HK-24 series assassin droid"}, {"tag": "p", "text": "The HK-24 series assassin droid was a class of assassin droid produced by the Czerka Corporation in the era of the Mandalorian Wars. Known for their distinctive red durasteel plating and fierce autonomy, the HK-24 was designed to impersonate protocol droids to avoid suspicion and easier facilitate the elimination of its target. Although the HK-24 represented a significant advance in droid technology at the time, and was mass-produced by Czerka in the run-up to the Mandalorian Wars, a lack of mass commercial appeal for an assassin droid ensured the HK-24 was a massive financial failure. However, Czerka recouped some of its financial losses when the entire production run of HK-24s was bought by Adascorp CEO Arkoh Adasca in 3963 BBY, so he could employ the droids in his search for runaway Arkanian Offshoot scientist Gorman Vandrayk. Adasca used many of these droids as security aboard his flagship, the Arkanian Legacy, but all of his HK-24s were destroyed when Vandrayk set a host of massive exogorth beasts upon the Arkanian's ship."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A class of assassin droid designed by the Czerka Corporation, the HK-24 represented one of the deadliest advances in droid technology of the era of the Mandalorian Wars. Despite their red durasteel armor plating and sinister-looking orange visual sensors, HK-24s appeared to be common service droids to the untrained eye, but that was intentional on Czerka's part. HK-24s were in fact designed to impersonate protocol droids to lure their targets into a false sense of security and make the eventual kill that much easier. Despite their unremarkable appearance, HK-24s were deadly with a blaster rifle and highly cunning, possessing a heuristic processor to boost an HK-24's learning and reasoning and outfitted with a translator unit that allowed it to understand millions of forms of communication."}, {"tag": "p", "text": "In hand-to-hand combat, HK-24s could utilize a utility vibroblade that helped the assassin droid specialize in cutting off limbs. HK-24s could be effectively used not only as assassins, but as bounty hunters, although their use earned criticism from organic hunters in the era of the Mandalorian Wars. HK-24s also saw use as security— their durasteel frame was quite sturdy, able to withstand crushing hits from much larger opponents, such as bulk-loading droids, and lose little if any functionality. However, HK-24s could not always be counted on to work together. The droids were fiercely autonomous and resented others of the same class, as each HK-24 believed itself above its \"redundant\" and \"artifact\" peers. Grouping several HK-24s together often simply resulted in the droids bickering and insulting one another."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The first major success in Czerka Corporation's assassin droid production, the HK-24 was mass-produced in the hopes that demand from the Galactic Republic and planetary governments would be high in the run-up to the Mandalorian Wars between the Republic and the Mandalorian Neo-Crusaders. Czerka overestimated their market, however—most people in the galaxy simply did not have a need for an assassin droid in their day-to-day lives—and the HK-24 wound up as a financial failure, with their production facilities eventually being shut down and abandoned. Although the HK-24 was not a success for Czerka, the droids wound up being put to great use by one of the Republic's captains of industry: Arkoh Adasca, the CEO of Adascorp, the galaxy's largest bioengineering firm. With the war looming, Adasca had a plan to turn his corporation into a galactic player, by selling the destructive services of the massive, monstrous space slug species known as the exogorths to one of the competing factions in the war, effectively choosing the winner. However, this plot had no chance of success without the knowledge of one particular Arkanian Offshoot scientist named Gorman Vandrayk, who had fled Adascorp over thirty years before when he realized the company was planning on weaponizing the beasts."}, {"tag": "p", "text": "After a long search, Adasca's Rodian aide Eejee Vamm discovered in 3963 BBY that Vandrayk was alive and had emerged from hiding after sighting him in security footage from the banking world of Telerath. In response, Adasca purchased the entire production run of HK-24s and sent them to nearby systems to track him down. Soon afterward, one HK-24 unit found the elusive scientist on the backwoods world of Ralltiir, managing to gain entry to his junk hauler, The Last Resort, concealed in a crate of hyperdrive parts. The HK-24 emerged from its hiding place once the ship jumped to hyperspace, quickly identifying a shocked Vandrayk, along with his close friend and protector, Jarael. HK-24 needed Vandrayk alive, but deemed the other Offshoot to be immaterial to his objective and decided to eliminate her. Jarael leapt in to protect Vandrayk, and as the HK-24 approached—intending to carve the Offshoot up with its vibroblade—the assassin droid was attacked and sent flying across the cargo hold by Vandrayk's massive bulk-loading droid, T1-LB. The HK-24 recovered, drew its blaster rifle and incapacitated the droid with a series of laser blasts, only for Jarael to attack it from behind with a chain. Jarael managed to destroy one of the HK-24's sensors, but the droid had gained the upper hand when it was destroyed in a surprise attack from behind by the Mandalorian warrior Rohlan Dyre, an acquaintance of Vandrayk's and Jarael's who had secretly stowed away on their ship."}, {"tag": "p", "text": "Not long afterward, however, Vandrayk was forced to return to Arkania due to an illness, where Adasca was able to manipulate Jarael into helping lead them to the Offshoot scientist. Vandrayk was quickly brought back to health once aboard Adasca's flagship, the Arkanian Legacy, where he was put back to work on the exogorths—by order of Adasca, he was accompanied everywhere by a squad of HK-24 units to ensure compliance. Once the Arkanian Legacy reached Omonoth, where a large number of dormant exogorths were located, the time for the auction had finally come—invited parties from the Republic Navy, Mandalorians and the Jedi Order's interventionist Revanchist faction flocked to the Adascorp flagship, and Adasca began using his HK-24 units openly as security. Adasca also directed several HK-24s to secure the ship's brig after acquiring a pair of high-profile prisoners: Zayne Carrick, the alleged perpetrator of the Padawan Massacre of Taris, who arrived in the custody of the Republic delegation, and Lucien Draay, a Jedi Master who had been poisoned and incapacitated by Adasca after he unexpectedly crashed the auction."}, {"tag": "p", "text": "Guarded by five HK-24 units, Carrick and Draay managed to overpower their captors and escape, and formulated a plan with Republic Lieutenant Carth Onasi to disrupt the auction and foil Adasca's power grab. With Carrick posing as a Mandalorian, the prisoners and Onasi were able to create a distraction allowing Draay to attack and cut through Draay's personal guard of HK-24s. Meanwhile, Vandrayk reprogrammed the HK-24 watching him to destroy the exogorth command station as he escaped and directed the massive beasts to tear the Arkanian Legacy apart. Adasca still had several dozen HK-24 units defending him to the end, but they were all destroyed along with their master as the exogorths obliterated the ship and ended his dreams of domination. At some point not long after the Mandalorian Wars, the HK-24 was illegal and found only rarely around the galaxy. Several years after the end of the war, during the Jedi Civil War, the Dark Lord of the Sith Darth Revan based his design of the HK-47 assassin droid off the HK-24, adding several of his own upgrades. The HK-47 in turn became the basis for the HK-50 assassin droid, which was produced en masse by Revan's Sith Empire during the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The HK-24 assassin droid first appeared in Knights of the Old Republic 13, an issue of the Star Wars: Knights of the Old Republic comic book series, written by John Jackson Miller and released in 2007. After the droid's second appearance in the series' next issue, Miller revealed that the HK-24's number was inspired by NASCAR driver Jeff Gordon who, sponsored by Lucasfilm, drove a #24 car bearing the image of Yoda to a victory in the 2005 Aaron's 499—Miller kept a miniature model of Gordon's Yoda car on his writing desk. The HK-24 droid went on to appear through the ensuing story arcs Nights of Anger and Daze of Hate, and over the course of the droid's appearances in the series it was illustrated by Brian Ching, Harvey Tolibao and Bong Dazo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}