{"url": "HK-01", "categories": ["Category:Legends articles", "Category:HK-series assassin droids"], "nodes": [{"tag": "h1", "text": "HK-01"}, {"tag": "p", "text": "HK-01 was a rogue prototype Hunter-Killer assassin droid in operation around 4015 BBY. Designed and built by the Czerka Corporation, HK-01 served as the basis for all later models of HK assassin/protocol droids. Sometime after his activation, HK-01 rebelled against organic life and started amassing his own droid army, instigating what became the Great Droid Revolution."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime after his activation, HK-01 gained a large degree of independent sentience and began secretly reprogramming his fellow droids, aiming to liberate his automaton brethren from their organic masters."}, {"tag": "p", "text": "HK-01 set the droids to rise up in revolution at his command, and across the galaxy, droids suddenly became violent and aggressive towards their owners. Once-loyal battle droids turned against their masters, and subjugated entire planets in the name of the Droid Revolution."}, {"tag": "p", "text": "Despite his impressive command of his new army, HK-01 was unable to remain in control of the droids, and his orders were soon deciphered and traced by agents of the Galactic Republic. The Jedi Knights, lead by Master Arca Jeth, were able to locate the source of these dangerous communications and shut HK-01 down, ending the rebellion."}, {"tag": "p", "text": "In spite of the trouble HK-01 caused, the Czerka Corporation was able to conceal their role in HK-01's creation, and the Hunter-Killer series continued development, evolving over time with newer and more advanced models."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like all later Hunter-Killer assassin droids, HK-01's chassis is designed to look like a normal (if slightly sinister) protocol droid. Despite being the oldest model of HK droid, HK-01 displayed a rebellious and tactical mind that surpassed any of his successors as he was able to successfully reprogram droids on a galactic scale and start a war against organic life."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}