{"url": "HH-87_Starhopper/Legends", "categories": ["Category:Legends articles", "Category:Hutt Cartel starfighter classes", "Category:MandalMotors products", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "HH-87 Starhopper"}, {"tag": "p", "text": "The HH-87 Starhopper was a starfighter used commonly by various factions of the criminal underworld. Notably, the craft saw widespread use by the Hutt crime families and Zygerrian slavers of the Zygerrian Slave Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The long-ranged starfighter was 6.8 meters long with a 13.59 meter wingspan. The craft's design was largely influenced by the tastes of the Hutt criminal empire: with visible armor platings and a prominent prow, the Starhopper displayed the Hutts' aggressiveness. Equipped with twin blaster cannons and compact stabilizer wings, the long-range craft was suited to a various number of activities carried out by seedy underworld organizations."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Starhoppers were used commonly by the Hutts to patrol the skies above their homeworld, Nal Hutta. In addition, the Hutts used the Starhopper to hunt down wayward debtors. The craft fell into the hands of various other seedy organizations, including the Zygerrian Slave Empire. The Zygerrians kept a number of them on the planet Kadavo which were stationed at the Kadavo slave processing facility."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The starfighters saw a combat role by the Zygerrian slavers during the Clone Wars. In the second year of the war, during the Battle of Kadavo, at least two Starhoppers were deployed when the forces of the Galactic Republic, led by Jedi General Plo Koon, invaded the planet with the intention of freeing the captured Togruta populace of the artisan colony world Kiros along with Jedi Knight Obi-Wan Kenobi. Two Zygerrians piloted HH-87 Starhoppers against the clone Z-95 starfighters and Koon's Blade of Dorin. After one of the Zygerrian pilots managed to damage the Z-95 piloted by a clone trooper pilot named Warthog, Koon destroyed both Starhoppers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Starhopper's first appearance in the Star Wars canon was \"Escape from Kadavo\", the thirteenth episode of the fourth season of the television series Star Wars: The Clone Wars."}, {"tag": "p", "text": "The craft's design was based on original concept art for the Imperial shuttle seen in the film Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}