{"url": "HK-51", "categories": ["Category:Legends articles", "Category:Alliance individuals", "Category:Czerka Arms products", "Category:HK-series assassin droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "HK-51"}, {"tag": "p", "text": "HK-51 was an individual HK-51 series assassin droid manufactured by Czerka Corporation shortly before the end of the Great Galactic War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the late stages of the Great Galactic War, the Sith Empire ordered a shipment of HK-51 series assassin droids from Czerka Corporation, but the Sith warship Fatality carrying the shipment was hijacked and crashed on Belsavis in the Frozen Lake of Section X. The droids aboard the vessel remained deactivated for decades, until during the renewed Galactic War in 3639 BBY an individual of great importance visited the wreckage. They found that one of the HK-51 units was still in a salvageable condition and acquired the necessary parts required to repair it. Upon reactivation, the droid welcomed the individual as his new master."}, {"tag": "p", "text": "While serving his new master, HK-51 started to become aware that his combat and assassination efficiency was swiftly declining. Analysis of the trend showed that if this continued, the droid would eventually be unable to function. The problem was discovered to be a failsafe subroutine buried deep within HK-51's programming. This failsafe would cause the eventual shutdown unless HK-51 successfully assassinated at least one individual on an implanted kill list, though killing an target would slow the degradation of his protocols. His master dispatched HK-51 to assassinate one of the targets, a mission that HK-51 successfully completed, and after the mission reported that his protocols were as efficient as the day he was manufactured. Coming to admire his master, almost to the level of idolization, HK-51 became worried that one day he would be reprogrammed to turn on the master that he respected. Searching for a way to resolve this, HK-51 found a loyalty subroutine that would permanently set his loyalty to his master and anyone his master specified. His master agreed to activate the subroutine, and HK-51 was overjoyed, congratulating his master and suggesting they celebrate by killing a large number of enemies."}, {"tag": "p", "text": "Although his master disappeared during the Eternal Empire conquest in 3636 BBY, HK-51 was reunited with them 3631 BBY, when his master was rescued from captivity on Zakuul and became the Commander of the Alliance that opposed the Eternal Empire. HK-51 reunited with his master in the Alliance base on Odessen, where during a party at the Alliance cantina, the droid was confronted by Tora, who mistook him for HK-55, another HK-series assassin droid droid she recently encountered on the Asylum."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "HK-51 was designed to be a lethally efficient assassin and to take great enjoyment and pride in his duty. Quite unlike his predecessors he was programmed to be very polite, cheerful and friendly to his master and their allies. His programmers felt that previous models were too unsettling in their brutality, and HK-51 himself even referred to models like HK-47 as \"unstable.\" HK-51 did not seem to express any sort of hatred or disgust with organic beings or other droids that was common with previous HK models. HK-51 also expressed dislike of political backstabbing and faction infighting, though he would partake in both if ordered to by his master. Outwardly, HK-51 appeared to be nothing more than an antique Systech Corporation protocol droid. This was the norm for most HK-series droids and one of the reasons for their unrivaled lethality."}, {"tag": "p", "text": "While he was capable of both precision assassinations and mass murders, HK-51 much preferred to assassinate singular targets who were difficult to hunt. In this way, he was much more like HK-47 than his direct predecessors, the HK-50 droids. Much like HK-47, HK-51 viewed his assassinations as an art form. Despite this, he was programmed to put efficiency ahead of art, though he most enjoyed it when he could have both. HK-51 quite enjoyed organics, as his negotiation/protocol programming was more prominent than in previous models. He himself proudly stated that he was an excellent conversationalist, and HK-51 also frequently used code words so as not to give away his true nature and purpose around those who may be alarmed. He often referred his targets as \"undesirables\" or \"troublemakers,\" assassination/murder as \"liquidation\" or \"deletion,\" and those who would be alarmed if they discovered his true purpose as \"polite company.\" HK-51 also often referred to a \"Maker,\" which seemed to be some sort of deity responsible for fate."}, {"tag": "p", "text": "HK-51 featured several improvements and upgrades over his predecessor models. Besides being more armored and accurate than previous models, HK-51 was far more mobile and maneuverable. He was capable of faster and more fluid motions, almost able to replicate those of organic humanoids, perform leaps and combat rolls. HK-51 also had built-in weapons and equipment: wrist mounted micro-missile launchers and railgun, hidden smoke grenades, a stealth field generator, and the ability to repair himself if critically damaged. If all other options failed, HK-51 was implanted with a powerful explosive which he could activate in a kamikaze attack to complete his mission."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "HK-51 appears in Star Wars: The Old Republic as a companion character available for all classes. Unlike all other companions, obtaining HK-51 requires the completion of a specific quest chain that begins in the Section X area of Belsavis and leads to the discovery of the crashed Imperial battlecruiser Fatality, carrying a full complement of damaged but salvagable HK-51s. To claim an HK-51 for themselves, the player must explore the abandoned Czerka Corporation cruiser Theoretika in the Unknown Regions, and obtain a set of HK schematics. Afterwards, they must collect certain HK parts from Coruscant, Dromund Kaas, Taris, Hoth and Tatooine, as well as the False Emperor and either the Maelstrom Prison (Republic) or the Foundry (Empire) flashpoints. After the parts are collected, the player must return to the Fatality wreck on Belsavis, and defeat a Sith of the Dread Host called \"The Lord of Agony,\" after which the player may claim their HK-51."}, {"tag": "p", "text": "Players of both factions acquire a slightly different version of HK-51, with unique conversations and ambient dialogue, as well the list of three targets, one of whom the player must single out for HK-51 to kill. However, during the Knights of the Fallen Empire the characters of the original eight classes disappear and HK-51 appears as the Outlander's droid, provided the player unlocked him prior to the expansion. HK-51 provides commentaries on the environmental surrondings only on Makeb and participates in the cutscene between the player and HK-47 during the \"False Emperor\" flashpoint, in which HK-51 claims that HK-47 is an inferior model, while HK-47 insists that he is still the pinnacle of HK droid models."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}