{"url": "HK-77", "categories": ["Category:Legends articles", "Category:Droid stubs", "Category:HK-series assassin droids"], "nodes": [{"tag": "h1", "text": "HK-77"}, {"tag": "p", "text": "HK-77 was an assassin droid developed by the Confederacy of Independent Systems during the end of the Clone Wars, but they were not produced or deployed until the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The HK-77 assassin droid was considered the pinnacle of the HK-series assassin droid lines that were designed by the Separatists. It was based on the HK-47, HK-57, HK-58, and HK-67 models. It was slightly shorter than the other models, and had a narrow head with optical sensors that extended from each side of it. Unlike the earlier models, the HK-77 had blaster rifles integrated into its arms for quick and easy access. HK-77s came in 2 primary variants: assault droids and squad leaders."}, {"tag": "p", "text": "It was considered extremely aggressive and preferred overt action to stealth. It would often reveal itself to a target and give it an opportunity to escape or attack first."}, {"tag": "p", "text": "It cost 19,865 credits. A popular modification was to convert the HK-77 into a firefighting droid by replacing the blaster rifles with fire extinguishers and coating the armor with a heat-resistant material."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The HK-77 assault droid was designed by Separatist engineers after finding and reverse engineering HK-47, attempting to combine the assassin droid's design with their battle droids. Unlike their predecessor, these droids are made for more direct combat. HK-77s were designed to serve as bodyguards or henchmen to larger droids. A small army of HK-77 units was created by HK-47 on Mustafar during the Galactic Civil War, but were defeated by a group of spacers. Several made it off world and continued their function as assassins, but others were repurposed for various jobs, including firefighters and gamblers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}