{"url": "HOB-147", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Clone trooper pilots"], "nodes": [{"tag": "h1", "text": "HOB-147"}, {"tag": "p", "text": "HOB-147 was a clone pilot who flew a V-19 Torrent starfighter for Light Brigade Division in the Grand Army of the Republic. He was shot down in a space battle during the Clone Wars, but survived in his starfighter, and floated through space, unconscious. Shortly after Order 66—one of the GAR's 150 contingency orders that instructed the clone forces to eliminate all Jedi—was issued, he was rescued by the junk salvager Hurd Coyle. Order 66 began the Great Jedi Purge, the near-eradication of the Jedi Order, which allowed the then Supreme Chancellor Palpatine to reorganize the Republic into the Galactic Empire and declare himself Galactic Emperor."}, {"tag": "p", "text": "After being rescued, 147 first assumed that the salvager was working for the Separatists when he saw re-programmed battle droids working throughout the ship, and found a group of Jedi younglings in the ship's cargo bay. Believing that Coyle had kidnapped them, 147 was surprised to discover that Hurd Coyle was in fact transporting the younglings to the Outer Rim in order to save them from the new Galactic Empire. 147 then decided to disobey Order 66, and did not inform his fellow clones that Coyle was transporting the children."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rescue"}, {"tag": "p", "text": "The clone trooper pilot HOB-147 was one of the many clones of the bounty hunter Jango Fett created on the planet Kamino to serve in the Grand Army of the Republic. Shortly before the Battle of Utapau, HOB-147 flew a V-19 Torrent starfighter for Light Brigade Division in a space battle between the Galactic Republic and the Confederacy of Independent Systems. During the battle, 147's starfighter sustained heavy damage and he was sent adrift in space. Although the V-19 was badly damaged, the cockpit was not penetrated, and the life support was still active, keeping him alive."}, {"tag": "p", "text": "147 drifted for several weeks, unconscious, and during this time, he missed the Battle of Utapau, the last major battle of the Clone Wars. Additionally, he missed Supreme Chancellor Palpatine's declaration of Order 66—one of the Grand Army of the Republic's 150 contingency measures that ordered the clone forces to eliminate any Jedi in the area, as they were considered a threat to the Republic. This measure allowed Palpatine to declare himself Emperor of the galaxy, and create the Galactic Empire out of the Old Republic. After a while, HOB's starfighter drifted near a ship owned by Hurd Coyle, a salvager passing through the area."}, {"tag": "p", "text": "A reprogrammed B1-Series battle droid that was working for Coyle detected the clone's ship and informed his master. Coyle then ordered the starfighter to be brought aboard, thinking that even though he was on a mission, he could still make a few credits from salvaging it. When a group of B1s went down to the hangar to dismantle the ship, and see if anything could be salvaged, they discovered that 147 was still alive. When they told Coyle, he reluctantly ordered one of his battle droids to bring 147 to the ship's sick bay."}, {"tag": "h3", "text": "Discovering Coyle's mission"}, {"tag": "p", "text": "When 147 awoke, he discovered that he was surrounded by droids. Thinking that he had been captured by the Separatists, the clone jumped out of his bed, and started to destroy the droids with his bare hands. When Coyle walked in, he was surprised to see that 147 had wrecked his new droids. In an attempt to stop the clone, the Captain shot 147 with an electro-dart, knocking him down and completely paralyzing him. While 147 was incapacitated, Coyle dragged the clone to a small room and chained his leg to the wall."}, {"tag": "p", "text": "Regaining consciousness, 147 found himself chained to the wall of the room, with Coyle sitting to his side. Coyle told the pilot about Order 66, and how the Jedi Order was now considered an enemy by Palpatine. 147 was surprised at this, and didn't completely believe it. When Coyle walked away, the clone sat down and started to think things through. While he was thinking, a female Jedi youngling, Nia, appeared in the vent system on the wall, and began to watch 147. He saw her there, and quickly ripped the cover off the vent and pulled Nia out. While 147 asked the girl who she was, Coyle walked into the room, and seeing what was happening, shot 147 with another electro-dart, and dragged Nia out of the room."}, {"tag": "p", "text": "Once 147 had once again recovered and gotten back to his feet, he now felt certain that whatever was going on was a Separatist plot, and that he needed to escape. The clone ripped the metal chain off the wall, and ran through the salvager's ship, looking for a way out. Eventually, he paused at a corner and found a B2 super battle droid guarding the door to the hold. HOB destroyed the battle droid and decided to look inside the hold, but as he walked into the room, he was attacked by an unknown, invisible force, and passed out."}, {"tag": "p", "text": "When he regained consciousness, 147 discovered that there were Jedi younglings all around him, and that the unseen force that attacked him was likely the Force. 147 kicked the younglings away from himself, and discovered that Coyle had at least eleven younglings aboard his ship, including Nia and Bon; it turned out that Coyle had taken on a mission to transport the Jedi younglings to the Outer Rim. Nia went up to 147, thinking that he wouldn't hurt her. She asked him whether all clones were bad or not. Touched by her childlike innocence, HOB decided to disobey Order 66 and his programming, and help the Jedi escape from the new Empire."}, {"tag": "p", "text": "Meanwhile, Coyle's ship was boarded by a group of clone troopers patrolling the area, suspecting he was hiding something aboard. When Coyle went to greet them, their ARC trooper commander threatened to order his men to tear the ship apart in order to find anything incriminating on board, although Coyle begged them not to. HOB-147 then walked in, saying that Coyle had saved his life, and that he had been up and down the ship and had found nothing wrong. The ARC trooper believed the pilot's lie, and ordered his men back to their cruiser. As 147 walked out, he saw Nia waving to him from a nearby vent, saying she knew he was tough."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "HOB-147, who was trained over a period of years to follow every order given to him by his commanders, had enough self-will to disobey Order 66, and allow a group of Jedi younglings to escape from the Empire. 147 was also very strong and muscular, as was shown by him possessing enough strength to tear a chain used to hold him—a full grown man—off of a wall. He also was able to defeat a heavily armored B2 super battle droid in close quarters combat by simply hitting it over the head with a hard piece of metal, albeit by surprise. 147 had brown eyes, black hair, tan skin, and, like all clone troopers, stood at 1.83 meters tall."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "HOB-147 made his first appearance in the Clone Wars Adventures comic Salvaged. He later had a small entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}