{"url": "HMOR_homing_droid", "categories": ["Category:Legends articles", "Category:Fifth-degree droid models", "Category:Imperial Department of Military Research products"], "nodes": [{"tag": "h1", "text": "HMOR homing droid"}, {"tag": "p", "text": "The HMOR homing droid was a fifth-degree homing droid produced by the Imperial Department of Military Research and used during the Galactic Civil War."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "The HMOR unit was larger than most homing droids, and was considered to have an ill-tempered artificial personality. Equipped with both a repulsorlift and a set of wheels, the droid was able to infiltrate many high-security locations, even those where the presence of an unfamiliar repulsor field would trigger an alarm. The droid carried a detachable homing device on its back, which it would leave behind to set pursuers off its trail. The HMOR's active signal was broadcast over hyperwave, and had a range of tens of thousands of light-years."}, {"tag": "p", "text": "The HMOR droid was programmed with an extensive database of over four-and-a-half million starship and airspeeder classifications, appropriated by Imperial scientists from the Pistoeka sabotage droid once used by the Confederacy of Independent Systems."}, {"tag": "p", "text": "If discovered, HMOR units were programmed to cause as much damage as possible before self-destructing to ensure any data it carried would not fall into enemy hands. To this end, each droid was equipped with two explosive seeker drones, and, alongside its manipulator arm, featured a retractable arm that could spray an acid stream at targets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "HMOR droids were used as tracking devices by the Galactic Empire. Imperial personnel secreted a HMOR homing droid aboard Millennium Falcon while it was held aboard the Death Star. The vessel escaped the battlestation and rendezvoused with Alliance High Command on Yavin 4—the presence of the HMOR droid thus ensuring the Imperials now had precise coordinates of the secret Rebel base. The droid was discovered on Yavin 4 by R2-D2 and C-3PO, and launched its seeker drones in retaliation. It then attempted to destroy Massassi Station's power generator, but was thwarted by C-3PO who trapped it between two closing blast doors, slicing the droid in half."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The HMOR homing droid first appeared in Star Comics' Droids 8. It went unmentioned again until it received an entry in The New Essential Guide to Droids. Author Daniel Wallace included the droid at the suggestion of Abel G. Peña, who also supplied Wallace with material from the original comic for reference. Artist Ian Fullwood redesigned the cartoonish homing droid depicted in the comic to appear realistic in the context of Star Wars; he also incorporated into the overall design the homing beacon shown in Empire 15 to show that the homing droid carried and planted the beacon seen in that comic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}