{"url": "Haazen", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Cyborgs", "Category:Fallen Jedi", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Members of the Jedi Covenant", "Category:Members of the Sith Brotherhood", "Category:Sith sorcerers", "Category:Treasure keepers"], "nodes": [{"tag": "h1", "text": "Haazen"}, {"tag": "p", "text": "Haazen was a failed Padawan-turned Dark Jedi who lived during the time of the Great Sith War and Mandalorian Wars. Alongside his best friend Barrison Draay, whose family Haazen's own had served as stewards and retainers for generations, Haazen was a student of Jedi Master Arca Jeth and a close friend of Krynda Hulis, Barrison's future wife."}, {"tag": "p", "text": "Though he failed to achieve Knighthood, Haazen continued to serve the Order as a field mortician during the Great Sith War. Eventually, Haazen betrayed the Jedi and participated in a Sith conspiracy that resulted in the death of countless Jedi, including his liege. However, Haazen suffered many injuries in the process. His dark thoughts well hidden, Haazen aided Krynda, now the mother of Barrison's son in forming her secret organization for the purpose of preventing the return of the Sith, serving her faithfully until he could wrest control of the Covenant from her and set his own plans in motion. Around that time, Haazen had been the mentor of Lucien Draay and confidant."}, {"tag": "p", "text": "When Krynda became critically ill, Haazen hid her and became the acting leader of the Covenant in her stead, pulling the strings on Lucien and his comrades into his control, having all but his old student killed one by one. But as he finally came close in taking control of the Jedi Order, Haazen was defeated by Lucien and his former Padawan, Zayne Carrick."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early years and Jedi training"}, {"tag": "p", "text": "Haazen's Jedi training took place on Arkania under Arca Jeth. His fellow students included his old friend, Barrison Draay, and Krynda Hulis. Haazen was a member of the family that served as stewards for the royal Draay family, so Haazen came on essentially as Barrison's servant, though the two eventually became good friends."}, {"tag": "p", "text": "Unlike his fellow students, Haazen didn't develop into a Force virtuoso, his abilities with it remaining, as he termed it, awkward. His abilities were so negligible that when he was trailing the Nautolan smuggler Dossa, he was easily beaten in physical combat when she confronted him. Taunting him with his stolen lightsaber, Dossa proceeded to topple a nearby obelisk onto Haazen, shooting the base with her blaster. It was only Barrison's intervention that saved his life."}, {"tag": "p", "text": "At the time, preparations were being made for the knighting of Arca Jeth's students, and Barrison attended a celebration put on by his family, Haazen and Krynda as his guests. At the subsequent knighting ceremony, Barrison and Krynda were knighted, but Haazen was not. Haazen's compromised abilities, lack of perception and predictable temperament made him unfit for knighthood. Enraged, Haazen stormed out into the snow outside."}, {"tag": "p", "text": "Barrison came out to console him, but Haazen lashed out at him. Barrison Draay, as well as being his friend, was also the subject of his envy, having everything he himself wanted; money, honor, and a relationship with Krynda. Barrison responded by punching Haazen, but realizing that this was wrong, forgave Haazen for his behavior, and offered the failed Jedi another way to continue serving him."}, {"tag": "h3", "text": "Fall to the dark side"}, {"tag": "p", "text": "During the Great Sith War, Haazen continued to serve Barrison, but as his assistant, not a Jedi. He did not participate in the direct battles, and his work consisted of taking care of the bodies that had remained in the battlefield. Krynda soon became Barrison's wife and bore a child named Lucien."}, {"tag": "p", "text": "After the Battle of Toprawa, Haazen was approached once again by Dossa, who was now a servant of Exar Kun. Dossa teased him about his servitude to Barrison, and then offered Haazen a way to return as the only hero and get whatever he wanted, asking what that was. Haazen proclaimed that he wanted Barrison's life and everything in it. Giving in to his hatred and envy, Haazen turned to the dark side and joined the Sith."}, {"tag": "p", "text": "Dossa instructed Haazen to lead the Jedi forces into the Ansharii Caverns, a trap intended for the Jedi. However, Dossa purposefully detonated the charges before Haazen could get clear. Though he survived the blast, he lost both of his legs, his right arm and eye. However, his body was salvaged by Dossa, and he awoke in a Sith enclave some time later to find his injuries more or less healed, thanks to the efforts of Doctor Uburluh. But he was left heavily disfigured, and his missing limbs and eye had been replaced by grisly inhuman prostheses. In addition to the prosthesis, Haazen also had a Sith artifact known as the Yoke of Seeming implanted into his back. The Yoke caused the Living Force to flow past and around Haazen rather than through him, allowing his thoughts and feelings to remain clouded, unreadable by Jedi. Dossa theorized that the implantation of more Sith artifacts and equipment into Haazen's body could expand his powers and abilities, making him potentially invincible. When Dossa included the condition that he must quit the Jedi before they could help him, Haazen stated that he was neither Jedi nor Sith, aspiring to be something more. He then killed Dossa for all the humiliation he had suffered at her hands."}, {"tag": "p", "text": "While he no longer remained with the Jedi Order, he continued to serve Krynda as her retainer, much as he served her late husband. However, she remained unaware of his feelings for her nor his part in Barrison's death. Despite the Yoke of Seeming's power to subtly influence others, allowing them to accept his mutilated appearance, Haazen took to wearing an all-concealing cloak."}, {"tag": "h3", "text": "Forming the Covenant"}, {"tag": "p", "text": "At the Draay Estate, Krynda began to form a cabal, a Covenant within the Jedi Order, whose one goal was to maintain vigil against the return of the Sith. Though not serving as a Jedi anymore, she trained seers and then inserted them in the Order as Knights. Not wanting anything to do with those in the Jedi Temple, Haazen was her liaison with the Order and all other contacts throughout the galaxy."}, {"tag": "p", "text": "While Krynda was training a group of Jedi seers that would form the prophesied First WatchCircle, Haazen began training her son, Lucien, who was not particularly fond of the idea. As Lucien slowly became a fighter, Haazen remarked he had his father's skills. When those four seers (Feln, Q'Anilia, Raana Tey and Xamar) were relocated to the Jedi Tower on Taris, Haazen recommended to Krynda that Lucien be the one to serve them as Hand."}, {"tag": "p", "text": "Haazen was with Krynda when she foresaw the Prophecy of the Five, which directed to five individuals who would see the Jedi Order and the Republic fall before them. Raana was overhearing them when she came to talk about one of Q'Anilia's visions and would later believe that the prophecy would refer to the First WatchCircle's Padawans. But Haazen had twisted the prophecy to suit his own ends."}, {"tag": "h3", "text": "According to plan on Taris"}, {"tag": "p", "text": "Weeks after the Padawan Massacre, a series of riots began to breakout due to the escape of Lucien's Padawan, Zayne Carrick. With Taris lost, the Jedi High Council recalled the Masters to Coruscant for their failures. Upon meeting, Haazen blamed his former apprentice for nearly exposing the Covenant and reducing its effectiveness, as well as for not bringing the Padawans to him and Krynda to be examined. He then ordered Lucien to bring Zayne Carrick to him alive. Lucien refused, saying that while Zayne was still alive he posed too great of a risk. The decrepit Jedi grew angry and further emphasized that he and Krynda alone—having both lived through the Great Sith War—knew best how to deal with such a threat, and then repeated his orders to Lucien."}, {"tag": "h3", "text": "The First WatchCircle fractures"}, {"tag": "p", "text": "After the Circle was split up by Vrook Lamar, Haazen continued to aid them in their efforts. The Economic Study Circle predicted the decline in Telerath's peacefulness and ordered the Draay Trust to sell off its stocks there before it fell to pieces. As the Mandalorian Wars erupted in the galaxy and Zayne Carrick was captured by Admiral Saul Karath, Haazen put aside the Covenant's mission of capturing Zayne and stopping the Mandalorians in pursuit of a more dire situation. Acting on Miraluka visions of an evil, mindless and faceless being rising and destroying everything in its path. Among these visions were a meeting of enemies, one of which was identified as being Adascorp's leader and Lucien's old friend, Arkoh Adasca. Haazen was more suspicious, as according to their sources on Telerath, Adascorp was constantly monitoring all visitors and it suddenly stopped, about the same time that the Moomo Brothers fouled up their surveillance on Arvan Carrick, Zayne's father."}, {"tag": "p", "text": "Haazen sent a holographic transmission to Telerath for Lucien relating the details. He also related that Adasca was attempting to make contact with the Revanchist. He ordered Lucien to investigate the situation and discover the source of the dark power. Haazen was also somehow able to get Lucien on the Jedi Council so the Covenant's agents could move about freely. After his appointment, Haazen called Lucien to order him back to the Draay Estate to report on the Covenant Shadow Celeste Morne. But Haazen somehow found out that Zayne was still alive and Celeste somehow completely indisposed."}, {"tag": "p", "text": "When Zayne and an associate were captured on Odryn, Lucien contacted Master Feln, who was on the planet at the time. He incorrectly deduced that Zayne was corrupted by the Talisman, killed Celeste, was going to blackmail the Covenant and use the Sith artifacts stored in the Sanctum of the Exalted to further spread his poison. Lucien ordered Zayne's death again and to execute Option Ossus: destroy the Sanctum. But Haazen, who had been monitoring the hologram channel the two Jedi had been using, told Feln to disregard that order. Lucien then argued with Haazen about this, but Feln jumped to his own conclusion—he was going to kill Zayne whether they liked it or not. The result of the skirmish was the destruction of the Sanctum and the death of Feln at the hands of his own people. Zayne Carrick, however, remained at large."}, {"tag": "h3", "text": "Deception revealed"}, {"tag": "p", "text": "When Zayne and Marn Hierogryph were captured by Xamar and brought to the Draay Estate, Haazen decided to personally examine the supposed Sith instead of Krynda, whom he claimed was currently meditating upstairs and could not be disturbed. He looked at Zayne and told him of how the Sith War had ravaged him, and then grabbed the pseudo-\"Muur Talisman\" from Zayne, revealing it to be a fake containing his lightsaber. He then turned to Gryph, whom Lucien believed was the real mastermind of this plan. Haazen told the Snivvian of how he knew of Gryph's escape from the bombings of Serroco. Then the Jedi Order stormed the Estate under Xamar's command, and a mass lightsaber battle ensued outside. Haazen then called all Covenant members, giving them command Vindication, claiming that the Jedi High Council had been influenced by the dark side."}, {"tag": "p", "text": "As the insurrection began, the ships under Admiral Saul Karath's command loomed above the area, having been controlled by Haazen to fire on the skybridge, which killed Xamar and many Knights. Haazen then surprised and horrified them all as he withdrew a red lightsaber from his sleeve and showed numerous Sith artifacts on his person. Soon he, not Krynda, was the leader of the Jedi Covenant, pitting the Jedi Knights against one another—true Jedi of the Order versus the misguided Jedi of the Covenant. He then revealed the Gauntlet of Kressh the Younger around his mechanical arm, which gave him the power to protect himself from those who go near him without his consent. Lucien attempted to strike him down, but was stopped by the ancient Sith artifact twice and thrown into a wall. A team of Padawans also failed to kill him; Haazen simply killed some with Force lightning and the rest with his lightsaber."}, {"tag": "p", "text": "Haazen revealed to Lucien and Zayne that Krynda's Prophecy of the Five, once thought to relate to the First WatchCircle, was in reality speaking of Q'Anilia, the one from the light standing in the blinding darkness; Gryph, the one from the darkness who stood in the light; Zayne, the one for the light; and Lucien, the one for the darkness. He himself was \"the one who stood apart from them all\", for, as he explained, he was both the dutiful retainer to the Jedi Covenant, and, if he were to take a name like the Sith of old, Darth Hayze, for the clouds of deception he had created, wielding both sides of the Force, controlling both Jedi and Sith."}, {"tag": "p", "text": "Haazen foretold to a shocked Lucien that he would one day train his Sith, and that he would perhaps take the name Darth Luzion or Darth Sion. The Jedi Guardian claimed to not want such a thing, but still he took a red lightsaber which was handed to him by Haazen, as he still took orders."}, {"tag": "p", "text": "While Q'Anilia ran off to find Krynda, Zayne attempted to follow her only to be stopped by Lucien, who said that he would not allow him anywhere near his mother if there was a chance that the Rogue Moon Prophecy was correct. The two dueled, which was a test orchestrated by Haazen. From above a high staircase, Haazen said that he would enjoy exploring more of Zayne's \"odd relationship\" with the Force and witnessed as Zayne unleashed a powerful Force push on Lucien. He then left to meet agents who were bringing relics from the Jedi Council. Gryph soon brought a revived Krynda down, who revealed that she foresaw Lucien kill his students but suffered a stroke that prevented her from contacting him. Haazen said it wasn't time for her to die yet and placed her in a prototype oubliette, keeping her out of the way while he assumed control of the Covenant."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "After Covenant agents brought him the collection of Sith artifacts from the Jedi Council, Haazen killed them, stating that their task was complete. As he was analyzing the artifacts, he said to himself that he would now redirect the Republic fleet's fire to the Jedi Temple, destroying the Jedi Council. He would then have Lucien say that Krynda had called an emergency Council to be headed at the Draay Estate, all-the-while he would be controlling things through the Draay family. At this moment, Gryph was thrown from the Draay Estate, with a dueling Zayne and Lucien following. Haazen watched as the two dueled. Eventually, a statue of Barrison fell on Lucien, and Zayne, to Gryph's surprise, used the chance to kill him."}, {"tag": "p", "text": "Haazen, impressed that Zayne had managed to kill Lucien, told him to kneel before him. Zayne said he would swear himself as Haazen's apprentice as long as he stopped the bombardment of Coruscant. Zayne suddenly grabbed Haazen's mechanical arm, saying he was having a vision. Presuming that Zayne had become a seer, Haazen asked what the vision said, and Zayne simply said he wasn't in it, slicing off his mechanical arm. An enraged Haazen blasted Zayne with Force lightning. Zayne then grabbed Gryph and the two were thrown into the sky. Lucien, who hadn't been killed, was then revealed to be the one who threw them away."}, {"tag": "p", "text": "Lucien revealed what had happened: he and Zayne had acted out the entire duel to catch Haazen off guard and get the Gauntlet of Kressh the Younger off him. Then, using the control mechanism built into the arm, Lucien redirected the Republic fleet's fire at the Draay Estate. Without the Gauntlet to protect him, Haazen perished in the resulting bombardment."}, {"tag": "p", "text": "After Vindication, the Jedi Covenant was dissolved. The Republic and Jedi Order, embarrassed that Haazen had fooled them so badly, covered up the incident as a Mandalorian terrorist attack. Lucien survived because he was holding the Gauntlet, but was still badly hurt. Lucien later said to himself that Haazen got what he wanted, since the pain he went through made him see into the dark side and consider embracing his destiny as a Lord of Pain. But Lucien rejected the dark side after remembering his father, and journeyed to a private moon to build a new life with his True Covenant."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Before and during the Sith War, Haazen was undisciplined and predictable in his actions to both friend and foe. According to Master Arca Jeth, he was unfocused and haphazard in his pursuits, allowing his emotions to constantly get the better of him. These obvious flaws caused Haazen to develop a great amount of jealousy and resentment towards Barrison Draay for performing better in his Jedi training and winning the affections of Krynda Hulis, allowing his actions to be even more easily interpreted."}, {"tag": "p", "text": "It was only after the end of the Great Sith War and (ironically) embracing the dark side that Haazen finally learned to control his emotions. He adopted a calm and collected demeanor which belied his malevolent, power hungry, and ruthlessly manipulative true nature. Using the Yoke of Seeming to his advantage, Haazen readily clouded his intentions by offsetting his Force presence to aid his personality facade and even enable him to strike without warning."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h3", "text": "Krynda Draay"}, {"tag": "p", "text": "Haazen showed some feelings for Krynda Hulis and even became jealous when Barrison Draay got to her first and married her. But this affection seemingly evaporated when he had become Sith. She greatly appreciated his help for bringing the Covenant together with her, causing him to feel some surprise, as if he still felt for her."}, {"tag": "p", "text": "As Krynda became ill, Haazen did not hesitate to place her in stasis to prolong her life for a little while longer. It did not stop him, however, to take advantage of her absence to control her son and the rest of the Covenant for his plans."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Haazen's Force abilities were weak at best, described as awkward. After his \"reconstruction,\" his body was implanted with various pieces of Sith antiquity and equipment. These artifacts enhanced his Force abilities and allowed him to compensate for this disability. His search for more Sith artifacts gave Haazen a working knowledge of Sith Magic, allowing him to tap into the hidden powers of each artifact he wielded, such as the Gauntlet of Kressh the Younger, which granted him the power to repel anyone who tried to touch him."}, {"tag": "p", "text": "Another Sith artifact Haazen utilized was the Yoke of Seeming, which clouded the Jedi's perception of his intentions and true nature, allowing him to live amongst them without being discovered to be a Dark Jedi for many years. In addition to Sith Sorcery, Haazen was capable producing Force lightning that was strong enough to kill multiple Jedi with a single blast. His strength in the dark side of the Force allowed him to influence Jedi Master-level individuals like Lucien Draay into doing his bidding. Haazen seemed to have a basic knowledge in the use of telekinesis, such as moving lightsabers to and from certain individuals like he did with Lucien Draay and Zayne Carrick."}, {"tag": "p", "text": "As a Jedi Padawan, Haazen used a single, blue bladed lightsaber, which he wielded to little effect, being bested even by non Force-sensitive opponents, such as Dossa. During the same fight, Haazen's lightsaber was stolen by Dossa. This incident, as well as several other flaws in his character, caused Haazen to not be Knighted, and therefore no longer allowed to wield the prestigious weapon of the Jedi."}, {"tag": "p", "text": "After his deformation in the trap that he himself arranged, Haazen constructed a Sith lightsaber using synthetic crystals that gave his blade the characteristic \"bloodshine\" glow. This weapon appeared to be constructed using the same material that his prosthetic arm was fabricated from, mimicking the replacements grisly aesthetic. As Haazen returned to the Jedi Order, and was still not permitted to possess a lightsaber, he hid his weapon in the handle of a walking cane he used to feign weakness. This saber would remain concealed until the events of Vindication where a team of Jedi attempted to arrest him. Apparently his skill with the blade had improved drastically in the interim, as he struck the three Jedi down with ease. Haazen would later pass this lightsaber to Lucien Draay, who used it in his duel with Zayne Carrick."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "John Jackson Miller, author of the Knights of the Old Republic comics, jokingly stated that Haazen's last name was Daag, as a reference to the ice cream brand Häagen-Dazs. Miller also jokingly claimed that Haazen was allergic to seafood."}, {"tag": "p", "text": "It would seem that because Haazen stated that \"the Haazens have served the Draays for a long time,\" Haazen is actually his last name, not his first."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}