{"url": "Hacken_Berge", "categories": ["Category:Legends articles", "Category:Galactic Republic individuals", "Category:Historians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Hacken Berge"}, {"tag": "p", "text": "Hacken Berge was a male human who worked for Coruscant's Galactic Library during the Cold War between the reconstituted Sith Empire and the Republic. He traveled to the ruined world of Taris in search of the fabled Promised Land, and enlisted the help of a Republic-allied individual to learn the fates of the lost Outcasts."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male human, Hacken Berge was a native of Coruscant during the Great Galactic War and the subsequent Cold War between the Galactic Republic and the resurgent Sith Empire. Sometime during the Cold War, Berge began to work for the Galactic Library—as a historian."}, {"tag": "p", "text": "Around 3643 BBY, Berge began studying the journals of Revan, the great Jedi hero of the Jedi Civil War. He took particular interest in Revan's adventures on the former ecumenopolis Taris, which was destroyed by Revan's former apprentice Darth Malak in an attempt to kill Revan and Bastila Shan, Revan's later wife. While on Taris, Revan had ventured into the Undercity and encountered the Outcasts. Revan had helped the group's leader, Rukil, find a route to the mysterious Promised Land by finding a set of journals describing the way."}, {"tag": "p", "text": "As the Outcasts had departed for the Promised Land before the bombardment, their fate was unknown. Determined to discover the truth, Berge traveled to Taris, which was being slowly rebuilt by the Republic. He set up a base at Waypoint Station Morne, where he began to search for any trace of the Outcasts. When a Republic-allied individual arrived at the base, Hacken enlisted their help in his search. He had discovered signs pointing toward the ruins of Transport Station Five, which was recently excavated, but the area was infested with rakghouls."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}