{"url": "Hacklin", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Admirals and generals of the Sith Empire", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Hacklin"}, {"tag": "p", "text": "Hacklin was a male admiral of the Imperial Navy and a loyal ally of Darth Angral, a Sith Lord of the resurgent Sith Empire during the Cold War with the Galactic Republic. After the Admiral encountered the Jedi Padawan Kira Carsen when the woman was captured by Angral's forces, Hacklin was impersonated by the Child of the Emperor Valis in order to lure Carsen and her Master into a trap on an abandoned mining facility."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male admiral in the Navy of the Sith Empire during the Cold War with the Galactic Republic, Hacklin was an adviser to, and ally of, the Sith Lord Darth Angral. In 3643 BBY, Hacklin accompanied the Sith to the Ord Mantell Orbital Station when Angral's spies identified Jedi Padawan Kira Carsen's presence on the space station. Angral, who was searching for Carsen's Master in an effort to avenge the death of his son, Tarnis, interrogated Carsen with Hacklin and Inquisitor Ferav, though Carsen managed to trick the trio into believing the Jedi Knight was on Corellia. Hacklin and Angral departed the station in order to oversee the installation of the Desolator superweapon onto Angral's warship, the Oppressor."}, {"tag": "p", "text": "Not long afterward, the Child of the Emperor Valis used Hacklin's name to draw out Carsen—who was a former Child herself—and her Master in an attempt to capture her. Valis, impersonating Hacklin, contacted Republic General Var Suthra and claimed that he wanted to defect, asking for a meeting with the Knight and Carsen. He also instigated rumors that the Admiral had earned a death mark in order to lend credence to the lead. When the Knight and Carsen arrived at the abandoned mining facility in the Unknown Regions that Suthra had selected, Valis informed the pair that Hacklin remained very loyal to the Empire and Angral before apologizing for the deception."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hacklin was created for Star Wars: The Old Republic, a video game released by BioWare on December 20, 2011. He is first mentioned in the Jedi Knight class mission \"New Intelligence,\" but he is not named until \"The Defector,\" in which the Child of the Emperor Valis uses Hacklin's name to draw out Kira Carsen and the player."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}