{"url": "Hadde_Base", "categories": ["Category:Legends articles", "Category:Galactic Republic military bases", "Category:Haurgab locations"], "nodes": [{"tag": "h1", "text": "Hadde Base"}, {"tag": "p", "text": "During the Clone Wars, the Grand Army of the Republic constructed a forward operating base in the city of Hadde as a headquarters for Republic operations on the Mid Rim backwater world of Haurgab. Overseen by Jedi General Mlaske, Hadde's forward operating base was home to several clone trooper units, among them members of the 14th Infantry Brigade, and at least two companies of the 85th Infantry Brigade, in addition to the clone commando squads Delta and Omega for the duration of their assignments."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Grand Army of the Republic's forward operating base in the city of Hadde was constructed approximately 19 BBY as a headquarters for Republic forces during their operations on the planet Haurgab, in the midst of the pan-galactic Clone Wars. Circa nine hundred and thirty eight days after the First Battle of Geonosis, Hadde's Forward Operating Base was damaged in an artillery shelling by Separatist rebels. Among the losses were a communications relay, rendering the base unable to receive nor respond to a distress call from the nearby clone commandos of Omega Squad, pinned down by pro-Separatist Maujasi soldiers. Only the timely arrival of a LAAT/i gunship manned by clone troopers from the 14th Infantry Brigade out of the nearby town of Neska—dispatched by Advanced Recon Commando Captain Maze, who picked up the distress call when Omega commed Special Operations Brigade on Coruscant—allowed Omega Squad to escape the fight unharmed and return to Hadde Base."}, {"tag": "p", "text": "Thirty-two days later, the base came under attack by a group of pro-Separatist rebels that launched a missile from a house within the Republic-friendly city of Hadde. Striking near the base's mess hall, numerous clone troopers were injured and killed in the rocket's explosion and from the subsequent shrapnel. The clone commandos of both Delta and Omega Squads—all of whom had been inside the mess at the time of the attack, but were spared the worst injuries due to their hardy Katarn-class commando armor—would lead the counterattack on the Hadde rebels with Jedi General Etain Tur-Mukan and elements of both the 14th and 85th Infantry Brigades."}, {"tag": "h2", "text": "Structure"}, {"tag": "p", "text": "The Republic's forward operating base was located on the outskirts of Hadde, and by nine hundred and seventy days into the Clone Wars, had expanded to a size Delta Squad member Scorch regarded as approaching a small city in and of itself. The base housed its own garrison, along with no fewer than two companies of the 85th Infantry Brigade and members of the 14th Infantry Brigade during the Republic's ongoing operations. The sprawling base included a mess hall for dining, barracks for housing clone troops, and the office of the base's commanding officer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}