{"url": "Hafner", "categories": ["Category:Canon articles", "Category:Duros", "Category:Kelen Biolabs employees", "Category:Males", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Hafner"}, {"tag": "p", "text": "Hafner was a male Duros scientist who worked for the biotech company Kelen Biolabs during the Galactic Civil War. Sometime shortly after the Battle of Yavin, he traveled as part of a collection crew for the Biolabs to the moon Fex in the Deep Core Sha Qarot system to survey and find possible valuable biological samples. Once on the moon, he and two other members of the team disembarked from their starship the Harvester and began investigating Fex's wildlife. However, the trio were soon ambushed by the previously undiscovered apex predators of the moon, the Fexian skullborers, which quickly killed Hafner's two compatriots before Hafner could stun them. Calling the Harvester to pick them up, Hafner began to observe one of the skullborers after stunning it, recording valuable information with the holocam in his helmet. Before the Harvester could pick him up though, the Duros was attacked and killed by the skullborers, and his recordings were returned to Kellen Biolabs. The recordings were later viewed by the rebels Luke Skywalker and Nakari Kelen after they were sent on a follow up collection mission to the moon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Duros Hafner was a scientist who worked for biotechnology Kelen Biolabs, a company which conducted zoological research in search of medical applications. Shortly after the Battle of Yavin during the Galactic Civil War, Hafner was sent by the company as part of a collection crew to Fex, an unexplored moon in the Sha Qarot system of the Deep Core region of the galaxy. Fayet Kelen, the owner of Biolabs, believed Fex might be a rich source of wildlife to research due to the star systems unusual red star. Hafner and the rest of the team traveled on board the XS-800 light freighter Harvester to the moon, and while there was sent down to the surface along with the Bith Priban and a human member of the crew in order to scout and collect developmental leads."}, {"tag": "p", "text": "While the trio were scouting, all three recorded video of the environment from their helmets' holocams, with Priban leading the group and giving commentary. As the scouts moved through the moon's crystalline forests, Priban was attack mid-sentence by a Fexian skullborer, a previously undiscovered apex predator of Fex which was invisible to the naked eye due to natural camouflage. The Bith called to Hafner and his other colleague for aid, but the pair could not understand what was happening as Priban collapsed to the ground. The human was next to be attacked, and demanded that Hafner fire stun blast at his and Priban's heads in the hopes of hitting the invisible creatures. The Duros complied, but too late, as his colleague had already fallen motionless. The shot did stun the creature and reveal its form, as the skullborer was unable to camouflage itself while unconscious. Hafner then contacted the Harvester and reported on the incident while approaching the unconscious predator to investigate."}, {"tag": "p", "text": "The Duros pulled the unconscious skullborer's trunk from the cavity it had created in the human's helmet, only to reveal that the predator had been feeding on its victim's brain. He put down his weapon and picked up the creature, examining it closely and commenting on its various features, documenting the first information about the species. As he did so another skullborer dropped onto Hafner, who grabbed his weapon and stunned himself and the creature in the hopes that the Harvester would arrive and save him while he was unconscious. The ship was not fast enough to save the Duros though as the stunned skullborers soon awoke, and when it arrived the Duros brain had been eaten in the same fashion as his colleagues. The remaining crew members collected the three corpses using the starship's cables and fled the moon."}, {"tag": "p", "text": "The Harvester later returned to Fex with a new crew equipped with harder helmets, but all bar one of them were killed by the skullborers when five escaped their confinement. A third mission to investigate the moon was made by the rebels Luke Skywalker and Nakari Kelen, the daughter of Fayet Kelen. The pair watched the holographic footage of Hafner and his colleague's deaths on Fex as a way of inform and prepare themselves for the moon's wildlife. On the moon they found the Harvester and killed the skullborers onboard, returning the ship and its sole surviving crew member to Kelen Biolabs."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hafner had green skin and red eyes. When Priban was first attacked by the invisible skullborers he Duros appeared terrified and could not react in time to save his colleagues life. However, Hafner remained calm and collected while investigating the creature and his colleagues' corpses. Luke Skywalker found this odd, believing it to be a trait shared by many scientists, disregarding their own safety and personal emotions when trying to accomplish a job or analyze a problem. Hafner even went so far as to put down his weapon despite the possibility of further attack in order to examine an unconscious skullborer, a fact that Nakari Kelen found illogical."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "While on Fex, Hafner wore an armor suit with heavier protection around the head and shoulders. The suit included gloves and a helmet which was capable of recording video and communication with the Harvester. He also carried a blaster with a stun setting."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hafner first appeared as a hologram in Heir to the Jedi, a canon novel written by Kevin Hearne and published in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}