{"url": "Hair", "categories": ["Category:Canon articles", "Category:Anatomy"], "nodes": [{"tag": "h1", "text": "Hair"}, {"tag": "p", "text": "Hair was a collection of pigmented thread-like strands growing from the skin of certain species, including humans, Weequays, and many others. The thick coat of hair of certain life-forms was also referred to as fur. Such species included the Wookiees of Kashyyyk and the Talz of Orto Plutonia. Hair came in a great variety of colors, lengths, and thicknesses. As exemplified by the case of the human Obi-Wan Kenobi, hair lost its hue with old age. In humans, gray hairs were an easily identifiable sign of aging. Premature graying could also be a sign of stress, and was common in members of the Resistance."}, {"tag": "p", "text": "Hair could be styled in a vast number of ways for practical or aesthetic reasons. The human weapon experts Sabine Wren used to keep her hair short because it would often get sweaty under her Mandalorian helmet. Nonetheless, she also did dye jobs to artificially add various colors her hair. Besides conventional dyes such as the purple substance extracted from the carnivorous Morogian snap plant, there existed a Mon Cal microplankton that would bond with each strand of hair, giving it a bioluminescent glow. The queens of Naboo often sported very intricate hairstyles. A product known as hair gel could be applied to tame any unruly hairs one may have."}, {"tag": "p", "text": "The Nightsisters of Dathomir could inflict a curse on a given individual by creating a waxen effigy of that person. The creation of the effigy required a lock of the intended victim's hair."}, {"tag": "p", "text": "Militaries typically had requirements regarding the hairstyle of their officers. For example, close-cropped hair was a requirement in the Galactic Republic's military. In the Galactic Empire, officers often cut their hair short for optimal efficiency, but were allowed to keep it long on the condition that they wore it pinned back in tight braids."}, {"tag": "p", "text": "Female porgs crafted nests by using hair, fiber, or grass."}, {"tag": "p", "text": "Range trooper armor had large pads of white fur on its shoulders to keep the rugged troopers warm on cold-weather planets, such as Vandor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}