{"url": "Hair/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Anatomy"], "nodes": [{"tag": "h1", "text": "Hair"}, {"tag": "p", "text": "Hair was a part of the anatomy that grew all over the body on many creatures and beings, mostly mammalian (like the Zabrak or the Bothan) and reptomammalian (like the Falleen or the Abyssin) species. The thick coat of hair that grew on certain species was also called fur. Humans, the dominant sentient species in the galaxy, grew hair in all manner of places except the soles of their feet and the palms of their hands. Other species like the Wookiees were fully covered with a thick coat of hair."}, {"tag": "p", "text": "Hair came in a great variety of thicknesses, lengths, and colors, but usually lost its hue with old age. As it was made of a living material, all hair would grow and fall when the cells died. In younger beings, soon after the cells died, new ones grew again in the same place, making new hair. In some beings, the regrowth process became less efficient with old age, eventually leading to baldness."}, {"tag": "h2", "text": "Function"}, {"tag": "p", "text": "Hairedness seems to have been a mammalian trait. Most mammals had hair or fur that served different functions—though body hair, such as that on Humans, could be extremely fine. Hair notably provided thermal regulation, which was necessary on icy planets like Hoth or Toola, which was why the Wampa and Whiphid sported fur all over their bodies. Sometimes hair had defensive functions. The Thisspiasian species would grow thick beards to deter the local cygnat bites."}, {"tag": "p", "text": "Many other species (most reptavians, birds and reptiles) were normally hairless. The Hutts, for example, were typically hairless, but some would grow beards or locks due to a rare genetic mutation."}, {"tag": "p", "text": "Somewhere between the two extremes lay certain reptomammals who shared the mammalian species' hairedness. Among them were the Falleen from the eponymous planet or the Abyssins from Byss. Other reptommmals, like the Rodians and the Clawdites, were completely hairless."}, {"tag": "h2", "text": "Social role"}, {"tag": "p", "text": "Haired species would often cut or arrange the hair on their head in a way considered aesthetically pleasing or acceptable. On Naboo, for example, the queens wore very intricate hairstyles, some of which necessitated wigs or hair extensions. Young Princess Leia Organa used to think the women of Alderaan had an obssession with their hair, a fixation she herself did not share. A popular hairstyle among Human females consisted of coiling the hair in twin buns. Throughout history, many famous women were known to sport their hair in this fashion, including Liana Merian, Padmé Amidala, Delva Racine, and Leia Organa."}, {"tag": "p", "text": "Some Humans, like Andronikos Revel or Mace Windu, chose to shave the hair from their head completely. At the time of the Cold War, this was quite common in the Sith Empire military, even among female officers."}, {"tag": "p", "text": "During the time of the Galactic Civil War, many male officers of the Galactic Empire grew long sideburns (as exemplified by Moradmin Bast or Pol Treidum). It was considered fashionable among the Imperial officer class at the time. Many Imperials had their hair cropped tightly. Wookiees like Merumeru or Guanta also tended to fashion their hair into several braids that were held in place by metal fastenings."}, {"tag": "p", "text": "In the Jedi Order, hairstyle was used as an indicator of status. While Padawan apprentices of the haired species would often wear short cropped hairstyles, their masters would have long hair worn tightly back to keep vision clear in action."}, {"tag": "p", "text": "Hairless species would sometimes create the illusion of hair as a fashion statement. Some Lafrarians, a race of avian humanoids from the planet Lafra, used \"thickening agents\" to make their head feathers appear similar to hair, while some Hutts like Marlo used live sha'rellian toops as wigs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": "The following is a list of sources in which hair or fur is specifically mentioned:"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}