{"url": "Hajen-class_fleet_tender", "categories": ["Category:Legends articles", "Category:Hajen-class fleet tenders", "Category:New Class starship classes", "Category:New Republic starship classes", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "Hajen-class fleet tender"}, {"tag": "p", "text": "The 375-meter-long Hajen-class fleet tender was a vital part of the New Republic's New Class Modernization Program."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As resupply vessels, Hajen-class ships had to constantly shuttle between fleets and bases, carrying vital supplies, such as food, water, bacta, fuel, spare parts, and Tibanna. To perform their mission, these ships were equipped with fast Class 1 hyperdrives and capable of carrying 300,000 metric tons of cargo."}, {"tag": "p", "text": "Hajen-class ships were highly automated, requiring a small living crew to operate. Its standard crew numbered only six beings and a large number of droids, and a mere two could serve as a skeleton crew. The vessels were completely unarmed, and relied on ships such as the Sacheen-class light escort for protection."}, {"tag": "p", "text": "The Hajen-class fleet tender was built on the same basic hull and systems of the Sacheen-class. This practice of using the same basic design for multiple configurations was so successful that it was adopted for all later New Class ships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While New Class ships were capable combatants, they were also relatively small and sacrificed cargo space for functionality, preventing them from carrying enough supplies to operate for extended periods of time; no New Class ship carried more than five months' worth of consumables. Hajen-class fleet tenders acted as resupply ships to extend a fleet's running time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The only official image of the Hajen-class is found in the RPG sourcebook Cracken's Threat Dossier. Like the pictures of other New Class ships, this picture contradicts information from the Black Fleet Crisis novels, on which Cracken's Threat Dossier is based. Specifically, the Hajen and Sacheen classes look nothing alike, even though they are supposed to be built on the same hull. Because of this, the picture has been labeled as erroneous and dismissed as non-canon by many fans."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}