{"url": "Hakaran", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Insectoid sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Hakaran"}, {"tag": "p", "text": "The Hakarans were a sentient insectoid species hailing from the swamp planet Hakara. The Hakarans remained unknown to the Galactic Republic until the Clone Wars, when they requested aid from the Jedi Order to fight off Separatist battle droids that had invaded their homeworld. Jedi Knight Anakin Skywalker and his Padawan Ahsoka Tano arrived on Hakara and taught the Hakarans how to defeat the droids. With the Jedi's help, the Hakarans were able to liberate their planet."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Hakarans were a sentient species of tiny insectoids capable of flight. Due to their small size, they were easily confused for non-sentient insects. The Hakarans usually massed in large swarms. They had their own language and were also able to communicate by forming a swarm in the shape of an object or a symbol; the latter way of communication was especially useful to convey information to individuals who did not know the Hakarans' language. The Hakarans lived in underground dwellings connected to the surface by tree hollows, and they possessed some form of technology to send signals off-world. The Hakarans were quick learners, able to grasp new technological concepts rapidly."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Hakarans were the only indigenous species of the swamp planet Hakara, which the Galactic Republic believed uninhabited at the time of the Clone Wars, although the Hakarans themselves were aware of the existence of the Jedi Order. At some point during the first two years of the war, Hakara was invaded by the Confederacy of Independent Systems, and a detachment of battle droids was stationed on the planet in order to steal the planet's natural resources. The Confederacy knew of the Hakarans, but they did not consider them to be a threat to their operation. Hoping to receive help from the Jedi, the Hakarans used their native technology to send a distress signal to the Jedi High Council. The Jedi Council received the message, but they were unable to decipher most of it because they were unfamiliar with the Hakaran language. Still, the Council conjectured that the strange message was in fact a call for help and thus sent Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, to Hakara to investigate."}, {"tag": "p", "text": "Upon arrival, the two Jedi mistook the Hakarans for nothing more than importunate insects, until a group of Hakarans saved them from a speeder bike–mounted B1-Series battle droid on patrol. The Jedi then realized that the insects possessed sentience and, by using the Force, taught them how to deactivate the droids' neural processors. With the new knowledge, the Hakarans raided a Confederate platform and dispatched all B1 battle droids and DSD1 dwarf spider droids stationed there. While the Hakarans finished off the remaining stragglers scattered throughout Hakara, Tano and Skywalker left the planet to inform the Jedi Council about the Hakarans. Skywalker hoped that the Council would place Hakara under their protection to prevent another invasion, and that the Jedi would suggest that the Republic send an ambassador to the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hakarans are featured in A Little Help on Hakara, a short comic strip published in Star Wars: The Clone Wars Comic UK 6.9 in June of 2010 and written by Tom DeFalco. In the comic, the Hakarans are illustrated by Tanya Roberts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}