{"url": "Halagad_Ventor", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Alderaanians", "Category:Force ghosts", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Purge victims", "Category:Males", "Category:Post-Ruusan Jedi Knights", "Category:Redeemed Jedi"], "nodes": [{"tag": "h1", "text": "Halagad Ventor"}, {"tag": "p", "text": "Halagad Ventor was a male Human Jedi Knight who was trained at an unusually late age, due to the fact that he was passed over for training initially during his childhood on Alderaan. Jedi Master Everen Ettene eventually agreed to take him as a Padawan at the Almas Academy. Since the nature of his training was unnatural, Ventor's actions as a Jedi were considered unorthodox, and he neglected the more subtle aspects of the Force. These shortcomings may have contributed to his botched peace talks in the Virgillian Civil War, where he and his team were erroneously reported dead during the Separatist Crisis."}, {"tag": "p", "text": "Ventor served as a Jedi General during the Clone Wars, and was a recipient of the Medallion of Honor. Under the leadership of Obi-Wan Kenobi, he helped liberate the planet Skye from Zeta Magnus, a genetic terrorist, during which time he engaged in a Concordance of Fealty with Anakin Skywalker. Later in the Outer Rim Sieges, Ventor commanded a team which included Sha Koon assisting to purge the Confederacy of Independent Systems from the planet Bal'demnic. Surviving Order 66, Ventor teamed up with Jedi Master Ashka Boda to establish a network of fellow surviving Jedi. He was soon captured by the new Galactic Empire and interrogated by former protege, Darth Vader. Ventor was forced to reveal the secret location of his hidden Jedi network. He eventually escaped Vader and fled to Trinta, where madness and the dark side of the Force consumed him."}, {"tag": "p", "text": "After many years, a band of Rebel Alliance scouts crash landed on Trinta and were terrorized by Ventor. After enduring several Force attacks, the Rebels confronted Ventor and drew him out of the dark side. Deceased yet redeemed, Ventor would persist in the Force as a Force ghost, and would guide survivors of his betrayal years after his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born to archivists of the Royal Library of Alderaan Ean and Zollet Ventor in 47 BBY, Halagad Ventor lived on Alderaan as a child. Despite being strong in the Force, Ventor was passed over for Jedi training by the Acquisition Division at an early age due to some oversight by Jedi Watchman Jorus C'baoth. Nevertheless, he aspired to be a scholar, and studied ancient tomes within the Royal Library where he learned the history of the Jedi Knights, and aspired to be one. Inspired by C'baoth's handling of the dispute between House Organa and House Antilles, Ventor began pursuing mastery of a wide range of scholarly and martial skills. Taken under the wing of a young Bail Organa, who would go onto become Senator and Viceroy of Alderaan, Ventor was introduced to a wide range of intellectual stimulation as he passed through adolescence."}, {"tag": "p", "text": "While visiting the Okonomo Retreat, Ventor was joined by Bail and Tia Organa in hunting manka cats while his parents enjoyed the vacation at the Retreat c. 32 BBY. While he succeeded in killing a manka, the celebration was cut short when Organa presented him the devastating news of what would come to be known as the Okonomo Tragedy. During the dinner at the Retreat, a madman had infiltrated the party and infected everyone in attendance with a treacherous hive virus which caused anthropophagitism in its victims. Shocked and pained at the thought of his parents devouring each other in a bout of mindlessness, Ventor shut himself away and began to teach himself the ways of the Jedi. Due to the difficulty of self-teaching, Ventor was unable to truly master any area of Jedi or non-Jedi study. He argued that Jedi should focus on all aspects of the Force, rather than specialize in just one discipline. However, these thoughts were likely born of inexperience. Accepting comfort from Tia Organa the two engaged in a brief affair and Organa became pregnant with their son Nial. Unable to bear the responsibility, Ventor abandoned the Organas and found his way to the Cularin system where he was excepted into the experimental Jedi academy on Almas in 30 BBY. At seventeen standard years of age, Ventor was rather old for a Jedi of the era, but trained hard and learned much during his time on the wild planet, confronting such terrors as the Wyrd cultists, dreambeasts, Dark Lizards, and the K'kayeh dragon."}, {"tag": "p", "text": "After spending several short years at the Academy, Ventor began searching for a Jedi Master that would train him in the ways of the Jedi. Meeting with Jedi Masters Jerec, Ashka Boda, and Djinn Altis, no Master would accept him, citing that he did not have enough control over his mind, anger, fear, and greed. Discouraged, Ventor sought assistance from his old friend, now Senator Organa. Using his connections from the Alderaan Ascendancy Contention, Organa arranged a meeting with Jedi Knight Everen Ettene who saw something of herself in the unorthodox Jedi-in-training. Agreeing to train the boy, she nurtured him and castigated him, loving him as a mother should love a child and attempted to reign in his strong personality. In spite of Ettene's code-adherent teachings, Ventor persisted with his personal beliefs, and failed to reach his full potential. Ventor, as an unusual case in the post-Ruusan Jedi, found it difficult to flourish among his Jedi brethren. He quickly became a great warrior under Ettene, but he failed to grasp the more subtle aspects of Jedi work, such as diplomacy and healing. In some cases, even, he was completely ignorant of these powers."}, {"tag": "p", "text": "In 27 BBY, Ventor and his master were assigned to investigate the ruinous Outbound Flight Project by the Galactic Senate. Leading an aggressive inquiry into the project's failing, the pair were brought into conflict with Jedi Obi-Wan Kenobi and Anakin Skywalker; the flight's sole survivors. After a caustic interaction, Ventor eventually met with Padawan Skywalker and the two became close. In Skywalker, Ventor saw himself, sharing the bond of having both entered the Order at a later age then the norm. In Ventor, Skywalker saw the characteristics of both of his lost friends, Padawans Tru Veld and Ferus Olin. The two shared secrets, with Ventor divulging the memories of his tryst with Organa and the birth of his son, while Skywalker confessed his love for Padmé Amidala of Naboo. During the Separatist Crisis, Ventor and Ettene were paired with Ludwin Katarkus and Danyawarra, and dispatched by the Jedi High Council to the Virgillia system, in order to establish peace talks in the Virgillian Civil War. Upon arriving in the system late in the year 23 BBY, their transport was attacked by dissenters, and destroyed. He, along with his master and the two other Jedi were presumed dead back at Coruscant, and a Jedi funeral was held for the four of them. Forgotten in the wake of the breakout of war, Ventor and Danyawarra were actually alive, hiding out in hopes of rescue. Salvation would come three weeks after the crash, when Senator Organa was joined by Giles Durane and Jedi Ashka Boda in a rescue mission. Extracting the two Padawans, Boda escorted them back to the Coruscant Jedi Temple where the master encouraged Jedi Knight Obi-Wan Kenobi to take on the older student and complete his training."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "As the second apprentice of General Kenobi, Ventor took up the rank of Commander in the Grand Army of the Republic and served alongisde Kenobi's first Padawan, Anakin Skywalker. Continuing to share a strong bond of friendship with Kenobi's other student, the two Padawans were permitted to undergo the Jedi ritual known as the Concordance of Fealty, wherein they both committed each others lightsaber to the other. Having received a Medallion of Honor from Supreme Chancellor Palpatine for his efforts on Virgillia 7, Ventor donned full clone trooper armor during the early stages of the war, foregoing only the helmet during his missions. Accompanying his master to the planet Marat V, Ventor and Skywalker were tasked by Jedi Master Mace Windu with arresting the Master Geneticist and madman, Zeta Magnus. Magnus had staged a single-handed takeover of the planet, cajoling the Outland Clans to his cause and naming himself Magister of Skye; all the while releasing a plague upon the other S'kytri who refused to bow down to his rule. Arriving on the planet, the Jedi were led to the City of the Winged People by Patriarch Klarymére where they were brought before the Supreme Council of the Highland Clans. As Kenobi attempted to persuade the Council of their good intentions through a retelling of the Order's Prophecy of the Chosen One, Ventor drew upon his skills with telekinesis to levitate Skywalker through the air and out the window high above the mountain vistas in order to gain their trust."}, {"tag": "p", "text": "Proving himself both in skill in the Force and competence with a lightsaber, Ventor fought his way past Oskan blood eaters in the depths of the legendary labyrinths of the Entyrmion as the Jedi trekked to the slopes of the Canaitith Mountain where Magnus had erected his citadel. Losing his Padawan braid during the fighting, Skywalker joked that it was the only way that Ventor would ever receive a promotion to knighthood. Entering the building, the Jedi were deceived by their clones and imprisoned within Magnus' laboratory. The Jedi awoke to look on in horror as clones were being developed from their DNA; Kenobi and Skywalker's clones were already growing in vats while Magnus planned to begin the process with Ventor's recently obtained genetic matter. When Kharys arrived and freed them, Ventor fled the chamber and followed Magnus to the citadel's hangar where he confronted the Arkanian mutant as the droid Blue-Tark began to power up Magnus' starship, the Skyriver Invader. When Magnus attacked, Ventor lost control of his lightsaber, and the mutant managed to pin the Jedi Padawan down, eating off several fingers from Ventor's sword hand. Ventor blacked out as the monster began consuming him, but was saved when Blue-Tark ignited the Invader's engines and fried Magnus in the the ionic fire erupting from the ship as it took off. Lunging into Magnus, Ventor cleaved his opponent clean in half; killing him. Regain his composure, Ventor returned to the laboratory where his fellow Jedi continued their fight with the traitorous clone troopers. Noting the Class-D detonator in the clone's hand, Ventor used the Force to detonate it, wiping the clones, a part of the lab, and the cloned child versions of Skywalker and Kenobi from existence. As the Jedi regrouped outside the citadel, Kenobi noted that Ventor's eye's were bloodshot; recognizing that as a sign of drawing upon the dark side of the Force. Ventor, exhausted from the battle, gave into his frustration as Skywalker turned against him and the pair argued with each other before Ventor tossed the lightsaber he was using back at its rightful owner and telekinetically grabbing his own lightsaber from Skywalker's belt and igniting it. In retaliation, Skywalker ignited his own and Kenobi's to block against Ventor's attack. Before the situation got too far out of hand, Kenobi used the Force to slam Skywalker to the ground, and demanded that the two Padawans hand over their lightsabers. Ventor disengaged and turned over his weapon to the General before storming off to the nearest Republic gunship."}, {"tag": "p", "text": "Ventor eventually earned the rank of Knight and was promoted to General himself, ending his collaboration with Kenobi. As the war reached its waning months, the Confederacy of Independent Systems launched Operation Durge's Lance, affecting worlds from the Outer Rim to the Core. General Ventor, along with several other Jedi Knights including Sha Koon, were sent to the Outer Rim planet Bal'demnic to halt the CIS advance. Intercepted CIS transmissions indicated that the Commerce Guild was planning to mine cortosis from the planet. Cortosis, being resistant to lightsabers, was known to be a great asset in anti-Jedi warfare, and it had been used by Wat Tambor in the early stages of the war, so Jedi Master Mace Windu considered Bal'demnic a high priority. What greeted Ventor and Koon's forces on the island planet was an extraordinary sight. The Kon'me natives had risen up against the Commerce Guild's tyranny, and launched their own revolution against the droid armies. The Kon'me utilized weapons smuggled in by war profiteers, allowing them to fight on equal terms with the droids. Unfortunately for Ventor and Koon, it allowed them to also fight on equal terms with the Republic. Soon after Ventor's Republic forces touched down on Bal'demnic, the Kon'me started firing on them, treating all outsiders as hostiles. With no intention of retaliating against the natives, Ventor and Koon were forced to call a retreat. However, the Confederacy forces were also driven away, so the mission was at least a partial success. Ventor ordered a small portion of his fleet to remain in Bal'demnic's orbit, to prevent further CIS intrusions."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "Ventor was able to evade Galactic Emperor Palpatine's agents during Order 66 and the subsequent destruction of the Jedi Order. He followed the suit of many of his fellow survivors, and attempted to flee the new Galactic Empire. The following day, Ventor's image was emblazoned on HoloNet News among other Jedi such as Kai Justiss and Koffi Arana, all labeled as dangerous fugitives."}, {"tag": "p", "text": "Attempting to stem the tide of Jedi deaths due to a lack of coordination, Ventor collaborated with Jedi Master Ashka Boda in an effort to create a network of survivors from the destruction of Almas Academy. Before he was able to leave for the Outer Rim Territories, he was captured by stormtroopers. Inquisitor Valin Draco, assisted by Imperial Intelligence officers, extensively tortured Ventor onboard Vader's flagship (probably the Star Destroyer Exactor,) but Ventor told them nothing."}, {"tag": "p", "text": "Vader personally interrogated Ventor with help of an interrogation droid, and progressively broke down the man's mental shields. As Ventor gave in to the dark side, he revealed the names and locations of all the Jedi in his secret network of Order 66 survivors. Satisfied with this information, Vader let him steal a ship, the Rimrider, to escape the flagship, knowing that the dark side or death itself would surely consume him. Vader did not pursue Ventor though, for he knew that he had already succumbed to the dark side of the Force. After that, Vader then hunted down and slew all the Jedi of Ventor's network he could find. At least one known Jedi on Ventor's blacklist, Jedi Master Qu Rahn, was able to escape from Vader's hunt."}, {"tag": "h3", "text": "Exile on Trinta"}, {"tag": "p", "text": "The dark side nexus of the swamp planet Trinta called to Halagad, and the fallen Jedi decided to take residence there. Bathing in the nexus, his body could not appropriately handle the dark side's power, and so he became deformed and withered, losing all his teeth, weakening his bones, and weathering his face by many years worth, an attribute shared with perhaps many Sith not yet used to the dark side. Fearing retribution from Vader's Imperial forces, Ventor used the dark side of the Force to create illusions of beasts and other creatures, and maintained them all over the planet, in order to ward off any inquisitive souls."}, {"tag": "p", "text": "For approximately 20 years, Trinta and Ventor would go untouched, until a team from the Alliance to Restore the Republic crash-landed on the planet. On the run from the Taloron bounty hunter Crutag and his cronies Slizzik and Slimego, the Rebels sought refuge in Trinta's thick swamps. It was here that they came across one of Ventor's old campsites, and discovered his abandoned Medallion of Honor. Displeased by the events that had transpired, Ventor used the Force to commandeer the ships of both the Rebels and Crutag, stranding both parties in the swamps. However, he had not thought his plan through to conclusion, as he would not be able to scare them off-planet. Instead, he created illusions of the extinct Dradan species, and a rancor to intimidate the foreigners. This gambit failed, although Ventor realized that the Rebels might be the key to his redemption from the dark side. However, the fallen Jedi was still fearful of the chance that Vader might find him, so he remained hidden."}, {"tag": "h3", "text": "Redemption"}, {"tag": "p", "text": "When the Rebels eventually found Ventor, he launched his plan for redemption. He feigned an attempt at converting the Rebels to the dark side, in the hopes that they would kill him and free him from his tortured existence. Instead, the Rebels showed Ventor his Medallion of Honor, reminding him of his service during the Clone Wars; the good deeds he had done, the lives he had saved. The Rebels also informed him that not all Jedi had fallen victim to Vader's blade during the Great Jedi Purge, and that some of them still lived on like Rahm Kota and Obi Wan Kenobi. Filled with hope for the first time in years, Ventor had finally escaped the grasp of the dark side, and in the process, escaped his worldly existence. Ventor ascended to the higher plane, passing away a redeemed man and becoming a Force ghost. His spirit thanked the Rebels, before vanishing. The rebels then escaped from Trinta with their ships intact, leaving the bounty hunters stranded there for some period of time."}, {"tag": "p", "text": "Years later, following the collapse of the Galactic Empire and deaths of Palpatine and Vader, Jedi Master Qu Rahn, the last survivor of Halagad's network and of the few Jedi who aided the Rebel Alliance, fought a quick but deadly battle on the bridge of the Super Star Destroyer Vengeance against Inquisitor Jerec and the Seven Dark Jedi. Though he was able to mortally wound Maw, he was overcome by Jerec. Before Jerec delivered the final blow with his lightsaber, Rahn saw the spirits of Anakin Skywalker and Halagad Ventor, and he understood that no one was beyond redemption."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Due to his self-taught nature, Halagad Ventor was always out to prove something. Due to the fact that he was passed over for training at an early age, it is probable that he sought to show the Order wrong. However, with a lack of guidance, Ventor did not cover the Force as a Jedi should, and so, in terms of standardized Jedi training, his skills were flawed. Lord Vader described Ventor as a \"loud man\", who craved accolades and recognition. This was reflected in the fact that Ventor was decorated in the Clone Wars with the Medallion of Honor, an award rarely bestowed."}, {"tag": "p", "text": "Ventor's insistence on his ways caused him to be knocked back by the Order on several occasions, but it also allowed him to eventually be accepted, despite his unorthodox nature. This nature made him a prime target for Lord Vader in the early stages of the Great Jedi Purge, since Ventor was known to be unstable and \"difficult\". Ventor's flaws plagued him on Trinta as well, but he was not so far gone that he did not realize the error of his ways."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Halagad Ventor was first developed by Jim Bambra and illustrated by Allen Nunis, making his debut as the major antagonist in the West End Games Roleplaying Game supplement Domain of Evil. In this adventure, the roleplayers - Rebel scouts - encounter Ventor as a Dark Jedi and endure his wrath, and their ultimate victory is achieved only through redeeming Ventor and bringing him back to the light."}, {"tag": "p", "text": "Domain of Evil identified Ventor as the Jedi who betrayed all the survivors of the Great Jedi Purge bar Obi-Wan and Yoda, but this hand in the Jedi's downfall was greatly diminished after the character went untouched for many years. Expanded Universe material, especially those based around the Prequel trilogy, revealed that a number of other Jedi survived the Purge, while many others died seemingly without the involvement of Ventor or his information."}, {"tag": "p", "text": "Pablo Hidalgo and Paul Ens revived the character over a decade later in an online HoloNet News story, in a mission during the Separatist Crisis. Halagad's reported death in the article caused confusion amongst fans, until Pablo Hidalgo later revealed that the report was a deliberate red herring. Pablo intended the article to plant the seeds of doubt in any government or private news source claiming that any Jedi had died."}, {"tag": "p", "text": "Author Abel G. Peña - who goes by the internet alias of \"Halagad_Ventor,\" or \"Halagad\" - always held a keen interest in the character, so much so that artist Joe Corroney used Peña as a basis for his illustration of Ventor in Republic HoloNet News Special Inaugural Edition 16:5:241. Peña's interest in the character has also been reflected in his own work; The Dark Forces Saga, Aliens in the Empire, and Echoes of the Jedi."}, {"tag": "p", "text": "Domain of Evil mentions Ventor serving under Obi-Wan Kenobi during the Clone Wars. What's The Story? writer Arthur Papadam included Ventor in his Databank entry for Bal'demnic, marking the first chronicle of Ventor's specific involvement in the Clone Wars."}, {"tag": "p", "text": "Author Abel G. Peña had long stated his desire to involve Ventor in Obi-Wan Kenobi and Anakin Skywalker's mission on Skye, an event mentioned in Star Wars Annual 1. Peña was able to finally realize this dream in Part 2 of the online supplement Aliens in the Empire. Ventor's role in this battle served two purposes; to show Ventor serving under Kenobi as mentioned in Domain of Evil, and to create a retcon fixing an error caused by a pre–Empire Strikes Back source that represented Anakin Skywalker and the father of Luke Skywalker as two separate individuals in the same place at the same time."}, {"tag": "p", "text": "In Echoes of the Jedi, Abel G. Peña established that the information Ventor surrendered to Darth Vader regarded only the Jedi survivors of Almas Academy's destruction, rather than the survivors of the entire Purge. This retcon allows the story established in Domain on Evil to maintain some element of truth, while also explaining why Ventor's forced betrayal of the Jedi was largely ignored by other Star Wars sources."}, {"tag": "p", "text": "Justin Chung, artist and friend of Abel G. Peña, illustrated Halagad Ventor on a sketch card that was part of the 2009 Topps Star Wars Galaxy Series 4 trading card set."}, {"tag": "p", "text": "Halagad seems to be named after \"Galahad,\" one of the most famous of King Arthur's Knights of the Round Table."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}