{"url": "Halden_Wes", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Humans", "Category:Journalists", "Category:Males"], "nodes": [{"tag": "h1", "text": "Halden Wes"}, {"tag": "p", "text": "Halden Wes was a Human male reporter for the Corellia Times who lived on Corellia during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Battle of Yavin, Halden Wes was based in Coronet and assisted fellow reporter Vani Korr in her investigation of the fanatical technology-hating Meatlump criminals."}, {"tag": "p", "text": "Around 1 ABY, he started to work with a spacer who previously worked with Vani Korr to identify the location of the Meatlump Hideout. Wes dispatched the spacer to find Meatlumps camps on Corellia but also outside their home planet. The adventurer discovered that the Meatlumps had established camps near the cities of Tyrena, Kor Vella and Doaba Guerfel on Corellia, Nashal on Talus, Theed and Moenia on Naboo, Narmle on Rori, Nym's Stronghold on Lok, and near Wayfar and Mos Taike on Tatooine. Halden Wes and the spacer realized that the Meatlumps had gathered large amounts of supplies to those camps, including food, weapons and explosives. As it appeared that the criminals were planning important operations on those worlds, the spacer suggested warning the authorities, while the ambitious Wes argued they could get credit, and Corellia Times as well, for foiling the Meatlump plans. The reporter finally paid the adventurer a good price to raid the Meatlump camps. The spacer therefore traveled to those worlds, attacked the Meatlumps and sacked the camps."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Halden Wes was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Halden Wes was added to the game with the update dubbed \"Chapter 10: The Search for the Meatlump King,\" released on June 19, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}