{"url": "Alphabet_Squadron_(novel)", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Articles with an excess of redlinks", "Category:Star Wars: Alphabet Squadron"], "nodes": [{"tag": "h1", "text": "Alphabet Squadron (novel)"}, {"tag": "p", "text": "Alphabet Squadron is a canon novel written by Alexander Freed. The book is the first in the Star Wars: Alphabet Squadron series, and it was published by Del Rey on June 11, 2019. Set after Star Wars: Episode VI Return of the Jedi, Alphabet Squadron focuses on a group of New Republic pilots hunting down an Imperial group called Shadow Wing, and it crosses over with the Marvel Comics miniseries Star Wars: TIE Fighter. A sequel to the novel, Shadow Fall, was published in 2020."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "On the verge of victory in a brutal war, five New Republic pilots transform from hunted to hunters in this epic STAR WARS adventure. Set after Return of the Jedi, Alphabet Squadron follows a unique team, each flying a different class of starfighter as they struggle to end their war once and for all."}, {"tag": "p", "text": "The Emperor is dead. His final weapon has been destroyed. The Imperial Army is in disarray. In the aftermath, Yrica Quell is just one of thousands of defectors from her former cause living in a deserters' shantytown—until she is selected to join Alphabet Squadron."}, {"tag": "p", "text": "Cobbled together from an eclectic assortment of pilots and starfighters, the five members of Alphabet are tasked by New Republic general Hera Syndulla herself. Like Yrica, each is a talented pilot struggling to find their place in a changing galaxy. Their mission: to track down and destroy the mysterious Shadow Wing, a lethal force of TIE fighters exacting bloody, reckless vengeance in the twilight of their reign."}, {"tag": "p", "text": "The newly formed unit embodies the heart and soul of the Rebellion: ragtag, resourceful, scrappy, and emboldened by their most audacious victory in decades. But going from underdog rebels to celebrated heroes isn't as easy as it seems, and their inner demons threaten them as much as their enemies among the stars. The wayward warriors of Alphabet Squad will have to learn to fly together if they want to protect the new era of peace they've fought so hard to achieve."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h4", "text": "International"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}