{"url": "Hall_of_Imperial_Register", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Coruscant locations", "Category:Libraries"], "nodes": [{"tag": "h1", "text": "Hall of Imperial Register"}, {"tag": "p", "text": "The Hall of Imperial Register, also known as The Pit, The Resource, and the Emperor's data bank was an archive on the Imperial capital Coruscant which stored Imperial records. It stored records which had been offloaded to backup on Imperial starships, navigation computers, offices, academies, and depots. These records included trajectory calculations, inventories, personnel records relating to Imperial Military affairs including Star Destroyers and Super Star Destroyers. The records were also of all Imperial employees, officials, and more, recording their every act as part of the Imperial government or military. Access to the Pit was located at the edge of the Verity District, a well-fortified Imperial part of Coruscant, and its storage capable stretched beneath the entire District. The Pits were serviced by several administrative droids. The Hall of Imperial Register was also the source of information used by the Messenger droids that carried out Operation: Cinder, taking the data stored at the Hall and using a complex series of formulas to select ideal candidates for carrying out the destruction."}, {"tag": "p", "text": "In 5 ABY, Grand Admiral Rae Sloane visited the Pits to find records on the Imperial Navy's Star Destroyers and Super Star Destroyers. She discovered that a quarter of the Empire's Star Destroyers and that Emperor Sheev Palpatine's flagship, the Eclipse, had mysteriously disappeared. Sloane also discovered a photo which depicted a young boy named Gallius Rax among several Imperial officials including the Emperor, Grand Vizier Mas Amedda, and the military officers Wullf Yularen, Dodd Rancit, and Terrinald Screed."}, {"tag": "p", "text": "During the Battle of Jakku, the Hall was the target of an attack by the leader of the 204th Imperial Fighter Wing Soran Keize in a modified TIE fighter. He felt that the information held there would be highly damaging to the soldiers of the Empire after the New Republic took over the galaxy, and that years of trials would hound former Imperials trying to live their lives. He was defeated in this effort by Yrica Quell and Kairos who had pursued him to Coruscant. After the Battle of Jakku, New Republic Intelligence gained access to the databases of the Hall, though it was estimated that it would take years to sift through the vast collection of information found there."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}