{"url": "Halleck", "categories": ["Category:Legends articles", "Category:Acclamator-class assault ships", "Category:Galactic Republic starships"], "nodes": [{"tag": "h1", "text": "Halleck"}, {"tag": "p", "text": "The Halleck was an Acclamator-class assault ship in service with the Republic Navy during the Clone Wars. It was assigned to Jedi Master Mace Windu during a mission to rescue his Padawan learner Depa Billaba on Haruun Kal. The vessel came under heavy attack when it proceeded to Haruun Kal to extract Windu, and was forced to retreat into hyperspace and return to Galactic Republic territory."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A Rothana Acclamator-class assault ship of the Republic Navy, the Halleck was equipped with twenty Jadthu-class landing ships, five LAAT gunships and six Delta-7 Aethersprite-class interceptors."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars in 22 BBY, the Halleck was assigned to Jedi Master Mace Windu for Windu's mission to track down and rescue his Padawan Depa Billaba on the Mid Rim world of Haruun Kal. Stationed in the Ventran system while Windu went on to Haruun Kal alone, the ship was duly summoned by Windu to commence extraction after he successfully acquired Billaba. The Halleck moved in and deployed a Jadthu-class landing ship to rescue Windu, but was intercepted by Separatist droid starfighters that had lain in wait in a nearby asteroid belt."}, {"tag": "p", "text": "The droid fighters launched their ambush, first destroying the extraction lander and then swarming the Halleck proper. One fighter rammed the bridge and, with the ship's captain, Trent, badly injured and its fighter escort obliterated, the Halleck began sustaining major damage. Its commander, Urhal, took charge and received an order from Master Windu to undock the landers and send them to Haruun Kal's surface. Despite Urhal's reservations due to the fact that the landers had no hyperdrives and could not escape the system with Windu without a carrier ship, the commander ordered the landers to deploy and had the  Halleck jump to hyperspace and the safety of Republic territory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Halleck first appeared in Matthew Stover's 2003 novel Shatterpoint. Described as a \"Republic medium cruiser\" in the novel, the ship was established as being an Acclamator-class assault ship in the 2005 reference book The New Essential Chronology. The entry for the Halleck in The Complete Star Wars Encyclopedia incorrectly states that the ship inserted Windu onto Haruun Kal, and that it was attacked by several Separatist warships and destroyed shortly after."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}