{"url": "Hallion_Nark", "categories": ["Category:Canon articles", "Category:First Order individuals", "Category:Males", "Category:Neimoidians", "Category:Spies", "Category:Warbird gang members"], "nodes": [{"tag": "h1", "text": "Hallion Nark"}, {"tag": "p", "text": "Hallion Nark was a nervous male Neimoidian who was a spy for Kragan Gorr's pirate gang during the era of the New Republic. Nark was a male Neimoidian with brown eyes and green skin."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hallion Nark was a member of Kragan Gorr's pirate Warbird gang during the New Republic era. Prior to a triple dark storm, Nark visited Jarek Yeager's repair station seeking repairs for his Sheathipede-class shuttle. In truth, he was at the Colossus to scout the platform prior to a pirate raid. Nark wanted to check that a triple dark storm was approaching; the ideal conditions for a raid."}, {"tag": "p", "text": "Yeager assigned his mechanics Neeku Vozo and Kazuda Xiono to repair the shuttle. Since Xiono had little mechanical experience, the repairs took longer than expected. Hallion became impatient and warned Yeager's Team Fireball that he was on a tight schedule. While installing the compressor, Xiono overheard Gorr telling someone on his comlink that everything was clear for a \"triple dark.\""}, {"tag": "p", "text": "Suspicious of Nark, Xiono startled Nark, causing his comlink to drop into a grate. Xiono apologized buy Nark told him to forget it since he had to leave. Yeager deducted money from Xiono's wages. After Nark departed, the Warbirds raided the Colossus under the cover of a triple dark storm. However, Xiono managed to retrieve the comlink and jammed the pirates' communications. This turn the tide of the battle in favor of Ace Squadron and Kragan was forced to order a retreat."}, {"tag": "p", "text": "Due to the failed raid, Kragan ordered that Nark be bound in the presence of the other pirates. He also reassured the First Order officers Captain Phasma and Major Elrik Vonreg, who were supporting the pirates, that Nark would be punished for his tactical error."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hallion Nark was a male Neimoidian with brown eyes and green skin. As a member of Kragan Gorr's Warbird pirate gang, Nark was a spy who could also pilot a Sheathipede-class shuttle. Nark had some knowledge of weather patterns on Castilon including triple dark storms. He feigned impatience with Yeager's Team Fireball so that he could leave the Colossus and rejoin the Warbirds. Nark did not realize that the loss of his comlink would have serious ramifications for the Warbirds' raid on the Colossus."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hallion Nark is a character created and developed for Star Wars Resistance. He is voiced by Jonathan Lipow. He first appeared in the Season One episode \"The Triple Dark,\" which premiered on October 14, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}