{"url": "Halo/Legends", "categories": ["Category:Legends articles", "Category:Bounty hunter starships", "Category:SS-54 assault ships"], "nodes": [{"tag": "h1", "text": "Halo"}, {"tag": "p", "text": "The Halo was a SS-54 assault ship constructed by Botajef Shipyards. During the galaxy-spanning conflict between the Galactic Republic and the Confederacy of Independent Systems, the Halo was used by a female Zabrak bounty hunter and mercenary by the name of Sugi as her personal starship. The Halo would be used to transport Sugi and her band of mercenaries to the planet Felucia in 21 BBY, where together with a trio of Jedi, they defended a village of Felucian farmers against the pirates of Hondo Ohnaka's gang. After the pirates had been run off, Sugi offered the stranded group of Jedi safe passage back to Republic space aboard the Halo."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Halo was an SS-54 light freighter, the product of Botajef Shipyards. A far cry from the shipyards of Botajef's other major export, the AA-9 Coruscant freighter, as an SS-54, the Halo was considerably smaller and more well-equipped in the area of armament, possessing approximately six laser cannons, four forward and two aft. Painted a dark green, it was decorated with stripes of white and yellow-colored highlights in certain areas along the top hull of the ship. Painted on the side was a rather demented looking tooka doll holding a knife next to the words 'Nice Playing With Ya' written in Aurebesh. The Halo became the personal transport of the bounty hunter and mercenary named Sugi, a female Zabrak who operated during the galactic conflict known as the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Coming into the possession of the mercenary Sugi at some point prior to the Clone Wars, the Halo was used as the Zabrak female's personal transport during the conflict between the Galactic Republic and the Confederacy of Independent Systems. When the nysillin farmers of the Felucian village Akira contracted Sugi and her crew of mercenaries to defend them against the extortion attempts by the pirates of Hondo Ohnaka's Weequay gang, it was the Halo that brought the group to Felucia. During their time on the planet, Halo was stored in the large barn used to store the harvested nysillin. Once Ohnaka and his pirates were driven off in a combined effort from Sugi's mercenaries and a trio of Jedi including Jedi Master Obi-Wan Kenobi, Jedi Knight Anakin Skywalker, and Padawan Ahsoka Tano—all of whom had been previously stranded on the Outer Rim world after their shuttle crashed—Sugi offered the Jedi passage off of Felucia and back to Republic space aboard the Halo."}, {"tag": "p", "text": "It was also later used by Sugi and Seripas along with a group of Wookiees with their commander, Tarfful on Wasskah, to rescue Chewbacca, Ahsoka, and a few other prisoners who had been kidnapped by Trandoshan bounty hunters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "LEGO made a set of the Halo called 7930 \"Bounty Hunter Assault Gunship\" which came out at the start of 2011. The set included Embo, Aurra Sing, Sugi, and an IG-86\nAssassin Droid. It was featured later that year in the video game LEGO Star Wars III: The Clone Wars."}, {"tag": "p", "text": "Dave Filoni stated that the Halo's cockpit and staging area had to be enlarged for its appearance in \"Wookiee Hunt\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}