{"url": "Halsey/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Post-Ruusan Jedi Masters", "Category:Roonan"], "nodes": [{"tag": "h1", "text": "Halsey"}, {"tag": "p", "text": "Halsey was a male Roonan Jedi Master who lived during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Alongside his Padawan, the Nautolan Knox, Halsey participated in the Republic's defense of the Temple of Eedit on the planet Devaron. Though the Jedi and their ARF troopers were initially successful in fighting off the Separatist battle droids, the Zabrak Savage Opress, a pupil of Separatist leader Count Dooku, turned the tide of the battle and cut through the Republic defenders. Halsey moved to confront Opress, but his combat skills were insufficient in dealing with the threat, and both he and Knox were killed by the Zabrak assassin. The Jedi's bodies were later recovered and transported to the Jedi Temple on the planet Coruscant. Separatist Weequay agents attempted to sabotage his funeral at the Temple, but Jedi Master Obi-Wan Kenobi prevented them from turning his coffin into a dioxis gas bomb."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi Master"}, {"tag": "p", "text": "Halsey was a male Roonan Jedi Master active during the Clone Wars, a galactic conflict between the Republic and the Confederacy of Independent Systems. He took the Nautolan Knox as his Padawan. In 21 BBY, Halsey was present in the Jedi Temple communication center on the planet Coruscant alongside several other members of the Order when the Separatist General Grievous informed the Jedi High Council of his successful capture of Jedi Master Eeth Koth."}, {"tag": "p", "text": "Halsey and his apprentice were later stationed at the Temple of Eedit, a Republic outpost on the planet Devaron. During their time on Devaron, the Temple came under attack by a force of Separatist battle droids. Halsey and Knox led the defense of the outpost, assisted by ARF troopers under Clone Commander \"Trauma.\" In the midst of the battle, the Separatists were joined by Savage Opress, apprentice to Confederate leader Count Dooku. The Zabrak assassin proceeded to kill all who stood in his way—clones and droids alike—before he reached the Temple's entrance. Halsey moved to confront Opress, who managed to avoid several strikes from the Roonan's lightsaber before disarming the Jedi. Though he proceeded to engage the assassin in unarmed combat, Halsey was repeatedly struck by Opress's pike and knocked to the ground, where he was stabbed by his opponent and killed. Knox attempted to avenge his Master's death, but he too fell to Opress, who reported his victory to Dooku."}, {"tag": "h3", "text": "Funeral"}, {"tag": "p", "text": "The clone commandos of Delta Squad were later dispatched to Devaron to search for survivors of the engagement. Finding none, they recovered the corpses of Halsey and Knox and returned them to the Jedi Temple on Coruscant. The Jedi High Council concluded that the deaths of the Roonan Jedi and his apprentice were a sign of a new threat to the Republic; their suspicion was confirmed when security footage of the massacre, including Halsey's death, was recovered. His body was transferred to a coffin by a Coruscant funeral firm so that it could be cremated at the Jedi Temple. However, a trio of Separatist Weequay agents, posing as workers at the firm, attempted to sabotage his funeral to kill the Jedi who would be attending the service. Jedi Master Obi-Wan Kenobi learned of the plot and arrived on the Temple steps just as Grand Master Yoda was about to ignite Halsey's funeral pyre. Kenobi removed a dioxis gas bomb that the Separatists had inserted into the coffin, saving the other attendees—Masters Plo Koon and Mace Windu, Jedi Knight Anakin Skywalker, and Padawan Ahsoka Tano—from the threat."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Halsey was an agile and wise Jedi Master, and he was admired by his apprentice, Knox. When confronted by Savage Opress, he instructed his Padawan to stay back as he attempted to defeat his opponent on his own. Following his death, Halsey was remembered by his peers as one of the most valiant members of the Jedi Order."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Skilled with both a lightsaber and the Force, Halsey was capable of redirecting blaster bolts with his lightsaber and jumping high using the Force. The Roonan was also knowledgeable in unarmed combat, though his talents were not sufficient to defeat Savage Opress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Roonan Jedi Halsey first appeared as a background character in \"Grievous Intrigue,\" the ninth episode in the second season of the Star Wars: The Clone Wars television series. He was identified by name in the accompanying episode guide. Halsey later made an appearance in the Season Three episode \"Monster,\" in which he was voiced by Corey Burton; the Roonan briefly appeared in holographic form in the subsequent episode \"Witches of the Mist.\" Halsey went through several name changes during development; concept art identified him as \"Jayfo Ong\" before he was renamed to \"Tukker Val Loo\" and then \"Lev'loa\" before his final name was determined. The Roonan's character model was constructed using the preexisting body of Jedi Master Kit Fisto, albeit retextured."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}