{"url": "Hammer_Station", "categories": ["Category:Legends articles", "Category:Asteroid bases", "Category:Battlestations", "Category:Galactic Republic vehicles", "Category:Mobile space stations", "Category:Space station superweapons"], "nodes": [{"tag": "h1", "text": "Hammer Station"}, {"tag": "p", "text": "Hammer Station was a powerful prototype battle station built by the Galactic Republic during the Great Galactic War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Pressed by the Sith Empire during the war, the Republic Senate sank its meager resources into ever-more desperate measures to end the conflict. One of the resulting projects was Hammer Station, a prototype mobile facility built inside an asteroid around a combined tractor beam and massive gravity cannon. The tractor beam captured nearby asteroids, and the cannon launched the asteroids at near-relativistic speeds at a chosen target. No shield could handle that magnitude of kinetic energy. When positioned over a planet, Hammer Station was capable of devastating entire cities in a single shot."}, {"tag": "p", "text": "However, Hammer Station's attacks could not be tempered. The asteroids caused planet-wide dust clouds and groundquakes, rendering entire worlds nearly uninhabitable. After seeing the destruction, the Republic Senate could not authorize its use, even against the Empire, and ordered the project scrapped. The Hammer Station project files were classified and later destroyed in a Senate tower bombing after the Treaty of Coruscant was signed. Hammer Station was abandoned, left to drift through the galaxy."}, {"tag": "p", "text": "Ten years after the Sacking of Coruscant, the station was claimed by the Advozse Hegemony and was being used to conquer worlds in the Outer Rim. In addition, a multitude of Republic war droids left on the asteroid were captured, and reprogrammed on board the station. Darth Malgus, the conqueror of Coruscant, called together an Imperial strike team to board Hammer Station and destroy it, and also uncover exactly how the Advozsec managed to acquire it. Similarly, Satele Shan, the Grand Master of the Jedi Order, called together Republic forces to investigate."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Hammer Station was designed and built within an asteroid. A main hanger bay, used for incoming and outgoing supplies, fed into a series of hallways. While many hallways were fully constructed, antechambers held drills and other mining equipment used to burrow through the asteroid. Several large caverns existed. One such cavern held a large DN-314 Mining Droid."}, {"tag": "p", "text": "The security wing was composed of a network of tunnels. Some contained bubble tunnels, which allowed excellent viewing of space. Under the control of the Advozse Hegemony, most Advozsec resided here. In addition, this area was commanded by Vorgan the Volcano and his subordinates, Sawbones Gjonfs and 2R-CH. The security wing led into Section Zero."}, {"tag": "p", "text": "Section Zero held the gravity cannon used to launch asteroids. In order to cross the cannon safely, a bridge existed, which could be deactivated prior to launching an asteroid. Battlelord Kreshan was often found here under the control of the Hegemony."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hammer is the location of a flashpoint mission in the video game, Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}