{"url": "Hammerhead-class_cruiser", "categories": ["Category:Legends articles", "Category:Cruiser classes", "Category:Galactic Republic starship classes", "Category:Hammerhead-class cruisers"], "nodes": [{"tag": "h1", "text": "Hammerhead-class cruiser"}, {"tag": "p", "text": "The Hammerhead-class cruiser was a type of warship used by the Republic Navy during the Old Sith Wars, the Mandalorian Wars, and the New Sith Wars. One of the most successful warship designs in galactic history, the Hammerhead-class would still see use in sector defense forces millennia after its introduction and would inspire many later ship designs, such as the Thranta-class corvette and MC140 Scythe-class main battle cruiser."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "This ship was a cruiser and a successor-design to the smaller Praetorian-class frigate. Serving on the line in fleet engagements as a courier and as a command ship of large fleets, it was a workhorse of the Republic and a common sight near Republic-controlled worlds. This ship could also undertake independent operations, unlike the Foray-class blockade runner, which was never observed outside a supporting fleet. Hammerheads were able to enter atmospheres and land on planetary surfaces."}, {"tag": "p", "text": "The spaceframe resembled the later Consular-class cruiser and the CR90 corvette, though this may have been coincidental. They also bore a large resemblance to the EF76 Nebulon-B escort frigate of the Galactic Civil War era, due to the vertically elongated bridge."}, {"tag": "p", "text": "In 3956 BBY the cruisers appeared to possess at least seven turbolasers, with three batteries of two and a single turbolaser cannon mounted atop the hammerhead bridge structure. As demonstrated by the Endar Spire and the Harbinger some years later, they also appeared to have a number of lighter, point-defense laser cannons for use against small craft mounted at various points along the hull."}, {"tag": "p", "text": "They were propelled by four ion engines emitting particles in the orange section of the visible spectrum during the wars around 3956 BBY. This changed over time, earlier ships having three engines that emitted blue particles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Hammerheads were first seen in service in the Great Sith War, where they participated in the Battle of Koros Major. During the restoration period after the war, it was mass-produced at such a scale that Rendili Hyperworks would finish a new cruiser every ten days for several years."}, {"tag": "p", "text": "During the Mandalorian Wars thirty years later, they remained in frontline service, sometimes alongside the Inexpugnable-class command ship, itself a class made to sell more Hammerheads. With a third of the Republic's fleet crushed at Malachor V during the Wars, and another third, including bigger Interdictor-class cruisers, taken by Revan to form the basis of his Sith Empire's forces, the ailing Republic government turned to these smaller capital ships to halt the Sith advance."}, {"tag": "p", "text": "Throughout the Great Galactic War, Galactic War, and New Sith Wars, the class remained in service. Hammerhead-class cruisers served alongside Thranta-class corvettes, a competitor design, at the Second battle of Leritor. Another ship, the Tanthior, was shot down over Onderon during the war with Zakuul. During the New Sith Wars, Hammerheads each held a squadron of Aurek-class tactical strikefighters and had undergone significant upgrades and design revisions since their debut thousands of years before.\nMuch like the Invincible-class dreadnaught, the Hammerhead-class cruiser was one of the longest serving classes of ship in the Republic military, with versions of it being maintained in active service for at least 3,000 years."}, {"tag": "p", "text": "One Hammerhead-class cruiser which had been retrofitted into a Jedi temple by Master Val Isa before being destroyed in the Mandalorian Wars, the Sanctuary, was rediscovered by a group of Force-sensitive individuals in 0 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hammerhead-class cruiser was first introduced in the 2003 role playing video game Star Wars: Knights of the Old Republic; it is within one such vessel, the Endar Spire, that the game's tutorial level takes place. Near the end of the game, when the Ebon Hawk crash-lands on Lehon, the player can see the remains of a Hammerhead-class ship that had crashed into the rocks on the shore at an earlier date. It could be possible that this was the vessel used by Revan and Malak during their search for the Star Forge, however this cannot be confirmed. In the game's sequel, Star Wars: Knights of the Old Republic II: The Sith Lords, much more information on this class of vessel is given, including deck plans for crew quarters, a medical bay, and engine rooms."}, {"tag": "p", "text": "In the second timeline trailer for the Star Wars: The Old Republic, a new and more heavily armed variant of the Hammerhead-class is seen above Coruscant. This was later revealed to be a separate class, the Thranta-class."}, {"tag": "p", "text": "Leland Chee has confirmed that the ships seen in the Knights of the Old Republic games are of the same class that was named in Darth Bane: Path of Destruction, but that the version of the book and that of the game may have different specifications, considering that they are used approximately three thousand years apart from one another."}, {"tag": "p", "text": "The wreckage of a Hammerhead-class vessel can be seen on the volcanic world of Mustafar in the expansion for Star Wars Galaxies, Trials of Obi-Wan. Why it is there and how it came to be is never explained, however, with the simple implication that it is only a long-crashed Republic warship."}, {"tag": "p", "text": "The Hammerhead-class cruiser was the Legends inspiration for the canon Sphyrna-class Hammerhead corvette, which made its first appearance in \"A Princess on Lothal,\" the twelfth episode of the second season of the animated television series Star Wars Rebels, released on January 20, 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}