{"url": "Hammertong/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire", "Category:Imperial projects and operations", "Category:Separatist projects and operations"], "nodes": [{"tag": "h1", "text": "Hammertong"}, {"tag": "p", "text": "Hammertong was the codename given to a secret project, known as Project Hammertong, involving the superlaser prime weapons for the Death Stars."}, {"tag": "p", "text": "Originating during the Clone Wars, the Confederacy of Independent Systems was working on their Ultimate Weapon, a project which would later be turned over to the Galactic Empire, and converted into the Death Star project."}, {"tag": "p", "text": "In 19 BBY, Supreme Chancellor Palpatine sent a unit of the 501st Legion to Mygeeto. The official story was that the unit was sent to support the Galactic Marines under Ki-Adi-Mundi by destroying an energy collector. In truth, the unit was sent to retrieve an energy crystal, used in one of the InterGalactic Banking Clan's power generators, that was necessary for the Hammertong project. General Mundi was suspicious of the unit's activities but had no idea of the truth until it was too late."}, {"tag": "h2", "text": "Mistryl involvement"}, {"tag": "p", "text": "By the time that the original Death Star was entering service in 0 BBY, the Hammertong project, now led by a scientist named Eloy, was already working on a superlaser design for the second, even more powerful battlemoon. A prototype section of the prime weapon was constructed in a secret facility on Gorno, and when the research base was relocated to another planet, the Hammertong was installed for transport in a massive hold aboard a specially-adapted Strike-class medium cruiser."}, {"tag": "p", "text": "In 0 BBY, a scientist from the Hammertong project named Kellering approached a Mistryl Shadow Guard team led by Manda D'ulin about providing security for the prototype during transit. Ostensibly, Kellering claimed that Eloy was skeptical about the capabilities of Captain Drome's security detail, but when he brought Manda to the base to meet Eloy, they were attacked by stormtroopers and Manda was gunned down, followed shortly thereafter by her comrade Pav D'armon."}, {"tag": "p", "text": "The four surviving Mistryl responded by attacking the Imperials, determined to leave a message that the military could not simply shoot down Shadow Guards as they pleased. Shada D'ukal and Karoly D'ulin stole the Strike Cruiser, blasting out of orbit even as an Imperial Star Destroyer arrived to guard the prototype."}, {"tag": "p", "text": "The Mistryl escaped to Tatooine, where they hid the stolen cruiser beneath the sands of the Dune Sea, and Shada and Karoly headed into Mos Eisley, disguised as the Tonnika sisters, to find a freighter that could transport part of the weapon back to Emberlene. They made contact with Rebel Alliance agent Riij Winward, but quickly fell out over whether details of the Hammertong should go first to the Shadow Guard or the Alliance. The Mistryl ended up with their freighter, but Winward stole their astromech Deefour, along with a technical readout of the device - promising politely to return it once the Alliance had acquired the information."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Project Hammertong made its first appearance in the short story Hammertong: The Tale of the \"Tonnika Sisters\". It later received mentions in other sources, such as Star Wars: Battlefront II."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}