{"url": "Alsakan_Conflicts", "categories": ["Category:Legends articles", "Category:Alsakan Conflicts", "Category:Conflicts of the Colonies", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Expansion Region", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Alsakan Conflicts"}, {"tag": "p", "text": "The Alsakan Conflicts were a series of seventeen wars waged between the planets Coruscant and Alsakan over a period of 14,000 years for the right to be the capital of the galaxy. The Alsakan Conflicts were mainly fought in the Expansion Region over the rights of corporations to sponsor colonization and settlement. The first conflict was in 17,000 BBY and the last was in 3017 BBY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The seeds of the Conflicts were sown during the Great Manifest Period, the widespread colonization of the Slice by the young Galactic Republic beginning in 20,000 BBY. Two super-hyperroutes reached outward from Coruscant: the Perlemian Trade Route to the galactic east, and the Corellian Run to the south. The open-bottomed triangular wedge of the galaxy defined by these spacelanes was known as the Slice, considered the cradle of galactic civilization, and Coruscant owed its pre-eminence to its position as the common point where these two hyperlanes emerged."}, {"tag": "p", "text": "The Corellian Run additionally continued through Coruscant to the west to become the Metellos Trade Route. Together, these routes formed a single hyperlane originally known as \"the Spin\", extending from Duro to Alland with spurs to systems such as Salliche, Koros and Kuat. This was the original spine of the early Republic, defining a civilization based on heavily-urbanised and bureaucratic megaworlds, where a strong state was seen as a protector against economic exploitation and inequality."}, {"tag": "p", "text": "The Perlemian Trade Route, however, was not part of this political geography and intersected with it only at Coruscant. The sectors along the Perlemian were human-dominated as opposed to the multi-species worlds of the Spin. Amid growing economic and political competition among the Core Worlds, Alsakan, Rimward of Coruscant along the Perlemian and a stopover between it and Axum, became a champion of those human-dominated sectors, which envied Coruscant's privileged position and influence over the worlds of the Spin. Thus, the Perlemian Trade Route's values were defined by those of Alsakan as opposed to Coruscant. The Alsakani saw the Republic as overly-powerful, having sought a limited economic and political union during the founding of the Republic, and were a people aristocratic in their values, enthusiastic for colonization and local independence, and cared little for bureaucracy or mass-produced goods beyond warships and blasters. Alsakan's national epic, the Archaiad, named the Perlemian \"the Axis\", and described it as \"an arrow sent into the possible.\" Thus the young Republic became divided into two very different civilizations, each defined by its separate hyperlane."}, {"tag": "p", "text": "Conflict first flared when the younger sons of Alsakani nobles, seeking to distance themselves from authority, established small colonies in the Inner Rim. Meanwhile, the great trading conglomerates of the Spin - the Grand Companies - pressed Rimward into the Slice in pursuit of raw materials, forming a territory dubbed the Exploitation Region that was actively controlled by the Grand Companies by 17,000 BBY. The settlement of the Inner Rim around the Perlemian was bolstered by refugees displaced by the Grand Companies' activities. Around 17,000 BBY, Alsakan led the Axis worlds in moving south to block the Grand Companies, claiming resource-rich worlds in the path of their expansion."}, {"tag": "h2", "text": "The Conflicts"}, {"tag": "h3", "text": "The first wars"}, {"tag": "p", "text": "The First Alsakan Conflict began in 17,018 BBY when armed Duros freighters clashed with Alsakani warships. The Republic's Coruscant government backed the Grand Companies, invading and occupying Virujansi before it was liberated by Alsakan. Further clashes took place at Porus Vida and Belasco, and the fleets of Coruscant and Alsakan clashed indecisively in the hyperspace minefields between the two systems at the Battle of Kes."}, {"tag": "p", "text": "The first conflict ended in 16,800 BBY when the Bureau of Ships and Services, which controlled the hyperspace beacon system both sides depended on, threatened to withhold navigational data if the war continued. The Challat Compromise temporarily resolved questions of representation in the Galactic Senate, but Alsakan continued to sponsor southward settlement across the Slice to seize raw materials. With another war on the horizon, Corellia - sympathetic to Alsakan but with deep ties to the Spin and the Grand Companies - inserted the Contemplanys Hermi clause into the Galactic Constitution, which gave it the right to recuse itself from the Republic if the two sides reopened hostilities."}, {"tag": "p", "text": "The First Alsakan Conflict and its resolution set the pattern for fourteen thousand years of history: Alsakani nobles and Coruscant-backed megacorporations competed for resources in the Expansion Region while Corellia protected its own interests in the farther reaches of the Corellian Run but tried to avoid choosing sides. Each conflict effectively split the Republic into three de facto independent states, sometimes for centuries at a time."}, {"tag": "p", "text": "The first five conflicts, fought across the Indecta Era to the end of the Kymoodon Era, saw repeated attempts to secure a decisive victory using fleets of capital ships, but while both Coruscant and Alsakan were raided, neither side had the military resources to split its forces between attack and defense, and neither wished to leave itself defenseless. This prompted a shift in tactics: squadrons of battleships like the Alsakani Atgeir-class battlecruisers and Coruscant's Gilagimar guarded both sides' Core planets, while fast cruisers launched raids into the Expansion Region. This was best exemplified by Admiral Hirken's tenacious defense of the Alsakani colonies in the Northern Dependencies in 12,980 BBY, which decided the conclusion of the Fifth Alsakan Conflict. Subsequent campaigns followed a pattern of raids and ripostes in the colonies and a ceasefire in the Core."}, {"tag": "p", "text": "During the conflicts, numerous items of historic interest were destroyed, including two of the Wonders of the Galaxy: Belgoth's Beacon, a hyperspace beacon and satellite dating from around 25,100 BBY, was destroyed in the Core Campaigns of the Second Alsakan Conflict in around 15,600 BBY. The centerpiece of the Alsakan Mosaics was destroyed during Cleansing of Rucapar in 14,450 BBY the Third Alsakan Conflict."}, {"tag": "h3", "text": "The Pius Dea Era"}, {"tag": "p", "text": "After the Galactic Republic fell under the control of Pius Dea theocrats in 12,000 BBY, it began a series of increasingly-brutal Crusades against the species of the Outer Rim. In response, Alsakan and much of the Axis seceded from the Republic around 11,820 BBY. The Sixth Alsakan Conflict was a vicious war between Alsakan and the Pius Dea Republic, which saw Alsakan open up secret lines of communication with numerous species that had been the victims of the Crusades, including the Duros, Herglics and Hutts."}, {"tag": "p", "text": "From 11,100 BBY, the Pius Dea began a series of violent Inquisitions to root out heresy within its own ranks. Alsakan collaborated with the Caamasi and the Jedi Order to spread a secret faith within the Pius Dea to create a movement of Renunciates that would help them restore the Republic. In 10,967 BBY the Renunciates declared themselves, sparking the Seventh Alsakan Conflict, also known as the Pius Dea Civil War. This saw Alsakani battlecruisers attacking Pius Dea Faithful strongholds at Ixtlar, Fondor and Cyrillia, backed up by Jedi privateers and Herglic, Duros and Hutt warships. The Conflict ended with the arrest of Supreme Chancellor Contispex XIX by the Jedi at the Battle of Uquine."}, {"tag": "h3", "text": "Conclusion"}, {"tag": "p", "text": "Though the Republic was restored, the Alsakan Conflicts would continue for another four thousand years, occasionally marked by atrocities like the Osara Mundicide of the Tenth Alsakan Conflict prior to the 9400s BBY. Eventually, however, the Conflicts grew less brutal and the period of peace stretched longer, until after 8000 BBY the Alsakan Conflicts were considered minor, almost antiquarian divisions."}, {"tag": "p", "text": "The Seventeenth and final Alsakan Conflict flared up in the aftermath of the Galactic War, which concluded in the 3600s BBY. The Axis continued building up its fleet, developing a capable force of mass-produced sublight missile corvettes. In response, the Republic Navy under Supreme Chancellor Vedij developed a fleet of Invincible-class fast battleships, designed to overwhelm Alsakan and Corulag's fleets in a direct assault."}, {"tag": "p", "text": "Alsakan's corvette squadrons successfully defended the Perlemian systems against Republic raids, but the decisive role was played by the Corellians, who responded to the saber-rattling of both sides by building a fleet of long-range frigates. These had originally been designed as pickets for Corellia's battleships, but technological breakthroughs during their construction enabled them to be fitted with fast engines, strong deflector shields, and heavy turbolasers, rendering the massive battleships of both sides obsolete. In 3017 BBY, Corellian privateers inflicted heavy defeats on both Alsakan and Coruscant, leading both to join forces and declare war on Corellia. Republic forces were rapidly outfought, and Corellian Prince-Admiral Jonash e Solo dictated a peace treaty at swordpoint on the floor of the Senate."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Jonash e Solo's peace proved enduring. The true victor of the Alsakan Conflicts was Corellia, whose neutrality allowed it to protect and enrich its colonies in the Corellian Hegemony around the Corellian Run and the Corellian Trade Spine. The conflicts between Coruscant and Alsakan along the Axis made settlement along the Perlemian Trade Route increasingly unattractive, resulting in a shift of colonists to the west of the Corellian Run and along the growing Trade Spine. The Corellian Hegemony in the Expansion Region thrived at the expense of the Slice, attracting billions of colonists and seeing the development of the 77 Sectors along the Run, a region that Corellia dominated as late as the Galactic Civil War."}, {"tag": "p", "text": "The Alsakan Conflicts were notable in helping to spread the High Galactic alphabet throughout the galaxy. While Aurebesh remained the dominant writing system, Alsakan heavily promoted the High Galactic alphabet as an alternative script for Galactic Basic as part of its efforts to portray itself as an alternate galactic capital. Owing to Alsakan's values, High Galactic became a popular script among upper-class Basic speakers, and its influence endured for millennia after the Alsakan Conflicts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}