{"url": "Han%27s_heavy_blaster_pistol", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Heavy blaster pistols", "Category:Personal weapons"], "nodes": [{"tag": "h1", "text": "Han's heavy blaster pistol"}, {"tag": "p", "text": "Han's heavy blaster pistol was the modified heavy blaster pistol owned by Tobias Beckett before been given to the future Rebel Alliance General and then smuggler Han Solo. The heavy blaster pistol was a DL-44 model manufactured by BlasTech Industries, and, despite newer models having come and gone, Solo preferred only his own modified DL-44 as his sidearm. Solo carried the weapon with him since before the Galactic Civil War between the Rebel Alliance and the Galactic Empire, and had it by his side at the time of his death on Starkiller Base over 30 years later."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Han Solo's heavy blaster pistol was a modified version of the standard BlasTech Industries DL-44 model. Like all DL-44s, Solo's blaster offered above-average firepower without compromising accuracy, and was one of the reasons why the weapon was so ideal for the smuggler. It was also easily modifiable, which allowed Solo to make a number of modifications, including, at one point, removing the blaster's motion-sensitive barrel scope. Solo did this so the blaster pistol could be drawn faster from its holster and improve his reaction time, but also because he was confident in his own aim. Even in his later life, as he grew older, Solo remained a quick draw."}, {"tag": "p", "text": "The DL-44's capacitor was capable of charging a laser bolt at twice the power without overheating. The heavy blaster pistol still retained a cooling unit beneath the firing barrel, as DL-44s were prone to quickly overheating otherwise. The DL-44 was renowned across the galaxy as one of the most powerful blaster pistols, as its laser bolts were powerful enough to pierce through the armor of Imperial stormtroopers."}, {"tag": "p", "text": "Solo's heavy blaster also had a steady grip that emitted a low-power pulse warning whenever the weapon was low on power. The weapon's power cell was located near its hair-trigger, and it had a detachable macroscope above the firing barrel. The weapon's grip was brown in color, while the rest of its body and firing barrel were black and silver."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Han Solo, a human male, was orphaned at a young age and thereafter became a street thief. His personal adventures eventually led him originally to the Empire (though not necessarily his first or original choice) in the hopes of becoming a pilot. Getting booted from The Imperial Flight Academy however stalled his plans and he wound up as an infantryman. During the Mimban campaign, Corporal Solo came across Tobias Beckett, a veteran smuggler with whom Han saw as an opportunity to leave the Empire to become a smuggler and adapt to a rogue life. Immediately after defecting, Beckett agreed to take Han on as a partner in his crew; after which Tobias gave the then unarmed Han a DL-44 heavy blaster pistol manufactured by BlasTech Industries. Notably, the DL-44 that he would give Han was originally in a rifle configuration as it was stolen from the Imperial outpost on Mimban; Tobias personally removed all of the rifle attachments including a longer barrel and a shoulder stock, making it much more suitable for the kind of quick fire situations smugglers tend to be in. This would become Han's most favored and trusted weapon. During his travels, Solo came to believe he should always have his blaster pistol at his side for any situation."}, {"tag": "h3", "text": "Smuggler's sidearm"}, {"tag": "p", "text": "Business went awry for Solo after he was forced to dump illegal cargo belonging to Jabba the Hutt, a notorious gangster, when the Galactic Empire boarded his starship, the Millennium Falcon. This put the smuggler in debt with the crime kingpin, with a bounty of 224,190 being placed on his head. When a Rodian bounty hunter named Greedo attempted to collect the bounty on Solo in Tatooine's Chalmun's Spaceport Cantina, Solo used his DL-44 to kill the Rodian, whose own blaster shot missed Solo."}, {"tag": "p", "text": "Soon after, Solo agreed to give transport to Alderaan to the Jedi Master-in-hiding Obi-Wan Kenobi and his companion Luke Skywalker, who were on a secret mission, for a payout of 17,000. Solo used his blaster in their escape from Tatooine and, reluctantly, ended up assisting in the rescue of the Princess Leia Organa from the Death Star battle station, where he used his heavy blaster pistol to steal the armor from unexpecting Imperial stormtroopers. He temporarily holstered his trusted DL-44 while disguised as a Stormtrooper soldier, using the standard-issue E-11 blaster rifle instead for the remainder of the escape."}, {"tag": "h3", "text": "Alliance weapon"}, {"tag": "p", "text": "Following the Battle of Yavin, in which Solo aided in destroying the Death Star superweapon, Solo became a hero and respected member of the Rebel Alliance. In 3 ABY, while patrolling the frigid planet of Hoth, the site of the Alliance's Echo Base, Solo and his lifelong friend Chewbacca came across an Imperial probe droid. In an attempt to prevent the probe droid from outing the location of the Rebel base, Solo used his DL-44 to fire on the droid, but it self-destructed before his blaster could do any damage. This alerted the Empire to the Alliance's location, forcing Echo Base to evacuate the planet."}, {"tag": "p", "text": "The Millennium Falcon escaped during the subsequent Battle of Hoth, but its hyperdrive was damaged, forcing Solo to find refuge from the pursuing Imperial TIE Fighters and Star Destroyers in an asteroid field. Solo hid the light freighter within a nearby asteroid cavern, where he used his heavy blaster pistol to clear mynocks off the hull of the Falcon. He then realized that the Falcon was actually inside the mouth of a giant space slug after the creature lurched from the blast of the laser bolts from his DL-44. Immediately after, Solo and the Falcon escaped the asteroid field and their Imperial pursuers, but the bounty hunter Boba Fett managed to stealthily track the smuggler down."}, {"tag": "p", "text": "Fett's pursuit gave the Empire the advantage against Solo and his rebel allies, beating the smuggler to the planet Bespin, where Solo sought to repair the Falcon. A trap was set, and when the Sith Lord and Imperial enforcer Darth Vader arrived on the planet, he coerced Lando Calrissian, Solo's friend, into cooperation against Solo. The smuggler, in vain, attempted to shoot down the dark lord on Cloud City using his heavy blaster pistol, but Vader effortless deflected the bolts telekinetically with the Force. Vader, using his Force powers, subsequently took Solo's DL-44 from his hands. Not long after, Han Solo was frozen in carbonite and taken by Fett to collect on the bounty set by Jabba the Hutt. Solo's trusted blaster ended up in the hands of his rebel allies following their escape from Cloud City."}, {"tag": "p", "text": "In 4 ABY, Luke Skywalker, now a Jedi, alongside Leia Organa, Chewbacca, and Lando Calrissian, successfully rescued Solo from Jabba's Palace, effectively erasing Solo's debt to the crime lord when the Hutt was killed. Solo, promoted to the rank of Rebel Alliance General, then volunteered for the Alliance's mission to the Endor moon, where they sought to disable the shield generator to the Empire's second Death Star. Solo had his DL-44 returned to him prior to the mission, but it was once again taken from him when the Ewoks of the Bright Tree Village captured Solo and his companions on the surface of the moon. After the group befriended the primitive species, Solo had his weapon returned to him and thereafter rendezvoused with the Rebel Alliance Special Forces to continue their mission."}, {"tag": "p", "text": "During the following Battle of Endor, Solo used his heavy blaster pistol against the opposing Imperial forces in the Alliance's efforts to infiltrate the Death Star's deflector shield bunker. When the Alliance emerged victorious, Solo rounded up the defeated Imperial forces at gunpoint using his DL-44 and subsequently destroyed the bunker using explosive charges. After the Death Star's destruction, Solo reunited with his companions and celebrated the defeat of the Empire and, thus, the end of the dark times."}, {"tag": "h3", "text": "Upended retirement"}, {"tag": "p", "text": "After the end of the Galactic Civil War, Han Solo and Leia Organa married and had a son named Ben. Solo retired for some time and became a successful racing pilot, abandoning his former career as a smuggler completely. However, Solo's son became corrupted by the dark side of the Force and destroyed the new generation of Jedi Luke Skywalker was training alongside Ben. This led Skywalker to go into self-imposed exile, and Solo to return to smuggling with his longtime partner, Chewbacca. As the Millennium Falcon was eventually stolen from Solo by Gannis Ducain after his return to smuggling, Solo became the pilot of the heavy freighter Eravana. Alongside his favored DL-44, Solo began carrying around a LPA NN-14 blaster pistol as another sidearm. Despite newer models having been available, Solo chose not to replace his DL-44, highly preferring its design."}, {"tag": "h3", "text": "Final conflicts and destruction"}, {"tag": "p", "text": "30 years after the Battle of Endor, a conflict began between the First Order, which had risen from the ideals of the Empire, and the Resistance, an effort led by Leia Organa to counter the First Order. Solo stayed out of the rising political tensions between the New Republic and the First Order, preferring to keep to his smuggling business. However, when the scavenger Rey and First Order defector Finn came across the stolen Millennium Falcon during their escape from Jakku, Solo's Eravana captured the Falcon and inadvertently became involved in the Resistance conflict. While inspecting the Falcon with his DL-44 drawn, Solo found Rey and Finn, alongside the Resistance astromech droid BB-8, stowed away on the freighter."}, {"tag": "p", "text": "After realizing Rey and Finn were not a threat, and learning that BB-8 carried a map that lead to Luke Skywalker's hidden location, Solo's hand was forced into helping the two when the Guavian Death Gang and Kanjiklub boarded the Eravana. The two gangs sought to force Solo into returning their investment of 50,000 each from Solo's rathtar smuggling operation, but attempted to apprehend Finn, Rey, and BB-8 when they realized the BB unit was the same one the First Order had been hunting down. Solo did not use his DL-44 during his escape from his heavy freighter, only using Chewbacca's bowcaster—for the first time—when the Wookiee was injured."}, {"tag": "p", "text": "The escape aboard the Millennium Falcon led Solo and the group to Takodana, where Solo sought to have the pirate Maz Kanata aid Rey and Finn in returning BB-8 to the Resistance. There, he gave Rey his secondary sidearm, the NN-14 blaster pistol. Kanata refused to undergo the task of aiding the pair, however, and told Solo he had been avoiding the conflict for too long. Soon after, the First Order located the group on Takodana and led an assault on Takodana Castle, forcing Solo to use his DL-44 blaster pistol against the attacking First Order stormtroopers. Solo, using his keen skills, gunned down numerous stormtroopers during the battle. However, having been impressed with Chewbacca's bowcaster previously, Solo borrowed the Wookiee's weapon again in the skirmish. Solo's blaster was temporarily taken by stormtroopers after they had seemingly won the battle, before the Resistance Starfighter Corps overwhelmed the First Order legions and allowed Solo to retrieve his heavy blaster."}, {"tag": "p", "text": "Solo used his blaster pistol for the last time on the First Order's Starkiller Base, a superweapon hosted on an ice-planet that dwarfed the Death Star of the Empire. Solo, from experience, believed that the superweapon could be destroyed and volunteered to aid Finn in taking down Starkiller's deflector shield, as well as rescuing Rey, who had been abducted on Takodana. After getting the Falcon through Starkiller Base's shields at lightspeed, Solo, Finn, and Chewbacca infiltrated the base and blasted their way through numerous stormtroopers. Solo used his DL-44 extensively throughout, up until the trio located Rey and made their way back to the Falcon. However, as the Resistance was suffering numerous casualties in the battle above, Solo realized he could not leave until the Starkiller Base thermal oscillator was severely crippled."}, {"tag": "p", "text": "After once again infiltrating Starkiller Base, Solo used his heavy blaster pistol to make his way to the superweapon's thermal oscillator. Once there, Solo and Chewbacca placed explosive charges throughout the structure of the oscillator, which were controlled by a remote detonator, and planned to escape. However, Solo's son, who had taken up the name of Kylo Ren, was nearby in search of Solo and his companions, seeking to apprehend them. When Solo saw Ren nearby, he holstered his weapon and approached his son, seeking to fulfill the promise he made to Organa while he had been on the D'Qar Resistance base of bringing their son home. However, Ren, seeking to fully commit himself to the dark side and the Supreme Leader of the First Order, Snoke, instead murdered his father by impaling him with his lightsaber. Solo died and fell into the depths of Starkiller Base with his DL-44 in tow. When the Resistance eventually succeeded in destroying Starkiller Base, the planet collapsed into itself and turned into a star, destroying everything that had been on the superweapon, including both Han Solo's remains and his trusted heavy blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Han's heavy blaster pistol first appeared in the 1977 Star Wars film Star Wars: Episode IV A New Hope. It subsequently appeared with Han Solo in each of his Star Wars film appearances, Star Wars: Episode V The Empire Strikes Back, Star Wars: Episode VI Return of the Jedi, and Star Wars: Episode VII The Force Awakens. Since the era of the Lucasfilm Story Group canon began in 2014, the blaster has also appeared in numerous publications that include Han Solo in comic books from Marvel Comics. It has also appeared in the novelizations of the Star Wars films it featured in, which include A New Hope: The Princess, the Scoundrel, and the Farm Boy, The Empire Strikes Back: So You Want to Be a Jedi?, Return of the Jedi: Beware the Power of the Dark Side!, Star Wars: The Force Awakens, and the Star Wars: The Force Awakens: A Junior Novel. Another novel, Smuggler's Run: A Han Solo & Chewbacca Adventure from the Journey to Star Wars: The Force Awakens series, also features the heavy blaster pistol."}, {"tag": "p", "text": "The weapon was also featured in the 2015 video game Star Wars Battlefront by EA DICE, in which Han Solo is a playable hero. In Battlefront, the heavy blaster features special abilities called \"Rapid Fire\" and \"Lucky Shot\" that allow the player to participate in both long and short ranged combat when using Solo's character. The reference books Ultimate Star Wars, Star Wars: Absolutely Everything You Need to Know, and Star Wars: The Force Awakens: The Visual Dictionary all feature detailed information on both Han Solo and his heavy blaster pistol. Ultimate Star Wars identifies the weapon as \"Han Solo's modified DL-44 heavy blaster pistol,\" meanwhile The Visual Dictionary, the most recent source to be released, identifies it as \"Han's heavy blaster pistol.\""}, {"tag": "p", "text": "When originally creating the blasters and weapons of Star Wars, creator George Lucas did not want to use the conventional concept of rayguns used in many science fiction films at the time. Lucas instead designed blasters based on real-world weapons, including many from the World War II era. Han's DL-44 was built by cannibalizing weapons together, including an antique Mauser pistol and a modified barrel from the MG 81 machine gun, and detailed with numerous random bits called \"greeblies\" to give the blaster a unique aesthetic. Roger Christian was one of the earliest crew members to assist Lucas in creating the weapons of Star Wars, such as Han's heavy blaster pistol."}, {"tag": "h3", "text": "\"Han shot first\""}, {"tag": "p", "text": "The expression \"Han shot first\" refers to the Mos Eisley Cantina scene between Han Solo and Greedo in Star Wars: Episode IV A New Hope, in which both characters take a shot at each other from their blasters, but Greedo misses and is killed by Solo. It is a frequently discussed topic among Star Wars fans in regards to who actually fired first, Solo or Greedo. The discussions came about after the release of the The Star Wars Trilogy Special Edition, in which numerous changes were made by George Lucas to the original trilogy of films, including the cantina scene. In the original release of the film, Solo preemptively fired his DL-44 blaster and killed Greedo before the Rodian, who had been holding Solo at gunpoint, could fire his weapon. Lucas has stated that the changes were made so that Solo would not appear to be a \"cold-blooded killer\" and to clear up confusion about who actually shot first. When asked about the subject, Harrison Ford, who portrayed Han Solo in the Star Wars films, stated, \"I don't know and I don't care.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}