{"url": "Han_Solo%27s_dice", "categories": ["Category:Canon articles", "Category:Artifacts"], "nodes": [{"tag": "h1", "text": "Han Solo's dice"}, {"tag": "p", "text": "Han Solo's dice were a pair of aurodium-plated gold dice owned by the smuggler Han Solo that he used to play the sabacc variant known as \"Corellian Spike\" with. While escaping his homeworld of Corellia in 13 BBY, Han gave the pair of dice to Qi'ra as a symbol of good luck, only for her to be captured by Moloch, taking the pair of dice with her. Three years later on the planet Kessel, Qi'ra gave the pair of dice back to Han during a mission to steal unrefined coaxium from the Kessel mines. During a game of Spike against Lando Calrissian, Solo won his opponent's YT-1300 light freighter, the Millennium Falcon, thanks to those dice. Solo kept the gaming devices, and the Wookiee Chewbacca hung them in the cockpit of the Millennium Falcon years before the Cyrkon Extraction as a joke, though Solo kept them up as a lucky charm."}, {"tag": "p", "text": "As a child, Han's son, Ben Solo, enjoyed playing with the dice while always following his father, promising anyone that listened that one day he would become a pilot like his father."}, {"tag": "p", "text": "Decades later, Jedi Master Luke Skywalker examined the dice when the Falcon arrived on Ahch-To. During the Battle of Crait, Skywalker Force projected himself and the dice to appear on Crait and gave them to his sister, Leia Organa. Later, Ben found the Force projection of the dice, which then disappeared. Later during the war between the First Order and the Resistance, replicas of the dice were sold at Dok-Ondar's Den of Antiquities in Black Spire Outpost on the planet Batuu."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Han Solo's dice first appeared on the Millennium Falcon in Star Wars: Episode IV A New Hope. The props were recreated for Star Wars: Episode VII The Force Awakens, but do not appear in the finished version of the film. In these films, the dice looked much like regular six-sided dice, where the sides are numbered with dots. However, for their first close-up appearance in Star Wars: Episode VIII The Last Jedi, their design was changed to use other symbols instead. The design from The Last Jedi was also used in Solo: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}