{"url": "Han_Solo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:We're Doomed!", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Articles with elements from unlicensed sources", "Category:Articles to be expanded", "Category:Alliance Army generals", "Category:Bright Tree tribe honorary members", "Category:Corellian Defense Force officers", "Category:Corellians", "Category:Coruscanti", "Category:Desilijic servants", "Category:Endor strike team personnel", "Category:Galactic Alliance individuals", "Category:Gamblers", "Category:House of Solo", "Category:Humans", "Category:Imperial defectors", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Impersonators", "Category:Jedi Coalition personnel", "Category:Males", "Category:Mechanics", "Category:Nar Shaddaa residents", "Category:New Republic Defense Force admirals and generals", "Category:Pirates", "Category:Privateers", "Category:Renegade Squadron personnel", "Category:Skywalker family", "Category:Smugglers", "Category:Space explorers", "Category:Star-Hoppers of Aduba-3", "Category:Swoop racers", "Category:Tansarii Point Station residents"], "nodes": [{"tag": "h1", "text": "Han Solo"}, {"tag": "p", "text": "Han Solo was a male Human smuggler from the planet Corellia who achieved galactic fame as a member of the Rebel Alliance and later the New Republic. Born on Corellia, he was orphaned at an early age and taken by the pirate Garris Shrike to serve on his crew. He was treated cruelly, and served Shrike for many years before escaping while in his teens. Solo became a smuggler, and fell in love with Bria Tharen, though she left him due to her duties to the Rebel Alliance. Solo then entered the Imperial Academy at Carida, serving with distinction. He was kicked out, however, when he stopped an Imperial officer from beating a Wookiee named Chewbacca with a neuronic whip for resisting capture. In gratitude, the Wookiee swore a life debt to Solo, protecting him with his life and a bond of friendship formed between the two that was unbreakable. Solo became a smuggler once again, with Chewbacca at his side. Piloting the upgraded and customized the Millennium Falcon, which he won in a game of Sabacc against Lando Calrissian, his future ally, he became known as one of the best smugglers in the galaxy."}, {"tag": "p", "text": "On the run from Imperial officials, Solo became caught up with the Rebel Alliance, courtesy of Obi-Wan Kenobi, Luke Skywalker, and Princess Leia Organa, whom he helped rescue from the Death Star. Solo helped Skywalker destroy the Death Star when it attacked the Rebel base at Yavin 4, where they had taken Organa. Solo became an unofficial member of the Rebel Alliance, and fell in love with Organa. He officially joined the Alliance in 4 ABY and was immediately commissioned as a general. He led the strike team that helped destroy the Second Death Star at the Battle of Endor, in which Emperor Palpatine was killed. A year later, the New Republic was founded."}, {"tag": "p", "text": "Solo married Organa in 8 ABY, and the two had three children: Jaina, Jacen, and Anakin. As the New Republic was threatened by many enemies in its first years of existence, Solo was always on the move, sometimes traveling with Skywalker, who was Organa's brother. Along with his wife and faithful Wookiee friend, Solo fought against Warlord Zsinj, Grand Admiral Thrawn, the reborn Emperor Palpatine, Admiral Daala and the Yevetha. In 25 ABY the New Republic was attacked by the Yuuzhan Vong. The war that followed lasted four years and was extremely bloody. Solo's closest friend Chewbacca and his son Anakin Solo both died during the war, deaths that haunted the ex-smuggler. The Vong were eventually defeated and the New Republic was reformed into the Galactic Alliance. In 40 ABY, his son Jacen turned to the dark side of the Force, and took control of the Galactic Alliance. Solo and his wife joined the rebel faction opposing Darth Caedus, and the two were prepared to kill him, as they no longer saw him as their son. At the end of the war, Solo was still having tense relations with the GA government."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "h4", "text": "Childhood"}, {"tag": "p", "text": "There were many rumors and speculation as to what happened to Han Solo in his earlier years. He was the subject of several holofilms, documentaries and at least two supposed \"autobiographies\" whose true authorship was questionable. For example, one contested account said that Solo was raised by Wookiees from age seven to twelve after his parents left him."}, {"tag": "p", "text": "In reality, Han Solo was orphaned at an early age, and his earliest memories were of being found in a Corellian spaceport by Garris Shrike with no clear memory of his life beforehand. Shrike took Solo in as a member of his band of vagabonds, training and using him in his underhanded enterprises. First, Han was sent out as a beggar, using his young appearance to get handouts. When he was older, Han learned how to pickpocket by first practicing on a droid of Shrike's, and then being sent out into the streets. During this time, Solo was befriended by Dewlanna, a Wookiee who was serving as a cook aboard Trader's Luck, Shrike's ship. Dewlanna raised Solo as her own son, teaching him Shyriiwook and taking care of him when he became ill. Han would go on to participate in numerous scams and illegal activities under Shrike's direction, including participating in an asteroid mining scam and swoop racing."}, {"tag": "p", "text": "Though Solo wanted to learn more about his family, especially his parents, Shrike kept all that information from him in order to better keep him under his control. For years, he did not even know his family name. At one point, soon after learning from Dewlanna that he was part of the famous Solo line, he ran away from Shrike on Corellia. There, he tracked down his long lost aunt Tiion Solo and his cousin, Thrackan Sal-Solo. The reunion with his family went badly, however—his aunt was a housebound madwoman while his cousin was a sadistic bully who eventually sold him out to Shrike. Han did not learn about his parents, Jonash and Jaina Solo, until he reached adulthood. Solo hid the fact that he was descended from Berethron e Solo, a king of Corellia who introduced democracy to the system."}, {"tag": "h4", "text": "Adventures with Shrike"}, {"tag": "p", "text": "Han Solo visited many planets on the behest of Shrike. During a mission on Corellia, Han befriended the half-breed Bey, an individual he would later encounter during the Nagai Invasion, shortly after the Battle of Endor. There are also scattered reports that claim Han Solo was present on Kashyyyk during the battle there, near the tail-end of the Clone Wars. Similar reports have been made about a brief run-in with bounty hunters searching for an escaped Jedi on the planet Socorro."}, {"tag": "p", "text": "Solo's education was spotty, like those of the other children Shrike used as beggars and thieves. Though most of the children received only an elementary education from the ship's computer on Trader's Luck, he managed with Dewlanna's help to pick up some knowledge of mathematics, physics, and history by reading in his spare time. Intermittently, he would attend school while going undercover as part of a \"respectable family\" while Shrike was running a complicated con. At one point, Solo briefly attended a school where Garm Bel Iblis gave a speech. Afterward, he asked the Senator two insightful questions, which impressed Bel Iblis. Years later, during the Thrawn campaign (9 ABY), the senator would still recall meeting Solo."}, {"tag": "p", "text": "Solo earned his keep for Shrike doing a variety of unsavory jobs. He once joined a pirate group operated by cutthroats Lemo and Sanda. He made a name for himself racing repulsorlift swoops professionally and on the independent circuit. In these days, Solo made an enemy out of a Corellian swoop jockey named Dengar. During one highly publicized race through the crystal swamps of Agrilat, Solo caused Dengar to crash headfirst into a crystalline plant, severely crippling the other racer. Dengar, who would hold a grudge against Solo for the rest of his life, would later become a bounty hunter contracted to find him."}, {"tag": "p", "text": "In 12 BBY, Solo was sentenced to fight in the Regional Sector Number Four's All-Human Free-For-All on the penal-colony world of Jubilar for cheating at cards, a felony there. Matched against three other human fighters much larger than himself, Solo somehow managed to defeat the other gladiators in unarmed combat, suffering numerous broken bones. Just prior to the onset of the fight, Solo caught a glimpse of a mysterious figure wearing Mandalorian armor, his first encounter, albeit indirect, with the notorious Boba Fett."}, {"tag": "p", "text": "In 10 BBY, Solo was ready to leave Trader's Luck in order to start his own career. He made plans to stowaway aboard Ylesian Dream, an automated freighter, and go to Ylesia, where he would apply for a job opening advertised by the Ylesian high priests. When Solo was about to leave, Shrike and a few of his cohorts caught him as he was saying goodbye to Dewlanna. The armed men tried to stop Solo, but Dewlanna sacrificed herself so that Solo could escape. Solo promised to himself that, if ever he had the chance, he would help one of Dewlanna's people to repay his debt to her."}, {"tag": "h3", "text": "Pre-military career"}, {"tag": "p", "text": "Solo stowed away aboard Ylesian Dream and after a difficult flight, he arrived on Ylesia. He applied for the piloting job under the alias Vykk Draygo; he was to pilot the Ylesian Dream—being a drone ship, it had been falling victim to pirate attacks. A Togorian by the name of Muuurgh was assigned to be Solo's 'bodyguard', and, despite some initial tension due to the nature of the relationship, Solo and Muuurgh became fast friends. Solo also developed a relationship with one of the pilgrims who had come to Ylesia seeking religious sanctuary—a Human woman by the name of Bria Tharen. Solo remained in the High Priests' employ for a time, but after discovering the true nature of the operation—a complete scam designed to lure Pilgrims into becoming slaves—he fled the planet with Tharen, Muuurgh, and Mrrov, Muuurgh's wife-to-be. Also key in his flight was that Bria, who had also learned the truth about the Ylesian fraud, was to be married to Ganar Tos. In the process, Solo and Tharen stole a small cache of treasures from the High Priest Toroenza's treasure room and indirectly killed Zavval, the Hutt administrator of Ylesia. This would come back to haunt him later in his life as many bounty hunters would be after him due to the bounty placed on his head by Zavval's relatives."}, {"tag": "p", "text": "Solo and Tharen eventually made their way to Coruscant so that Solo could fulfill his dream of becoming a pilot in the Imperial Navy. There, Han received a referral from Tharen's father, Renn, to the Imperial Academy, qualifying him for the entrance examinations without a credential from a Sector Naval Academy. Han also had his identity completely changed, including new retinal patterns by Nici the Specialist. They remained together for a short time, but in the end Tharen left Solo without warning because she felt that she was holding him back. She felt that her struggles with the addictive \"Exultation\" of the Ylesian t'landa Til would hinder Han's career."}, {"tag": "p", "text": "Solo took the entrance exams for the Imperial Academy on Coruscant, doing poorly on the cultural portions and advanced mathematics, but excelling in technical knowledge and the piloting tests. During the test, Solo flew through the Arch of Triumph rather than taking the parade route above it, thus earning the fastest time for an assigned flight run. Despite his unorthodox conduct, Solo was accepted into the Academy and assigned to a two-year program of flight instruction on Carida."}, {"tag": "p", "text": "Just after he was accepted into the Academy of Carida, Solo was attacked by Garris Shrike, who was one of the few people who knew that 'Vyyk Draygo' and Han Solo were the same person. Han was certain to have been doomed to Hutt retribution, but another bounty hunter killed Shrike and Han was able to kill that hunter. The next day he shipped out to Carida."}, {"tag": "h3", "text": "Service in the Imperial Starfleet"}, {"tag": "p", "text": "Solo was crushed at Bria Tharen's departure, but he followed his dreams (and Tharen's wishes) and went to study at the Academy of Carida. There he would hone his skills as a pilot. Among his fellow students were future TIE Fighter ace Soontir Fel and Solo's friend Mako Spince. At flight school, Solo's record was mixed: he earned excellent piloting marks, but his academic record was poor and he earned a number of demerits and conduct reports. His flight instructor, Alexsandr Badure, approved of him, filing a report praising Solo's abilities when he managed to land a malfunctioning U-33 orbital loadlifter by executing a number of difficult flight maneuvers, saving the lives of numerous cadets and Academy Dean Horace Wyrmyr. Student Advisor Lucinta Cal-Meg noted Solo's innate intelligence and that he worked hard to improve his academic performance. However, many also had deep reservations about Solo's judgement, conduct, and suitability for military service, as well as his friends at the Academy. In Solo's second year, he was investigated for his role in Mako Spince's prank that destroyed Carida's Mascot Moon with a gram of stolen antimatter, though Cadet Tedris Bjalin's testimony cleared Solo of any involvement."}, {"tag": "p", "text": "Solo graduated at the top of his class with the rank of lieutenant. However, his hard-earned military career was short lived. In 5 BBY, he was dispatched to aid Commander Nyklas in duties including slaving and construction work. In this capacity, Han boarded a derelict slaving craft to find that its cargo of Wookiee children had escaped and that a badly wounded Wookiee was in the pilot's seat. Nyklas ordered Han to skin the helpless Chewbacca, but Han refused and Nyklas swore to punish the Corellian. Shortly afterward, Han and Chewbacca were put to work on the construction of a new wing of the Imperial Hall of Heroes on Coruscant by Wookiee slaves. An enraged Chewbacca turned on Nyklas, who drew his blaster on the Wookiee. Solo refused to let Chewbacca die; he stunned his commanding officer and helped Chewbacca escape, with the assistance of the Rebel Alliance. Court-martialed and dishonorably discharged, Solo returned to smuggling with Chewbacca (who had sworn a life debt to the Corellian) at his side."}, {"tag": "p", "text": "Solo later reflected that even without Chewbacca he probably would have left Imperial service anyway, due to the ridiculous regulations, incompetent officers and widespread anti-alien prejudice. He later became wanted for treason, with a bounty issued to his head by the Empire."}, {"tag": "p", "text": "Solo earned both classes of the Corellian Bloodstripe at some point during his military career, though the reasons for his first-class stripe are unknown. All that is known is that the events through which he earned them took place over several days. Because they were non-Imperial awards, they were the sole decorations that were not stripped from his uniform after his court-martial. Alexsandr Badure did later inform an interviewer that Solo's second-class bloodstripes came from an incident dealing with a Wookiee."}, {"tag": "h3", "text": "Smuggling career"}, {"tag": "p", "text": "Initially, Han was not happy to have the big Wookiee around. He had saved Chewbacca out of remembrance of Dewlanna, but it had cost him his life's dreams. Han spent much time drinking and playing sabacc, until he was accused of cheating by an irritated Barabel named Shallamar. He probably would have been seriously injured if Chewbacca had not stepped in. After that, Han and Chewbacca grew much closer."}, {"tag": "p", "text": "Solo's friend Mako Spince, who had been expelled from the Academy two years before graduation, helped Solo and Chewbacca get started as smugglers. Using Nar Shaddaa as their home base, the three of them enjoyed considerable success. Solo and Chewbacca also frequently worked for the Hutt Lords Jiliac and Jabba. They piloted many of their ships, including both Hutts' personal yachts. Solo also befriended Lando Calrissian, a gambler who saved him from the notorious bounty hunter Boba Fett, and Jarik \"Solo\", a street urchin who claimed to be a long-lost relative. Han knew that Jarik's claim was a lie, but he took the youth under his wing anyway. He also became romantically involved with the magician Xaverri and later fellow smuggler Salla Zend. During his time with Xaverri, Han became her stage assistant, and performed across the galaxies in her shows. He also served in the other part of her work—schemes designed to hurt the Empire and Imperial officials. At one point, Han even taught Lando how to fly in a ship that would be the center of much of Han's life-the Millennium Falcon. Han had been entranced by the ship from the moment he first saw it and he wanted it more than anything else. During that test run, his dangerous flying scared Calrissian. After that, he decided that Calrissian did not deserve a ship of that quality and contemplated having the Hutts buy it for him or even stealing it for himself."}, {"tag": "p", "text": "Han also bought his own ship, the Bria, from Lando, and restored it to spaceworthy condition with the help of Shug Ninx. Having the Bria only made him want the Millennium Falcon even more. When the Empire sent a fleet to raze the Smuggler's Moon, Han and his friends rallied a force of smugglers and pirates to victory in the Battle of Nar Shaddaa. Shortly after the battle, as Han was paying the Imperial admiral that the Hutts had agreed to bribe in exchange for his battle plans, the Bria was destroyed by Imperial fighters. Han and Chewbacca worked again with Mako, until he was crippled during a smuggling run in the Ottega system. Solo and Chewbacca continued their career on their own."}, {"tag": "p", "text": "Short on cash, Han pawned his last stolen treasure from Toroenza's cache and entered the Cloud City Sabacc Tournament. Against all odds he reached the tournament finals and beat his friend Lando, winning the Millennium Falcon with his earnings. For a time afterward Han Solo and Chewbacca worked in the Corporate Sector, the Tion Hegemony, and other remote but potentially lucrative sectors of the galaxy. Part of Solo's motivation for these travels was a desire to get away from Salla Zend and her wedding plans, as he was not ready for such a commitment. Solo would later boast that he had been \"from one side of the galaxy to the other.\""}, {"tag": "p", "text": "Han and Chewbacca then met up with another of his former classmates from the academy, Jahan Cross, a Imperial Intelligence agent posing as a Imperial Diplo-serv Envoy on Etti IV. There they fought against some old \"friends\" of Han that lost a game of Sabacc to him. They were able to fight them off till the local security came and stopped the fight. Han and Chewbacca were then employed and given diplomatic immunity by Cross. Han then asked Cross what it would cost, with Cross telling him it will be at some point. When Cross was framed for the murder of Dah'lis Stark, Solo hid Stark in the secret compartments of the Falcon. Solo denied to Sergeant Myrsk that he had not seen Cross since the fight. Han was then punched by Myrsk, and then Chewbacca attacked him but Han was able to calm him down. Myrsk was then forced to apologize to Han or Chewbacca would hurt him. After Myrsk and his corporal left, Solo then told Cross to leave. Cross then asked Han for a blaster, a change of clothes, and to be taken to unfinished spa called Eclipse. Han at first refused, but Cross promised to pay him. After Cross discovered suspicious activity on Eclipse, he hired Solo to fly him and Ellie Stark to the satellite. Upon reaching Reltooine, the Falcon was attacked by modified Vulture-class starfighter. Solo dropped off Stark and Cross, and flew off being chased by the starfighters. Solo managed to destroy the pursuing starfighters, and returned to pick up Cross and Stark from the falling space station. Solo transported Cross and Stark back to Etti IV and told Chewbacca how he was going spend the credits he had earned on a new gambling system to cheat at Sabacc"}, {"tag": "p", "text": "While in the Corporate Sector, the Falcon was damaged after Solo and Chewbacca attempted smuggling weapons to insurgents on Duroon. However, they did collect payment from the insurgents and went to pay off Ploovo Two-For-One, but in a rather creative manner. Given the prickly relationship and even outright disgust they had for each other, Han bought a foul, irritable, putrid dinko, attached the payment to it, and unleashed on the unfortunate employer. Although Corporate Sector Security arrived at the establishment where they were, Han and Chewbacca escaped their grasp relatively unscathed. Payment completed, they went off to find the outlaw tech \"Doc\" Vandangante's hideout, only to discover he had been taken to the Corporate Sector Authority prison at Stars' End. Doc's daughter Jessa offered upgrades and repairs to his ship, and a Corporate Sector waiver, in exchange for Han helping rescue Doc and other prisoners. Before he could take off, the outlaw techs were attacked by IRD-A Fighters. Piloting a Z-95 Headhunter, Han led the other techs and Jessa in defense of the base. Despite heavy losses, they were successful. To complete their rescue mission for Jessa, Solo and Chewbacca were given two droids, Bollux and Blue Max, and went to the agriworld Orron III to meet up with a group led by Rekkon planning the prison rescue. Though Solo was initially only interested in getting the repairs for his ship, his motives became personal when Chewbacca was captured. After dealing with a traitor in the group, Solo and the others arrived at Stars' End. In order to gain entry, Han, Atuarre, Pakka, Bollux and Blue Max posed as a troupe of entertainers. The rescue proved successful; freeing Chewbacca, Doc, and the other prisoners and destroying the Stars' End in the process. After the Falcon was repaired, Solo and Chewbacca left the Corporate Sector for a time, taking Bollux and Blue Max with them."}, {"tag": "p", "text": "After a disastrous incident on Kamar, where Solo and Chewbacca accidentally began a religion (the Cult of Varn) before having to flee with their lives, they returned to the Corporate Sector. There, they were contracted to transport cargo from Lur. When they discovered the cargo was a group of Lurrian slaves, Solo freed the slaves and killed the slaver Zlarb. Since they had not been paid for their cargo run, Solo and Chewbacca decided to track down Zlarb's partner on Bonadan and get the promised ten thousand credits as revenge. While on Bonadan, Han was jumped and nearly overcome by a mysterious figure and Chewbacca encountered a skip tracer, Spray, trying to possess their ship for debts and regulation compliance. However, Han and Chewbacca became mixed up with a CSA Auditor, Hart-and-Parn Gorra-Fiolla, who was investigating the slavers also. Han went to meet an associate of hers, Magg, but he betrayed them. Forced to flee on a swoop bike, they made it off planet after a harrowing encounter and planned to meet up with Chewbacca on Ammuud. Chewbacca was also forced to make a somewhat hurried escape. While Han and Fiolla were on the transport that was taking them to meet Chewbacca, they were attacked by pirates, who were looking for them. They escaped in one of the pirate's craft and landed at the nearby estates of the Mor Glayyd. Han and Chewbacca were eventually reunited after Han saved the Mor Glayyd from a duel which would have gotten him killed. The Glayyd estate provided Han with a way to get back to the Falcon and Chewbacca. As Han was leaving the planet, he was pursued by the pirates/slavers. However, at that point a CSA Victory-class Star Destroyer intervened and tractor beamed both ships. Though they helped her break up the gang, they barely escaped being arrested by another CSA executive, Odumin, who had really been the tracer Spray, and earned the enmity of a hired gun named Gallandro. They did, however, manage to steal the money Solo felt the CSA owed them."}, {"tag": "p", "text": "Giving up on the Corporate Sector, the Falcon's crew attempted clothes legging in the Cron Drift and a currency exchange scam in the Lesser Plooriod Cluster before finding themselves short on cash and stuck in the Tion Hegemony. After several misadventures, they joined with Solo's old friend Badure, a young woman named Hasti, and a Ruurian historian named S. V. Skynx on a hunt for Xim the Despot's long-lost treasure ship, Queen of Ranroon. On Dellalt, they finally discovered the treasure vaults. After run-ins with the \"Survivors\" (the descendants of Xim's soldiers) and their ancient War-Robots, Solo finally discovered the vaults. Though Gallandro followed him to the vaults and challenged the smuggler to a duel, the automatic defense systems killed the gunfighter. Solo and his associates then recovered the treasure—unfortunately for them, after all those years it had become outdated war matériel. The two droids stayed with Skynx when Solo and Chewbacca left the Tion Hegemony."}, {"tag": "p", "text": "Shortly after this, Han and Chewie were arrested by the Empire, the Millennium Falcon was impounded, and the two smugglers were put in solitary confinement on the Imperial prison barge Purge. When the crew of the Purge fell victim to a horrific bioweapon created by the Empire, Han and Chewie were let out of their cells by Zahara Cody, the ship's doctor, in a bid for freedom from the virus. Han and Chewbacca managed to help Cody and a few others escape from the virus, then regained the Falcon and resumed their smuggling career."}, {"tag": "p", "text": "At some point between 2 BBY and 0 BBY, Han Solo ended up getting into a run-in with several Stormtroopers on the Star Tours space station. He then exchanged fire with them before escaping onboard the Millennium Falcon, also aiding a StarSpeeder 1000 carrying a Rebel agent in escaping as well. Solo's actions also resulted in a Star Destroyer suffering severe damage."}, {"tag": "p", "text": "In 1 BBY, Solo was caught by Aleena gangster Sollima on the Outer Rim world of Simbarc with a debt he could not return. In exchange for the debt the gangster asked Solo to perform a dangerous mission for him. Sollima's accounting droid was being held by the Galactic Empire, who planned to use the information inside the droid's data core to gain control over Sollima's casino world, the Hollow Moon. Since the Aleena was keeping Chewbacca as a hostage, Solo had no choice but to agree. Solo's old friend, Billal Batross, with whom they grew up together on Trader's Luck, joined him on the mission, as Batross also owed Sollima money he could not return."}, {"tag": "p", "text": "Together, Solo and Batross infiltrated the Imperial garrison on Moog Mot VI and retrieved the droid, but Batross destroyed the droid with a blaster shot. He revealed that he was stealing money from Sollima accounts, and the droid discovered this, so Batross covered his tracks by selling the droid to the Empire. Shortly afterward, both partners were captured by Imperial forces and interrogated. They were informed that if they double-crossed Sollima, Captain Taavin would release them. Having no other choice but to agree, the accomplices returned the remains of the droid to the crime lord. Since Sollima needed the droid back intact, the Aleena ordered his bodyguards to shoot the scoundrels, but Batross managed to detonate a bomb hidden inside the droid's head. In the ensuing chaos, Solo used the security key provided by Taavin to override the Hollow Moon's defense system, allowing the Imperial Fleet safe passage in. Together, Batross, Solo and Chewbacca left the Hollow Moon in the Millennium Falcon. After their successful escape, Batross believed that he would become the third member of the team formed by Solo and Chewbacca, but they were tired of Batross getting them into trouble, and left him on Arbra amongst the Hoojibs."}, {"tag": "p", "text": "During this period, Solo and Chewbacca worked for Jabba the Hutt on occasion. They also had several run-ins with the Rebel Alliance. Senators Mon Mothma and Leia Organa became aware of Solo when he began to lead efforts to free Wookiee slaves from Kashyyyk, as a favor to Chewbacca, who had begun to lose friends and family members to the slaving effort. Solo reluctantly allowed the Alliance to help him in this effort, despite his disdain for political causes, and the Alliance soon became one of his frequent employers."}, {"tag": "p", "text": "After being saved from an Imperial fleet over Corellia, Han and Chewie helped plant an EMP charge on a shipment that was delivered to an Imperial facility over Corulag and helped steal Mon Calamari cruiser schematics on Carida. This last mission almost got them killed, and afterward Han swore off involvement with the Alliance and swore to keep his distance from the Galactic Civil War, until he was thrust into the center of galactic politics again after events on Tatooine."}, {"tag": "p", "text": "At some point in his smuggling career, he partnered with Katya M'Buele as part of a Corellian rim-runner's crew. They were the only survivors among the crew when a smuggling operation on Skye was discovered by the planet's Imperial-assigned Majestrix, Kharys. Until they met again in 2 ABY, Solo stayed away from Skye, fearing Kharys would come after him."}, {"tag": "p", "text": "Solo's heaviest involvement with the fledgling Rebel Alliance occurred when he and other smugglers, including Lando Calrissian and Jarik Solo aided Bria Tharen's Red Hand Squadron in raiding the Ylesian colonies and putting them out of business—a plan endorsed, aided, and supported by Jabba, a business rival of Ylesia. In the subsequent battle, the Alliance forces were victorious, but several smugglers, including Jarik Solo, were killed. Han and his smuggler friends were double-crossed by Tharen who seized all the spice and treasures that were to be the smugglers' reward for the Alliance."}, {"tag": "p", "text": "Soon afterward, he met with Tharen again during a Hutt-sponsored treasure hunt for the Yavin Vassilika. Once again, Tharen took the prize for the Rebellion, while Solo and his smuggling associates were left with nothing. Solo and Tharen left on poor terms on both occasions, since Solo refused to give up his independent ways and join Tharen in the Alliance. However, most of his fellow smugglers assumed that he had been working with Tharen from the beginning. Even one of his closest friends, Lando Calrissian, said that he never wanted to see him again."}, {"tag": "h3", "text": "Early Galactic Civil War"}, {"tag": "h4", "text": "Working for Jabba"}, {"tag": "p", "text": "Han continued to work for Jabba the Hutt as a smuggler, but once, while smuggling glitterstim, Han was boarded by an Imperial patrol and had to dump his load of spice–spice he couldn't recover. Still, as small consolation, Han and Chewbacca made the Kessel Run in less than twelve parsecs after an attempt to recover the dumped spice turned nasty. As a warning, Jabba hired Greedo, a novice bounty hunter, to let Solo know that he was serious about getting paid. However, the Hutt lord was not renowned for patience, and none of Solo's smuggler friends would help him. Solo was also dealt another personal blow at this time, when Boba Fett broke the news of Bria Tharen's death, at the Battle of Toprawa, to Solo."}, {"tag": "p", "text": "In an attempt to find the funds to pay off Jabba, Han and Chewbacca were hired to transport an imprisoned crime lord, Tyber Zann off the prison world of Kessel. Though the deal did not transpire exactly as planned, much to Solo's annoyance, the duo transported Zann and his associate Urai Fen as agreed, though only after an increased fee."}, {"tag": "p", "text": "Since Han Solo still had not paid Jabba the Hutt, the crime lord sent Greedo to collect the money from Solo, dead or alive. When Greedo found Solo in the Mos Eisley Cantina on Tatooine the next day, it became clear that he intended to kill Solo rather than give him a chance to pay Jabba. Han shot Greedo under the table, then paid the bartender for 'the mess', as he put it. Later, Solo found Jabba and a band of his thugs, including Boba Fett, in Docking Bay 94, where the Millennium Falcon was docked. Solo managed to convince Jabba to give him more time, promising to repay him what he owed plus fifteen percent after being paid for a routine charter flight he and Chewbacca had recently arranged in the cantina, with an old man, a young farmboy and two droids, named R2-D2 and C-3PO."}, {"tag": "h4", "text": "Mercenary turned Rebel"}, {"tag": "p", "text": "The passengers, of course, were Obi-Wan Kenobi and Luke Skywalker, who meant to escort the droids C-3PO and R2-D2 from Tatooine to Alderaan on behalf of the Rebel Alliance. When they arrived in the Alderaan system, the crew and passengers of the Millennium Falcon found that the planet had been destroyed by the Death Star. After they were dragged on board by the Death Star's tractor beams, Skywalker convinced Solo and Chewbacca to help him rescue Princess Leia Organa by promising \"more wealth than you can imagine.\" Han helped Luke infiltrate the massive station in stolen stormtrooper armor and after several misadventures, they managed to rescue the Princess and escape, at the cost of Obi-Wan's life, taken by his former apprentice, Darth Vader during their duel aboard the Death Star."}, {"tag": "p", "text": "Afterward, Solo took Leia, Skywalker, and the droids to Yavin 4 to collect his reward. Though he was initially willing to abandon the Rebels and make off with his fee, an attack of conscience, (brought on partly by Chewbacca's arguments) led him to join the Battle of Yavin at the last moment. The Millennium Falcon joined in just in time for Solo to destroy Black 3, which caused Black 2 to collide with and disable Darth Vader's TIE advanced. This allowed Skywalker to destroy the Death Star, scoring a major victory for the Alliance and recognition for Solo. As a result of this battle, as well as his earlier involvement in rescuing Organa, Solo and Chewbacca had a bounty placed on their heads: Specifically, 300,000 alive, due to their crimes of the liberation of a known criminal, direct involvement in armed revolt against the Empire, high treason, espionage, conspiracy, and the destruction of Imperial property."}, {"tag": "h4", "text": "Hero of the Alliance"}, {"tag": "p", "text": "Solo and Skywalker were both awarded medals of honor for their efforts, and Solo was handsomely rewarded with 20,000 Alliance Credits and a stash of valuables. The day after the Battle of Yavin, he shot down an Imperial cruiser that was searching for the Death Star, much to the chagrin of his superiors. The chests of treasure the Rebels had given him were stolen from him almost immediately after leaving Yavin by the space pirate Crimson Jack (who, ironically, had ties to the Hutt crime lord), leaving Solo still unable to pay off Jabba. With the help of Luke Skywalker and Princess Leia, Solo managed to defeat the pirate. Following the debacle, Solo gave the recovered money back to the Alliance."}, {"tag": "p", "text": "Broke and fearing Jabba's retribution, Solo and Chewbacca discovered an ancient cache of treasure hidden in one of Yavin 4's temples. He took the treasure to an Ithorian named Sprool on Dennogra, who in turn delivered the money to Jabba. It was, however, too little and too late. Jabba kept the money and refused to call off the bounty. Han Solo was still a hunted man with a price on his head. He, however, used money earned from selling more of the treasure to purchase new T-65 X-Wings for the Rebellion."}, {"tag": "p", "text": "After the destruction of Alderaan Han still wanted to leave the Rebellion but for now he traveled with Chewbacca, Luke, Leia and the droids to Muunilinst. On the planet Leia was supposed to meet Mak Luunim who had the codes for some secret accounts of the Rebellion. When they flew with the Millennium Falcon a TIE fighter attacked them and an unknown pilot came to their aid. Afterwards the pilot crashed on a moon and Han and the others searched for him although they were still on their mission. On the moon they were attacked by a reek as soon as they found the pilot who said that his name had been Tobin Elad. On seeing the reek Han had shot with his blaster so  they were surrounded in a cave and only Luke could disburden them. Then the group traveled to Muunilinst where they discovered that Mak Luunim was dead and Nal Kenuun had the codes of the Rebellion. Therefore Luke had to win a podrace to get the codes back. While he and Leia made a plan, Han and Tobin Elad were involved into an affray with some other racers. Later Luke won the race but Kenuun now wanted to get the head money of Han and Tobin. Leia then threatened to hurt the krayt dragon Urgiluu if Kenuun would not let her companions go. For this reason Kenuun exchanged the safety of the krayt dragon for the liberty of the group."}, {"tag": "p", "text": "At some point, Han Solo also arrived on Phelarion to rescue Leia (who had crash landed after a scouting mission gone awry), as well as two servants Sparv and Bikum Calus, the latter two being former acquaintances of Solo and planned to steal the megonite moss for a profit."}, {"tag": "p", "text": "Later, Han and Chewbacca were hired by Ramiz, a moisture farmer on Aduba-3, to protect his village from a band of local thugs known as the Cloud-Riders led by Serji-X Arrogantus. To help with this task, Han and Chewbacca hired six misfit spacers, including Don-Wan Kihotay, a Human who believed himself to be a Jedi Knight, Jaxxon, a Lepi with a mean disposition, and Jimm Doshun and his droid FE-9Q. Han, Chewbacca and the Star-Hoppers of Aduba-3 arrived at Ramiz's village, Onacra, only to find it under attack by high-hounds. They managed to drive away the beasts, saving the life of a young girl named Merri to the great relief of her father Oncho, the village spokesman. But their relief was short-lived once Serji-X Arrogantus and his gang attacked. Han and the Star-Hoppers did their best to defend the village but it was to no avail as FE-9Q was killed and Merri's grandfather, the Old One, dismissed the hired spacers' help. Instead of relying on Han and his team, the shaman summoned a large, mythical reptilian monster called the Behemoth from the World Below to handle the invading Cloud-Riders. Many members of the Star-Hoppers died trying to destroy the creature. Using Kihotay's lightsaber, Han managed to kill the deadly beast once and for all.\nHan Solo and Chewbacca left Aduba-3 soon after, in the Millennium Falcon, only to be captured once again by Crimson Jack and his gang of pirates. Princess Leia Organa had also been captured by the pirate while on her way to the Drexel system to find out what happened to Luke, and Jack intended to hold the Princess for ransom. But Han and Leia secretly devised a plan to trick the pirates into taking them to the Drexel system by claiming that the Rebels have stockpiled a treasure there. Accepting Solo's claim, Jack went to Drexel where the met up with Luke and encountered Quarg, the Governor of Drexel, and the Dragon Lords. Han managed to escape on the Falcon, only to crash it near Quarg's ship. Teaming up with the Dragon Lords, Han and Luke managed to save Leia, the droids, and Chewbacca. Han then faced off against Jack in space where he shot the pirate, killing him."}, {"tag": "p", "text": "After a misadventure on the massive gambling complex known as the Wheel, Solo hid out for repairs on Orleon and was soon besieged by an emissary of Jabba the Hutt. Within a week, Solo had rescued the emissary from stone mites and, by some miracle, had the bounty taken off his head. He returned to Tatooine, and started to heal his relationship with the Hutt. He made Kessel Runs for the crime lord, even beating BoShek's most recent record-breaking time. Sadly, this was not to last. The remains of Crimson Jack's Star Destroyer were discovered by the Hutt's agents, and within days the bounty was back on Solo's head. An even higher reward was registered for anyone who would capture him alive so Jabba could kill Solo himself."}, {"tag": "p", "text": "While evading Jabba's organization, Solo and Chewbacca continued to work with the Rebel Alliance for the next three years. Solo became a good friend of Luke Skywalker, and developed a love-hate relationship with Princess Leia, cementing friendships after close encounters with bounty hunters."}, {"tag": "p", "text": "Around this time, Han sent Col Serra to create a new unit. It would remain secret for many years."}, {"tag": "p", "text": "Days before the Evacuation of Yavin, during negotiations with the Aquaris Freeholders, Han was \"accused\" of being an Imperial spy by Leia Organa. In truth, the accusation was just a ploy to draw out the real spy, Aquaris Freeholders deputy commander Kraaken, in their midst. In addition, shortly after the discovery of the development of the Super Star Destroyer Executor by Luke Skywalker during a reconnaissance mission at Fondor, Leia had him recover a power gem. Although he personally doubted the gem's existence, he took the job when he realized that the alternative was allowing Leia to send Luke to find the gem when he returned from his mission, as Luke was \"not familiar with the Underworld.\" He initially tried to find intel on the gem at Junkfort Station, but his attempts nearly got himself killed when he deduced that some of the \"criminals\" who wanted to \"help\" Solo were really going to lure him to Jabba the Hutt for the monetary reward. He did nonetheless learn from one of the other attendees to locate the pirate Raskar for the sole known power gem remaining in existence. After locating Raskar and orchestrating a fight between Chewbacca and the reigning victor of the tournament outside of the ring so he could get close and find out how much power is left in the power gem, he acquired the power gem. He also swore that he'll keep the true status of the shield properties of the power gem a secret after he learned about its decrease in power, as he and the Rebel Alliance only intended to use the gem once anyway, although he secretly intended to loot Raskar of all his ill-gained items as his punishment for the scam. After he returned to Yavin base with the power gem, however, he learned from Leia that Luke didn't make it back to Yavin due to an ambush."}, {"tag": "p", "text": "After the evacuation of Yavin IV, the Rebellion was left without a base. Han and Chewbacca aided Han's new elite fighting force, Renegade Squadron led by Col Serra, in obtaining a holocron made by Bail Prestor Organa before Alderaan's destruction. The holocron, encased in phrik, survived the planet's demise and contained a list of potential bases for the Alliance. During the battle to obtain it, Han was contacted by Boba Fett, who demanded the Holocron. The bounty hunter was fought off by the squadron, however, and the holocron was successfully obtained."}, {"tag": "p", "text": "Following the damage sustained in the Alderaan system, Han, Chewbacca, and Renegade Squadron landed on Ord Mantell to make repairs. However, before the repairs were finished, the droid bounty hunter IG-88 discovered them and alerted the Imperials. During a battle with them, a power converter and an energy cell were found in the junkyards. Han repaired his ship, and he, Chewbacca, and Renegade Squadron took off from the planet, narrowly avoiding a Star Destroyer squadron. Shortly after, they learned that Gial Ackbar had been captured by the Empire while on a recon mission to find a new base. Han and Chewbacca helped rescue Ackbar."}, {"tag": "p", "text": "The squadron learned from Ackbar that his crew had been captured by Boba Fett and sold as slaves on Tatooine. Han and Renegade Squadron landed on the planet and encountered Imperial resistance. During the skirmish there, they learned from a Rodian contact in a cantina that the slaves were being held in a shipyard; Han, using a fusioncutter, broke into the room the slaves were being held in and, along with Renegade Squadron, fought their way to the Millennium Falcon and escaped the planet. They headed back to Boz Pity, the new base of the Alliance. However, a tracker beacon had been placed in an R2 unit and they were tracked by Boba Fett, who then told the Imperials the location of the Rebels' new base on Boz Pity. An Imperial planetary assault force attacked the base; Han and Chewbacca helped prepare and pilot the evacuation craft that allowed Renegade Squadron and Ackbar to flee the planet."}, {"tag": "p", "text": "Six months after the battle of Yavin, Han was supposed to accompany Leia to a diplomatic meeting with Chivkyrie on Shelkonwa, but was reassigned to hunt pirate groups threatening Alliance supply lines, along with Luke. However, he was uncertain of his allegiance to the Rebels and only reluctantly accepted the job. While on their mission, they encountered the Hand of Judgment and developed a tenuous relationship with them, even after both sides learned of the other's identity. Together, they defeated a group of BloodScar pirates. Learning that Leia was being hunted on Shelkonwa by the Empire and that the pirates had inside help from the governor's office there, the ex-Imperials and Rebels infiltrated Shelkonwa, with the troopers posing as their escorts while they looked for Leia. Although the rogue stormtroopers left to assist Mara Jade, Luke, Han, and Chewie found Leia and, returning to the Hand of Judgment's ship, escaped once the Hand returned. They were dropped off at the Falcon and made their way back to Alliance headquarters. Leia told him that he could stay in the Alliance for the sake of one person, and while she meant Chewie, Han preferred to think that he was in it for her, and continued to be part of the Alliance."}, {"tag": "p", "text": "Following weeks of searching for Vader's TIE Fighter, Solo and Organa stopped over at Ord Mantell, where he hoped he might make some money on the Sabacc tables and try to get Jabba his bounty. Before long, Solo found himself racing the Togorian Alfreda Goot to Tatooine, after the bounty hunter kidnapped Organa. Before long, Solo had inadvertently handed Vader back over the Empire, encountered a prototype Executor, and rescued the princess of Alderaan, all within the span of a short amount of time."}, {"tag": "p", "text": "Later on, Han, accompanied by Chewbacca, Leia, and Deena Shan, traveled to the planet of Aguarl 3. During an untimely detour on the dangerous planet, Han and his first mate, Chewbacca, were attacked by the creatures native to the planet. Fortunately, Leia and Deena were able to save them from the dangerous native wildlife."}, {"tag": "p", "text": "Nearly a year after the destruction of the Death Star, Chewbacca and Han left for the celebration of Life Day on Kashyyyk. It served as a short break between the periodical fighting. But peace did not last long for the pair. Not long after they departed Tatooine for Kashyyyk, they found themselves once again being chased by the Empire. Fleeing to lightspeed, they went on their way. However, the Empire had apparently traced their route to Kashyyyk, which they rightfully suspected to be a harbor for rebels. Upon learning of this, Darth Vader ordered a blockade and search of the planet. A group of Imperial officers entered Chewbacca's home, terrorizing his family and wrecking the house. They looked for any sign of rebel activity. However, after a while, Chewbacca's son, who then went by the name Lumpawarrump, devised a plan. He used his mini-transmitter, which he had received as a Life Day present from Saun Dann, to send out a voice message through the Imperial airwaves—which changed the sound of Lumpy's voice. He gave the command of \"return to base,\" which the officers in the home picked up on their receivers. They complied, with the exception of the stormtrooper known as B4711, who was ordered by a superior to stay behind in order to temporarily watch the house for rebel activity. However, the trooper soon learned of Lumpy's trick, and pursued him through the house, out onto the balcony, where Han and Chewbacca had just arrived. Chewbacca roared as Han managed to kill the trooper. That night, the group, along with the other Wookiees on Kashyyyk, celebrated an uninterrupted Life Day."}, {"tag": "p", "text": "One year after the Battle of Yavin, Han provided support for Crix Madine and Rogue Squadron during the battle of Corellia and evacuated the Coronet Capitol Tower."}, {"tag": "p", "text": "As part of the Rebel Alliance, Solo undertook many missions while trying to evade Jabba's organization. However, no matter how Han tried, he still encountered many bounty hunters who wished to carry out Jabba's bounty. On one such occasion, Han and Chewbacca returned to Ord Mantell where he encountered another bounty hunter seeking to collecting Jabba's bounty, the cyborg Skorr. Skorr had planned to use Luke Skywalker and Leia Organa to lure Solo into a trap. Solo and Chewbacca managed to evade the trap, rescuing Skywalker and the Princess in the process. Skorr accidentally killed himself with his blaster during a duel with Solo."}, {"tag": "p", "text": "When the Alliance lost a large shipment of ryll on its way to a Rebel medical facility, Solo was asked to use his underworld contacts to uncover its whereabouts. When conversation with fellow smugglers provided several leads, Solo arranged a meeting with Alliance Major Bhan in a cantina on Corellia. However, instead of Bhan, an ISB posing as a smuggler approached Solo and engaged in a conversation. It was soon interrupted by an arrival of Solo's friend Col Serra, who informed him that Bhan was bush-walked on Tatooine, supposedly by the same individual Solo was talking to. The undercover agent tried to deny it, but Solo and Serra confronted him anyway. After a short fight, they subdued him and, leaving him on the floor, departed, oblivious to the fact that the operative managed to place a tracking device on Solo. Later, when the shipment was discovered to be located on the asteroid Skip 52 in the Smuggler's Run, Rebel agents traveled there and managed to defeat ISB personnel trying to secure the ryll. Solo and Chewbacca took the Millennium Falcon to Skip 52 to help return it back to the Alliance, but were tracked via the beacon placed on Solo. A second team of ISB agents arrived to secure the shipment, and this time they were successful. Solo and Chewbacca managed to escape in the Millennium Falcon with a few crates of ryll, though the rest had fallen into the hands of the Empire."}, {"tag": "p", "text": "On another occasion, Han and Chewbacca came into the possession of some valuable glowing Tandgor gems, which he claimed would pay off debts and help pay to modify the Millennium Falcon. They stopped on an unknown planet to get fuel. After landing on the planet, Solo and Chewbacca were confronted by groaning skeletal figures; the undead. Chewbacca was able to fight them off and made a hasty retreat back to the Falcon only to find the fuel line had been severed by someone. Arming themselves, the two-man crew of the Falcon headed back and came face to face with a local and her baby who explained to the two that the crew of a \"Great Interplanetary Ark\" perished after their ship crashed in the planet's fog. They were compelled to wander the planet as corpses, terrorizing the locals every night."}, {"tag": "p", "text": "Using the Tandgor Gems to lay down lines, Han formed a makeshift runway that managed to dissolve the fog. A ghostly apparition of the ship that crashed long ago used it to land, easing the spirits of the perished crew. The living dead would no longer terrorize the planets residents. Han and Chewbacca left the planet out of pocket, but were rewarded with enough fuel to last them the rest of their journey."}, {"tag": "h4", "text": "Crisis on Cloud City"}, {"tag": "p", "text": "After run-ins with bounty hunters such as Skorr and Cypher Bos on Ord Mantell, Solo resolved to leave his friends in the Rebellion and finally settle things with the Hutt. After Luke Skywalker disappeared while on patrol, Han went out to search for Luke on a tauntaun, although he ended up stranded alongside Luke in the blizzard. Because of these circumstances, he was forced to use his recently deceased Tauntaun as a makeshift heat source by borrowing Luke's lightsaber to cut its innards open until morning when Zev Senesca located him in a search operation. Likewise, during patrol, he managed to find a Viper probe droid and destroyed it, although not before it transmitted images of the Rebel shield generator and thus gave away their location. Before he could finish repairs on the Millennium Falcon and leave the Rebels' Echo Base, however, he was caught up in the Imperial attack on Hoth."}, {"tag": "p", "text": "When Princess Leia and C-3PO were cut off from their evacuation ship, Solo took them on board the Millennium Falcon, which avoided Vader's Death Squadron by hiding in the Hoth asteroid field. When they were nearly trapped in the gullet of a space slug, Han flew the Falcon back out into the asteroid field where they were almost immediately detected by the Star Destroyer Avenger. Han, ignoring a warning from C3PO, moved his ship into an attack approach, flying directly over Avenger's bridge. Subsequent tracking of the Falcon turned up no trace; Han had outwitted Avenger's command by attaching his ship to the rear of the Star Destroyer's conning tower with the Falcon's landing claws. Han and his passengers later escaped undetected by drifting off amongst Avenger's garbage dump before Avenger went into hyperspace. During their escape, Solo and Leia began to show their affection for each other, which would later lead to them falling in love."}, {"tag": "p", "text": "Since the Millennium Falcon's repairs were still not complete, Solo went to the nearest safe haven—Bespin, home to Solo's old friend Lando Calrissian's tibanna mining facility, Cloud City. Unfortunately for Solo, he had been beaten there by Darth Vader and Boba Fett. Under duress, Calrissian made a deal with the Dark Lord to betray the Rebels in exchange for the continued autonomy of Cloud City. Calrissian invited them for \"refreshments,\" and led them into a room where Darth Vader sat, waiting. Han, with one of the fastest draws of his life, pulled his blaster and fired a couple shots at Vader, who easily blocked them and snatched the blaster out of Han's hands using the Force. Then, Boba Fett and stormtroopers surrounded the Rebels, capturing them. Solo was badly tortured on a scan grid by the Imperials who, according to him afterward, never even asked him any questions. While in his cell, Calrissian came and told the agonized Han about the custody of Leia and Chewbacca and Vader's plan to trap Luke Skywalker. Uncaring about the consequences and furious at his friend's betrayal, Han slugged Calrissian before being subdued by the administrator's guard detail."}, {"tag": "p", "text": "Shortly afterward, Han was taken by the Imperials to be frozen in carbonite as a test to ensure that Luke Skywalker would survive a similar freezing. There, surrounded by Darth Vader and his personal guard, he spoke his last words before being frozen. In response to Leia saying, \"I love you\" Solo responded, \"I know.\" (Listen (help·info)) After being frozen, Han Solo went into a state of hibernation."}, {"tag": "p", "text": "Fett, dubbing Vader's handiwork, Man in Carbonite, loaded the slab containing Solo aboard the Slave I, and departed for Jabba's Palace. After escaping Bespin, Skywalker, Leia, Chewbacca, and a repentant Calrissian set about planning Solo's rescue."}, {"tag": "h4", "text": "Rescue"}, {"tag": "p", "text": "In 4 ABY, the group managed to locate Solo and set up a rescue operation. As a result of careful planning, Solo was brought out of carbon freeze by Leia disguised as Boushh, temporarily suffering from blindness, a symptom of hibernation sickness. However, Jabba was aware of Leia's real identity and imprisoned Han Solo while Leia was to become his new slave. In his cell in Jabba's Palace, Solo was reunited with his partner Chewbacca. During his short period of captivity, a B'omarr Monk named Sai'da interviewed Solo, wishing to record the famous smuggler's history. With the arrival of Luke Skywalker, Han Solo was brought once more before Jabba. He tried to barter for his life but to no avail, as he was considered a failure by Jabba. Han reunited with Luke as the two were sentenced to death and carried off to the Sarlacc pit."}, {"tag": "p", "text": "At the Sarlacc pit, Luke turned the tables and a battle broke out. During the fight Calrissian redeemed himself by risking his life to save his old friend. Solo accidentally set off Boba Fett's jetpack which sent him flying into Jabba's sail barge then into the Sarlacc (though the hunter escaped well after the skirmish had ended.) Solo then managed to rescue Lando from one of the Sarlacc tentacles while hanging from one of the damaged skiffs, despite hibernation sickness still affecting him. The fighting ended with Leia killing Jabba and Han being reunited with his friends. The heroes quickly escaped Jabba's barge as it exploded due to a chain reaction set off by Luke by firing its cannon into its hull at point-blank range, and then left Tatooine after a fierce sandstorm when Luke revealed he had to go to Dagobah."}, {"tag": "p", "text": "Sometime after this incident, Han volunteered to rescue Ithorians from the Empire. Han and Chewbacca found the Ithorians, destroyed several TIE Fighters, and dodged asteroids. They even ran into three more space slugs, barely missing him as they did during the Battle of Hoth."}, {"tag": "h4", "text": "Attack on Endor"}, {"tag": "p", "text": "With the death mark no longer on his head, Solo felt free to devote his time to the Rebellion."}, {"tag": "p", "text": "After recovering from hibernation sickness, he formally joined the Alliance and was commissioned as a general. He led a commando team, which included Luke Skywalker, Leia Organa and Chewbacca, on a mission to Endor to destroy the Death Star II's shield generator, which would allow a fleet led by Admiral Ackbar and Calrissian--now also a general--to move in and attack the station, hopefully capturing or killing the Emperor in the process."}, {"tag": "p", "text": "On Endor Leia became separated from the group when she chased after two scout troopers on a speeder bike. Worried, Han, Chewbacca, and Luke, accompanied by R2-D2 and C-3PO, searched through Endor's thick forest in order to locate her. However the group fell into a trap that appealed to Chewbacca's stomach and was captured by Ewoks, natives of Endor. They were eventually freed with the help of Threepio—who the Ewoks mistook for a deity—and Luke. Following their initial encounter, Han and the others became part of the Ewok tribe, forming a close bond with them."}, {"tag": "p", "text": "After their initiation into the tribe, Han led his strike force to the shield generator bunker. Solo didn't know, however, that he was walking into a trap; Palpatine himself knew of their attempt to destroy the generator. Solo and his force were captured, while a battle raged in space between the Rebel and Imperial fleets. Fortunately, with the help of the Ewoks and a timely reunion with Renegade Squadron, Han and the other Rebels were able to turn the tables and capture many Imperial troops. After planting several 7-PrG proton grenades, Han destroyed the shield generator in time, killing Captain Sarkli on the way out (while also noting that Sarkli had picked the wrong side of the conflict), allowing General Calrissian to begin his attack on the Death Star. The Death Star was finally destroyed, taking the Emperor with it. As the explosion of the Death Star lit the skies, Han said he was sure Luke got off in time, and Leia said \"I can feel it.\" Han, thinking Leia was in love with Luke, offered to step aside when he came back. Leia corrected Han, telling him Luke is her brother, shocking Han, and they shared a kiss as the celebration began. Solo later joined in the evening's banquet."}, {"tag": "h3", "text": "Hero of the New Republic (4 ABY–19 ABY)"}, {"tag": "h4", "text": "Truce at Bakura and aftermath"}, {"tag": "p", "text": "Shortly after the Battle of Endor, Solo accompanied Princess Leia and Luke as part of a task force to Bakura, which was under invasion by the Ssi-ruuk. The remaining Imperial forces were outnumbered and outgunned by Ssi-Ruuk invaders and, after the intervention of Alliance forces held off the alien invaders, the result was a truce between the Imperials and the Rebels. Han was uncomfortable in the presence of so many Imperials, and his customary lack of tact annoyed some of them as well. While on Bakura, Han tried to deepen his relationship with Leia, but circumstances kept them from spending much time together, and Leia was also distraught by seeing a vision of Anakin Skywalker. After a successful engagement led to the withdrawal of the Ssi-Ruuk, Imperial governor Wilek Nereus betrayed the Rebels and ordered them targeted. Leia was arrested shortly afterward for sedition but was rescued by Han. In orbit in the Falcon, Han prepared a ramming maneuver to allow the surrounded Alliance forces to escape. Fortunately, Luke was able to convince the Imperial fleet commander to surrender. Solo then aided the short, swift Bakuran overthrow of the government and was present at the surrender of Nereus. Shortly afterward, the Alliance of Free Planets was founded."}, {"tag": "p", "text": "Solo later commanded Rebel forces in the Battle for the Eclipse in the Millennium Falcon that temporarily teamed with Tyber Zann's forces against Imperial forces in order to destroy the semi-built Eclipse. However, he was knowledgeable enough of Zann's character to suspect that Zann had ulterior motives in aiding the Rebel Alliance in the battle, and made clear that the instant he suspects that he'll betray them, he will kill them before wishing Zann and his group good luck. Together, Zann's fleet and the Solo-commanded rebels destroyed three Cardan-class space stations, and as soon as a boarding party of Zann's had taken over the Eclipse, Solo realized Zann's ruse and attacked, but he and the rebels were soon driven away. Zann proceeded to destroy what remained of the Imperial fleet there and stole information he desired from the Eclipse before leaving it."}, {"tag": "h4", "text": "Encounter with Boba Fett"}, {"tag": "p", "text": "Though he won the Battle of Endor, Solo found himself in need of credits. Refusing to accept money from the House of Alderaan and the Rebel Alliance, Han, along with Princess Leia and R2-D2, went to Tatooine to access Han's bank account. However, his account was frozen due to his encasement in carbonite. Shortly afterward, R2-D2 was captured by Jawas. Unbeknownst to Han, the Jawas also captured Boba Fett, who was suffering from amnesia after escaping the Sarlacc. Han leaped from his moving landspeeder and entered the sandcrawler's cargo hold to find Artoo and Boba Fett; he was surprised the bounty hunter survived the Sarlacc too. Fett had temporarily lost his memory and helped Solo rescue R2 from the sandcrawler and onto the racing landspeeder. Unfortunately for Solo, Fett regained his memory due to Leia's constant repetition of Solo's name. Fett tried to shoot Solo, but missed. Solo and the others fled, leaving Boba Fett and the Jawas to be eaten by the Sarlacc. However, Fett was regurgitated by the Sarlacc, again."}, {"tag": "h4", "text": "Nagai-Tof War"}, {"tag": "p", "text": "After the Alliance of Free Planets was established, Solo, along with Chewbacca and Lando Calrissian were sent on several missions to bring secure attendees for the First Conference of Free Peoples. After these recruitment missions, the group decided to take a break to visit Chewbacca's family on Kashyyyk. Arriving on the planet, the group felt a sense of uneasiness about Rwookrrorro. With Chewbacca leading the way, they made their way to Chewbacca's home. However, they fell into a trap set by Chewbacca's brother-in-law, Vargi, and his mysterious companion, Knife. As it turned out, Knife's true intention was to set up a slave ring on Kashyyyk, using Chewbacca's family as hostages to keep the Wookiees in line. Fortunately, Han and Lando were able to break free."}, {"tag": "p", "text": "While Lando contacted the Alliance, Solo tried to keep Chewbacca from being brought onto a slaving ship. He managed to free Chewbacca but was interrupted by Vargi. Vargi dragged Chewbacca aside and proceeded to beat him for his attempt to escape. Han could not bear to see Chewbacca being unmercifully beaten and struck Vargi. Furious, Vargi went on a rampage and struck Solo, rendering him unconscious. Shortly afterward, Lando returned with weapons and armed the Wookiees still loyal to the Alliance. The Wookiees overthrew their rogue counterparts just as Chewbacca was able to overpower Vargi, throwing him to the ground. Han woke up just in time to see Knife escaping from the battlefield. Though Knife's slave ring had been dismantled, the skirmish on Kashyyyk would mark the beginning of the Nagai–Tof War."}, {"tag": "p", "text": "Things went from bad to worse as certain members of the Alliance began to grumble about the manner in which the leadership of the Alliance was run, claiming it was too oppressive. The leaders of the discontent parties gathered on Kabray to share their concerns with one another. Most attending the gathering were non-military members of the Alliance, and had contributed little to the Rebellion's fight against the Empire. In order to prove that their leadership was not aloof, Admiral Ackbar dispatched Han and Princess Leia, along with four Zeltrons as an escort, to the meeting on Kabray. Unfortunately, Han and Leia walked right into a trap and were captured by the Nagai. While Han and Leia tried to formulate a plan involving Leia pretending to faint, the Zeltron set their plan in motion, taking out the guards. Eventually, the Nagai were all rounded up and captured by Solo and the others, averting the Nagai's strategic win on Kabray."}, {"tag": "p", "text": "Shortly after the skirmish on Kabray, the Nagai forces and their Imperial allies attacked the forest moon of Endor, officially starting the Nagai-Tof War. While Ackbar led forces in space, Han and Luke ventured off to investigate a disturbance in the forest that had been reported by the Ewok Tippet. They found a squad of Nagai and Maccabree preparing to attack the Alliance base, covered by the diversion taking place in space. While Luke set off to warn the base, Han encountered the traitor Bey."}, {"tag": "p", "text": "Although Bey bested Solo in hand-to-hand combat, the Nagai commander, Knife, intervened and tried to shoot Han. Bey had not wanted to kill Han and so tackled Ozrei knocking the shot off target. This gave Solo a chance to grab his blaster and shoot Ozrei—and he did not miss. An anguished Bey revealed Ozrei was his half-brother, and allowed Han to continue on to the listening post. By the time he arrived there, the Maccabree had been driven off, flying away in their flight-suits."}, {"tag": "p", "text": "The war escalated once the Nagai's sworn enemies, the Tofs, joined the war. The final battle of the war came at the Battle of Saijo after the Alliance allied with the Nagai and Empire against the Tofs and their leader Prince Sereno. Once the Alliance learned of Sereno's and Lumiya's Saijo, a strike team consisting of Han, Princess Leia, Luke, Dani, Knife, Den Shiva, and one stormtrooper were sent to Saijo to neutralize the threat. Han and others were able to defeat the Tof and Lumiya, causing Prince Sereno to surrender. The Nagai Tof war finally ended."}, {"tag": "h4", "text": "Tracking Zsinj"}, {"tag": "p", "text": "Though not always a formal member of its military, and never holding official political office, Han Solo played an important role as part of the New Republic. Solo was instrumental in the Liberation of Kashyyyk, eliminating its oppressors such as the Trandoshan slaver Pekt and Moff Hindane Darcc. Solo went on to take part in the defeat of many warlords."}, {"tag": "p", "text": "In 7 ABY, Warlord Zsinj's attacks on the New Republic had the populace frightened and discontented. Due to his reputation and public image, Solo was given command of a fleet group and charged with hunting down and killing Zsinj. His flagship was the Mon Remonda, a Mon Calamari Star Cruiser. Under his command were several other Mon Calamari cruisers, a few Imperial Star Destroyers, smaller frigates, and several starfighter squadrons, including Rogue Squadron, Wraith Squadron, Polearm Squadron, and Nova Squadron. Han and Zsinj played a dogged game of each pursuing and trying to trap the other. In one effort, Han employed a fake Millennium Falcon, known as the Millennium Falsehood, and another time got the aid of an Imperial Immobilizer 418 interdictor cruiser under the command of Teren Rogriss, his Imperial anti-Zsinj counterpart. In his final fleet battle against Zsinj in late 7 ABY, Solo and his fleet were led to believe that they had destroyed Zsinj's flagship, the Iron Fist Executor-class Star Dreadnought. However, Zsinj had fooled them by detonating a reconstructed Star Dreadnought as cover while the Iron Fist jumped into hyperspace."}, {"tag": "h4", "text": "Disastrous courtship"}, {"tag": "p", "text": "Following the hunt for Zsinj, Han returned to Coruscant and discovered—much to his dismay—that Leia was asked for her hand in marriage by Prince Isolder of Hapes. At a formal reception the Hapes delegation presented Leia with a number of gifts which included a Hapan Gun of Command and a special plant. Jealous and depressed, Han went into the undercity of Coruscant and won ownership of the planet Dathomir in a game of sabacc. Soon after he kidnapped Leia and took her to the planet to win her heart. However, they soon learned that the planet was home to the Dathomiri \"Force witches\" as well as Warlord Zsinj's hidden base of operations. Han was captured by one of the witch clans who hoped to trade him to Zsinj in exchange for a transport to escape Dathomir. Han was tortured by Gethzerion, the leader of the witches, before being rescued by Luke single-handedly piloting the Millennium Falcon with the aid of the Force."}, {"tag": "p", "text": "Back at the helm of the Falcon, Solo managed to get past the shields of Zsinj's flagship. Solo called up Zsinj on the comm, telling Zsinj to \"kiss [his] Wookiee\" right before firing two concussion missiles into the bridge of the ship, killing the warlord instantly and essentially turning the tide of the Battle of Dathomir."}, {"tag": "p", "text": "After the Zsinj crisis, he married Leia, which made him the husband of the New Republic's Minister of State and eventually Chief of State. Later that year, Han accompanied his wife to Tatooine to recover the Alderaanian moss-painting Killik Twilight which held an encrypted Shadowcast key which contained codes once in use by the Alliance. During their trip on Tatooine, the pair met many people who had known Anakin Skywalker when he had been a nine-year old slave and Podracer. A snag was thrown into the mission when a group of Imperials were also competing for the painting. They included Kitster Banai, the Rodian Wald, and the younger sister of Beru Whitesun, the woman who had raised Luke as his \"Aunt Beru\" and had been present during the burial of his grandmother Shmi Skywalker. They also discovered Shmi's diary with the help of the Darklighters who now owned Luke's moisture farm. From this diary, Leia discovered that her father had not always been the evil monster she thought he was and learned to forgive him. Enlisting the help of some Squibs, Han and Leia went on a long chase to finally retrieve the painting, during which Han became lost in a sandstorm and suffered from dehydration. Leia and the Darklighter family rescued him and they were eventually able to retrieve the Shadowcast key, although the Empire gained possession of the painting."}, {"tag": "p", "text": "This adventure on Tatooine gave his wife a new understanding of Anakin Skywalker. Soon, Leia made plans with Han to start a family. Later, it was learned that she was pregnant with twins."}, {"tag": "h4", "text": "Return of the Empire"}, {"tag": "p", "text": "During the Thrawn campaign in 9 ABY, Solo was heavily involved in foiling several of Grand Admiral Thrawn's schemes. While trying to take care of his wife and unborn children, he was also involved in several diplomatic missions, some to fringe groups to recruit them, and some accompanying Leia on official New Republic delegations. Han helped fend off multiple attacks by the Noghri commandos on Leia, using what could best be described as unorthodox tactics to defeat them. When suspicious bank account activity implicated Admiral Ackbar, Han went to Lando to find a slicer to investigate the accounts. Lando and Han subsequently visited Talon Karrde on Myrkr to recruit a slicer, but events soon changed their mission completely when an Imperial Grand Admiral arrived and Han and Lando discovered that Karrde had been holding Luke Skywalker prisoner. Adapting to the situation, he and Lando evaded the Imperials and helped rescue Luke from the stormtroopers searching for him—both with Karrde's help. Following their departure from Myrkr, Han and the rest of the crew aboard the Millennium Falcon became embroiled in the Battle of Sluis Van, where they attempted to disable the mole miners that Thrawn was using to steal New Republic ships. While Lando was successful in preventing the theft, most of the ships were severely damaged. While Han labored to aid the New Republic against the Empire, he also had to deal with the political machinations of ambitious Bothan leader Borsk Fey'lya."}, {"tag": "p", "text": "Han continued his search for the truth behind Ackbar's accusations and Fey'lya's activities, journeying to New Cov. While following Tav Breil'lya, Fey'lya's aide, Han was stopped by Sena, but before they had much for discussion, they were interrupted by an Imperial raid. Fleeing in the Lady Luck with Lando—Leia had been using the Falcon—Han and Lando were escorted back to Peregrine's Nest, where they met the legendary Corellian Senator Garm Bel Iblis and his private army. Han was impressed at seeing the former Senator again, even referring to him as sir, a title that rarely slipped from his lips. After Lando realized that Bel Iblis's ships had come from the Katana fleet, Han and Lando began a race with the Empire to find Bel Iblis's contact who had supplied the ships. Their search led them to the Coral Vanda, but a detour and ambush instigated by Niles Ferrier slowed them enough to allow the Empire to reach the contact, Hoffner, first. Thanks to coordinates supplied by Talon Karrde, who also knew of the fleet's location, Han, Lando, Luke, and a small team traveled to the location of the fleet, arriving before the Empire did. As battle erupted, Han helped fend off the Imperial boarders while the New Republic Frigate Quenfis, its fighters, Rogue Squadron, and some of Karrde's ships held off the Star Destroyer Judicator. The arrival of Bel Iblis aided greatly in the battle, but the tide was finally turned when Han remotely piloted another Dreadnaught into the second Imperial Star Destroyer that had arrived, destroying it."}, {"tag": "h4", "text": "Becoming a father"}, {"tag": "p", "text": "Han was present when his wife gave birth to Jacen and Jaina, and was quite nervous and excited. When Imperial Intelligence infiltrated the Imperial Palace not long afterward, Han and Leia defended their children until help could arrive. As a result of the attack, the Noghri, who had been persuaded to help the New Republic, sent bodyguards to protect the twins while Han, Luke, Chewbacca, Artoo, Threepio, and Mara Jade went to destroy the Mount Tantiss fortress after springing Mara out of arrest. After landing the Falcon on Wayland, Han and the others journeyed through the inhospitable forests, fending off predators and other hazards. Reaching the fortress, they were joined by more Noghri, who had been clearing paths for them. Infiltrating the mountain while the local inhabitants launched a diversion, the Republic party attempted to destroy the cloning facility, with the help of Leia, Lando, and Talon Karrde, who had arrived to help in the Wild Karrde. Aiding Mara and Luke, who were challenged by the insane Jedi Master Joruus C'baoth, Han tried to shoot the deranged Jedi, but was hit with Force lightning and had his gun snatched out of his hand."}, {"tag": "p", "text": "Solo also played an important role in the defeat of the resurrected Emperor Palpatine in 10 ABY including infiltrating the Emperor's Citadel on Byss. It was also during this time that his wife learned that she was pregnant with a third child: Anakin Solo. In 11 ABY, during the Battle of Onderon, he shot the last clone of the Emperor in the back, killing it. However, the Emperor's spirit tried to enter the infant Anakin though he was stopped by the Jedi Knight Empatojayos Brand, who sacrificed his life for Anakin."}, {"tag": "p", "text": "Following that, he and Chewbacca traveled to Kessel to persuade the planet to join the New Republic. Unfortunately for them, they only encountered hostility from the planet's Rybet governor Moruth Doole and were put to work in the spice mines of the planet. During their captivity, they met a young Force-sensitive boy named Kyp Durron who helped them escape from Kessel. While escaping from Kessel, they avoided Doole's ships by flying into The Maw, an unusual concentration of black holes."}, {"tag": "p", "text": "In the Maw, they discovered the Imperial research center Maw Installation which was under the command of Admiral Daala, the only female Admiral in the Imperial Navy. It was there that they discovered the Death Star prototype and the Sun Crusher. They eventually escaped Daala with the help of one of the researchers Qwi Xux and stole the Sun Crusher. Fleeing from the Maw installation, Han flew the Sun Crusher through one of Admiral Daala's four Imperial-class Star Destroyers destroying it. Admiral Daala's three Star Destroyers pursued the Sun Crusher and fought Doole's ragtag navy in a space battle above Kessel. Han would later play a role in the Battle of the Maw Installation, which resulted in the destruction of the Death Star Prototype and the Sun Crusher."}, {"tag": "h4", "text": "Jedi Search"}, {"tag": "p", "text": "Later when Luke was disabled by Kyp Durron and the spirit of an ancient Sith Lord named Exar Kun, Han and the family went to visit the Jedi Praxeum on Yavin 4 and were baffled by his condition. During the dinner that followed, Leia, along with the twins and the students felt a great disturbance in the Force when the planet of Carida was destroyed by Kyp Durron. Han, who had befriended Kyp Durron, knew he was the only one with a chance of stopping him before he killed thousands more. Han and Lando took the Falcon in order find the errant Kyp. Once they found him, Han attempted to reason with Kyp and was making progress when Lando disabled the Sun Crusher with pre-existing command codes. However, Kyp bypassed the codes easily and was preparing to destroy the Falcon when Exar Kun was defeated by Luke's students. Free of the Dark Lord's influence, Kyp yielded and was taken back to Coruscant for sentencing."}, {"tag": "p", "text": "As Luke began the process of restoring the Jedi Order, Han, along with Leia and Chewbacca set out on a mission of their own, vital to the survival of the fragile New Republic. They began searching for the long-lost children of the Jedi. The quest took them to the Jedi planet of Belsavis, a nearly forgotten frozen world. Having heard tales of a Jedi exodus from the dark crypts below the planet's surface, and also hearing that since the time of the exodus no one entering the crypts has returned alive, Han, Leia, and Chewbacca journeyed to Belsavis to start their search."}, {"tag": "h4", "text": "Darksaber incident"}, {"tag": "p", "text": "In 12 ABY Han accompanied Luke to Tatooine where the Jedi Master had hoped to make contact with Obi-Wan Kenobi. After they arrived under the ruse of Tusken Raiders, Han and Luke visited Jabba's palace. They encountered a former associate of Jabba's, in the form of a disembodied brain connected with a life support system and a BT-16 droid, in the tradition of the mysterious B'omarr Monks. This former man, pleased to see enemies of Jabba, informed Han and Luke that the Hutts were planning to build another superweapon. Soon after the discovery, Solo and Skywalker revealed it to the New Republic, however, Durga the Hutt's subordinates stole the plans from the Imperial Palace by creating a distraction through an \"accidental\" discharging of an honor guards' ceremonial blaster rifle. In order to find out the location of the superweapon, the New Republic launched a covert operation to Nal Hutta that involved Leia, Han, General Crix Madine, Admiral Ackbar and then-general Wedge Antilles. Disguised as a diplomatic summit, Madine was able to infiltrate Nal Hutta, and deposit a small tracking device on Durga's ship, while Han, Leia and C-3PO met with Durga inside one of his bathhouses, who then allowed the New Republic access to one of his data slicers. It was this data slicer who revealed, much to Han's bewilderment and dismay, that the various Imperial Warlord fleets were unified and under the command of one Admiral Daala. After returning from the successful mission on Nal Hutta, Leia felt a stirring of the Force inside her, identical to the distress call Luke sent out to her above Bespin, and from the same sender. Han and Leia then moved in and rescued Luke and Callista near the Hoth asteroid belt in the Millennium Falcon. After this rescue, Han flew Luke back to his Jedi Praxeum on Yavin 4, only to nearly run headlong into Admiral Daala's Super Star Destroyer Knight Hammer. On the surface of the moon, Han and Chewbacca provided air support for the Jedi trainees, with Leia and Kyp Durron manning the quad laser cannons."}, {"tag": "h4", "text": "Planet of twilight"}, {"tag": "p", "text": "In 13 ABY, Leia was taken captive by Seti Ashgad and Dzym, who took her to Nam Chorios. Han, Chewbacca, and Lando went to rescue her, but ended up delayed by the confusion caused by the outbreak of the Death Seed plague, and also they did not know where she was. Fortunately Leia was able to escape by defeating the Hutt Jedi, Beldorion. Soon after Han reunited with Leia and participated in the Battle of Nam Chorios, as a commander. The battle ended when Luke Skywalker managed to convince the Chorian crystal mind of the threat that Ashgad posed to the galaxy if his plans succeeded. As a result Seti was killed though Getelles still survived."}, {"tag": "h4", "text": "Waru"}, {"tag": "p", "text": "In 14 ABY, when his three children were kidnapped by the Imperial Procurator of Justice Hethrir, Han and Luke were on Crseih Station investigating rumors of a healing cult. Han had been increasingly worried about the change he had seen in Luke, in part due to his suspicions of Waru, the cult's leader. He was also warned by an old acquaintance, Xaverri, to be wary of Waru. Originally unbeknownst to Han, Hethrir kidnapped his children and intended to sacrifice the Force-strong Anakin to Waru, which came from another dimension known as Otherspace. However, Hethrir was foiled by Han, Leia, Luke and his former mate Rillao."}, {"tag": "h4", "text": "Black Fleet Crisis"}, {"tag": "p", "text": "During the Black Fleet Crisis from 16 to 17 ABY, while his wife was serving as Chief of State, Han was charged with the day-to-day responsibilities of raising their three young children: officially, Admiral Ackbar insisted that he retained his rank and security clearances as a General, as Leia's personal \"liaison for domestic defense\"."}, {"tag": "p", "text": "Because of his wife's role as Chief of State, there were many attempts on her life. It was then that the Yevetha struck. An alliance of Yevethan worlds known as the Duskhan League intended to cleanse the Koornacht Cluster of all non-Yevethan species. They were armed with the Black Fleet which consisted of the Super Star Destroyer Intimidator (which had been renamed Pride of Yevetha) and its smaller escort Star Destroyers which they procured during a revolt against their Imperial master eight months after the Battle of Endor."}, {"tag": "p", "text": "During this time, Han was temporarily given the rank of commodore and was placed in charged of a massive New Republic fleet sent to patrol the borders of the Cluster. However, his shuttle was yanked out of hyperspace by a Yevethan Immobilizer 418 cruiser and he was brought before the Yevethan Viceroy Nil Spaar on the Yevethan homeworld of N'zoth. During his incarceration, Nil Spaar once transmitted a hologram to Leia in which he brutally assaulted Han for twenty minutes, saying only, \"Leave Koornacht now\"."}, {"tag": "p", "text": "However, this only gave the New Republic a reason to invade the Koornacht Cluster and deal with the Yevetha. Several Wookiees including Chewbacca and his son rescued Han Solo from his prison on the Pride of Yevetha through the use of the Millennium Falcon. The New Republic was aided by the enslaved Imperials who mutinied against their Yevethan masters despite having no love for the New Republic. The Yevetha were finally defeated at the Battle of N'zoth and were disarmed and placed under close watch."}, {"tag": "h4", "text": "Almanian Uprising"}, {"tag": "p", "text": "Later in 17 ABY, Han met up with Jarril, an old smuggling associate of his, in the Crystal Jewel Casino on Coruscant. Jarril had came to warn Han about things happening in the Smuggler's Run. Han didn't really take him too seriously, until the Senate Hall was bombed during the course of their conversation. Han rushed off to the ruins of the Senate Hall and found that Leia had been injured in the attack. He felt that the attack had something to do with what Jarril had been warning him about, so traveled to Skip 1 on the Smuggler's Run, along with Chewbacca, to investigate."}, {"tag": "p", "text": "Han met a lot of his old smuggling friends, such as Ana Blue, Zeen Afit and Kid DXo'ln, who were a bit hostile to him, as they considered him to have gone legit. However, after finding the wreck of Jarril's ship, Lando Calrissian believed that Han was in trouble and headed to the Run to find him, despite the fact that Nandreeson, a crime lord based on the Run, had a placed a bounty on him. Lando was soon captured and when Han learned of this, he rallied together a number of smugglers to help rescue him. However, the smugglers were actually in Nandreeson's pay and turned on Han during the rescue attempt. However, Han shot Nandreeson in the mouth with Chewbacca's bowcaster, killing him and allowing Han, Lando and Chewbacca to escape. They returned to Skip 1, where, shortly after, a number of droids bound for Coruscant, exploded and injured a lot of the smugglers. Han helped to transport some of the injured to Wrea, aboard the Falcon. Ana Blue also revealed to him that Kueller on Almania was behind everything."}, {"tag": "p", "text": "Han traveled to Almania and picked up Mara Jade on the way, despite the fact that he still didn't trust her, because she provided some ysalamiri to use against Kueller. When they arrived, the Battle of Almania was in progress between the New Republic and Kueller's forces. Han landed on the planet and went to help Luke and Leia, who were already there, but his ysalamiri were eaten by a thernbee. Nevertheless, his plan still worked, as the creature moved towards where Luke and Kueller were dueling and the ysalamiri pushed the force out of the area, allowing Luke to defeat Kueller."}, {"tag": "h4", "text": "First Corellian Insurrection"}, {"tag": "p", "text": "In 18 ABY, Han and the family took a vacation to Corellia, where they were hosting a trade summit in order to boost Corellia's economy. However the New Republic Intelligence Service remained wary of Corellia, maintaining that the situation at Corellia was unstable. En route to Corellia, Lieutenant Belindi Kalenda attempted to warn Han Solo and Chewbacca not to travel to Corellia—or at least not take his children, as Corellia was no longer safe. Distrustful, Solo refused to take her advice, seeing the trip as a family holiday. Once there, the Solo family decide to settle in with Governor-General Micamberlecto, and hired a Drall tutor, Ebrihim, as well as his droid, Q9-X2, to watch over their children while they were attending the trade summit. However Han soon discovered that the Sacorrian Triad and the Human League, headed by his cousin Thrackan Sal-Solo, was causing a political uprising that only went from bad to worse."}, {"tag": "p", "text": "Thrackan declared himself Diktat of the Corellian System and declared the system's secession from the New Republic. He also used Centerpoint's power to jam all system-wide communications, and demanded that all nonhuman races are to leave the system within a month, or he would vaporize a wide variety of New Republic planets. Han realized that Lieutenant Kalenda was right and aided in her escape. However, Han was captured by Human League thugs in the process."}, {"tag": "p", "text": "Imprisoned with the Selonian Dracmus, Han was forced to fight the female Selonian for his cousin Thrackan's amusement. However, communicating in Selonian, the two mostly staged the fight. Fortunately, the two were rescued by other Selonians, and, on a primitive coneship, managed to escape to Selonia. On Selonia, Han met up with Leia and Mara Jade and the three tried to convince the Overden to change their minds to the immense outrage of the Selonians. The Overden immediately released the three because of the grievous nature of Thrackan holding the Solo children hostage just as Luke Skywalker arrived, and the group planned a course of action. Enraged, the Sacorrian Triad waged war, and the Battle of Centerpoint Station began. Han participated in the war, and with the help of Luke, Leia, and Lando Calrissian, he was able to end the Insurrection and put Thrackan in jail. Han's children also played an important role in the battle as Anakin was able to use a planetary repulsor to stop the Starbuster beam from destroying Bovo Yagen."}, {"tag": "p", "text": "In 19 ABY, Solo made a nostalgic return to Jubilar, hoping to relive the adventurous times of his smuggling days. While negotiating a deal with Mayor Incavi Larado Baker to transport a shipment of Jandarra to the planet Shalam, Solo was attacked by Boba Fett, who had been informed of Solo's presence on the planet by Baker, an old informant. After a short fight, the two agreed to end their long-standing grudge and go their separate ways."}, {"tag": "h4", "text": "Caamas Document Crisis"}, {"tag": "p", "text": "During the final days of the Galactic Civil War Solo acted as an unsuccessful mediator in the Diamala/Ishori dispute. Solo and Calrissian led a mission to Bastion to retrieve a copy of the Caamas Document. Soon afterward, he was part of the final New Republic victory over the Imperial Remnant at the Battle of Bothawui. Soon after the Caamas Document crisis, Han and the family attended Luke's and Mara's wedding on Coruscant."}, {"tag": "p", "text": "All three of his children were trained as Jedi at Luke Skywalker's Jedi Praxeum from 22 ABY, and Han and Chewbacca would often visit them with the Millennium Falcon."}, {"tag": "h3", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "Han was involved in two of the first battles of the Yuuzhan Vong invasion. He aided in the evacuation of Sernpidal, where the Vong brought a moon down on the planet. However, they were unable to save Chewie, who had saved Anakin from the impact by sacrificing himself. Anakin, knowing that going back would result in the death of the passengers aboard the Falcon, took off from the planet. He also aided New Republic forces in the Battle of Dubrillion. Han went into a period of grief and for a short time blamed his son for the death of his long time friend, this continued and was very painful for his son, Anakin, who heard his father's words echo in him, \"You left him, you left Chewie!\". Eventually, Han reconciled with his son, who feared they would not be as close anymore, understanding the reasons for his choice. For killing his long time friend, Han went into a fit to get revenge against the Vong."}, {"tag": "h4", "text": "Adventures with Droma"}, {"tag": "p", "text": "A few months later, still dealing with grief, he left his family on Coruscant to go help his old friend, Roa. Roa was taken prisoner by the Yuuzhan Vong on Ord Mantell. Han then teamed up with his new friend, Droma to help save Roa. Also around this time, Han met and befriended Vergere, who had given him the antidote to cure Mara Skywalker of her disease."}, {"tag": "p", "text": "Han and Droma eventually traced the Ryn's family to a ship piloted by members of the Peace Brigade that dropped off refugees at Vong targets. Han and Droma finally found the ship at Fondor and rescued Droma's family while Kyp Durron and others rescued refugees, including Roa from a nearby ship. They then all witnessed the destruction of three-fourths of the Hapan fleet and half of the Yuuzhan Vong fleet by Centerpoint Station fired by his cousin, Thrackan Sal-Solo."}, {"tag": "h4", "text": "Hero's trial"}, {"tag": "p", "text": "Solo decided that he could be best used helping the New Republic, rather than moping around in grief. He was assigned to the terraforming project on Duro, and worked with Jacen and Jaina to try and maintain a small refugee habitat on the surface. After his habitat was overrun by Yuuzhan Vong insects, he went to a nearby habitat which he was surprised to find was being run by Leia. The situation soon became very bad when Leia was captured and almost killed by Warmaster Tsavong Lah. Jacen and Jaina soon rescued their mother and the Falcon blasted into hyperspace from Duro."}, {"tag": "p", "text": "After Duro was taken by the Yuuzhan Vong, Han and Leia fled to Corellia for Leia to recover but were chased away by Thrackan, who was now governor of the planet. They then decided to take a short break to try and close the rift in their marriage that was formed by Han's grief over Chewbacca. While on vacation, Han and Leia ran into a previously unknown group of Jedi called the Wild Knights which was lead by Saba Sebatyne, and helped bring them to Luke's attention, and into the limelight of the war. When they returned to Coruscant, Han and Leia gained temporary custody of their nephew, Ben Skywalker, and the two formed a close bond."}, {"tag": "p", "text": "Soon after, the Yuuzhan Vong created voxyn, Jedi hunting creatures that quickly killed many in the Jedi Order. To Han's dismay, Anakin volunteered to lead a strike team to Myrkr to destroy the voxyn cloning project. Han was reluctant to let Anakin lead in fear of losing someone else close to him. Although the mission was successful, Han's worst fears were realized when Anakin was killed fighting the extragalactic invaders during the mission, and Jacen was captured and presumed dead. Han and Leia helped each other deal with the grief of a lost son, and ended up with a stronger relationship."}, {"tag": "h4", "text": "War's end"}, {"tag": "p", "text": "During the occupation of Borleias, Han, Leia and Jaina all played key roles in maintaining the New Republic's hold as long as possible. Han and Leia dropped out of hyperspace into the middle of an enemy fleet, along with the Super Star Destroyer Lusankya. Thanks to Han's piloting, the Falcon and its cargo of Myrkr strike team survivors escaped the engagement unscathed. Han would later ferry those survivors to the Maw shelter, although he nearly turned back when Jaina came under attack. Han wanted to go to Coruscant in search of Jacen, but Leia talked him out of it, telling him that she needed him in the new Insiders organization. After they returned to Borleias from the Maw, Han continued to help Wedge in his defense of the planet. After his son's surprise return from Yuuzhan'tar, Han lead a small fleet of Smuggler's Alliance ships to help with the ambush over Ebaq 9. After that, Han, Leia, Jaina and Tahiri Veila went from system to system trying to re-establish communications with the far flung reaches of the New Republic. During this time they saw the destruction of the Yevetha, the Ssi-ruuvi Imperium's newest attempt to take Bakura, and the Yuuzhan Vong's attempt to take out hyperspace channels with the Unknown Regions During a ambush gone wrong over Bilbringi Han and Leia helped save Wedge Antilles from certain death, when they rescued Jaina aboard a hijacked Golan II Defense Platform. During the final days of the war, Han helped extract prisoners taken by the Yuuzhan Vong during the battle of Bilbringi."}, {"tag": "p", "text": "When Zonama Sekot made its existence known near Coruscant in 29 ABY, Han and Leia traveled there to be reunited with the rest of their family. While there, they met Harrar, a Yuuzhan Vong priest. Solo also played a major role during the Recapture of Coruscant. Leia and Han, along with the Yuuzhan Vong priest, Harrar, Threepio and Artoo, crashed the Millennium Falcon into the well of the World Brain. With the help of Harrar and revolting Yuuzhan Vong heretics, they captured the Well of the World Brain. After the destruction of Shimrra and Onimi, Han and the others traveled with Nom Anor across the labyrinth the mighty war vessel of the Master Shaper. However, the executor turned on them, shooting his venom at Solo. Jacen managed to save him just in time. Before he could kill them off, Leia engaged Nom Anor, slicing off his hand in the process. They managed to escape and arrived at conclave on Zonama Sekot, which marked the end of the Yuuzhan Vong War. After the war ended, he allowed Chewbacca's son Lumpawaroo and nephew Lowbacca to carry on Chewbacca's life debt."}, {"tag": "h3", "text": "The Dark Nest"}, {"tag": "h4", "text": "A cry for help"}, {"tag": "p", "text": "During the five years of reconstruction after the Yuuzhan Vong war, Han and Leia were often doing the Jedi one favor after another to help an order that was stretched too thin. Because of all the help he gave to the Jedi Order they considered him a member, leading him to joke that he wanted a lightsaber. They also helped the Ithorians find a new home after the devastation of their planet, Ithor, during the Yuuzhan Vong War."}, {"tag": "p", "text": "However, he and Leia finally refused to help the Jedi when they heard that Jaina and several other Jedi Knights had been drawn to the Unknown Regions by a mysterious calling in the Force. Eventually, Han and Leia decided to follow several Jedi including Luke, Mara, and Ben into the Unknown Regions, where they discovered that Raynar Thul was alive, and had been taken in by a nest of Killiks. During the mission to Myrkr, Thul had been incapacitated by the Nightsister Lomi Plo and the Dark Jedi Welk. They took him and escaped on the Tachyon Flier, which was under fire during Myrkr outbound, where all three were presumed lost. In truth, the Tachyon Flier had crashed onto the planet Yoggoy, a Killik nest, and made all three Force-users into Joiners. Raynar Thul was integrated into the Yoggoy nest while Lomi Plo and Welk were integrated into the Gorog nest."}, {"tag": "p", "text": "All became leaders of their respective nests, Raynar even created a new lead nest named Unu and became the Prime Unu, now reborn as UnuThul. They found that many non-Killiks had become part of the nests—part of the hive mind—after being around the Killiks for too long. These were called Joiners, and Han was terribly afraid that Jaina would become a \"bug hugger\" like the Joiners. The Yoggoy nests, and each other nest, except for Gorog, gained Raynar's sense of compassion and value for life, whereas the Gorog nest retreated into secrecy, due to the want of Lomi Plo and Welk to hide. The Gorog became the Dark Nest, and secretly controlled the other nests, without their even knowing."}, {"tag": "p", "text": "UnuThul greeted the Solos in Yoggoy hangar with a masterful display of his current Force power. In the Prime Chamber, UnuThul used \"we\" to address himself, stating Raynar Thul no longer existed and \"they\" were now UnuThul. Luke insisted that he sensed Raynar's presence in UnuThul, and guessed Raynar might be in hiding. Raynar then guided the Jedi to read the Chronicle on the wall, explaining the transformation of Raynar Thul to UnuThul, and the rise of the Unu nest. UnuThul explained the Unu nest as \"the nest of the nests\"."}, {"tag": "p", "text": "Still refusing to surrender the location of Qoribu, UnuThul stated that anyone could leave whenever they wanted, and decided to assign a Yoggoy guide to escort the Jedi back to Lizil. The Jedi soon realized that such a collective mind allowed UnuThul to spy on them almost anytime and anywhere on Yoggoy. They visited the crash site, and Leia received Jacen's flow-walking message about Qoribu which was in the Gyuel system. Insects dark blue in color then attempted to assassinate the Jedi Masters at the crash site, which the Jedi barely escaped with Nanna killing several blue insects in the process. However, the Yoggoy guide that accompanied the Jedi denied ever seeing any blue insects before its death. When they traveled back to the hangar, Han and UnuThul exchanged harsh words on the matter of attempted assassination. As the debate became a stalemate, Luke proposed that it was another party who attempted to assassinate the Jedi, but UnuThul insisted that even if someone else attacked the Jedi, the hive mind would also be aware."}, {"tag": "h4", "text": "Swarm War"}, {"tag": "p", "text": "Just prior to the Swarm War, Han and Luke had been taken prisoner by the Killiks in order to gain help for stopping the Fizz. Fortunately for them, both Solo and Skywalker were resistant to the joining process. They eventually escaped and participated in the offensives against the Killiks. During the crisis, Han and Leia were captured by the Chiss so they would not stop the Swarm War. They escaped, and eventually stopped the Chiss from unleashing their bio-weapon on the Killiks."}, {"tag": "p", "text": "Around this time Han and Leia found out about the birth of Tenel Ka's daughter Allana, unaware that she was their granddaughter through their son Jacen. Tenel Ka's and Jacen's reluctance to talk about Allana surprised them which caused Han to remark that the father must have been ugly if Tenel Ka refused to talk about her."}, {"tag": "p", "text": "The entire crisis was a nightmare for Han, due to his traumatic experience years before with the Kamarians of the Cult of Varn. That experience had given him a deep-seated unease around sentient insects."}, {"tag": "h3", "text": "Second Galactic Civil War (40 ABY–41 ABY)"}, {"tag": "h4", "text": "Rising tensions"}, {"tag": "p", "text": "In 40 ABY, a Jedi mission to Adumar by his son Jacen and his nephew Ben Skywalker to uncover an illegal missile factory on the planet ended in a violent ambush, from which the Jedi narrowly escaped with their lives. The incident sparked political unrest that threatened to ignite into total rebellion that could shatter the young Galactic Alliance. In a desperate attempt to avoid such a fate, the Alliance readied a preemptive display of military might in a bid to bring the rogue worlds to heel. In a display of poor decision-making, Corellia, Solo's home planet, was chosen as target of this exercise."}, {"tag": "p", "text": "Since Han Solo was a Corellian, this incident turned him against the Galactic Alliance. Worse, relations with his son Jacen and the Skywalkers were ruined after Jacen chose to stand with his uncle, Luke Skywalker, on the side of the Galactic Alliance. But when the Corellians launched a counterstrike, armed conflict was ignited and civil war broke out among those of the Galactic Alliance. As the Galactic Alliance began making more repressive laws, many began seeing it as a new Galactic Empire. Throughout the Galactic Alliance, families found themselves divided and old friendships were torn apart."}, {"tag": "p", "text": "That year, alongside Wedge Antilles, Han led Corellian forces at the Battle of Tralus. Han's actions were vital as he flew one of the bombers that led to the destruction of the Alliance's base and stronghold on Tralus. His daughter and wife were in the opposing Alliance fleet, although Leia was secretly aiding the Corellians by instructing fighters not to attack Han's and Wedge's ships."}, {"tag": "p", "text": "And while all this was going on, his son Jacen Solo became what the Jedi feared most: a Sith."}, {"tag": "h4", "text": "Allegiance with Corellia"}, {"tag": "p", "text": "Later, Han Solo and his old enemy, Boba Fett, were drawn together as they both learned some harsh truths about their own kin. Thrackan Sal-Solo put a bounty on Han and his family. Han finally decided to kill Thrackan, to forever end the threat. Fett agreed to help Han, in exchange for aid in finding his long-lost daughter, Ailyn Vel. Solo posed as a Mandalorian soldier working for Fett, and began strangling Thrackan shortly after encountering him, but Boba Fett's granddaughter Mirta Gev actually made the killing shot, with Boba and Han adding at least three more. Sadly, Ailyn Vel had been killed by Jacen during an interrogation. Horrified and outraged, Han disowned his son saying his son would never have done such a thing. Afterward, Han questioned Leia upon Jacen's upbringing, wondering if they were at least partly to blame."}, {"tag": "p", "text": "Shortly afterward, Han, Leia, and C-3PO were summoned to the Kiris Asteroids where the secret Corellian fleet was located. Upon their arrival, they were greeted by Wedge Antilles who was recently promoted to the rank of admiral. Han believed that he was summoned to help Antilles defeat the Blockade of Corellia but he was proven wrong once Dur Gejjen interfered. Instead of leading the attack with Wedge, Han and Leia were tasked with being decoys in order to draw Queen Mother Tenel Ka onto Corellia's side. Though disappointed, Han nonetheless did as he was told though he felt suspicious and uneasy. Traveling to Hapes in order to warn Tenel Ka of danger, Han and Leia learned that Gejjen had been using the Solos to disrupt Tenel Ka's security routine and draw her out into the open for an attack. In the process of warning her, Han and Leia unexpectedly walked into an assassination attempt on her life by the assassin Nashtah. Due to a series of unfortunate events, the two were forced to work with the assassin in order to escape. The three then set their course for Telkur Station. En route to the station, Han and Leia felt uncomfortable around Nashtah, though they insisted on finding the identity of the coup's leader. During their conversation, Nashtah revealed to Han and Leia that she'd seen Leia's father race in the Boonta Eve Classic. It was then that Leia revealed the reason for having children, though Han was upset about revealing such information to a stranger."}, {"tag": "p", "text": "They arrived on Telkur Station, only to encounter Jagged Fel, who was presumed lost after the Battle of Tenupe during the Swarm War. During their conversation, Fel revealed that he was marooned on Tenupe for two years after being shot down by Leia. While on Tenupe, he had discovered that Alema was still alive and seeking to kill Leia and her family in revenge for crippling her during their last duel. He also revealed that his family was going through financial troubles, causing him to become a bounty hunter. After the conversation, the three were drugged while Jagged slipped away. Han and Leia eventually escaped Nashtah, only to gain a new passenger by the name of Lalu Morwan. After delivering their findings to Tenel Ka, Han disarmed Morwan and locked her up in one of the Falcon's compartments, burning one of his hands from blaster fire in the process. Shortly afterward, Han and Leia came across Jaina, Zekk, Ben and his crew, taking them aboard the Falcon during the Battle of Hapes. However, Jacen ordered the Star Destroyer Anakin Solo to open fire upon the Millennium Falcon. Han and Leia escaped the confrontation, but with the Falcon's turrets and central core destroyed by the turbolaser blasts. During the battle, Han's nephew, Ben Skywalker, attempted to arrest Han and Leia for crimes against the Galactic Alliance. In an attempt to arrest the two, Ben accidentally slashed Zekk in the abdomen when he was restraining Ben, severely injuring Zekk. After making sure that Jaina, Zekk, Ben and his crewman escaped, Han and Leia escaped into hyperspace."}, {"tag": "p", "text": "After escaping into hyperspace, Han and Leia traveled to Tendrando Arms to repair the Millennium Falcon. There, Han and Leia reunited with Lando Calrissian, who left with them in his personal yacht, the Love Commander, and left C-3PO with the Falcon. They managed to get through Corellia's security zone, partially due to their deceitful disguises and Leia's use of a Jedi mind trick."}, {"tag": "h4", "text": "Break with Corellia"}, {"tag": "p", "text": "Meeting with Denjax Teppler in a Coronet cantina, they discovered that Teppler nor Wedge knew of the conspiracy to kill the Queen Mother and that it was the doing of Dur Gejjen. After their conversation, the group was forced to exit the cantina after several CorSec officers tracked Teppler to the cantina. Leia, Han, and Lando parted ways with Denjax shortly thereafter, being chased back to the Love Commander. Only with the intervention of the Pulsar Skate and the Errant Venture were Han and the others able to defeat the Corellian fighters attacking them. Onboard, Han and Leia were finally able to reunite with their friends and family. They also encountered the smuggler Uran Lavint, who informed them of Alema's existence on the ship and the conference being held on Gilatter VIII. Unknown to them, Alema had been looking for Han to kill him and make Leia suffer. He and Leia later went to Gilatter VIII to rescue Jacen from a Confederation ambush. However, Jacen fled the planet, leaving them behind to deal with Alema and the Confederation."}, {"tag": "p", "text": "Unbeknownst to Han and Leia, Jacen initially decided to make them his sacrifice for his ascension to Sith Lord; however, he later killed Mara Jade Skywalker instead. Han, along with Leia, also went to Hapes to comfort Luke in his grief in the loss of his wife."}, {"tag": "p", "text": "Then, Han and his wife slipped into Coruscant, as Leia was scheduled to deliver the eulogy for Mara. However, Jacen sent a squad of GAG troopers to intercept them. Naturally, Han and Leia refused to be arrested peacefully and escaped after a short firefight in the halls of the Temple, ditching their plans to attend the Funeral of Mara Jade Skywalker."}, {"tag": "p", "text": "Instead, Han and Leia went to Kashyyyk to persuade the Wookiees not to join the Galactic Alliance. However, they encountered some difficulties in the form of old Wookiee grudges and two GA Intelligence agents, Tarfang and Jae Juun. Thankfully, Luke and the other Jedi arrived after making their final break with Jacen, and Jaina also arrived on the Wookiee homeworld. Angered by the betrayal of the Jedi, Jacen followed Luke in the Anakin Solo and brought the Fifth Fleet with him. After the Wookiees refused to yield the Jedi and the Solos up to Jacen, Jacen bombarded the planet's wroshyr forests, causing further outrage to Han, who was prepared to take the Millennium Falcon up to attack the Anakin Solo himself. He was talked out of it by Luke, who along with the other Jedi led a StealthX strike on the GA fleet. Luke allowed others to believe that he had been shot down by his niece Jaina while she was trying to hit Jacen's StealthX, and boarded the ship to confront his nephew and rescue his son."}, {"tag": "p", "text": "While Han and Leia were traveling to Hapes, Leia felt Luke's presence disappear and believed he was dead, but Han refused to believe it, thinking that it would take a change in the laws of physics to kill Luke Skywalker. When they got to Hapes, they convinced Queen Mother Tenel Ka to stop supporting Jacen Solo. Han and Leia were relieved when they returned to Kashyyyk and found Luke still alive."}, {"tag": "p", "text": "Later, Han and Leia sanctioned Confederacy assassination attempts on Jacen while planning their own justice with the Jedi for their son."}, {"tag": "p", "text": "Han later accompanied Jaina, Zekk, and Jagged on their quest to end Alema Rar. He used the Falcon to rescue them from the asteroid they found Alema in after she had been killed."}, {"tag": "h4", "text": "Betrayal"}, {"tag": "p", "text": "Han was later part of the strike team that boarded the Anakin Solo to rescue Allana from Jacen. After the successful rescue, Han and Leia learned from Allana that Jacen was her father. The discovery that he was a grandfather came as a pleasant surprise to Han."}, {"tag": "p", "text": "Han was also present on Endor when Ben showed his family a recording that proved Jacen killed Mara Jade Skywalker. Han was shocked by the discovery."}, {"tag": "p", "text": "Following Jaina's training under Boba Fett, she revealed to Han and Leia that she had to be the one to kill Jacen, now known as Darth Caedus. Jaina embarked on a mission, dueling Caedus first on Nickel One, and then encountering him on the Anakin Solo. After a duel and being mortally wounded, Caedus stopped fighting so he could warn Tenel Ka about a threat to Allana. Jaina thought this to be a trick and killed him, horrified when she felt Jacen reaching out to Tenel Ka. Afterward she believed that Jacen had been himself at the end, though knowing that there was still too little of him to be saved. Han still believed that Caedus would have killed Jaina. Though the Solos struggled to get through this hard time, they were able to remember Jacen as the kind young man he had once been, not the Sith he had turned into. The war had ended, and though Han had lost much, peace was finally at hand. Additional comfort and joy came from Han's granddaughter, Allana, whom Tenel Ka had given to Han and Leia to raise under the pseudonym Amelia because she knew that they could give the girl a safer life than she could on Hapes."}, {"tag": "h3", "text": "Post-Second Galactic Civil War (43 ABY–)"}, {"tag": "h4", "text": "Origins of the Millennium Falcon"}, {"tag": "p", "text": "Han and his wife were able to come to some terms with losing their other son and they busied themselves by taking care of their granddaughter, given the name \"Amelia\" to hide her identity. While on an outing in the Falcon with Leia and Allana, the young girl found a camouflaged transponder aboard the Falcon. It had been placed there more than half a century before by the Republic Group, an organization that tried and failed to keep the Republic together and honorable in its waning years. It was meant to find its way to the planet of Toprawa, but a collision with another craft had made this impossible. Because Han and Leia had been telling Allana about how Han had acquired the Falon, she thought that they could track down all the people who had owned the ship, finding out what the mysterious component was along the way. Her grandparents agreed."}, {"tag": "p", "text": "They traveled to the planet of Lujo to visit Lando Calrissian and his family at on of their homes, where they stayed for a few weeks. Han asked Calrissian who he had won the Falcon from and Calrissian pointed him to Cix Trouvee. Additionally, one of Calrissian's technicians, Tal-lik-Tal, examined the transponder and found that it was comparable to pre-Imperial designs and still active."}, {"tag": "h4", "text": "Lost Tribe of Sith emergence"}, {"tag": "p", "text": "After Natasi Daala was elected the new Galactic Alliance Chief of State, tensions began to rise between the government and the Jedi Order. This eventually resulted in the arrest of Luke, though after an agreement between Skywalker and Daala, Luke exiled himself from the Jedi Order and subsequently began a quest to learn what had lead to Jacen's fall to the dark side. The Solos were soon contacted by Lando and were forced to aid him in saving the planet of Kessel which had succumbed to violent earthquakes at the time Centerpoint Station was destroyed. The Solos discovered a strange species of pure energy based beings living within Kessel, who monitored every gravity well in the galaxy, and who had begun to leave en masse, causing the earthquakes that wreaked across Kessel. Ultimately, however, the Solos and their allies proved able to save Kessel from destruction. Later, Han and Leia traveled to Dathomir, as Luke had tracked a Sith girl there. Solo had several adventures on the world, such as an attack by Nightsisters. Han and Leia then returned to Coruscant, and Han was newly appointed as a general. Solo later participated in the coup that removed Natasi Daala as Chief of State and placed the Jedi in charge of the government, and then he traveled with Leia and Allana to the planet Klatooine in order to end a slave rebellion there."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Han Solo was known for his cockiness, dry wit, rudeness, piloting skills, and his fast draw. He also had an affinity for Sabacc and other gambling games. He often boasted of his achievements he made in his ship the Millennium Falcon, such as making the Kessel Run in less than twelve parsecs, and being able to outrun Imperial Star Destroyers. Captain Solo was quite the mechanic, having made countless modifications to the Falcon alongside Chewie. He once said he preferred to shoot first as opposed to shooting second, and used to his advantage on at least one occasion the fact that he was ambidextrous. Han Solo was also one of the few people to evade Boba Fett on multiple occasions. During the Second Galactic Civil War, when he began to distrust the New Jedi Order because of his beliefs that Corellia should be able to have independence, Leia often referred to him as \"the most dangerous man in the galaxy\"."}, {"tag": "p", "text": "Han was not known to be Force-sensitive, unlike his wife, children and many of his friends, although due to his experience with the Force via his friends and family, he was Force-attuned. Despite his family and frequent companions including some of the most powerful Jedi in the galaxy, Han was far from helpless in comparison. His ability to think up inventive and often extremely unorthodox solutions to problems on the fly proved to be a constant source of frustration to all enemies he encountered (and often his friends). This, combined with Han's peerless skill at the hands of the Millennium Falcon as well as the legendary \"Solo Luck\" more than compensated for any lack of Force sensitivity. During his daughter Jaina's wedding, however, Jaina speculated that he may have potentially possessed a mild form of Force-sensitivity."}, {"tag": "p", "text": "He was, however, a man with insecurities as well. He was overprotective of his ship and hated times when the Falcon was modified or repaired too much, especially by droids, as tight bolts on the craft wouldn't let him feel how hard they were hit by laser fire, resulting in him loosening several of them around the ship. He was also hesitant to let Chewbacca, Lando or anyone else fly it. Han also vowed jokingly to never give the codes for the Falcon to his son Jacen, at least not in his lifetime."}, {"tag": "p", "text": "Among the multiple skills he developed during his early career, Han Solo became familiar with the practice and details of dishwashing."}, {"tag": "p", "text": "Han Solo was known to dislike droids and discouraged them from travelling in his ship, although he relented in certain circumstances. After he joined the Rebellion, he allowed C-3PO and R2-D2 free access to the Falcon, as a special case and in attention to Luke Skywalker's and Leia Organa's wishes; Solo nevertheless rarely had a good word to any of the droids."}, {"tag": "p", "text": "He had a particular distaste for \"bugs\", as he revealed during the Swarm War, probably due to the run-in with Kamarian religious fanatics early in his smuggling career. Han also had a loud snore which bothered Leia."}, {"tag": "p", "text": "In addition to speaking his native Basic, Solo fluently understood many other languages, including Shyriiwook, Trader's argot Rodese, Illodian, and Huttese. He could also imperfectly speak Mandaba, the Selonian language. Although he spoke Basic with a Corellian accent for much of his life, he had developed more of a Coruscanti accent by 40 ABY."}, {"tag": "h2", "text": "Romances"}, {"tag": "p", "text": "During his life, Han Solo had several romances."}, {"tag": "h3", "text": "Bria Tharen"}, {"tag": "p", "text": "His first serious relationship occurred during the time Han was working for Besadii on Ylesia. Known to him only as \"Pilgrim 921\", Bria Tharen immediately attracted Han's attention thanks to her facial features and Corellian accent, even as she was processing glitterstim in the complete dark. Together they fled Ylesian \"paradise\" and made their way to Bria's home on Corellia and the couple eventually traveled to Coruscant, where Han planned to apply to the Imperial Academy. It was there when Bria left Han to confront her addiction to the Exultation after she helped her lover to obtain the money for \"buying the new personality\". This relationship haunted Han for a very long time and forced him to make a decision not to fall in love again."}, {"tag": "p", "text": "They would eventually meet again during the Rebel raid on Ylesia. Unfortunately, it turned out that Bria was using Han and other smugglers for the Rebel gains. Even after this incident, Han would later feel sorry for her and sadly pass on the message about Bria's death to her family."}, {"tag": "h3", "text": "Xaverri"}, {"tag": "p", "text": "His \"second\" relationship five years after his breaking up with Bria Tharen was with traveling magician and illusionist named Xaverri. They met after her performance on Nar Shaddaa, started going out and on their fourth date, Xaverri revealed her past to Han, who in turn shared his own background and troubles with the Empire. She also told Solo that this was the first tour where she hadn't spent her spare time plotting against the Empire. Han offered his services as an assistant for her show and a pilot, and she agreed. Shortly after, Xaverri and Han deepened their relationship to an intimate level. Feeling that being around Han and Chewbacca had made her too soft, too vulnerable, and too attached to him, she left him after several months."}, {"tag": "p", "text": "They would later team up during the Battle of Nar Shaddaa and eventually after many years on Crseih Station. Han would later reflect that he might have had a future with her if she hadn't left him."}, {"tag": "h3", "text": "Salla Zend"}, {"tag": "p", "text": "Being his fellow smuggler, Salla Zend \"replaced\" a position of Han's girlfriend after his unsuccessful romance with Xaverri. In time, the initially harsh woman became more attached to Han. Not feeling the same way, he was forced to virtually \"escape\" from her."}, {"tag": "p", "text": "She never forgot his actions and upon meeting again during the resurrected Emperor crisis reminded him of what he had done."}, {"tag": "h3", "text": "Katya M'Buele"}, {"tag": "p", "text": "At some point in his smuggling career, Han Solo partnered with Katya M'Buele, with whom he infiltrated the restricted world of Skye. They were the sole survivors of that unfortunate smuggling operation. Solo met M'Buele again two years after the Battle of Yavin, but Katya was killed shortly thereafter by a Smoke Demon under the control of Majestrix Kharys of Skye."}, {"tag": "h3", "text": "Leia Organa"}, {"tag": "p", "text": "Han first spotted her when she was just a little princess on a lap of Viceroy Organa, whose prerecorded message welcomed all ships arriving on Alderaan. After ten years, when they actually first met, the two got off to a rocky start; however, as they worked together during the Galactic Civil War, Leia and Han developed a relationship that would last throughout the war. Their love fully manifested shortly before Han's capture by Boba Fett. Despite Leia's later occasional suitors like Fenn Shysa or Prince Isolder, Han never lost his \"femme fatale\" from sight."}, {"tag": "p", "text": "In 8 ABY, the two were married and had three children, Jaina, Jacen, and Anakin Solo, in the next two years. Even with the death of their youngest child Anakin and estrangement and death of Jacen in 41 ABY, their relationship grew stronger. By the time of 43 ABY, having been married for more than thirty-five years, they loved each other even more than they did in 8 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Origins and development"}, {"tag": "p", "text": "Han Solo was created by George Lucas during the development of Lucas's 1977 film Star Wars, and is present in Lucas's 132-page The Star Wars: Rough Draft, completed in May 1974. In the draft, Solo is a Ureallian, and is described as a huge green-skinned monster with no nose and large gills. He is a member of the Jedi Bendu and an old friend of General Skywalker. As Lucas refined his story, Solo evolved into a burly, bearded, flamboyantly-dressed pirate. Although Lucas had originally intended for Solo to be a nefarious alien character, he settled on the idea of a Human so that he could develop more of a relationship between the film's three primary characters. Chewbacca thus filled the role of the alien sidekick. By August 1975, when Lucas had written his third draft, Solo was described as: \"A tough James Dean style starpilot about twenty-five years old. A cowboy in a starship -- simple, sentimental and cocksure of himself.\" This incarnation of Solo's character went on to appear in the finished film."}, {"tag": "p", "text": "While developing Solo's character, Lucas defined him in relation to the film's hero, Luke Skywalker. Selflessness was an important theme throughout the film, and Skywalker was a selfless young idealist. Lucas thought of Solo as the sidekick with contrary morals to the hero, and wrote him as a selfish character. Harrison Ford, who portrayed Solo in all three films of Star Wars's original trilogy, has described Solo as the smartass to Skywalker's callow youth, with each character having had a clear section of turf to explore."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "When casting the role of Solo, Lucas sought actors who had individual screen presence as well as chemistry with Skywalker. He wanted Solo to be older than Skywalker and to possess a cynical edge. Lucas desired new and unknown actors to play Star Wars's major roles, and originally forbade Harrison Ford from auditioning, having worked with him on the 1973 film American Graffiti. Ford was working as a carpenter on the set of the auditions, and was brought in by Lucas to feed lines to the actors who were auditioning, including Kurt Russell, Nick Nolte, Christopher Walken, and Perry King. While feeding lines, Ford impressed Lucas by giving the character a mix of mercenary swagger and world weariness, and convinced the director to let him play the part."}, {"tag": "p", "text": "Ford went on to portray Solo in both of Star Wars's sequels, 1980's The Empire Strikes Back and 1983's Return of the Jedi, as well as 1978's The Star Wars Holiday Special. He was hesitant to sign the contracts for the sequels, however, feeling that Solo's character should be killed off. When Lucas was discussing the script of Return of the Jedi with director Richard Marquand and screenwriter Lawrence Kasdan, the three were unsure if Ford would return for the film. Solo's character had been frozen in carbonite during the climax of The Empire Strikes Back, and Ford was a rising star in Hollywood following his starring role as Indiana Jones in 1981's Raiders of the Lost Ark. Ford himself thought that Solo should die in Jedi, sacrificing himself to save Skywalker and Princess Leia. He reasoned that Solo had no family, future, or responsibilities to the story, and that his death would give the story some resonance. Kasdan also believed that a major character death early in Jedi would keep audiences worried, believing that none of the characters were safe. Lucas vetoed the idea, however, and Solo ultimately survived."}, {"tag": "p", "text": "The script of The Empire Strikes Back originally called for Solo to respond to Princess Leia's declaration of \"I love you\" with \"I love you too\". Ford disliked the line, feeling that the established character of Solo wasn't being taken advantage of. After many takes, director Irvin Kershner wasn't satisfied either. He told Ford not to think about it, and to say whatever he thought that Solo would say. When Ford improvised the line \"I know\", Kirshner felt that it was perfect for the character, and it was included in the film's final cut."}, {"tag": "p", "text": "Solo was voiced by Perry King in the trilogy's three radio dramas, and by various voice actors in different Star Wars video games: Neil Ross in Star Wars: Rogue Squadron, Star Wars: Masters of Teräs Käsi and Star Wars: Force Commander, David Esch in Star Wars: Galactic Battlegrounds, Lex Lang in Star Wars: Rogue Squadron III: Rebel Strike and Star Wars: Battlefront II, and John Armstrong in Star Wars: Empire at War and Star Wars Galaxies. James Gaulke leant his vocal talents for the Dark Forces: Jedi Knight audio drama, and Joe Hacker for the audio adaptations of Dark Empire, Dark Empire II and Empire's End."}, {"tag": "h3", "text": "In Star Wars media"}, {"tag": "p", "text": "In addition to all three installments of the original trilogy, Solo has appeared in a wide variety of Star Wars novels, comic books, video games, and other media. In the late 1970s, he was the focus of some of the earliest Expanded Universe material. After Marvel Comics adapted the first Star Wars film into a six-issue series, they began producing original stories in 1978; the first story arc focused on Solo and Chewbacca teaming up with a group of starhoppers on Aduba-3. Author Brian Daley wrote The Han Solo Adventures in 1979 and 1980, novels which told tales of Solo's life as a smuggler before he joined the Rebellion."}, {"tag": "p", "text": "Solo played a starring role throughout Marvel's 107-issue run, as well as in the concurrent newspaper comic strips published by the Los Angeles Times Syndicate. Throughout the 1990s, he was a primary character in many of the novels and comics published by Bantam Spectra and Dark Horse Comics set after the events of Return of the Jedi. These stories saw him marry Princess Leia, sire three children, battle an extra-dimensional blob, become a Commodore in the New Republic military, and play a large role in bringing the Galactic Civil War to a close. However, when The New Jedi Order book series was being crafted in 1998 and 1999, its planning team felt that many of Bantam's authors hadn't quite known what do with Solo. Solo was one of the stars of the nineteen-book series, first slipping into alcoholism and depression after the death of Chewbacca, but gradually overcoming his grief and helping the galaxy repel the extragalactic invaders known as the Yuuzhan Vong. He has continued to be a major character in subsequent stories taking place up to 43.5 years after the events of the original Star Wars film."}, {"tag": "p", "text": "Author A. C. Crispin wrote a trilogy of novels in 1998 about Han Solo's youth. The trilogy built off of Daley's earlier books as well as several other works, consolidating many existing elements of the character's past while telling a story of its own. Many of these elements, particularly ones originating in Daley's works, would show up in author James Luceno's Agents of Chaos Duology, two novels written in 2000 as part of The New Jedi Order. The duology focused heavily on Solo, owing to Luceno's desire to pay homage to Daley, who was a good friend of his and who had passed away in 1996. Luceno hoped for the duology's first installment, Hero's Trial, to be a \"Han Solo, this is your life\" novel. Luceno also wrote The New Jedi Order's final chapter, The New Jedi Order: The Unifying Force, and considered killing Solo in the book. Once again, however, Solo lived to see another day."}, {"tag": "p", "text": "Solo's character has echoed Indiana Jones in several works. In Dark Nest I: The Joiner King, his line \"Bugs! Why did it have to be bugs?\" is a probable nod to Jones's nearly identical line regarding snakes in Raiders of the Lost Ark. The Paradise Snare sees Solo adopt the alias \"Jenos Idanian\", an anagram of \"Indiana Jones\"."}, {"tag": "p", "text": "Several unused concepts and shots of Solo exist within Star Wars film lore. The scene that sees Luke Skywalker, Obi-Wan Kenobi, and the viewer first meet Solo and Chewbacca in the original film was at one point set to feature Solo sitting with and kissing a woman named Jenny. A young Han Solo was slated to appear on Kashyyyk in 2005's Star Wars: Episode III Revenge of the Sith, living among the planet's Wookiees as well as assisting Yoda. No actor was cast and the character was cut from the final draft. However, the concept was somewhat recycled in the non-canon LEGO Star Wars: The Padawan Menace (where the character is voiced by Katie Leigh) and Jaybo Hood in the Star Wars: The Clone Wars episode \"Mystery of a Thousand Moons\"."}, {"tag": "h3", "text": "Actor and author comments"}, {"tag": "p", "text": "Harrison Ford has referred to Solo as an inherently relatable character to audiences, owing to his separation from the overarching mythological themes of the saga. However, he saw Solo as a chess piece that could be moved around and even killed, as the character wasn't as important to Star Wars as its Force-using characters. Ford has called Solo a thin character, and one that wasn't interesting enough to be developed throughout several sequels, unlike Indiana Jones. As such, Ford thought that if Solo died in Return of the Jedi, it would introduce a needed complication for the character and give the story resonance."}, {"tag": "p", "text": "In the words of George Lucas, Solo is \"a loner who realizes the importance of being part of a group and helping for the common good.\" James Luceno has identified Solo as one of his favorite characters to write, owing to the humanness of the character. Luceno feels that Solo has often been type-cast in novels, unable to grow and evolve in the same way as his Force-using family, and found the process of writing him as older, isolated, and grief-stricken during Agents of Chaos challenging. Author Troy Denning has similarly identified Solo as one of his favorite characters, due to his wit and his ability to always have a comeback."}, {"tag": "h3", "text": "Impact on popular culture"}, {"tag": "p", "text": "Following his appearances in the original trilogy, scores of Han Solo merchandise were produced, including a variety of action figures, as well as busts and soap. A Han Solo-themed mini fridge was proposed, but never made it past the pitch stage."}, {"tag": "p", "text": "In 2005, Solo placed #14 on the list of greatest film heroes composed by the American Film Institute. The criteria involved in the lists's selection included cultural impact, legacy and inspiration to contemporary artists and audiences, and heroism defined as prevailing in extreme circumstances coupled with a sense of morality, courage and purpose. Empire magazine deemed Solo the fourth greatest movie character of all time, citing him as full of charm and laconic cool that was brought by Harrison Ford. The magazine Entertainment Weekly ranked him at #7 on their list of the all-time coolest heroes in pop culture, and the website Fandomania.com placed him at #15 on their 2009 list of the 100 greatest fictional characters."}, {"tag": "p", "text": "The developers of the 2008 video game Prince of Persia cited both Solo and Indiana Jones as having inspired their nameless protagonist. Actor Chris Pine also named both characters as sources he drew upon when preparing to play James T. Kirk in the 2009 film Star Trek, mentioning their humor and \"accidental hero\" traits."}, {"tag": "p", "text": "Solo's likeness has been used in a variety of media, including the American television shows Mind of Mencia and Robot Chicken. In the cartoon Family Guy's Star Wars-themed episodes Blue Harvest and Something, Something, Something, Dark Side, the character Peter Griffin plays the role of Solo. Mel Brooks's 1987 Star Wars spoof Spaceballs features a character named Captain Lonestar, who parodies both Solo and Skywalker."}, {"tag": "h4", "text": "Han shot first"}, {"tag": "p", "text": "When George Lucas made a slight edit to one of Solo's scenes for the 1997 Special Edition of the original Star Wars film, the change and its consequent fan response developed into somewhat of a pop culture meme. The original version of the film depicted Solo shooting the bounty hunter Greedo before Greedo could fire a shot of his own, but the Special Edition added in a laser blast from Greedo that preceded Solo's shot but harmlessly hit the wall. Many fans disapproved of the change, and an online petition that called for Lucas to re-release the original cut of the scene was signed by thousands. T-shirts were produced reading \"Han Shot First\", and Lucas was even spotted wearing one on the set of the 2008 film Indiana Jones and the Kingdom of the Crystal Skull."}, {"tag": "p", "text": "The concept of Solo shooting first has been parodied in the dialogue of various Star Wars novels and video games, although Solo states that he enjoys shooting first, rather than second, in the 1979 novel Han Solo at Stars' End, written eighteen years prior to the release of the Star Wars Special Editions. The non-canon comic story \"The Emperor's Court\" sees Solo argue with Greedo's mother in court over who shot first. Arguments over the subject appear in the films Jay and Silent Bob Strike Back and Clerks II, and a scene from the 2005 movie Serenity was inspired by the debate. When the original versions of the Star Wars trilogy were released on DVD in 2006, a promotional article on StarWars.com stated that fans could \"yes, see Han Solo shoot first.\""}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "Solo has appeared in several Star Wars stories that fall outside of continuity. Each story operates independently of all others, existing in its own non-canon universe. One such story is \"Into the Great Unknown\", a short comic which appeared in 2003's Star Wars Tales 19. Han Solo and Chewbacca flee from an Imperial fleet by executing a blind jump into hyperspace, and end up crashing the Millennium Falcon into the Pacific Northwest of the planet Earth. After leaving their downed ship to investigate their surroundings, Solo is killed by Native Americans. 126 years later, Indiana Jones and his partner Short Round investigate Solo's corpse and the remains of the Falcon, and Jones dubs the scene \"eerily familiar\". Author Haden Blackman has cited the story as one of the most fun Star Wars tales that he's attempted."}, {"tag": "p", "text": "Another Tales comic which features Solo is \"Ghost\", published in Star Wars Tales 11 in 2002. During the Dark Times, Solo is attempting to find a lost treasure and encounters the former Jedi Quinlan Vos. He later discovers that the treasure is Vos's lightsaber. Star Wars Tales 14 features The Emperor's Court, where Greedo's mother sues Solo for the murder of her son. Emperor Palpatine presides over the case as Solo argues the events of the Star Wars Special Edition and Greedo's mother claims the validity of the original version of the film. When she calls in Lak Sivrak, an alien who was removed from the cantina scene in the Special Edition, Solo questions his testimony by claiming that he wasn't actually present. Palpatine rules against Solo and sentences him to life imprisonment in carbonite. Solo also appears in the video game LEGO Star Wars II: The Original Trilogy."}, {"tag": "p", "text": "From 2001 to 2004, Dark Horse Comics published alternate takes on the original Star Wars trilogy, with each tale altering one pivotal moment in the film and exploring the hypothetical consequences. In Star Wars Infinities: A New Hope, Luke Skywalker's proton torpedoes detonate prematurely and fail to destroy the Death Star. Yavin 4 is destroyed by the battle station's superlaser, and the Millennium Falcon and Luke's X-wing flee through the debris field as Grand Moff Tarkin and Darth Vader capture the escaping Rebel fleet. After rendezvousing in another system, Skywalker and R2-D2 abandon their battered X-wing and board the Falcon. When Solo tells Skywalker that the Rebellion is over, he is attacked by the emotionally heated youngster. Skywalker only stays his lightsaber blade when the spirit of Obi-Wan Kenobi appears and tells him to go to Dagobah. Solo gives Skywalker a ride on the Falcon, and lands the ship in the planet's swamps without incident. Yoda appears and brings the group to his hut, where Solo alone realizes that the small green being is Yoda himself. He shares his discovery with his impatient companion, who goes on to train in the Jedi arts under Yoda while Solo and Chewbacca remain on the planet and tinker with the Falcon. After two months, the pair of smugglers depart the planet, promising to come back if Skywalker ever needs a lift."}, {"tag": "p", "text": "Five years later, Solo and Chewbacca are at a cantina on Ord Mantell, and see a holovid of Princess Leia, now a servant of Darth Vader, addressing the citizens of the Empire from Coruscant. Infuriated, Solo breaks his chair over his table, and draws the attention of bounty hunters and Imperial stormtroopers. He and Chewie manage to reach the Falcon, and dodge an orbiting Imperial fleet en route to Dagobah. After once again arriving on the swamp world, Solo makes his way into the dark side cave as Skywalker is performing the final test of his Jedi training. He and Chewbacca then join Skywalker, Yoda, and R2-D2 for dinner, and inform Skywalker that Leia is alive. Yoda then reveals that Skywalker is the son of Vader and the sister of Leia, and the entire group prepares to depart for Coruscant."}, {"tag": "p", "text": "After arriving at the Imperial throneworld, Solo drops Yoda and R2-D2 off on the Death Star, and leaves with the aid of a mind trick by Yoda. He and Skywalker then land onworld while Chewbacca keeps the Falcon airborne, and storm the Imperial Palace. As Leia wants them to find her, the only resistance they encounter is four Royal Guards armed with double-bladed lightsabers. Solo and Skywalker fight them off, and Solo strikes the final blow by seizing one of the lightsabers and stabbing a guard in the back. C-3PO then arrives and escorts them to Leia's throne room, where she awaits with Vader and the Emperor. Reprogrammed to serve the Empire, the protocol droid places a blaster to Solo's head and forces him to watch Skywalker duel his sister. Skywalker redeems Leia, and the Emperor begins casting Force lightning against them both before Vader turns on his master. Skywalker incapacitates C-3PO but forces Han to carry the droid, and the group cuts their way through stormtroopers before boarding the Falcon and fleeing the planet as Yoda crashes the Death Star into the Emperor's Palace. Many years later, the group attends a ceremony electing Leia as Chancellor of the New Republic."}, {"tag": "p", "text": "In Star Wars Infinities: The Empire Strikes Back, when Solo finds Skywalker in a Hoth snowstorm, Skywalker dies in his arms, having been attacked by an additional Wampa in the cave. Skywalker's dying words tell Solo to go to Dagobah to train as a Jedi. The Empire catches the Rebels unaware during Skywalker's funeral, and Solo and Chewbacca take Princess Leia and the droids on the Falcon during the melee. Rather than fly into an asteroid field, they attach themselves to a Star Destroyer right away, and float away with the garbage to go to Cloud City and get their hyperdrive repaired. Lando Calrissian receives them, and discovers that Boba Fett followed them and arrived at the same time. Solo and Chewbacca team up with Calrissian's forces to incapacitate Fett, and the bounty hunter is frozen in carbonite. With a repaired hyperdrive, Solo and his crew leave the planet to go to Dagobah."}, {"tag": "p", "text": "On Dagobah, they come across Yoda, and Solo demands to be trained as a Jedi. When Yoda informs him that Skywalker's message was actually meant for Leia, he reluctantly departs, letting Leia begin her Jedi training. Solo and Chewbacca spend the next three months saving up enough credits to pay back Jabba the Hutt, and contact the smuggler Vilmarh Grahrk to deliver the funds from Mos Eisley. Grahrk betrays them to a team of Gand bounty hunters and takes their ship, and Solo, Chewbacca, and the droids are brought to Jabba's Palace. Solo and Chewbacca are thrown into a pit of Nexu, but are rescued when R2-D2 opens the pit door. Solo, Chewbacca and R2-D2 escape while the Nexu overrun the Palace, and return to Dagobah to see if Leia has completed her training. When they find her dueling Darth Vader, Solo and Chewbacca fire their blasters at his face, killing him. Yoda passes away and becomes one with the Force, and during Vader's funeral pyre, the surviving group declares that they have a galaxy to save."}, {"tag": "p", "text": "Finally, Star Wars Infinities: Return of the Jedi sees Solo not released from carbonite until well after the events of Jabba's Palace. When the Hutt beheads C-3PO during negotiations with Leia in her bounty hunter disguise, Leia is left without a translator, and removes her helmet, causing a scene that ends with her thermal detonator activating and slipping from her fingers. She, Chewbacca, and Calrissian are able to escape as the Palace explodes, but fail to catch Boba Fett, who brings Solo aboard the Slave I and flees Tatooine. While pursuing him through the palace, Leia accidentally fires on Solo's frozen form. After rendezvousing with Skywalker and R2-D2, they begin searching for Fett, eventually locating him in the Outer Rim. They recover Solo and steal the Slave I, and a medical team unfreezes Solo at the Rebel fleet near Sullust."}, {"tag": "p", "text": "The blaster shot received from Leia causes Solo to be permanently blinded after being released from the carbonite. When a message arrives from Skywalker indicating that he has been captured by the Empire, Leia takes the Slave I to Endor to rescue him, and Solo joins Calrissian and Chewbacca on the Falcon as the Rebel Fleet follows her and strikes at the Death Star. Calrissian takes the Falcon to the moon's surface, and when Chewbacca is injured by pursuing TIE fighters, Solo mans the guns, firing blindly as Calrissian aims them at the shield generator. Rebel ground forces have already weakened the generator, and Solo's blasts finish the job. The Falcon then boards the Death Star to recover Skywalker, Leia, and a redeemed Darth Vader. After the station is destroyed, Vader joins the Rebel Fleet and efforts are begun to track down the Emperor, Han now wearing a helmet that is apparently intended to compensate for his lost eyesight."}, {"tag": "p", "text": "Hear Han Solo"}, {"tag": "p", "text": "Han Solo and Chewbacca appeared in the ambiguously canon scenario for Star Wars Miniatures, The Theft of Vader's Helmet, in which they infiltrate the Executor to steal Darth Vader's helmet sometimes during Admiral Piett's captaincy of the Executor."}, {"tag": "p", "text": "In the Battle of Endor DLC for Star Wars: The Force Unleashed II, Darth Vader sends the Dark Apprentice to stop the rebels from destroying the shield generator bunker protecting the second Death Star. As the Dark Apprentice approached the bunker, Han Solo told Chewbacca they must buy time for Princess Leia to set the bombs to destroy the bunker. Chewbacca engaged the Dark Apprentice with a stolen AT-ST while Han took shots at him with a rocket launcher. Despite assistance from the Ewoks, they were unable to defeat him. The Dark Apprentice heavily damaged the walker, then incapacitated Chewbacca and lifted him into the air with one hand. Han attempted to save his friend by firing two shots from his blaster, only for the Dark Apprentice to use Chewbacca as a shield, killing him much to Han's horror. Enraged, Han opened fire with his blaster, but the Dark Apprentice easily deflected the shots with his lightsaber, then lifted him into the air with the Force and impaled him, killing Han. As a result of Han and Chewbacca's failure, the Dark Apprentice was able to destroy the bombs and kill Leia, resulting in the Empire's victory over the Rebel Alliance."}, {"tag": "p", "text": "On July 22 2011, Han made an appearance in LEGO Star Wars: The Padawan Menace as a young boy who escapes an orphanage and ends up joining Yoda in a quest to recover stolen battle plans from the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Translations"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}