{"url": "Han_Solo_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Han Solo"], "nodes": [{"tag": "h1", "text": "Han Solo 5"}, {"tag": "p", "text": "Han Solo 5 is the final issue of the five-part Marvel comic book miniseries Star Wars: Han Solo. Released on November 23, 2016, it was written by Marjorie Liu, with art by Mark Brooks."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "The race announcer states that the current Dragon Void Run will go down as the most unpredictable and thrilling race in a thousand years, adding that this is the first time that the Galactic Empire has intervened in the race. The Imperials order the remaining racers to shut down their engines and prepare to be boarded. They warn that the consequences of disobedience will be severe."}, {"tag": "p", "text": "Han Solo asks the racers if they have weapons on their starships. Nowk Asil says they are not smugglers and thus don't carry weapons. Delan Vook asks who in their right mind would fire on the Empire. Not intimidated by the Empire, Chewbacca opens fire on a TIE fighter. Vook dismisses Solo as a fool and decides to pull out of the race, saying his sponsors will bail him out of any trouble the Empire wants to accuse him of. Dorae tells Solo that the Elomin Aran has been murdered."}, {"tag": "p", "text": "As the announcer gives a running commentary of the race, Loo Re Anno convinces the pilots including Vook to follow her, telling them that this is a race for the firsts and that none of them have reached the void yet. Loo Re Anno's ship activates an energy field, which causes a massive tentacled creature to emerge from the seams between space and time and devour several of the pursuing TIE fighters. Loo Re Anno's actions impress Solo."}, {"tag": "p", "text": "The racers then fly into the jaws of the void for the last and most dangerous leg of the race. Solo tells Chewbacca to keep an eye on the Millennium Falcon's fuel supply so that they do not get stranded here. He regrets taking up a mission from Leia Organa. Dorae blames Solo's ego for dooming them and the Rebellion while Bot describes them as a bunch of killers. While Solo comes to terms with the murder of Aran, Dorae warns that they won't be able to jump to hyperspace in the void and could get stranded here. U'Il warns that if they are not the first ship to make it to the finish line, they will be stranded in space until someone comes to pick them up. She fears they will be tortured by the Empire."}, {"tag": "h3", "text": "Exposing the double agent"}, {"tag": "p", "text": "While examining Aran's body, U'Il believes that the Elomin was poisoned. Solo states that he loves his ship and that he is unhappy that someone was murdered in his home, which makes him angry. Dorae thinks that Solo is addressing her but he clarifies that he was addressing the Duros Bot. Bot denies he is a killer. Solo responds that if it wasn't him, Chewbacca, Dorae or U'Il, that only rules out Bot. Dorae questions Solo's reasoning but U'Il tells her to hush."}, {"tag": "p", "text": "Bot screams that he is not a killer before lunging at Solo with a concealed needle. Solo grabs the Duros and headbutts Bot. Chewbacca grabs Bot by the ankle and attempts to restrain him. Bot however injects himself in the neck with the needle while screaming that he is not a killer. Dorae thinks that Bot is poisoned but U'Il reassures him that his kind is immune to the poison. While Solo thanks Chewbacca, Dorae asks why Bot keeps repeating that he is not a killer. U'Il replies that Bot did not betray the Rebellion by choice but was compromised and brainwashed by the Empire. U'Il believes that Bot killed the other informants under Imperial influence."}, {"tag": "p", "text": "As Solo and Chewbacca return to the cockpit, he tells U'Il and the others to keep an eye on Bot. Solo grumbles that their problems used to be so simple. Chewbacca says in Shyriiwook that he would like to help the Rebellion, prompting Solo to comment that he is way more noble than himself. Solo describes himself as a nobody smuggler and that he likes it that way."}, {"tag": "h3", "text": "The finishing line"}, {"tag": "p", "text": "Sensing Loo Re Anno's witness, Solo contacts the ancient pilot, asking her what she plans to do after the race. Loo Re-Anno replies that her ship is her home. As for the race, Loo-Re Anno says that she will either win or will die. She explains that she is the last surviving member of her species in the galaxy with her only companions being her witnesses, who do not know what they will become."}, {"tag": "p", "text": "She admits that she is tired of being alone. Loo Re Anno explains that a long time ago, she chose to ignore the lessons of her grandmother and rejected all offers of friendship and community. She wrongfully believed that she was strong and could only learn about herself in solitude. Loo Re Anno says that by the time she realize it was too late. As the ships approach the finishing line, the TIE fighters close in."}, {"tag": "p", "text": "Dorae straps in and Solo asks if she is as good a pilot as she claims to be. Since their power levels are low, Solo warns Chewbacca that they won't be able to use the deflector shield in order to save enough power to reach the finishing line, which is occupied by a gate. This gate is a piece of ancient technology capable of creating a wormhole to the start of the race. The first ship through the gate wins the prize and freedom from the void while the losers are stranded."}, {"tag": "p", "text": "U'Il fears the Falcon cannot outrun the other ships. However, Solo fires up the Falcon's engines, overtaking Vook, Asil and Reat. The Falcon is soon neck in neck with Loo Re Anno. The Imperial TIE fighters continue their pursuit, inflicting damage on Loo Re Anno's ship and causing her to fall behind Solo. The Falcon takes the lead to the delight of the rebel informants. Recalling Loo Re Anno's words, Solo deliberately veers away from the gate and flies towards the TIE fighters. Dorae thinks that Solo wants to die but he replies that she does not know what he wants."}, {"tag": "p", "text": "Loo Re Anno flies into the gate, winning the race. While the announcers ponders about the fate of the racers, Dorae chastises Solo for spurning their lives. U'Il points her blaster at Solo's face and vows not to be taken alive. To the surprise of everyone, the gate reopens from the other side. A fleet of ships  led by Loo Re Anno emerge from the gate and attack the TIE pilots. Loo Re Anno tells Solo that she has reunited with her people, who dwell far away between the seams of time and space. She explains that her people built the gate for their exodus from the galaxy."}, {"tag": "p", "text": "Loo Re Anno thanks Solo for helping her to reunite with her people. As a parting gift, Loo Re Anno tells Solo and the other plots to fly through the gate. As the witness departs, Solo tells it to thank Loo Re Anno for her help. Solo and the surviving pilots emerge back at the start of the race, creating an unprecedented situation with three winners. While the announcer ponders over the unexpected turn of events, Solo tells Chewbacca that it is time to go home. The Falcon jumps into hyperspace."}, {"tag": "h3", "text": "Homecoming"}, {"tag": "p", "text": "As Han Solo and his companions return to the rebel base, he reflects on his life choices to choose the Rebellion over being a lone spacer. Princess Leia meets with the surviving spy Dorae and U'Il, the latter of whom she greets as an old friend. Leia an Solo learns that she had the master list of rebel spies while pretending to be a bodyguard. Leia speaks with Solo, telling him that he could have risked the lives of all the spies for a race."}, {"tag": "p", "text": "Solo quips that his ego could not handle it. While Solo was reckless, Leia concedes that he won against all the odds. While overlooking a balcony, Leia confides that she could trust Solo to do the right thing. Solo tells her not to make it a habit since he won't be around forever. When Leia asks if he plans to leave the Rebellion, Solo tells her that he will stick around for longer since he believes the Rebellion won't survive without him. Leia quips that Solo is being arrogant while Solo addresses her as \"your worshipfulness.\" The two line up their hands together."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}