{"url": "Han_Solo_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Han Solo"], "nodes": [{"tag": "h1", "text": "Han Solo 3"}, {"tag": "p", "text": "Han Solo 3 is the third issue of the five-part Marvel comic book miniseries Star Wars: Han Solo. The issue, released on August 31, 2016, was written by Marjorie Liu, with art by Mark Brooks."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Bailed out"}, {"tag": "p", "text": "While the racing announcer ponders the reason for the Galactic Empire's arrest of all the Dragon Void Run, Princess Leia Organa and General Airen Cracken watch the news on a holoscreen. Cracken thinks that the Empire must have uncovered their plans or that the smuggler Han Solo has betrayed them. Leia refuses to give up on Solo, telling Cracken that Solo is a survivor who will survive this."}, {"tag": "p", "text": "While Solo grapples with his internal fears and doubts, the Imperial officer Tomine announces the end of the Dragon Void Run, claiming it is a disruptive event inciting unrest. He informs the pilots that he recently arrested local criminal elements shooting at each other over the race. Tomine questions Solo why the people were shouting his name. Solo claims that people love him and that it is a curse. However, Tomine believes that Solo is a criminal and dismisses the pilots as \"riffraff.\""}, {"tag": "p", "text": "Turning his attention to Loo Re Anno, Tomine ponders how she became the last surviving member of her species. Loo Re Anno replies that it usually requires help. Tomine also takes an interest in the bright orbs surrounding Loo Re Anno and demands that she gets rid of them . Loo Re Anno refuses since they are living beings. Solo backs Loo Re Anno up, telling the officer that these are just lights."}, {"tag": "p", "text": "Several hooded figures riding on repulsorlift chairs confront Tomine for delaying the race and demanding the release of the pilots. When Tomine refuses, the lead figure warns that the sector's refueling stations, who are sponsoring the Dragon Void Race, may retaliate by denying services to the Empire. The lead figure convinces the officer that the race harms nobody but the pilots themselves. Seeking to avoid conflict, Tomine releases the pilots but warns them to savor it since it may be the last Dragon Void Race. The organisers order the race to commence, much to the cheer of the crowds."}, {"tag": "h3", "text": "The rebel informant"}, {"tag": "p", "text": "After returning to the Millennium Falcon, Solo meets with Chewbacca who has successfully retrieved the rebel spy Bot, who was wounded on the world lying on the first stop of the Dragon Void Race. Bot claims that the Wookiee gave him a paralytic to treat his wounds and grumbles about bein rescued."}, {"tag": "p", "text": "In the cockpit, Solo tells Chewbacca that they managed to obtain their first informant and that they need to stay in the race for the mission to succeed. Solo notices that one of Loo Re Anno's bright orbs has followed them aboard the ship. Solo contacts Loo Re Anno and asks about the bright orb. She does not answer his question but thanks him for saving the lives of his young friends. Before they jump into hyperspace, she tells Solo that they will speak on the other side since they have to race."}, {"tag": "p", "text": "While traveling through hyperspace, Bot enters the cockpit, telling them that he hates space travel. When Solo asks if he was paralysed, the Duros claims that fear of Solo's incompetence motivated his metabolism to kick in. Solo remarks that Bot is too nervous to be a rebel informant and asks how he joined the Rebellion. When Bot claims he was motivated by morals, Solo expresses skepticism. Bot counters that nothing keeps a person loyal when they have to stare down the barrel of a stormtrooper's rifle."}, {"tag": "p", "text": "Bot tells Solo that there is a mole among the rebel spies but claims that the mole is not responsible for the killings. He believes that one of the spies turned. Though only Princess Leia knows their identities and locations, all spies in the network had information on each other. Bot adds that they funneled all of their secrets through one person, who put the pieces together to create the map of leaks inside the Rebellion. This means that none of them can identify the moles and the identity of their master list-holder remains the biggest secret."}, {"tag": "p", "text": "Solo reassures Bot that knowing this information does not make him a killer. Bot wonders whether Princess Leia is the traitor but Solo refuses to be drawn into that question. Since an informant is murdering rebel spies, Solo asks Bot how they would know if the killer has already won. Bot replies that if that were the case, Princess Leia would not have sent Solo out here since she is the only one who knows the master-list holder's identity. When Solo asks Bot if he is the master list-holder, the Duros refuses to confirm nor deny that question. Bot says that the traitor is still out there and that there are only two spies left, meaning that one of them is the murderer. Bot believes that the rescue mission is in danger but Solo replies that nobody is destroying the Falcon."}, {"tag": "h3", "text": "The second leg"}, {"tag": "p", "text": "The announcer tells the remaining Dragon Void racers that the second leg involves the starships having to travel at 150 Vee-nauts through a debris field for the next 12 hours. This leg tests their speed, agility and endurance. Solo tells Bot to strap in and warns this is about to get rough. When Bot asks why he is so excited, Solo explains that a loophole in the race allows disqualified pilots to travel to race plants as a courtesy. He hopes to use this loophole to pick up the remaining spies. As the countdown commences, Solo gets Chewbacca to prepare the accelerators despite it being against the rules. Solo reassures Bot that he can deal with it."}, {"tag": "p", "text": "The ships spend the next 12 hours racing through the debris field, dodging debris and exploding starships. In the 12th hour, the Falcon collides with some debris, damaging its rear deflector. Solo tells Chewbacca to Divert more power to the engines. Just then, Delan Vook's starship uses it grappling hook to latch on to the Falcon, which he uses to overtake Solo's ship. The remaining Dragon Void pilots enter the atmosphere of a sandy planet where they have been given one hour to make repairs and refuel."}, {"tag": "h3", "text": "The second spy"}, {"tag": "p", "text": "After landing the Falcon, Solo tells Chewbacca to keep the engine hot and to check the rear deflector while he goes and find the second spy. The announcer provides running commentary on Solo's decision to leave the airfield. Solo encounters a pair of cam droids but one of Loo Re Anno's bright orbs takes them out to Solo's relief. Solo travels to the informant's house and is greeted by a masked figure. Solo hands a black rebel firebird insignia to the spy. Later, Solo introduces the second spy to Chewbacca. The second spy turns out to be a vengeful feline alien named Dorae, who seeks to settle an old debt with the Wookiee."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Airen Cracken is mistakenly referred to as admiral rather than as a general."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}