{"url": "Han_Solo_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Han Solo"], "nodes": [{"tag": "h1", "text": "Han Solo 1"}, {"tag": "p", "text": "Han Solo 1 is the first issue of the five-part Marvel comic book miniseries Star Wars: Han Solo. The issue, released on June 15, 2016, is written by Marjorie Liu, with art by Mark Brooks."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Everyone's favorite scoundrel gets his very own series! Han is given a top-secret undercover mission for the Rebellion—rescuing a number of informants and spies. His cover for the assignment? Only the biggest and most infamous starship race in the galaxy! You know—the race Han has dreamt of winning his entire life. Will he keep his mind on the mission? And can he manage to pull it off while keeping the lead? Best-selling author Marjorie Liu (X-MEN) comes to the Galaxy Far, Far Away along with superstar cover artist Mark Brooks (ULTIMATE X-MEN) in his return to interior art! Face it, readers—there aren't enough scoundrels in your life!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Tracking Solo"}, {"tag": "p", "text": "Following the Battle of Yavin, Han Solo has taken a step back from the rebel cause and taken several smuggling jobs. While at a cantina, Solo reflects on his recent smuggling work and believes that he is being followed. A Trandoshan named Katrull approaches Solo with a smuggling job but he turns that down due to the Imperial presence in that sector. Katrul warns Solo that the smuggler could develop a reputation for turning down jobs if he continues that way."}, {"tag": "p", "text": "Just then, Solo spots a female humanoid named Selentia, whom he recognizes as someone that has been tracking him down. Solo attempts to leave the cantina but is cornered by a human man named Adame, who tells Solo that he has business to discuss. Solo is about to draw out his blaster but Selentia warns him against it. While walking back, Solo asks the strangers if they have been following him. Adame and Selentia acknowledge they have been followign him and says that they were looking for the right time to confront him."}, {"tag": "p", "text": "Solo brings his companions back to the Millennium Falcon where Chewbacca is playing sabacc with an R5 series astromech droid. Adame shakes Chewbacca's fist, thanking the Wookiee for meeting them here. Solo realizes Chewbacca is acquainted with the pair and asks what is going on. Just then the astromech droid plays back a holographic transmission from Princess Leia Organa, who tells Solo that she needs his help and that Adame and Selentia will brief him. She tells Solo to hear them out."}, {"tag": "p", "text": "Adame and Selentia ask if they can borrow the Falcon for a mission to the Gomar sector. Solo refuses, insisting that nobody pilots the Falcon but him and Chewbacca. When Solo asks why Leia would think that he would let anyone take his ship for a reason, Adame and Selentia reply that they are loyal to the Rebellion first and foremost. Solo is incensed that Leia would ask him to loan his ship, believing that she has overlooked his contribution to the Battle of Yavin. Adame and Selentia agree to respect his wishes."}, {"tag": "h3", "text": "Back with the Rebellion"}, {"tag": "p", "text": "After returning to the Alliance Fleet, Solo confronts Princess Leia, who leads him down a corridor to continue the conversation. When Solo raises the topic of his debt to Jabba Desilijic Tiure, Leia remarks that he must not be a very good smuggler if he still has not paid his debts. Leia then introduces him to General Airen Cracken, the head of security and intelligence for the Rebellion. Cracken expresses his suspicion and distrust of Solo, whom he regards as a smuggler and mercenary."}, {"tag": "p", "text": "When Solo asks General Cracken why he needs his ship, the General replies this is classified. Leia explains that the Falcon is the fastest and best ship they have. Despite his misgivings about Solo, Cracken decides to give the smuggler a chance. He informs Solo that the Rebellion's spy network has been compromised by a wave of killings. He explains that they only have three agents alive who have information that they desparately need and that is why they require their ship."}, {"tag": "p", "text": "Solo is still unwilling to lend them the Millennium Falcon. Leia explains that there is a mole inside the Rebellion and they cannot use their ships or anyone who is officially part of the Rebellion. Leia explains that they have enrolled him and the Falcon in the Dragon Void Run. Since the race passes by three planets, each of the rebel informants have been told to rendezvous with Solo on those worlds. He will retrieve each asset during the race's mandatory refueling period. When Solo raises concerns about the mole alerting the Empire, Leia tells him she and General Cracken are the only ones inside the Rebellion privy to his plan."}, {"tag": "p", "text": "Princess Leia asks if he will do the mission for them. She warns him that the mission comes first and that the race is not his objective but his cover. Solo agrees to accept the mission. To conceal his mission from the other rebels, Princess Leia feigns anger at Solo and slaps him on the face. Solo feigns anger and raises his finger at Leia before leaving aboard the Falcon with Chewbacca."}, {"tag": "h3", "text": "The Dragon Void race"}, {"tag": "p", "text": "Solo and Chewbacca travel to the Dragon Void space station. After arriving, Solo and Chewbacca are greeted by a tracked tour droid, who confirms his registration and identity. The droid briefs Solo about the rules of the race. Contestants are required to refuel at three planets, whose coordinates will be sent to his ship. If they fail to refuel at those planets or make unscheduled planetary stops, they will be disqualified and fined."}, {"tag": "p", "text": "Inside the dining hall, Solo and Chewbacca meet the other contestants including the female Twi'lek pilots Sotna Reat and Nowk Asil, the blue-skinned humanoid Delan Vook, and the female multi-armed alien Loo Re Anno. Reat and Asil recognise that Solo is a smuggler and joke that he does not belong in the race. Vook thinks that the Falcon can't compete against their advanced starships. Loo Re Anno speaks up for Solo, believing that he has heart and the loyalty of his crew. Defending Solo, she says that she and her ship are old but the other pilots don't question their skill. Speaking to Solo, she observes that he is so young, which she describes as both an honor and a curse. Vook tells a curious Solo that the female alien is the legendary racer Loo Re Anno, who is the oldest among them. He thinks it may be her last race."}, {"tag": "p", "text": "Later, as the ships line up at the starting line, Solo reassures Chewbacca that he is not nervous. He also insists that they are going all the way despite Leia's orders. At the announcer's signal, the ships jump into hyperspace. Solo thinks the race will be easy but changes his mind after exiting hyperspace and finding the ships under attack."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}