{"url": "Han_and_Chewie_-_A_Lifelong_Partnership", "categories": ["Category:Real-world articles", "Category:Star Wars Galaxy of Adventures episodes"], "nodes": [{"tag": "h1", "text": "Han and Chewie - A Lifelong Partnership"}, {"tag": "p", "text": "\"Han and Chewie - A Lifelong Partnership\" is the thirty-sixth episode of Star Wars Galaxy of Adventures. It premiered on the Star Wars Kids website and YouTube channel on July 13, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Aboard Tobias Beckett's stolen Y-45 armored transport hauler, Han Solo thanks Chewbacca for helping him get out of there. The video flashes back to Solo convincing Chewbacca to help him escape the pen beneath Camp Forward on the planet Mimban. Working together, they bust their way out of the pen, knocking over the two Imperial Swamp troopers guarding it."}, {"tag": "p", "text": "The narrator explains that in a \"galaxy of adventures\", an unexpected friendship can last a lifetime. Han and Chewie jump out of the pit, still chained together. Han smiles and gives Chewie a thumbs up. The two then flee across the trenches of Mimban as AT-DT walkers exchange fire with the Mimbanese Liberation Army."}, {"tag": "p", "text": "The video then flashes forward to Han and Chewbacca battling range troopers aboard an 20-T Railcrawler conveyex transport on Vandor. Chewbacca almost falls off the train into the abyss but Han grabs his hand. The video then flashes forward to Chewbacca holding onto Han and Lando Calrissian above the Great Pit of Carkoon while the sarlacc roars. The video then flashes to Chewbacca pulling Han to safety during a skirmish with an Imperial Viper probe droid on Hoth. Han manages to shoot down the probe droid."}, {"tag": "p", "text": "This is followed by shots of Qi'ra leading a bound Chewbacca and Han into the spice mines of Kessel in the presence of the Pyke Syndicate; stormtroopers leading a bound Han and Chewie through a corridor; and a bound Han and Chewie being surrounded by several Weequay skiff guards and a disguised Lando on Tatooine. Jabba's Khetanna lies in the background."}, {"tag": "p", "text": "Chewbacca and a disguised Han and Luke storm Detention Block AA-23 aboard the Death Star, battling Imperial Navy troopers. The video returns to Vandor where Han asks Chewbacca what is his name. Regarding Chewbacca as too long, he decides to nickname him \"Chewie.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}