{"url": "Hanar-Ye", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Force ghosts", "Category:Males", "Category:Voss Mystics"], "nodes": [{"tag": "h1", "text": "Hanar-Ye"}, {"tag": "p", "text": "Hanar-Ye was a male Voss who lived on the planet of the same name well before the Galactic War between the Galactic Republic and the Sith Empire. One of the Force-sensitive Mystics of his species, Hanar-Ye died many years before 3640 BBY, and his spirit remained within the Shrine of Healing on Voss alongside fellow Mystics Shanatka-Lo and Laeras-Wu to teach Force rituals to other Mystics and healers. The three Mystics' spirits taught the Sith Lord Fulminiss a healing ritual at the request of the Mystic Valen-Da, and though Fulminiss corrupted the ritual with the dark side of the Force, the three spirits remained confident in the wisdom of their fellow Mystic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Voss male Hanar-Ye was born on the planet Voss and spent his whole life on his homeworld. A Force-sensitive, Hanar-Ye became a Mystic who was capable of seeing the future. Hanar-Ye died sometime well before 3640 BBY, but his spirit remained behind in the Shrine of Healing on Voss along with the spirits of fellow Mystics Shanatka-Lo and Laeras-Wu. The three spirits shared their knowledge with visiting Mystics and healers, including the secrets of a healing ritual that could heal the mind of a patient by drawing on the strength of many. In the year 3640 BBY, during the Galactic War between the Sith Empire and the Galactic Republic, the Mystic Valen-Da visited the Shrine with the Sith Lord Fulminiss."}, {"tag": "p", "text": "Because Valen-Da was a Mystic and therefore infallible in Voss eyes, Hanar-Ye and his companions taught Fulminiss the healing ritual, though the Sith corrupted the ritual so that it tore open the minds of its victims; the three spirits watched as Fulminiss used the ritual against the healers who had accompanied Valen-Da. Valen-Da and Fulminiss then departed the Shrine, though the spirits witnessed Valen-Da leave a holoprojector in the corner of the chamber with a message for the Voss commando Tala-Reh. When the Jedi Knight known as the Hero of Tython arrived at the Shrine in search of Valen-Da not long afterwards, Hanar-Ye and the others saw the deranged healers attack the Jedi and force the Knight to kill them in self-defense. The three Mystics then appeared to the Knight and explained what Fulminiss had done with the ritual, and they then faded away after informing the Knight of Valen-Da's message for Tala-Reh."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Force-sensitive Voss male, Hanar sported the orange eyes and blue patterned skin that all males of his species did, and his skin was various shades of blue and white. Like all Voss, Hanar-Ye did not possess hair, and he wore Mystic robes that were white and blue in color. As a spirit, the Mystic appeared as a ghostly yellow apparition, and he retained his belief that the wisdom of the Mystics was unquestionable even after his death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hanar-Ye first appeared in the Jedi Knight class mission \"Bloody Pilgrimage\" on the planet Voss in Star Wars: The Old Republic, a video game released by BioWare in 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}