{"url": "Hand_of_Thrawn", "categories": ["Category:Legends articles", "Category:Empire of the Hand", "Category:Fortresses", "Category:Nirauan locations"], "nodes": [{"tag": "h1", "text": "Hand of Thrawn"}, {"tag": "p", "text": "The Hand of Thrawn was a fortress on the planet of Nirauan. Its name was due to its five towers, which vaguely resembled an outstretched hand."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Construction"}, {"tag": "p", "text": "It was chosen by Grand Admiral Thrawn as the center of his efforts in the Unknown Regions to conquer territory for the Galactic Empire and defend it from threats from the galactic fringes or from outside the galaxy. It contained a fully equipped command center, library, and a cloning facility in which Thrawn had kept a clone of himself in stasis. The complex also held an advanced database. It also had a holomap of the galaxy to show sector's that were underneath Thrawn's control."}, {"tag": "h3", "text": "Defensive Capabilities"}, {"tag": "p", "text": "Surrounded by various turbolaser batteries, and a hangar bay equipped with a wing of starfighters, the Hand of Thrawn was highly secured from an attack. Guarded heavily by a garrison of Chiss soldiers, infiltration inside the complex would be pointless."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Jedi Infiltration"}, {"tag": "p", "text": "By 19 ABY, it had become the leading fortress of the Empire of the Hand. Its garrison, comprised for the most part of Chiss troops, was commanded by Imperial officer Voss Parck. Soontir Fel was also part of the Hand of Thrawn's complement. When Mara Jade disappeared on a mission to track down the source of clones and mysterious starfighters which had recently become active, Luke Skywalker and R2-D2 followed her. Joining with some of the native Qom Jha and Qom Qae, they infiltrated the compound. In order to prevent the Hand of Thrawn from turning itself over to Bastion and the Empire, Mara Jade used a beckon call to drive her ship, Jade's Fire, into the compound, damaging the main hangar and all remaining ships. Luke and Mara then reentered the compound, where they discovered Thrawn's secret cloning chamber. While battling two sentry droids, the entire chamber flooded, but they were able to escape by forcing Thrawn's cloning cylinder to explode, resulting in the water draining and allowing them to escape. After escaping, Luke discovered that R2-D2 also managed to download an unaltered copy of the Caamas Document."}, {"tag": "h3", "text": "Pirate attack"}, {"tag": "p", "text": "Following Luke Skywalker and Mara Jade's intervention, the Hand of Thrawn was attacked and looted by the Cavrilhu Pirates who were involved in some skirmishes with the Jedi and had followed them to Nirauan. Due to the destruction of their defenses by the Jedi, the personnel of the base were forced to evacuate. Fearing that the pirates could have obtained information about the secret Chiss installations in the ruins, Commander Stent went to the Syndic Mitth'raw'nuruodo training academy in the Rata Nebula to prevent a pirate attack."}, {"tag": "h3", "text": "Refurbishment"}, {"tag": "p", "text": "The base was eventually renovated and back into service. In 22 ABY, Luke Skywalker and Mara Jade traveled once again to Nirauan after being contacted by Parck from the Hand of Thrawn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}