{"url": "Handoff", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Star Wars Gamer fiction"], "nodes": [{"tag": "h1", "text": "Handoff"}, {"tag": "p", "text": "Handoff is a short story by Timothy Zahn. The story, which features Mara Jade, Zakarisz Ghent and Talon Karrde, was originally published in Star Wars Gamer 10 in 2002 and was made available on Hyperspace on June 2, 2004. The story takes place on the Mid Rim planet of Chibias and tells of the first meeting between Jade and Ghent."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Mara Jade attends a symphonic concert on the benighted Mid Rim world of Chibias. In the lobby of the concert hall, she encounters a confused youth detained by two security personnel and a uniformed Human identifying himself as Imperial Counselor Raines, a member of Governor Egron's staff. Shortly before the security personnel are to search the youth, Mara observes Raines slip an incriminating datacard into the side pocket of the kid's backpack."}, {"tag": "p", "text": "Pretending to be the Director of Offworld Special Events, Mara intervenes on the youth's behalf. After ushering the foursome into a side-room, she physically overpowers the three men and escapes with the youth to her modest hotel room."}, {"tag": "p", "text": "At her hotel room, Mara learns the youth's name is Ghent and that he was summoned to Chibias by an unknown person at the governor's palace. After examining the planted datacard, Mara concludes that Raines attempted to frame Ghent with stolen government secrets. Instructing Ghent to remain at her abode, Mara surreptitiously travels to the walled palace of Governor Egron and, using an Imperial recognition code, bluffs her way past the wary guards. Inside the palace, she meets a bruised Counselor Raines. Mara unnerves him with her knowledge that there is no such person known as Counselor Raines in Imperial records. She demands to know why he attempted to plant incriminating evidence on Ghent."}, {"tag": "p", "text": "Raines reveals to Mara that his true name is Markko and claims that he is an unofficial attache to Governor Egron. Egron requires the skills of an expert slicer to decode a Rebel computer system. Egron employed Markko to slice the computer core, but Markko was unable to finish the job by himself. Markko summoned Ghent to Chibias and attempted to blackmail him into helping to slice the computer system. If Ghent can slice it, the Imperial forces can clear the Rebel insurgents out of that entire region of space."}, {"tag": "p", "text": "Mara agrees to help Markko and persuades him to hire Ghent for two thousand credits per hour. After leaving the palace, she realizes that Markko has assigned two henchmen to follow her. After confusing her pursuers, she tails the two henchmen to a side street two blocks short of the palace. A minute later, the two men disappear through the front door of a large private residence."}, {"tag": "p", "text": "Secretly entering the residence, Mara is captured by Markko and his men. Markko informs his captive that he is an Alliance Intelligence agent and his residence is the headquarters of a Rebel cell. Unfazed, Mara insists that she is an independent contractor with no political affiliations. After reiterating that Ghent will slice the computer for Markko, Mara leaves the residence."}, {"tag": "p", "text": "An hour and a half later, Mara and Ghent arrive at the governor's palace where they are greeted by Markko and a bodyguard of stormtroopers. They are escorted to a private room with the computer core. Moments later, they are welcomed by Governor Egron."}, {"tag": "p", "text": "When Ghent slices the computer, Mara realizes the computer core actually contains the control codes of a Star Destroyer and that Ghent is expected to decrypt the control node. She has been hoodwinked and Egron is a traitor to the Empire who plans to sell those codes to the Rebel Alliance."}, {"tag": "p", "text": "Creating a diversion, Ghent and Mara attempt to flee the palace, but Markko, accompanied by Governor Egron, corners Mara and Ghent. Mara dispatches Egron, shooting him in the chest, while Markko takes Ghent hostage. Mara, however, decides that her work is done — she had only come to the palace in order to eliminate an Imperial traitor, not go on a killing spree. Mara offers to allow Markko to go free, as long as he releases the captured Ghent. Markko agrees to Mara's terms, and the stand-off is peacefully resolved."}, {"tag": "p", "text": "After exiting the palace grounds, Mara and Ghent decide to go their separate ways. Before leaving the planet, Ghent is intercepted and recruited by Talon Karrde, a smuggler."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cover illustration by Star Wars comics veteran artist Dave Dorman shows Jade and Ghent escaping from pursuing stormtroopers through a hallway marked by a forest of columns supporting distinctive red and white patterned arches. Dorman drew the architecture of the hall as a direct homage to the ancient former mosque of the city of Córdoba, in Andalucia, southern Spain.\nThe building, an outstanding example of the Moorish architecture of the 9th to the 15th centuries, is today a UNESCO World Heritage Site, and one of the most visited sites in Spain.[source?]"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}