{"url": "Hang_glider", "categories": ["Category:Legends articles", "Category:Air vehicles", "Category:Alliance to Restore the Republic vehicles", "Category:Ewok vehicles"], "nodes": [{"tag": "h1", "text": "Hang glider"}, {"tag": "p", "text": "The hang glider, also known as the sky-glider, was an invention of the Ewoks, a primitive species who learned to use their natural resources to manufacture a wide range of tools. The hang glider featured among their many inventions, which also included catapults, numerous handheld weapons, expansive tree villages, and a variety of traps."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "An Ewok would begin constructing a hang glider by stalking and killing a number of large animals. These creatures were skinned and their pelts stretched and dried until they formed a durable leather. The skins were then sewn together and connected to a simple skeletal framework which was made of a special strong, light wood."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally, the hang gliders may have been used simply to transport Ewoks across the forests. Eventually, they began carrying rocks, spears, and slings for use in hunting small creatures from above. The Ewoks soon realized that these same weapons could also be used in defense against towering monsters such as the Gorax. Furthermore, with the Wisties guiding the Ewoks around dangerous convection currents, the Ewoks were able to use the gliders to suppress a forest fire by airdropping Master Logray's magic foam."}, {"tag": "p", "text": "Thus, when the Ewoks agreed to aid the Rebels, they used their extensive experience with their hang gliders to gain an advantage over the land-bound stormtroopers."}, {"tag": "p", "text": "During the Battle of Endor, the Ewoks also attempted, unsuccessfully, to use their gliders against All Terrain Scout Transports."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}