{"url": "Alta_Ranga", "categories": ["Category:Legends articles", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Alta Ranga"}, {"tag": "p", "text": "Alta Ranga was a male Ensel Jedi Master who served the Jedi Order and the Galactic Republic during the Clone Wars. Master Ranga was present at the opening battle of the conflict on Geonosis in 22 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive, Alta Ranga was educated in the ways of the Force by the Jedi Order, eventually attaining the rank of Jedi Master. Serving the Order for many decades, Ranga was of advanced age and supported himself with a simple cane when he walked."}, {"tag": "p", "text": "In 22 BBY, the Separatist Crisis that had plagued the Galactic Senate for years brought the Republic to its knees. Several thousand star systems began leaving the Republic, many of them joining the Confederacy of Independent Systems, led by the former Jedi Master Count Dooku. When Master Obi-Wan Kenobi discovered that the Confederacy was building a battle droid army on Geonosis, he was taken captive along with Padawan Anakin Skywalker and Senator Padmé Amidala of Naboo. Supreme Chancellor Palpatine was given emergency powers by the Senate, and commissioned a Grand Army of the Republic. As Jedi Grand Master Yoda went to Kamino to recruit an army of clone troopers that Kenobi had earlier discovered the Kaminoans had been secretly building for the Republic, Master Mace Windu assembled a strike team of over two hundred Jedi to rescue the captives on Geonosis. Joining the task force, Master Ranga helped storm the Petranaki arena and pit his lightsaber against the blasters of the Confederate Army."}, {"tag": "p", "text": "Alta fought bravely with the wisdom of his old age, somewhere in the arena. Many Jedi fell to the overwhelming force of rapidly-firing droids, and a survivor's circle started forming in the center of the arena. As the droids ceased firing, Count Dooku, observing the melee from above, called on the Jedi to surrender. Windu refused, and as the Jedi again raised their lightsabers, the clone army arrived, landing in and outside of the arena in LAAT gunships. A battle ensued between Republic and Separatist forces, initiating the Clone Wars. While Ranga did not make it to the survivors' circle, he was able to survive the fight and return to the Jedi Temple to prepare for the militarization of the Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alta Ranga's species was an upgraded form of an alien seen in the Podrace crowd in Episode I. Alta was designed by Dermot Power and slated to appear in Star Wars: Episode II Attack of the Clones, but did not make it to the final cut. He was however shown to the world in concept art in the The Art of Star Wars Episode II: Attack of the Clones book and as a maquette in Sculpting a Galaxy: Inside the Star Wars Model Shop."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}