{"url": "Altagak", "categories": ["Category:Legends articles", "Category:Creatures of the Dalonbian sector", "Category:Ectothermic species", "Category:Grassland and plains creatures", "Category:Predatory creatures", "Category:Reptiles", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Altagak"}, {"tag": "p", "text": "The altagak was a reptilian creature from the planet Altora. Known for its cunning, stealth, and speed, the altagak was thought to be the apex predator of its homeworld."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The altagak of Altora was a four-legged reptilian predator with foot claws and a spiny tail. Two long tusks protruded on either side of the creature's sinuous snout, which retracted during feeding to display several sets of rending teeth. They also had a spinal mane which adult altagaks expanded into a threatening display to discourage competitors."}, {"tag": "p", "text": "Solitary hunters, altagaks would stalk their prey for hours on end, hiding patiently in the tall grasses of their native savannas. Once within a hundred meters of their target, altagaks lunged into attack with a sudden burst of speed that were recorded to reach up to eighty kilometers per hour. Using the impetus of its momentum, the hunter would skewer its prey on its long tusks, delivering a head-butt aimed to shock their quarry to the ground. The altagak would then feed using its rending teeth, and would quickly consume its meal to appease the species' voracious appetite. The altagak had an average lifespan in excess of twenty-eight standard years."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The altagak were native to the southern savannas of the planet Altora, and enjoyed the warmth of the southern clime while basking in the sun for large portions of the day. They hunted a variety of large herd animals native to the plains, although were also known to attack Humanoids if game proved scarce. The Altoran natives came to regard the altagaks as \"high speed death on four legs\", and the species became known for its ability to stalk silently and attack quickly. They also attacked rancher herds, and their continued depredations threatened the fragile economy of their world, leading to bounties being placed on altagak hides. The species spread to other planets, and remained fearsome if less of a threat than on their native land where there were few other predators to challenge it."}, {"tag": "p", "text": "The Rebel unit Strike Force Altagak, stationed on the jungle planet of Mentanar Vosk, was named after the altagak, and used a representation of the predator as its insignia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}