{"url": "Hanoon", "categories": ["Category:Legends articles", "Category:Bothan Space", "Category:Hanoon locations", "Category:Mid Rim asteroids"], "nodes": [{"tag": "h1", "text": "Hanoon"}, {"tag": "p", "text": "Formerly the desolate asteroid known as Geddes, the terraformed world of Hanoon was home to several strategic Imperial outposts designed to increase Imperial presence in that system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Geddes was one of many asteroids held loosely in Krant's gravity well. Krant was a world in the Mid Rim's Krant system at galactic coordinates R-14. After it the terraforming process had been completed, the asteroid had canals and snow-covered rocks. Due to the large amount a raw materials on the asteroid, a number of mining operations had been set up even before the Empire took over."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 0 ABY, Geddes became the site of an Imperial research facility. After the Imperials located the Vor'Na'Tu, an ancient and powerful Jedi artifact, on Krant, it was shipped to Geddes' Sith Temple to await retrieval by Darth Vader. The Rebel Alliance discovered the location of the Vor'Na'Tu, a strike force led by Princess Leia Organa and the exiled Jedi Echuu Shen-Jon, the former keeper of the Vor'Na'Tu, was sent to Geddes aboard a transport. They were joined by a Wookiee army. The strike force struck at the research facility and destroyed the temple, freeing the Vor'Na'Tu. The force retreated back to the transport, but was ambushed by Darth Vader. Shen-Jon shattered the artifact and sacrificed himself by fighting Vader to allow the others to escape."}, {"tag": "p", "text": "After the Krantian Civil War, Moff Yittreas escaped to Geddes and fortified the asteroid. By 6 ABY, Geddes had been terraformed and renamed Hanoon, and the cities of Libreck, Magentic, Reeche, and Reticul had been established, with New Geddes as the capital. That year, Organa and her brother, the Jedi Luke Skywalker, returned to Hanoon after a visitation from Shen-Jon's Force ghost. Aided by the a New Republic Army and the Hanoon Imperial Resistance, Skywalker recovered the shards of the Vor'Na'Tu and placed them in a newly-built Jedi Temple. Organa and Skywalker then decided to liberate the rest of the planetoid, and marched on New Geddes to free the Terraform Processor. The Republic forces succeeded in freeing the Terraform Processor, and destroyed Moff Yittreas' Fortress, killing the Moff. During the battle, Imperial forces tried to break into the Temple holding the Vor'Na'Tu's remains, forcing Skywalker to shatter the artifact into dust, thereby ending its threat. With the Imperials defeated, Hanoon joined the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Geddes/Hanoon was first mentioned in the strategy guide for the 2001 video game Star Wars: Galactic Battlegrounds. The asteroid appeared throughout the Princess Leia campaign and received its own entry in the game's DataBank. The campaign was later included in the game's 2002 expansion pack, Clone Campaigns. 2009's reference book The Essential Atlas provided dates for the battles which took place on Hanoon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}