{"url": "Hansel", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Con artists", "Category:Criminals", "Category:Males", "Category:Romins", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Hansel"}, {"tag": "p", "text": "Hansel was the Romin charity deputy (bribe collector) for planetary dictator Roy Teda, who harbored galactic criminals for hefty \"contributions\" (bribes) that he expected them to pay for such refuge and protection."}, {"tag": "p", "text": "In their Mission to Romin, Jedi Knights Obi-Wan Kenobi and Siri Tachi and their apprentices, Anakin Skywalker and Ferus Olin, disguised themselves as members of the Slam gang. Hansel, as he did with all criminal contacts, accepted \"charitable donations\" from them."}, {"tag": "p", "text": "He also followed the undercover Jedi Anakin and Ferus around the city of Eliior when he became curious about the young Jedi's own curiosity. When the two Padawans turned about suddenly to confront him about why he was trailing them, Hansel used his well-practiced cover: on behalf of \"Great Leader Teda,\" he invited their senior gang leaders (Jedi Masters Kenobi and Tachi, who were posing as the notorious thieves Slam and Valadon) to a reception for all criminal refugees at the grand palace. Hansel thus was able, on a frequent basis, to lie himself out of being exposed for the exalted scammer he was."}, {"tag": "p", "text": "During the grand palatial reception, the revolutionary leader Joylin and the Citizens' Resistance began their coup, during which Hansel was captured. When Teda himself was captured, Hansel was released. Even so, Hansel, as Teda's \"first aide,\" was to have been the first of many of the old regime to be executed should Teda have refused to turn himself in (the Jedi, really, compelled Teda to surrender, and so it wasn't of his own volition, and yet it was enough for Joylin to forego the executions)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}