{"url": "Hapan_Royal_Guard", "categories": ["Category:Legends articles", "Category:Hapes Consortium", "Category:Military units"], "nodes": [{"tag": "h1", "text": "Hapan Royal Guard"}, {"tag": "p", "text": "The Hapan Royal Guard (Chume'doro in Hapan) was a military unit tasked to defend the Queen Mother of the Hapes Consortium and her family. Members of the Royal Guard included Major Moreem Espara. As was typical of Hapan women, they were generally attractive, but they were also generally very large and strong, sometimes carrying enormous shoulder-mounted weapons."}, {"tag": "h2", "text": "Organization and philosophy"}, {"tag": "p", "text": "Ultimately, the Royal Guard was not a military unit but rather a police force with its agents quietly omnipresent. Their forces were spread about to protect the Queen Mother with a bodyguard always being by her side whilst other agents were stationed on such sites as the flagship, Star Home. In addition, the Royal Guard were present on any naval vessel the Queen Mother might visit and one each of the worlds of the Hapes Consortium. Their mission objective was namely to investigate any possible threats against the Hapan Royal House. To achieve this aim, they had unlimited authority to commandeer local security forces, detain as well as interrogate any citizens, seize property, confiscate items and tap into private communications. By using the authority of the Queen Mother, a Royal Guard was capable of even overruling the orders of high ranking fleet admirals. Though there was little to curb these powers, many Hapans willingly submitted to the authority of the Royal Guard. This was attributed to the fact that Hapans saw their ruler as a goddess and that her protectors were incorruptible."}, {"tag": "p", "text": "The Chume'doro was divided into at least two branches namely the Royal and Investigative divisions. The duties of the Royal branch included the protection of the Queen Mother in combat engagements and serving as deterrents which includes the various contingents spread throughout Consortium space. The Investigative branch operated by spying and surveillance where it included five sub-divisions; Surveillance, Interrogation, Forensics, Stealth and Purity with this part serving as internal affairs. Much of the work of the Royal Guard was conducted by its Investigative Branch who were also tasked with monitoring the ranks of the Chume'doro as well. When a threat to the Queen Mother was detected, an Investigative agent was dispatched to determine the extent of the danger whilst agents arrested the conspirators without violence. When necessary, however, the Chume'doro were capable of entering combat as elite fighters where they defended the Queen Mother with their lives. Combat usually sees the Royal Guard fighting against organized pirate raids or attempted coups by planetary forces of one of the 63 Consortium worlds. During full-scale battle, members of the Chume'doro were capable of commanding the Hapes Home Guard along with other military elements."}, {"tag": "p", "text": "Among the specialty branches of the Guard included:"}, {"tag": "p", "text": "New recruits within the organization were known as agents which was also the informal term used to identify members of the Royal Guard. The rank of agent was graded in an ascending order with Grade 3, Grade 2 and Grade 1 who all operated in cells of two to four individuals. Promotion to the rank of officer was achieved through a recommendation by their superiors whereupon prospective candidates engaged in fighting duels using polearms or other such melee weapons. The victor of the fight was the individual that was promoted the rank of officer. Amongst officers, the starting rank was of captain who was capable of commanding 40 cells of agents. Above them were major's that was the highest ranking position within the Investigative Branch. Within the Royal Branch, there was the existence of a special elite rank known as the Favored who were individuals believed to be the spiritual descendants of the original bodyguard detail that had been assembled to protect the first Queen Mother. Whilst few in number, a Favored had complete control over the Chume'doro along with the military forces and even civilians. All members of the Favored consisted of female Hapans though with the rest of the Royal Guard this gender ratio was different with 5% males and 95% females within the Royal Guard."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Chume'doro were formed in 3000 BBY after the destruction of the Lorell Raiders and the rise of matriarchy on Hapes. Upon the appointment of the Queen Mother as the absolute ruler of the Hapan people, the Royal Guard was created to protect the ruler of the Hapes Consortium from rivals attempting to bring their own members onto the throne. Once established, they were a simple bodyguard unit made up of one hundred women who were selected from members of the Hapan Royal Navy."}, {"tag": "p", "text": "The duties of the Chume'doro involved the protection of the Queen Mother whenever she left the Fountain Palace as well as screened visitors when reaching the throne room and testing food in case poison was inserted into it. In time, the Royal Guard's ranks increased in number which led to an expansion in their duties that included the protection of the Hapan Royal House. Eventually, the schemes of heirs to the Queen Mother began to involve the Royal Guard who were enlisted in attempted coups which brought a major addition to the organization; the creation of the Investigative Branch to watch out for plots against the Chume as well as placed surveillance over the members of the Chume'doro in order to watch for any signs of disloyalty."}, {"tag": "p", "text": "They continued their service even until 8 ABY when the Hapes Cluster reopened its borders. At the time, they accompanied Queen Mother Ta'a Chume to Dathomir in order to recover Prince Isolder. When Teneniel Djo declared that she would marry the Hapan Prince, Ta'a Chume commanded her Royal Guard to kill the Dathomiri witch but Djo simply used The Force to incapacitate the guards. As Ta'a Chume fell in favor, the Chume'doro shifted their allegiance from her to her daughter-in-law; Tenenial Djo."}, {"tag": "p", "text": "Many Royal Guards were murdered as a result of an internal war, but during the Second Galactic Civil War they were called on once more to protect the Queen Mother during an assassination attempt on Tenel Ka Djo's life by the bounty hunter Aurra Sing."}, {"tag": "h2", "text": "Equipment and training"}, {"tag": "p", "text": "All members of the Royal Guard were experts in unarmed combat and trained in the use of weapons such as edge blades, polearms, and blaster pistols. Detachments of Chume'doro also included combat specialists for appropriate assigned environments such as forests, urban, arctic as well as aquatic. As was the case with all Hapans, the Chume'doro suffered from poor night vision and thus compensated by the use night-vision optics to compensate for this deficiency."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The endnotes posted at the writer of Galaxy at War mentions that the ranks of the Royal Guard are 95% female and the ranks of the elite favored are 100% female. In addition, a unique aspect of the Hapan Royal Guard is that they were more like a secret police than a military unit. They are noted for a high degree of power allowing them to arrest any citizen without cause, commandeer public resources for any reasons as well as tap private communications. These powers are attributed in the interest of protecting the Queen and most of the Hapans are stated to be only too happy to let them do it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}