{"url": "Hapes/Legends", "categories": ["Category:Legends articles", "Category:Galactic Alliance planets", "Category:Galactic Republic planets", "Category:Hapes Consortium planets", "Category:Hapes locations", "Category:New Republic planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Hapes"}, {"tag": "p", "text": "Hapes was the homeworld of the Hapans, a near-Human race known for their beauty, and the administrative capital of the Hapes Consortium. Surrounded by shimmering nebulae, and with seven moons in the sky after sunset, Hapes never knew the darkness of true night, and the Hapan people had relatively poor night-vision."}, {"tag": "p", "text": "Only a few small, neat cities were necessary to cater for the needs of the state bureaucracy and the Consortium's commercial and legal institutions, and much of the planet was an unspoiled wilderness of broad oceans, snow-peaked mountains and lush primeval forest, where tightly-controlled commercial fisheries and game-preserves were the major focus of Hapan activity."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located near the center of the Hapes Cluster, Hapes was one of only two planets in the Hapes system, along with Kavan. Due to the light reflected off of the seven moons surrounding Hapes and the shimmering nebulae of the Transitory Mists, the inhabitants of Hapes never knew true night."}, {"tag": "p", "text": "The surface was marked by large oceans, forests, and mountains. Much of the surface was untouched due to the Hapan love of beauty, with Hapans preferring to stay in cities such as Ta'a Chume'Dan, the capital city of Hapes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Hapes was first discovered by the Lorell Raiders, a group of pirates who had found routes through the Transitory Mists and used the Hapes Cluster as their base. For centuries, the Lorell Raiders stalked the trade routes of the Galactic Republic using Hapes as their base. The Lorell Raiders would abduct beautiful women from all over the Galaxy and bring them back to the hidden worlds of Hapes, along with any other treasure they would plunder. The women would stay on Hapes and raise their children, but the Lorell Raiders would eventually take the boys with them and train them as pirates in turn. After months the pirates would return with the boys to rest."}, {"tag": "p", "text": "Around 4050 BBY, however, the mostly male Lorell Raiders were wiped out by the Jedi when they ventured out into Galactic Republic space. Hapes was forgotten and the women left behind took control and vowed that a man would never rule them again, creating both the title of Queen Mother and the matriarchal society that would continue on for at least the next four thousand years. Around 3100 BBY, a Queen Mother sealed the borders to the newly created Hapes Consortium from the rest of the Galaxy, ordered the starship Star Home to be constructed, and quickly captured many more planets for the Hapans to colonize."}, {"tag": "p", "text": "Information on Hapan history between 3,000 BBY and 8 ABY was very hard to come by, but what was found was that sometime in the distant past, several members of the Hapes Consortium tried to secede from the influence of Hapes, but were quickly crushed. Those worlds became known as the Rifle Worlds, and eventually they became the commerce base of the Consortium."}, {"tag": "h3", "text": "Rise of the Empire era"}, {"tag": "p", "text": "Shortly before the Great Jedi Purge and the rise of the Galactic Empire, a Hapan Jedi washout named Sinsor Khal returned to the Hapes Cluster to become a scientist. Due to his failed Jedi status and his location in the Hapes Cluster, he survived the Great Jedi Purge. Later on, he would be banished to a lockdown science lab on Gallinore by Ta'a Chume for cruelty to his subjects, although she would continue to fund his research."}, {"tag": "p", "text": "It is believed that the Hapans were left to their own devices by the Galactic Empire, as no records of any major confrontations between the two parties exist as of yet. However, there were some skirmishes near the border that resulted in the Hapans capturing some Imperial Star Destroyers."}, {"tag": "p", "text": "During Palpatine's reign as Galactic Emperor, there existed rumors that he was in love with a Hapan woman."}, {"tag": "p", "text": "In 2 ABY, Kalen, the Chume'da (or heir) of the Hapes Consortium, was captured in the Terephon system and killed. Kalen's brother Isolder then went on a two year undercover quest to find and apprehend the killer. The culprit, a Hapan pirate named Harravan, was eventually found and apprehended, but died mysteriously in jail before he could be questioned."}, {"tag": "p", "text": "A short time after, Isolder's fiancée, Elliar, was found murdered in one of Hapes's many reflecting pools. As far as it was known, no one was ever charged or questioned in Elliar's death. It would later come out that Ta'a Chume was responsible for arranging the murders of both Elliar and of her own son."}, {"tag": "h3", "text": "End of Isolationism"}, {"tag": "p", "text": "In 8 ABY, Princess Leia Organa went to Hapes to discuss with Ta'a Chume a possible alliance with the New Republic. While Organa was there, Isolder fell deeply in love with her, and requested of his mother permission to marry her. Permission was granted, and was made a part of the deal: Hapes would ally with the New Republic if Organa married Isolder. Instead, after an altering adventure on the planet Dathomir, Isolder proposed marriage to a Dathomiri Witch named Teneniel Djo. Ta'a Chume disapproved of the young Dathomirian, but grudgingly accepted her son's choice of a bride after Djo used the Force threateningly on her. Isolder also demanded of his mother that the Consortium join the New Republic, which she agreed to, but eventually did not live up to an effort to preserve internal stability. Also at this time, Dathomir was admitted into the Consortium as the unofficial 64th planet."}, {"tag": "p", "text": "Some time later, Ta'a Chume stepped down as Queen Mother, and was replaced by Teneniel Djo. The Consortium stayed out of galactic politics for over a decade and a half, until the advent of the Yuuzhan Vong War. The people rejoiced at the birth of Tenel Ka in 10 ABY, but they would be disappointed in their heir's preference for her mother's culture. Since Tenel Ka had trained to be a Jedi and had no interest in taking over the Hapan throne, the issue of another heir had become a hot topic."}, {"tag": "h3", "text": "The Yuuzhan Vong War"}, {"tag": "p", "text": "To resolve the issue, Isolder and Teneniel tried to have another child. They had succeeded, as Teneniel was in the early stages of pregnancy when Leia Organa Solo again visited Hapes in 25 ABY to request the assistance of the Hapan Royal Navy in the fight against the Yuuzhan Vong. A vote was made by the planetary delegates, which ended up in a tie. Beed Thane then provoked an honor duel with Isolder, with the winner controlling the tie breaking vote. Isolder defeated Thane, and the navy was dispatched to Fondor, with Isolder himself commanding the Song of War. However, due to Centerpoint Station being misaligned, the beam from that ancient weapon took out three quarters of the Hapan fleet. Due to the Force backlash, Teneniel miscarried and went into a deep depression."}, {"tag": "p", "text": "With the Queen Mother incapacitated and Isolder blamed for the loss of many lives at Fondor, the people began calling for stronger leadership. Since Isolder refused to allow Ta'a Chume to retake the throne, she began a plot to find a new wife for Isolder. In 27 ABY, when the survivors of the Myrkr strike team flew to Hapes for refuge, Ta'a Chume saw a younger version of herself in the grieving Jaina Solo and tried to groom her to be the next Queen Mother. To further her plot, Ta'a Chume had also arranged to have Teneniel Djo poisoned. Unexpectedly, however, it was Tenel Ka who took up her fallen mother's crown, not because she desired it, but to keep her grandmother and other bloodthirsty relatives from ruling Hapes. The new Queen Mother revealed Teneniel's legacy: A whole fleet of ships built in secret and hidden in the Transitory Mists, ready to be used in the fight against the Yuuzhan Vong. The Consortium eventually joined the Galactic Federation of Free Alliances in 28 ABY, and they aided in Alliance campaigns against the Yuuzhan Vong."}, {"tag": "h3", "text": "The Swarm War"}, {"tag": "p", "text": "In 35 ABY, Jacen Solo came to Hapes to visit his friend, Queen Mother Tenel Ka, and to ask for her assistance in sending a fleet to defend the Killiks against the Chiss. Tenel Ka granted the request, provided he spend some time with her. Shortly after, she secluded herself for almost a year, and in 36 ABY, Tenel Ka gave birth to Jacen's daughter, whom she named Allana. The identity of Allana's father remained unknown to all except her parents, and Tenel Ka refused to release any holoimages of her."}, {"tag": "p", "text": "Shortly after the birth of Allana, Ta'a Chume, who was still under house arrest for the death of Teneniel Djo, was rendered catatonic by Jacen Solo after he found out it was she who had arranged for the Dark Nest's attempt on his daughter's life."}, {"tag": "p", "text": "A few months later, Queen Mother Tenel Ka was one of many Jedi summoned by Luke Skywalker to a Jedi meeting on Ossus. When everyone had assembled, Skywalker gave an ultimatum that the Jedi Order came first, and that any who could not put the order first was welcome to leave. Tenel Ka went to Skywalker after the meeting and told him that regretfully, she could not put being a Jedi before being Queen Mother, and offered up her lightsaber. Skywalker told her to keep it, and that there was a place for her in the Order if she ever decided to return. After an awkward meeting with Han and Leia Organa Solo, Tenel Ka went back to Hapes."}, {"tag": "h3", "text": "The Second Galactic Civil War"}, {"tag": "p", "text": "During the Second Galactic Civil War of 40 ABY, some rogue Hapan nobles calling themselves the Heritage Council got in touch with the Corellian government and hatched a plot to eliminate the pro-Galactic Alliance Queen Mother Tenel Ka and her daughter Allana. After both the Queen Mother and her heir were dead, the rogue Hapan nobles would then align the Hapes Consortium with the Corellians."}, {"tag": "p", "text": "Knowing that the pro-Corellian Han and Leia Solo were good friends of the Queen Mother, the Corellian leadership used them as dupes and sent them on a fake mission to Hapes in an effort to draw the Queen Mother into a trap laid by the Hapan nobles. After realizing that they were used, the Solos foiled the assassination attempt and decided to spy on the assassin named Nashtah, also known as Aurra Sing, to determine the extent of the conspiracy."}, {"tag": "p", "text": "Alerted to the assassination attempt, Queen Mother Tenel Ka contacted Jacen Solo, who was by now the head of the Galactic Alliance Guard, to help in the investigation. In turn he arranged to have both Tenel Ka and their daughter smuggled onto his flagship, the Anakin Solo, to prevent any more attempts on their lives."}, {"tag": "p", "text": "After it was revealed that the Duchas of AlGray and Galney were part of the rogue Hapan nobles planning to take over Hapes, Tenel Ka left the Anakin Solo to prepare the Royal Navy for battle, but not before giving express instructions that Allana was to remain onboard."}, {"tag": "p", "text": "Despite the fact that Jacen placed his daughter under a heavy guard, the assassin Nashtah still managed to get through all the security protocols that Jacen had set up and continued her quest to kill Allana. Jacen then proceeded to engage Nashtah in battle, and while the assassin was lying on the ground wounded, Allana injected Nashtah with a sleep stick."}, {"tag": "p", "text": "Over Hapes, the battle between the Hapan loyalists and the Heritage Council raged. Both sides suffered heavy losses, but with the aid of the Anakin Solo, the Hapan loyalists were victorious. Jacen Solo was hailed as a hero among the Hapan people, and because of this Tenel Ka briefly considered announcing Allana's paternity to her people."}, {"tag": "p", "text": "Later on, Tenel Ka withdrew all Hapan support from the Galactic Alliance when Jacen refused to turn back from the dark side."}, {"tag": "p", "text": "Two years after the war had ended, the Hapes Consortium, was on the sidelines of signing a peace treaty by Tenel Ka Djo on Coruscant, with Hapes as the capital."}, {"tag": "h3", "text": "Sith–Imperial War"}, {"tag": "p", "text": "During the Sith–Imperial War and the Second Imperial Civil War that followed, Hapes remained neutral."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The main inhabitants of Hapes were the Hapans, a culturally distinct branch of Humans. They look identical to baseline Humans except they were considered more beautiful (due to the limited gene pool available) and suffered from poor night vision due to the fact that Hapes has never seen true night. The official language of the Hapans was Hapan."}, {"tag": "h3", "text": "Government"}, {"tag": "p", "text": "The Hapans were ruled by the Queen Mother, who held court at either the Fountain Palace when on Hapes, or aboard the royal transport ship Star Home when traveling abroad. The title of Queen Mother was hereditary, passed down from mother to daughter. If the Queen Mother failed to have daughters, the wife of the firstborn son became Queen Mother. However, to be in the line of succession meant both the Queen Mother and her heirs had to avoid constant attempts on their lives by jealous relatives who vied for the throne themselves."}, {"tag": "p", "text": "In addition to the Queen Mother, there were also representatives from each Consortium member planet at the Hapan Royal Court. Their main purpose was to vote on matters of importance and to give updates on any political and social conditions of their home planets that may require the Queen Mother's attention. The Queen Mother had the final say on everything, and her word was considered law."}, {"tag": "p", "text": "The Queen Mother was also surrounded by members of the nobility, which she had to pacify in various ways in order to prevent them from plotting against her or her family."}, {"tag": "h3", "text": "Culture"}, {"tag": "h4", "text": "Political climate"}, {"tag": "p", "text": "Hapan culture, at least among the upper classes, was based on assassination attempts and struggles for power. Most members of Hapan nobility or royalty would think nothing of manipulating and/or arranging the death of one of their own if it would advance their own cause."}, {"tag": "p", "text": "The Queen Mother was treated like a goddess by the Hapans, and her selection of a consort was important to all her people. Candidates for the role of consort often came from the nobility, mainly to keep the gene pool vibrant. There were fierce rivalries between many noble houses over which house would get their sons to father the next Queen Mother, and nobles often plotted against both the consort and the heir of the Queen Mother who was not fathered by one of their own."}, {"tag": "h4", "text": "Status of males"}, {"tag": "p", "text": "Due to the matriarchal society of the Hapes Consortium, men were often treated as second class citizens. Hapan males were used mainly for breeding and thought of as little more than an accessory. Despite this, there are a few documented cases of some Hapan men in positions of power, such as Isolder, Beed Thane, and Aleson Gray. Oftentimes, however, Hapan men who felt trapped by their position in society ran away and became pirates. These men hid out in the Transitory Mists and preyed on unsuspecting vessels, at least until caught by passing Nova Battle Cruisers. When captured, they would be put on trial, and possibly executed depending on how severe the charge was."}, {"tag": "h4", "text": "Anti-Jedi sentiment"}, {"tag": "p", "text": "Anti-Jedi sentiment was rife among the Hapans, mainly due to the fact that the Lorell Raiders had fallen to the Jedi. This sentiment came to head during the reign of Ni'Korish, Ta'a Chume's mother. Ni'Korish had an immense hatred of Jedi and had done her best to wipe out any that had made their way into the Consortium. Because of this, an anti-Jedi faction had formed among the Hapans named after her. The faction had come into prominence during the Yuuzhan Vong War, mainly due to the backlash of the Battle of Fondor. It was this faction, under the control of Ta'a Chume, that had Teneniel Djo assassinated in 27 ABY."}, {"tag": "p", "text": "However, there is a hint of greater tolerance towards the Jedi during Tenel Ka's leadership after Jacen Solo saved her from Corellian sympathizers in 40 ABY. The Hapan loyalists highly praised Jacen as a hero for his actions, seemingly an indication of the decrease in anti-Jedi sentiments."}, {"tag": "h4", "text": "Character traits"}, {"tag": "p", "text": "The Hapan people had a deep (some would say neurotically so) love of beauty. If a person, especially the heir to the throne, was blemished or deformed in any way, it was considered a fate worse than death."}, {"tag": "p", "text": "The Hapans were also considered paranoid by non-natives, which, given the political climate on Hapes, was not an unreasonable assumption for the non-natives to make."}, {"tag": "h3", "text": "Economy"}, {"tag": "p", "text": "Hapes, via the Consortium, was vastly wealthy, with treasures such as rainbow gems and guns of command fetching high prices on both legal and illegal markets."}, {"tag": "p", "text": "Even though businesses could operate on any of the 93 member planets of the Hapes Consortium, Hapan law dictates that all major financial and business transactions must be conducted at Ta'a Chume'Dan, the capital city of Hapes."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Ta'a Chume'Dan"}, {"tag": "p", "text": "Ta'a Chume'Dan was the capital city of Hapes. Although consisting of only a few hundred thousand people, it was the administrative seat of the Hapes Consortium. To accommodate as many people as possible, there were movable landing pads located all over the city."}, {"tag": "h4", "text": "Fountain Palace (Castle of Per'Agthra)"}, {"tag": "p", "text": "Located in Ta'a Chume'Dan, the Fountain Palace (also known as the Castle of Per'Agrtha) was the ancient home of the Queen Mothers. Located on a black basalt crag, the palace had been the seat of power of the Hapan monarchy for many centuries. It contained such rooms as the Hall of Masters, Royal Residence, Queen Mother's Special Salon, and the Royal Hangar."}, {"tag": "h4", "text": "Lorell Hall"}, {"tag": "p", "text": "Standing on the same crag as the Fountain Palace, Lorell Hall was an assembly hall that had large windows that allowed a good view of the sky."}, {"tag": "h3", "text": "Reef Fortress"}, {"tag": "p", "text": "Private residence of the Hapan Royal Family that was located near the shore of the ocean."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}