{"url": "Happy_Go_Lucky", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Females", "Category:Humans", "Category:Mercenaries", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Happy Go Lucky"}, {"tag": "p", "text": "Happy Go Lucky was a mercenary who worked with a paramilitary unit until she was fired from it for compromising a mission that cost the lives of several of her comrades. She was later employed by the pirate Black Jack who made her his second-in-command. She wore a sash in her dirty blond hair and complemented her black combat fatigues with mercenary boots."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The walking arsenal"}, {"tag": "p", "text": "Happy Go Lucky was a walking arsenal, virtually never seen without some kind of weapon in her hands. She constantly adjusted, readjusted, cleaned and repaired her weapons to make sure they were always in perfect condition."}, {"tag": "p", "text": "She was in charge of providing firepower when required (and often when not required) while the pirates stole starships. She had the ability to always conjure up a spare blaster, grenade or some other kind of weapon for her pirate colleagues, should they have the need to borrow a weapon."}, {"tag": "h3", "text": "\"Trigger\" Happy Go Lucky"}, {"tag": "p", "text": "Happy Go Lucky got along well with Black Jack and her fellow pirates, but hated virtually everybody else. She was especially hostile toward the crews of the ships she participated in stealing, and was known to blast hapless spacers for absolutely no reason, and would not hesitate to abuse people verbally and physically."}, {"tag": "p", "text": "She tended to shoot first, and ask later—or better yet, not ask at all—which was valuable in firefights. However, her trigger happy attitude would prove to be more of a liability than a help to her band of pirates."}, {"tag": "h3", "text": "Connection with the Empire"}, {"tag": "p", "text": "When a number of smaller New Republic battleships started disappearing only to appear later on Imperial hands, New Republic Intelligence Service suspected Black Jack and his band of pirates, including Happy Go Lucky, of working for the Empire. This was backed up by evidence, such as changes in crew rosters, shady characters seen consorting with the pirates, faulty starship systems, and unauthorized starship hardware. Therefore the New Republic issued a bounty on Black Jack and on Happy Go Lucky."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}