{"url": "Harbor-class_Mobile_Space_Dock", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic space stations", "Category:Galactic Empire space station classes", "Category:Haven-class Mobile Space Docks", "Category:Shipyards"], "nodes": [{"tag": "h1", "text": "Harbor-class Mobile Space Dock"}, {"tag": "p", "text": "The Harbor-class Mobile Space Dock was a mobile drydock and repair yard space station active during the Imperial Era, serving in both the Galactic Empire and the Rebel Alliance. It was considered very rare due to its mobility, with the Imperial Navy having a handful in its complement and the Alliance Fleet with only two, the Sanctum and the recently captured Imperial Reserve."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Harbor-class Mobile Space Dock was a type of mobile shipyard space station manufactured by Rendili StarDrive. It was designed as a traveling drydock and starship maintenance facility. The physical appearance of the Harbor-class was described as a thin and large vessel that resembled a skyscraper rather than a starship. It had several long docking arms with each having many ports deriving from them extended from the main vertical hull. Large horizontal support frames that helped in drydock repairs also extended from the vertical hull."}, {"tag": "p", "text": "The Harbor-class Mobile Space Dock also had a superstructure similar to a city that rose from the docking facilities and housed the station's crew, passengers, and support facilities. Each of the station's docking facilities could handle a frigate- or cruiser-sized starship up to a silhouette 6 classification. The station had quarters for many technicians, workshops, fabrication facilities, laboratories, and other facilities to have the ability to repair severely damaged ships or maintain a small fleet or battle group."}, {"tag": "p", "text": "Although mobile, Harbor-class Mobile Space Docks were not fast or agile, and as such were extremely vulnerable to attack. This was despite thick armor, and their large weapons load out were anti-starfighter and anti-boarding craft rather than for general assault. Because Harbor-class stations were vulnerable on their own, they were typically escorted by at least one or two frigates for combat support, or are part of a larger battle group and relied on the support of the other ships for defense. Harbor-class stations were not regularly equipped to launch or recover starfighters as it could be a dangerous operation, although they often had the starfighters of visiting ships."}, {"tag": "p", "text": "The Harbor-class Mobile Space Dock had hyperdrives, a class 3 that served as a primary and a class 16 secondary. It had long-range sensors and a navigation computer. The Harbor-class was armed with six port turret-mounted twin light turbolaser batteries, thirty port turret-mounted quad laser cannons, six starboard turret-mounted twin light turbolaser batteries, thirty starboard turret-mounted quad laser cannons, and ten tractor beam projectors. As part of its complement it had the capacity to hold short-range runabouts and shuttlecraft. It was crewed by 4,500 officers, engineers, and enlisted crew, while it had a passenger capacity of 8,000. It had consumables that could last two years."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The Harbor-class Mobile Space Dock served as a mobile shipyard that allowed it to refit, repair, and provide general service to starships that docked with it. It maintained a support vessel role by itself under escort as well as when it was part of a fleet or battle group."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Imperial Era, several Harbor-class Mobile Space Docks were in service, most belonging to the Imperial Navy of the Galactic Empire. The Alliance Navy of the Rebel Alliance owned two vessels during the Galactic Civil War, one being the fully operational Sanctum, and a recent captured one named by the Empire as the Reserve. After the Alliance secured control of the Reserve, it underwent repairs and refit at an Alliance-controlled shipyard. At one point, one of the two Alliance Harbor-class Mobile Space Docks serviced two MC80 Liberty Type Heavy Star Cruisers and one MC80A Home One Heavy Star Cruiser."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Harbor-class Mobile Space Dock was first mentioned and pictured in the 2018 Fully Operational roleplaying Fantasy Flight Games book but was erroneously referred to as the Haven-class. The 2020 supplement Starships and Speeders identifies it as the Harbor-class."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}