{"url": "Hard_Merchandise", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:The Bounty Hunter Wars"], "nodes": [{"tag": "h1", "text": "Hard Merchandise"}, {"tag": "p", "text": "Hard Merchandise is the third novel in The Bounty Hunter Wars trilogy, written by K. W. Jeter and published in July 1999 by Bantam Spectra."}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Feared and admired, respected and despised, Boba Fett enjoys a dubious reputation as the galaxy's most successful bounty hunter. Yet even a man like Boba Fett can have one too many enemies…."}, {"tag": "p", "text": "When Boba Fett stumbles across evidence implicating Prince Xizor in the murder of Luke Skywalker's aunt and uncle, Fett makes himself an enemy even he fears: the unknown mastermind behind a monstrous deception, who will kill to hide his tracks. Fett also finds himself in possession of an amnesiac young woman named Neelah, who may be the key to the mystery—or a decoy leading Fett into a murderous ambush. Fett's last hope is to run through the list of Xizor's hidden enemies. And since Xizor's hidden enemies are almost as legion as Fett's, the chance of survival is slim—even for someone as skilled and relentless as Boba Fett."}, {"tag": "h2", "text": "Acknowledgements"}, {"tag": "p", "text": "The author would once again like to extend thanks to Sue Rostoni and Michael Stackpole for invaluable assistance, and to Pat LoBrutto for saintly patience. Also, a special thanks to Irwyn Appelbaum. Honi soit qui mal y pense."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Front page excerpt teaser"}, {"tag": "p", "text": "Hard Merchandise begins with the following excerpt appearing before the title page:"}, {"tag": "p", "text": "THE BOUNTY HUNTER...HUNTED..."}, {"tag": "p", "text": "\"Seal off the cockpit area,\" Boba Fett spoke aloud. He was already leaning over the control panel as Slave I's onboard computer executed the command; with a hiss, the hatchway door closed behind him. With a few quick jabs at the controls, he silenced the alarm siganls once again. Even from this distance, where the visible details of his enemy's ship were little more distinct than the stars behind it, he could recognize the vessel. It's Xizor. The outline of the Falleen prince's flagship were unmistakable - and intimidating. The ship was known to be one of the deadliest and most thoroughly armored in the galaxy. If Slave I had gotten into a full-pitched battle with it, there wouldn't have even been this much of Boba Fett's ship hanging together.\nThe mystery of why the Vendetta hadn't moved in for the kill was easy enough to determine. He's holding back, decided Fett. Just waiting to see if there's any sign of life. Prince Xizor was known to be something of a trophy collector; it would be entirely consistent with him to want the hard physical evidence - the corpses - of those he had set out to kill, rather than just blowing them into disconnected atoms drifting in space."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Hard Merchandise."}, {"tag": "h2", "text": "Notes and references"}]}