{"url": "Hardcase/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Members of the 501st Legion (Galactic Republic)"], "nodes": [{"tag": "h1", "text": "Hardcase"}, {"tag": "p", "text": "\"Hardcase\" was the nickname of a clone trooper who served in the 501st Legion, a unit in the Galactic Republic's Grand Army, during the Clone Wars. Hardcase was present during a hunt for the Confederate General Grievous on the planet Saleucami around 21 BBY. With troopers Jesse and Kix, Hardcase joined Clone Captain Rex on the planet to search for escape pods that had been jettisoned from Grievous' crashed ship. After two commando droids injured Rex, Hardcase, Kix, and Jesse took the injured Captain to a nearby homestead to recover, while they met up with High Jedi General Obi-Wan Kenobi, who was locating Grievous on the planet. Hardcase continued to serve in the 501st Legion on the Confederate-aligned world Umbara, where he participated in a battle alongside Rex and Jedi General Anakin Skywalker."}, {"tag": "p", "text": "After the initial attack on the native Umbarans, another Jedi, General Pong Krell, arrived on Umbara and relieved Skywalker of his duties. Krell took over the leadership of Hardcase and the rest of the 501st troops, and wanted the clones to take over Umbara's capital city. A nearby airbase was resupplying the city's defenses, although after Hardcase and trooper Fives infiltrated the base, Krell's troops forced the Umbaran militia there to surrender, allowing the Republic force to fortify themselves in the airbase. Once Krell's battle group learned of a Confederate supply ship in orbit of the planet, Hardcase and Jesse joined Fives' mission to destroy the ship. The three clones used Umbaran starfighters to board the supply ship. Hardcase stayed behind and destroyed the ship's main reactor while Fives and Jesse departed back to the airbase. His actions destroyed the supply ship, although they cost him his life as well."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Saleucami"}, {"tag": "p", "text": "The clone trooper with the nickname \"Hardcase\" served in the 501st Legion, a unit in the Galactic Republic's Grand Army. When Hardcase was training on the planet Kamino, his commander told him that while he was growing in his cloning tank, the tank had a leak, resulting in Hardcase acquiring a hyperactive personality. Around 21 BBY, during the Clone Wars, Hardcase served under the command of High Jedi General Obi-Wan Kenobi. After a battle above the planet Saleucami, the Confederate General Grievous used an escape pod to jettison from his starship down to Saleucami's surface. Chasing after Grievous, Kenobi gathered a team of clone troopers, including Hardcase, to hunt down the cyborg General on Saleucami. After landing on the surface of the world aboard an Acclamator-class assault ship, Kenobi's battle group found the wreckage of Grievous' crashed landing ship, and Commander CC-2224, nicknamed \"Cody,\" told Kenobi that the ship had crashed recently. Kenobi decided to split the group into two teams and ordered Captain CT-7567, nicknamed \"Rex,\" to find the missing escape pods with troopers Hardcase, Jesse, and Kix, while he, Cody, and Crys stayed behind to go through the remains of the crashed ship."}, {"tag": "p", "text": "After mounting separate BARC speeders, Hardcase and the team drove through the wetlands of the planet's surface in search of escape pods. Ahead of them, two commando droids were stationed on top of a hill overlooking the clones. Utilizing a blaster rifle, one of the droids shot Rex, knocking the Captain off his speeder. Jesse ordered Hardcase to turn his speeder around and protect the Captain, while he and Kix drove toward the hill from where the shot had been fired. Once the two droids were destroyed, Jesse and Kix rejoined Hardcase, and Kix took the opportunity to survey Rex's injury which was severe. Hardcase pointed out that the two droid commandos might have called for backup, and that they needed to find shelter for Rex. Noticing domesticated eopies, Jesse concluded that they were on farmland, which meant there was a homestead nearby. Kix attached a flatbed on the side of his BARC speeder and laid Rex on top of it, before the team drove off to find the homestead."}, {"tag": "p", "text": "Upon arriving at the nearby homestead, a female Twi'lek, Suu, greeted the clones warily, pointing a rifle at the intruders. When Kix informed her that they needed a place to settle the injured Rex for the night, Suu gave the clones permission to use her barn. After Kix placed a bacta patch on Rex's wound, the Captain regained consciousness, and Hardcase informed him that if the injury had been about five centimeters to the left, the shot would have gone straight to his heart, resulting in death. The trooper also retrieved one of Rex's blasters and placed it by his side. Before Hardcase, Kix, and Jesse left to continue their search for the escape pods, Rex gave Jesse the responsibility of leading the search party. Once the clones boarded their BARC speeders, Kenobi contacted the group via comlink and called for Rex. After Jesse told Kenobi what had occurred to Rex, Kenobi wanted the troopers to drive westward toward an abandoned escape pod and intercept Grievous, who was heading toward the pod."}, {"tag": "p", "text": "Though Hardcase, Jesse, Kix, arrived near the pod, Grievous was the first to arrive at the location. Kenobi, however, had already engaged Grievous' forces by the time Jesse's team arrived on their BARC speeders. As Hardcase, Kix, and Jesse fired their speeder's blaster cannons at Grievous' battle droids, the clones spotted an approaching Confederate shuttle in the sky, and Jesse warned Kenobi via comlink. After a nearby Republic AT-TE's guns overheated, Kenobi ordered Cody and Jesse to cover him as he raced toward Grievous. The two engaged in a lightsaber duel as the Confederate shuttle approached them, eventually coming to a hovering stop above the escape pod; Grievous fired his tow cable on the hull of the shuttle and fled in the vehicle. While Hardcase and Kix remained near Kenobi's AT-TE with other clone troopers squads, Jesse and Cody—aboard their speeders—returned to Kenobi after dispatching the remaining battle droids. The Jedi Master told both clone troopers to contact the Republic fleet and order them to send a transport to pick them all up."}, {"tag": "h3", "text": "Umbara"}, {"tag": "p", "text": "Later in the war, Hardcase continued to serve in the 501st Legion. Under the command of Jedi General Anakin Skywalker, Hardcase was dispatched to the Confederate-aligned planet Umbara. The Republic task force sent there initiated an attack to retake the world that was once part of the Republic, and to capture its capital city. Aboard an Acclamator-class assault ship, which broke through the Confederate blockade in orbit of Umbara, Hardcase boarded a space gunship, while the clones' leader, Skywalker, boarded Clone Lieutenant Hawk's gunship with Rex, Jesse, Tup, and several other 501st Legion troopers. As the gunships descended through the shadowy world's atmosphere to the surface, the Umbaran militia stationed on ground level fired on them. Although some gunships crashed as a result of the heavy fire, the clone pilot of Hardcase's gunship was able to maneuver the shuttle to avoid being shot down. As the gunship positioned itself over its designated landing site, Hardcase and the troops deployed and readied themselves to engage the attacking Umbaran Soldiers of the Umbaran militia. Following the lead of Skywalker, whose gunship had landed on the surface before Hardcase's shuttle, Hardcase and his teammates began their initial push against the Umbarans."}, {"tag": "p", "text": "Skywalker's troops on the ground were supported by AT-RT-mounted troopers, as well as space gunships that carried more clone reinforcements. Hardcase met up with Skywalker, Jesse, Tup, ARC trooper Fives, and Rex. Shortly thereafter, Rex gave Hardcase and the troopers the order to eliminate enemy Umbaran soldiers on a nearby ridge. After helping his troops defeat a vixus, a sharp-toothed, tentacled creature that lived on Umbara, Hardcase made camp on the trench-filled ridge with the rest of Skywalker's team. Behind Skywalker's camp, several Umbaran soldiers spotted the clones and one released a millicreep probe droid to infiltrate the area. The probe droid, whose purpose was to distract the clones and help the Umbarans prepare for their subsequent attack on the Republic forces, caught the attention of Hardcase and various clones. Unaware that the probe was a distraction, Hardcase used his Z-6 rotary blaster cannon to fire on the droid, although soon the hidden Umbarans revealed themselves and began their ambush on Skywalker's forces. To suppress enemy fire, Rex called in an air strike team, led by Clone Commander pilot \"Odd Ball.\" Before Odd Ball's bombers arrived at their position, Skywalker led Hardcase and the rest of the clones off the ridge."}, {"tag": "p", "text": "Not long after the bombing, a space gunship, flanked by two clone Z-95 starfighters, landed near Skywalker's team. The craft carried the stern Besalisk Jedi Master General Pong Krell, who had been leading another clone battalion on Umbara alongside Jedi Master Saesee Tiin. Krell informed Skywalker that the Jedi Council had ordered him back to the planet Coruscant immediately, and Krell would then temporarily lead the 501st Legion on Umbara as an interim. Skywalker left aboard Krell's gunship, and the stern Jedi Master informed Hardcase and the 501st troopers of his strict beliefs on standard protocol. Following his introduction, Krell ordered Rex to ready all clone platoons, and the teams began to follow the Besalisk Jedi through Umbara's jungle terrain, heading toward the planet's capital city. When a trio of flying creatures known as banshees approached Krell's team, Hardcase and the troops defensively fired their weapons at the flying animals. As the creatures attacked the clone troopers, one of the creatures lifted a clone off the ground. Noticing the ambush, Krell intervened and forced the creature to release the trooper, before killing two animals with his twin double-bladed lightsabers."}, {"tag": "p", "text": "Following the event, Hardcase and the 501st troops walked for nearly twelve hours. To allow his troops to rest, Rex wanted his men to make camp, a decision that was not well received by Krell, who dictated that the platoons of the 501st were crucial to the Republic's success on Umbara. Without resting, Hardcase and the team made their way to the outskirts of Umbara's capital city. While Skywalker had originally planned to deplete the city's defenses first before initiating multiple attacks, Krell wanted an all-out forward assault to the city. To achieve that, Hardcase and the clones would use a highway that led into the city itself. When the clone troopers began to walk on the highway, several of the clones exploded as a result of hidden enemy mines on the ground. As Fives began to scan the surface of the highway to locate the mines, Umbaran troops, who were hiding behind nearby vegetation, ambushed Hardcase and the troopers. The Umbarans utilized their hover tanks, equipped with EMP cannons, against the clones and advanced toward their position. Although Hardcase and other clone troopers killed a number of Umbaran troopers, the native species overran the clones, forcing the Republic battle group to fall back."}, {"tag": "p", "text": "After positioning themselves away from the Umbaran militia, Hardcase and the clone troopers resumed their firefight with the attacking Umbarans, though the Umbara natives began to retreat. Krell believed that his plan to take over the city was compromised and blamed the setback on Rex and his leadership. After a heated debate between Krell and Rex, the Jedi Master dismissed the Captain and wanted Hardcase and the 501st to continue carrying out his plan of taking over the city. As the clones proceeded into Umbara's dense jungles, Hardcase and the troops found themselves being attacked by Umbaran starfighters, whose ray shielded cockpits proved useful against the clones' blaster fire. However, as Hardcase and the clones continued their assault on the starfighters, two of the Umbaran fighters retreated. In case the starfighters returned, Rex wanted his men to move out of their current positions and engage the nearby Umbaran troop lines. As Rex's men fought the Umbaran militia, Hardcase stood with Krell, who conferred with Kenobi via hologram."}, {"tag": "h4", "text": "Attacking an airbase"}, {"tag": "p", "text": "Kenobi informed Krell that he was unable to take control of the Umbara capital city because its defenses were being resupplied by an airbase, which was located west of the city. The Jedi Master wanted Krell and the 501st to capture the airbase so that the city's supply lines could be severed. After their conversation ended, Krell ordered Rex to map out the coordinates of the airbase and gather Hardcase and the rest of the 501st troops. Overlooking the airbase on the top of a cliff, Rex noticed the gorge that led to the heavily-fortified base was narrow, which would force the troops to walk in single squads. When Rex wanted to make use of reconnaissance to find an alternate secure path to the airbase, Krell dismissed the Captain's opinion, as they did not have enough time to find another route. After Hardcase and the clone troopers regrouped at the bottom of the cliff, Rex ordered the men of the 501st to separate into two divisions—he would lead a group of troops, while Fives would lead Hardcase and the other division."}, {"tag": "p", "text": "Proceeding into the narrow gorge, Hardcase and Fives' group encountered a deadly Umbaran Impeding Assault Tank, which had been buried beneath the ground. The Umbaran tank, soon to be joined by four other tanks, attacked Hardcase and the clones, whose blaster weapons became unreliable due to the tanks' ray shields. In order to destroy the tanks, Fives contacted Rex and requested RPS-6 rocket launchers. After Rex, who was nearby Fives' position, ordered a few of his troops to bring the launchers to Fives' team, one of the Umbaran tanks injured a clone trooper who carried a rocket launcher. Taking the weapon from the clone, Hardcase positioned himself in front of a tank and fired the rocket launcher directly into the tank's ray shielded cockpit, which blew the vehicle apart. Rex ordered Hardcase and the rest of the clones to regroup behind vegetation that blocked them from the tanks. Using thermal detonators, the clone troopers planted the explosives along a corridor of the gorge near the advancing tanks. As soon as the tanks fell into the thermal detonator trap, Rex detonated the explosives, which obliterated the remaining tanks."}, {"tag": "p", "text": "Following the battle with the Umbaran crawler tanks, the clone troopers continued on toward the airbase. Hardcase and the battle group walked by the ruins of the tanks, one of which was still active. On Rex's order, Hardcase used his rocket launcher to destroy the cockpit of the active tank. An Umbaran, who piloted the tank, fell through the damaged window of the cockpit, though Rex made short work of him with his blaster. As Rex began to survey the area in front of them by the airbase, six-legged Umbaran mobile heavy cannons, fitted with electromagnetic plasma cannons, emerged from the distance and began to fire their plasma cannons at Hardcase and the clone troopers. The machines forced the clones to separate into two groups. Noticing the separation of Rex' battle group, Krell ordered Rex that his team continue their attack against the Umbaran mobile cannons. The Captain obliged, and he led Hardcase and his men back toward the six-legged mobile cannons. As Hardcase and the clones engaged the cannons into battle, they noticed their rocket launchers were ineffective against the machines. Instead of taking the cannons head-on as a large group and then attack the airbase, Rex formulated a new plan—Hardcase and Fives would go around the cannons and infiltrate the airbase, while Rex and the rest of the troopers stayed behind and continued their battle against the Umbaran cannons."}, {"tag": "p", "text": "With the plan in motion, Hardcase departed with Fives and the two headed toward the airbase. Upon arriving at the base undetected, Hardcase and Fives found a tree by the base's electric-sensor field that covered the entire perimeter of the base. Hardcase utilized his DC-15A blaster rifle's grappling hook to ascend to the top of the tree, while Fives planted thermal detonators at the base of the tree before climbing the large plant. After killing a banshee that attacked Fives, Hardcase lowered himself into the airbase using a tall plant structure and Fives followed suit. Afterward, the two clones made their way toward a hangar of the base. To distract the attention of the stationed Umbarans, Fives detonated the thermal detonators that he had planted on the tree. Hardcase and Fives boarded two separate deactivated Umbaran starfighters, which alerted nearby Umbaran troops. After gaining control of the unfamiliar starfighters, Hardcase and Fives utilized the vehicles' blaster cannons to kill the attacking troops and destroy several deactivated Umbaran starfighters. To help Rex and his men defeat the mobile cannons, the two clone troopers flew the fighters to Rex's location and took out the six-legged machines. Once the mobile cannons were destroyed, Krell ordered Clone Sergeant CC-1119, nicknamed \"Appo,\" to mobilize his troops and attack the airbase."}, {"tag": "p", "text": "After the Republic force arrived at the airbase, the remaining Umbaran troops stationed there surrendered, allowing Hardcase and the Republic troops to fortify themselves within the former Umbaran airbase. For their efforts, Rex congratulated Hardcase and Fives and claimed both of them saved their footing on Umbara. When Krell wanted a report from Rex, the Captain told the Jedi General of their accomplishments, although Krell believed that it was luck that saved them, a comment that was dismissed by Rex, who claimed that many of his troops died to take the airbase."}, {"tag": "h4", "text": "Betraying orders"}, {"tag": "p", "text": "Though they had captured the airbase, the Republic forces did not control it entirely. In an attempt to retake their base, the Umbaran militia stepped up their attack. When both Hardcase and trooper Dogma informed Krell of the attacking insurgents, the Jedi Master wanted the two clones to reconfigure the airbase's security systems and lock them down, and if they needed to, interrogate their Umbaran prisoners. After Rex told Krell that Kenobi wanted to speak with him, Krell departed with Rex and Dogma, while Hardcase left the group to confer with Fives, who was repairing an Umbaran starfighter nearby. When Kenobi told Krell and Rex of a supply ship resupplying the Umbaran capital city, Krell wanted to attack the capital city with the remaining troops he had instead of attacking the supply ship. Following the meeting, Rex relayed Krell's plan to Hardcase and the other troops, and the clone troopers did not approve of the plan, seeing it as another suicide mission. Not trusting Krell's plan, Fives wanted to use the Umbaran starfighters to sneak past the Umbaran blockade in orbit of the planet, board the supply ship, then destroy it."}, {"tag": "p", "text": "Taking note of Fives' decision, Rex brought up Fives' plan to Krell, who did not support it. The Captain returned to the troopers' barracks and re-enforced Krell's plan of attacking the city. Fives, however, continued to persuade Rex, Hardcase, and the other clones present in the barracks that they could use the Umbarans' fighters to infiltrate the supply ship. Though Rex knew that they could be sent to the Grand Army's court-martial for disobeying orders, Fives defended his own plan and decided to carry it out. Within hangar 9-4 of the airbase, Hardcase and Jesse joined Fives, and Hardcase mounted one of the deactivated starfighters to test it. As Hardcase struggled to maintain control of the starfighter, his reckless flying and inability to control the fighter's weapon systems triggered the alarm systems in the hangar which alerted Krell. After Krell entered the hangar to see what was occurring, Hardcase tried to persuade the stern Jedi Master that the accidents in the hangar were the result of his and Fives' efforts to try to decrypt the Umbaran starfighter codes."}, {"tag": "p", "text": "As a result of Hardcase's words, Krell dictated that the Umbaran starfighters were too dangerous to operate, and ordered the troopers to lock down the fighters and disregard any use of them. Despite Krell's orders, Hardcase and Jesse showed their support toward Fives' plan of using the starfighters. With Hardcase and Jesse agreeing to help him, Fives told the two troopers that once they were in the supply ship, they would destroy the ship's main reactor. Proceeding to carry out the plan, Hardcase, Fives, and Jesse joined Rex outside the airbase. Wanting the troopers to rethink, Rex tried to convince them that they should not carry out the plan, as they would be disobeying orders. After Fives informed the Clone Captain that they had no other option, Rex reluctantly obliged, and informed Fives, Hardcase, and Jesse that he could not help them if they were caught. Hardcase, Fives, and Jesse departed back to the airbase and boarded three separate deactivated starfighters. Soon after taking off from the airbase, the three troopers flew the vessels through Umbara's atmosphere. Once in space, Hardcase and the two other troopers found themselves in the midst of a battle."}, {"tag": "p", "text": "The Republic forces engaged in the battle took heavy casualties from the Confederate tri-fighter droids and Umbaran starfighters. The Umbarans piloting their Umbaran starfighters believed Hardcase, Fives, and Jesse's fighters were part of their battle group, which allowed the three clone troopers to fly through the battle to the Confederate supply ship unharmed. Once they boarded the ship, Hardcase and the group navigated their way through the ship's hangar hallways aboard their starfighters. The droids inside the ship spotted the clone troopers' starfighters and began to close a blast door near the troopers' position. When Hardcase noticed the closing blast door, the clone trooper used his starfighter's missiles to destroy the door. The resulting blast of the missile eradicated the door, although the blast also crippled the right wing of his starfighter. Once the clones pinpointed the location of the reactor room, they used their starfighters' pulse missiles to destroy it, although the room was soon protected by a ray shield activated by the ship's battle droids. After a group of battle droids arrived near the clones' starfighters and began to fire at them, Hardcase dismounted from his vessel."}, {"tag": "p", "text": "Despite resistance from Fives, Hardcase ordered the trooper and Jesse to leave the supply ship, as he would stay behind and take care of the reactor. Taking a pulse missile tube that was detached from his starfighter, Hardcase maneuvered around the ray shield to enter the reactor room. As Fives and Jesse began to retreat toward the supply ship's exit aboard their starfighters, Hardcase rammed the missile tube into the side of the reactor, which caused the missile tube to explode. The blast killed Hardcase and started a chain reaction throughout the reactor room which destroyed the supply ship. Fives and Jesse avoided death and piloted their starfighters out of the supply ship and landed back in the airbase on Umbara. Though they had taken out the Confederate supply ship, which crippled their enemies' supplies in the Umbaran capital city, Krell told Fives and Jesse they had committed a crime, and were to be sent to the Grand Army's court-martial for their actions. However, when Krell later wanted the two clones executed for their crime, the Jedi Master was revealed to be against the Republic. After a battle between Krell and the clones, Krell was killed for his treasonous acts. After Krell's death, Fives and Jesse were released from captivity and the Republic became victorious on Umbara."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a clone trooper, Hardcase stood 1.83 meters tall. His head was clean shaven and sported several tattoos; on the right side of his head, Hardcase had a tattoo that began under his right eye and ran to the top part of his head. His chin also featured similar markings. Hardcase favored the adrenaline-rushing battlefield and had the urge to seek action wherever possible. Because of that, the trigger-happy Hardcase was described as a hyperactive clone, who devoted himself to fight when a firefight broke out. In particular, during the battle on Umbara, as Hardcase fired his Z-6 rotary blaster cannon at the attacking Umbarans, he did not seek cover and continued to sweep the Umbarans with rounds of blaster fire. When the Umbarans began to retreat as a result of Hardcase and the clones' blaster fire, Hardcase laughed at the Umbarans and demanded that they return and fight."}, {"tag": "p", "text": "On Kamino, Hardcase's commander informed him that his less-than-standard behavior was a result from his damaged cloning tank. Hardcase later told Fives this when the latter questioned his behavior on Umbara. However, during the Battle of Saleucami, Hardcase was level-headed and obeyed the orders that were given to him by his team's leader, Rex. When Rex was injured during their hunt for Grievous, Hardcase showed concern for Rex's health and wanted the group to seek shelter, to avoid being caught by droids. The clone trooper informed Rex of how he became injured once he regained consciousness. After Rex gave Jesse the task of leading the group, Hardcase cooperated with Jesse. On Umbara, despite it going against Krell's orders, Hardcase favored Fives' plan of destroying the Confederate supply ship in the atmosphere of the world. Complications aboard the supply ship, however, stalled the clone troopers. Hardcase decided to sacrifice himself to complete the mission, and wanted Fives and Jesse to go back to the airbase without him."}, {"tag": "p", "text": "On the field, Hardcase used a Z-6 rotary blaster cannon. Like Jesse and Kix, Hardcase's Phase I clone armor sported light blue markings. Sometime during the Clone Wars, Hardcase switched to the second phase of the clone armor. Much like his Phase I counterpart, the armor set featured blue markings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hardcase first appeared in \"The Deserter,\" the tenth episode in the second season of the Star Wars: The Clone Wars television series, which aired on January 1, 2010. Like all clones in the show, Hardcase was voiced by Dee Bradley Baker. The original episode guide slideshow mistakenly displayed an image of Hardcase, without his helmet on, attending to Rex after he had been shot off his BARC speeder. In the aired episode, it was Kix, the team medic, who stopped to attend to Rex, and his helmet remained on. Hardcase later appeared in the season four episodes \"Darkness on Umbara,\" which aired on October 28, 2011; \"The General,\" which aired on November 4, 2011; and \"Plan of Dissent,\" which aired on November 11, 2011. After his appearance in \"Darkness on Umbara,\" Hardcase received an entry in the StarWars.com Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}