{"url": "Hard_Sell", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "Hard Sell"}, {"tag": "p", "text": "\"Hard Sell\" is the eleventh episode of the second season of Ewoks. Written by Michael Reaves and directed by Dale Schott, the episode originally aired on ABC on October 25, 1986."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The unfriendly neighbor"}, {"tag": "p", "text": "Wicket, Teebo, Latara, and Kneesaa are walking through the forest on Endor. Kneesaa can't understand why Latara doesn't like her new blue scarf with green stripes. Latara complains that she wanted a green scarf with blue stripes. Teebo says that he doesn't mind going back to Mooth the Trader’s Hut since he always has great stuff to trade. Wicket warns that they are passing by the Bobog's lair."}, {"tag": "p", "text": "Kneesaa says that he is the meanest creature in the forest. Teebo steps on a branch. The Bobog surfaces from his bamboo hut and tells the Ewoks to go away or he will eat them up. The Bobog chases them through the forest. While running, Latara's scarf is caught on a branch. She manages to retrieve it, narrowly avoiding the Bobog who grabs a branch instead. Exiting the forest, the Ewoks run down a hill. The Bobog warns them to stay off his property."}, {"tag": "h3", "text": "Mooth and the Eodon tusks"}, {"tag": "p", "text": "The four Ewoks approach Mooth's hut, just in time for him to sneeze out two pots. Inside the wooden hut, they find Mooth's home in a mess and that Mooth is sick with the cold. Mooth is bathing his feet in a pail of hot water. Mooth tries to make light of his situation while Kneesaa tries to reassure him."}, {"tag": "p", "text": "Wicket finds a pack of Eodon tusks in Mooth's hut and believes they will look great hanging over his hammock. Kneesaa thinks they will look great on her father's helmet. Teebo adds that Eodon tusks have magical powers. Latara thinks they are beautiful and wants one. Sensing their interest, Mooth offers to give the Eodon tusks to whoever can trade the most of his goods."}, {"tag": "p", "text": "Wicket accepts the deal. Mooth tells them that the best place to trade stuff is the river but warns them about the Bobog since he is the meanest customer in the forest. The Ewoks say no kidding and leave before Mooth can sneeze."}, {"tag": "h3", "text": "The Kagels and the swamp pickles"}, {"tag": "p", "text": "By the riverside, Wicket boasts about charming the customers with his good looks. Kneesaa boasts that she and Latara can run rings around him and Teebo. Teebo disagrees. With the competition getting the better of them, Wicket says that he and Teebo can take one side of the river while the girls can take the other side. Kneesaa accepts, saying that whoever can trade the most stuff will win."}, {"tag": "p", "text": "On the other side of the river, Wicket says that he will show the girls they can be better. He and Teebo visit the Kagles' hut, believing they like everything. The Kagles are delighted to see them. Wicket offers to sell Mooth's delicious swamp pickles, which are too repelling even for the flies. Wicket asks Teebo to try and Teebo has a bad reaction. Wicket claims that Teebo passed out from the sheer pleasure."}, {"tag": "p", "text": "The lead Kagle tells Wicket that he doesn’t have to convince them. The other Kagles add that they eat Mooth's swamp pickles all the time but they don't have anything to barter. They take the swamp pickles but fail to pay. Wicket is disappointed while Teebo says that his mouth will never forget the unpleasant experience. Latara laughs while spying on the boys."}, {"tag": "h3", "text": "Unfriendly competition"}, {"tag": "p", "text": "When she returns, Kneesaa tells her off for spying on the boys but wants to know how they are doing. Latara tells her that Wicket and Teebo have performed pathetically and believe that they can acquire the Eodon tusks. Kneesaa approaches the rodent-like Darling, who is chewing tree trunks with her big teeth to make into wooden statues."}, {"tag": "p", "text": "Latara tries to get Darling to trade one of her statutes for one of Mooth's pink cloaks. However, she ends up tearing it into ribbons after it gets caught on a branch. Darling refuses to trade. Spying on the girls, Wicket watches in glee but Teebo reminds him that they haven’t traded anything either."}, {"tag": "p", "text": "Crossing the bridge, an eager Wicket tries to sell a fire feather blanket to Larry. Larry says he wished he had something to trade for but has nothing since he is a lonely, friendless hermit. Larry manages to manipulate Teebo and Wicket into giving him the feather blanker for free. Teebo says that was really nice but Wicket is disappointed they haven’t found paying customers yet. Wicket vows to knock on every door."}, {"tag": "p", "text": "Wicket visits several huts but is met by several rejections from creatures of all size. Frustrated, Wicket decides to try the Bobog. Teebo is reluctant due to the hostility of the Bobog. Wicket is determined to trade something so that the girls do not get the Eodon tusks."}, {"tag": "p", "text": "Meanwhile, Latara and Kneesaa try selling a wart removing device to a reptilian creature. Unsatisfied with Kneesaa’s sale’s pitch, Latara decides to show her how to do a \"proper\" one. Latara walks around and uses her feminine charm in an attempt to sweet talk the reptile. However, this arouses the creature who grabs her and carries her up the tree. Kneesaa is forced to rescue Latara using her lasso."}, {"tag": "h3", "text": "Trouble with the Bobog"}, {"tag": "p", "text": "Following their failed sale, the two girls find themselves near the Bobog’s lair. The Bobog approaches carrying a bag of treasures. Despite their unpleasant earlier encounter, Latara is determined to trade with the Bobog. Kneesaa thinks it is too dangerous but Latara is determined to beat the boys. She hopes to win over the elderly miser with her feminine charms."}, {"tag": "p", "text": "Latara tries to sell shampoo to the Bobog and even squirts some on his hair before massaging it into his scalp. Despite Kneesaa's warnings, Latara pours a jar of tree sap on Bobog's head, which creates a messy mess. The enraged Bobog chases Kneesaa and Latara, who flee up a tree."}, {"tag": "p", "text": "Seeing the girls are in trouble, Wicket and Teebo decide to help. Wicket manages to restrain the Bobog's hands with a lasso but he breaks free. Teebo throws Wicket a jar of candy. Despite his doubts, Wicket throws the candy at the Bobog's mouth, restraining him."}, {"tag": "h3", "text": "Unexpected customers and the Eodon"}, {"tag": "p", "text": "Later outside Mooth's hut, Latara grumbles that they were not able to trade anything while Wicket grumbles that they lost everything. The Ewoks fear that Mooth will be mad. To their surprise, they see the Kagles enjoying themselves at Mooth's hut. However, Mooth is pleased that he brought over the Kagles since they traded their family cold cure for more swamp pickles."}, {"tag": "p", "text": "Mooth adds that even the Bobog came in and trade some jewels for more fudge. He adds that the Bobog loves the stuff. When Mooth asks who deserves the Eodon tusks, Wicket says they are his since he convinced the Kagels to become Mooth's customers. Teebo claims that he deserves it since he had to eat a swamp pickle. Kneesaa contends that they are hers since she carried the pack. Latara disagrees, saying that she risked her life and limb to give the Bobog some shampoo."}, {"tag": "p", "text": "Just then, the Eodon arrives and says that the tusks belong to him. The Ewoks are caught by surprised but a conciliatory Wicket returns the tusks to the Eodon."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}