{"url": "Hardin", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Army of Light members", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Somov Rit residents"], "nodes": [{"tag": "h1", "text": "Hardin"}, {"tag": "p", "text": "Hardin, known as Bug for most of his life due to the custom of his homeworld Somov Rit, was a Force-sensitive Human who was recruited into Jedi Lord Hoth's Army of Light as a youth, in the service of which he died. Living an uneventful life on Somov Rit with his cousins Root, Darovit, and Zannah, Hardin chafed, longing to escape and take charge of his life. When Jedi Torr Snapit arrived and recruited Hardin, Darovit, and Zannah into the Army of Light for training, Hardin leaped at the chance to depart Somov Rit."}, {"tag": "p", "text": "Zannah's presumed death soon after arriving on Ruusan, followed by Snapit's self-sacrifice in defense of the two young boys, stripped away Hardin's gruff, cynical exterior and left him admiring the Jedi, whom he had long criticized in response to Darovit's idolization of them. When Darovit's ideals met reality, he was devastated by the fallibility of the Jedi and the lack of glory in the Light and Darkness War. He defected to the Sith Brotherhood of Darkness, leaving Hardin more determined than ever to prove himself as a Jedi Knight and make up for Darovit's abandonment of the Jedi. During the Seventh Battle of Ruusan, as Hardin guarded an exit from the caves in which Dark Lord of the Sith Skere Kaan detonated his thought bomb, Hardin encountered and dueled Darovit. Darovit's Sith Master, Githany, crippled Hardin, but Darovit could not kill his cousin. Instead, Hardin's spirit became victim to the thought bomb, trapped for over one thousand years. His death, however, galvanized Darovit into rejecting the Sith ways and living the life of a hermit on Ruusan."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Childhood"}, {"tag": "p", "text": "Hardin spent his youth on the quiet world of Somov Rit, undisturbed by the Light and Darkness War raging across the galaxy. There he lived a rural existence with his cousins Darovit and Zannah, whom he knew as \"Tomcat\" and \"Rain.\" Natives of Somov Rit believed that if one's true name was spoken, the swamp demon would claim the unfortunate individual, and as a result used nicknames instead. Hardin went by \"Bug\" in his interactions with others. Cared for by elder cousin Root, Hardin and Darovit were known to be Force-sensitives, though Zannah was not believed to possess the ability to touch the Force."}, {"tag": "p", "text": "Hardin learned to use his Force talents, summoning fish to him so that he could catch them for the family's meals. This use of the Force angered Darovit, an idealistic young man. Darovit's idolization of the Jedi annoyed Hardin, who felt his cousin to be naive and frequently told him so. Hardin chafed on the backwater planet, seeking to find a better life elsewhere, and longed to live without his family members, whom he found annoying."}, {"tag": "h3", "text": "Recruitment"}, {"tag": "p", "text": "One day in 1000 BBY, the cousins were visited by Torr Snapit, a Jedi scout seeking Force-sensitives to recruit into Jedi Lord Hoth's Army of Light for training. Though he was dismayed by Hardin and Darovit's arguing, Snapit agreed to train the children. Despite his skeptical view of the Jedi, Hardin was eager for any chance to leave Somov Rit and make his way in the wider galaxy. After a display of Force-use from Zannah, she too was allowed to travel with Snapit to Ruusan, the site of Hoth's long campaign against Dark Lord of the Sith Skere Kaan's Brotherhood of Darkness. Hardin remained moody during the journey to Ruusan, finally confronting Darovit over his belief that the young man had used the Force during Zannah's test, and not the girl herself. Darovit defended himself by saying he did not want to leave their family behind. They continued arguing as Snapit descended to Ruusan and the ship came under attack by Sith Buzzard fighters. Their fellow recruits Slatka and Sladak were killed, and Zannah tumbled out of the ship into the forest below. Jedi reinforcements arrived, staving off the Buzzards, only after the loss of Hardin's cousin."}, {"tag": "p", "text": "Snapit had to put the damaged ship down in the forest, forcing the boys to trek with him through the terrain toward Hoth's camp. One evening, as they journeyed, the trio was attacked by Sith soldiers. Wielding only a tree branch as a club, Hardin defended himself, subduing at least two warriors in the melee. Continuing harassment by Sith forces led the group to flee to a rope bridge crossing a small canyon. Snapit, wounded by an arrow to the leg, held the bridge as the boys scrambled across before cutting it, plunging himself and the enemy troops into the chasm and guaranteeing the safety of the Jedi candidates. Hardin wanted to move on to safety, but Darovit insisted on climbing into the ravine to retrieve the Jedi Knight's lightsaber. By the time Darovit returned to the top, a party of Sith arrived. Before they could attack, a Jedi squad under General Kiel Charny annihilated the Sith contingent, saving the boys."}, {"tag": "p", "text": "Charny led the pair to the Jedi encampment. There, Darovit expressed his disillusionment with the Jedi's rough camp life and susceptibility to death, leading Hardin to abandon his gruff demeanor and defend the Jedi as noble and admirable. When the pair was assigned to assist in moving the kitchen wagon, Hardin accepted the assignment while Darovit angrily objected to taking a duty he saw as beneath him. Hardin continued to serve in camp until after the devastation of the Sixth Battle of Ruusan. He sought out Darovit, who had been involved in the fighting, only to hear that his cousin had killed Charny and joined the Sith. Astounded and outraged, Hardin was initially disgusted with his cousin's behavior before realizing that it was up to him to take Darovit's place among the Jedi and restore a balance within his family. As Hoth prepared for a final confrontation with the Brotherhood of Darkness, Hardin was armed with the rest of the support staff. Hoth personally questioned Hardin's commitment in the wake of Darovit's defection, seeking to make sure he was not acting out of a desire for revenge or sympathetic to his relative. Hardin's explanation of his motives impressed Hoth, who granted Hardin a lightsaber and welcomed him to the Jedi Order, prompting Hardin to reveal his true name."}, {"tag": "h3", "text": "Confrontation"}, {"tag": "p", "text": "As Hoth led his men into the caves where Kaan awaited, Hardin and two other members of the kitchen staff were assigned to guard a rear exit from the caves. Hearing something within, Hardin led the others inside. There they found the Sith Lord Githany and her apprentice, Darovit. The others were killed, and Githany disarmed Hardin before he used his affinity with animals to summon the bats within the cave to swarm her. Hardin then dueled his cousin, taunting him as a traitor. As soon as Githany recovered, she used her lightwhip to sever Hardin's right leg, leaving him for Darovit to kill. Darovit could not manage to strike down his cousin, however. At that moment, Kaan activated his thought bomb. The thought bomb drained Hardin's life as the cave began crumbling, a falling stalactite crushing Hardin's withered body."}, {"tag": "p", "text": "Hardin's death proved to be the shock needed to jar Darovit away from the dark side of the Force. Surviving the thought bomb, he abandoned both the Jedi and the Sith to live as a simple hermit. Hardin's spirit was trapped by the thought bomb, to be held for over one thousand years in what became the Valley of the Jedi. His spirit, along with the rest of the trapped Jedi and Sith spirits, would eventually be released when Kyle Katarn defeated Jerec and freed the souls in the Valley of the Jedi in 5 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a boy on Somov Rit, Hardin was skeptical and argumentative, often to the point of rudeness. He disdained Darovit's idolization of the Jedi, instead believing that reality was not nearly as heroic as Darovit believed. As a result, he was prone to antagonize his older cousin in the name of challenging Darovit's views. He did not get along with the others well, instead maintaining that he wanted to be rid of them and of his boring life on Somov Rit. After Zannah's presumed death, Hardin grew less confrontational and more apt to express attachment to others. He was openly aghast when Torr Snapit sacrificed himself on Ruusan, crying out against it. He spoke in defense of the Jedi's inner nobility after Darovit criticized camp life in the Army of Light, and was outraged when his cousin impugned Snapit. In the wake of Darovit's defection, Hardin was furious with his cousin. His anger soon gave way to a commitment to join the Jedi and attempt to atone for Darovit's actions by taking his place and fighting on the side of the light. He saw their cause as noble, and when he confronted Darovit he displayed his anger and sense of betrayal at Darovit's desertion, chiding him for turning away from the Jedi path."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Root believed that the Force was strong with Hardin. As a youth on Somov Rit, Hardin was able to use the Force to lure fish to him, allowing him to kill them for food. It was a manifestation of a telepathic ability which allowed him to read the minds of other beings and communicate with animals."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Hardin was created by writer Darko Macan for the comic Jedi vs. Sith and illustrated by Ramón Bachs. Though initially portrayed as the darkest of the three cousins whom the comic follows, Hardin was the only character of the trio to remain true to the light side throughout the entire story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}