{"url": "Hark", "categories": ["Category:Canon articles", "Category:Captains", "Category:Humans", "Category:Imperial Super Commandos", "Category:Males", "Category:Mandalorians"], "nodes": [{"tag": "h1", "text": "Hark"}, {"tag": "p", "text": "Hark was a male Mandalorian human who served as a captain in the Imperial Super Commandos. Hark commanded the Imperial convoy that transported Alrich Wren but was ambushed by renegade Mandalorian and Rebel Alliance forces. Hark later received orders from the Mandalorian Governor Tiber Saxon to withdraw Clan Saxon and the Empire's forces from the battlefield so that Saxon could test \"the Duchess\" on the renegades. He later objected to Governor Saxon's plan to strengthen the weapon on the grounds that the Empire would eventually turn it against all Mandalorians. For his objections, Saxon shocked Hark with the weapon. After Saxon was incapacitated when the rebel Sabine Wren adjusted the weapon to affect Imperial armor, forcing Hark to flee."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Transporting Alrich"}, {"tag": "p", "text": "Hark was a captain in the Imperial Super Commandos during the Imperial Era. The Imperial Super Commandos served as the soldiers of Clan Saxon, an Imperial-aligned Mandalorian clan that ruled Mandalore on behalf of the Galactic Empire. Following the death of Viceroy Gar Saxon in 2 BBY, Mandalore was plunged into civil war. Saxon's brother Tiber Saxon succeeded him as Governor. In 1 BBY, Hark commanded an Imperial convoy that was tasked with transporting Alrich Wren to the capital Sundari for execution. Clan Wren had risen against Clan Saxon with Alrich's wife Countess Ursa Wren killing Governor Saxon after he tried to murder her daughter Sabine Wren, who had joined the the rebellion."}, {"tag": "p", "text": "On the way to Sundari, the Imperial convoy was attacked by Clan Wren forces under Ursa and her son Tristan. Hark redirected the Imperial Troop Transport carrying Alrich plus two others and a detachment of scout troopers on speeder bikes, stormtroopers, and Imperial Super Commandos to a canyon. Captain Hark then informed Governor Tiber about avoiding the rebel attack. Tiber responded that he would be sending \"reinforcements.\" Hark then taunted his captive Alrich about enjoying Sundari's architecture for the last time. While Captain Hark believed that he had escaped the renegade Mandalorian forces, he did not know that Countess Wren had deliberately redirected the convoy into a canyon where a joint rebel-Mandalorian forced led by Sabine, Fenn Rau, and Lady Bo-Katan Kryze was lying in wait."}, {"tag": "p", "text": "The renegades and rebels ambushed the convoy, quickly overpowering the Imperial and allied Mandalorian escorts. During the fighting, Captain Hark was thrown out of his transport by the Jedi Padawan Ezra Bridger, a friend of Sabine and member of the Rebel Alliance. After the renegades had rescued Alrich, Hark contacted Governor Saxon and informed him about the successful rebel attack. Tiber responded that the rebels had planned well and ordered him to withdraw all remaining Imperial forces since he was going to deploy \"the Duchess,\" which was capable of reacting with the beskar alloy inside Mandalorian armor and incinerating their wearers."}, {"tag": "h3", "text": "Rising dissent"}, {"tag": "p", "text": "After Grand Admiral Thrawn advised Governor Saxon that he needed the Duchess's creator in order to realize the weapon's full potential, Tiber assigned Hark to capture Sabine. When Sabine led a joint rebel and Mandalorian strike team on a mission to destroy the Duchess aboard Tiber Saxon's Star Destroyer, Hark and Governor Saxon trapped Sabine and the former Mandalorian Regent Bo-Katan Kryze inside the weapon's store room. Tiber demanded that Sabine fix the weapon in order to strengthen it and unleashed the weapon on her and Bo-Katan when she refused."}, {"tag": "p", "text": "When Hark objected on the grounds that the Empire could use the Duchess against Mandalore, Saxon unleashed the weapon on him as well. Governor Saxon then gave the three Mandalorians some respite. Sabine pretended to comply but reset the weapon to target stormtrooper armor. Since Governor Saxon was wearing stormtrooper armor, he was affected. Sabine toyed with killing Governor Saxon but Bo-Katan convinced her not to descend to the Empire's level. After Sabine slashed the Duchess with the Darksaber, Hark took the opportunity to flee before Saxon's Star Destroyer exploded and crashed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Captain Hark was a human male Mandalorian warrior. As a member of the Imperial Super Commandos, he wore Mandalorian armor that covered him from head to foot. He had a low opinion of Alrich Wren, taunting him about marveling at Sundari's architecture before his impending execution. Hark later objected to Governor Tiber Saxon forcing Sabine to strengthen the Duchess on the grounds that the Empire could use the weapon against Mandalore. For this, Saxon unleashed the weapon on him. Right before Sabine destroyed the Duchess, Hark took the chance to escape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hark first appeared in Star Wars Rebels: Heroes of Mandalore, where he was voiced by Andrew Kishino, who also voiced Saw Gerrera in Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}