{"url": "Alter_Environment/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alter powers", "Category:Light side powers"], "nodes": [{"tag": "h1", "text": "Alter Environment"}, {"tag": "p", "text": "Alter Environment was a Force power that involved various techniques that allowed the user to manipulate nature, enabling the creation of phenomena such as Force whirlwinds or fog that could be used to attack or to shield the user from opponents. Plo Koon further modified this ability with his considerable knowledge of physics."}, {"tag": "p", "text": "Alter Environment could be used to manipulate temperatures, creating freezing sub-zero temperatures in seconds, or blistering heat that could burn. With this ability, a user could generate electrical discharges over broad expanses of ground, vacate areas of air, or increase the pressure of the air to burst eardrums. The power allowed a Force-user to form small earthquakes and fissures or gather the moisture in the air to bring about flash floods. Moreover, Alter Environment could influence already existing natural occurrences. For instance, a thunderstorm could be manipulated to unleash a burst of lightning, rain clouds to start up torrential rains, or cause the sky to hail. Windswept seas could be coaxed to rear up in massive waves or form whirlpools."}, {"tag": "p", "text": "This ability utilized the innate Force energy, or life force, of the object being manipulated instead of the Force energy of the user. In other words, when a Force-user used this power, he would use a small amount of his own power to harness the innate power already present. Novices were able to sense and feel the environment while masters of this ability could control the elements at will. This could lead to the formation of killer waves and lightning storms with minimum effort and concentration, and depending on the amount of energy expended, little stamina. A greater knowledge in physics would result in more precise control, and a larger range of methods this power could be used, as well as improve the time it took to enact. However, a being would need to monitor the effects in order to keep them from spreading to disastrous consequences."}, {"tag": "p", "text": "Streen and the Sith Emperor were notable adepts of these talents. The Sith Emperor used this ability to corrupt the environment of the planet Dromund Kaas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}