{"url": "Haroon", "categories": ["Category:Legends articles", "Category:Atrivis sector astronomical objects", "Category:Crystalline moons", "Category:Galactic Empire moons", "Category:Outer Rim Territories moons"], "nodes": [{"tag": "h1", "text": "Haroon"}, {"tag": "p", "text": "Haroon was the sole moon of the Imperial penal world Despayre, located in the Horuz system of the Outer Rim's Atrivis sector. The crystalline surface of the moon was exploited by the Galactic Empire after the relocation of their partially-constructed Death Star superweapon in orbit of Despayre. A small mining operation was set up on Haroon, where very large, specially cut crystals were extracted for use in the construction of the Death Star. Near its completion in 0 BBY, the Death Star destroyed Despayre in a three wave test fire of its superlaser, reducing the planet to a debris field, which presumably consumed Haroon in the process."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally, Haroon was only visually depicted as a satellite orbiting Despayre in a cutscene from the 1993 video game Star Wars: X-Wing, which showed the destruction of Despayre by the Death Star's superlaser. Haroon was being fully developed by LucasArts for the video game Star Wars: The Force Unleashed, initially as a completely original planet. It was to have been a green, crystal world where the Empire was mining the materials needed to create the immense focusing lenses on the Death Star. At least two pieces of concept art for Haroon were created by Greg Knight, depicting a scene where an incomplete Death Star fires on the crystal-covered surface of the planet."}, {"tag": "p", "text": "The March 2007 issue of Game Informer magazine first announced Haroon as a playable environment in The Force Unleashed, and by this point Haroon was referred to as a moon. The game's protagonist, Darth Vader's secret apprentice, was to journey there to rescue the Mon Calamari Gial Ackbar, who had been sentenced to a lifetime of labor in the mines of Haroon. However, issues arose when it was discovered that Ackbar's rescue from the Empire and recruitment into the Rebel Alliance were already depicted in other sources and did not fit with what the developers had in mind. Ultimately, Haroon was removed from the game and replaced with the more iconic Cloud City from Star Wars: Episode V The Empire Strikes Back."}, {"tag": "p", "text": "Nevertheless, Haroon eventually found its way into canon in some form. In 2008, The Force Unleashed Campaign Guide first identified Haroon as Despayre's moon and attributed elements from The Force Unleashed's concept stages to it, such as its crystalline surface and the Imperial mining operation being conducted there. In 2009, The Essential Atlas also referenced Haroon and the moon was depicted in an image of Despayre's destruction, illustrated by Chris Trevas."}, {"tag": "p", "text": "Though Haroon was described as being a green world in the concept stages of The Force Unleashed, X-wing depicts the moon as purple in color and the illustration in The Essential Atlas shows the moon being illuminated by Despayre's destruction, making its intended hue unclear. While no source has yet to clarify whether Haroon was destroyed along with Despayre, the moon is no longer visible after Despayre is annihilated by the Death Star in the X-wing cutscene."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}