{"url": "Althin", "categories": ["Category:Canon articles", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Althin"}, {"tag": "p", "text": "Althin was a Rodian male born on the moon Jedha to Steya and Tok, owners of a shop in Jedha City. Several weeks before his eighth birthday, Althin's parents were killed during an attack on the Galactic Empire by Saw Gerrera's partisans."}, {"tag": "p", "text": "Althin was found wounded after the attack by the blind Guardian of the Whills Chirrut Îmwe, who was an old friend of the Rodian's family. The Guardian then carried Althin across Jedha City, encountering several stormtroopers on the way, and delivered him to an orphanage run by the sisters Kaya and Killi Gimm, who treated his physical wounds. Althin's psychological wounds were not so easily fixed however, and due to shock he refused to speak."}, {"tag": "p", "text": "Îmwe and Malbus then devised a plan to get Althin and the other orphans under the Gimm sisters' care off Jedha and away to safety. With the aid of the Partisans, Malbus secured a Sentinel-class landing craft in the Jedha City spaceport while Îmwe led the orphans along with the Gimm sisters and the pilot Denic across the city, garnering much attention as they did so."}, {"tag": "p", "text": "Upon reaching the spaceport, the group discovered that the Partisans had had a change of heart and decided to take the shuttle for themselves. Determined to see the children to safety, Îmwe talked down several of the Partisans and forced the others to abandon their plans for the shuttle by carrying Althin onboard with the other children following behind. Kaya and Denic then stayed with the children on the shuttle and piloted it off Jedha and away from the Empire and the insurgency to safety."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Growing up on Jedha"}, {"tag": "p", "text": "Althin was the Rodian male child of Steya and Tok, a couple who had moved from the planet Rodia prior to the end of the Clone Wars to the moon Jedha, where Althin had been born. The family lived above their storefront in Jedha City, built one block off the Blessing Way, where Althin's parents sold guides and simple works on the Force and similar topics to pilgrims and tourists visiting the city."}, {"tag": "p", "text": "Chirrut Îmwe, a blind Guardian of the Whills and friend of Steya and Tok, knew Althin from the day the Rodian was born. The Guardian at one point overheard Althin approach a group of pilgrims in one of Jedha City's markets arguing over where to find the Emitter of Constant Hope and introduce himself before providing directions. When the pilgrims thanked the Rodian boy and offered him money, Althin refused to accept it and requested they give it to someone who needed it more."}, {"tag": "h3", "text": "The Jedha insurgency"}, {"tag": "p", "text": "Prior to Althin's eighth birthday, the Galactic Empire began mining kyber crystals on Jedha, and their presence on the world quickly led to a variety of insurgencies forming against them. These rebellious forces were eventually unified under Saw Gerrera, the leader of an offworld faction of partisans who had set up base near Jedha City."}, {"tag": "p", "text": "With Gerrera in charge, insurgency attacks on the Empire escalated to a point where the Imperials responded one morning several weeks before Althin's eighth birthday with a large scale deployment of troops from the Imperial I-class Star Destroyer Dauntless in orbit. As stormtroopers began scouring the city for the insurgents and their allies, the partisans began attacking them across the city."}, {"tag": "p", "text": "Fearing for their lives, Tok and Steya hid inside with Althin; however, the street on which they hid was rigged with explosives by the partisans. When an Imperial All Terrain Defense Pod passed through, the Partisans detonated their explosives and destroyed the walker, demolishing several homes in the process including the Rodian family's hiding place. Tok and Streya were killed by the explosion, but Althin survived with a broken arm."}, {"tag": "h3", "text": "Journey to the orphanage"}, {"tag": "p", "text": "Îmwe discovered Althin alongside his parents' bodies, and made him a makeshift sling with a sash torn from his robe. The Guardian then proceeded to carry the wounded boy through Jedha City toward an orphanage run by his friends the Gimm sisters, Kaya and Killi. Althin gripped Îmwe's arm but remained silent as he was carried other than to whimper when the guardian made sudden movements."}, {"tag": "p", "text": "Enroute to the orphanage, Îmwe sensed an approaching TX-225 GAVw \"Occupier\" combat assault tank and backed into a doorway to avoid it, but was still spotted by a stormtrooper who approached and questioned the Guardian. Îmwe explained that Althin's parents were dead and that he was taking the boy for medical treatment, making the trooper uneasy and causing him to let them pass with a warning about a curfew that would be enforced that night."}, {"tag": "p", "text": "Twice more the pair were stopped by stormtroopers and both times they were allowed to pass without incident or empathy. Althin shifted position so that his good arm was around Îmwe's neck while his legs were wrapped around the Guardian's waist. Near the First Spire, the sound of blasterfire caused the Rodian to tense, but the pair managed to reach the orphanage safely. Kaya took Althin from Îmwe so she could treat his arm, but the boy was reluctant to let go of his protector until the Guardian reassured him he would be close by."}, {"tag": "h3", "text": "March across Jedha City"}, {"tag": "p", "text": "The Gimm sisters managed to set Althin's arm, but the boy still refused to speak as he was in shock. Killi managed to get the Rodian to take a few sips of juice and then stayed with him and the other children, whose presence the sisters hoped would help calm him. Knowing that there were now too many children for the orphanage to hold, and likely more on the way, Baze Malbus, a former Guardian of the Whills and friend to Îmwe and the Gimm sisters, proposed that they move the orphans off world to a safer location."}, {"tag": "p", "text": "With arrangements made for an Imperial Sentinel-class landing craft to be acquired by Gerrera's partisans, it was decided that Kaya and the pilot Denic would accompany the children once they were onboard the shuttle. After much discussion, it was decided that the easiest way for the children to reach the shuttle in Jedha City spaceport was for them to walk across the city, as a group of mostly children was unlikely to incur the wrath of the Empire."}, {"tag": "p", "text": "As Malbus secured the shuttle with the aid of the Partisans Wernad and Leevan Tenza, the procession from the orphanage set out at midday. Îmwe led the group of thirty-four children, with Althin walking beside him holding his hand and Kaya, Killi and Denic all guiding the large group. Occasionally the group who have to stop when Killi had a coughing fit, but otherwise they kept moving, through the Old Market and onto the Blessing Way, at which point other residents of the city, curious as to what was going on, began to follow them."}, {"tag": "h3", "text": "Trouble at the spaceport"}, {"tag": "p", "text": "By the time the procession reached the Square of Stars, fifty people were following, a figure that doubled by the time they reached the end of the Blessing Way and then doubled again by the time they turned onto the Pilgrim's Path. The Empire carefully watched the procession as it progress, but were unsure of how to respond, and by the time they realized the group were headed to the spaceport there were five hundred people following the Guardian and the orphans."}, {"tag": "p", "text": "Upon reaching the spaceport, Althin spotted stormtroopers ahead and tightened his grip on Îmwe's hand; however, the Imperials let the children and their guardians pass without incident. The crowd following the orphans became stuck at the archway entrance into the port due to their number. Hearing the commotion as they tried to get through, Îmwe asked Althin what was happening, but as the boy was still yet to speak due to shock, the orphan Togruta B'asia answered him instead."}, {"tag": "h3", "text": "Escaping Jedha"}, {"tag": "p", "text": "Upon reaching bay eighteen, where the shuttle they were stealing was located, Îmwe met with Malbus who warned him that the Partisans had made a change of plans and decided to use the shuttle to bomb the Dauntless instead. After a moment's thought, the Guardian carried on toward the shuttle, followed by Althin after some hesitation and then the other children. The Partisans Kullbee Sperado and Wernard pleaded with Îmwe to stop, and then the Twi'lek Partisan Beezer Fortuna halted him at the entry point to the shuttle, giving a speech to those present about how Gerrera would bring hope to Jedha by destroying the Star Destroyer."}, {"tag": "p", "text": "Unconvinced, Îmwe and Malbus briefly argued with Beezer and convinced Sperado and Wernard of their cause. Îmwe then picked Althin up to carry him and walked aboard the shuttle, followed by Malbus and B'asia, and then the other children. Beezer tried to stop them, but stood aside, realizing that Gerrera would not want the Partisans to be seen stopping children from being saved by the crowd of hundreds that had followed Îmwe."}, {"tag": "p", "text": "Onboard the shuttle, Îmwe sat Althin down in one of the seats and then crouched beside him to speak as Sperado and Wernad began to remove Tenza and the partisans' explosives from the starship. The Guardian then gave the Rodian a hug, and Althin whispered something to Îmwe that made him smile. Once the others had all said their goodbyes, Îmwe got off the ship and Denic piloted the shuttle up out of the spaceport and out from under the shadow of the Dauntless and then away to safety."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Althin was a well behaved child who loved to read and draw. He helped strangers when they were lost and refused payment for the aid, requesting it be given to the more needy instead. After the death of his parents, Althin suffered from shock, refusing to speak to anyone for quite some time as he was deeply psychologically wounded by the event."}, {"tag": "p", "text": "He finally broke his silence to say goodbye to Îmwe, who he had become very attached to after the guardian saved him, often gripping onto him for reassurance when scared and not wanting to be parted from him. When hearing that the partisans were taking the shuttle, Althin understood enough to be shocked, his black-colored eyes nearly doubling in size. He had long slender fingers tipped with soft suction cups."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Althin first appeared in the novel Guardians of the Whills, which was written by Greg Rucka and released on May 2, 2017."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}