{"url": "Harrandatha_Estillo", "categories": ["Category:Legends articles", "Category:Eiattuans", "Category:Humans", "Category:Males", "Category:Royal family of Eiattu 6"], "nodes": [{"tag": "h1", "text": "Harrandatha Estillo"}, {"tag": "p", "text": "Harrandatha Estillo, also known as Harran, was a Human male prince who served as a member of the royal family of Eiattu 6, a Mid Rim world (possibly capital of Ado sector) which retained its monarchical government under the New Order."}, {"tag": "p", "text": "After his death, he was replaced by an Imperial agent."}, {"tag": "h2", "text": "The true Harran"}, {"tag": "p", "text": "The son and heir-apparent of the reigning monarch, Uthorrferrell Cartha, Harran had a vicious, psychotic personality, and from boyhood supported the Galactic Empire. His personal hero was Darth Vader, and on a visit to Eiattu, the Dark Lord of the Sith molded the young prince as his protégé and proxy, using mental manipulation to transform his hot-blooded sadism into something cold and calculating."}, {"tag": "p", "text": "During Harran's childhood, the Eiattauan nobility overthrew the royal family and sent them into internal exile, forming a ruling council, known as the Priamsta, to govern in their stead. A faction of the Priamsta resolved to murder the dynasty, but Harran was killed not by the nobles or their agents, but rather by his sister, Plourr, who he attempted to stop from escaping so that he could watch her die. Plourr clubbed him to death with a rock, and left his body in the bush for the Thuvasaurs to eat."}, {"tag": "h2", "text": "The false Harran"}, {"tag": "p", "text": "Years later, a man claiming to be Prince Harran led the revolutionary People's Liberation Battalion against the Priamsta, apparently satisfying tests to prove his bloodline, and wearing the ring which Vader had given the prince—in fact an Imperial mind-control device."}, {"tag": "p", "text": "However, he was not only an impostor, but an agent—and lover—of Moff Leonia Tavira. This false prince was exposed by the returned Plourr, who took the leadership of her people after the expulsion of the Empire. Harran's ring hand was blasted away in a firefight, and he was reduced to a catatonic state, his mind destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}