{"url": "Althiri", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Undefined social groups"], "nodes": [{"tag": "h1", "text": "Althiri"}, {"tag": "p", "text": "The Althiri were the inhabitants of the Outer Rim planet Althir III. During the Mandalorian Wars, their homeworld was assaulted by the Mandalorian Neo-Crusaders. Despite holding off the invaders for five days, the Althiri were eventually defeated. The Mandalorians were later repelled from Althir by Galactic Republic forces under the command of the Jedi Revan and Malak."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Althiri were the inhabitants of the planet Althir III, a world with multiple rings, which was located in the Rolion sector of the northern Outer Rim Territories. They manufactured their own starships as well as producing weapons of mass destruction."}, {"tag": "h3", "text": "Invasion"}, {"tag": "p", "text": "In 3976 BBY, Althir was outside the borders of the Galactic Republic. It was one of the first two targets attacked by the Mandalorian Neo-Crusaders in what would become known as the Mandalorian Wars. For five days, the Althiri held the Mandalorians at the outer-most rings of their planet in a conflict that became known as the Battle of Althir, preventing them from making a direct assault on their homeworld. However, on the sixth day, Mandalorian Canderous Ordo led a feint against one of the Althiri flanks, designed to draw out the Althiri forces, allowing the rest of the Mandalorian task force to attack from the rear. The Althiri were not fooled by his maneuvers, however, and set about repelling the main force. In doing so, however, they split their fleet, leaving the center of their fleet exposed. Ordo exploited this tactical failure, turning his forces to assault the center of the Althiri formation. The ponderous Althiri starships were unable to turn in time, and Ordo decimated their command vessels, defeating an Althiri force ten times the size of his own complement. With their leadership destroyed, the Althiri organization collapsed. The surviving starships scattered, with some attempting to cut across the plane of the rings in order to escape. These Althiri were shredded by the ring's asteroids, while others were slaughtered by Mandalorians. For his part in the battle, Ordo gained command of a sub-sect of his clan. The conquest of Althir III gained the Mandalorians another industrial world for their war machine, and Althiri frigates and corvettes soon supplemented the Mandalorian fleet."}, {"tag": "h3", "text": "Liberation"}, {"tag": "p", "text": "Some time between 3976 and 3960 BBY, the Galactic Republic attacked the Mandalorian forces on Althir in a second Battle of Althir, inflicting massive losses on the Mandalorian army and winning the battle, one of a number of victories for the Republic under the leadership of the Jedi Knights Revan and Malak. Later, when Revan fell to the dark side, Althir became part of his Sith Empire. The Republic defeated the Sith Empire in 3956 BBY, and five years later scattered the Sith Triumvirate that had arisen to replace it. Following these victories, the Republic slowly began reintegrating its lost territory."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "BioWare created the Althiri for Star Wars: Knights of the Old Republic, a video game released in 2003. In the game, the Althiri are only mentioned in dialogue, and the source is unclear as to whether the name refers to a species or is merely a demonyn for the inhabitants of the planet. Daniel Wallace and Kevin J. Anderson referred to the planet Althir in The New Essential Chronology, published in 2005, and it was also included by Wallace and Jason Fry in The Essential Atlas, published in 2009. Later, 2012's The Essential Guide to Warfare referenced the Althiri and named their planet Althir III."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}