{"url": "Harsh", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males", "Category:Moffs of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Harsh"}, {"tag": "p", "text": "Harsh was a Human male who served the Galactic Empire as Moff of the Bosph sector in the Outer Rim Territories during the Galactic Civil War against the Alliance to Restore the Republic. He grew up with the dream of commanding a vessel the size of a Star Destroyer and attended the Imperial Academy as a young man, graduating with the highest honors after being mentored by a senator who taught him politics. Following his graduation, Harsh joined the Imperial Navy and was eventually made captain of the Star Destroyer Cauldron. At the start of the Galactic Civil War, Harsh led stormtroopers to victory in an assault against Rebel forces during a battle on the planet Chabosh but was gravely wounded in the process. Against the advice of a medical droid, Harsh refused a cybernetic replacement limb and instead waited until the wound recovered."}, {"tag": "p", "text": "After his victory and recovery, Harsh came to be considered a legend, and Emperor Palpatine personally promoted him to Moff. Given control of the Bosph sector, Harsh ruled with an iron fist, bombarding the planet Bosph and killing many of its inhabitants on Palpatine's orders. Following the Emperor's death, Harsh, who had taken residence on the planet Otunia, conspired with the Human Seth Kabul to take control of the mining company Kabul Industries. With company head Lorn Kabul, Seth's brother, out of the way, Seth could then partner the company with the Empire. Lorn was successfully killed, but his daughter, Arista Kabul, survived and destroyed the mines used by Kabul Industries, ruining Harsh's plans."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and career"}, {"tag": "p", "text": "The Human male Harsh was born the child of a minor bureaucrat and, as a young boy, came into possession of a toy Star Destroyer, which he played with until the toy was destroyed by a larger bully. In retaliation, Harsh took the stone the bully had used to break the Star Destroyer and turned it on its wielder, smashing the other boy's face. As a young man, Harsh attended the Imperial Academy, where he became friends with a prominent senator who mentored him in the art of politics. Harsh eventually graduated with honors and, with the senator's continued mentoring and patronage, was promoted rapidly through the command structure of the Imperial Navy, reaching the rank of captain and taking command of the Imperial-class Star Destroyer Cauldron."}, {"tag": "p", "text": "At the start of the Galactic Civil War against the revolutionary Alliance to Restore the Republic, Harsh was sent to the planet Chabosh, where he led a fleet in an orbital blockade after the planet's Imperial governor was overthrown by the Rebels. Harsh personally led a company of stormtroopers in the final assault on the Rebels' planetary stronghold, which was defended by powerful deflector shields. During the attack, which was successful, Harsh was severely injured and taken back to the Cauldron, where a 2-1B surgical droid informed him that his leg would have to be replaced by a cybernetic prosthetic. Harsh rejected the idea and held those trying to treat him at bay by threatening other patients with a blaster. Harsh's leg eventually healed on its own, allowing him to walk, and the captain became a legend for his deeds. He quickly earned a number of promotions over many more senior officers, and one year after his victory on Chabosh, Emperor Palpatine personally granted him the title of Moff. Harsh received the promotion in a ceremony in the Imperial Palace on the planet Coruscant, where he was given control of the Bosph sector in the Outer Rim Territories."}, {"tag": "h3", "text": "Imperial Moff"}, {"tag": "p", "text": "While Harsh was Moff of the Bosph sector, Rebel activity was negligible in the area; however, the Emperor became aware of the ela b'Yentarr, a Force-sensitive faction of the Bosph species who were native to the sector. On the Emperor's orders, Harsh immediately blockaded the Bosph homeworld before bombarding it and killing huge numbers of its inhabitants. At some point during or following the year 4 ABY, Harsh lived on the world of Otunia within his sector, and there he survived following the Empire's catastrophic defeat at the Battle of Endor, which saw the death of Palpatine."}, {"tag": "p", "text": "Sometime after the Emperor's death, Lorn Kabul, the head of the Otunia-based mining company Kabul Industries, was unwilling to enter his company into a partnership with the Empire. Displeased with the decision, Harsh made arrangements with Kabul's brother, Seth, to have Lorn killed, after which Harsh would gain easier access to the raw material from the mine in exchange for performing political favors for Seth. Seth would set charges in a mining tunnel, which he would detonate when Lorn and his daughter, Arista Kabul, were visiting for inspection. After significant delays to the plan, Harsh contacted Seth by hologram to demand the scheme move forward, and the event took place the next day. The charges successfully detonated, and Lorn was killed, allowing Seth to take his place as head of the company and create the partnership Harsh wanted. The Moff then traveled to the Kabul Estate in person, along with Imperial forces, to occupy and secure it for Seth."}, {"tag": "p", "text": "Arista Kabul, however, had not been killed in the explosion, of which Seth had become aware and sent men out to correct, without informing Harsh. Arista, along with her Gamorrean companion, Grissom, sneaked into the Kabul Estate shortly after Harsh arrived and visited Seth. Instead of killing Seth, Arista and Grissom had Tek, a Jawa criminal, destroy the Kabul mines, leaving her uncle with nothing, following which they fled the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a boy, Harsh dreamed of commanding vessels similar to the Star Destroyer toy he owned. Even from a young age, however, he was combative and violent, attacking another child with a rock for destroying his property. The senator who mentored Harsh taught him a great deal about politics, especially the importance of winning political battles as well as military ones. When wounded at Chabosh, Harsh deemed having a cybernetic limb as being incomplete and thus refused treatment and threatened other patients to ensure he got his way, willing his leg to heal instead. When made Moff of the Bosph sector, Harsh did not let himself become complacent and ruled his territory with an iron fist."}, {"tag": "p", "text": "During his work with Seth Kabul, Harsh became angry at his co-conspirator when there were numerous delays to the plan, although the amount of wealth the plan would earn Harsh pleased him. He was a wise and charismatic individual. Harsh had pale skin, brown eyes, and was bald when working with Seth Kabul."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Harsh was proficient in the use of blaster pistols, blaster rifles, simple weapons, heavy weapons, and vibroweapons, as well as all types of armor and the piloting of a starship."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Harsh carried a blaster pistol, a datapad, and a comlink with him while on duty. During his time working with Seth Kabul on Otunia, he wore a standard Imperial officer's uniform."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Harsh first appeared in \"Three Against the Galaxy,\" a comic story published in Star Wars Tales 3 on March 29, 2000. The comic was written by Rich Hedden and illustrated by Rick Leonardi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}