{"url": "Harrower-class_dreadnought", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Battlecruiser classes", "Category:Dreadnought classes", "Category:Harrower-class dreadnoughts", "Category:Sith Empire starship classes"], "nodes": [{"tag": "h1", "text": "Harrower-class dreadnought"}, {"tag": "p", "text": "The Harrower-class dreadnought, known more infrequently as the Harrower-class battle cruiser, was a heavily-armed class of wedge-shaped capital ship that was the backbone of the Imperial Navy of the reconstituted Sith Empire during the Great Galactic War, the Cold War, and the Galactic War with the Galactic Republic. Produced by Taerab Starship Manufacturing and measuring around eight hundred meters long with heavily-reinforced hull plating and shield generators, the Harrower-class dreadnought carried a complement of over one hundred starfighters, bombers, and shuttles; a single dreadnought required a crew of 2,400 and could carry 7,300 troops. Harrower-class dreadnoughts required an immense amount of energy and materials to produce, and a single dreadnought was capable of taking on starfighters and smaller warships on its own when it was not coordinating Imperial fleets as a command ship."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A large dreadnaught that was approximately 800 meters in length, 433 meters in width, and 151 meters in height the Harrower-class dreadnought—also known as the Harrower-class battle cruiser—adhered to the wedge-shaped design that had been used for warships of the Sith Empire since the Empire's founding in 4980 BBY. The \"point\" of the Harrower-class's wedge was split down the middle for a quarter to a third of the length of the ship, forming two prongs. Between those two prongs was one of the Harrower-class's hangar bays, with two hangar openings stacked on top of each other and protected by force fields. Two additional hangars were located on either side of the ship, between the ends of the forward prongs and two smaller \"wings\" that protruded from each side closer to the rear of the ship. Two of the ship's shield generators were located on the upper hull of each of those wings, and a final hangar was located on the underbelly of the dreadnought."}, {"tag": "p", "text": "A smaller wedge was located on both the top and bottom of the dreadnought towards the rear, and the vessel's command tower was positioned at the rear of the vessel atop that wedge: wing-like protrusions extended out from atop the upper wedge, and the rectangular command tower was built atop the junction of the \"wings.\" Harrower-class dreadnoughts sported heavily-reinforced hull plating and four shield generators, and the ship featured turbolaser batteries, quad laser cannons, ion cannons, proton torpedos, and concussion missile launchers as its armaments. Most Harrower-class dreadnoughts had three primary thrusters surrounded by four smaller ones located at the rear of the ship."}, {"tag": "p", "text": "Standard Harrower-class dreadnoughts carried a complement of ninety-five starfighters, most of which were the Imperial Navy's standard Mark VI Supremacy-class starfighter, as well as thirty-two B28 Extinction-class bombers and thirty-five shuttles. Harrower-class dreadnoughts required crews of 2,400 and could carry a complement of 7,300 troops. The Harrower-class dreadnought also came with a number of escape pods. As the largest and most heavily-armed vessel in the Imperial Navy, a single Harrower-class dreadnought was capable of holding its own against fleets of starfighters or several smaller warships, but dreadnoughts were typically used as the backbone of the fleet: Harrower-class dreadnoughts normally coordinated fleet attacks while absorbing damage and dealing damage of its own. The Harrower-class was produced by Taerab Starship Manufacturing, and the energy and material cost of building a single dreadnought was roughly equivalent to a decade's output of a major planetary mining colony. After acquiring Makeb resources, Imperial Navy created ships that were using Isotope-5 reactors, making them faster and stronger than most of the other ships. Ships equipped with that technology could be recognized by green glowing."}, {"tag": "h3", "text": "Variants"}, {"tag": "p", "text": "The Harrower-class saw many revisions and refits over the course of its life, with some of these altering the hull to the point where they were not easily recognizable as a Harrower-class."}, {"tag": "p", "text": "Tingel Arm-type: Seen in the Skirmish in the Tingel Arm, this variant lacks the widely-split prow of later Harrowers, with the space between the prongs reduced to little more than a narrow slit and leaving the central hangar bay completely obscured."}, {"tag": "p", "text": "Early-type: a model that saw use during the first years of the Great Galactic War, such as during the Battle of Korriban. The frontal prongs were wider than the Late-type's and were squared off at the ends, and it had a set of four turrets on both the top and bottom sides of the hull's rear wing structures."}, {"tag": "p", "text": "Late-type: this model saw the most use throughout the era of conflict between the Republic and the Sith Empire, and was seen at the First Battle of Bothawui. The frontal prongs were narrower and more pointed than on the Early-type, and the turrets on the Early-type's rear wing structures were moved forward to just above the forward hangar bay, forming two rows of four turrets on both the top and bottom of the ship."}, {"tag": "p", "text": "Valor Prevails-type: this variant had its frontal hangar bays in a diagonal inset, and the frontal prongs were angled slightly inward so their tips almost met. The only known vessel of this type is the Valor Prevails."}, {"tag": "p", "text": "BSX-5 Dreadnaught: Visually similar to the standard Harrower-class, but smaller at 600 meters in length and possessing a reduced armament and complement. The most famous vessel of this type was the Dominator, flagship of Darth Jadus."}, {"tag": "p", "text": "Silencer-type: this variant stripped out the forward hangar bays to mount the Silencer superweapon, a \"fleet killer\" megalaser with the firepower to destroy a capital ship and recharged quickly enough to do so in rapid succession. The first ship of this type was the Doombringer, and more were constructed to the Sith Empire on the orders of Darth Nox."}, {"tag": "p", "text": "Gauntlet-type: nearly identical to the Silencer type in appearance, the main difference was that the superweapon mounted between the prongs was the Gauntlet lightspeed cannon, a weapon capable of destroying ships while they were in hyperspace. The only known example of this ship was destroyed by Havoc Squad."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Harrower-class dreadnought was in production as early as 3712 BBY, when the Sith Lord Darth Ikoral was given an early model Harrower-class dreadnought Red Reaper so that he could conduct his expedition to search for pureblooded Sith outside of the Empire. The Harrower-class dreadnought had become the primary capital ship of the Imperial Navy of the Sith Empire by 3681 BBY, when the Empire instigated the Great Galactic War against the Galactic Republic, though the early design—which was similar to the Red Reaper—would be phased out over the course of the war. Harrower-class dreadnoughts were present at the Republic's first contact with the Empire in the Tingel Arm, and over thirty Harrower-class dreadnoughts made up the bulk of the Imperial fleet that reclaimed the Sith homeworld of Korriban."}, {"tag": "p", "text": "In 3678 BBY, several Harrower-class dreadnoughts were part of the Imperial fleet that defended Korriban from a Republic assault in 3678 BBY. In 3671 BBY, Harrower-class dreadnoughts were among the vessels making up the Imperial fleet that attempted to capture the Mid Rim world of Bothawui—a Republic victory that became known as the First Battle of Bothawui. At least three dreadnoughts were present at the Battle of Alderaan in 3667 BBY and Harrower-class dreadnoughts also saw use during the Rim Campaign of 3661-3660 BBY—at least two dreadnoughts were destroyed at the end of the lengthy Battle of Ord Radama in 3660 BBY. A powerful prototype Harrower-class known as the Voidstar disappeared during the Great Galactic War, though it was later discovered floating as a derelict during the subsequent Cold War. Harrower-class dreadnoughts such as the Scream of Ragnos made up much of the fleet that conducted the Sacking of Coruscant in 3653 BBY, a battle that brought about the Treaty of Coruscant and the end of the war."}, {"tag": "p", "text": "Over a dozen Harrower-class dreadnoughts and Terminus-class destroyers were stationed at Vaiken Spacedock, the primary staging area of the navy, including the White Nova and the Ziost Shadow. Grand Moff Rycus Kilran commanded the Imperial Fifth Fleet from the Harrower-class Emperor's Glory, which attacked the Republic transport Esseles in 3643 BBY in an effort to capture the Republic ambassador Vyn Asara. The Emperor's Glory and the rest of the Fifth Fleet later defended the Maelstrom Prison from Republic attack as the Galactic War began to erupt, but Kilran was killed aboard the prison and the Emperor's Glory was destroyed."}, {"tag": "p", "text": "During the renewed galactic conflict Isotope-5 Harrower Dreadnoughts were used in a great battle over Corellia seeking to destroy Meridian Complex.[source?]"}, {"tag": "p", "text": "Knowledge of the design remained for thousands of years, with the Sith Lord Darth Sidious remarking on its similarity to his own Imperial Star Destroyers after he became Galactic Emperor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Harrower-class dreadnought was introduced by the multimedia project for Star Wars: The Old Republic, a video game released by BioWare in 2011. However, the design was not finalized by the time the tie-in webcomic Star Wars: The Old Republic, Threat of Peace was released in 2009, resulting in an altered appearance for the starships. The Oppressor, a Harrower-class dreadnought that is featured in the Jedi Knight storyline of the game, first appeared in the comic."}, {"tag": "p", "text": "Timeline 1: Treaty of Coruscant, the first in a series of videos detailing the game's backstory, used concept art of the Pellaeon-class Star Destroyer from the Legacy era in place of the Harrower-class, as the design for the Harrower-class had not yet been finalized by the video's release in March 2009. The Harrower-class itself did not actually appear until Timeline 5: The Battle of Bothawui in October 2009, which showed an early design of the ship that featured a less prominent split between the ship's prongs and a wider vessel overall."}, {"tag": "p", "text": "The Hope cinematic trailer, which premiered on June 14, 2010, included a side shot of several Harrower-class dreadnoughts over the planet Alderaan, though the design continued to undergo revisions. The Return cinematic trailer, which premiered in June 2011, featured Harrower-class dreadnoughts which differed from the finalized version that appeared in Star Wars: The Old Republic. The ship is thicker than the finalized version, has a different layout for its dorsal dual turbolaser cannons, has an additional 25 triple turbolaser cannons, possesses two additional hangars in on the inner sides of its two-pronged nose, and also possesses traditional circular engines rather than triangular engine arrays. That rendition was also pictured in the 2012 reference guide The Essential Guide to Warfare, which credited the design to artist Ansel Hsiao. It should also be noted the ship's in-game appearance varies significantly, including varying armaments such as the use of dual versus quadruple turbolasers, and also in-game size variation. Harrower-class dreadnoughts are a frequent sight in The Old Republic, with several of them serving as hubs in the Imperial Fleet for Sith Empire players and others appearing in the game's various space combat missions. Imperial guilds can purchase their own Harrower-class dreadnought as a \"Guild Flagship\" as part of the \"Galactic Strongholds\" digital expansion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}