{"url": "Haruun_Kal/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Arboreal planets", "Category:Confederacy of Independent Systems planets", "Category:Dustig sector planets", "Category:Galactic Republic planets", "Category:Haruun Kal locations", "Category:Low-gravity planets", "Category:Type II atmosphere planets"], "nodes": [{"tag": "h1", "text": "Haruun Kal"}, {"tag": "p", "text": "The planet Haruun Kal (Above the Clouds in Basic, also known as Haruun Kul or Al'Har I), located in the Dustig sector of the Mid Rim on the Gevarno Loop, was the homeworld of the famed Jedi Master Mace Windu. Its capital was Pelek Baw."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The only world in the Al'Har system, Haruun Kal appeared to be an oceanic world from space. However, this \"ocean\" was in fact a sea of toxic gases brought to the surface by volcanic activity, and broken by mountains and plateaus. Only the landmasses that reached into the atmosphere could support life, and thus it was high in these mountains and plateaus where native life evolved."}, {"tag": "p", "text": "Native Humans of the world, known as Korunnai (Uplanders), were all Force-sensitive. There were many theories explaining this remarkable phenomenon. The most popular, held by the Jedi Council, indicated that during the Great Sith War a starship transporting Jedi Knights crashed on the planet, and that the marooned survivors were the ancestors of the Korunnai. This view was supported by the fact that the vibroshields used by Kar Vastor and his Akk Guards were made of ultrachrome, a metal that was used in shipbuilding during the Great Sith Wars."}, {"tag": "p", "text": "The planet had a rotation rate of 25.5 standard hours, and a year length of 383 local days. Its diameter was 10,120 kilometers, and had .98 standard gravity."}, {"tag": "p", "text": "All electronics on the planet had to be rubbed down with portaak amber to prevent the planet's various metal-eating and silicate-eating fungi from destroying them; even with the amber, electronics were somewhat vulnerable."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Great Galactic War"}, {"tag": "p", "text": "During the Great Galactic War, an Imperial Black Ops squadron that included would-be Lieutenant Pierce were dispatched to initiate a massacre on Haruun Kal."}, {"tag": "h3", "text": "Waning days of the Republic"}, {"tag": "p", "text": "Haruun Kal was first colonized by sapients 700 generations prior to the Clone Wars. It was governed, in the years preceding the Clone Wars, by the Representative Council."}, {"tag": "p", "text": "During the reign of the Republic, war between the native Korun tribes and immigrants, whom the natives named Balawai, meaning \"Downfolk\", divided the population of Haruun Kal. These Summertime Wars lasted from 51 BBY until 22 BBY. Mace Windu brought an end to the conflicts when he returned to his homeworld during the Clone Wars, in which the Korunnai were allied with the Republic and the Balawai with the Confederacy of Independent Systems. However, in the process of bringing an end to both the long local conflict and breaking the Separatist hold on the planet, he watched his former Padawan, Depa Billaba, who had been on the planet supposedly leading missions for the Republic, fall to the dark side of the Force. The combatants of the Clone Wars consisted of more than clone troopers without families and battle droids without feeling. On many worlds, the war overlapped local conflicts, fanning flames of deep-rooted aggression even higher. The Confederacy and the Republic both exploited local wars to secure contentious worlds, and bolstered indigenous combatants with supplies and expertise. On Haruun Kal, the Clone Wars made a terrible civil war even worse."}, {"tag": "h3", "text": "Imperial oppression and beyond"}, {"tag": "p", "text": "Shortly after the Galactic Empire was established, an Imperial Navy fleet bombarded Haruun Kal. By 40 ABY, it was unknown if any Korunnai had escaped extermination. However, at least three Korunnai were still active in 5 ABY—specifically Nick Rostu, Kar Vastor, and Lorz Geptun. At some point prior to 40 ABY, Haruun Kal joined the Galactic Alliance."}, {"tag": "h2", "text": "Flora and Fauna"}, {"tag": "p", "text": "The fauna on Haruun Kal included many predators and scavengers. Many of the insects were parasitic. Notable fauna included akk dogs, ankkoxs, branch leopards, fever wasps (cause of Wasp Fever), tuskers, jacunas, vine cats, rot crows, and grassers."}, {"tag": "p", "text": "The flora of Haruun Kal was made up of lush trees and dangerous fungi. Certain fungi that blanketed the planet were corrosive to metal. If unprotected, vehicles, communication equipment, and other advanced technology would be destroyed within days. Other fungi rapidly decomposed dead tissue. Plant life came in every shade of green. Important plants included portaak, brassvine, glass-fern, jinsol, thyssel, and lammas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}