{"url": "Altin_Wuho", "categories": ["Category:Legends articles", "Category:Human replica droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "Altin Wuho"}, {"tag": "p", "text": "A male Human replica droid, Altin Wuho was assigned to a task force led by Captain Dirk Balor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Wuho was created for the sole purpose of detaining a nightmare demon named Reist. Nightmare demons were able to influence the thought of organics, causing their worst nightmares to come true and driving the victim into insanity. They made the perfect weapon, but because organics were unable to control them due to their powers, a droid was needed to control the beast."}, {"tag": "p", "text": "Wuho kept the creature under lock and key. Reist was detained in a force field and hooded with a lead cap. This kept Reist from affecting any of Dirk Balor's crew. Wuho would place the creature in a hollowed out missile tube and then remove his cap. The tube would then be remotely flown to land on a starship. Reist's powers would drive the crew to insanity, and the Imperials would claim their victims without a shot being fired."}, {"tag": "p", "text": "Wuho eventually became incredibly arrogant, realizing the importance of his position. He would talk back to the captain and insult him for being so frightened of Reist. One fateful day, Balor's task force intercepted Luke Skywalker in the Lapez system. Wuho placed Reist in his missile tube and landed him right on the wing of Skywalker's X-wing. The nightmare demon's power immediately began to affect Luke and he crashed his ship on Lapez 3."}, {"tag": "p", "text": "Wuho was proud of his pet's accomplishment, and Balor ordered Wuho to the surface to retrieve Reist and Skywalker's remains. However, when Wuho arrived he was astounded to find Reist dead. In disbelief, Wuho tried to question Skywalker on how he had defeated the beast's power. Skywalker was in no mood to talk and he pulled a blaster on the droid. Wuho's droid reflexes were more than a match for the young Jedi, and he quickly shot the blaster out of Skywalker's hands."}, {"tag": "p", "text": "Skywalker had another trick up his sleeve, and he used the Force to propel his lightsaber straight into Wuho's chest, destroying him. Skywalker retrieved the stabilization unit housed within Wuho's droid body to repair his X-wing, which was damaged in the crash. Skywalker left the destroyed droid's body on the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}