{"url": "Hasbro_Inc.", "categories": ["Category:Real-world articles", "Category:Toy companies"], "nodes": [{"tag": "h1", "text": "Hasbro Inc."}, {"tag": "p", "text": "Hasbro is a toy company that purchased the Kenner company in the early 1990s. It currently holds the master license from Lucasfilm Ltd. to produce all Star Wars–branded toys. Hasbro manufactures action figures and a number of other Star Wars–branded toys and games, including Galactic Heroes, Star Wars Transformers, the Titanium Series, and board games such as Star Wars–themed Monopoly."}, {"tag": "h2", "text": "Basic action figure line"}, {"tag": "p", "text": "Hasbro's most popular offering for the Star Wars brand is its line of 3¾-inch \"basic\" action figures. The 3¾-inch size refers to the height representation of an average adult male human character portrayed, and corresponds to a scale ratio of 1:18. Characters are scaled to the standard, so that smaller characters such as Jedi Master Yoda or an Astromech droid, and taller characters like Darth Vader and Chewbacca, are rendered at appropriate height. As with the original Kenner figures of the 1970s and '80s, Hasbro has had major success with the basic line and has, in nearly two decades of continuous production, released over fifteen different packaging series, four distinct figure generations, and well over two thousand character and character variants from the Star Wars saga in figure form."}, {"tag": "p", "text": "Collections:"}, {"tag": "h2", "text": "Action Collection 12-inch figure line"}, {"tag": "p", "text": "Star Wars action figures in the 12-inch, or \"one sixth\" scale (1:6), were released from 1995 to 2005. A variety of figures were released over the course of this line, including larger beast characters and smaller \"in scale\" characters, like R2-D2 and Yoda. Multipacks were released as retail exclusives. Like the 3¾\"-scale playsets, the 12\" figures were created by a different division within Hasbro from the regular basic (3¾\") line, leading to some disparity between the quality and execution of each line. Whereas the basic figure line kept pace or often set the trends for similar products of that scale, the 12\" figures lagged behind the sculpting, articulation, painting, and fabric advancements made by competing lines of the same scale, even within Hasbro itself."}, {"tag": "p", "text": "As collector interest for the caliber of figure being made by Hasbro waned, the company ceased larger-sized action figure production, and sub-license for a \"sixth scale\" (12\") line of high-end collector action figures was provided to Sideshow Collectibles, whose direct marketing, limited production runs, premium packaging, quality execution and higher price points are in stark contrast to the approach of its predecessor."}, {"tag": "h2", "text": "Other toy lines"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "External links"}]}