{"url": "Hask", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Business owners and executives", "Category:Males", "Category:Neimoidians", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Hask"}, {"tag": "p", "text": "Viceroy Hask was a male Neimoidian who led the Trade Federation in the years prior to the Stark Hyperspace War in 44 BBY. He helped arrange a bacta shortage on the planet Thyferra, with the intention of raising demand and thereby increasing profits. The result was that bacta transports came under attack by pirates of the Stark Commercial Combine, and Hask's involvement was discovered by the Jedi Tholme and Quinlan Vos."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hask was a male Neimoidian who served as Viceroy of the Trade Federation as well as its representative to the planet Thyferra in the years prior to 44 BBY. That year, Hask and other members of the Neimoidian leadership of the Trade Federation formed an alliance with Adol Bel of the Xucphra Corporation, a producer of the medical substance bacta on Thyferra. They planned to manufacture a bacta shortage by sabotaging a processing plant for alazhi, a key ingredient in bacta. The plan lowered the availability of bacta and raised its price, increasing the Trade Federation's profits as planned."}, {"tag": "p", "text": "Hask had also coordinated the shortage with Iaco Stark, whose pirate Stark Commercial Combine attacked bacta-carrying transports. The Jedi Tholme and Quinlan Vos traveled to Thyferra to investigate the shortage, finding it suspicious. There, they overheard a meeting between Hask and Bel, where the latter was enraged that Stark's attacks had disrupted their plans. Hask insisted that the Trade Federation was not to blame, while Bel continued to complain that his company could not move any of their bacta safely, and that the galaxy would turn on them if its denizens discovered the conspiracy. Hask reminded Bel that it was his responsibility to keep their secrets safe, as he had heard that Jedi were investigating. Bel told him not to worry as there were HKB-3 hunter-killer droids on patrol."}, {"tag": "p", "text": "Later, Hask, as well as senator Nute Gunray were intimidated by Jedi Master Mace Windu on Coruscant into mobilizing the Trade Defense Force to save the Republic forces trapped by Stark's Combine on Troiken.  Gunray received credit for the Trade Federation's contributions, which played a role in his ascension to Hask's position of viceroy."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hask was willing to artificially force a bacta shortage in order to increase profits, and the expense of many lives that were lost in the pirate attacks that followed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Hask wore purple clothing, and during his meeting with Bel he sat in a mechno-chair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hask appeared in the thirty-seventh issue of the Star Wars: Republic comic-book series. The issue was written by John Ostrander, published by Dark Horse Comics on February 20, 2002. Hasks' entry in the 2008 The Complete Star Wars Encyclopedia stated that his plans were foiled by Stark's attacks, however, the 2009 reference book The Essential Atlas stated that the Trade Federation Viceroy—confirmed to be Hask in 2012's The Essential Guide to Warfare—had engineered the crisis with Stark."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}