{"url": "Hassk", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Hassk", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Hassk"}, {"tag": "p", "text": "The Hassks were a sentient species that were native to Hasskyn. They were almost completely covered in fur, except for their gray-skinned faces. They had sensitive hearing and keen night vision, all the better for hunting. Hassk were near-feral, and were thought of by most as wild animals. They lived in a primitive culture with limited technology. When they were first confronted with space travel, many left their homes and sought out worlds to wreak havoc, particularly in places of ill repute. A number of Hassks came to join Kragan Gorr's pirate gang. The Hassk triplets were thugs who spent time at Takodana Castle stirring up trouble."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Hassks were a species of subhumanoids native to Hasskyn. Their bodies were almost entirely covered with cream-colored fur. Their faces, however, were hairless, revealing grey or cornflower blue skin. They had sensitive ears, two large forward-facing eyes that could be orange in hue and gave them a keen night vision. Their mouths were filled with flesh-tearing fangs and had powerful jaws that could cause serious damage."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Despite being sentient, the Hassks had a fierce behavior, suggestive of wild animals, and their culture was primitive. Multiple births were known to occur among them, with the siblings being referred to as littermates."}, {"tag": "h2", "text": "Hassks in the galaxy"}, {"tag": "p", "text": "When they were first confronted with advanced technology, the Hassks were not prepared for its impact on morality. Consequently, many of them left Hasskyn to roam the galaxy with their littermates, making trouble in places of ill repute."}, {"tag": "p", "text": "One Hassk was serving as a member of the Gray Gundarks speeder bike gang when they attempted to claim the lost treasure of the Sith Lord Count Dooku on the planet Ponemah Terminal sometime after the Battle of Endor."}, {"tag": "p", "text": "A number of Hassk pirates including Tooms and Snarl served as members of Kragan Gorr's pirate gang during the era of the New Republic."}, {"tag": "p", "text": "Varmik and his two brothers, the Hassk triplets, were know to attend the castle of the pirate Maz Kanata around thirty years after the Battle of Endor. While those thugs often attempted to create mischief in the castle's main hall, other beings kept the peace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hassks first appeared in the junior novel Smuggler's Run: A Han Solo & Chewbacca Adventure, which was written by Greg Rucka and released in 2015."}, {"tag": "p", "text": "Varmik, a Hassk played by Paul Warren, is seen in Takodana Castle in Star Wars: Episode VII The Force Awakens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}