{"url": "Hasty_Departure", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "Hasty Departure"}, {"tag": "p", "text": "\"Hasty Departure\" is the first episode of the animated micro-series Star Wars: Forces of Destiny' second season. It was released on March 19, 2018."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Hera and Sabine liberate an Imperial shuttle, but because Sabine was rushing, they board the wrong ship and it's full of troopers! Chopper flies the correct shuttle and rescues his friends mid-air."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Hera Syndulla and Sabine Wren infiltrate an Imperial base during a mission to steal medkits aboard a Lambda-class shuttle. Hera asks Sabine if she is sure that is the one. Sabine thinks that is the only shuttle here. Hera is not so sure and tells the C1-series astromech droid Chopper to meet them at the rendezvous point. The two sneak aboard the shuttle ramp just as a large crane moves several crates of medkits, revealing a second shuttle parked to the left. Hera and Sabine take off on the first shuttle, leaving Chopper to beep in bemusement on the ramp of the second shuttle."}, {"tag": "p", "text": "Hera sends Sabine to check on the cargo with Chopper. However, Sabine instead finds seven armed stormtroopers inside the passenger compartment. Sabine rushes back to the cockpit and shoots out the controls. Sabine warns Hera they are on the wrong ship just as the stormtroopers begin cutting through the cockpit door. Hera swerves the shuttle to the left and then to the right, throwing the stormtroopers off balance. Hera asks where is Chopper."}, {"tag": "p", "text": "Just then, Chopper appears on the second shuttle and beeps over the com. Sabine tells Chopper to bring the ship close and to lower the rear ramp because they are going to jump over. Sabine shoots at the transparisteel windscreen with her blaster but Hera removes the windscreen with the switch of a button. Chopper aligns the rear exit of his shuttle at front of Hera and Sabine's stolen shuttle. Sabine leaps aboard Chopper's shuttle. As the stormtroopers cut through, Hera shoots out the ship's controls before leaping onto the ramp. Sabine helps her up."}, {"tag": "p", "text": "The stormtroopers enter the cockpit just as their shuttle descends to the ground. Aboard Chopper's shuttle, Hera and Sabine find themselves among crates of medkits. Hera says it was much harder than it needed to be. Sabine apologizes for rushing and not checking whether there was another shuttle. Hera reassures her that they got what they came for. The two rebels join Chopper at the cockpit with Sabine thanking the astromech droid."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}