{"url": "Hate_Leads_to_Lollipops", "categories": ["Category:Real-world articles", "Category:Non-canon Legends articles", "Category:Star Wars Tales 9"], "nodes": [{"tag": "h1", "text": "Hate Leads to Lollipops"}, {"tag": "p", "text": "Hate Leads to Lollipops was a lighthearted story by Dave McCaig in Star Wars Tales 9 about a young Darth Maul. It was collected in Star Wars Tales Volume 3, Star Wars: Darth Maul — Son of Dathomir and Star Wars Legends Epic Collection: Rise of the Sith Vol. 1."}, {"tag": "p", "text": "The art and plot are reminiscent of children's cartoons or Mad magazine's Spy vs. Spy comic strips, and there is minimal dialogue."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "During Maul's early years, he was sent to the Happy Nerf Herder, a maximum security home for wayward boys on Coruscant. While there, he was involved in a breakout and, upon escaping, went on a hunt for a lollipop. After using a cable to get to the nearby Mon Calamari Fish Market, Maul stole a hoverboard from a bystander, accidentally causing an explosion by doing so. He used this hoverboard to get to RIB hutt, where he crashed into an unknown Hutt before stealing a lightsaber from a Jedi who was at the restaurant."}, {"tag": "p", "text": "Maul used this lightsaber to jump off the side of the building and slow his landing by slicing the lightsaber down the building's side. Though the Jedi chased him, Maul eventually landed upon a granite slug which had attached itself to the building and dropped the lightsaber before landing on an airspeeder along with the slug. The airspeeder went along, out of control, before catapulting both Maul and the slug onto a nearby building which contained a lollipop shop. Before Maul was able to get his sought-after lollipop, however, he was taken captive by a Senate Guard, who brought him before Senator Palpatine. Though the Guardsman wanted to take him back to the security home, Palpatine stated that Maul simply needed better guidance and that he would re-educate the boy personally. Maul finally got his lollipop as Palpatine placed one in his mouth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}