{"url": "Haven-class_medical_station", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Haven-class medical stations", "Category:Space station classes", "Category:VenteX Construction Yards products"], "nodes": [{"tag": "h1", "text": "Haven-class medical station"}, {"tag": "p", "text": "The Haven-class medical station, also known as the Republic medical station, was a model of space station manufactured by VenteX Construction Yards used by the Galactic Republic as a space-bound medcenter during the Clone Wars. The Kaliida Shoals Medical Center, located in the Ryndellia system, was a Haven-class medical station, as were the Ord Cestus medical station and Felucia Medical Station HCTFF2. The stations were designed so that from above, they looked like the Republic crest."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Haven-class medical stations were medical space stations manufactured by VenteX Construction Yards built around a long central shaft, which comprised the longest axis of the station. The cylindrical central hub had eight equidistant protrusions, which included docking areas for starships such as Venator-class Star Destroyers and Pelta-class frigates. From above, the station's shape resembled the Republic crest. The stations could carry a maximum of 80,000 patients at any one time."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The stations were intended as medcenters for the treatment of wounded Galactic Republic military personnel during the Clone Wars, particularly clone troopers. The Haven-class had little defenses, and as such were targets for Separatist attacks, so their locations were occasionally kept secret."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "The stations came into use during the galaxy-spanning Clone Wars. During the Battle of Christophsis, after the destruction of their heavy-weapons depot, Jedi Generals Obi-Wan Kenobi and Anakin Skywalker sent Admiral Wullf Yularen and their fleet to resupply from a medical station. However, in the midst of doing so, Yularen was contacted by Jedi Masters Mace Windu and Yoda, who wanted him to immediately escort Padawan Ahsoka Tano, who had been newly assigned to Skywalker without his knowledge, to Christophsis so she could bring him and Kenobi an urgent message from the Jedi High Council. Yularen begrudgingly agreed to do so, although he pointed out that he would be transporting empty ships."}, {"tag": "p", "text": "During the Malevolence campaign, General Grievous was sent in the warship Malevolence after the secret Kaliida Shoals Medical Center by Count Dooku. Skywalker and Tano led Shadow Squadron to defend the station, with the Y-wing bombers managing to take out the Malevolence's giant ion cannon before it could fire upon the station."}, {"tag": "p", "text": "The planet Felucia was a constant battleground between the Republic and Confederacy throughout the Clone Wars, and at one point, the Republic placed Felucia Medical Station HCTFF2 in orbit. However, it was eventually destroyed by the Separatists, with a squadron of vulture droids left to patrol the area. When Skywalker, Kenobi, and Tano arrived in a T-6 shuttle to investigate the station's loss of contact, they were subsequently forced down by the droids, becoming briefly stranded on Felucia."}, {"tag": "p", "text": "After the Second Battle of Geonosis, Tano and fellow Padawan Barriss Offee were sent on the medical frigate TB-73 to retrieve supplies from the medical station near Ord Cestus to be delivered to Republic forces on Dantooine. However, an infestation of Geonosian brain worms complicated the journey, and by the time the frigate dropped out of hyperspace, it was going too fast due to the deaths of the pilots. Two spacetugs managed to slow the ship down before it could collide with the medical station, and Jedi Master Kit Fisto boarded the ship with troops to help the infected. Tano and Offee recovered from their ordeal onboard the station, along with the troopers of Tango Company."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Haven-class stations fell out of use during the reign of the Galactic Empire, but could still be found throughout the galaxy. In 4 BBY during the early rebellion, several members of the Spectres visited an abandoned medical station on the advice of the former clone captain Rex to salvage medical supplies for Phoenix Cell. However, the Inquisitor Second Sister had left probe droids at the station, as well as some other places, to watch for rebel and Jedi activity, and the rebels, who included Padawan Ezra Bridger, got into a skirmish with the Seventh Sister and fellow Inquisitor Fifth Brother before managing to escape with a crate of medical supplies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A Haven-class medical station first appeared in the Clone Wars movie. The class was first canonically identified as such in a Star Wars Rebels promotional Facebook post regarding the episode \"Always Two There Are.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}