{"url": "Havet_Storm", "categories": ["Category:Legends articles", "Category:Alliance Army personnel", "Category:Humans", "Category:Jedi trainees of the New Jedi Order", "Category:Males", "Category:New Republic individuals", "Category:Rebel Force-sensitives"], "nodes": [{"tag": "h1", "text": "Havet Storm"}, {"tag": "p", "text": "Havet Storm was the young Rebel agent who stole the Death Star superlaser plans for the Rebel Alliance. He later joined the Jedi Praxeum on Yavin 4 under the tutelage of Luke Skywalker, where he was killed by the Dark Jedi Desann."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (16 BBY to 1 BBY)"}, {"tag": "p", "text": "Born on an unknown, but well-populated planet on the outer edge of Imperial space, Havet Storm never had a place he could truly call home. His mother, driven by an unknown fear, never dared reside on one planet or system long enough to be found by their shadowy pursuers, successfully sheltering her son from their hidden past and from his hidden heritage until he was approximately fifteen years of age."}, {"tag": "p", "text": "At this time Storm's mother fell ill, her exhaustion and grief finally overtaking her. Searching through his mother's meager possessions, seeking anything that would comfort her, the boy came across a small K-9 series droid, named Arf. Although it was little more than a child's toy, Havet was strangely drawn to it. Picking up the droid he activated an audio recording; the voice was that of a man who identified himself as his grandfather Morvet Storm."}, {"tag": "h3", "text": "Jedi dawn (1 BBY to 0 BBY)"}, {"tag": "p", "text": "The message was a recording of Morvet's last moments of life before he was found and killed by Darth Vader and his agents as part of Emperor Palpatine's Purge of the Jedi following the formation of his Galactic Empire. Knowing he would soon become one with the Force, Morvet explained that he was a Jedi and that this heritage lived on in his grandchild too. The long-dead Jedi had hidden within the droid another gift for the boy—the weapon of a Jedi Knight, an orange-white-bladed lightsaber."}, {"tag": "p", "text": "Havet's mother, on her deathbed, confirmed Morvet's story shortly before dying, telling her son that his father, although untrained and a cripple, had also been killed by the Empire for the potential he carried within him. Afraid and completely alone, Havet packed his lightsaber, Arf, and what few possessions he could carry and left the planet. Eventually, Havet found himself on the planet Korphir, finding work as a mind-reader until his friends grew suspicious and fearful of his strange abilities and forced him to leave the planet. Haunted by this narrow escape and the memory of his grandfather's frantic, spluttered final words—\"Havet… the dark side… the death of all Jedi. Never reveal… never…—Havet swore to abandon his heritage, never to use the Force again."}, {"tag": "p", "text": "Shortly after this Havet bought transport on a junk-flyer to Toprawa, knowing it to be the site of an important Imperial base and reasoning that there could be no better place to hide than right under the Empire's nose."}, {"tag": "p", "text": "Once he arrived on the planet Havet fell into his usual routines: eating, getting a job and finding a place to lay low. But Storm's hopes of a safe, quiet life on Toprawa were cut short when he mistakenly insulted the bounty hunter Boba Fett at Al the Alchemist's cantina. Refusing to back down from what he saw as nothing more than a common bully, Havet seemed to have bitten off more than he could chew. Luckily their confrontation was cut short when a battle broke out in the sky above the city, Rebel ships attacking an Imperial convoy in orbit around the planet."}, {"tag": "p", "text": "Not long after arriving on Toprawa, Havet became acquainted with the beautiful Facet Anamor, Executive Personnel Officer at the Imperial Research Station. It was then that Havet was approached by the Toprawan branch of the Rebel Alliance. Their leader Vermilion explained that the plans to the superlaser for the Empire's horrifying new superweapon the Death Star were being held within the Imperial base."}, {"tag": "p", "text": "Havet agreed to help the Rebels, using his relationship with Facet to gain access to the base and steal the plans. Once they were in Rebel hands, Vermilion attempted to broadcast the superlaser plans to Princess Leia on board Tantive IV, a Rebel ship that was orbiting the planet, but was fatally wounded in an ambush by Facet and a unit of stormtroopers. In the ensuing confusion Havet struck down Facet and, while fellow rebel Surna comforted Vermilion in his final moments, Havet broadcasted the superlaser plans to the Rebel Alliance."}, {"tag": "p", "text": "Their mission a success, the Rebels evacuated their troops from the Imperial base and detonated a series of strategically placed explosive charges, destroying the base and all record of the transmission, effectively covering their tracks. However, Havet was sure that through the dust and debris he had seen the wounded Facet Anamor fleeing the devastation."}, {"tag": "h3", "text": "The bounty hunter (0 BBY to 2 ABY)"}, {"tag": "p", "text": "After the attack on the Imperial base Havet Storm became a staunch supporter of the Rebel Alliance, spending the next two years carrying out various missions on the planet Toprawa and eventually taking command of his own unit. But despite the Toprawan Rebels' best efforts, the Empire continued to whittle away at their numbers. Then one fateful day Imperial troops discovered the location of the Rebels' base and launched their final attack. Havet and Surna, now close friends, managed to survive the attack and escape to safety."}, {"tag": "p", "text": "This was the least of Havet's troubles, however, as he continued to attract the attention of the bounty hunter Boba Fett, who still held a grudge against Havet for humiliating him two years earlier."}, {"tag": "p", "text": "With the Toprawan branch of the Rebel Alliance decimated, Havet felt nothing would be accomplished by staying on Toprawa any longer. Hoping to find a way to continue helping the Rebellion, as well as escape the ever-present specter of Boba Fett, Havet, Surna and a few others began making plans to leave the system. Fortunately, Surna's brother Tann was a skilled pilot and owned his own ship, The Rust Bucket. Unfortunately, following the rebel attack on the Imperial Research station, the Empire had continued to blockade the planet. Unable to work, Tann had been unable to maintain payments on The Rust Bucket and it had been impounded by agents of Jabba the Hutt who had funded the purchase of the ship."}, {"tag": "p", "text": "Havet managed to win enough credits to pay off the Hutt crime lord's enforcers after using his fledgling Force abilities to expose a cheat in a high-stakes game of Seven card comet. But access to the ship was only the first step to escaping Toprawa; the small group of rebels still had to make their way through the Imperial blockade."}, {"tag": "p", "text": "While Tann and the few remaining rebels prepped The Rust Bucket for takeoff, Havet made his way to the Communication tower to \"convince\" the Comms officer to give the ship clearance. With time running out Havet realized the only way to ensure the ship would safely beat the blockade was for him to remain in the comms tower until it entered hyperspace. With much protestation from Surna, Havet ordered the rebels to take off without him. Fearing they might never see each other again, Surna confessed her undying love for Havet."}, {"tag": "h3", "text": "Life and death at the academy (11 ABY to 12 ABY)"}, {"tag": "p", "text": "Following the Rebel Alliance's victory over the Empire and the establishment of the New Republic, Havet Storm began his formal training at Luke Skywalker's Jedi Praxeum on Yavin 4."}, {"tag": "p", "text": "Here, Havet's indomitable spirit and refusal to bow down to a common bully once again landed him in a fight he could not win. When accosted by fellow student Desann, Havet stood firm in defense of himself and was struck down by the Chistori student. Refusing to be dominated by fear as so much of his early life had been, Havet Storm died as he had lived: a hero in defense of justice and freedom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lost Jedi Adventure Game Book was released only in Great Britain. As such, Havet Storm is a relatively unknown character within the Star Wars fan base."}, {"tag": "p", "text": "The Lost Jedi Adventure Game Book revealed that Havet Storm was the \"Rebel Voice\" broadcasting the Toprawa Death Star plans to Princess Leia in Episode Three of the Star Wars Episode IV: A New Hope radio drama."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}