{"url": "Havoc_(ARC_trooper)/Legends", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Advanced Recon Commandos", "Category:Clone trooper commanders"], "nodes": [{"tag": "h1", "text": "Havoc  (ARC trooper)"}, {"tag": "p", "text": "\"Havoc\" was the nickname of an ARC clone commander who served in the Grand Army of the Republic during the Clone Wars. Bred on the Wild Space world of Kamino far above the galactic plane, he received constant military training with his brothers. Circa 22 BBY, during the Clone Wars he participated in a battle fought on his homeworld, which cost him his life."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Havoc was bred on Kamino for the Grand Army of the Republic and was one of the millions of clones of Jango Fett, a Mandalorian bounty hunter. He and his brothers received constant military training in the years that followed his conception."}, {"tag": "p", "text": "He was seen with Advanced Recon Commando Commander Colt and Blitz observing the Domino Squad when they were training in the clone military education complex on Kamino."}, {"tag": "p", "text": "He was with a squad of clone troopers when two trident drills appeared and dispatched aqua droids commanded by Grievous, who ordered the machines to kill all the clones. The troopers immediately engaged Grievous's forces. While helping a wounded clone Havoc spotted 99 giving troopers extra DC-15 rifles, and he immediately ordered 99 out of the danger. But while distracted, Havoc was shot in the shoulder and, when 99 tried to help him, received a hit to the head moments later killing him instantly. 99 then grabbed Havoc's standard clone backpack that was full of grenades, and quickly hurried off to find Echo and Fives."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Havoc had blue markings on his experimental Phase II clone trooper armor with a rangefinder on the right side of his helmet. He wore a unique shoulder pauldron and had four blue squares that covered his chest and abdomen. He, Colt, and Blitz all wore the same specialized pauldron. Finally, he wore a kama with blue stripes. In combat, he wielded a DC-15A blaster rifle. During the Battle of Kamino, he used a standard Republic backpack, which 99 used later."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}