{"url": "Altor-class_replenishment_ship", "categories": ["Category:Legends articles", "Category:Fuel tanker classes", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Altor-class replenishment ship"}, {"tag": "p", "text": "The Altor-class replenishment ship was an Imperial support ship class that carried fuel for other vessels in the Imperial Navy."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "The Altor-class was a large Imperial supply ship model and carried six pill-shaped fuel containers. In addition, it also contained at least four arm nozzles to refuel capital ships. The Altor was capable of refuelling two battlecruiser- and dreadnought-scale ships at the same time, one on each side."}, {"tag": "p", "text": "At the stern of the vessel were located several hangar/drydock complexes that could fit frigate-scale capital ships for deep space repairs."}, {"tag": "h3", "text": "Propulsion systems"}, {"tag": "p", "text": "The ship was moved by a cluster of seven large thrusters, each circled by a cluster of eight auxiliary thrusters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The class consisted of at least three ships. The vessels were capable of refueling various Imperial warships, including Allegiance-class battlecruisers and Assertor-class dreadnoughts. An Altor-class vessel partook in a fleet exercise at some point after the Arms Race campaign, where it simultanously refueled a Star Dreadnought and a battlecruiser of this kind. Altors were known to be serviced at Naval Station Validusia in the Validusia system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This design originated as a fanon vessel made by Ansel Hsiao, his original intention was to create a ship that was capable of replenishing a single ship comparable in size to an Executor-class Star Dreadnought, or an entire squadron of smaller ships. When approached by Lucas Licensing to provide artwork for The Essential Guide to Warfare, Hsiao submitted his own designs in addition to new models, along with their names. The names were recorded in LFL's Holocron continuity database, according to the artist."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}