{"url": "Havoc_Marauder", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Galactic Republic starships", "Category:Gunships"], "nodes": [{"tag": "h1", "text": "Havoc Marauder"}, {"tag": "p", "text": "The Havoc Marauder was an Omicron-class attack shuttle that served as the personal starship of Clone Force 99, also known as the \"Bad Batch.\" The craft was unique compared to other Grand Army of the Republic starships, so it was used for the Bad Batch's covert and undercover missions throughout the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Havoc Marauder was utilized by Clone Force 99 during the Clone Wars. After the execution of Order 66 and the end of the war, the \"Bad Batch\" returned to the clone homeworld Kamino. However, the group fled from the Galactic Empire's new reign aboard the Havoc Marauder, losing their companion CT-9904 \"Crosshair,\" who joined the Empire after having his behavioral modification biochip's effects enhanced, and gaining one in Omega, a young, enhanced clone who had previously spent her days as a medical assistant to the Kaminoan Nala Se."}, {"tag": "p", "text": "After traveling to Saleucami to meet with Cut Lawquane, Tech and Echo decided to get the ship intentionally impounded by Imperial forces as part of their plan to help Cut and his family escape the planet. The ship would suffer damage in their escape, which caused them to drop out of hyperspace and make repairs on the Ordo Moon. As repairs were made on the exterior of the ship, Wrecker took the opportunity to work on the inside, fashioning the Bad Batch's newest companion, Omega, a room of her own by reconfiguring the ship's gunner's nest."}, {"tag": "p", "text": "As the group worked on their next move, Echo informed them that he had overheard comm chatter placing the ship on the wanted list. They made for the moon Pantora to refuel, resupply, and scramble the ship's signature, but the ship was recognized by the Sullustan Raspar Six, who informed the bounty hunter Fennec Shand of their presence. After a chase, Hunter and Omega escaped the bounty hunter and the group quickly departed Pantora."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Havoc Marauder first appeared in the unreleased, development version of the Star Wars: The Clone Wars episode \"The Bad Batch,\" and later appeared in the unfinished versions of subsequent episodes. The ship appeared again in the finished releases of the arc, streaming on Disney+ starting February 21, 2020."}, {"tag": "p", "text": "In the unfinished version of \"A Distant Echo,\" the vessel had nose art depicting Naboo senator Padmé Amidala in a provocative fashion with the subtitle \"Good to be Bad.\" However, in the finished version of the episode (and by extension, its other completed appearances), the nose art is no longer present."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}