{"url": "Havoc_Squad", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Eternal Alliance", "Category:Members of Havoc Squad", "Category:Republic Special Forces units"], "nodes": [{"tag": "h1", "text": "Havoc Squad"}, {"tag": "p", "text": "The Havoc Squad, also known as Havoc Squadron, was an elite Republic Special Forces squad of troopers in the army of the Galactic Republic, who fought against the Sith Empire during the Great Galactic War. Originally known as infantry squad 326, Havoc Squad soon gained its name under the leadership of its commander Jace Malcom, and it was later led by Malcom's executive officer Jek Kardan, Kardan's protege Harron Tavus, and Meteor. Havoc Squad saw action on many fronts throughout the war, from Ord Mantell to the Battle of Alderaan, and even after the Treaty of Coruscant was signed, the commandos of Havoc Squad continued to combat Sith threats during the resulting Cold War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Havoc Squad's creation was part of the larger introduction of Galactic Republic special forces commandos following the departure of the Jedi from Coruscant for the planet Tython. The squad saw action in many Cold War hot spots, including the civil war on Ord Mantell and the Battle of Alderaan. Led by the brave commander Malcom, Havoc Squad helped reclaim Alderaan from the forces of the Sith Empire under the leadership of the Sith Lord, Darth Malgus. During the battle on Alderaan, Havoc Squad fought and killed numerous Imperial troopers, assault droids and Sith alike, though the squad was considerably outnumbered. During the battle, Satele Shan arrived to aid Havoc Squad in combating Darth Malgus' Sith forces, slaying a number of Sith Warriors before defeating Malgus in single combat, effectively allowing the Republic to emerge victorious from the guerrilla conflict."}, {"tag": "h3", "text": "Defection"}, {"tag": "p", "text": "Eventually, the squad fell under the command of Harron Tavus who led them during numerous engagements. This saw them face numerous skirmishes against the elite Shadow Fist unit of the Imperial Military."}, {"tag": "p", "text": "A noted incident emerged when the squad was sent by General Garza to Ando Prime to cut off an Imperial offensive. The squad encountered more enemy soldiers than expected and were forced to call for extraction. But before Garza could get a rescue operation going, the Republic Senate shut it down. Garza had sent the squad to Ando Prime without the Senate's consent or knowledge, and the senators would not allow her to risk re-igniting war with the Empire. To prevent violating the Treaty of Coruscant, the Senate did not acknowledge the squad's mission as sanctioned. The squad was left stranded in enemy territory, though they managed to return to the Republic through a stolen shuttle. However, the incident left a dark scar on the team with many of its members believing that they were betrayed by the Republic. Thus, they planned to defect to the Empire and were stationed on Ord Mantell when they were making their final preparations."}, {"tag": "p", "text": "During Havoc Squads tenure on Ord Mantell, they were tasked with locating and recovering a stolen ZR-57 Orbital Strike Bomb. Considering that Havoc squad was undermanned for the mission, high command decided to add a new recruit to the team, the first in a while. This individual, a sergeant, was unaware of Tavus's intentions to defect. After locating the bomb in a Mantellian Separatist stronghold, Havoc Squad attempted to retrieve the bomb without the new recruit. Due to a suspected communication lapse, the new recruit was sent in to extract the squad. The new recruit discovered Imperial troops organizing the defection. The recruit confronted Commander Tavus, who offered for the recruit to join them in defecting. After the recruit refused, the traitorous Havoc Squad members departed with the stolen ZR-57 Orbital Strike Bomb."}, {"tag": "p", "text": "Afterwards, the recruit was made the new head of Havoc Squad and given the task of recruiting new members into the squad, being given a lead by recruiting Aric Jorgan, who was recently demoted to Sergeant, as Havoc's first squadmate."}, {"tag": "h3", "text": "The new Havoc Squad"}, {"tag": "p", "text": "In the Cold War, the team was tasked with combating the Imperial threat and hunting down the renegade former members of the squad. At this time, the Special Forces unit was directed by General Elin Garza during their operations. In their travels, Havoc recruited defected Imperial Sergeant Elara Dorne and assault droid M1-4X into the squad, eventually tracking down all the traitors. Garza then promoted Havoc's CO to the rank of captain."}, {"tag": "p", "text": "Havoc was soon called upon to extract a Strategic Information Service agent on Tatooine, who had vital information on an Imperial superweapon codename Gauntlet, a powerful hyperspace cannon. While coordinating a joint military offensive, Garza required Havoc to be up to full strength with the needed specialists to destroy the Gauntlet. To that end, she dispatched Havoc Squad to recruit explosives expert Tanno Vik on Balmorra and technician Sergeant Yuun on Hoth, as well as extract the Safecrackers squad on Quesh. Participating in the assault, Havoc boarded and sabotaged the Gauntlet, completely vaporizing the superweapon. Upon returning to Coruscant, Garza commended Havoc's actions and promoted each member."}, {"tag": "p", "text": "Unfortunately, their victory was not without consequences. Imperial General Rakton declared war against the Republic and captured the heads of state of many Republic-aligned worlds to allow Imperial forces to bypass their borders. Havoc stormed the station where the hostages were being held and freed them, earning Rakton's ire."}, {"tag": "p", "text": "Garza soon dispatched Havoc to allocate forces from Belsavis, Voss and station A-77 to turn the tide of the war. Unfortunately, a paid Imperial agent, Senator Grom Zian, under Rakton's orders, launched a sham inquiry into Havoc's activities to get the squad suspended. Luckily, the SIS had gathered evidence proving Zian's Imperial ties, allowing Havoc to return to the frontline. The squad soon faced off against Rakton on Corellia and defeated him. Havoc was then personally commended by Supreme Chancellor Saresh."}, {"tag": "h3", "text": "Disbandment"}, {"tag": "p", "text": "During the Eternal Empire's conquest, Havoc Squad's commander disappeared, causing the squad to go their separate ways; Tanno Vik led his own gang on the shadowport of Asylum; Yuun traveled to Zakuul to try and understand the technology of the Eternal Empire in the hopes he could also find the Major; M1-4X was reassigned to the Press Corps in recognition of his Morale Initiative; Dorne was removed from Havoc by Saresh; and Jorgan, the last remaining member, was promoted to Major and given command of a new Havoc Squad. His unit consisted of himself, Dengril, Abbeth, Kanner, Xaban, and Torg."}, {"tag": "p", "text": "Havoc Squad later went rogue in defiance of Saresh's draconian policies and traveled to Zakuul after being provided schematics of the Spire by the Alliance. Soon after allying with the Alliance, Havoc took in a group of Zakuulan refugees before participating in an assault on a Zakuulan outpost to plant a wiretap in their communications."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Havoc Squad's soldiers made use of Republic trooper battle armor, with red or orange colored markings adorning the plates. In addition, bandoliers and pauldrons were available accessories for wear with their armor. The squad made use of a number of heavy weapons including assault rifles, hand-held missile launchers, portable blaster cannons similar in appearance to the much later Clone Wars-era Z-6 rotary cannon, and thermal detonators, along with sidearm blaster pistols and combat knives including grenade launchers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}