{"url": "Hawk/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles that are known by a nickname", "Category:Clone trooper lieutenants", "Category:Clone trooper pilots"], "nodes": [{"tag": "h1", "text": "Hawk"}, {"tag": "p", "text": "\"Hawk\" was the call sign of a clone trooper lieutenant and pilot who served in the Republic Navy during the Clone Wars. An expert pilot, Hawk was named for his highly precise hawk-like eyes. He saw action, particularly with the Grand Army of the Republic's 501st Legion, on many worlds during the war, including Christophsis. During a battle there in 22 BBY, he rescued a clone trooper strike team led by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker after a thwarted Republic attempt to ambush Confederate battle droids. During a following operation to rescue Rotta the Huttlet, the son of crime lord Jabba Desilijic Tiure, Hawk ferried Skywalker and his Padawan, Ahsoka Tano, along with Clone Captain CT-7567 and a squad from the 501st Legion's Torrent Company, to the surface of Teth aboard an LAAT/i gunship. After landing on Teth, Skywalker's forces began an assault to reach the B'omarr Monastery where Rotta was being held. Both campaigns resulted in victories for the Republic."}, {"tag": "p", "text": "When the Republic launched an invasion in 21 BBY to retake Umbara from the Confederacy, Hawk was among the troops dispatched as part of the Grand Army's landing force. At the outset of the battle, Hawk served with the 501st Legion, transporting Skywalker, CT-7567, and their men to the planet's surface via gunship despite thick ground fire from the Umbaran militia. On a later assignment around 20 BBY, he covertly inserted Skywalker, CT-7567, Tano, and Kenobi onto Onderon aboard a Nu-class attack shuttle so that the four officers could train a group of rebel soldiers to retake their world from the Confederacy. Hawk flew a clone Z-95 starfighter during Skywalker's invasion of Scipio, helping to clear out the Separatist ground forces stationed outside the Main Vault of the InterGalactic Banking Clan. Yet, a Vulture droid that Hawk shot down during the battle inadvertently led to the death of Rush Clovis, the leader of the Banking Clan, when the droid starfighter crashed into his office."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Christophsis and Teth"}, {"tag": "p", "text": "The Human male clone with the call sign \"Hawk\" was decanted from the Mandalorian bounty hunter Jango Fett and developed as a clone trooper on the planet Kamino for service to the Galactic Republic. Named for his hawk-like eyes, Hawk was trained in combat, military tactics, and piloting, and he became well-noted for his skill with the latter. He served as a lieutenant in the Republic Navy and participated in many campaigns during the Clone Wars on an array of worlds, often serving with Jedi General Anakin Skywalker and Clone Captain CT-7567, nicknamed \"Rex,\" of the Grand Army of the Republic's 501st Legion. In 22 BBY, seven weeks into the war, Hawk was dispatched with a contingent of clone troopers to liberate the planet Christophsis from the Confederacy of Independent Systems. The Republic troops, led by Skywalker and High Jedi General Obi-Wan Kenobi, planned to attack the Confederate battle droids from a business complex with towers situated to the north and south of the droids' route. However, the Separatist army ambushed Kenobi's forces in the south tower, and Skywalker responded from his position in the north tower by requesting Hawk and his LAAT/i gunship for an evacuation from the south tower."}, {"tag": "p", "text": "While Hawk headed for the south tower, Skywalker, Captain Rex, and their men proceeded there to reinforce Kenobi. After regrouping, Skywalker and Kenobi made their way to the tower's roof, and Hawk's gunship touched down near the edge of the roof just as B1-Series battle droids caught up with the beleaguered Jedi and clones. The Republic troops piled onto Hawk's gunship, taking the pilfered cranial unit of the Confederate T-series tactical droid TJ-55 with them so as to uncover more information about the foiled ambush. Hawk returned the weary troops to the Republic base, where debriefing began on the failed assault. Following several days of fighting, Skywalker and Kenobi defeated the Separatist forces on Christophsis and freed the world from droid occupation. Immediately after their victory, Skywalker was dispatched with his recently assigned Padawan, Ahsoka Tano, to the planet Teth, where they were to retrieve Rotta the Huttlet, the son of crime lord Jabba Desilijic Tiure, to win Jabba's favor so that the Grand Army could be granted safe passage through Hutt-controlled space."}, {"tag": "p", "text": "Skywalker was given only one planetary rotation to return Rotta to his father on the planet Tatooine. Furthermore, Rotta was being held at an abandoned monastery on Teth, a clifftop stronghold guarded by two battalions of battle droids. Because the Republic battle group was unable to directly land there, Skywalker instead elected to deploy his troops in the jungle below the cliff and commence a vertical assault up the ridge. Hawk was among the pilots chosen for the gunship deployment, and he recognized the dangerous lack of cover at the drop-off and extraction sites. Launching from Skywalker's Acclamator-class assault ship alongside the other pilots, Hawk, piloting the battle group's lead gunship, ferried Skywalker, Tano, Rex, and a squad of the 501st Legion's Torrent Company to the jungle of Teth. En route to the landing site, Hawk received orders from Skywalker to pull out of the drop zone once they had been deployed, as Skywalker wanted him to be standing by for an extraction from the monastery. Once DSD1 dwarf spider droids opened fire on the gunship from their position at the monastery, Hawk closed the craft's blast shields and maintained his course to the jungle landing site. After the lieutenant managed to land them in the dense jungle, Skywalker, Rex, and Tano led Torrent Company in the half-mile climb to the monastery. Despite heavy casualties, Skywalker and Tano were able to rescue Rotta and return him to his father."}, {"tag": "h3", "text": "Separatist battlefronts"}, {"tag": "p", "text": "Late in 21 BBY, the war's second year, Hawk was dispatched as part of a Republic task force sent to invade and retake the planet Umbara, which had recently seceded from the Republic to join the Confederacy of Independent Systems. Hawk initially served aboard an Acclamator-class assault ship commanded by Skywalker and Kenobi, which was the first cruiser of the Republic fleet to break through the Separatists' blockade of Umbara thanks to starfighter support from Jedi Commanders Tano and Barriss Offee. Once the assault ship had moved into position over Umbara to deploy Skywalker's and Kenobi's forces—alongside clone battalions led by Jedi Generals Saesee Tiin and Pong Krell—Hawk and a number of other clone pilots were tasked with transporting the Republic forces to the shadowy world's surface aboard space gunships. Hawk's passengers included Skywalker, Captain Rex, Advanced Recon Commando Fives, and troops from the 501st Legion, including Hardcase, Jesse, Tup, and Dogma."}, {"tag": "p", "text": "With clone Z-95 starfighters flying as starfighter support against attacking Umbaran starfighters, Hawk and the other gunship pilots steered their craft toward the predetermined landing site on Umbara's surface. The gunships' deployment was met with much enemy ground fire from the Umbaran militia, and Hawk was forced to maneuver his gunship through the heavy flak. Even with night vision sensors, Hawk had a tough time trying to navigate through the dark atmosphere, and he expressed his concern to Skywalker about the possibility of overshooting the landing zone. While other gunships landed early to launch All Terrain Recon Transports against the advancing Umbaran Soldiers and hover tanks, Hawk continued on to the landing point and reached it intact. There, he deployed Skywalker, Rex, and their men to join the concentrated Republic effort to secure Umbara."}, {"tag": "p", "text": "Hawk was dispatched around 20 BBY, the final year of the war, to transport Skywalker, Tano, Rex, and Obi-Wan Kenobi to the planet Onderon. There, the four officers were to train a group of rebel soldiers to retake Onderon from Separatist control. Flying the Nu-class attack shuttle Valkyrie 2929, Hawk inserted the four officers into the Onderon jungle by night, hovering over the drop point so that they could disembark, and then quickly pulled out to avoid being detected by the Separatists. Skywalker, Rex, Tano, and Kenobi found the rebel soldier Steela Gerrera, who took them to the resistance's secret base so that they could train the insurgents to liberate their world."}, {"tag": "p", "text": "Hawk later joined Skywalker's fleet when the 501st was dispatched to retake Scipio, the headquarters of the InterGalactic Banking Clan, which had recently fallen to the Confederacy. After Skywalker's three-cruiser armada arrived in the Scipio system, Hawk and a number of other pilots flew clone Z-95 starfighters into combat against the Separatist flotilla's Vulture droid starfighters. With Hawk and his comrades providing escort, Skywalker and Captain Rex made for the surface aboard a squadron of LAAT/i gunships to rescue Senator Padmé Amidala, who had been trapped on-world since the Separatists invaded. En route to the surface, Hawk reassured Skywalker that he and his fellow pilots would provide further air support for the ground assault. Once Hawk and his comrades had reached the planetary atmosphere, the Confederate fleet retreated from Scipio, abandoning the droid forces stationed outside the Main Vault of the Banking Clan. Hawk and the other pilots turned their laser cannons on the Vulture droids and Hyena-class bombers that launched into combat against them, working together to pick off the enemy fighters."}, {"tag": "p", "text": "When Hawk noticed that another clone trooper pilot was being chased by a Vulture droid, he came to his comrade's rescue and gunned down the pursuant Vulture droid. Yet, the enemy fighter veered into the central spire of the Main Vault, where the office of Rush Clovis, the leader of the Banking Clan, was situated. After the Vulture droid crashed into the central spire, Clovis's office toppled, nearly plunging its current occupants—Clovis, Amidala, and Skywalker—off the side of the structure. Clovis sacrificed himself so that Skywalker could save Amidala. Despite Clovis's death, Hawk and his comrades emerged victorious on Scipio, helping to secure the banks and ending the crisis."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Human male clone, Hawk stood 1.83 meters tall and was versed in Galactic Basic Standard. An expert pilot, his abilities impressed the likes of Jedi General Anakin Skywalker and Clone Captain Rex. He was thorough in his duties, and during the Battle of Teth, he kept Skywalker updated with comprehensive reports en route to Teth's surface. His experience in the war caused him to see the danger posed in his troop landings on Teth, as both the drop-off and extraction sites lacked proper cover from the Separatist droid forces entrenched there. He had eyes like a hawk bird, which earned him his nickname. Hawk received combat training and had a knowledge of military tactics. He was capable in piloting LAAT/i gunships and flew a variant of the infantry gunship model, the space gunship, at Umbara. He was also able to fly the Nu-class attack shuttle and the nimble clone Z-95 starfighter."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the Battle of Christophsis, Hawk wore Phase I clone trooper armor, and his scarred helmet was customized with blue markings and two red hawk \"bird of prey\" insignia. However, the clone trooper pilot armor he later wore at the Battle of Teth was standard issue, with yellow markings and the normal Galactic Republic insignia displayed on his helmet. After upgrading to Phase II clone trooper armor prior to the Battle of Umbara, Hawk adopted new equipment that was based on the armor suit that he had previously utilized at Christophsis; his new Phase II helmet featured variations of his Phase I blue markings and red hawk insignia. All of his armor suits were equipped with sensors that measured his vital signs. He wielded a DC-15 blaster pistol in combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Hawk was created for the August 2008 Star Wars: The Clone Wars film, which served as an introduction to the television series of the same name. Hawk first appeared in the film's novelization, written by Karen Traviss, and was later featured in \"The Hidden Enemy,\" an episode in the television series' first season that was released in February 2009 as a prequel to the 2008 film. He received references in various source material following these appearances. In October 2011, more than three years after his original creation, Hawk returned to the television series for a brief appearance in \"Darkness on Umbara,\" which was released as part of the series' fourth season. Although he was not directly referred to by name in the episode, his appearance was confirmed by the episode's corresponding online guide on StarWars.com. He was later featured in the fifth season episode \"A War on Two Fronts\" in October 2012, as well as in \"Crisis at the Heart,\" an episode that was released in March 2014 with the series' sixth and final season."}, {"tag": "p", "text": "As part of the Battle of Teth sequence in The Clone Wars film, Anakin Skywalker calls in a gunship for an evacuation from the Teth monastery, but the gunship is shot down by a Vulture droid starfighter, killing the pilot and all troops on board. That scene initially appeared in the film's novelization and junior novelization, though neither books identified the pilot of the gunship by name. Hawk was originally intended to be the pilot of the gunship in the film, but the scene was removed from the film's final version, thus maintaining that Hawk did not die at Teth. To date, Hawk's \"death\" has not been verified as canonical, and the non-canon status of his appearance in the scene was solidified with his being featured in the chronologically later episode \"Darkness on Umbara.\" Nevertheless, the cut scene itself—without Hawk as the named pilot—retained its canon status thanks to its canonization in the film's novelizations."}, {"tag": "p", "text": "Hawk's card in Star Wars PocketModel TCG: Clone Wars Tactics depicted him in normal, white Phase I clone trooper armor at Teth instead of his standard-issue yellow-marked pilot armor, as seen in the film. A September 2010 video published on the official Star Wars website showed Series Director Dave Filoni describing Hawk as a clone trooper commander, but this rank has yet to be confirmed by an official source. Until such a confirmation, it is assumed to be an error. Additionally, a clone pilot who lacked Hawk's distinctive armor but whose role corresponded to that of Hawk in \"The Hidden Enemy\" appeared in the non-canonical video game LEGO Star Wars III: The Clone Wars, which was released in March 2011. In the game, the pilot does not initially hear Skywalker's request for an evacuation because he is listening to music."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}