{"url": "Hawker_Bryce-Kelley", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Hawker Bryce-Kelley"}, {"tag": "p", "text": "Hawker Bryce-Kelley was a male Human smuggler who was the owner of both the medium freighter Royal Mistress and the bulk freighter Queen's Victory along with his co-pilot Rypka during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hawker Bryce-Kelley and his Twi'lek co-pilot Rypka wandered Outer Rim as smugglers. The duo once met with a group of wannabe Rebels in the Mos Eisley Cantina and arranged to race their ship, the Limping Lady, with the Queen's Victory to whichever system they chose. He waited in orbit above Tatooine for them and they proceeded to race to the planet Zoma V in the Zoma system. After the race, he invited the group on board his ship for drinks and to transfer the credits."}, {"tag": "p", "text": "Sometime after this, Bryce-Kelly was being pursued by Imperial Customs Frigate 517 and came to the Reginard system, following a Stellar-class starport beacon which had in fact been planted in the Rebel passive sensor array by Imperial spy Tanya Madera. He soon met with a group of Rebels on the planet who were investigating why his ship had landed so close to their sensor array. He explained to them what had happened, and that he was angry that there wasn't a starport nearby. When the group asked him where this starport was meant to be, he pointed towards the hill which the sensor array was located upon."}, {"tag": "p", "text": "When the group went to investigate, they were attacked by Madera who no longer posed as a spy. Bryce-Kelly and Rypka joined in the fight, quickly killing Madera. The trouble was not over, however, as the Imperial Customs Frigate which had been chasing them soon arrived in the system also. The group of Rebels managed to convince the crew of the ship that Bryce-Kelly was not on the planet, and so they soon left, leaving Bryce-Kelly with the Rebels."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Bryce-Kelley had a cheery personality, but was very much a rogue; there was always a clear smile flashing through his thick beard and moustache, and he always loving a good challenge, never being above flirting with attractive ladies. Bryce-Kelley himself believed that good business for others would often translate into a better opportunity for him, and would often spread favors around in the hope that the more he spread around, the more he could collect later. Bryce-Kelley had a rather odd accent which would seem to indicate that he was from an elite system in the Core Worlds."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "He was most often seen in a tan spacer's jumpsuit that was covered in pockets which seemingly held just what he or his friends needed. However, despite his trusting and friendly attitude, he would still carry a heavy blaster pistol at his side in case of emergencies or the inevitable encounters with Imperial or bounty hunter forces, as well as double-crosses from those he thought were friends."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Despite being called Hawker Bryce-Kelly in the earlier Challenge Magazines which he first appeared in, West End Games would later use the character for Platt's Smugglers Guide in which an 'e' was added to his name, causing him to then be called Hawker Bryce-Kelley. As the West End Games material holds more weight canonically then both the Challenge Magazines, it can be assumed that this is his proper name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}