{"url": "Haydel_Goravvus", "categories": ["Category:Legends articles", "Category:Galactic Republic senators", "Category:Males", "Category:Near-Human Hybrids", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Haydel Goravvus"}, {"tag": "p", "text": "Haydel Goravvus was a male part-Human, part-Hamadryas businessman who went on to become the first Republic Senator for the planet Taris and gained fame as the leader of the Taris Resistance against Mandalorian invaders in 3964 BBY. Coming from humble beginnings, Goravvus spent his early years working in a Lhosan Industries factory in Taris' Lower City, where he was recognized for his ruthless cunning and sent on the fast track to management. Goravvus eventually became one of Lhosan's chief hatchet men, making under-the-table deals all across the galaxy. His greatest con was getting Taris in the Republic, which he achieved with a series of strategic bribes in exchange for Taris' Senate seat. Surprisingly, however, when Goravvus took his place in the Senate, he became a changed man—finding himself more interested in helping his constituents than making money, Goravvus wound up becoming a selfless public servant who challenged the corrupt business interests that ruled Taris."}, {"tag": "p", "text": "In 3964 BBY, the Mandalorian warrior clans, in the first grand strike of their nascent war with the Republic, sacked and besieged Taris. As the invaders easily took the Upper City, Goravvus—refusing to abandon his people—formed an armed resistance out of surviving law enforcement and armed civilians. Although he had no prior military experience, Goravvus and his Resistance managed to carve out a stronghold of several square blocks of the Lower City, despite overwhelming Mandalorian opposition, and soon aligned himself with the Hidden Beks, one of the strongest Lower City swoop gangs still holding out against the invaders. However, although Goravvus plotted to cripple the Mandalorians by killing chief siege engineer Cassus Fett, the Mandalorians hit the Resistance first in a devastating strike on their headquarters, sending the group scattering. Goravvus survived the attack, and although he initially still refused to leave Taris behind, he eventually made his way back to Republic space where he became known as a champion of refugees and those at risk from the war."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Path to Coruscant"}, {"tag": "p", "text": "The son of a Human businessman and a Hamadryas serving girl, Haydel Goravvus was born and raised on the Outer Rim planet of Taris, whose systematic Humanocentrism prevented the young near-Human from receiving a formal education. Instead, Goravvus spent his formative years working in a swoop bike factory owned by Lhosan Industries in the Machineville neighborhood of the Lower City. After several years as a common laborer, Goravvus began the journey that would make him one of Taris' most prominent citizens, when as a poor and hungry teenager he accepted payment from Lhosan management to help break a strike, bringing him to the attention of the corporate higher-ups. For the next 30-plus years, Goravvus served as one of Lhosan's chief hatchet men, traveling across the galaxy to engage in illegal backroom dealings and crush competitors. Goravvus' greatest achievement came when he paid off a number of Senators to support Taris' bid for Republic citizenship, in exchange for corporate support in his bid for Senator once Taris was admitted. The plan worked, and Goravvus became Taris' first Republic Senator with no opposition and little public knowledge of the backroom dealings, despite some grumbling from Taris' Human elite on having a mixed-race Senator."}, {"tag": "p", "text": "But once Goravvus reached the Senate, he underwent a significant personal transformation: now that he had responsibility to the people of Taris, Goravvus became more concerned with serving his constituents than profit, and metamorphosed into a model Senator and a selfless public servant. By 3964 BBY, a wedge had begun to be driven between Goravvus and his old friend, Lhosan Chairbeing Jervo Thalien, despite their long corporate history. Goravvus had grown weary of constantly giving Lhosan Industries tax breaks, even after Thalien's operations had begun to be severely affected by the Black Vulkar swoop gang, professing that he was indifferent to the idea of Lhosan pulling off Taris entirely—Goravvus trusted the local Jedi Council's ability to handle the gang problem, but he quickly recanted after witnessing Jedi Padawan Zayne Carrick being outsmarted and defeated by common criminal Marn Hierogryph."}, {"tag": "p", "text": "Carrick would very shortly afterward become one of the most wanted fugitives in the Republic, after he was accused of slaughtering four other Padawans in his class at Taris' Jedi Tower, and went on the run with his alleged accomplice, Hierogryph. Carrick—who had in truth been framed by the five Jedi Masters in the local Council, who had actually carried out the murders—managed to flee summary execution and slip off the planet, an event that drove Taris into riots. In the ensuing several weeks, Goravvus disappeared from the public eye as Taris descended into anarchy. Although the public at large knew nothing of Goravvus' whereabouts—it was considered a major mystery in the press at the time— the Senator had in fact gone in search of Thalien, who had pulled Lhosan Industries off Taris in the wake of the riots. Goravvus followed Thalien across half the galaxy, pleading with him to change his mind, and eventually threatened to go public about the bribes he had issued on behalf of Lhosan Industries. However, before Goravvus could do so, events on Taris took a turn that required the Senator to return home."}, {"tag": "h3", "text": "Leading the Resistance"}, {"tag": "p", "text": "The Padawan Massacre, as it became known, caused the Jedi Order to pull off Taris entirely, and the warrior band known Mandalorian Neo-Crusaders, who had been engaged in a war of conquest against the Republic, took it as a signal to attack the planet. The Mandalorian assault was massive and the invaders swiftly seized the Upper City with only token resistance. It was then that Goravvus re-emerged, revealing that he had pulled together an armed resistance movement in the Lower City. Turning from Senator to warrior, Goravvus organized the best-equipped and best-run force opposing the Mandalorian invasion, populated by a number of surviving law enforcement led by Constable Noana Sowrs and an cohort of armed locals, many of whom were non-Human. In the face of constant Mandalorian assault Goravvus' Resistance managed to carve out a territory consisting of several square blocks in the Lower City, and soon received a major boost when Raana Tey, one of the Jedi Masters formerly stationed at the Jedi Tower, was ordered back to Taris by Republic Supreme Chancellor Tol Cressa and joined up with Goravvus' group."}, {"tag": "p", "text": "As the conflict continued to escalate, Goravvus received some unexpected visitors at the abandoned factory that served as his base: Zayne Carrick and Marn Hierogryph, who arrived along with the swoop gang known as the Hidden Beks, who had waged their own less-successful struggle against the foreign invaders. Although there was initial tension between the two factions—Tey wanted Carrick, who was still a highly wanted Republic fugitive, killed, while Constable Sowrs wished to exact Tarisian justice on the Beks' \"criminal\" leader, Gadon Thek—Goravvus managed to broker an uneasy peace, as the Beks wished to parley and join forces. Goravvus worked out a deal with Thek where the two factions would merge their numbers, with the swoop gang lending him their valuable skills and vehicles in exchange for medical aid for their wounded. Goravvus also found that he had personal business with Hierogryph, who had actually been enlisted by Jervo Thalien to track Goravvus down. When the two had a moment alone, Hierogryph opened a briefcase revealing a transmitter strong enough to beat the Mandalorian signal-jamming, and initiated a holo-call with Thalien. At that moment, Ithorian bounty hunter Del Moomo took hold of Goravvus, with Thalien revealing that he had placed a bounty on the Senator to prevent him from revealing Lhosan's shady backroom dealings."}, {"tag": "p", "text": "Raana Tey arrived on the scene and quickly disarmed Moomo, and Thalien's ace in the hole—the transmitter itself, which also functioned as a powerful thermal charge—failed to detonate. With Thalien's leverage gone, Goravvus took the opportunity to dictate a new arrangement, where Thalien would use his political resources to arrange for aid to be sent to the Resistance, before terminating the video call. Soon afterward, Goravvus received word that one of Mandalore the Ultimate's chief lieutenants, Cassus Fett, had personally arrived in the Upper City to supervise operations planetside. Sensing that a critical opportunity approached, Goravvus called a strategic meeting with the entire strength of the Resistance—using charges recovered in recent raids and the detonator from Thalien's unexploded bomb, Goravvus and his men put together a plan to bomb the Jedi Tower, Fett's command center, and deal a crushing blow to the Mandalorian siege effort. By the time the strike team reached the Jedi Tower, however, they found that Cassus Fett had already flown the coop. Instead, the Mandalorians used that climactic moment to strike directly at the Resistance base, dealing a critical blow to Goravvus and his group."}, {"tag": "p", "text": "The Mandalorian assault was swift, brutal and unforgiving, pushing most of the survivors deep into the rakghoul-infested wasteland known as the Undercity. Although Goravvus survived the attack and had a chance to flee the planet on Raana Tey's shuttle, Goravvus refused to leave his planet behind and instead gave his spot on the craft to Shel Jelavan, a Resistance agent. At some point, however, Goravvus fled Taris and returned to the Republic capital of Coruscant, where he became known as a champion for refugees throughout the remainder of the war. Among the people working for him after his escape from Taris was Jelavan, who in turn served as an aide to Zayne Carrick in his Rogue Moon Project, which aimed to help many of the same at-risk people that Goravvus did."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Senator, and as leader of the Taris Resistance, Haydel Goravvus' first and foremost concern always lay with his people. A respected leader, Goravvus brooked no disunity, whether it was between Constable Sowrs and the Hidden Beks or Raana Tey and Zayne Carrick, as Goravvus believed that even the slightest split could result in defeat and he feared the chaos and violence of life under the Mandalorians. Despite the enormous personal danger to himself, Goravvus stayed behind to fight for Taris out of his commitment to help his people in their time of need, and even refused the chance to flee the planet when his Resistance collapsed. However, Goravvus' motivation wasn't always so selfless. As a younger man, he was a cunning, wily corporate hatchet man who desired power and status above all else. Everything changed for Goravvus once his schemes brought him to the Galactic Senate—a lifelong loner, Goravvus found a family in the people of Taris, and was drawn to the ideals of a public servant."}, {"tag": "p", "text": "Goravvus' character transformation resulted in a man not afraid to challenge the business interests that had arranged for him to join the Senate and willing to work with the \"criminals\" fighting for freedom from the Mandalorians. The \"new\" Goravvus was privately honest about the under-the-table dealings of his past, and while he still considered Jervo Thalien a personal friend, he valued the needs of his planet over those of his old employer and was willing to threaten to reveal to the galaxy that Lhosan bribed Taris into the Republic to ensure their continued economic presence on the planet. Goravvus' commitment to help those at risk continued long after the end of his Resistance on Taris, as he became a popular advocate for refugees and people living on occupied worlds for the rest of the Mandalorian Wars. Goravvus had green skin, white hair and blue eyes, and spoke a number of languages, including Galactic Basic, Gamorrese, Hamadryas, High Galactic, Huttese, Ithorese, Kedorzhan and Twi'leki."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Haydel Goravvus was created by John Jackson Miller, the writer of the Star Wars: Knights of the Old Republic comic series. The character first appeared in the series' first issue, although he was not identified until the release of the trade paperback for the Commencement story arc. In The Taris Holofeed: Siege Edition, which appeared in the fifteenth issue, his name was spelled \"Gorravus.\" Miller stated in his production notes for that issue that the spelling of the character's surname had not yet been decided upon. However, in The Taris Holofeed: Invasion Edition, the senator's surname was spelled as \"Gorravus\". Furthermore, his entry in 2008's The Complete Star Wars Encyclopedia had the spelling of his name as \"Gor-ravvus.\" Goravvus was given the first name \"Haydel\" in his entry in the Knights of the Old Republic Campaign Guide, where his background was expanded because Miller needed a character to represent the Corporate Agent prestige class for the Star Wars Roleplaying Game."}, {"tag": "p", "text": "In the comics, Goravvus was drawn by Brian Ching and Dustin Weaver for the first and twenty-third issues of the Knights of the Old Republic comic series, respectively. The first issue depicted the character as having yellow irises; however, the twenty-third issue depicted Goravvus' eyes as a blue hue."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}