{"url": "Head_Proctor", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Dark Side Adepts", "Category:Empire Reborn members", "Category:Unidentified humans", "Category:Unidentified males", "Category:Unidentified Sith"], "nodes": [{"tag": "h1", "text": "Head Proctor"}, {"tag": "p", "text": "The Head Proctor was the head of the Proctors used by Lord Hethrir. He was a young Human male and was distinguished from other Proctors by his numerous medals. The Head Proctor was known to be a rough and hardened bully and was bad tempered and also ill-mannered including throwing tantrums. He was stationed at Hethrir's Worldcraft as the Lord's second-in-command and thus also commanded the Helpers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 14 ABY, while Hethrir had gone to sacrifice the Force-strong Anakin Solo to Waru at Crseih Station, he was trapped in one of the holding cells by Jaina and Jacen Solo. The two Solo children then managed to free the other captive children from the compound and mounted the sand dragon known as Mistress Dragon."}, {"tag": "p", "text": "The children then fled on the sand dragon through a forest and a swamp with the Head Proctor and his Proctors and Helpers following them. Compared to the children who were largely safe, the Proctors and Helpers were injured by the bushes and branches and bogged down in the swamp by the time Leia Organa Solo, Chewbacca and Rillao arrived in their yacht Alderaan. To make matters worse, they were forced to flee through the desert only to be harassed by Mistress Dragon."}, {"tag": "p", "text": "In exchange for protection from Mistress Dragon and other so-called \"plagues\", the Head Proctor surrendered to Leia. As part of the conditions of surrender, he was stripped of his medals and detained in one of the holding cells at the compound. With the fall of the Empire Reborn movement, the Head Proctor was presumably arrested and placed into New Republic custody."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}