{"url": "Head_of_State", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Confederacy of Independent Systems", "Category:Political titles"], "nodes": [{"tag": "h1", "text": "Head of State"}, {"tag": "p", "text": "Head of State was a title used to refer to the leader of a government. As leader of the Confederacy of Independent Systems, Count Dooku possessed the title. Dooku determined the overall strategy for the Confederacy military, served the leader of the Separatist Parliament—the legislative organ of the Confederacy—and presided power over the Separatist Council."}, {"tag": "h2", "text": "Powers"}, {"tag": "p", "text": "The powers of the Head of State of the Confederacy of Independent Systems was legally limited by the Bylaws of Independent Systems which vested most power the Separatist Senate in regards to state matters, with only the Head of State being officiator of congressional procedure. However, during the Clone Wars, the position became a dictatorship under the guise of Count Dooku, who could make executive orders in regards to governmental decisions which undermined the democratic process completely and making the senate ineffective."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Dooku Premiership"}, {"tag": "p", "text": "In the wake of the Naboo Crisis, Sheev Palpatine was appointed to the position of Supreme Chancellor in the image of himself as a mild-mannered servant of the common good. Despite his true intentions, growing tensions between the Core Worlds and the Outer Rim Territories gradually increased to the point where many believed that a war was imminent. Following Dooku's denouncement of the Galactic Republic, many systems rallied to Dooku and seceded from the Republic to the Confederacy of Independent Systems, he also began backing coups on Ryloth and meddling in the affairs of a variety of worlds including Kashyyyk, Sullust, and Onderon while alienating distant worlds from the galactic political process and denied all attempts to negotiate with the Republic—igniting a Separatist Crisis as he elected as its Head of State by parliament."}, {"tag": "p", "text": "Ultimately, the Republic and Separatists clashed in the Clone Wars. While some Separatists senators learned of Dooku's true nature, and some members of the Peace Faction opposed the war powers granted to Dooku, as they felt it made the Confederacy no better than the Republic, the Count remained the leader of the Confederacy until the Battle of Coruscant, where he was killed by Jedi General Anakin Skywalker. Afterwards, General Grievous, the Supreme Commander of the Separatist Droid Army, succeeded Dooku as the de facto Head of State. However, only days later, Grievous was killed by Jedi General Obi-Wan Kenobi during the Battle of Utapau."}, {"tag": "p", "text": "Following the Battle of Utapau, Viceroy Nute Gunray succeeded Grievous and became the final Head of State for the Confederacy, and the remaining droid forces were placed under the command of the Separatist Council, who continued to monitor the war effort on Mustafar, until the council's execution at the hands of Darth Vader. With the deaths of Grievous, Gunray and the rest of the council, the Separatist command structure ultimately collapsed and the droid armies were deactivated, bringing the war to an end."}, {"tag": "h2", "text": "Residence"}, {"tag": "p", "text": "During the Clone Wars, as Count of Serenno, Dooku in his capacity as Head of State resided his prestigious family palace on the planet. His private quarters was in the main tower which featured a grand window on cliff side which was made up of luxurious and lush furnishings, and were decorated with many statues and elaborate paintings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}