{"url": "Heart/Legends", "categories": ["Category:Legends articles", "Category:Anatomy"], "nodes": [{"tag": "h1", "text": "Heart"}, {"tag": "p", "text": "The heart was a major internal organ found in many non-sentient creatures and sentient humanoid species. It was responsible for pumping blood through the blood vessels. Any strikes or damage done to the heart was usually fatal to humanoids. The Muun Sith Lord by the name of Darth Plagueis, for instance, had once pulled the beating heart out of a warrior, and took a bite out of it. Jaina Solo, on the other hand, killed her brother, Darth Caedus, by striking at his heart with her lightsaber. Over a thousand years earlier, Dessel—the boy who would become Darth Bane—killed his own father, Hurst, by using the dark side to crush the man's heart. The heart of a Human being was located behind the breastbone, and would thud against it under certain emotional conditions."}, {"tag": "p", "text": "Some species, such as the Zabrak, had two hearts, which had to beat in synchronization to function properly, while the Muun had three hearts. Cereans also had a secondary heart to support their large brains. Chadra-Fan had two hearts, but would die in three days if one of the them failed. The Atoan species did not possess hearts, but rather had numerous \"hearts\" throughout their bodies."}, {"tag": "p", "text": "In terms of medical treatment, there were several devices which could monitor the heart, such as the various monitors and defibrillators used by Darth Sidious to monitor the status of Darth Vader following his horrific ordeal on Mustafar. Medical personnel used a device called an auscultator to listen to the heart sounds of their patients, as Doctor Kornell Divini did to Memah Roothes on board the first Death Star.\nA failing heart could also be replaced by a more healthy one through a delicate surgical procedure."}, {"tag": "p", "text": "For many, the heart was also thought of as the seat of emotion. Jabba Desilijic Tiure once told an extra-galactic spacer they had the heart of Hutt. When young Anakin Skywalker asked his mother if they would ever see each other again, she responded, \"What does your heart tell you?\" Ten years later, Jedi Grand Master Yoda was pleased to see Senator Padmé Amidala survive an assassination attempt, telling her that it brought warm feelings to his heart. Three years later, Padmé told Anakin that he was breaking her heart after witnessing him turning to the dark side. Hearts were also a symbol of love. During the time of the Galactic Civil War, an Ewok named Kyoopid sported heart-like symbols on his body. The celebration also saw symbolic representations of the heart on love cards, as sculptures, as Chak hearts, or as the tip of an arrow on certain crossbows"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}