{"url": "Heart_of_the_Guardian", "categories": ["Category:Legends articles", "Category:Jedi artifacts", "Category:Lightsaber crystals"], "nodes": [{"tag": "h1", "text": "Heart of the Guardian"}, {"tag": "p", "text": "The Heart of the Guardian was an ancient crystal that was rediscovered on the surface of Yavin 4 by the Rodian inventor Suvam Tan some time prior to the Jedi Civil War. Possibly utilized as a lightsaber crystal by the redeemed Revan, it gave the blade of any such weapon into which it was installed a unique bronze hue and yellow core. The Heart was one of two legendary crystals that Revan possibly obtained from Tan near the end of his quest to find and destroy the Star Forge, the other being the Mantle of the Force."}, {"tag": "p", "text": "When placed within a lightsaber, it altered the properties of other crystals that the lightsaber carried in a positive way; this crystal created a fast yet devastating blade that was perfect for lightsaber combat."}, {"tag": "p", "text": "It is believed that the Heart was involved in the founding of the Jedi Order. According to prophecies of the Order, the Heart would appear at the time of greatest turmoil and help in bringing the galaxy into salvation. However, the Sith also believed it to be an object of their heritage, which in turn would have brought about their domination of known space."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This crystal can only be purchased at the Yavin Station in the PC version of Star Wars: Knights of the Old Republic for 20,000 credits; Yavin is also available as downloadable content for the Xbox version. The bronze color of the blade is exclusive to this crystal in the game."}, {"tag": "p", "text": "The benefit of the crystal will likely vary depending on what other crystals you use in the light saber. Also, you will not see identical benefits when used in the right or the left hand. For instance, in the right hand, The Heart of the Guardian will negate a VS Dark Side benefit crystal and replace it with a Blaster Bolt Deflection benefit, but it will not give the Blaster Bolt Deflection benefit in the left hand."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}