{"url": "Heavy_Defender", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Military units", "Category:Scavengers", "Category:Rodians", "Category:Rodian organizations", "Category:Salvage companies"], "nodes": [{"tag": "h1", "text": "Heavy Defender"}, {"tag": "p", "text": "The Heavy Defenders was a military unit and part of the Rodian Salvager's Cartel during the early years of the Galactic Empire. They were founded by Drexl Roosh prior to 3 BBY and operated on Raxus Prime. The Heavy Defenders acted as enforcers to protect Roosh's scavengers and were predominately bulky, brutal Rodians wielding rotary cannons. They were wiped out along with the rest of the cartel by Galen Marek in 2 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prior to 2 BBY the Heavy Defenders were founded by Drexl Roosh as part of the Rodian Junk Cartel. Their role was to protect the Rodian Rippers and Jawas who did much of the scavenging for the cartel. The Heavy Defenders frequently clashed with Jedi Master Kazdan Paratus' droid army, being deployed to stop them from interfering with Roosh's operations."}, {"tag": "h4", "text": "Mission to Raxus Prime"}, {"tag": "p", "text": "When Galen Marek landed on the planet Heavy Defenders were deployed on skiffs to stop him. Marek killed them along with the scavengers inside a wrecked hyperdrive. Defenders were also skirmishing with Paratus' droid army near a crashed Blockade runner, until Marek intervened and defeated both factions. Marek then advanced to the scavengers' camp, whereupon he destroyed its shield generator and fought his way past them into the junk chasm, into the territory of his target Kazdan Paratus, whom he killed. The destruction of the scavengers' camp combined with the subsequent invasion by the Galactic Empire and Drexl Roosh's apparent death at Marek's hands crippled and fragmented the cartel."}, {"tag": "h4", "text": "Second mission to Raxus Prime"}, {"tag": "p", "text": "By 2 BBY the cartel was reorganised by Roosh, who had survived being crushed by a LAAT gunship. They were fighting against the Imperials, who had occupied the planet, when Marek returned and killed Roosh for good, dissolving the cartel."}, {"tag": "h2", "text": "Weapons and Equipment"}, {"tag": "p", "text": "The Heavy Defenders wielded Z0-16 rotary cannons, which sprayed blaster bolt on a wide range but were not very precise and required time to heat up in order to begin firing. When cornered at close range the Defender would use their cannon as a melee weapon and attempt to club their opponent."}, {"tag": "p", "text": "The Heavy Defenders would also wear tough, heavy armor that gave them significant protection against melee weapons."}, {"tag": "p", "text": "Them being bulky and having high amounts of stamina allowed them to bear the weight of both armour and cannon easily."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}