{"url": "Heavy_Weapons_Factory", "categories": ["Category:Legends articles", "Category:Articles to be merged", "Category:Building types", "Category:Factory types"], "nodes": [{"tag": "h1", "text": "Heavy Weapons Factory"}, {"tag": "p", "text": "Heavy Weapons Factories were construction facilities used to build siege weapons for various factions. throughout galactic history. They were produced by droid or organic workers such as Glurrgs or Wookiees at a cost of 210 units of carbon and 25 units of ore. These buildings would typically produce units such as pummels, anti-air units, and artillery pieces. The units were also upgraded at Heavy Weapons Factories. The Gungans, Royal Naboo Security Forces, Trade Federation, Galactic Republic, Confederacy of Independent Systems, Galactic Empire, and the Rebel Alliance all used their own version of these factories."}, {"tag": "h2", "text": "Known Heavy Weapons Factory types"}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "The Galactic Empire's heavy weapons factories were composed of two buildings connected via a bridge. The larger building on the right side was trapezoidial and contained a deck that was either an observation deck or a place where parts were placed. It also contained a tower. The left building, the shorter of the two, contained a small stack. Between the two buildings on the ground was the construction area, where a levitating crane-like droid would utilize its arms to construct various weapons. There was also a globular device nearby. Similar to all Imperial-owned buildings, they were primarily gray with blue linings."}, {"tag": "p", "text": "Such facilities were where the Empire's Mobile Artillery, Heavy Artillery Platforms, All Terrain Anti Aircraft, Heavy All Terrain Anti Aircraft, Energy Pummels, and Heavy Energy Pummels were developed."}, {"tag": "h3", "text": "Gungan"}, {"tag": "p", "text": "The Gungan weapons factories were primarily biomechanical in nature, similar to other Gungan-owned buildings. To the right of the building was a large pit, and the building itself was a large sea mesa. A prong also jutted out over the pit. A lesser pit was also nearby in front of the building. The building at its early stages of construction had a starfish on it, and also started developing undersea chimmneys during the second stages of construction."}, {"tag": "p", "text": "Such facilities were where Gungan energy catapults, Gungan Heavy Energy Catapults, Raapturs, Large Raapturs, Cerrabores, and Large Cerrabores were maintained and breeded."}, {"tag": "h3", "text": "Rebel Alliance"}, {"tag": "p", "text": "The heavy weapons factories utilized by the Alliance to Restore the Republic were large buildings that were composed of a garage and a small storage space. The building had a satellite array for communications. The storage space stored various necessary parts. The garage contained a mechanical arm used to assemble the various siege weapons."}, {"tag": "p", "text": "Such facilities were where the Rebel Alliance's Artillery, Heavy Artillery, Proton Torpedo Launchers, Heavy Torpedo Launchers, Energy Pummels, and Heavy Energy Pummels were developed."}, {"tag": "h3", "text": "Royal Naboo Security Forces"}, {"tag": "p", "text": "Due to the fact that Naboo was considered peaceful and thus lacked a large-scale military, the Royal Naboo Security Forces' heavy weapons factories were rarely seen outside of Theed. However, a number of such facilities were ordered and developed across Naboo during the Invasion of Naboo."}, {"tag": "p", "text": "The facilities themselves was constructed from materials gathered by Royal Naboo PKN-49 worker droids at a cost of 210 units of carbon and 25 units of ore. Royal pummels, artillery carts, and anti-air hovercraft and their heavier variants were designed, built, and housed here."}, {"tag": "p", "text": "The architecture was general Naboo-style architecture, and was composed of at least one smokestack as well as two buildings covered in wall ivy connected by a pathway above, and featuring a maintenance pit with a crane."}, {"tag": "h3", "text": "Trade Federation"}, {"tag": "p", "text": "The Trade Federation utilized a brown building with a garage to maintain their various heavy weapons systems. The building also featured two smokestacks and an observation balcony."}, {"tag": "h3", "text": "Wookiee"}, {"tag": "p", "text": "The Wookiees' heavy weapons factories were composed, at least initially, of two buildings connected by an adjoining walkway, and had a pit for maintaining their various heavy weapons."}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "The Grand Army of the Republic during the Clone Wars, or at least during the Hunt for the Decimator battleground, were ordered across the galaxy. The buildings had two garages and a maintenance pit, with one being on the second story of one building that was adjoining another building via a walkway."}, {"tag": "h3", "text": "Confederacy of Independent Systems"}, {"tag": "p", "text": "The Confederacy of Independent Systems during the Clone Wars, or at least during the Hunt for the Decimator battleground, were ordered across the galaxy. Like other CIS-owned buildings, they were derived primarily from Geonosian architecture, and featured a massive pit with a spire emerging from the middle containing a cavern up top, and possessed purple patterns."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Heavy Weapons Factories appear in the 2001 video game Star Wars: Galactic Battlegrounds and its 2002 expansion pack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}