{"url": "Hedji", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Adubans", "Category:Males", "Category:Spiners", "Category:Star-Hoppers of Aduba-3"], "nodes": [{"tag": "h1", "text": "Hedji"}, {"tag": "p", "text": "Hedji was a member of the near-extinct Spiner species who found work as a mercenary during the Imperial Period. In 0 ABY, Hedji joined the Star-Hoppers of Aduba-3, a ragtag team of warriors formed by Captain Han Solo to defend the Aduban village of Onacra from the Cloud-Riders, a gang of marauders under the command of Serji-X Arrogantus. Stoic and humorless, Hedji stipulated to Solo that his reasons for joining the team would remain unquestioned—in truth, the Spiner held to a rigid moral code."}, {"tag": "p", "text": "He journeyed with Solo and the rest of the Star-Hoppers to Onacra, where they did battle with the Cloud-Riders. Hedji put his naturally grown quills to good use, using them to kill the opponents. Although Arrogantus was overcome during the engagement, a giant monster—the Behemoth from Below—emerged and wreaked havoc. When one Star-Hopper, faux-Jedi Knight Don-Wan Kihotay, attempted to confront the monster by himself, Hedji rushed to his aid. The Spiner was consequently killed by a lightning blast from the creature."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A dying breed"}, {"tag": "p", "text": "Hedji was a male member of the Spiner species—rare in the galaxy during the Imperial Period, due to the fact that their homeworld, Yablon, had been destroyed by a supernova. The Galactic Republic had only managed to rescue roughly a thousand of the species, as they themselves had not developed space travel. Furthermore, the Spiners could only reproduce on Yablon, and so they were gradually driven toward extinction. Hedji eventually made his way to the Outer Rim Territories world of Aduba-3."}, {"tag": "p", "text": "While in the spaceport of Tun Aduban in 0 ABY, Hedji heard word that a posse was being formed for an unknown purpose. The Spiner made his way to Locru's Central Saloon, where candidates for the group were being interviewed by the Corellian smuggler Han Solo. After ten candidates had been rejected, Hedji entered Solo's room. Solo noted that he was unarmed, and the Spiner insisted that he did not need a weapon. When the Corellian asked him to leave, Hedji stayed put, and demonstrated his natural quill-throwing ability. Solo, shocked, immediately identified Hedji as a Spiner. Impressed, he hired Hedji, who inquired as to just what they were being hired to do. The Corellian assured him that he would be informed as soon as he had recruited a large enough force."}, {"tag": "p", "text": "The next day, Hedji met with the rest of the posse—Solo's Wookiee co-pilot Chewbacca, fugitive pirate Amaiza Foxtrain, elderly faux-Jedi Knight Don-Wan Kihotay, Lepi spacer Jaxxon, as well as the young Jimm \"The Starkiller Kid\" Doshun, and the tractor droid FE-9Q. As they assembled and Solo prepared to brief them, they were approached by Serji-X Arrogantus and the Cloud-Riders—a group of mercenaries from whom Solo had gathered a fighting force to defend the farming village of Onacra. Solo and Arrogantus exchanged heated words before the Cloud-Riders departed. Hedji was focused on dedicating himself to the defense of the weak and harmless, but he kept his intent secret from the other members of the gang."}, {"tag": "p", "text": "The group saddled up on banthas and made their way out to Onacra. As they got closer to the village, they encountered a pack of high-hounds ravaging the farmers' crops, and Solo ordered his forces to engage the creatures. Hedji put his quills to good use, killing one of the beasts with a precise fusillade of strikes. The group later arrived at the village and were introduced to the local farmers. Solo ordered everyone to prepare makeshift defenses for the village, but soon enough Arrogantus and the Cloud-Riders were sighted on approach. Hedji and the rest of the defenders assembled, and the Spiner assured Solo that he was ready to engage the enemy when the order was given. As the defenders fought the Cloud-Riders, Hedji teamed up with Jaxxon, rapidly launching quills toward his opponents."}, {"tag": "h3", "text": "The Behemoth"}, {"tag": "p", "text": "The climate of the battle was complicated when one of the villagers, known as the Old One, summoned a gargantuan beast, the Behemoth from the World Below, to battle the Cloud-Riders. When the creature began launching concentrated bursts of lightning from its forehead, Hedji pointed out to Solo the threat it posed. At first, the Corellian believed the creature was merely attacking the Cloud-Riders, but when a boulder came hurtling toward the regrouped posse, they were forced to scatter and seek out better cover. The beast eventually trampled both Arrogantus and the Old One. Hedji was querulous as to how the group should proceed, and Doshun pointed out that Onacra would be in danger now that the only one who could control the behemoth was dead."}, {"tag": "p", "text": "After a foolhardy attempt made by Jaxxon to singlehandedly destroy the beast, Solo ordered his allies to work as a team. As they were plotting, a second landslide caused by the beast forced them to relocate once more. The team soon noticed that Kihotay was making his own singular attempt to destroy the creature, approaching it with his lightsaber drawn. The fighters looked on anxiously, and Solo noted that the behemoth reacted strangely to the lightsaber. While Solo and the others held back, Hedji set off to help the beleaguered old man, who had drawn the monster's fire. Despite Solo's protests, the Spiner made his way into the open, and urged Kihotay to retreat, as he was not agile enough to dodge the blasts of the creature. Kihotay, however, was adamant that it was his duty to slay the gargantuan beast."}, {"tag": "p", "text": "Realizing that he could no longer reason with the old man, Hedji fired off a fusillade of fresh quills at the behemoth. The attack, however, did nothing but anger the creature, and it turned its lightning projections on Hedji. The Spiner was instantly struck dead. Solo was eventually able to destroy the beast with Kihotay's lightsaber. The exploits of the group, which would come to be known as the Star-Hoppers of Aduba-3, were later immortalized in a historically dubious holodocumentary created by the Tri-Nebula Entertainment company. Hedji himself would later be profiled by Alliance to Restore the Republic historian Voren Na'al, who was attempting to compile a more accurate history of the Star-Hoppers' exploits than the holodocumentary's portrayal for the Alliance database known as Mistress Mnemos."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hedji was a laconic individual, and he clung to a rigid code of honor. He was both quiet and stoic, and preferred to keep company with himself. He had little time for technology that made physical activity simple. While he had use for starships and medical technologies that were necessities, the Spiner had no time whatsoever for items of convenience or comfort. He refused to carry a blaster and placed his trust in his natural quill-throwing abilities. He held strong convictions about the defense of those weaker than him, but he refused to divulge any personal details to his fellow Star-Hoppers."}, {"tag": "p", "text": "Hedji was considered by Solo to be one of the more competent Star-Hoppers, and Hedji made sure that the Corellian was aware he was a complete professional in the art of combat. Later, when Don-Wan Kihotay sacrificed his safety to attempt to battle the Aduban behemoth by himself, Hedji could no longer stand aside and was driven into action, sacrificing himself to save the elderly faux-Jedi. In his last moments, Hedji came to suppose that Kihotay may have indeed been a Jedi Knight of the old Jedi Order. He also felt that Captain Solo should have done more than merely stand and watch as the elderly Kihotay sacrificed himself for his allies. Hedji possessed dark gray fur and black eyes."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "As a Spiner, Hedji was covered in stiff, barbed quills, which grew longest on his arms and legs. He could flex his muscles in a specific way, and the quills would be propelled with great speed and accuracy to any target up to ten meters away. He naturally replenished the quills whenever more were needed. He donned an all-temperature cloak to serve as his attire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hedji first appeared in the Marvel comic Star Wars 8 (1978), written by Roy Thomas and Howard Chaykin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}