{"url": "Hefi", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Abrion sector planets", "Category:Hefi locations", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Hefi"}, {"tag": "p", "text": "Hefi was a planet of varying climates in the Abrion sector of the Outer Rim Territories. In the wake of the destruction of the Galactic Empire's first Death Star battlestation at the Battle of Yavin, Bevel Lemelisk, the Death Star's designer, went into hiding on Hefi in fear of having failed Emperor Palpatine. After Imperial Intelligence agents located Lemelisk on Hefi, the Emperor executed him for his engineering incompetence."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Hefi was located in the Hefi system of the Abrion sector, within the Slice portion of the Outer Rim Territories. Covered by landmasses and oceans, Hefi's surface featured varied climates that were capable of supporting various forms of humanoid life."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Hefi once served as a private sanctuary for Imperial weapons engineer Bevel Lemelisk, designer of the first Death Star battlestation. Following the Death Star's destruction at the hands of the Rebel Alliance during the Battle of Yavin, Lemelisk fled into hiding on Hefi, fearing for his life for having failed Emperor Palpatine. Imperial Intelligence agents tracked Lemelisk to his remote retreat, and the Emperor later executed him for his incompetence. However, more recent findings suggested that this story was likely apocryphal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Hefi was first mentioned in the 1990 West End Games sourcebook Galaxy Guide 5: Return of the Jedi, written by Michael Stern for Star Wars: The Roleplaying Game. Hefi later appeared as one of 200 playable worlds in the 1998 PC game Star Wars: Rebellion, which provided the planet's only visual depiction, an image also used to illustrate eleven other planets of similar composition in the game."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "The 1998 Star Wars Encyclopedia notes that the story of Bevel Lemelisk hiding on Hefi following the Death Star's destruction was \"likely apocryphal, based on more recent findings.\" This seemingly contradicts all other source material detailing the incident, including the subsequent The Complete Star Wars Encyclopedia, released in 2008, which presents the story as fact. Nevertheless, this article presents both versions of the story, effectively as competing reports."}, {"tag": "h3", "text": "Star Wars: Rebellion cartography"}, {"tag": "p", "text": "Star Wars: Rebellion provides hyperspace travel times between each planet in the game. However, in several instances these times are significantly longer than those in other Star Wars Legends sources, which seems to reflect the Star Wars: Rebellion hyperspace times as game mechanics rather than actual figures. Hefi's intra-sector hyperspace times and distance from Coruscant according to Star Wars: Rebellion using the game's fastest capital ship hyperdrive are as follows. Note that this chart only includes planets that were canonically located in the Abrion sector with respect to the Legends continuity, excepting Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}