{"url": "Heget", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Males", "Category:Personnel of Moff Sarne's forces"], "nodes": [{"tag": "h1", "text": "Heget"}, {"tag": "p", "text": "Colonel Heget was a Human male Imperial Army officer who served the Galactic Empire during the Galactic Civil War. A capable commander and instructor, Heget was a loyal devotee of Emperor Palpatine's New Order. However, he became disillusioned with the constant infighting and political backstabbing that permeated the Empire and sought to remove himself from it by transferring to the remote Kathol sector under Moff Kentor Sarne. Sarne, however, declared himself a warlord following the death of Palpatine at the Battle of Endor in 4 ABY and fostered a personality cult amongst his forces, in which loyalty to him was rewarded over loyalty to the Empire. Heget refused to play Sarne's games and was rewarded by being posted to command Imperial Depot 4290-1 on the backwater planet Shintel. There, he trained his allotted personnel into a fighting unit."}, {"tag": "p", "text": "In 8 ABY, Sarne was evicted from his capital on Kal'Shebbol by the New Republic. Falling back to Shintel, Sarne took everything of value from the depot and stranded Heget and his troops on the planet by destroying the hyperdrives on all the base's starships. Shortly thereafter, the New Republic CR90 corvette FarStar arrived in orbit in pursuit of Sarne. Heget offered its crew a deal to help him contact Imperial authorities in exchange for information on Sarne's possible destinations."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early service"}, {"tag": "p", "text": "Heget was a Human male who served in the Imperial Army during the Galactic Civil War. Dedicated to Emperor Palpatine's vision of the New Order, Heget rose to the rank of major and commanded one of the Imperial Army's most highly decorated special missions battalions. However, he grew weary of the backstabbing and political maneuvering that pervaded Imperial culture. After two opposing Moffs clashed trying to secure his loyalty, Heget requested a transfer to the Kathol sector. He believed that an isolated backwater sector would free him from petty political squabbles. A young officer under Heget's command, Danthe, accompanied him to his new posting."}, {"tag": "h3", "text": "Kathol sector and command on Shintel"}, {"tag": "p", "text": "Heget found himself under the command of Moff Kentor Sarne, an ambitious man who cultivated a personality clique amongst the personnel under his command and rewarded loyalty to himself over loyalty to the Empire. Following the Battle of Endor in 4 ABY, which resulted in the death of Emperor Palpatine, Sarne declared himself a warlord and withdrew the Kathol sector from the Empire. Heget, now a colonel, refused to play by Sarne's rules, leading to his assignment to command Imperial Depot 4290-1 on the backwater planet Shintel in 6 ABY. For two years, he trained the personnel under his command, whipping them into prime fighting condition. The soldiers became specialized in wilderness survival, special recon, and AT-ST combat operations. Under Heget's command, the base personnel developed into a tight-knit community."}, {"tag": "p", "text": "In 8 ABY, Sarne was ousted from his capital on Kal'Shebbol by New Republic forces. Retreating with his fleet, Sarne began stopping at his supply depots throughout the sector. Arriving at Shintel, Sarne uploaded the depot's arsenal supplies and transferred to the fleet those personnel at the base who were loyal to him. Conversely, he rotated those personnel from his fleet who were not loyal to him personally to the depot. Sarne also ordered his forces to destroy the hyperdrive on any hyperspace-capable vessel stationed at the base, as well as the courier droids. He then placed ion mines in orbit around the planet. To Sarne's mind, the personnel on Shintel were traitors and deserved their fate. However, he did not want to risk unrest in his ranks by openly killing the base personnel, and he understood that he might need the depot during his eventual campaign to retake the sector. To that end, Sarne left Heget with orders to hold the depot and construct a landing field suitable for Skipray Blastboats."}, {"tag": "h3", "text": "Dealing with the New Republic"}, {"tag": "p", "text": "Heget saw Sarne's actions as the betrayal they were, and the introduction of new personnel to the base caused fault lines to appear in the camp. The personnel split into two factions. Heget and his allies wanted to disregard Sarne's orders, seeing them as a waste of resources, and concentrate on restoring communications to Imperial command authority. A faction led by the Major Danthe—who was the outpost's second-in-command—believed that Sarne would return and that his extreme measures were meant to preserve the security of the base. A week after Sarne's visit, the New Republic CR90 corvette FarStar arrived at Shintel in pursuit of the Moff. Heget, seeing a possibility of rescue, invited the New Republic ship to land on the planet. The FarStar cleared a path through the ion mines and landed at the depot. Heget greeted the command crew awkwardly alongside Danthe, and then invited them to the officer's barracks, where he offered the FarStar's commander, Captain Kaiya Adrimetrum, a deal. He would supply the New Republic with information regarding Sarne's possible destinations. In return, the FarStar would transport him and an aide to the Tanquilla Beach shadowport so that he could contact Imperial authorities and inform them of the situation on Shintel. He also offered to resupply the FarStar with provisions from the base's stores. Although wary of Heget, Adrimetrum agreed to the deal."}, {"tag": "p", "text": "As the FarStar prepared to depart Shintel, Adrimetrum was approached by Lieutenant Palme, an officer on the base and secretly a deep-cover spy for Sarne. He claimed that Heget was going to betray Adrimetrum, and offered to provide her with a datacard containing a copy of Sarne's navigational charts for the sector. At the same time, four agents under his command infiltrated the FarStar and attempted to steal a hyperdrive motivator from one of the corvette's T-65 X-wing starfighters. Palme's plan was twofold; the datacard, while seemingly genuine, contained programming that would activate a booby-trap hardwired into the FarStar. Before its service to the New Republic, the FarStar had been part of Sarne's forces, and the Moff had installed failsafe programming in the ship in case of emergency situations. The attempted theft of the hyperdrive motivator was never meant to succeed, as Palme wanted to cast doubt on Heget in an attempt to stop him from leaving Shintel."}, {"tag": "p", "text": "Adrimetrum uploaded the information from the datacard into the FarStar's computers, but the attempted sabotage by Sarne's men did not change her decision regarding the Colonel. Heget departed Shintel aboard the FarStar as planned, but, as the corvette engaged its hyperdrive, the booby-trap activated, causing a massive explosion that destroyed the hyperdrive engines. As the corvette recovered from the sabotage, the Steel Fist, a YT-1300 light freighter belonging to the bounty hunter group Qulok's Fist, decanted from hyperspace and attacked the FarStar. The booby-trap activated aboard the FarStar was but one stage of Sarne's plans to harass the New Republic corvette; Sarne had contracted Qulok's Fist to follow the FarStar and attack them in the Shintel system once disabled. The New Republic vessel rallied from the initial surprise and repulsed the attack. Heget was not pleased with the turn of the events and was indignant if anyone attempted to cast suspicion on him for the sabotage. The FarStar's Wookiee mechanic, Lofryyhn, jury-rigged the FarStar's engines with parts cannibalized from the corvette's starfighter complement, allowing them to reach Tanquilla Beach for repairs."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By 8 ABY, Heget was middle-aged but in excellent health. His face was lined, and he had tired eyes, but he was mentally sharp and alert. A staunch supporter of Palpatine's New Order, he grew disillusioned with the constant political maneuvering and attempted to remove himself from the games of ambitious Moffs. Heget had no use for politics, a distaste that effectively stalled his career in the Kathol sector when he refused to pander to Moff Sarne's personality cult. Sarne's reaction—to post a decorated veteran officer to a remote supply post—showed just how much the Moff prized loyalty over ability. An honorable man, Heget was loyal to his troops and inspired the personnel under his command to return his loyalty. Despite his allegiance to the Empire, Heget had no problem working with New Republic personnel to achieve his goal of contacting Imperial authorities to inform them of the plight in which Sarne had left the personnel stationed on Shintel."}, {"tag": "p", "text": "A military man, Heget was trained to use a blaster, with a specialty in heavy blaster pistols. He was also trained to use blaster artillery and vehicle-mounted weapons, and he was skilled in unarmed and melee combat. Heget was able to pilot ground and hover vehicles, and he was skilled in walker operations, with a specialization in piloting AT-STs. An able commander and combat trainer, Heget was knowledgeable about enforcing Imperial law. Heget was trained to repair blasters, and he had survival and first-aid training. He carried a blaster pistol and a comlink."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Heget first appeared in Shintel Downtime, the fourth RPG adventure featured in The DarkStryder Campaign published by West End Games in 1995. He later received an entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "In Shintel Downtime, the players have the option of refusing Heget's deal and leaving him behind on Shintel either through their own choices or by believing Lieutenant Palme's assertions that Heget will betray them. As the adventure continues under the assumption that the players help Heget, while also taking advantage of Palme's datacard, this article assumes that the FarStar chose to help Heget but did not believe Palme's claims about Heget's deceitfulness. If Heget is aboard the FarStar during the battle with the Steel Fist, the gamemaster has the option to have Heget call the base's remaining TIE fighters into combat if the FarStar is having trouble dealing with their opponents. If Heget is informed of Palme's attempts to subvert his deal with the New Republic crew, he will incarcerate Palme in the brig for his actions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}