{"url": "Heinsnake_Cult", "categories": ["Category:Legends articles", "Category:Secret societies"], "nodes": [{"tag": "h1", "text": "Heinsnake Cult"}, {"tag": "p", "text": "The Heinsnake Cult was an ancient sect the members of which wielded a dark and powerful magic capable of rivaling the Dark Lords of the Sith and clouding their vision. Its symbol was a green headless snake, which the cultists painted or tattooed on their torso. They had a temple located on a small moon. Their motto was \"The Heinsnake requires no head to survive.\" The cultists could also self-destruct to avoid capture or to ensure an enemy was taken down."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In ancient times, a group of humanoids discovered a mysterious moon covered with the relics of a bygone civilization. The newcomers found an abandoned city and a temple, inside which mysterious petroglyphs had been painted. Thanks to those drawings, the humanoids learned how to use \"the Basis,\" a large beam of energy harnessed from the moon's core. With that beam, the new inhabitants were able to increase their crops, and they also found out how to use it as a weapon. With the teachings of the petroglyphs in mind, the colonists developed a dark philosophy based on the worship of chaos and anarchy. Brute might became their only rule, and chaos their key to ultimate freedom. Among the petroglyphs was also a prophecy, which they regarded as one of their core beliefs: one day, a black-armored warrior would come and lead their army, ready to bring chaos to the whole galaxy. The drawings showed that the prophecized warrior would defeat two snakes by decapitation, before cutting the head off another one. While the first two snakes would die, the third one represented chaos and would live on forever. And so the Heinsnake Cult was born."}, {"tag": "p", "text": "By the end of the Clone Wars, that cult was thought to have died ages ago, when their temple was abandoned because of some mysterious \"abnormalities.\" However, that sect had actually survived, and it resurfaced shortly after the establishment of Emperor Palpatine's New Order and the extermination of the Jedi Knights in 19 BBY. At that time, the resurrected snake cult made an assassination attempt on Palpatine, which prompted the Emperor to send his second-in-command, Darth Vader on a mission to locate the cultists. Meanwhile, one of the cultists also sabotaged a Venator-class Star Destroyer in orbit around their current hideout, an unidentified moon, by posing as one of the engineers and implementing a homing beacon. By consequence, the Cult utilized the basis to completely obliterate the ship, although not before most of the crew evacuated. After locating the remains of the Imperial ship, Vader and his guards landed on the moon. They discovered the ruined temple, and Vader was greeted by the cultists, who recognized him as the armored warrior of the prophecy. The Emperor's right hand man discovered that the cultists expected him to destroy the Empire, which they regarded as the embodiment of the second snake. With the Jedi and the Empire destroyed, the cultists hoped they could bring chaos to the universe, allowing the headless Heinsnake to reign forever. However, they ended up wiped out by Vader instead, who also took the crystal powering the Basis, dooming their moon in the process. Palpatine later revealed that he had manipulated Vader into wiping them out as a test, even engineering his own assassination attempt. He also stated the Basis would be inspirational for Grand Moff Tarkin's 'project'."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}