{"url": "Heist_in_Capital_City", "categories": ["Category:Canon articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Heists and robberies", "Category:Missions of the Ghost", "Category:Missions to Lothal"], "nodes": [{"tag": "h1", "text": "Heist in Capital City"}, {"tag": "p", "text": "Five years before the Battle of Yavin, a group of rebels carried out operations against the Galactic Empire on the Outer Rim planet of Lothal. One mission was contracted by crime lord Cikatro Vizago, who commissioned the rebels to mount a heist to steal blasters from the Empire. The operation was carried out in Capital City, where the rebels attempted to steal the blasters. They were interrupted, however, by a street orphan named Ezra Bridger, who stole one of the sets of crates. This led to a chase throughout the city, with the rebels attempting to outrun the Empire, and Bridger attempting to outrun both. Their chase made its way out of the city, and the rebels fought off stormtroopers and TIE fighters as they fled. Bridger eventually got away from the rebels, but was saved by their ship, the Ghost, which shot down an approaching TIE fighter. Kanan Jarrus, the leader of the rebels, offered Bridger a chance to escape as more fighters approached, and Bridger leapt onto the ship with his crate."}, {"tag": "p", "text": "The Ghost was pursued by several TIE fighters, leading to a brief firefight throughout the atmosphere and into space. The ship was able to escape into hyperspace before returning to Lothal, where it scrambled its signal so it could not be recognized. The rebels brought many of the crates, which also contained food and other supplies, to a refugee settlement called Tarkintown, where the rebels provided it for free to the refugees. Jarrus and Hera Syndulla, the crew's captain, delivered the blasters to Vizago, who paid them both in money and in information—specifically, the potential whereabouts of Wookiees who had been enslaved by the Empire, leading the rebels to undertake a mission to rescue them. Bridger later joined the crew, having found an adopted family in them as a result of the heist."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In the fifth year before the Battle of Yavin a group of rebels operated on and around the Outer Rim planet of Lothal, striking out against the Galactic Empire. Occasionally, in order to fund their operations and maintain their starship, the Ghost, the rebels took jobs from the Devaronian crime lord Cikatro Vizago, leader of the criminal gang known as the Broken Horn Syndicate on Lothal. The rebels, not content to operate just on one planet, used information provided by Vizago to rendezvous with a ship they were told carried potential allies for their fight against the Empire."}, {"tag": "p", "text": "The ship, which they discovered to be a Wookiee gunship, had been raided by Trandoshan slavers before the Ghost arrived, and the Wookiees were taken as slaves by the Empire. Vizago told the rebels that he would look into what happened to the Wookiees, and, in the meantime, he provided them with another job: to steal Imperial supply crates in Capital City. The crates contained blasters, which Vizago wanted, but also contained food that could be given to refugees in Tarkintown, a small settlement made out of citizens who had been displaced by Grand Moff Wilhuff Tarkin, Governor of the Outer Rim Territories."}, {"tag": "p", "text": "Shortly before the heist was to begin, the Lawbringer, an Imperial-class Star Destroyer, made its way towards Capital City. Seeing it fly over his his home, the abandoned LothalNet comm tower E-272, Ezra Bridger followed the vessel's route aboard a speeder. Bridger, a 14-year-old orphan and con artist, also made his way into Capital City, where he encountered a local Gotal merchant, Yoffar, being harassed by two Imperial officers, Commandant Cumberlayne Aresko and Taskmaster Myles Grint. After Yoffar criticized the Imperial presence on Lothal, the officers intended to arrest him for treason. Bridger swiped a communicator from Aresko and tricked the officers into believing that there was an emergency in the town square, causing the officers to leave and reverse their previous decision to arrest the merchant for treason."}, {"tag": "p", "text": "After stealing a few jogan fruits from the merchant, Bridger made his way to a rooftop and watched the officers in the city square, where the officers found that there was no emergency. Instead, they found another officer, Supply Master Yogar Lyste, and his troops loading supply crates onto speeders—the same crates that the rebels intended to steal. The rebels themselves were in the area, preparing to undertake their mission."}, {"tag": "h2", "text": "The heist"}, {"tag": "p", "text": "As the Imperials continued loading their supplies, one of the rebels, Mandalorian explosives artist Sabine Wren, left a detonator on one of the speeder bikes, which exploded near one of the stormtroopers. Fearing they were under siege, the Imperials evacuated with the supply crates, sending their speeders through the city. The speeders were intercepted by Kanan Jarrus, the rebel leader and a Jedi survivor of Order 66. Together with the Lasat warrior Garazeb Orrelios, Jarrus fought off the Imperial troops in order to steal the crates. Their plan was complicated, however, when Bridger jumped from the roof and stole one of the speeders, and a set of crates along with it, before speeding off."}, {"tag": "p", "text": "Bridger's actions led to a chase throughout the city. He was first spotted by Wren, who jumped onto the crates that Bridger's speeder was carrying and took one of the two from him. Bridger continued to make his way through Capital City, while Jarrus and Orrelios continued their pursuit. Their chase led outside of Capital City, where they were then pursued by Imperial troops. Jarrus and Orrelios fought the stormtroopers off, with Orrelios falling back in order to come at the stormtroopers from behind. Orrelios eventually left with Jarrus' crates, while the rebel leader continued after Bridger. Jarrus intercepted the boy, who said that he stole the crate fair and square. They were soon intercepted by a TIE/ln space superiority starfighter, which fired on their location and destroyed Jarrus' speeder. Bridger's speeder was unharmed, and he continued away from the city."}, {"tag": "p", "text": "The TIE fighter continued to pursue Bridger as he attempted to return to his tower. The TIE fighter fired on him and destroyed the speeder, leaving Bridger defenseless—until the TIE fighter was shot down by the Ghost. Jarrus gave Bridger a chance to escape as four additional TIE fighters approached, a chance that Bridger took. He grabbed his crate and leaped towards the ship, unknowingly using the Force to propel his ascent, much to the former Jedi's surprise."}, {"tag": "p", "text": "Once Bridger was on board, the Ghost flew into space, where it continued to be pursued by the TIE fighters. Bridger learned that the crate he stole contained blasters, and he continued to lay a claim to it, wanting to sell the weapons on the black market. As he argued with the crew, the ship's pilot, Hera Syndulla, evaded the TIE fighters and calculated a jump into hyperspace, while Jarrus and Wren manned the ship's gun turrets to fire back at the TIE fighters, destroying two of them. Wren was able to shoot down the second TIE fighter and provide an opening for Syndulla, who jumped the Ghost into hyperspace and escaped from the Empire."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the chase ended, Agent Kallus of the Imperial Security Bureau, who had arrived on Lothal prior to the heist in order to investigate the rebels' activity, discussed the situation with Aresko and Grint. Kallus explained that many other Imperial operations had been targeted by the rebels, and that the crew would need to be destroyed lest they spark a full-scale rebellion against the Empire."}, {"tag": "p", "text": "The Ghost later returned to Lothal, scrambling its signal so the Empire could not detect their return. The ship landed on the outskirts of Tarkintown, where Wren and Orrelios brought the supplies to the people. Bridger also brought supplies, though he did not yet believe in the rebel cause, instead wanting to take the weapons he stole back to his home. He nonetheless saw the impact that the supplies had on the townspeople, who were grateful to receive free food from the rebels. Jarrus and Syndulla, meanwhile, delivered the blasters to Vizago, who paid them with money as well as information. Specifically, he provided them with what they believed was the location of the enslaved Wookiees."}, {"tag": "p", "text": "The rebels mounted a mission to rescue the Wookiees, but they were unaware that the information was a trap laid by Agent Kallus. The crew fell into Kallus' trap while trying to rescue the Wookiees, but they escaped and ultimately learned that the Wookiees were being taken to the spice mines on the planet Kessel. It was on Kessel that the rebels successfully rescued the prisoners and released them from Imperial captivity. After the mission, Bridger agreed to join the crew and become Jarrus' Padawan, as the Jedi survivor had discovered Bridger's sensitivity to the Force. Additionally, the actions of the rebels on Lothal and on Kessel led Kallus to contact the Grand Inquisitor, who was tasked by the Empire with hunting down any surviving Jedi—and who took an interest in eliminating Jarrus, Bridger, and their crew."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The heist in Capital City was featured in the opening sequences of Star Wars Rebels: Spark of Rebellion, the one-hour television film premiere of Star Wars Rebels that aired on October 3, 2014."}, {"tag": "p", "text": "The first draft of Spark of Rebellion initially depicted a different sequence of events for the heist. In that draft, Ezra Bridger stole one of the speeder bikes and returned to his tower outside of Capital City. The sequence did not contain a speeder bike chase, but rather a chase on foot across rooftops. After Bridger returned to his tower, he opened a crate and found electronic leaflets containing propaganda from the Empire. Rather than be confronted by Kanan Jarrus immediately, the two instead met again the next day. The final draft of the script added the speeder chase to the heist sequence in order to provide more action to the first act of the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}