{"url": "Helen_Goldenfield", "categories": ["Category:Legends articles", "Category:Farmers", "Category:Females", "Category:Humans", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Helen Goldenfield"}, {"tag": "p", "text": "Helen Goldenfield was a Human female rancher who lived on Tatooine during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the time of the Battle of Yavin, Helen Goldenfield lived in a  ranch near the city of Mos Eisley with her husband Roric Goldenfield."}, {"tag": "p", "text": "Circa 1 ABY, Helen and her husband had raised the ire of a local band of pirates who had established a hideout near their home. Roric had managed to capture and imprison some of the pirates in the basement of their home and had left to find an Imperial garrison to have them arrested. He left Helen to watch the pirates. While he was away, a spacer, who was on a quest for the Mark of Honor, arrived at their house. Being a gracious host, Helen let the spacer in. She asked if they would watch the prisoners for her while she took a break. The spacer agreed. During this time, the pirates pleaded with the spacer to let them out, but they refused and informed Helen of their intent to escape. At this time, Roric had finally returned with two Imperial dark troopers. The troopers arrested the pirates and led them out of the house. Helen and her husband thanked the spacer for their assistance, and the spacer left."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Helen Goldenfield is an non-playable character in the 2003 massively multiplayer online role-playing game Star Wars Galaxies. She appears if the player is on the \"Mark of Honor\" portion of the \"Hero of Tatooine\" questline. Due to the nature of the game, Helen's appearance changes every time she is encountered, so the provided picture is just one possibility of how she may have looked. She is consistently a Human female, however."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}