{"url": "Helix_Squadron", "categories": ["Category:Canon articles", "Category:Galactic Empire stubs", "Category:Helix Squadron personnel", "Category:Imperial starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Helix Squadron"}, {"tag": "p", "text": "Helix Squadron was a starfighter squadron of the Galactic Empire that was active during the Galactic Civil War and participated in the attempted destruction of a convoy of refugees fleeing the Disaster. It was commanded by Captain Lindon Javes, prior to his defection to the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Helix Squadron was an Imperial TIE fighter squadron made up TIE pilots, that was led by Captain Lindon Javes around the time of the destruction of Alderaan. His second-in-command was Lieutenant Terisa Kerrill. The squadron reported to Commodore Rae Sloane."}, {"tag": "p", "text": "Helix Squadron was attached to Rae Sloane's fleet and their headquarters was the Imperial II-class Star Destroyer Vigilance. The Squadron usually equipped their starfighters with the Sigma-Nine loadout, but sometimes reverted to standard TIE/ln space superiority starfighters for certain missions, something Kerrill referred to as \"old school\". The Squadron also utilized the TIE Advanced v1, which Lindon Javes used at least once."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Fostar Haven"}, {"tag": "p", "text": "After the destruction of Alderaan, Darth Vader believed that Alderaanians incited rebellion and anarchy, and that survivors continued to spread dissent. He ordered the Imperial forces to find them and not rest until the destruction of Alderaan was complete."}, {"tag": "p", "text": "Commodore Rae Sloane received intelligence of a convoy of Alderaanian refugees was headed to Fostar Haven and ordered Captain Lindon Javes to draw them out and finish them off. Javes, in a TIE Advanced v1, led Helix Squadron in standard fit TIE fighters to Fostar Haven. They were accompanied by a group of Arquitens-class command cruisers, Gozanti-class cruisers, and Quasar Fire-class cruiser-carriers who formed a blockade to protect the rearguard from any escaping ships."}, {"tag": "p", "text": "Javes' ordered Helix to commence a patrol, scanning the various freighters and transports, that included BFF-1s and a GR-75 medium transport, which ranged from innocent traders to weapons and spice smugglers. This action upset Fostar Haven's Stationmaster and so he activated the station's defense turrets, attacking the TIE fighters. After destroying the defenses, a group of T-65B X-wing starfighters appeared from a tunnel and engaged the TIE fighters, taking some losses in the process."}, {"tag": "p", "text": "After defeating all the X-wings, Lieutenant Terisa Kerrill and her wing-mate found three GR-75 medium transports containing the Alderaanian refugees trying to escape through the same tunnel. As they tried to intercept the transports, Javes turned on his squad and disabled their TIEs with ion missiles. Now a traitor to the Empire, Javes helped the transports escape by destroying tunnel walls to prevent the two TIE pilots from catching up to him and the convoy. As the refugee transports left the tunnel, they were blocked from further escape by the Imperial II-class Star Destroyer Vigilance and four more Arquitens cruisers."}, {"tag": "p", "text": "Following a distress call to the Rebel Alliance, Echo Squadron arrived to assist the refugee convoy. Javes offered his support to the Alliance forces and defected. Then the rest of the Alliance fleet arrived to soften the Imperial blockade, and after the rebel ships disabled the tracking system on the Star Destroyer, they jumped to lightspeed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Helix Squadron first appeared in the prologue mission of the 2020 video game Star Wars: Squadrons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}