{"url": "Hella_Cordoni", "categories": ["Category:Legends articles", "Category:Chandrilans", "Category:Females", "Category:Humans", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Hella Cordoni"}, {"tag": "p", "text": "Hella Cordoni was a Human female trade delegate from the planet Chandrila. After the Trade Federation's attempted invasion of Naboo in 32 BBY she traveled to the planet with her family to try and negotiate a trade contract with the government there. Whilst on Naboo her son Pellum Cordoni however fell in love with the daughter of a rival trade delegate and ran away with her causing Hella to hire a group of spacers to find him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hella Cordoni prior to 32 BBY lived on the planet Chandrila in the Core Worlds where she worked as a trade delegate and raised a family including her son, Pellum Cordoni. In 32 BBY the Trade Federation lead by the Neimoidian Nute Gunray attempted to invade the Mid Rim planet of Naboo unsuccessfully, this still however caused considerable damage to the planet's government and population. Seeing a business opportunity she brought her entire family to Naboo where she planned to set up permanent residence and attempted to petition the recovering government for a trade agreement."}, {"tag": "p", "text": "Hella however was not the only trade delegate to seize the opportunity and she quickly became rivals with the Human trade master Van Kellen from Corellia who had also moved to Naboo with his family to petition for trade agreements. Both parties' rivalries however did not extent too their children and Pellum and Kellen's daughter Remi Kellen soon became romantically involved in secret. When Hella and Kellen found out about this relationship they were both outraged and placed great amounts of pressure on the pair to break up. This instead caused the pair too steal a landspeeder and flee together from their controlling parents. Hella and her rival then quickly hired a group of spacers visiting Naboo to find their lost children and return them."}, {"tag": "p", "text": "The spacers discovered the pair had fled to the city of Keren were they had purchased supplies to move into the Gungan swamps. The outfitter who had sold them said goods however was involved with a number of criminal organizations including a slaver ring that had captured the pair of lovers as they left the city. The spacers, ambushed by the slavers themselves set out to free the pair and complete their contract. Whether they were successful or not and returned Pellum to Hella is unknown."}, {"tag": "h2", "text": "Personality"}, {"tag": "p", "text": "Hella was an even tempered and cautious business woman but clearly placed huge importance on her work, moving her entire family to follow a business opportunity and becoming angry at her sons love for a rival instead of supporting him. As she paid for Pellum's rescue however she clearly did care for her family above her profit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hella Cordoni was created as part of the adventure idea \"young love... what a pain!\" which was included in the Star Wars Roleplaying Game supplement book Secrets of Naboo, published by Wizards of the Coast and written by Steve Miller and J.D. Wiker. The short story was included to give game masters ideas for their own story lines or to be expanded upon and used as the basis for a short adventure. Hella acted as the one of the possible starting points for the adventure who would give the players their mission as well as the individual who would presumably reward them for their success."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}