{"url": "Always_trust_Secret_Strategy_3", "categories": ["Category:Real-world articles", "Category:LEGO comics"], "nodes": [{"tag": "h1", "text": "Always trust Secret Strategy #3"}, {"tag": "p", "text": "\"Always trust Secret Strategy #3\" is the eighth in a series of comics on the LEGO Star Wars website. It is a follow-up to the story arc finished in the previous comic \"That's no Space Station\". The comic was first placed on the LEGO\nwebsite in early 2009 and added to StarWars.com on October 22, 2009."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"There's no naysaying when it comes to Anakin's schemes.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin Skywalker, Ahsoka Tano, and R2-D2 are traveling through hyperspace in the Twilight on a mission to find Asajj Ventress and get information about the Death Brick. Anakin has a plan, but Ahsoka is doubtful. Upon emergence from hyperspace, the Twilight is met by three MagnaGuard starfighters. Unfazed, Anakin sticks to what he calls \"Skywalker secret strategy #3\" and tells the starfighters that they are harmless. The droids apparently fall for the trick and let the Jedi continue under escort. Things soon change when the lead starfighter unveils a missile launcher. Skywalker gives Tano the controls and heads to the back of the ship, despite her protests. Ahsoka manages to avoid the missile but smashes into a MagnaGuard starfighter. Anakin then flies out of the Twilight in his own starfighter and shoots down one of the MagnaGuards. Ahsoka assists by destroying the remaining starfighter. Anakin remarks that they can get back to their mission, when Ahsoka replies by stating Ventress had already found them. In front of the two Jedi is a group of ten MagnaGuard starfighters with Asajj Ventress standing on top of the lead one, in space."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}