{"url": "Hellhound_Two", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:All Terrain Armored Transports", "Category:Galactic Empire walkers", "Category:Jakku locations"], "nodes": [{"tag": "h1", "text": "Hellhound Two"}, {"tag": "p", "text": "Hellhound Two, alternatively spelled Hellhound 2, was an All Terrain Armored Transport used by the Galactic Empire during the Battle of Jakku, the final battle of the Galactic Civil War. Almost three decades after the battle, the AT-AT served as the home of a young scavenger named Rey, who salvaged what supplies she could and lived inside of the walker, which lay on its side in the Goazon Badlands."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Hellhound Two was one of the Galactic Empire's quadruped All Terrain Armored Transport combat walkers. Like other AT-ATs, the vehicle had a grey hull and featured two chin-mounted heavy laser cannons and two temple-mounted medium blasters. The craft was operated by two pilots and a commander, and it could ferry multiple stormtroopers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Battle of Jakku"}, {"tag": "p", "text": "While in Imperial service, the AT-AT was designated \"Hellhound Two\", and formed part of the Hellhound attack force of the Imperial-class Star Destroyer, Interrogator. The walker was deployed to the desert planet of Jakku one year after the Battle of Endor, where it went into combat against the fledgling New Republic during the Battle of Jakku, the final battle of the Galactic Civil War. Its objective was to protect the Imperial research base."}, {"tag": "p", "text": "The walker was destroyed by New Republic A-wing pilot Odavia Anaru. Knocked out of the sky by a surface-to-air missile in the Goazon Badlands, Anaru was well behind enemy lines. Retreating to better cover, Anaru took a rocket launcher from a fallen trooper. Bracing the heavy weapon against a broken hull fragment, she took aim at the lead AT-AT assaulting New Republic commandos, and fired. Stormtroopers rushed her position, but Anaru didn't move, instead firing all six rockets at the AT-AT's weak points. While the walker crumbled, Odavia Anaru died in the effort, and was posthumously awarded the Medal of Valor."}, {"tag": "h3", "text": "Home of Rey"}, {"tag": "p", "text": "Twenty-nine years after the Empire's defeat on Jakku, the young scavenger named Rey had made a home for herself in the abandoned walker. Having stripped it of its valuable parts, Rey lived in the troop compartment of AT-AT, which simultaneously served as her kitchen, bedroom, and workroom. To defend against intruders, Rey had welded the walker's hatches shut, using its auxiliary hatch as an entrance. Salvaged fuel cells from the walker's laser-cannon energizer wired up to a TIE fighter's solar panel help power Rey's homemade generator. However, this required constance maintenance. She also removed the terrain sensors from the walker's feet and used them as an early motion warning system. The head with a cryptographic lock houses most of Rey's most valued items. When she became a target of the First Order for being seen with Finn at Niima Outpost, however, Rey had no other option than leave the AT-AT and Jakku behind to join the Resistance. With her long-time home now abandoned, the Hellhound Two was eventually claimed by competing scavengers of the desert world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hellhound Two first appeared in the 2015 film Star Wars: Episode VII The Force Awakens. It was originally painted in gray paint, but in the salt plains of Abu Dhabi where Jakku scenes were filmed, the set designers had to switch to a metallic paint so it was visible. A scale model of the homestead was also created."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}