{"url": "Helm_of_Dathka_Graush", "categories": ["Category:Legends articles", "Category:Headgear", "Category:Sith artifacts"], "nodes": [{"tag": "h1", "text": "Helm of Dathka Graush"}, {"tag": "p", "text": "The Helm of Dathka Graush was a Sith artifact, presumably created by the Sith Lord Dathka Graush. It amplified the wearer's abilities to wield the Force, and possibly strengthened the Sword of Ieldis. It also caused atmospheric disturbances within a radius of six kilometers."}, {"tag": "p", "text": "In 3963 BBY it was contained in the Jedi Covenant's secret storehouse on the planet Odryn. There it was undergoing inspection and extensive research at the orders of Haazen and Krynda Draay."}, {"tag": "p", "text": "Like all the artifacts stored on Odryn, the ill effects of its dark side contamination could be safely contained as long as the helm was encased in nullification resin. Grade three resin was required to protect the surrounding environment from the relic's power. When the helmet was removed from its resin case for analysis, the resulting weather disruptions caused apprehension among the superstitious Feeorin warriors guarding the compound."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Helm of Dathka Graush was first seen in Tales of the Jedi: Golden Age of the Sith, where a flashback showing the arrival of the Exiles on Korriban has a Sith lord being worshipped by members of his species. Since the helm from the Knights of the Old Republic comics is obviously based on this depiction, it is possible that the comic has assigned the initial picture as a depiction of Dathka Graush."}, {"tag": "p", "text": "However, in Book of Sith: Secrets from the Dark Side, it is revealed that the character depicted is actually Hakagram Graush, presumably Dathka's descendant.\nThis doesn't completely deny that the helm is the same depicted in both comics, since it could have been passed down from Dathka to Hakagram."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}