{"url": "Hem_Dazon", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Arcona", "Category:Males", "Category:Scouts"], "nodes": [{"tag": "h1", "text": "Hem Dazon"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Hem Dazon was a grouchy Arcona male scout who became stranded on the planet Tatooine after spending all his money on juri juice and salt. While on Tatooine, he spent time in Chalmun's Spaceport Cantina and was present when Jedi Obi-Wan Kenobi and his companion Luke Skywalker entered the establishment. The Arcona sat with fellow patrons Bom Vimdin, Arleil Schous, Pons Limbic, and Braconnor Bakiska."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hem Dazon was an Arcona scout who became stranded on the planet Tatooine after spending all his credits on juri juice and salt, preventing him from returning to his homeworld. After becoming stranded, he frequently spent time in Chalmun's Spaceport Cantina in the Mos Eisley spaceport. Shortly before the Battle of Yavin, in 0 BBY, Dazon sat at a table in one of the cantina's backrooms when the Jedi Obi-Wan Kenobi and the local moisture farmer Luke Skywalker entered the establishment with the droids C-3PO and R2-D2."}, {"tag": "p", "text": "The Arcona shared the table with four other patrons: the Advozse Bom Vimdin, the Defel Arleil Schous, the Siniteen Pons Limbic, and the Stennes Shifter Braconnor Bakiska. Dazon and his companions were still sitting at the table when Kenobi and Skywalker got into a fight with the ruffians Doctor Cornelius Evazan and Ponda Baba at the cantina's bar. Dazon was mentioned in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dazon was a grouchy Arcona male with brown skin. He particularly favored the variety of juri juice containing Rodian blood, even though it made his hands tremble and turned his eyes a putrid golden color. He spoke in Arconese."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Hem Dazon wore a brown jacket in the cantina."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hem Dazon first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. The alien was designed, built, and portrayed by makeup artist Laine Liska during a series of supplemental shots filmed for the cantina sequence on a sound stage in Dovington's Hollywood studio between January 24–25, 1977. Both Liska and creature designer Rick Baker drew concept art of the character. The character's \"costume\" consisted only of the head and neck, which was operated as a hand puppet. A silver flashlight in the back of the head made the character's eyes sparkle."}, {"tag": "p", "text": "On set, the character was known as \"T Head\" due to the shape of the puppet. A Lucasfilm Ltd. memorandum dated September 13, 1978 stated that the character's name was intended to be \"Thadd,\" although this was never used. The character instead became known as Hem Dazon, a name first used in the new Star Wars canon in the 2015 reference book Star Wars: Absolutely Everything You Need to Know. The name originated in the Star Wars Legends continuity, where it first appeared in the 1989 Mos Eisley Cantina Adventure Set, a miniatures supplement released by West End Games for Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}