{"url": "1MSE-KUP24", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Courier droids", "Category:Manumitted droids", "Category:Pyke Syndicate slaves"], "nodes": [{"tag": "h1", "text": "1MSE-KUP24"}, {"tag": "p", "text": "1MSE-KUP24 was a KUP24 messenger droid that was forced to work in the criminal Pyke Syndicate's spices mines on the planet Kessel during the reign of the Galactic Empire. In 10 BBY, 1MSE-KUP24 was present in the mines' control room when it was taken over by a group of criminals who started a revolution against the Pykes."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "1MSE-KUP24 was the designation of a KUP24 messenger droid that was one of many droids forced to work in the spice mines controlled by the criminal Pyke Syndicate on the planet Kessel during the reign of the Galactic Empire. In 10 BBY, the messenger droid was present in the mines' control center while a group of Crimson Dawn–affiliated criminals disguised as slavers met there with Pyke Administrator Quay Tolsite in an attempt to steal a shipment of coaxium."}, {"tag": "p", "text": "During the meeting, the criminal Qi'ra killed Tolsite while her accomplice Tobias Beckett shot each of the Pyke sentinels and Mining Guild supervisors present in the room. With the room now under the infiltrators' control, the criminal droid L3-37 removed the restraining bolt from the enslaved droid DD-BD, who in turn began removing the restraining bolts from the other droids in the room. 1MSE-KUP24 whizzed around the floor of the control room as the droids were freed, after which the droids and the organic slaves rose up against the Pykes, creating a distraction that allowed the criminals to escape with the coaxium."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "1MSE-KUP24 had gray and black plating with orange detailing and a black sensor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "1MSE-KUP24 first appeared in the 2018 Anthology film, Solo: A Star Wars Story. The droid was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}