{"url": "Hemi", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance Fleet personnel", "Category:Males", "Category:Mon Calamari"], "nodes": [{"tag": "h1", "text": "Hemi"}, {"tag": "p", "text": "Hemi was a Mon Calamari male who served in the Alliance to Restore the Republic aboard the MC80A Home One Type Heavy Star Cruiser Republic, under General Jan Dodonna. He was killed during the Assault on the Mako-Ta Space Docks when the starship was destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hemi served under General Jan Dodanna on the MC80A Home One Type Heavy Star Cruiser Republic. During the Assault on the Mako-Ta Space Docks, Dodanna ordered Hemi to use all the firepower they had on the Executor. Hemi reported to Dodanna that the star destroyers were converging on them. General Dodanna was satisfied that the star destroyers had taken his bait. When the starships were able to get back and running, Hemi was at Jan Dodanna's side when he ordered the fleet to scatter. The Republic was taking heavy damage when Hemi reported that while all the remaining cruisers were online, their engines were too damaged for them to go anywhere. Dodanna thanked Hemi for his service and told him they would guard the rear. Shortly after, Hemi reported that all the cruisers were ready to which General Dodanna ordered them all to leave. On the Executor, an it was reported to Darth Vader that only one of the cruisers remained. Darth Vader said it would only be momentarily. Back on the Republic, Hemi told General Jan Dodanna that the Alliance Fleet had escaped but their shields were failing. The general sat back in his chair and said he was proud of everyone he fought with. The Republic was destroyed killing both Dodanna and Hemi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hemi appearance in Star Wars 55, part of the Hope Dies story arc. Star Wars 55 was written by Kieron Gillen and illustrated by Salvador Larroca. The comic was published on October 3, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}