{"url": "Hench_Sina", "categories": ["Category:Canon articles", "Category:Aqualish", "Category:Grav-ball players", "Category:Males"], "nodes": [{"tag": "h1", "text": "Hench Sina"}, {"tag": "p", "text": "Hench Sina was a male Aqualish who played fullback for the Junior Academy of Applied Sciences' grav-ball team, the AppSci SaberCats. During a match against the Mavericks, Sina, with the help of Zare Leonis and Frid Kelio, broke Ames Bunkle's school records for carries and meters gained in a single game. Shortly before the championship match of the season, Athletic Director Janus Fhurek transferred Sina and Kelio to the Technical Institute for Agricultural Research due to his anti-alien bias. As a result, the two nonhumans were unable to compete in the final championship."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hench Sina was a student at the Junior Academy of Applied Sciences in Lothal's Capital City during the Age of the Empire. He served as the weakside fullback in the school's grav-ball team, the AppSci SaberCats. Along with Frid Kelio, Hench was one of the only two alien players in the SaberCats. Hench had a good relationship with Zare Leonis, the team's center-striker who had recently migrated to Lothal. Leonis was an effective and well-liked leader who guided the SaberCats to victory against other school teams."}, {"tag": "p", "text": "Hench played in several games during the grav-ball season. During a match against the West Cap City Carvers, Zare pressed the ball into Hench's hands before sending the brawny Aqualish forwards into the Carvers. Despite an exhausting match, Leonis' tactics broke the deadlock and allowed the SaberCats to win the match by 38 points against the Carvers' 36 points. During a later match against the East City Brawlers, Hench dropped the ball on a carry, forcing Leonis to scramble after it. The SaberCats struggled during this match and Hench was stiff-armed by a Brawler player."}, {"tag": "p", "text": "Hench and his fellow SaberCats had more success during a match against the Thrashers; scoring 44 points to the opposing team's 18. During a winter match against the South Capital City Volunteers, Hench broke a hole in the opposing team's defenses which allowed his fellow fullback Beck Ollet to break farther right and go up the sidelines. The SaberCats won that match by twelve points. Following the match, Leonis credited Hench's performance for their victory. However, the Junior AppSci's xenophobic athletic director Janus Fhurek only twisted his face when he saw Hench."}, {"tag": "p", "text": "Later that season, Fhurek attempted to get Leonis to remove Hench and Frio from the SaberCats on the grounds that their alien physiognomies gave them an unfair advantage. However, Leonis refused to comply and kept Hench and Frid for the rest of the grav-ball season. During a title match against the Mavericks, Hench Sina, with the help of Leonis Frid Kelio, broke the Junior AppSci alumni Ames Bunkle's school records for carries and meters gained in a single game. Despite the SaberCats' victory, Fhurek retaliated against Leonis by transferring Hench and Frid to the Technical Institute for Agricultural Research due to his anti-alien bias. As a result, the two nonhumans were unable to compete in the final championship."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hench Sina's brawny built led him to serve as a fullback in the AppSci SaberCats. Despite his limited talent as a grav-ball player, Leonis regarded him as a reliable player who would do his job regardless of the score, the referees, or other mitigating factors. By contrast, the school's xenophobic athletic director Fhurek regarded him as amounting to little more than a \"brute-force\" fullback who lacked tactical intelligence. However, Hench made up for this flaw by his willingness to work in a team."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}