{"url": "Hepsalum_Tash", "categories": ["Category:Legends articles", "Category:Outer Rim Territories species", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Hepsalum Tash"}, {"tag": "p", "text": "Hepsalum Tash, known collectively as \"the Tash\" were a sentient species native to the Dagobah system. Worm-like in appearance, they were a simple folk, valuing peace, stories, and musical entertainment. They had a cumbersome appearance, and were skilled craftsmen, able to fashion utensils and musical instruments. The Tash, however, were reclusive by nature."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Hepsalum Tash were a species of forest giants, who upon reaching adulthood, could grow to 8 meters in height or more. Their skin was tough and leathery, and would hang in folds off their thick limbs. Its coloration would vary from a pale yellow ochre to a deep sienna red-brown. Sexual dimorphism was apparent in the Hepsalum Tash, with tiger-stripe marks and spotting indicating gender. Those features could also be used to distinguish age. The Hepsalum Tash also featured long, flexible necks, which ended in a flat, broad, and whiskered face. As a result, their heads and necks had a worm-like appearance, which was considered \"curious.\" Their right hand was more claw-like in nature, and could be used to forage for roots and ground nuts, which were an important element of their vegetarian diets. Their left hands were more humanoid in nature, however."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Hepsalum Tash hailed from the Dagobah system, and resided on the planet of Dagobah. They were collectively known as \"the Tash,\" and were a simple people, who valued peace. The Tash were reclusive by nature, and the impenetrable thicket of Dagobah's surface was ideal for them. Their cumbersome appearance belied their abilities as craftsmen of skill. The Tash fashioned utensils, clothing, and musical instruments. They derived great enjoyment from listening to stories, songs, and from smoking pipes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hepsalum Tash were created by Andrew Foley, a 25-year-old Star Wars fan, through the \"Design An Alien\" competition held by Star Wars Galaxy magazine. The competition, which was launched in Star Wars Galaxy Magazine 3 (1995), called for fans to create entirely new alien species inspired and influenced by the original trilogy of Star Wars films. Although Foley's entry was not included with the winners in Star Wars Galaxy Magazine 7 (1996), it was published in Star Wars Galaxy Magazine 8 (1996), under the \"honorable mentions\" category. Holocron continuity database keeper Leland Chee later stated that the published \"Design an Alien\" material was considered canon. Despite this, the Hepsalum Tash has not been referenced in any other Star Wars material."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}