{"url": "Hera%27s_Heroes", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Hera's Heroes"}, {"tag": "p", "text": "\"Hera's Heroes\" is the fifth episode of the animated television series Star Wars Rebels' third season. It is the forty-second episode of the series overall. It was aired on October 15, 2016 on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "When the Empire occupies Hera's home, she decides to personally recover a family heirloom. But a new Imperial commander named Grand Admiral Thrawn is waiting."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Rendezvous"}, {"tag": "p", "text": "On the plains of Ryloth, the Ryloth rebels Cham Syndulla and Numa are riding blurrgs while being pursued by scout troopers on 614-AvA speeder bikes and an Imperial Troop Transport. When Numa asks how did the Galactic Empire find them, Cham replies that the Empire is getting better at anticipating their moves. Numa throws a grenade which destroys two of the speeder bikes and their riders are thrown to the ground. Cham tells Numa that they are heading for a pick-up with his daughter Hera Syndulla, the captain of the Ghost."}, {"tag": "p", "text": "Numa's blurrg is hit by a laser blast but continues running. The scout trooper tries to shoot her but Cham uses his blurrg to knock him aside. Numa's blurrg grabs the forward laser cannons of another speeder bike and yanks the rider aside. The two Twi'leks and their steeds approach a cliff. At that point, Hera contacts Cham to tell them that they are closing in on their position. Cham tells them that they are running out of time to land. In the Ghost's cockpit, Hera replies that she is not landing and tells Cham and Numa to turn around and head south. Kanan Jarrus and Gobi Glie appear behind Hera."}, {"tag": "p", "text": "Numa is skeptical of Hera's idea but joins Cham in turning their steeds around and heading south. The Ghost strafed the Troop Transport and the remaining speeder bike; knocking the former out. Cham and Numa leap over the burning transport and follow the Ghost. The surviving scout trooper pursues them on his speeder bike. Hera lowers the forward ramp of the Ghost and Cham and Numa ride their blurrgs aboard the ship. However, the surviving scout trooper follows them into the cargo bay only to be confronted by the gun-wielding Numa, Zeb, and Cham. After taunting the scout trooper, Garazeb Orrelios knocks him out and allows Ezra to keep his armor."}, {"tag": "h3", "text": "Family reunion"}, {"tag": "p", "text": "The Ghost flies into Ryloth's horizon. Cham hugs Hera and tells her that she arrived just in time to make the supply run. Hera explains that it was tricky getting through the Imperial blockade around Ryloth. Cham tells his daughter that the situation on Ryloth has worsened and that the Empire is now occupying the Tann Province. The Spectres including Ezra and Chopper are watching the conversation. When Ezra asks, Kanan explains that Tann province is Hera's home."}, {"tag": "p", "text": "Cham explains that he underestimated the new Imperial commander; previous attacks were clumsy but the new commander's attacks were swift and precise. He tells Hera that the new Imperial commander has made the Syndulla residence his new headquarters. Cham regrets not being able to save anything including the Kalikori. When Ezra asks, Numa explains that it is a valuable Twi'lek heirloom. Hera vows to recover the Kalikori because it belonged to her late mother. After Hera explains that successive generations add objects to the device, Sabine surmises that the Kalikori is living art."}, {"tag": "p", "text": "Hera is initially reluctant to involve her father in the recovery mission but relents when Cham, Numa, Globie, and the other Spectres volunteer. Cham then proceeds to brief Hera about Captain Slavin's advances. While planning the mission, Hera tells Chopper that he will accompany her to Syndulla house while the others stage a diversionary attack in the nearby Tulara Ravine to draw the Empire away. Cham is skeptical their mission will succeed since his forces in the Tann province have been decimated. However, Ezra volunteers to enter the base disguised as a scout trooper."}, {"tag": "h3", "text": "Homeward Bound"}, {"tag": "p", "text": "Putting their plans into action, the Lothal and Ryloth Rebels ambush an Imperial patrol led by an AT-DP walker and an Imperial Troop Transport at Tulara Ravine. Cham, Gobi, and Numa charge on their blurrg steeds while Sabine blows up the two vehicles. Kanan and Zeb then join the attack. As more Imperials approach, Ezra and Hera take the speeder bike to Syndulla House, which lies inside a Twi'lek city. Ezra manages to gain access by posing as a scout trooper who has captured a Twi'lek insurgent. They rendezvous with a disguised Chopper outside the Syndulla household."}, {"tag": "p", "text": "Chopper is mesmerised by the wreck of a Y-wing starfighter which had crashed outside the Syndulla house during the Clone Wars. Hera explains to Ezra that her father had left the ship as a memorial and that Chopper still has issues with it due to it being the starfighter that Hera pulled Chopper out of. As the rebels enter Syndulla's home, they make their way to Cham's office. There, Ezra inspects a portrait of the Syndulla family and sees Hera's mother for the first time. Hera finds the Kalikori inside a drawer. Having accomplished their mission, the two try to sneak out."}, {"tag": "p", "text": "While hiding behind wall separaters, Hera and Ezra witness Captain Slavin, the blue-skinned Grand Admiral Thrawn, and two stormtroopers enter through the front door. After ordering his stormtroopers to stand guard, Slavin tells Thrawn about the recent rebel attack at Tulara Ravine. Despite having increased operations, Slavin ponders why the rebels are attacking far from here. Thrawn senses movement behind the wall separaters and surmises that the rebels are closer than Slavin thinks."}, {"tag": "p", "text": "When Ezra asks who is the \"blue guy\", Hera admits she does not know. Hera then suggests that they use a secret entrance in the basement to escape. They enter the basement only to discover that the Imperials have converted it into a command center. Later, they encounter Chopper and Hera tells him that she is glad to see him because they need help to get out."}, {"tag": "h3", "text": "Confronting Thrawn"}, {"tag": "p", "text": "Meanwhile, Cham, Gobi, and Numa and the other Spectres think they have lost their pursuers. Cham is confident that they know the land better. However, they are ambushed by another AT-DP walker. While fleeing, Sabine's blurrg is gunned down. Kanan and Sabine stand and fight and are joined by Cham. Cham tells Gobi to get the rocket launcher. Gobi uses the launcher to dislodge rocks from a ravine, creating an obstacle for the Imperials. Despite their efforts, the walker blasts through effortlessly. Cham says they have gotten no contact from Hera and deduces that something has gone wrong. The rebels and their remaining blurrgs then retreat."}, {"tag": "p", "text": "Back at Syndulla house, Hera and Ezra decide to escape through the front door but find it guarded by two stormtroopers. They use Chopper to stage a diversion and the droid tries to talk to the stormtroopers in Binary; which they don't understand. While Ezra covers for Hera, she approaches the front door only to run straight into Slavin and Thrawn. Slavin mistakes her for a servant and warns her that she is not permitted outside the kitchen. Hera attempts to move away but Thrawn decides that he wants to speak to her. Thrawn orders the stormtroopers entries including Ezra to detain Hera."}, {"tag": "p", "text": "Thrawn takes an interest in the Kalikori and asks Hera for her view on the Imperial occupation of Ryloth. Pretending to be a servant, Hera claims that she can't help but Thrawn begs to differ. He orders his men to take her to his office. Chopper watches as Hera is led away by the Imperials including a disguised Ezra. Inside Thrawn's office, Hera pretends to be an impoverished servant who wanted to sell the Kalikori to buy food for her family. Slavin wants to punish the servant for stealing Imperial property. Thrawn inspects the Kalikori and deduces that their prisoner was far more valuable than the Captain realized."}, {"tag": "p", "text": "Thrawn explains that to defeat an enemy you must know them; not only their battle tactics but also their history, philopshy, and art. He then asks Slavin a second time if he understands the significance of the Kalikori. When Slavin dismisses the Kalikori as a primitive trinket, Thrawn corrects him by pointing out that the Kalikori is a priceless family heirloom that is important to Twi'lek families. Thrawn then asks Hera why she stole it and observes that she has only known war her entire life. Thrawn explains that he has devoted himself to studying the art of war and surmises that Hera's entire life has been forged by war."}, {"tag": "p", "text": "When Slavin disparages Hera as a mere servant, Hera speaks up and remarks that it doesn't matter where her people come from but that her people will not give up their will to be free. Slavin is about to chastise her when Thrawn scolds him for embarrassing himself. Thrawn reveals that the Twi'lek servant is none other than the rebel freedom fighter Hera Syndulla, the daughter of the rebel leader Cham Syndulla. Ezra tries to make a move but Thrawn stuns him with his blaster. When Slavin asked Thrawn how he knew, Thrawn points out that the rebels always have friends around them. Thrawn then tells Hera that her rescue plan has been thwarted."}, {"tag": "p", "text": "Hera drags the unconscious Ezra to a cell and a stormtrooper knocks her to the ground. Thrawn meets with Hera in her cell while still holding the Kalikori. He tells Hera that he regrets that this would be their last meeting but promises to keep her Kalikori in a place of honor. Hera regrets not destroying the Kalikori since she does not want an enemy gaining possession of a priceless heirloom. Thrawn retorts by asking Hera if her history is worth so little to her. When Slavin interjects, Thrawn apologises for his comrade's behavior and thanks Hera for her hospitality."}, {"tag": "h3", "text": "Hera's escape plan"}, {"tag": "p", "text": "After leaving the cell, Thrawn orders Slavin to deliver the Kalikori to his ship. When Slavin suggests destroying the object, Thrawn momentarily loses his temper and grabs Slavin by the collar before apologizing to him. Thrawn laments that Slavin does not appreciate art and then departs for an \"experiment\" that requires his attendance. Before leaving, he leaves Slavin to finish the job. Back in the cell, Ezra awakes and Hera tends to him."}, {"tag": "p", "text": "In the Tulara Ravine, the Ryloth and Spectres are locked in battle against an AT-DP walker. Suddenly, the walker stops firing and Captain Slavin uses a holocaster to offer Cham a deal. He offers to release Hera and Ezra if Cham agrees to surrender himself to the Empire. If Cham refuses, Slavin threatens to execute the prisoners by firing squad at dawn. Gobi tries to talk Cham out of surrendering due to his importance to the Ryloth resistance. However, Cham is willing to sacrifice himself to save his daughter and describes her as a worthy successor."}, {"tag": "p", "text": "Back at the cell, Hera apologizes to Ezra for embarking on a personal mission and endangering their lives. Ezra reassures her that they would be willing to do the same for her. Hera admits that she underestimated the admiral. Chopper then enters the cell to inform Hera and Ezra that Cham is surrendering himself to the Empire to free them. When Ezra suggests escaping, Hera counsels against it because there are too many guards. Instead, Hera sends Chopper to raid the Imperial armory for explosives. When Ezra asks if she is going to destroy the Syndulla family home, Hera responds that her crew are her home and family now."}, {"tag": "h3", "text": "The prisoner exchange"}, {"tag": "p", "text": "Following Hera's orders, Chopper ventures into the command room where he discovers that Captain Slavin has positioned cannons around the hangar in order to trap the Ghost. Slavin plans to use the exchange as an opportunity to trap the rebels. Chopper then pillages the armory. Later, Slaving enters Hera's cell and tells her that it is time to say goodbye to her father. Meanwhile, Thrawn watches the impending exchange from the safety of his Arquitens-class command cruiser. He is interested in watching how Cham will respond to this test."}, {"tag": "p", "text": "The Ghost travels to the Syndulla home. Captain Slavin has Hera and Ezra brought out for the exchange. Sabine lands the Ghost in the hangar. Cham and Kanan step out of the forward ramp to facilitate the exchange. When Slavin orders Cham to surrender, Cham reminds him to honor his promise to release his daughter and Ezra. Slavin agrees to make a simultaneous exchange. Meanwhile, Chopper finishes planting the explosives and races out through the door just in time to join Hera and Ezra. When Hera meets Cham, she apologizes but he tells her that it is alright because he has been captured before."}, {"tag": "p", "text": "Hera quickly reveals her plan to blow up Syndulla house in order to stage an escape before ordering Chopper to trigger the explosives. The explosives send a fiery wave through the house that knocks the stormtroopers to the ground. From above, Thrawn watches the explosion. The rebels then flee aboard the Ghost while Slavin orders his men to stop them. Kanan uses the Force to deflect a rocket back at an AT-DP walker, toppling the machine. Despite being blinded, Kanan waves goodbye to a humiliated Slavin."}, {"tag": "p", "text": "The Ghost then flies into the air where Thrawn's light cruiser is lying in wait. The gunnery officer asks the Grand Admiral whether he should give the command to fire. However, Thrawn replies that the rebels have gained their victory. When a wounded Slavin reports that the rebels are getting away, Thrawn counsels him not to worry because he found this \"experiment\" enlightening."}, {"tag": "h3", "text": "Home and family"}, {"tag": "p", "text": "The Ghost lands on the plains of Ryloth. Cham meets in private with Kanan and Hera. He surmises that she should not have underestimated his daughter. Both father and daughter hope that the Empire will continue to underestimate them. When Kanan apologizes for not being able to recover the Kalikori, Hera replies that she doesn't need an heirloom to honor her mother's memory because she already has Kanan, her father, and the Spectres. In the background, Zeb grabs and hugs Ezra while Chopper and Sabine watch."}, {"tag": "h2", "text": "Cast"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}