{"url": "Herat", "categories": ["Category:Legends articles", "Category:Desilijic servants", "Category:Females", "Category:Jawas", "Category:Religious workers", "Category:Shamans"], "nodes": [{"tag": "h1", "text": "Herat"}, {"tag": "p", "text": "Herat was a female Jawa who was the shaman of Wittin's tribe. She was Wittin's advisor during his negotiations with Jabba the Hutt, and agreed to serve as one of Jabba's retainers as long as he helped Wittin. When Luke Skywalker arrived at Jabba's Palace, Herat was present and was retaining the Frog-dog, Buboicullaar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After Jabba's death, Herat and her tribe were freed from servitude, and roamed the deserts of Tatooine for many years. When they discovered Kitster Chanchani Banai in the deep desert, Herat agreed to transport him to Anchorhead. The tribe was struck by two almost simultaneous attacks, one by an Imperial search party that was looking for the Killik Twilight moss painting, and then by a group of Sand people. Many of the tribe were killed, but Herat and Kitster managed to survive. Kitster was taken by the Sand people, and Herat was left for dead. She agreed to help Leia Organa Solo and her husband, Han Solo, locate Kitster and the moss-painting before the Imperials could, since her hatred of the Imperials had grown immeasurably after their attack. However, she was badly injured by in the attacks, and was forced to negotiate in return for treatment of her broken leg. She later came to understand the Solos' need to recover the painting, and agreed to let herself be \"hijacked\" in order to draw off Imperial pursuit. With the Solos' help, Herat got her sandcrawler working again, then locked herself in a toolbox while the sandcrawler was put in gear. The stormtroopers pursuing them took the bait, and believed Herat's story of being captured and locked up after the Solos stole her cargo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "After Wicket, Bib Fortuna, and Ortugg, Herat is perhaps the most minor of characters to appear on a Star Wars movie poster. She was played by Andy Herd."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}