{"url": "Herglic", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cetacean sentient species", "Category:Herglics"], "nodes": [{"tag": "h1", "text": "Herglic"}, {"tag": "p", "text": "The Herglics were a species of sentient, hulking aliens with black skin, a wide mouth, oily eyes, and a blowhole. Due to mistreatment by the Galactic Empire, many took refuge on Level 1782, on Coruscant, where one rescued Anandra Milon from a stormtrooper. The Herglic Qensog provided Rebel Alliance fugitives with coordinates to the rebel vessel Home One."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Herglics were a sentient species, with dark, slick skin, and oily eyes. They had a large head with no neck or chin and a wide mouth with tiny, serrated teeth. Herglics also had cartilaginous shoulders and a blowhole on their heads."}, {"tag": "h2", "text": "Herglics in the galaxy"}, {"tag": "p", "text": "With the advent of Sheev Palpatine's Galactic Empire, the Herglic race became the object of mistreatments from the new regime. On Coruscant, capital world of the Empire, some Herglics had found shelter along many other non-humans in the immense junkyard called Level 1782. A Herglic was captured by Trandoshan slavers and sold to the Xonti Brothers to be trained as a gladiator. The Herglic died during training."}, {"tag": "p", "text": "Shortly after the destruction of the planet Alderaan in 0 BBY, a Herglic criminal killed a stormtrooper in order to rescue Anandra Milon on Level 1997, suggesting the fugitive might find shelter on Level 1782. The Herglic Qensog was a contact of the informant Bodo Linx and provided a number of the Rebel Alliance fugitives with coordinates leading them to the MC80a Star Cruiser Home One in the Kaliida Nebula. In 4 ABY, the Herglic Gor-kooda worked for the Sullustan crime lord Surat Nuat and his gang on Akiva. He accompanied his employer to a shop in search of the stolen objects. After eventually capturing the owner, Temmin Wexley, the Herglic brought him to Nuat, but when taking him to a cistern, they were attacked by Sinjir Rath Velus and Jas Emari, who escaped with the boy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}