{"url": "Herglic/Legends", "categories": ["Category:Legends articles", "Category:Cetacean sentient species", "Category:Colonies species", "Category:Herglics", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Herglic"}, {"tag": "p", "text": "The Herglics were a species native to the planet Giju. They were water-based mammals and developed hyperdrive and a trade-based empire in the Colonies Region before encountering the Duros. Herglics were pleasant and peaceful, but they had an addiction to gambling and games of chance. Herglics were a very large species and were sensitive about their size."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Herglics were large bipeds that appeared to have evolved from water-dwelling mammals. Most of the evidence of their waterborne ancestry had been bred out so that, for example, fins and flukes were replaced with arms and legs. They did, however, still breathe through a blowhole on the top of their heads. The hauum sound of a Herglic clearing their blowhole was a common Herglese word throughout the Tapani sector, where it was used with emphasis to preface a significant remark."}, {"tag": "p", "text": "They were tall and extremely wide, and had smooth, hairless skin that ranged in color from pale blue to black although some, like Hamar-Chaktak, had pale pink skin. A few Herglics, such as the entrepreneur and gambler Narloch, displayed white stripes down the sides of their head and arms."}, {"tag": "p", "text": "Herglics were generally quite sensitive about their large size. Since most other sentient species in the galaxy were smaller than they were and most facilities were designed to accommodate Human dimensions, Herglics tended to feel somewhat self-conscious and out of place when removed from their community or their ships. Their bulky size meant that typically a Herglic would take up two seats in a restaurant, and the majority of doorways required some maneuvering. Despite this they were typically easygoing and enjoyed meeting new people and visiting exotic locations."}, {"tag": "h2", "text": "Culture and history"}, {"tag": "p", "text": "The Herglics of Giju were a technologically advanced race early in galactic history, reaching the stars of neighboring systems and beginning colonization in about the same time period as the Corellians reached theirs. There was some archaeological evidence that an early Herglic trading Empire achieved a superior level of technology that was not paralleled during the time of the Galactic Empire. Ruins were found on some Herglic colony worlds that contained nonfunctioning machines that appeared to harness gravity to perform an unfathomed function. This early Empire, however, collapsed a millennium before the Herglics made contact with the wider galaxy, and most records were lost."}, {"tag": "p", "text": "The Herglics were natural explorers and traders. During the early days of the Galactic Republic, the angular freighters characteristic of Herglic trading vessels became a common sight throughout the galaxy, but contact with the Republic remained minimal. They had an inquisitive but practical nature and calm persona that helped them interact with other species and made them a welcome member of the Galactic community. The Herglic Trade Empire joined the Galactic Republic in 13,000 BBY, and Herglic hyperspace scouts were instrumental in the establishment of the Rimma Trade Route in 5500 BBY. Jedi Master Bowspritz explained that the Herglics were also employed for the import and export of contracts by the Jedi Temple of Coruscant at some time in Republic history."}, {"tag": "p", "text": "With the rise of the Galactic Empire, Giju's manufacturing centers were among the first to be nationalized by the Emperor's New Order. The normally docile Herglics tried to fight the subjugators, but after significant slaughter and realizing that their resistance was in vain, they decided to be pragmatic and submit totally to the will of the Emperor. Fortunately they stopped resisting and surrendered before the destruction of Giju's infrastructure. During the Galactic Civil War, a number of Herglics purchased their way into the Tapani nobility when House Cadriaan began selling titles to nonhumans."}, {"tag": "h2", "text": "Herglic in the galaxy"}, {"tag": "p", "text": "The area of space around the portion of the Rimma Trade Route cutting through the Colonies and containing Giju was usually referred to as Herglic Space, and was the center of Herglic culture. The region was built around an ancient hyperlane known as the Hidakai Pool, which was established after the Herglics joined the Galactic Republic in 13,000 BBY. Through this, the Herglics expanded their reach to other planets, and because of the Herglic Trade Empire's legacy, hundreds of star systems along the Hidakai Pool and its expansion, the Rimma Trade Route, had substantial Herglic populations. Abregado-rae, also located along the Pool and the Rimma Trade Route coreward from Giju, sported a numerically small but important minority of this species, including Shelov, founder of the planet's Tundei government. Herglics resided also on the planet Sukkult, rimward of Giju. Many of the Herglic colonies beyond Giju maintained a lively trade relationship with the Gran. Some members of the Herglic species were used as slaves on the Sith world Ziost."}, {"tag": "p", "text": "Due to the proximity of Herglic Space to the Tapani sector, many Herglics settled on planets within the sector. Every larger metropolis in the sector had its own Herglictown, with members of the species constituting up to 11% of the population on Fondor. On one single planet, Lamuir IV in the Freeworlds Territory, the Herglics were the dominant species and controlled the political agenda of the planet through a democratically elected government. The planet Tallaan, on the nexus of the Giju Run and the Shapani Bypass, sported a large Herglic minority concentrated in the neighborhood of Soun-Giju or Little Giju. The Herglic of Lamuir were thought to differ from their Tallaan counterparts in that they adapted to coexistence with their Human counterparts, while the latter mostly consisted of Giju natives."}, {"tag": "p", "text": "The planet Tresidiss, a gamblers' world located in the Quence sector, was privately owned and run by Herglic criminal groups affiliated with the Hutt clans. A large Herglic minority counting in the millions was reported at Emmer in the Nilgaard sector, and the influence of the species was noted also at the sector capital, Reaper's World, where casinos were owned by Herglics. A very large Herglic community existed on Esseles, located in the Core Worlds region along the Perlemian Trade Route, where 8% of the 24 billion residents were members of this species, sharing the land with baseline Esselian Humans and a Bothan minority."}, {"tag": "p", "text": "Herglics living away from their homeworld tended to cluster in their own communities mainly because their bulky size required them to build larger scale accommodation than was typical across the wider galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A population of Herglics is referred to as a pod community (\"pakk\") and family members are prefixed by pod. In this way the Herglic are further likened to Cetacea (whales, dolphins and porpoises)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}