{"url": "Herian_I%27ngre", "categories": ["Category:Legends articles", "Category:Bith", "Category:Females", "Category:Force ghosts", "Category:Pilots", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Herian I'ngre"}, {"tag": "p", "text": "Herian I'ngre was a female Bith starfighter pilot who flew X-wings with Rogue Squadron during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "I'ngre served as a member of the elite starfighter unit after the Battle of Endor. As a Bith, she went against her species' noted pacifistic tendencies to join the Rebellion, specifically due to the species diversity of the organization compared to the Humanocentric chauvinism of the Galactic Empire. Due to her species characteristic short-sightedness, Herian wore corrective flight goggles while flying."}, {"tag": "p", "text": "She joined the Squadron in time for the mission to Eiattu 6. In an odd occurrence Herian spent all of her fighting on the ground instead of in an X-wing, as did most of the Rogues fighting the forces of Moff Leonia Tavira. She was captured along with several of her comrades, but was rescued thanks to the efforts of Nrin Vakil."}, {"tag": "p", "text": "Herian's second mission with Rogue Squadron took her to Malrev IV in an effort to rescue the Bothan Starfaring. Upon arriving on the planet the Rogues were attacked by TIE fighters piloted by primitive Irrukiine, who were under the control of Cartariun's Sith magic."}, {"tag": "p", "text": "That proved to be Herian's only true fighter engagement with the squadron, as she was gravely wounded the next day during a ground battle with Carturian's forces. She suffered brain damage, and the goggles she used to fly were destroyed, grounding her."}, {"tag": "p", "text": "But when her squadron was in danger of being swamped by the enemy Herian stole Feylis Ardele's damaged fighter and, with Dllr Nep's guidance, flew the ship into the Sith temple responsible for the carnage on the planet. Herian and Dllr sacrificed themselves to destroy the temple and save the lives of their fellow pilots."}, {"tag": "p", "text": "Herian was known to possess an interest in music, often discussing the techniques of different bands with Dllr, the Squadron's other music fan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}