{"url": "Alysun_Celz", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Fallen Jedi", "Category:Females", "Category:Humans", "Category:Pilots", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Alysun Celz"}, {"tag": "p", "text": "Alysun Celz was a Human female Jedi Knight who served the Jedi Order during the final decades of the Galactic Republic. In 25 BBY, Celz fell to the dark side and began committing crimes. She attempted to persuade her fellow Jedi Et Rex to join her; after his refusal, the Dark Jedi framed and arrested him for the crimes. As they were en route to the Jedi Council so that Rex could stand trial, their cruiser, the Radiant IX, crashed on the Poison Moon asteroid in the Hoth system. Celz murdered the ship's crew, while Rex escaped to the asteroid's surface. When Jedi Knight Obi-Wan Kenobi and his Padawan, Anakin Skywalker, investigated the crash, Celz gave them false information about Rex and insisted that he killed the ship's crew. She stayed aboard the ship with Skywalker as Kenobi searched for Rex, and eventually began torturing Skywalker with Force lightning. Celz was attacked by Kenobi and Rex, who had revealed the truth about the Dark Jedi. She was successfully incapacitated by Rex and was brought to Coruscant by the three Jedi to stand trial."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Alysun Celz, a Human female, was born during the final decades of the Galactic Republic. She was instructed in the ways of the Force by the Jedi Order, eventually rising to the rank of Jedi Knight. During that time, she befriended fellow Jedi Et Rex. However, in 25 BBY, Celz succumbed to the dark side of the Force and began to commit various crimes. When Celz invited Rex to join her, he refused, and she subsequently framed her former friend. The Dark Jedi took Rex prisoner and attempted to bring him to the Jedi High Council on the galactic capital, Coruscant, piloting the Consular-class cruiser Radiant IX. En route to Coruscant, the starship's power couplings failed due to a flock of mynocks, forcing Celz to crash on the surface of the asteroid Poison Moon, which was located in the Hoth system's asteroid field. Celz proceeded to kill the crew with Force lightning, although Rex escaped to the surface."}, {"tag": "p", "text": "When the Radiant IX failed to reach the Temple, the High Council dispatched Jedi Knight Obi-Wan Kenobi and his Padawan, Anakin Skywalker, to find and detain Rex. As they searched the cruiser for signs of life, Celz attacked the two Jedi with a blaster; however, they disarmed her and questioned her involvement with the deaths of the crew. She deceived Kenobi by affirming that Rex slew the Radiant IX's crew, and she was left with Skywalker while Kenobi went out on the asteroid's surface to search for Rex."}, {"tag": "p", "text": "Shortly thereafter, Celz attempted to convince Skywalker to take Kenobi's vessel and leave, but when the Padawan refused, she began torturing him with Force lightning. However, Kenobi, who had encountered Rex and discovered the truth about Celz, attempted to stop her from attacking his Padawan. Celz caught Kenobi with the lightning, however, and proceeded to torture them both. She was interrupted by Rex, who had thrown a mynock at her so that it would attack and distract her from Kenobi and Skywalker. After he threw a second mynock at her, she attempted to get them off her, which resulted in Celz stunning herself until she was incapacitated. Celz was detained by the Jedi and brought back to the Jedi Council to stand trial."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Alysun Celz was light-skinned with flowing black hair and brown eyes. After falling to the dark side, she attempted to persuade Et Rex to join her and subsequently framed her friend for the crimes she committed when he refused. She enjoyed torturing her victims with Force lightning and was also capable of wielding a blaster. In addition, Celz knew that the pirates who visited the planet Hoth called the name of the asteroid Poison Moon because it resembled one from the world's surface. She made it a point to relate this to Anakin Skywalker before she tortured him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Celz was sensitive to the Force and earned an elevation to the rank of Jedi Knight. She was proficient in the use of Force lightning, using the power to murder the crew of the Radiant IX and torture Anakin Skywalker and Obi-Wan Kenobi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alysun Celz was created by Michael Carriglitto for the short story Star Wars: Poison Moon, which appeared in issues 44–47 of the Dark Horse Extra, a series of monthly four-page comic anthologies. Issues 44–47 were published from February to May 2002, with the art being provided by Adrian Sibar. Celz garnered an entry in The Complete Star Wars Encyclopedia in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}