{"url": "Hermione_Bagwa/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Business owners and executives", "Category:Coruscanti", "Category:Females", "Category:Galactic Republic individuals", "Category:Humans", "Category:Waiters"], "nodes": [{"tag": "h1", "text": "Hermione Bagwa"}, {"tag": "p", "text": "Hermione Bagwa was a female Human brought up in the lower levels of Coruscant. Dexter Jettster rescued her from the filthy streets, giving her a job in Dex's Diner. She was always a favorite among the customers, and went on to become the diner's head waitress."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life in poverty"}, {"tag": "p", "text": "Hermione was born into desperate poverty in the filthy lower levels of Coruscant. Her childhood years were lonesome, full of squalor and misery. It was not until her teenage years that Dexter Jettster stumbled across her. He felt sorry for the young woman. At the time, he was in need of a waitress for his diner, and offered Hermione the job. This was nothing short of salvation for the young teenager. From that point on, she was deeply loyal to Dexter. When asked, Dexter sometimes said that Hermione's father was an old friend, and that he had promised to look after her."}, {"tag": "h3", "text": "Head waitress"}, {"tag": "p", "text": "As the head waitress, Hermione was in charge of Dex's motley crew of assistant droids. She took customers' orders by dictating them into a stylus which she stored in a garter on her thigh. The stylus was attached to an order comm worn on her belt, which transmitted the orders to the kitchen. She also brought customers their meals."}, {"tag": "p", "text": "Although she loved working at the diner, it was not without its troubles. Even though Hermione was head waitress, her fellow WA-7 waitress droid disliked having to work under an inexperienced organic waitress. The jealous droid did everything it could to undermine Hermione's position. WA-7 would often try to run over Hermione's toes, forcing her to wear very durable leather boots (also good protection against toxic kitchen slops). In response, Hermione would sometimes set up traps around the diner to trip WA-7 up."}, {"tag": "p", "text": "Hermione was a favorite among the working-class patrons. She usually wore an old-fashioned light-blue dress at the diner. She presented herself in a way that always gained the customers' attention, and was soon known to be one of CoCo Town's beauties. Many of the diner's regulars kept coming back just for Hermione's good company. Her employer believed her to be \"wild after hours.\""}, {"tag": "p", "text": "With her tough upbringing, Hermione was also very capable of dealing with troublesome customers. Her large black leather boots reminded customers that she was not one to be trifled with. She also had the option of calling Dex out of the kitchen with her order comm if the going got too rough."}, {"tag": "h3", "text": "Brushes with glory"}, {"tag": "p", "text": "Hermione was working in the diner at the time that Obi-Wan Kenobi visited Dexter in 22 BBY regarding a mysterious saberdart, though it was WA-7 that served him a cup of Jawa juice."}, {"tag": "p", "text": "When Quinlan Vos and Khaleen Hentz visited the diner in 20 BBY for information on a female Anzati assassin, Hermione was serving sliders, ardees and special sauce to some customers."}, {"tag": "p", "text": "At some point, presumably after the diner was destroyed by the Galactic Empire and later rebuilt, an aging but friendly Hermione owned and operated the diner after Dexter presumably retired throughout most of the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hermione Bagwa was portrayed by Australian actress Susie Porter in Attack of the Clones. Hermione's appearance was conceptualized by artist Dermot Power."}, {"tag": "p", "text": "Earlier drafts of the screenplay had Bagwa being Dexter's wife, but this notion was eventually abandoned. Susie Porter delivered the dialog seen in the film both for Bagwa and WA-7, but it was only WA-7 who ended up with all the lines in the final film script."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}