{"url": "Hethar", "categories": ["Category:Legends articles", "Category:Agriworlds", "Category:Arboreal planets", "Category:Atrivis sector planets", "Category:Galactic Empire planets", "Category:Imperial Remnant planets", "Category:Pentastar Alignment planets"], "nodes": [{"tag": "h1", "text": "Hethar"}, {"tag": "p", "text": "Hethar was a forested planet located in the Outer Rim Territories' Atrivis sector. It was the homeworld of the omnivores known as gornts, whose meat was a staple in the diet of the local colonists. Shortly before the Battle of Yavin, the Galactic Empire annexed the planet and instituted a gornt breeding and processing program, wherein Sullustan ranchers provided gornt meat as supplies for the Imperial Navy."}, {"tag": "p", "text": "Over the following years, gornt breeding on Hethar began to face problems related to the creatures' reproduction, drawing Imperial geneticists to visit the planet in an attempt to solve the difficulties. During the Galactic Civil War, a Rebel Alliance team on Hethar encountered a pack of local shredder bats that were eventually repelled via the use of the excluder device."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Hethar was a terrestrial planet located in the Hethar system, a part of the Atrivis sector in the New Territories portion of the Outer Rim Territories. The planet's surface featured forests in which trees and brown-colored bushes grew. Hethar was the homeworld of the gornt, a species of quadrupedal omnivore. The delicate nature of gornt reproductive cycle prevented the creatures from stripping their homeworld's forests bare."}, {"tag": "p", "text": "The shredder bat, a species of flying predator that had originally been encountered on the Core Worlds planet Atrisia and had eventually spread to more than a thousand other worlds, was also found on Hethar. In addition, the planet's biosphere included a life-form that had a shell as part of its organism."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The gornt, a creature native to Hethar, was already known off-world by 22 BBY. The Galactic Empire annexed the planet during the Galactic Civil War, shortly before the Battle of Yavin. The local colonists offered the Imperial suppliers a staple of their own diet: gornt meat. Due to the good qualities of the meat, the Imperial Navy rapidly established a gornt breeding and processing program. Due to deals made by several Sullustan entrepreneurs, gornt ranches were established on Hethar and other planets."}, {"tag": "p", "text": "For years, wild gornts were rounded up, fattened and bred to provide food for naval supplies. Eventually, however, due to factors that included forced breeding, overly rapid harvesting, changed diet, the use of fertility-modifying chemical treatments, and tampering with the gornts' genetic code, the creatures' breeding cycle began to change, leading to a steady decrease in the number and quality of the herds kept on Hethar. Drawn to the challenge, Imperial geneticists traveled to the planet in order to attempt to find a solution to the gornt fertility problems. During the reign of the Empire, the gornts of Hethar were given an entry in a holobrochure for the Tagge Holographic Museum of Chandrila."}, {"tag": "p", "text": "At some point during the Galactic Civil War, a Rebel Alliance team including Homack became stuck on Hethar while carrying out reconnaissance of a small Imperial contingent on the planet. One night, four Rebels, including Homack, on guard duty encountered a pack of shredder bats. Wary of using blasters to repel the creatures lest they were discovered by the Imperials, the Rebels stunned the creatures using the sonic animal repellent device known as the excluder. On the date 45:2:3:47, Homack mentioned the incident on Hethar in the illegal database Gundark's Gear Datalog. Hethar fell within the borders of the Pentastar Alignment between 4 ABY and 12 ABY and was situated in the territory under the control of the Imperial Remnant between 12 ABY and 13 ABY."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Hethar had already been colonized by the time the planet was annexed by the Galactic Empire. During the Empire's reign, Hethar was also home to wealthy Sullustan gornt ranchers and was occasionally visited by Imperial geneticists."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hethar was first mentioned in the 1994 sourcebook Creatures of the Galaxy, published by West End Games for Star Wars: The Roleplaying Game. The section of the book mentioning the planet was authored by Phil Brucato and illustrated by Mike Vilardi. The 2009 reference book The Essential Atlas placed the Hethar system, and therefore the planet Hethar, in grid square L-5."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}