{"url": "Hett_family", "categories": ["Category:Legends articles", "Category:Force-sensitive bloodlines"], "nodes": [{"tag": "h1", "text": "Hett family"}, {"tag": "p", "text": "A family of Humans living among Sand People, the Hett family consisted of exiled Jedi Sharad Hett, his wife K'Sheek, and their son A'Sharad Hett."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "K'Sheek was adopted into a Tusken Raider tribe at a very young age. Initially, she was a slave but would soon be regarded as one of their own by the Sand People and became a great warrior."}, {"tag": "p", "text": "Powerful Jedi Knight Sharad Hett, haunted by a feeling of emptiness and self-doubt, was granted leave of absence so that he could rejoin his family, only to learn that his entire family had been killed in a planetary bombardment of his homeworld by off world rival forces. Devastated, Sharad roamed the worlds of the Outer Rim Territories and eventually crash-landed in the deserts of Tatooine where he lived as a wild man until he was captured by the Sand People. He impressed them with his capabilities and eventually was accepted into their ranks as a Tusken warrior. He would end up the leader of a coalition of Tusken tribes."}, {"tag": "p", "text": "He and K'Sheek fell in love, and she gave birth to their son A'Sharad Hett. While A'Sharad was still a baby she was lost in a sandstorm and presumably died. Sharad took it upon himself to raise his son and train him in the ways of the Jedi. Fifteen years after A'Sharad's birth, Ki-Adi-Mundi traveled to Tatooine in search of Sharad Hett. Little did he know that psychotic Jedi hunter Aurra Sing was on his tail. During a fierce battle between Gardulla the Elder and Jabba Desilijic Tiure combined forces and the coalition of Tusken tribes, Aurra Sing took advantage of the chaos and killed Sharad. The entire coalition of Tusken tribes being wiped out by the Hutts and his father dead, A'Sharad agreed to go with Ki-Adi-Mundi to Coruscant and join the Jedi Order."}, {"tag": "p", "text": "One of the few Jedi to survive Order 66 and the Great Jedi Purge, A'Sharad later returned to Tatooine and his former life as a Sand Person, again assuming leadership of a tribe of Tusken Raiders. While leading a raid on the Lars family moisture farm, he was intercepted by Obi-Wan Kenobi, who led him to believe he was there to rein him in. A lightsaber duel broke out, and in typical style Obi-Wan cut A'Sharad's arm off, bringing dishonor to him among the tribe and resulting in the Tusken people abandoning him."}, {"tag": "p", "text": "A'Sharad would later learn that Obi-Wan's real reason for being there had been to protect the son of Anakin Skywalker."}, {"tag": "p", "text": "A'Sharad later turned to the dark side of the force, becoming a Sith Lord and taking the name Darth Krayt."}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "Appearances"}]}