{"url": "Hetto", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males", "Category:Personnel of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Hetto"}, {"tag": "p", "text": "Hetto was a member of Myder's Mynocks, a division of the Gorse-based surveillance company Transcept Media Solutions. One of Hetto's colleagues and closest friends was the Sullustan Zaluna Myder. Hetto was a secret contact of the rebel operative Hera Syndulla and informed her about a planned visit by Count Denetrius Vidian to the Gorse system. Due to his rebel links, he was arrested by the local Imperial authorities during Vidian's crackdown."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Myder's Mynocks"}, {"tag": "p", "text": "Hetto worked for twenty years at Transcept Media Solutions, a surveillance company based on the planet Gorse that worked for the Galactic Republic and its successor, the Galactic Empire. By the Age of the Empire, Hetto was working under the supervision of Zaluna Myder, whose entire work floor shift was named Myder's Mynocks. Under the Galactic Empire, the Mynocks were assigned the tasks of monitoring all surveillance cameras in the Gorse system and reporting all violations of \"public order\" to the Imperial authorities. Hetto's increasing dissatisfaction with the Empire's repression led him to contact a rebel operative named Hera Syndulla on HoloNet and to disclose sensitive information about Imperial operations on Gorse and a mining consultant named Lemuel Tharsa, who later became the Imperial efficiency expert Count Denetrius Vidian."}, {"tag": "h3", "text": "The Cynda Bomber"}, {"tag": "p", "text": "Hetto was on duty when he received a security camera on Gorse's moon Cynda picked up a threat to the Empire. He reported it to his supervisor Myder, who asked him who was listening. Hetto replied that dark-haired transport driver had overheard the threat and reported the culprit to the Galactic Empire. After consulting Transcept's database, Zaluna discovered that the culprit was Skelly, a dissident demolitions expert who had served during the Clone Wars and had been dismissed by several local mining companies. When Hetto remarked that he had not pulled out the file before, Zaluna reminded him that he had pulled out the fire eight days ago."}, {"tag": "p", "text": "After the Cynda security incident, Hetto received an incoming message from the official HoloNet channel. This turned out to be a hologram message from the Imperial Count Vidian, who informed Zaluna that he would be inspecting all mining operations on Cynda and processors on Gorse. Vidian added that both Cynda and Gorse were now under Security Condition One. Since Vidian's new security measures increased the company's workload drastically, Hetto remarked that Vidian needed a \"red stamp\" on his file; a euphemism for a mentally unwell person. This earned him a corrective rebuke from Zaluna, who reminded him to follow his orders. After the hologram message with Vidian had ended, Hetto tried to point out that Skelly had a red stamp on his file. However, Zaluna told him that the Empire did not care and reiterated that Master Skelly's words would earn him a visit from stormtroopers."}, {"tag": "h3", "text": "The last shift"}, {"tag": "p", "text": "The alleged threat posed by Skelly coincided with an inspection of the Gorse system by Count Vidian, who had come to speed up thorilide production. As a result of Vidian's new security measures including he arbitrary arrest of known troublemakers and dissenters, Skelly and his fellow Mynocks' workload was greatly increased. The crackdown was also accompanied by the stationing of several Imperial officers and stormtroopers on the Mynocks ' work floor. Due to his dealings with Hera, Hetto was visibly nervous and took steps to avoid making eye contact with any of the Imperials; focusing on his work. After receiving news that Skelly had been apprehended by the refinery company Moonglow Polychemical, Hetto took the chance to inform Zaluna about his secret."}, {"tag": "p", "text": "Pretending to talk about gardening, Hetto motioned for her to approach a pot of yellow stasias. While Zaluna pretended to change a saucer beneath the plant, Hetto told her about his activities on HoloNet and his planned rendezvous with Hera. He also told her that he had hidden a datacube with an attached note in that pot. Before Hetto could disclose the full account of his dealings with Hera, Hetto was arrested by an Imperial lieutenant and several stormtroopers, who charged him with making seditious remarks to disturb order and abusing the trust of the Galactic Empire. When Hetto responded that he worked for Transcept and not the Empire, the lieutenant responded that Transcept worked for the Empire and that they would not have traitors in their midst."}, {"tag": "p", "text": "The lieutenant then informed Zaluna that the Empire would be monitoring everything that happened on Myder's work floor in the light of Hetto's arrest. Before he was taken away, Hetto took the opportunity to tell his fellow Mynocks that they were being spied upon by the Empire. He then defiantly told the lieutenant to go ahead and view the records and emphasized that he and his fellow workmates had nothing to do with Skelly's mining collapse on Cynda. The lieutenant than replied that the Empire had a record of all his past statements against the Empire. When Zaluna told Hetto that she did not known anything about this, he warned her that the Empire was monitoring all comments and remarks made by Imperial citizens."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Despite Skelly's arrest, his supervisor and friend Zaluna managed to deliver the datacube to the rebel Hera at a local cantina called The Asteroid Field. This datacube included files from Transcept and information about a man called Lemuel Tharsa, who was actually Count Vidian. After being trapped inside a hoverbus, Zaluna joined Hera and an informal band of rebels that included Skelly and Kanan. Using Hetto's information, they were able to uncover Count Vidian's true identity and motives, and stop his plan to destroy the moon Cynda in order to discredit his rival Baron Lero Danthe. Hetto's arrest reflected the increasing repression and totalitarianism of the Galactic Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hetto was a surveillance operator who worked at Transcept Media Solutions for the past twenty years. He was a vocal critic of the Galactic Empire's mass surveillance of Imperial citizens and transients in the Gorse system. Hetto's opposition to the Empire led him to initiate contact with the rebel operative Hera Syndulla and download classified files relating to Transcept and Lemuel Tharsa. Hetto disagreed with Transcept's decision to alert the Imperial authorities to the remarks of a dissident miner named Skelly. Hetto's dissent and secret correspondence with Hera led to his arrest by the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hetto first appeared as a secondary character in John Jackson Miller's 2014 novel A New Dawn. Most of his lines are told through the point of view of another supporting character, Zaluna Myder."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}