{"url": "Hewex/Legends", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Hewex"}, {"tag": "p", "text": "Hewex was an Imperial Navy Major. He was the leader of the Navy detachment assigned to guard the deflector shield bunker on Endor, a liaison between technicians and command staff. Initially, when the Rebels broke through the blast doors of the bunker, Hewex was captured and forced to move out of way at gunpoint. When the Rebels became overrun, Hewex stole Chewbacca's Bowcaster. Fooled by Han Solo (posing as Major Marquand), Hewex ordered three squads to help search for the Rebels. Solo and his team then infiltrated the bunker and destroyed it."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Before the battle of Endor erupted in the year 4 ABY, Hewex was stationed inside the deflector shield bunker during the construction of the second Death Star. Together with a fleet division, Hewex would guard the complex with the generator at all costs. In addition to this task, Hewex also served as a liaison officer between the bunker's command staff and the Imperial technicians."}, {"tag": "p", "text": "His efforts were unsuccessful. When the Rebel Alliance learned of the plans of the Empire, a rebel strike team led by Han Solo managed to land on Endor with the help of a hijacked Imperial Space Shuttle, the Tydirium. The Alliance envisaged a ground force on Endor destroying the generator of the SLD-26 Shield to allow the rebel fleet in orbit to attack the the battle station. Together with the local Ewoks, the rebels were able to invade the control bunker, destroy the generator, and subsequently destroy the Death Star."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hewex was played by Anthony Smee."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}