{"url": "Hibernation_trance", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Control powers", "Category:Force healing", "Category:Light side powers"], "nodes": [{"tag": "h1", "text": "Hibernation trance"}, {"tag": "p", "text": "Hibernation trance, healing trance, Jedi hibernation, Force trance, or recovery trance was an ability that allowed Force-users to go into a very deep hibernation state."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Hibernation trance was a control-based ability that slowed the user's metabolism and breathing to a standstill, causing the individual to only use one tenth of the air of a normal individual. To all outward appearances, the individual appears to be dead; only thorough testing would determine that they were alive. Individuals using stethoscopes would be able to detect a faint heartbeat if they listened intently enough, and life sensors would register a slight flicker. Other Force users with training in the Sense skill would be able to sense the hibernating individual in the Force and know they were not dead."}, {"tag": "p", "text": "A fully trained Force-user could stay in this state for up to one week in a dry climate or one month in a wet climate before dying from lack of water. By hooking themselves up to an intravenous water drip, they could extend the duration indefinitely. Individuals could hibernate for up to three months before dying of starvation; the application of an intravenous sugar-solution drip could extend the hibernation period to a year."}, {"tag": "p", "text": "A hibernating Force-user would appear dead to all but another Force-user. This could lead to potentially dangerous results for the hibernating individual if nobody was aware of the truth. To avoid such situations, the person in a hibernation trance could provide a trigger phrase that, if recited by another person, would bring the Force-user out of the trance."}, {"tag": "p", "text": "Trained force-users could also use a similar technique to place others in a hibernation trance. The target had to be a willing ally. The force-user touched the ally to place him into the trance. The ally would then benefit from the effects of the hibernation trance. The ally could not emerge from the trance on his own; he relied on the force-user to bring him out of it."}, {"tag": "p", "text": "A hibernation trance was a lesser form of the more advanced Force power morichro.[source?]"}, {"tag": "p", "text": "There was another trance called Serenity, which was a brief meditative state that Jedi Masters used to regain focus and power."}, {"tag": "h2", "text": "Users"}, {"tag": "p", "text": "Kreia entered a hibernation trance to appear dead and be moved to the morgue at the Peragus Mining Facility in 3951 BBY."}, {"tag": "p", "text": "Bela Kiwiiks used a hibernation trance to survive torture from the Sith Lord Praven—under orders from Darth Angral—when she was placed beside the active Shock Drum."}, {"tag": "p", "text": "Jedi Master Tholme used this ability on numerous occasions, such as during the Mission to Devaron, in order to place himself outside of his former apprentices's (Aayla Secura and Quinlan Vos) thoughts so they could fight clearly in times of great struggle."}, {"tag": "p", "text": "It was also used, in combination with the natural healing trance of the Whiphids, by the Whiphid Jedi K'Kruhk to fake death after being struck down by Grievous at the Battle of Hypori."}, {"tag": "p", "text": "In 378 BBY, the Kushiban Jedi Master Ikrit discovered the Golden Globe within the Palace of the Woolamander, on the jungle moon of Yavin 4. Unable to break the curse and free the countless trapped Massassi children, he used this ability to wait for someone who could. His hibernation lasted for 356 years, far beyond his species' natural lifespan, until discovered in 22 ABY by Anakin Solo and Tahiri Veila."}, {"tag": "p", "text": "Luke Skywalker was known to use it in the course of long hyperspace flights. His descendant, Cade Skywalker, used it to survive the Massacre of Ossus and later, the Battle of Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}