{"url": "Hide_and_Seek", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "Hide and Seek"}, {"tag": "p", "text": "\"Hide and Seek\" is a comic story that was published as the lead story of Star Wars Adventures 20 on April 17, 2019."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The invisible friend"}, {"tag": "p", "text": "On the planet Retta in Wild Space, B1-series battle droids were patrolling the jungles of the planet when their commander received a message from their general, Flebek who ordered them to keep finding the secrets of Retta for Count Dooku. One of the battle droids thought they had found something. But then Jedi General Anakin Skywalker. The battle droids opened fire on the Jedi but then were attacked from their opposite side by Grand Master Yoda. Yoda and Skywalker were sent to stop Flebek from discovering a secret on the planet."}, {"tag": "p", "text": "But then the Jedi were attacked by a soaring boulder. Yoda and Skywalker used The Force to locate the perpetrator. Skywalker knocked an invisible individual into a tree. The individual became revisable and Yoda instantly knew that it was an old friend named Kreeda. Kreeda was the last remaining of the Segredo species who was able to manipulate the minds of others to hide their appearance. Skywalker thought it was amazing and wanted to take her back to Coruscant and make her a spy for the Galactic Republic. Kreeda did not like this, causing her to become invisible once again."}, {"tag": "h3", "text": "Discovering the invisible refugees"}, {"tag": "p", "text": "A group of battle droids appeared and attacked the Jedi. Skywalker was able to destroy them but when he finished he realized that Master Yoda had disappeared. Yoda was tracking down Kreeda and found her as she was turning a Ishi Tib invisible. They then ran away from Yoda as he continued after them."}, {"tag": "p", "text": "Skywalker destroyed the last battle droid as he continued his search for Yoda. He found Yoda meditating in an open area in the jungle. Skywalker asked him what he was doing out on his own but Yoda questioned if he really was alone. Then, members of various species appeared behind Yoda. Kreeda walked forward and told Skywalker that the individuals had come to her to escape the Clone Wars and she had been protecting them by turning them invisible when she had to. Skywalker realized that it would be best if she stayed to protect them then leave to become a spy. They were interrupted by the sound of Confederacy of Independent Systems battle droids approaching."}, {"tag": "h3", "text": "Protecting the camp"}, {"tag": "p", "text": "A short distance away, Flebek knelt down, observing the remains of a destroyed battle droid. She realized that there were Jedi nearby. The battle droid asked if the Jedi were also after the secret to invisibility like them."}, {"tag": "p", "text": "Back with the Jedi, Kreeda started to panic knowing that the CIS was after her. She also knew her powers did not work on droids but Yoda and Skywalker volunteered to protect her camp. Skywalker had a plan and asked to borrow the Kyuzo war shield, to wear on his head ,from one of the refugees."}, {"tag": "p", "text": "Shortly after, Skywalker made a fake report to the Jedi High Council that the cloaking cap was working fine even though it was fake. Flebek and her battle droids appeared behind Skywalker and feel for his trick. She chased after Skywalker but behind her, Yoda dropped a tree on her battle droid. Skywalker then turned around and threatened to kill Flebek with his lightsaber. Flebek then decided to abort the mission believing Skywalker's trick of there being no secret."}, {"tag": "p", "text": "Kreeda questioned what was for them next. Yoda reassured her that she will stay where she was and that her secret was safe with them. Skywalker agreed but didn't know what to tell Jedi Master Mace Windu for their report. Yoda told him to tell Windu that the truth with was they saw nothing on Reeta."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}