{"url": "Amaiza_Foxtrain", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Females", "Category:Humans", "Category:Pirates", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Amaiza Foxtrain"}, {"tag": "p", "text": "Amaiza \"Maiz\" Foxtrain was a human female who worked as a pirate and a smuggler during the Galactic Civil War. She was an associate of Jaxxon, who regarded her as a \"class act\" and sought to impress her, until she double-crossed him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Amaiza had a partnership with Jaxxon T. Tumperakki, and was considered to be his girlfriend. She had a number of safehouses on Valtos, including a hideout near Tovey's Cantina."}, {"tag": "h3", "text": "The lost eggs of Livorno"}, {"tag": "p", "text": "Amaiza accompanied Jaxxon to rendezvous with their contact, Queen Prizzi of Livorno, to deliver a case of precious eggs to Princess Leia Organa of the Alliance to Restore the Republic. However, Jaxxon's vessel, the WUD-500 star yacht Rabbit's Foot, suffered an engine fault and crash-landed. Foxtrain was unimpressed, and demanded that Jaxxon fix the ship or else their partnership was over. She met with Prizzi, bringing her back to the crash site with the eggs, and convinced the reluctant Jaxxon to transport them by threatening to ask Han Solo to do it instead. They were interrupted by Imperial stormtroopers, and during the shootout Amaiza took possession of the eggs and replaced them with eggs that contained vicious bat-like creatures. Jaxxon and Prizzi took off, unaware of Foxtrain's absence, and realized they'd been duped when the false eggs hatched."}, {"tag": "p", "text": "Amaiza brought the real eggs to the Wheel space station for an auction with several likely buyers—including undercover Imperials who started another shootout. However, Jaxxon was also undercover, revealing himself by attacking the Imperial agents and unleashing Amaiza's bats on her in revenge. While she fought off the vicious critters, Jaxxon stole the real eggs and fled to the Rebel Alliance. After rendezvousing with Organa and Solo, Jaxxon learned that the eggs were never the real lost eggs of Livorno at all, but rather decoys to draw Imperial eyes while Solo smuggled the real eggs aboard the Millennium Falcon."}, {"tag": "h3", "text": "The Reegor duplicity"}, {"tag": "p", "text": "After the Wheel affair ended her partnership with Jaxxon, Amaiza stole a cache of Imperial transit chips, earning herself a bounty. She partnered up with Reegor, one of Jaxxon's many cousins, hoping the Imperials would come after Jaxxon himself while she laid low. Han Solo and Luke Skywalker informed Jaxxon of this development after he escaped from Dengar and the Scram Gang on Rekelos."}, {"tag": "p", "text": "Jaxxon caught up with Reegor on Valtos and posed as his own cousin to trick Amaiza. Though she allowed him into her hideout, Foxtrain saw through his ruse and held him at blaster-point. He revealed he had a tracker, which led stormtroopers and Dengar to the hideout. While Amaiza fought off the intruders, Jaxxon collected the transit chips and fooled the Imperials by surrounding them with many of his cousins, all posing as Jaxxon himself. Though Jaxxon escaped, Amaiza was apprehended by Dengar, who intended to collect on her bounty."}, {"tag": "p", "text": "While in Cloud City in 3 ABY, Jaxxon led Lando Calrissian to believe that stolen hypercoils from the Corsair, which Maz Kanata believed Lando had stolen, ended up in the power core of the Rabbit's Foot thanks to Amaiza, whom he remained separated from."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}