{"url": "Hiding_Cube_SCT-1000", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Articles in need of updating", "Category:Containers", "Category:Veretrex Securities products"], "nodes": [{"tag": "h1", "text": "Hiding Cube SCT-1000"}, {"tag": "p", "text": "Hiding Cube SCT-1000s, also known as Bith hiding cubes, were a model of Bith security container produced by Veretrex Securities. They could be installed in walls, where they would blend completely into the surface using fiber optic relays which transported light across the container. When the cubes were not contained in a recess, any lighting around them became fuzzy, which made them easy to spot. Galladinium Galactic Exports sold the cubes for 3000 credits each during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Each side of a Hiding Cube SCT-100—which were also known as Bith hiding cubes—measured seventy-five centimeters per side and was made from transparisteel with built in fiber optic relays, which allowed the cubes to effectively act as advanced prisms. When activated, these relays would transport light from one side of the cube to the other. As such, if a cube was placed in a wall recess in a similar manner to a safe, it would appear as though it was just another section of the wall. While it was moderately difficult to spot a cube hidden in such a manner, the containers were easy to spot if not in a recess, as they created a fuzzy effect on the lighting around them. Small objects could be placed inside of the cube to be hidden, with magna locks—which were difficult to pick—used to secure the container."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The company Veretrex Securities produced the SCT-1000, which was associated with the Bith species. The cubes were sold by the technological supply company Galladinium Galactic Exports company through their product datalog for 3000 credits each between the Battle of Yavin and the Battle of Hoth during the Galactic Civil War fought between the Galactic Empire and the Alliance to Restore the Republic. The cubes were rare and difficult to acquire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hiding Cube SCT-1000 was featured in Galladinium's Fantastic Technology, a sourcebook released in April 1995 by West End Games for the Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}