{"url": "Amaiza_Foxtrain/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Adubans", "Category:Dancers", "Category:Females", "Category:Humans", "Category:Mantellians", "Category:Nar Shaddaa residents", "Category:Pirates", "Category:Smugglers", "Category:Star-Hoppers of Aduba-3"], "nodes": [{"tag": "h1", "text": "Amaiza Foxtrain"}, {"tag": "p", "text": "Amaiza Foxtrain was a Human female who found work, respectively, as a dancer, a pirate, a gunslinger, and a smuggler. In her youth she worked, along with her twin sister Jodelle, as part of a sultry dancing/tumbling act. They were managed by the Twi'lek Quatrain Pudundruh, who was later forced to sell them into slavery. The sisters were purchased by the Black Hole Gang pirates, and found their relatively sheltered existences subverted in the new environment, but were not abused by the pirates."}, {"tag": "p", "text": "When Jodelle was accidentally killed during a pirate operation, Foxtrain resolved to turn herself into a lethal combatant, and eventually became an effective and competent pirate in her own right. She rose to the top of the Black Hole pirate gang, only to fall afoul of the Imperial Navy. Left destitute, Foxtrain found work on Aduba-3 as a part of the Corellian Han Solo's Star-Hoppers of Aduba-3, who in turn defended the farmer village of Onacra from the Cloud-Riders gang led by Serji-X Arrogantus. Foxtrain later teamed up with fellow Starhopper Jaxxon, a Lepi, and encountered the relentless bounty hunter Beilert Valance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Black Hole Gang"}, {"tag": "p", "text": "During the Imperial Period, Amaiza Foxtrain, a Human female, and her twin sister, Jodelle, were born to a sabacc dealer and a cocktail waitress on Ord Mantell. At an early age, the sisters were orphaned by Mantellian gangsters, who were in turn ultimately killed by the gunslinger Gallandro. They eventually became the sole members of a sultry dancing/tumbling act that performed at the Lady Fate Casino, known as the Foxtrain sisters. One of the patrons of their act was the Wookiee con artist Chalmun, who taught Foxtrain to gamble and speak the Wookiee language of Shyriiwook. The sisters' youth and inexperience proved hazardous, however—they were easy prey for the Twi'lek entrepreneur Quatrain Pudundruh. The enterprising Twi'lek offered to manage the sisters when they were 18 years of age, and although business was good for a year, they struggled through the next season. Pudundruh was forced to sell off all his assets, and as a result the Foxtrain sisters were sold into slavery."}, {"tag": "p", "text": "The sisters were purchased by the pirate Black Hole Gang gang, who operated from Delphon. The girls were not abused by the pirates, but their sheltered lifestyles were thrown into disarray while living in the gang culture. During a raid, Jodelle was accidentally killed while accidentally mishandling a blaster. As a result, Amaiza Foxtrain was determined not to meet the same fate as her sister, and set about honing the skills she would require to properly defend herself, In time, Foxtrain's education progressed beyond basic defensive knowledge, such as how to operate a blaster, and she became a capable pirate in her own right, and her prowess with firearms became legendary. She progressed through the ranks of the Black Hole Gang, and earned death sentences in six systems. At some stage, she encountered the smuggler Han Solo, and his Wookiee co-pilot, Chewbacca. Foxtrain demonstrated to Solo her skills with a blaster, shooting the antennae off a ji-ant at 600 yards. She progressively used her surname of \"Foxtrain\" less and less, and was widely known merely as \"Amaiza.\""}, {"tag": "p", "text": "The leadership of the Black Hole gang was continually under contention, and would often be seized by force. Foxtrain was popular among her fellow pirates, and it was often suggested that she should be the new leader of the gang. At some stage, one of the Black Hole chiefs, Kayso, managed the pirates poorly, and instead elected to keep all of their ill-gotten gains to himself. When Foxtrain learned of the betrayal, she shot Kayso, and thereby took control of the Black Hole gang as den-mother, and captain. Her tenure was brief though, when the arrival of the Imperial Star Destroyer Riptide arrived in the Delphon system, enforcing a crackdown on pirate activity within the area. The Black Hole Gang scattered and disbanded, with Foxtrain left to fend for herself."}, {"tag": "h3", "text": "Star-Hopper"}, {"tag": "p", "text": "Thanks to the Imperial interference, Foxtrain was left destitute. She was wanted dead or alive in six systems. Hoping to find work, she made her way to the remote Aduba-3. While in the spaceport of Tun Aduban, she heard word that a posse was being assembled. She attended the queue forming outside one of the apartments in Locru's Central Saloon, hoping to sign up. After the Spiner Hedji had been interviewed, Foxtrain entered the apartment. The individual assembling the posse was none other than Han Solo. Chewbacca was present, as well. The Corellian had heard that Foxtrain had been killed during the Navy's raid on Delphon—similarly, Foxtrain had heard tell that Solo was greatly indebted to the crime lord Jabba the Hutt. Solo accepted Foxtrain into his posse, and she assured him that her marksmanship was still considerable."}, {"tag": "p", "text": "The next day, Foxtrain met with the rest of Solo's posse, which included the Lepi spacer Jaxxon, Hedji, the faux-Jedi Don-Wan Kihotay, Jimm Doshun—the so-called \"Starkiller Kid,\" and the tractor-robot FE-9Q. While Solo and Chewbacca briefed the posse, they were approached by a local mercenary, Serji-X Arrogantus, and his Cloud-Riders gang, who flew skyspeeders. Solo quickly divulged that the posse would be defending the farming village of Onacra against Arrogantus and the Cloud-Riders. Arrogantus and Solo briefly bandied words, and when the mercenary called into doubt the skills of the posse, Doshun was angered, drawing his blaster. At Solo's behest, Foxtrain moved quickly, cuffing the inexperienced Doshun on the head, preventing him from making any rash maneuvers. Arrogantus contemptuously pointed out that Solo's posse was already resorting to in-fighting, before departing."}, {"tag": "p", "text": "The posse saddled up on banthas, and rode out towards Onacra. In transit, they encountered a pack of savage high-hounds, attacking several farmers. Solo and the posse charged their banthas, and engaged the creatures. Drawing her blasters, Foxtrain blasted at the high-hounds, and as Jaxxon did likewise, he suggested a partnership with her once their job was done—a proposal she flatly rejected. The high-hounds were soon staved off, and Solo managed to save one of the farm girls, Merri Shen. The posse rode on into Onacra, and after they had stabled their banthas, met with the village leaders. Merri was in fact the daughter of Oncho Shen, the Onacran spokesman. He felt indebted to Solo for his saving of her daughter, but the Corellian refused, pointing out that they were already paying him what little they could to defend the village from Arrogantus. Foxtrain was amused by the fact that Solo had \"gone soft\" over the girl. Solo retorted, insinuating that Foxtrain talked too much, but Foxtrain in turn declared that the widow of the last person to tell her that was enjoying his death benefits on Bestine IV."}, {"tag": "p", "text": "Solo soon put the posse and farmers to work, assembling makeshift defenses for when Arrogantus and the Cloud-Riders arrived. Sure enough, the marauders were sighted, and Solo assembled his posse, ready to defend Onacra. As Arrogantus attacked and the battle raged, Solo called for Foxtrain and Kihotay to defend his and Chewbacca's rear. Although Foxtrain was able to gun down one attacker, she was grappled from behind by another. Kihotay came to the rescue, striking down the mercenary with his lightsaber. Although Foxtrain was impressed by the clearly inexperienced Kihotay's skills, she noted that he would not be fast enough to prevent himself from being shot from behind by a skyspeeder-mounted attacker. Sure enough, Kihotay was blasted, but his Jedi armor absorbed the blast. The skirmish was complicated further when a creature, the Behemoth from the World Below, emerged from a cavern, and began wreaking havoc."}, {"tag": "h3", "text": "Contending with the Behemoth"}, {"tag": "p", "text": "The Behemoth was a gargantuan creature, impervious to blaster shots, and possessing an ability to project concentrated lightning from an organ on its forehead. As it battled the Cloud-Riders, Solo's posse regrouped. As the monster created a landslide, the posse was forced to scatter, and take cover. The Behemoth proceeded to destroy the Cloud-Riders, trampling both Arrogantus and the Old One—an Onacran who had been controlling the beast. Doshun, a native Onacran, pointed out that the Behemoth would likely proceed to destroy the entire village, now that it was out of control. Foxtrain protested, since they had been hired to destroy Arrogantus, who was now apparently dead. Solo countered by pointing out that the posse would not even get paid should Onacra be destroyed by the Behemoth. Jaxxon accepted Solo's logic, and set out to destroy the Behemoth by itself, despite Foxtrain's protests that he should stay put. As the Behemoth hurled rocks at the Lepi, he was disarmed. Jaxxon reached for his weapon, and Foxtrain began to panic, fearing that he would be destroyed. In the nick of time, the Lepi retrieved his blaster, and returned to shelter. The Behemoth pursued him, and both Foxtrain and Jaxxon made their way back to Solo quickly. Although she arrived safe, Foxtrain twisted her ankle."}, {"tag": "p", "text": "Regrouping, the posse sought better cover, and Solo hoped that united, they would be able to formulate an effective line of attack. After surviving another landslide, the posse realized that Kihotay had launched his own solo effort to bring down the Behemoth. Doshun realized that he was leading the beast away from the posse to augment his efforts. Hedji ran to Kihotay, hoping to lend aid, but was only blasted by the Behemoth and killed. Solo realized that the lightsaber was acting as a sort of lightning rod for the creature's beam, interfering with its attacks. The Corellian bemoaned the fact that he would not be able to reach Kihotay in time to tender assistance, but Chewbacca suggested that he ferry Solo to the old man. Foxtrain immediately concurred, and the Wookiee wasted no time in picking up the Corellian, and carrying him across the battlefield. Solo was able to take up Kihotay's lightsaber and destroy the beast, saving Onacra. In the aftermath of the battle, the posse was paid by the villagers, and became known as the Star-Hoppers of Aduba-3. Their exploits even inspired a highly fictionalized holodocumentary of events produced by Tri-Nebula Entertainment, for which Foxtrain became more famous than her actual gunslinging exploits. Foxtrain was later profiled by historian Voren Na'al, as part of an Alliance to Restore the Republic report on the Star-Hoppers."}, {"tag": "h3", "text": "The Hunter"}, {"tag": "p", "text": "Foxtrain teamed up with Jaxxon, and put her skills as a gambler to good use. Pooling their credits, she was able to raise enough for Jaxxon to buy back his freighter, the WUD-500 star yacht Rabbit's Foot. The pair made their way to Nar Shaddaa, where Jaxxon wanted to sample the local night life. Foxtrain was less interested however, and instead elected to oversee the refueling of the Rabbit's Foot. However, she later chose to investigate Jaxxon's whereabouts, and found him strung upside-down, being tortured by a pack of thugs. Foxtrain immediately shot the H'nemthe Dafi, and warned the rest of them not to reach for their weapons. They chose not to heed her warning, and she was forced to rapidly gun them all down. She mentioned that she was reminded of their exploits on Aduba-3, and Jaxxon protested, pointing out that the thugs had been interrogating him about those events. He cautioned that if any of them were still alive, his resilience would have been for naught. Sure enough, one of the thugs had survived, and scampered off before Foxtrain could shoot him."}, {"tag": "p", "text": "Realizing that the thugs, who were in the employ of Captain Beilert Valance the bounty hunter, would be heading to Aduba-3, Foxtrain and Jaxxon made their way there in the Rabbit's Foot. Landing near Onacra, they were reunited with Jimm Doshun, who found it unlikely that he would be targeted by a bounty hunter. Nevertheless, that was the conclusion Jaxxon had reached from his conversation with the thugs, and Foxtrain insisted that they prepare for the worst—to that end, she formulated a plan. When Valance's ship, the Kill Switch, arrived in-system, Foxtrain and Jaxxon took to space, and engaged the bounty hunter. Valance returned fire, and as per Foxtrain's plan, Jaxxon feigned a forced landing on Aduba-3. The pair then cleared out of the ship, and hid in the tall grass. Valance's men landed and began investigating the Rabbit's Foot, prompting Foxtrain and Jaxxon to open fire. In accordance with the next phase of the plan, Doshun fired a blaster shot into the air, causing a herd of banthas to stampede and crush the bulk of Valance's men."}, {"tag": "p", "text": "Doshun was satisfied that Onacra had been successfully defended once more, but Foxtrain was not as sure. Sure enough, one of the thugs, Slssk, emerged, and Foxtrain quickly dispatched him. Valance himself then emerged, and attempted to steal towards his ship, but Foxtrain, Jaxxon, and Doshun stood in his path. The Lepi queried the bounty hunter as to why he was after Doshun, and when Valance regarded the young farmer, he began caterwauling about a recording from the Empire's destroyed Death Star, and the \"wrong boy.\" After laughing manically, Valance fired a blast from his hand, sending the trio of defenders flying. The bounty hunter escaped to the Kill Switch and blasted away from Aduba-3. The trio were satisfied that their ordeal was over, but Foxtrain speculated as to the fate of the individual that Valance truly hunted, who he had mentioned to be a \"lover\" of droids. Valance was later destroyed by the Dark Lord of the Sith, Darth Vader."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Foxtrain, in her youth, was particularly inexperienced in business matters. The death of her sister roused her into action, and she was driven into the life of a pirate. She was well liked by her fellow pirates, and claimed leadership of the Black Hole gang when she found the actions of one chief, Kayso, to be unconscionable. She managed to retain a youthful appearance, through secrets she had compiled in her extensive travels. Foxtrain was hugely confident in her own skills as well, believing herself to be a more precise marksman than the Spiner Hedji. She was also quick to act, not questioning the orders of the leader of the Star-Hoppers, Han Solo, and instead leaping into action when called for."}, {"tag": "p", "text": "Foxtrain was initially uninterested in the prospect of working with the Lepi Jaxxon. She also found particular mirth in the fact that Solo was attracted to the young Merri Shen, and had no qualms about illustrating her amusement openly. Solo in turn criticized her, claiming that her tendency to speak her mind was hardly an asset. Foxtrain also found amusement in the antiquated and outmoded speech patterns of Kihotay, although he admired his skills, considering both his age and obvious inexperience in the art of combat. As their time together wore on, Foxtrain grew more fond of Jaxxon, and grew particularly concerned when he made a foolhardy attempt to confront the Behemoth from the World Below on his own."}, {"tag": "h2", "text": "Equipment and skills"}, {"tag": "p", "text": "To achieve a more catlike appearance, Foxtrain would occasionally wear decorative corneal lenses. She was a crack shot with the dual blaster pistols she would keep slung at her hips. She was often scantily clad, opting to wear red leather, and a red flower in her hair. Her skills as a pilot were about average, but she was highly competent as a mechanic. She was also equipped with a vibrodagger, and could speak Huttese, Basic, Rodese, and Shyriiwook. Foxtrain was also a talented gambler, and an exceptional gunslinger, able to gun down many opponents before they could even draw their own weapons. She was also a qualified plotter, able to devise a plan to outwit the bounty hunter Beilert Valance when he threatened Jimm Doshun's life."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Amaiza made her first appearance in Star Wars 8 (1978), written by Roy Thomas and Howard Chaykin. The issue is part of a larger arc that paid homage to Akira Kurosawa's Seven Samurai (1954). The character appeared in the rest of that arc, and the fill-in issue Star Wars 16 (1978), which focused on many of the series' original characters, rather than the protagonists from Star Wars: Episode IV A New Hope (1977). The character, like many other elements from the early portions of the Star Wars comics from Marvel, went unreferenced in the wider Expanded Universe for many years, until an article published in Star Wars Gamer 4 (2001), \"The Starhoppers of Aduba-3.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}