{"url": "Hig", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Hig", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Hig"}, {"tag": "p", "text": "The Hig were a slender, blue-colored sentient species. The Hig Ginbotham served aboard the Yavin under Wedge Antilles' command, and saw action against the forces of the terrorist Kueller at Almania. Another Hig was a supporter of the Diversity Alliance, a pro-alien, anti-Human organization, donating her ore hauler to the cause."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Hig were a sentient humanoid species with blue skin and slender bodies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Hig were active in the galaxy from at least the time of the New Republic. In 17 ABY, a Hig known as Ginbotham served in the New Republic Defense Forces. He was renowned for his piloting skills and served as part of the command crew aboard the Yavin, a Mon Calamari Star Cruiser under the command of General Wedge Antilles. While serving aboard the Yavin, Ginbotham saw action at the Battle of Almania, where the Republic engaged three Victory-class Star Destroyers under the command of the terrorist Kueller. Ginbotham was ordered to fire at one of the Republic's allied ships, the Wild Karrde, in order to confuse the opponent's droid-operated forces into mistaking the Yavin for one of their own ships."}, {"tag": "p", "text": "Later, in 24 ABY, a female member of the Hig species donated the use of a robotic ore hauler to the Diversity Alliance. The Alliance was a coalition of pro-alien groups, led by Nolaa Tarkona, that aimed to displace Humans from significant positions of power throughout the galaxy. The Hig trader's spacecraft was used at their mining operations on Ryloth. While she occasionally flew the spacecraft there herself, more frequently she relied on the autopilot to complete her cargo runs, remaining behind in cantinas on backwater worlds. On one particular occasion, her spacecraft was used as cover by four members of the Jedi Praxeum on Yavin 4 who wanted infiltrate the Diversity Alliance operations on Ryloth. They attached a small craft, the Rock Dragon, to one of the hauler's cargo bays as a decoy, and hid themselves inside the ore hauler, escaping from the ship once they made planetfall."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hig were created by Kristine Kathryn Rusch and first appeared in her novel The New Rebellion, published in 1996 by Bantam Spectra. They next had a brief mention in Young Jedi Knights: Jedi Bounty, a young adults novel written by Kevin J. Anderson and Rebecca Moesta and published by Boulevard in 1997."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}