{"url": "High_Colonel", "categories": ["Category:Legends articles", "Category:Imperial Army ranks"], "nodes": [{"tag": "h1", "text": "High Colonel"}, {"tag": "p", "text": "High Colonel is the title given in the Imperial Army to the officer commanding a Battlegroup, as well as the title given in the Stormtrooper Corps to the officer commanding a Legion. In the latter case, \"High Colonel\" is the highest rank available to the entire branch."}, {"tag": "p", "text": "A typical High Colonel had four regiments under his command, totaling just over ten thousand front-line troops, with the next highest rank being General. Such a command represented a significant military resource usually deployed for extended campaigns against organized enemies, although Imperial Army strategists did not consider it enough to undertake the conquest or pacification of an entire planet."}, {"tag": "p", "text": "One such campaign was fought on Picutorion, under High Colonel Drost in cooperation with Commodore Bevven of the Imperial Navy"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rank of High Colonel originates in the Imperial Sourcebook. Officers holding this rank are senior to the Lieutenant Colonels in command of Regiments but below the Major Generals in command of Corps; the Battlegroups which High Colonels command are said to be newly-introduced formations analogous to former Divisions."}, {"tag": "p", "text": "Beyond this, there is no canon evidence for exactly how the position of High Colonel fits into the fictional hierarchy of the Imperial Army, and a number of options remain possible:"}, {"tag": "p", "text": "Considering that the Battlegroup is said in the source to be a newly-created level of command replacing the Division, it may be that the rank of High Colonel was created along with the formation; also, there is nothing to say that \"High Colonel\" was any longer-lived than the comparable rank of \"Colonel-Commandant\" in the British Army."}, {"tag": "p", "text": "It is often said that the rank insignia for High Colonel consists of six yellow squares with a code cylinder worn on either side of the badge; but this is merely a popular fanon conjecture, apparently originating on the Imperial Insignia page at the Star Wars Technical Commentaries website."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}