{"url": "High_Council_(Galactic_Alliance)", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Galactic Alliance organizations", "Category:Galactic Alliance Senate organizations", "Category:New Jedi Order organizations"], "nodes": [{"tag": "h1", "text": "High Council  (Galactic Alliance)"}, {"tag": "p", "text": "The High Council, or Special Council, was the ruling council of the Galactic Federation of Free Alliances. The High Council was unique in its form, containing a distinct balance of six Jedi and six Galactic Alliance leaders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The High Council was established by Chief of State Cal Omas during his reforms prior to the creation of the Galactic Alliance, possibly named or based after the earlier New Republic High Council. Jedi Master Luke Skywalker was an instrumental force in the establishment of the Council. The Council was created in 28 ABY on the planet Mon Calamari and governed the Galactic Alliance until the end of the war against the Yuuzhan Vong. The Council continued to govern from Denon and Coruscant following the conclusion of the war."}, {"tag": "p", "text": "While the Galactic Alliance Advisory Council was the primary executive body of the Galactic Alliance, the High Council was considered better suited for the prosecution of the war, and many important officials often brief the council, including Ayddar Nylykerka. Nylykerka became so important during the war, that he was granted temporary status on the Council. Nylykerka's position on the Council was removed with the end of the war."}, {"tag": "p", "text": "All sessions were recorded by a protocol droid, which also served as a translator. C-3PO initially served in this position, though a new protocol droid was assigned following the Yuuzhan Vong War."}, {"tag": "p", "text": "After the Swarm War, Luke Skywalker dissolved the Jedi's role on the High Council, feeling that the Jedi should not make policy for the Galactic Alliance. The new system would have the Order's Grand Master meet and discuss events with the Chief of State. The High Council thus became obsolete, and the Galactic Alliance Advisory Council replaced it as the key body in the Alliance."}, {"tag": "h2", "text": "Yuuzhan Vong War"}, {"tag": "p", "text": "The original High Council governed from 28 ABY until the end of the war against the Yuuzhan Vong in 29 ABY from Mon Calamari."}, {"tag": "p", "text": "Following the end of the war against the Yuuzhan Vong, Sien Sovv and Dif Scaur both resigned, primarily over the fall of Coruscant and the Alpha Red scandal, respectively. Ayddar Nylykerka was not a part of the first meeting of the High Council, but was added before the end of the war."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}