{"url": "High_General", "categories": ["Category:Legends articles", "Category:Imperial Army ranks", "Category:Military ranks"], "nodes": [{"tag": "h1", "text": "High General"}, {"tag": "p", "text": "The title of High General indicated a senior position within the Imperial Army. A High General normally controlled a Systems Army, a largely bureaucratic level of command immediately subordinate to the Surface Marshal in charge of a Sector Army, and consisting simply of a non-combatant headquarters detail, responsible for coordinating front-line Corps and Armies, and keeping track of the resources available within a sector, so that they could be deployed in support of those field formations as required. They were sometimes referred to by the title of Commander."}, {"tag": "h2", "text": "Other Military Forces"}, {"tag": "p", "text": "The title of High General was not limited to the Imperial military, however. Shortly before the outbreak of the Clone Wars, the military commander of the planet Typha-Dor was High General Bycha, and during the subsequent conflict, the rank of High Jedi General was given to the Jedi Generals commanding the ten Systems Armies in the Grand Army of the Republic. These Jedi officers were presumably in some ways prototypes of the later High Generals of the Imperial Army, but the significance of the rank of High General may have evolved considerably under the Empire, as the organization of the associated Systems Army formation certainly did. During the Galactic Civil War, the title was also used by the Rebel Alliance. The title was also used as far back as the Hundred-Year Darkness by Ajunta Pall, the leader of the Dark Jedi."}, {"tag": "h2", "text": "Notable High Generals"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The title of High General appears only in a short paragraph in the Imperial Sourcebook, where it is given to officers set above the Generals in command of a standard field Army of four Corps formations, but below the Surface Marshal, who is the local Moff or a deputized commander in charge of all Imperial Army operations inside his sector. The authors may have inteneded there to be two High Generals within a Sector Army, but the text would also allow a single High General to serve as an administrative deputy to the Surface Marshal, or perhaps varying numbers of them according to the strength of forces deployed."}, {"tag": "p", "text": "A further problematic issue is the exact meaning of the title of \"High General\". Within the hierarchy given in the Imperial Sourcebook, a High General is implicitly equivalent to a Fleet Admiral in the Imperial Navy; in spite of the superficial similarity of terminology, the Navy rank of High Admiral is in contrast equal to Surface Marshal. But it is not completely clear that any of these positions are proper hierarchial ranks, rather than titles signifying certain levels of senior command and borne additionally to substantive ranks."}, {"tag": "p", "text": "These problems with understanding the exact role and status of a High General in the Imperial Army are all compounded by the fact that canon sources offer very few examples of officers explicitly identified as holding this rank. The only exception appears to be High General Sutt Ramic, the commander of one of the three Golan III battlestations protecting Muunilinst in 19 ABY, and said to be the senior military officer based at the financial capital of Imperial Space. It is unclear whether Ramic's seniority is simply due to his rank in the hierarchy, or whether it reflects a specific commission, and if the latter is the case, the question then arises whether his sphere of command was limited to Muunilinst's defenses or its specific star system, or whether it extended across a wider reach of space and territory. And even if those questions could be answered, we would then have to ask whether the command hierarchy at Muunilinst is in any way typical of Imperial Space as a whole, and whether the hierarchy at this point in time in any way corresponded to the models of twenty years earlier."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}