{"url": "Higher_Skies_Advocacy_Group", "categories": ["Category:Canon articles", "Category:Legal companies"], "nodes": [{"tag": "h1", "text": "Higher Skies Advocacy Group"}, {"tag": "p", "text": "The Higher Skies Advocacy Group was a lobbying group that advocated the interests of the people of Coruscant, such as addressing inadequate housing arrangements, to the government of the Galactic Empire. The head of Higher Skies was Driller MarDapp. During the Imperial Era, MarDapp recruited Arihnda Pryce, a native of the planet Lothal, into the organization. With Pryce's help, the Imperial Security Bureau learned that Higher Skies was involved with Nightswan's spy ring—an organization that used espionage to monitor members of the Imperial Senate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Higher Skies Advocacy Group was a Coruscanti special interest group led by Driller MarDapp during the era of the Galactic Empire. In public, Higher Skies was known for advocating the interests of Coruscant's population, such as inadequate housing arrangements, to the Imperial government. Unknown to the Empire at the time, the group's leader was affiliated with a spy ring that monitored the Imperial Senate on behalf of an insurgent known as Nightswan. Utilizing a thief program hidden inside its brochure data cards, Higher Skies was able to obtain information on multiple senators. It also worked with the Yinchom Dojo instructor Juahir Madras to recruit and turn government bodyguards into spies."}, {"tag": "p", "text": "At some point, MarDapp hired Arihnda Pryce in the hopes of using her to the ring's advantage. However, Higher Skies activities attracted the suspicions of Thrawn and Colonel Yularen who suspected Higher Skies and Yinchom Dojo's connection to Nightswan. They gained their opportunity to investigate them when Moff Ghadi attempted to blackmail Pryce into spying for him. Because he pulled a similar trick on her before, Pryce dug up some dirt on Ghadi and went straight to Thrawn. Thrawn advised her to gain Tarkin's support and to be willing to turn on Higher Skies as he believed they were more than they seemed. Pryce then met with Yularen who revealed his and Thrawn's suspicion that some members of Higher Skies are Rebels. Yularen also discovered the thief program and made a double layer thief program. Pryce discovered the group's link to Nightswan and took what she knew straight to Tarkin. She used this information to gain influence in the Empire by reporting the groups' activities to the Imperial Security Bureau and Grand Moff Tarkin, resulting in multiple arrests and the start of Pryce's rise to power."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}