{"url": "Hijacking_of_the_Executor", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Battle stubs", "Category:Battles of Kuat", "Category:Duels", "Category:Events during the Imperial Era"], "nodes": [{"tag": "h1", "text": "Hijacking of the Executor"}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Doctor Cylo and his fleet attempted to hijack the Executor-class Star Dreadnought Executor while the flagship was still under construction in the Kuat system by the shipyards operated by Kuat Drive Yards."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the War on Shu-Torun, Cylo collaborated with the ore-barons in an attempt to kill the Dark Lord of the Sith Darth Vader. However, Vader survived and led the Empire to victory. Morit Astarte had killed his sister Aiolin Astarte, as she was a competitor to him, and he fled with Cylo and Tulon Voidgazer. After this, Vader would be sent by his master to hunt them down. Meanwhile Vader sent the two maniacal droids 0-0-0 and BT-1 to capture Doctor Chelli Lona Aphra and bring her to the Executor, as she knew about his plot against the Emperor. Vader took the Devastator to the Crushank Nebulae where he led TIE fighters in an attack on Cylo's fleet. Cylo escaped, but not before Vader got aboard his flagship. He went through the labs and eventually confronted by Voidgazer, who put him against her cyberanimate rancor. However, it was no match for Vader, who slew the beast before killing Voidgazer."}, {"tag": "h2", "text": "The Battle"}, {"tag": "h3", "text": "The hijacking"}, {"tag": "p", "text": "As Vader was fighting Voidgazer, Cylo's fleet emerged from hyperspace. On the bridge of the Executor, General Cassio Tagge ordered the batteries to open fire. However, they found the weapons, doors, and controls offline and watched with horror as sleeping gas emerged from the vents and knocked them out. In the Emperor's throne room, a Royal Guard informed him they are operating on their own life-support system. In a last ditch effort, Cylo and Morit abandoned their flagship and set it on a collision course with the Executor. Vader reached the bridge of the flagship to stop the collision course, but found that it couldn't be altered."}, {"tag": "p", "text": "Aboard the ship, Cylo's forces found the crew knocked out and took the bridge. They then activated ion charges to disable pursuing ships. However, before they could escape, the power went out. Vader then contacted them and revealed that he had cut the power and that he was coming for them. Morit went to deal with Vader while Cylo's troops went to capture the Emperor."}, {"tag": "h3", "text": "Retaking the ship"}, {"tag": "p", "text": "Meanwhile, Aphra had used the programming of BT-1 and 0-0-0 to get them to help free her. She decided that in order to get Vader off her tail, she had to report his plot to the Emperor. She alongside the droids, and the Wookiee bounty hunter Black Krrsantan, who was there because she owed him a great deal of money, went to defend the Emperor from Cylo's troops. Morit met up with Vader on the hull where they dueled. Vader Force-pushed Morit onto a ledge where he regained balance, only for Vader to destroy it with the force, killing him. As Vader approached the bridge, the troops sent to capture the Empire withdrew and went after Vader, who killed them all. When he arrived at the bridge Cylo reminded him he was his machine as he deactivated him with a button."}, {"tag": "p", "text": "Vader had a vision in which he returned to Mustafar and killed Obi-Wan Kenobi and Anakin, then choked Padmé Amidala. He then stated Anakin was dead as he awoke, shocking Cylo. He then stabbed Cylo-V and killed him. Aboard Cylo's whale fleet, Cylo-VI awoke desperate to escape. Vader departed in his TIE Advanced x1 and informed the Emperor that the ship was under Imperial control as he raced off to stop Cylo's escape. Right then, Aphra barged into the Emperor's chamber to explain Vader's plot."}, {"tag": "h3", "text": "Ending Cylo"}, {"tag": "p", "text": "Vader pursued Cylo as his fleet tried to stop him from getting to the flagship. The flagship escaped, but not before Vader boarded it. He took out all of Cylo's marines and as he went through the cloning chamber, he was confronted by the clones of Cylo. As they taunt him he killed them all with ease. He then confronted Cylo-VI on the bridge, who still bragged that he was immortal. However, Vader used the Force to send the ship into the sun and left as the ship is torn apart, ending Cylo."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Vader then returned to the Executor to report his victory. The Emperor revealed that Aphra told him of his treason. Instead of being angry, he congratulated Vader and left him to deal with Aphra. Vader ejected Aphra out the airlock and then went to meet Tagge and the Emperor on the bridge. The Emperor left Vader with command of Death Squadron and as soon as he departed, Vader killed Tagge and gave Admiral Kendal Ozzel two weeks to have the Executor ready for action. Aphra ended up being rescued by Black Krrsantan, with Vader now off her tail since he believed her to be dead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}