{"url": "Hill_Purpura", "categories": ["Category:Canon articles", "Category:Alliance Military officers", "Category:Criminals", "Category:Humans", "Category:Males", "Category:Rebel Alliance defectors"], "nodes": [{"tag": "h1", "text": "Hill Purpura"}, {"tag": "p", "text": "Hill Purpura was a human male who held the rank of commander in the Rebel Alliance during the Galactic Civil War against the Galactic Empire. After the rebel defeat at the Battle of Hoth, Purpura lost hope in the cause, making a deal with the bounty hunter Dengar to sell the transponder codes of the rebel armada to the Empire. In command of the transport Spirit of Jedha, Purpura had the vessel sabotaged while in hyperspace after evacuating the rebel base on the planet Lowik. The transport was left stranded in the Terminus, where it was attacked by the pirates of the Ohnaka Gang under Captain Skragg, who had captured Dengar en route and forced him to reveal Purpura's plan."}, {"tag": "p", "text": "The bounty hunter Beilert Valance was sent by Lieutenant Kondra to rescue the rebels of the Spirit of Jedha, but Purpura had Valance imprisoned aboard the transport, refusing to let him interfere. Though Purpura met with Dengar and Captain Skragg, Valance was able to deactivate the Spirit of Jedha's power, leaving it in darkness and ambushing the pirates aboard. Once the pirates had restored power to the transport, they were attacked by Valance, and Skragg was forced to escape. Having had his plan to betray the Rebellion foiled, Purpura turned his blaster on Valance, but was knocked unconscious by the mechanic Blanch Sproull. Lieutenant Kondra and his forces eventually arrived to rescue the transport after receiving a message sent by Valance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Losing spirit"}, {"tag": "p", "text": "As a child, Hill Purpura resided on the planet Corellia. On Corellia, he competed in swoop racing with his friend Dengar; while Purpura believed that he often beat Dengar, his friend would later claim otherwise."}, {"tag": "p", "text": "Purpura eventually came to join the Alliance to Restore the Republic by the time of the Galactic Civil War against the Galactic Empire, attaining the rank of commander in the Alliance Military. After the Rebel Alliance's loss during the Battle of Hoth in 3 ABY, Purpura became disillusioned with the rebel cause, believing that it was hopeless. He made a deal with Dengar, by that point a bounty hunter, to sell the transponder codes of all starships in the rebel armada to the Empire. In the time following the battle, Purpura commanded the transport Spirit of Jedha, a starship present at the rebel outpost on the planet Lowik. After the rebel forces on Lowik were forced to evacuate, Purpura orchestrated the sabotage of the transport's hyperdrive motivator, causing the Spirit of Jedha to drop out of hyperspace at Terminus, the intersection between the Corellian Trade Spine and Hydian Way hyperspace routes."}, {"tag": "p", "text": "However, while making his way to the transport's location, Dengar had a run-in with Skragg, the pirate captain of the Ohnaka Gang. Skragg took Dengar captive due to debts that he owed, and he was forced to reveal his deal with Purpura to the pirates. Captain Skragg, intending to take the Empire's reward for the ex-rebel's information, had her pirate forces ambush the Spirit of Jedha as it fell out of hyperspace, destroying its two X-wing escorts."}, {"tag": "h3", "text": "Enter Valance"}, {"tag": "p", "text": "When the Spirit of Jedha failed to make it to the rendezvous, Lieutenant Kondra—unable to contact Rebel Command or spare ships to mount a rescue—sent the bounty hunter Beilert Valance, who was responsible for the necessity of the evacuation of Lowik, to save the transport's crew. After the bounty hunter arrived at Terminus and reached out to the Spirit of Jedha, his starship came under attack by the pirates. Valance's ship sustained heavy damage, and he landed in the transport's hangar, where Purpura and his rebel crew met the hunter."}, {"tag": "p", "text": "Though Valance insisted that Kondra had sent him to rescue the Spirit of Jedha, Purpura claimed to be dubious of his intentions, imprisoning him within a cell aboard the transport. Alleging that he did not wish for any more rebels to be killed, Purpura stated his intent to surrender, leaving the mechanic Blanch Sproull to guard Valance's cell. Sproull, seeing Valance as their only hope for survival, freed the bounty hunter, who commandeered a half-functioning X-wing to attack the pirates."}, {"tag": "p", "text": "Aboard the transport's bridge, Purpura ordered the starfighter to stand down, though Valance refused. Valance tasked his astromech droid with escaping to hyperspace and relaying a message to Kondra, but ejected from the vessel before it jumped, clinging onto the transport's exterior. Purpura was thankful for Valance's apparent jump to hyperspace, though the other rebel on the bridge noted that there was no longer anything preventing the pirates from boarding. Admitting he knew that, Purpura placed his blaster to the back of his fellow crewmember, killing the rebel as the pirates began to board the Spirit of Jedha."}, {"tag": "h3", "text": "Traitor versus hunter"}, {"tag": "p", "text": "While the Ohnaka Gang pirates took control of the transport, Skragg and Dengar met Purpura on the bridge, where the bounty hunter introduced the commander as his contact. Purpura greeted Dengar, noting how his old friend's appearance had changed since their time on Corellia. Skragg interrupted, ordering Purpura to provide the rebel transponder codes, but Purpura revealed that he had memorized the database. At that point, Valance—who had boarded the Spirit of Jedha once more and rescued the remaining crew—cut the transport's power, plunging the ship into darkness."}, {"tag": "p", "text": "As Valance stalked the darkened corridors, killing the pirates, Purpura accompanied Dengar and Skragg to the engine room, where Valance had previously freed the rebel crew. One rebel attacked the group, and was swiftly killed by Skragg. Speaking discreetly to Purpura, Dengar asserted the need to kill Skragg, aware that she would do the same to them, and Purpura did not object, satisfied with having to split less of the Imperial reward."}, {"tag": "p", "text": "Purpura, Dengar, and Skragg watched as two pirates reactivated the transport's power, bringing its systems back online. Valance emerged from behind to attack the pirates, while Dengar took the opportunity to defeat Skragg, though the pirate captain managed to escape. Furious that Valance had ruined his chance to escape the Rebellion, Purpura aimed his blaster at the bounty hunter, accusing him of not knowing how it felt to lose hope in a cause he had believed in. Sproull hit Purpura in the back of the head with a metal rod, incapacitating the ex-rebel."}, {"tag": "p", "text": "Following the failure of Purpura's plan, Valance commandeered the pirates' frigate, departing with Dengar captive in tow. After receiving Valance's message, Kondra and a force of rebel ships arrived at the Spirit of Jedha's location, and the lieutenant was surprised when Sproull responded to his hail rather than Valance or Commander Purpura."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A self-proclaimed survivor, Hill Purpura lost hope in the Rebel Alliance after its defeat in the Battle of Hoth, believing that he had been indoctrinated into supporting a futile cause. Purpura regarded trust and idealism as the reasons for the rebel loss during the battle and did not consider himself to be so naive as to possess those qualities. His loss of hope in the Rebellion led him to attempt to betray his former comrades, selling them out to the Empire."}, {"tag": "p", "text": "When first confronting Valance, Purpura accused the bounty hunter of knowing nothing of duty or sacrifice for a greater cause, contrary to his true opinion toward the Rebellion. Though Purpura claimed responsibility for the lives of his rebel crew, he in fact had no regard for their deaths at the hands of the pirates, even turning his own blaster on a fellow rebel. Purpura was not opposed to Dengar's suggestion of killing Captain Skragg, either, content with not needing to cut his reward with the pirate captain. The commander showed disdain toward Valance, remarking upon the bounty hunter's nature as a cyborg. Skragg described Purpura as an \"arrogant fool.\""}, {"tag": "p", "text": "A human male, Hill Purpura had brown hair, blue eyes, and light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Hill Purpura wore a long gray coat over a light tan shirt, red undershirt, and brown pants. He also wore a belt with a pack attached to it, as well as gray gloves and boots. Purpura wielded a blaster that he kept in a holster on his hip. Following the time of the Battle of Hoth, Purpura was the commander of the Spirit of Jedha, a transport carrying mining supplies, sabotaging his ship in order to betray the Rebellion. After Valance deactivated the transport's power, Purpura carried a light to illuminate the darkened ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hill Purpura first appeared in the comic Bounty Hunters 9, written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on January 27, 2021."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}