{"url": "Amani", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles in need of updating", "Category:Amanin", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Amani"}, {"tag": "p", "text": "The Amanin were a sentient yet primitive species from the planet of Maridun. They were tall, flat-bodied aliens with long, gangly arms, and wrinkly hides covered in slime. At the time of the Clone Wars, there were Amani living on Utapau. Those were considered dangerous by the Pau'an authorities, and their technology level was low."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Amani were tall, thin sentients with short legs, gangly arms long enough to reach the ground, big hands, and yellow-and-green skin coated in slime. They were capable of curling themselves into a ball and rolling as a means of locomotion. The species had an average height of two meters and a life expectancy of 90 standard years. Their natural habitat was plains and grassland."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Compared to many other species, the Amani were considered primitives. They had a tribal organization and dwelled in simple tents. They were also regarded as dangerous, and Amani head hunters were once highly sought after. Amani were often seen carrying staffs on which were strung several skulls."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Amani hailed from Maridun, an Outer Rim planet covered in grass plains. During the Clone Wars, a conflict that pitted the Galactic Republic against the Confederacy of Independent Systems, they came to share their homeworld with a group of Lurmen refugees."}, {"tag": "h2", "text": "Amani in the galaxy"}, {"tag": "p", "text": "During the High Republic Era, one Amani worked as a scientist for the Galactic Agricultural Alliance."}, {"tag": "p", "text": "By the time the Clone Wars was drawing to a close, the Amani had recently established settlements on Utapau, where they co-existed with the native Pau'ans and Utai, living as immigrant hunter-gatherers. They set up their encampments on the plains or underground, but rarely ventured into the cities. At that time, General Grievous used a rogue Amani as a bodyguard to facilitate a major arm deal with the Sugi. The Jedi Master Tu-Anh was killed while investigating the matter, which prompted Anakin Skywalker and his master, Obi-Wan Kenobi, to embark on a mission to Utapau. Once there, the two Jedi visited the Amani quarter in Pau City, where they learned from the local chief that an Amani outcast from the plains had been consorting with some Separatist IG-100 MagnaGuards."}, {"tag": "p", "text": "Using this information, Kenobi and Skywalker traveled on winged dactillion mounts to the plains of Utapau. They sighted an Amani encampment that was home to several Amani outcasts, who attacked them with spears, arrows, and precision laser darts. The two Jedi overpowered their attackers, but the Amani fled into the wilderness. While tracking the Amani outcasts, the two Jedi were captured by a party of Sugi mercenaries, who had found a large kyber crystal that they were planning to sell to the Separatist leader Count Dooku. These Sugi were accompanied by at least one Amani outcast. Later, the two Jedi fought their Sugi captors and stole the crystal."}, {"tag": "p", "text": "While looking for a beast of burden to help them transport the kyber crystal, Kenobi encountered a plains Amani villager but used a Jedi mind trick to convince him that he had not seen the Jedi. Meanwhile, the Sugi leader Endente tried to cover up the theft of the kyber crystal by claiming that they could no longer rely on the plains Amani to guard it. To cover up the theft, Endente instructed Grievous to meet them at Pau City. However, Grievous saw through the deception and executed Endente."}, {"tag": "p", "text": "Many years later, shortly before the Battle of Endor, an Amani bounty hunter known as Amanaman was present in the palace of Jabba the Hutt on Tatooine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the original version of the Maridun Pacifists arc, the Amani were to be the pacifistic tribe instead of the Lurmen colonists."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}