{"url": "Hilts_Restoration", "categories": ["Category:Legends articles", "Category:Stub", "Category:Time periods"], "nodes": [{"tag": "h1", "text": "Hilts Restoration"}, {"tag": "p", "text": "The Hilts Restoration was a period of time on the planet Kesh immediately following the end of the Time of the Rot and the Great Crisis in 3000 BBY. It took its name from the Sith Caretaker Varner Hilts, who became Grand Lord of the Lost Tribe of Sith and ushered in the new era. One of the first policies enacted by Lord Hilts was to allow Force-sensitive Keshiri, a purple-skinned species native to Kesh, to join the Lost Tribe as Sith Tyros and Sith Sabers. Under Hilts' leadership, the Tribe also rebuilt the cities of Keshtah Minor, the continent that was the main domain of the Tribe."}, {"tag": "p", "text": "The most important element of the Hilts Restoration were efforts to reach and annex Alanciar, a continent which was separated from Keshtah by a wide ocean. Hilts tasked his chief engineer and High Lord Edell Vrai with the task of developing a way for the Tribe to travel to Alanciar safely. After twenty five years of experimenting with uvaks and watercraft, Vrai succeeded in developing airships which were powered by helium and methane extracted from the volcano Sessal Spire. These airships were used during the Tribe's invasion of Alanciar in 2975 BBY. In the end, Hilts succeeded in using the Alanciari Keshiri man Jogan Halder to convince the Alanciari that the Sith did not pose a threat to them. Thus, the Alanciari willingly submitted to Sith rule."}, {"tag": "p", "text": "Following the annexation of Alanciar, the Tribe gained access to the continent's industrial base and forests. This enabled them to build a fleet of wooden sailing ships which allowed them to explore the other regions and oceans of Kesh. By 44 ABY, the Sith controlled the entire planet and had realized their goal of reaching the stars. Another legacy of the Hilts Restoration was the Testament of Varner Hilts, which replaced the earlier Yaru Korsin. It was read every Testament Day and acknowledged the Tribe's Tapani origins and their ancestors' experience of being slaves to the Sith Lord Naga Sadow."}, {"tag": "h2", "text": "Appearances"}]}