{"url": "Hiram_Drayson", "categories": ["Category:Legends articles", "Category:Alliance Fleet admirals", "Category:Businesspeople", "Category:Chandrilans", "Category:Humans", "Category:Males", "Category:New Republic Defense Fleet admirals", "Category:New Republic Intelligence personnel", "Category:Republic Navy personnel"], "nodes": [{"tag": "h1", "text": "Hiram Drayson"}, {"tag": "p", "text": "Hiram Drayson was a Human male from Chandrila, known as a military commander and intelligence administrator."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Drayson attended an offworld military academy, but returned home with his education incomplete when his father became ill. He took over his father's shipping business; under his leadership, it became the most successful such business in the Chandrila system. Because of this and his partial Academy education, the Chandrilan government made him the head admiral of the Chandrila Defense Fleet. He reorganized it to run more efficiently, cutting down piracy and smuggling dramatically. It was in his capacity as fleet commander that he came to know Senator Mon Mothma. During the Clone Wars, Admiral Drayson was replaced as fleet head by Palpatine-appointed Kohl Seerdon after the passage of Emergency Amendment 121b. At some point in his career, he gained extensive experience serving aboard Star Destroyers, including a professional knowledge of their tractor beam systems."}, {"tag": "p", "text": "When Chandrila was brought to heel under the Imperial Starfleet, Drayson was contacted by Mon Mothma, who offered Admiral Drayson a role in the military leadership of the new Rebel Alliance as the commanding officer of the Alliance flagship. He accepted."}, {"tag": "p", "text": "As the Alliance transitioned into the New Republic, Admiral Drayson commanded the New Republic Second Fleet prior to the Liberation of Coruscant. Drayson was later placed in command of the fleet attached to the New Republic Provisional Council, and then of the Coruscant defense fleet. He was tasked with the retrieval of the Katana fleet during the Thrawn campaign. As a military commander, Drayson was considered competent but not very creative, which left him rather outmatched when Grand Admiral Thrawn carried out an elaborate attack against Coruscant. His intense personal loyalty to Mon Mothma also led to some friction with Garm Bel Iblis, as he felt the Corellian General had betrayed Mothma by splitting away from the Rebel Alliance years earlier. Later, Drayson's command experience, strategic mind and extensive contacts made him the ideal candidate for first Director of Alpha Blue, and Mon Mothma appointed him under decree D9020616."}, {"tag": "p", "text": "After decades of service in the New Republic Intelligence Service apparatus, years that earned him the nickname \"the Old Ghost of Coruscant,\" Drayson retired from service following Borsk Fey'lya's election. He was married to Joi Eicroth for a time. He had a daughter, Bhindi Drayson, who also served in New Republic Intelligence, as well as Wraith Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}