{"url": "Hiran_Bessiker", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Humans", "Category:Males", "Category:Sith acolytes and apprentices of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Hiran Bessiker"}, {"tag": "p", "text": "Hiran Bessiker was a Human male Sith apprentice who was active during the Cold War between the Galactic Republic and the Sith Empire. He was the son of Major Bessiker."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 3643 BBY, Hiran was sent to the Sith Academy on Korriban to be trained as a Sith. He was able to complete his trials which impressed his father, who would then brag about his success to Kallig. Hiran believed that non-force users in the Sith Empire such as his father were nothing more than \"pawns in [the Sith's] game\", and considered aliens to be \"scum\". He later returned to Balmorra to help his father on several missions. When he was able to find a holocron, he was suddenly captured by Republic forces when Iannos Tyrek betrayed the Empire."}, {"tag": "p", "text": "While captured, his father sent Sith Inquisitor Kallig who was here to search for an artifact of Tulak Hord. He expressed his disdain towards his father to the Inquisitor, and demanded to be released. The Inquisitor refused, and attempted to seal Hiran in the cell he was in with a blast of force lightning. Hiran escaped, and fought the Inquisitor in an intense duel. Though he fought competently, he was ultimately no match for the combined forces of Kallig and Khem Val."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If the player chooses to free Hiran, he will mock the player saying that the Inquisitor and his father are both weak. He says his father didn't mention that the player is a \"filthy alien\" if the player is any species that isn't Human, Sith, or cyborg."}, {"tag": "p", "text": "Hiran Bessiker uses primarily Sith Warrior attacks, as well as Force Shock."}, {"tag": "h2", "text": "Appearances"}]}