{"url": "Hiromi", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Hiromi", "Category:Insectoid sentient species", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Hiromi"}, {"tag": "p", "text": "The Hiromi were a bipedal, sentient, insectoid species. Despite a strong instinct for self-preservation and a large aversion to anything that could bring them harm, the Hiromi saw themselves as a glorious race of mighty warriors. Their government was the Hiromi Empire, and they were members of the Alliance of Free Planets. The Hiromi secretly dreamt of galactic conquest; to achieve their aims, shortly after the Battle of Endor they tried to incite a war between Lahsbane and the Ewoks to tear the Alliance apart, but this plot was foiled. They then tried to conquer Zeltros, but were again foiled when the planet was later conquered by the Nagai, and in turn the Tofs. They gave up their dreams of conquest afterwards, helping the Alliance and the Nagai fight the Tofs."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Hiromi were a green, insectoid sentient species approximately 1.5 meters tall. They had yellow eyes, two long antennae on their heads, and unlike many insectoid species, tongues."}, {"tag": "p", "text": "All Hiromi serving in their invasion force were clad in a uniform of red berets and boots, with the exception of Captain Hookyr, who wore a red hat. They dressed in red, tan, and purple attire."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The most prominent trait of the Hiromi was their instinct for self-preservation. One of their favorite activities was, in their words, \"not getting beaten up\". The Hiromi became very fearful when the possibility of being in danger came up, and were quick to suggest alternatives to fighting—including bringing in reinforcements to fight in their stead, hiding, and going home. Nonetheless, when they were truly needed, the Hiromi charged headlong into whatever task was required of them, though they were no less afraid as they did so."}, {"tag": "p", "text": "The Hiromi had a grandiose image of themselves, claiming to be \"glorious conquerors,\" though their short attention spans meant that their grand long-term plans, such as galactic control, were frequently derailed by thoughts of food or play. The Jedi Knight Luke Skywalker would observe that they enjoyed the work of conquest. Other words they used to describe themselves included \"glorious\", \"ruthless\", and \"supreme\". Hiromi considered themselves to be ruthless masters of interrogation, and backed this claim up by making subjects crack in a short time by relentlessly bombarding them with shouts of \"Talk!\"."}, {"tag": "p", "text": "Another activity the Hiromi enjoyed greatly was cheering. Whenever they achieved any kind of victory, they would praise themselves and let out a cheer. This was, to them, a very important part of any activity. When Luke Skywalker sought to rally the Hiromi, he appealed to their love of cheering by leading them in one."}, {"tag": "p", "text": "Finally, the Hiromi had a great passion for food. Their first task after \"conquering\" Zeltros was to have lunch, and they had nothing but praise for the quality of the Zeltronian food and desserts. The Hiromi knew of the Jedi and the Force only through legends."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "\"The glorious destiny of the Hiromi\""}, {"tag": "p", "text": "Approximately 2000 years before the Battle of Endor, the Hiromi Empire began planning its conquest of the galaxy. Over the next two millennia they watched the shape of galactic affairs and waited in hiding. They heard legends of the Jedi Knights and their powers, though it would not be until their invasion that they saw one, namely Luke Skywalker, in action."}, {"tag": "p", "text": "In 4 ABY, shortly after the Battle of Endor, the Hiromi mothership Kuratcha was dispatched as part of the advanced force of the invasion of the galaxy, and the Hiromi operative Hirog infiltrated the command staff of the Alliance of Free Planets as Admiral Ackbar's aide. Hirog's mission was to destabilize the Alliance to prepare for the Hiromi invasion, which he set about doing by pitting the Lahsbee and Ewoks at war against each other, as these were considered to be the two least dangerous members of the Alliance."}, {"tag": "p", "text": "The first phase of his plot was to arrange it to appear that one of the Lahsbee was engaging in an affair with the Ewok Princess Kamida. The Ewok Tippet, who had been courting her, was outraged, and began rallying his people to fight the Lahsbee. The second phase of the Hiromi plan was to plant a bomb near the Alliance leadership; when it detonated, it would kill all the participants in the conflict, leaving the rest of the galaxy to assume it was the fault of either the Lahsbee or the Ewoks. With the leaders of the Alliance dead, their worlds would presumably split and wage war on each other."}, {"tag": "p", "text": "The situation never reached this point. A stray blaster shot, accidentally fired during an honor duel between the Lahsbee and Tippet, disabled the timing mechanism on Hirog's bomb, causing it to tick uncontrollably towards detonation. Hirog ran screaming from his hiding place, yelling to everyone present about the plans of the Hiromi and their impending doom. As it happened, one of the Lahsbee had transformed into their animalistic form, the Huhk, and when the creature flung a rock at Hirog and missed, it accidentally disabled the bomb. The Hiromi forces on the mothership chose to abandon Hirog and retreated, the Ewoks and Lahsbee made peace, and Hirog was chased from the scene by the enraged Huhk. He somehow escaped, and later rejoined the Hiromi forces."}, {"tag": "h3", "text": "The invasion of Zeltros"}, {"tag": "p", "text": "Not to be defeated, the Hiromi next set their sights upon the world of Zeltros, home of the Zeltrons. Captain Hookyr, leader of the invasion force, decided that with its temperate climate and rich supply of pleasures, Zeltros was the perfect world for their people. Arriving in orbit on the Kuratcha, they dispatched a force to the royal palace. Members of the Alliance of Free Planets had come to Zeltros too, and King Arno and Queen Leonie held a party for them. With the king and queen busy reveling, and many Zeltros drunk, Hiromi scout Ensign Phoebe reported that they had been neutralized, and recommended the Hiromi strike. The rest of the invasion force, meanwhile, \"captured\" Luke Skywalker and the Hoojib Plif, though in fact Skywalker had allowed himself to be taken to see whether the Hiromi had the backing of any stronger allies."}, {"tag": "p", "text": "This accomplished, the invaders then swept into the empty throne room, and, with the Hiromi declaring him \"Hookyr the First\", the ruler of Zeltros, Captain Hookyr took his seat on the Zeltron throne. By his order, the first act of the Hiromi was to go to the royal kitchen and have lunch. Unfortunately for them, two other parties had arrived on Zeltros, the Nagai and the Tofs, each of them determined to conquer the world first. The Tof broke their way into the kitchen and took the Hiromi invaders captive. Altogether, the Hiromi conquest of the palace kitchen was the shortest successful invasion of Zeltros ever recorded."}, {"tag": "h3", "text": "Heroes of the Alliance"}, {"tag": "p", "text": "Skywalker and the Hoojibs, although taken captive by the Tof, did not remain so for long, and after defeating their captors they freed the Hiromi. Four Zeltron friends of Skywalker had been captured by the Tof, and Skywalker enlisted the help of the Hiromi to rescue them from the Tof ship. Though initially frightened, the Hiromi saw it as another chance to fulfill their destiny. Skywalker then turned their interrogation skills against a Tof prisoner, who quickly cracked and told them the codes to infiltrate the Tof vessel in orbit."}, {"tag": "p", "text": "Taking the Kuratcha to the Tof Wayfarer, the Hiromi waited in the ship until Skywalker had dispatched the guards in the hangar. While they wanted to stay beside Skywalker as he sabotaged the Tof ship, Skywalker heaped praise upon, as he said, \"that dauntless, matchless, legendary Hiromi spirit\", and thus inspired the Hiromi to charge off to rescue the prisoners. However, it was not as simple as they expected; the Zeltrons believed the Hiromi were working with their captors and assaulted them, and only the timely arrival of Skywalker saved them. A Tof, meanwhile, began sneaking up on Skywalker; Hirog shouted a warning and shot the Tof, killing him. Having killed a Tof in a fair fight for the first time, the Hiromi were very pleased with themselves, and the gathered party let out a loud cheer. Later, the Hiromi would muse that Skywalker had only helped a little, and that it had been them who had truly helped defeat the Tofs."}, {"tag": "p", "text": "In the wake of their victory. the crew of the Kuratcha put in a request to return home. They believed they could best serve the Alliance and the Hiromi while safely hidden—though they were careful to explain that this did not mean they were afraid."}, {"tag": "h2", "text": "Hiromi in the galaxy"}, {"tag": "p", "text": "Although the Hiromi had plans for conquest since two millennia before the time of the Rebellion, they did not put these plans into action until after the Battle of Endor. However, the Rebel Alliance had known of the Hiromi for long enough that Hirog had time to cultivate a trusted position as Ackbar's aide."}, {"tag": "p", "text": "After their plot was uncovered, the Alliance still did not take the Hiromi seriously as a threat. During their invasion of Zeltros, Luke Skywalker even let himself be taken by them, not fearing that they could do him or anybody any harm, and finding their attempts at conquest humorous. After their unsuccessful bid at galactic domination, the Hiromi made peace with and briefly fought alongside the Alliance of Free Planets, before retreating to their homeworld to wait out the rest of the Nagai–Tof War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Mary Jo Duffy created the Hiromi while she was the head writer of Marvel Comics' ongoing Star Wars series of comics in 1985. Duffy named the Hiromi after Japanese musician Go Hiromi. Hiromi skin color varies between reddish-brown and green throughout their appearances in the comics. By the end of their run in the Marvel series, they were green, and as their most recent appearance this is assumed to be the most accurate portrayal. An alien resembling a Hiromi appears in the thirteenth issue of the Knights of the Old Republic comic series, published in 2007, but it is unclear if it is in fact a Hiromi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}