{"url": "Hober", "categories": ["Category:Canon articles", "Category:61st Mobile Infantry personnel", "Category:Individuals of unspecified species", "Category:Males", "Category:Quartermasters"], "nodes": [{"tag": "h1", "text": "Hober"}, {"tag": "p", "text": "Hober was a male quartermaster in the Rebel Alliance's 61st Mobile Infantry, also known as Twilight Company, who served during the Galactic Civil War. In 3 ABY, he was the recruiting officer for a recruitment drive on the planet Haidoral Prime. The quartermaster later attended a meeting held by Captain Micha Evon about the damages to the hyperdrive of the company's CR90 corvette, the Thunderstrike. After Twilight Company raided an Imperial heavy freighter, Hober led a funeral for the soldiers lost."}, {"tag": "p", "text": "While Twilight Company was on the planet Ankhural, Hober proposed a funeral for the since deceased Evon to First Sergeant Hazram Namir. The quartermaster later attended a meeting where the ex-governor Everi Chalis proposed a new campaign for the company. Hober asked many questions to Chalis during the debating between the meeting attendees. The quartermaster also brought up field promoting Namir to commanding officer. After Twilight Company attacked the planet Mardona III, Hober led the funeral for the soldiers lost during the fighting."}, {"tag": "p", "text": "Twilight Company was stranded on the planet Sullust soon after, and defended the Inyusu Tor mineral processing facility from Imperial forces. Hober served as Namir's aide, passing on messages and orders via comlink. The quartermaster signalled Namir when a lava trap was ready to be set off and was separated from the commanding officer when defending Twilight personnel retreated towards the facility's entrance. The company ultimately won, and Hober arranged a funeral for all the fallen during their time on Sullust, leading the service for over four hours."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Recruitment duty"}, {"tag": "p", "text": "During the Galactic Civil War, Hober served in the Rebel Alliance's 61st Mobile Infantry, better known as Twilight Company, as a quartermaster. He possessed multiple assistants. When the company's Captain Micha Evon, nicknamed Howl, established a more welcoming policy for the recruitment efforts, the quartermaster discussed it in length with First Sergeant Hazram Namir. In 3 ABY, Twilight Company fought forces of the Galactic Empire on the Mid Rim planet Haidoral Prime. Over thirty hours into the fighting, a number of Twilight squads accumulated in the central plaza of the planet's capital city, Haidoral Administrative Center One. By tradition, Twilight Company held an open recruitment drive in the plaza, with Hober being the recruiting officer."}, {"tag": "p", "text": "During the recruitment, Namir made his own assessment of the recruits and gave his recommendations the quartermaster, who shrugged at them. Hober then mentioned Howl's policy to the first sergeant, and Namir remarked that the recruits would have to be crazy to jump aboard a sinking ship. The quartermaster joked that if the first sergeant said that louder, the recruitment would end early. Hober proceeded to question the volunteers about their past and fighting experience, making judgements on who he wanted to be taken in. A trio of potential recruits scuffled until Namir intervened, nodding to the quartermaster after he talked to the three. Hober, looking skeptical, returned to his duty."}, {"tag": "h3", "text": "Freighter raid"}, {"tag": "p", "text": "A short while later, Twilight Company, aboard its CR90 corvette the Thunderstrike and the Braha'tok-class gunship Apailana's Promise, was pursued through the Metatessu sector by Imperial forces tracking a hypermatter leak from the Thunderstrike's hyperdrive. Howl subsequently held a meeting with the top staff and bridge crew of the vessels in the corvette's conference room, inviting Hober, Namir and Chief Medic Von Geiz out of courtesy. The three were not expected to take part in the discussion. As the meeting progressed, Everi Chalis, the Imperial governor of Haidoral Prime who had defected to Twilight Company, proposed boarding an Imperial cargo transport to seize supplies to repair the Thunderstrike's hyperdrive. Namir detailed how Chalis's idea could be carried out, looking at Hober briefly as he did so."}, {"tag": "p", "text": "Twilight Company ultimately raided an Imperial heavy freighter for the supplies. After the raid, Hober hosted a funeral at the Thunderstrike's for the eight soldiers who had died during the raid, his voice being projected over the corvette's intercom system. After the quartermaster read the names of each dead soldier, a Twilight Company member close to the individual gave a eulogy for their late comrade. The soldier Twitch gave Sergeant Maximian Ajax's eulogy, holding up a dented blaster power pack which Hober drained into the vehicle charging station."}, {"tag": "h3", "text": "Consolidation on Ankhural"}, {"tag": "p", "text": "Sometime after, Twilight Company sustained losses to the entirety of their officers with command experience, including Howl. The company then took refuge on the pirate backwater planet Ankhural, where the Thunderstrike and Apailana's Promise received repairs. On one day, the soldier Brand returned from an errand in Ankhural's main city, shaking her head to Hober as to say there was no progress or emergencies to report."}, {"tag": "p", "text": "Hober, Von Geiz, Namir and the senior officers had meetings in the conference room reading updates from engineers and the supply requisitions from Hober. During one meeting, Namir brought up a matter where some soldiers were considering deserting. When the attendees discussed a solution to their problem, Hober suggested a funeral for Howl, claiming that it was past time to hold one. Namir argued against the idea, but submitted to the overwhelming support for Hober's proposal."}, {"tag": "h3", "text": "Operation Ringbreaker"}, {"tag": "p", "text": "Shortly after, Chalis held a meeting proposing Operation Ringbreaker, a campaign which sought to force redeployments from the Kuat Drive Yards to weaken the shipyards for a projected attack. When a round of debates arose around the ex-governor's plan, Hober asked Chalis many questions about the targets before Kuat and the shipyard's defenses. He then had a coughing fit before Von Geiz intervened, Chalis answering Hober's questions after. When a vote subsequently was carried out for Operation Ringbreaker, Hober and the soldiers Gadren and Mzun remained silent. The vote, though, was in favor, and the quartermaster suggested to start takeoff preparations. Hober then brought up the possible decision for Namir to be the new commanding officer, the first sergeant ultimately being field promoted to the role."}, {"tag": "p", "text": "Operation Ringbreaker began with Twilight Company's attack on the warehouse planet Mardona III. After the company left the world, a funeral was held, hosted by Hober. When the quartermaster called the name of the late Sergeant Pol Andrissus, the soldier Carver gave the sergeant's eulogy. After all seven fallen were eulogized, Hober stepped away from the charging station and Chalis took over, briefly murmuring something to the quartermaster before giving a speech to the audience. After the former governor finished, someone muttered \"Onward to victory,\" who Namir—now considered a captain—thought was Hober."}, {"tag": "h3", "text": "Stranded on Sullust"}, {"tag": "h4", "text": "Passing orders"}, {"tag": "p", "text": "Twilight Company continued to attack numerous targets for Operation Ringbreaker. However, the Thunderstrike was shot down during the company's time on the manufacturing planet Sullust. With the Apailana's Promise and its two X-wing starfighters having fled, Twilight Company was stranded on the surface, and fortified at the Inyusu Tor mineral processing facility. The local Imperial garrison soon attacked the Inyusu Tor facility with the backing of the Imperial II-class Star Destroyer Herald."}, {"tag": "p", "text": "Namir chose Hober to act as his aide during the battle, passing orders and messages on via comlink from a peer point. As the fighting begun, the quartermaster reported to the captain that the Herald was descending towards the surface of Sullust. Namir asked how the Twilight personnel were fairing, to which Hober replied that the company knew their jobs. With the battle continuing, the captain then had the quartermaster tell the outer defense lines to slowly withdraw. When AT-ST walkers entered the battlefield, the quartermaster was then made to have the inner artillery target the walkers. Hober asked about the trench teams, but the captain insisted that some of them would survive, asking that a withdrawal of the outer squads to the perimeter be ordered."}, {"tag": "h4", "text": "Rebel victory"}, {"tag": "p", "text": "Namir went to check on other personnel, but soon returned to Hober's side, mentioning the Herald's approach. Hober asked if the troops should pull inside the Inyusu Tor facility, but the captain gave the order more time. As the enemy fire on Twilight Company intensified, Namir pulled the quartermaster into a crouch. The Herald opened fire on the company's outer positions, Hober having to scream into the captain's ear that the troops were still in position. However, the Apailana's Promise and its X-wings arrived and distracted the Star Destroyer. Namir asked how long the ships could survive against the Herald, to which the quartermaster described the struggle to maintain a channel with the Promise and doubted that the gunship and its fighters would last long. The captain remarked that they may not last long either, drawing laughter from Hober."}, {"tag": "p", "text": "As the battle continued, Hober approached Namir again and nodded to the captain when the engineer teams finished burrowing holes for lava to be pumped through as a defense mechanism. Namir gave the go ahead for the lava trap to be used and the Imperial forces were cut off from retreat. The enemies then redoubled their offensive and the Twilight Company forces withdrew to Inyusu Tor facility entrance, Hober being separated from the captain in the process. The Herald soon moved from the battle scene after receiving a power surge. The Imperial forces then chased the company's troops inside the facility, but were gradually whittled away until they were ultimately defeated."}, {"tag": "p", "text": "After the battle was over, Twilight Company conducted a cleanup of the battlefield and scavenged the wreckage of the Thunderstrike. Namir tasked Hober with preparing a funeral for the many Twilight personnel, droids included, that had been lost. The quartermaster and Von Geiz found a speaker for every eulogy. As the funeral went on for almost four hours, the power packs being drained into emergency generators acquired from the native Sullustans rather than a vehicle charging station. Hober also drained the laser cannon plasma cells from the Thunderstrike, with Commander Tohna giving his own eulogy for the corvette in the process."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male individual, Hober became creak-kneed due to his old age. Hober's appearance gave a withered impression on Hazram Namir, who commended the quartermaster's ability to judge potential recruits. Hober also had a natural skill for card games. When Namir that the volunteers on Haidoral Prime were crazy to jump on a sinking ship, the quartermaster snorted and shook his head at the comment, jokingly challenging the first sergeant to say the comment louder. After Namir then questioned some scuffling potential recruits, Hober appeared skeptical when the first sergeant nodded his approval for a young looking volunteer."}, {"tag": "p", "text": "Following Maximiam Ajax's eulogy, the quartermaster took the power pack from Twitch solemnly when inserting it into a charging station. During a discussion on stopping some potential deserters, Hober claimed that it was past time to hold a funeral for the late Howl. After Chalis proposed Operation Ringebreaker, the quartermaster inundated the ex-governor with questions on the targets and Kuat's defenses. Hober ultimately remained silent during the vote on the campaign and decided to bring up field promoting Namir after."}, {"tag": "p", "text": "When Namir ordered artillery to fire during the Siege of Inyusu Tor, Hober was worrisome for the trench teams that may be affected. As the Herald approached the battlefield, the quartermaster asked whether troops should withdraw. After the Apailana's Promise distracted the Star Destroyer, Hober guessed that the gunship may not last long and laughed bitterly when Namir joked that the ground troops did not have long either. For the funeral after the battle, Hober was able to find a speaker for every fallen soldier's eulogy and led the event for several hours."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Hober used a comlink during the Siege of Inyusu Tor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hober appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}