{"url": "Hocekureem_Sea", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Falleen locations", "Category:Seas and oceans"], "nodes": [{"tag": "h1", "text": "Hocekureem Sea"}, {"tag": "p", "text": "The Hocekureem Sea was a saltwater ocean on the Mid Rim planet Falleen. Sometimes referred to as just Hocekureem, it was most well known as the natural habitat of the fleek eel, renowned as a delicacy across the galaxy. The ocean's salt was also sometimes used as a seasoning in salads."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located on the Mid Rim planet Falleen, the Hocekureem Sea was a saltwater ocean suitable for animal life. Often referred to as just Hocekureem, the ocean was the natural habitat of the fleek eel, an edible sea creature that was considered a delicacy by chefs galaxywide."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3964 BBY, a Snivvian self-proclaimed industrialist going by the name \"Baron Hieromarn\" tried to solicit investors on the planet Taris for a venture to bring fleek eels from the Hocekureem Sea to Taris for the local restaurant trade. Promising a three-for-one return on investment, Hieromarn guaranteed that fleek eel would be an Upper City delicacy within eight months. Thousands of years later, Dex's Diner, an eatery in Coruscant's CoCo Town district, offered a dish called the Xizor salad, which was fresh Sizhranian lettuce tossed with Hocekureem Sea salt croutons. On the menu, it was advertised as being \"fit for a Falleen prince!\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hocekureem Sea was first mentioned in the novel Shadows of the Empire, written by Steve Perry and released in 1996. Although never actually making a direct appearance, the Hocekureem Sea was also mentioned in The Taris Holofeed: Prime Edition, an in-universe news report appearing on the last page of the comic Knights of the Old Republic 0, and the 2009 Hyperspace article \"Dining at Dex's.\" In 2008, the Hocekureem Sea was given an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}