{"url": "Hok_Daragon", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Males", "Category:Pilots", "Category:Tetans"], "nodes": [{"tag": "h1", "text": "Hok Daragon"}, {"tag": "p", "text": "Hok Daragon was a male Human starship operator during the years leading up to the Great Hyperspace War. He was the husband of Timar Daragon and the father of Gav and Jori Daragon. During the Unification Wars of the Koros system, Daragon worked as a supply runner with his wife in their ship, the Shadow Runner. On one mission to the planet of Kirrek in 5000 BBY during the midst of a battle, the Shadow Runner was destroyed by pirate forces, killing both of the Daragons instantly. After their deaths, the Daragons' other ship, the Starbreaker 12, was bequeathed to Gav and Jori, who would become hyperspace explorers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Hok Daragon was married to Timar Daragon, and had two children, Gav and Jori Daragon. In 5000 BBY during the Unification Wars in the Koros system, where a political leader named Teta attempted to unify the seven worlds of the Koros system, the Daragons worked as supply runners to Teta's forces in their ship, the Shadow Runner. In time, Teta's forces managed to unify six of the Koros system's seven worlds in mutual commerce and aid. The only planet in the system yet to be unified with the others was Kirrek, where the Tetan soldiers had become besieged by rebels and pirates. The Daragons went to Aarrba the Hutt, who ran a service dock in the Koros system capital of Cinnagar, to repair the Shadow Runner so they could bring relief supplies to the soldiers on Kirrek."}, {"tag": "p", "text": "The Daragons were grateful for Aarrba's services, and in exchange, the Hutt decided to keep the Daragon's other ship, the Starbreaker 12, as collateral until they returned. Gav and Jori asked Hok and Timar if they could assist them on their mission but were refused, as Hok believed that their upcoming mission was too dangerous. Meanwhile on Kirrek, the battle continued, with the Tetan forces now led by two Jedi, Memit Nadill and Odan-Urr. Using an exotic Force power known as battle meditation, the Jedi were able to demoralize the pirate forces and lift the spirits of the Tetan fighters. Finding their backs against the wall, the pirates desperately began to fire on the weakest targets, hoping to eliminate as many as they could before they were defeated. The Shadow Runner reached Kirrek soon afterward, and was quickly attacked by the pirate guns."}, {"tag": "p", "text": "The Daragons decided to fly in low and fast to drop their cargo, but weren't able to maneuver the Shadow Runner well enough due to the heavy load. Caught in a crossfire, the Shadow Runner was destroyed, killing both of the Daragons instantly. The Tetan forces ultimately won the battle, unifying the entire Koros system. After the Daragons' death, Aarrba gave Gav and Jori the Starbreaker 12, and the two vowed to honor their parents by exploring the galaxy.\nThis would prove to be a pivotal moment in galactic history; Gav and Jori would eventually take a blind hyperspace jump and discover the Sith, sparking the Great Hyperspace War."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hok Daragon was a daring individual; he accepted a dangerous mission to Kirrek, knowing full well that the mission was perilous and could end in his death. When confronted with the pirate guns, Daragon took it as a challenge, but panicked once the Shadow Runner was hit and began to crash. Daragon greatly cared for his children Gav and Jori and was mindful of their safety, refusing to allow them along on the mission to Kirrek due to his concerns that it was too dangerous for them. Daragon and his wife were both considered skilled pilots by their children."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hok Daragon made his first and only appearance in Tales of the Jedi – The Golden Age of the Sith 0. He and his wife Timar later received an entry in the 2008 The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}