{"url": "Holiest_of_Holies", "categories": ["Category:Legends articles", "Category:Death Stars", "Category:Interdictor starships", "Category:Mythology", "Category:Ugor culture"], "nodes": [{"tag": "h1", "text": "Holiest of Holies"}, {"tag": "p", "text": "The Holiest of Holies or Holy of Holies was a chunk of wreckage from the first Death Star that was recovered by Ugor scavengers shortly after the Battle of Yavin. The salvage contained a prototype gravity well projector that the Ugors' priest-scientists discovered could be used to order the chaotic spread of garbage in the Ugor's home, the Paradise system. After this discovery, the projector was dubbed the Prime Mover, and the wreckage in which it was housed was called the Holy of Holies or Holiest of Holies."}, {"tag": "p", "text": "An Ugor cordon of Black Hole-class Salvage Dreadnoughts patrolled the area surrounding the wreckage and its holy component. The Holiest of Holies had a mass of 40,000 tons. It certainly looked like wreckage; visitors were greeted with a patchwork of destroyed conduits, deck supports, and hallways. Because its outer surface was completely destroyed, it was not easily identifiable as coming from the Death Star."}, {"tag": "p", "text": "Inside the hunk of space station, artificial gravity allowed for normal movement. Nevertheless, there was no oxygen, so breath masks were required. Visitors found the shadows and echoes of the interior somewhat disconcerting. Imperial matériel, such as stormtrooper armor and blaster rifles, was scattered willy-nilly throughout the corridors. Among the surviving chambers in the wreck were a garbage compactor and Darth Vader's personal quarters and meditation chamber (complete with a spare cloak and helmet). Force-sensitive individuals could still detect a residual evil in this area. Obi-Wan Kenobi's lightsaber also survived and could be found in the wreckage. The gravity well projector lay at the center of the hulk in a high-ceilinged chamber with broken transparisteel viewports."}, {"tag": "p", "text": "The rubbish was inhabited. For one, a group of malfunctioning automata known as Void Droids roamed the wreckage. Desperate for power cells and spare parts, they attacked anyone who entered the holy site. A diseased and injured dianoga lived in the remains of a garbage smasher."}, {"tag": "p", "text": "When the Alliance to Restore the Republic eventually located the debris and captured the gravity well projector, the Paradise system devolved back into chaos."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}