{"url": "Amaxine_warrior_crisis", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Battles of the Amaxine warrior crisis", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Expansion Region", "Category:Conflicts of the Inner Rim", "Category:Events during the New Republic Era", "Category:First Order", "Category:New Republic"], "nodes": [{"tag": "h1", "text": "Amaxine warrior crisis"}, {"tag": "p", "text": "The Amaxine warrior crisis was a period of political turmoil that occurred approximately 24 years after the Battle of Endor between the New Republic and the Amaxine warriors, a paramilitary faction secretly supported by an mysterious power from the Unknown Regions known as the First Order that was descended from the Old Empire, which had began chanelling funds via the Rinnrivin Di's cartel through to the Amaxine warriors in order to restore the Imperial Navy. Over a seven year period, Rinnrivin created a criminal empire based on smuggling and gambling. Eventually, Rinnrivin's activities exacted a heavy economic toll on the Gaulus sector."}, {"tag": "p", "text": "Following a request by the Ryloth government, the New Republic senators Leia Organa and Ransolm Casterfo investigated the criminal syndicate and uncovered its links to the Amaxine warriors. The Amaxines, led by the former Imperial officer Arliz Hadrassian, bombed the Senatorial conference building in Hosnian Prime, in a failed attempt to distract the Galactic Senate. This drew Leia and Ransolm's attention to the Amaxines. The conflict also coincided with political tensions between the Centrists and Populists, two powerful factions in the Galactic Senate, and plans to create a new post called First Senator."}, {"tag": "p", "text": "While visiting Daxam IV, Casterfo gained Hadrassian's trust and learned that the Amaxines' main base was located on the planet Sibensko in the Expansion Region. Meanwhile, Leia and her team discovered that Rinnrivin was also hiding on Sibensko. Before the two senators could travel to Sibensko, the two fell out after Lady Carise Sindian, a clandestine agent of the First Order, supplied information about Leia's true parentage as the daughter of Darth Vader. Due to the political fallout, Leia's credibility was undermined and she was forced to withdraw her nomination for First Senator. Undaunted, Leia and her team traveled to Sibensko and obtained information linking the Amaxines to Rinnrivin."}, {"tag": "p", "text": "Rinnrivin's cartel and the Amaxines were wiped out during an explosion which destroyed their underwater city. While most of the New Republic Senate believed that no more threats to the Republic existed, Leia disagreed and advocated vigilance. Seeking vengeance for the death of her Amaxine warriors, Hadrassian assassinated the Populist politician Tai-Lin Garr, who was standing as the new Populist candidate for First Senator. Lady Carise also fabricated evidence framing Casterfo due to his friendship with Leia. Disillusioned with the infighting and complacency of the Senate, Leia resigned and founded a new paramilitary organization called the Resistance."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The defeat of the Galactic Empire at the Battle of Jakku one year after the Battle of Endor ended the Galactic Civil War. The New Republic, the successor government to the Alliance to Restore the Republic, signed a peace treaty with the remnants of the defeated Empire known as the Galactic Concordance. The Galactic Concordance imposed strict disarmament treaties and war reparations on the remnants of the Empire. For the next twenty-nine years, the \"Old Empire\" became a remnant of political hardliners who eventually retreated to the Unknown Regions. There, they formed a new military junta called the First Order, which admired the policies and principles of the Old Empire. Believing that the Imperials no longer posed a threat, the New Republic turned its attention to reshaping galactic politics."}, {"tag": "p", "text": "About thirteen years prior to the destruction of the Hosnian system, the First Order began using a paramilitary faction called the Amaxine warriors to funnel billions of credits into the Nikto crime lord Rinnrivin Di's cartel. Rinnrivin's cartel in returned channeled much of its smuggling and gambling revenue to unidentified sources and shadow corporations on Centrist worlds, which funneled the money back to the First Order. The First Order used these proceeds to rebuild the old Imperial fleet, which had retreated into the Unknown Regions following the Galactic Concordance."}, {"tag": "p", "text": "The Amaxine warriors on the surface acted as the financiers and partners of Rinnrivin's cartel. Their leader Arliz Hadrassian, a former TIE fighter pilot who admired the Old Empire and hated the New Republic, also began marshaling troops and starships for an armed insurrection against the Republic. Hadrassian maintained a tenuous relationship with another First Order agent, the New Republic Senator Lady Carise Sindian; who was a prominent member of the Centrists faction in the Galactic Senate. Lady Carise channeled Rinnrivin's profits back to the First Order. While Hadrassian saw the Amaxine warriors as the vanguard of the First Order, Lady Carise viewed them as a distraction that would allow the First Order to \"restore order\" to the galaxy."}, {"tag": "h2", "text": "The conflict"}, {"tag": "h3", "text": "Mission to Bastatha"}, {"tag": "p", "text": "In 28 ABY, Rinnrivin's cartel began to exact a heavy toll on interstellar trade in the Gaulus sector, which housed the planet Ryloth. Rinnrivin's smuggling operations drained revenue from legitimate commercial traffic. Legitimate ships were raided while merchants were extorted into paying protection money. Rinnrivin's cartel was able to thrive in the Gaulus sector due to poorly-enforced New Republic financial regulations and infrequent naval patrols of the galactic traffic lanes. The New Republic's indecisiveness was the result of frequent bickering within the Galactic Senate between two powerful factions, the Centrists and the Populists. The Centrists advocated a stronger central government and military while the Populists championed the autonomy of individual worlds. Several Centrists included Lady Carise admired the Old Empire and had secret ties to the First Order."}, {"tag": "p", "text": "With Rinnrivin's cartel exacting a heavy toll on Ryloth's economy, the planet's Emissary Yendor traveled to the New Republic capital of Hosnian Prime to lobby the Galactic Senate into taking action. While several senators disputed Yendor's testimony and argued that this was an intrasystem matter, the former rebel leader and Populist senator Leia Organa and her Centrist colleague Ransolm Casterfo agreed to investigate the cartel. The two senators traveled to Bastatha, a casino destination in the Outer Rim Territories which housed Rinnrivin's headquarters."}, {"tag": "p", "text": "Despite their philosophical differences, the two senators struck a friendship when Casterfo rescued Leia from Rinnrivin, who had attempted to bribe the latter into easing the Republic's ban on illegal spice. While Rinnrivin and his henchmen escaped, Leia and her team managed to uncover computer data showing that Rinnrivin was channeling most of his profits into shadow corporations in the Outer Rim. The two returned to Hosnian Prime and called for the investigation to continue. However, the Senate was distracted by a Centrist motion to create a new office called First Senator that would have stronger executive power over the military and economy."}, {"tag": "h3", "text": "Political intrigue"}, {"tag": "p", "text": "Senator Casterfo managed to sway the Senate into adopting the motion by pointing to the deadlock in the New Republic. After the Populists failed to block the motion, Leia's colleagues Senators Tai-Lin Garr and Varish Vicly urged her to stand for First Senator due to her charisma and respect as a rebel leader. Preoccupied with matters on Hosnian Prime, Leia dispatched her pilot Greer Sonnel and the starfighter pilot Joph Seastriker to Pamarthe to investigate whether Rinnrivin was recruiting pilots from there. Greer was a native of Pamarthe and Leia believed that she would be ideal for the mission. There, the two pilots discovered that Rinnrivin was hiring Amaxine pilots from nearby Daxam IV, a barren Centrist world."}, {"tag": "p", "text": "Joph's preliminary investigations determined that the Amaxines were operating in Centrist-aligned worlds. Suspecting that certain Centrist senators were harboring the paramilitary section, Leia convinced Casterfo to investigate the Amaxine presence on Daxam IV. Casterfo, who was an avid collector of Imperial artifacts, was able to take advantage of a planned rendezvous with a prospective seller on Daxam IV to travel to that planet. Meanwhile, Leia met Lady Carise, who was interested in inheriting the Supreme governorship of Birren. Since the previous governor Lord Mellowyn had died, Leia and her son Ben Solo were his designated successors due to Leia being the adopted daughter of Bail and Breha Organa. Since Leia was not interested in royalty, the Senator made arrangements with the Elder Houses for Lady Carise to procure the tile."}, {"tag": "p", "text": "Later, Hadrassian bombed the Senatorial conference building on Hosnian Prime in order to create a distraction for the Senate and to induce chaos. While Lady Carise had asked her to create a distraction, Hadrassian's action only drew more attention to the Amaxines. While no senators or staff were killed, the so-called \"Napkin Bombing\" was the first security incident since the end of the Galactic Civil War and led the Centrists and Populists to blame each other for the bombing. Despite the political infighting, Leia and Casterfo decided to continue with their investigations into Rinnrivin's cartel and the Amaxine warriors. After preliminary evidence suggesting that the bomber was a Twi'lek, Leia and her team decided to travel to Ryloth. She send Casterfo and Greer to investigate the Amaxines on Daxam IV."}, {"tag": "h3", "text": "Continuing the investigation"}, {"tag": "p", "text": "At the Ryloth archives, Leia and her team including C-3PO, Korr Sella, and Joph discovered evidence that Rinnrivin had hitherto been a minor player who had risen to power under suspicious circumstances seven years ago. Meanwhile, Casterfo befriended Arliz Hadrassian and gained her trust by posing as an Imperial sympathizer. Greer also discovered that the Amaxines had a sizeable military encampment and at least five starfighter squadrons based on Daxam IV. After obtaining the helmet of Hadrassian's brother, who had been an Emperor's Royal Guard, Casterfo trained with her Amaxine warriors and learned that the organization had a larger base on the watery Expansion Region world of Sibensko."}, {"tag": "p", "text": "Armed with this information, Casterfo contacted Joph, C-3PO, and Korrie and also told them that Rinnrivin had several spy satellites above Ryloth. After C-3PO sliced into one of Rinnrivin's satellites, Leia and her team discovered that Rinnrivin was hiding on Sibensko. Being able to track Rinnrivin's movements through his satellite, Leia traveled to Harloff Minor near Coruscant and met up with the crime lord. While Rinnrivin was not nvolved in the Napkin Bombing, he expressed admiration for Leia and attempted to bribe the prospective First Senator. Leia also planted a tracking device on a holocube that Rinnrivin had gifted to her for slaying Jabba Desilijic Tiure. She returned the device to the crime lord under the pretext that she did not need to be reminded of the past."}, {"tag": "p", "text": "Upon returning to Hosnian Prime, Leia and Casterfo shared their findings. Casterfo was also able to take video recordings of the Amaxine warriors and starfighters. While Leia agreed to guide the investigation into the Napkin Bombing, Casterfo agreed to investigate his fellow Centrist senators for possible linkages to the Amaxines. Knowing that several Centrists were avid collectors of Imperial artifacts and relics, Casterfo hosted a private reception. While his fellow Centrists did not reveal any incriminating information, several expressed admiration for the Old Empire and disdain for the New Republic. Meanwhile, Lady Carise stumbled upon a keepsake chest and music box on Birren which revealed Leia's identity as the daughter of Darth Vader."}, {"tag": "p", "text": "Due to Sibensko's reputation as a criminal haven, Leia made plans with Joph, Greer, and Casterfo for a covert mission. Joph and Greer traveled to Chrome Citadel disguised as smugglers and managed to obtain a smuggling job from Sibensko. Leia was also distracted by the Populist efforts to prepare her nomination for First Senator. Meanwhile, Hadrassian contacted Lady Carise and informed her that she had recruited Casterfo as a \"sympathizer.\" However, Lady Carise realized that Casterfo was working with Leia and decided to drive a wedge between the two friends. Knowing Casterfo's hatred for Vader, Carise disclosed the secret information to the junior senator."}, {"tag": "h3", "text": "Leia's revelations"}, {"tag": "p", "text": "Feeling betrayed by Senator Organa, Ransolm Casterfo upstaged a Senate hearing into Leia's candidacy for First Senator by revealing her true parentage as the daughter of Darth Vader. Trapped, Leia confirmed that Vader was indeed her father. This threw the Senate into turmoil and many of Leia's political allies turned against her. Korrie resigned in protest and Leia quickly penned a message comforting her son about his grand-parentage. Most importantly, Leia's friendship with Casterfo was badly damaged with the two blaming each other for the scandal. Despite this major setback, Leia's husband Han Solo and several friends and companions including Tai-Lin Garr, Varish Vichly, C-3PO, Joph, Greer, the former Chancellor Mon Mothma, Chewbacca, Lando Calrissian, Gial Ackbar, and Nien Nunb stood by her."}, {"tag": "h3", "text": "Mission to Sibensko"}, {"tag": "p", "text": "Despite the political uproar, Leia was determined to continue her investigation into the Amaxine warriors' presence on Sibensko. After withdrawing her nomination for First Senator, Leia managed to secure leave from the Galactic Senate. Disguised as an indentured servant, Leia traveled with Greer, Joph, and C-3PO to Sibensko. While Greer and Joph loaded a shipment of detonators destined for Hosnian Prime, Leia and C-3PO managed to access a computer in a cantina in the Sibensko underwater city. C-3PO managed to download banking records which proved that the Amaxine warriors were financing Rinnrivin Di's cartel."}, {"tag": "p", "text": "While C-3PO headed back to Greer and Joph's freighter, Leia stayed behind to spy on the Amaxine base in the underwater city. She was cornered by Rinnrivin Di and two of his henchmen but managed to escaped by causing a water tunnel to collapse on top of them. Leia managed to take a lift into the Amaxine base where she discovered they had several starfighters. She was soon pursued by several Amaxine youths but managed to escape up a landing platform which rose to the sea. The Amaxines dispatched two starfighters, a Y-wing and a B-wing to destroy her. However, Leia was rescued by her husband Han Solo, who arrived on a modified racer. During a brief dogfight, the couple shot down both starfighters."}, {"tag": "p", "text": "The B-wing crashed into the underwater city's ammunition depot, destroying the Amaxine base and eliminating the organization as a threat to the New Republic. The death of Rinnrivin also presumably decapitated the leadership of his criminal cartel. Later, Leia managed to address the Senate on her investigation into Rinnrivin's cartel. While the Amaxines and Rinnrivin's cartel had been eliminated, the Senator warned the Galactic Senate that other threats to the Republic still existed. She urged the senators to abandon their complacency and their petty differences to protect the Republic. However, Leia's warning was met by hostility and skepticism until Casterfo sprung to her defense and pointed to the pro-Imperial sympathies of the Amaxine warriors. Casterfo's actions earned him the ire of Lady Carise, who decided to eliminate the dissident Centrist senator."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "h3", "text": "Wrapping up loose ends"}, {"tag": "p", "text": "Following the events on Sibensko, Lady Carise severed her support for the remaining Amaxines, finding Hadrassian more of a liability than an asset. After learning about Tai-Lin Garr's plans to stand as the new Populist candidate for First Senator, she decided to eliminate her problems by hiring Hadrassian to assassinate Tai-Lin. Hadrassian then killed herself before she could be taken into custody. With Hadrassian's death, many believed that the Amaxines were Rinnrivin's partners and financiers, and that they had staged the Napkin bombing. Following Tai-Lin's assassination, Lady Carise fabricated evidence framing Casterfo as an ally of Hadrassian, who had supplied her with funding and intelligence."}, {"tag": "p", "text": "Lady Carise and her Centrist colleagues then officially disowned Casterfo as a rogue member of their faction. Due to the political tensions, the Senate passed a motion to suspend future elections including those for First Senator. Lady Carise supported this motion since it allowed her to begin planning another motion to secede the Centrist worlds from the New Republic. Lady Carise decided to follow the late Hadrassian's request to secede from the Republic and join the First Order. However, Senator Organa determined that Lady Carise had been responsible for the revelations into her parentage and Casterfo's frame-up. On the grounds that Lady Carise had violated her oath as Supreme governor, Leia convinced the Elder Houses to expel Lady Carise and strip her of all her titles."}, {"tag": "h3", "text": "Path to War"}, {"tag": "p", "text": "Disillusioned with the Galactic Senate, Leia made preparations to resign as Senator. She also invited several rebel veterans and New Republic personnel to a secret meeting in the Senate complex's hangar bay where she founded the Resistance, a paramilitary outfit aimed at protecting the Republic. For the next six years, the Resistance kept an eye on the movements of the First Order, which had begun to cross the Trans-Hydian Borderlands and made repeated incursions into New Republic space. While General Organa regularly petitioned the Republic for support, the Republic leadership was too preoccupied with other matters. The New Republic tolerated the Resistance but was wary of risking war with the First Order."}, {"tag": "p", "text": "Over the years, Leia recruited more Republic personnel including the starfighter Commander Poe Dameron to her cause. Dameron and his fellow pilots Iolo Arana and Karé Kun would play an important role in exposing the Centrist Senator Erudo Ro-Kiintor's dealings with the First Order during Operation: Sabre Strike. During this period, the First Order's Supreme Leader Snoke succeeded in seducing Leia's son Ben Solo to the dark side of the Force. Ben adopted the persona Kylo Ren and became the leader of the Knights of Ren. Kylo Ren destroyed his uncle Luke Skywalker's Jedi and caused the latter to flee to Ahch-To. After the Resistance embarked on a campaign to find Luke, the First Order launched a preemptive strike on the New Republic; using Starkiller Base to destroy the Hosnian system. In response, the Resistance launched an attack and destroyed Starkiller Base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Amaxine warrior crisis serves as the main plotline of Claudia Gray's 2016 novel Bloodline."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}