{"url": "Hollian", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:Shu-Torun royal family"], "nodes": [{"tag": "h1", "text": "Hollian"}, {"tag": "p", "text": "Hollian was the eldest daughter and second child of the king of the planet Shu-Torun, and stood to inherit the role of celebrant warlord upon the death of her father. When the king decided to rebel against the Galactic Empire and attempt to assassinate their representative Darth Vader, Hollian and her brother Monthan stood with their father in the Shu-Torun royal palace's throne room while their sister Trios was sent to lead the Imperial into a trap. She did not attempt to stop his father when the king chose to sacrifice Trios in order to kill Vader, and was killed soon after when the Vader's assassin droid BT-1 murdered everyone in the palace throne room."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hollian was a princess in the royal family of the Mid Rim mining planet Shu-Torun, and the second child of her father, the king of Shu-Torun. She had an older brother, Prince Monthan, who stood to inherit the throne, and a younger sister named Princess Trios. Upon her father's death, Hollian would become the new celebrant warlord of the Shu-Torun's War-Faith, giving her the task of destroying the planet's enemies. During the reign of the Galactic Empire, Shu-Torun provided ore for Imperial building projects, but when the planet's ore-dukes became displeased with the Empire's required tithes, the king chose to rebel.\nThe Imperial Sith Lord Darth Vader was dispatched to investigate why Shu-Torun was not meeting its ore quotas, allowing the king to devise a plan to assassinate the Sith. Trios would lead the target into a trap while Hollian and Monthan watched with their father from the safety of the throne room. The Princess successfully led Vader into the first trap in the Shu-Torun royal palace, which consisted of an ambush in the subterranean abyssal rooms, where a ball was being held in the guests honor; however, Vader was able to slay his attackers with ease."}, {"tag": "p", "text": "With the initial plan having failed, Trios led Vader into the palace's tunnels, where the king could unleash molten lava to kill Vader and her.\nAs the king lamented having to sacrifice Trios and activated the magma delivery system, Hollian stood by the her father's side and did not raise objection. The trap was unsuccessful however, as Vader cut his way out of the tunnel with his lightsaber, saving Trios as he escaped. Knowing that Vader would now be headed straight for the throne room, the king ordered Hollian, Monthan and his guards to prepared to defend themselves."}, {"tag": "p", "text": "Unbeknown to the king or his children, two assassin droids serving Vader had infiltrated the throne room. When the droid 0-0-0 failed to poison the king by offering him a drink, its counterpart BT-1 opened fire on the room's occupants. It shot each target in the heart, killing Hollian, Monthan and the king, along with all of the guards present. Vader then brought Trios into the throne room and revealed her family's deaths to her, crowning her and leaving her to rule Shu-Torun as the new queen."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hollian was a human female with brown hair and fair skin. When her father attempted to sacrifice Trios in order to kill Darth Vader, she did not protest."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Hollian wore a set of armor including a helmet which was white in color with a golden trim. She also wore a blue cloak and a sword."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hollian first appeared in Darth Vader Annual 1, a comic book released in 2015 with writing by Kieron Gillen and art by Leinil Francis Yu."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}