{"url": "Hollowtown", "categories": ["Category:Legends articles", "Category:Centerpoint Station locations"], "nodes": [{"tag": "h1", "text": "Hollowtown"}, {"tag": "p", "text": "Hollowtown was a large botanic biosphere located in Centerpoint Station."}, {"tag": "h2", "text": "Structure and appearance"}, {"tag": "p", "text": "It was an open sphere, measuring sixty kilometers in diameter, in the exact center of the station. At the center of Hollowtown, the Glowpoint blazed like a perpetual sun, making the interior of the sphere habitable. The walls of Hollowtown had been colonized for generations, with homes, parks, lakes, orchards, and farmland. There was no night in Hollowtown. Residents typically placed programmed blocks of transparisteel above their houses that \"dimmed\" on a day/night cycle. These were referred to as \"shadow-shields.\" On both sides of the Hollowtown sphere, positioned along the spin axis, was a large cone ringed by six smaller cones; the sets were called the North and South Conical Mountains. Several levels radiated outward from the center of Centerpoint. The first level out from Hollowtown was called Shell One. Many, but not all of the levels were explored, and some were used for scientific research or engineering projects."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For generations the interior of the Station was colonized, formed and inhabited. Still, none of the colonists knew who built Centerpoint Station or whether the structure was intended to be inhabited, but the environment was as acceptable as any fertile planet."}, {"tag": "p", "text": "Hollowtown was destroyed when Centerpoint's Starbuster was fired, which caused the Glowpoint to flare to several thousand degrees. The structures and farms were literally incinerated, leaving nothing behind but scraps of melted metal and charred bones."}, {"tag": "p", "text": "The activation of the hyperspace repulsor, believed to be the mechanism by which the Corellian system was originally assembled, would have made Hollowtown uninhabitable. Some speculate their intention may have been to build the Corellian system and then shut down the repulsor permanently, using the steady energy of the Glowpoint as a power source for the Centerpoint sphere."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}