{"url": "Amaxine_warriors_(New_Republic_Era)", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:First Order organizations"], "nodes": [{"tag": "h1", "text": "Amaxine warriors  (New Republic Era)"}, {"tag": "p", "text": "The Amaxine warriors were a paramilitary organization active during the New Republic Era. Allied with the secretive First Order, they were commanded by Arliz Hadrassian and named after an ancient warrior culture. They first made themselves known by bombing the New Republic Senate building. In response, Senators Leia Organa and Ransolm Casterfo undertook a campaign to investigate the Amaxines and their links to Rinnrivin Di's cartel."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Amaxine warriors of the New Republic Era wore black jumpsuits and carried various weapons including blasters and force pikes, the weapons of the Emperor's Royal Guard. A substantial number of the Amaxine warriors were adolescent youths in their mid teens. Amaxine warriors spent most of their time training with weapons and flying with their starfighters. The Amaxine warriors had at least half a dozen bases in Centrist space. Their main headquarters was an underwater base on the Expansion Region planet of Sibensko. The Sibensko base contained a large ammunition depot and hosted several starfighters including X-wings, Y-wings, B-wings and TIE/ln space superiority starfighters. In addition, the Amaxines maintained a smaller base on the desert world of Daxam IV. The Daxam encampment boasted at least a thousand Amaxine warriors and had at least five squadrons of starfighters. While the Amaxines' resources and manpower paled in comparison to the \"Old Empire\", some contemporary observers like Senators Leia Organa and Ransolm Casterfo believed that they posed a significant threat to the New Republic."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Reappropriation"}, {"tag": "p", "text": "In 28 ABY, the Amaxine warriors became the name of a local paramilitary organization that controlled smuggling operations around Daxam IV. This organization had no connection to the original Amaxines but was merely a group of malcontents who had established themselves as a burgeoning paramilitary with the encouragement of Lady Carise Sindian, a prominent Centrist Senator who served as a clandestine agent of the First Order, a remnant of the Old Empire based in the Unknown Regions. After bankrolling the Nikto crime lord Rinnrivin Di's cartel, Lady Carise and her Centrist colleagues diverted funds into procuring weapons and training for the Amaxine Warriors."}, {"tag": "p", "text": "According to Joph Seastriker, no record of the Amaxines existed on any New Republic public information grid. However, there were reports of Amaxine activity on several Centrist worlds clustered in one section of the galaxy. They generated considerable revenue from smuggling operations carried out by Rinnrivin Di's cartel, whose activities were hurting the offworld trade of the planet Ryloth. Rinnrivin hired the Amaxine warriors as pilots for his smuggling operations and raids on Ryloth's commercial shipping. On the surface, the Amaxines appeared to be the financiers and partners of Rinnrivin's cartel when in fact they were mainly proxies of the undercover Centrist agents of the First Order."}, {"tag": "p", "text": "The Amaxines maintained between five and six bases including an encampment on the subarctic desert world of Daxam IV in the Outer Rim Territories and a larger base on the watery planet of Sibensko in the Expansion Region. Their leader was Arliz Hadrassian, a former TIE fighter pilot, who had ties to Lady Carise. While Hadrassian wanted the Amaxines to serve as the vanguard of the First Order's attack on the New Republic, Lady Carise regarded them as a distraction for sowing chaos in order to prepare the galaxy for the return of the First Order."}, {"tag": "p", "text": "The New Republic starfighter pilots Joph and Greer Sonnel learned about the paramilitary organization during a visit to Sonnel's homeworld of Pamarthe. Joph and Greer discussed their findings with Senator Organa, who was spearheading an investigation into Rinnrivin's cartel. Realizing the two organizations were linked, Leia sent her colleague Senator Ransolm Casterfo and Greer to investigate the militia's base on Daxam IV. Shortly later, Hadrassian bombed the Galactic Senate's conference building to sow confusion. This only drew Leia's attention to the Amaxines and Casterfo traveled to Sibensko to investigate. After befriending Hadrassian and gaining her trust, the two discovered that the Amaxine warriors were training had mustered a large fleet of starfighters and had thousands of personnel. Most of the Amaxines were adolescent youths who wore black jumpsuits. Casterfo also discovered their main base was on Sibensko."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "Later, Senator Organa and her entourage including C-3PO traveled to Sibensko. There, Threepio managed to download banking records showing that the Amaxines were funnelling billions of credits into Rinnrivin's cartel. Rinnrivin's cartel was channeling these funds to nameless sources on Centrist worlds. Leia and her team also discovered evidence that the Amaxines were marshalling starfighters and personnel for a war against the New Republic. Despite escaping the Amaxines, the underwater base was destroyed when a downed Amaxine starfighter collided with the ammunition store; creating an explosion that killed many Amaxines and wiped out much of the evidence."}, {"tag": "p", "text": "The skirmish on Sibensko dealt a heavy blow to the Amaxine warriors and wiped out most of their manpower and starships. Hadrassian was infuriated by the destruction of much of her organization and attacked Lady Carise and her Centrist counterparts for refusing to secede from the Republic. Lady Carise retorted that Hadrassian's \"Napkin Bombing\" only drew attention to the Amaxines. Since the Amaxines had in her view outlived their usefulness, Carise withdrew her support from them. Lady Carise hoped that the events on Sibensko would cause the New Republic to cease investigating the Amaxines' links to the First Order. Despite this setback. C-3PO was unable to access data layers that linked the Amaxines directly to the First Order. As a result, most people in the New Republic Senate and media wrongly believed that the Amaxines had been the primary financiers and partners behind Rinnrivin's cartel."}, {"tag": "p", "text": "After Ransolm spoke out in support of Leia's testimony on the Amaxines' activities, Lady Carise decided to discredit the dissident Centrist senator by arranging for Hadrassian to assassinate the Populist politician Tai-Lin Garr. Hadrassian then killed herself before she could be taken into custody. Lady Carise's slicers then produced faux footage linking Casterfo to Hadrassian, who had taken the fall as the instigator behind the Napkin bombing and the Amaxine warriors. As a result, Casterfo was deported to his homeworld of Riosa for trial, sentencing, and imprisonment. In retaliation, Leia convinced the Elder Houses to strip Lady Carise of her royal titles. With the Senate unwilling to take action against the Amaxines and their true masters, Leia formed the Resistance to defend the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Amaxine warriors first appeared as minor antagonists in Claudia Gray's 2016 novel Bloodline."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}