{"url": "HoloNet_News/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:HoloNet News"], "nodes": [{"tag": "h1", "text": "HoloNet News"}, {"tag": "p", "text": "HoloNet News (HNN) was a HoloNet channel that provided news across the Galactic Republic, Galactic Empire, New Republic and Galactic Alliance."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Based on Coruscant, HoloNet News was in its 531st volume in 22 BBY."}, {"tag": "p", "text": "The HoloNet News can be traced as far back as the Freedon Nadd Uprising. With the tagline \"The Information Sources For The Republic,\" the publication was segmented into news on business, regional sectors, Jedi, sports, and common Republic life, as well as general news headlines. There were also weather forecasts (available to those who knew their six-digit planet code) and a poll. A number of placed advertisements sponsored the publication, and full feed annual subscriptions were available for 45 credits in 22 BBY, although there was a free-access version as well."}, {"tag": "p", "text": "On 5:23 22 BBY, HoloNet News's channel was seized by Republic Executive Directive 9302-84121 for use by the military. During, and for a short time after, the Clone Wars, HNN made sporadic updates. Shortly after the war's end and the creation of the Galactic Empire, HNN was finally folded and replaced with the new Imperial HoloVision and was very likely the reason why many of the Empire's genocidal acts were covered up. After the Battle of Endor, Holonet News Network was put back on the air under the New Republic and the Galactic Alliance."}, {"tag": "p", "text": "To appeal to all audiences, HoloNet News released HoloNet Kids!, \"The Information Source for the Young Republic.\" Political commentary segment Week in Focus was a regular fixture on HoloNet News by 40 ABY. The HoloNet News Weather Report used Planet Codes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}