{"url": "Amban_phase-pulse_blaster/Legends", "categories": ["Category:Legends articles", "Category:Blaster weaponry"], "nodes": [{"tag": "h1", "text": "Amban phase-pulse blaster"}, {"tag": "p", "text": "The Amban phase-pulse blaster was a type of two-pronged blaster. In 1 ABY, the bounty hunter Boba Fett used an Amban phase-pulse blaster to save Luke Skywalker from a Panna dragon on Panna Prime."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Amban phase-pulse blaster was a type of handheld blaster technology. The weapon had a stock at its base and a grip near its forked end. The Amban phase-pulse blaster could be used at a medium range, and it was capable of fighting off large creatures."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 1 ABY, the bounty hunter Boba Fett wielded one such weapon. While on the mud-moon of Panna Prime, Fett witnessed the young rebel Luke Skywalker come under attack by a Panna dragon, which began to devour the pilot's BTL-S3 Y-wing starfighter. Skywalker's blaster pistol had no effect on the beast, so Fett intervened. From the back of a Paar's ichthyodont, the bounty hunter fired his Amban phase-pulse blaster at the dragon, and it retreated. After the incident, Skywalker thanked Fett for saving his life."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Amban phase-pulse blaster first appeared in \"The Story of the Faithful Wookiee,\" an animated segment of 1978's The Star Wars Holiday Special, and it was named in the production's Boba Fett character key."}, {"tag": "p", "text": "The design of the Amban phase-pulse blaster was repurposed for Chop'aa Notimo's electrostaff in the 2008 video game Star Wars: The Force Unleashed."}, {"tag": "p", "text": "In 2020, a version of the Amban phase-pulse blaster, named the Amban JP Blaster Rifle, was added to the online multiplayer game Star Wars: The Old Republic's Cartel Market to commemorate the release of the second season of The Mandalorian."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}