{"url": "Holochex", "categories": ["Category:Legends articles", "Category:Holochess"], "nodes": [{"tag": "h1", "text": "Holochex"}, {"tag": "p", "text": "Holochex was a two-player board game popular on Tatooine, somewhat similar to chess (although with only one type of piece and several different game board layouts on which it could be played). Each player began the game with twelve monster-shaped pieces of a certain color, the player's turn designated by the edge of the board glowing in accordance with that player's color.\nThe game required the player to capture the opponent's monsters while at the same time he or she was trying to jump theirs.\nMonsters could move in any straight or diagonal line, and were allowed to double jump. According to the rules, if a pawn was in a position to take the opponent's pawn, it had to do so. Whoever captured all the enemy pieces won the game. Most players well versed in the game found it difficult to come back from a loss if the opponent managed to capture a sizable number of pieces early in the game, as successful strategies often consisted of strings of sacrifice moves and double jumping. Most boards were equipped with an electronic help buttons, showing novice players where moves and jumps could be made."}, {"tag": "p", "text": "The crime lord Jabba the Hutt himself was fond of this game, and he would sometimes play it with anyone in Mos Espa during his own game venue, or even teach how to play it. The Hutt was renowned as a tough opponent and a master strategist at holochex. At some point after the Boonta Eve Classic in 32 BBY, an extra–galactic spacer chanced their luck at Jabba's game plaza and won a few holochex matches against the Hutt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The game of holochex could be played in Star Wars Math: Jabba's Game Galaxy, an educational video game released by Lucas Learning in 2000. It was inspired by real-life game of checkers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}