{"url": "Holocron_Chamber", "categories": ["Category:Legends articles", "Category:Coruscant rooms", "Category:Jedi Temple locations", "Category:New Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Holocron Chamber"}, {"tag": "p", "text": "The Holocron Chamber was a sealed room located in the Tower of First Knowledge, one of the five spires of the Jedi Temple on Coruscant. A branch of the expansive Jedi Archives, it was presided over by the Caretaker of First Knowledge and stored the holocrons containing the majority of the Jedi Order's most coveted secrets. Holocrons stored within this chamber were being actively studied or consulted, therefore they were not held in the Holocron Vault."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Though the original towers of the Temple were destroyed in 3653 BBY during the Sacking of Coruscant by the resurgent Sith Empire, the Order, with help from the Galactic Senate, was able to draw enough funds to rebuild them by 1000 BBY. The chamber then came to house several of the most prized holocrons of the Order."}, {"tag": "p", "text": "During the year 30 BBY, while the Jedi High Council was dealing with Tinté Vos' demand for Jedi assistance on the plagued world Kiffex, a holocron containing information on the Anzati Dark Jedi Volfe Karkko activated for the first time in fourteen generations. Concerned over this, Caretaker Astaal Vilbum consulted Mace Windu of the High Council, warning him of the dangers that awaited whoever was sent to Kiffex. Windu had already sent Jedi Knight Quinlan Vos to investigate, causing him to send additional Jedi to assist in the defeat of the reawakened Karkko."}, {"tag": "p", "text": "In 19 BBY Darth Sidious, the Dark Lord of the Sith responsible for the Clone Wars, was discovered to be Supreme Chancellor of the Galactic Republic. While the Jedi prepared the Temple for attack, the few fully trained Knights and Masters stationed within were no match for the sheer number of clone troopers of the 501st Legion. Led by Darth Vader, the clones swept through the Temple, slaughtering the Jedi and securing the complex's treasures. While many Jedi tried to escape with holocrons, most were cut down before they were able to escape."}, {"tag": "p", "text": "By the end of the night, the Temple was secured and most of the advanced holocron technology within the Chamber remained largely unscathed. Sidious' desire to plunder the Jedi's trove of Sith holocrons undoubtedly caused the chamber to be carefully picked apart, ensuring that any useful information be saved and preserved. While the room was left undisturbed for years after the initial study, in 2 BBY, Darth Vader's secret apprentice broke into the Tower of First Knowledge in order to complete the Jedi Trials. After killing the Shadow Troopers stationed in the main entrance of the Tower, Starkiller was able to cross the damaged bridge leading to the chamber. Inside, he found a large holocron resting on the rotunda's central pedestal. When activated a Gatekeeper demanded the assassin complete the Trial of Spirit in the bowels of the Temple. Leaving the chamber, the Sith apprentice found himself in competition with a twisted version of himself. After defeating the Stalker, he left the Temple, the Trials complete."}, {"tag": "p", "text": "The chamber would once more lay in silence for another decade, standing even after the Galactic Empire was driven off Coruscant. With the resurgent Jedi Order growing, Luke Skywalker entered the ruined edifice to find any information on the Order's teachings. However, his search was short lived; although Jedi historian Tionne Solusar was able to restore and scan the Archives, the Towers of the Temple were leveled by the Lusankya eruption from beneath the planet's cityscape. While the Temple remained in use for several more years, the entire structure was ruined by the Yuuzhan Vong War."}, {"tag": "p", "text": "A few years after Coruscant was secured by the Galactic Alliance, Chief of State Cal Omas ordered the Reconstruction Authority to rebuild the Temple according to salvaged schematics. As the new Jedi Temple took shape, the Towers were restored to their former height, though they were encased in a large transparisteel pyramid. Every room restored, the Holocron Chamber once more held the Order's treasure for the next century."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Sealed off to all but Jedi Masters, the rotunda contained the vast majority of the Order's most coveted Jedi holocrons. Located on the first level of the Tower of First Knowledge, the Chamber was set opposite the main entranceway. Accessible by a bridge that spanned the Spire's central chasm, Jedi had to pass through a sealed doorway to view the holocrons. The doorway was marked with the Order's crest, leading to a hall lined with pentagon-shaped consoles behind which several holocrons were stored. The hall led into the rotunda, in the center of which sat a squat pedestal from which a holocron could be studied. Amidst the rotunda, several holocrons floated in a repulsorfield above the heads of visitors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}