{"url": "Holocron_Vaults", "categories": ["Category:Legends articles", "Category:Coruscant rooms", "Category:Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Holocron Vaults"}, {"tag": "p", "text": "The Holocron Vaults were secured chambers located in the Jedi Archives deep within the Coruscant Jedi Temple. It was within these chambers that the Jedi Order stored its holocrons, in addition to the Vault in the Tower of First Knowledge."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Holocron Vault, along with the vaults in the First Knowledge Tower, held the Order's holocron's under the watchful eye of the Chief Librarian. Although only Jedi Masters were supposed to access Sith holocrons, there was little in the way of security on them. This changed following the incident of the theft of such a holocron by the Padawan Lorian Nod. After this incident, known as the \"Lorian Nod affair,\" any holocrons containing the deepest secrets of Masters of the Force were guarded in such as way that they could only be accessed by Jedi Masters."}, {"tag": "p", "text": "In 22 BBY during the Clone Wars, Darth Sidious hired the Duros bounty hunter, Cad Bane, to infiltrate the Temple's holocron vault in the Fourth Hall of the Archives and steal a holocron. Having killed Jedi Ord Enisence, Bane hired Clawdite bounty hunter Cato Parasitti to assume the Skrilling Jedi's form. Equipped with schematics of the Temple by the Sith Lord, Parasitti, in the form of Master Enisence, entered the Temple Archives in order to guide Bane through the ventilation shaft. While the Jedi noticed the break in, they failed to guess where the intruder was headed. Distracted, the Jedi rushed around the Temple while Bane slipped into the vault without disturbance. Stealing the artifact he was hired to acquire, he calmly exited the Temple in a stolen Jedi robe; Parasitti meanwhile was detained by the Jedi, having been left behind by Bane."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Located along the outer edges of both the Second and Fourth Halls of the Archives, the four Vaults were protected behind a set of two dilating security doors. Between the two portals was a circular hallway filled with security lasers capable of detecting movement and sounding alarms. Only accessible by the twelve Jedi Masters with seats on the Jedi High Council or the five of the Council of First Knowledge, entrance to the chamber was controlled by a Force-activated lock. In addition to the outer entrances each pair of Vaults was connected by another laser-crossed hallway."}, {"tag": "p", "text": "Beyond the security hall, a circular chamber was lit with the faint blue glow from the resting holocrons. Stored in dilating niches in the wall, there was also a pillar in the center of the room, filled with the palm-sized artifacts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}