{"url": "Holocron_of_Heresies", "categories": ["Category:Legends articles", "Category:Sith holocrons"], "nodes": [{"tag": "h1", "text": "Holocron of Heresies"}, {"tag": "p", "text": "The Holocron of Heresies, also simply known as Darth Andeddu's holocron, was a Sith holocron made by the Dark Lord of the Sith Darth Andeddu. In addition to Andeddu's lightsaber crystal, it most notably held the secret of transferring one's spirit to another body. The holocron had the phrase \"In umbris potestas est\" written on it in Aurebesh."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Lost in the annals of Sith history for many years, Darth Andeddu's Sith holocron was said to have first been discovered by the fallen Jedi Freedon Nadd. Darth Bane in 980 BBY stole it from Andeddu's Keep on Prakith during his quest to obtain eternal life, battling many of Andeddu's followers in the process. Bane eventually had to forcibly rip the secret of essence transfer from the holocron because the gatekeeper would not give him the secret of eternal life until he passed it's so-called \"Games\". It was stolen soon after by Set Harth from the Doan Royal House. Centuries later, the holocron had found its way back to Korriban. Quinlan Vos and Tol Skorr recovered the holocron sixteen months after the First Battle of Geonosis as they attempted to gain favor with Darth Tyranus."}, {"tag": "p", "text": "After extracting the knowledge stored in the holocron, Tyranus disassembled the artifact and removed a deep red lightsaber crystal that had been used in Darth Andeddu's lightsaber. He gifted the ancient crystal to Vos and then ordered him to Coruscant to assassinate Senator Viento."}, {"tag": "p", "text": "By 137 ABY, the holocron had fallen into the hands of Darth Krayt, Dark Lord of the Sith and founder of the One Sith. Lord Krayt activated the holocron in order to learn how Andeddu had been able to cheat death, but the gatekeeper refused to counsel the \"pretender\" because Krayt had defied the teachings of the Ancient Sith."}, {"tag": "p", "text": "Darth Wyyrlok took the holocron to Andeddu's true tomb, located within a keep on the planet Prakith searching for a way to cure Darth Krayt. There, it was revealed that Andeddu's holocron was unlike regular holocrons. Not only did the holocron contain Andeddu's full intellect (possibly his spirit), but was also able to manipulate the Force."}, {"tag": "p", "text": "After being placed near Andeddu's decayed remains, the holocron was able to siphon off the life force energy of Gerlun, a member of a Sith cult calling itself The Malevolence. The holocron used Gerlun's lifeforce to reanimate Andeddu's body. Wyyrlok's own illusions made Andeddu lose control of his reanimated body. The Force-empowered intellect was either destroyed or retreated back into the holocron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}