{"url": "Hologram/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Holographic technology"], "nodes": [{"tag": "h1", "text": "Hologram"}, {"tag": "p", "text": "A hologram was a three-dimensional projection of a person or object, normally used in communication or entertainment."}, {"tag": "h2", "text": "Operation"}, {"tag": "p", "text": "Holograms were used mostly in telecommunications as an alternative to screens. A holocamera of any recorder or receiver would acquire the dimensions, form and movements of an object by means of ray scanning. This vision then could be transmitted simultaneously somewhere else, or stored and reproduced on a holoprojector at a later time. Projected holographic images were visible from all sides, although matterless. Holograms were initially monochrome with a cyan hue, though following the Clone Wars, an additional layer of color was added to some holograms. In full-duplex telecommunications, users could see each other's holograms, as if they were in the same room talking to each other, although not always in relative proportion."}, {"tag": "p", "text": "Standard holograms had a lesser quality than screens, since they were mainly monochrome and often flickered. The luxury versions could produce incredibly lifelike full-color images, and were mainly used for entertainment purposes, such as at the Holographic Zoo of Extinct Animals, or Hologram Fun World, though they could also be used for disguises and other deceptions."}, {"tag": "h2", "text": "Uses"}, {"tag": "p", "text": "Portable holovids could display a miniature hologram. Projectors were also implemented in many starship communication systems, for use by both pilots and passengers. Some droids (e.g., R2-D2) could record and display holograms."}, {"tag": "p", "text": "Members of the Jedi Council could attend Council meetings via hologram if absent from Coruscant or otherwise unable to be there physically. Their image would project on their formal seat, and they would participate as if they were present."}, {"tag": "p", "text": "Holograms were also frequently used in scientific projects as schematics. Likewise, they could be used in military operations and briefings. During the Battle of Naboo, R2-D2 projected a hologram of the Theed Royal Palace before organizing the assault. Prior to the Battle of Endor, a hologram of Death Star II illustrated the attack plan to the Rebellion pilots."}, {"tag": "p", "text": "Holograms were also used in targeting practice. For instance, the Republic clone army used holograms of B1-Series battle droids and B2 super battle droids, as well as holograms of Anakin Skywalker and Obi-Wan Kenobi, to train their clone sharpshooters and improve their ability to distinguish between hostile and friendly targets."}, {"tag": "p", "text": "Someone who forged holograms and passed them off as the real thing was known as a holo faker."}, {"tag": "p", "text": "Sentient programs would often use holograms as a method of interacting with living creatures. Sometimes, as in the case of Holiday, the program would use holograms as their primary method of communication."}, {"tag": "h2", "text": "Storage of holograms"}, {"tag": "p", "text": "Holograms could be transmitted directly, or they could be stored in various storage devices (such as holodiscs) and in astromech units or other types of droids. The storage device would be hooked up with a holoprojector in order for the stored image to be accessed. Many droids had built-in holoprojectors."}, {"tag": "p", "text": "Hologram storage devices could be encrypted if their contents were deemed sensitive or classified. Morgan Katarn recorded and encrypted a hologram for his son revealing his Jedi heritage. The hologram was stored on a holodisc and could only be accessed by the Katarn family droid WeeGee. However, Jan Ors and Xiong Wong (with the help of Wires) managed to partially crack the hologram and display it, albeit in a very bad quality, to Mon Mothma, Leia Organa and Luke Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}