{"url": "Hologram", "categories": ["Category:Canon articles", "Category:Articles needing additional sources", "Category:Technology stubs", "Category:Holographic technology"], "nodes": [{"tag": "h1", "text": "Hologram"}, {"tag": "p", "text": "A hologram was a three-dimensional visual projection of an object or data, most commonly including maps, technical plans, or other information. The type and quality of the holographic image projected varied widely, and holograms could be static or moving, live or recorded, with or without sound, large or small, and colored or monochrome. Many of these attributes were determined by the quality of the original recording or broadcast, as well as the holoprojector being used to display it."}, {"tag": "p", "text": "Holograms were used for many different purposes, including entertainment, military planning, or political speeches, and as such touched the lives of nearly every being in the galaxy. Members of the Jedi High Council dispatched to missions on remote worlds could regularly participate in Council meetings held at the Jedi Temple by appearing as holograms."}, {"tag": "p", "text": "By the time of the Clone Wars, holographic technology had advanced to a point where it was difficult to tell the difference between a high quality hologram and real life. This was used in the holographic disguise matrix, which created a holographic disguise over a user that was realistic enough to deceive both observers and electronic sensors."}, {"tag": "p", "text": "Holographic technology was sophisticated enough that a holographic image could be made to project a smaller holographic image, as in the case of a holographic image of R2-D2 projecting a message of Princess Leia."}, {"tag": "p", "text": "Holographic displays were also a use of the technology, for example in the Finalizer to show data concerning the stormtrooper Finn to the bridge of the ship after the attack on Tuanul. Holograms could also be interactive, by touching, in order to control a system or a ship, like in Aphra's ship, the Ark Angel."}, {"tag": "p", "text": "After the Battle of Endor, Supreme Leader Snoke of the First Order used holographic technology in which the user could be seen in full color without any scan lines. He used this type of hologram when speaking with Kylo Ren and General Armitage Hux, while the two were in a special chamber on Starkiller Base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}