{"url": "Hologram_projection_pod", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Holographic communications", "Category:HoloNet technology", "Category:SoroSuub Corporation products"], "nodes": [{"tag": "h1", "text": "Hologram projection pod"}, {"tag": "p", "text": "The hologram projection pod, sometimes referred to as a HoloNet transceiver or a holopod, was a holoprojector produced by SoroSuub Corporation."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "This round device measured three meters in diameter, with a central holoprojector set into a hologram pod. Scanning and projection panels were located around the perimeter of the central projector, which could create an image many meters in height. A control panel was located on the side of the pod, along with cooling vents and a field limiter. The SoroSuub projection pod, like all other HoloNet transceivers, could receive and decode HoloNet transmissions sent along S-thread channels from anywhere in the galaxy. Because of the widespread implementation of the HoloNet, the projection pod had an effective range that spanned the entire galactic disc."}, {"tag": "h2", "text": "History and usage"}, {"tag": "p", "text": "SoroSuub projection pods were commonly installed on the bridges of Imperial Star Destroyers, and one was also found in the holoprojection chamber aboard Executor during the Galactic Civil War. Vader used this to communicate with Emperor Palpatine to report on the progress of the war, and during the pursuit of Millennium Falcon following the Battle of Hoth in 3 ABY. Palpatine altered the transmission settings to project his image many times its actual size, to the extent that it usually only showed his head; a technique he used to intimidate his subordinates. The field limiter also ensured Prince Xizor, who was at the Emperor's side during the holotransmission, was not seen by Lord Vader. Grand Admiral Thrawn also used a hologram projection pod to inform Captain Gilad Pellaeon of his arrival. While in Mount Tantiss Joruus C'baoth discovered Palpatine's settings and used that setting when communicating with Thrawn.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}