{"url": "Homack", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Alliance Starfighter Corps personnel", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Homack"}, {"tag": "p", "text": "Homack was a member of the Alliance to Restore the Republic. While fighting as an X-wing pilot, Homack saw action over Atrivis but was shot down and pursued by Imperial storm commandos planetside. Homack managed to escape the Imperials and, while on a separate ground mission to the planet Hethar, was attacked by shredder bats. After retiring from the Alliance, the veteran occasionally commented in Gundark's Gear Datalog."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Homack was a member of the Alliance to Restore the Republic and a pilot. While flying an X-wing, the pilot was involved in an engagement over the planet Atrivis, and was shot down. Pursued on the planet's surface by storm commandos, elite stormtrooper units specially trained in commando tactics, Homack was able to successfully evade them with the help of a set of Creshaldyne Industries camo scout armor. Stored in the starfighter's survival gear kit, the suit was capable of mimicking surrounding terrain by generating a small holographic distortion, thus enabling Homack to avoid capture long enough to steal a ship and escape the planet."}, {"tag": "p", "text": "On another mission, this time to the planet Hethar, Homack and a number of other Rebels were investigating an Imperial contingent. Spending a night on the planet, Homack was on night duty with three other Rebels when they were attacked by shredder bats. The creatures, known to hunt in packs, were armed with sharp fangs with which they tried to pierce their target's coronary arteries. Homack and the sentries were able to avoid such an attack by activating their Merr-Sonn Excluders. Small sonic devices that emitted waves of high frequency sound, they scrambled the bats' senses, causing them to fall from the sky. The sentries were then able to kill the creatures without drawing Imperial attention, or even waking the other Rebels. The bats were later enjoyed as breakfast the next day."}, {"tag": "p", "text": "After retiring from the Rebellion, Homack posted a number of comments and reviews on equipment in 8 ABY. Three of these made their way into Gundark's Gear Datalog. For instance, when discussing the A3AA personal defense module created by Corellian Technologies, Homack recommended using grenades or slugthrowers to overcome the suit dissipation field."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Rebel, Homack took precautions to ensure survival, such as storing camo scout armor aboard starfighters in case of crash landings, or carrying animal excluders. The Rebel was also happy to share opinions and past experiences on message boards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Homack was created for Gundark's Fantastic Technology: Personal Gear (1997) where the character commented on three pieces of equipment. The comments originate from a planet with the code \"Bst,\" which may be Bestine, or less notably, Bseto I. The in-universe comments throughout the book were intended to function as scenario hooks or potential modifications. Given the action on the planet Atrivis, Homack may have been a member of the Atrivis Sector Force, which coordinated Rebel activity in the sector."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}