{"url": "Holy_Ugor_Taxation_Collection_Agency", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Religious organizations", "Category:Ugor culture"], "nodes": [{"tag": "h1", "text": "Holy Ugor Taxation Collection Agency"}, {"tag": "p", "text": "The Holy Ugor Taxation Collection Agency, often abbreviated as HUTCA, was an organization which held authority over every member of the Ugor species in the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Holy Ugor Taxation Collection Agency, abbreviated as HUTCA, was an organization founded by Ugors, a unicellular sentient species indigenous to a planet in the Paradise system. After they ruined their planet with poisons resulting from too much industry and overpopulation, they began to worship all kinds of rubbish, and over time they became the primary garbage collecting species in the galaxy. They even gained a contract to collect the refuse of the Galactic Empire, though they fought for this right with the Squib species."}, {"tag": "p", "text": "Some time after they wrecked their once glorious planet, the Ugor people set up several waste recovery companies, the most well known of which were Ugor Salvage Company, Waste Haulers Unlimited, and Dismantled Droid Disposal Device, all of which were loyal to and sent their profits to the Holy Ugor Taxation Collection Agency."}, {"tag": "h2", "text": "Leadership"}, {"tag": "p", "text": "Eventually, the Holy Ugor Taxation Collection Agency and its leader began to rise in power, until it held supreme authority over every single Ugor in the known galaxy. The Ugors were an unpleasant species, who felt that cheating, gambling, and bargaining were the way to live, and because of this, the name and identity of the leader of the Holy Ugor Taxation Collection Agency changed extremely regularly. During the reign of Emperor Palpatine, for example, the leader of the HUTCA was known to change almost hourly because of the complex nature of Ugor negotiations."}, {"tag": "h2", "text": "Bureaucracy"}, {"tag": "p", "text": "Although they were officially in charge of the Ugor race, the Holy Ugor Taxation Collection Agency held no actual power, due to the Ugor bureaucracy and the painstakingly slow process that was needed for the Holy Ugor Taxation Collection Agency to pass a new law or to change an old one. The Ugor bureaucracy beneath HUTCA was so well established that it was practically impossible for any real change to happen, so the official power held by the Holy Ugor Taxation Collection Agency and its leader was almost completely worthless."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Holy Ugor Taxation Collection Agency first appeared in West End Games' Galaxy Guide 4: Alien Races, written by Troy Denning as a supplement to Star Wars: The Roleplaying Game in 1989. The supplement was revised for the second edition by Chuck Truett in 1994. From an in-universe perspective, the book is supposed to be made up of excerpts from the Catalog of Intelligent Life in the Galaxy by an Imperial sentientologist named Obo Rin, who was commissioned by Darth Vader to catalog the intelligent species of the galaxy."}, {"tag": "h2", "text": "Sources"}]}