{"url": "Homecoming", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Homecoming"}, {"tag": "p", "text": "\"Homecoming\" is the sixteenth episode of the second season of the animated television series Star Wars Rebels. It is the thirty-first episode of the series overall. It was directed by Bosco Ng and written by Steven Melching. Corey Burton, Robin Atkin Downes, Keone Young, and Catherine Taber guest star. The episode premiered on February 17, 2016 on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Ghost crew joins forces with Cham Syndulla, father of Hera and Clone Wars legend. But will his thirst for revenge—and fractured relationship with his daughter—cost the rebels a victory?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "A tenuous reunion"}, {"tag": "p", "text": "On one mission, Hera Syndulla and Garazeb Orrelios were transferring a cargo from the Ghost into a Sphyrna-class Hammerhead corvette while being pursued by an Imperial-class Star Destroyer and its TIE fighter escorts. After Zeb loads the shipment, the other rebels are able to jump into hyperspace. However, the Phoenix Squadron pilot Phoenix Two's A-wing starfighter sustains damage to its hyperdrive. Phoenix Two attempts to dock with the Ghost but is hit by enemy fire. With little choice, Hera is forced to take the Ghost into hyperspace with the rest of the fleet."}, {"tag": "p", "text": "Following the mission, Hera and Kanan Jarrus contact Commander Jun Sato via hologram and inform him that the rebels are losing more pilots and starfighters than they can replenish. Hera asserts that they need a safe place to land. Sato informs Hera and Kanan that he has received intelligence that an Imperial Quasar Fire-class cruiser-carrier has been spotted above Ryloth. Sato suggests stealing the ship and tells them to make contact with the Ryloth rebels. Hera knows the leader of the Ryloth rebels, her father Cham Syndulla, with whom she has an estranged relationship with. In private, Hera contacts Cham, who remarks that he was not expecting to see her."}, {"tag": "p", "text": "Later, Cham and two other Twi'lek rebels Numa and Gobi Glie travel on a former Republic Nu-class attack/transport shuttle to meet the Ghost in space. Inside the Ghost, Kanan is visibly nervous about meeting Hera's father due to his relationship with Hera and takes it out on his Jedi apprentice Ezra Bridger. After Cham and his fellow Twi'lek rebels enter the ship, Kanan introduces the crew, mixing up Ezra, Sabine, and Zeb and leaving out Chopper entirely, who grunts in annoyance. Cham is impressed by the rebels, whom he calls a \"fine group of fighters.\" Sabine greets Cham and tells him that she learned about his tactics during the Clone Wars at the Imperial Academy on Mandalore. Cham then introduces Numa and Gobi to the Spectres."}, {"tag": "p", "text": "Using a hologram projection pod, Hera briefed the crew of the Ghost and the Twi'leks about her plan to infiltrate the Imperial carrier above Ryloth with a stolen TIE/sa bomber. Disagreeing with his daughter's plans, Cham instead proposes destroying the carrier to show Ryloth the Resistance's strength. In response, Hera replied that Cham and his band would have destroyed the ship by now if they had the means to do it. Since they lacked the means, she suggested compromising and working with her rebel band. She stressed that the rebellion needed the carrier. Kanan then backed her up by telling Cham and his band that they should work together in order to achieve a win-win situation."}, {"tag": "p", "text": "In private, Ezra asked Hera about her relationship with her father. While Hera was repairing Chopper, Hera revealed that she and Cham had not spoken for years due to their differences about her joining the rebellion rather than fighting for Ryloth's freedom. She explained that Cham had spent his whole life fighting both the Confederacy of Independent Systems and the Galactic Empire. After her mother died, Cham devoted his whole life to freeing Ryloth from Imperial rule and neglected his own daughter. Their conversation was interrupted by the arrival of Cham, who informed the rebels that they should be getting ready for their mission. Ezra exits the room but not before muttering that family is always more important."}, {"tag": "p", "text": "Entering the room, Cham quickly recognized Chopper as the old astromech droid that Hera had found during the Clone Wars. Hera replied that the droid's name was Chopper while Chopper beeped in affirmation. Cham then remarked that if Hera had showed him half the devotion that she had shown Chopper (whom he termed a \"second rate junkpile\"), they would have won back Ryloth by now. Chopper grunted in protest while Cham proceeded to scold his daughter for devoting her life to the rebellion, which he termed a wrong cause. Speaking in a Twi'lek accent, Hera defended her devotion to the rebel cause by arguing that the rebels were fighting to free everyone including Ryloth. Cham responded that outsiders could not be trusted and that he was only fighting for Ryloth. Unable to resolve their differences, Cham stormed out of the room; leaving Hera alone with Chopper."}, {"tag": "h3", "text": "Stealing the Imperial fighter carrier"}, {"tag": "p", "text": "For their mission, the Lothal and Twi'lek rebels departed on Cham's Nu-class attack shuttle into hyperspace. During their journey, Kanan talked about how the Jedi Master Mace Windu had spoken highly about Cham's tactics during the Battle of Lessu. Cham elaborated about his exploits during the battle including seizing the plasma bridge and how the attack was remembered in history as \"The Hammer of Ryloth.\" Cham's companions Numa and Gobi also befriend the rebels and Kanan seems to be taken in by Cham and attributes Hera's leadership qualities to him. However, Hera does not fully trust her father."}, {"tag": "p", "text": "As they exit hyperspace, the rebel shuttle approaches the carrier and everyone boards the stolen TIE bomber. Cham instructs Gobi to prepare for their landing. The rebels plan to seize the carrier while its TIE bombers are on a bombing run on Ryloth. Hera then signals for A-wing starfighters to pursue their stolen bomber. Heading to the carrier, they request permission to land and are directed to Bay Two. The two rebel A-wings then disappear into hyperspace. Upon landing, Hera crashes the TIE bomber into the hangar bay to make it look damaged."}, {"tag": "p", "text": "Before they can proceed to their mission, Sabine realizes that the Twi'lek rebels have brought explosives aboard. Cham and his companions then stun the rebel crew and proceed on their original mission to blow up the fighter carrier. After exiting the ship, the three Twi'leks overpower an Imperial containment party. Back on the bomber, Hera wakes up to find herself chained and kicks Chopper awake. Chopper frees his master from her restraints while informing her that Cham has betrayed them. After Ezra and Sabine inform Hera that the Twi'leks have bags of detonators, Hera realizes that Cham is heading to the ship's munition racks and resolve to stop the Twi'lek rebels in their tracks. Cham intends to make the explosion visible for all Ryloth to watch."}, {"tag": "p", "text": "On the bridge of the Imperial carrier, the commander sends reinforcements to check the adjacent hangar bay after losing contact with the containment squad. Meanwhile, Sabine and Zeb attempt to sneak up on Numa and Gobi only to get involved in a blaster battle with the Ryloth rebels and stormtroopers. Meanwhile, Cham proceeds alone to sabotage the ship's hyperdrive. In the ship's corridors, Ezra and Kanan fight stormtroopers while dodging blast doors, using their lightsabers to cut open the doors. The two Jedi are followed by Hera and Chopper. The four rebels eventually make their way onto the command bridge where Ezra uses a Jedi mind trick to force the Imperial commander to order an evacuation of the ship. All the Imperials abandon ship and flee on escape pods."}, {"tag": "p", "text": "Elsewhere, Sabine and Zeb used a rigged mouse droid to trip up Numa and Gobi, knocking them out. Back on the bridge, Cham runs into the crew of the Ghost and reveals that he has disabled the ship's hyperdrive. He tries to contact Gobi and Numa only to learn that Sabine and Zeb have captured them. With both sides deadlocked, Hera tried to reason with her father again. She told him that if they destroyed the carrier, the Empire would only send another one to Ryloth. However, if they stole the carrier, they could use it to fight the Empire. Cham responded that his daughter had not seen what the Empire had done to Ryloth; namely the plundering of the planet's resources and the enslavement of the Twi'leks. He wanted to use the carrier's destruction to demonstrate what the Twi'lek rebels could accomplish."}, {"tag": "p", "text": "Hera responded that she wanted Ryloth to be free but reiterated that the battle could not be won on Ryloth alone. As they argue, Imperial fighters and a shuttle approach the carrier to retake it. In the munitions racket, Sabine plays the recording of Hera and Cham's conversation to Numa and Gobi. Hera tells Cham how he inspired her and her motives for joining the rebellion. After Ezra adds that they have to buy Hera enough time to take the ship, Cham and the others agree to help. While Cham instructed Chopper how to repair the hyperdrive, the other rebels used the ship's cannons to fight off the Imperial reinforcements. The carrier's TIE bombers then return and begin firing torpedoes at the carrier, damaging the ship's stabilizers. Hera manages to take evasive action and to stabilize the ship with her father's help."}, {"tag": "p", "text": "Meanwhile, Sabine, Zeb, Numa and Gobi managed to shoot down the TIE bombers. After working together to regain control of the ship, Hera and Cham realize that they are stronger together. However, their problems are not over. An Arquitens-class command cruiser arrives. After telling Chopper that he had shut down the hyperdrive's couplings on the third and fourth generators, he and Ezra meet up with Sabine in the hangar bay. Using their stolen TIE bomber, Ezra casts the bomber adrift. Cham fires on the bomber, causing it to explode and engulf the Imperial light cruiser. With its magazine compartments aflame, the burning cruiser plummets down to Ryloth. After Chopper completes repairs to the fighter carrier's hyperdrive, the ship jumps into hyperspace."}, {"tag": "h3", "text": "Reconciliation"}, {"tag": "p", "text": "Following the battle, Cham informed his daughter Hera that the theft of the Imperial carrier had rallied the Ryloth rebels like never before. More people were joining its ranks. Cham also reconciles with his daughter, whom he describes as sharing her mother's idealism. Hera responds that Cham taught her leadership. The crew of the Ghost then watched as Cham and his Twi'lek comrades departed on their shuttle into space."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}