{"url": "Home_is_Where_the_Shrieks_Are", "categories": ["Category:Real-world articles", "Category:Ewoks episodes"], "nodes": [{"tag": "h1", "text": "Home is Where the Shrieks Are"}, {"tag": "p", "text": "\"Home Is Where the Shrieks Are\" is the third episode of the second season of Ewoks. Written by Bob Carrau and directed by Dale Schott, the episode originally aired on ABC on September 20, 1986."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Upset that he was performing household chores for his mother instead of training with the Ewok warriors, Wicket decided to move out of the Warrick family hut. As he left the village, Teebo caught up with him, and when he realized that he felt the same as Wicket, Teebo decided to leave home as well."}, {"tag": "p", "text": "The duo moved into an old tree fort in the forest and decided to fix the place up. But tension grew between the two as they realized that their current workload was worse than it was at their respective homes. Since the boys would not be attending the village Harvest Festival that night, Latara and Kneesaa brought them some stew for dinner. However, Wicket and Latara got into a culinary quibble which ended with Wicket covered in stew."}, {"tag": "p", "text": "As their first night out approached, Wicket cleaned up the fort while Teebo went out to look for food. Teebo returned, well fed, with his new friends—a trio of Kagles. The Kagles, however, chose not to stay once they learned the Ewoks had moved in without getting permission from the current landowners, the Shrieks. Although Teebo became afraid, Wicket decided that they would remain at their new fort rather than return the village."}, {"tag": "p", "text": "That night, the Shrieks haunted the Ewoks. The unafraid Wicket dragged Teebo along as he traced the cackling voices all the way to the inside of the tree the fort was built in. Wicket outsmarted the Shrieks, and soon realized there was only one Shriek—Larry, a lonely three-eyed being who had also run away from home long ago. However, when Larry had eventually returned home, he found that his people had all moved away. Wicket then had an epiphany and returned to the village immediately, bringing both Teebo and Larry along with him, and they were all able to enjoy the rest of the Harvest Festival."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}