{"url": "Homeworld_Security_Command", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Galactic Republic military units", "Category:Law enforcement"], "nodes": [{"tag": "h1", "text": "Homeworld Security Command"}, {"tag": "p", "text": "Homeworld Security Command, or simply Homeworld Security, was a branch of the Galactic Republic government charged with ensuring the security of the capital planet Coruscant. This task included coordinating security patrols and managing orbital security stations with military forces, as well as keeping them on alert for security threats to Coruscant. During the Clone Wars between the Republic and the Confederacy of Independent Systems, the clone shock troopers of the Coruscant Guard were assigned to Homeworld Security to enforce tightening security measures. Stationed outside public gathering areas such as theaters, hotels, government buildings and other areas of vital infrastructure, the shock troopers were given wide powers to stop and search beings, their belongings, and private residences. Although most citizens of Coruscant saw no issue with the measures, certain Senators such as Bail Organa did. Recognizing that the shock troopers were simply responding to their training, Organa still saw the actions of the troopers as another method for Supreme Chancellor Palpatine to grab power. Despite the increase in security, Homeworld Security was still caught off guard when General Grievous of the Separatists attacked Coruscant and kidnapped Chancellor Palpatine. With the Declaration of a New Order establishing the Galactic Empire, shock troopers were stationed in the Senate Building and Republic Executive Building to ensure a smooth transition of government."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Homeworld Security Command was a branch of the Galactic Republic charged with coordinating security operations on the capital planet Coruscant. Composed of a civilian team, Homeworld Security worked closely with military forces to ensure that orbital security stations and ground-based security patrols were on alert for any major security threats. They set up emergency procedures and coordinated responses to major security incidents. During the Clone Wars between the Republic and the Confederacy of Independent Systems, Homeworld Security supervised the Coruscant Guard, a body composed of clone shock troopers. The troopers were stationed outside major businesses, government buildings, and other public areas to conduct checkpoints. The Guards also conducted police raids and searches and seizures of any suspicious persons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "To ensure public safety, Homeworld Security coordinated their efforts with civilian police and military forces. They were active by 22 BBY with the outbreak of the Clone Wars between the Republic and the Confederacy of Independent Systems when incidents of terrorism and the threat of invasion became a pressing concern. A successful anti-terror operation by clone commandos of the Grand Army of the Republic's Special Operations Brigade and members of the Anti-Terrorism Unit of the Coruscant Security Force (CSF) demonstrated the need and usefulness of clone troopers to assist in securing Coruscant."}, {"tag": "p", "text": "As part of increased efforts to tighten security, the clone shock troopers were established as the Coruscant Guard and became a part of Homeworld Security. Although unknown at the time by the general public, the move had been pre-planned by Supreme Chancellor Palpatine. The shock troopers, as well as the clones of the 501st Legion, had been trained on Coruscant for law enforcement duties and emerged trained for the city terrain with the outbreak of war. The passage of the Emergency Powers Act by the Galactic Senate and, later into the war, the Enhanced Security and Enforcement Act, gave Homeworld Security increased authority to secure Coruscant. Shock troopers operated increased checkpoints and were stationed at vital government buildings, banks, hotels, theaters, and other major gathering areas. The shock troopers had authority to conduct stops and search beings as well as search belongings and private residences. Other measures by Homeworld Security including having Holocams installed in previously private areas of the Senate's Grand Convocation Chamber. Rumors surfaced of other government activities, such as antiwar demonstrations put down with brutal force, beings disappearing, and private property seized from their owners, although they were quickly discredited by government officials. Senator Bail Organa recognized the actions of the shock troopers as those of bred soldiers simply following their training and that there was no randomness or animosity in their actions. Yet Organa and other senators felt that the deeds of the shock troopers were just more examples of too much power resting in the hands of Palpatine, whom they viewed as the driving force behind Homeworld Security."}, {"tag": "p", "text": "Despite the increased security measures and coordination between military and civilian forces, Homeworld Security was caught off guard with the attack on Coruscant by the Separatist General Grievous. As Coruscant military command coordinated defense efforts with the Coruscant Home Fleet and the arriving Open Circle Fleet, Homeworld Security enacted its emergency procedures. The CSF attempted to evacuate vulnerable areas and clear skylanes as Separatist battle droids landed and fought with Republic clone troopers. Supreme Chancellor Palpatine and his Red Guards were moved from the Senate Building and secured at 500 Republica. However, those measures were unable to prevent Grievous from landing and kidnapping the Chancellor, overwhelming Palpatine's security detail. Two Jedi, Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker, retrieved the Chancellor, and Republic forces routed the Separatists. In the aftermath of the battle, the presence of Coruscant Guard shock troopers and the 501st Legion were increased in public areas on Coruscant. Clone troopers were also paired with CSF police officers on patrol and checkpoints were increased."}, {"tag": "p", "text": "Palpatine's issuance of Order 66, which declared all Jedi as enemies of the state, became a major operation of Homeworld Security. As the 501st Legion under the command of the new Dark Lord of the Sith Darth Vader took the Jedi Temple, the Chancellor's office declared martial law. With Palpatine's Declaration of a New Order, in which he dissolved the Republic and claimed the title of Galactic Emperor, the Coruscant Guard was stationed in the Senate Building and Republic Executive Building to ensure a smooth transition of government. The reorganization of the Republic into the Galactic Empire brought drastic changes. With the new military authority in place, the Coruscant Guard became independent and was given primacy to police Coruscant, although they continued to rely on the Coruscant Security Force for general support. The Internal Security Bureau had already been formed and was combined with elements of the Commission for the Protection of the Republic and CSF's Anti-Terrorism and detective divisions by order of Palpatine. They became the Imperial Security Bureau (ISB) which took a firm grip in all issues related to internal and external security threats."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Homeworld Security Command first appeared in Labyrinth of Evil, a novel written by James Luceno and published on January 25, 2005. Homeworld Security also received an entry in The Complete Star Wars Encyclopedia, published in 2008 by Del Rey. Reviewers of Labyrinth of Evil made note of several similarities between the novel and the real world. One such alleged connection is that the Homeworld Security Command and the new security procedures have a striking resemblance to the real-world U.S. Department of Homeland Security, a department set up to combat terrorist threats."}, {"tag": "p", "text": "Homeworld Security's fate after the formation of the Empire has not been officially clarified. The Complete Star Wars Encyclopedia lists Homeworld Security Command as a Republic organization but makes no mention of its status during the Empire. Other sources indicate Homeworld Security's responsibilities were given to other agencies. As stated in Galaxy at War, law enforcement functions and coordinating the activities of police and military forces on Coruscant came under the Coruscant Guard and the Emperor's Royal Guard with the Coruscant Security Force in a support capacity. The responsibility to monitor for internal and external threats was given to the Imperial Security Bureau according to The Complete Star Wars Encyclopedia and numerous other sources including Imperial Commando: 501st. Additionally, there is no further mention of Homeworld Security within any sources taking place during the Imperial rule of Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}