{"url": "Homeworld/Legends", "categories": ["Category:Legends articles", "Category:Stub", "Category:Articles needing additional sources", "Category:Moon types", "Category:Planetary types"], "nodes": [{"tag": "h1", "text": "Homeworld"}, {"tag": "p", "text": "Homeworld, sometimes referred to as \"home planet,\" was a term used to identify the planet that a being was raised or born on, or migrated to, and in the case of droids, where they were constructed. Many notable individuals, such as Luke Skywalker and Leia Organa Solo, referred to the planets where they spent their childhood as their homeworld, despite the fact that they were born elsewhere. Natasi Daala referred to her birthworld as her homeworld, even though she grew up elsewhere. Curiously, Yoda, Grand Master of the Jedi Order, never revealed his homeworld."}, {"tag": "p", "text": "The term homeworld also referred to the home planet of a species. Most species had a homeworld or home system. Some were found in many systems, while others, suchs as the Hutts, had transplanted themselves to a new home. There were thousands of such homeworlds throughout the galaxy. Most of these planets had modern starports, a sophisticated trader network and a high level of technology. The term was also used to describe the homeworld of a culture, like the planet Mandalore, the homeworld of the Mandalorians, an ancient, warrior-based culture."}, {"tag": "p", "text": "Members of some species, like the Falleen and the Kaminoans, rarely left their homeworld. Most Ithorians never set foot on their homeworld, and instead spent most of their time on floating cities above Ithor. As a result, most of them were comfortable only on starships or other artificial constructs. Flakax who left their homeworld tended to become psychopaths."}, {"tag": "p", "text": "The Yevetha equivalent term was spawnworld."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": "The following is a list of media in which homeworlds are specifically referred to:"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}