{"url": "Homemade_evacuation_pod", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Escape pod classes", "Category:Wookiee vehicles"], "nodes": [{"tag": "h1", "text": "Homemade evacuation pod"}, {"tag": "p", "text": "Homemade evacuation pods, also called Kashyyyk Pods, were simple vessels constructed by the Uurbahhahvoovv Joiners & Artisans for last-resort evacuation by the Wookiees of Kashyyyk. Capable of propelling a single passengers into interplanetary space, one of these escape pods was utilized by Jedi Grand Master Yoda to flee Kashyyyk after the Clone Wars battle during which Order 66 was executed."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "These simple, Wookiee-made vessels were created by the Uurbahhahvoovv Joiners & Artisans, who undertook a sturdy and practical construction to accommodate a single Wookiee passenger. The homemade pods were created using pieces cobbled together from shipwrecks, including their three sublight thruster nozzles. These were situated on the base of the conical vessel, located below the fuel tank, reactor, and sensor pit. A single seat was fitted into the pod's central section, with both adjustable seat restraints and a headrest designed to accommodate a Wookiee's frame and height. A control panel was located to the occupant's left. Above, a sensor processor, guidance computer, and an optical sensor window were built into the pod's conical tip."}, {"tag": "p", "text": "The exterior of the evacuation pod was fitted with a heatproof hull, which reflected the practicality of the ship's design, and the Wookiees' sturdy construction. Curved stabilizer fins ensured a stable and rifled ascent through Kashyyyk's atmosphere. The ship's fuel capacity was enough to blast its passenger into interplanetary space, at which point they would utilize the vessel's distress beacon to call for rescue from any nearby starships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As battle droids of the Separatist Droid Army began overrunning the forests and lagoons of Kashyyyk during the late stages of the Clone Wars, Wookiee defenders prepared thousands of last-resort evacuation pods in hidden locations."}, {"tag": "p", "text": "Although the Galactic Republic was ultimately victorious during the Battle of Kashyyyk, the struggle ended around the time that Supreme Chancellor Palpatine issued Order 66 to his clone troopers. Jedi Grand Master Yoda fled his former allied forces, enlisting the help of Tarfful and Chewbacca to reach an evacuation pod hidden behind bushes in a remote location. Yoda bade farewell to his Wookiee friends, and departed the planet aboard the pod. He deactivated the onboard distress beacon, knowing it would be a tell-tale signal intercepted by enemy forces, and instead relied upon his Jedi emergency transmitter to send his ID and location through encrypted channels. The signal was intercepted by Alderaanian agents on Coruscant, searching for surviving Jedi, who informed Bail Organa of the Jedi Master's position. Yoda's pod was discovered by Organa's vessel, the Sundered Heart, and he and his escape craft were brought on board."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The homemade evacuation pod was created for Star Wars: Episode III Revenge of the Sith, as one of two escape pods used by Yoda in the film. The art department ensured the two were visually different from one another. The scene where Yoda says goodbye to Tarfful and Chewbacca before departing in the pod was an homage to the ending of the Steven Spielberg film E.T. the Extra-Terrestrial.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}