{"url": "Hondo_Ohnaka/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Males", "Category:Members of the Ohnaka Gang", "Category:Slaves", "Category:Weequays"], "nodes": [{"tag": "h1", "text": "Hondo Ohnaka"}, {"tag": "p", "text": "Hondo Ohnaka was a Weequay male pirate and the captain of the Ohnaka Gang, a Weequay pirate group, on the backwater planet Florrum during the waning years of the Galactic Republic. Born to a poor family, Ohnaka was sold as a child into slavery by his parents. Ohnaka eventually managed to escape the life of slavery by stowing away on an offworld ship, after which he formed a group of pirates on Florrum. Ohnaka's pirates flourished during the Clone Wars by dealing spice and receiving ransoms through kidnapping and extortion."}, {"tag": "p", "text": "One of these kidnappings was eventually Count Dooku, the Head of State of the Confederacy of Independent Systems fighting against the Galactic Republic during the Clone Wars. Realizing how valuable Dooku was, Ohnaka attempted to sell him to the Galactic Republic for a hefty spice ransom. The ensuing hostage crisis also led to the capture of the Jedi Obi-Wan Kenobi and Anakin Skywalker. The Jedi and Dooku managed to escape with the assistance of a squad of clone troopers led by Representative Jar Jar Binks of the Galactic Senate. Ohnaka later confronted the Jedi once again on Felucia during one of his routine raids on an agricultural settlement, though the Jedi and a team of bounty hunters, led by Sugi, fought off Ohnaka and his pirate forces."}, {"tag": "p", "text": "Later in the Clone Wars, he agreed to deliver missile launchers to the Onderon rebels after being met by Skywalker. Some time after that, his base was destroyed in a raid by General Grievous, forcing him to team up with a group of Jedi Initiates to escape. In 20 BBY, the Sith Lord Darth Maul and his brother/apprentice Savage Opress arrived at Florrum to hire a gang of bounty hunters. Ohnaka and loyalist pirates, aided by the Jedi Kenobi and Adi Gallia, fought and defeated the two brothers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Hondo Ohnaka was from the planet Sriluur. His father and mother were poor swindlers and had sold Hondo as a slave to \"honor\" the Weequay god Quay. Hondo didn't believe in the power of the gods. He thought he was sold as a slave because his parents were just poor, not because Quay wanted it. The young Ohnaka escaped slavery as a child by stowing away on a ship heading for Boonta."}, {"tag": "p", "text": "On Boonta, he served as a cupbearer for Porla the Hutt. Hondo found out that the spice smugglers of Porla were asking for strange prices for their spice and that they were always caught by the Republic when they were bringing the spice to Porla. He whispered advice to his Master about these shady business deals. Porla was thankful to him, and Ohnaka became Porla's personal advisor. After gaining Porla's trust, he made off with several other servants on Porla's skiff, bringing along Starhawk speeder bikes, Ubrikkian tanks and weapons. He then ventured to Florrum, where he founded a base. At some later point, he also became familiar with bounty hunter Jango Fett, whom he described to be a good friend and honorable man. He also came to know Aurra Sing and had a relationship with her."}, {"tag": "h3", "text": "The Ohnaka Gang"}, {"tag": "p", "text": "During the Clone Wars, Ohnaka's band of pirates situated on Florrum grew in strength and chose to stay neutral. Hondo wore a Desevrar Infantry helmet, Corellian-made pants and a cloak he stole from a Wroonian nobleman. He had also stolen several Flarestar-class Weequay ships and a Surronian cruiser from a collector on Farana. Ohnaka had a pet Kowakian monkey-lizard named Pilf Mukmuk."}, {"tag": "p", "text": "Ohnaka and his pirates were mostly active in the Outer Rim, stealing the cargo of ships and holding the passengers for ransom. Especially in areas like the Tion Hegemony and the Corporate Sector, they could do whatever they wanted. Ohnaka taught his men that killing was bad for the business, because nobody would pay ransom for a corpse. Later he began seeing some profit by working in the spice trade. Hondo already had some experience with it, and a stolen spice cargo worth 400,000 credits was enough to start Hondo's idea. Still not under the attention of either faction, having never done anything to draw undue attention to themselves, the group and its leader now had business dealings in both ransoming hostages and selling spice on the black market."}, {"tag": "p", "text": "After Count Dooku, a Sith Lord and member of the Separatist movement, fled in his solar sailer from the forces of the Republic in a short skirmish, he was shot down and crashed onto the surface of Vanqor. Ohnaka found Dooku fleeing from the Jedi Knights Anakin Skywalker and Obi-Wan Kenobi and he attempted to sell a passage off the planet to Dooku. Ohnaka's offer was taken by Dooku, who agreed to pay in order to escape from Skywalker and Kenobi, since the Jedi wished to take him to Coruscant for trial and imprisonment. Dooku claimed he was above material wealth and paid the price. He also made sure to hide his lightsabers so as not to show his status as a Sith Lord and important figure within the Confederacy, which could make the pirates choose to hold him for ransom. Taking the Count to the planet Florrum, Ohnaka put the ship down in his organization's base."}, {"tag": "h3", "text": "Capture of Count Dooku"}, {"tag": "p", "text": "Before Ohnaka arrived on the planet with Dooku, he had instructed Mukmuk, his pet monkey lizard, to steal Dooku's lightsaber and the other lightsaber Dooku was carrying (having stolen Anakin's while on Vanqor) on the journey. Having done so, Ohnaka then had his men surround Dooku and take him prisoner. Dooku attempted to negotiate that if he could get proper means of communications, he could call someone to pay any ransom for him. But Hondo and his gang didn't \"survive the Outer Rim by being stupid.\" He knew that if Dooku contacted the Confederacy, their armies would crush them in order to get Dooku free of charge."}, {"tag": "p", "text": "Ohnaka demanded a ransom of 1,000,000 credits in spice from the Republic to be paid in order to claim the Count. Ohnaka felt he could sell the spice on the black market for a higher price, and so make an even bigger profit. Chancellor Palpatine of the Republic discussed this with both Ohnaka and other officials in the Republic, before reaching the decision to comply with his demands."}, {"tag": "p", "text": "Palpatine sent Jedi Knights Obi-Wan Kenobi and Anakin Skywalker to confirm that Dooku had been captured by the pirate gang. Arriving at the base, Kenobi and Skywalker were able to identify the hostage as Dooku. Having verified his presence to the Chancellor, Hondo invited the two Jedi to a banquet with his pirates to \"celebrate a successful transaction.\" Ohnaka, however, drugged the drinks he intended to give to the two Jedi."}, {"tag": "p", "text": "Ohnaka gave the drugged drinks to the two Jedi, but they sensed the deception and switched their drinks with two other pirates. Mukmuk saw this, so he put the drug in the ventilation shaft, which rendered everybody in the room unconscious. Ohnaka proceeded to take the Jedi as hostages too, and had them locked into the same cell as Dooku. Ohnaka meant to ransom the two Jedi in addition to Dooku, so he could triple the amount of credits."}, {"tag": "p", "text": "The Republic, knowing Dooku to be on the planet, had sent Senator Kharrus and Representative Jar Jar Binks with a spice ransom to Florrum, in addition to a number of clone troopers of the Diplomatic Escort Group. Ohnaka didn't know that Turk Falso, his lieutenant, wanted the spice for himself and that he arranged to have their craft shot down by fellow pirate Barb Mentir with Flarestar-class Weequay ship."}, {"tag": "p", "text": "Mentir succeeded and killed Kharrus and the clone pilots within the ship. During this time, the three prisoners tried to escape. Ohnaka, however, was able to make sure that they were recaptured before they could escape, and he had them confined with armed guards. Hondo thought the ship carrying the ransom was merely delayed, while it had in fact been shot down."}, {"tag": "p", "text": "Falso wanted to know if Mentir had the spice with him, but Mentir answered him that the shuttle had crashed in the Doshar fields. Falso was angered and decided to get the ransom himself. He rounded up some Weequays and they went to the crash site on swoop bikes. They attacked the ship and stole the spice inside. However, the clones followed the swoops by riding on skalders, creatures native to Florrum. The clone troopers retained the spice back and they killed all the pirates, except Falso who returned to Ohnaka. He wanted to cover his deceit to Ohnaka, so he told Ohnaka the Republic hadn't sent the ransom, but an army instead. He believed the lies and he agreed with Falso to send several tanks to destroy the clone army."}, {"tag": "h3", "text": "Hostage escape"}, {"tag": "p", "text": "After the third time the hostages tried to escape, Ohnaka had the three escapees recaptured again and brought Dooku back to his cell. Hondo had Obi-Wan and Anakin brought out to be tortured, using electricity."}, {"tag": "p", "text": "Meanwhile, Jar Jar Binks met with the pirates inside one of the tanks, to negotiate with them, but he destroyed one of them and knocked out the power lines to the pirate stronghold. The remaining two tanks were captured and used as transports to Ohnaka's pirate outpost. Hondo was now without power in his own base. The resulting power outage freed Anakin, Dooku and Obi-Wan. Hondo was taken hostage by the two Jedi, who used him as a shield to ensure that they weren't attacked by Hondo's pirates. Dooku killed the Weequay cell guard in front of his cell and Falso and his accomplice, after escaping in the ship the two pirates were planning to escape in."}, {"tag": "p", "text": "When it became apparent that Dooku had escaped, the Jedi set Hondo free, wanting no unnecessary hostilities from the pirates. Having been spared his life by the Jedi, Hondo ordered his men not to fire upon the Jedi. Hondo praised the Jedi for their nobility, and in return promised that he and his pirates would allow them to leave unhindered. Hondo was warned by Obi-Wan that Dooku now knew the location of their base, and wouldn't be as forgiving as the Jedi toward those who had imprisoned him."}, {"tag": "h3", "text": "Skirmish on Felucia"}, {"tag": "p", "text": "Ohnaka had another run-in with Obi-Wan Kenobi and Anakin Skywalker on a nysillin farm of Felucia, which Ohnaka's pirates routinely raided. The Jedi were accompanied by a band of four bounty hunters led by the Zabrak mercenary Sugi, hired by the Felucian farmers to defend them against further pirate attacks. Ohnaka offered to buy out the mercenaries, but Sugi rejected his offer. The pirate demanded the Felucians to have the harvest ready for him in the morning before leaving the village and regrouping with the pirate forces."}, {"tag": "p", "text": "The Jedi spent the following day training the Felucians to defend themselves, which caught the attention of a scout sent by Ohnaka to investigate. However, Sugi discovered the scout and sent one of her accomplices, Embo, who brutally killed the fleeing Weequay. When the scout failed to return, Ohnaka led his men into battle from the cockpit of a repulsortank. While his men charged the village on speeder bikes, Ohnaka opened fire on the village atop a cliff, killing the bounty hunter Rumi and injuring Embo."}, {"tag": "p", "text": "Skywalker eventually took action and leapt to the cliff, forcing Ohnaka to brandish his electrostaff in a duel against the Jedi. Skywalker eventually gained the upper hand and kicked Ohnaka off the cliff, but the pirate managed to cling to the cliffside for his life. Ohnaka pleaded to Skywalker for his mercy, and Skywalker pulled Hondo up. Ohnaka quickly double-crossed Skywalker and pushed him into the way of the repulsortank's turret, but Skywalker quickly jumped off the cliff before the ensuing explosion, giving Ohnaka time to retreat."}, {"tag": "h3", "text": "Back on Florrum"}, {"tag": "p", "text": "After returning to Florrum, Aurra Sing, Hondo's former lover, visited him with a young Boba Fett, Bossk, and Castas. Sing requested Ohnaka's assistance with business, asking for his military help if Mace Windu should show up. Ohnaka refused, saying he would not help but he would not hinder them either, although he offered Sing, Castas, and Fett an indefinite stay on Florrum. Plo Koon and Ahsoka Tano, tracking Fett, soon received intelligence leading them to the planet, and upon their arrival Hondo welcomed them, openly stating that Aurra and Boba were waiting in the bar and that they were walking into a trap, but he didn't know exactly what they were planning beyond that. After a brief encounter, Aurra stole an air speeder and was quickly pursued by Ahsoka, who had stolen another."}, {"tag": "p", "text": "Koon and Fett exited shortly thereafter, with Koon asking Hondo to convince Boba to tell where the Republic hostages, Admiral Shoan Kilian and a clone trooper, where being kept. When Boba refused to cooperate, Hondo responded by telling him to do the honorable thing, and that that's what his father would have wanted. The young clone soon gave Master Plo all the information he needed, and while Bossk and Boba were detained, Tano chased Aurra to Slave I and sliced off its wing, causing it to crash a short distance away. Soon after, Ohnaka investigated the crash site, pulled the unconscious Aurra out of the wreckage, and claimed Boba's ship, Slave I. Being a classic-starship collector, he repaired the Firespray-31-class ship and repainted it green."}, {"tag": "h3", "text": "Battle of Florrum"}, {"tag": "p", "text": "Shahan Alama, a Weequay bounty hunter and member of Cad Bane's posse had to go into hiding from the Republic, because of his involvement in the Senate hostage crisis on Coruscant. He took his Flarestar-class Weequay ship to the Outer Rim Territories, when his ship was spotted by a Separatist Munificent-class star frigate. The captain of the frigate recognized the Weequay ship as the same type of ship used by Hondo Ohnaka's pirate gang. He knew that Count Dooku had been kidnapped by the gang and thought that Alama was a member of the gang. The captain knew Dooku wanted payback and ordered to open fire on the craft. Alama headed to the surface of Florrum to escape the firing frigate."}, {"tag": "p", "text": "Meanwhile, a Republic task force, using a Acclamator-class assault ship under the command of Jedi General Aayla Secura, was scouting the area. Clone Commander Bly reported Alama's unidentified craft to Secura, who ordered the commander to take a LAAT/i gunship and gather more information through a reconnaissance of the planet. Bly took off in the gunship with a squad of clone troopers, accompanied by several other gunships to the surface of Florrum. In the subsequent battle between Alama, the Republic and the Confederacy, Alama was shot down by Bly's gunship and crash landed on Florrum. Alama then met Ohnaka and asked him for help. Ohnaka offered him their hospitality so he could determine who wanted him so badly, and for how much."}, {"tag": "h3", "text": "Aiding Onderon"}, {"tag": "p", "text": "Around 20 BBY, Anakin Skywalker came to Florrum and asked Ohnaka if he would illegally deliver weapons to Onderon that was subjugated by the Confederacy of Independent Systems. While he questioned Skywalker about why the Jedi would want to ship weapons illegally, Skywalker offered to give Ohnaka a large enough sum of money for him to deliver the weapons and not to ask any questions. Ohnaka laughed as he accepted, and used his yacht Fortune and Glory to deliver the weapons to the Onderon rebels led by Steela Gerrera, but quickly fled when BX-series droid commandos attacked. His delivery was partially responsible for the victory of the rebels and the retreat of the Confederacy."}, {"tag": "h3", "text": "Second Battle of Florrum"}, {"tag": "p", "text": "A while after the aid of Onderon, Ohnaka and his gang intercepted the Crucible, a Jedi training cruiser passing by the system which had just departed from Ilum carrying Ahsoka Tano, R2-D2 along with six Jedi Initiates, Petro, Gungi, Katooni, Ganodi, Byph and Zatt and an architect droid, Huyang. The captain intended to seize the Initiate's rare lightsaber crystals they had just collected, stating that just one of them was worth a fortune. After boarding and searching the Jedi ship, the pirates found the Initiates, but they successfully escaped by detaching a part of their ship where the pirates were. However, Ahsoka was sucked into the pirates' Flarestar-class attack shuttle during the event and Hondo held her captive."}, {"tag": "p", "text": "After that, Hondo and his gang returned to their outpost on the surface of Florrum. That night, they expected to be entertained by a traveling circus, whose owner had a past relationship with the captain. While the pirates were enjoying the show, Hondo was invited to join the circus in one of the shows by a performer. He happily accepted and was tossed into the air but crashed into the ground, revealing the band of young performers to be the Jedi Initiates who came to rescue Ahsoka. A group of pirates chased them in a heated pursuit, while Hondo himself was too drunk to be able to recognize the Jedi."}, {"tag": "p", "text": "During the pursuit, back at the outpost, General Grievous and his droid army came after their victory in the system and claimed the planet from the pirates. Hondo was then presented with a holocommunicator connecting to Count Dooku, who stated that the invasion was a retaliation for Dooku's capture long before, and the captain was put into an energy holding cell while the droids began to dismantle the pirate gang's vehicles and ships."}, {"tag": "p", "text": "Meanwhile, the other pirates had recaptured Ahsoka and the Initiates, but they decided to join forces to save Hondo in order to get to his secret hangar full of starships after learning of the invasion. It was after Hondo was rescued that he showed his reluctance to let the children fight in a battle, but this intrigued Ahsoka, who said he didn't mind having a battle with them earlier. It's unknown whether the captain was actually feeling compassion or it was just his current mood, as he replied."}, {"tag": "p", "text": "The group then fought their way out of the outpost, with Hondo himself destroying numerous battle droids with a cutlass, and traveled to Hondo's secret hangar on a tank and several speeder bikes with the droids close behind. The path was inside a labyrinthine canyon, where the group was divided when the tank carrying Ahsoka, Huyang, R2-D2, Petro, Gungi, Byph and Zatt separated from the group. Droids soon reached the tank at an edge of the canyon, where the Jedi were forced to make a last stand against Grievous and his droids. Fortunately for them, Hondo arrived in the Slave I just in time, and the group escaped to a nearby Republic cruiser."}, {"tag": "p", "text": "After demanding reward for their rescue from General Kenobi, Ohnaka bid farewell to the Jedi and gave Katooni a brief wink, as she had given Hondo a rare opportunity to see a Jedi crafting a lightsaber earlier during his rescue, which he regarded as \"priceless,\" and also convinced him to come back for the other members during their escape from the planet."}, {"tag": "h3", "text": "Nightbrothers attack"}, {"tag": "p", "text": "During the Clone Wars, the revived Darth Maul and his brother Savage Opress visited Ohnaka's outpost on Florrum. While there, Maul convinced a portion of Ohnaka's pirate crew to turn on their captain. Having tracked Maul and Opress across the galaxy, Jedi Masters Obi-Wan Kenobi and Adi Gallia arrived on Florrum to confront the Sith. The Jedi and Sith clashed, and Gallia was slain by Opress. With Kenobi's lone ally killed, he and Ohnaka formed a brief alliance to take on Maul and Opress. Kenobi took on the two Sith Lords in a lightsaber battle, while Ohnaka managed to buy back the loyalty of his crew and set about to raid Maul's cargo-laden ship. In the following conflict, a member of Ohnaka's crew shot the escaping Maul and Opress out of the sky. Hondo and his men subsequently looted the parts and cargo from the smoldering remains of the cargo ship. Maul and Opress were nowhere to be found, and Hondo speculated that their bodies had been disintegrated in the crash. Kenobi, however, correctly deduced that the brothers had escaped before the crash."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although his morality was skewed, Hondo Ohnaka seemed to believe in a vague but consistent form of honor (for a pirate, at least). However, his morality did change somewhat over the course of the Clone Wars, especially after the incident with the Jedi younglings. Even as the leader of a pirate gang, Ohnaka only used torture as a last resort. Ohnaka claimed that he had learned this and much other wisdom from his mother, even quoting her at one point. Since his first encounter with Skywalker and Kenobi, he gained a healthy respect for the Jedi's fighting abilities and their sense of honor, but was reluctant to cross them in any way even when he had to confront them."}, {"tag": "p", "text": "One of Hondo's most marked personality traits was his air of grandeur. Considering himself a businessman, he liked to haggle and conduct ironic but good-natured arguments to get the best deal (for himself) in any given situation. But Hondo was anything but a fool: Though he liked to put on a show for his own pleasure, he recognized a fortuitous opportunity when he saw one, and would ultimately agree to any deal which promised him a win. In addition, he was able to bluff very well."}, {"tag": "p", "text": "Hondo had a passion for antiquities; he wore a Desevrar Infantry helmet, and he was proud of his collection of Flarestar-class Weequay ships and his Surronian cruiser. He had a profound distrust for payments made directly in Republic credits, preferring merchandise which he could sell for much greater winnings by allowing him to demand his own prices."}, {"tag": "p", "text": "Ohnaka was a decent tactician and leader in his own right, and he and his crew were relatively successful in their endeavors. During the skirmish on Felucia, Hondo proved himself to be skilled with an electrostaff (which he took from Dooku's solar sailer), being able to hold his own against the powerful Jedi Knight Anakin Skywalker, and though he was ultimately unable to defeat him and was disarmed, he put up a decent fight. Later, Hondo proved himself able to fend off numerous opponents at once, bold enough to take on a battalion of battle droids armed with little more than a blaster and a cutlass."}, {"tag": "p", "text": "Ohnaka was apparently friends with Jango Fett, and held him in high regard, telling Boba Fett that he was a friend and that he was deeply sorry for Boba's loss. He also had a part-time relationship with Aurra Sing. When Aurra came to Florrum to confront the Jedi, he allowed her use of his hideout, though refused her any help from himself or any of his men and declared his neutrality in the conflict. He upheld this neutrality, first warning the Jedi Master Plo Koon about Aurra's trap and later barring one of his men from firing on Ahsoka Tano while she pursued the bounty hunter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hondo Ohnaka was portrayed by veteran voice actor Jim Cummings. Cummings voiced Hondo in the manner of Mexican-born American radio, television, theater and film actor Ricardo Montalbán, who played Khan in the Star Trek film The Wrath of Khan.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}