{"url": "Honoghr/Legends", "categories": ["Category:Legends articles", "Category:Destroyed planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Honoghr locations", "Category:Hutt Empire planets", "Category:Infinite Empire planets", "Category:Kessel sector planets", "Category:New Republic planets", "Category:Sith planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Honoghr"}, {"tag": "p", "text": "Honoghr (pronounced /'hɑnoˌgɚ/) was the homeworld of the Noghri, and the only one of the Honoghr system's seven planets with a permanent population."}, {"tag": "p", "text": "Honoghr was covered by a single globe-spanning continent."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet was once part of the Rakatan Infinite Empire, around 30,000 BBY. The Rakata constructed a temple on the planet, which remained sacred to the Noghri long after the Infinite Empire's collapse."}, {"tag": "p", "text": "During the waning years of the New Sith Wars, there was a Sith Academy there, which specialized in training Sith Warriors and Marauders."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "In 20 BBY, during the Clone Wars, the non-aligned planet became an ecological disaster when, after a battle in orbit, a Lucrehulk-class Core Ship crashed to the surface. The Galactic Republic took great interest in the accident due to the Separatist ship's cargo: the toxin Trihexalophine1138. As the contaminant spread, it ravaged the planet and desiccated most of its flora. Over the next few months, plains and jungles died, forcing the Noghri to trek across the planet in a mass exodus, searching for a place where they could survive."}, {"tag": "p", "text": "Within weeks of the end of the war, Darth Vader arrived at Honoghr, and promptly found his stormtrooper guards slaughtered around him by the natives—with nothing more than primitive bladed weapons—impressing the Dark Lord greatly. In exchange for the Galactic Empire working to restore the planet's ecosystem, the Noghri gave homage to Vader and pledged to serve him as assassins—the Death Commandos. In reality, the Imperial restoration teams deliberately kept Honoghr poisoned using a hybrid grass that killed off the remaining plant life, thus keeping the Noghri bound in the service of the Empire. The planet had also been used as a training ground for Vader's secret apprentices of Galen Marek (codenamed Starkiller) and Tao, as well as for Ennix Devian, which involved dropping them onto the planet unarmed and having to evade and defeat a Noghri hunting party."}, {"tag": "p", "text": "Not long before the Battle of Yavin a Zann Consortium ground force led by Urai Fen arrived on Honoghr, to kill Commander Malinth and intimidate the Noghri. The Noghri helped the Empire to try to repel the invaders, but were ultimately beaten and their dwellings destroyed. Malinth was killed and the Noghri proved unable to defeat them."}, {"tag": "p", "text": "Later, during the Thrawn crisis in 9 ABY, Leia Organa Solo arrived at Honoghr and, using her position as the daughter and heir of Darth Vader and having discovered the Empire's trickery, persuaded the Noghri to relinquish their allegiance to the Empire. The Noghri were freed from their enslavement and became members of the New Republic and its successor government the Galactic Alliance. The Noghri were represented in the New Republic Senate by Kahr'corvh of Clan Kihm'bar."}, {"tag": "p", "text": "Leia and her entire family also became very highly respected figures in Noghri society. The New Republic helped resettle the Noghri to other planets, including Wayland, to give Honoghr time to heal."}, {"tag": "p", "text": "The world was invaded by the Yuuzhan Vong during their assault on the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "It should be noted that, while the Battle of Honoghr took place in 20 BBY, the maitrakh of Clan Kihm'bar tells Leia that the planet was devastated 48 Honoghr years ago, or 44 standard years ago. Taking into account that Leia visited in 9 ABY, this piece of information implies it happened around 35 BBY. The Essential Guide to Alien Species retconned this by saying that the year on Honoghr is shorter than usual time on other planets. However, in Dark Force Rising, the maitrakh states \"Forty-eight Noghri years. In years of the Emperor, forty-four,\" indicating the maitrakh already understood that there was a differential between Honoghr years and that of Galactic standard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}