{"url": "Honor_guard", "categories": ["Category:Legends articles", "Category:Stub", "Category:Titles"], "nodes": [{"tag": "h1", "text": "Honor guard"}, {"tag": "p", "text": "An honor guard was martial protection given to important ambassadors and politicians on diplomatic missions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Galactic Senate offered to give former Supreme Chancellor Tarsus Valorum an honor guard for his diplomatic missions. But, being the modest man that he was, he refused to put people in harm's way for his sake. Yet, Jedi Knight Johun Othone chose to travel with him to offer him some security."}, {"tag": "p", "text": "During the Separatist Crisis, before the Clone Wars, the Alwari overclans of the planet Ansion gifted an elite honor guard (composed of the finest warriors of the Situng Borokii and the Hovsgol Januul subclans) to a team of Jedi ambassadors commissioned by the Senate and the Jedi High Council to achieve an accord among the planet's urbanite government, the Unity of Community with its Unity Council, and Ansion's Alwari tribal government comprised of the councils of the ruling Borokii and rival Januul overclans."}, {"tag": "p", "text": "The Alwari honor guard, charged to shadow and protect the Jedi at all costs until they had seen the Ansionian secession vote to its conclusion, valiantly defended the Jedi when they were attacked by vicious mercenary hunters and snipers contracted by Soergg the Hutt. The honor guard's efforts ensured that the Jedi overcame their malicious assailants and found successful closure to a critical mission. Situng Borokii sentry commander Bayaar was appointed captain of the honor guard to the Jedi. After the Ansionians' critically defining vote to remain within the Republic, the overclan councils later consolidated to become the Council of Alwari Elders."}, {"tag": "p", "text": "In 22 BBY, a Cestian honor guard (composed of uniformed Kiffar males) and band (playing the Republic anthem, \"All Stars Burn as One\") greeted the arrival of a Jedi diplomatic contingent headed by Obi-Wan Kenobi at the beginning of its mission to Ord Cestus."}, {"tag": "h2", "text": "Appearances"}]}