{"url": "Hoover/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Hoovers", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Hoover"}, {"tag": "p", "text": "The Hoovers were a small, quadruped sentient species, little-known throughout the galaxy. They were brown with black eyes and disproportionately large trunks; with this, some sucked the blood of other sentients. Hoovers could become sophisticated technicians, utilizing their tiny size to effect repairs from inside machinery. The technician Attark was a pet of Jabba Desilijic Tiure, living in the Hutt's Palace on Tatooine in 4 ABY."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Hoovers were a sentient species of quadrupeds with each of their limbs ending in black, cloven hooves. They had a disproportionately long snout compared to their small body size. Hoovers could use these snouts—also known as nose trunks—to slither through clothing and around blankets. It also enabled them to suck the blood of sleeping victims, belying their otherwise harmless appearance. They had two large, black, pupiless eyes, pointed ears, a wide mouth, and a small tail. A narrow ridge began at the top of their heads and ran down their backs to their tails. At least some Hoovers had brown skin, which was heavily wrinkled."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "To the wider galaxy, the Hoovers were a mysterious and little-known species. They were part of the galactic community by at least 4 ABY, when the Hoover Attark was a member of the Tatooine court of the Hutt crime lord Jabba Desilijic Tiure. Although considered to be a pet of the Hutt, he had tremendous technical abilities, and, due to his small size, was able to manipulate detailed electronics, sometimes crawling inside machinery to repair it from within. During the night, Attark drank the blood of other members of Jabba's retinue. He was present when Luke Skywalker, Leia Organa, and Chewbacca infiltrated Jabba's Palace to rescue a carbonite-encased Han Solo, an event which subsequently led to the death of Jabba and the splintering of his criminal empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hoover was created as a maquette for the film Star Wars: Episode VI Return of the Jedi, released in 1983; however, the creature cannot be seen in the film nor its presence recalled by several of the puppeteers from the set. He was given the moniker \"Hoover\" by the creature shop of Industrial Light & Magic, from as early as 1981. Given the creature's long trunk, this was likely a reference to the Hoover vacuum cleaner. A second nickname found in the original design sketches for this creature was \"Dogephant.\" The puppet was to be operated by a puppeteer's arm through the floor. A dummy maquette shows that propmakers considered painting him a light purple with red spots on his back; he was later colored brown. The maquette ended up in the Lucasfilm Archives sporting a blonde wig."}, {"tag": "p", "text": "Early reference works, such as Return of the Jedi Monster Activity Book (1983), A Guide to the Star Wars Universe (1994) and Star Wars: Chronicles (1997), treated Hoover as the name of an individual, leaving the species unidentified. The Decipher, Inc. Star Wars Customizable Card Game (1998) first identified Hoover as the species, giving the individual in Jabba's Palace the name Attark. The Complete Star Wars Encyclopedia (2008) has an entry for both Attark and Hoover; however, it treats Hoover as an individual of the Hoover species, not connecting him with Attark. This article has treated this as an error."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}