{"url": "Horace_Vancil/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Republic senators", "Category:Humans", "Category:Legislators and councilors", "Category:Males", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Horace Vancil"}, {"tag": "p", "text": "Horace Vancil was a Human male from Naboo. He served on the Royal Advisory Council of Queen Padmé Amidala in 32 BBY and as a senator in the Galactic Senate between 30 BBY and 25 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Vancil was the Queen's political and economic advisor, often giving information about Theed's economy and keeping an eye out for political crises. His wardrobe included a heavy, black overcoat with voluminous sleeves. Vancil was present in the Theed Royal Palace when the Trade Federation disrupted the communication signal of Palpatine. Ironically, although a political crisis was occurring, Vancil kept his own council, allowing Governor Sio Bibble to share his insights. Like Palpatine, Vancil decided to continue in politics despite the Naboo tradition of retiring from politics at age twenty-one."}, {"tag": "p", "text": "In 30 BBY, he succeeded the xenophobe Janus Greejatus as Senator of the Chommell sector, although Greejatus had only held the office two years. Vancil's open-mindedness was more in touch with the interspecies-integrated society on Naboo following the treaty between Queen Amidala and Boss Nass. Vancil was replaced by Amidala herself in 25 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Strangely, most reference sources that name and show the Royal advisors overlook this character. He is named by the CCG and can clearly be seen on the Council in the movie. Secrets of Naboo inaccurately states that the Royal Advisory Council has five members. In the movie, there are clearly six. Vancil cannot be seen at the Celebration Parade, probably because this was one of the last scenes filmed."}, {"tag": "p", "text": "The name for Horace Vancil comes from the Star Wars CCG when employee Joseph Alreed was coming up with names for cards and used the last name of his friend Phil Vancil. It was thought that the first name Phil didn't sound appropriate to the Star Wars universe and Horace was fabricated instead."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}