{"url": "Horizon-class_star_yacht", "categories": ["Category:Legends articles", "Category:SoroSuub Corporation products", "Category:Yacht classes"], "nodes": [{"tag": "h1", "text": "Horizon-class star yacht"}, {"tag": "p", "text": "Manufactured by the SoroSuub Corporation during the rise of the New Republic, The Horizon-class Star Yacht was one of SoroSuub's engineering triumphs. While certain design aspects were built off the themes visible in SoroSuub's line of Personal Luxury Yachts, the Horizon-class was a true paradigm in design."}, {"tag": "p", "text": "Like the Luxury 3000, the Horizon-class yacht was designed with luxury in mind. While both ships featured an upper-level observation deck, one major difference between the two models was the cockpit. While the PLY 3000's cockpit was more of a bridge-type structure, one level below the observation deck, the Horizon was designed with a dorsal cockpit, more like that of a starfighter than a yacht or a freighter. Sitting on a forward point on the primary fuselage, the pyramidal cockpit had little in the way of standing room and seated only three crew: a pilot, a co-pilot, and a navigator."}, {"tag": "p", "text": "Another of the Horizon's unique design features were the two equipment pods on the \"wings\", extending from the upper portion of the fuselage. Generally, these pods were configured to house sensor units or other avionics systems, though it was not unheard of for them to hold incognito weapons. Certain examples of Horizon-class Star Yachts were also fitted with laser cannon turrets (generally flanking the cockpit). One example, Mara Jade's Jade Shadow, was even known to have been modified to mount a torpedo launcher."}, {"tag": "p", "text": "One feature the Horizon did have in common with its forebears were its engine wing pods. While smaller than the engine pods on the PLY 3000, the Horizon's ion engines made up for their smaller frame with an increase in power."}, {"tag": "h2", "text": "Known owners"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}