{"url": "Ambush", "categories": ["Category:Social media citations with missing permanent archival links", "Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Ambush"}, {"tag": "p", "text": "\"Ambush\" is the first episode of Season One of Star Wars: The Clone Wars, and the first episode of the series overall. Before its television premiere, the episode was shown on the Television Critics Association press tour on July 11, 2008 and later at Dragon Con in Atlanta, Georgia in September. \"Ambush\" aired on Cartoon Network on October 3, 2008. Though it is the first episode of the series, \"Ambush\" is the fifth episode chronologically, being preceded by the later episode \"Supply Lines.\""}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Jedi Master Yoda is on a secret mission to forge a treaty with the King of the strategic system of Toydaria when his ship is ambushed by Count Dooku. Yoda and three Clone troopers must face off against Count Dooku's dreaded assassin Ventress and her massive droid army to prove the Jedi are strong enough to protect the king and his people from the forces of the war."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Jedi Master Yoda is dispatched to the dried coral moon of Rugosa to convince King Katuunko to allow the Galactic Republic to build a base in Toydarian territory. As the Toydarian monarch King Katuunko and his retinue await the arrival of their Jedi envoy, Asajj Ventress arrives and presents Katuunko with a hologram of Count Dooku, who attempts to express the Jedi's supposed incapability to protect Toydaria in hopes of swaying the king to his cause. In orbit of the Rugosa moon, two Banking clan frigates ambush Yoda's ship, forcing him to take an escape pod while his ship escapes the system. Three clones—Lieutenant Thire, Jek, and Rys—accompany him to the surface."}, {"tag": "p", "text": "The Republic frigate leaves the system, a move that Asajj Ventress spins to the king as a sign of weakness. Her attempts at persuasion are interrupted however by a holographic call from Yoda, in which the Jedi Master offers his greetings. Ventress then suggests a deal: if Yoda can escape her best troops, then Toydaria will be free to join the Republic. But if he should fail and the droids prevail, Toydaria will join the Separatists."}, {"tag": "p", "text": "Agreeing to Ventress' proposal, Yoda and his troops march through the coral forest as a Separatist landing ship carrying a full battalion of droids arrives. Yoda and his men then face off against a large number of droids and several tanks. The tanks find it difficult to penetrate the dense coral forest, forcing the droid commander 224 to send his troops out on foot, which allows the clones to ambush them in small groups. Eventually, Thire is wounded, and the group is forced to retreat."}, {"tag": "p", "text": "Yoda and the clones make their way to a dried gulch lined with caves, to rest and recover. Inside a cave, the clones are less than enthusiastic about their current situation, as they find themselves outnumbered and outgunned. To raise spirits, Yoda gives his troopers a small lesson about them being individuals despite their origin as clones, and that it is their mind which makes them strong, not their numbers or weapons."}, {"tag": "p", "text": "As the droid column approaches, Master Yoda decides to face them alone, ordering his clone troopers to stay out of sight until their help is truly needed. The droids report the current situation to Ventress, who in turn orders them to open fire. Yoda ends up cutting the whole battalion to pieces, and angered, Ventress sends out ten droidekas to deal with the Jedi Master. Just before the droidekas can finish the Jedi Master, Thire launches their last rocket at an overhanging bluff, sending an avalanche of rock crashing down on the droideka reinforcements."}, {"tag": "p", "text": "Katuunko is impressed by the display, and opts to have Toydaria join the Republic. Furious about the outcome, Dooku orders Ventress to kill the king. Ventress knocks the king's Toydarian Guards unconscious and prepares to deal the killing blow, but Master Yoda arrives just in time, stopping Ventress mid-swing. Rather than surrender, Ventress quickly triggers an avalanche with pre-planted explosive charges, using it as a distraction to escape in her solar sailer. King Katuunko gladly accepts Yoda's offer to join the Republic, and Republic gunships come to retrieve the group."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "\"Ambush\" marked the series' debut on October 3, 2008. It brought in 3.96 million viewers, and was Cartoon Network's most watched series premiere."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The episode's original name was \"Ambush in the Outer Rim.\" Its title was first revealed by Henry Gilroy in an interview that featured in Star Wars Insider 103."}, {"tag": "p", "text": "The original moral of this episode was supposed to be, \"Great leadership comes in all sizes.\""}, {"tag": "p", "text": "\"Ambush\" was originally not supposed to be aired as the first episode of Season One, but the episodes' order was changed very close to the series' premiere."}, {"tag": "p", "text": "Almost two years after the original airing of \"Ambush,\" a prequel episode titled \"Supply Lines\" aired on September 24, 2010 as part of season three. It revealed the Republic's original purpose to use Toydaria as a staging ground to help the Twi'leks and supply them with food and medical supplies, which intertwined with the Ryloth Trilogy of episodes which aired later on in Season One."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}