{"url": "Horox_Ryyder/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Anx", "Category:Galactic Republic senators", "Category:Males"], "nodes": [{"tag": "h1", "text": "Horox Ryyder"}, {"tag": "p", "text": "Horox Ryyder was a male Anx senator of the Raioballo sector who served in the Galactic Senate of the Galactic Republic for over 50 years."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Horox Ryyder was the senator of the Raioballo sector, representing thousands of worlds during Supreme Chancellor Finis Valorum's last term. Ryyder was among the Senators who openly supported Valorum, even though most of the Senate wanted the Chancellor to be replaced."}, {"tag": "p", "text": "Corruption was rampant in the Senate during this time, but Ryyder joined a reduced group of senators (also including Bail Antilles of Alderaan, Yarua of Kashyyyk, and nominally Palpatine of Naboo) who took public measures to end corruption."}, {"tag": "p", "text": "In 33 BBY, Chancellor Valorum proposed the taxation of the until then free trade zones. Senator Palpatine then suggested that a part of the collected money could be invested in the growth of planetary systems in the affected areas. Ryyder and other senators of the region, including Tendau Bendon and Yarua, cheerfully supported the idea."}, {"tag": "p", "text": "Soon afterward, Ryyder and his political ally Antilles tried to meet privately with Valorum, but the Chancellor was busy with the upcoming Eriadu Trade Summit and did not receive them. However, soon afterward, Valorum asked Ryyder, Antilles and Palpatine for advice during a hostage crisis in the Senex sector. During the meeting, Ryyder analyzed the political implications involving the Ancient Houses ruling the Senex sector, with Antilles and Palpatine proposing measures to be taken."}, {"tag": "p", "text": "Horox retired in 22 BBY, and handed the title to the younger Zo Howler in a semi-private ceremony inviting only his personal friends (such as by-then retired Bail Antilles) and the press. Upon his retirement, Ryyder received the Royal Chalcedony Shield from his political ally, the new senator of Alderaan, Bail Prestor Organa; he was one of few non-Alderaanians to receive the award, in recognition of his dedication to peace."}, {"tag": "p", "text": "He was present at Galaxies Opera House for the Squid Lake performance in 19 BBY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Horox Ryyder was a very tall Anx, even for a species reaching four meters in maturity. Ryyder had yellow-green skin and axis-shaped fingers, as well as a bearded head shaped like a crescent moon."}, {"tag": "p", "text": "Ryyder was famous in the Senate both for his ability to maintain composture when provoked and for his grasp when faced with complex political matters."}, {"tag": "p", "text": "Horox Ryyder liked dressing in shining crimson clothes and using circular neckbands."}, {"tag": "p", "text": "During his time on Coruscant, Ryyder visited the Coruscant Opera, like many other politicians of the time. Ryyder was known to have assisted to a representation of The Brief Reign of Future Wraiths, performed by a Bith company."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Horox Ryyder was portrayed by Jerome Blake."}, {"tag": "p", "text": "For Episode I, the costumes for Horox Ryyder and Graxol Kelvyyn were exactly the same. It was later changed so that the first character wore the collared-robe depicted above, and the second character wore a blue tunic.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}