{"url": "Ambush_at_Kestavel", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Kestavel", "Category:Battles of the early Imperial campaigns", "Category:Battles of the Great Jedi Purge", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Ambush at Kestavel"}, {"tag": "p", "text": "The Ambush at Kestavel was an event that took place several months after the creation of the Galactic Empire in 19 BBY, which nearly resulted in the assassination of the Empire's primary enforcer, Darth Vader."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The assassination attempt on Vader had been planned for at least several weeks beforehand, with Dass Jennir reluctantly carrying out the plot, having just settled for a comfortable life. However, the ambush nearly ended before it could begin due to distrust among Jennir's allies about keeping secrets from each other, as well as the machinations of Jedi Master-turned Sith agent, Beyghor Sahdett. Afterwards, the Uhumele's captain, Schurk-Heren revealed to Bomo Greenbark that he managed to pick up a large supply of explosives, an idea he had come up with since Greenbark saved the group on Mimban. In addition, they also planned on allowing the Imperials to cross over to the second bridge before ambushing them, due to the bridges being a chokepoint alongside the archway tunnel preceding the casino, as well as coming up with a strategy to cull the Imperial forces."}, {"tag": "h2", "text": "The ambush"}, {"tag": "p", "text": "Eventually, holed up inside Kestavel's local hotel, The Lucky Twi'lek, Greenbark, Kai Hudorra, and Jennir waited out for Vader's arrival, having earlier flooded the main entrance with enough engine fuel to cover the bridge when released. When Greenbark sighted Vader arriving via the second gate, Jennir told Greenbark to leave him, also ordering him to flee to the canyons until it is safe, then upon arriving at the Uhumele, tell Captain Heren not to spare the engines when leaving. Huddora then witnessed the arrival of Vader's forces, as well as their disarming the explosives under the second arch under Vader's command, privately remarking that he expected Vader to bypass that particular trap. Vader, likewise, sensed both Jennir and Huddora inside the hotel, and deduced that the former made an ally. Jennir then opened the impromptu floodgates and released the engine fuel. Vader then jumped up to the gate's wall as the engine fuel covered his stormtrooper troops. Immediately after they informed Vader of what the fluid was, also citing they should retreat until the fuel evaporated and forbidding anyone to fire their weapons, they saw a spark thrown out of a window to the flooded bridge."}, {"tag": "p", "text": "Elsewhere, on the surface of the Venator-class Star Destroyer Hound, Lieutenant Gregg got into an argument with the other Imperial officers on standby, as Vader had ordered them to not interfere on his behalf, with Gregg also pulling his blaster on one of the officers to ensure the order was followed, before he witnessed from afar a blaze at the location of The Lucky Twi'Lek. A communication popping up shortly thereafter stated that all communications were lost. This led Gregg to believe Vader to have been killed. In actuality, Vader narrowly evaded the fire, resulting in his cape being singed."}, {"tag": "p", "text": "Vader entered The Lucky Twi'lek, finding only Hudorra waiting for him. The two dueled until the Bothan Jedi Master attempted to activate a thermal detonator, which would trap them under the rubble if not kill them outright. Vader used the Force to stop Hudorra, stunning him momentarily and giving him the chance sever his hand. After attempting to interrogate Hudorra, who would reveal nothing about Jennir, Vader killed him. Vader then followed the Force signature of whom he thought was Jennir, only to discover Sahdett bound and gagged. After questioning his presence, he decapitated the Verpine in anger."}, {"tag": "p", "text": "Bomo then arrived at the Uhumele, and boarded inside with the two remaining crew to board, hastening the boarding before being spotted by mist creatures. The Uhumele managed to escape into space. Jennir also ended up unwittingly escaping, due to Hudorra drugging his drink earlier."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}