{"url": "Horton_Salm/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Gray Squadron personnel", "Category:Humans", "Category:Males", "Category:New Republic Starfighter Corps generals", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Horton Salm"}, {"tag": "p", "text": "Horton Salm was a Human male from the planet Norval II in the Calaron sector of the Outer Rim Territories who was a military officer of the Alliance to Restore the Republic and its successor, the New Republic. An accomplished pilot, leader, and training commander, he preferred to fly Koensayr Manufacturing BTL Y-wing starfighters over newer models, as he felt that the older craft were more reliable and would get him home in one piece. Salm led the Alliance's Gray Squadron at the Battle of Endor, surviving the run through the second Death Star's superstructure. Salm continued to command combat units, leading Aggressor Wing through the Battle of Brentaal IV nine months after Endor, an engagement that saw him promoted to the rank of general. Salm later led the Aggressors during the evacuation of Ciutric IV."}, {"tag": "p", "text": "By 6.5 ABY, Salm was assigned to the New Republic's Folor Base, training several new starfighter squadrons, including the reformed Rogue Squadron and his own Defender Wing. Despite clashes with Commander Wedge Antilles over Rogue Squadron's lack of discipline, and the presence of Tycho Celchu—a suspected sleeper agent of the Galactic Empire—as the unit's executive officer, Salm and his Defender Wing worked effectively with Rogue Squadron at the battle of Vladet and the First Battle of Borleias. Salm was also one of the officers responsible for devising the plan that would eventually cause the planet Borleias to fall to the New Republic."}, {"tag": "p", "text": "Following the liberation of the galactic capital, Coruscant, Salm served as a judge presiding over the trial of Tycho Celchu. Celchu had been charged with treason and the murder of Rogue Squadron pilot Corran Horn during the operation to capture Coruscant. Salm was surprised to learn that Horn was in fact not dead, but had been captured by Director Ysanne Isard, the ruler of the Empire, and interred aboard the Super Star Destroyer Lusankya. Briefly resuming training duties, Salm was based at the Borleias starfighter training base before returning to active combat with a B-wing assault group for the New Republic's campaign against the Ciutric Hegemony, a former Imperial faction, in 9 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "The Human male Horton Salm hailed from the planet Norval II, located in the Calaron sector of the Outer Rim Territories. At some point during the Galactic Civil War, he joined the Alliance to Restore the Republic as a starfighter pilot, preferring to fly Koensayr BTL Y-wing starfighters rather than newer craft, stating that they always got him home in one piece."}, {"tag": "p", "text": "Salm was the protégé of General Grisserno, who taught him how to effectively handle a Y-wing to achieve the mission objectives. While others held that the Alliance's most common starfighter was a poor dogfighter, Salm and Grisserno's proper handling of the starfighter proved that Y-wings did not need to dogfight, and instead could rely on their shielding, tail gunners, and wingmen to deal with enemy interceptors while they accelerated toward bigger targets."}, {"tag": "h3", "text": "Endor"}, {"tag": "p", "text": "Rising to the rank of colonel by 4 ABY, he was assigned to command Gray Squadron—a unit of BTL-S3 Y-wing starfighters—during the assault on the Galactic Empire's second Death Star over the forest moon of Endor. He was partnered with Kin Kian, a pilot from Rogue Squadron who had been assigned as his gunner. The Alliance's plan called for a strike force of starfighters led by General Lando Calrissian to fly into the superstructure of the half-completed battlestation to destroy the main reactor core, while the cruisers created a perimeter around the Death Star. Although the station was protected by a shield emanating from a deflector shield generator located on the forest moon, a strike team was assigned to infiltrate the garrison and destroy the facility. By the time the Alliance Fleet was due to arrive, the shield should have been down, allowing the naval forces to enact their plan. The Alliance's leaders hoped to catch the Empire by surprise, having learned that Emperor Palpatine himself was overseeing the final construction stages, and that the weapons systems—including the superlaser—were not operational."}, {"tag": "p", "text": "Operating under the call sign Gray Leader, Salm and his squadron of Y-wings were part of the fleet massed in the Sullust system. Salm was given specific orders to use his fighters' ion cannons to disable any Imperial craft between General Calrissian and the Death Star. Launching from their assigned capital ship, Salm and his pilots made the short hyperspace jump to the Endor system in their fighters, already deployed to engage and destroy the Death Star. Upon reversion to realspace, General Calrissian—designated as Gold Leader and flying the modified YT-1300 light freighter Millennium Falcon—requested all fighter wings to check in. Salm responded in the affirmative, leading his squadron toward the battlestation. On the approach, General Calrissian was informed by his co-pilot, the Sullustan Nien Nunb, that he could not get an accurate reading on whether the shield protecting the Death Star was up or down due to jamming interference. Calrissian suddenly realized that their arrival was expected by the Empire, and rationalized that the jamming meant that the strike team had failed and that the shield was still in place. He immediately ordered all fighters to break off the attack."}, {"tag": "p", "text": "Salm led Gray Squadron away from the Death Star just as the Imperial Fleet, led by the Star Dreadnought Executor, rounded Endor and appeared in Sector 47. Calrissian led several squadrons of fighters towards the main bulk of the Imperial Fleet, engaging their advance fighter force and drawing fire away from the Rebel cruisers. The entire operation had, in fact, been an elaborately planned trap devised by the Emperor to lure the Alliance into the open so that they could be annihilated. He had leaked intelligence on the operational readiness of the station to the Alliance and Bothan Spynet, and arranged for a large naval force to be waiting for the Alliance Fleet when they emerged from hyperspace. The superlaser was fully operational, and capable of targeting capital ships. In addition, a ring of Interdictors surrounded the system, ensuring that a retreat by the Alliance would be just as costly as a direct confrontation. Committed to battle, the Alliance Fleet moved into close range with the Imperial Fleet, hoping to protect themselves from the firepower of the Death Star and give the strike team on Endor more time to bring down the shields."}, {"tag": "p", "text": "Eventually, the strike team—led by General Han Solo—managed to destroy the shield generator. With the shield around the Death Star lowered, General Calrissian ordered all available fighters to follow him. Salm was the only member of Gray Squadron to respond, joining Red Leader Wedge Antilles, Tycho Celchu, Keir Santage, and Jake Farrell from Green Squadron among others. Skimming the surface of the battlestation, Salm dodged turbolaser fire, entering an access shaft to the Death Star's reactor core behind Celchu's A-wing, and ahead of Santage's X-wing. Several TIE interceptors followed them into the shaft, scoring direct hits on Santage's fighter and destroying it. General Calrissian ordered several of the fighters in the shaft to double back and head for the surface, hoping that they would draw several of the pursuing fighters with them. Salm followed orders, leaving Antilles and Calrissian to complete the attack run on the reactor core. Successfully exiting the Death Star, Salm survived the destruction of the battlestation and the subsequent four-hour fleet battle."}, {"tag": "p", "text": "Following the Battle of Endor, Salm and his Y-wings were part of the Second Fleet. Salm participated in the battle at Emmer, where elements of the Second Fleet under the command of Admirals Kalback and Nammo succeeded in driving the Imperial forces off-planet."}, {"tag": "h3", "text": "Brentaal IV"}, {"tag": "h4", "text": "Assault on the Brentaal IV moonbase"}, {"tag": "p", "text": "Around nine months after the Battle of Endor, Salm was commanding Aggressor Wing—a unit of BTL-S3 Y-wings—and was assigned to the operation to liberate the planet Brentaal IV from the Empire by Admiral Gial Ackbar, Supreme Commander of the New Republic's armed forces. Salm and his Aggressor Wing pilots participated in simulated training for the assault, but the mission was considered to be low-priority. However, a reconnaissance run by Rogue Squadron convinced Ackbar that the time to strike was at hand. In addition, Sate Pestage—nominal ruler of the Empire following the death of Emperor Palpatine—had publicly vowed to hold Brentaal against the Republic's advances; Ackbar wanted to strike and liberate the planet before Pestage had a chance to reinforce the garrison stationed there. Salm met with Rogue Squadron's Captain Antilles and Lieutenant Celchu at Base Delta-Nine, where Ackbar informed them that they would all be working together to free Brentaal IV from Admiral Lon Isoto, also known as \"Isoto the Indecisive.\" The two squadrons and their commanders would have two weeks to train on simulator runs for the assault."}, {"tag": "p", "text": "Staging from the New Republic base on Recopia, Salm led Aggressor Wing against the Brentaal IV moonbase, with Rogue Squadron flying cover. Admiral Ackbar commanded fleet elements led by the Mon Calamari Star Cruiser Independence during the assault on the moonbase. Isoto, displaying a lack of tactical awareness, kept his capital ships in close orbit of Brentaal IV, allowing the New Republic to assault the base without interference from them. However, Director Ysanne Isard of Imperial Intelligence had sent the 3rd Squadron of the 181st Imperial Fighter Group—the Empire's elite starfighter unit under the overall command of Colonel Baron Soontir Fel—to reinforce Brentaal IV. They engaged Salm's Y-wings during their attack runs on the moonbase, forcing Salm to call in extra help from Antilles and Rogue Squadron to keep the TIE interceptors off them. Despite the presence of an elite Imperial starfighter unit, the New Republic was able to take the moonbase, securing it for use as a staging area for the assault on Brentaal IV itself."}, {"tag": "h4", "text": "The Battle of Oradin"}, {"tag": "p", "text": "With the moonbase under New Republic control, Admiral Ackbar prepared to strike at Brentaal IV directly. Isoto had established his headquarters in Vuultin, and Ackbar's plan called for Rogue Squadron to stage a diversionary attack on the city while Salm and Aggressor Wing flew cover for Bantha-class assault shuttles landing at Oradin, which housed the extensive spaceport facilities needed to land large concentrations of troops. Additionally, Baron Fel—along with the other two squadrons of the 181st—had arrived on Brentaal IV, and the New Republic Intelligence Service had placed him at Vuultin. It was hoped that Rogue Squadron's attack there would allow them to engage the 181st, while the Y-wings and assault ships hit Oradin without interference."}, {"tag": "p", "text": "As Rogue Squadron struck Vuultin, Salm led Aggressor Wing on attack runs against Oradin's defenses, clearing the way for assault shuttles to land and disembark ground troops. However, Fel had anticipated this move by the New Republic, and had stationed his fighters at Oradin to defend the spaceport. Isoto, however, believed that the New Republic would attack Vuultin directly, striking at him. He ordered Fel to leave him a flight or two of interceptors in case he was proven right. With jamming coming from Oradin, Fel led the assault on Aggressor Wing's fighters, destroying several craft in the opening moments of the engagement. However, Rogue Squadron's assault on Vuultin panicked Isoto, and he ordered Fel to withdraw from Oradin to protect him. Unmolested, Aggressor Wing and the assault shuttles successfully took the city of Oradin. In the aftermath, Salm and his wing were based in the city. Salm had lost several fighters, and was worried about the silence concerning rescue operations for his downed pilots. Along with Antilles and Celchu of Rogue Squadron, he toured a triage center where most of the wounded of the battle were being treated, including some of his own pilots such as Lieutenant Telsij Cayr."}, {"tag": "h4", "text": "The evacuation of Brentaal IV"}, {"tag": "p", "text": "With Oradin lost to the New Republic, Director Isard authorized the evacuation of Brentaal IV, sending 205 ships to Vuultin to save the wealthy and the elite. Fearing that the escaping Imperials would take a large amount of the planet's wealth and culture with them—as Moff Leonia Tavira had done on Eiattu 6—the New Republic Provisional Council authorized a strike to stop the evacuation. They also hoped that the citizens would buy their own freedom with allegiance to the New Republic, which would prove to be useful in toppling the Imperial government. Salm briefed his pilots on the plan: Aggressor Wing would use their ion cannons to disable the evacuating civilian transports while Rogue Squadron engaged the TIE interceptors."}, {"tag": "p", "text": "Deploying to Vuultin, Salm led the Aggressors against the city's spaceport, disabling transports awaiting launch clearance with the intention of chasing any craft already running from the planet after that. As the assault continued, Admiral Isoto ordered the immediate evacuation of the planet. As the evacuation transports were cleared to launch into orbit, Salm led his wing into space to chase down the escaping vessels. Despite attacks from Fel's 181st, Aggressor Wing stayed on-mission under Salm's leadership. Reasoning that the Y-wings would break if their leader was killed, Fel targeted Salm's fighter. Making an attack run on the Y-wing, Fel blew Salm's left engine off, although the Baron was hit by fire from Antilles' X-wing at the same time. Despite having a crippled fighter, Salm ordered Antilles to continue targeting the interceptors, insisting that they would be able to keep attackers off themselves. Antilles complied, dueling with Fel. However, Fel got the upper hand on Antilles and closed in for the kill shot. Antilles broke at the last moment, allowing Salm—who had managed to make a quarter-turn in his crippled Y-wing—to hit Fel's interceptor with his bomber's ion cannons. The burst hit the interceptor squarely, immobilizing the fighter. The New Republic won the battle, and Salm was recovered from space along with Baron Fel's fighter. Aboard the Mon Calamari cruiser Home One—flagship of the New Republic Fleet—Salm received word from Ackbar that he was being promoted to the rank of general based on his performance during the Brentaal operation. He later presided over the funerals of those who died during the operation from the hangar deck of a Mon Calamari star cruiser."}, {"tag": "h3", "text": "Ciutric IV"}, {"tag": "h4", "text": "Initial raid"}, {"tag": "p", "text": "Following the Brentaal IV operation, Salm and his wing were stationed on a planet that also housed the headquarters of the Provisional Council. The general and his pilots were called to a briefing along with Rogue Squadron and Commando Team One, one of the New Republic's elite special forces units led by Kapp Dendo. There, they learned that Sate Pestage had been branded as a traitor to the Empire by Director Isard, and that he had fled Coruscant for Ciutric IV. Pestage had attempted to cut a deal with the New Republic to ensure his own freedom—in a meeting with Princess Leia Organa on Axxila, Pestage attempted to negotiate an arrangement that would leave Coruscant undefended in exchange for his freedom, a number of planetary holdings for himself and several trusted aides, and membership in the New Republic. However, upon arrival on Ciutric IV, Pestage was arrested by Governor Brothic and incarcerated. Knowing that an Imperial mission would be dispatched to take Pestage back to Coruscant, the Provisional Government authorized a mission to rescue Pestage from Ciutric IV, both for the enormous amount of intelligence that he had to offer, and because it was meeting with their representative that got him in trouble in the first place."}, {"tag": "p", "text": "Using information gathered from New Republic Intelligence, Salm—along with Antilles and Celchu of Rogue Squadron, Kapp Dendo, and Intelligence Agent Winter—planned the mission to extract Pestage from the prison on Ciutric IV. Despite having to work with limited intelligence on Imperial forces and possible reinforcements, and a short planning time frame, Salm and the others devised a plan that would see Rogue Squadron and Aggressor Wing flying cover for Commando Team One while they rescued Pestage. The task force—consisting of Aggressor's Y-wings, the Rogues' X-wings, and two Bantha-class assault shuttles—jumped to the edge of the Ciutric system. Taking sensor readings to ensure that there was no Imperial force in orbit attempting their own extraction, the task force executed a micro-jump to the planet. Aggressor Wing and Rogue Squadron engaged the local garrison's TIE/LN starfighters while the assault transports headed to the surface. Salm and the Aggressors remained in orbit while the extraction was underway, although Rogue Squadron was required to provide air cover for the commandos."}, {"tag": "p", "text": "During the extraction, Salm's sensors indicated that something big was about to drop out of hyperspace in orbit of the planet, and he urged the Rogues and commandos to hurry. As the X-wings and assault transports were coming up the gravity well, two Imperial ships—the Imperial II-class Star Destroyer Reckoning, under the command of Admiral Delak Krennel, and the interdictor Binder—emerged from hyperspace. The Aggressors managed to clear the area before the Binder could trap them, but the Rogues and assault transports were not so lucky. Salm began to order the Aggressors to scatter and head back to the planet to assist their comrades, but Antilles reminded Salm that they had agreed in the briefing that if the operation went sour, then whoever was able to would return to base and organize reinforcements and a rescue. Salm took Antilles' advice, and led the Aggressors away from Ciutric IV while the Rogues and commandos went to ground on the planet."}, {"tag": "h4", "text": "Rescue of the Rogues"}, {"tag": "p", "text": "While Salm disengaged from the combat zone, he did not return to base. He kept Aggressor Wing at the edge of the system where they would be able to come to the aid of the stranded forces, reporting the situation to the Provisional Council. While waiting, Salm encountered the Baudo-class star yacht Pulsar Skate, which dropped out of hyperspace on the edge of the system. The Pulsar Skate's captain, Mirax Terrik, had been contacted by Antilles from Ciutric IV to come to their aid. Hooking up with Salm and his wing, Terrik micro-jumped the Pulsar Skate into orbit around Ciutric IV, right into the middle of a battle between the Rogues and fighters from the Reckoning. While the Pulsar Skate drew several Imperial fighters after it, Salm and Aggressor Wing performed a micro-jump, emerging from hyperspace behind the combat zone. Having used the Skate as bait, the Y-wings were able to destroy several enemy fighters, and link up with the Rogues. Antilles was surprised to find that Salm had returned, but was grateful for the general's timely intervention. Salm and the Aggressors followed the Rogues down to the surface of the planet to refuel, regroup, and plan their escape."}, {"tag": "p", "text": "On the surface, Salm joined Antilles, Celchu, Winter, Dendo, Terrik, and Soontir Fel—who had defected to the New Republic following his capture at Brentaal IV—in a planning session to devise their escape. The plan involved using the Pulsar Skate as a decoy in an attempt to make Krennel believe that Pestage was escaping on the ship. At the same time, Rogue Squadron and Aggressor Wing would hit both the Reckoning and the Binder with multiple proton torpedo strikes, forcing them to withdraw, which would then give the two assault transports a clear path out of the system. Salm led Aggressor Wing against the Reckoning, dropping linked torpedo fire onto the Star Destroyer and collapsing its shields. The Y-wings then did the same to the Binder, forcing both ships to retreat and giving Kapp Dendo and his commandos free reign to leave the planet. However, despite successfully extracting themselves from Ciutric IV, the intended mission was a failure. Although they had managed to secure Pestage, the former Imperial ruler had left their custody and attempted to negotiate a deal with Admiral Krennel that would have seen the Imperial officer as the military commander of Pestage's own mini-empire. Krennel, however, was tired of serving. He killed Pestage and took his holdings for his own."}, {"tag": "p", "text": "After returning to the New Republic, Salm attended the funeral ceremony of the Rogue Squadron pilot Ibtisam, who had been killed in a skirmish with Krennel's TIEs while the squadron had been in hiding on Ciutric IV."}, {"tag": "h3", "text": "Training commander"}, {"tag": "h4", "text": "Command of Folor Base"}, {"tag": "p", "text": "Two years later, in 6.5 ABY, Salm was stationed at Folor Base overseeing the training of Defender Wing, a BTL-A4 Y-wing starfighter unit consisting of Champion, Guardian, and Warden Squadrons. He was also directly responsible for overseeing the pilot selection for the reformation of Rogue Squadron. Despite having worked with Antilles in the past—who had been promoted to the rank of Commander—the two had an uneasy working relationship at Folor Base. Antilles was concerned that many of the pilots selected for the squadron were political appointees, and was disappointed that neither Rogue Squadron veterans Derek Klivian nor Wes Janson would be part of the new unit. However, his main point of contention with Salm was the appointment of two individuals; Antilles wanted Gavin Darklighter, cousin of Rogue Squadron hero Biggs Darklighter in the squadron. Salm disagreed with Antilles, stating that—at sixteen standard years old—Darklighter was too young for the elite unit. Antilles countered with the fact that, despite his age, Darklighter would find his way into a cockpit somewhere in the military regardless. Eventually, Salm agreed to consider Darklighter for a position in the squadron if he scored well on the Redemption scenario. The scenario was a training exercise that replicated an engagement fought prior to the Battle of Yavin, in which a flight of starfighters attempted to defend the frigate Redemption from an Imperial assault during a transfer of wounded personnel."}, {"tag": "p", "text": "However, the main issue of contention between the two commanders was Tycho Celchu. Celchu had volunteered for a reconnaissance run to Coruscant in a captured TIE starfighter, but had been caught by the Empire and imprisoned in the infamous Lusankya facility. Lusankya had the reputation of turning out sleeper agents that remained dormant until triggered. Celchu had subsequently been transferred to a facility on Akrit'tar, and had managed to escape back to the New Republic. Despite being debriefed thoroughly by New Republic Intelligence—and having memories of actually being in the prison, unlike other sleeper agents who only revealed their motivations after they had enacted their programming—Celchu was not trusted by the command staff. Salm was one of the officers who distrusted Celchu, although it was not on a personal level. He feared the amount of damage a man with Celchu's familiarity with the New Republic, and his association to Rogue Squadron, could cause. Celchu was stripped of his flight status, and Salm was of the opinion that he should never fly a starfighter for the New Republic again. Despite Celchu's status, Antilles wanted him as an instructor for the new pilots in Rogue Squadron, and to serve as the unit's executive officer. Salm flatly denied his request, stating that he would never let Celchu near an active combat squadron. He was furious when he learned that Antilles had already used him as a pilot in Corran Horn's—one of the new Rogue Squadron recruits—Redemption scenario run. Antilles vouched for Celchu, believing his longtime friend to be innocent, and stating that the Alderaanian had agreed to a staggering degree of restrictions if he was allowed to take up the post of executive officer. Against Salm's wishes, Admiral Ackbar signed orders transferring Celchu to Rogue Squadron as executive officer."}, {"tag": "p", "text": "While training his new wing, Salm agreed to allow Rogue Squadron to conduct a surprise attack on his formation while they were conducting bombing practice. Rogue Squadron engaged Defender Wing, shooting down all but six Y-wings. Salm himself was one of the survivors. Following the incident, Salm was angry that members of Rogue Squadron had taken it upon themselves to download modified computer code into the Target-Aggressor Attack Resolution Software of Defender Wing's fighters, which displayed the Rogues' squadron crest when the craft were \"shot down.\" He was concerned about security breaches—specifically that vital software had been tampered with by a unit that had Captain Celchu as an executive officer. He was also concerned that the Rogues' lack of discipline was proving detrimental to the morale of the rest of the personnel training at the base, fearing that they thought that the Rogues were able to get away with whatever they wanted, as they were an elite unit. In a meeting between himself, Antilles, and Admiral Ackbar, the Mon Calamari officer told Antilles that Rogue Squadron were being made operational inside the week. At that point, Salm revealed that Defender Wing was being taken operational in two weeks."}, {"tag": "h4", "text": "Striking Vladet"}, {"tag": "p", "text": "Several weeks after the meeting with Ackbar and Antilles, Salm was summoned to another meeting with the pair on Home One. Salm had forgiven Antilles and the Rogues for their training mission incident, after the unit's quartermaster droid M-3PO had delivered a gross of new flight suits to Defender Wing as an apology. Rogue Squadron had been based on the planet Talasea, but their position had been discovered by Imperial forces. A strike by Imperial ground forces had ended up with injuries to Rogue Squadron personnel, and several deaths—including Rogue pilot Lujayne Forge and several security officers. Determining through forensic evidence that the Imperial force had come from Vladet, the capital of the Rachuk sector, a retaliatory strike was organized. Defender Wing and Rogue Squadron would strike at the Imperial base on the planet, supported by the CR90 corvette Eridain. Before the mission was enacted, Salm attended the funerals of Forge and the security personnel who had died on Talasea aboard the Nebulon-B medical frigate Reprieve."}, {"tag": "p", "text": "The strike on Vladet was organized so that each one of Salm's Y-wing squadrons would have one flight from Rogue Squadron acting as escort. Champion—with Salm commanding from the lead fighter—and Guardian Squadrons were the main assault, covered by Rogue Flights One and Two. Warden Squadron, covered by Three Flight—temporarily understrength due to the death of Forge and injuries to Andoorni Hui—was held back in reserve. The Imperial base at Vladet, Grand Isle, had been built inside the remains of a long-dormant volcano. When the New Republic force arrived, Admiral Devlia— commander of the installation—raised the base shields. Working to a pre-planned attack strategy, the assault force proceeded to the north wall of the volcano's crater. Erosion had weakened the rock's structure on that part of the wall, and Salm led his fighters in an attack run on the rock face, using proton torpedoes to blast a hole through it and into the crater beyond. Rogue Squadron's One Flight entered the crater first, engaging and eliminating TIE starfighters before Antilles reported that the area was clear. Salm led Champion and Guardian Squadrons in on attack runs on the base, diving to pick up speed before leveling out and releasing their payloads."}, {"tag": "p", "text": "While Salm led the Y-wings on their attack runs, the Eridain, acting as a command and control platform, registered the arrival of two Imperial ships—the Carrack-class light cruiser Expeditious, and the Lancer-class frigate Ravager. Knowing the danger that the Ravager possessed to the starfighter force, Salm ordered Antilles to screen Guardian and Warden Squadrons away from the combat zone, while Champion Squadron engaged the Imperial ships to buy them time. Antilles refused the order, rationalizing that Rogue Squadron had the better chance of engaging the ship and surviving the encounter than Champion Squadron did. Before Antilles could order the Rogues to engage, Rogue Nine—Corran Horn—came up with a plan to kill the Ravager. Horn proposed making a run on the Lancer-class frigate, and having the Y-wings of Warden Squadron lock their proton torpedoes onto his own X-wing's homing beacon. The torpedoes would follow his fighter, then Horn would place the Imperial ship between them and himself, allowing the projectiles to detonate against the ship. Horn requested that Salm release Warden Squadron to him, but Salm refused. Horn, however, began his outbound flight despite the general's warnings that what he was doing was treason. Antilles attempted to calm Salm down, requesting that the general form Champion Squadron up on him for a similar attack run should Horn fail. Horn's plan was a success, and the Ravager was destroyed by the combined torpedo fire of Warden Squadron. However, Salm intended to bring Horn up on charges of insubordination, disobeying a direct order, and pirating a squadron of bombers."}, {"tag": "h3", "text": "The push to Coruscant"}, {"tag": "h4", "text": "The First Battle of Borleias"}, {"tag": "p", "text": "Following the Vladet mission, Salm attended a briefing on Home One, where the Bothan General Laryn Kre'fey laid out a plan to capture the Imperial planet Borleias—codenamed Blackmoon for the operation—in the Pyria system. For operational security, the true name and location of the planet was kept from the pilots participating in the mission. The world was then to be used as a stepping stone to reach and liberate the galactic capital of Coruscant. Salm—who had an antagonistic working relationship with Kre'fey—was concerned over the lack of smaller details in the operation, such as limited information on TIE models available to the Imperial garrison, and worried that the two-week timeframe for training was too short. Kre'fey dismissed his concerns, but Salm remained unconvinced. Following the briefing, Ackbar informed him and Commander Antilles that the task force would stage from Noquivzor, and they would be transferring to a base on the world in preparation for the assault. When Ackbar broached the subject of Salm's intentions towards Horn's insubordination at Vladet, the general informed the admiral and Antilles that he was dropping the charges. Although he felt Rogue Squadron was out of line, he realized that pushing for a court-martial would force Horn to sit out the coming operation, and adversely affect the morale of the elite unit. That, he reasoned, would be detrimental to the operation, and he already had a bad feeling regarding its outcome."}, {"tag": "p", "text": "Two weeks later, Salm's Defender Wing were based off the Mon Valle, a modified bulk cruiser, for the Blackmoon operation. Along with another bulk cruiser, the Corulag, the corvette Eridain, and the Imperial II-class Star Destroyer Emancipator, the task force emerged from hyperspace in the Pyria system. Taking up position to guard their exit vector, the Emancipator began firing on the Imperial base on the surface with turbolaser and ion cannon fire while Defender Wing, with Rogue Squadron flying cover, waited for their orders to begin their attack runs. As the base's shield collapsed, General Kre'fey decided that the Y-wing assault runs were unnecessary, and ordered Defender Wing home while Rogue Squadron escorted the assault transports in. Salm complied with the order, but felt that Kre'fey was attempting to rob him of any credit for the operation. In a deliberate act of defiance, Salm's outbound vector took him close enough to the Emancipator that he could claim the ship's mass prevented his wing from jumping to hyperspace."}, {"tag": "p", "text": "As the Rogues escorted the transports in, the base defenses reactivated—the failure of the shields had been a ruse by the base commander, General Evir Derricote, to bring the New Republic forces in close so that he could destroy them. With the shields back up and strengthened by power generated from a refurbished Alderaan Biotics facility on the planet, ion cannon fire started to stab into the heart of the Republic formation while TIE fighters and interceptors launched to engage. In a frenzied engagement, several Rogues were killed or injured, and the Modaran—the lead transport carrying General Kre'fey—was destroyed. Salm and his fighters—screened from ground sensors by the Emancipator—returned to the engagement zone, using their superior firepower to destroy half a dozen interceptors. The intervention gave the New Republic forces time to recover ejected pilots and begin a withdrawal. However, a series of ion cannon blasts hit the Mon Valle dead on, disabling the ship and sending it plummeting to the planet below. Salm and Defender Wing finally entered hyperspace with the rest of the task force."}, {"tag": "h4", "text": "Feint at Jagga-Two and the Second Battle of Borleias"}, {"tag": "p", "text": "Back on Noquivzor, Salm met with Antilles to discuss what the Rogue Squadron commander was going to put in his report about Salm defying direct orders. While Antilles was grateful to the general for returning and saving his unit, Salm told him that he had to report the whole truth about his actions. He also revealed to Antilles that, in hindsight, it was a good thing that they hadn't taken Borleias. The Imperial II-class Star Destroyer Eviscerator was only four hours away from the planet, stationed in the Venjagga system, and could have responded to their assault. Antilles was amazed that the operation had been green-lit with the knowledge that an Imperial Star Destroyer was so close by. During their meeting, they were interrupted by Lieutenants Horn of Rogue Squadron and Judder Page of the Katarn Commandos. Through analysis of data collected by Horn's astromech droid, Whistler, they had determined the location of Blackmoon, and Page was sure that his commandos could use a meteor shower to cover their infiltration into the base to capture it and disable the ion cannons. They also discovered that the base's power generators were supplemented from the abandoned biotics facility, and that the installation also housed two squadrons of TIE interceptors that the original intelligence reports had failed to spot. Armed with this new knowledge, Salm and Antilles devised a plan to take the planet, and took it to Ackbar. Salm's plan called for the Emancipator and the Liberator to stage a feint at the Eviscerator's home port while Rogue Squadron and the commandos hit Borleias."}, {"tag": "p", "text": "The two Star Destroyers dropped out of hyperspace in the Venjagga system and deployed Salm's Defender Wing and a wing of other fighters. The Eviscerator deployed its own wing of fighters and moved to engage the New Republic force. However, as the mission was a feint to draw attention away from Borleias, the fighters were not moving at full speed, and the entire force gave the impression of being reluctant to engage in a fight. When the Eviscerator had reached a point where the system's planetary bodies restricted the vessel's hyperspace entry vectors, the New Republic fighters—which were deployed and positioned in a region of the system unencumbered by such gravity wells—entered hyperspace, heading for Borleias. However, the Star Destroyers headed for Ord Mirit in the Mirit system to further draw the Eviscerator away from Borleias. Bothan slicers had planted information on the HoloNet that Ord Mirit held the key to finding the location of the legendary Katana fleet, an armada of two hundred Dreadnaught-class heavy cruisers that had been lost when the crews succumbed to a hive virus, slaved the ship's controls together, and jumped to an unknown location. After recovering its fighters, the Imperial Star Destroyer headed to Ord Mirit. Meanwhile, Salm led Defender Wing against Borleias, capitalizing on the strike that members of Rogue Squadron enacted to cut the power conduit linking the main Imperial base to the biotics facility. Borleias fell to the New Republic, and Salm and Defender Wing were stationed at the planet to assist in protecting their new asset. Salm later attended a series of meetings and briefings on Noquivzor to plan the liberation of Coruscant."}, {"tag": "h3", "text": "The Trial of Tycho Celchu"}, {"tag": "p", "text": "Following the successful liberation of the capital, Salm and Defender Wing were part of the New Republic forces stationed on the planet. Salm was selected—along with Ackbar and General Crix Madine—to preside over the trial of Tycho Celchu. Celchu was charged with murder and treason, following acts that he was supposed to have committed while assisting Rogue Squadron during their infiltration mission to Coruscant to bring down the planet's shields. These acts included conspiring with a known Imperial Intelligence agent—one Kirtan Loor—and the murder of Corran Horn by causing the Z-95 Headhunter he was flying to crash by overriding the flight controls using the command codes. Antilles questioned Rogue pilot Nawara Ven, who was acting as Celchu's legal counsel, if Salm could be removed from the tribunal due to his well-documented suspicion of Celchu. Ven pointed out that if Salm didn't excuse himself, then he did not believe there to be any conflict of interest on his part, and any attempt to remove him may actually work against the case, causing him to become even more biased against Celchu than they already believed."}, {"tag": "p", "text": "However, despite the New Republic's victory in capturing the capital, they were left with a problem. Prior to their liberation of Coruscant, Director Isard—now ruler of the Empire—had released a virulent man-made disease known as the Krytos virus into the planet's water system. It was designed to target most non-Human species; Isard had hoped to both give the New Republic a devastated world, and to tie them up with relief operations. In addition, a large amount of bacta was known to cure the disease outright; with the New Republic's need for bacta at an all-time high, the price for the cure-all fluid rocketed. Even with the bacta cartels on the planet Thyferra producing as much as they could, the New Republic still needed more. When a bacta convoy was hijacked by the Imperial warlord Admiral Zsinj, and taken to an Empress-class space station in the Yag'Dhul system, General Salm's Defender Wing was part of the operation to liberate the bacta and take it to Coruscant. By this point, Guardian Squadron had been outfitted with B-wing starfighters, adding more firepower to the wing."}, {"tag": "p", "text": "Salm presided over weeks of testimony during Celchu's trial, until the day that Corran Horn unexpectedly returned from the presumed dead with evidence that Celchu was innocent of all charges, and that the traitor was actually Erisi Dlarit, a Thyferran serving with Rogue Squadron. Horn had actually been captured by Isard and interred at Lusankya—which was, in reality, an Executor-class Star Dreadnaught buried beneath Coruscant's cityscape. During this revelation, the Lusankya broke free of the planet, laying waste to huge swaths of the city as it escaped into orbit. Salm was surprised by this turn of events, and angry when he learned that General Airen Cracken, head of New Republic Intelligence, had known that Celchu was innocent all along. He was indignant that his fellow officer had allowed him to berate, suspect, and treat Celchu with disdain, all the while knowing the truth. Cracken replied that while he knew that Celchu was not the traitor within Rogue Squadron, he could not be sure that he wasn't an Imperial agent of some sort. The trial concluded with all charges against Celchu dropped, and a story released to the media that the entire affair was part of an elaborate plan to draw out the real traitor and that Celchu had been in on the deception from the beginning. This appeased the population of the New Republic, and cleared Celchu's name."}, {"tag": "p", "text": "Salm once more took up the post of a training commander, this time stationed at the training base established on Borleias. One squadron of Y-wing bombers that he was responsible for training, Green Squadron, would participate in the Battle of Ession alongside Rogue and Wraith Squadrons."}, {"tag": "h3", "text": "Back in the field"}, {"tag": "p", "text": "By 9 ABY, Salm was back on active combat duty, commanding a B-wing assault group off the Imperial II-class Star Destroyer Moonshadow. Following the Battle of Bilbringi and the death of Grand Admiral Thrawn, the New Republic decided that they needed to strike out against one of the many Imperial warlords to prove that they had not been dealt a fatal blow by the Imperial commander's campaign against them. They chose to topple Prince-Admiral Delak Krennel, who had set himself up as ruler of the Ciutric Hegemony following the death of Sate Pestage several years earlier. Using the murder of Pestage and his family as the reason for their campaign, Admiral Ackbar chaired a briefing of the situation which included Salm, the newly-promoted General Antilles, Admirals Kir Vantai and Areta Bell, and Commander Sair Yonka. Ackbar outlined the plan to take the planet Liinade III away from Hegemony, which Salm commented would prove to Krennel's subjects that his realm was not as well-defended as he claimed. In addition, the fall of the planet to the New Republic would also affect the neighboring planets of Vrosynri 8 and Corvis Minor."}, {"tag": "p", "text": "With the operation authorized, Salm and his assault group were deployed from the Moonshadow upon reversion from hyperspace near Liinade III, alongside Rogue Squadron, who were staging from the Victory II-class Star Destroyer Swift Liberty. Forming up, Salm led the B-wings towards the Direption, an Imperial II-class Star Destroyer in service to the Ciutric Hegemony. The Hegemony ship disgorged a wing of seventy-two TIE fighters and interceptors, matching Salm's number of craft. The B-wings engaged the Hegemony fighters, with Rogue Squadron providing top cover. Meanwhile, the larger vessels engaged in fierce ship-to-ship combat, which resulted in victory for the New Republic force."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Horton Salm was a dedicated military officer, known and respected both for his ability to command combat units, and as a training commander. A strict disciplinarian, Salm knew that many of the pilots he had under his command were not of the same caliber as the elite Rogues, and therefore had to be drilled harder to watch each other's backs, and function as a unit rather than individuals, to make up for the lack of innate talent. Although he was generally a by-the-book officer,—willing to charge individual pilots like Lieutenant Horn over actions that actually saved his own command since he himself had disobeyed a direct order—he was also savvy enough to realize that the needs of the mission sometimes outweighed the needs of protocol, and rescinded the charges so that Horn's presence on a future mission may have saved them. Salm generally followed mission orders to the letter, except on two occasions; both times saw his unit rescue Rogue Squadron. However, on the second occasion, Salm requested that Commander Antilles not hold back with the truth in his official report, and relay that he disobeyed direct orders from the theater commander, despite the fact that his actions had saved his own unit and the Rogues from destruction."}, {"tag": "p", "text": "Once Salm held a particular view, it was very hard to dissuade him from it. Once he learned of Tycho Celchu's experiences and time in Lusankya, he became distrustful of the officer despite having served with him on several occasions in the past. He held firm to his belief that Celchu could not be trusted at all, and pointed out that fact—and the possibility of him being a security liability—every time a breach of security of improbable coincidence occurred. However, Salm was genuinely concerned for the security of the units under his command, and that of the New Republic. Knowing exactly what Ysanne Isard was capable of, he knew how much damage an Imperial agent with the New Republic's elite unit could cause. However, Salm did not see his distrust of Celchu as a personal issue, and saw no reason to excuse himself as a judge at the officer's trial. Following the revelation that Celchu was innocent all along, and with evidence to prove that he was not even a sleeper agent, Salm was angry that General Cracken had kept the truth—that he had known all along that Celchu was not the traitor within Rogue Squadron—from him, causing him to treat the Rogue Squadron executive officer in the manner he had."}, {"tag": "p", "text": "A well built man, Salm had black hair, light skin, and brown eyes. Around nine months after the Battle of Endor, he was balding and sported a mustache which he did not have when he participated in the Battle of Endor. Salm was known to favor Abrax cognac, which his aide managed to procure for him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Horton Salm was created by Michael A. Stackpole for his 1996 novel, X-Wing: Rogue Squadron, as the officer in charge of overseeing the reformation of Rogue Squadron. Salm appeared in several of the other X-Wing novels by Stackpole as a supporting character. In 1997, Salm received his first visual appearance in the comic X-Wing Rogue Squadron 21. Salm went on to appear in the rest of the arc, as well as being a supporting character in the series' final arc, Mandatory Retirement. In 2000, Decipher, Inc. released their Death Star II Limited expansion for the Star Wars Customizable Card Game. In the set, they identified the previous unnamed Gray Leader from Star Wars: Episode VI Return of the Jedi as Salm, retconning the character into the film, the novelization, and the radio drama. A shot of the actor who played Gray Leader was also used to represent Red Two."}, {"tag": "p", "text": "According to all the editions of A Guide to the Star Wars Universe, Star Wars: Behind the Magic, and the Star Wars Encyclopedia, Gray Leader was killed early during the Battle of Endor. Curiously, even though the third edition of the A Guide to the Star Wars Universe was published after the Salm–Gray Leader connection was made, the book still listed them as if they were two separate individuals. However, The Complete Star Wars Encyclopedia, published in 2008, does not repeat the information regarding Gray Leader's death, merely stating that Gray Leader was Salm's callsign during the battle."}, {"tag": "p", "text": "In The Essential Guide to Warfare, Jason Fry established that Salm was a protégé of Grisserno, a Y-wing commander first established in The Star Wars Sourcebook. Fry noted that it felt like a natural pairing of the Rebellion's two foremost proponents of the Y-wing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}