{"url": "Hosk_Trey%27lis", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Bothans", "Category:Force ghosts", "Category:Jedi healers", "Category:Jedi Knights of the New Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Hosk Trey'lis"}, {"tag": "p", "text": "Hosk Trey'lis, a male Bothan Jedi Knight and healer, was one of the Jedi who worked on the Ossus Project—the project to have the Yuuzhan Vong terraform the worlds that had been ravaged by their invasion of the galaxy. After the project was sabotaged in 127 ABY by the One Sith, who had allied themselves with the Fel Empire, a war broke out between the Empire and the Alliance. Trey'lis managed to avoid the massacre of the Jedi Order on Ossus at the end of the Sith-Imperial War, and spent the next seven years on the run. In 137 ABY, Trey'lis was waiting in Brogar's cantina on the planet Lok for transport offworld when bounty hunter and former Jedi Cade Skywalker, along with fellow hunters Jariah Syn and Deliah Blue, burst into the cantina, seeking to capture the gambler Naxy Screeger. Trey'lis believed the bounty hunters were after him, and attempted to flee. Recognizing the Bothan was a Jedi, the hunters captured Trey'lis, and he was turned over to the Sith for the bounty cast upon living Jedi."}, {"tag": "p", "text": "In the Temple of the Sith on the galactic capital of Coruscant, Trey'lis was tortured and interrogated by Darth Maladi, the head of Sith Intelligence and Assassination. Unable to resist her ruthless interrogation and torture techniques, Trey'lis eventually told her everything he knew about young Skywalker, whom Emperor Darth Krayt, the reigning Dark Lord of the Sith, sought for his healing ability. After having a vision of the Bothan, Skywalker traveled to Coruscant to rescue Trey'lis, only to get captured himself. A week later, after pretending to join Krayt and receiving training as a Sith, Skywalker attempted another rescue, but was once again thwarted. Both Trey'lis and Skywalker were taken to Krayt's chambers, where the Dark Lord attempted to convince Skywalker to kill the Bothan as a show of devotion to the Sith. Not wanting to be used as a weapon, Trey'lis pleaded with Skywalker not to turn to the dark side. Krayt then struck the Bothan down, and Trey'lis's body disappeared as he became one with the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A male Bothan, Hosk Trey'lis was a Jedi Knight and healer who worked with fellow Jedi Master Kol Skywalker on the Galactic Alliance-backed Ossus Project—the project to have the Yuuzhan Vong terraform the worlds that had been ravaged by their invasion of the galaxy. In 127 ABY, the project was sabotaged by the newly risen One Sith Order, who had allied themselves with the Fel Empire, sparking a war between the Empire and the Alliance. At the end of the Sith-Imperial War, Trey'lis managed to avoid the massacre of the Jedi Order on the planet Ossus, but many other Jedi were killed. Going into hiding during the deposed Emperor-in-exile Roan Fel's insurgency against the Sith-controlled Empire, Trey'lis spent the next seven years on the run, at some point losing his lightsaber in an explosion that he barely survived."}, {"tag": "h3", "text": "On the run"}, {"tag": "p", "text": "In 137 ABY, Trey'lis was in Brogar's cantina on the planet Lok, where he arranged to have transport offworld. While Trey'lis was waiting for his transport, bounty hunter and former Jedi Cade Skywalker, along with fellow hunters Jariah Syn and Deliah Blue, burst into the cantina seeking to capture the gambler Naxy Screeger, who was wanted for a debt he owed. Believing the bounty hunters were after him, Trey'lis used the Force to hurl a table at them. Realizing the chance to collect the greater bounty that was placed on Jedi, Syn went after Trey'lis while Skywalker pursued Screeger."}, {"tag": "p", "text": "To ensure that the Jedi would not escape, Syn prepared to shoot Trey'lis, but was stopped as Skywalker threw Screeger into Syn's back, causing him to lose his blaster. Blue took a different approach, and attempted to slow Trey'lis down by shooting him with a tranquilizer dart from her dart launcher; however, Trey'lis was not hindered by the attack, and unleashed a wave of Force energy, throwing Blue back. Trey'lis was finally brought down by an illegal thud bug thrown by Syn, which knocked the Bothan unconscious. On the way to the bounty hunters' ship Trey'lis pleaded with them to let him go, stating that although he did not fear death, what the Sith would do to him would be far worse. Skywalker and his companions were not swayed, however, as they headed to collect their bounty."}, {"tag": "p", "text": "Traveling to Socorro, the bounty hunters were attempting to take Trey'lis and Screeger to the Crimson Axe—an old starship that had been converted into a stationary base of operations for the pirate Rav—when Trey'lis managed to break free of the hunters' hold and run away from his captors. Skywalker pursued the Bothan, following him as he jumped off a ledge. As they fell together, Trey'lis recognized the power of the Force within Skywalker, and realized it was not a Sith trained power. After plunging into the water below, Trey'lis was dragged out of the water by Skywalker and brought before Rav, who had been watching the engagement from a holovid captured by his droids. Rewarding Skywalker, Blue, and Syn for their work, Rav ordered his crew to take Trey'lis and Screeger away. After receiving hallucinogenic death sticks from Rav, Skywalker was preparing to take the narcotic when he was visited by the spirit of his ancestor, the famed Jedi Grand Master Luke Skywalker. Pointing out that Cade had never turned a Jedi over to the authorities before, Luke attempted to dissuade his descendant from taking the death sticks, which deadened his connection to the Force. Cade refused to listen, and forced his ancestor to leave by threatening to take his own life."}, {"tag": "h3", "text": "Prisoner of the Sith"}, {"tag": "p", "text": "Turned over to the Sith for the bounty cast upon living Jedi, Trey'lis was held in the laboratory of Darth Maladi, the head of Sith Intelligence and Assassination. Searching for information on Skywalker, whom the reigning Dark Lord of the Sith, Emperor Darth Krayt, sought for his healing ability, Maladi interrogated and tortured the Bothan Jedi Knight. Trey'lis could not resist the ruthless interrogation and torture methods of Maladi, and eventually told her everything he knew about young Skywalker, such as his ability in the Force, and that his companions were Jariah Syn and Deliah Blue. With the information she gleaned from Trey'lis, Maladi ordered intelligence agent Nyna Calixte to personally take command of the search and to bring Skywalker back alive."}, {"tag": "p", "text": "When Skywalker traveled to Ossus and began to complete his Jedi training, he had a vision of Trey'lis during one of his meditations. During his vision, Cade was once again visited by his ancestor Luke Skywalker. Instead of trying to convince Cade of his duty to the Jedi, Luke told Cade that the Sith were torturing Trey'lis on Coruscant, and it was his responsibility to make it right. Despite not having completed his training, Cade left Ossus and headed to Coruscant to rescue Trey'lis. Meanwhile, in the Sith Temple on Coruscant, Trey'lis was forced to use his healing abilities on Krayt, who was struggling to control the Yuuzhan Vong implants—gained during the Yuuzhan Vong War—which threatened to take over his body. His abilities proved inadequate, however, and Krayt continued to seek Skywalker."}, {"tag": "p", "text": "Arriving on Coruscant and entering the Sith Temple in secret, Skywalker located the laboratory in which Trey'lis was being held. While being freed by Skywalker, Trey'lis sought Skywalker's forgiveness for giving in to the Sith interrogation and telling them everything he knew about the former Jedi. As the pair made their escape, Trey'lis tried to explain to Skywalker how he had betrayed him, however, Skywalker would not listen. Sensing impending danger, Skywalker Force-pushed Trey'lis out of the way just as they were attacked by one of Krayt's personal assassins, his Hand, Darth Talon. Engaging the Sith in a short duel, Skywalker was overpowered when Krayt's other Hand, Darth Nihl, joined the fight. Having succeeded in capturing the former Jedi, the two Hands took Skywalker to their Master, while Trey'lis was taken back to Maladi's laboratory."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "For a week after Skywalker's failed rescue attempt, Trey'lis was held in the laboratory, while Skywalker—having feigned allegiance to Krayt—was trained as a Sith. Meanwhile, in the underlevels of Coruscant, Skywalker's friends planned to rescue him from the Sith, aided by Skywalker's mother, Imperial Moff Nyna Calixte, who was acting under the guise of her alter ego, Morrigan Corde, in order to hide her true identity. After being held in the Yuuzhan Vong torture device known as the Embrace of Pain, Skywalker attempted another escape, and returned to Maladi's lab to rescue Trey'lis. Expecting such an attempt, however, Talon had been waiting in the lab, and the former Jedi was once again captured. Taken to Krayt's chambers, Skywalker was berated by the Dark Lord of the Sith, who ordered him to kill Trey'lis to show his devotion to the Sith. Knowing that Krayt wanted him alive, Skywalker refused, stating that Krayt's threats were meaningless. In response Krayt commanded that Trey'lis be killed, which angered Skywalker as he did not want the Bothan to die for him. Not wanting Krayt to use him as weapon, Trey'lis pleaded with Skywalker to resist Krayt's temptations of the dark side. Prepared to die, the Bothan told Krayt that he forgave Skywalker, and that he pitied the Dark Lord. Drawing his lightsaber, Krayt struck the Bothan down, and Trey'lis's body disappeared, becoming one with the Force."}, {"tag": "p", "text": "The voice of Trey'lis's spirit spoke to Skywalker, telling him the Force would be with him. Enraged at the murder of Trey'lis, Skywalker prepared to attack Krayt when he was visited by the spirit of his father, Jedi Master Kol Skywalker, who advised Cade to use the Force to break into the case that held his father's lightsaber—taken by the Sith after Kol's death on Ossus. Skywalker engaged Krayt and his two Hands in a short duel. Both Nihl and Talon were injured, and Skywalker escaped through a hole blasted in the wall by his mother, Nyna Calixte, who had arrived to rescue him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hosk Trey'lis was a male Bothan with brown fur and brown eyes. Unlike many Bothans, who held political scheming and spying in high regard, Trey'lis valued healing, patience, and communion with the Force. Peaceful by nature, Trey'lis preferred to practice the healing arts over the ways of the warrior. As a Jedi, the Bothan strove to be a force of good in the galaxy, even after the Jedi were decimated at the end of the Sith-Imperial War. Despite his inherent peaceful nature, Trey'lis was willing to fight for his survival when pursued by Skywalker and his fellow bounty hunters. Unwilling to surrender without a fight, Trey'lis even attempted a last minute escape while constrained in binders."}, {"tag": "p", "text": "Although the Bothan did not fear death, Trey'lis implored Skywalker and his friends to let him go rather than turn him over to the Sith, knowing what the Sith could do to him would be far worse. While being tortured by Darth Maladi, Trey'lis was initially able to resist the interrogation; however, Maladi's methods eventually proved too much for the Bothan, and his will broke, leading him to tell the Sith all he knew about Skywalker."}, {"tag": "p", "text": "Trey'lis did not hold grudges against those who wronged him, quickly forgiving Skywalker when he came to rescue the Bothan from the Sith Temple. Trey'lis also felt guilty for giving the Sith information on Skywalker during his interrogation, believing he had betrayed the former Jedi. When Krayt threatened the Bothan's life in an attempt to turn Skywalker to the dark side, Trey'lis pleaded with Skywalker not to let them use him as a weapon. Knowing his death was imminent, Trey'lis was not afraid; instead, he found a greater happiness and a deeper sense of peace than he had ever felt before. Trey'lis even forgave Krayt, pitying the Dark Lord and the man he once was. At peace, Trey'lis's body vanished as Krayt dealt the killing blow, and the Bothan became a Force spirit."}, {"tag": "p", "text": "Aside from his talents as a Jedi and healer, Trey'lis was also multilingual, able to speak Bocce, Bothese, and Yuuzhan Vong, in addition to Basic."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Jedi Knight, Hosk Trey'lis was skilled in the use of the Force, particularly in the arts of healing. Like most Jedi, Trey'lis was trained in the use of a lightsaber, and used it before losing it in an explosion. He was proficient in telekinetic applications of the Force, able to throw both objects and people with powerful waves of energy, as he showed during his attempted escape from Skywalker and his friends. Despite being restricted by binders, Trey'lis showed that he was skilled in unarmed combat, able to put up a fight against Skywalker, Blue, and Syn as they attempted to turn him over for the bounty on living Jedi."}, {"tag": "p", "text": "Although he was capable of combative uses of the Force, Trey'lis's true talent was as a healer rather than as a warrior. He was able to sense the emotions of individuals through the Force, and was able to sense that something was emotionally broken within Skywalker. Forced to use his healing abilities on Darth Krayt, Trey'lis's powers proved inadequate in combating the Yuuzhan Vong implants, which threatened to take over the Dark Lord's body. A peaceful healer to the end, Trey'lis's body disappeared upon his death, and he became a Force spirit."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hosk Trey'lis was first mentioned in the introductory supplement to the Star Wars: Legacy comic series, Star Wars: Legacy 0, released in June 2006, where his last name was spelled Tre'lyis. His name was later corrected to Trey'lis in the expanded version of the supplement, Star Wars: Legacy 0½. Trey'lis would go onto appear in the second issue of the series, Broken, Part 2, released in July 2006. The issue was written by John Ostrander and Jan Duursema, as well as being penciled by Duursema. Trey'lis's story would be further explored throughout the series until his death in the eighteenth issue, Claws of the Dragon, Part 5. Trey'lis's backstory was later expanded upon briefly in the Legacy Era Campaign Guide, a sourcebook for the Star Wars Roleplaying Game Saga Edition released in March 2009, and he also gained an entry in The Complete Star Wars Encyclopedia. In the 113th issue of Star Wars Insider, Trey'lis's death gained a place on the list 5 Evil Deeds! (Expanded Universe) that ranked the five most evil deeds in the Star Wars Expanded Universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}