{"url": "Hosnian_Cataclysm", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Artificial disasters", "Category:Battles of Hosnian Prime", "Category:Events of the Cold War", "Category:Events of the First Order–Resistance war", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Hosnian Cataclysm"}, {"tag": "p", "text": "The Hosnian Cataclysm, also known as the destruction of Hosnian Prime, the destruction of the Hosnian system, the Hosnian Calamity, or the Starkiller Incident, was the destruction of the Hosnian system at the hands of the First Order in 34 ABY—thirty years after the Battle of Endor. The event took place during the Cold War and marked the annihilation of Courtsilius, Raysho, Hosnian, Cardota, and Hosnian Prime, the capital of the New Republic. Its destruction was carried out from the Unknown Regions by Starkiller Base, a superweapon on Ilum capable of destroying entire star systems. With the destruction of Hosnian Prime came the destruction of the Galactic Senate and the home fleet of the New Republic Defense Fleet. The massive sub-hyperspace ripple created by the destruction of the system made the event visible in real time around the galaxy, including the planets of Takodana and Vardos. After the destruction of the Hosnian System, the conflict between the First Order and the Resistance escalated into full open warfare."}, {"tag": "p", "text": "In the aftermath of the event, General Leia Organa of the Resistance organized a counterattack to destroy the First Order superweapon. The Battle of Starkiller Base ensued, resulting in the base's destruction moments before the Starkiller was ready to fire on D'Qar, the location of the Resistance base. However, the extermination of the Galactic Senate and a large part of the Republic fleet, as well as the massive loss of life, left both the New Republic and the Resistance vulnerable while the armed forces of the First Order moved to take control of the galaxy."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "At the end of the Galactic Civil War, the Galactic Empire was defeated by the New Republic, the government formed by the Alliance to Restore the Republic after the death of the Emperor during the Battle of Endor. The Empire officially signed a treaty, the Galactic Concordance, with the Republic, keeping the remnants of the Imperial confined to their territories in the Core Worlds and the Inner Rim. What remained of the Imperial Starfleet, however, retreated into the Unknown Regions and ultimately formed the First Order, a successor force with the goal of destroying the New Republic and bringing order to the galaxy. As part of their plan, the First Order built a fleet in the shadows of the Unknown Regions and constructed a new superweapon called Starkiller Base, one capable of destroying entire star systems. The construction of the Starkiller weapon marked the culmination of efforts by the Old Empire to research dark energy translations and hyperspace tunneling, and it was a successor to the DS-1 Death Star Mobile Battle Station and the DS-2 Death Star II Mobile Battle Station superweapons that came before it."}, {"tag": "p", "text": "During the conflict that had only just begun to spark between the First Order and the Resistance, Supreme Leader Snoke, the leader of the First Order, considered Luke Skywalker an existential threat to the designs of the First Order. Snoke believed that if Skywalker, the last of the Jedi, returned from the exile he imposed on himself after the destruction of his new generation of Jedi and aided the Resistance, a new Jedi Order could arise to threaten him. Kylo Ren, apprentice to Supreme Leader Snoke, attempted to find the last piece of a map that they needed to locate Skywalker, but his efforts at first proved unsuccessful. General Armitage Hux, commander of the Starkiller, argued in favor of using the weapon to destroy the Republic and eliminate the government he believed was illegitimate and ill-equipped to lead the galaxy. Hux argued that without the Republic, the Resistance would no longer be a threat. Snoke agreed and gave his permission to fire the weapon."}, {"tag": "h2", "text": "The Hosnian Cataclysm"}, {"tag": "p", "text": "Under orders from Snoke, Hux prepared the Starkiller weapon to fire against the Hosnian system in the Core Worlds, the capital of the New Republic. When the weapon was ready, Hux addressed the legions of stormtroopers under his command who assembled to witness the destructive firepower of the weapon. Hux promised that this day would be the end of the New Republic and ultimately, the Resistance, the culmination of everything the troops had worked towards. Hux then commanded that the weapon be fired, and massive beams of energy were fired across the galaxy towards the Hosnian system. When they arrived, the astronomical bodies of the system were destroyed, including Hosnian Prime. With the destruction of Hosnian Prime, the capital planet of the Republic, came the destruction of the Galactic Senate and the home fleet of the New Republic Defense Fleet. The casualties on Hosnian Prime included Chancellor Lanever Villecham and Korr Sella, an envoy from the Resistance sent by General Leia Organa to warn the Senate about the threat of the First Order—a warning that came too late."}, {"tag": "p", "text": "The destruction of the Hosnian system was visible from across the galaxy, and this caused terror and shock on countless worlds that had no idea what was happening. The famed smugglers Han Solo and Chewbacca, along with stormtrooper defector Finn, witnessed the system's destruction from Takodana, in the Mid Rim. The sight led to confusion on Takodana, but Finn told Solo and Chewbacca that what they were seeing was the First Order using the Starkiller to destroy the Republic capital. Ex-Imperial and member of Inferno Squad Iden Versio also witnessed it from her home planet of Vardos. Resistance member Shriv Suurgav, who was also present, immediately knew that it was the First Order but was unable to work out what they had done until they were captured by First Order officer Gideon Hask; while Shriv was staggered and horrified, Hask referred to the system's destruction as a thing of beauty."}, {"tag": "p", "text": "On Castilon, Kazuda Xiono and Torra Doza witnessed a First Order broadcast of the event. As a native of Hosnian Prime, Xiono was devastated and feared that he had lost his family and friends, although his family were actually off-planet and survived the attack. Xiono's father and mother tried to contact him for days."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The destruction of the Hosnian system caused a massive disturbance in the Force that was immediately felt by Organa on D'Qar, almost causing her to buckle from the sheer volume of deaths.[source?]"}, {"tag": "p", "text": "After the destruction of the Hosnian system, the war raged on, and the Resistance mounted a reconnaissance run on Starkiller Base to learn more about the First Order base that destroyed the Republic. Tracing the route of the phantom energy beam, the Resistance located the Starkiller, and Organa ordered Black Squadron to develop a way to launch a reconnaissance mission on the base."}, {"tag": "p", "text": "Jessika Pava designed a minimal stealth recon pod that would be towed into the Starkiller Base system by a T-70 X-wing starfighter, passively skim above the base's atmosphere while taking measurements, and then be picked up again by the X-wing. While Pava planned to pilot the pod, Temmin Wexley volunteered with his wife Karé Kun piloting the X-wing. The two had just been married and wished to spend as much time together as possible in the event that the Resistance was wiped out shortly thereafter."}, {"tag": "p", "text": "The reconnaissance mission was a success, though Wexley was barely able to make it out of the atmosphere of Starkiller Base, sustaining damage and requiring him to broadcast the data to his wife, giving up his location to the First Order. However, she was able to recover his damaged pod by clamping it between the S-foils of her X-wing, bringing them back to D'Qar. However, due to this, the First Order was able to learn the location of the Resistance base."}, {"tag": "p", "text": "With the location identified, the Resistance put a plan in motion to destroy the Starkiller before it could destroy D'Qar. Finn, Solo, and Chewbacca were sent to the weapon first to disable its shields, while Commander Poe Dameron led a starfighter assault against the base's thermal oscillator, which contained the energy that it drained from stars in order to power its weapon. The Resistance forces successfully destroyed the weapon but at the cost of a number of Resistance lives, including Solo and many starfighter pilots."}, {"tag": "p", "text": "The Hosnian Cataclysm led to a complete shift in the galactic status quo. Although the New Republic had never had the size or influence of the Galactic Republic at its height, it had been the dominant galactic power since the Battle of Jakku. Now, with its political structure decimated and its important fleet in ruins, the First Order had established itself as the primary power in the galaxy, with sufficient resources to conquer it. Systems and planets across the galaxy, that had been tempted by the First Order's promises of security, instantly capitulated, while several others were taken by conquest. A few senators, such as Hosnian Prime's Hamato Xiono, survived the destruction of the Senate, as had several units of the military. However, the remaining task forces had been dissolved by the senators, who redirected the last forces of the Republic fleet to protect their homeworlds from the First Order."}, {"tag": "p", "text": "However, a year later, the Resistance managed to defeat the First Order with the help of a citizens' fleet.[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The destruction of the Hosnian system was depicted in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment of the Star Wars sequel trilogy."}, {"tag": "p", "text": "Director J.J. Abrams felt that if he hadn't cut the scenes of Maisie Richardson-Sellers's Korr Sella, the sequence could have turned out better and provoked a more emotional reaction. Abrams initially filmed a scene in which Leia Organa tasked Sella with going to the Galactic Senate and warning them about the First Order, but deleted it from the final cut as he agreed with writer Michael Arndt that Leia's reintroduction would be more powerful through Han Solo's eyes later on Takodana."}, {"tag": "p", "text": "Pablo Hidalgo, creative executive of the Lucasfilm Story Group, suggested that the reason the blast from Starkiller Base could be immediately seen from Takodana was a \"sub-hyperspace rip side-effect\" of the Starkiller."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}