{"url": "Hospital_ship/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Medical starship classes", "Category:Medical starships", "Category:Starship types"], "nodes": [{"tag": "h1", "text": "Hospital ship"}, {"tag": "p", "text": "A hospital ship or medical frigate was a medical spacecraft often accompanying large or medium-sized military fleets to provide back-up in battle, though it was also sometimes found without military company. Hospital ships were mobile hospitals equipped with medical gear, such as bacta tanks and medical droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The craft were many and varied, including modified EF76 Nebulon-B escort frigates such as Redemption, MedStar-class frigates and Sprint-class rescue craft, including Bright Flight."}, {"tag": "p", "text": "MedStar-class frigates functioned both as medical transport ships and hospital ships during the Clone Wars, being manned by top class medics and, in some cases, also Jedi healers. Pelta-class frigates were used as well during the Clone Wars with the MedStar-class frigate."}, {"tag": "p", "text": "During the Galactic Civil War, EF76 Nebulon-B escort frigates, and at least one Nebulon-B2 frigate, were sometimes converted into hospital ships, by gutting the internal hangar bay out to make room for an internal hospital. Luke Skywalker was healed aboard such a converted Nebulon-B frigate after having lost his hand by the lightsaber of Darth Vader."}, {"tag": "p", "text": "Another former military vessel converted into a hospital ship was the Mercy, a two-kilometer-long former Imperial spaceship, appropriated by the Rebels during the Galactic Civil War. It was aboard this ship that Kyle Katarn was healed in Ward 114's bacta tank 23 after having been injured during his second mission to Nar Shaddaa."}, {"tag": "p", "text": "Another famous hospital ship was the Sudden Restoration. Manned by Carosite physicians, it offered free health care to all, and often worked in systems ravaged by recent battles. Hospital ships were also utilized heavily by the New Republic Relief Corps."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}