{"url": "Hot_air_balloon", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Air vehicles"], "nodes": [{"tag": "h1", "text": "Hot air balloon"}, {"tag": "p", "text": "A hot air balloon, or simply balloon was an ancient type of aircraft that ran on hot air. It consisted of a large bag of light material that was filled with heated gas to make it rise in the atmosphere. Such balloons often carried a suspended \"gondola\" for passengers."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The scientific fact that hot air rose above cold air could be used to put a balloon into motion and make it leave the ground. A hot air balloon consisted of three basic parts: the basket or \"gondola\" for the passengers to sit in, the large bag known as the \"envelope\" that would fill with air and lift the basket, and the burner which was used to heat the air in the envelope."}, {"tag": "p", "text": "Unlike more modern aircrafts, hot air balloons had no steering controls, which could be very destabilizing to individuals hailing from advanced civilizations. The burner was the closest equivalent to controls, allowing the pilot to take the balloon up or down by adjusting the intensity of heat. In order to make the balloon move laterally, its pilot needed to know the layers of wind currents so he or she could determine which one would push the aircraft in the desired direction."}, {"tag": "p", "text": "On the world of Naboo, the Gungans used troop carriers that functioned on similar principles, except that the gas-filled bag was replaced by a dunsenn, a lighter-than-air, fish-like animal of vast size."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "They were notably used on the planet Lahsbane to cross the broad canyons that existed there. The native Lahsbee/Huhk aversion to technology meant this was one of the most sophisticated forms of air transport on the planet. Gliders were also used to cross the canyons."}, {"tag": "p", "text": "A makeshift hot air balloon—made from a parachute, a piece of hull from an escape pod and a homemade stove—was used by Stuart Zissu, R2-D2, C-3PO and 4B-X on Da'nor to return to civilization. It was destroyed when they were forced to land during a storm and crashed through a canopy of trees."}, {"tag": "p", "text": "At some point in history, a traveling explorer crashed with their balloon on the top of the Explorer's Crag, on the forested moon of Endor. The native Ewoks later found that balloon and used it for their own enjoyment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}