{"url": "Hoth_asteroid_field", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Anoat sector asteroid fields", "Category:Hoth system"], "nodes": [{"tag": "h1", "text": "Hoth asteroid field"}, {"tag": "p", "text": "The Hoth asteroid field, also known as the Anoat Asteroid Belt and Hoth Belt, was an extensive, wildly erratic asteroid belt occupying the farthest orbit of the Hoth system in the Outer Rim Territories. Forged as the resulting effect of a collision between two rocky planets eons prior to the Galactic Civil War, the belt was a favored sanctuary for smugglers and pirates alike hoping to elude legal authority. The field was rich in untapped mineral resources such as metal ore, a magnet for mining prospectors hoping to make a fortune. The chaotic nature of the asteroid field sent a constant bombardment of meteorites to the surface of Hoth, the system's sixth planet."}, {"tag": "p", "text": "Following the Battle of Hoth in 3 ABY, Han Solo braved the perils of the asteroid field in the Millennium Falcon as part of a desperate ploy to escape the Imperial Navy, successfully navigating its expanse against all odds. Later, in 12 ABY, the Hutts used the belt as the construction site of the Darksaber Project, a planet-destroying superweapon designed to dominate the galaxy. A New Republic attack force under the command of General Wedge Antilles pursued the weapon through the field, and it was ultimately destroyed after being crushed between two planetoids."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Hoth asteroid field, also referred to as the Anoat Asteroid Belt and Hoth Belt, was an especially wide swath of countless free-ranging planetesimals confined to a set orbit. Located at the outermost edge of the Hoth system—the far end terminating in the Anoat system—within the Anoat sector of the Greater Javin region of the Outer Rim Territories, the Hoth asteroid field was the resulting effect of a collision millions of years prior to the Galactic Civil War between what were once the system's two farthest outlying planets. Large and rocky in composition, the planets were fractured into scattered chunks of debris that were strewn throughout the system and eventually were pulled into erratic orbits around Hoth, the system's star. Scientists and surveyors also speculated that the asteroid field may have formed after the crumbling of one of the ice planet Hoth's own moons, or even that the two planets' collision caused the moons to crumble, supplementing the rock storm. Due to the Hoth system's remote isolation, the asteroid field remained largely uncharted."}, {"tag": "p", "text": "Throughout the belt's existence, rocky chunks continued to constantly collide with one another, grinding each other down to smaller asteroids. During the belt's early years, the collisions were catastrophic, creating vast craters in the many large asteroids. The collisions became less frequent and less powerful by comparison as the field matured, and the asteroids entered relatively stable orbits. As the asteroids collided and increased in number, the belt's composition grew in range from microscopic dust particles to tiny pebbles, large boulders, and asteroids that rivaled small moons in size and were massive enough to contain scant atmospheres. The chaotic nature of the asteroid field created an environment all but impossible for charting. Additionally, the random maelstrom and constant collisions proved a great hazard for hyperspace travel through the region and a certain deathtrap for pilots hoping to successfully traverse the field. The largest asteroids, continually tugging at each other, destroyed any possibility of maintaining a rigid orbit. The Hoth system's planets were the frequent recipients of meteorite collisions from asteroids that had broken away from the field as a result. In particular, a steady stream of meteorites constantly bombarded the planet Hoth, occupying the system's sixth orbit."}, {"tag": "p", "text": "The field's asteroids were rich in mineral composition, the lasting deposits of the two planetary cores. Indeed, the asteroids were composed of a vast array of different minerals and metal ores, including nickel and iron—one asteroid was even rumored to be comprised entirely of platinum. The high metal concentration of the asteroids had a tendency to cause sensor distortions for passing starships. A rare growth found among many of the asteroids were crystal ferns, strange transparent, silicon-based crystals produced as an effect of some rocks' exposure to heavy radiation and cold vacuum. The crystals grew in delicate, web-like tangles extending several meters from their base on the surface of an asteroid and propagated from one asteroid to another, broken in shards that were carried to other rocks by orbital forces."}, {"tag": "p", "text": "The asteroid field's very high mineral content and presence of some organic material, including frozen water, meant that some extraordinary creatures occupied the asteroid field. Many of the larger asteroids were inhabited by giant wormlike creatures known as exogorths, colloquially called \"space slugs.\" Prior to the fall of the Galactic Republic, the space pirate Clabburn the Elder installed the space slugs as guardians within the hollow shaft entrances of asteroids that led to his secret hives of operation. In the absence of gravity, these space slugs grew to enormous proportions, some reaching lengths of 900 meters. Indeed, while other exogorth specimens existed throughout the galaxy, those found among the Hoth asteroids were the largest. The slugs were able to survive within the thin atmospheres of the larger asteroids, subsisting for many years by breaking down the rock of the asteroid itself. Long tendrils extended from the rear portion of the creatures that reached into the asteroids to extract nutrients. By the early years of the Galactic Civil War, thousands of space slugs populated the asteroid field. In turn, winged, parasitic creatures known as mynocks inhabited these giant space slugs. Silicon-based lifeforms able to survive in vacuum, mynocks typically assumed sanctuary within their hosts and leached off the soft inner membranes of the slugs' interiors and the thermal energy they radiated as heat. Large numbers of mynock packs lived in the field, attaching themselves to the outer hull of the occasional passing starship to drain the vessel's concentrated energy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Miners and pirates"}, {"tag": "p", "text": "The asteroid belt was an opulent source of untapped wealth for the galaxy at large. The mineral deposits laying in store within the asteroids themselves promised instant reward to anyone who was able to extract them. For many years prior to the fall of the Galactic Republic, Hoth's asteroid belt was a powerful attractant to several such prospectors—independent, or otherwise—hoping to strike it rich. The belt's hazardous and erratic pitfalls were not enough to deter these entrepreneurs from accepting the gambit of potential death for wealth. Nevertheless, by 12 ABY, the field's resources still remained largely untapped despite previous efforts."}, {"tag": "p", "text": "A popularly persistent legend existed of one particular asteroid that was rumored to be nothing less than a mass of nearly pure platinum. The chunk of ore became anecdotally known as Kerane's Folly because the prospector Kerane, having supposedly discovered the asteroid, extracted a sample and exited the asteroid field in order to confirm that it was indeed the precious metal he sought. When he returned to the field, he found he could not relocate his treasure. Kerane spent the rest of his life searching the Hoth asteroid field, but was never able to recover the asteroid. This story had spurred other prospectors into searching for the platinum asteroid for years without success."}, {"tag": "p", "text": "For centuries the field also proved to be a favorite hiding place for many smugglers and pirates. Rumors abounded about pirate treasure that lay hidden deep within the field. The larger asteroids with minimal atmospheres served as strongholds for many hostile criminals, where they discovered they were relatively safe from any lawful hand of judgment. Governmental organizations alike, from the Republic and the Galactic Empire, to independent planetary police forces, had lost elusive prey into the confines of the wild asteroid assortment. They each determined that, after numerous enforcement ships were lost in pursuit, once a refugee managed to reach the asteroid belt, continuing the chase was an exercise in futility. Reports of smugglers raiding a small mining station in the asteroid field came to the attention of the Jedi Council sometime prior to the Battle of Naboo in 32 BBY. The responsibility fell to Jedi Master Qui-Gon Jinn to assemble a team of Jedi to patrol the area for suspicious smugglers."}, {"tag": "p", "text": "One large asteroid in particular was known among pirate groups as the \"Poison Moon,\" because of its surface appearance. Three years prior to the onset of the Clone Wars, the Republic Consular-class cruiser Radiant IX was sucked into the gravity well of the asteroid after a group of mynocks leeched power from the exterior of the ship. The Jedi Knight Obi-Wan Kenobi and his Padawan learner, Anakin Skywalker, arrived at the crash site responding to a distress beacon. They discovered the Radiant IX had been carrying a group of Jedi en route back to Coruscant, where they hoped to deliver the captive Dark Jedi Alysun Celz to the Jedi Council. Kenobi and Skywalker were able to rescue the lone Jedi survivor, Et Rex, and detain Celz."}, {"tag": "p", "text": "Sometime prior to the fall of the Republic, the Mugaari pirate Icanis Tsur and a crew of thirty manning his ship, the 80-Vag, were killed when the craft was destroyed within the field. The ship's wreckage was pilfered by Squib teams and rogue scavengers as it floated among the asteroids. However, many of these foragers were similarly destroyed in the process, adding to the very debris they were hoping to retrieve."}, {"tag": "p", "text": "The asteroid field was also known notoriously as the haven of operations for the pirate Clabburn the Elder, an uncompassionate Mugaari, during the last decades of the Republic. Striking from the safety of the field, Clabburn and his forces would stalk the most populated hyperlanes running through the area, typically attacking wealthy tourists in luxury liners en route to the nearby resort of Bespin's Cloud City. Bounty hunters, police forces, and vengeful family members of the besieged attempted to hunt Clabburn, but were unable to locate his base within the field. The pirate took precaution to constantly relocate from one planetoid to another, always covering his tracks and booby-trapping his previously used facilities. Clabburn acquired and installed giant exogorths at the entrances of his discarded bases to devour anyone brave enough to track him."}, {"tag": "p", "text": "At some point following the Battle of Yavin, another Mugaari pirate, Clabburn the Younger, the son of the elder Clabburn, attempted to fashion his own pirating career after that of his father. He similarly created a secret base within the field, drilled deep into the nickel-iron core of one of the larger asteroids, known as Airtight Base for its impregnable security. Also like his father before him, the younger Clabburn used some of the field's exogorths, which had multiplied to thousands in number by this time, as a security measure. He planted them in caves flanking Airtight Base, training them to attack a threatening ship by way of ultrasonic signal."}, {"tag": "p", "text": "Sometime after Clabburn the Elder introduced the slugs to the field, the Krish game hunter Gamgalon responded to an ad placed on the HoloNet calling for a healthy space slug, declaring that he had discovered a 900-meter-long specimen in the Hoth asteroid field and that he believed he could deliver it in a couple weeks' time. However, he noted the difficulty in capturing the slug, explaining that he would require a special towing ship and heavy extraction machinery, a substantial amount of sedative to incapacitate the slug, and would potentially demand more than the originally advertised 100,000-credit bounty, depending on the difficulty of securing the creature from its Hoth asteroid field home."}, {"tag": "h3", "text": "Rebel activity and Battle of Hoth"}, {"tag": "p", "text": "After the retreat from their Massassi Station base on Yavin 4, the Alliance to Restore the Republic's High Command established the secret Echo Base on the planet Hoth. The planet's remote nature, as well as the perpetual bombardment of meteorites from the system's nearby asteroid field, proved to be a perfect natural camouflage from the probing eye of the Empire. Nevertheless, the system's constant meteor activity proved a hindrance to any attempts to track would-be approaching ships. In response, Captain Wyron Serper, one of Echo Base's scanners, was tasked with monitoring the Hoth system's meteor activity to determine what was an asteroid and what could be an Imperial scout ship."}, {"tag": "p", "text": "In 2 ABY, as Echo Base neared completion, a group of Rebels were assigned to deliver a supply shipment—including construction equipment, weapons, droids, and other items—to the Rebel facility on Hoth. Upon arriving in the Hoth system, the Rebel couriers found themselves somewhat off course and had to traverse a section of the Hoth asteroid field before landing on the ice planet."}, {"tag": "p", "text": "When an Imperial-launched Arakyd Viper probe droid crashed into Hoth's icy terrain in 3 ABY, the Rebels failed to detect it as a threat. Luke Skywalker, unfazed by yet another meteorite impact, reasoned it could have been a man-made instrument. The \"meteorite\" that Han Solo reported to the base's command center would be the impetus for the subsequent Battle of Hoth after the Empire's discovery of Echo Base."}, {"tag": "p", "text": "During the battle, many fleeing Rebel ships were able to use the asteroids to their advantage to evade the Imperial blockade of the planet. Following the Rebels' staggering defeat during the ground portion of the battle, Solo and the Wookiee Chewbacca escaped from Hoth aboard the Millennium Falcon with Princess Leia Organa and the protocol droid C-3PO in tow, followed closely by Darth Vader's pursuing Death Squadron, his personal fleet of Star Destroyers. Much to the chagrin of Solo and his passengers, the Falcon's malfunctioning hyperdrive failed to engage, trapping them in the system. While Solo feverishly worked on the ship's interior systems in an attempt to effect their escape from the Imperial Navy, Organa inadvertently piloted the Falcon into the system's asteroid field. Stuck—quite literally—between a rock and a hard place, Solo had little alternative but to plunge his ship further into the asteroids. Through masterful flying and near-suicidal maneuvering, he escaped from a flight of TIE/LN starfighters, led by Arnod, whose pilots were unable to avoid crashing into the asteroid maelstrom. Solo eventually piloted his ship into a cavernous opening of one of the biggest asteroids, where he hoped to hide long enough to complete repairs on his hyperdrive."}, {"tag": "p", "text": "Almost simultaneously, the mercenary Dash Rendar, who had also escaped from Hoth after delivering a shipment of supplies to Echo Base, was similarly chased into the asteroid field by an Imperial II-class Star Destroyer and a large contingent of its starfighter complement. Unlike Solo, Rendar's ship, the Outrider, a sleek YT-2400 light freighter, was not in disrepair. Rendar manned his freighter's heavy laser cannons while his copilot droid, LE-BO2D9, bypassed the Star Destroyer, which remained at the fringe of the belt, and took them into the field. Rendar was able to hold off several squadrons of TIE Fighters and TIE/sa bombers long enough until the Outrider was far enough away from the asteroids to safely make the jump into hyperspace."}, {"tag": "p", "text": "One of Echo Base's thirty GR-75 medium transports that attempted to escape through the Imperial blockade of the planet, the Treasure Trove, was crippled and lost within the asteroid belt during the battle. The transport managed to dock along the edge of a crater on a large asteroid the size of a capital ship. Rebel General Carlist Rieekan noticed the transport missing when it failed to regroup with the Alliance Fleet at the Rebels' predetermined rendezvous point beyond the Galactic Rim, where it was meant to deliver a valuable shipment of blaster gas. He dispatched a team of special agents aboard the Out Runner, a YL-2200 light freighter, who located the Treasure Trove in the field, only to find its crew dead."}, {"tag": "p", "text": "Once the Rebel agents returned to the Out Runner, they were beset upon by the Rodian bounty hunter Chreeto the Defiant and his crew, operating as Imperial retainers. Hoping to capture the Rebels, Chreeto pursued the Out Runner through the asteroid field in his YT-1300 light freighter, the Prowling Wolf. The Rebels, however, successfully escaped the bounty hunters."}, {"tag": "h3", "text": "Search for the Millennium Falcon"}, {"tag": "p", "text": "Despite the threat of damaging asteroid collisions, the Imperial II-class Star Destroyer Avenger boldly led Death Squadron's chase of the Millennium Falcon into the field. Once the Millennium Falcon disappeared from sight, however, the Avenger slowed its pursuit near the edge of the belt. Vader nevertheless ordered his fleet of Star Destroyers into the asteroid onslaught. He believed that Luke Skywalker had escaped Hoth aboard the Millennium Falcon with the rest of his companions. All of Vader's Star Destroyers, including the 19-kilometer-long Super Star Destroyer Executor, Vader's own flagship, were diverted into the asteroid field amid a flurry of damaging collisions and incidental casualties suffered aboard several of the Star Destroyers. Captain Lorth Needa, commander of the Avenger at the forefront of the fleet, reasoned with Vader that the Millennium Falcon must have been destroyed, but Vader knew better. The Avenger continued to charge forward, clearing a path through the asteroids for the remainder of the fleet to follow, while flights of TIE bombers littered the biggest asteroids with explosives, hoping to chase out their quarry."}, {"tag": "p", "text": "The fleet's starfighters suffered a number of casualties and other mishaps during the search through the asteroid field. The Imperial pilot Captain Jonus narrowly escaped death after encountering a space slug, while the TIE bomber Scimitar 2 was struck and disabled by an asteroid. The TIE Fighter Scythe 3 had its laser cannons upgraded in order to destroy smaller asteroids."}, {"tag": "p", "text": "The Millennium Falcon spent several days hiding within the massive asteroid while Solo and his passengers worked to repair the ship's faulty hyperdrive. Solo cleverly shut down the ship's primary systems in order to avoid detection by the probing Imperial ships the group could hear overhead trying to chase them out. It was while cooped up within the close confines of the Millennium Falcon for several days that the longstanding romantic tensions between Solo and Organa first began to blossom. The princess finally warmed to Solo's roguish charms as they shared one of their first kisses within the deep innards of the asteroid."}, {"tag": "p", "text": "However, it was not the might of the Imperial Navy that eventually flushed the Millennium Falcon out of its hiding place. The group soon discovered that mynocks living inside of the cavern had attached themselves to the ship's power cables, leeching the ship of its energy. While clearing the ship of the parasites, Solo and Chewbacca unwittingly discovered the true nature of their hiding spot. Stray blaster bolts fired into the walls of the cave had strangely caused the grotto to shake violently. It was not a simple cave that Solo had hidden his ship in, but the nesting area of a giant exogorth. Solo was able to pilot his ship out of the closing jaws of the massive space slug with only seconds to spare, but at the expense of knowing they would once again be engaged by the Imperial fleet. The existence of an enormous space slug within the asteroid field had been written off as spacer legend until Solo's run-in with the creature. However, some continued to disbelieve the story, based on Solo's reputation for exaggeration."}, {"tag": "p", "text": "Immediately after reentering the asteroids and exposing itself, the Millennium Falcon was once again detected by two TIE scout ships, which broke orbit and returned back to alert the main Imperial fleet. Soon, the Avenger reengaged the Millennium Falcon and the chase continued. Fortunately for the Rebels, however, they had exited the confines of the asteroid field after traversing its expanse. Free of obstruction, Solo once again tried to engage his hyperdrive with repairs believed completed, only to find, much to the dismay of everyone aboard, it was still inoperable. The Avenger was the only ship attached to Death Squadron that managed to stay with the Falcon through the entirety of the asteroid field, earning the warship a reputation for persistence among the Imperial Navy. Needa had sent his Star Destroyer headfirst into the asteroids as Vader had commanded, sustaining substantial damage in the process. It was all his gunnery crews could do to try and keep up with the endless task of trying to shoot down the rocky debris in the Star Destroyer's path. So, when Solo suddenly and unexpectedly banked the Millennium Falcon on an attack course straight for the pursuing Avenger, Needa and his crew were ill-prepared and lost the Rebel ship for good. Solo had cleverly attached the Millennium Falcon to the backside of the Avenger's bridge command tower, where the Imperial Navy neglected to look. Solo knew that, per standard Imperial procedure, large warships such as the Avenger customarily jettisoned their garbage allotment before entering hyperspace. When the Imperial fleet had finally decided that their prey had indeed escaped into hyperspace and had themselves exited the area, Solo simply allowed his ship to tumble away undetected with the rest of the Avenger's refuse."}, {"tag": "p", "text": "Even before the Battle of Hoth began, the Empire had announced a reward for any bounty hunters who helped chase the Rebels fleeing from the system. Once it became clear to Vader that the ineptitude of his own fleet would likely never bring him those he sought, he sent out his own call for an elite group of hunters to capture the crew of the Millennium Falcon hiding within the asteroid field. Six bounty hunters, highlighted by the notorious Boba Fett, were instructed to rendezvous with Vader's Executor just outside the field, where they were briefed on the details of their mission. Just as Vader's briefing was finished, the Avenger's failure to capture the Millennium Falcon was reported throughout the fleet. The hunter Dengar surmised correctly—albeit too late—that Solo had hidden his ship within the asteroids, taking advantage of the fact that the high metal concentration of the field would distort sensor readings and help mask his location. His own hours-long search within the field came to an abrupt end when one of his own strategically-placed sensor beacons, powerful enough to counteract the metal-induced distortions, detected a badly damaged Millennium Falcon limping away from the system at sublight speed. Before Dengar could close in on his prey, however, a taunting transmission from the rival Fett activated a preemptively planted bomb within Dengar's ship, destroying the engines and neutralizing the craft. Dengar could only watch helplessly from the asteroids as Fett tracked Solo's departure away from the field."}, {"tag": "h3", "text": "Darksaber Project"}, {"tag": "p", "text": "By 12 ABY, the Hutt criminal empire had created the Orko SkyMine Asteroid Processing Corporation under the direction of the Hutt overlord Durga Besadii Tai to mine the untapped resources of Hoth's asteroids. In reality, the corporation was nothing but a sham commercial enterprise designed to mask the copious amounts of funds being diverted into the Hutts' true goal: the construction of a superweapon powerful enough to rule the entire galaxy. Nicknamed the Darksaber Project by its chief engineer, Bevel Lemelisk, the weapon would be constructed within the heart of the asteroid field itself, created from the asteroids' metal ore. The remote location of the Hoth system and the field's limitless resources made the Hoth asteroid belt the perfect construction site."}, {"tag": "p", "text": "Early construction phases consisted of extracting the precious metal from the asteroids using two massive Automated Mineral Exploiters, named Alpha and Beta, respectively. The processing units were little more than cargo containers equipped with turbolasers to reduce an asteroid to small debris before a forward mouth would swallow the rubble, spit out the useless slag, and retain the valuable ore. Each exploiter was designed to lock onto the heaviest concentration of metal in its general vicinity and commence with processing. The two machines each met their demise when they unexpectedly detected each other as sources of incredibly pure metal and ground one another down to scrap—a disappointing but ultimately minor setback for the Hutt operation. Fearful of Durga's retribution for his faulty designs, Lemelisk declared the two Mineral Exploiters prototypes and promised to correct the programming error in the second batch: Exploiters Gamma and Delta."}, {"tag": "p", "text": "The new mineral smelters, altered to ignore one another as a potential metal resource, proceeded with greater efficiency than their predecessors. Before long, the Darksaber weapon itself began to take shape among the asteroids: a long cylindrical shaft housing a planet-destroying superlaser derived from the original plans to the first Death Star battlestation. Seeing that his creation would resemble a lightsaber hilt with extended blade when fired, Lemelisk derisively coined the project Darksaber, much to the amusement of Durga. The Hutt had tasked the project's labor to multitudes of multi-armed, mind-linked creatures known as the Taurill, who were fitted with vacuum suits enabling them to manually build the weapon from the gravitation-void of space. Construction was delayed several times due to the easily distracted nature of the Taurill. Governed by an Overmind, in which each member of the hive was linked mentally, the attention of the Taurill was occasionally diverted by a nearby passing asteroid or a smuggling ship that had entered the area. When the Taurill returned to their labor, they would continue construction on a different portion of the Darksaber superstructure, destroying previously created cohesiveness."}, {"tag": "p", "text": "Following an unsuccessful journey to the planet Hoth to help the Jedi Knight Callista Ming regain her control of the Force, Luke Skywalker and Ming entered the asteroid field in a barely functioning space yacht, damaged on the ice planet by the native wampa ice creatures. With life support systems failing on the ship, Skywalker was able to telepathically communicate with his sister, Leia Organa Solo, across the vastness of space to call for help. Guided by Organa Solo's Force connection with her brother, she and Han Solo tracked down the location of the damaged yacht in the asteroid field and rescued the two stranded Jedi. However, they were unaware that the Hutt superweapon that the New Republic had recently become privy to was being constructed right under their noses."}, {"tag": "p", "text": "The Darksaber project was discovered almost immediately thereafter by a search-and-destroy mission led by New Republic General Crix Madine. Madine and two other commandos entered the field in RZ-1 A-wing interceptors, although one of the pilots, Korenn, was killed by a colliding asteroid, and infiltrated the construction site in self-propelled vac-suits. Despite the capture and death of both Madine and his fellow agent, Trandia, a distress signal transmitted by Madine through the HoloNet directly to the New Republic Defense Fleet prompted a response by a task force led by General Wedge Antilles. Antilles' fleet surged through the field, suffering considerable damage as they approached the Darksaber, which had fled into the most chaotic part of the belt on Durga's orders. Pummeled by a salvo of laser fire from the pursuing New Republic warships, the Hutt superweapon was ultimately obliterated between two massively sandwiching asteroids, killing Durga and creating yet more scattered debris among the field."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Creating the asteroid field"}, {"tag": "p", "text": "The Hoth asteroid field first appeared simultaneously in Donald F. Glut's novelization of Star Wars: Episode V The Empire Strikes Back and The Empire Strikes Back Storybook, adapted by Shep Steneman, both released on April 12, 1980, just prior to the film's May theatrical release."}, {"tag": "p", "text": "The idea of entering an asteroid field to escape the enemy first appeared in the rough draft of Star Wars: Episode IV A New Hope, in which General Skywalker enters the Norton Asteroid Belt to elude Imperial forces. While the chase through the asteroid belt is included in every version of The Empire Strikes Back screenplay, some versions place the sequence after the Millennium Falcon reaches the Rebels' rendezvous point, where the ship is met by a massive Imperial fleet."}, {"tag": "p", "text": "Designers at Industrial Light & Magic used at least twenty-five different visual elements to create the chase through the Hoth asteroid field. Among these were an \"asteroid box\" that was composed of dozens of small rocks suspended from rotating wires in an effort to convey the impression of a massive asteroid field. Closer asteroids were represented by pieces of polystyrene coated in plaster and at least one potato. All of these elements were shot separately against a bluescreen and composited with an optical printer. Animatics of the chase created by ILM's animation department allowed editors to more easily coordinate the timing and pacing of the scene."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "The West End Games The Movie Trilogy Sourcebook, published in 1993, refers to the asteroid field as the \"Anoat Asteroid Belt,\" terminology not repeated in any other Star Wars canonical source. According to Star Wars: The Annotated Screenplays, which includes the original script for The Empire Strikes Back, Hoth and its system's asteroid belt are located in a region of space known as the Granita Clusta. However, this material, which was ultimately cut from the final version of the film, should not be considered canonical."}, {"tag": "p", "text": "Several Star Wars sources depict C-3PO as providing Han Solo with different odds for navigating an asteroid field: the novelization of The Empire Strikes Back and the film's Marvel Star Wars comic adaptation, Star Wars 41, include odds of 2,467 to 1; the plot synopsis of The Empire Strikes Back - Official Collectors Edition magazine places the odds at 365,000 to one; the radio adaptation of The Empire Strikes Back lists odds of 725 to 1; while the radio drama's script, originally published in The Empire Strikes Back: The National Public Radio Dramatization, puts the odds at 720 to 1."}, {"tag": "p", "text": "The short story Payback: The Tale of Dengar, which details Dengar's search of Han Solo and the Millennium Falcon through the asteroid field, describes nearly a half-hour passing between the time the Imperial fleet enters hyperspace and the Millennium Falcon, having hidden itself in the Star Destroyer Avenger's jettisoned garbage dump, begins to limp out of the system, while Dengar is ultimately left incapacitated within the asteroid field. This time is seemingly inconsistent with the film The Empire Strikes Back, which depicts the Millennium Falcon as beginning its departure from the region immediately after the departure of the Imperial fleet."}, {"tag": "h3", "text": "Video games"}, {"tag": "p", "text": "The non-canonical PC games LEGO Star Wars II: The Original Trilogy and LEGO Star Wars: The Complete Saga recreate the Millennium Falcon's flight through the asteroid field, adding unique game mechanics not seen in the film. Nintendo GameCube's Star Wars: Rogue Squadron II: Rogue Leader offers the Hoth asteroid field as a bonus level that closely resembles the film's storyline, in which the player must also recreate the Falcon's chase through the field before completing the level by attaching the ship to the backside of a Star Destroyer's bridge tower. In Star Wars: Flight of the Falcon for Game Boy Advance, the player enters hyperspace at the conclusion of the game's asteroid field level, a clear contradiction of established canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}