{"url": "Ambush_in_the_Derilyn_system", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Elrood sector", "Category:Battles of Spreading the Rebellion campaign", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Ambush in the Derilyn system"}, {"tag": "p", "text": "The First Battle of Derilyn was an Rebel Alliance ambush that resulted in a devastating defeat for the Imperial fleet sent to reinforce Task Force Vengeance."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Rebel Alliance intended to bring their newly-christened modified Strike-class cruiser Peregrine to bear on the Imperial Navy in the Airam sector. Having learned of a reinforcement fleet with additional ships and supplies intended for Task Force Vengeance, the Alliance High Command decided that the time to strike had come."}, {"tag": "p", "text": "Positioning the Peregrine and MC80 Calamari Cruiser Liberty in the Derilyn system, the newly-acquired Rebel gravity well projectors performed their intended task against their former owners: the whole reinforcement fleet, which consisted of two Ton-Falk-class escort carriers, two EF76 Nebulon-B escort frigates, a Nebulon-B2 frigate and a Strike-class medium cruiser, was drawn out of hyperspace."}, {"tag": "p", "text": "Rogue Squadron immediately launched their complement of proton torpedoes at the modified frigate, crippling the vessel. Green Squadron engaged the other capital ships while Rogue Squadron migrated to eliminating any starfighter that would launch."}, {"tag": "p", "text": "The Imperial fleet, while caught fully surprised, was likely alerted of the capture of the interdictor Compellor and the distinct possibility of it being used against the Empire. The Task Force Vengeance reinforcements had their fighter and bomber squadrons on hot standby and were able to launch them immediately, while the capital ships turned to move in on the Liberty and Peregrine."}, {"tag": "p", "text": "Whether alerted or not, the battle group was vastly disorganized, partly likely due to the crippling hits to the modified frigate Subjugator, partly thanks to being pulled out of hyperspace with no warning. The fleet suffered heavy losses relatively quickly—the frigates exploded first, shortly followed by the Strike-class cruiser Talon. The last to be destroyed were the two escort carriers Abolisher and Hyperion, due to the relatively small threat they posed to the Alliance starships."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Alliance victory was likely one of the most impressive won by the Rebellion prior to the Battle of Endor; the intercepted fleet outnumbered the Liberty strike force at least ten to one in terms of starfighters and three to one in terms of capital ships, yet the Alliance suffered only relatively minor losses and slight damage to both Liberty and Peregrine."}, {"tag": "p", "text": "The destruction of six capital ships, their starfighter complements and any loaded supplies intended for Task Force Vengeance also meant that Admiral Wooyou Senn was further limited in what action he could take in the Airam sector from now on, gradually running low on warheads, fuel, and consumables."}, {"tag": "h2", "text": "Appearances"}]}