{"url": "Hound%27s_Tooth_Expansion_Pack_(X-Wing:_Second_Edition)", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Incomplete lists", "Category:X-Wing: Second Edition Expansion Packs: Sixth Wave"], "nodes": [{"tag": "h1", "text": "Hound's Tooth Expansion Pack (X-Wing: Second Edition)"}, {"tag": "p", "text": "The Hound's Tooth Expansion Pack is an expansion to the tactical ship-to-ship combat game Star Wars: X-Wing Second Edition released by Fantasy Flight Games on January 31, 2020. It is a Scum & Villiany expansion to the Sixth Wave of the Core Set for the stand-alone game. It features a detailed miniature of the Hound's Tooth and a Z-95-AF4 Headhunter."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The reptilian bounty hunter Bossk is as tenacious as he is notorious, pursuing his targets doggedly in his customized YV-666 light freighter, the Hound's Tooth, or launching his Z-95-AF4 Headhunter to engage other starfighters up-close and personal. Beside Bossk, the YV-666's spacious triple-decker design makes it popular with bounty hunters of all stripes, who often retrofit an entire deck for prisoner transport."}, {"tag": "p", "text": "The Hound's Tooth Expansion Pack contains everything you need to start your own bounty hunting career, including a YV-666 light freighter miniature and a Z-95-AF4 Headhunter miniature painted in the striking Nashtah Pup scheme. Joining these miniatures are six ship cards—four for the YV-666 and two for the Z-95-AF4 Headhunter—and fourteen upgrade cards. Finally, three Quick Build Cards give you even more options for deploying your YV-666. The Bossk Z-95-AF4 ship card contained in this expansion is also be available in the Hotshots and Aces Reinforcement Pack for the benefit of veteran players."}, {"tag": "h2", "text": "Contents"}, {"tag": "h3", "text": "Mission scenarios"}, {"tag": "h3", "text": "Miniatures"}, {"tag": "h3", "text": "Cards"}, {"tag": "h4", "text": "Pilots"}, {"tag": "h4", "text": "Crew"}, {"tag": "h4", "text": "Gunner"}, {"tag": "h3", "text": "Ship cards"}, {"tag": "h3", "text": "Tokens"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}