{"url": "House_Alde_embassy", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:House Alde", "Category:Locations in House Organa"], "nodes": [{"tag": "h1", "text": "House Alde embassy"}, {"tag": "p", "text": "The Alderaanian noble family House Alde maintained an embassy on the grounds of Castle Organa, the ancestral home of fellow Republic ally House of Organa on the planet Alderaan, during the Cold War between the Republic and the Sith Empire. In 3643 BBY, the Imperial spy Aleyna Hark infiltrated the embassy and tagged Count Alde with the targeting device for the Death Mark laser, a weapons satellite in orbit of Alderaan, and the Death Mark's orbital laser killed the Count while he was still inside the structure. After the death of the Count, the embassy's guards closed the building to the public."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As an ally of the House of Organa, the Alderaanian noble family House Alde occupied a building on the western grounds of Castle Organa, the home of House Organa on the planet Alderaan, to use as their embassy. The building contained a hallway with numerous turns that linked the entrance to the main conference room, which was a large circular chamber containing tables and chairs for diplomatic discussions. Like many buildings on Alderaan, it featured large statues, tan flooring, and a color scheme of crimson and gold. The embassy was protected by guards under the command of Captain Yils, as well as under Count Alde, who conducted business there when he was visiting Castle Organa."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3643 BBY, during the Cold War between the Sith Empire and the Galactic Republic, Count Alde was visiting the embassy when the Mirialan Aleyna Hark arrived, claiming to be the only survivor of an attack on the Mensaav Laboratory—a facility where the Republic was working on the weapon known as the Death Mark laser using Alde funding. A young Jedi Knight who had been sent to secure the Death Mark laser soon joined Count Alde, but Hark—actually an Imperial spy—took the opportunity to tag the Count with the targeting device of the Death Mark. During their conversation, the Sith Lord Nefarid activated the Death Mark satellite in orbit above Alderaan, killing Count Alde with a laser strike. Captain Yils and his men charged into the conference room to find the Count dead with Hark, the Jedi, and the Knight's companion thrown to the floor."}, {"tag": "p", "text": "Ignoring their attempts to explain, Yils ordered his men to arrest the trio for the death of the Count. However, Yils was convinced to allow the Knight to leave, either by the Jedi's use of the Force or by Hark's offer to remain in custody until the Knight returned. After the Knight's departure, Yils and his subordinates closed the embassy to the public."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Alde embassy first appeared in Star Wars: The Old Republic, a video game released by BioWare and LucasArts, as a class-restricted location for the Jedi Knight class mission \"The Death Mark.\" Yils can either be fought for dark side alignment points, or convinced to release the Knight for light side points. As a Republic character, the Jedi Knight is assumed to only choose the light side options, so this article assumes the Knight left without fighting the guards. The embassy was also pictured on a map of the Apalis Fields region that appeared in Star Wars: The Old Republic Explorer's Guide, though it went unlabeled."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}