{"url": "Ambush_in_the_Semag_system", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Zaarin insurrection"], "nodes": [{"tag": "h1", "text": "Ambush in the Semag system"}, {"tag": "p", "text": "The forces of Grand Admiral Demetrius Zaarin ambushed Imperial forces in the Semag system."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When Rogue Grand Admiral Zaarin learned that Grand Admiral Thrawn was trying to lure him into a trap using a small convoy that claimed to be carrying Missile Boats as bait, he sent a minor attack force to destroy the convoy. Realizing that there may be Spies working for Zaarin. Thrawn opted to use a convoy carrying real Missile Boats. Unfortunately Zaarin knew it was also a trap and intercepted Task Force Whirlwind, which consisted of the Interdictor Whirlwind and 4 Strike Cruisers G'Neeznow, Indomitable, Iron Duke and Triumph. Using his own Interdictor Maelstrom with TIE Advanced to handle the ships fighters and TIE Defenders to attack the Whirlwind."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Tan Maarek Stele, in his own Missile Boat was present among the task force. He engaged the enemy fighters and managed to destroy a few of the Advanced and TIE Defenders, but a couple of TIE Defenders managed to damage the Whirlwind. Stele still managed to intercept the remaining rockets and destroyed the remaining fighters. With time running out he then launched Bombs to destroy the Maelstrom."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The attack although a particular loss to Zaarin, still managed to achieve the desired results. The Whirlwind was damaged and hopelessly behind schedule and Zaarin managed to attack the convoy earlier then predicted. Stele was the only one who could save the convoy in time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle appears in Star Wars: TIE Fighter in Battle 11, Mission 4. This article assumes completion of \"Primary\" and \"Bonus\" Goals completed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}