{"url": "Ambush_near_Darknon_Station", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Inner Rim"], "nodes": [{"tag": "h1", "text": "Ambush near Darknon Station"}, {"tag": "p", "text": "A pre-planned ambush took place close to the space station Darknon Station on the Itani Run Hyperlane in the Inner Rim. The conflict involved three pirate vessels aiming to capture a Helix-class light interceptor. The pirates, lead by an individual named Larken, had been tipped off to the fact that the interceptor was headed for the station by a female named Sahr who joined them as Larken's gunner and partner on board his vessel Pillage. The group, which also included the ships Trust Me and Profit, waited under the cover of an magnetic storm for their target's arrival with the Pillage waiting in a position to prevent the target doubling back and escaping. When their target, which was named the Kizbon's Box, arrived the three moved to attack what they believed was an unarmed vessel only to discover it was armed with proton torpedos, which it used to destroy Trust Me. After seeing the destruction of the other ship the pilot of Profit, named Druug, began to curse before his ship two was obliterated, killing him. In the only remaining vessel, Larken fired several shots at the Box but did almost no damage and afterwards the pilot of the opposing vessel contacted Larken and Sahr by comm, addressing them both by name."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ambush first appeared in 1995 the article \"A Buyer's Guide to Alternative Starships\" which was published in the fifth issue of the Star Wars Adventure Journal series of supplement books for West End Games, Star Wars: The Roleplaying Game. The article was written by Stephen Luminati and included two short stories to illustrate some of the ships mentioned. The conflict appeared in one of these, titled \"Kizbon's Box\" which gave no information as to what era it was set in."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}