{"url": "House_Mecetti", "categories": ["Category:Legends articles", "Category:Interplanetary governments", "Category:Tapani Noble Houses", "Category:Tapani sector culture"], "nodes": [{"tag": "h1", "text": "House Mecetti"}, {"tag": "p", "text": "House Mecetti was a coalition of noble families that ruled the Mecetti Province, which was located in the Tapani sector. It was considered to be the most bellicose and arrogant of all the Tapani Noble Houses."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "House Mecetti was one of the most ancient and powerful houses of the Tapani sector and had a history filled with marauding surprise attacks, bloody revolutions, betrayal, murder and vast internal struggles for power."}, {"tag": "p", "text": "After the Great Sith War, House Mecetti sponsored the Sith-inspired Mecrosa Order, only to be defeated by the Jedi and House Pelagia during the Cleansing of the Nine Houses."}, {"tag": "p", "text": "At the time of the Galactic War, the noble House was sponsering expeditions to recover their heirlooms lost during the Great Sith War."}, {"tag": "p", "text": "During the last years of the Galactic Republic, Count Dooku had close ties with the noble house. During this time, Mecetti's aggressions were held in check by House Pelagia and the Galactic Republic. Despite their setbacks during the Cleansing, House Mecetti was still the most powerful family at the time of the New Order, and would have done anything to retain that power, even if it was harmful to the Tapani sector. During the New Order, Mecetti launched a purge of House Pelagia. However, fear of the Galactic Empire prevented them from attacking the other houses (particularly House Melantha, which was close with Imperial Center), though Mecetti harbored the ambition of annexing the entire sector."}, {"tag": "h2", "text": "Assets"}, {"tag": "p", "text": "All key industries in the Mecetti Province were nationalized in the decade prior to the rise of the Galactic Empire. As a result the house owned stakes in several megacorporations, including controlling stakes in dozens of corporations based in the Core Worlds and the Colonies. The individual families of the house also had large holdings."}, {"tag": "p", "text": "House Mecetti similarly to House Pelagia kept a variety of Sith artifact and holocrons in their vaults. This would be a closely guarded secret of the house, with those who knew of it being forced to take a blood oath not to tell anyone outside the House of the artifacts. Some rumors even say they had the lightsaber of Darth Malgus."}, {"tag": "p", "text": "Starship manufacturing and food production were two of the most important industries in the house, and Mecetti tried to keep them competitive. However by the Rebellion era the command economy began to falter, state-owned businesses had grown top-heavy and less productive and Mecetti had troubled attracting outside investments. The Mecetti Province was largely self-sufficient, as deficiencies in one world could be made up by goods and services imported from another."}, {"tag": "p", "text": "House Mecetti also controlled a vast and centuries-old spynet known as the House Ministry of Inquiry. The spynet had infiltrated most of the other houses and by the time of the Galactic Empire it also had agents within the Imperial Security Bureau and the Ubiqtorate."}, {"tag": "h3", "text": "House Defense Forces (0 BBY to 3.5 ABY)"}, {"tag": "p", "text": "House Mecetti had always maintained a strong house navy and its forces were collectively known as the Mecetti House Guard. During the Rebellion era the Mecetti Guard Navy had 12 capital ships, most of which were Victory II-class Star Destroyers refurbished in the Obulette shipyards and supported by dozens of picket ships, corvettes, assault boats and snubfighters."}, {"tag": "h2", "text": "Politics"}, {"tag": "p", "text": "House Mecetti was the leader of the Mecetti-Reena-Calipsa coalition but had no real allies save those of opportunity. Its chief enemy was always House Pelagia."}, {"tag": "h2", "text": "Notable Members"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}