{"url": "House_Tresario", "categories": ["Category:Legends articles", "Category:Bounty hunter houses"], "nodes": [{"tag": "h1", "text": "House Tresario"}, {"tag": "p", "text": "House Tresario was an organization of bounty hunters founded in 8 BBY by former officers of the Imperial Navy to track down pirates. When they discovered that it was a profitable venture, they officially created a chapter of the Bounty Hunters' Guild, specializing in Imperial bounties on raiders and in bounties exceeding 14,999 credits."}, {"tag": "p", "text": "During the Galactic Civil War, House Tresario was a new bounty hunter chapter, not as influential as others, but still profitable. It retained links with active Imperial officers, and was opposed by privateers affiliated to the Alliance to Restore the Republic. Funding of House Tresario came from Vigo Clezo of Black Sun. House Tresario had a rivalry with House Benelex, another active bounty hunter chapter."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "House Tresario, sometimes known as House Tresario Bounty Hunters Guild, was a corporation of bounty hunters. Tresario employed a number of professional, licensed hunters, accepted Imperial bounty postings, and then paired one of its hunter, or several hunters, with each bounty. It was one of the chapters of the Bounty Hunters' Guild during the Galactic Civil War."}, {"tag": "p", "text": "House Tresario was specifically founded to track space pirates that harassed the Imperial Navy. In time, they modified their activities to accept simply any bounty greater than 15,000 credits, no matter the charges against the fugitive. Even then, House Tresario still specialized in Imperial contracts on raiders. Tresario's hunters operated through all the space controlled by the Galactic Empire, but a 22% of their activities took place either in the Core Worlds or in surrounding areas. The main headquarters of the House were on the planet Baradas II, in the Colonies"}, {"tag": "p", "text": "A prospective member wanting to join House Tresario had to be sponsored by two or more bounty hunters already belonging to House Tresario. A member of the House had to pay 1,000 credits to the House as an annual fee, plus an 8% of the net value of any obtained bounty. In exchange, House Tresario would provide the members with employment and with training in their area of specialization. The so-called Tresario hunter-improvement programs were mocked by House Benelex, a rival bounty hunter chapter, as this training was perceived as useless."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Rovan Tresario, a charismatic aristocrat and officer in the Imperial Navy, was angered at the problem posed by pirates. He retired from the Navy, joined other former Imperial officers who shared his dislike, and together, hired a number of bounty hunters to track a number of pirates whom they personally hated. The pirates were captured, and Tresario and his partners even obtained a profit. They decided to continue with this activity and go after bigger bounties every year. In 8 BBY, House Tresario was officially founded by Rovan Tresario and the other ex-Imperial officers."}, {"tag": "p", "text": "Seven years later, House Tresario was considered a new, expanding House with moderate influence through the Empire. Rovan Tresario was still the CEO of the House. At that time, they used the services of 9,659 non-hunting members for management tasks, plus 1,767 bounty hunters, including former warden Garim Ayrvn. Ayrvn had made a specific deal with House Tresario to obtain help and equipment in exchange for an important share of any bounty he could obtain, instead of paying the usual annual fee and gap. Around that time, House Tresario was mentioned in a report by Commander Scay Danson of Imperial Security Bureau about the Bounty Hunter's Guild and other fringe activities."}, {"tag": "p", "text": "During these years, House Tresario found a rival in another bounty hunter chapter, House Benelex. Corvastan Benelex publicly ridiculed Tresario's training activities and called it a social club. House Tresario in turn disapproved the Inquisitorius and considered that Benelex should not profit from tracking targets of Legal Authorization for Advanced Confinement Documents, an ad hoc legal instrument to convict the enemies of the Inquisition even without charges."}, {"tag": "p", "text": "In 4 ABY, House Tresario was at least partially funded by the Rodian crime lord Clezo, one of the Vigos in the Black Sun criminal organization. Clezo was known to fund other organizations of bounty hunters at that point, as well as being involved in many criminal activities"}, {"tag": "p", "text": "Having been founded by Imperial officers, House Tresario retained important links to the Imperial Navy, and hunted pirates for the benefit of the Empire. During the Galactic Civil War, the anti-Imperial Alliance to Restore the Republic used the services of pirates as privateers, and these buccaneers became natural enemies of the Imperial bounty hunters. Considering that House Tresario was specialized in working for the Empire, not infrequently against Alliance members, Tresario was added to the list of legitimate target for Alliance privateers, the Alliance Target List. However, only the best among the Alliance privateers were courageous enough to attack starships and assets of a bounty hunter house."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "House Tresario was first mentioned in Galaxy Guide 10: Bounty Hunters (1994), a role-playing guide written by Rick D. Stuart. Information on it was expanded in further role-playing guides, including Shadows of the Empire Sourcebook (1996) and Pirates & Privateers (1997). It was mentioned in passing in the article Underworld: A Galaxy of Scum and Villainy (2006)."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}