{"url": "House_Ulgo", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:House Ulgo"], "nodes": [{"tag": "h1", "text": "House Ulgo"}, {"tag": "p", "text": "House Ulgo, claimed by its supporters to be the new Royal House, was an Alderaanian noble family with a long history of military excellence that existed by the time of the Cold War. Family values, discipline and duty were considered traits that the Ulgos prided themselves with, forsaking the pampered, aristocratic lifestyles of the other noble houses of Alderaan. Ulgo tradition also required that every member serve in the military, which had produced generations of distinguished officers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "On Alderaan"}, {"tag": "p", "text": "During the Cold War era, the Ulgos became increasingly frustrated by the political stalemate that had befallen Alderaan's parliament. This was created following the death of Queen Silara Panteer and Gaul Panteer (the latter was killed on House Ulgo's orders) and the return of House of Thul from exile where it was being supported by the reconstituted Sith Empire. In this time, General Bouris Ulgo pleaded with the nobles to remove the Thul's from Alderaan but the fracturing of the houses saw them failing in stopping the second Imperial invasion."}, {"tag": "p", "text": "As a result of these events, Bouris Ulgo declared himself king and made open war against House Thul. However, this act of seizing the crown forced the hands of the other houses who in turn declared their own war against Ulgo. These chain of events had led to House Ulgo being left in the predicament of being beset on all fronts as it struggled to defend the crown whilst attempting to brutally enforce order on Alderaan no matter the cost in blood or resources."}, {"tag": "p", "text": "Trask Ulgo, an ensign in the Republic Navy during the Jedi Civil War, was a member of House Ulgo, who was killed in battle with the Sith Lord Darth Bandon. Three centuries after his death, he was revered as a martyr for the Republic by Alderaanians, including his descendant Bouris Ulgo."}, {"tag": "p", "text": "During the Alderaan Civil War, Bouris Ulgo attempted to rally the scattered houses into expelling the once exiled House Thul, who had returned with backing from the resurgent Sith Empire. However, as the Alderaanian houses were too fractured to realize what Ulgo foresaw as a second Imperial invasion, he usurped the throne from House Panteer, only to turn all the houses, excluding House Rist, against him. Ulgo was eventually removed from the throne by agents of House Panteer but the rest of his house wouldn't falter."}, {"tag": "p", "text": "Nonetheless, House Ulgo participated in a secret peace summit with the other noble houses. The summit nearly collapsed due to sabotage from Jedi Master Sidonie Garen, who was afflicted with a madness plague, trying to set the houses against each other, before the Barsen'thor was able to cure her. The Barsen'thor then had the summit agree to a truce and to reconvene at a later date. To the disappointment of House Teral, there was no talk of removing House Ulgo's land and armies."}, {"tag": "h3", "text": "On Taris"}, {"tag": "p", "text": "The Ulgo family appears to have also had connections to the Outer Rim world of Taris; they were known there as a merchant family with many enemies. The assassin Selven was hired by an unknown party, believed by some individuals to be the rival House of Organa, to eliminate them. Within a standard month, the Ulgo family had been entirely removed from Taris by Selven, gaining her a bounty posting from the Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}