{"url": "Ambush_of_the_bacta_tankers", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Bacta War", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Ambush of the bacta tankers"}, {"tag": "p", "text": "In 7 ABY, during the Bacta War, Rogue Squadron ambushed a Xucphra Corporation bacta convoy under Captain Ait Convarion in a star system with a red dwarf and a dust disk."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the hijacking of several Xucphra Corporation Bacta Tankers by Rogue Squadron, Thyferran Minister of Trade Fliry Vorru suggested, and Xucphra Chief Operating Officer Ysanne Isard agreed, to suspend direct shipment of bacta and to implement a convoy system under which the Bacta Tankers would be escorted to centralized locations to by collected by client worlds. To avoid the difficult task of striking against the escorted convoys, Rogue Squadron's Zaltin allies initiated an operation separate the tankers from their escort. The Ashern sliced new code into the navicomputers of three Bacta Tankers which were part of a small convoy escorted by the Victory II-class Star Destroyer Corrupter. The sliced codes produced a course deviation in the final leg of their trip to the Rish system and the three ships were met by Rogue Squadron in a star system."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Although Rogue Leader Wedge Antilles convinced the captains of the Bacta Tankers Xucphra Meander and Xucphra Rose to surrender, the third tanker, the Xucphra Alazhi resisted and tried to stop the Meander's defection. Antilles ordered Rogue Squadron pilots Gavin Darklighter and Riv Shiel to disarm the ship, and after losing its turbolaser armament, the Xucphra Alazhi surrendered. Meanwhile, while waiting at the previous transit point, the Corrupter had tracked the exit vectors of all the ships in his convoy. The discovery that three ships had deviated from the planned course prompted Commander Ait Convarion to follow them."}, {"tag": "p", "text": "The Corrupter's entry vector into the system was the same as that of the three tankers, and the exit vector of the Xucphra Alazhi as it prepared to jump to hyperspace. When the Star Destroyer reverted to realspace, it immediately opened fire, destroying the tanker, two of the Twi'lek Chir'daki starfighters and one X-wing, killing Shiel and forcing Darklighter to jump blindly out of the system. Having completed their mission, the surviving X-wing and Chir'daki starfighters jumped to hyperspace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}