{"url": "Ambush_on_Hashim", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Zaarin insurrection"], "nodes": [{"tag": "h1", "text": "Ambush on Hashim"}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After his betrayal of the Galactic Empire and failed coup de'tat against Emperor Palpatine in 3 ABY, the treacherous Grand Admiral Demetrius Zaarin continued to wage war against the Empire through an extensive campaign aimed at stripping the Empire of its technological advantage on the battlefield. After successfully, although costly, destroying the TIE Advanced factories, he set his sights on his Research station where he developed the TIE Defender. After failing to take the platform, twice, he took it upon himself to destroy the platform."}, {"tag": "p", "text": "However, Loyalist Imperial forces lead by Maarek Stele, held of his attacks until the TIE Defender prototypes Proto 11 and 12 were on board a BFF-1 bulk freighter Mharsup and the personnel, which included the Chief scientist of the project, onto a Lambda-class T-4a shuttle G'nabgib. The two ships then arrived Buoy B-F09 to transfer the fighters to Modified corvette group Hashim. Despite Rebel interference, all 3 Defenders were put in a corvette each and left the area. They soon came out of Hyperspace near bouy CRM-114, to find themselves trapped in a Ion mine field laid by Rneekii pirates and were unable to escape on their own, as they were they were outnumbered by multiple R-41 Starchasers and a Strike-class medium cruiser Intombe. They called for reinforcements but feared that they may not arrive in time."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "First phase"}, {"tag": "p", "text": "Maarek Stele in his TIE Defender was launched to defend the ships. But as soon as he was launched, one of the pirate transports from group Ibutho, Ibutho 1 had already docked with the G'nabgib and left taking the Chief scientist with them. Stele focused his attention against the other transports as the threat of being captured could at least be thwarted, all the while dogfighting and dodging R-41 Starchaser squadrons, Dhlovo, Eshowe, Gingin, Hlobane and Khambula Squadron, soon into the battle Assault Gunboats arrived and assisted Stele in eliminating the starfighters and Ion Mines as the Strike Cruiser Intombe soon departed from the battle."}, {"tag": "p", "text": "Although the Pirates were driven of, the corvettes were stranded until help arrives. Also the Chief scientist along with the data were now in the Rneekiii's possession. While it would be possible for the pirates to create a TIE Defender out of the data and the scientist, it would still take time. Time that could be used to develop a \"crash program\". The prototypes were still safe from falling into rogue arms, for now."}, {"tag": "h3", "text": "Second phase"}, {"tag": "p", "text": "Calling for reinforcements, 3 Cargo Ferries Mssan were brought in to repair the corvettes and transfer the TIE Defenders to each one, with Maarek Stele ordered to dock with Masan 3. However two of them arrived 24 Klicks away and a Rebel starfighter strike force, consisting of 2 A-wings, Azul Squadron, 2 B-wings, Blue Squadron and 4 X-wings, Red Squadron had just arrived, at a relatively long distance of about 20 Klicks but were still a danger to the ships."}, {"tag": "p", "text": "Maarek Stele, was sent in his TIE Defender, again, to intercept the attacking ships. Mssan 3 with two other Assault Gunboats arrived to assist in the attack. However, another pirate force, known as the Nami, arrived in the form of YT-1300 freighter Dhoora escorted by two Y-wings from Boegis Squadron and two T-wings from Talon Squadron arrived very close to the corvettes and disabled them. Dhoora proceeded to dock with Hashim 1 and programmed the ship to jump into hyperspace with them. Stele tried to intervene, but only managed to shoot down at least one of the starfighters before the rest escaped."}, {"tag": "p", "text": "To make matters even more complicated TIE Defenders under the command of Zaarin arrived to engage Maarek Stele and the Gunboats. Stele managed to destroy all 12 Defenders, while the Cargo ferries arrived to receive the other prototype and Maarek Stele's TIE Defender. Stele was on his way to the Cargo ferries when the Rneekii Pirates once again arrived in a Mon Calamari light cruiser Sumpntodo launching, one by one, Z-95 Headhunters Adam Squadron. Stele engaged the Rneekii Pirates and after destroying some of the fighters, Mssan 2 boarded with Hashim 2, picked up the prototype and jumped into Hyperspace to rendezvous with Admiral Thrawn. Stele was encouraged to do the same and entered Masan 3 to rendezvous with Thrawn."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The two TIE Defenders arrived to Thrawn's Star-Destroyer safely and Thrawn ordered the ship to return to Coruscant, therefore allowing the Empire the possibility to manufacture TIE Defenders. However, the situation was still looking very precarious for the Empire, as two pirate factions had important components needed to make their own independent TIE Defenders, the Rneekii had the Chief scientist and the data needed to construct one, and the Nami had the other prototype. To combat this, Thrawn began designs for a new starfighter to combat this unpredictable threat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle appears in Star Wars: TIE Fighter, in the expansion Defender of the Empire in Battle 9, Combats 5 and 6. This article assumes completion of all \"Primary\", \"Secondary\" and \"Bonus\" objectives completed in the game."}, {"tag": "p", "text": "It is possible to destroy the Dhoora before it docks, thereby preventing the capture. However, doing so will result in Zaarin's TIE Defenders and the Rneekii pirate cruiser not turning up, making completion of \"Secondary\" and \"Bonus\" objectives impossible. The player can still complete \"Primary\" mission objectives and return with \"mission success\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}