{"url": "Household_Phalanx", "categories": ["Category:Legends articles", "Category:Chiss military units", "Category:Empire of the Hand military units"], "nodes": [{"tag": "h1", "text": "Household Phalanx"}, {"tag": "p", "text": "A Household Phalanx (or sometimes House Phalanx) was a type of military or paramilitary unit among the Chiss, possibly the private warrior retinue of a leading public figure. The only such unit of which any clear detail is known was that loyal to Syndic Mitth'raw'nuruodo, better known to the galaxy at large as the Imperial Grand Admiral Thrawn."}, {"tag": "p", "text": "It appears that Thrawn's Household Phalanx was loyal to him in his capacity as a Syndic of the Eighth Ruling Family, and accordingly wore the burgundy colors of the Family; but it is unclear exactly what such loyalty meant in the wider context of Chiss society, given that Thrawn had been exiled from Chiss space. The Household Phalanx was, in the words of one of its officers, a \"rogue phalanx\" in that it appears to have been formed around a core of Chiss warriors who shared Thrawn's ideals and were prepared to joined him in his crusade beyond the frontiers of the Chiss Ascendancy, acting independently of the Expansionary Defense Fleet and the Chiss political leadership—although for at least part of its existence, it operated under the aegis of the Empire of the Hand."}, {"tag": "p", "text": "Although a study prepared by the University of Sanbra in the final years of the New Republic described Thrawn's House Phalanx as a \"portion of the CEDF,\" this seems to be a self-consciously euphemistic reference to the number of Chiss military personnel who had left their posts to join it, perhaps compounded by a lack of certainty on the author's part as to the true status of the phalanx. The scant available evidence suggests that a unit wearing the House colors of a Ruling Family should be operationally distinct from the black-clad troops of the CEDF, and the Sanbra study dryly notes that the personnel in the House Phalanx had \"taken an extended leave\" to deal with threats outside the borders of the Ascendancy, action that would have been regarded as \"treason\" and \"secession\" had the Ascendancy's leadership been capable of publicly admitting that it was occurring."}, {"tag": "h2", "text": "Operational history"}, {"tag": "p", "text": "In 19 ABY, the Household Phalanx was under the leadership of the Chiss Commander Kres'ten'tarthi, who answered in turn to Imperial General Baron Soontir Fel, and its scout pilots were probing Imperial and New Republic space, using powerful long-range ships which combined elements of the TIE/LN starfighter design with alien technology. Lured into following these ships, Mara Jade and Luke Skywalker discovered the command post known as the Hand of Thrawn on Nirauan, where the Household Phalanx was represented by an impressive starfighter force of a hundred scouts, and a garrison of Chiss warriors wearing red jumpsuits with Imperial rank insignia."}, {"tag": "p", "text": "In spite of damage done by the Jedi, and a subsequent pirate attack, House Phalanx forces were apparently still headquartered at Nirauan three years later, by which time they were explicitly claiming to represent the Empire of the Hand. It is not beyond possibility that the Clawcraft unit led by Commander Chak Fel was one of the Phalanx's component units at this time."}, {"tag": "p", "text": "Household Phalanx forces were next encountered by the galaxy at large during the Yuuzhan Vong invasion: in 26 ABY, Colonel Jagged Fel, the Baron's son, deployed with three squadrons of Clawcraft alongside Imperial forces at the battles of Garqi and Ithor. Although Jag subsequently sent one of his squadrons to report back to his father, the others remained to resist the Yuuzhan Vong in cooperation with the New Republic, and part of the force was still fighting alongside Rogue Squadron at least as late as the Battle of Kalarba."}, {"tag": "p", "text": "Nevertheless, Colonel Fel's two remaining squadrons were eventually recalled, while his father seems to have busied himself founding a number of remote bases in the anticipation of a guerrilla war against the Yuuzhan Vong. By 28 ABY, Jag had been removed from his command position, but he and his wing guard were sent back to scout former New Republic space following the fall of Coruscant. On Hapes, he defied his orders and raised a bush-pilot snubfighter force, Vanguard Squadron, but within a few months, he was once again in command of a full Clawcraft squadron, sometimes referred to as \"Chiss Squadron.\""}, {"tag": "p", "text": "At the same time, mysterious political maneuvers seem to have been occurring in the Unknown Regions. The precise fate of the Empire of the Hand and the Household Phalanx is unknown, but by 29 ABY, Baron Fel was apparently Assistant Syndic of the CEDF, and in 30 ABY, Colonel Fel was appointed as the Chiss Ascendancy's Ambassador to the Galactic Alliance. The Household Phalanx was not apparently heard of again after the conclusion of the war."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Most of the Household Phalanx personnel encountered by outsiders have been crack fighter pilots flying Chiss hybrid variants of the Empire's TIE Series starfighters, and operating from hidden fortresses on remote worlds. It is known that the composition of the force was almost entirely Chiss, and that squadron commanders were chosen by the pilots they led, although they could also be reassigned by superior officers. Overall numbers of personnel are unknown; at least a hundred scouts were based at Nirauan in 19 ABY, and 36 Clawcraft deployed at Garqi and Ithor seven years later, but the full total may have been much, much larger. Training facilities and combat bases were scattered in remote locations around the galaxy, and it appears that, although some recruitment took place among the children of serving personnel, the ranks of the Phalanx were swelled by volunteers and defectors drawn directly from the Ascendancy."}, {"tag": "p", "text": "One of the most unusual such recruits was Jagged Fel. For political reasons, he was enrolled in a military academy operated by the line military of the Ascendancy, and subsequently commissioned into a Colonial Phalanx guarding one of the Chiss colony worlds. But, with his Chiss wing guard Shawnkyr Nuruodo, he joined the House Phalanx, probably by defection, and in approximately 24 ABY, he was chosen as commander of a starfighter squadron by his Chiss comrades. By 26 ABY, as noted above, he was a colonel with several squadrons under his command—the Phalanx seems to have preserved the Imperial system in which colonels commanded larger formations than single squadrons."}, {"tag": "p", "text": "It is unknown what happened to the Household Phalanx subsequent to the confusing political events of 29 ABY, but both Baron Fel and his son later appeared as senior officers of the CEDF, and the House Phalanx's distinctive burgundy uniforms and Clawcraft subsequently appeared in association with Chiss warriors claiming to be soldiers of the CEDF."}, {"tag": "p", "text": "Lastly, it should be mentioned that the House Phalanx pilots who accompanied Colonel Fel to the grand reception for the allied forces before the Battle of Ithor wore white uniforms, rather than burgundy—a color that was perhaps more appropriate for troops assigned to an Admiral of the Defense Hierarchy than a unit associated with one of the a Ruling Families."}, {"tag": "h2", "text": "Other Household Phalanxes"}, {"tag": "p", "text": "As already noted, Thrawn's Phalanx operated independently of the Chiss Ascendancy, and it may have been unique and anomalous in many ways: there is only a small quantity of evidence to suggest the existence of comparable military units within Chiss borders. In 28 ABY, Baron Fel described Ganet as the Phalanx Commander of a rival Syndic, and it is likely that he was indicating that she commanded a Household Phalanx. However, given that she wore a black jumpsuit, and claimed to speak and act for the CEDF, it is hard to know what her real status was."}, {"tag": "p", "text": "It is not known for certain whether there was any connection between House Phalanxes and the Colonial Phalanxes which were the militias of the twenty-eight Chiss colony worlds, although such a link cannot be ruled out. A New Republic source claimed that Colonial Phalanxes typically fell under the authority of Syndics answerable to House leaders, and we can also note that between at least 27 BBY and 22 ABY, combat-capable cruisers of the Fifth Ruling Family were typically crewed by personnel clad in the yellow colors of the Family. These warriors may have represented a Phalanx or Phalanxes serving the Chaf Family or its senior members, and they appear to have been tasked with defending some form of Family presence in the volumes of space that contained the Chiss colony words."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}