{"url": "2-1B-series_medical_droid", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:2-1B surgical droids", "Category:Imperial droids", "Category:Medical droid models"], "nodes": [{"tag": "h1", "text": "2-1B-series medical droid"}, {"tag": "p", "text": "2-1B-series medical droids, also known as 2-1B surgical droids, were a model of medical droids that was common throughout the galaxy during the Clone Wars and Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Humanoid in appearance, all 2-1B series droids were equipped with encyclopedic memory banks. Their memory banks and modular limbs helped ensure that the droids gave the best course of medical treatment in any given medical situation. The droids also had stabilizing feet, hydraulic legs, vocabulators, hydraulics covered by a transparent shell, and some even had hypodermic injectors."}, {"tag": "p", "text": "2-1B droids boasted remarkable joint articulation coupled with their precision-crafted servogrip pincers, which could be replaced with multiple attachments to suit various requirements. The droids could be upgraded to specialize in neurosurgery, alien biology, cybernetic limb replacement, pediatrics, and podiatry."}, {"tag": "p", "text": "Though they were designed to treat humans, they were able to treat the diseases and injuries of millions of different species using stored data. They often worked alongside FX-7 medical droids. Due to the need to care for patients, 2-1B droids spoke numerous languages."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic Era"}, {"tag": "p", "text": "2-1B droids were popular since the Republic Era. The droid TB-2 was a 2-1B droid stationed on the G9 Rigger-class light freighter Twilight during the Clone Wars. He was originally a hologram, but was eventually uploaded into a body and stationed on the Venator-class Star Destroyer Resolute."}, {"tag": "p", "text": "Other notable 2-1Bs were used on worlds such as Naboo, Alderaan, and Coruscant. One droid became a bartender working at Chalmun's Spaceport Cantina on Tatooine. Other notable droids were also stationed on the Resolute and the Kaliida Shoals Medical Center."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "During the Imperial Era, The Galactic Empire used millions of 2-1B droids throughout its territory. One such unit later broke free and came to be known as 2-1B Delta."}, {"tag": "p", "text": "The 2-1B droid G2-1B7 served the Partisans during the early rebellion against the Empire. G2-1B7 kept the Partisans' leader, Saw Gerrera, alive due to his ailing health."}, {"tag": "p", "text": "2-1B was another notable surgical droid. He served the Alliance to Restore the Republic, and operated on the Alliance Commander Luke Skywalker. The droid treated Skywalker with bacta after he was attacked by a Wampa, and was later personally requested by Skywalker to treat him again after Skywalker lost his hand to Darth Vader. He would go on to be a member of the crew of the Home One during the Battle of Endor. Another 2-1B droid served at Jabba's Palace. However, after he fell out of favor with Jabba he was tortured by the taskmaster droid EV-9D9 until both of his arms were ripped out of their sockets."}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "During the New Republic Era, the 2-1B droid 2MED2 served the Resistance during the Cold War and was assigned to help a team of Resistance fighters transport the First Order RA-7 protocol droid O-MR1, who was believed to know the location of Admiral Gial Ackbar, who had been captured by the First Order. On the way back to the Resistance base, the team's ship crashed on an unknown planet and the only survivors were 2MED2, O-MR1, the protocol droid C-3PO, the construction droid CO-34, and the two security droids PZ-99 and VL-44. The group of droids worked together to get home, but along the way every droid except C-3PO and O-MR1 were destroyed by creatures native to the planet. 2MED2 was destroyed in an attack from a can-cell."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 2-1B surgical droid first appeared in the 1980 original trilogy film Star Wars: Episode V The Empire Strikes Back, directed by Irvin Kershner. They were first identified in canon in the 2015 reference book Ultimate Star Wars, which was written by Ryder Windham, Tricia Barr, Adam Bray, and Daniel Wallace. In Star Wars Legends, they first appeared in the novelisation of Empire Strikes Back by Donald F. Glut, which was released prior to the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}