{"url": "How_to_Speak_Droid_with_R2-D2:_A_Communication_Manual", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:Legends reference books"], "nodes": [{"tag": "h1", "text": "How to Speak Droid with R2-D2: A Communication Manual"}, {"tag": "p", "text": "How to Speak Droid with R2-D2: A Communication Manual is a children's book published by Chronicle Books on August 20, 2013. It explains how to translate and speak with astromech droids in various situations."}, {"tag": "p", "text": "It is the follow-up to 2011's How to Speak Wookiee: A Manual for Intergalactic Communication."}, {"tag": "p", "text": "Inside the front cover of the book, there is a key to all the letters of Aurebesh as well as an introduction which discusses how R2-D2 works"}, {"tag": "h2", "text": "The Pages"}, {"tag": "p", "text": "The book contains a speaker shaped like R2-D2 with 10 buttons which each correspond to a page of the book minus the intro. Each page gives many different translations for a certain scenario."}, {"tag": "p", "text": "There are 10 pages each containing a recording of a translation (via the corresponding button) as well as two other written \"also helpful\" translations"}, {"tag": "p", "text": "The 10 pages are, in order, The Messenger, The Server, The Office Tech, The At-Home Helper, The Mechanic, The Dog Walker, Spy Droid, Special Forces Droid, The Prankster, and Road Trip Buddy."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Following the success of How to Speak Wookiee comes this essential manual for interacting with droid units in various situations. Droids are made to be reliable, helpful, and daring, but they can be frustratingly stubborn. This convenient sound guide will help new droid users bypass that malfunction and utilize them to their full capacity. Featuring helpful scenarios—like convincing a droid to play back full messages, serve beverages and hors d'oeuvres at events, diagnose and repair mechanical issues on an X-wing, or just walk the dog—plus a sound module of 10 different droid phrases demonstrated by R2-D2, this handbook is a necessity for any new droid user."}, {"tag": "h2", "text": "Examples"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}