{"url": "Ambush_on_Tatooine_(Jedi_Civil_War)", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Articles with conjectural titles", "Category:Battles of the Jedi Civil War", "Category:Battles of Tatooine", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Ambush on Tatooine  (Jedi Civil War)"}, {"tag": "p", "text": "The Ambush on Tatooine was a confrontation that took place between the former Dark Lord of the Sith and redeemed Jedi Padawan Revan and the bounty hunter Calo Nord. The ambush took place in the final year of the Jedi Civil War, outside of the Rakatan ruins in the Eastern Dune Sea of the desert planet Tatooine. The ambush resulted in Nord and his henchmen's deaths."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3956 BBY, the final year of the Jedi Civil War, the former Dark Lord of the Sith and amnesiac Republic soldier Revan assisted in the Jedi Bastila Shan's escape from the destruction of the ecumenopolis Taris. The bounty hunter Calo Nord, who attempted to halt Revan, Shan, and their companions' escape, managed to flee Taris and had a private audience with the Sith Lord Darth Malak, the reigning Dark Lord. Nord informed Malak and the Sith Admiral Saul Karath of Shan's escape with Revan and the Republic commander Carth Onasi's assistance. Karath and Malak hired Nord to locate and capture Shan, and kill her companions. Nord also revealed to Malak that Revan was still alive."}, {"tag": "p", "text": "After traveling to the planet Dantooine, Revan was retrained as a Padawan by the local Jedi Council. After Revan completed his training, he was tasked by the Council to find an ancient Rakatan space station called the Star Forge, which was under Darth Malak's control. Revan located a second Rakatan Star Map in a krayt dragon's cave in the Eastern Dune Sea on the desert world Tatooine. After Revan examined the Star Map, Nord, along with two Rodian and two Aqualish henchmen, ambushed Revan and his companions."}, {"tag": "h2", "text": "The ambush"}, {"tag": "p", "text": "Nord gave Revan credit for evading him; however, Nord stated that no one could escape him in the end. When Revan asked Nord if they could work out a deal so as to avoid fighting, Nord told him that he was not in it for the credits; rather, he had a reputation to protect. Nord and his henchmen attacked Revan and his companions, but were ultimately defeated by the former Sith Lord and his allies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ambush on Tatooine first appeared in the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic, developed by BioWare. Should Canderous Ordo accompany Revan when Nord confronts the Jedi, Ordo will make note of the fact that Nord brought backup, and taunt the bounty hunter."}, {"tag": "p", "text": "The planet on which Revan battles Nord is determined by the order in which the second of the five Star Maps that lead to the Star Forge's location is obtained. Nord could confront Revan on Tatooine, the Wookiee homeworld Kashyyyk, the Selkath homeworld Manaan, or the Sith tombworld Korriban. On Kashyyyk, Nord is accompanied by Wookiees loyal to the chieftan Chuundar. In the Hrakert Station on Manaan, Nord is flanked by two Twi'leks, and on Korriban, Nord is backed up by two Sith students from Korriban's Sith Academy. Should Revan have encountered Nord in the Hrakert Station on Manaan, Nord explains to Revan how he managed to reach the underwater station."}, {"tag": "p", "text": "Also, the area in which the player encounters Nord determines what items are recovered from his remains. For example, the player will receive Nord's Mandalorian heavy blasters if he is killed on Tatooine, but they won't be on his body if he is killed on Kashyyyk."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}