{"url": "Ambush_on_Trogan", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Jospro sector", "Category:Battles of the Thrawn campaign"], "nodes": [{"tag": "h1", "text": "Ambush on Trogan"}, {"tag": "p", "text": "The Ambush on Trogan was an Imperial attack against a meeting of some of smuggler leaders during the Thrawn campaign that had for consequence the formation of the Smugglers' Alliance ."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After an accidental meeting with his fellow smuggler Samuel Tomas Gillespee in the Chazwa system, Talon Karrde set a meeting of the top smugglers on the planet Trogan. Karrde would like to convince the other smugglers to help the New Republic in finding where Thrawn's clones were been bred."}, {"tag": "h2", "text": "The meeting"}, {"tag": "p", "text": "The meeting in Whistler's Whirlpool Tapcafe, which was attended by Brasck, Par'tah, Ellor, Dravis, Mazzic, Lishma, Gillespee, Niles Ferrier and others. Despite all his efforts, Talon Karrde didn't manage to convince the others. Most of them wanted to stay neutral in the war and continue to do business with the two sides."}, {"tag": "h2", "text": "The Battle"}, {"tag": "p", "text": "Grand Admiral Thrawn was aware of the meeting but decided not to intervene, thinking that an Imperial intervention could turn the smugglers against him. He ordered the commander of the local garrison, Lieutenant Kosk, not to attack them. But Niles Ferrier, who was trying to impress the Grand Admiral by capturing Karrde and Gillespee, convinced the lieutenant to attack the meeting."}, {"tag": "p", "text": "Kosk and his forces were slaughtered after a brief firefight with the adept smugglers and mercenaries, killing the Gotal Lishma in the process."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Imperial ambush inspired all the smugglers to agree with Talon Karrde. They decided to meet another time, on Hijarna, where the Smugglers' Alliance was eventually formed."}, {"tag": "p", "text": "Mazzic and Ellor decided that the Empire needed to learn a lesson and raided the Bilbringi Shipyards to avenge the death of Lishma. This raid resulted in the destruction of a nearly complete Star Destroyer."}, {"tag": "p", "text": "Upon learning of the attack, despite instructions that the participants in the smugglers meeting be left alone, Grand Admiral Thrawn was furious. Thrawn had Ferrier brought on board the Chimaera, and nearly had the ship thief executed for his role in the attack."}, {"tag": "p", "text": "Thrawn tried to convince the smugglers that he wasn't responsible for the attack, and had tried to frame Karrde as having organized the attack. He was unsuccessful as Niles Ferrier bungled the framing of Karrde, which led to the other smugglers discovering that Ferrier was Thrawn's agent and had organized the ambush."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}