{"url": "Hoxim", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Arboreal planets", "Category:Grysk Hegemony planets", "Category:Mining planets", "Category:Unknown Regions planets"], "nodes": [{"tag": "h1", "text": "Hoxim"}, {"tag": "p", "text": "Hoxim, often referred to as the \"Agbui mining world,\" was an unclaimed and uninhabited planet in the Unknown Regions. Its terrain consisted of forests and grasslands as well as rugged mountains and small swaths of desert, but it had extremely acidic soil."}, {"tag": "p", "text": "As part of a plan to orchestrate the demise of the Chiss Ascendancy, Haplif of the Agbui led three Chiss Great Families to believe that the Agbui possessed an otherwise unowned mining settlement on Hoxim that mined nyix, a valuable metal used to fortify the hulls of warships, and that the Agbui were ignorant of the metal's value. Haplif, acting naïve, portrayed Hoxim as sufficiently rich in nyix that the Agbui could mass-produce jewelry out of the metal and sell it for a fraction of the metal's worth within the Ascendancy. (In reality, Haplif had looted the nyix jewelry from a species among whom he had orchestrated a civil war so the Agbui could mine their world for nyix.)"}, {"tag": "p", "text": "Over time, Haplif described the supposed riches of Hoxim to officials in terms that suggested vast profitability on their part and foolish ignorance of the value on his own. He also flooded the market of Celwis with underpriced nyix jewelry as part of his deception, convincing Councilor Xodlak'uvi'vil that his family would be foolish not to seize Hoxim's nyix mines. Haplif thus tantalized ambitious Xodlak, Pommrio, and Erighal family officials to conspire to claim Hoxim and its mine for their families, in the hope that the families would fight over the mine and the conflict would lead to a civil war within the Ascendancy."}, {"tag": "p", "text": "Ultimately, Senior Captain Thrawn of the Chiss Ascendancy deduced the purpose of Haplif's plot, and, as the fleets of the three families encountered one another above Hoxim, destroyed the mine with the appearance that it was accidental, preventing the families from being able to fight over it. He also set the stage for the three families to achieve glory and honor by \"rescuing\" his debilitated Springhawk from an ambush."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Hoxim was a terrestrial world with many forests and grasslands, rivers and lakes, mountain ranges and even some deserts. The atmosphere was breathable to at least the Chiss and Agbui species. Various woodland creatures lived in the forests of Hoxim. The soil of Hoxim was too acidic to support plants edible to Chiss."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 18 BBY, members of the Agbui species had set up a purported mining settlement on Hoxim, where they claimed to be mining the planet for its rich supplies of nyix and other precious metals."}, {"tag": "p", "text": "After living on the economically important but politically irrelevant Chiss Ascendancy world of Celwis for several months, Haplif tantalized Xodlak family Councilor Xodlak'uvi'vil to send his Senior Aide Lakjip to scout the mines on Hoxim to appraise their value. Lakjip visited Hoxim's mining settlement, where several Agbui workers allowed her to see the exterior of the facilities, but did not permit her to enter the putative mines and refining complex. However, they presented her with enough nyix that she believed the world to be rich with the precious metal. Upon her return to Celwis, Lakjip and Councillor Lakuviv plotted to seize Hoxim world for the Xodlak family, thereby increasing their family's standing and their own careers. Similarly, other agents of the mysterious faction seeking to destroy the Chiss Ascendancy seduced Pommrio family officials on Sarvchi and Erighal family officials on Copero to declare family emergencies to summon their Defense Fleet service-members and attempt to seize Hoxim."}, {"tag": "p", "text": "The fleets of the Xodlak, Pommrio, and Erighal families met in the space above Hoxim, with each fleet's commanding officer staking a claim to the world below and its precious mining resources. The three family fleets nearly engaged in hostilities against one-another until they saw Senior Captain Mitth'raw'nuruodo's Springhawk derelict and supposedly under attack by hostile forces. The Xodlak, Erighal, and Pommrio forces neutralized the 'hostile' forces and brought glory upon their families."}, {"tag": "p", "text": "In reality, the \"attacking\" forces were remotely piloted gunboats Thrawn had captured from Watith forces led by Captain Fsir, being operated from the Watith shuttle attached to the Springhawk. Thrawn instructed Xodlak, Erighal, and Pommrio family members under his command to operate the drone gunboats, as members of each family were most familiar with the strengths and weaknesses of the starships of their respective family fleets. This allowed Xodlak operators to target Xodlak cruisers with maximum force but minimum damage, thereby making a convincing display of hostility that was nevertheless non-damaging; and likewise for the Erighal and Pommrio family members."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}