{"url": "Hoxie", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Ankura Gungans", "Category:Males", "Category:Mayors"], "nodes": [{"tag": "h1", "text": "Hoxie"}, {"tag": "p", "text": "Hoxie was a male Ankura Gungan who was the boss of the city of Otoh Raban on the planet Naboo in the year 3000 BBY. During a period of war at that time between the Gungan tribes, Hoxie was kidnapped by the warlord Boss Rogoe to keep Otoh Raban in the war, leaving the city leaderless. Eventually, Gallo, a Gungan boss who was uniting the tribes against Rogoe, heard about Hoxie's kidnapping from a villager living in Otoh Raban. In order to gain the city's allegiance, Gallo rescued Hoxie from the prison camp, and Otoh Raban contributed more troops to Gallo's Grand Army."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hoxie was a male Ankura Gungan who served as the Boss of the city of Otoh Raban on the planet Naboo in 3000 BBY. At that time, the Gungan tribes were at war with each other, which eventually resulted in Hoxie being kidnapped and placed in a prison camp by the warlord Rogoe, who was controlling the war and wished for it to continue. For some time, Otoh Raban was left without a leader, and its inhabitants were forced to keep training soldiers to defend themselves from the other tribes. However, Gallo, another Boss who was attempting to unite the Gungans against Rogoe, heard about Hoxie's kidnapping from a villager living in Otoh Raban, and agreed to rescue him. After his ally Marsune told him of rumors of the prison camp where Hoxie was being kept, Gallo led his small army into the stronghold and attempted to rescue Hoxie. When they found him the Boss thanked Gallo for saving him, and told him Otoh Raban would join his crusade if he was rescued. Gallo's forces destroyed the prison camp and freed Hoxie, then proceeded to take him back to Otoh Raban. Upon returning him to the city, Hoxie pledged his allegiance to Gallo, and contributed four repeater militiagungs, Gungans who fired repeating boomas, to Gallo's army."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hoxie served as the boss of Otoh Raban, and when he was kidnapped by Rogoe, his city refused to stop fighting the other Gungan tribes until he was rescued. Hoxie was very thankful when Gallo rescued him, and agreed to join Gallo's cause to defeat Boss Rogoe to show his gratitude. Hoxie was also a green-skinned Ankura Gungan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Boss Hoxie appears in the 2001 PC game Star Wars: Galactic Battlegrounds and its 2002 expansion, Clone Campaigns Prior to the games release, Hoxie was mentioned in its strategy guide Hoxie appears in the second level of the Gungan campaign, \"The Gungan who would be Boss,\" in which the player has to rescue him to complete the level. The image used for Hoxie in the game is the same as the other Gungan bosses that appear. Hoxie's voice actor was uncredited in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}