{"url": "Ambush_on_an_Imperial_construction_module", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Battles of the Galactic Civil War", "Category:Battles of Geonosis", "Category:Missions of the Ghost"], "nodes": [{"tag": "h1", "text": "Ambush on an Imperial construction module"}, {"tag": "p", "text": "In 3 BBY, the crew of the Ghost was ambushed by the Galactic Empire in an Imperial construction module that orbited Geonosis. The rebels boarded the construction module while investigation intelligence reports from the rebellion that the Empire had been constructing something over Geonosis. Unknown to the rebels, this was the Death Star, an armored battle station capable of destroying entire planets, which had already been moved. When the rebels boarded one of the construction modules, they were quickly attacked by Agent Kallus of the Imperial Security Bureau and several stormtroopers. The rebels fought their way back to the Ghost, but one of the rebels, Garazeb Orrelios, remained locked in single combat with Agent Kallus. The Ghost departed while Orrelios headed for an escape pod, but he was followed by Kallus, who also boarded the departing pod."}, {"tag": "p", "text": "The Ghost and Imperial forces engaged in a firefight outside of the module, which damaged the escape pod and sent it crashing onto Bahryn, an icy moon of Geonosis. Orrelios and Kallus were forced to work together in order to survive. In the process, they learned more about one another's pasts and motivations, and Kallus began to recognize the cold realities of serving in the Empire."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 3 BBY,[source?] during the Galactic Civil War between the Galactic Empire and the growing rebellion, intelligence gathered by the rebellion suggested that the Empire was building something in orbit of the planet Geonosis, the world on which the Clone Wars had begun many years earlier. Several Imperial construction modules were in orbit of Geonosis, which at one point—unknown to the rebels at the time— were used to support the construction of the Death Star, an armored battle station capable of destroying entire planets. The station was moved following the rise of the Empire, and the population of Geonosis was destroyed."}, {"tag": "p", "text": "The crew of the Ghost, who were part of the rebellion, traveled to Geonosis to investigate the reports from rebel intelligence. They found the construction modules and deduced that whatever was being built, it had to have been massive to justify building it in space rather than on the surface of the planet. The rebels also learned, through Padawan Ezra Bridger's connection to the Force, that there was no sign of life on the planet. To investigate further, the rebels boarded one of the construction modules."}, {"tag": "h2", "text": "The ambush"}, {"tag": "p", "text": "After docking aboard the construction module, four of the rebel crew members—Bridger, the Jedi Kanan Jarrus, Lasat warrior Garazeb Orrelios, and Mandalorian warrior Sabine Wren—departed the ship. The crew's leader, Captain Hera Syndulla, remained behind in order to keep the Ghost ready to depart in the event they needed a quick exit. Captain Rex also remained behind. As the rebels began making their way through the module, where they intended to check the primary databanks to see if they could uncover what the Empire was building, they were spotted by an Imperial astromech droid. The droid was there as part of a trap set by Agent Kallus of the Imperial Security Bureau, who had lured the rebels to the station and intended to ambush them."}, {"tag": "p", "text": "Just as the rebels began to suspect that they were walking into a trap, the droid closed the blast doors behind them and separated the rebels from the Ghost. Kallus then revealed himself, flanked by many stormtroopers. Most of the rebels contended with the stormtroopers, while Orrelios engaged Kallus in single-combat; the two had a long-standing rivalry, as Kallus was involved in the destruction of Orrelios' people and planet. Jarrus contacted the Ghost to let them know what was happening, so Rex ordered the rebel astromech droid C1-10P (\"Chopper\") to leave the ship and assist the rebels. Chopper found the Imperial astromech droid, pushed it out of the way, and began opening the doors. The Imperial droid fought back, but it was ultimately defeated when Chopper electrocuted it. This allowed Chopper to open the doors, letting most of the rebels return to the Ghost. Orrelios remained locked in combat with Kallus, however, and told the others to leave while he headed for an escape pod. Syndulla agreed and the Ghost flew out of the module, flying past three All Terrain Defense Pods that were stationed on the outside of the facility."}, {"tag": "p", "text": "Orrelios boarded one of the pods, but so too did Agent Kallus, and the two continued their struggle as the escape pod blasted away from the station. As it made its way towards Geonosis, three TIE/ln space superiority starfighters attacked the Ghost. The Ghost was able to fend them off, while Orrelios and Kallus scuffled aboard the escape pod. Their fight caused damage to the craft, knocking it off course and sending it towards Bahryn, an icy moon of Geonosis. The pod crashed beneath the surface of the moon, while the Ghost successfully destroyed the Imperial forces."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The escape pod's crash onto Bahryn broke Kallus' leg. Orrelios and the injured agent found the craft's transponder, but the signal was not strong enough to make it through the ice. They had to reach the surface in order to transmit a distress signal, though it was unclear who would arrive first: the rebels or the Empire. The two also faced dangers in the form of the rapidly dropping temperature and ice creatures known as bonzami. As they worked to survive, Orrelios and Kallus began to learn more about one another and how they were both warriors fighting for causes that they believed in. Kallus also revealed that his role in the fall of Lasan was exaggerated, and that his actions there were based on the horrors that a Lasat mercenary once inflicted on his unit on the planet Onderon—forging a belief that Lasats were dangerous. The two were finally able to escape when they climbed up a pillar that held the ice up, escaping from two bonzamis as they did so. Once on the surface, they transmitted their distress signal."}, {"tag": "p", "text": "The Ghost found Orrelios the next morning. Orrelios told Kallus that the rebels would treat the agent fairly if he chose to leave with them, but Kallus decided to take his chances in the cold and wait for the Empire to find him. The two bade one another farewell, having come to an understanding, and Kallus witnessed the warm reception that Orrelios received when the Lasat returned to the Ghost. Once Kallus was rescued and returned to a Star Destroyer, Orrelios' reception was starkly contrasted when Kallus received a cold reception. Admiral Kassius Konstantine did not acknowledge his rescue and safe return, and Kallus retreated to his quarters alone."}, {"tag": "p", "text": "Kallus's newfound sympathies towards the rebels soon developed into the initiative to provide assistance for their cause. He became a Fulcrum agent and provided Phoenix Squadron with Imperial intelligence, including that of would-be defectors Wedge Antilles, Derek Klivian, and Rake Gahree at the Skystrike Academy and reports regarding Grand Admiral Thrawn's search for Phoenix Squadron's base. During the Battle of Atollon, after his rebel allegiances were discovered, Kallus defected from the Empire and joined the Rebel Alliance at their base on Yavin 4."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ambush on the Imperial construction module appeared in \"The Honorable Ones,\" an episode of the second season of the animated television series Star Wars Rebels. The event formed the basis for the story between Garazeb Orrelios and Agent Kallus, which was designed to show different aspects of the conflict between the rebellion and the Empire and how perceptions of one's enemies are not always accurate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}