{"url": "Hraykken_Bender", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Humans", "Category:Males", "Category:Meatlumps"], "nodes": [{"tag": "h1", "text": "Hraykken Bender"}, {"tag": "p", "text": "Hraykken Bender was a male Human criminal who lived on the planet Corellia during the Galactic Civil War. He was a leader of the Meatlumps."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hraykken Bender was the son of Lucien Bender and the brother of Draykken and Louis Bender. Lucien Bender was a mad scientist who used to conduct experiments on his own sons. However, prior to the Battle of Yavin, the three young boys managed to escape their abusive father with the help of a mysterious individual who would later become the Meatlump King. This man adopted the three boys and raised them as his own. After Imperial assassins attempted to kill their adopted father, the Bender brothers founded the Meatlumps, a gang of fanatical technology-hating thugs, criminals and terrorists. While the Meatlump King became the ideological and public leader of the Meatlumps, the Bender brothers handled the daily operational details of the gang activities. They were based in a secret hideout located beneath the city of Coronet. It was Draykken Bender who named the Meatlumps after their favorite food. In response, their father Lucien created the Bofa Treat Gang, also named after food."}, {"tag": "p", "text": "By the time of the Battle of Yavin, two Imperial officers, Major Tery and Colonel Frost, discovered that the three Meatlump leaders were in fact three brothers. Analyzing the Meatlump attacks against Imperial researchers, Frost and Tery hypothesized that the father of the three brothers could have been himself an Imperial scientist at some point. Later, the reporter Vani Korr of Corellia Times confirmed their conclusion and revealed the filiation of the three brothers in the article Who are the Meatlumps?."}, {"tag": "p", "text": "Around 1 ABY, Hraykken and Draykken decided to attack a droid factory that manufactured helper droids on Corellia. They dispatcher a spacer affiliated with the Meatlumps to attack the factory. The spacer was successful in destroying most droids, including the \"droid queen\" QU3-3N. A short time later, the spacer finally killed Lucien Bender who had placed a bounty on his three sons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hraykken Bender was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "The three Bender brothers — Hraykken, Draykken and Louis — were first mentioned in Vani Korr's article Who are the Meatlumps?, introduced in the game with the \"Publish 21\", released on August 4, 2005. They were later mentioned in web articles related to the Meatlumps on the Star Wars Galaxies website: the \"CorSec Database H-Z\", published on June 16, 2006, and \"Meatlumps!\", published on May 30, 2008, as well as during the events of \"Chapter 10: The Search for the Meatlump King\", released on June 19, 2008. Finally, the three Bender brothers were added to the game with the \"Game Update 10\", released on June 2, 2009."}, {"tag": "p", "text": "In the \"CorSec Database H-Z\", the Bender brothers were originally described as the sons of the Meatlump King. However, it was revealed with the Game Update 10 that they were in fact adopted by the Meatlump King after escaping Lucien Bender, their biological father."}, {"tag": "p", "text": "Analysis of unused game files indicated that the three Bender brothers were intended to be named Lempi, Lucien and Hamm while the father should have been named Andrade. The game's files also contain unused graphical models of Hamm and other Meatlump brothers. These files indicate that Lempi became Draykken Bender, Hamm became Hraykken Bender and Lucien eventually became Louis Bender."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}