{"url": "Hreven_Karsh", "categories": ["Category:Legends articles", "Category:Domain Karsh", "Category:Males", "Category:Yuuzhan Vong", "Category:Yuuzhan Vong officers"], "nodes": [{"tag": "h1", "text": "Hreven Karsh"}, {"tag": "p", "text": "Hreven Karsh was a member of the warrior caste of the Yuuzhan Vong, and during the Yuuzhan Vong War was escalated to the position of commander following the death of his relative, Supreme Commander Komm Karsh. Hreven Karsh later accompanied another supreme commander, B'shith Vorrik, during the campaign to crush the Imperial Remnant, but was later ordered to remain in the Unknown Regions to hunt a party of Jedi searching for the living planet of Zonama Sekot. When he failed in this capacity, Karsh returned to Coruscant, where he was reprimanded and sent by Supreme Overlord Shimrra Jamaane on a suicide mission to invade the Chiss Ascendancy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "When Supreme Commander Komm Karsh, who headed the Yuuzhan Vong's sole strategic reserve fleet, was defeated with his fleet and killed at Obroa-skai, Hreven Karsh was escalated not long after to fill the position of his deceased relative. Inexperienced and over-eager, Hreven Karsh accompanied Supreme Commander B'shith Vorrik on the campaign to eliminate the threat posed by the Imperial Remnant. When Vorrik's invasion was halted at Borosk, Hreven Karsh was dispatched to the Unknown Regions to follow Jedi Master Luke Skywalker and his search party, but lost the Jade Shadow and the Widowmaker, the ships which made up Skywalker's task force, on the borders of the Chiss Ascendancy. With his escalation wounds still weeping and bleeding, Hreven Karsh returned to Supreme Overlord Shimrra Jamaane on Yuuzhan'tar, formerly Coruscant."}, {"tag": "p", "text": "In the Hall of Confluence, Karsh gave his report to the Supreme Overlord, and faced the fury of the Dread Lord. The commander claimed that he had not wished to incur on Chiss territory, and that he had been \"combing\" the borders of the Ascendancy in order to search for the Jedi. Jamaane demanded that Karsh take what was rightfully the Yuuzhan Vong's, and remind the Chiss who ruled over the galaxy. When Karsh swore on the name of Domain Karsh that he would apprehend the Jedi fugitives, the supreme overlord took Karsh at his word, swearing in turn that he would execute every member of Domain Karsh if the commander was unsuccessful. It was perceived by the distant Yuuzhan Vong outcast, Nom Anor, who was watching Hreven Karsh's audience through a concealed villip, as a useless gesture on the behalf of Shimrra—the Chiss would be antagonized, and commander Karsh would be lost. Before the doomed commander left the Hall of Confluence, Jamaane demanded Karsh's hand as a reminder of their pact together. Having severed his hand—the limb was taken away by Onimi, Shimrra's familiar—Hreven Karsh left the presence of the supreme overlord, bleeding profusely, with orders to lead a suicide mission into the Chiss Ascendancy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hreven Karsh's identity as a member of Domain Karsh links to Walter Jon Williams' The New Jedi Order: Destiny's Way, the novel in which Hreven's relative Supreme Commander Komm Karsh dies. Hreven Karsh's fate is never revealed in the final two books of the Force Heretic trilogy, but it is most likely that he perishes, as both Shimrra and Nom Anor suspect he will, fighting the Chiss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}