{"url": "Ambush_on_the_Vulture%27s_Claw/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conflicting sources", "Category:Battles in the Bothan sector", "Category:Battles of the Clone Wars"], "nodes": [{"tag": "h1", "text": "Ambush on the Vulture's Claw"}, {"tag": "p", "text": "The Ambush on the Vulture's Claw took place in 22 BBY, the opening year of the Clone Wars, when Jedi General Anakin Skywalker and his Padawan, Ahsoka Tano, attempted to recover the astromech droid R2-D2. The astromech droid had gone missing during the previous Battle of Bothawui, so Skywalker and Tano set out aboard the freighter Twilight and ventured to the droid's last known location: Bothawui Prime's asteroid belt. While scouring the asteroid belt, they happened upon the scavenger Gha Nachkt's salvage ship, the Vulture's Claw, and boarded it disguised as peasant customers. Nachkt showed the Jedi to his wares, but after Skywalker's replacement astromech droid, R3-S6—who was secretly a spy for General Grievous of the Confederacy of Independent Systems—activated a pair of IG-86 sentinel droids within the cargo hold, Skywalker and Tano were forced into combat with the deadly assassin droids. After dismantling their assailants, the Jedi left the Vulture's Claw empty-handed, remaining unaware that Nachkt had salvaged R2-D2 and promised the droid to Grievous."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 22 BBY, the first year of the Clone Wars, Jedi General Anakin Skywalker marshaled a Republic Navy fleet in defense of the strategic planet Bothawui, which was being targeted by General Grievous of the Confederacy of Independent Systems. In the ensuing Battle of Bothawui, Grievous's Confederate Navy flotilla suffered critical losses, prompting the cyborg general to flee from the battlefield with Skywalker in hot pursuit. However, shrapnel spawned by the disintegrating Confederate frigates wrecked Skywalker's Delta-7B interceptor, which consequently veered into the asteroid belt of the gas giant Bothawui Prime. Although Clone Captain CT-7567, nicknamed \"Rex,\" rescued Skywalker from the asteroids, he was unable to save Skywalker's astromech droid, R2-D2. Skywalker had developed an attachment to R2-D2 and, as a result, had never wiped the droid's memory, which was thus full of classified Republic Military data."}, {"tag": "p", "text": "When High Jedi General Obi-Wan Kenobi learned of Skywalker's dilemma, he ordered him and his Padawan, Commander Ahsoka Tano, to find and retrieve R2-D2, as the information within his databanks would prove fatal to the Republic if it fell into Confederate hands. As Skywalker and Tano prepared to depart from their flagship, the Venator-class Star Destroyer Resolute, aboard Skywalker's personal freighter, the Twilight, they were issued a replacement droid: R3-S6, an R3-series astromech droid with more powerful capabilities than R2-D2's model. However, both Jedi were unaware that R3-S6 was a spy and enemy agent working for Grievous, intent on removing Skywalker as an obstacle for the cyborg general. Also unbeknownst to the Jedi, the scavenger Gha Nachkt salvaged R2-D2 from the asteroid belt and offered the droid to Grievous, who in return promised Nachkt a number of credits. Nachkt concealed R2-D2 in a cockpit compartment aboard his GS-100 salvage ship, the Vulture's Claw."}, {"tag": "p", "text": "Weaving through the battlefield debris amidst Bothawui Prime's asteroids, Skywalker and Tano spotted the former's Delta-7B interceptor. Yet the starfighter's astromech socket was empty, and though Skywalker believed that R2-D2 had escaped, Tano failed to locate the droid on the Twilight's scanners. They caught sight of the Vulture's Claw and decided to board the vessel to see if the scavenger had recovered R2-D2. After docking with the Vulture's Claw, Skywalker and Tano donned simple robes to disguise themselves as peasants, then boarded the craft with R3-S6. Upon greeting his new customers, Nachkt lied and told them that he had not picked up any R2 units for a long time, as war shortages had made the R-series scarce. When Skywalker flashed a handful of shiny credits, the greedy Nachkt amended his statement with a smile and told the disguised Jedi that there might be an R2 unit buried in the depths of his cargo hold. He allowed Skywalker, Tano, and R3-S6 to browse through his wares there, warning them to be careful of his \"unique items\" before leaving."}, {"tag": "h2", "text": "The ambush"}, {"tag": "p", "text": "After a short time, Tano found the unique items of which Nachkt had spoken: a pair of deadly but inactive IG-86 sentinel droids, which were connected to the ship's systems via cables. As they continued to peruse Nachkt's inventory, Skywalker ordered R3-S6 to access the ship's cargo manifest to see if any droids matching R2-D2's description were logged. Suddenly, they heard a sound that Skywalker concluded was R2-D2's trademark whistle, and he bolted over to a nearby blast door from which the sound had originated. Although Tano was skeptical of whether it had been R2-D2, Skywalker told R3-S6 to open the door, but the astromech droid instead flashed on the cargo hold's lights. Exasperated with R3-S6's apparent ineptitude, Skywalker activated his lightsaber and began to cut through the door himself."}, {"tag": "p", "text": "At that moment, R3-S6 switched on the dormant IG-86 sentinel droids, one of which grabbed Tano from behind. On hearing his Padawan's cry of surprise, Skywalker came to her aid, slicing off the arm of the assassin droid holding Tano and then using the Force to telekinetically push both droids into a pile of crates. Tano told R3-S6 to shut down the assassin droids, but before R3-S6 could do so, the two droids released themselves from the ship's cables. As the sentinel droids targeted the Jedi with their E-5 blaster rifles, Skywalker and Tano deflected the oncoming blasterfire with their lightsabers, though their agile adversaries summarily launched themselves onto the adjacent shelves. Skywalker and Tano soon managed to knock them back to ground level, but Tano's one-armed opponent shoved a crate in her direction, pinning her against the shelf behind her. Before the sentinel droid could incapacitate Skywalker from behind, Tano jumped to her Master's aid, cleanly slicing the droid in half with her lightsaber. Skywalker took care of the second assassin droid, beheading it with a single lightsaber strike."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the ambush, Skywalker rounded on R3-S6, criticizing the astromech droid's deficiency; R3-S6 responded by finally opening the nearby blast door. In the room on the other side was a surprised Nachkt. Activating his lightsaber, Skywalker threateningly questioned the scavenger regarding the whereabouts of R2-D2, but Tano convinced her Master that the missing droid was not aboard the Vulture's Claw. Still irate, Skywalker shoved past Nachkt, and Tano and R3-S6 followed him back onto the Twilight. Before the Jedi detached from his ship, Nachkt called after them that they owed him for the mess—the butchered sentinel droids—that they had left behind. Shortly thereafter, Nackht holographically contacted Grievous and informed him that he was en route to rendezvous with him and deliver R2-D2. Although Nachkt attempted to negotiate a higher payment since R2-D2 was obviously valuable to the Jedi, he acquiesced when Grievous did not respond positively to his haggling."}, {"tag": "p", "text": "Meanwhile, after hearing Skywalker's report of his failure to find R2-D2, Kenobi told him that they had to assume the droid had been destroyed in the explosion that had claimed Skywalker's starfighter. Skywalker then contacted Jedi Masters Yoda and Mace Windu of the Jedi High Council and declared R2-D2 officially lost in action. Believing that his fleet of Star Destroyers—including the Resolute—could use some modifications, Skywalker took them back to the shipyards where they had been constructed to refit them. Eventually, Kenobi contacted Skywalker to relay his next assignment. Republic intelligence had confirmed the existence of a Confederate listening post, and Skywalker and Tano were to find and destroy it before it could intercept further Republic transmissions. Skywalker decided to personally scour the outer corridors of space that was suspected of Separatist activity, while Tano and Captain Rex maintained a more central path with the Resolute and the remainder of their forces. Once his starfighter had been retrieved and repaired, Skywalker departed on his new mission with R3-S6."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ambush on the Vulture's Claw was created as part of the storyline of \"Downfall of a Droid,\" an episode in the first season of the Star Wars: The Clone Wars television series. The episode aired on November 7, 2008. Besides being mentioned in various supplementary material for the series, the event was made into a Hasbro Battle Pack entitled Ambush on the Vulture's Claw, which provided the event with a name."}, {"tag": "p", "text": "The December 2008 novel The Clone Wars: Wild Space, which made reference to Skywalker's unsuccessful search for R2-D2, introduced some continuity problems surrounding the event. The novel stated that after their unsuccessful search, Skywalker and Tano returned to the Allanteen Six shipyards, and they embarked on their sweeps of suspected Confederate space at the end of the book. This contradicted the events of the episode, in which the Ambush on the Vulture's Claw was immediately followed by Skywalker's mission to suspected Confederate space. Furthermore, the novel erroneously stated that R3-S6 was not assigned to Skywalker until after his fruitless search for R2-D2, even though R3-S6 had already been issued to Skywalker prior to the episode's events aboard the Vulture's Claw. This article assumes that the novel's interpretation of events is correct aside from the chronology error regarding R3-S6's issuance to Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}