{"url": "Hssiss", "categories": ["Category:Legends articles", "Category:Creatures of Ambria", "Category:Force-sensitive creatures", "Category:Lizards", "Category:Predatory creatures", "Category:Semi-sentient species", "Category:Venomous and poisonous creatures"], "nodes": [{"tag": "h1", "text": "Hssiss"}, {"tag": "p", "text": "Hssiss, or dark side dragons, were a lizard species with the ability to influence Force-sensitive beings around them. If bitten by a Hssiss, one would succumb to the effects of a dark side poison. Hssiss also had the ability to conceal themselves and become invisible, possibly doing so through the Force. Hssiss originated as savage reptilian predators on Ambria, and were one of the few creatures to survive the planet's destruction. They lived in and near Lake Natth, where Jedi Master Thon had imprisoned the dark side energies that had plagued the planet for millennia. The dark spirits then began to possess the creatures, turning them into something much fouler—it was said that these \"dark side dragons\" aided those who used the dark side of the Force. Eventually, Great Bogga began to use them as body guards and pitted them against those who had failed him. When he realized how effective and vicious they were, he had them transported off-world and sold in bulk. Soon, Hssiss could be found all over the galaxy, especially on worlds where the dark side was strong, including Korriban, Mimban and Vjun."}, {"tag": "p", "text": "In appearance, Hssiss looked nothing more than particularly vicious reptiles, about three meters in length, with a green, scaly hide. In addition to those three meters, they had a meter long tail, covered in rows of spikes which stretched up past their backs and onto their necks. When in the lakes on Ambria, they hunted in pairs, grasping their prey with their strong jaws and sinking dozens of teeth into the unfortunate animal's body, while the other Hssiss sunk its jagged claws into it."}, {"tag": "p", "text": "Dark Lizards were a species of hssiss."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "As creatures of the Force, they had a limited ability to mask their presence. Hssiss were drawn to suffering and carnage. After the Jedi Civil War and the devastation of the planet Korriban, they fed upon all the corpses left behind from the war, while the angry phantoms of the Sith—too weak to influence the sentient—took these Hssiss as thralls to their will, fending off all intruders who landed on the planet."}, {"tag": "p", "text": "They were found on many planets throughout the galaxy, including Korriban, Ambria, Mimban and Vjun. Their prevalence was probably the result of being brought with Sith armies in their many wars. Many scientists believed the Hssiss originated from the planet Stenness."}, {"tag": "p", "text": "The Jedi philosopher Tionne Solusar once met with a Hssiss on the planet Ambria. She killed it by removing its head with her lightsaber, but did not escape unscathed. The Hssiss had slashed her with its claws, and only a Jedi healing trance proved able to remove the venom. This led her to believe that the poison was spawned from the dark side of the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic II: The Sith Lords, Ludo Kressh's tomb on Korriban contains an infinite hssiss spawn next to a dead Jedi. By looting the body, two Hssiss spawn. This is the basic level up glitch."}, {"tag": "p", "text": "Strangely, when using Force vision to see the Force alignment, Hssiss are colored blue for a light-sider rather than red for a dark-sider."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}