{"url": "Hudso_Shaku", "categories": ["Category:Canon articles", "Category:Individuals of unidentified species", "Category:Individuals of unspecified gender", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Hudso Shaku"}, {"tag": "p", "text": "Hudso Shaku was a native of Dallenor and the leader of the Krypder Riders on the planet Dallenor. When a Jedi holocron was uncovered on the planet, Shaku and the Krypder Riders wished to steal it. Upon encountering the Jedi Obi-Wan Kenobi and Anakin Skywalker, Shaku ordered the pirates to instead steal Kenobi's lightsaber. Shaku managed to capture Skywalker, threatening his life, but Skywalker used the Force to lift up several rocks and knock the pirate to the ground."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hudso Shaku led the Krypder Riders on the planet Dallenor. When an excavation site was established there, Shaku quarreled with them until they realized that what they were digging up was worthless to him and his pirates. They left the excavation site alone until the excavators discovered an ancient Jedi holocron. When Shaku took his pirates to have a second look at the site, the archaeologist in charge, Clatriffe, planted guards around to keep them at bay. News of the holocron eventually reached the Jedi Order, and they sent the Jedi Knight Obi-Wan Kenobi and his apprentice Anakin Skywalker to collect it."}, {"tag": "p", "text": "Kenobi's arrival quickly became known to Shaku, and he took the Krypder Riders to seize the holocron. Upon arriving, Shaku faced Kenobi, who activated his lightsaber in defense. Shaku saw more value in the lightsaber and had his pirates try and steal that instead. As Kenobi began incapacitating the pirates, Shaku sneaked behind Skywalker and held him hostage. However, Skywalker used the Force to lift several stones, using them to knock Shaku to the ground. With Shaku unconscious, Kenobi prompted the rest of the pirates to leave before he and Skywalker left with the holocron."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hudso Shaku was a male individual with pink skin, blue hair and red eyes. When a valuable possession became known to him, he was quick to try and seize it with the help of the Krypder Riders."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Hudso Shaku wore brown gloves, boots and a cloak with gray trousers and silver spiked shoulder pads. He had goggles over his head and wielded a sword."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hudso Shaku first appeared in the 2019 canon comic Age of Republic - Obi-Wan Kenobi 1, written by Jody Houser and illustrated by Cory Smith. The appearance of Shaku's species resembles that of the Fosh species from the Star Wars Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}