{"url": "Hudrow", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Exchange members", "Category:Humans", "Category:Males", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Hudrow"}, {"tag": "p", "text": "Hudrow was a Human male that served as Exchange crime lord Davik Kang's personal pilot for the Ebon Hawk. During the Sith Empire's occupation of Taris, he angered Kang by stealing spice from the spice lab at his estate. In retaliation, Kang had him imprisoned and tortured by K-X12 probe droids in his torture chamber, where he remained just an hour before the destruction of Taris."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A member of the powerful crime syndicate the Exchange, Hudrow was employed by its crime lord, Davik Kang, as his personal pilot for the Dynamic-class freighter, Ebon Hawk. Reputed to have been the fastest starship in the Outer Rim, the Ebon Hawk was a prized possession of Kang. As the pilot of such a prestigious ship for such a prestigious man, it was inevitable that Hudrow was afforded a measure of prestige as well. Hudrow exploited his status to commit various transgressions without fear of reprisals."}, {"tag": "p", "text": "This changed in 3956 BBY when the Sith Empire occupied Taris, homeworld of Kang, during the Jedi Civil War and imposed a planet-wide quarantine. The blockade was reinforced by the auto-targeting laser cannons of the Sith fleet, which could immediately incinerate any vessel that attempted to flee the planet without the authorized access codes. Despite its speed, not even the Ebon Hawk could escape these laser cannons, effectively grounding the vehicle. With the Ebon Hawk rendered useless, Hudrow's role was for the time being irrelevant, and his status temporarily voided."}, {"tag": "p", "text": "Thus, when Hudrow was caught stealing spice from the spice lab at the estate, he was not spared punitive measures. Incurring Kang's wrath, he was imprisoned in a force cage at the \"guest\" room—actually a torture chamber—where he was subjected to continuous torture by two K-X12 probe droids."}, {"tag": "p", "text": "Fortunately for Hudrow, the Galactic Republic soldier Revan had just infiltrated the estate under the guise of a potential recruit brought by the Mandalorian mercenary Canderous Ordo, one of Kang's top henchmen. Having already acquired the proper departure codes, Ordo and Revan, alongside Revan's friends, sought to steal the Ebon Hawk and escape the blockade. The hangar of the ship, however, was sealed by an impregnable security system which Hudrow, as the pilot, had the means to access."}, {"tag": "p", "text": "After Revan heard of Hudrow's plight by questioning the slaves, he ventured into the torture room to free the pilot from his suffering, destroying the K-X12 probe droids in the process."}, {"tag": "p", "text": "In gratitude, Hudrow, lacking anything tangible to give, uploaded the access codes to bypass the Ebon Hawk's security system into Revan's datapad. Even without knowing that this was exactly what Revan needed, he figured that access to the Ebon Hawk was a reward worth a fortune. With that, he parted ways from his saviors, rushing to flee the estate before Kang discovered his escape."}, {"tag": "p", "text": "Unbeknownst to him, just moments later, Revan and his group encountered Kang and the infamous bounty hunter Calo Nord in the hangar, a confrontation that would leave Kang dead and Nord severely injured just as the Sith began their orbital bombardment to destroy the entire planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hudrow is a non-player character in the video game Star Wars: Knights of the Old Republic. His reward for saving him from torture, the access codes to the hangar of the Ebon Hawk, is a crucial part to the player's main quest to escape the planet with the ship. Even so, it is not the only means by which the player can reach the Ebon Hawk as he or she can alternatively deactivate the security system after slicing into a security terminal, a method that costs up to ten computer spikes depending on the Computer Use level of the character being used. Accessing the computer itself will cost one to two spikes unless the player loots the computer passcard from a Trandoshan bounty hunter in the corridor outside the torture chamber. While it is not known if the player's character, Revan, canonically forgoes rescuing Hudrow and relies on hacking the security system instead, unlocking the hangar doors through Hudrow's access codes is the more efficient way of reaching the Ebon Hawk."}, {"tag": "p", "text": "If the player takes the dark side route, he or she can murder Hudrow after rescuing him, under the pretense that the man may warn the guards and is too dangerous to be spared. If either Bastila Shan or Carth Onasi are present, they will object, but only the latter will automatically prevent you from going through with the kill whereas you can proceed with it in spite of the former's intervention. Additional dark side points will be gained if the player threatened Hudrow prior to killing him with the assertion that the reward was lacking. The player will not receive light side points for his or her act in releasing Hudrow or for sparing his life to confirm the intention is to save him."}, {"tag": "h2", "text": "Appearances"}]}