{"url": "Hubin", "categories": ["Category:Canon articles", "Category:Arboreal moons", "Category:Galactic Empire moons", "Category:Hubin locations"], "nodes": [{"tag": "h1", "text": "Hubin"}, {"tag": "p", "text": "Hubin was a moon in the Dene Gois Cluster, and the residence of the isolationist Clan Markona and their leader, Thane Markona. To avoid the Galactic Empire while passing through the Dene Gois Cluster, Leia Organa, Luke Skywalker, and Han Solo had to land on Hubin in an escape pod. After they landed, they met Thane Markona, who allowed them to stay in his mansion. About a month later, the Empire learned of the rebel presence on Hubin, sending SCAR Squadron to capture them. Markona, having decided to join the Rebellion, organized the evacuation of his clan, who stole the squadron's shuttle to escape. Markona himself was killed by Sergeant Kreel, who was left stranded on the moon with the rest of SCAR Squadron. The squadron was able to create a transmitter, warning the Empire of the rebels' next mission."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Hubin was one of many moons located in the dense Dene Gois Cluster. Its surface was both covered in rocky mountains and large forested areas. Some of the forests had been cleared away to make room for the construction of a village, leaving fields of grass behind. Hubin's atmosphere was breathable to humans, and rainfall could occur on the moon. Creatures known as thanrax lived on Hubin, and often bothered its inhabitants."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clan Markona"}, {"tag": "p", "text": "After a former Jedi fell in love with a roguish stranger, they found a quiet life for themselves on Hubin. After their deaths, their son, Thane Markona, left Hubin to begin a mercenary company. The death of Markona's wife led him to leave his mercenary ways behind, deciding to retire. Clan Markona took one last mission that gave them the rights to settle on Hubin, becoming a peaceful community of isolationists. On the moon, they constructed a village, along with a mansion where Markona and his daughter Tula lived. During the Imperial Era, the Galactic Empire allowed Clan Markona to remain unbothered on the moon."}, {"tag": "h3", "text": "Escape from the Empire"}, {"tag": "p", "text": "After the Galactic Empire attacked the Rebel Alliance's Mako-Ta Space Docks, Leia Organa, Luke Skywalker, and Han Solo, along with the droids C-3PO and R2-D2, escaped to Corosi 7. On Nar Shaddaa, Solo asked the smuggler Sana Starros to transport them in her ship, the Volt Cobra. Briefly stopping on Barnahof to acquire details of a contact from Bodo Linx, the rebels planned to visit Brentaal IV, passing through the Dene Gois Cluster to avoid being noticed. However, an Imperial-class Star Destroyer blocked their path, and the rebels used an escape pod to land on Hubin."}, {"tag": "p", "text": "Not long after they had landed, they were pursued by a thanrax, which was scared away by Thane Markona. After asking the rebels why they were on Hubin, Markona took them back to the mansion, letting them relax. After he introduced both himself and his daughter to them, Tula took Skywalker and Solo on a tour of the clan's village. When a pack of thanrax later began to attack several houses in the village, Thane Markona and Luke rushed to help, taking care of the problem. The rebels lived on Hubin for the next week, with Luke attempting to construct a transmitter, and Leia making plans to get revenge on Queen Trios and Shu-Torun. Luke activated his transmitter, but it was blocked by Thane Markona, who had known about it beforehand. Despite this, the Empire's SCAR Squadron managed to learn that the rebels were on Hubin from Sana Starros, who they had captured and interrogated. About a month into the rebels' stay on Hubin, the members of SCAR Squadron arrived and were met by Markona, who, following the clan's martial code, challenged Sergeant Kreel and Luke to trial by combat."}, {"tag": "p", "text": "However, the duel was a trick, organized by Markona and his daughter. Luke escaped using a smoke grenade and Markona led the stormtrooper squadron away. Tula asked their butler droid MK-1 to sound the alarm and gather the clan while Markona entered in a blaster fight with SCAR Squadron to slow them down. The members of Clan Markona left their homes, led aboard the Imperial shuttle by Tula Markona. As the Thane was shot down by Kreel, the clan left Hubin to join their guests in the Rebel Alliance. With the loss of their ship, SCAR Squadron were stranded on Hubin, with only MK-1 and the thanrax for company. The squadron used Markona's estate as their base, and while searching through computers, Cav recovered Organa's plans, which she had attempted to delete. They were eventually able to construct a transmitter and send warning of Organa's mission to Shu-Torun, which was rerouted to Commander Kanchar. Kanchar ordered for a rescue team to collect SCAR Squadron, taking action against the rebel mission."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Clan Markona, while being a community who had a long history of being fighters, lived an isolated and private life on Hubin. Their life involved less technology than on other planets, having no transports or communication devices. Many of the clan's villagers worked on farms using basic tools and equipment. While the clan was mostly comprised of humans, there were several nonhuman residents, including Duros, Morseerians, Saurin, and Trandoshans. The clan were eventually forced to evacuate the moon, leaving to join the Rebellion against the Galactic Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hubin first appeared in Star Wars 56, a canon comic written by Kieron Gillen, illustrated by Andrea Broccardo, and published on November 7, 2018. According to Gillen, the environment of Hubin was inspired by a visit to a noble house in Scotland."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}