{"url": "Hundred-Year_Darkness/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles of the Hundred-Year Darkness", "Category:Conflicts involving the Galactic Republic", "Category:Conflicts of the Outer Rim Territories", "Category:Jedi", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Hundred-Year Darkness"}, {"tag": "p", "text": "The Hundred-Year Darkness, also known as the Second Great Schism, was a conflict that began in 7000 BBY and lasted until approximately 6900 BBY, when a group of Dark Jedi created monstrous armies to battle the Jedi Order and the Galactic Republic. The Hundred-Year Darkness began three years after the Dark Jedi split with the Order in the Second Great Schism. After ten decades of fighting, the Dark Jedi lost the war at the Battle of Corbos, but went on to conquer Korriban, and founded the Sith."}, {"tag": "h2", "text": "Beginnings"}, {"tag": "p", "text": "The Second Great Schism began when a small sect of Jedi Knights began practicing extended uses of the Force. By relying more and more upon the Force, these Knights learned that using the Force of sufficient intensity could bend life itself. With their new powers, the Knights experimented upon other lifeforms to create new species and predators as extensions of their will. It was postulated that their power could even be used to end death and revive dead worlds. Other Jedi looked upon these new powers with suspicion, suspecting that such power would only lead to abuse. The earliest rebels, the Legions of Lettow, had been defeated in the First Great Schism, but their legacy remained, and a second group of dissidents would emerge, led by such rogue Jedi as Ajunta Pall, XoXaan and Karness Muur."}, {"tag": "p", "text": "All great conflicts began with passion, and this one was no different. Firmly adamant in protecting their newly-acquired powers, this sect of Jedi sought to convince the other Jedi to join their quest for eternal life and galactic bliss. The others were not convinced, and tried to distance themselves from the situation. Firmly convinced that their way was right, the arguments turned into conflict. The rogue Jedi were exiled along with their teachings. A war had begun that would last a hundred years."}, {"tag": "h2", "text": "War"}, {"tag": "p", "text": "Retreating from Jedi worlds such as Tython, the exiled Jedi raised an animalistic army of dark side abominations. The first form of Korriban zombies would be created during the earliest stages of the war. However, even against these incarnations of the dark side, the Jedi began to push the rogue Jedi back. The animalistic army was easily overwhelmed by the power of the Jedi, but the exiled Jedi refused to surrender. Duels to the death between Jedi became the end of many battles."}, {"tag": "p", "text": "During the war, the Jedi constructed the Prism, a secret prison facility known only to the members of the Jedi High Council."}, {"tag": "p", "text": "By the second half of the war, the Dark Jedi were in a state of despair. They were simply outnumbered, and could see no way of winning. However, the Dark Jedi refused to surrender, and pooled all their resources into creating the most fearsome dark side creatures ever seen. Supported by monstrous creatures, such as the Leviathan, the Dark Jedi armies were reinvigorated. Armies fled in terror from the abilities of the Leviathan to suck life essences into the blister-traps upon their backs."}, {"tag": "p", "text": "However, under combined efforts from the Jedi, the Dark Jedi were continually pushed back. The last stand of the Dark Jedi was on the world of Corbos. Infighting, along with the bombardment of the Jedi and the Republic, led to the surrender of the last of the Dark Jedi."}, {"tag": "h3", "text": "Exile"}, {"tag": "p", "text": "After their defeat on Corbos, the surviving Dark Jedi were rounded up by the Republic armies. Stripped of weapons and armor, the Dark Jedi were at the mercy of the justice of the Republic. Although members of the Republic wanted public executions, the Jedi leaders were inclined to banish the rogue Jedi into the unknown, in the hopes that, with time, they would see the error of their ways."}, {"tag": "p", "text": "On the plains of a barren world, the Exiles, as they became known within the Republic, were herded onto unarmed transport ships. Several fighters accompanied the ships to ensure the departure of the Dark Jedi from Republic space. The Hundred Year Darkness was over, and the Jedi had weathered the Second Great Schism."}, {"tag": "h2", "text": "A new world"}, {"tag": "p", "text": "Coming out of hyperspace, the Dark Jedi gazed upon an uncharted world. Landing on the world, they were surprised to find a humanoid species calling themselves the Sith. Hakagram Graush, the ruling king of the Sith, or Sith'ari, was shocked at the appearance of the outsiders, but after witnessing their powers and advanced technology, the king welcomed the exiled Jedi to the world. However, this led to Graush's downfall. The Sith'ari's Shadow Hand conspired with the new arrivals, and betrayed his liege to the Dark Jedi. Using their training in the Force, the Exiles amazed the Sith and elevated themselves to god-like status on Korriban, becoming the rulers of the Sith people. The most powerful of the Dark Jedi, Ajunta Pall, became the first Dark Lord of the Sith."}, {"tag": "p", "text": "Some of the Exiles, however, were not content to rule the Sith and gather their strength. A few of the Dark Jedi returned to the territory of the Republic to attack the Jedi. They believed they now had the power to crush the Jedi Order and rule, but they were wrong. Their premature actions served only to alert the Republic and their defenders that some of the Exiles survived out in uncharted space."}, {"tag": "p", "text": "As years passed, and interbreeding occurred between the Fallen Jedi and the Sith, the term \"Sith\" came to mean not only the original inhabitants of Korriban, but also their fallen Jedi masters. The Dark Jedi greatly accelerated the cultural development of the Sith. When first encountered, the Sith were a simple tribal species that wore primitive clothing and lived in small huts. With the influence of the Dark Jedi, elaborate clothing came into use, and large temples were erected by the Sith people for their overlords, including the Valley of the Dark Lords."}, {"tag": "p", "text": "With the destruction of the Sith Empire, for the rest of galactic history, the term Sith was more often applied to only those dark-side Force-users who were the successors of Ajunta Pall and the Lords of the Sith."}, {"tag": "p", "text": "It is from this rise to power and integration into Sith culture that the term \"Dark Lord of the Sith\" originated as a title bestowed upon the leader of the Old Sith Empire by a council of lesser Sith Lords. During the early history of the Sith Empire, the coming of the prophesied savior of the Sith Order, the Sith'ari, was foretold. The Sith'ari was a perfect being who would one day lead the Sith. According to prophecy, the Sith'ari would rise up and destroy the Sith, but in the process make them stronger than ever before. Some see this as a striking parallel to the Chosen One of Jedi legend."}, {"tag": "h2", "text": "Return"}, {"tag": "p", "text": "After becoming Sith Lords, several Exiles took the ship they had arrived on along with new weapons, Massassi warriors, and their new secrets of Sith alchemy in an attempt to destroy the Jedi against Ajunta Pall's orders, only to have themselves destroyed, and giving the Jedi the knowledge that Sith Space existed, and that the Exiles had survived."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "For many years, the Hundred-Year Darkness was just a footnote in the history of the Star Wars galaxy, and unknown as the conflict which birthed the Sith Order. Prior to that, it had often been assumed that the First Great Schism, caused in the early years of the Republic, had been what formed the Sith Order. This was also somewhat confirmed in Naga Sadow's entry in The New Essential Guide to Characters, which stated he was the first Sith Lord in 20,000 years to reestablish contact with the Republic. However, LucasFilm had intended the Hundred-Year Darkness to be the source of the Sith Order, and was established as such in The New Essential Chronology. Daniel Wallace, who worked on both the NEGTC and the NEC, has since admitted that the Naga Sadow entry date was a mistake."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}