{"url": "Hundred-Year_Darkness", "categories": ["Category:Canon articles", "Category:Events", "Category:Jedi", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Hundred-Year Darkness"}, {"tag": "p", "text": "The Hundred-Year Darkness was a period of time that led to the formation of the Sith, who were once considered brothers in the Force with the Jedi Order. The birth of the Sith led to a number of wars over the course of galactic history."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Hundred-Year Darkness"}, {"tag": "p", "text": "Thousands of years before the Clone Wars, the Jedi Order and the individuals who became the Sith were considered brothers in the Force. This unity fractured, however, during the period of time known as the Hundred-Year Darkness, when a rogue Jedi came to believe that the true power of the Force lay not through contemplation and passivity, and that only by tapping its dark side could its true potential be reached. The Jedi High Council balked at this new direction and the fallen Jedi was cast out, but he gained followers and formed a new order, which eventually became the Sith."}, {"tag": "p", "text": "According to a later Sith Lord, Darth Sidious, the Sith \"rose up\" against the light side of the Force. During the Hundred-Year Darkness, hellhulk stations were used, and the Shadowfang Beast, a bioconstruct that generated a resonance-absorptive shield, was created. The Tah'Nuhna species were neutral during the war."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The birth of the Sith led to countless wars between the two rival sects. The Sith were believed to have been destroyed in the Jedi-Sith War, but they eventually returned to galactic prominence and ushered in the Clone Wars. Both sides of the war were controlled by Darth Sidious, known publicly as Supreme Chancellor Sheev Palpatine, and allowed him to gain enough power over the galaxy to transform the Galactic Republic into the Galactic Empire. This led to decades of Sith rule over the galaxy, which lasted until Sidious' death during the Battle of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hundred-Year Darkness was a conflict originally created for Star Wars Legends, previously known as the Expanded Universe, and made its first appearance in the comic book series Star Wars: Tales of the Jedi. The event was canonized in the 2015 comic book Star Wars 9."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}