{"url": "Hunt_for_Exal_Kressh", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Great Galactic War"], "nodes": [{"tag": "h1", "text": "Hunt for Exal Kressh"}, {"tag": "p", "text": "During the Great Galactic War, both the Sith Empire and the Galactic Republic initiated an interstellar manhunt for the rogue Sith apprentice Exal Kressh. Kressh, a Sith disciple and apprentice to the Sith Emperor, abandoned the Empire after discovering that her Master was planning to use her as the first member of his \"Children\"—a collection of individuals entirely subject to the will and powers of the Emperor himself. Upon learning that the Children of the Emperor were meant to be nothing more than puppets to his Force essence and tools to achieve immortality, Kressh fled the Empire in 3678 BBY and promptly began a campaign to undermine the Emperor's plan to forge more Children through Sith magic. However, while Kressh began leaking Imperial Military intelligence to the Republic Strategic Information Service, the Empire's Dark Council dispatched the disgraced Sith apprentice Teneb Kel to hunt down and execute Kressh. Meanwhile, the High Council of the Jedi Order, who had witnessed Kressh's leaked data as it was disseminated to the Republic Navy, ordered that the apparent Sith defector be found so that her identity and the veracity of her information could be confirmed."}, {"tag": "p", "text": "Kressh, aware that the Emperor's mind was still attached to her own, sought solitude and safety in orbit above Lenico IV, the planet on which she discovered her Masters secret during her apprenticeship. Hoping the memories of Lenico would blind the Emperor to her whereabouts, Kressh entered suspended animation aboard Lenico Colony Blue while she waited for the Republic Navy act on her leaks and assemble for an attack on the Sith holy world of Korriban. Although her tactic worked for a time, Kressh was eventually found by Teneb Kel and his slave Maggot, as well as her Jedi pursuers, Master Jerbhen Hulis and his Padawan. Kel was the first to discover Kressh, with whom he immediately engaged in a highly destructive duel that resulted in the destruction of the colony space station. Although the rogue Sith decisively overcame her opponent, Kel was able to escape with Maggot and was marooned on the surface of Lenico IV along with the Jedi and many of Lenico Colony Blue's civilian survivors. After nearly dying on the Ash Plains of Lenico IV, Kel received a Force vision that helped him to learn Kressh's history and of the of the Emperor's secret Children collective."}, {"tag": "p", "text": "Meanwhile, Kressh was traveling to Korriban, where she intended to use the attacking Republic Military as cover for her infiltration of the Sith Academy. Within, she hoped to find and destroy the Emperor's Children, who were being prepared for ritual possession. With confirmation of Kressh's arrival on the planet, a Republic fleet invaded the Horuset system and assaulted Korriban itself. While Republic strike teams and Jedi landed in the Valley of the Dark Lords and rushed the Academy, Kressh navigated the labyrinth of tombs beneath the valley to gain undetected access to the Emperor's ritual chambers. She was ultimately caught and confronted by Teneb Kel, who had escaped Lenico IV and was committed to fulfilling his duty. After a fierce duel, Kel cut down Kressh but was also forced to sacrifice his companion, Maggot. Because of Kel's success in the hunt for Kressh, the Empire succeeded in beating back the Republic assault and the Emperor's \"Children\" project continued unhindered. The young Sith apprentice was granted the moniker of Darth Thanton for his achievements, while the Empire proceeded to wipe the Kressh name from history."}, {"tag": "h2", "text": "Prelude"}, {"tag": "h2", "text": "The hunt"}, {"tag": "h3", "text": "The fugitive Kressh"}, {"tag": "h3", "text": "The revelations of Lenico IV"}, {"tag": "h3", "text": "Bloody Korriban"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}