{"url": "Hunt_for_Han_Solo", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Hunt for Han Solo"}, {"tag": "p", "text": "During the Galactic Civil War, several bounty hunters launched an adventure to hunt the smuggler Han Solo."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The smuggler Han Solo, captain of the freighter Millennium Falcon along with his friend and co-pilot Chewbacca the Wookiee earned a price on their heads after failing to deliver a load for the crimelord Jabba the Hutt. They also earned a bounty from the Galactic Empire after taking part in the Battle of Yavin."}, {"tag": "h2", "text": "The Hunt"}, {"tag": "h3", "text": "Hunt on Tatooine"}, {"tag": "p", "text": "Solo, with his friends known as the Heroes of Yavin, were on Tatooine a few weeks later. They encountered a group of slavers who had captured the young Hutt Grubba Desilijic Aarrpo. They were able to rescue Grubba and make arrangements to return him to his uncle Jabba."}, {"tag": "p", "text": "Along the way, they were hunted by a group of bounty hunters—Dengar, Udin, and Eron Stonefield. Once they heard that the Millennium Falcon was about to land and meet with Jabba's agents, one of them setoff on a dewback in the middle of a sandstorm. The hunter was able to infiltrate the Falcon, and make off with Grubba. Skywalker was then forced to use a mind trick on Bib Fortuna and the Gamorrean guards to let them escape."}, {"tag": "h3", "text": "Showdown on Kubaz"}, {"tag": "p", "text": "Desperate to re-locate the Hutt, the Heroes of Yavin interrogated a Kubindian. He revealed that the hunters were likely going to Udin's tribe—the Zabin Hive on Kubaz. They were then chased out of Mos Eisley by the Tatooine militia."}, {"tag": "p", "text": "Once on Kubaz, they faced a tough journey through the forest and being captured by the hive, before one of them was able to negotiate with Queen Zabin for their freedom. By that time though, the hunters had escaped again with Grubba, seeking refuge with General Olan Dewes."}, {"tag": "h3", "text": "Liberation of Ithor"}, {"tag": "p", "text": "A short while later, the Heroes of Yavin agreed to join with exiled leader Momaw Nadon and escort him to Ithor. The crew posed as Torturer Vengnar Heiff, and then faked a crash landing. They then took Nadon to the Tafanda Bay, where he inspired an uprising of the Ithorians. Both General Dewes and Torturer Heiff were captured, and the fleet sent by the Rebel Alliance helped drive off the Imperial blockade."}, {"tag": "p", "text": "Solo and his crew also re-rescued Grubba. They then made arrangements with Jabba to meet with his agents on Togoria and claim the reward. Unbeknownst to them, Jabba sent notice of the rendezvous to the bounty hunters as well so they could capture the smuggler."}, {"tag": "h3", "text": "Allying with the Togorians"}, {"tag": "p", "text": "Princess Organa was able to use her diplomatic connections to land on the city of Caross on Togoria."}, {"tag": "p", "text": "Before they landed, they were ambushed by the hunters. Solo was able to hit the Punishing One with an ion cannon, causing it to crash into the jungle, although they were able to make it to an escape pod."}, {"tag": "p", "text": "The hunters discovered the Mindnight Fire clan, and they were able to convince the clan to aid in their adventure to find Solo, by deceiving them that Solo had captured Grubba himself."}, {"tag": "p", "text": "The clan ambushed the Heroes of Yavin in Caross, with one sneaking aboard the Falcon. Solo was able to get into a Corellian standoff with the hunter, but after Grubba betrayed them, they were captured."}, {"tag": "p", "text": "The hunters then sent a signal to the Empire to collect the bounty on the Heroes of Yavin, but the Togorians were able to intercept the signal, allowing the Alliance to send the Victory-class Star Destroyer Valiant with Fordwyn acting as an Imperial captain. Fordwyn paid off the hunters with forged credit disks, allowing them to leave with the Hutt."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Jabba the Hutt told the hunters how they had been tricked and had them return Grubba, who had managed to gamble 85% of his bounty. The Heroes of Yavin then went on to other missions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The hunt appears across several books in the original Star Wars Missions series by Scholastic Inc."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}