{"url": "Hunt_for_Zsinj", "categories": ["Category:Legends articles", "Category:Battles of the Hunt for Zsinj", "Category:Galactic Civil War campaigns"], "nodes": [{"tag": "h1", "text": "Hunt for Zsinj"}, {"tag": "p", "text": "The Hunt for Zsinj was a campaign during the Galactic Civil War fought primarily between Warlord Zsinj and the New Republic, which near the end was occasionally supplemented by a fragile alliance with the Imperial Remnant. The battles occurred primarily in Zsinj's empire in the Outer Rim and Colonies regions between 6.5 and 8 ABY, although most of the fighting took place between 7 and 7.5 ABY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "With the Emperor killed at Endor, Grand Moff Zsinj was just one of many Imperial officers to go rogue. Zsinj knew that he couldn't make himself a target early in his career as a warlord, so he dispatched emissaries from the planets he controlled in Quelii Oversector in order to convince the New Republic to leave his territory alone. His plan succeeded and Zsinj was able to consolidate his forces unhindered by New Republic activities. Some of his early successes in building up his armada were the creation of the Raptors, building the Dathomir shipyards, and creating Project Chubar. By 7 ABY, Zsinj had cared out a significant empire in the Outer Rim Territories."}, {"tag": "p", "text": "Just prior to the fall of Coruscant, Zsinj continued building up his forces from his secret Rancor Base while also absorbing the forces of other warlords such as Admiral Terrinald Screed. Zsinj managed to accumulate a significant amount of territory and finally felt it was time to strike. While not a massive invasion, Zsinj's forces had notable encounters with the New Republic's Rogue Squadron and harassed New Republic shipping during the Bacta War."}, {"tag": "p", "text": "Zsinj's Empire stretched along the Hydian Way from the Inner Rim to the Corporate Sector. The eccentric former Grand Moff affected the white uniform of a Grand Admiral and a handlebar moustache that led many in the New Republic to dismiss him as a buffoon. However, he possessed a powerful military built around the Super Star Destroyer Iron Fist and his elite units, the Raptors, had already halted New Republic incursions into his territory. After the capture of Coruscant, many Imperial Loyalists saw him as the best hope for an Imperial resurgence."}, {"tag": "h2", "text": "The campaign"}, {"tag": "h3", "text": "Opening actions"}, {"tag": "p", "text": "With the Bacta War against Ysanne Isard over, the New Republic was finally in a position to focus on Zsinj. Under the command of Corellian hero Han Solo, a large fleet led by the Mon Remonda was put together for the purpose of tracking down and eliminating the Warlord. It was around this time that Zsinj decided to create a false version of the 181st Imperial Fighter Wing led by an actor impersonating Baron Soontir Fel, and another Corellian hero Wedge Antilles formed Wraith Squadron as a commando fighter group to aid the hunt."}, {"tag": "p", "text": "The initial battles mostly involved Zsinj's subordinate Admiral Apwar Trigit, who Wraith Squadron and Solo's fleet were able to eliminate with a number of brilliant acts of subterfuge. After Trigit's demise, Solo's forces learned that Zsinj was recruiting space pirates which gave them an idea for their next plan to capture the warlord."}, {"tag": "p", "text": "After a failed attempt to assassinate Wraith Squadron, Zsinj inadvertently got to meet some of them in person when members of the squadron began impersonating a group of pirates, the Hawk-bat Independent Space Force, that Zsinj ended up recruiting. The warlord accidentally provided a good deal of intelligence to Wraith Squadron during their recruitment, while the Wraiths successfully kept their cover and fed Zsinj misinformation."}, {"tag": "p", "text": "Soon, Zsinj's recruitment of space pirates was revealed as part of a larger plan to assault Kuat Drive Yards and steal a Super Star Destroyer, the Razor's Kiss. This operation would net Zsinj a second Super Star Destroyer. However, the raid was done without the knowledge of the Empire, and Kuat was still an Imperial Loyalist world. Zsinj, however, saw it as an opportunity to rob the Empire of a vessel they could use to challenge him. Thankfully for the New Republic, Wraith Squadron and Solo's forces were able to carry out the destruction of the Razor's Kiss shortly after the theft."}, {"tag": "p", "text": "With a humiliating defeat came Zsinj's fiercest plan yet, as he instituted a multi-pronged attack on New Republic morale designed to cause dissension among the alien races within the New Republic Fleet. Project Minefield and Project Funeral involved the placement and activation of brainwashed Republic officers, while Project Blunted Razor collected the debris from the destroyed Razor's Kiss. In the Battle of Levian Two, Zsinj also attempted to lead Solo's forces into a trap where his overwhelming fleet would annihilate his pursuers, a battle Solo's forces managed to escape from."}, {"tag": "p", "text": "While Solo reevaluated his prey, Zsinj planned a trap for Wraith Squadron on Saffalore. Unorthodox tactics saved the Wraiths and gained further intelligence on Zsinj's plans. Zsinj appeared increasingly erratic and the warlord's cumulative losses, culminating in his defeat at the Battle of Jussafet Four and his raid on Kuat, angered Loyalist Galactic Empire forces in Imperial Space. Admiral Teren Rogriss quietly agreed to share tactical information with Solo, and even leant the Interdictor cruiser Stellar Web to Solo's fleet to help him in trapping their mutual enemy. Project Funeral continued successfully as the schism between humans and non-humans of the New Republic grew bigger, however the collaboration of Rogue Squadron, Wraith Squadron, and New Republic Intelligence but a stop to it."}, {"tag": "h3", "text": "Apparent victory"}, {"tag": "p", "text": "Following the use of a converted YT-1300 light freighter into the Millennium Falsehood by Solo's forces, Zsinj found himself in a horrible situation with New Republic and Imperial forces eating away at him from both fronts of his Empire. Based on these poor fortunes, Zsinj came up with an idea to abandon his territory, eliminate Solo, and retreat to fight another day."}, {"tag": "p", "text": "Using false intel from a member of Wraith Squadron that managed to infiltrate his forces, Zsinj was nearly trapped at Vahaba but barely escaped. Sabotage by the Wraith on board led him to be temporarily stranded in the Selaggis system. The Battle of Selaggis began with Solo's forces following the warlord. The short but vicious battle was turned into a cover for Zsinj to bring in the remains of the Razor's Kiss, renamed the Second Death. He managed to release the ruins of the other Super Star Destroyed just as the Iron Fist made a final jump to Zsinj's secret Rancor Base. Solo was convinced that Zsinj was no more and returned to Coruscant."}, {"tag": "h3", "text": "Hapan intrigues"}, {"tag": "p", "text": "Concurrent to Solo's campaign was Princess Leia Organa's attempt to win the Hapes Consortium and its powerful navy to support the New Republic. During her visit to Hapes, the Hapan Chume'da, Isolder, fell in love with her, and accompanied her to Coruscant with a fleet which he promised in return for her hand in marriage. A jealous Han Solo, however, kidnapped Princess Leia and fled with her to Dathomir, having won the deed to the isolated planet in a Sabacc game, unaware that it was where Zsinj was rebuilding."}, {"tag": "h3", "text": "Conclusion"}, {"tag": "p", "text": "When Han Solo arrived at Dathomir, he immediately spotted Zsinj's shipyard–and the massive fleet assembled there spotted Solo. Solo's attempt to disguise the Falcon as one of Zsinj's Incom Y-4s didn't last long, but he managed to fire concussion missiles into an unshielded frigate. The Falcon rode the ruined frigate into Dathomir's atmosphere, but there was a surprise waiting on the surface: The Witches of Dathomir."}, {"tag": "p", "text": "The last Jedi Knight, Luke Skywalker, pursued Solo with Isolder's Hapan Battle Dragon, Song of War. They arrived at Dathomir only to watch the Falcon crashing. Isolder and Skywalker followed them in, but they were also captured by a Force Witch. Skywalker was soon reunited with Han and Leia, but in the skies above Dathomir, Zsinj's forces braced for an attack and, having learned of Solo's presence, General Melvar began to negotiate with the Nightsisters for custody of Solo."}, {"tag": "p", "text": "As the Rebel intruders made efforts to escape the planet, Zsinj deployed the Orbital Nightcloak to cow the planet's inhabitants into submission, an action which is commonly considered the beginning of the Battle of Dathomir. Zsinj directly contacted Gethzerion, the leader of the Nightsisters, to demand the transfer of Solo. The Nightsister captured Solo, and Melvar took two shuttles to the surface to claim him–an armed one for himself and Solo, and an unarmed one for the Nightsisters to depart the planet. In a display of treachery Zsinj did not foresee, Gethzerion killed Melvar and stole the armed shuttle. Unfortunately for the Nightsisters' plans, Luke Skywalker drew more deeply on the Force than he ever had before in order to fight them. He staged an attack to free Solo, and then pursued the Nightsisters' shuttle into the Dathomir sky. With new-found confidence, Luke used his Force-enhanced skills to help Zsinj's forces destroy the Nightsisters, and then he attacked the Nightcloak."}, {"tag": "p", "text": "Zsinj deployed hundreds of starfighters to stop the Falcon, but he couldn't keep Skywalker from shutting down his planet-killing satellites. When Luke realized that Zsinj's flagship, the Iron Fist was within range, Solo reclaimed the helm of the Falcon. Slipping beneath Iron Fist's shields, Solo put in a priority communication directly to Zsinj. The last words Zsinj ever heard were Solo's: \"Look up at your viewscreen, you vermin. Kiss my Wookiee!\""}, {"tag": "p", "text": "With his last two concussion missiles, Solo obliterated the bridge of the Star Dreadnought, killing Zsinj."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With Zsinj defeated at the Battle of Dathomir, the grateful planet quickly joined the New Republic. Shortly thereafter, Leia Organa married Han Solo. Prince Isolder took a Dathomir native, Teneniel Djo, as his wife, but he still entered into a limited alliance with the New Republic."}, {"tag": "p", "text": "Though his reign lasted a mere four years, Zsinj's death had widespread repercussions. The greatest single threat to the New Republic was eliminated, but Zsinj's death also left the Empire free to return their focus to the New Republic. Even worse, Zsinj's forces remained active, but lacked direction. Much of his fleet was claimed by a number of independent warlords, most notably Treuten Teradoc."}, {"tag": "p", "text": "In the fighting that followed, Teradoc was defeated and the Greater Maldrood dissolved, and the Warlord fled to the Deep Core. However, New Republic lost a significant portion of their military forces. Crynyd, Rebel Dream, and other Star Destroyers were either destroyed or recaptured by the Empire. The New Republic took Kuat, but the yards were heavily damaged and rife with Imperial partisans. Further, the New Republic lost the core KDY design team when they leapt to the Deep Core with the half-completed Eclipse. Eventually, Rogriss and the Imperial forces began to back down from fighting the New Republic, and Teradoc and other warlords retreated into their pocket empires."}, {"tag": "p", "text": "Within a year from Zsinj's defeat, the galactic situation was more stable, with the New Republic in nominal control of three-quarters of the known galaxy. The stage was set for the next great conflict, and the reemergence of the last Grand Admiral, Mitth'raw'nuruodo."}, {"tag": "h2", "text": "Technologies"}, {"tag": "p", "text": "The New Republic Defense Force made several advancements during the campaign, such as the creation of the ad hoc Solo Fleet, the introduction of the new MC80B Star Cruiser and formation of Wraith Squadron."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}