{"url": "Hunt_for_Ziro", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Hunt for Ziro"}, {"tag": "p", "text": "\"Hunt for Ziro\" is the ninth episode of the Star Wars: The Clone Wars television series' third season. It aired on November 12, 2010. The episode is a sequel to \"Hostage Crisis.\""}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Cad Bane has broken Ziro the Hutt out of prison and the Hutt Council demands that Ziro tell them where he's hidden vital -- and incriminating -- information: a journal detailing the criminal activities of the five Hutt families. Ziro makes another daring escape with the help of his estranged (and strange) lover, Sy Snootles. Bane is back on the Hutt's trail -- but he's not the only one. The Jedi Obi-Wan Kenobi and Quinlan Vos need to find him too."}, {"tag": "p", "text": "A chase through the swamps of Nal Hutta leads the pursuers to Ziro's enormous mother, Mama the Hutt, who points them to the direction of Teth. It is here, in the secret grave of Ziro's father, that the fugitive Hutt has hidden the diary. When he retrieves it, Snooty reveals her true spots. She's a deadly woman scorned and a bounty hunter for hire. She kills Ziro, and returns the journal to her client: Jabba the Hutt."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following his liberation by Cad Bane, Ziro the Hutt has been brought to the swampy Hutt home world of Nal Hutta, since he is holding critically incriminating information about the Hutt Crime lords, stored in a holodiary whose location only he knows. Ziro ensures his own safety by claiming that if something happens to him, the information would be immediately sent to the Republic authorities. However, Ziro has an ally in the singer Sy Snootles, with whom he had entertained a romantic relationship. After learning that Ziro is being held captive in the Hutt stronghold, she secretly visits him. Ziro exploits her affection for him to have her break him out, and the two escape into the swamps, to the abode of Mama the Hutt, Ziro's grotesque mother, who provides him with a starship so he can travel to \nTeth."}, {"tag": "p", "text": "On Coruscant, Obi-Wan is entrusted by the Jedi Council with the task of retrieving Ziro and bringing Cad Bane to justice with the help of the skilled, but rather free-minded, crazy and impulsive Jedi Master Quinlan Vos, whose company is not exactly a delight for Obi-Wan. Nevertheless, Vos is well-informed about the possible reason why Ziro has been freed, so they travel to Nal Hutta. The Hutt Council denies any knowledge of Ziro's and Bane's whereabouts, and Obi-Wan is reluctant to confront them openly since the Republic owes the Hutts for their contributions to the war effort, but Vos states that they could have freed him, to Gardulla's resentment. He then detects Ziro's presence by psychometrically scanning a cup Ziro has drunk from. As the two arrive at Ziro's detention cell, they find him already missing and promptly attempt to track him down. Shortly afterward, the Hutt Council also learns of Ziro's flight, and once more Cad Bane offers his services (for a fee) to retrieve the renegade Hutt."}, {"tag": "p", "text": "The two parties successively follow Ziro's trail to Mama's abode and learn of his intent to get to Teth. In the meantime, Ziro and Sy retrieve the diary from its hiding place, the grave of Ziro's father, but then Sy, out of greed and a grudge against Ziro for having abandoned her, turns on the Hutt and blasts him to death. The Jedi and Bane meet beside the corpse and immediately begin to slug it out between themselves: While Obi-Wan intends to bring Bane to justice for the Senate hostage incident, Bane is tempted by the reward for each dead Jedi delivered to the Separatists. The Jedi press Bane hard, however, and he barely manages to get away with his innate skills and the help of his droid aid Todo. But while this is going on, Sy delivers Ziro's holo-diary to her true master..."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In addition to using Quinlan Vos and his psychometric powers, \"Hunt for Ziro\" drew on other elements of the Expanded Universe as well—the Hutt homeworld of Nal Hutta has existed in Star Wars lore since as early as 1993's Dark Empire Sourcebook. The names of the Hutt family leaders present on Nal Hutta in the episode were revealed in \"Hunt for Ziro\"'s StarWars.com episode guide, although they had already appeared in holographic form in the previous episode, \"Evil Plans.\" Also revealed were the names of some of the creatures seen on Nal Hutta and one that sits atop the head of Marlo the Hutt. The episode marks the first appearance of Sy Snootles in The Clone Wars; Snootles originally appeared on the screen in the 1983 film Star Wars: Episode VI Return of the Jedi. Snootles' lover, on the other hand, dies and is seen onscreen for the last time—Ziro had been a supporting character since the 2008 release of the Star Wars: The Clone Wars film."}, {"tag": "p", "text": "Another Hutt who appears in \"Hunt for Ziro\" is Gardulla Besadii the Elder, despite having previously been fed to a krayt dragon in the 2002 video game Star Wars: Bounty Hunter, which is set prior to the Clone Wars. After \"Hunt for Ziro\" aired, Leland Chee declared that the krayt dragon had found Gardulla \"indigestible,\" echoing a similar line spoken by Boba Fett in a 1992 issue of the comic series Star Wars: Dark Empire. However, Star Wars author Adrick Tolliver pointed out that continuity errors surrounding Gardulla's death had existed for some time, with both the Galactic Phrase Book & Travel Guide and the novel Tatooine Ghost mentioning her as being alive after the events of Bounty Hunter."}, {"tag": "p", "text": "Chronologically, the events of \"Hunt for Ziro\" immediately follow the events of \"Hostage Crisis,\" an episode from The Clone Wars's first season. Together with \"Evil Plans,\" which is set just prior to \"Hostage Crisis,\" the three episodes form a story arc that tells the tale of Ziro's escape from a Republic prison. Their viewing order was confirmed in the 2012 reference book Star Wars: The Ultimate Visual Guide: Updated and Expanded, which also places the comic story arc Star Wars: The Clone Wars: In Service of the Republic at just after \"Hunt for Ziro.\" In March 2014, Keeper of the Star Wars Holocron continuity database Leland Chee revealed the chronological episode order of The Clone Wars's six seasons in a tweet, and the information was later posted in a StarWars.com blog entry. Both confirm that \"Hunt for Ziro\" follows \"Senate Murders,\" with season three's tenth episode, \"Heroes on Both Sides,\" being the next episode of the show in the timeline."}, {"tag": "p", "text": "The Jedi Temple Archives feature on The Complete Season Three Blu-ray includes the deleted scenes \"Ziro Loses the Bracelet\" and \"Quinlan Finding Snooty's Bracelet.\""}, {"tag": "h2", "text": "Conception"}, {"tag": "p", "text": "The idea of using Quinlan Vos in the animated television series Star Wars: The Clone Wars came from writer Henry Gilroy as early as 2005, soon after he became attached to the show. Vos was a fan-favorite Expanded Universe character who had appeared in numerous issues of Dark Horse Comics' Star Wars: Republic series, though his original character design came from a background extra in the 1999 film Star Wars: Episode I The Phantom Menace. Gilroy contacted John Ostrander, who had penned most of Republic's Vos-centric issues, to ask if he would be interested in writing the episode which featured the character's first appearance. However, the producers of The Clone Wars ultimately decided to employ experienced television animation writers early in the show's production, and Ostrander's involvement was nixed."}, {"tag": "p", "text": "Vos was written into an early draft of the show's season one episode \"Bombad Jedi,\" but was cut due to limitations involving how many new character models a single episode could introduce. His first appearance thus did not come until the season three episode \"Hunt for Ziro,\" which drew on his character traits from the Republic comics, including his powers of psychometry and his tendency to bend the rules of the Jedi Order. Various pieces of concept art were created for the episode, including art of Vos, Vos's gunship, the swamp speeder, Mama the Hutt's home, the musical number performed by Sy Snootles, and various locations on both Teth and Nal Hutta. A maquette of Mama was also built."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "\"Hunt for Ziro\" drew inspiration from various sources. Mama was partially inspired by the obese vampire Pearl from the 1998 film Blade; the Ran-D housekeeper droids in Mama's hut were an homage to the 1987 film Batteries Not Included; and when Ziro dies, he says \"What a world, what a world!\" in reference to a line spoken by the Wicked Witch of the West in 1939's The Wizard of Oz. Additionally, the musical number in Gardulla's palace was a tribute to the opening scene of 1984's Indiana Jones and the Temple of Doom."}, {"tag": "p", "text": "The number was inserted into the episode as a throwback to the Chicago nightclub scenes often seen in gangster films. Designer Darren Marshall and Supervising Director Dave Filoni designed the headdresses worn by Snootles's backup dancers; the headdresses have been compared to those found in Director Julie Taymor's staging of The Lion King musical. Originally, Jabba the Hutt was intended to be present in the palace along with his protocol droid, TC-70. He was replaced by Gardulla late in the episode's production, and TC-70 was swapped for Gardulla's droid MF-80. TC-70 has not gone on to appear in Star Wars canon."}, {"tag": "p", "text": "In May 2010, Dan Curto of Rebelscum.com reported a rumor that Quinlan Vos would be included in The Clone Wars' season three action figure line. An image of Vos's Hasbro figure was first spotted by Yakface.com in August of the same year, and images of the character were used in official promotional materials for the series in the subsequent months. An official preview of \"Hunt for Ziro\" was included in the 121st issue of Star Wars Insider magazine (October 2010), consisting of several still images and a brief plot summary. Additionally, three official preview clips were released online by Lucasfilm Ltd. and the Cartoon Network."}, {"tag": "p", "text": "\"Hunt for Ziro\" aired on the Cartoon Network on November 12, 2010. It featured one voice actor who had never worked on The Clone Wars before: Al Rodrigo as Quinlan Vos. The episode was posted on StarWars.com three days later, and was later included in Star Wars: The Clone Wars: The Complete Season Three, which was released on October 18, 2011."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "\"Hunt for Ziro\" was received well by reviewers. Eric Goldman of IGN gave the episode a score of 8/10; although he found the horrifically obese Mama the Hutt to be awkward and the episode to be odd overall, he praised Snootles's surprise betrayal and a well-sustained action sequence between Bane and the two Jedi. Another \"Eric,\" writing for TheForce.net, also named the climactic fight as his favorite part of the episode, asserting that it felt like a scene from one of the main Star Wars films. To Eric, the episode redeemed a thus-far disappointing third season."}, {"tag": "p", "text": "Filmmaker Bryan Young, writing for Examiner.com, rated \"Hunt for Ziro\" five stars out of five, stating that it had \"just about anything I could want in an episode of Clone Wars.\" Young singled out the dance number's impressive animation, fun factor, and nod to Indiana Jones as making up for overall slow pacing and for the disappointment of Kenobi being fought to a standstill by a non–Force sensitive bounty hunter. He also favorably compared Vos to The Big Lebowski's \"The Dude,\" including his use of the line \"That's just your opinion, man.\" A review posted by \"Cameron\" at Denofgeek.com likened Vos to Han Solo, but found Snootles to be the episode's main star. Although he opined that the bizarre and inappropriate actions of Snootles and Ziro contrasted sharply with the tale of two Jedi on the hunt, Cameron concluded that \"variety is the spice that keeps the show so dynamic and worth tuning in for every week.\""}, {"tag": "p", "text": "Jawajames of Club Jade gave the episode an overall grade of Aurek (A), also praising the animation, dance number, betrayal, and climactic fight scene. Elements he disliked, though, included Ziro's unclear motivation for seeking out the holodiary, an out-of-place robot DJ, and a seeming overwrite of Sy Snootles's existing backstory. Responding to jawajames's review, Star Wars author Pablo Hidalgo revealed that he loved both the episode and Star Wars dark comedies in general. On dauntlessmedia.net, reviewer Samuel Walters assigned \"Hunt for Ziro\" a grade of B due to its mob-movie homage, dark romance, and appearance of Quinlan Vos. He called the episode \"pure fun, pure adventure, pure entertainment.\""}, {"tag": "p", "text": "Jan Duursema, an artist who had collaborated with Ostrander on many of Republic's Vos-centric issues, responded positively to the character's appearance in The Clone Wars, naming the showcasing of his flair for the dramatic and his interactions with Kenobi as highlights of an enjoyable episode. Star Wars author Daniel Wallace saw a discrepancy between the two depictions of Vos, however, calling the Republic version \"brooding and stoic\" and The Clone Wars' version as \"an overenthusiastic bull in a china shop.\" Before the episode aired, Ostrander stated that a potentially alternate take on Vos was within the purview of Star Wars creator George Lucas, who ultimately owned the character. Like Duursema, he was pleased to see one of his comic book characters make the jump to Star Wars television."}, {"tag": "p", "text": "In April 2011, the 125th issue of Star Wars Insider included an article titled 50 Great Reasons to Rewatch Star Wars: The Clone Wars Season Three, written by Daniel Wallace, Pablo Hidalgo, and Leland Chee. \"Hunt for Ziro\" contributed six items—more than any other episode—to the list: Quinlan Vos's rudeness and the script's The Big Lebowski reference; the sensational musical number; the presence of a mummified Hutt; the slyness of Sy Snootles; the battle between Bane, Kenobi, and Vos; and the outrageous character of Mama the Hutt."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Quinlan Vos went on to appear in just one additional episode of The Clone Wars: the sixth season episode \"Destiny\", as one of many Jedi gathered around Coruscant's Jedi Temple in a vision experienced by Jedi Master Yoda. He also appears in the Star Wars: Clone Wars Adventures MMORPG. An action figure of Vos, complete with his speederboard, was produced by Hasbro as part of their Star Wars: The Clone Wars toyline."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}