{"url": "Hunted", "categories": ["Category:Real-world articles", "Category:Canon films"], "nodes": [{"tag": "h1", "text": "Hunted"}, {"tag": "p", "text": "\"Hunted\" is a CG short produced by Industrial Light & Magic featuring the character Varko Grey, who appears in the video game Star Wars: Squadrons. The short was released on September 14, 2020."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "The Empire's retreat after a surprise attack marks yet another stumble in the wake of the second Death Star's destruction. But for one member of Titan Squadron, the battle is far from over. Squadron Leader Varko Grey finds himself as the last TIE pilot on the battlefield, hunted relentlessly by a determined New Republic X-wing in this standalone Star Wars: Squadrons story."}, {"tag": "p", "text": "Made in collaboration by Motive Studios, Lucasfilm, and Industrial Light & Magic, \"Hunted\" is set before the events of Star Wars: Squadrons, introducing you to one of the ace pilots who you'll be fighting alongside in the story to unfold."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Another retreat"}, {"tag": "p", "text": "At the Imperial dockyard above Var-Shaa, Imperial forces attempt to fend off a New Republic attack. Captain Varko Grey, leader of Titan Squadron, orders the squad to form up behind him and hold formation as they pursue Y-wings which have just destroyed a Raider-class corvette. As Grey targets a MC75 Star Cruiser, his commander, Terisa Kerrill, tells him the station is lost and orders him to call off the attack. Grey laments that the Empire is retreating again, but disengages and orders his squadron to do the same. Kerrill orders all fighters to return to the Star Destroyer Overseer for extraction, as a klaxon sounds and the ship prepares to jump to hyperspace."}, {"tag": "p", "text": "Titan Three in a TIE/sa bomber is still inbound, and Grey informs Kerrill that they still have TIEs out, but she says they will not hand another destroyer to the enemy and that the Overseer is leaving. Pursued by three A-wings, Titan Three is resigned to her fate, but Grey returns to the battle and eliminates her pursuers. She thanks him, but is hit by an X-wing and is destroyed. Grey's TIE/IN interceptor is also hit and damaged. Grey hears Kerrill giving the order to go to lightspeed, and he diverts all power to throttle, dodging debris in a desperate attempt to catch the destroyer before it jumps. With Grey just seconds from the hangar bay, one of the Overseer's shield generators explodes, and the ship jumps into hyperspace."}, {"tag": "h3", "text": "Dogfight on Var-Shaa"}, {"tag": "p", "text": "Grey's sensors pick up New Republic fighters patrolling the debris for Imperial stragglers. He quickly turns off his TIE's power systems and waits for the patrol to pass by. The searchlights of a lone X-wing become visible, illuminating the nearby debris. Grey holds his breath, and re-activates his targeting computer then opens fire. The X-wing evades the barrage and its pilot watches as the fighter spins and heads for the planet."}, {"tag": "p", "text": "Both ships enter the atmosphere, the pursuing X-wing firing its blasters then a proton torpedo. Grey evades the missile for a while, then decides he has had enough and activates countermeasures which turn the torpedo around back towards its source, forcing the X-wing to shoot and destroy it. Using his fighter's maneuverability and the cover of the clouds, Grey manages to get a good hit on the X-wing, destroying its astromech droid."}, {"tag": "p", "text": "Emerging from the clouds and evading burning debris from the battle, Grey dodges through the canyons of Var-Shaa with the X-wing close behind. As his ship takes another hit, Grey removes his helmet, and turns as the X-wing appears at his port side, the pilot turning to him and saying \"War's over, Imp.\""}, {"tag": "p", "text": "The fighters emerge from the canyon over a lake. Grey turns his fighter sharply in front of the X-wing, the slipstream of his TIE creating a huge wall of water which blinds the pilot, preventing him from seeing a rock face before he crashes into it. Heavily damaged, the engines of Grey's fighter cut out, and he calmly watches as his ship plunges into the lake."}, {"tag": "p", "text": "Grey crawls onto the lake's shore, and watches the sun setting as he recalls the pilot's words \"War's over, Imp.\" The radio in his helmet crackles into life, and Titan Squadron flies over the shore, calling Titan Leader. Grey stands, picks up his helmet, and replies to the X-wing pilot: \"It's not over yet. Not for me.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}