{"url": "Amerce", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:New Republic starships", "Category:Star Destroyers"], "nodes": [{"tag": "h1", "text": "Amerce"}, {"tag": "p", "text": "The Amerce was a New Republic Star Destroyer under construction at the shipyards of the planet Fondor during the beginning of the Yuuzhan Vong War. In 25 ABY, as the Star Destroyer was a month away from completion, Yuuzhan Vong forces attacked the shipyards. The unfinished Amerce was destroyed when enemy coralskippers committed suicide runs on the Star Destroyer and its construction site."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Amerce was a Star Destroyer. It was never completed before its destruction."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Construction on the New Republic Star Destroyer Amerce began at the Fondor Shipyards close to the beginning of 25 ABY. One of thirty Star Destroyers being created at Fondor's Orbital Shipyard 1321, the Amerce was worked on by tens of thousands of shipfitters, augmented by droids and machinery, with the work consisting of multiple double shifts in zero-g conditions. The laborers slept in Orbital Shipyard 1321, but frequent space-raid drills meant that many of the workers toiled on short rest. Foreman Creed Mitsun was one of the workers building the Amerce, leading a team of electricians. Labor on the Amerce lasted the majority of a year—at a time when the extra-galactic Yuuzhan Vong were invading the galaxy in the Yuuzhan Vong War—and the Amerce was soon estimated to be only a month away from completion."}, {"tag": "p", "text": "However, the Yuuzhan Vong attacked the Fondor system in 25.7 ABY. While the invaders' warships engaged the New Republic's First Fleet, Yuuzhan Vong coralskippers commenced suicide runs on the shipyards and the starships being constructed there. The attacks left the Amerce a holed hulk, and other New Republic warships under construction, such as the Anlage, succumbed to the attack as well. Although the shipyards suffered heavy damage, the New Republic ultimately drove off the Yuuzhan Vong with the help of the Hapes Consortium."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Amerce appeared in 2000's Agents of Chaos II: Jedi Eclipse, a novel written by James Luceno as part of The New Jedi Order series. The Star Destroyer later received an entry in The Complete Star Wars Encyclopedia, released in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}