{"url": "Hunter_(Lambda-class)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Lambda-class T-4a shuttles"], "nodes": [{"tag": "h1", "text": "Hunter (Lambda-class)"}, {"tag": "p", "text": "Hunter was a Lambda-class T-4a shuttle used by the Rebel Alliance during the Galactic Civil War."}, {"tag": "p", "text": "After the discovery of the Death Star project and, in order to learn more about it, Alliance Special Forces managed to sabotage and disable a Delta-class DX-9 stormtrooper transport that was carrying Imperial officers assigned to the Death Star as it traveled through the Corellian system."}, {"tag": "p", "text": "The Alliance sent the Hunter, along with the EF76 Nebulon-B escort frigate Inad, to capture the disabled transport. The operation was protected by three X-wings from Blue Squadron and three Y-wings from Red Squadron, flown by Keyan Farlander, Namrhe and Omin-Oreh."}, {"tag": "p", "text": "Soon after the mission began, several Assault Gunboats arrived. The Rebel fighters moved to intercept at the cost of all three X-wings. The Hunter boarded the transport and captured the officers. However while both vessels were returning to the Inad, the Imperial-class Star Destroyer Immortal arrived and began to launch fighters. An Imperial transport also jumped out of hyperspace and attempted to recapture the fleeing transport. Farlander destroyed the attacking transport, and two more which arrived shortly afterward. However, both his wingmen were shot down while attempting to keep the Imperial fighters off his tail. Namrhe was killed but Omin-Oreh was rescued but severely injured and was placed in a bacta tank shortly afterward."}, {"tag": "p", "text": "As soon as both ships had boarded the Inad, the Rebels withdrew to hyperspace. The captured military advisors were unable to reveal much information except that Bevel Lemelisk was leading the design team and that some of his team had recently traveled to Coruscant for a meeting with Grand Moff Wilhuff Tarkin. The Alliance planned an assault on their ship as they returned from the meeting."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}