{"url": "Hunter_(Star_Cabal)", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Humans", "Category:Members of the Star Cabal", "Category:Republic Strategic Information Service personnel", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Hunter  (Star Cabal)"}, {"tag": "p", "text": "Hunter was a female Human operative for the Star Cabal, who posed as a male Agent with the Galactic Republic's Strategic Information Service during the Cold War and the Galactic War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Little is known about Hunter's early life, other than she was found by Star Cabal as only a little girl. Using the Black Codex, they erased her name and homeworld from all known records. She underwent training with the Old Man on Tatooine that would allow her to pass as someone completely different through wearing a holographic disguise. Assuming a Human male persona, Hunter infiltrated the Republic Strategic Information Service and joined the team of Ardun Kothe. When Imperial Intelligence agent Cipher Nine offered to defect, Hunter met the agent on Nar Shaddaa and provided coordinates to the warehouse with the rest of Kothe's team. At this point, Hunter also leaked to Kothe the Imperial Castellan mind control performed on the Cipher Agent as well as the code word to make him utterly obedient to commands."}, {"tag": "p", "text": "Hunter accompanied Cipher Nine on a mission to recover Starbreeze from Hoth. \"He\" passed on a SIS dossier on Imperial Ensign Raina Temple to the agent, but when Temple was recruited to Cipher's team, Hunter used the agent's brainwashing code to force the agent to kill Temple if she became a liability. However, Cipher later broke free of the brainwashing with the aid of Watcher X."}, {"tag": "p", "text": "Hunter later betrayed both Cipher Nine and Ardun Kothe on Quesh, sending a bombing run to destroy the Shadow Arsenal, preventing either side from getting an advantage in the war. Cipher Nine soon learned of the existence of the Star Cabal and worked to stop them. Hunter visited the mining colony on Isen IV and, pretending to work for the Empire, performed massive sabotage, trying to frame the Empire as attackers. When Nine arrived at the colony, Hunter had left a holorecording, warning the agent against interfering with the Star Cabal's plan, or he would expose the agent's identity to anyone who had an axe to grind with them."}, {"tag": "p", "text": "After Nine had uncovered Megasecurity Ward 23 on Belsavis, Hunter sent Pashon Cortess, who held Nine accountable for his house's fall from grace, to kill the agent but he failed. Hunter later contacted Nine via holo after the agent unknowingly brought a rigged holorecording that rendered Intelligence's genetically enhanced Watchers comatose and started gloating. He then issued another warning for the agent to stop investigating, threatening to destroy everything Nine held dear. Undeterred, Nine promised to stop the conspiracy before that happens and cut the transmission."}, {"tag": "p", "text": "As Nine went to Voss to uncover the conspiracy of the Shining Man, Hunter sent Voontara Fa'athra, whom Nine indirectly got exiled from Nal Hutta, to the planet. Fa'athra kidnapped Nine's contact, Bas-Ton, who held information vital to the agent's mission to lure Nine to him, but the Cipher bested and killed him. With Nine having obtained the information from the Shining Man's starship, the conspiracy retaliates by using their influence to dissolve the Operations branch of Imperial Intelligence. Hunter then sent Nine a holomessage, revealing the truth behind Intelligence's dismantlement, and that he could not protect the agent from her colleagues anymore."}, {"tag": "p", "text": "Nine went to Corellia, where a significant battle between Republic and Empire was raging, eventually infiltrating an airship, where Hunter was throwing a \"apocalypse party\", keeping the wealthy of Corellia from doing anything constructive as their planet burned. Hunter was monitoring the agent's progress via hologram and revealed the Star Cabal's plan. Through use of disinformation, they'd trick both Empire and Republic into annihilating each other, thereby destroying both Jedi and Sith and allowing the \"ordinary\" people to rule once more. Nine dismissed the conspiracy's vision as a delusion, stating that the galaxy would remain the same, only with new enemies. Hunter then incapacitated Nine with coma gas and had his mercenaries, formerly of Eidolon Security, to interrogate the agent as to the contents of Moff Zamar's report on Imperial forces. But Cipher was actually on the airship to feed false information under torture, thereby upsetting the conspiracy's plan. Cipher then escaped the airship and fled to Capitol Square. Hunter tipped off Neyla Hawkins, who's sister Nine killed, who cornered the agent in the Military History Museum, only for Nine to kill her in turn and blew up the museum to fake their death."}, {"tag": "p", "text": "With their plan upsetted, the conspiracy convened at the Star Chamber to try to adapt. But Cipher, with the aid of the remnants of Intelligence, discovered and infiltrated the station to kill all the conspirators and obtain their secrets. Hunter soon realized his error and as Nine shot the Prince, Hunter ran off to arm the station's defenses for fear of outside attack. As the inner circle was slaughtered by the agent, Hunter jammed the agent's transmission with Keeper from the meeting room. Later, coming face-to-face at the Black Codex core, Hunter remarked that he never expected that a Imperial Cipher could threaten the entire Star Cabal. In turn, Nine called Hunter a \"sick man with sick dreams\", which he refused to believe and engaged Cipher Nine in battle, ultimately being defeated."}, {"tag": "p", "text": "At the mercy of the agent, Hunter shed her disguise. She claimed that they were very much alike and that they played \"the game\" right. Angered at how she saw manipulating people's lives a game, Nine refused to compare Hunter to the agent and executed her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Fate"}, {"tag": "p", "text": "In her final moments, Hunter tells Cipher Nine she was, depending on Nine's gender, jealous or infatuated with them. If Cipher Nine is male, he has the option of kissing her (neutral dialogue). She will commit suicide to avoid capture (light side dialogue) or if she is called a freak, which would not grant any light side or dark side points. Nine can also choose to kill her, before or after Hunter reveals her identity (dark side dialogue)."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}