{"url": "Hunting_for_Han", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: The Resistance Rises"], "nodes": [{"tag": "h1", "text": "Hunting for Han"}, {"tag": "p", "text": "Hunting for Han was the third episode of the LEGO Star Wars: The Resistance Rises series."}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "At Maz Kanata's castle on Takodana, a hooded alien demands a table in the thief's section. The bouncer responds that the section is full but offers to lead the alien to the low-life section. The hooded alien reluctantly obliges and follows the bouncer into the castle's cantina. As the alien enters the castle, he pulls out an unidentified object from his pocket. Maz Kanata meanwhile entertains the Guavian Death Gang negotiator Bala-Tik, who wants to sell her a case that is of interest to her collection of memorabilia at the back of the cantina. However, Bala-Tik then demands that she divulges the location of a \"cheat\" named Han Solo in return. Bala-Tik displays a photo of Han which arouses the other patrons."}, {"tag": "p", "text": "When Maz asks Tik what he has against Solo, the gangster responds that the latter owes him money. Bala-Tik is soon joined by Tasu Leech and the Kanjiklub gang, who claim that Han owes them several rathtars. Bala-Tik insists that Solo is his bounty. The other patrons then insist on settling their own scores with Han. Maz then asks the patrons why they still choose to do business with Han knowing his shady nature. An Ithorian replies that Han is kind of roguish and charming. The other patrons cite various grievances with Han including stolen speeders, weapons, and ships. One patron even remarks that Han shot Greedo; prompting another to interject that Greedo shot first."}, {"tag": "p", "text": "Bala-Tik attacks Tasu Leech and a brawl breaks out in the cantina. Before Maz can stop them, the patrons damage her \"Princess Leia Battle of Endor speeder bike.\" Enraged at the destruction of her property, Maz uses Skywalker's lightsaber to cut down several pieces of masonry which fall on the rowdy patrons. Bala-Tik and Tasu Leech immediately cease fighting. A hooded \"old-timer\" then tells them that Han Solo was last sighted at Jakku where his ship the Millennium Falcon had been stolen. The gangsters then depart Maz's castle and race to Jakku."}, {"tag": "p", "text": "After the gangsters have left, Maz puts away Luke's lightsaber and praises the hooded \"old-timer\" for getting rid of them. The \"old-timer\" then reveals himself to be none other than Lando Calrissian, whose voice Maz's recognizes. Maz and Lando then inspect Bala-Tik's stash of weapons which turn out to be musical instruments. The two then play with the musical instruments."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}