{"url": "Hunting_knife", "categories": ["Category:Legends articles", "Category:Cutting tools", "Category:Knives"], "nodes": [{"tag": "h1", "text": "Hunting knife"}, {"tag": "p", "text": "A hunting knife was a knife used to kill animals for food, shelter, or clothing. It was also used as a melee weapon. Some were small enough to be concealed in a boot or sleeve, while others were half a meter long. When not in use, it was often holstered in a sheath."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Near the end of the Old Republic era, Darth Bane was attacked by a number of strange crustaceans that dug through his armor and attached to his body. Bane tried to use his hunting knife which he kept in his boot to pry and carve them off his body, but to no avail. He discovered that the creatures were able to regenerate even the deep knife wounds he was inflicting upon himself in his attempts to be free of them. They eventually formed a symbiotic relationship."}, {"tag": "p", "text": "Pqweeduk carried a hunting knife while he explored various caves and jungles with his older brother Greedo. That particular knife had been given to Pqweeduk by his uncle Nok for his twelfth birthday."}, {"tag": "p", "text": "A hunting knife was used in an attempted murder by Finn Darktrin, an undercover agent working for the Galactic Empire. He used his hunting knife, which he kept in his sleeve, to stab Dusque Mistflier, a woman who had fallen in love with him. Dusque survived the incident and joined the Alliance to Restore the Republic after being rescued by Luke Skywalker."}, {"tag": "p", "text": "Grif Grawley, a Human farmer, carried a hunting knife with him. It was half a meter long, and the blade was fashioned from diamond-hard hull metal. Grawley used this blade during what would prove to be a fatal encounter with probe droid AD-43 while on a mission to stop Dark Jedi Jerec from harnessing the power of the fabled Valley of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}