{"url": "Hurati", "categories": ["Category:Legends articles", "Category:Captains", "Category:Males", "Category:Separatist officers", "Category:Umbarans"], "nodes": [{"tag": "h1", "text": "Hurati"}, {"tag": "p", "text": "Hurati was an Umbaran male who served as a captain in the Confederacy of Independent Systems during the Clone Wars, under the command of the former Mandalorian mercenary Ghez Hokan. Hurati was more disciplined than his other subordinates and bore a military manner that Hokan appreciated. As a result, the Mandalorian eventually promoted Hurati to the rank of captain to replace the less-efficient Lieutenant Pir Cuvin. Along with Hokan, Cuvin, and a hundred battle droids, Hurati attempted to eliminate a small team of Republic agents on the planet of Qiilura, which included the four clone commandos of Omega Squad and the Jedi Padawan Etain Tur-Mukan. After the commandos attacked the Separatist nanovirus facility on the planet, Hurati nearly killed clone commando RC-3222 by shooting the clone from behind with a Verpine shatter gun. However, he died shortly afterwards when RC-1136, another Omega Squad commando, turned around and shot him in the head."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Separatist officer"}, {"tag": "p", "text": "Hurati, a male member of the Umbaran species, held the rank of second lieutenant and served under the command of former Mandalorian mercenary Ghez Hokan, based on the Mid Rim world of Qiilura by 22 BBY, in the first months of the Clone Wars. Their militia was employed by the Confederacy of Independent Systems, along with a hundred battle droids, helping to protect Lik Ankkit, the Neimoidian who governed the planet, and a team of Separatist scientists. When a unit of clone commandos, Omega Squad, arrived on Qiilura to eliminate the Separatist nanovirus research facility that was located there, Hurati and his superior, Lieutenant Pir Cuvin, were given the task of finding and eliminating them. The clone commandos successfully fought off a unit of battle droids and their Aqualish captain, the remains of which were eventually located by Hokan and his men. The two Umbaran lieutenants searched the site of the skirmish, and Hurati located the remains of several droids left by the commandos. The clones had put together a pile of droid parts as a sign to RC-1136, a commando who had become separated from the rest of Omega Squad, that the squad had been there, in case he happened to find it. Hokan saw the droid parts as an attempt by the commandos to taunt his forces."}, {"tag": "p", "text": "Hurati was ordered by Hokan to declare a curfew on all repulsorlift vehicles after that incident. The Umbaran was concerned about the local farmers that needed to transport their crops to the town of Teklet for shipping, but the Mandalorian mercenary gave the order anyway, believing that the farmers could use handcarts. Hokan's forces later began burning fields near the nanovirus facility to give the clones the impression that they wanted to defend it, although the research team had actually been relocated. Hurati explained the plan to Cuvin when the lieutenant did not understand their actions. Together with Hokan, the Umbaran also analyzed the locations of the encounters with the commandos that had occurred and the two determined that the group was moving towards Teklet. Hokan, who viewed Cuvin to be incompetent, took Hurati some distance away from Cuvin shortly after that and told him to keep an eye on the lieutenant. Hurati agreed to carry out the task."}, {"tag": "h3", "text": "Final actions and death"}, {"tag": "p", "text": "Cuvin disappeared at some point, which Hokan presumed to be a desertion, and promoted Hurati to the rank of captain as his replacement. By then, the rest of Omega Squad had met up with RC-1136 and a Jedi Padawan by the name of Etain Tur-Mukan. When some of the clones infiltrated the facility that the research team was in, Hokan and the captain were split off from the head scientist Ovolot Qail Uthan as a result of the emergency doors suddenly shutting. The commandos were able to get Uthan out through underground tunnels that they used to enter the facility before Hurati managed to get the doors open by slicing the controls. But the pair did locate the team of four scientists that the clones did not capture and decided to move them out of the facility before more commandos could arrive. However, the clones had planted explosives throughout the building, which they set off as the Separatists fled. The captain and Hokan managed to escape in time, but the scientists were too scared to run when they heard the clones firing in their general direction and were killed in the explosion."}, {"tag": "p", "text": "The pair were able to catch up with Omega Squad and the Jedi shortly after their attack on the facility, at which point Hurati shot one of the commandos, RC-3222, with a Verpine shatter gun, although the clone ultimately survived. Several seconds later, RC-1136 turned around and shot Hurati through the head, killing the Umbaran. Hokan was also killed, not long after his Umbaran comrade. With the facility destroyed and the Separatist presence eliminated, the commandos' mission was accomplished and they left the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hokan considered Hurati to be a competent and reliable officer. When they were investigating the destroyed droids, Hurati sprinted over to the former Mandalorian to give his report, which Hokan appreciated and took as a sign that the Umbaran was enthusiastic to get Cuvin's rank. Hurati always stood with a military posture, even when not being under scrutiny, something which caught Hokan's attention. The former Mandalorian initially considered him, along with Cuvin, to be \"academy theoreticians\", but over time he came to consider Hurati to be a competent and loyal officer. When Hokan ordered him to declare a curfew on all repulsorlift vehicles, Hurati showed concern about the local farmers being unable to transport their crops. He was also willing to keep an eye on Cuvin for Hokan and later informed his former Mandalorian superior that he did not think the lieutenant would \"make captain.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hurati made his first and only appearance in Karen Traviss' 2004 novel Republic Commando: Hard Contact, and later received a mention in an entry for Ghez Hokan in the The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}