{"url": "Hurlo_Holowan", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Kuati", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Hurlo Holowan"}, {"tag": "p", "text": "Hurlo Holowan was a female Human droid designer and engineer from Kuat and the daughter of a wealthy merchant house patriarch. She designed the Razor Eater, the fiercest killing machine ever seen on the planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Holowan was the creator of the sophisticated droids that piloted Groodo the Hutt's counterfeit Sun Runner, a replica of the ancient colonial transport from the Darpa sector. She also was the engineer and controller of the Hutt's Droid Control Army that attempted the takeover and destruction of the Fondor Spaceport and the planet's major surface facilities."}, {"tag": "p", "text": "Soon thereafter, Holowan was hunted down by both Jango Fett, the bounty hunter who was hired by Darth Tyranus to take the droid engineer alive, and hunters Cradossk and his son Bossk, who were simultaneously hired for the job (but to bring in her head) by Wat Tambor, Foreman of the Techno Union and a member of the Separatist Council. Fett, in the end, was the one to achieve the task, by subcontracting the job to fellow hunter Zam Wesell, and he turned Holowan over to Darth Tyranus alive. The Sith Lord, impressed with the concept of the Sun Runner scheme hatched by Groodo, Senator Rodd and Holowan—and with the ingenuity, ambition, talent, and secrecy they demonstrated—wished to recruit them to his cause."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hurlo Holowan, a Kuati with an aristocratic heritage, was cunning, intelligent, and very wealthy. With short dark hair and extremely pale skin (she rarely exposed herself to sunlight), and despite her privileged background, Holowan characteristically wore a drab, gray uniform."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}