{"url": "Hurley_Klakk", "categories": ["Category:Legends articles", "Category:Corellian Security Force officers", "Category:Corellians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Hurley Klakk"}, {"tag": "p", "text": "Hurley Klakk was a Human male Corellian Security Force agent who lived on Corellia during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hurley Klakk was a friend of Lieutenant Mack Jasper, a CorSec officer in Coronet City. After the Battle of Yavin, the Corellian Security Force started an investigation against the Chirq Council following the increase of ryll traffic on Corellia. Circa 1 ABY, Captain Vitala Baize successfully infiltrated a CorSec agent in Jzoro Quanera's Chirq Council cell in Doaba Guerfel and managed to obtain the identity of the nine Chirq Council elite councilors and the locations of their two secret headquarters. The Corsec thus assaulted the First and Second Elite Council Bunkers near Doaba Guerfel. Agent Hurley Klakk was assigned to the attack on the Second Elite Council Bunker, along with agent Chun Solso. Agent Klakk was tasked to hamper the production of battle droids being developed by the Chirq Council: the Chirq Council Mechanized Guardians. He thus hired an independent spacer who previously worked for the CorSec to help him in his mission. Klakk thought that the best way to achieve the objective was to destroy the droids already built; and the spacer successfully destroyed them. Eventually, the Chirq Council splintered after all the Chirq Council elite councilors were killed by the CorSec in the Elite Council Bunkers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hurley Klakk was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Hurley Klakk was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}