{"url": "Hurrim", "categories": ["Category:Legends articles", "Category:Hurrim starships", "Category:Pirate organizations"], "nodes": [{"tag": "h1", "text": "Hurrim"}, {"tag": "p", "text": "The Hurrim were an Outer Rim based pirating group, led by Golov Nakhym, which had a mutual agreement with Dunari and the Rebellion in 3 ABY until an incident in the Nezni system."}, {"tag": "p", "text": "The Rebel Alliance had formed a cargo-sharing pact with notorious gambler and owner of the casino Dunari's Rest—Dunari, who hired the Hurrim for protection and paramilitary operations. The Hurrim requested Dunari and the Alliance's assistance in hitting a civilian cargo convoy flying through the Nezni system. The Alliance battleship Liberty, under Admiral Yamarus, complied and sent a starfighter squadron including Ace Azzameen and Olin Garn to assist."}, {"tag": "p", "text": "The capture of the cargo was successfully completed, until the bloodthirsty Hurrim revealed their true colors, firing on the helpless civilians. Dunari and the Alliance, horrified, ordered the squadron to attack the Hurrim, effectively chasing them off—though both Dunari and the Alliance's reputations were badly tarnished."}, {"tag": "p", "text": "Dunari defiantly removed the Hurrim from his agreement, placing bounties on them. Consequently, this Preybird flying group not only continued to \"liberate\" cargo in the name of the Alliance but also revealed the agreement between Dunari's Rest and the Rebel Alliance, and the Imperial-class Star Destroyer Corrupter, under Admiral Garreth Holtz attacked the casino, while the Liberty and her squadrons covered the evacuation."}, {"tag": "p", "text": "Fed up with the Hurrim, the Alliance and Dunari launched a full-scale assault on the Hurrim's nearby asteroid base, rescuing Dunari's men and destroying the station, while capturing the notorious Golov Nakhym. A late rescue attempt by the Corrupter failed, and the Star Destroyer and the Hurrim were left in tatters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}