{"url": "Hutt_Council_Chamber/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Nal Hutta locations"], "nodes": [{"tag": "h1", "text": "Hutt Council Chamber"}, {"tag": "p", "text": "The Hutt Council Chamber was the meeting place of the Hutt Ruling Council. Throughout the history of the Council, the Council used different chambers as their meeting place; during the Clone Wars the Council met in Gardulla the Hutt's Palace, on Nal Hutta. The Council Chamber was not to be confused with the Grand Council Hall on Nal Hutta, which was an expansive chamber that hosted the meetings of the Hutt Grand Council."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "During the Clone Wars, Council Chamber was a circular room that was open at the front and higher upper towards the back. Much of the chamber and its architectural details were built from natural material like the rest of Gardulla's Palace. In keeping with the Hutts' taste for murky atmosphere, the chamber was dimly light, leaving much of the room in darkness. An opening in the ceiling overhead was the only source of natural light. A spot light system used during musical numbers also hung overhead. Several fire pits along the back of the chamber also provided light. The entrance doors were marked with the symbol of the Desilijic Clan. Several banners hung down the walls of the chamber. Along the right side of the chamber was a circular entryway that lead to dressing rooms used by the performers who entertained the council. To the left side of the entrance doors was a control station where the DJ Rang Thang conducted the music and lighting for musical performances."}, {"tag": "p", "text": "At the center of the camber was the large sunken almost pit like space where those who wished to address council or the council wished to address would stand. Curved along this space was a wooden table where the members of the Hutt council met. This table was raised and those sitting at it would be able to look down at whoever was before the council. Access to the space behind the table was by use of a set of stairs on the left of the counter and a ramp on the right. A series of banners that depicted the council member's Kajidics on the table's front. Set between each banners was one of five Abyssinian ornamental gargoyles."}, {"tag": "p", "text": "The table was long enough for each Hutt to have their own personal space and not crowd one another. On the top of the table was a small personal console located on the each Hutt's left hand side and Hookah pipe where were often kept on each Hutt's right hand side. Dancers often performed for the Hutts on the table's top and lie about on the table. Holoprojectors located behind the table allowed members to attend council meetings when they were off world. The space behind the table was ample enough for each member to kept several bowls of food besides themselves and for their servants and droids to move about as they attend to their masters."}, {"tag": "h3", "text": "Security"}, {"tag": "p", "text": "The Council Chamber was protected by Gardulla's Nikto and Gamorrean guards. Usually the guards were not stationed in the chamber itself. Additional security was often provided by the numerous bounty hunters who worked for Jabba and other council members."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Council chamber was the meeting place for the Hutts that headed the Five Hutt Families. Here, the council would discuss important matters and decide upon the numerous regulations and laws that would govern all of the Hutt clans and Hutt Space. Those who had violated Hutt law where brought here to answer for their actions."}, {"tag": "p", "text": "In 22 BBY Ziro Desilijic Tiure was brought before the council after Cade Bane broke him out of Republic custady and imprisoned in on of the holding cells in Gardulla's palace as they where afraid he would release the records of the council's dealings. Later Jedi Knights Obi-Wan Kenobi and Quinlan Vos]] appeared before the Council and informed them of Ziro's escape."}, {"tag": "p", "text": "Later in 20 BBY the Shadow Collective, led by Darth Maul and Pre Vizsla arrived at the Council Chamber to ask the Hutt Council about joining them. A battle between the Collective and the council's guards and bounty hunters broke out when the Hutts refused to join. A few Twi'lek and Nikto guards were killed in the chamber itself during the battle. Soon after, the table was set on fire by Pre Vizsla. The outcome of the whole battle was that all the guards were killed, and Oruba was executed."}, {"tag": "p", "text": "The chamber also served as a place for musical performances by the likes of Sy Snootles and other entertainers who performed for the Council's amusement. One of Sy Snootles' performances before the council was Da Hutt Moda."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Clone Wars director Dave Filoni compared the Da Hutt Moda dance sequence in Hunt for Ziro to the musical numbers seen in old gangster movies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}