{"url": "Hutt_Empire", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Hutt organizations", "Category:Interplanetary governments", "Category:Pre-Republic"], "nodes": [{"tag": "h1", "text": "Hutt Empire"}, {"tag": "p", "text": "The Hutt Empire was a large pre-Republic empire in the Outer Rim that arose to be a galactic power. The empire was founded and ruled by the Hutts using economic means as a way to control it population."}, {"tag": "p", "text": "It rose to power after the fall of the Infinite Empire that was founded before the formation of the Republic that was once the dominant power in the galaxy."}, {"tag": "p", "text": "But it power would fade, forcing it to adopt a new philosophy known as kajidic and to advocate indirect control through commerce and, as it developed, the criminal underworld, the Hutt Cartel, while the crime lords continued to maintaining their political base as means to an end."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Conquests and expansion"}, {"tag": "p", "text": "Between the fall of the Infinite Empire and the rise of the Galactic Republic, the Hutt Empire was the major power in the galaxy, although its influence was primarily economic; the Hutts generally seemed to regard political or military conquest as less important than control of commerce."}, {"tag": "p", "text": "Despite this, the Hutts could be ruthless warriors when necessary, enslaving those species they considered useful and exterminating those they did not. One of the few species in Hutt Space that escaped either of these fates were the Sakiyans, who won the Hutts respect and kept their independence in exchange for tribute payments. The histories of ancient Rim worlds like Delacrix and Rinn recorded the fate of planets caught between feuding Hutt clans or offended the Hutts, and had been depopulated, poisoned, bombarded or incinerated."}, {"tag": "h3", "text": "War with the Tion"}, {"tag": "p", "text": "One of the greatest expressions of Hutt militarism was the war against Xim the Despot. During Xim's reign his own empire attempted to vanquish the Hutts and rule the Si'Klaata Cluster, resulting in the Xim Wars. However, the Hutt Empire made a pact with the Nikto, Klatooinians and Vodrans. This new slave army was crucial to the Hutt victory at the Third Battle of Vontor circa 25,100 BBY which saw the defeat of Xim's War-Robots."}, {"tag": "p", "text": "Following the battle, the Treaty of Vontor was signed by the Hutts, Klatooinians, Vodrans, and Nikto. This treaty set the Hutts up as eternal overlords of the three other species and of the Si'Klaata Cluster. The Hutts then launched a devastating invasion of the Tionese colonies in the Kiirium Reaches known as the Devouring, which utterly obliterated and depopulated the Tionese empire there, leaving an uninhabited stretch of space that from then on would be known as the Ash Worlds"}, {"tag": "p", "text": "During the Tionese War in 24,000 BBY, the Galactic Republic won its war against the Honorable Union of Desevro & Tion (one of the feuding states that rose from the ashes of Xim's empire a millennium after his death) by using its agents to stir up trouble in Hutt Space. This worsened the divide between the Hutts and Tionese."}, {"tag": "h3", "text": "Decline"}, {"tag": "p", "text": "After the devastating civil war known as the Hutt Cataclysms of 15,000 BBY, the Hutt Empire collapsed, with their destruction of their homeworld Varl, moved to Nal Hutta and all that was left became known as Hutt Space, with Nal Hutta as the new capital. In the aftermath, the Hutts under the leadership of Budhila Hestilic Amura established a Council of Elders to mediate clan disputes and adopted a new philosophy known as kajidic. This was a pragmatic renunciation of war and conquest, instead advocating indirect control through commerce and, as it developed, the criminal underworld, becoming the Hutt Cartel."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Hutts influence continued to be a galactic power in reduced form until the territory's demolition in 26 ABY by the Yuuzhan Vong empire during their extra-galactic invasion. After their defeat in 29 ABY, the Yuuzhan Vong had left the oversector in anarchy for at least twelve years, but the untouched Bootana Hutta world of Mulatan became the domain and sector's third capital in the aftermath of the war. By 41 ABY it had mostly recovered and joined the Confederation and thus the Hutts, had once again, dominated the oversector and beyond, at least up until the time of the New Galactic Empire."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "This empire was based mainly in the Outer Rim though it also covered a portion of the Mid Rim. The Hutt Empire was near the Tion Hegemony and occasionally both fought."}, {"tag": "p", "text": "The major trade routes of the Hutt Empire included the Pabol Hutta, the Pabol Sleheyron, and the Pabol Kreeta. The route that would be known as the Pabol Hutta reached from Varl to Boonta. The Pabol Sleheyron crossed the Pabol Hutta at Sleheyron from Nimban to Formos."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "By 0 BBY, very few records survived of the Hutt Empire's military forces. Ancient Sakiyan chronicles recorded Hutt cavaliers armored with iron shells and maneuvering via metal limbs, treads or wheels. These would later be compared to the Shell Hutts of Circumtore. Sakiyan tribute-counts also recorded payments for the Sakiyans' assistance in building Hutt planechanga - massive tubular rail guns built to accelerate asteroids to planet-destroying velocities."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic, Bastila Shan says the Hutts never built an empire. The opposite is stated in Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}