{"url": "Hutt_Flats", "categories": ["Category:Canon articles", "Category:Mos Espa podrace circuit locations", "Category:Plains"], "nodes": [{"tag": "h1", "text": "Hutt Flats"}, {"tag": "p", "text": "Hutt Flats was a region of desert located on the planet of Tatooine. It was once the bed of the prehistoric Lake Anre, which, via underground tributaries, ran to the Northern Dune Sea. During the final decades of the Galactic Republic, podracing circuits ran through the flats from the Mos Espa Grand Arena, which was built within the regions boundaries. The Boonta Eve Classic podrace included the Hutt Flats as its final segment, and it was here that the podracers Anakin Skywalker and Sebulba faced off in their vehicles during the third lap of the race. After the two pilot's vehicles became entangled, Sebulba's engine became disconnected from his pod, causing his vehicle to crash and leaving Skywalker to claim victory."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Once the bed of the prehistoric Lake Anre, the Hutt Flats was a wide expanse of flat desert located beyond one end of the mountain known as Ben's Mesa and surrounded on several sides by high cliff walls on the planet Tatooine. One entry point into the flats was the canyon entrance known as the Devil's Doorknob, which connected the desert to the canyon known as the Corkscrew. A canyon which ran through the region known as the Waldo Flats also opened out into the Hutt Flats and connected them to the Mushroom Mesa."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point after the Lake Anre dried out and left the flats, the Mos Espa Grand Arena was built in one corner of the flats, and a podracing circuit was established which passed through the flats as its final section. Because the Hutt Flats was the final portion of any race on the circuit, it often brought out the worst behavior in podracers as they battled for final placements in race. The Dug podracer Sebulba, who raced on the circuit in the final decades of the Galactic Republic's reign, often used the size and weight of his large podracer to try and force other pilots out of races while they flew through the flats, often pleasing the crowds viewing the race in the process."}, {"tag": "p", "text": "Thirty-two years before the Battle of Yavin, the Boonta Eve Classic podrace was hosted out of the Mos Espa Grand Arena, and included the Hutt Flats as the first and final portion of each of its three laps. Racers headed straight from the arena through a small portion of the flats and straight into the Waldo Flats canyon before making their way around the entirety of Ben's Mesa and back out into the flats through the Devil's Doorknob. During the second lap of the race Xamster pilot Neva Kee left the circuit while traveling through the Hutt Flats and disappeared completely, his where abouts after the race unknown."}, {"tag": "p", "text": "In the final lap of the race the two front runners, Sebulba and Anakin Skywalker entered the flats together, vying for first place. As he had done in the past Sebulba attempted to ram Skywalker's smaller vehicle. Piping from the Dug racer's pod became caught on the machinery of Skywalker's engines and the entanglement trapped the two vehicles side by side. Attempting to pull away, Sebulba loosened a part of his podracer and seeing his chance Skywalker accelerated away, tearing parts from Sebublba's vehicle and causing the left engine to separate from the pod and the other engine. Both engines quickly plunged into the floor of the flats and exploded, while the pod containing Sebulba was hurled ahead, leaving the Dug alive, but very much out of the race. Skywalker went on to win the race, leaving the five other pilots who made it to the end of the third lap to pass through the flats and claim their rankings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Hutt Flats first appeared in the 1999 film Star Wars: Episode I The Phantom Menace, in which the desert area was the setting for the finale of the podrace section of the film, but went unnamed. They were then identified on a map of the entire podracing circuit from the film included in the Star Wars Legends reference book Inside the Worlds of Star Wars: Episode I, which was written by Kristin Lund and released in 2000. The name was confirmed to be canon when it was used in the Star Wars: Complete Locations reference book released in 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}