{"url": "Amilyn_Holdo", "categories": ["Category:Canon articles", "Category:Semi-protected articles", "Category:Articles in need of updating", "Category:Alliance Fleet captains", "Category:Apprentice Legislators", "Category:Females", "Category:Gatalentans", "Category:Humans", "Category:LGBTQ+ individuals", "Category:Resistance admirals and generals", "Category:Resistance High Command members"], "nodes": [{"tag": "h1", "text": "Amilyn Holdo"}, {"tag": "p", "text": "Amilyn Holdo was a human female politician, military commander, and freedom fighter who served in both the Alliance to Restore the Republic and the Resistance. Known for her unconventional strategy and eccentric style, she was an early participant in the rebellion against the Galactic Empire and a lifelong friend and ally to rebel leader Leia Organa of Alderaan. In the early days of the First Order/Resistance War, Holdo became the commanding officer of the Resistance fleet as it fled the overwhelming might of the First Order Navy. Her leadership in that role saved the Resistance and many of its heroes when she executed a historic suicide attack on the First Order fleet, later dubbed the Holdo maneuver."}, {"tag": "p", "text": "A native of the planet Gatalenta, Amilyn Holdo had an early career in public service as a delegate to the Imperial Apprentice Legislature program. During her term, Holdo was notably critical of oppressive Imperial policy and developed a close relationship with the like-minded Alderaanian Princess Leia Organa. Through Organa, she became involved in the operations of the insurgent Rebel Alliance in opposition to the Empire during the Galactic Civil War. Although she initially served as a civil minister, Holdo proved herself as a capable martial commander and was granted an officer's commission in the Alliance Fleet."}, {"tag": "p", "text": "Decades after the Alliance's victory over the Empire, Holdo was again recruited by Organa—this time to join her paramilitary Resistance movement against the rise of the neo-Imperial First Order. Holdo served then-General Organa during the Cold War as a vice admiral of the Resistance fleet, undertaking clandestine missions to prepare for open war. After the war erupted in 34 ABY, Resistance High Command was decimated, leaving Holdo as the highest ranking officer in charge of the remaining Resistance forces as they fled from the pursuing First Order armada and its mobile headquarters, the Supremacy."}, {"tag": "p", "text": "Unable to escape into hyperspace and low on fuel, the remaining Resistance personnel consolidated under Holdo's command aboard the flagship star cruiser Raddus. Holdo's singular focus on escape was controversial among some younger soldiers like Captain Poe Dameron, but the vice admiral successfully led the Resistance to the mineral world of Crait, where she intended to sneak the survivors to the surface aboard cloaked transports. Due to an information leak during an attempted mutiny, the First Order ascertained her plan and destroyed nearly all of the Resistance transports. In a stunning act of sacrifice, Holdo saved the Resistance from complete obliteration by jumping the Raddus directly into the First Order fleet, resulting in a lightspeed collision that destroyed the Resistance flagship, the Supremacy, and twenty Star Destroyers. Holdo's actions allowed the remnants of the Resistance to escape, ensuring the continuation of an organized opposition to the First Order's fascist regime."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rebellious youth"}, {"tag": "p", "text": "Amilyn Holdo was human female born on the planet Gatalenta in the Core Worlds around the early days of the Galactic Empire's reign. As a child, she enjoyed spelunking and high-speed tobogganing, and she became a skilled practitioner of the Gatalentan calisthenics practice skyfaring. The young Holdo also studied astrology, public service, and philosophy. She found herself at odds with Gatalentan aesthetics and traditions of simplicity and tranquility, instead embracing eccentricities and seeking out danger."}, {"tag": "p", "text": "In 3 BBY, Holdo was set to represent Gatalenta in the Apprentice Legislature, a junior deliberative program in the Empire to train youth in politics on the Imperial capital world of Coruscant. In the lead-up to their first legislative session, Holdo and several other members of the Apprentice Legislature were invited by Queen Breha Organa of Alderaan to participate in a pathfinding class, wherein students would learn survival techniques through challenging expeditions in natural environments. Holdo's first pathfinding course was in Alderaan's Istabith range and led by Chief Pangie of the Chandrilan Pathfinding Corps. During their orientation at the pathfinders' chalet basecamp, Holdo met several of her fellow classmates and soon-to-be apprentice legislators, including Chassellon Stevis of Coruscant, Harp Allor of Chandrila, Sssamm Ashsssen of Fillithar, and Alderaan's delegates Kier Domadi and Princess Leia Organa."}, {"tag": "p", "text": "During the introductory pathfinding class, Chief Pangie left the students deep within the frozen Istabith range, charging them with returning to the chalet by nightfall using only their observational skills to guide them out of the wilderness, or risk being expelled from the class. When her fellow student Harp Allor broke her leg during the return hike, Holdo committed to helping Allor back to the chalet alongside students Ashsssen, Domadi, and Organa; Stevis meanwhile led the rest of the class onward, refusing to slow down for their injured classmate. Holdo's crew progressed slowly back down the range and were in danger of missing their nightfall deadline, but the young Gatalentan's unconventional thinking saved them from failure when she thought to convert her expandable emergency tent into an ad hoc toboggan that could carry all five members of her troop downhill."}, {"tag": "h4", "text": "Apprentice Legislator"}, {"tag": "p", "text": "In the days following her first pathfinding class on Alderaan, Holdo moved to Coruscant and took residence in dormitories for members of the Apprentice Legislature. She was present for the legislature's opening ceremonies in the Senate complex, where she witnessed an introductory speech by Grand Moff Wilhuff Tarkin. Her gaudy wardrobe and peculiar behavior at the following reception contributed to Holdo's growing reputation for eccentricity among her fellow delegates."}, {"tag": "p", "text": "Holdo participated in the first formal session of the Apprentice Legislature the next day, where she introduced to her colleagues her passion for astrology and participated in a debate over where Galactic Emperor Sheev Palpatine should charter a new Imperial academy for aeronautical engineering and design. The debate was focused on four potential sites: Iloh, Harloff Minor, Lonera, and the impoverished world Arreyel. Princess Organa argued in favor of selecting Arreyel and convinced a winning margin of delegates to support the proposal. Weeks later, Holdo learned that the Apprentice Legislature received a special commendation for their selection of Arreyel after early surveys for the academy revealed massive sub-surface radiation sources. The discovery triggered an Imperial effort to displace the local populace within six weeks so the Imperial Military could blast away the surface and build sprawling planet-wide factories on Arreyel. Holdo was devestated by the development shared her disappointment with Organa and Domadi, both of whom were also opposed to the brutal authoritarianism of Palpatine's reign."}, {"tag": "p", "text": "In a later session, the Apprentice Legislature was tasked with determining which punitive sanctions would be levied against the planet Lolet for its violation of Regulation 16-ME, which stipulated that worlds were legally required to provide fuel to Imperial pilots as needed. Holdo was opposed to any sanctions at all, arguing that Lolet's refusal to provide the fuel was reasonable, considering its economic conditions and low reserves of fuel indicated the planet was in a state of near-crisis. Her research revealed that Lolet's reserves were largely depleted after significant geological activity on one of its moons, leaving the world without the resources to support both Imperial patrols and their own people in the event of future emergencies. Holdo's argument—that no planet was legally required to imperil themselves to supply the military—was convincing for Domadi and Organa. She was opposed by delegates from Arkanis and Glee Anselm, who ridiculed her flamboyant style and accused her of treason for the mere suggestion that the Empire was not a reliable safety net for worlds in crisis."}, {"tag": "p", "text": "The episode had a deep impact on Princess Organa, who fiercely defended Holdo on the legislature's floor and motioned successfully to draft a new language proposal for the Imperial Legal Code rather than impose sanctions on Lolet for circumstances not enshrined in law. The Lolet debate and other experiences endeared Organa to Holdo, and the two became increasingly close during their terms. Holdo instructed the Alderaanian noble in Gatalentan skyfaring and helped Organa to better understand her evolving relationship with her parents and her paramour, Kier Domadi. At the time, Organa weighed whether to involve Holdo in the clandestine operations of the nascent allied rebel movement organized by her father, Senator Bail Organa, but decided against it."}, {"tag": "h4", "text": "The Princess's companion"}, {"tag": "p", "text": "During the legislative term, Holdo continued her pathfinding class with Cheif Pangie and the other delegates, attending sessions in Eriadu's Rivoche Ranges, on Felucia's jungle cliffs, and through Chandrila's vast marshlands. Their final session took them to the ocean world of Pamarthe in the Outer Rim Territories, where Holdo was partnered with Organa and the two were tasked with navigating extensive island chains via rope bridges to reach Pangie's location."}, {"tag": "p", "text": "Holdo and Organa were distracted from their objective when they discovered Senator Winmey Lenz of Chandrila—a vocal critic of Palpatine's—meeting with an Imperial Military Director in a Pamarthe spaceport to conduct a massive, off-the-record sale of quadanium steel. Organa knew Lenz to be a co-conspirator in her father's rebel network, to whom the senator was also secretly brokering sales of quadanium. While they eavesdropped on Lenz's conversation, the two girls learned that a shipment of Lenz's quadanium was imminently leaving Pamarthe for Ocahont—a world which Organa knew to be a hub for rebel operations. When Organa indicated her desire to know more about the shipment, Holdo jumped aboard the freighter bound for Ocahont, compelling Organa to stow away with her."}, {"tag": "p", "text": "En route to Ocahont, Organa revealed to Holdo that she had firsthand knowledge of an armed and organized rebel movement. Before she could reveal more, the two stowaways were discovered by a pair of Quarren crewmembers and taken to a rebel outpost on Ocahont as prisoners. There, they were presented to the outpost overseer: Chandrila's other senator and close ally of the Organas, Mon Mothma. Although Mothma was frustrated at the Princess for putting herself in a dangerous situation and revealing the rebel plot to Holdo, the senator was grateful for the girls' information about Lenz's double dealing. After the meeting with Senator Mothma, Holdo and Organa were sent back to their parents; Holdo maintained Organa's secret and did not reveal to her parents the true nature of her stowaway misadventure."}, {"tag": "p", "text": "Holdo returned to Coruscant shortly thereafter to go to a formal ball at the Imperial Palace attended by apprentice legislators and graduates from the Royal Imperial Academy. Some time after the ball, she planned to return to Gatalenta to participate in a meditative retreat, and so hired the light freighter Mighty Oak Apocalypse to ferry her from Coruscant back to her homeworld. At the spaceport, Holdo was met by Chassellon Stevis, who argued that he should be able to usurp the Mighty Oak Apocalypse's services so he could travel to an auction on Arkanis to buy a rare speeder. While the two argued, Princess Organa found them and asked Holdo if she could use the ship's services instead. Holdo recognized the urgency in Organa's request and immediately agreed to help her friend, to Stevis's irritation."}, {"tag": "p", "text": "Organa had learned that the Empire was aware of a rebel presence in the Paucris system, where Senator Bail Organa was overseeing a secret staging ground for a fledgling rebel fleet as its vessels were refitted for combat. Together aboard the Mighty Oak Apocalypse, Holdo and Organa travelled back to Pamarthe, where they planned to hire a different ship from a high-traffic spaceport to reach Paucris and warn Senator Organa that the Empire was likely to launch an imminent attack. On Pamarthe, the two girls struggled to find a willing pilot due to dangerous atmospheric and solar storms, but Organa managed to use her political connections to convince a crew of Chalhuddans to take the job."}, {"tag": "p", "text": "The Chalhuddan vessel reached the Paucris system with enough time for Organa's warning to reach her father. As the rebel fleet prepared to evacuate, Holdo and Organa briefly rendezvoused with the senator on his starship, the Tantive IV, before transferring to a small hopper transport that they could fly back to Coruscant. The Princess kept the hopper in-system while Holdo monitored the dozens of rebel ships escaping to hyperspace. After the rebel vessels left, Holdo noticed one new ship moving quickly towards the abandoned refitting stations. To her and Organa's surprise, the vessel's pilot was Kier Domadi, who had followed Organa to the Paucris system. Domadi was unaware that the stations had engaged their self-destruct mechanism and his vessel was caught in the resulting explosion. Holdo and Organa docked their ship with Domadi's badly damaged transport to rescue him, but their friend had been mortally wounded in the explosion and died."}, {"tag": "p", "text": "While Organa retrieved Domadi's body and grieved the loss of her romantic partner, Holdo flew their hopper directly to Alderaan, knowing that both of her friends needed to return to their home. Upon entering the Alderaan system, their ship was detected by Imperial authorities who suspected it was returning from the Paucris system. Holdo's knowledge of astrology helped her convincingly lie to the Imperial captain that they had instead just come from the Shili system, and was able to return Organa and Domadi safely home."}, {"tag": "p", "text": "Holdo and Organa became close friends after the death of Domadi as they leaned on one another to process the loss. Holdo took her friend skyfaring daily and attended the investiture ceremony on Alderaan where Organa formally became the world's crown princess. Publicly, they maintained appearances as loyal Imperial politicians, while privately they joined the efforts the Alliance to Restore the Republic as rebel operatives."}, {"tag": "p", "text": "Around this period, Organa offered to teach Holdo how to drive a speeder on Coruscant; Holdo accepted the lesson, both because she was an inexperienced driver and because she hoped to take Organa's speeder to the Coruscant Underworld to find an ancient, lost museum somewhere in Level 4, deep within the subterranean superstructure of the ecumenopolis. Organa was impressed with Holdo's driving skills in a practice area, but did not agree to go with her friend to find the museum, insisting that nobody could get deeper than Level 5 on Coruscant. Holdo was insistent that it was possible, and plunged the two deep into the Coruscant underbelly to find directions."}, {"tag": "p", "text": "At an underworld circus, Holdo found a Zeltron fortune teller called Lady Forzaa and pushed Organa to pay for her assistance. In exchange, Forzaa used a Liga crystal to imbue Organa's hands with a soft glow that strengthened as they approached the museum Holdo sought. Back in their speeder, Holdo took the girls deeper into the undercity, following Organa's glow, until they happened upon a group of criminals carrying out operations in the darkness. The girls were chased by the criminals on speeder bikes and managed to flee into a massive pipeline before being driven out by a thermal detonator blast and a swarm of mutant roach-rats. Holdo and Organa escaped all their pursuers and made it to the museum on Level 4, where they discovered a soaring statuary hall lit by glowing blue coral. The experience brought the two girls closer together and strengthened their resolve to advocate for those that lived deep below the heights of power."}, {"tag": "h4", "text": "War with the Empire"}, {"tag": "p", "text": "Around when the Galactic Civil War broke out in earnest in 0 BBY,  Holdo and Princess Organa left Imperial politics and joined the Alliance in open rebellion against the Empire. Holdo took on a role as a minister in the Alliance Civil Government with support from Organa, who became a leading face of the revolution. As a minister, Holdo was known for delivering anti-Imperial speeches but was otherwise distant from the Alliance Military."}, {"tag": "p", "text": "Sometime during the war, she was a passenger aboard the Alliance CR90 blockade runner Candor, a smuggling vessel travelling through deep space. While she relaxed in her quarters with the droid Tee-Six and used a Morogian snap plant to dye her hair, the Candor came under attack from an Imperial-class Star Destroyer and suffered severe damage. Holdo made her way to the bridge, where she discovered the ship's commander, Captain Jardar, was killed in the initial volley. Minister Holdo quickly began issuing orders to the stunned crew, taking command of the Candor as the highest ranking Rebel on the ship."}, {"tag": "p", "text": "Holdo overcame the bridge crew's reservations about her command when the ship was caught in the Star Destroyer's tractor beam. On her orders, the pilots reoriented the Candor towards the Star Destroyer and opened fire on its exposed hangar. The blasts burned a hole through the destroyer's hull, allowing the blockade runner's ion drives to push the ship through and out of danger. The unconventional maneuver saved the crew of the Candor and impressed Rebel command. Holdo's performance in battle proved Princess Organa's plaudits for her friend and secured her a new role as a captain in the Alliance Fleet."}, {"tag": "p", "text": "Later in the war, Holdo was embedded with the criminal syndicates of the galactic underworld to secure supply chains for the Alliance. After the Rebellion was routed and scattered during the Battle of Hoth in 3 ABY, Holdo discovered that the once-defunct syndicate Crimson Dawn had returned, and was hosting an auction of Rebel captain Han Solo on the Mid Rim world of Jekara. Solo was a companion of Leia Organa's who had been frozen in carbonite while in Imperial custody shortly after the two escaped from Hoth. Although Holdo was not in regular communication with Organa during this period, she knew the princess was searching for Solo and so left a holomessage at one of their dead drops with the news about the rebel captain, the return of Crimson Dawn, and the invitation to the auction that had gone out to the major actors in the criminal underworld. The message ultimately reached the princess's team and Holdo's information helped them find their way to Jekara to attempt a rescue."}, {"tag": "h3", "text": "Resistance leader"}, {"tag": "h4", "text": "Organa's secret war"}, {"tag": "p", "text": "The Alliance won the war in 5 ABY and established the New Republic to return democracy to the galaxy. Peace prevailed for decades, but remnants of the Empire coalesced in secret in the Unknown Regions, reorganizing into a fascist military cult—the First Order. In 28 ABY, Leia Organa left New Republic politics to take a more direct role in confronting the rising threat of the First Order with a private military vanguard known simply as the Resistance. Amilyn Holdo was one of many former Rebel leaders recruited by the newly-minted General Organa to build out the command structure for her movement. She became a Vice Admiral of the Resistance fleet during the Cold War between the New Republic and First Order, and was given command of the Free Virgillia-class cruiser Ninka."}, {"tag": "p", "text": "During the Cold War, Holdo and other Resistance leaders suspected that elements of New Republic High Command were intentionally mishandling the New Republic Defense Force to avoid taking direct action against the rising First Order. Sometime before 31 ABY, Vice Admiral Holdo was given command of a Resistance task force that included the legendary Rebel pilot Nien Nunb, and was charged with gathering information that would confirm those suspicions. The mission took Holdo and her crew to Brooksdion station, where the New Republic's Admiral Mathieson was stationed. Knowing Mathieson's protocol droid held a treasure trove of records that could substantiate the Resistance's fears about New Republic High Command, Holdo's team stole the droid's head and escaped the station aboard their unmarked passenger transport."}, {"tag": "p", "text": "Before Holdo's team could flee the area, the New Republic scrambled the T-85 X-wings of Rapier Squadron to intercept and recover the droid's head. The hyperdrive on Holdo's ship was disabled by Rapier's Commander Poe Dameron, but Holdo maintained anonymity over comms and continued efforts to flee at sublight speeds by directing her ship into Lost Souls, a deadly low-visibility asteroid field. While her team repaired the hyperdrive, Holdo and Nien Nunb guided Dameron through Lost Souls, refusing to reveal their identity but ensuring the New Republic commander was able to safely traverse the region. The Vice Admiral had previously travelled through Lost Souls and could adeptly navigate its lethal Exogorth infestation and Clone Wars-era mine defenses. By the time the Resistance ship and their pursuer emerged from the asteroid field, Holdo's crew had repaired the hyperdrive. Nien Nunb efficiently shot and damaged Dameron's snub-fighter, preventing him from continuing the chase. After warning Dameron about the dangerous inaction of the New Republic, Holdo's team jumped to hyperspace to take their captured evidence back to the Resistance. Dameron returned to Rapier Squadron, unaware of the identity of his escaped quarry."}, {"tag": "h4", "text": "Bomber command"}, {"tag": "p", "text": "As Vice Admiral of the Resistance fleet, Holdo also oversaw the operations of several starfighter and bomber groups attached to the Ninka, including Blue Squadron and Crimson Squadron. She and Admiral Gial Ackbar both welcomed the Otomok system refugees Rose and Paige Tico into the Resistance after their escape from the First Order blockade of their home; the two sisters joined the bomber teams of Cobalt Squadron and went on to serve under Holdo for multiple relief and reconnaissance missions."}, {"tag": "p", "text": "Holdo was present aboard the Ninka when Blue Squadron, under the command of Lieutenant Tallissan Lintra, scrubbed a training mission due to sensor interference from a nearby ionized gas cloud. While the rest of the squadron returned to the Holdo's cruiser, Lintra followed a distress signal into the cloud. Despite flying blind through the nebula, the lieutenant successfully located the source: a lost freighter crewed by a lone Duros pilot, Staaysha Dekkr. Lintra helped guide the vessel back to Blue Squadron and the Ninka, and brought the pilot on board to meet Vice Admiral Holdo. Dekkr was deeply thankful to the Resistance for Lintra's response to the distress signal, and promised to share with Holdo a map of the nebula compiled by Duro Interstellar Freight and Shipping."}, {"tag": "p", "text": "By 34 BBY, tensions between the First Order and the Resistance were at a fever pitch as the First Order became exceedingly aggressive in its expansion. In the Cassander sector, Holdo commanded the Ninka and the MG-100 StarFortress bombers of Cobalt and Crimson squadrons against a pirate force based on Sheh Soahi that was suspected of acting as a proxy for the First Order. Working alongside Lieutenant Lintra and bomber commander Fossil, Holdo led the Resistance to victory over the Sheh Soahi pirates, all while avoiding direct engagement with patrolling First Order forces. The Resistance win in Cassander space foiled the First Order's ambitions in the sector and provided confirmation that the enemy was supplying arms and resources to pirate forces."}, {"tag": "p", "text": "After the Cassander campaign, Holdo joined General Organa and Commander Fossil at the Resistance's secret base on D'Qar to discuss the First Order lockdown of the Atterra system. Using intelligence gathered by Cobalt Squadron and reconnaissance efforts by Rose and Paige Tico, Holdo and Organa worked with Casca Panzoro of the Atterran insurgent group Bravo Rising to devise a plan for their StarFortress bomber squadrons to covertly deliver relief supplies and armaments to the beleaguered people of Atterra Bravo. Although Holdo did not plan to go to Atterra herself, she advised on the relief campaign and joined Organa and Panzoro to brief the bomber teams of Cobalt and Crimson squadrons on their objectives."}, {"tag": "p", "text": "While Holdo monitored the Atterra campaign, open war erupted. At the behest of Supreme Leader Snoke, the First Order destroyed the Hosnian system using a new superweapon in the Unknown Regions: Starkiller Base. The base launched a cataclysmic energy beam through sub-hyperspace all the way into the Core Worlds, vaporizing the New Republic capital world of Hosnian Prime, all other worlds in the system, and the New Republic home fleet. The attack obliterated the New Republic as a government and military entity, leaving the Resistance as the only organized opposition to the First Order. General Organa immediately marshalled the forces of the Resistance for a counterstrike against Starkiller Base, but Holdo and the bombers of Crimson and Cobalt Squadron were too far afield to join the assault."}, {"tag": "p", "text": "Although Resistance agents were able to destroy the superweapon, the Hosnian Cataclysm was only the first sortie in the war. As First Order armadas and legions of stormtroopers moved quickly to conquer the galaxy, General Organa recalled Holdo and all other Resistance forces to D'Qar to assist in an emergency evacuation effort. After the StarFortress bomber teams finished their successful final runs to Atterra, Holdo met them at their staging location on Refnu in the Outer Rim to brief them on the events surrounding the firing of Starkiller Base. She explained the situation on D'Qar, and that she would be commanding the bomber teams and a starfighter escort in defense of Resistance forces as they fled their secret headquarters. She also recruited Rose Tico to join her crew aboard the Ninka after learning of the mechanic's impressive work with baffler technology during the Atterra operation. At Holdo's behest, Tico taught the Ninka's crew how to adapt her bafflers, which masked the energy signature from starship engines to cloak vessels from detection."}, {"tag": "p", "text": "After the Ninka resupplied the eight StarFortress bombers with ordnance in the Refnu system, Vice Admiral Holdo led her attack force to D'Qar, where they joined the other remaining elements of the Resistance fleet, which were anchored by General Organa's massive flagship, the MC85 Star Cruiser Raddus. As ground crews wrapped up the evacuation, a First Order fleet of three Star Destroyers led by General Armitage Hux arrived in-system; at the center of the invading fleet was the colossal Siege Dreadnought Fulminatrix, which carried ventral orbital autocannons with firepower capable of obliterating both the base and the Resistance fleet."}, {"tag": "p", "text": "While Commander Poe Dameron—now an ace pilot for the Resistance—distracted and delayed the First Order invaders in his T-70 X-wing, Holdo's StarFortress squadrons moved into position to assault the Fulminatrix. The ground teams completed the evacuation just before the dreadnought's ventral cannons bombarded and destroyed the D'Qar base, but the starfighter and bomber squadrons pushed their attack on the Fulminatrix at Dameron's insistence and in direct defiance of General Organa's command to retreat so the fleet could jump away. Although the Cobalt Hammer was able to complete it's bombing run and destroy the Fulminatrix before it launched a destructive volley at the fleet, every StarFortress in Cobalt and Crimson squadron was destroyed during the effort—a major blow to the Resistance's dwindling forces. After the surviving starfighter escort retreated to the Raddus, Holdo and the Ninka escaped into hyperspace with the rest of the fleet to the an old Rebel Alliance rendezvous point in the remote Oetchi system, where they would regroup and begin the search for a new base."}, {"tag": "h4", "text": "Custodian of the fleet"}, {"tag": "p", "text": "In deep space in the Oetchi system, Holdo's Ninka formed a convoy with the Raddus and the other surviving Resistance ships that escaped D'Qar: the Vakbeor-class cargo frigate Vigil and the Nebulon-C medical frigate Anodyne. Holdo and Organa had a plan for survival derived from their experience in the Rebellion: after jumping to safety to escape the First Order, they would head to the mineral planet Crait in a nearby system, where they would regroup and and begin the search for allies and resources from the hidden safety of an abandoned Rebel outpost dating back to the Galactic Civil War. Far in the Outer Rim and overlooked by political and economic powers alike, Crait did not appear on most modern star maps, and would make a fitting base for the Resistance, provided its secrecy was maintained. To ensure that secrecy, Holdo and Organa decided not to share their plan widely to avoid potential leaks to enemy agents during a precarious time for their movement."}, {"tag": "p", "text": "Before their plan could get underway, a First Order armada arrived in the Oetchi system, having tracked the Resistance ships through hyperspace using new technology. The armada was an overwhelming naval force consisting of thirty Resurgent-class Star Destroyers led by the Supremacy—a titanic Mega-class Star Dreadnought that served as the mobile headquarters of the First Order and the flagship of Supreme Leader Snoke. Caught off-guard by the seeming impossibility of hyperspace tracking and with only enough fuel for one more jump, the Resistance vessels turned to flee. Although the Ninka, Raddus, and Anodyne survived the initial volley from the Star Destroyers, the Vigil was destroyed and the Resistance's starfighter wing was wiped out before it could launch from Organa's flagship. Before the fleet escaped the destructive range of the Star Destroyers, a squad of TIE fighters slipped under the Raddus's deflector shield envelope and fired on the bridge, killing much of Resistance High Command—including Admiral Ackbar—and ejecting General Organa into the vacuum of space. Although Organa survived through her connection to the Force, she was severely injured and fell into a coma, leaving the Resistance without its unifying commander as it fled the overwhelming might of the enemy."}, {"tag": "p", "text": "With most of the Resistance leadership either dead or incapacitated, Vice Admiral Holdo was the highest ranking officer on the fleet and Organa's designated successor in the chain of command. She transferred her flag to the Raddus along with a limited staff and assumed command of the Resistance as the First Order armada continued its pursuit. Holdo's ascension was announced by Commander Larma D'Acy at a gathering of Resistance officers in the ship's secondary battle bridge, to the surprise of several Raddus crew and personnel who had never served with the vice admiral. In an address broadcasted fleet-wide, Holdo outlined their dire situation—four hundred survivors on just three ships—and made clear that the survival of the Resistance was her paramount goal in command."}, {"tag": "p", "text": "Holdo intended to move forward with her and Organa's original plan to head to Crait and regroup, although it required adjustments due to the First Order's ability to track the fleet through hyperspace. Since a direct jump to Crait would reveal their destination and consume the last of their fuel, Holdo instead decided to continue at sublight speed towards the planet and use U-55 orbital transports cloaked with Tico's baffler technology to ferry the survivors to the surface while their capital ships baited the armada away. Holdo maintained the secrecy that she and Organa had committed to, which immediately brought her into conflict with Poe Dameron. After the vice admiral's address to the fleet, Dameron—who had been demoted from commander to captain after the loss of Cobalt and Crimson squadrons over D'Qar—expected Holdo to involve him in command decisions. Holdo instead rebuffed him, stirring suspicion and resentment in the impulsive young pilot."}, {"tag": "p", "text": "Dameron quickly went to work devising his own plan to save the fleet, and convinced Rose Tico, Lieutenant Kaydel Ko Connix, and the former stormtrooper Finn to participate in an effort to deactivate the hyperspace tracker aboard the Supremacy without Holdo's knowledge. To pursue their mission, Tico and Finn secretly jumped away from the fleet aboard a commandeered shuttle; although Holdo noticed the departure on the Raddus's sensors, Lieutenant Connix convinced the vice admiral that the blip was the result of passing debris."}, {"tag": "p", "text": "As Holdo pushed the fleet onward, the Raddus protected the smaller support ships with its expansive shield envelope, but dwindling fuel resources remained a problem. The medical frigate Anodyne was the first to deplete its fuel stores, prompting Holdo to order the vessel's evacuation and the transfer of its crew to the Raddus. The decision again provoked anger from Captain Dameron, who confronted Holdo on the flagship's battle bridge and demanded to know what she planned beyond evacuations. Holdo dismissed Dameron once more, insisting that her command would not reflect the kind of risky decision-making that led to the loss of the bombing squadrons over D'Qar. The Anodyne was quickly scuttled by Resistance crews, with the final transports of injured patients making it off the vessel just as it lost power and fell outside of the Raddus's protective envelope. The medical frigate's captain, who remained aboard the vessel after the last evacuation transports departed, sent a final status update communique to Holdo as the Anodyne was fired upon and destroyed by the Supremacy. With that loss, Lieutenant Connix informed the vice admiral that the fleet had only six remaining hours worth of fuel."}, {"tag": "p", "text": "The destruction of the Anodyne amid the perilous fuel situation had a severe impact on morale, and Dameron blamed Holdo for allowing the Resistance survivors to fall into such low spirits. In response to his outbursts against her leadership, Holdo banned Dameron from the bridge and removed him from duty rosters. Before long, the Ninka's fuel was depleted, and Holdo was forced to order the evacuation of the skeleton crew from her own cruiser. The Ninka was destroyed as soon as it fell outside the Raddus's shield envelope, leaving the Resistance flagship as the only remaining combat vessel in the fleet."}, {"tag": "p", "text": "As the cruiser reached sublight range of Crait, Holdo ordered the Raddus's remaining fuel to be transferred to the thirty U-55 orbital transports left in the hangar. As the command and hangar crews carried out her orders, Dameron forced his way back on to the bridge to confront the vice admiral about the morale crisis aboard the ship. Although Holdo was briefly able to calm the captain, Dameron became violent when he saw a monitor providing the status of the shuttle fueling operation. Dameron believed Holdo was planning to abandon ship and put the entire Resistance aboard unarmed and unshielded transports with no hyperdrive ability and no destination, and accused the vice admiral of cowardice and treason. Holdo had fleet security remove Dameron from the bridge, prompting him to move forward with his plans with Finn, Tico, and Lieutenant Connix."}, {"tag": "p", "text": "When Holdo went to the hangar to personally oversee the evacuation preparation, Dameron and Connix gathered a group of Resistance pilots to stage a mutiny. Dameron and his crew confronted Holdo in the hangar, explaining to her that he had initiated a plan to have Finn and Tico infiltrate the Supremacy to shut down the dreadnought's hyperspace tracker. Holdo rejected Dameron's request to delay the evacuation so that his plan could advance, instead ordering the shuttles to begin the boarding process. With her refusal, Dameron and his compatriots—Connix, C'ai Threnalli, and Nodin Chavdri—drew their blasters and announced they were relieving the vice admiral of her command. Although Holdo was supported by officers including Commander D'Acy, General Caluan Ematt, Major Nossit Cicer, and Captain Geno Namit, she surrendered to Dameron to avoid battle aboard the Raddus."}, {"tag": "p", "text": "Holdo and her loyalists were confined to the hangar by Dameron's armed mutineers while the pilot led a small force to seize control of the bridge. The mutiny was short lived, however. As Dameron shut down power to the hangar, the vice admiral kicked a fuel line loose, blasting Threnalli with vapor. Holdo stunned the Abednedo pilot with her concealed blaster; her compatriots followed her lead, resulting in a shootout in the hangar between her loyal officers and the mutineering pilots. As the Raddus descended into chaos, General Leia Organa awoke from her coma and personally retook the bridge from Dameron, stunning him and capturing his co-conspirators. In the hangar, Holdo and her forces continued battle with Dameron's supporters as news of Organa's return began to spread. The Resistance fighters were uncertain whose side she would take in the conflict until the general herself arrived in the hangar to stop the fighting. She was accompanied by a cadre of soldiers carrying an unconscious Dameron, and she greeted Holdo with a hug, making clear that the vice admiral retained Organa's confidence and loyalty."}, {"tag": "p", "text": "With the mutiny put down, Holdo and Organa resumed their plan to secretly evacuate the Raddus and make for Crait. Holdo took a moment to check on the unconscious Dameron before he was loaded aboard a transport, confiding in Organa that she liked the pilot. As the final transports were loaded, Organa ordered Holdo to board, but the vice admiral refused. She explained that for the transports to escape, someone had to remain aboard the Raddus to lure the First Order fleet away from Crait. Although Organa tried to protest, Holdo reminded the general that she still held technical command of the fleet and therefore outranked her friend, and that \"an admiral goes down with her ship.\" Organa was reluctant to leave her friend aboard the doomed cruiser, but ultimately deferred to Holdo's will. The vice admiral consoled her friend with a final goodbye before the general and the rest of the Resistance departed the Raddus, leaving her behind."}, {"tag": "h4", "text": "The Holdo maneuver"}, {"tag": "p", "text": "Alone aboard the Raddus, Vice Admiral Holdo returned to the battle bridge. She had complete control over the massive vessel from her station, with a singular goal to buy the Resistance survivors time to reach Crait and flee. As she watched the U-55 transports slip towards the planet, she reflected on her role, her relationship with Leia Organa, and her Gatalentan faith. Although she expected the First Order armada to pursue the Raddus until the Mon Calamari cruiser's fuel depleted, the Supremacy unexpectedly switched targets and opened fire on the unshielded transports bound for Crait. Unknown to the Resistance, Holdo's plan had been leaked to the First Order by way of Dameron's allies, Finn and Rose Tico. Dameron's messages to his compatriots about the situation on the Raddus were overheard by DJ, a thief and slicer who was recruited by Finn and Tico in their effort to infiltrate the Supremacy. DJ betrayed his clients after the stormtroopers captured them, buying his freedom with the information he gleaned from Dameron's updates."}, {"tag": "p", "text": "First Order gunners, made aware of the low-energy targets headed away from the Raddus, tracked the transports' emissions and opened fire on the Resistance lifeboats. Holdo watched in horror from her station on the bridge as the Supremacy picked off the vessels with ease. One of the transport pilots contacted Holdo, frantically asking if the convoy should return to the Raddus. Knowing that the transports were too far out from the shield envelope to hope for any protection from their flagship, Holdo ordered them to continue full speed towards Crait planetfall. That pilot and others were killed as more than half the Resistance transport fleet was wiped out by the First Order volley."}, {"tag": "p", "text": "Although Holdo understood that the Raddus's shields and armaments were insufficient to save the lifeboats or distract the enemy, she found a potential solution in the cruiser's navigation computer. Dameron had entered hyperspace jump coordinates when he stormed the bridge; since the Raddus and its pursuers had continued along their trajectory towards Crait after the mutiny, the entry point for the jump was now located behind the First Order fleet. Although the likelihood of this outcome was infinitesimally small, Holdo hoped she could initiate the hyperspace jump and ram the enemy forces. Understanding it to be her only option, she brought the cruiser about and pointed it directly at the Supremacy. Both Resistance forces on the transports and First Order officers aboard the armada thought that Holdo was preparing to jump in order to flee the battle; the commanders of the Supremacy realized too late that the cruiser was aimed at the heart of their fleet and posed a significant risk."}, {"tag": "p", "text": "Holdo overrode the fail-safes aboard the Raddus and made the jump. The massive vessel accelerated to nearly the speed of light and impacted the Supremacy as a lethal projectile bound for hyperspace. Holdo was immediately killed as the tremendous release of energy from the collision converted the Raddus's mass into a column of super-heated plasma that vaporized a large portion of the First Order dreadnought's starboard wing. The plasma remnants of Holdo's cruiser continued forward at lightspeed, cracking open the hulls of twenty Resurgent-class Star Destroyers assembled behind the Supremacy before being launched into hyperspace. Holdo's historic suicide attack was witnessed by Organa, Dameron, and other Resistance survivors aboard the six remaining transports bound for Crait."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Amilyn Holdo's sacrifice over Crait saved the Resistance and some of its greatest heroes. Aboard the  Supremacy, Finn and Rose Tico were set for immediate execution when the Raddus slammed into the ship; the ensuing chaos allowed for the two to escape as the dreadnought's interior collapsed. The Supremacy's particular superstructure prevented the vessel from being destroyed entirely, but the First Order's headquarters ship was crippled beyond repair, forcing it to be abandoned in the Crait system. The surviving First Order leaders—including General Hux and the newly-minted Supreme Leader Kylo Ren—led their remaining forces down to Crait, where the Resistance survivors gathered to regroup and call for allies. During the ensuing Battle of Crait, Resistance forces were able to finally escape their constant First Order pursuit with the help of the Jedi Luke Skywalker and Rey."}, {"tag": "p", "text": "The Resistance spy Vi Moradi was devastated upon learning of Holdo's sacrifice. Likewise, the retired Wedge Antilles and Norra Wexley were astonished upon learning of Holdo's death when Temmin Wexley and Karé Kun told them about it, leading Norra to ask if Organa shared Holdo's fate before relieving over the fact that Organa had survived. Organa remembered Holdo not only as a leader but as a friend while she lamented the fact that she was gone, having known her for most of her life, which led Rey to express her condolences even though she never met her."}, {"tag": "p", "text": "By the time of the mission to Pasaana, Holdo's sacrifice had become known as the \"Holdo maneuver.\" Following the defeat of Darth Sidious and the Sith Eternal on Exegol, the maneuver was used against a Star Destroyer during an uprising on Endor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Holdo was tall, and had blue eyes and light-colored skin. In her youth, Holdo rebelled against the undemonstrative exterior of her homeworld's culture and expressed herself by dyeing her hair vibrant colors, wearing vibrantly colored clothing, and going on daring escapades. In spite of that, Holdo shared the core values of Gatalenta: she believed in the importance of joy, love and spiritual harmony, showed great interest in esoteric practices of her planet, like meditation and astrology, and she was knowledgeable of the galaxy. She also had a penchant for going barefoot. Organa found Holdo insightful and charming, but also irritating at times."}, {"tag": "p", "text": "Holdo had a quirky personality, often getting distracted, speaking in riddles and metaphors with a monotone/singsong voice (Leia called her peculiar speech patterns \"Holdo speak\"), and being eccentric. She was by no means stupid, however, and her oddball persona hid a keen intellect. She was not afraid of death, and dreamed of dangerous adventures \"to get more comfortable with the nearness and inevitability\" of it. Holdo was a determined and patriotic person, able to react to changing circumstances and ready to sacrifice herself for the cause. As a commander she had a cool head for the greater strategy, and expected her orders to be executed precisely, as shown during her time in command of the Raddus. Holdo was known to carry a Defender-5 sporting blaster, which was favored by many nobles on her homeworld. According to Dameron, Holdo was recognized within the Resistance as a great strategic mind due to her actions at the Battle of Chyron Belt and was admired even by Admiral Ackbar."}, {"tag": "p", "text": "Despite having an antagonistic relationship with Dameron, Holdo respected him, telling Organa that Dameron was a troublemaker after his mutiny but that she liked him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Amilyn Holdo is a character developed for the 2017 film Star Wars: Episode VIII The Last Jedi, in which she is portrayed by actress Laura Dern. The casting announcement was revealed on February 15, 2016, and Holdo's name was revealed on May 24, 2017 in a Vanity Fair article. During the Journey to Star Wars: The Last Jedi marketing campaign, Holdo appeared as a supporting character in the young-adult novel Leia, Princess of Alderaan by Claudia Gray, and was briefly shown in the picture book A Leader Named Leia. Holdo's appearance in Leia, Princess of Alderaan was received positively, with some readers comparing her to the character Luna Lovegood from Harry Potter. Gray confirmed via her Tumblr blog that she intended to portray Holdo as LGBTQ+, though she did not know what the Star Wars galaxy's terminology would be."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}