{"url": "Huttese/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Hutt culture", "Category:Klatooinian culture", "Category:Languages"], "nodes": [{"tag": "h1", "text": "Huttese"}, {"tag": "p", "text": "Huttese was the native language of the Hutts, and was the second most prevalent language in the galaxy after Galactic Basic. It served as the lingua franca for both  Hutt Space and most of the space surrounding the Hutts' territory. Because of the Hutts' commercial and criminal influence throughout the  galaxy, Huttese was widespread."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Being one of the more common modes of intergalactic communication, the Baobab School of Speed-Learning offered an extremely popular course to promote Huttese fluency."}, {"tag": "p", "text": "All the Nimbanels were fluent in Huttese, as well as in Basic and their own language, because their snout structure made it easy for them to articulate the Huttese language. Understanding the advantages of learning such an important language, the species made it a semi-official language of Nimban. Huttese was so influential that it also became a primary language for the Rodian race. Toydarians were also usually fluent in Huttese, because the two species had had a long commercial history with each other. They usually preferred to speak their Toydarian rather than Basic, but if that was not a choice, they would try Huttese. Huttese was one of the primary languages of Tatooine and many Hutt-controlled worlds like it."}, {"tag": "p", "text": "Although most Hutts were fluent in spoken and written Basic, they considered Huttese to be a much superior language to Basic, and exclusively addressed others in it, often relying on protocol droids to translate for them."}, {"tag": "p", "text": "The Hutts were the owners of three species, Niktos, Klatooinians, and Vodrans, since the time of the Third Battle of Vontor. Klatooinians and Vodrans had forfeited their respective languages (Klatooinian and Vodran language) to replace them with Huttese, being usually illiterate. However, Niktos kept alive the Nikto during their servitude, learning Huttese only as a second language, and sometimes Basic as a third language. Some Hutts talked with their Nikto servants in Nikto language."}, {"tag": "p", "text": "Huttese had many words ending in -a, especially -a(C)a (ex. botaffa), palatalized l (rulya), and expressions formed by duplicated words (rocka rocka, puna puna, chu chu). Another common convention of Huttese was the pronunciation of x as a bilabial click."}, {"tag": "p", "text": "It should be noted that the Hutts had no words for the otherwise polite phrases of 'Please' and 'Thank You'."}, {"tag": "h2", "text": "Speaking in Huttese"}, {"tag": "h3", "text": "Greetings"}, {"tag": "h3", "text": "Common words and phrases"}, {"tag": "h3", "text": "Insults/expressions"}, {"tag": "h3", "text": "People"}, {"tag": "h3", "text": "Places"}, {"tag": "h3", "text": "Things"}, {"tag": "h3", "text": "At the merchant"}, {"tag": "h3", "text": "Business"}, {"tag": "h3", "text": "Applied business"}, {"tag": "h3", "text": "Dining"}, {"tag": "h3", "text": "Entertainment"}, {"tag": "h3", "text": "Travel"}, {"tag": "h3", "text": "At the racetrack"}, {"tag": "h3", "text": "Counting in Huttese"}, {"tag": "p", "text": "Counting in Huttese is a risky proposition. While Humans have ten fingers, Hutts have but eight, meaning that their method of counting uses base eight. Hutts have utilized the ensuing confusion to their monetary advantage; if, for example, a Hutt were to offer you twelve of something in Huttese, it is the equivalent of ten in Basic. Generally speaking, the problem grows exponentially the higher one rises, and many a race (including the Rodians) have been horribly swindled by the discrepancy. To avoid such predicaments, wise negotiators use the Basic number system, which explains why the monetary amounts spoken by Jabba are in Basic."}]}