{"url": "Huttese_(writing_system)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Language stubs", "Category:Alphabets", "Category:Hutt culture", "Category:Writing systems"], "nodes": [{"tag": "h1", "text": "Huttese  (writing system)"}, {"tag": "p", "text": "The Huttese language had its own accompanying writing system. On the Hutt-controlled planet of Tatooine, podracers bore Huttese writing both on their hulls and on their display screens. Such inscriptions could also be seen on the walls of Coruscant at the time of the Cold War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A Huttese alphabet was created for the 1999 movie Star Wars: Episode I The Phantom Menace, in which it was featured during the podracing sequence. Huttese inscriptions were notably shown on the podracers' control panels. The numerals for \"3\", \"2\" and \"1\" were also featured on the lap indicators at the Mos Espa Grand Arena. The same numerals appeared in the 1999 video game Star Wars Episode I: Racer."}, {"tag": "p", "text": "The same glyphs were used in the Nar Kreeta level of the 2003 video game Star Wars: Jedi Knight: Jedi Academy, although occurrences of that alphabet were written in mirror image when compared to The Phantom Menace. Those inscriptions were written according to the mapping of a fanmade \"Nal-Huttese\" font that could be found at Geocities.com as early as July, 1999. The readable Huttese inscriptions in the game are \"BALE,\" \"RANCOR,\" \"OPEN,\" \"CLOSED,\" and \"PARLOR,\" all of which made sense in context."}, {"tag": "p", "text": "While the original Nal-Huttese font only contained letters A-S, an updated version emerged later on EagleFonts.com, a searchable database of free TrueType fonts. That new version was included in Star Wars: The Old Republic. Inscriptions on planet Coruscant are consistent with spelling the phrases \"Black Sun\" and \"The sun shall rise.\" On the Vaiken Spacedock, a board hanging above the doorway leading to the Hutta departures clearly reads \"Hutta.\""}, {"tag": "p", "text": "A different font was created for the TV series Star Wars: The Clone Wars. Despite the aforementioned evidences to the contrary, Leland Chee, who maintains the Holocron continuity database, has stated that the updated Geocities font has not been officially endorsed. When asked about that by a Wookieepedia editor on his Facebook account, Chee stated: \"Though [the updated Geocities font] has many similarities to a font we have based on letters and numbers seen in The Phantom Menace, this is not an official font. No official fonts have ever been made publicly available.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}