{"url": "Huttese_slave-girl_costume", "categories": ["Category:Legends articles", "Category:Clothing", "Category:Hutt culture"], "nodes": [{"tag": "h1", "text": "Huttese slave-girl costume"}, {"tag": "p", "text": "Huttese slave-girl costumes were clothing worn by humanoid female dancers who were enslaved or employed by Hutts. They typically consisted of an ornamented metal harness on top with varying garments on the lower half, and they revealed the wearer's limbs, chest, and abdomen. When Jabba the Hutt captured Leia Organa at his palace, he forced her to wear a costume as one of his dancing girls, but she strangled him to death with the chain he put on her."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Huttese slave-girl costumes were clothing worn by female humanoids who were enslaved or employed by Hutts as dancers. The top half included a slave girl harness that fastened with cords and had filigree on the chest. The lower half varied, but could be an ornamented bikini-style bottom layered over trousers or worn with thigh-high stockings, or a metal belt with a lashaa silk skirt or a loincloth. It was worn with jewelry, and enslaved beings also wore a collar on the neck to which a chain could be attached."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Old Republic"}, {"tag": "p", "text": "After the Mandalorian Wars, the exiled Jedi Meetra Surik needed to negotiate a solution for shipments of Sleheyron fuel for the Telosian Restoration Project. The Exchange crime lord Goto was disrupting Vogga the Hutt's business on Nar Shaddaa, the moon of Nal Hutta. To gain an audience with Vogga, Surik considered a job offer from Vogga's majordomo to become a new dancer for the Hutt or procure another candidate for him. Dancers were required to be young, female, and wearing a dancer's outfit."}, {"tag": "p", "text": "During the resurgence of the Sith Empire, enslaved women wore dancer's outfits to perform in cantinas, such as the Slippery Slopes Cantina in the Promenade and Club Ufora in the Red Light Sector on Nar Shaddaa. Free beings also purchased and wore attire in the same style."}, {"tag": "p", "text": "During the Boonta Eve Classic on Tatooine in 32 BBY, the Hutt crime lord Jabba Disilijic Tiure brought with him the half-Theelin Diva Shaliqua, whom he had enslaved, to his private box at the Mos Espa Grand Arena. Shaliqua wore a slave-girl costume of the style that included baggy trousers, chunky metal bangles on both wrists, leather armbands on both arms, and a collar."}, {"tag": "p", "text": "The Clawdite bounty hunter Zam Wesell disguised herself in the dancing garb during the Infant of Shaa incident in order to seduce Dreddon, a Hutt criminal with a bounty on his head. Once the two were alone together, Wesell killed him."}, {"tag": "p", "text": "During the Clone Wars, an underground establishment called Show Girls advertised itself on Coruscant with images of a female Twi'lek in a slave-girl costume. When Ziro Desilijic Tiure was imprisoned at Gardulla the Hutt's Palace on Nal Hutta, three Twi'lek chorus girls performed for the Hutt Ruling Council with Ziro's lover, the Pa'lowick Sy Snootles. Their costumes paired harnesses with matching bikini-style bottoms, along with stockings and leather strapping wrapped around their legs and collars on their necks. They wore headdresses crowned with vibrantly-colored feathers and styled to resemble the heads of specific Hutts, such as Jabba and Gardulla Besadii the Elder."}, {"tag": "p", "text": "On Zygerria, a male Zygerrian displayed a female Twi'lek clad in a slave-girl costume to a fellow Zygerrian and a Neimoidian. At another time on Nal Hutta, several Twi'leks wore the outfit in the city of Bilbousa, including a pair who escorted a drunken Sy Snootles out of a saloon while others provided entertainment inside."}, {"tag": "h3", "text": "The Imperial Period"}, {"tag": "p", "text": "In 4 ABY, Princess Leia Organa, a Force-sensitive Human, infiltrated Jabba the Hutt's palace disguised as the male Ubese bounty hunter Boushh, with the Wookiee Chewbacca seemingly the bounty hunter's captive. They planned to rescue Han Solo from imprisonment in carbonite. Organa freed Solo from the carbonite, but the Hutt had not been fooled and captured Organa as well."}, {"tag": "p", "text": "Two of Jabba's enslaved dancers dressed Organa as another dancing girl while the Ortolan musician Max Rebo and his band played the song \"Ode to a Radioactive Ruin\". The garb she was forced to wear included a gold slave girl harness, a lashaa silk skirt suspended from a belt, and jerba leather boots. Her hair was styled in a high braided bun and then left to hang in a long plait down her back. She also wore metal accessories: small hoop earrings, hair ornaments, a cuff in a spiral design on her upper left arm, a bracelet on her right wrist, and a heavy collar around her neck through which a heavy chain was threaded, allowing Jabba to force her to stay in place. Rebo felt sorry for Organa; he thought she looked malnourished and in need of food, so he snuck her a blatberry pie from the kitchens."}, {"tag": "p", "text": "When Jabba had Organa sent to Boba Fett's quarters that night as a gift, Fett instead gave Organa a sheet to cover herself. Organa offered to pay Fett if he assisted in the escape, but he declined and said the Rebel Alliance was morally wrong for starting a war with the Empire. They debated the morality of her friends before Fett went to sleep. Other beings in Jabba's Palace were sympathetic to Organa, such as the chef Porcellus who offered to sneak her some food. When Jabba suspected Porcellus of putting fierfek in his fricasseed sandmaggot kidneys, Organa ate a sample despite becoming nauseated."}, {"tag": "p", "text": "Organa managed to get some sleep before Jedi Knight Luke Skywalker entered the palace, and defeated Jabba's rancor while Organa watched. Jabba sentenced Skywalker, Solo, and Chewbacca to death by sarlacc digestion in the Great Pit of Carkoon, and brought Organa alongside him in his sail barge. As the group and their friend Lando Calrissian fought back against the scheduled execution, Organa knocked out the controls to Jabba's throne, grabbed her chains, and threw them around the Hutt's neck to strangle Jabba with the chains and kill him. Organa's victory over the Hutt was witnessed by many beings, including Max Rebo, Sy Snootles, Ree-Yees, Bib Fortuna, and Tessek."}, {"tag": "h3", "text": "The New Republic"}, {"tag": "p", "text": "Luke Skywalker visited a bar called Jabba's Throne Room, a faithful replica of the room in Jabba's palace. Noting that many of the waitresses are scantily-clad and upon hearing the name Leia, he feared the evening's entertainment would be a lookalike of his twin sister. Later, the First Administrator of the New Republic's General Ministry, Nanaod Engh, encouraged Chief of State Leia Organa Solo to buff up her public image. She responded by sarcastically asking if she was meant to give interviews or be recorded dancing for Han in a Huttese slave-girl costume."}, {"tag": "p", "text": "The outfit appeared in a vision to Leia Organa Solo as she struggled to come to terms with her Force powers. She saw herself having two possible fates. In one, she would be the Empress of the Galactic Empire, having ascended the throne of Palpatine; in the other, she had given up and was crying at the foot of that throne. While the latter wore the scraps of gold and silk with shame, the Empress Leia wore it under a robe with flashing jewels as a shining symbol of strength and power."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Huttese slave-girl costumes first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, where versions were worn by actress Carrie Fisher and stunt performer Tracey Eddon. The bikini-style costume consisted of a brassiere, a skirt made with maroon silk veils, suede boots, matching jewelry, and hair accessories. The costume was designed by Nilo Rodis-Jamero and Aggie Guerard Rodgers, and the faux metal elements were sculpted by Richard Miller."}, {"tag": "p", "text": "In the 2003 massively multiplayer online role-playing game Star Wars Galaxies, the costume was made of two items, a \"Metal Bikini\" and an \"Extremely Revealing Skirt.\" It could be crafted by players in a range of colors, but could only be worn by female player-characters."}, {"tag": "p", "text": "The costumes were first identified in the 1996 novel Shield of Lies, written by Michael P. Kube-McDowell."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}