{"url": "Hutt%E2%80%93Republic_treaty", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles with conjectural titles", "Category:Hutt culture", "Category:Treaties"], "nodes": [{"tag": "h1", "text": "Hutt–Republic treaty"}, {"tag": "p", "text": "In the second year of the Clone Wars, the Galactic Republic established a treaty with the Hutt families through crime lord Jabba Desilijic Tiure, the leader of the Hutts. Jedi Master Obi-Wan Kenobi initially negotiated the treaty with Jabba, while Senator Padmé Amidala was able to secure the accord's ratification after exposing a Separatist plot against Jabba to kidnap his son and frame the Jedi Order for the crime."}, {"tag": "h2", "text": "Terms"}, {"tag": "p", "text": "The treaty between the Galactic Republic and the Hutt families ended hostilities that had been brought about during the Clone Wars. Under the accord, the Hutts became allies of the Republic, and the Grand Army of the Republic was granted much-needed access to Hutt Space hyperlanes. The Hutts, meanwhile, retained ownership of the Valsedian asteroid belt but could not sell it to the Confederacy of Independent Systems. These terms came at a price for the Republic, however; with the treaty, the criminal-dealing Hutts were able to safeguard their methods from the eyes of the Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Confederacy of Independent Systems seized numerous hyperlanes throughout the galaxy and separated the Republic from the majority of its army, the Republic sought to broker a deal with Jabba to gain access to trade routes running through Hutt Space. Although the Confederacy kidnapped Jabba's son, Rotta, and attempted to frame the Jedi Order for the crime in order to gain access to the hyperlanes for themselves, Jedi Master Obi-Wan Kenobi—the Republic's designated emissary to Jabba—was able to negotiate with Jabba on Tatooine while Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, rescued the captured Rotta on Teth. When Count Dooku deceived Jabba into believing that the Jedi had captured and executed his son, Senator Padmé Amidala of the Galactic Congress was able to reopen negotiations with Jabba by exposing the Separatist conspiracy against him, in which his own uncle, Ziro Desilijic Tiure, had been involved. Additionally, Jabba agreed to sign the treaty when Skywalker and Tano returned Rotta to him despite Dooku's attempts to assassinate the Huttlet."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Some in the Republic, like Anakin Skywalker and Jedi Masters Mace Windu and Keelyvine Reus, were wary about the treaty simply because they did not wish to deal with the criminal Hutts. Others, like Count Dooku and the Separatists, coveted access to the Hutt Space hyperlanes themselves and attempted to prevent the treaty from being brokered. The proviso that the Republic could not inquire too deeply into Hutt methods created problems for the Jedi, who could not verify the reliability of information that came from the Hutts because they could not ask as to how that information had been acquired."}, {"tag": "p", "text": "In the end, the Hutts bypassed the Republic's authority on several occasions. Torpo the Hutt, ignoring the accord that the Valsedian asteroid belt could not be sold to the Separatists, brokered a deal with the Confederacy and sold it to them. The Hutt Grand Council, meanwhile, sought to break Ziro Desilijic Tiure out of Republic custody for an incriminating holodiary in his possession, and the Hutt leaders had the bounty hunter Cad Bane hold the Republic Senate hostage in order to secure Ziro's release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}