{"url": "Huyang", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Droids of the Jedi Order", "Category:First-degree droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "Huyang"}, {"tag": "p", "text": "Huyang was a Mark IV architect droid professor based aboard the Jedi vessel Crucible who, for a thousand generations, taught Jedi younglings, including Grand Master Yoda and Jedi Master Mace Windu, how to construct their lightsabers following the Gathering."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early incarnation"}, {"tag": "p", "text": "By the time of the Clone Wars, Huyang was over a thousand years old, and had helped thousands of generations of Jedi younglings in the construction of their lightsabers including Grand Master Yoda and Jedi Master Mace Windu. His purpose was to accompany the young trainees to the planet Ilum, and once they retrieved the kyber crystal that called to them through the Force, he would aid them in fashioning the weapon."}, {"tag": "h3", "text": "Training gone astray"}, {"tag": "p", "text": "During the Clone Wars, in 20 BBY, Huyang accompanied Grand Master Yoda, Ahsoka Tano, and a group of younglings to Ilum, where they would begin their journey towards becoming Padawans. During this time, their ship was boarded by the Weequay pirates led by Hondo Ohnaka. While Tano was occupied with Ohnaka, one of the pirates crippled Huyang, knocking off his head and both his arms. Later, during their rescue of Tano, the younglings were able to reassemble Huyang."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Huyang first appeared in \"A Test of Strength,\" the seventh episode in Season Five of the animated television series Star Wars: The Clone Wars, which aired on November 10, 2012. He was voiced by former Doctor Who actor David Tennant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}