{"url": "Huyang/Legends", "categories": ["Category:Legends articles", "Category:Droids of the Jedi Order", "Category:First-degree droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "Huyang"}, {"tag": "p", "text": "Professor Huyang was a masculine-programmed architect droid who guided the Initiates of the Jedi Order in the construction of their lightsabers. Based aboard the Jedi training cruiser Crucible, Huyang began his service to the Order in its early days. His instruction would commence once a class of younglings had passed The Gathering on Ilum and collected their lightsaber crystals. Although criticized for being a droid despite his central role in Jedi training, he carried out his tasks with distinction, educating each new generation of Jedi and providing them with the needed components from his vast cache of supplies. He also maintained an archive of each and every lightsaber, and its owner, within his memory bank. By the time of the Clone Wars, thousands of generations of Jedi had passed through Huyang's tutelage and completed their lightsabers."}, {"tag": "p", "text": "In 20 BBY, Huyang's instruction of one particular class of Initiates—Petro, Ganodi, Byph, Katooni, Zatt, and Gungi—took an unexpected turn when a gang of pirates attacked and boarded the Crucible. Although Huyang and his students repelled the brigands from the Crucible, the Initiates' chaperone, Padawan Ahsoka Tano, was captured. Huyang himself was almost completely dismembered in combat, though he received repairs thanks to Ganodi, Zatt, and the astromech droid R2-D2. While mounting an attempt to rescue Tano on the planet Florrum, Huyang and the younglings were drawn into an all-out invasion launched by General Grievous and the Confederacy of Independent Systems, though with the aid of Captain Hondo Ohnaka and his pirates, they evaded Grievous and safely returned to the Republic fleet."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Teacher of Jedi Initiates"}, {"tag": "p", "text": "An architect droid, Huyang—also Professor Huyang or Master Huyang, as he came to be known—began his service to the Jedi Order within its nascent days. The Order was founded around 25,783 BBY, from the ancient society known as the Je'daii Order. Huyang served aboard the Jedi training vessel the Crucible."}, {"tag": "p", "text": "As the sole being assigned to the Crucible, Huyang maintained his own database of lightsaber designs and their designers, spanning the entire tenure of his considerable teaching career. It was aboard the Crucible that Huyang taught countless Jedi the means of constructing their own lightsabers in the last thousand years of their order. Sometime during this period, he assisted then-Initiate Yoda in the construction of his first lightsaber."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "h4", "text": "Training gone astray"}, {"tag": "p", "text": "During the Clone Wars, a group of Initiates consisting of Byph, Ganodi, Gungi, Katooni, Petro, and Zatt—having recently completed their Gathering trial—arrived on the Crucible to be instructed by Huyang in the construction of their lightsabers."}, {"tag": "p", "text": "Some of the Initiates, Ganodi in particular, were skeptical of the droid due to his extreme age, but were quickly won over by his wisdom and anecdotes from the annals of Jedi history. Patiently, Huyang guided the Initiates in the construction and personalization of their respective blades."}, {"tag": "p", "text": "Before the younglings could complete their task, Huyang's vessel was assaulted by Hondo Ohnaka and his pirate gang, who were intent on stealing any lightsaber crystals aboard due to their high market value. To safeguard the Initiates' unique crystals, Huyang gathered and stored them inside his chest. Unbeknownst to him at the time, however, Petro had surreptitiously palmed his crystal and handed Huyang a droid component."}, {"tag": "p", "text": "Huyang, Padawan Tano, and the group of Initiates chose to hide in the ship's ventilation system when the pirates boarded the Crucible and began searching for their prize. In executing a plan of Tano's devising, Huyang and the younglings were found and caught by a group of pirates, but Petro put his crystal into his poorly crafted lightsaber and tricked the largest pirate into activating it, causing it to explode, knocking the pirates unconscious and damaging Huyang in the process."}, {"tag": "p", "text": "Eventually, Huyang and the younglings were confronted by Ohnaka and more pirates before Tano arrived and subdued the pirates with a Force Push. As Tano began to hold Ohnaka off, Huyang began to lead the Initiates to safety, but ending up having his head shot off by one of the pirates. The droid professor then engaged the pirate in unarmed combat and managed to defeat him, despite having both his arms blasted off as well. The Initiates then collected his body parts and took shelter in the Crucible's hold. Unfortunately for Tano, the plan to liberate the ship did not go exactly as planned, and she was captured by the pirates even as she drove them from the ship."}, {"tag": "h4", "text": "Misadventures on Florrum"}, {"tag": "p", "text": "Still significantly damaged from his battle with Hondo Ohnaka, Huyang was able to offer little in the way of assistance when the group of Initiates decided to pursue the pirates back to their base on Florrum in order to rescue Padawan Tano. With the Crucible landed on the planet surface to effect repairs, Huyang remained aboard with Initiate Ganodi and fellow droid R2-D2, while the remaining Initiates set out to rescue Tano."}, {"tag": "p", "text": "With the others gone, Ganodi began to repair Huyang, beginning with re-attaching his head to his body. He had only just completed this task when the other Initiates—having managed to rescue Tano from the pirates—made contact to ask for help in escaping their pirate pursuers."}, {"tag": "p", "text": "Huyang, the young Rodian Initiate, and R2-D2 immediately launched the Crucible and flew to rescue their companions. The effort was a near-success, almost managing to secure the Jedi, until one of the pirates scored a blaster hit on one of the ship's engines, causing the ancient Jedi vessel to crash and the entire group to be recaptured by the pirates."}, {"tag": "p", "text": "As the captors and captives began making their way back to the pirate outpost, they stumbled upon something unexpected: Separatist General Grievous and an army of battle droids had landed and claimed the system for the Confederacy."}, {"tag": "p", "text": "Faced with no alternative, the pirates chose to release their Jedi captives in order to work together to rescue Ohnaka so that they could all escape the planet. The combined group achieved their goal without taking any casualties, and together escaped back to a Republic fleet commanded by Jedi Master Obi-Wan Kenobi. Huyang was finally repaired once they found themselves back in friendly territory."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Features and equipment"}, {"tag": "h3", "text": "Personality"}, {"tag": "p", "text": "Huyang was many millennia old during the Clone Wars, having instructed Jedi in their training for over a thousand generations. Befitting his age, Huyang had developed a personality possessed of great knowledge and wisdom, paired with quirks such as a dry sense of humor and indignant responses when his usefulness was questioned due to his age."}, {"tag": "h3", "text": "Combat capacity"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Huyang was voiced in Star Wars: The Clone Wars by actor David Tennant, best known as the Tenth Doctor in long-running science-fiction series Doctor Who. He won an Emmy for his portrayal of Huyang."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}