{"url": "Hyabb", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Republic planets", "Category:Krenher sector planets"], "nodes": [{"tag": "h1", "text": "Hyabb"}, {"tag": "p", "text": "Hyabb was a planet in the Core Worlds' Krenher sector. It lay on the Hyabb-Twith Corridor hyperlane, which connected it to the planet Twith. Hyabb and Twith were engaged in a continuous war lasting nearly since the foundation of the Galactic Republic and were both members of the Republic by 17,000 BBY. During the Alsakan Conflicts, Hyabb remained loyal to the world of Coruscant in its struggle against the planet Alsakan, with which Twith had allied itself."}, {"tag": "p", "text": "Decades before 4050 BBY, both Hyabb and Twith came under the oppression of the Nelori Marauders, a group of bandits that established their base in the Hyabb-Twith Corridor. Due to the hyperlane serving as a no-man's-land zone for the two rival worlds, the Marauders preyed unopposed on both Hyabb and Twith and surrounding star systems. The Republic's Jedi Order eventually defeated the Nelori, freeing both Hyabb and Twith from the outlaws' influence."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Hyabb was a planet located in the Hyabb system, a part of the Core Worlds' Krenher sector. It was situated at the endpoint of the hyperlane known as the Hyabb-Twith Corridor, which connected it to the Voon system and, ultimately, the Twith system."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Old wars"}, {"tag": "p", "text": "Hyabb and its neighboring planet Twith were at a state of continuous war that had lasted almost since the foundation of the Galactic Republic in 25,053 BBY. As a result, the Hyabb-Twith Corridor essentially became a virtually empty no-man's-land region between the two heavily-armed worlds. Neither Hyabb or Twith dared to risk repercussions from the other by dispatching patrol ships into the disputed territory, and the neighboring star systems were actively dissuaded from entering the zone, as well."}, {"tag": "p", "text": "Both Hyabb and Twith fell within the borders of the Republic by 17,000 BBY, and they found themselves on the opposing sides of the early Alsakan Conflicts. A series of wars that erupted around 17,018 BBY, the Conflicts saw Twith ally with the planet Alsakan in its struggle against the planet Coruscant for the status of the Republic's capital. Hyabb, however, remained loyal to Coruscant."}, {"tag": "h3", "text": "The Nelori Marauders"}, {"tag": "p", "text": "Decades before 4050 BBY, the Nelori Marauders, a band of warriors, pirates, and outlaws, were driven off its homeworld of Dachat. The Nelori Marauders took advantage of the tensions between Hyabb and Twith and established their new main base on the planet Voon. Since neither Hyabb or Twith could afford to risk taking any action against the bandits, the Nelori preyed upon the governments of both planets, oppressing both of the worlds."}, {"tag": "p", "text": "Furthermore, the Nelori Marauders raided starships both on the Hyabb-Twith Corridor and in the nearby systems. When the Nelori sphere of control began to extend deeper into the Republic's territory, the Jedi Order dispatched a task force of Jedi Knights to eliminate the threat posed by the Marauders. Following a series of confrontations known as the Hyabb-Twith Campaigns, the Jedi were victorious over the Nelori, shattering the latter's sphere of influence and liberating both Hyabb and Twith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hyabb was introduced in the Tales of the Jedi Companion, a 1996 sourcebook authored by George R. Strayton and published for use with West End Games' Star Wars: The Roleplaying Game. It was given an entry in the 2008 The Complete Star Wars Encyclopedia, which specified that Hyabb was a planet. The 2009 reference book The Essential Atlas placed the Hyabb system, and therefore the planet itself, in grid square K-9."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}