{"url": "Hylon", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Jedi Purge victims", "Category:Males", "Category:Ovoni", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Hylon"}, {"tag": "p", "text": "Hylon was an Ovoni male Jedi Master who lived during the final years of the Galactic Republic. In 19 BBY, Hylon and his Jedi Padawan, Dendro, survived the initial stages of the Great Jedi Purge, which was ordered by Supreme Chancellor Palpatine. A few months after Palpatine declared himself Emperor of the Galactic Empire, Hylon and Dendro allied themselves with the Ovoni natives of the planet Otavon XII. After a strike force of Ovoni was defeated while attacking Tremor Base—an Imperial station that constructed All Terrain Armored Transports—the Dark Lord of the Sith Darth Vader killed Dendro and tracked down Hylon, who was on Mount Dijandi waiting for the Dark Lord. The Jedi Master confronted Vader in a duel, in which Vader disabled Hylon's lightsaber. The Jedi revealed a hidden sword in his staff and attacked the Dark Lord. However, Vader killed Hylon with Dendro's lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hylon, an Ovoni male, served the Jedi Order as a Master during the Clone Wars. During this time, he took the Human Dendro as his Padawan. In 19 BBY, Supreme Chancellor Palpatine issued Order 66, mandating most clone troopers to murder their Jedi Generals. Shortly after, Palpatine declared himself Emperor of the new Galactic Empire. Hylon and Dendro survived the initial stages of the Great Jedi Purge and allied themselves with the Ovoni natives on the planet Otavon XII. A few months after Order 66 was issued, the Ovoni staged an assault on the local Imperial station, Tremor Base, which constructed All Terrain Armored Transports. The assault team was defeated, however, by the Dark Lord of the Sith Darth Vader and Imperial forces under his command. Vader tracked down and killed Dendro and a group of Ovoni, who were on their way to meet Hylon on nearby Mount Dijandi."}, {"tag": "p", "text": "Hylon was meditating on the mountain when Vader arrived on a sugati—a native creature of Otavon XII—to confront the Jedi Master. Hylon informed Vader that he had known that the Sith would use a mind trick on the sugati in order to reach the top of Mount Dijandi to confront Hylon. When Vader inquired as to where Hylon's starship was, the Jedi replied that there had never been a ship, and suggested that Vader be more concerned that the sugati was leaving. He then attacked Vader with his lightsaber while he was distracted. Hylon blocked Vader's counterattack and managed to injure the Dark Lord with his staff, which he held with his left hand."}, {"tag": "p", "text": "After Vader destroyed Hylon's lightsaber, the Jedi complimented Vader's precision and unsheathed a sword from his staff. Hylon attacked Vader and managed to disarm the Dark Lord. However, Vader wounded Hylon by stabbing the Jedi Master through his stomach with Dendro's lightsaber—which he had taken from Hylon's Padawan when he slew him. Vader demanded Hylon tell him what his name was before the Dark Lord ended his life. The Jedi answered, stating that his name meant \"trickster\" in the Ovoni language. Vader further asked Hylon why he had come to the mountain without any hope of escape, and the Jedi replied that Vader would know when he went back to the Imperial base. The Dark Lord then used Dendro's lightsaber to kill Hylon, unaware that the Jedi Master had sacrificed himself by distracting Vader in order to ensure that the sugati would be able to destroy Tremor Base. When Vader returned to the Imperial base, he found that the sugati had razed the station."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Ovoni male Hylon once served the Jedi Order as a Master. After Palpatine issued Order 66, Hylon and his Padawan, Dendro, allied with the Ovoni on Otavon XII and aided the natives in their efforts against the Imperials stationed on the world. When Darth Vader destroyed his lightsaber, Hylon made it a point to compliment Vader for what he felt was precision. Before Vader killed him on Mount Dijandi, he revealed that his name meant \"trickster\" in the Ovoni language. He sacrificed himself by confronting Vader, ensuring that the Dark Lord was distracted so that the sugati could successfully destroy Tremor Base."}, {"tag": "p", "text": "Hylon wore a brown set of Jedi robes. He carried a lightsaber, which contained a green crystal, and possessed a staff that also hid a sword."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Hylon, along with his Padawan, Dendro, managed to survive the initial stages of the Great Jedi Purge. He was capable of using both his lightsaber and staff during combat, although his skills were not enough to defeat Vader. When Vader destroyed Hylon's lightsaber, the Jedi used his hidden sword against Vader and managed to disarm him, but he was ultimately slain by the Dark Lord."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hylon first appeared in the standalone 2010 comic Star Wars: Purge: The Hidden Blade, written by W. Haden Blackman and penciled by Chris Scalf. The comic details the events of Hylon's death at Darth Vader's hands during the Great Jedi Purge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}