{"url": "Hyperbaride/Legends", "categories": ["Category:Legends articles", "Category:Science stubs", "Category:Chemicals", "Category:Elements"], "nodes": [{"tag": "h1", "text": "Hyperbaride"}, {"tag": "p", "text": "Hyperbarides were a group of so-called superheavy elements that were extremely rare throughout the galaxy, but were required for turbolaser technology."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Hyperbarides were known to be as stable as more common elements, but they had certain special chemical and physical properties. They could withstand high temperatures, levels of radiation and flux densities, which made them useful for many high-energy technologies."}, {"tag": "p", "text": "Hyperbarides were cytotoxic minerals that were lethal to nearly any form of life based on carbon-oxygen physiology, similar to other heavy metals, but also served as a mutagen. The only known species resistant to hyperbarides were the Gorothites, due to their evolution on a heavy-metal- and hyperbaride-rich world."}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "Hyperbarides could be synthesized from normal elements, but the process was very expensive, requiring high pressure and temperature and a lot of energy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the reign of the Galactic Empire, hyperbarides had been known for several centuries."}, {"tag": "p", "text": "During an industrial accident in 22 BBY, hyperbaride runoff was released among other industrial waste when Waste Canister Delivery Port 84-D-21 in the Desrini District of Coruscant misfired."}, {"tag": "p", "text": "Normally the price of hyperbarides ranged around 2,200 credits per kilogram during the Galactic Civil War, though this varied according to Imperial price controls."}, {"tag": "p", "text": "The Galactic Empire had several synthesis plants, but their locations were highly guarded military secrets. One of them was on the planet of Marca, and another one was on Goroth Prime, but corporately controlled."}, {"tag": "p", "text": "It was possible to die of \"hyperbaride poisoning.\" An Imperial dignitary died of such poisoning due to eating Clawcats."}, {"tag": "h2", "text": "Deposits"}, {"tag": "p", "text": "Hyperbarides were extremely rare and could only be found on a few planets; even there, an occurrence of one part per quadrillion was considered abnormally high. Naturally existing hyperbarides came in compounds, such as ilinium trioxide or vintrium hydride, which were less valuable than pure materials."}, {"tag": "p", "text": "The world Goroth Prime had an unnaturally high concentration of hyperbarides, among other heavy metals, in its crust. This was not discovered until its devastation and rediscovery a few thousand years later."}, {"tag": "h2", "text": "Known hyperbarides"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The idea of hyperbarides stems from the real-life idea of the \"island of stability.\" This predicts that some superheavy element isotopes with specific nuclear structures, like a certain isotope of flerovium, can be unusually stable. There is evidence to support this hypothesis, but it is not proved, since synthesizing the correct isotopes is very difficult, and the exact recipe is still unknown. Some scientists theorized that superheavy elements may occur naturally in fresh supernova remnants."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}