{"url": "Hyperdrive_(Punch_It!)", "categories": ["Category:Canon articles", "Category:Beverages in Black Spire Outpost", "Category:Cantonican food", "Category:Effervescent beverages", "Category:The Official Black Spire Outpost Cookbook recipes"], "nodes": [{"tag": "h1", "text": "Hyperdrive (Punch It!)"}, {"tag": "p", "text": "Hyperdrive (Punch It!) was a non-alcoholic, carbonated beverage that provided energy. It was teal and red in color, and had berry and fruit flavors. The drink originated in the casinos of Canto Bight on Cantonica, and was served at Oga's Cantina in Black Spire Outpost on Batuu. Artiodac chef Strono Tuggs included a recipe for the drink in his cookbook."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Hyperdrive (Punch It!) was a non-alcoholic beverage found at drinking establishments in the galaxy. The teal-colored punch combined a carbonated drink, berry juices and flavors, crushed ice, and a red fruit purée which was poured on top and sank to the bottom. The beverage replenished the drinker's energy and was suitable for human consumption."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Hyperdrive (Punch It!) shared its name with the hyperdrives that enabled starships to reach lightspeed. The phrase \"punch it\" was used by starship pilots as an instruction to engage the hyperdrive; the beverage itself was also described as a punch."}, {"tag": "p", "text": "The punch originated in the casinos of Canto Bight on Cantonica, where it was a popular beverage that assisted gamblers with staying awake to continue gambling. In 34 ABY, it was served in Black Spire Outpost on the planet Batuu at Oga's Cantina, an establishment that used a hyperdrive to supply power. During that time, host Palob Godalhi of the Black Spire Outpost radio station BSO 401.72 was known to tell his listeners they should visit the cantina and order the beverage."}, {"tag": "p", "text": "After the Battle of Takodana in 34 ABY, Artiodac chef Strono Tuggs published his cookbook and included a recipe for the beverage, which he enjoyed drinking for its bold flavor and its energizing effects. He compared its ability to provide energy with a hypothetical digestible form of coaxium."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Hyperdrive (Punch It!) is one of the non-alcoholic beverages sold to customers at the Oga's Cantina bar in Star Wars: Galaxy's Edge. It was first revealed as part of a large promotional event held on February 26, 2019. The menu's description reads, \"Powerade® Mountain Berry Blast, White Cranberry Juice, Black Cherry Purée, and Sprite®.\""}, {"tag": "p", "text": "A recipe for the beverage is included in the 2019 cookbook Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook, which was written by Chelsea Monroe-Cassel and Marc Sumerak. The ingredients are white cranberry or white grape juice, blue-colored berry-flavored sports drink, lemon-lime soda, and black cherry purée."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}