{"url": "Hypergate", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Gree technology", "Category:Hyperspace technology"], "nodes": [{"tag": "h1", "text": "Hypergate"}, {"tag": "p", "text": "Hypergates were a form of faster-than-light transportation used by the ancient Gree civilization."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "A network of devices that created hyperspace wormholes, hypergates used an unknown technology to circumvent mass shadows, allowing near-instant travel through space and to other hypergates.[source?] Hypergates had a variety of sizes and functionality with such shapes typically being freestanding accessways, gateways, or archways. Those that activated the technology and stepped through the threshold were instantly transported through hyperspace to a corresponding hypergate terminus at another location. Such locations tended to vary as a receiving hypergate was capable of being located on the planet of origin or another world entirely with rumors of this latter fleet known of variant gates that were capable of sending entire starships across the galaxy."}, {"tag": "p", "text": "They were considered a significant development of Gree technology. Amongst the Gree, the hypergates were venerated by their culture as sacred relics of technological works of art. Their civilization had long claimed that only the elite Gatemasters of their Operator caste were capable of activating a hypergate, though this may have been a cultural bias. They became a lost technology that the Gree refused to duplicate."}, {"tag": "p", "text": "One variant of these devices was the Grand Hypergate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "These devices were constructed countless millennia ago in a time known to the Gree as \"the most ancient and forgotten days.\" In time, a number of these devices were spread across the space of the Gree Enclave with dozens once connecting the myriad of Gree worlds. In the aftermath of their creation, other forms of personal interplanetary travel became obsolete though starships were still used on occasion. As Gree society declined, their ability and willingness to duplicate their technology atrophied. The secret of building hypergate technology was known only to Gree masters, who operated their remaining constructor devices.[source?] After centuries of neglect, only ruins of them remained, and their existence was a closely guarded secret. A major hub of the hypergate system was the Grand Hypergate on Asation, but due to the Asation gatemaster's inability to use it, it was little more than a historical monument.[source?] By this point, not even the Gree fully understood hypergate technology. On Tython, the early Je'daii Tythans discovered the Old City that had been long ago abandoned and rumors persisted of a working hypergate present in the settlement but none had been discovered."}, {"tag": "p", "text": "During the Galactic War between the Galactic Republic and the Sith Empire, the rogue Sith known as the Dread Masters directed their servant Kephess to the Gree world of Asation. Once there, the twisted Trandoshan activated the hypergate and allowed countless unknown terrors to ravage the planet. In response, the Gree sent ambassadors to both the Republic and Empire to request aid. A group of spacers from one faction later traveled to Asation, where they battled the creatures besieging the planet and confronted Kephess, who was ultimately killed. However, the opened hypergate brought a monstrous being to the planet, which the spacers had to force back into the hyperspace threshold and remove its hold from the gate, thus defeating it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the 1991 West End Games supplement Graveyard of Alderaan, an experimental hypergate was present on the planet Alderaan, where a group of rebels used it to travel between a remnant of the Aldera Royal Palace and the bridge of the Alderaanian War Frigate Another Chance. However, when the adventure was reprinted in Classic Adventures: Volume Two, all reference to the hypergate was removed, and the Rebels boarded the Another Chance via a GAT-12 Skipray Blastboat."}, {"tag": "p", "text": "The hypergates are strongly reminiscent of other fixed-terminus long-distance transport methods like the Stargates of Buck Rogers and the Stargate franchise, the Iconian gateways of Star Trek: The Next Generation, or the Eldar Webway of the Warhammer 40,000 universe, all of which predated the debut of the Gree."}, {"tag": "p", "text": "It is unknown whether or how the hypergates were related to the Infinity Gates built by the Kwa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}