{"url": "Hypermatter/Legends", "categories": ["Category:Legends articles", "Category:Fuels", "Category:Physics"], "nodes": [{"tag": "h1", "text": "Hypermatter"}, {"tag": "p", "text": "Hypermatter was an exotic form of fuel used in the hypermatter annihilators of starships and immense battlestations. Its unusual properties allowed vessels to produce the phenomenal amounts of energy necessary for their operation."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Hypermatter was tachyonic matter that existed in hyperspace. When constrained by realspace, charged tachyons were annihilated as they accelerated to infinite speed within a reactor. The hyperdrive adjusted the faster-than-light hypermatter particles to allow a ship to jump to lightspeed without changing its complex mass and energy. The hypermatter annihilation cores were in turn confined by fusion systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Despite its high efficiency, hypermatter still required massive amounts of reactant fuel to power the great starships of the spacelanes. For example, at peak power, the Venator-class Star Destroyer's main reactor annihilated the equivalent of 40,000 tons of matter each second. Even small starfighters required significant fuel supplies—the Utapaun P-38 starfighter consumed 6.2 kilograms of hypermatter each second at full power. Hypermatter was also found in the hyperdrive rings used by some Clone Wars–era starfighters."}, {"tag": "p", "text": "During the late years of the Galactic Republic, research into utilizing hypermatter for needs other than starship powering was ramped up considerably. A grant from Republic Sienar Systems was given to the Republic Ministry of Science allowing them to continue research into hypermatter for planetary power, deep-space mining, and other civilian uses. Some of this research was later used to refine the plans for Sienar's Expeditionary Battle Planetoid, which evolved into the Death Star project."}, {"tag": "p", "text": "Hypermatter instability was a great risk to any process using it, as shown when the Imperial II-class Star Destroyer Battle Lance was vaporized along with its crew, when the improved, prototype hypermatter reactor it was carrying malfunctioned."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}