{"url": "Hyperspace:_The_Official_Star_Wars_Fan_Club", "categories": ["Category:Real-world articles", "Category:Website stubs", "Category:Hyperspace: The Official Star Wars Fan Club"], "nodes": [{"tag": "h1", "text": "Hyperspace: The Official Star Wars Fan Club"}, {"tag": "p", "text": "Hyperspace: The Official Star Wars Fan Club was Lucasfilm's worldwide fan club for Star Wars fans."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Hyperspace Club was given its name in 2004 when it merged with the subscriber feature of StarWars.com, the official Star Wars website. On May 5, 2010, StarWars.com announced that the Hyperspace Fan Club would be discontinued in 2011. The week of June 20, the 2010 membership packets began shipping."}, {"tag": "p", "text": "The service ceased to exist when the site was reformatted in late 2011."}, {"tag": "h2", "text": "Membership"}, {"tag": "p", "text": "The Club required a regular subscription fee for membership. Membership gave subscribers special privileges. Members were given exclusive access to a special Hyperspace section of the official Star Wars site. For a time, members who lived in the United States received a free subscription to the Star Wars Insider magazine, though that perk was later removed."}, {"tag": "p", "text": "Hyperspace members were able to create a large range of Star Wars avatars that appeared on any of their blogs and posts on the forums. They were also given the exclusive use of the Star Wars Blogging tool, periodic offers for discounts and other deals on Star Wars products and memorabilia, and access to write entries for the Databank."}, {"tag": "h2", "text": "Content"}, {"tag": "p", "text": "Nine short stories from Hyperspace have been republished on Suvudu, an online genre site created by Random House publishing company. The republished short stories include The Secret Journal of Doctor Demagol, Labor Pains, Interference, Precipice, Lando Calrissian: Idiot's Array, Fists of Ion, Deader than a Triton Moon, Crossroads, and Shades of Gray."}, {"tag": "h3", "text": "Sections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}