{"url": "Hyperspace_Mountain", "categories": ["Category:Real-world articles", "Category:Theme park attractions"], "nodes": [{"tag": "h1", "text": "Hyperspace Mountain"}, {"tag": "p", "text": "Hyperspace Mountain is a Star Wars-themed seasonal overlay to the Space Mountain roller coaster attractions at three Disney Parks. The Disneyland version opened as part of the Season of the Force event on November 14th, 2015, and the Hong Kong Disneyland version opened June 11th, 2016, as part of the Star Wars: Tomorrowland Takeover event. On May 6th, 2017, the update opened in Disneyland Paris under the name Hyperspace Mountain: Rebel Mission."}, {"tag": "p", "text": "Utilizing the animation projection infrastructure used in the ride's earlier Halloween-themed Ghost Galaxy overlay, laser effects, and a newly recorded arrangement of assorted John Williams scores performed by the London Symphony Orchestra, the attraction put guests into a dogfight between X-wing starfighters and TIE fighters at the start of the Battle of Jakku."}, {"tag": "p", "text": "The ride returned to its original \"classic\" Space Mountain format at Disneyland on June 1st. Hyperspace Mountain returned temporarily in 2018 on May 4th in celebration of \"Star Wars Day\", and is set to return on that same date in 2019."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "The attraction queue is mostly left in its standard form, though graphics and a brief pre-show and safety film set up the simple story and place Space Mountain's space station setting into the role of a New Republic base. The Hong Kong installation added an X-Wing hangar mockup to an outdoor portion of the queue. Admiral Gial Ackbar sends out a brief holo-transmission to a group of reconnaissance pilots to investigate an Imperial Star Destroyer near Jakku. He also announces the 77 Squadron—flying as \"Blue Squadron\"—will provide support for the mission. Much of this back story is not mentioned in the Paris version of the ride, since there is only a safety video featuring a human woman, and no appearance by Ackbar."}, {"tag": "p", "text": "After boarding the reconnaissance vessel (portrayed by Space Mountain's sled-like rocket vehicles), the recon team and Blue Squadron make a jump through hyperspace. Upon arrival at Jakku, a group of TIEs ambushes the team. The recon vehicle ducks and weaves its way through the dogfight and assorted laser-fire from either side. With the TIE squadron destroyed, Blue Squadron is able to make a critical destructive hit on the Star Destroyer's bridge area and make a quick jump through hyperspace back to the base."}, {"tag": "h2", "text": "Gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Space Mountain originally opened at Disneyland on May 27th, 1977, two days after A New Hope first premiered in theaters (Walt Disney World's version had opened two years earlier). In 2005, as part of Disneyland's 50th Anniversary, the attraction underwent a significant overhaul including a new sound system and digital projection infrastructure that would allow for alternative versions of the attraction. The first variation was Rockin' Space Mountain, followed a few years later by a more involved Halloween overlay borrowed from Hong Kong's park, Space Mountain Ghost Galaxy. That more successful overlay added additional projection hardware in 2007."}, {"tag": "p", "text": "In 2015, to promote The Force Awakens and act as a stop-gap until the Star Wars-themed expansion to Disneyland opened, Disney announced a promotional event called \"Season of the Force\" located in Tomorrowland, consisting of an The Force Awakens themed-update to Star Tours: The Adventures Continue, a clip show of the entire saga entitled Path of the Jedi, an update to the Jedi Training Academy entitled Trials of the Temple, the Star Wars Launch Bay exhibit, and Hyperspace Mountain."}, {"tag": "p", "text": "Disney Imagineers consulted with Lucasfilm Story Group to ensure Hyperspace Mountain would fit into the canon timeline and decided to tell the story of the space battle portion of the Battle of Jakku, which also appeared in the novel Lost Stars and the Star Wars Battlefront video game. New starfighter animation and musical arrangements of John Williams' tracks were produced for the overlay and the temporary attraction opened at Disneyland on November 14th, 2015."}, {"tag": "p", "text": "The 77 Squadron takes its number from 1977, both the year when Star Wars: Episode IV A New Hope first premiered and when Space Mountain first opened at Disneyland park."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}