{"url": "Hyperspace_Marauder", "categories": ["Category:Legends articles", "Category:New Republic starships", "Category:Smuggler starships", "Category:Xiytiar-class transports"], "nodes": [{"tag": "h1", "text": "Hyperspace Marauder"}, {"tag": "p", "text": "The Hyperspace Marauder was Lo Khan's personal smuggling starship."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A modified Xiytiar-class transport, Hyperspace Marauder performed for most of its smuggling career without weapons and was relatively slow. It cost 800,000 credits."}, {"tag": "p", "text": "While Lo Khan upgraded the ship's shields and armor plating, he preferred safe, high-traffic hyperlanes to make up for Marauder's lack of defenses. In the event of attack, Lo Khan used his ship's onboard communications system that could hijack an attacker's computer. This unique system put the ultimate gun to the heads of raiding vessels, as Khan could shut down any part of a raiding ship, even the life-support systems. His usual MO was much less violent, however—typically, Khan would loot whatever was worth stealing from the enemy ship and shut down the enemy ship's hyperdrive, leaving the would-be raiders to limp along for weeks at sublight speeds and rethink ever crossing Khan again."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Lo Khan began running goods to Byss during the reborn Emperor's campaign, he finally gave Marauder some teeth with a pair of 700 Penetrator laser cannons. His additions could not have been any more timely."}, {"tag": "p", "text": "During Salla Zend and Shug Ninx's involvement with Han Solo and Leia Organa Solo's mission to Byss, they hid the Millennium Falcon inside Marauder, which resulted in ship transport taking crippling damage from a hunter killer droid."}, {"tag": "p", "text": "Later, Marauder joined Starhook Ten and Bespin Bandit in strafing runs on Imperial war beasts during the Battle of the Emperor's Citadel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}