{"url": "Hyperspace_tracker", "categories": ["Category:Canon articles", "Category:Technology stubs", "Category:Hyperspace technology", "Category:Imperial projects and operations"], "nodes": [{"tag": "h1", "text": "Hyperspace tracker"}, {"tag": "p", "text": "A hyperspace tracker was a type of active tracker with the ability to detect starships traveling through hyperspace, a feat not thought possible until the First Order first utilized it against the Resistance in 34 ABY during the Attack on the Resistance fleet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The science behind hyperspace tracking was studied by the Tarkin Initiative during the reign of the Galactic Empire, and files about these studies were discovered by Jyn Erso during the Battle of Scarif in 0 BBY. The science was not perfected for several more decades when a team assembled by General Armitage Hux discovered how to implement the technology."}, {"tag": "p", "text": "Part of the technology used in the hyperspace tracker was a complex static hyperspace field generator, which enveloped arrays of databanks and computers in a localized hyperspace field that accelerated their calculation speeds to unimaginable rates."}, {"tag": "p", "text": "Resistance hero Finn and young Flight Engineer Rose Tico attempted to board the Mega-class Star Dreadnought Supremacy and cut off its hyperspace tracker to enable the Resistance fleet to escape. They were helped by a crack codebreaker named DJ who betrayed them and turned them in to the First Order."}, {"tag": "p", "text": "Following the disastrous tracking of the Resistance fleet by the First Order, Rose Tico spent many months working under General Leia Organa, developing new technology and techniques to prevent hyperspace tracking."}, {"tag": "p", "text": "One year later, in 35 ABY, the Millennium Falcon crewed by Poe Dameron, Chewbacca and Finn was pursued by several First Order TIE fighters during a mission to the Sinta Glacier Colony. As Poe and Finn raced to retrieve intel from the Resistance informant Boolio, the Falcon came under attack from the fighters, which had since been equipped with hyperspace trackers, forcing Dameron to resort to the extremely dangerous act of lightspeed skipping as a means of escaping the First Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}