{"url": "I,_Droid", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:The Legends of Luke Skywalker—The Manga"], "nodes": [{"tag": "h1", "text": "I, Droid"}, {"tag": "p", "text": "I, Droid is a story that was published in The Legends of Luke Skywalker—The Manga. The story was written and illustrated by Haruichi, and published on January 14, 2020 by Viz Media."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Enslaved"}, {"tag": "p", "text": "The protagonist introduces himself as a Z7 series construction droid named Zeta, who was designed for hard labor on developing planets. Zeta recalls experiencing a wide range of conditions including permanent frost, jungles, swaps, and deserts. While building a new settlement on the tundra of Cro-Akon, her life was \"destroyed\" by roaring wind, light and wires. Upon awakening, the droid found herself aboard a slave ship to an a space station called Gem."}, {"tag": "p", "text": "The slave ship's captain U'rum meets with Lord Kluleyeke and Lady Eekee. Kluleyeke is keen to view U'rum's collection of enslaved droids. Besides Zeta, another prisoner is a small white, silver and blue astromech droid, which had managed to slice through its restraining bolts. Lord Kluleyeke warns the captain that R2 series droids are known for aftermarket modifications and have hidden appendages. However, he believes that the droid can be put to good use sifting through the crushed ore until the acid melts all his appendages. While R2-D2 squeals in protest, Zeta is horrified about droids being forced to work till they melt."}, {"tag": "h3", "text": "Security enforcer"}, {"tag": "p", "text": "As Zeta and the other enslaved droids enter the factory where Lord Kluleyeke puts them to work digging for rare gemstones within the inhospitable mines of \"The Deep\". Within the factory, the droids are modified with new limbs and appendages for working in the mines. Zeta is not given a memory wipe but rather an override chip. Later, the droids are transported down to the inhospitable planet which is ravaged by thunderstorms. An RA-7 protocol droid moans that they are doomed since they can't survived that planet. R2-D2 tries to cheer him up but he is in no mood to sing."}, {"tag": "p", "text": "On the Deep, Zeta has been reprogrammed through the override chip into a security droid used to enforce rules and suppress rebellions. The override chip causes her to act violently out of control. The droids labour hard to extract and process tear opals. Droids that are damaged and can no longer work are disintegrated. The only droid that Zeta is unable to force into submission is the white, silver, and blue astromech droid, who refuses to give up hope of being rescued."}, {"tag": "h3", "text": "The false droid"}, {"tag": "p", "text": "Several days later, Zeta is summoned by Lord Kluleyeke, who is pleased with her work as an enforcer droid. He appoints her the job of wrangling the new shipment. Zeta pities the new shipment of droids, knowing the fate that awaits them below. One of the new protocol droids appears to have volunteered. Lady Eekee notices that his plates are loose and a bit misshapen. The droid claims to be fluent in six million forms of communication and an excellent musician. When asked by Lord Kluleyeke, Zeta thinks that the droid's cognitive circuits are more advanced that he suggests. Since the protocol droid volunteered, Eekee, Kluleyeke and Captain U'rum decide to send him down to the mines."}, {"tag": "p", "text": "Down in the Deep, Zeta brutally bashes a droid, ordering it to hurry up. She orders the new protocol droid to get to the sifting line, warning that him to pick out a hundred grams of tear opals or else he will be sent to the tunnels to dig ore. The protocol droid manages to chat with the other droids including the astromech droid, whom he addresses as R2-D2 and apologizes for taking so long to get here. Zeta notices the two droids are talking and confronts the protocol droid. However, the droid rapidly leaps out of harm's way and wields a lightsaber."}, {"tag": "p", "text": "Zeta wonders if the droid is human but is skeptical since no human can survive in The Deep. Influenced by her override code, Zeta denounces the rebellion and vows to suppress it. However, the protocol droid leaps out of harm's way. Zeta grabs him and hurls him to the ground. While smashing the protocol droid, she realizes that the droid is a disguised Luke Skywalker She notices the man has a metal hand and marvels that this man is fearless in such a hellish place. She wonders whether he is a droid or man."}, {"tag": "h3", "text": "Droid rebellion"}, {"tag": "p", "text": "Skywalker tells the enslaved droids that they have to work together and that this is their last chance to be free. The enslaved droids including R2-D2 rebel and stop work. Under the influenced of her override code, Zeta attempts to put down the droid uprising and attacks Skywalker. Trying to resist the override code, Zeta pleads with Skywalker to destroy her while he can. Skywalker gets R2-D2 to pass him his lightsaber. Skywalker cuts himself free of her claw arm. A pit droid rams a boulder hanging from a crane into Zeta, knocking her to the ground. Believing that there is still good in zeta, Skywalker enlists R2-D2's help in cutting out her override chip. Skywalker manages to remove the override chip before more security droids arrive including a repurposed B2-series super battle droid."}, {"tag": "p", "text": "Skywalker cuts down the B2 super battle droid. Before he can finish him off, Zeta convinces Skywalker to spare the battle droid since there is still good in him.  She tells Skywalker that the override chip has a weakness and that single logic gate can be flipped to disable the whole chip. However, she warns that it will be difficult even for droids to do so. However, Skywalker is not undaunted and uses the Force to close the parity gates and to flip the few dozen logic gates scattered across trillions of gates in enforces across the deep; effectively liberating the security droids from their override chips."}, {"tag": "p", "text": "The newly liberated droids imprison their sentient slave masters aboard the cells in the gem. Lord Kluleyeke, Lady Eekee and Captain U'rum are brought before Skywalker. Kluleyeke denounces the \"pesky\" human for scheming a droid rebellion and vows vengeance against Zeta. However, R2-D2 squirts a liquid at him. Skywalker replies that R2-D2 was telling him to shut up. He tells Kluleyeke that they will be dropping him off with the authorities to be put on trial. He adds that Zeta could serve as a witness."}, {"tag": "p", "text": "Taking pity on Zeta, Skywalker asks her to lead him to the infirmary. There, he repairs the droid and fits her with arms and hands. Zeta is grateful. Skywalker tells her this is his amends for breaking them. Skywalker tells the droids that he will be returning them to their homes. While chatting with R2-D2, Skywalker tells him that C-3PO was mad at him. Watching the two chatting as friends, Zeta marvels at the friendship between Skywalker and his astromech droid. Reflecting on Skywalker's role in freeing the forgotten droid slaves, Zeta surmises that Skywalker is not only a great man but at least partly a great droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}