{"url": "Amni_Ponnar", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Amni Ponnar"}, {"tag": "p", "text": "Amni Ponnar was a young Human female who lived at her parent's homestead on Tatooine around 0 BBY. That year, her life was put in danger after her father's plan to make the local Jawas and Tusken Raiders go to war over food turned wrong. She was saved by Jedi Master Ben Kenobi and his new young trainee Luke Skywalker. Back to her home, she learned of her father's treachery from Kenobi and noticed that the locals had followed them. However, Kenobi defused the escalation of violence and went his way, leaving Amni and her mother settle accounts with her father."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Amni Ponnar was born to Human parents in the later years of the Imperial Period. By 0 BBY, she lived with her father and mother at the family homestead, situated in the Jundland Wastes. Although her father considered him to be a \"crazy old man,\" Ponnar was an acquaintance of Ben Kenobi, secretly a Jedi Master in hiding who lived out beyond the Dune Sea. She was also familiar with Luke Skywalker, a nineteen-year-old who resided at his uncle's home on the Great Chott salt flat."}, {"tag": "p", "text": "In 0 BBY, Amni's father sought to expand his farm at the expense of the local Jawas and Tusken Raiders. Unbeknownst to his wife and daughter, he stole all the hubba gourds that grew on a cliff while they were still growing. Since those hubba gourds were the main staple food of both species, Amni's father hoped the two groups would fight over the vanished fruits. With the Jawa and Tusken Raider clans wiping out one another, the farmer could farm beyond the bounds of his current property."}, {"tag": "p", "text": "However, some of the locals noticed Ponnar's landspeeder while he was stripping the hubba gourds clean. When Amni was sent to Anchorhead to purchase supplies, she found herself in the middle of a fight between Jawas and Tusken Raiders on her way back, and the fighters recognized the Ponnar family speeder. The girl was rescued by the timely arrival of Kenobi, who was headed to Mos Eisley with Luke Skywalker, who was now his apprentice. The two men returned Amni safely to her homestead, where the farmer Ponnar gave them a lukewarm reception."}, {"tag": "p", "text": "Suspecting that Ponnar might have something to do with the natives' hostile behavior, Kenobi pretended to wash off the sand from his clothes so he could investigate the house. Kenobi found the stolen hubba gourds behind a sliding wall and exposed the treachery in front of the homestead residents. The young Amni was appalled to learn of her father's machinations. When Ponnar threatened Kenobi with a blaster, Luke Skywalker reacted by swinging his father's lightsaber at the gun, cutting through its barrel before the farmer had the occasion to shoot. Immediately afterwards, Amni realized that the fighting Jawas and Tusken Raiders had followed them home and were about to assault the place. Since the farm's occupants were clearly outnumbered, Kenobi defused the situation by redistributing the stolen hubba gourds. Once the natives had left, Amni and her mother waved their heroes of the day goodbye, while her father was crushed by the shame of his devious scheme."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By 0 BBY, Amni Ponnar was a juvenile female with fair skin and green eyes. She had a speckled face and brown hair, which she wore in twin bunches. Despite her young age, Amni's parents deemed her responsible enough to travel through the Jundland Wastes on her own, and she was also capable of piloting the family landspeeder herself. While she had been attacked by the Jawas and the Tusken Raiders, Amni was still shocked at the idea that her father would lead them to stand at daggers drawn. Following Kenobi's departure, she looked at her father with contempt, which the Jedi found to be enough of a punishment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Amni Ponnar first appeared in War on the Jundland Wastes, a comic written by Mike W. Barr and illustrated by Bob Molesworth, which was published in 2014 in Star Wars Comic 1."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}