{"url": "I-C4a_combat_construction_droid", "categories": ["Category:Canon articles", "Category:Construction droid models", "Category:Droid vehicles", "Category:Imperial droids", "Category:Veril Line Systems products"], "nodes": [{"tag": "h1", "text": "I-C4a combat construction droid"}, {"tag": "p", "text": "The I-C4a combat construction droid was an autonomous construction droid manufactured by Veril Line Systems for the Galactic Empire's Imperial Corps of Engineers. The droid possessed a fabrication system that allowed it to produce slabs of building material with which to create structures. While a majority of I-C4a units were owned by the Imperial Army, the construction droids also fell into civilian or Rebel Alliance hands, developing personalities when not subjected to the Empire's frequent memory wipes."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A smaller and militarized version of the I-C2 Civil-Industrial Droid, the I-C4a combat construction droid was an autonomous construction and fabrication droid. The I-C4a was a slow-moving droid vehicle with a long, slab-sided body, propelled by a versatile and articulated track system like that found on the Corellia Mining Corporation digger crawler."}, {"tag": "p", "text": "The construction droid held a powerful fabrication system that consisted of a fusion furnace that was capable of producing slabs of building materials—including ferrocrete, stresscrete, armorplas, and plasteel—out of either raw or recycled materials. Equipped with dozens of tools and appendages for lifting and fabricating, the I-C4a was able to both clear land and build structures at a surprising rate. The droid vehicle was also equipped with a dorsal heavy repeating blaster."}, {"tag": "p", "text": "The fabrication and construction system was controlled by an on-board droid brain, though two combat engineers could ride in an open-air cockpit to monitor the droid's power, propulsion, and control systems. The GT-series construction droid was able to interface with the I-C4a combat construction droid, and was often used to replace the vehicle's organic crew. I-C4a units developed fast-talking, obsessive, and often distracted personalities when not in the possession of the Galactic Empire, speaking in a dense mix of engineering jargon and scientific technobabble."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Utilized during the time of the Galactic Empire, the I-C4a combat construction droid was manufactured by Veril Line Systems for the Imperial Corps of Engineers and was available for 750,000 credits. The Imperial Army owned a majority of the I-C4a units, which it officially classified as restricted military-grade materiel, subsequently giving the construction droids regular memory wipes. Despite this, a number of I-C4a combat construction droids fell into the hands of civilians or the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The I-C4a combat construction droid was introduced in Fully Operational, a 2018 sourcebook for Fantasy Flight Games' Star Wars: Age of Rebellion roleplaying game."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}