{"url": "ICM-092792", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Galactic Empire space station classes", "Category:Huppla Pasa Tisc Shipwrights Collective products"], "nodes": [{"tag": "h1", "text": "ICM-092792"}, {"tag": "p", "text": "The ICM-092792, also known simply as an Imperial construction module, construction sphere, Imperial reclamation plant, or orbital command habitat, was a model of large-scale space station manufactured by Huppla Pasa Tisc Shipwrights Collective and used by the Galactic Empire during building projects. Such modules were equipped with several crane arms and contained all data, materials, and plans related to the development of a given project. The Command Center built by the Empire in the capital of the planet Lothal was of the same design as those construction modules, as was Yarma's Reklam Station."}, {"tag": "p", "text": "Several construction spheres were used to support the construction of the Death Star in the orbit of the planet Geonosis. Eventually, the Death Star was moved to another location. In the third year before the Battle of Yavin those spheres orbiting Geonosis were discovered by the rebellion, a network of cells that sought to overthrow the Empire. Consequently, the rebel crew of the Ghost was dispatched there to retrieve the sphere's databanks, which could provide information on whatever the Empire was building at Geonosis. That module, however, had been inactive for some time, and the rebels had fallen into an Imperial trap; as soon as they entered the base, the freedom fighters were ambushed by Agent Kallus of the Imperial Security Bureau and several squads of stormtroopers."}, {"tag": "p", "text": "Grand Admiral Thrawn employed construction modules above Lothal along with his Seventh Fleet, in order to oversee his mining operations there. Hera Syndulla of the Spectres was able to break through the blockade of Lothal by launching into hyperspace through the hangar of a construction module, destroying docked starships and damaging the station."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}