{"url": "IDW_Publishing", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Real-world publishing companies"], "nodes": [{"tag": "h1", "text": "IDW Publishing"}, {"tag": "p", "text": "IDW Publishing is an American comic-book publisher, best known for its licensed comic adaptations and tie-in work for various movies and cartoons, such as Star Trek, My Little Pony, Ghostbusters, and Teenage Mutant Ninja Turtles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Idea and Design Works was formed in 1999 by a group of entertainment executives and artists that included Ted Adams, Robbie Robbins, Alex Garner, and Kris Oprisko to develop products related to video games, movies, TV, collectible card games, comic books, and trading cards. The IDW Publishing division was formed in the year 2000."}, {"tag": "p", "text": "After developing multiple other Disney titles, including Donald Duck and Mickey Mouse, their first venture into the world of Star Wars began with the release of the Star Wars edition of the Micro Comic Fun Pack in 2015, a series of bling bags containing comics, stickers, and posters, of which editions relating to other series had already been released at that point."}, {"tag": "p", "text": "They have since started reprinting the Los Angeles Times Syndicate comic strips in hardcover compilations, the first of which was Star Wars: The Classic Newspaper Comics Vol. 1 on May 9, 2017."}, {"tag": "p", "text": "They are current holders of the Star Wars juvenile comics license, with which they started publishing original comics, beginning with Star Wars Adventures Ashcan on July 20, 2017 at San Diego Comic-Con and Star Wars: The Force Awakens Graphic Novel Adaptation on August 29."}, {"tag": "h2", "text": "Published series"}, {"tag": "h3", "text": "Star Wars Micro Comic Fun Pack"}, {"tag": "h4", "text": "A New Hope"}, {"tag": "h4", "text": "The Empire Strikes Back"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "h4", "text": "Icons"}, {"tag": "h3", "text": "Graphic novels"}, {"tag": "h3", "text": "Series"}, {"tag": "h3", "text": "Miniseries"}, {"tag": "h3", "text": "One-shots"}, {"tag": "h2", "text": "Published collections"}, {"tag": "h3", "text": "Star Wars Newspaper Comics"}, {"tag": "h2", "text": "Current series"}, {"tag": "h3", "text": "Ongoing series"}, {"tag": "h2", "text": "Forthcoming series"}, {"tag": "h3", "text": "Miniseries"}, {"tag": "h3", "text": "One-shots"}, {"tag": "h3", "text": "Graphic novels"}, {"tag": "h2", "text": "Forthcoming collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}