{"url": "IG-101/Legends", "categories": ["Category:Legends articles", "Category:IG-100 MagnaGuards", "Category:Masculine programming", "Category:Separatist droids", "Category:Separatist military members"], "nodes": [{"tag": "h1", "text": "IG-101"}, {"tag": "p", "text": "IG-101 was one of several of General Grievous's IG-100 MagnaGuards. Trained in the seven forms of lightsaber combat by Grievous, IG-101 was a formidable martial combatant, more than a match for most opponents, and even able to compete with Jedi. He participated in the Battle of Coruscant towards the end of the Clone Wars, accompanying Grievous aboard his flagship, the Invisible Hand. He and IG-102 retrieved Anakin Skywalker and Obi-Wan Kenobi when they were captured by security forces aboard the Hand, bringing them before Grievous. When the Jedi escaped captivity and fought back, Grievous ordered IG-101 and 102 to engage the Jedi. Focusing on Kenobi, 101's formidable combat skills allowed him to quickly gain ground on the Jedi, though his repetitive fighting form proved to be his undoing, and he was decapitated and dismembered by his opponent."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "IG-101, along with IG-102, served as the cyborg General's bodyguards onboard Invisible Hand during the Battle of Coruscant in 19 BBY."}, {"tag": "p", "text": "He and IG-102 personally led the force that successfully captured Anakin Skywalker and Obi-Wan Kenobi during their botched rescue attempt of Supreme Chancellor Palpatine, as well as Skywalker's astromech droid, R2-D2. Bringing the Jedi before Grievous on the Invisible Hands bridge, they took up positions behind the General while the cyborg gloated over the Jedi. However, all on the bridge were distracted by a pyrotechnics display unleashed by Skywalker's astromech, allowing Kenobi to retrieve his lightsaber from the sheath pocket inside Grievous' cape, where it had been deposited as the newest addition to the cyborg's collection. Kenobi quickly cut his bonds and freed Skywalker, who wasted no time retrieving his own weapon."}, {"tag": "p", "text": "With the Jedi rearmed, Grievous ordered IG-101 and 102 to engage, and make them suffer. The two droids initially teamed up on Kenobi, but IG-102 broke off to take Skywalker, leaving 101 to deal with Kenobi. Despite the Jedi's best efforts, 101 managed to drive him back towards the front of the bridge. However, Kenobi was able to pin the MagnaGuard's electrostaff against a console and decapitate the droid. However, as MagnaGuard primary processors and had a secondary 'eye' in their chest, 101 was able to continue fighting."}, {"tag": "p", "text": "Opting for a one-handed hold of his staff, IG-101 began utilizing twirling movements to keep up a constant wave-front of attack, gaining even more ground on the Jedi. However, due to the repetitive nature of this move, Kenobi was able to find an opening. The Jedi exploited it; when the MagnaGuard brought his weapon horizontal, Kenobi used a horizontal slash to get inside the droid's guard, simultaneously removing 101's weapon arm and cleaving him in half at the chest."}, {"tag": "p", "text": "IG-101's still standing body literally fell to pieces with a metallic groan, even as he attempted to continue attacking Kenobi, grasping at him impotently."}, {"tag": "h2", "text": "Abilities and traits"}, {"tag": "h3", "text": "Abilities and skills"}, {"tag": "p", "text": "IG-101 was trained in all seven forms of lightsaber combat by Grievous with coaching from Dooku, just like all other MagnaGuard's. Executing his moves almost faster than the human eye could follow, IG-101 demonstrated a lack of hesitation and almost total commitment. However, again like all other MagnaGuard's, 101 could be confused by unpredictability due to his own repetitive combat style, which proved to be his downfall, when Kenobi got inside his guard and bisected him."}, {"tag": "h3", "text": "Programming and traits"}, {"tag": "p", "text": "IG-101, like all MagnaGuards, was programmed to demonstrate loyalty to General Grievous and to learn from experience, his own leading him to develop a somewhat aggressive and pragmatic personality. While he never disobeyed orders, he did openly question them, such as when he inquired as to why he and IG-102 weren't allowed to simply execute Kenobi and Skywalker on the spot when they were captured. Grievous appeared to respect the droid enough to provide him with an explanation rather than berate him for insubordination. His more aggressive traits came to light when he battled Kenobi, continuing to fight even after beheaded. He even attempted to keep it up after being disarmed and bisected, grasping in Kenobi's direction as his body fell to pieces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Revenge of the Sith novelization, IG-101 is said to lose an arm and a leg rather than his head. He is also mentioned making improbable threats to Kenobi regarding his staff and Kenobi's bodily orifices."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}