{"url": "IG-102/Legends", "categories": ["Category:Legends articles", "Category:IG-100 MagnaGuards", "Category:Masculine programming", "Category:Separatist droids", "Category:Separatist military members"], "nodes": [{"tag": "h1", "text": "IG-102"}, {"tag": "p", "text": "IG-102 was one of General Grievous's IG-100 MagnaGuards."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "IG-102, along with IG-101, served as the cyborg General's bodyguards aboard Invisible Hand during the Battle of Coruscant in 19 BBY. Judging by his damaged photoreceptor, Anakin Skywalker theorized that IG-102 had fought Jedi in the past and come out ahead."}, {"tag": "p", "text": "He and IG-101 personally led the force that successfully captured Anakin Skywalker and Obi-Wan Kenobi during their botched rescue attempt of Supreme Chancellor Palpatine, as well as Skywalker's astromech droid, R2-D2. IG-102 casually shoved one of the battle droids aside, destroying it, before backing up the same droid's threat, though this time not as a preprogrammed security recording."}, {"tag": "p", "text": "Bringing the Jedi before Grievous on the Invisible Hands bridge, they took up positions behind the General while the cyborg gloated over the Jedi. However, all on the bridge were distracted by a pyrotechnics display unleashed by Skywalker's astromech, R2-D2, allowing Kenobi to retrieve his lightsaber from the sheath pocket inside Grievous' cape, where it had been deposited as the newest addition to the cyborg's collection. Kenobi quickly cut his bonds and freed Skywalker, who wasted no time retrieving his own weapon."}, {"tag": "p", "text": "With the Jedi rearmed, Grievous ordered IG-102 and 101 to engage, and make them suffer. The two droids initially teamed up on Kenobi, but IG-102 broke off to take Skywalker, leaving 101 to deal with Kenobi. Skywalker was able to fend off 102's initial assault, but despite his best efforts, was unable to mount a sufficient counter-attack, and was accordingly driven back. Unfortunately, the MagnaGuard grew careless, and paid for it. Skywalker found an opening in 102's offense and cleaved the hapless droid in half at the hips."}, {"tag": "p", "text": "The droid quickly fell to the ground with a muffled electronic scream, while Skywalker went on to free Palpatine from the remaining droids."}, {"tag": "h2", "text": "Abilities and Traits"}, {"tag": "h3", "text": "Abilities and Skills"}, {"tag": "p", "text": "IG-102 was trained in all seven forms of lightsaber combat by Grievous with coaching from Dooku, just like all other MagnaGuards. Executing his moves almost faster than the human eye could follow, IG-102 demonstrated a lack of hesitation and almost total commitment. However, again like all other MagnaGuards, 102 could be confused by unpredictability, due to his own repetitive combat style, which proved to be his downfall, when he was cut in two by Skywalker."}, {"tag": "h3", "text": "Programming and Traits"}, {"tag": "p", "text": "Little is known about IG-102's personality, other than his basic programming that all MagnaGuard's received. He did, however, demonstrate a singular disregard - if not outright disdain - for other battle droids (which he considered inferior to his own superior composition), shown by his casual destruction of one."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the novelization of Revenge of the Sith, Anakin cuts IG-102 at the knees. However, IG-102 continues to fight, balancing on his electrostaff while kicking Anakin with the remains of his thighs before being struck down."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}