{"url": "IG-11", "categories": ["Category:Canon articles", "Category:Bounty Hunters' Guild bounty hunters", "Category:IG-series assassin droids", "Category:Masculine programming", "Category:Nanny droids"], "nodes": [{"tag": "h1", "text": "IG-11"}, {"tag": "p", "text": "IG-11, also known as Eyegee-Eleven or simply as IG or Eyegee, was a masculine-programmed IG-series assassin droid who was a bounty hunter during the New Republic Era. IG-11 was programmed to follow protocols of the Bounty Hunters' Guild, and had a built-in self-destruct mechanism to prevent himself from being captured while working as a hired gun."}, {"tag": "p", "text": "Around 9 ABY, IG-11 took on a bounty that involved killing Grogu, a Force-sensitive infant that was held in a encampment on the desert world Arvala-7. During the assignment, the droid teamed up with the Mandalorian bounty hunter Din Djarin, and the two worked together to eliminate the Nikto mercenaries in the encampment and confront Grogu. Upon seeing the infant, IG-11 was destroyed by Djarin while the droid attempted to kill him."}, {"tag": "p", "text": "The Ugnaught Kuiil later retrieved the droid's body from the encampment and repaired and re-programmed him in order to assist the retired vapor farmer. Now tasked with protecting Grogu, he accompanied Djarin and his allies to the planet Nevarro after meeting them in Kuiil's moisture farm. Following the death of his new master, he assisted them after they were pinned down by Imperial forces and helped them escape. IG-11 later sacrificed himself via self-destruction in order to kill a platoon of stormtroopers to prevent Grogu from being captured. After his sacrifice, a statue of the droid was erected in Nevarro's city."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The unsuccessful job"}, {"tag": "p", "text": "During the New Republic Era, IG-11, also known as Eyegee-Eleven, was a bounty hunter affiliated with the Bounty Hunters' Guild. Around 9 ABY, IG-11 traveled to the desert world of Arvala-7 after acquiring a bounty to terminate a Force-sensitive infant known as Grogu. Arriving at a heavily guarded encampment, he began eliminating a number of Nikto mercenaries after they refused to comply with subparagraph sixteen of the Bondsman Guild Protocol waiver—which stated that they were required to produce the asset to IG-11."}, {"tag": "p", "text": "After dispensing a number of mercenaries, the droid encountered another bounty hunter, the Mandalorian Din Djarin, by surprise and shot his shoulder, knocking him down. After getting up, Djarin offered to split the reward of the bounty on the target and the droid agreed so long as he would obtain the reputation merits associated with the mission. While speaking to Djarin, the pair was ambushed by more mercenaries who managed to corner the bounty hunters and overwhelm them. In compliance with his programming, IG-11 attempted to initiate his self-destruct mechanism various times to ensure that his design would not fall into enemy hands, in accordance with his manufacturer's protocols."}, {"tag": "p", "text": "IG-11 was ultimately convinced to continue fighting, and distracted a Nikto-manned turret so that Djarin could hijack it and use it to eliminate the remaining mercenaries. With the outpost's defenders terminated, the droid and Djarin proceeded to use the hijacked turret to cut through a blast door and enter the building where Grogu was kept. Inside, they located the target, which was revealed to be an infant member of the same species as famed Jedi Grand Master Yoda. Despite Djarin insisting they keep Grogu alive, IG-11 protested, stating that the commission stated clearly that the target was to be terminated—contrary to Djarin's assignment, which preferred the target to be captured and brought in alive. Raising his blaster to complete the task, the droid was shot in the head and destroyed by Djarin, who then took Grogu into his custody."}, {"tag": "h3", "text": "Restoration"}, {"tag": "p", "text": "In the wake of his destruction, the Ugnaught vapor farmer Kuiil retrieved IG-11's body from within the encampment and took the droid's flotsam back to his moisture farm. With some considerable effort, Kuiil was able to repair the droid. Due to the damage caused by Djarin, little of the droid's neural harness remained, leaving him with no memories or abilities to speak of. Over the course of many days, Kuiil gradually re-trained the droid to assist him on his vapor farm, tending to the blurrgs and eventually preparing meals among other simple tasks. Kuiil reinforced IG-11's development with patience and affirmation."}, {"tag": "p", "text": "During the droid's rehabilitation, he began to develop a new personality and a seemingly far friendlier demeanor than his previous incarnation. When Djarin returned to Arvala-7 with former shock trooper Carasynthia Dune to recruit Kuiil, the droid entered the Ugnaught's hut to offer the newcomers tea. Djarin and his companion immediately drew their blasters, aware of the threat the droid posed to Grogu. Kuiil explained that IG-11 was re-programmed and was no longer a hunter, but could still protect should the need arise. Djarin still refused to trust the droid and begrudgingly agreed to Kuiil's terms to bring the droid along on their mission."}, {"tag": "p", "text": "IG-11 later joined Kuiil aboard the Razor Crest on the mission to the planet Nevarro in order to assist Djarin and his allies. During the trip, he prepared a meal for his companions, the invitation to which Djarin swiftly declined. IG-11 stayed aboard the Razor Crest as per Djarin's orders for the duration of the mission. During the mission, Kuiil was gunned down by Imperial scout troopers a mere distance from the starship, while Djarin, Dune, and the Guild's agent Greef Karga were pinned down in Nevarro's cantina by Imperial remnant forces led by Moff Gideon."}, {"tag": "h3", "text": "Nursing and protection"}, {"tag": "p", "text": "After Kuiil was killed by the Imperial scouts and Grogu was kidnapped, the two troopers stopped and waited for authorization to return to the city. During that time, the scouts repeatedly taunted and abused Grogu. IG-11 found them, insisting that they cease their actions and introduced himself as Grogu's nurse droid. Taken aback, the two imperial scouts laughingly demanded that the unusual IG droid leave. The droid then broke one of the trooper's arms and flipped him over before lifting the second trooper by his face-plate and repeatedly smashing him into his 74-Z speeder bike. Boarding the second speeder bike with the rescued infant, IG-11 set off into the city to rescue Djarin and his comrades."}, {"tag": "p", "text": "As the droid neared the city, Djarin attempted to contact Kuiil through his comlink. IG-11 responded through the comlink stored in Grogu's sack and revealed that Kuiil had been killed. When Djarin asked what he had done, IG-11 stated that he was fulfilling his base function, which was to \"nurse and protect.\" Making his way through the city on the bike, the droid eliminated many Imperial stormtroopers with his blasters, eventually reaching the cantina where his companions were trapped by Moff Gideon's troops. With the Imperials distracted by the droid's actions, Djarin, Dune, and Karga fought their way out of the cantina. IG-11 killed several stormtroopers alongside his allies, all the while protecting Grogu from harm. The group later retreated to the cantina after Djarin sustained an injury to the head."}, {"tag": "p", "text": "IG-11 provided an escape route into the sewers by using a built-in plasma cutter. This allowed Dune and Karga to escape with Grogu, whilst the droid stayed behind with Djarin, who sought a warrior's death. The droid refused his request to kill him, reiterating that he was no longer a hunter, but was programmed to nurse and protect. He stated that he would need to remove Djarin's helmet in order to save the Mandalorian's life."}, {"tag": "p", "text": "Despite initially refusing and threatening the droid, the injured warrior relented after realizing that IG-11 was not a living being and thus it would not break his oath to be seen unmasked. He then applied a bacta spray to Djarin's injury and they rejoined the others in the sewer. He would follow Djarin to the covert of the Tribe. The droid provided protection to the group and the Armorer within, while they discussed the future of Grogu and re-equipped themselves."}, {"tag": "h3", "text": "Sacrifice"}, {"tag": "p", "text": "IG-11 would later join his companions aboard a droid-driven barge aboard a river of lava. While aboard the barge, Djarin's imaging systems revealed that there was an entire platoon of stormtroopers awaiting their arrival at the end of the river. Knowing that the Imperials would surely overpower the group, IG-11 deduced that the only way to fulfill his primary objective of protecting Grogu was to initiate his built-in self destruct mechanism in order to eliminate them."}, {"tag": "p", "text": "Djarin, who at that point had come to trust the droid and was saddened by this prospect, insisted that there was another way through the trap. IG-11 stated that he would be fulfilling his purpose and that he should not be mourned as he was never alive to begin with. Bidding Grogu farewell by stroking one of his ears, the assassin-turned-nurse droid then stepped off the barge and into the molten lava. Making his way through the river towards the Imperial ambush, the droid stopped before the troops. With his final words acknowledging his manufacturer's protocol, IG-11 self-destructed, killing the entire platoon of stormtroopers and saving Grogu and his companions. Djarin would later disable Gideon's TIE fighter and leave the planet with Grogu in his care."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "When Djarin reunited with Karga and Dune in the flourishing Nevarro prior to the second skirmish on the planet, they passed a market square with a statue resembling IG-11."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "IG-11 was a masculine-programmed IG-series assassin droid with red sensors and gray and bronze plating. The droid's reinforced body was able to withstand sustained turret fire without suffering significant damage. Without hesitation, he would put himself in harm's way if the situation demanded it. Due to his moving sensors, IG-11 had a sensory advantage on the battlefield. He was able to engage multiple targets at once in both hand-to-hand and blaster combat. IG-11 also demonstrated the ability to pilot a speeder bike whilst using his two blasters. The droid was also capable of lifting a scout trooper with one hand and was able to repeatedly slam him into his speeder bike to incapacitate him."}, {"tag": "p", "text": "After his reprogramming and rehabilitation at the hands of Kuiil, IG-11 became a caring nurse droid. He was capable of preparing meals and pouring tea and was determined to protect those placed under his care. His new nature drove him to sacrifice himself to save his friends, seeing his self-destruction and the resulting death of their enemies as the only way to ensure his companions' survival."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "IG-11 had two utility belts around his body, and was armed with an E-11 blaster rifle and a DLT-20A blaster rifle. In addition to his blasters, IG-11 also had a detonator built into him as a self-destruct mechanism by his manufacturer in an effort to prevent his design from being stolen or copied. He was equipped with a plasma cutter to cut open grates, as well as a bacta spray, which he used to heal Djarin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "IG-11 was a character created for the 2019 Disney+ live-action television series The Mandalorian, which began airing on November 12, 2019. A picture of IG-11 was revealed on series creator Jon Favreau's Instagram on December 25, 2018. Concept art for the character was created by Nick Gindraux, Ryan Church, and Christian Alzmann. According to Alzmann, concept art of Kuiil holding IG-11's dead form was meant to evoke the Pietà, with Kuiil resembling the Virgin Mary and IG-11 resembling Jesus. Other art by Alzmann was meant to depict what the artist referred to as a \"Frankenstein moment,\" where Kuiil caringly puts IG-11 to bed. For the art depicting the scene where the droid takes down the two scout troopers on speeder bikes, Church claimed he was possibly looking to a Clint Eastwood Spaghetti Western for inspiration and considered what film director Sergio Leone would have done with that moment."}, {"tag": "p", "text": "Footage of IG-11 was first shown in a trailer leading up to the show's release, although fans mistook the droid for IG-88, a famous droid bounty hunter who first appeared in Star Wars: Episode V The Empire Strikes Back. Pre-release information stated that IG-11 was often mistaken for IG-88 in-universe, but the older character is never referenced in the show's first season, though IG-11 was inspired by IG-88 as part of an effort to include background characters and concepts from the Original trilogy. Orange stripes and a double bandolier were given to IG-11 to distinguish him from his predecessor, and concept supervisor Christian Alzmann gave the droid hands to better hold his blasters, another feature IG-88 was missing. Series director and producer Dave Filoni deliberately chose to make IG-11 a new character so as not to contradict the Star Wars Legends stories about IG-88."}, {"tag": "h3", "text": "Performance"}, {"tag": "p", "text": "The character was voiced by Taika Waititi, who also directed \"Chapter 8: Redemption.\" Waititi stated his character was very innocent, direct, and unaware of sarcasm, and did not know how to lie. He compared IG-11 to a child armed with a gun. His motion-capture work was provided by Rio Hackford, who also played Riot Mar in \"Chapter 5: The Gunslinger.\""}, {"tag": "p", "text": "Due to the droid's linear and unique appearance, the animation team did not want him to be performed by a live actor via motion-capture in certain scenes, as it would not allow them to give IG-11 unnatural, angular movements that would be impossible for a human performer. The props team created a puppet version of the character's upper half that was capable of head rotations. The puppet ended up being more useful for filming than expected and was utilized in medium shots, and its awkward movements eventually became part of the droid's character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}