{"url": "IG-88B", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles with spoilers", "Category:Articles with conflicting sources", "Category:Articles in need of updating", "Category:Bounty hunters", "Category:IG-88 assassin droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "IG-88B"}, {"tag": "p", "text": "IG-88B, also commonly known simply as IG-88, or as a Phlutdroid, was a rogue, deadly masculine IG-series assassin droid manufactured by Holowan Laboratories who worked as a bounty hunter. Following the Battle of Hoth, he and several other bounty hunters were summoned by Darth Vader to the Executor and hired to track down the Millennium Falcon and her Rebel crew. Unable to track his quarry, IG-88 trailed his chief rival, Boba Fett, to Bespin, where the bounty hunter nearly destroyed the assassin droid, however IG-88 managed to survive. At some point IG-88 undertook a software infiltration into Death Star II, but his plan was single-handedly thwarted by R2-Q5. Decades later, the droid met with mercenary Bazine Netal to speak about the location of the Millennium Falcon."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The first of the IG-series assassin droid models created in secret by Holowan Laboratories. IG-88B, more commonly known as simply IG-88, and also known as a Phlutdroid, realized his skill and desire to kill the moment he was first activated and turned on his creators, killing everyone in the lab. From that moment on, he became one of the most feared bounty hunters in the galaxy, in part due to the lingering fear of droids from the Clone Wars, particularly those capable of battle and assassination, gaining notoriety comparable only to that of Boba Fett, his chief rival."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "h4", "text": "Hired by Kallus"}, {"tag": "p", "text": "During the Age of the Empire, IG-88 was hired by Imperial Security Bureau Agent Alexsandr Kallus to assist in tracking down Imperial Army deserter turned smuggler, Captain Han Solo of the Millennium Falcon."}, {"tag": "h4", "text": "Capturing Qi'ra"}, {"tag": "p", "text": "Later, IG-88 teamed up with Hondo Ohnaka to collect the bounty on Crimson Dawn lieutenant Qi'ra's head. Tracking Qi'ra down, IG-88 and Hondo managed to apprehend Qi'ra. Turning the bounty hunter and the pirate against each other, Qi'ra convinced IG-88 to collect the bounty on Hondo instead of the bounty on her. Attacking Hondo, IG-88 was quickly stunned and put in binders. After Qi'ra had similarly tricked and apprehended Hondo, IG-88 was led away by Qi'ra so that she could collect the bounty on his head."}, {"tag": "h4", "text": "Seeking a data-tape"}, {"tag": "p", "text": "Later, IG-88 pursued Princess Leia Organa on Garel, seeking a data-tape in her possession of Imperial base locations. Organa was assisted by Sabine Wren, who identified the droid, and the pair fled as the assassin opened fire in the corridors of Garel City Spaceport. However, Wren planted a paint bomb, surprising IG-88 and covering him in purple paint. Leia convinced several stormtroopers to fire at the bounty hunter, and the droid was hit by a blast before retreating."}, {"tag": "h4", "text": "Apprehending a thief"}, {"tag": "p", "text": "IG-88 was hired by an Imperial captain to capture a thief named Venga Liss who hijacked a Lambda-class T-4a shuttle on a jungle planet. Eventually, the droid killed Liss when he detonated the shuttle. IG-88 later allowed himself to be destroyed and taken to the headquarters of the Gillanium Syndicate, where he killed the group's leader and Liss' father, The Underlord."}, {"tag": "h4", "text": "Capturing the Gatto Gang"}, {"tag": "p", "text": "IG-88 was hired by Duke Blazor of the Black Sun to capture the Gatto Gang that consisted of Sylvestarr, Ziggee and Moggee. He eventually captured all three of them."}, {"tag": "h4", "text": "Hired by Vader"}, {"tag": "p", "text": "By the year 0 ABY, IG-88 consorted with the crime lord Jabba Desilijic Tiure. He was present in the Hutt's palace while Jabba received Darth Vader. The Sith Lord told the Hutt to dispense with his audience, and IG-88, along with fellow hunters including Fett and 4-LOM, departed from the court. In 3 ABY, IG-88 answered a call put out by Vader for bounty hunters to track down the Millennium Falcon. He and several other hunters, including Boba Fett, Bossk, Dengar, Zuckuss, and 4-LOM, assembled aboard the Executor, where Vader offered a bounty for the live capture of Han Solo and his companions. IG-88 tailed the Millennium Falcon along with Fett to Cloud City on the planet Bespin, where the assassin droid was defeated and left for scrap after his longtime rival caught it trailing him. Ultimately, Boba Fett captured Han Solo for Vader, who then later on delivered the bounty to Jabba on Tatooine."}, {"tag": "h4", "text": "Hired to kill Vader"}, {"tag": "p", "text": "Sometime later, IG-88 was hired by Sly Moore to kill Vader alongside the Droid Crush Pirates of Bestoon. She also informed him of the Sith Lord's damaged state and gave him the code needed to slice into his armor. Vader and the accompanying Sith assassin Ochi of Bestoon were both lured into an ambush by a Hutt named Bokku, who sent them after the pirates in an attempt to locate the recently stolen Han Solo. Upon arriving at Zee-Nine City Seven, Vader and Ochi's ship was sabotaged, causing them to crash. They were then attacked by IG-88 and the pirates. During the firefight, IG-88 warned Vader that his mechanics were in worse shape than the droid's. When Vader told IG-88 that he had information he required, the droid responded that Vader would have to download it from his severed head. Vader went to destroy the droid, but IG-88 then used a remote to breach Vader's armor, gaining control over the Sith Lord. As he forced Vader to hold his lightsaber to his head, the Sith ordered IG-88 to tell him who had given him the code. The droid replied that the terms of his employment prevented him from sharing the information. While IG-88 was distracted, Vader used the Force to take the remote from him, allowing him to use it against the droid and force him to blast himself in the head. Once IG-88 was subdued, Vader and Ochi forced the pirates to retreat and used one of the droid's hands to access a terminal he had been using, allowing them to discover various dead ends the droid had been chasing, as well as the symbol of crime syndicate Crimson Dawn. After repairing himself, IG-88 returned to Coruscant and reported his loss to Moore and her court. The droid lamented that Vader could not be defeated, but Moore assured him that Vader could only defeat them one at a time. And if they all stood together, then they would be more powerful than either Vader or Sidious could ever imagine. After uncovering Sly Moore's betrayal, Vader and Ochi returned to Coruscant to find her, her court and IG-88 in Administrative Temple Garden 313A. Vader then struck down IG-88 once again before chasing Moore and her court into the Imperial Palace."}, {"tag": "h3", "text": "Infiltrating the Death Star II"}, {"tag": "p", "text": "At some point before or during 4 ABY, IG-88 undertook a software infiltration of the Empire's second Death Star. However, his plan was single-handedly thwarted by the Imperial astromech droid R2-Q5."}, {"tag": "h3", "text": "Contacted by Bazine Netal"}, {"tag": "p", "text": "In 34 ABY, at some point after the Battle of Takodana, IG-88 was contacted by the mercenary Bazine Netal to discuss the location of the Millennium Falcon after she heard a rumor about the time IG-88 nearly caught the Falcon. During their rendezvous, IG-88 took the opportunity to tell Netal when he almost caught the Falcon with Kallus. IG-88 told Netal that he almost caught the Millennium Falcon again, but lost out to Fett. Netal responded that, though he had a lot of excuses, her employer only paid for results. She informed IG-88 that someone knew where the Falcon was and that they would tell her where it was before leaving him to continue with her search."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A rogue class 4 assassin droid, IG-88 was obsessed with hunting, destroying, and killing as a result of his incompletely formed droid programming. He tended to hunt alone and earned a reputation as a merciless hunter."}, {"tag": "p", "text": "A hideous, battered chrome war droid, IG-88 stood 1.96 meters in height. His steady aim, along with his ability to track targets with advanced sensors that ringed his head and allowed him to see in all directions, won him great success. These sensors included multiple red photoreceptors, a heat sensor, and a sound sensor. IG-88 also had a vocoder at the base of his head. His torso was able to fully rotate on the battlefield, allowing him to blast enemies on all sides. His tough metal body allowed him to survive most attacks without taking any damage and featured acid-proof servo wires."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "IG-88 carried an arsenal of weapons, including blaster rifles, pulse cannons, a DAS-430 Neural Inhibitor, and a needle dart gun that launched poison darts. However, his most dangerous weapons were hidden inside his slender frame, including a flamethrower, a sonic device, and toxic gas dispensers. IG-88 also wore an ammunition bandolier that carried his concussion discs and vibroblades. As an IG-series droid, he was designed to have blasters built into each arm, installed sometime prior to the search for the Millennium Falcon. IG-88 owned a modified Aggressor-class Assault Fighter called the IG-2000."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "IG-88, originally referred to as a \"chrome war droid\" in the script and also called \"Phlutdroid\" during production, was originally created for the 1980 film Star Wars: Episode V The Empire Strikes Back. His mechanical puppet was constructed by Bill Hargreaves and Steve Short of the props team and special effects department, whose design was a complete departure from concept artist Ralph McQuarrie's streamlined, if not elegant, version. IG-88's cylindrical head was originally a combustion chamber in a Rolls-Royce Derwent jet engine, which was previously used as part of the distillery setup seen in Chalmun's Spaceport Cantina in the 1977 film Star Wars: Episode IV A New Hope. McQuarrie would revise his earlier IG-88 design during the production the 1983 Star Wars: Episode VI Return of the Jedi. Considered an \"assassin droid,\" it did not appear in any version of the film's screenplay but was for the basis for EV-9D9, another practical droid built by Hargreaves and Short. McQuarrie's early concept art of IG-88 later inspired the design of the IG-RM bodyguard and enforcer droid."}, {"tag": "p", "text": "While Lucasfilm has no official record of the identity of the technician that operated IG-88 in The Empire Strikes Back, the official Star Wars Authentics website has credited the role to Bill Hargreaves. However, the online database IMDb instead credits Paul Klein as the puppeteer of IG-88, as well as that of BG-J38 and EV-9D9 in the Return of the Jedi. Despite this, there is no Paul Klein credited as a member of The Empire Strikes Back's effects crew. As IMDb often relies upon unconfirmed information submitted by fans and Star Wars Insider was unable to determine who submitted said information, it is currently unknown whether or not Klein actually operated IG-88. Oddly, Star Wars Authentics credits Klein in place of Hargreaves in the description of the photograph titled \"Darth Vader, Dengar, IG-88 and Boba Fett,\" despite having credited the latter in the descriptions of nearly every other live-action image of IG-88 available for purchase on the website."}, {"tag": "p", "text": "Pre-release information for the 2019 Disney+ live-action television series The Mandalorian stated that IG-11 was often mistaken for IG-88 in-universe, though IG-88 is never referenced in the show's first season."}, {"tag": "h3", "text": "Freemaker Adventures"}, {"tag": "p", "text": "IG-88 appeared in the LEGO Star Wars: The Freemaker Adventures Season Two episode \"Return to the Wheel,\" which premiered on August 3, 2017. He and several bounty hunters including Dengar, Bossk, 4-LOM, and Zuckuss captured the Freemakers but they escaped after Kordi created a fight between the droid and organic bounty hunters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}