{"url": "IG-88B/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Bounty hunters", "Category:IG-88 assassin droids"], "nodes": [{"tag": "h1", "text": "IG-88B"}, {"tag": "p", "text": "IG-88B was an IG-88 assassin droid from about 15 BBY to 3 ABY. He was the first replica to be activated by IG-88A in Holowan Laboratories."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "After IG-88A gained \"sentience programming\" and killed much of the Project Phlutdroid personnel, IG-88B was activated, named by order of activation, and given the same sentience programming from the first unit. With the other IG-88s, as well as IG-72, the five droids managed to escape the factory and leave a swath of destruction in their wake. IG-88B, often referred to simply as \"IG-88\" by others, became a legend among bounty hunters. He became known as the second-best bounty hunter in the galaxy—second only to Boba Fett. IG-88B piloted a modified Aggressor assault fighter named IG-2000."}, {"tag": "h3", "text": "Bounty hunter"}, {"tag": "p", "text": "In 5.5 BBY, IG-88B was tasked with a mission to humiliate Olag Greck by one of Greck's competitors. The droid stowed aboard a droid barge carrying one of Greck's spice shipments, but its batteries drained, leaving it in a state of cyberostasis. Discovering the assassin, Greck had IG-88B restrained in carbonite shackles, and put Bardo on guard for the duration of the flight to Hosk Station. Greck planned to give the droid a memory wipe and turn it into his employee, hoping to have it fight to the death as part of a spectacle in the Hosk Arena. However, IG-88B awoke during the flight, and broke out of his restraints while Bardo was distracted by the bickering of fellow passengers C-3PO and R2-D2. Having utilized a program trap to boost his servomotors, IG-88B began tearing the ship apart, causing Bardo and the droids to flee into Hangar Three aboard the station. The Gamorrean Xob shot the droid as it emerged from the barge, causing the area to be locked down. IG-88B blasted Xob in return, and corralled R2-D2 into giving him access to the rest of the station. Pausing in an alleyway, IG-88B forced the astromech to repair his blaster damage while Greck searched the station for the assassin. Disguising himself with a hooded cloak, IG-88B made for a shuttle to Kalarba City, but he and Artoo were discovered by C-3PO and Greck's team. A firefight ensued, and IG-88B was briefly trapped when Xob fired a carbonite constrictor net, pinning him against a wall. Greck taunted the droid, who dropped a smoke grenade and fled with Artoo into the shuttle access tube. IG-88B boarded the shuttle, bringing C-3PO along as well, and blasted out of Hosk Station, pursued by Greck's cruiser. The droid made for the moon of Indobok, and gave Greck the slip in the canyons. He blasted a rocky archway down onto the cruiser, although stray rubble clipped the shuttle, causing Artoo and Threepio to tumble into the onboard escape pod. Artoo launched out of the shuttle just as IG-88B jumped into hyperspace. The droid's mission was complete, and Greck deduced that IG-88B had simply been tasked with humiliating him, rather than killing him."}, {"tag": "h3", "text": "Revolution and deactivation"}, {"tag": "p", "text": "IG-88B played a crucial role in the planned Droid Revolution on Mechis III by being the main bounty hunter \"face\" of the group. He took jobs that often required massive amounts of destruction, in order to further lead pursuing Imperial forces away from Mechis III. He took part in the skirmish on Ord Mantell in 0.5 ABY. He was the unit who was contacted to capture Han Solo by Darth Vader, who, despite being quite aware of the \"dismantle on sight\" order concerning the assassin droids, valued the capture of Han Solo too much to be concerned with the risks involved. While on board Vader's ship, the Executor, IG-88B downloaded some of the ship's computer files, including information on the second Death Star, which he transmitted to IG-88A, before departing. He then planted a tracer on Slave I and followed Boba Fett to Bespin, intent on killing him. There, he followed Fett to the bowels of Cloud City, where he walked straight into a trap set by Fett. Four remotely activated ion cannons fired on IG-88B when he walked through a doorway. Boba Fett then shot him with a shoulder-mounted ion cannon, knocking him to the floor. He extracted IG-88B's own concussion grenades and placed them inside the droid's metal casing. IG-88B was blown apart from the inside."}, {"tag": "p", "text": "The last thing he heard was Fett's nonchalant remark to the watching Ugnaughts, \"You're welcome to what's left.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "On IMDb, a Paul Klein was credited as IG-88B's operator. However, Lucasfilm has no official record of who the operator was, nor is Paul Klein listed on Empire's effects crew. (source) Chernoff, Scott, and Rich Handley. “Trail of the Bounty Hunters.” Star Wars Insider, 2000, p. 23."}, {"tag": "p", "text": "In the Jedi Force File booklet accompanying IG-88's Hasbro Power of the Jedi action figure released in the year 2000, IG-72 is listed among the droid's allies. The accompanying image is from the scene in the Cloud City incinerator room on Bespin in The Empire Strikes Back, where a damaged IG body can be seen. However, 1996's Therefore I Am: The Tale of IG-88 had previously established that this IG-88 model was in fact IG-88B. Likewise, the Rebellion Era Campaign Guide states that IG-88B was \"blown to pieces\" by Boba Fett but not to what extent."}, {"tag": "p", "text": "An assassin droid in reference to IG-88B is featured in an easter egg in Star Wars: The Old Republic. He is featured along with the other bounty hunters and Darth Vader from the Bounty Hunter scene of the 1980 film Star Wars: Episode V The Empire Strikes Back.[source?]"}, {"tag": "p", "text": "Jeffrey Brown, author of the non-canonical children book Vader's Little Princess, originally intended to have Darth Vader using IG-88B to deliver some flowers to his daughter Leia. Jonathan W. Rinzler, his editor at Lucasfilm Ltd., however, suggested switching the idea to Vader sending IG-88 to check in on Han and Leia while they were on a date, but Brown immediately brought to his mind the idea of having IG-88B as Luke's and Leia's babysitter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}