{"url": "IG_lancer_combat_droid", "categories": ["Category:Legends articles", "Category:IG-series droid models", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "IG lancer combat droid"}, {"tag": "p", "text": "IG lancer combat droids, also known as IG-series battle droids or simply IG lancer droids, were a type of battle droid used by the Confederacy of Independent Systems during the Clone Wars."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "These tall, thin battle droids were created to resemble their Muun creators. They were also more advanced than the standard Baktoid B1-Series battle droids used by the Trade Federation. They were armed with giant energy lances and anti-vehicle mines and rode into battle on swoop bikes."}, {"tag": "p", "text": "They were developed by Phlut Design Systems, a Muunilinst-based weapons development firm that took out a large capital investment loan from the InterGalactic Banking Clan to fund a secret battle droid program that it planned to sell to the Trade Federation. When PDS was unable to repay the InterGalactic Banking Clan, the IBC responded by seizing the assets of the company and adding the battle droids to the military forces of the Confederacy of Independent Systems. As an InterGalactic Banking Clan asset, the new droids were renamed the IG-series."}, {"tag": "p", "text": "After the assassination of the Separatist Council by the newly anointed Darth Vader the droids were deactivated but not destroyed. The Phlut Design Systems kept the blueprints and a few droids. The droids looked very similar in appearance as their later cousins, IG-72 and IG-88, without the shoulder armor protrusions and lack of heavily modified torso armor. Using the blueprints and droid bodies as a basis, The Holowan Technology company, with a contract from the Empire and Phlut Design Systems built and created the infamous IG-72 and the more infamous IG-88 series droids."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "IG lancer droids were led by Durge at the Battle of Muunilinst. They proved a match to Jedi General Obi-Wan Kenobi's lancer troopers and destroyed nearly all the SPHAs during the battle. Some were also deployed during the Battle of Amaltanna, but were mostly destroyed,"}, {"tag": "p", "text": "Following the execution of the Separatist Council by Darth Sidious's new apprentice, Darth Vader, these units were presumably deactivated."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}