{"url": "INS-444_window_installation_droid", "categories": ["Category:Legends articles", "Category:Fifth-degree droid models", "Category:Publictechnic products"], "nodes": [{"tag": "h1", "text": "INS-444 window installation droid"}, {"tag": "p", "text": "The INS-444 window installation droid, sometimes referred to as an installer droid, was a fifth-degree installer droid produced by Publictechnic during the time of the Galactic Republic. INS-444 units commonly worked alongside CLE-004 window cleaning droids."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The INS-444 was a repulsorlift-equipped droid with two magnatomic grip pads used to hold a window pane in place while traveling to its destination and during the installation process. Because most Coruscanti preferred more delicate materials than transparisteel, such as Clari-crystalline or even glass, the droids would have to be extremely careful in both carrying the pane to the destination, as airspeeders would sometimes smash right through the pane before realizing they hit something. Often, two INS droids worked together to carry larger panes. Three manipulator arms were used to secure the pane to the window frame, and testing probes located on the droid's upper arms scanned the frame for any gaps in the airtight seal. These droids did not have an internal processor, instead relying on a master control system to broadcast commands to their top-mounted power receivers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "INS-444 droids were a common sight in Galactic City on Coruscant, and were favored due to their ability to reach even the city-planet's tallest buildings. An INS-444 unit nicknamed \"Mick\" and its counterpart replaced a window pane in Senator Padmé Amidala's apartment in 22 BBY, after Obi-Wan Kenobi smashed through it in pursuit of an ASN-121 assassin droid. These droids saw continued use throughout the Galactic Civil War and beyond."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}