{"url": "ISPCA", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Organizations"], "nodes": [{"tag": "h1", "text": "ISPCA"}, {"tag": "p", "text": "Little was known about the organization called ISPCA, up to and including its proper name, since the only time that it was known to be mentioned was during a conversation between the amateur starship captain Lando Calrissian and Mohs, the High Singer of the Toka."}, {"tag": "p", "text": "Prior to this conversation, Calrissian, his droid, Vuffi Raa and Mohs landed in the Millennium Falcon at the base of one of the Sharu pyramids on Rafa V and were ambushed by a tribe of Toka who were armed with crossbows. After the Toka warriors incapacitated Vuffi Raa, Mohs took command of them and demanded that Calrissian turn the Fabled Key over to his possession. Because they were ritually forbidden from taking the key from the custody of the Key-Bearer — a prohibition that included directly killing him — they did what they felt was the next best thing and marched Calrissian to a life-orchard. There, they tied him to a life-crystal tree, which given time, would slowly drain him of his intelligence and ultimately kill him."}, {"tag": "p", "text": "However, Calrissian was unwilling to go along with their plan. After Mohs and his fellow Toka left him, Calrissian freed himself and with the help of a newly-recovered Vuffi Raa, made his way back to the Falcon's original landing site. They found Mohs there, cooking a creature (alternately called a lizard, a reptile or a frog) that he had impaled upon a branch. During the course of the ensuing conversation, Vuffi Raa alerted Calrissian to the approach of Mohs's friends. Calrissian threatened Mohs with the prospect of having him trade places with \"that poor uncomfortable creature you're cooking\" and then entertained the prospect of turning Mohs in to the \"ISPCA — or at least the Epicures Club.\""}, {"tag": "p", "text": "Given the context of Calrissian's reference to the ISPCA, it is likely that the organization would not have looked kindly upon Mohs's treatment of the frog. Calrissian's consideration of the idea of turning Mohs in to the custody of either organization may or may not have indicated that the ISPCA was vested with some power to enforce the law. Further details regarding this mysterious organization remain elusive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The nature of ISPCA, as well as its name, bears resemblance to the real world's Society for the Prevention of Cruelty to Animals (commonly abbreviated \"SPCA\"). As for the \"I\" of the ISPCA, it could be inferred that, since its time of mention within the Star Wars universe is during the Imperial Period, and that many governmental organizations bear the prefix \"Imperial,\" the same could be said in the case of the ISPCA."}, {"tag": "h2", "text": "Appearances"}]}