{"url": "IX3244-B", "categories": ["Category:Legends articles", "Category:Imperial military units"], "nodes": [{"tag": "h1", "text": "IX3244-B"}, {"tag": "p", "text": "IX3244-B was the designation of an Imperial Survey Team under the command of Captain Toss. His second-in-command was Lieutenant Kiviett."}, {"tag": "p", "text": "After the failure of the first Death Star, Emperor Palpatine of the Galactic Empire sought to construct a far more powerful weapon with less flaws. After deciding that there would be a second Death Star, the Emperor ordered thousands of expert Imperial survey teams to find a suitable location to build the new, powerful Death Star, and where its shield generator would also be housed. The survey team designated IX3244-B, under the leadership of Captain Toss and Lieutenant Kiviett, were sent to several backwater planets and moons initially, though they found little success. Eventually, they were sent to the forest moon of Endor."}, {"tag": "p", "text": "They immediately realized Endor's prospects as a potential base of operations for the Empire. Endor had been selected by Darth Vader, Palpatine's armor-clad enforcer, because of its extreme remoteness from the Core, as well as from any previously established Imperial outposts, which the Alliance to Restore the Republic might have been aware of. Vader was of the opinion that the Rebel Alliance would not be expecting to find an Imperial base so close to their administrative center on Imperial City. In addition to those factors, the planet held a considerable amount of natural minerals and resources, meaning that the transportation of materials for building the Death Star would be minimal, should Palpatine choose to build his base on Endor."}, {"tag": "p", "text": "Before they set down on Endor's surface, Toss and Kiviett conferred with Darth Vader about Endor's suitability. Although his superiors neither cared for nor listened to Kiviett's opinion, he felt that the base should be built on a barren world with low gravity and a poisonous atmosphere. That would ensure that no indigenous species interfered with Imperial operations; an opinion which contrasted with those of his superiors. Vader saw such an option as a waste and resources—life support systems and special domes were not something that was necessary for a small Imperial outpost—and that it would consume much time, which the Empire did not have an abundance of. Vader was also confident that the Imperial military would be easily able to dispatch any interfering natives, and did not see that particular aspect of Endor a threat. Not wanting to anger Vader, Captain Toss agreed, despite Kiviett's attempts to be heard."}, {"tag": "p", "text": "After being debriefed by Vader, Toss and Kiviett accompanied their team to Endor's surface in the Survey Frigate they had used on earlier expeditions. They immediately began to perform Imperial Survey Team Standard Procedure; the entire vast surface of Endor was recorded through digital means, with a multitude of scanners taking readings for lifeforms and geographical informations. The scans revealed Endor to be an arboreal world, easily capable of supporting Human life."}, {"tag": "p", "text": "Almost immediately after the initial survey, Captain Toss decided that the mission had been successful, and that Endor met all of Lord Vader's requirements. Toss did this even though the scans they had made from their survey frigate revealed the existence of sentient life-forms, requiring further information. He sent a holoreport to his superiors reporting that the native Ewoks were \"laughably primitive\" creatures which the Empire could \"safely ignore\" even as he sent Lt. Kiviett and four other personnel (including two stormtroopers) down in a shuttle to investigate the Ewoks."}, {"tag": "p", "text": "During their mission on the surface, Kiviett's team attempted to investigate an Ewok village. Due to interference from unseen Ewoks who turned their chosen path into a shifting maze, the team managed to completely lose their way. After moving in circles for over two hours, the team started to hear the beating of Ewok drums all around them. They panicked, and started firing their blasters randomly into the woods. The shots did not stop the drumbeats, which only stopped when Kiviett and his team returned to their shuttle and retreated to their frigate."}, {"tag": "p", "text": "An embarrassed Kiviett reported to his captain, only to have his recommendations and warnings about the Ewoks ignored. Capt. Toss, eager to claim the credit for discovering the Death Star II's construction site, did not think the Ewoks to be worth further study or concern. Even the suggestion that Imperial personnel on Endor be issued forest camouflage was dismissed."}, {"tag": "p", "text": "Though Lord Vader and Galactic Emperor Palpatine appear to have quickly decided that Endor was a suitable candidate for the second Death Star's construction site, the Emperor was displeased by the sketchy report. A second expedition under Sergeant Pfilbee Jhorn was sent as a follow-up. Sgt. Jhorn was particularly annoyed during his survey that the previous expedition had failed to mention the Gorax, Yuzzums, Sanyassan Marauders, and the other potentially dangerous lifeforms on Endor. Ironically, he agreed with Captain Toss that the Ewoks posed no significant threat."}, {"tag": "p", "text": "At least one of their number, Lt. Kiviett, was taken prisoner by the victorious Rebel forces after the Battle of Endor."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}