{"url": "Amphistaff", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Lightsaber-resistant creatures", "Category:Melee weaponry", "Category:Predatory creatures", "Category:Snakes", "Category:Species of undefined sentience", "Category:Yuuzhan Vong technology", "Category:Yuuzhan Vong weapons"], "nodes": [{"tag": "h1", "text": "Amphistaff"}, {"tag": "p", "text": "Amphistaffs were genetically engineered serpentine creatures that served as the primary anti-personnel weapons of the Yuuzhan Vong."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Like all Yuuzhan Vong biotechnology, amphistaffs were fully organic beings native to the Yuuzhan Vong homeworld. Young amphistaffs grew in trios from leathery polyps, reaching out and snatching whatever prey could be found and redirecting it into the polyp's gaping maw, known as the groundmouth, thus feeding all four entities simultaneously. Eventually the amphistaffs lengthened to around 2 to 3 meters, too large for their polyp to support them. They would break off, escaping their amphistaff breeding gla, and slither into the wilderness leaving the polyp to die. Amphistaffs saw in infrared light."}, {"tag": "p", "text": "Fully grown amphistaffs were durable and cunning predators. Power glands in the serpent's body could emit electrical impulses that reorganized the creature's semicrystalline cell structure. This field extended a millimeter from the amphistaff's body and created razor-thin edges capable of slashing through prey. Only vonduun crabs rivaled the amphistaff in rigidity. After feeding voraciously, amphistaffs morphed into polyps to continue their species' reproduction."}, {"tag": "p", "text": "If a warrior captured an amphistaff as it left its polyp, the two were bound together and the amphistaff would loyally serve its new master in battle. Hand motions from the warrior coaxed the amphistaff to either harden or become pliable, for each had its own purposes. Amphistaffs had three distinct forms: a quarterstaff, a spear, or a whip. As a hardened spear with a poisonous head, the amphistaff could be hurled, further increasing its lethality. As a flexible whip, the amphistaff could trip or pin its target and even poison it. Amphistaffs were one of the most durable objects known, as not even lightsabers could cut through them. When used as a heavy staff, the serpent would endure blow after blow from the Jedi weaponry and remain unfazed. The amphistaff's edge—measured in atoms—slashed through flesh with no resistance. In the blink of an eye, the amphistaff could soften and wind around the lightsaber's blade, its venomous jaws snapping and tearing at the unfortunate victim's face. Because of its organic nature, these creatures were capable of recovering from virtually any wounds. Nigh indestructible, an amphistaff could only be killed by repeated blunt trauma to or removal of the head."}, {"tag": "p", "text": "Psychological damage was rampant in Republic soldiers that entered ranged combat with amphistaff-armed Yuuzhan Vong. When directed, an amphistaff spat venom at a distance of 20 meters. This spray was aimed directly at the target's eyes and instantly blinded them. Poison seeped through the pores and entered the victim's bloodstream, interfering with circulation and choking off the oxygen supply. Excruciating pain accompanied twenty hours of suffering until the victim finally died. Jedi Master Mara Jade Skywalker eventually created a biotoxin drill that, if administered early enough, could disrupt the venom's lethal actions."}, {"tag": "p", "text": "Certain types of specialized amphistaffs, or related creatures existed among the Yuuzhan Vong. Supreme Overlords such as Shimrra Jamaane possessed uniquely gigantic variations of the typical amphistaff called Scepters of Power. Warmasters such as Tsavong Lah and Nas Choka were granted \"Batons of Rank\" called tsaisi. Also there was the Scepter of Entreaty which were used when one wished to supplicate the Supreme Overlord. There also existed a species of amphistaff that could be implanted within the body which could be used by infiltrators as the amphistaff would avoid detection until the appropriate time at which point they could be used. Finally, the reptoid Chazrach slaves were armed with coufees, dagger like creatures, which were inferior, less flexible, and smaller versions of the amphistaffs, to compensate for their tiny stature and lower combat skills."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 33 BBY, Darth Maul fought a Yuuzhan Vong warrior with an amphistaff during his time in Cog Hive Seven."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the galaxy at large first learned about amphistaffs when the Praetorite Vong infiltrated ExGal-4 on Belkadan where it was wielded by the advance agent Yomin Carr. This member of the Yuuzhan Vong empire used this weapon against Jedi Mara Jade Skywalker."}, {"tag": "p", "text": "A number of hibernating amphistaff's were smuggled onto Hosk Station in order to arm elements within the Givin government who were sympathetic to the Yuuzhan Vong. The aim was to create an uprising when the Yuuzhan Vong fleet arrived in the system thus securing the location."}, {"tag": "p", "text": "Jacen Solo while onboard a Yuuzhan Vong seedship managed to use his Vongsense and connection to animals to gather seventeen young amphistaffs to his side and help him against the Yuuzhan Vong crew onboard the ship. He used these feral amphistaffs to also slay several of the larval Dhuryam in order to sabotage the shaping of the planet Coruscant."}, {"tag": "p", "text": "At the war's close, a group of warriors crashed on Zonama Sekot, the Yuuzhan Vong's home. As the warriors exited their downed coralskippers, their amphistaffs uncoiled themselves and fled into the tampasi. All other amphistaffs were loaded onto the warships of the Yuuzhan Vong and sent crashing into Coruscant's star."}, {"tag": "p", "text": "In 137 ABY, Jariah Syn traveled to Wayland, where he managed to tame one of the native amphistaffs and used it as a weapon, which he named Heartstriker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The origins of the amphistaff possibly date back as far as the Bantam/Dark Horse invasion storyline, where the (non-humanoid) invaders were to be armed with a bladed, anti-lightsaber weapon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}