{"url": "Ice_(duelist)", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Articles with gameplay alternatives", "Category:Duelists", "Category:Females", "Category:Gladiators", "Category:Humans", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Ice  (duelist)"}, {"tag": "p", "text": "Ice was a Human female competitor at the Taris dueling ring that operated at the Upper City Cantina during the Jedi Civil War. Inspired by the legendary Mandalorian duelist Bendak Starkiller, Ice was a competent gladiator who received her handle as a result of her cold disposition. To her, coldness was a theme that she adopted for every aspect of her persona: she was harsh and critical toward everyone, even her fans. Nevertheless, she was popular among audiences of the arena, being an intermediate-ranking duelist. Shortly before the destruction of Taris, she was challenged and defeated by the amnesiac former Dark Lord of the Sith Revan, who had joined the duel ring under the alias \"Mysterious Stranger\" and would subsequently surpass the other duelists and become the ring's last champion before its destruction."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Childhood"}, {"tag": "p", "text": "In her childhood, the Human female later known as Ice idolized the famed Bendak Starkiller, a legendary gladiator of the dueling ring run by Ajuur the Hutt, located in the Upper City Cantina on the planet Taris. In Starkiller, she found her inspiration, hoping to follow in his footsteps and pursue a career as a duelist. Upon meeting the gladiator for the first time, however, she found his personality revolting. So affected was the girl by this meeting that she resolved to emulate Starkiller's ruthless, anti-social character, embracing it as a lesson in the reality of the world."}, {"tag": "h3", "text": "Career as a duelist"}, {"tag": "p", "text": "As an adult, the woman stayed true to her dream and joined the Taris dueling ring, having been personally chosen by Ajuur himself. By 3956 BBY, Ice had acquired a considerable following among fans of the sport, having earned a reputation as a devious fighter. She was especially popular with the female demographic, as women admired that her prowess proved they could achieve in such a field, but she was dismissive of being an icon for gender equality. Of the competitors current to that year, Ice could defeat Gerlon Two-Fingers and Deadeye Duncan, the latter of whom was considered the worst duelist of all time. While respected for her skills, she was no match for the veteran duelist Marl or the then-champion Twitch and her ranking was therefore intermediate."}, {"tag": "p", "text": "It was in that same year that a Sith fleet led by Dark Lord of the Sith Darth Malak occupied Taris and imposed martial law alongside a planetary blockade. Under the quarantine, the dueling arena continued to operate as usual, with the Sith enforcing the ban on death matches that had led to Bendak's retirement."}, {"tag": "p", "text": "However, one of the Republic soldiers who escaped the destruction of the Republic warship Endar Spire, the amnesiac former Dark Lord Revan, visited the Upper City Cantina and decided to join the dueling arena under the alias \"Mysterious Stranger\". After beating Deadeye Duncan and Gerlon Two-Fingers, he fought Ice and emerged victorious, winning 300 credits. With her defeat, Ice was quick to conclude that Revan's martial prowess far eclipsed her own, accepting this as another simple, cold, hard truth. Sure enough, she would watch as Revan went on to defeat Marl and Twitch as well, becoming the last champion of the duel ring before the destruction of Taris at the hands of the Sith."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As her stage name suggested, Ice exhibited a cold, dispassionate personality, generally unwilling to befriend others. Though she was deeply cynical, she was not always so, as in her childhood, she dreamed often of meeting her idol Bendak Starkiller. When this dream at last came true, she was struck by his toxic personality. Whether she felt more heartbroken or impressed, the meeting profoundly shaped her worldview, and she became convinced that to thrive, she must be every bit as ruthless and cruel as he was. To that end, she internalized the theme of coldness for her persona, even greeting strangers with condescension unprovoked. In spite of this, and her propensity for blunt, rude responses—even to her fans—she was not above congratulating fellow competitors, especially if they proved their remarkable skill. While her resolution to be emotionless made her asocial, it also meant that she was not one to take scorn or defeats personally. Moreover, she would be motivated by shocking incidents to reflect upon what lessons it held."}, {"tag": "p", "text": "Ice was a blonde-haired woman with pale skin and blue eyes. By her own account, many men that she was disgusted by;found her attractive and her immediate assumption upon meeting Revan was that he was just another male fan who had come to flirt with her."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Ice's dispassionate attitude was reflected not only in her asociality, but in her combat style as well. Characterized by Marl as a steady fighter, she was confident in her martial expertise and this confidence allowed her to exercise a good measure of control in battle. While not unrivaled in the duel ring, never having been able to surpass Marl or unseat Twitch, she was still lauded as a strong competitor by fans of the sport."}, {"tag": "p", "text": "During her duel with Revan, she opened the fight with her blaster, and in such scenarios, she only switched to her sword if her opponent closed the gap between them. In other cases, she was known to reverse this tactic, hiding a blaster in her clothing to be employed only if a fight turned against her."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "In her career, she favored a combat suit, standard for its time, and carried a heavy blaster pistol alongside a vibroblade."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ice's first appearance is as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic. In the Xbox version of the game, her hair is brown, whereas in the PC version, it is blonde. In the game, the player, Revan, can choose to fight her in the dueling ring. However, the nature of the encounter is such that it does not progress any plot, nor does it change the player's alignment. Therefore, it is undetermined whether Revan ever interacted with her."}, {"tag": "p", "text": "Should the player defeat Ice and proceed to kill Bendak Starkiller in a death match, earning dark side points in the process, Ice becomes introspective as to what his death meant for her cynical worldview."}, {"tag": "p", "text": "Ice receives a brief entry in The Complete Star Wars Encyclopedia, where she is described as having competed in the duel ring on Taris during the Great Sith War. This is implausible and most likely an error as the Great Sith War occurred in 3996 BBY, forty years before the events of Knights of the Old Republic where Ice still appears as a young woman."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}