{"url": "Icehead", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Sentient species of Endor"], "nodes": [{"tag": "h1", "text": "Icehead"}, {"tag": "p", "text": "Iceheads were a species of sentient humanoids with lean, black bodies that resisted extremes of cold, and spiked, rectangular heads that resembled blocks of ice. Their large mouths brimmed with jagged teeth, and their three-fingered hands sported sharp claws. While they could walk like other humanoid species, Iceheads could travel faster by flipping onto their heads and sliding on an icy surface."}, {"tag": "p", "text": "A group of Iceheads lived on the Forest Moon of Endor, where, armed with specialized clubs, they guarded the Snow Palace and went on missions for a sorcerer called the Snow King and his mistress, known as Odra. In 3 ABY, they stole a powerful artifact called the season scepter from the Sun King on their masters' orders and plunged Endor into perpetual winter. A group of Ewoks infiltrated the palace disguised as Iceheads, recovered the artifact, and restored the scepter and the season to their previous states."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Iceheads were a species of sentient bipeds who were comfortable in wintery conditions. Their thin, wiry bodies were humanoid with two arms that ended in three-clawed hands and two legs that thickened toward pointed feet. Their bodies appeared black. Members of the species stood about 1.5 meters tall on average."}, {"tag": "p", "text": "As their name implies, the head of a typical member of the species resembled a block of ice. The head was colored white and shaped like a thin rectangular prism, wide in front and back, but thin on the sides. The Iceheads' eyes were blue polygons that stretched from one side of the face to the other; the sides of their eyes could change angle to show emotion, appearing at times as quadrilaterals, and at others as triangles. The remainder of the head was given over to a large, shovel-like mouth with sharp and uneven edges. The lower jaw stuck out and overlapped the upper lip. The mouth, too, was flexible and capable of expressing emotion. A line ran through the center of the face and led to the top of the head, which tapered to several backward-curving spikes. With the exception of the eyes, the entire head was white and shiny, down to the inside of the mouth."}, {"tag": "p", "text": "Iceheads had several adaptations to aid them in cold-weather conditions. They could operate in low temperatures with no problems and could run normally through even deep snow, since they did not sink into it. Their quickest form of locomotion, however, utilized their hard, ice-like heads: when on a slick surface such as ice, Iceheads could flip upside down and skate about on their heads. Once they reached their destination, they simply flipped back upright and began walking again."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Several Iceheads lived on the Forest Moon of Endor and served their leader, a sorcerer known as the Snow King, and his mistress, a Frost Sprite known as Odra, the Duchess of Sleet. The Iceheads lived and worked in and around the Snow Palace, and their duties included standing guard over the Snow King and Duchess of Sleet, three on each side of the rulers' thrones, and patrolling the grounds outside the palace single-file while chanting, \"Snowy-O, snow-O!\" Such Icehead guards wielded wooden clubs that had thin, round grips, but which curved and grew wide and flat toward the other end. Other Iceheads performed various errands, typically armed with only their natural claws and teeth. Endor's Iceheads could comprehend the language spoken by their superiors, although they themselves rarely spoke except to acknowledge orders."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 3 ABY, several Iceheads had come under the command of the Snow King and his mistress, the Duchess of Sleet, on the Forest Moon of Endor. As Odra's influence grew stronger over the Snow King, she convinced him to steal a powerful artifact known as the season scepter from his brother, the Sun King. Four Iceheads were tasked with the deed, and they sneaked up on the Sun King while he was resting with his friends and grabbed the season scepter from the sand nearby. The weather on the Forest Moon instantly changed from summer-like heat to wintery snows. The Icehead troops skated away on their heads before the Sun King or his friends could apprehend them."}, {"tag": "p", "text": "A short time later, Odra urged the Snow King to send a group of Iceheads to intercept four Ewoks—Kneesaa a Jari Kintaka, Latara, Teebo, and Wicket W. Warrick—who were on their way from Bright Tree Village with, she thought, a powerful item called the Sunstar in their possession. The Iceheads were to capture the quartet and bring them to the Snow Palace. The Iceheads ambushed the Ewoks, who moved into the area on a large, flying leaf. During the ensuing skirmish, the Iceheads boarded the leaf and flew with the Ewoks through a dark tunnel. On the other side, they found themselves sharing the conveyance with a large snow monster instead. Nevertheless, two of the Snow King's minions managed to capture Kneesaa, and with the advantage of higher ground, the Iceheads caused an avalanche to throw off the other three Ewoks. With their white-furred prize in tow, the Iceheads returned to the Snow Palace and brought their prisoner to the throne room. Under the protection of their Icehead guards, the rulers demanded that Kneesaa hand over the Sunstar, but she refused."}, {"tag": "p", "text": "Meanwhile, a group of club-wielding Iceheads was completing a patrol of the grounds when the three Ewoks from the previous encounter coated themselves in snow and surreptitiously joined the procession as it entered the palace. Back in the throne room, three strange figures appeared and claimed to be ice-on-a-stick vendors. The Snow King and Odra, apparently seeing through the disguise, ordered their Icehead guards to attack. The servants dutifully flipped onto their heads and slid toward the Ewok Teebo, but he used one of their own clubs to knock them away. In the ensuing fray, Teebo gained possession of the season scepter and began a futile effort to use it. Wicket W. Warrick joined his companion, and together, the two hit the Snow King with a magical blast that broke the thrall of the Duchess of Sleet and restored his appearance and personality to normal. Another blast shrank the Frost Sprite and melted her into a puddle of water."}, {"tag": "p", "text": "In the battle's aftermath, the wintery weather subsided. Several other Ewoks, Logray and Chief Chirpa, arrived at the palace in the company of the Sun King. The Snow King handed over the stolen scepter, and Endor returned to summer. In appreciation for his help, the Snow King gave Wicket W. Warrick an Icehead club for his Belt of Honor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Iceheads appear in The Season Scepter, an episode of the Ewoks animated series written by Bob Carrau that first aired during the show's second season in 1986. Animation cells show that the characters were known as \"Iceheads\" from the production phase. The Iceheads were animated using two cells per pose, one for their eyes, and one for the rest of their bodies."}, {"tag": "p", "text": "The Season Scepter never establishes the identity of the Iceheads' ultimate master, the Snow King, or the Duchess of Sleet. As no Iceheads appear after Odra's defeat, their ultimate fate is left in question. Likewise, the Iceheads' origins are murky. According to Geonosis and the Outer Rim Worlds, only Ewoks and Yuzzums are native to the Forest Moon of Endor. A later source, \"Castaways of Endor,\" makes Duloks native to the moon as well and implies that Endor's other sentient beings were natives of other planets. The two sources blame Endor's massive gravity shadow and a shield of space debris nearby for downing ships on the moon and stranding their survivors. As no source conclusively speaks to the Iceheads' homeworld, however, they cannot be ruled out as native to the moon."}, {"tag": "p", "text": "A few of the Iceheads' scenes pay homage to the 1939 film The Wizard of Oz. For example, the scene in which the Iceheads march and chant outside the Snow Palace hearkens back to a similar scene of the Wicked Witch of the West's soldiers. Likewise, when the Ewoks sneak into the palace by impersonating the Iceheads, they quote a scene in Wizard when Dorothy Gale and her companions execute a similar ploy."}, {"tag": "p", "text": "Other jokes in the episode revolve around the Iceheads' clubs. With their long, curved, and flat shape, these resemble real-world hockey sticks. In one gag, Teebo repels a group of Iceheads by striking their heads with the club as if they were hockey pucks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}