{"url": "Icehead_club", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Batons and clubs", "Category:Cultural weapons"], "nodes": [{"tag": "h1", "text": "Icehead club"}, {"tag": "p", "text": "The Icehead club was a wooden bludgeon used by members of the Icehead species, who served as guards and soldiers for the Snow King, a powerful being who lived in the Snow Palace on the Forest Moon of Endor. The weapon was long and thin at its cord-wrapped handle, but it curved forward and widened into a paddle-like surface used to strike at a target. When used on ice, the club was able to swat an object a long distance across the slippery surface. In 3 ABY, Icehead clubs were used by both Ewok infiltrators and Icehead soldiers during a skirmish at the Snow Palace."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Icehead club was a melee weapon that had a narrow, two-handed grip wrapped in cord that extended for a distance roughly equal to half the height of its Icehead wielder, and curved backward. The club then curved forward acutely and widened into a paddle-like shape at the striking end. Thicker wrappings in orange separated the weapon's tip, handle, and striking surface. Attackers were able to wield the Icehead club both over- and underhanded to strike objects within short distances. In the latter technique, Icehead clubs were able to swat objects long distances across icy surfaces."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3 ABY, each Icehead guard outside the Snow Palace—home to a powerful being known as the Snow King—kept watch with an Icehead club slung over the shoulder. Icehead soldiers in the Snow King's throne room also employed the weapon. That summer, three Ewoks from Bright Tree Village—Latara, Teebo, and Wicket Wystri Warrick—used snow to disguise themselves as Iceheads and sneaked into the Snow Palace, where they hoped to rescue their friend, Kneesaa a Jari Kintaka, from the Snow King and his mistress, the Frost Sprite Odra, and to recover the season scepter, which the enchanted monarch used to cause perpetual winter on Endor. When they reached the Snow King's throne room, a skirmish erupted between Icehead forces and the Ewoks. During the fracas, Teebo used an Icehead club to bat away Iceheads who attacked him while sliding on their heads. The Ewoks reclaimed the season scepter and broke the enchantment placed on the Snow King by Odra. As a reward, the king gave Warrick an Icehead club to adorn his Belt of Honor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Icehead clubs appear in The Season Scepter, an episode of the Ewoks animated series that was written by Bob Carrau and first aired during the show's second season on November 1, 1986. With their long, curved, flat shape, the clubs resemble real-world hockey sticks. Jokes in the episode play on the resemblance, such as Teebo batting away sliding Icehead attackers as if their heads were hockey pucks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}