{"url": "Iceworld", "categories": ["Category:Real-world articles", "Category:Los Angeles Times comic strips"], "nodes": [{"tag": "h1", "text": "Iceworld"}, {"tag": "p", "text": "Iceworld is a comic strip written by Archie Goodwin and illustrated by Al Williamson. It was published by the Los Angeles Times Syndicate. It was later republished in Classic Star Wars 12 and 13 then collected in Classic Star Wars Volume 2: The Rebel Storm. It was also available on StarWars.com's webstrips section of Hyperspace. Unlike most other story arcs issued since Darth Vader Strikes, this story arc did not include the Star Wars Scrapbook."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luke Skywalker and C-3PO are fleeing Imperial forces when he is forced to hide in a comet and crash on an ice-covered world. With his ship damaged and communications out, he is forced to survive the night. His heat runs out and he collapses. When he comes to, he is lying on the back of a creature. A woman and her father are arguing about his fate. He surprises the man, an Imperial Governor hiding on this planet, when he wakes up, and when the man tries to shoot him, he strikes out with his lightsaber, destroying the blaster. Skywalker orders 3PO to lock up the man."}, {"tag": "p", "text": "The next morning, Skywalker and the woman, Frija, head back to his crashed ship. They want to salvage the communicators. Skywalker thanks Frija for saving him, and she tells him she is glad she found him. She also reveals why they are isolated on this planet, Hoth. As Skywalker finishes salvaging parts, the Governor reappears, having broken out of his prison. He tries to shoot Skywalker, but Frija knocks him aside to save him. She then jumps onto a tauntaun to save the communications equipment. The Governor aims for the parts, but shoots Frija instead. Blaming Luke, he turns the blaster unto the young Rebel. Skywalker is forced to slice the blaster, but ends up hitting the Governor, revealing him to be a Human replica droid. Frija calls out to him, and she is also a droid. She tells him the truth, that they were made to be decoys. She thanks him for bringing meaning to her life and then finally shuts down. Luke buries the two droids in unmarked graves and calls the Rebel leaders, suggesting they use this world as their next haven."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collected in"}, {"tag": "h2", "text": "External links"}]}