{"url": "Idiot%27s_Array_(episode)", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels episodes"], "nodes": [{"tag": "h1", "text": "Idiot's Array  (episode)"}, {"tag": "p", "text": "\"Idiot's Array\" is the eleventh episode of the first season of the animated television series Star Wars Rebels. It is the eleventh episode of the series overall."}, {"tag": "p", "text": "The episode, which features Billy Dee Williams reprising his original trilogy role of Lando Calrissian, was released on WatchDisneyXD.com and the WatchDisneyXD app on January 12, 2015, and premiered on Disney XD on January 19."}, {"tag": "p", "text": "The episode centers around the crew of the Ghost working for Lando Calrissian, after Garazeb Orrelios loses a sabacc bet to the smuggler and gambler. Calrissian uses the crew to his own ends in order to begin a mining operation on Lothal, while at the same time evading a crime lord called Azmorigan."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "After Zeb bets — and loses — Chopper in a game of sabacc, the Ghost crew find themselves caught in the middle of a smooth-talking smuggler's scheme."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Working for Calrissian"}, {"tag": "p", "text": "With the crew of the Ghost short on cash, Kanan Jarrus, Garazeb Orrelios and Chopper are at Old Jho's Pit Stop. When Kanan asks Jho if he knows about any jobs, the Ithorian bartender says he doesn't, but that the stranger playing sabacc with Zeb said he was looking to hire a ship and crew. Kanan pays for his drink and wanders over to the gambling table. The third player, besides Zeb and the stranger, is the Rodian Tsoklo, who swiftly bows out when the stakes get too high. Believing that he has a winning hand, Zeb decides to bet Chopper, as he has no more money. Kanan has some misgivings, but agrees when he sees Zeb's hand. Zeb reveals his hand, a Pure Sabacc, and reaches for the money, only to be shocked when the stranger warns him away and shows off his hand, an Idiot's Array. When Zeb, angry, demands to know the stranger's name, he introduces himself as \"Calrissian, Lando Calrissian,\" and asks to meet his new droid."}, {"tag": "p", "text": "Later, Kanan, Zeb, Chopper and Lando arrive at the Ghost, where Hera Syndulla, Sabine Wren and Ezra Bridger are waiting for them in the cargo hold. Zeb, upon seeing Hera, hurriedly states that he can explain, as Chopper smacks him in the leg. Hera asks Zeb what he's talking about, but Kanan interjects to introduce Lando, explaining that he needs to smuggle something past the Imperial blockade. Hera asks what kind of cargo he's talking about, and Lando responds that he and Kanan already settled on a price. He asks Hera if Kanan requires her approval for that kind of thing, and she responds that Kanan doesn't. Kanan and Lando shake hands, and Lando states that, as promised, when the job is done he'll pay them handsomely and return their droid, as Kanan smiles uncomfortably. Hera demands an explanation, and Zeb sheepishly admits that he bet Chopper, which shocks Hera, Ezra and Sabine. Zeb states that Kanan said it was okay, and Hera snaps at Kanan that he should know better. Lando interjects, saying that they need to get his cargo, and that if all goes well there shouldn't be anything to argue about."}, {"tag": "p", "text": "On the way to Lando's rendezvous, he acquaints himself with the crew, starting off by flirting with Hera, to Kanan's considerable irritation. Kanan says that they won't be able to get past the Imperial blockade without fixing the signature modulator, which is currently broken, and orders Chopper to fix it. The astromech droid beeps in response, and Hera agrees that since he's no longer part of the crew, he doesn't have to do what Kanan says anymore. Lando asks Chopper to take him on a tour of the ship, and the droid happily obliges, making Kanan even more aggravated. In the common room, Lando admires a painting of Sabine's starbird, comparing it to the protest paintings of Janyor of Bith. Ezra interjects that he'd said Sabine's work was good before, and she retorts that he didn't know why. During this, Chopper fetches his new master a hot drink from the galley, causing Zeb to remark that he can't believe that the irascible droid is actually \"waiting on that guy.\" Ezra retorts that he can't believe Zeb lost Chopper, and Zeb whispers that he thinks Lando cheated. Sabine offers to show Lando some of her more \"impressionistic pieces,\" and he accepts, calling himself an \"impressionistic connoisseur.\" Lando attempts to tell Ezra what the word means, and the boy retorts that he already knows. Once Sabine and Lando have left the room, Ezra asks Zeb what \"connoisseur\" means, and Zeb responds that it means \"A lot less than [Lando] thinks.\""}, {"tag": "h3", "text": "Swindling Azmorigan"}, {"tag": "p", "text": "Shortly later, the Ghost rendezvouses with the freighter Merchant One. Lando, Hera and Kanan board, and Lando tells the rebels to go along with whatever he says. Hera is concerned about what might happen if things go wrong, and Lando reassures her by noting that \"If a comet hits, this ship has escape pods.\" She is not particularly reassured. The three are escorted to the ship's owner, the Jablogian slaver Azmorigan, who is messily eating fruit. Gesturing to a hovering crate, Azmorigan states that he has what Lando ordered, and asks what the smuggler has to offer in return. Lando shoves Hera forward, passing her off as a slave girl, to her and Kanan's horror. Kanan protests, and Hera, still angry with him about getting them into this mess, tells him that \"a deal's a deal.\" She's insulted when Azmorigan dismisses her attire as \"preposterous,\" but the slaver accepts the deal. Hera \"thanks\" Lando for getting her here, and tells him that she will find a way to \"repay\" him. Kanan and Lando return to the Ghost with the crate."}, {"tag": "p", "text": "Back onboard, Sabine asks where Hera is, and Kanan angrily tells Lando to explain what happened. Lando responds that Hera's following his plan, and that they should be too so they can get her back. Kanan, irritated, demands to know what \"plan\" Hera is following, and Lando states that he told her to take an escape pod. In response, Kanan snaps that Lando told her no such thing, and Lando replies that he did, asking if Kanan was paying attention. Sabine sarcastically tells Kanan that he's having a good day, what with him losing first Chopper, than Hera. After the Ghost undocks from the Merchant One, Lando takes his crate to the ship's cargo hold and gives Ezra and Zeb firm instructions not to open it, telling them it contains sensitive mining equipment. As Lando departs, Ezra notes that the equipment in question is snoring."}, {"tag": "p", "text": "Meanwhile, back on Azmorigan's freighter, the slaver, still messily eating fruit, asks Hera if she needs food. Nauseated, Hera states that she seems to have lost her appetite, but suggests to Azmorigan that perhaps he would like her to serve him. He agrees, and she takes the tray of fruit from the protocol droid holding it. Hera then suggests that maybe Azmorigan would like to dine alone, and he agrees, ordering his guards out. As Azmorigan reaches for some fruit, Hera, telling him to \"take the whole tray,\" promptly knocks him out with it and exits the room, telling the guard at the door that the master wants some \"alone time\" while she changes clothes. Hera then knocks out the guard with the tray as well, before discarding it and heading for the escape pods. As Hera's pod launches, Azmorigan is found by his guards, and growls that he wants his \"property\" back. On the Ghost, Lando points out Hera's escape pod to a visibly angry Kanan, and Sabine swiftly escorts Lando out of the cockpit to prep the airlock. As soon as Hera is onboard, Lando reports via the intercom that they should make themselves scarce, and Kanan grumbles that \"somebody should.\" The Ghost then jumps into hyperspace. In the airlock, Hera hits Lando in the groin as payment for \"selling\" her to Azmorigan, and Lando agrees that he deserved it. Hera demands to know what was in the crate, and Lando offers to show her."}, {"tag": "h3", "text": "The puffer pig and Imperial entanglements"}, {"tag": "p", "text": "In the Ghost's cargo hold, Ezra and Zeb, curious about Lando's \"mining equipment,\" decide to open the crate against instructions. A puffer pig emerges, and Ezra notes that she's \"kinda cute.\" Zeb unintentionally startles the animal, and she flees up the ladder, prompting Ezra and Zeb to chase after her. On the upper deck, they pass Lando, Hera and Sabine emerging from the airlock, and Lando warns them not to scare her. In the hallway to the cockpit, Zeb grabs the pig. Seeing that the pig is spooked by the Lasat, Lando again warns Zeb that he's scaring the pig, and Zeb growls that he's not scaring her. In response, the pig, frightened, inflates and blocks the hallway, trapping Lando, Sabine, Hera and Chopper on one side, and Ezra, Zeb and Kanan on the other side. Kanan emerges from the cockpit, demanding to know what's going on. When Ezra attempts to explain, an exasperated Kanan decides that he doesn't want to know."}, {"tag": "p", "text": "Shortly after, the Ghost drops out of hyperspace above Lothal, right by the blockade of several Imperial Star Destroyers. Kanan remarks that he could really use Hera in the cockpit, on his side of the pig. Hera asks Lando what kind of stuff the Empire could be scanning for, and when he suggests \"rebels,\" she insists \"Besides that.\" He suggests mining equipment, and admits that he tried smuggling some to Lothal the week before. Lando explains that since the puffer pig is organic, the Empire won't detect her, as long as the Ghost can mask its signature. Hera retorts that he knows it can't until he asks Chopper to fix it, and Lando laughs. He asks Chopper if he'd like to be a \"hero\" and fix the signature modulator. Aboard the ISD Relentless, a scanning technician informs Admiral Kassius Konstantine that the Corellian freighter resembles the rebel ship the Empire has been looking for. At this point, Chopper activates the Ghost's signature modulator, making it appear to be the Tontine, a legitimate freighter authorized for travel between Boz Pity and Lothal. Konstantine tells the ship to prepare for scanning."}, {"tag": "p", "text": "As the Ghost flies through the blockade, Lando begins to flirt with Sabine again by offering to purchase some of her work, which irritates Ezra. He attempts to reach Lando and Sabine by climbing over the pig. Kanan, flying the ship and unaware of what Ezra is doing, tempts fate by remarking that they're going to make it. Zeb attempts to stop Ezra, but he's too late, and Ezra irritates the pig and causes it to inflate further, causing Zeb to be flung across the cockpit and into the controls, disabling the modulator. Onboard the Relentless, the technician informs Konstantine that the freighter's signal was masked, and the Admiral orders the Imperial forces to open fire. Kanan and Zeb, piloting the Ghost, make for Lothal. Zeb remarks that Hera usually fires back, and Kanan snaps that he's not Hera and is having enough trouble keeping ahead of the TIEs as it is. Sabine, manning the Ghost's rear cannon, shoots one of the fighters down. Hera tells Kanan to make for cloud cover. In the clouds, Kanan manages to lose the TIEs, and double back and shoot them down. He tells Hera he understands how hard her job as a pilot can be, and Lando remarks to Hera that Kanan finally appreciates her. Hera tells Lando off for trying to \"divide and conquer\" the crew, informing him that the only way he'll get what he wants is if the crew is working together in sync. Ezra, trapped between the inflated pig and the ceiling, asks for help."}, {"tag": "h3", "text": "Trouble with Azmorigan"}, {"tag": "p", "text": "After escaping, the Ghost flies to Lando's farm. As the crew and Lando disembark, he notes that he bought the farm off \"a charming fellow named Vizago.\" Hera asks why it was so important to get the pig here, and Lando explains that puffer pigs can smell precious minerals, so it can do the job of a dozen mining scanners. Hera notes that the Empire doesn't want private landholders mining Lothal. Kanan demands that Lando pay them, and the crew will then be on their way. At this point, a familiar voice interjects that Lando has other debts to pay, and Azmorigan and his henchmen, hiding around the farm, reveal themselves. Lando is shocked that Azmorigan knew where to find him, and Azmorigan reminds Lando that he was the one who introduced the smuggler to Vizago in the first place. Surprised, Lando notes that the overweight slaver must have walked to the farm, something that the smuggler thought Azmorigan never did. Azmorigan retorts that he is willing to do whatever is necessary to reclaim his property. Hera asks what Azmorigan wants, and he demands the return of the puffer pig and Hera, the Ghost and her crew as compensation for his \"sore feet,\" and Lando's death."}, {"tag": "p", "text": "Hera states that there will be no deal, and Kanan suggests that they reconsider the slaver's last demand. She overrides Kanan and repeats that there will be no deal, and Azmorigan loses his patience and orders his men to open fire. A gunfight ensues, and Sabine shoots one of the henchmen. Chopper takes the opportunity to steal one of Lando's fuel canisters. Ezra, taking cover with Kanan, pulls out his lightsaber-blaster to use. Kanan, unaware of the dual function, is initially worried that Ezra is going to expose himself as a Jedi under fairly mild circumstances. Ezra tells his master that he worries too much and shoots one of Azmorigan's henchmen, impressing Kanan. On Hera's orders, Zeb frightens the puffer pig again, causing her to inflate and knock over two of Azmorigan's henchmen. Sabine uses the animal as a stepping stool to reach the roof of the farmhouse and hold the two remaining henchmen at gunpoint."}, {"tag": "p", "text": "Azmorigan takes advantage of Zeb being distracted by having to shoot a henchman firing at Chopper, who was pushing his pilfered fuel up the Ghost's ramp, to hold the Lasat at gunpoint. He threatens to kill Zeb if they don't surrender Lando to him. Kanan and Ezra, strongly disliking Lando due to his flirting, swiftly agree. Hera overrules them, and denies Azmorigan anything. Then Chopper, onboard the Ghost, fires the ship's nose gun at Azmorigan, throwing him and Zeb to the ground. Zeb takes the opportunity to retrieve his bo-rifle and hold Azmorigan at gunpoint, saluting Chopper in thanks. Hera tells Azmorigan and his remaining henchmen that they'll spare their lives, and orders them to start walking. As the crime lord leaves, Sabine fires at the henchmen's feet to get them running."}, {"tag": "h3", "text": "Resolution"}, {"tag": "p", "text": "After Azmorigan has fled, Lando remarks that he likes everything that happened except for sparing Azmorigan, because that could create trouble for him in the future. Hera retorts that Lando already has a problem now: he doesn't have the money he owes the Ghost crew. In fact, Hera suspects he never did. Lando offers to return Chopper, and Hera states that that won't satisfy his debt to her. He suggests that they settle it with a game of sabacc, and Hera responds that he'll just have to owe her one. Chopper rolls up to Lando, who bids farewell to his \"small metal friend,\" stating that they will meet again. In response, Chopper slaps Lando with his manipulator arms and rolls off. As the Spectres board the Ghost, Ezra tells Sabine that he always appreciated her, and she tiredly responds that she knows. Kanan and Hera discuss that they still need money and fuel, as Kanan doesn't see Chopper's return as a positive. In the cargo hold, the crew discovers that Chopper stole some of Lando's fuel, and Zeb asks if Chopper was playing Lando for a fool the entire time. Sabine congratulates the astromech, and the Ghost takes off. Lando watches the ship depart, telling his puffer pig that he knows that Chopper stole the fuel, which is why he didn't pay the rebels. He waves, believing that they shall meet again."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}