{"url": "Amuncie_Tidian", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Boosodian", "Category:Forgers", "Category:Males"], "nodes": [{"tag": "h1", "text": "Amuncie Tidian"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Amuncie Tidian was a Boosodian male forger who was active on the planet Kijimi shortly before its destruction in 35 ABY. During the First Order's occupation of the planet, he exited a building in Kijimi City but then immediately retreated back inside after spotting a nearby First Order patrol. Tidian's twenty eyes could be focused to see different portions of the electromagnetic spectrum, and he believed that he had the ability to see the future with a non-existent twenty-first eye."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Amuncie Tidian was a Boosodian male who worked as a forger during the war between the First Order and the Resistance. During the First Order's occupation of the planet Kijimi in 35 ABY, Tidian exited a building within the Thieves' Quarter of Kijimi City while a spotlight was being shone upon the building's door. Tidian called out and then looked around, not seeing the Resistance pilot Poe Dameron, who was hidden nearby, but spotting a First Order patrol attempting to enter another neighboring building."}, {"tag": "p", "text": "Seeing the First Order caused him to call out in alarm and retreat back to within the building, closing the door behind him. Shortly after Tidian retreated into the building, the First Order evacuated its personnel from Kijimi before the planet was destroyed by their allies in the Final Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Boosodian, Amuncie Tidian was well equipped to work as a forger and with concentration could focus clusters of his twenty eyes on specific portions of the electromagnetic spectrum, including X-rays and, with a large amount of effort, radio waves. Not long before Kijimi was destroyed, he had become convinced that he was able to see the future, crediting his supposed ability to a non-existent extra eye. Tidian had gray skin and white eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Tidian wore a black insulated environment suit and black boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Amuncie Tidian was portrayed by Nick Kellington\nin the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker. He was first identified simultaneously in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo, and a card in the 2019 Topps Star Wars: The Rise of Skywalker Series 1 trading card set by The Topps Company, Inc."}, {"tag": "p", "text": "Tidian was originally designed to be an alien that had seen the ten thousand Star Destroyers of the Final Order and reported it back to the Resistance. Looking haunted was an integral part of the original brief for the character and creature concept designer and senior sculptor Martin Rezard gave the character many eyes so that viewers would question if he had really seen that many ships or whether his number of eyes had caused him to see more."}, {"tag": "p", "text": "Rezard's concept art was titled \"Haunted Alien.\" The script of the film evolved to not include the character as originally imagined, with the character Boolio instead delivering similar information to the Resistance. However, director J.J. Abrams took a liking to Rezard's design and promised to use it elsewhere, using the character as an extra on Kijimi in the final version."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}