{"url": "Ido_Glayyd", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Ido Glayyd"}, {"tag": "p", "text": "Ido Glayyd was a Human female member of the venerable House Glayyd on the Corporate Sector planet Ammuud. Glayyd's father Agmor was the Mor, or clan patriarch, of House Glayyd, and upon his death in 2 BBY her younger brother Ewwen ascended to the role. Ido took her place at her brother's side as his most trusted advisor. Just weeks after her father's death, an insult paid to Ido by the gunslinger Gallandro forced her brother to challenge the outsider to a death duel—Ido then helped bring in Corellian smuggler Han Solo to intercede in the duel and allow her brother to save face."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The daughter of Agmor Glayyd, the Mor—or clan patriarch—of the powerful House Glayyd of the Corporate Sector world of Ammuud, Ido Glayyd grew up being told that she only had one purpose: being a suitable wife for a husband within the clan. But while she was constantly courted by any number of suitors interested in the rich Glayyd holdings—only Kyle Odoon stood out as remotely pleasant—she had little interest in that duty. Her father's sudden death, due to a mysterious poisoning in 2 BBY, instead gave Ido a chance to take an active role in shaping her family's future. Ineligible to become Mor according to the Code of Ammuud, Ido instead watched her younger brother Ewwen take the position, and in turn took her place alongside him as his most trusted advisor."}, {"tag": "p", "text": "It was only weeks before Ewwen faced his first major trial as the new Mor of House Glayyd. At a reception, Ido had an encounter with a mysterious offworlder named Gallandro, who gravely insulted and struck her. Honor dictated that the Mor in turn challenge Gallandro, a famed gunslinger, to a death duel, even though Ido suspected that it was an obvious plot by a rival clan to eliminate the new Mor Glayyd. The scheduled duel was postponed twice in the coming days, just in time for Corellian smuggler Han Solo to arrive on Ammuud, claiming to have business with Ewwen. Ido saw an opportunity: although the Code of Ammuud meant that no one in Clan Glayyd or in its service could intervene in the duel, the outsider Solo could step in and allow her brother to save face. Although Ewwen was uncertain at first, Ido begged her brother to accept Solo's intervention as a personal favor, and his assent caused Gallandro to issue an apology and call off the duel."}, {"tag": "p", "text": "In the aftermath of the duel, Solo informed the Glayyds of his reasons for coming to Ammuud: he was after a slaving ring that had cheated him out of 10,000 credits, and through his investigation he had learned that one of the group's leaders, a man named Zlarb, had cleared several of his starships cleared through House Glayyd's shipping firm—the Glayyds had kept themselves purposefully unaware of the group's activities, as Zlarb and his associates paid them extremely well. Solo and his partner, Fiolla, hoped their hosts could point them towards the ring's connections. Ewwen initially refused, as the provision of the Code of Ammuud known as the Silence compelled him not to betray their trust, as Zlarb's people had never broken faith with the Glayyds. However, after learning that Zlarb—a trained Malkite Poisoner—was responsible for the death of the former Mor, Ido and her brother passed on the information that Solo needed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Much like her brother, Ido Glayyd had an idealistic vision for the future of her homeworld, seeing its social order as archaic and hoping to chart a better course. Strong-willed and intelligent, she found her niche as her brother's advisor, which allowed her to focus on other matters than her various suitors. The job carried with it its own challenges, however: Ido was protective of her younger brother and extremely concerned with his safety, and had to work to get him out of difficult and dangerous situations. As an advisor, the beautiful Ido used lessons learned from a Lorrdian tutor, who taught her the art of reading body language and posture."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ido Glayyd first appeared in Han Solo's Revenge, written by Brian Daley and released in 1979. She later was pictured, along with her brother, by Mike Vilardi in 1993's Han Solo and the Corporate Sector Sourcebook."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}