{"url": "Iego/Legends", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Pages needing citation", "Category:Ash Worlds planets", "Category:Confederacy of Independent Systems planets", "Category:Iego locations", "Category:Spice producing worlds", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Iego"}, {"tag": "p", "text": "Iego, named the Planet of a Thousand Moons, was a planet located in the Extrictarium Nebula in the Outer Rim Territories. Due to the obscurity of the Nebula, Iego did not appear on any star-charts. Iego did not orbit a sun; rather, it was warmed by local stellar gases. It was home to the subterranean Maelibi species, as well as thousands of stranded spacefarers who had been lured to the planet by the Diathim—a spaceworthy species that resided on Iego's forty-two moons. Although Iego appeared to have no noteworthy natural resources, the concepts of aging and hunger somehow eluded its residents."}, {"tag": "p", "text": "In spacer lore, Iego was considered a mythical location, and was the subject of many stories and rumors. Numerous expeditions set out to find the planet, though few succeeded, and the ones who did were for the most part unable to leave. Due to the amount of hearsay surrounding the planet, as well as its continued unconfirmed location, most members of the galaxy's scientific community dismissed Iego as a spacefarer's tale."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Iego's original inhabitants, the Maelibi (also called Demons), were large, subterranean creatures that sang a song so pure that it was regarded as the very essence of song. They lived in large, underground caverns, but they intermittently poached the castaway population, dragging their screaming victims back below ground."}, {"tag": "p", "text": "The inhabitants of Iego's moon Millius Prime, Diathim (also called Angels), were vibrant, flying creatures that were said to be of legendary beauty. When a new starship arrived in orbit, a mass of angels assembled around it, entrancing the pilot into crashing his ship onto the rocky surface of Iego."}, {"tag": "p", "text": "For many years, spacers somehow ended up on Iego. Very few ever made it back. A mass of starships named The Scatter sat on Iego's surface and around it lived the castaway tribes. Each time a new being landed on the planet, they pledged allegiance to one of the tribes. There were a select few who chose not to join a tribe and instead live inside the Scatter; alone, angry, and often insane."}, {"tag": "p", "text": "For some reason, time did not seem to affect Iego, as supposedly castaways no longer felt the burden of age or hunger. It was said that Humans who served in the Great Sith War could still be alive on Iego millennia later."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally a planet of legend known as Maelibo, smugglers eventually located reliable routes through the Extrictarium Nebula. A former state of Xim's Empire, towards the end of the Old Republic, spice convoys visited the planet and brought more civilized living to the inhabitants. They eventually dried up, and Iego became increasingly isolated."}, {"tag": "p", "text": "During the Clone Wars, the Separatists invaded the planet and established battle droid garrisons, intending to use Iego as a redoubt should their war go against them. They eventually abandoned the planet, but before leaving, they installed an orbital security system that destroyed any ship trying to leave the system. The inhabitants of the planet believed the amount of casualties in orbit was because of the wrath of \"Drol\", a destructive spirit that would allow nobody to leave the planet. Jaybo Hood, a ten year old prodigy, made use of the battle droids left on the planet and reassigned them to his personal commands."}, {"tag": "p", "text": "When Anakin Skywalker and Obi-Wan Kenobi arrived on the planet to collect a reeksa root necessary to create an antidote to the Blue Shadow Virus, the locals told them about the myth of Drol. The Jedi soon discovered that it was actually a laser security system that went off whenever a ship passed through the area. They destroyed it with Jaybo's Vulture droids, bringing freedom to Iego."}, {"tag": "p", "text": "During the Second Imperial Civil War, Iego was one of the worlds that supported the Galactic Alliance Remnant."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Scatter was located in the far south of the planet and almost every being who was unfortunate enough to be stranded stayed there for the rest of their lives."}, {"tag": "p", "text": "The Choir Alignment was located near the planet's equator and was one of the few places that the Diathim would touch down on the planet's surface. It was unknown why they chose to land there but it created a brilliant light that could be seen for miles."}, {"tag": "p", "text": "The Boneyard was in the north, bordering Iego's mountains. It consisted of massive bones, too big to be from any known creature. Underneath it could be found caverns inhabited by the demon-like Maelibi."}, {"tag": "p", "text": "Rawk's Nest, the home of \"Bantha\" Rawk, was also located on Iego."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Iego was first mentioned in The Phantom Menace by the character Anakin Skywalker. In the novel Labyrinth of Evil, Iego is misspelled as \"Viago.\" The correct spelling of \"Iego\" was confirmed by Leland Chee in a thread at the StarWars.com message boards. According to the Geonosis and the Outer Rim Worlds, Iego was said to have 42 moons. This sets up a continuity error, as later sources claim Iego has 1,000 moons."}, {"tag": "p", "text": "The Angels of Iego closely resemble the Sirens from the Greek epic The Odyssey, beautiful creatures that used their songs to lure ships to crash."}, {"tag": "p", "text": "In Star Wars: Starfighter, Iego is mispronounced as \"Lee-go\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}