{"url": "Igear", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Merchants", "Category:Scavengers", "Category:Tarisian outcasts"], "nodes": [{"tag": "h1", "text": "Igear"}, {"tag": "p", "text": "Igear was a young Human male native to the Undercity of Taris. He was the Outcast village's primary salvager and trader, and was very jealous of Gendar's position of leadership."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Whether Igear was a trader before being found guilty of a crime and then sent down as an Outcast or a descendant of one is unclear as there is no information about his history. Igear was good at striking deals with the swoop gangs of the Lower City which made him the primary trader for the Outcast colony. Whenever an outcast found useful salvage they would bring it to Igear and he would trade it with the gangs for food, medicine or sometimes credits if he was lucky. However, he envied Gendar's position and did not agree with Gendar's views and ideals. At some point he attempted to hide supplies so that he would give them to the others when they would need them desperately, thereby gaining followerers. His goal in this matter was to usurp Gendar. However, Gendar caught him and made him share his hoard. Though Gendar never trusted Igear again, he did not banish the shopkeeper because of his ability to make deals."}, {"tag": "h3", "text": "Arrival of Revan"}, {"tag": "p", "text": "In 3956 BBY, Revan, an amnesiac former Sith Lord, came to the village while searching for Mission Vao as part of a larger quest to rescue Bastila Shan. It was likely Revan did buy a few things from Igear, as the Undercity was a dangerous place. When Rukil sent Revan to find out what happened to Malya, his former apprentice, Revan soon found her dead, and returned to Rukil with her journal. After revealing to Rukil his apprentice's fate, Rukil explained to Revan the Tarisian Civil War and the legend of the Promised Land. Revan agreed to Rukil's request to search for the missing journals from his father and grandfather, in order to complete the puzzle."}, {"tag": "p", "text": "Igear overheard the conversation between Rukil and Revan. Unlike many from the Outcast village, Igear believed there might have been some truth to Rukil's stories. It was for this reason he wanted to stop Rukil from discovering its location. Igear felt that, for an Outcast, he lived life pretty well. His position as deal maker and shopkeeper meant the villagers relied on him. He believed his position of power was in turn dependent on the village needing his services. If the Outcasts discovered the Promised Land, his services would no longer be needed and he'd be \"another nobody\". He offered Revan a considerable sum of credits, something Rukil couldn't offer, to give the clues to the Land's location to him instead of Rukil, so that they might be destroyed. Revan found the missing journals, but refused Igear's offer and instead gave them to Rukil, who then managed to find out the location of the Promised Land. Igear, like all the other Outcasts, left the Undercity village for the Promised Land."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Igear was eager to get his hands on any food, medicine and credits, a trait common among most outcasts. Unlike the others however, Igear didn't believe that the salvagers who brought him salvage should get anything, because he believed that it was \"his store, his profits\". He also believed that if he was to survive he had to look out for number one. Igear was so self-centered that he believed that if it wasn't for Gendar, he (Igear) would be in control of the village, something Carth Onasi commented that if it wasn't for Gendar, the village would be a lot worse than it is. This self-centered behaviour made Igear unafraid to ruin the village's hope for salvation just because it compromised his position."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Alternatively, Revan could have given the journals to Igear who then would have burnt them, leaving the Outcasts in the same situation with no hope. If the journals had been destroyed he would have rewarded Revan with 100 credits. He could have persuaded for more—200 credits—if his skill in persuasion had been high enough."}, {"tag": "p", "text": "In Knights of the Old Republic: Prima's Official Strategy Guide, Igear intends to sell them to the Black Vulkars."}, {"tag": "p", "text": "Igear is portrayed with a different face in the Xbox version of the game, where his skin color is light instead of dark."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}