{"url": "Iguni", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Individuals of unidentified species", "Category:Jedi Commanders", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Iguni"}, {"tag": "p", "text": "Iguni was a Jedi Padawan around the time of the Clone Wars, having previously trained in Yoda's youngling classes."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Youngling"}, {"tag": "p", "text": "He was one of the many younglings who trained with Yoda before being selected by a Jedi Master, in a class along with his friend Zeami. It was during this time that he questioned if training in the Force could make him stronger to which Yoda answered that, though he could become stronger in the Force, it was not a certainty and if his spirit was not strong then he would be burned by the flame of the dark side."}, {"tag": "h3", "text": "Padawan"}, {"tag": "p", "text": "By the time of the Battle of Coruscant, Iguni had been selected by Mace Windu as his apprentice. Though still a Padawan, he and his friends Zeami and Zoi both took part in the battle, despite their master's warnings not to, engaging several B2 super battle droids and Octuptarra combat tri-droids as well as at least one DSD1 dwarf spider droid. His friends were both struck down by the droids, which led Iguni to create a whirlwind around himself and Zeami in the Force, destroying many droids but also badly hurting Zoi."}, {"tag": "p", "text": "It was then that the group was found by Mace Windu, who ordered Iguni to take his fellow Padawans back to the Jedi Temple as it was Iguni's lack of discipline and weakness which had caused his friends harm. Upon returning to the temple, Zeami was taken to the infirmary but Zoi was well enough to inform Iguni that the \"great hero\" Anakin Skywalker had returned from defeating Count Dooku. Iguni then went to the infirmary to apologize for hurting Zeami, but she informed him that there was no need. Despite this, Iguni vowed to become stronger to protect those who he cared about."}, {"tag": "p", "text": "Iguni went on to train his lightsaber skills with Master Windu and, though he was defeated with ease many times, he kept persevering. Eventually he got to a point where Mace Windu reported that he had improved, though he had to stop letting his guard down when he attacked. While he was still defeated in this spar, he nevertheless rejoiced at showing some improvement."}, {"tag": "p", "text": "It was shortly after this time that Iguni once more saw Anakin Skywalker, this time approaching him to ask a question. When he asked Anakin what it was that made him so strong in the Force, Anakin bounced the question back to him, asking him why he wanted to be strong. It was only when Iguni responded that he wanted to become strong to protect his friends that Anakin gave his answer; he wanted to protect the ones he loved, though he cut himself off before he was able to inform Iguni that he would do anything for this goal."}, {"tag": "p", "text": "Though he had stopped himself, when Anakin touched Iguni's shoulder, Iguni was given a vision in the Force of Anakin falling to the dark side and killing him. Anakin Skywalker simply walked away, while Iguni stood there in silence. Iguni's vision soon came to fruition, as Anakin fell to the Sith and it is entirely possible that the later part of his vision came true also, with Iguni being killed by Anakin himself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Iguni only appears in the story Evil Eyes, published in Star Wars Manga: Black issue of Tokyopop's Star Wars Manga. Originally published in Japan, those stories were considered to be of \"fuzzy\" continuity by Lucasfilm. Since then, they have been republished in English in the United Kingdom under Infinities label, which established the material in them as non-canonical."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}