{"url": "Iktotch", "categories": ["Category:Canon articles", "Category:Desert moons", "Category:Expansion Region moons", "Category:Iktotch locations", "Category:Narvath sector", "Category:Rocky moons", "Category:Type I atmosphere moons"], "nodes": [{"tag": "h1", "text": "Iktotch"}, {"tag": "p", "text": "Iktotch was the moon of the planet Iktotchon located in the galaxy's Expansion Region."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The moon of the gas giant Iktotchon, Iktotch was the rocky moon upon which the hardy Iktotchi species evolved and developed society. The moon itself was considered inhospitable by galactic standards, due to the strong sand-and-gravel windstorms that buffeted the barren landscape. The Iktotchi developed a heightened Force-sensitivity to survive on the moon, with innate precognitive skills that allowed them to predict a storm's approach and avoid the damaging winds."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Developing a civilized culture early in galactic history, the Iktotchi established cities across Iktotch. Predicting the rise of the Galactic Republic, ancient Iktotchi carved the Crest of the Republic into a mountainside where they predicted scouts would land. When the Republic did arrive, they were stunned by the Iktotchi's power and alerted the Jedi Order. Taking an interest in the moon's people, the Jedi began inducting powerful Iktotchi into the Order and conducting studies on the world. Some Jedi and scholars speculated that the moon itself was a massive vergence in the Force, though admitted that the phenomenon rarely encompassed an entire moon. The Jedi also found it peculiar that the farther from Iktotch an Iktotchi traveled, the weaker their connection to the Force grew."}, {"tag": "p", "text": "While the Iktotchi throughout the galaxy began to return to Iktotch in the years preceding the Clone Wars due to their precognitive skills, most failed to predict the fall of the Republic and the Jedi Order due to the dark side veil of the Dark Lord of the Sith Darth Sidious. When the Galactic Empire came to power, the Emperor immediately ordered that the moon be blockaded by the Imperial Navy to prevent the Iktotchi from threatening the stability of the Empire. Visitors to the system required permits, and additional waivers to land on the moon. While the Iktotchi were prohibited from leaving the moon, many Iktotchi offworld returned home to avoid the Galactic Civil War, which they predicted would affect other occupied worlds more directly than their isolated moon. Because no Imperial Governor was installed, the citizens of Iktotch were free to live as they wished, but were also forced to go without galactic support should they suffer any planetary crises. Pilots and smugglers frequently broke the blockade to smuggle in items not permitted through official channels, as wells as black market material. Others sought out the Rebel Alliance to help promote the forthcoming change in power."}, {"tag": "p", "text": "According to propaganda viewed by FN-2187, Iktotch saw the liberation of a labor camp by the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Iktotch was first mentioned in the Star Wars Legends reference book Star Wars: Episode I The Visual Dictionary, which was written by David West Reynolds and released in 1999. The world was confirmed to be canon by the reference book Ultimate Star Wars, which was released in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}