{"url": "Ikvizi", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with gameplay alternatives", "Category:Geonosians", "Category:Males", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Ikvizi"}, {"tag": "p", "text": "Ikvizi was a male Geonosian scientist who worked at the old Geonosian research station on Yavin 4 a few years before the Battle of Yavin. After he left the station, Ikvizi journeyed to the city of Kachirho on the planet Kashyyyk to study the Wookiees. A short time after the destruction of the Death Star, a group of Trandoshan slavers framed Ikvizi for a crime, because he had found their base in the forests where they tortured their Wookiee slaves. While he was in the Kachirho prison, he came upon a spacer who agreed to help the captive Geonosian get out of the mess. After Ikvizi was freed from jail, he gave the spacer a handsome reward."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ikvizi was a male Geonosian scientist active during the reign of the Galactic Empire. Ikvizi worked at the Geonosian Bio-Labs on the moon of Yavin 4 a number of years before the Battle of Yavin, with his primary job being to travel the galaxy and bring back DNA strands from useful animals. During his travels, he was able to get his hands on the DNA of the bolotaur, a sacred riding beast on the planet Kashyyyk that the native Wookiees let no other species use. After he decided to leave the labs on Yavin 4, he moved to Kashyyyk to study the native Wookiee population. However, upon returning to Kashyyyk, he found out that as his species was very rare on the planet, the natives were distrustful of him. This made his job very difficult, and at times, impossible. Usually he could only interview the Wookiees that were outside mainstream Kashyyyk society for one reason or another."}, {"tag": "p", "text": "Sometime after the Battle of Yavin, during the Galactic Civil War, Ikvizi heard a rumor about a scientific camp east of the city of Kachirho. He decided to go out into the forest to swap notes with the these other scientists. However, when the Geonosian arrived at his destination, it turned out that the scientific camp was not a research station at all, but a group of Trandoshan slavers doing strange and painful experiments on Wookiee captives. Ikvizi decided to sneak into the camp and find some proof to take back to Kachirho. When he was rummaging through the slavers' items, one of the Trandoshans found Ikvizi and knocked him out. When he awoke, Ikvizi was in chains, being led by a Wookiee hunting patrol back into town. The patrol had found him unconscious in the woods with documents implicating him in a vile plan to do harmful experiments on many Wookiees."}, {"tag": "p", "text": "When the hunting party arrived back at Kachirho, Ikvizi was thrown into jail and sent to trial. As soon as the trial began, there were suddenly a whole slew of people testifying against him, saying they had seen the Geonosian doing suspicious things around the city; most notable of these was bribing a guard to let him examine one of the Wookiee hunters who had died in the Shadowlands. Ikvizi only wanted to study the Wookiee physiology because no live Wookiee would let him examine them, but the courts did not see it that way, and Ikvizi was on the verge of being found guilty."}, {"tag": "p", "text": "While Ikvizi was in jail, a spacer came by his cell. After convincing the spacer to listen to him, Ikvizi explained his misfortune and how the Trandoshans had framed him. He asked the spacer to search for the Trandoshan camp and to find some proof that he was not planning on any experiments on the Wookiees. The spacer agreed, and went out to find the Trandoshan camp. Upon reaching the camp, the spacer was attacked by some of the slavers there. After killing the assailants, the spacer found eight documents proving Ikvizi was not planning anything and that the Trandoshans were guilty of doing illegal experiments on the Wookiees."}, {"tag": "p", "text": "The spacer returned to Kachirho and brought the documents to Ikvizi, who after looking them over, told the spacer to give the documents to Elder Ovarra, who was one of the judges at Ikvizi's trial. When the spacer showed the female Wookiee the shocking information, she cleared Ikvizi of the dangerous experiment charges. While Ikvizi was still charged with bribing the guard, she said she would argue he receive a lenient sentence. She then sent a patrol to stop the remaining Trandoshans. The spacer returned to the Geonosian with the good news, but Ikvizi was upset that he still had to spend more time in prison for bribing the guard. As a reward, he told the spacer of his old research station on Yavin 4. The facility still contained the DNA strands of the bolotaur, which, if recovered, the spacer could keep. Once the spacer recovered the DNA strands, they were then used to clone a bolotaur riding beast for the spacer."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ikvizi took his work very seriously, even going so far to bribe a Wookiee guard to examine a Wookiee's corpse. However, despite this infringement of the law, Ikvizi had a sense of justice. When he discovered the Trandoshan slaver camp, instead of protecting himself and retreating from the site, he ventured into the camp to look for evidence to save the Wookiee captives. Ikvizi had a dry sense of humor, even joking around a little when the spacer accused him of being a criminal. Ikvizi had black eyes, dark green skin, and no hair."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ikvizi made his first and only appearance in the Star Wars Galaxies expansion game Rage of the Wookiees, in which he was an add-on quest to the already preexisting Geonosian Bio-Lab \"theme-park.\" Although the player can choose not to do Ikvizi's quests, this article assumes 100% game completion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}