{"url": "Ilamna", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:The Divide", "Category:Eucer sector astronomical objects", "Category:Galactic Republic astronomical objects"], "nodes": [{"tag": "h1", "text": "Ilamna"}, {"tag": "p", "text": "Ilamna was an astronomical object located in the star system of the same name, which was a part of the Eucer sector of the Mid Rim. The celestial body was situated in the region known as the Divide during the Tionese War, fought between the Galactic Republic and the Honorable Union of Desevro & Tion. During that time, Ilamna had been settled by Republic colonists."}, {"tag": "p", "text": "Shortly before the war's end around 23,900 BBY, Republic settlements on the astronomical object Okator VIII were destroyed by a Tionese military force. A local farm boy–turned–Republic soldier, who had witnessed the attack, later narrated an account of the attack in a Baragwin sense lattice. The soldier noted that the Tionese could have just as well chosen as their target any of the other settled celestial bodies of the Divide, including Ilamna."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ilamna was originally meant to be mentioned in the 2012 reference book The Essential Guide to Warfare by Jason Fry and Paul R. Urquhart; however, the section that would have mentioned the astronomical object was cut before the book's release."}, {"tag": "p", "text": "The information regarding Ilamna was later released in 2014 as part of Star Wars: The Essential Guide to Warfare Author's Cut, a series of articles published on the StarWars.com Blog by Fry and Erich Schoeneweiss containing various cut content from The Essential Guide to Warfare. The StarWars.com Online Companion to the 2009 reference book The Essential Atlas placed the Ilamna system, and therefore the celestial body itself, in grid square Q-7."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}