{"url": "Illegal_Lab_(Corellia)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Corellia locations", "Category:Laboratories"], "nodes": [{"tag": "h1", "text": "Illegal Lab  (Corellia)"}, {"tag": "p", "text": "An illegal lab was in operation on Corellia during the time of the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "This laboratory was located on an island off the southern shore of the Core World of Corellia, near the Suntir Plains and the Riverlands. The laboratory was active following the Battle of Yavin in 0 BBY and specialized in bio-engineering creatures. Genetic experiments being conducted in the lab were illegal and highly dangerous. For instance, the scientist were crossing DNA between aggressive creatures and passive members of the same genus in order to create powerful and intelligent fighting beasts. Engineered creatures included durnis, gaping spiders, bark mites, klikniks, tusk cats, boar-wolves and acklays. Doctor Maldien was the Chief Scientist of the lab, and Jenson served as lead beast master. Among the lab's residents included three administrative heads, Rond Fenimer, Pirt Rawklin, and Benn Calder. The Whiphid Borgan once applied as Security Director position at the lab but was turned down."}, {"tag": "p", "text": "The illegal activities in the lab were finally discovered after an informant known as Ja'inn reported some rumors about \"dangerous things coming\" to CorSec Lieutenant Joth, circa 1 ABY. Lieutenant Joth tasked a spacer with tracking down rumors. The spacer learn from Ja'inn that one of her friends, the Bothan smuggler Moril, got scared after shipping some rather odd items to a group that he couldn't name. When he was interrogated by the spacer, Moril confessed he was hired to deliver animal feed, chemicals and tranquilizer materials to the lab and what he saw there terrified him. Lieutenant Joth therefore ordered the spacer to go to the drop location for Moril's shipment and investigate the area. Upon arriving to the lab, the spacers first attacked security officers to get the passwords needed to access administrative terminals. The spacer also killed the three administrative heads, Rond Fenimer, Pirt Rawklin and Benn Calder, to get their passwords. This allowed Lieutenant Joth to identify the building as a secret illegal lab. Joth consequently tasked the spacer to cripple the operations. On the first level of the lab, the spacer also met Jeridel, who was worried about her missing brother, the beast master Jenson. The spacer then entered the second level of the lab. There, the spacer fought some guards and researchers, disabled the security system control and downloaded research notes. The spacer also killed Doctor Maldien. However, Lieutenant Joth was worried about the beasts and ordered the spacer to neutralize them. The spacer therefore released a tranquilizer gas to subdue the animals. In the lower level of the lab, the spacer fought the beasts that were still aggressive but managed to kil them all. The spacer also collected some blood samples from the engineered creatures to Stregand, the representative of a rival lab. The spacer eventually found the body of Jeridel's bother Jenson, killed by his own beasts. Finally, the spacer overloaded the lab's central computer, destroying all the research data collected."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The illegal laboratory on Corellia was a location in the 2003 massively multiplayer online role-playing game Star Wars Galaxies, prior to the game's closure on December 15, 2011. The illegal lab was added to the game with the release of the \"Publish 28\", on April 26, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}