{"url": "Ilum", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Death Stars", "Category:Destroyed planets", "Category:First Order planets", "Category:Galactic Empire planets", "Category:Ice planets", "Category:Ilum locations", "Category:Ilum system planets", "Category:Jedi planets", "Category:Mining planets", "Category:Mobile space stations"], "nodes": [{"tag": "h1", "text": "Ilum"}, {"tag": "p", "text": "Ilum was a snow-covered planet located in the 7G sector of the Unknown Regions, within the Ilum system. Ilum was the fifth planet from its parent star Asar, a blue dwarf, located roughly equidistant from Asar and the system's cometary cloud. Ilum had a kyber crystalline core, and had been utilized by the Jedi Order for the Gathering, a rite of passage in which Jedi younglings had to find and harvest kyber crystals for their lightsabers, which had existed for thousands of standard years."}, {"tag": "p", "text": "When the Jedi Order was exterminated by order of Darth Sidious, the new Galactic Empire occupied Ilum and began excavating it for its vast supply of kyber crystals, which were to be used in the construction of the first and second Death Stars. The over-mining of the planet caused its core, and later a massive Imperial Trench, to open up along Ilum's equator."}, {"tag": "p", "text": "After the fall of the Empire, its successor state, the First Order, converted the massive trench into Starkiller Base: a system-destroying superweapon that was the culmination of the Empire's research into dark energy translations and hyperspace tunneling. Held in secret by the First Order, its modifications allowed Ilum to act as a mobile base and major weapons platform until it was destroyed by the Resistance in desperation after Starkiller's destruction of the Hosnian system. Following the attack, led by Poe Dameron, the planet collapsed into a star that would later be named Solo after the legendary smuggler Han Solo, who died at Ilum."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ilum was a terrestrial astronomical body smaller than a dwarf planet. With a kyber crystalline core and a frigid climate, it was considered a planet despite its size. The planet was situated in the eponymous star system located in a part of the Unknown Regions known as the 7G sector. Ilum was an arctic world; nearly the entire planet was covered in ice and snow, and was therefore inhospitable to most species, though it was populated with non-sentient animals."}, {"tag": "p", "text": "Hidden beneath Ilum's frigid surface was what came to be known as the Crystal Cave. Within the maze-like caves grew kyber crystals, which brought the Jedi Order to Ilum so they could harvest the crystals in a rite of passage known as the Gathering, in which Jedi initiates harvested their crystals by attuning themselves to the Force. As such, Ilum was a holy site for the Jedi Order for centuries."}, {"tag": "p", "text": "Also located beneath the surface of Ilum were geysers, formed by volcanic activity on the planet. These geysers warmed some bodies of water under the ice and their size or duration could change due to volcanic episodes or mineral deposition. Geological formations were also present in the caves of the planet, formed over billions of years by accumulated mineral matter, deposited from hydrothermal fluids."}, {"tag": "p", "text": "By 18 BBY, the Empire had already corrupted Ilum, draining its resources dry as well as having destroyed entire parts of the planet's surface, as they were harvesting kyber crystals; the destruction was visible even from space. When Great Jedi Purge survivor Ahsoka Tano returned to the planet, she noted that there were at least two Star Destroyers and a mining ship in orbit around the planet. Chunks of the planet had been carved away, exposing the rock and magma that boiled up from the planet's core."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Discovery"}, {"tag": "p", "text": "Ilum's recorded history began tens of thousands of years before the Galactic Empire's creation. Soon after the formation of the Jedi Order on Ahch-To, a Jedi scout performed Force-assisted hyperspace navigation through hyperspace routes, taking her to the Unknown Regions. She was drawn to a powerful resonance in the Force, which brought her to Ilum. The scout reported that Ilum was devoid of any sentient life, but was rich with non-sentient animals."}, {"tag": "h3", "text": "Jedi uses"}, {"tag": "p", "text": "Survey teams were sent out later, and ultimately discovered the vast quantity of naturally-forming kyber crystals such as pontite and mephite. The Jedi Order's High Council dispatched scholars, artisans and warriors to secure the planet. The Council decided that the planet should be kept secret to the galaxy at large. Hyperspace surveyors mapped out an uninterrupted hyperspace route from the Core World of Metellos directly to Ilum, and was incredibly complex. Eventually, all mentions of Ilum were deleted and it was kept from local, sector-wide and galactic star maps."}, {"tag": "p", "text": "The Jedi Temple on Ilum remained the last sign of intelligent life on Ilum, but was almost entirely covered by ice. All other bases on Ilum were removed by the Jedi. Ilum became a bigger supplier of kyber crystals when other planets exhausted their supplies."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "As was tradition, a group of Jedi younglings would travel to Ilum to build their first lightsabers, aboard the Crucible and escorted by a higher-ranked Jedi. In 20 BBY, one such Gathering took place in the midst of the Clone Wars. Padawan Ahsoka Tano escorted the younglings Byph, Ganodi, Gungi, Katooni, Petro, and Zatt to the Crystal Cave, where Grand Master Yoda awaited their arrival. Each youngling endured different trials to retrieve their crystals."}, {"tag": "p", "text": "All of the younglings left Ilum aboard the Crucible, where they would be instructed by the architect droid Huyang on the construction of their lightsabers."}, {"tag": "p", "text": "When Order 66 was initiated, the clone troopers of the 481st Legion were deployed to Ilum to eliminate Jedi survivors hiding there."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "A year after the Gathering took place, the Galactic Empire was proclaimed.[source?] Another year later, the Empire laid claim to the Jedi world, discovered from Palpatine-commissioned deep space expeditions of the Unknown Regions using ancient navigational routes found in the Jedi Temple, and quickly occupied and began strip-mining Ilum as part of a large-scale terraforming project; harvesting the small world's abundance of energy-focusing kyber crystals for the focusing arrays of the Death Stars' superlasers, thus revealing magma bubbling from Ilum's core. The entrance to the Jedi Temple was destroyed to allow access to the crystal caves, and a massive mining ship, as well as two Imperial Star Destroyers, stood watch over the planet to gain its riches."}, {"tag": "p", "text": "The Empire's mining effort did not show respect to Ilum as the Jedi had, leaving the world ravaged and making surviving Jedi despair for the loss of many kyber crystals, which no longer sang. Nevertheless, lower concentrations of crystals still existed elsewhere in the galaxy, ready for anyone who was willing to listen for their call. The Empire used geothermal energy from the planet's core to power their machinery and control the internal temperature of their industrial operations. Harmful byproducts were created as a result, causing destruction to Ilum's pristine ecosystem. Eventually, a large industrial equatorial trench, called the Imperial Trench, was realized over the planet as part of Imperial plans, replacing what were gaping cracks that struck into the planet core of kyber."}, {"tag": "p", "text": "After his Master's lightsaber was severely damaged, Padawan Cal Kestis visited Ilum's crystal caves to find a kyber crystal and build a new lightsaber. Although he had problems with the Imperial garrison on the planet, he was successful in his mission and able to escape the planet."}, {"tag": "h3", "text": "First Order superweapon"}, {"tag": "p", "text": "After the Battle of Jakku, some of the Empire's remnants disappeared into the Unknown Regions and reorganized into the First Order. Ilum was chosen to begin development of the Starkiller project by the First Order, and over the 30 year period they continued the excavations started by the Empire, transforming the equatorial trench into Starkiller Base, with the planet's kyber crystalline core serving as the containment field for the Base's superweapon."}, {"tag": "p", "text": "Thirty years after the Battle of Endor, the First Order would use the Starkiller superweapon to destroy the Hosnian system. The Hosnian Cataclysm destroyed the New Republic, and the Resistance, acting on intelligence obtained from Finn, a defected First Order stormtrooper, launched an attack on Starkiller Base in an attempt to destroy the superweapon before it could fire on their base at D'Qar. Ilum was mobilized to the Starkiller Base system, whose star it then drained to recharge its weapon."}, {"tag": "p", "text": "With help from Han Solo, Chewbacca and Finn, who arrived on Ilum to disable the shield protecting the planet, the Resistance was able to destroy the thermal oscillator that prevented the Starkiller superweapon from destabilizing. The destruction of the thermal oscillator caused a chain reaction of explosions across Ilum's surface, and Ilum imploded and exploded, becoming a miniature star which became known as \"Solo.\""}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Ilum was home to few people, with just 5,200 sentient inhabitants. Of those 5,200, 45% were support crew, 30% were temporary researchers, 20% were military, and the remaining 5% were other individuals living on-world. Prior to the fall of the Republic, the planet had no permanent residents."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Ilum's main feature was its Jedi temple, hidden beneath a large cliff of ice. Beneath that temple was the planet's massive complex of crystal caves where a vast quantity of kyber crystals could be found, and the site of the Gathering. The remainder of Ilum's surface was barren, save for canyons and mountains, though there were also ice fields and forests on Ilum's surface."}, {"tag": "p", "text": "During the Cold War between the New Republic and the First Order, Starkiller Base was built into its equatorial trench."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ilum first appeared in Star Wars canon in the sixth episode of the fifth season of the animated television show Star Wars: The Clone Wars, which was titled \"The Gathering\" and aired on November 12, 2012. The planet originated in Star Wars Legends, where it first appeared in the junior novel Jedi Quest: Path to Truth, which was released on September 1, 2001."}, {"tag": "p", "text": "In the 2019 video game Star Wars Jedi: Fallen Order, Ilum is depicted similarly to Starkiller Base. This depiction also appears in the 2017 reference book Star Wars Super Graphic: A Visual Guide to a Galaxy Far, Far Away. Additionally, the book specifies Ilum's diameter to be 660 kilometers, which is the same diameter as Starkiller Base. The connection between Ilum and Starkiller Base was officially confirmed in Star Wars: The Rise of Skywalker: The Visual Dictionary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}