{"url": "Ilum_Temple", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Eastern Ice Shelf locations", "Category:Jedi temples", "Category:Locations of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Ilum Temple"}, {"tag": "p", "text": "The Ilum Temple, also known as the Jedi Temple, was an ancient structure on Ilum constructed by the early Jedi Order as they spread out from Tython and established training grounds across the galaxy. It was selected for its isolation and placed over a massive subterranean network of caves in which the Order's rare lightsaber crystals grew. While the training grounds were eventually abandoned, Ilum's temple served as a mecca for Jedi seeking to construct their very own lightsaber."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Construction"}, {"tag": "p", "text": "During the Jedi Order's formative years circa 22,800 BBY, hyperspace scouts for the Order discovered the frozen world of Ilum and unearthed its hidden treasure trove of crystals, prized for their usage as a focus lens in the Order's symbolic weapon, the lightsaber. As the crystals of Adega were the primary source of crystals previous to the discovery, the kathracite, mephite, and pontite crystals found on Ilum bolstered the Order' stockpiles to these rare formations. The Jedi High Council decided to establish a temple and training center on the inhospitable world, embracing the cold and the isolation the world afforded the Order. In order to keep their solitude undisturbed, the Order kept the hyperlane and the world's coordinates a secret, per Galactic Republic law giving the Order exclusive access to all planetary discoveries."}, {"tag": "h3", "text": "Old Sith Wars"}, {"tag": "p", "text": "Indeed, the route to Ilum was not only treacherous but required Force-sensitivity to navigate; this extremely difficult trek was the first test for students seeking to train on the world. As the training grounds on Ilum saw its heyday in the years preceding the rise of Exar Kun during the Great Hyperspace War, the ravages of war saw the facility downsize considerably. As the number of Jedi stationed on the world dwindled, the Temple was maintained by an honor guard while it received visitors seeking to construct their lightsabers. Treks on Ilum were known to be hazardous throughout history. One of the earliest visitors, Jedi Master Seta-Le, fell through a weak patch of ice into a dark cavern. Having broken her lightsaber during her fall, Seta-Le was able to use her knowledge of the lightsaber's inner workings and apply it to a large crystal formation in the cave. Once activated, the beam created was able to melt through the ice and enable her escape."}, {"tag": "p", "text": "The Temple was threatened once more during the Great Galactic War, a conflict between the resurgent Sith Empire and the Republic. As the Empire swiftly attacked the world, the few Jedi stationed there were overwhelmed and quickly slain. As the Empire began to garrison troops on the world the Temple was made inaccessible and, due to thinly-stretched resources, the Order was unable to reclaim it for over a decade. In 3640 BBY, during the Galactic War, Republic and Imperial forces clashed on the planet. During the Battle of Ilum, Republic and Jedi forces battled Imperial troops in the Temple and defeated Darth Arho."}, {"tag": "p", "text": "Following the destruction of the Sith Empire the Order restored their Temple on Ilum and once more maintained a small group of Jedi on the planet to protect their coveted crystals."}, {"tag": "h3", "text": "Golden Age of the Old Republic"}, {"tag": "p", "text": "During the Golden Age of the Old Republic, the Temple and the caves below were a constant journey point for members of the Order. As the caves only produced blue and green crystals, the Order's members carried weapons that reflected this as Ilum held the largest stockpile of crystals. During the final decades of the Republic, the young Anakin Skywalker, Padawan of Master Obi-Wan Kenobi ventured into the Temple's caves and sought to create his first lightsaber. Like many before him the Force-permeated grottoes induced Force visions or hallucinations, sending him into combat with a manifestation of the mysterious Zabrak Sith Lord his master had killed on Naboo. Upon defeating the manifestation, Skywalker realized his lightsaber was complete and left the Temple with his new weapon."}, {"tag": "p", "text": "Several years later during the Clone Wars, a deadly conflict between the Republic and the Confederacy of Independent Systems, Jedi Master Luminara Unduli led her Padawan Barriss Offee into the Temple to instruct her as she crafted her lightsaber. Upon completion of the ancient ritual the pair were attacked by Confederate probe droids sent to destroy the caves by Count Dooku, the leader of the Separatist movement. During the skirmish, the caves were heavily damaged by bombs placed by the droids and the Master-Padawan team were trapped under rubble. Detecting the disturbance, Grand Master Yoda, leader of the Order, descended upon Ilum and entered the Temple in time to rescue Unduli and her student."}, {"tag": "p", "text": "Following the attack, the Jedi High Council determined that the coordinates to the secret Jedi world were compromised by Dooku, a former member of the Order who had fallen to the dark side of the Force and become a Dark Lord of the Sith. Fearing that the Confederacy would use to caves' treasures against the Order or prohibit Jedi from making new lightsabers, the Council ordered that all crystals be harvested and taken to the Coruscant Jedi Temple for safe keeping. As for the Temple, reconstruction efforts would take a year before it was safe for students to reenter, while all treks were placed on hold."}, {"tag": "h4", "text": "The Gathering"}, {"tag": "p", "text": "In 20 BBY, a group of Jedi Initiates including Petro, Ganodi, Zatt, Byph, Katooni, and Gungi came to collect their Lightsaber crystals for the construction of their Lightsabers."}, {"tag": "h3", "text": "Rise of the Empire"}, {"tag": "p", "text": "When the war concluded with the overthrow of the Galactic Republic and the dissolution of the Jedi Order, the newly-formed Galactic Empire took control of the coordinates to Ilum. Several Jedi found their way back to Ilum, assuming it would be safe and hiding in the Temple's caves. Among the survivors were Masters Fy-Tor-Ana and Garen Muln; Master Ana soon departed for Coruscant while Muln wasted away inside the caverns. Within months of the start of the Great Jedi Purge, former Jedi Padawan Ferus Olin went searching the caves and discovered Muln ill and near-death. Rescuing the Jedi Master, Olin escaped offworld before the Imperials secretly stationed on the world were able to reach the fugitive Jedi."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Constructed in the icy face of one of Ilum's frozen mountain cliffs, the Jedi Temple was snow-covered and bare. The vast entrance was hidden behind large sheets of ice which adhered to the Temple facade after long periods of disuse. Large transparisteel windows let in the pale light from the snow-swept world, illuminating the cave-like interior of the Temple. Inside the main tower of the Temple, the Jedi Order carved long elegant pillars into the circular chambers high walls, and adorned the room with tall statues of Jedi. Along the upper walls of the chamber, circular windows could be opened to allow in natural light using the Force. When the light shined through, it refracted through a series of massive crystals suspended in the chamber and when focused with the Force, would melt the ice which formed over the entrance to the Crystal Caves. This crystal array was originally used by the trapped Jedi Master Seta-Le several millennia before the rise of the Galactic Empire. When melted, the ice wall ran down like a waterfall to reveal the massive gates leading into the darkness. Beyond, tall and slender black rock formations stood like pillars in the main hall; embedded in each were hundreds of small crystals that appeared to shimmer in the dim light. Spiraling ramps stretched into the darkness of the place, leading to seldom used rooms and construction galleries."}, {"tag": "p", "text": "Deep within the heart of the Temple were other paths into the caves, caverns made of natural shiny black stone; a rock that swallowed light instead of reflecting it. As time progressed and the Jedi Order grew, the many Jedi that visited the cave recorded their histories on its walls, expansive cave etchings that seemed to come to life during the Force-induced hallucinations many Jedi were known to succumb to while constructing their weapons. The caves of the Temple held many secrets such as a hidden entrance that led into the subterranean grottoes. During the later centuries gorgodons began to nest in this area, making the entrance more of a hazard then a shortcut."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}