{"url": "An_Apology", "categories": ["Category:Real-world articles", "Category:Legends short stories"], "nodes": [{"tag": "h1", "text": "An Apology"}, {"tag": "p", "text": "\"An Apology\" is a non-canon short story published on and for April Fools' Day by Random House's genre site, Suvudu. It was authored by Timothy Zahn. The story was presented as an epilogue to the Fate of the Jedi book series, written by Luke Skywalker's clone Luuke Skywalker from a first-person, in-universe perspective."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Fate of the Jedi: Apocalypse, the ninth and final chapter in the epic nine-book series Star Wars: Fate of the Jedi, was published just a few weeks ago. The book debuted at #2 on the New York Times bestseller list and has been entertaining Star Wars readers for weeks. The one question on all of the readers minds is: \"What comes next?\""}, {"tag": "p", "text": "Well, faithful readers, we are finally able to reveal our plans. This isn't just some thrown-together plot that will connect the novels to the Legacy comics. No, this story has been in the works since almost the birth of the Expanded Universe. For decades now the editors at Lucasfilm, Bantam, Del Rey, and the authors have been carefully constructing and building this next chapter. Laying the groundwork and building the foundation for what we hope will be the most epicly epic Star Wars adventure ever."}, {"tag": "p", "text": "An adventure so epic in its epicness can't simply be revealed with a blog post telling you what we're going to do. No, our friends and fellow readers, an epic adventure like this must begin with an author's touch. There was only one man who could light this torch and launch us into the future…the man who gave birth to the Expanded Universe and set in motion the story we can finally tell. We present to you the Fate of the Jedi Epilogue, \"An Apology,\" written by New York Times bestselling author Timothy Zahn."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Luuke Skywalker laments the direction the galaxy has taken since Mara Jade accidentally killed Luke Skywalker in his place at Mount Tantiss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}