{"url": "Ilwizzt", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Ilwizzt", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Ilwizzt"}, {"tag": "p", "text": "The Ilwizzt were a sentient species with mahogany skin and a prominent trunk. That trunk flared and vibrated when they spoke. Brco was an Ilwizzt who attained the rank of major in the G'rho Defense Force. He was in charge in 1 BBY when a Ssi-ruuvi strike-force invaded the Wild Space planet. Despite ordering G'rho's Conjo fighters to attack the invaders, Brco and virtually all the other colonists were captured by the Ssi-ruuk."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Ilwizzt were a sentient species with mahogany skin. Their most prominent facial feature was a trunk, which had two nostrils at its end that flared when Ilwizzt spoke with emotion. The flexible trunk moved when Ilwizzt spoke, often thrusting toward the partner in the conversation. The Ilwizzt were able to speak Galactic Basic Standard through their trunks, but did so with a buzzing accent."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ilwizzt were present in the galaxy in the final years of the Galactic Empire. The Ilwizzt Brco lived on the planet G'rho, a barren and sparsely settled Chandrilan colony located in Wild Space. Although considered stodgy by some of the locals, Brco attained the rank of major in the G'rho Defense Force. The Defense Force was located near Boku Settlement, the sole residential center on the planet, and from there Brco coordinated the G'rho militia, which consisted of one system patrol vessel and three squadrons of atmospheric Conjo fighters."}, {"tag": "p", "text": "Brco was in command when Boku Settlement was raided by the Ssi-ruuvi Imperium in 2 BBY. The Imperium was composed of the reptilian Ssi-ruuk and was located within a globular star cluster in Wild Space. After a failed attempt at communication with the invaders, Brco ordered his Conjo fighters to attack; however, these squadrons were insufficient to stop the Ssi-ruuvi forces. They attacked the Ilwizzt's office with gas grenades to knock out its inhabitants. Brco barely had time to order an evacuation of his office before the gas took effect. Despite the Ilwizzt's efforts, the Ssi-ruuk conquered G'rho. Notwithstanding a brief resistance of a few dozen colonists, virtually all of the planet's colonists were enteched—a process by which a sentient's life energy was absorbed into battery coils—by the Ssi-ruuk. The raid was later reported by Imperial HoloVision on 32:4:2, but it was attributed to the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ilwizzt were mentioned in The Truce at Bakura Sourcebook, a West End Games sourcebook published in 1996. They were created by Kathy Tyers, who also wrote the novel The Truce at Bakura, which the sourcebook was written to complement."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}