{"url": "Ima-Gun_Di/Legends", "categories": ["Category:Legends articles", "Category:Jedi Generals", "Category:Kajain'sa'Nikto", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Ima-Gun Di"}, {"tag": "p", "text": "Ima-Gun Di was a male Kajain'sa'Nikto Jedi Master who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Kajain'sa'Nikto, Ima-Gun Di was a Jedi Master in the Jedi Order. In 22 BBY, during the Clone Wars, Di was assigned to fight under the command of Master Mace Windu on the planet of Ryloth. Alongside local militia leader Cham Syndulla, Master Di fought on the ground against the droid army as Wat Tambor led an invasion of the Twi'lek homeworld. Commanding troopers of the Republic Navy, Di and Admiral Dao were wearisomely low on supplies as the battle raged continuously. Contacting Coruscant, the Jedi asked for reinforcements, looking to Senator Bail Organa and his diplomatic ties to open up supply lines. Organa pleaded with the King of Toydaria to send aid, and while he was successful, help would come too late for Master Di."}, {"tag": "p", "text": "Planting explosives in a canyon wall to seal off access points that the droid army could exploit, Master Di and his men prepared for a last stand in the bottle neck canyon they allowed to remain open. As the droids made their way around into the canyon, the surviving Twi'leks were able to escape the valley without interception. Protecting their flank, Master Di stood side-by-side with Captain Keeli and the other surviving clones as the droids marched through the canyon. As clones fell around them Di and Keeli were the last men standing amongst the sea of droids. As Keeli fell, Di continued to fight valiantly, but was inevitably killed as the droids closed in on him, sustaining five direct blaster bolts to the chest before succumbing. Despite his end, his sacrifice was not in vain, as the Twi'leks managed to escape and received aid from the Republic before overthrowing the Separatist occupation leaders."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Di was a Kajain'sa'Nikto male with orange skin and blue eyes. During the Battle of Ryloth, he had full faith in the Republic, believing that they would deliver reinforcements and aid even without any communications to confirm it. When they did not, he understood the anger of Syndulla. He was willing to sacrifice himself and his clone troopers in order to allow the Twi'lek Resistance and their families to escape. In his last moments, Di and Keeli held out alone, trying to make their last moments memorable ones. The Jedi was greatly pleased to hear that supplies had arrived, dying in the knowledge that his sacrifice to save the Twi'leks had not been in vain."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Master Di, like many other Jedi, became a Jedi General when the Clone Wars started, soon gaining respect amongst the Republic due to his tactical brilliance."}, {"tag": "p", "text": "During the Battle of Ryloth, Master Di displayed his great aptitude for military strategy when planning his troops last stand against the Separatist droids. A former lightsaber instructor, Master Di was an accomplished duelist, and one of the few swordmasters to focus exclusively on the more duel-centric techniques, much like former Jedi Master, Count Dooku. Di was a highly proficient master of Form V: the Djem So variant, utilizing it during his final battle against the Separatists, proving capable of deflecting innumerable amounts of blaster bolts, despite being severely injured; although his dedication to the single-combat martial skills proved his downfall, and subsequently, Di was overwhelmed by the sheer number of droids."}, {"tag": "p", "text": "Master Di was also experienced in the use of Force Push, demonstrating it during his last stand."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In a CartoonNetwork.com exclusive, Dave Filoni revealed that Ima-Gun's name was designed to sound like the phrase \"I'm a-Gon' Die\" (I'm gonna die), which reflects his fate. Di was voiced by Robin Atkin Downes, who also voiced Cham Syndulla in the same episode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}