{"url": "Imberlin_sector", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Expansion Region sectors", "Category:Imberlin sector", "Category:The Slice sectors"], "nodes": [{"tag": "h1", "text": "Imberlin sector"}, {"tag": "p", "text": "The Imberlin sector was a part of the Expansion Region. It contained the Imberlin, Silorna, and Zaraksander systems, and the Gamor Run hyperlane passed through the sector. At various points, the military of the Trade Federation and forces of the extragalactic Nagai, Tof, and Yuuzhan Vong species all traveled along the section of the Gamor Run running through the Imberlin sector."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Imberlin sector was located in the Slice portion of the Expansion Region. By 0 ABY, the Imberlin sector bordered the Hilo and Sepan sectors Coreward, the Dimean sector spinward, and the Charra sector in the trailing direction. Rimward, the Imberlin sector also formed a three-way border with the Mid Rim's Fei Hu and Sloo sectors. The Imberlin sector contained the Imberlin, Silorna, and Zaraksander systems. The hyperlane known as the Gamor Run traveled through the sector, connecting the Charra system in the Charra sector to the Fei Hu sector's Aikhibba system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 32 BBY, while preparing for its upcoming blockade of the planet Naboo, the Trade Federation moved its armed forces along the section of the Gamor Run passing through the Imberlin sector on their way to the Trade Federation distribution center on the Mid Rim world of Enarc. While moving spinward as part of secondary movements of their separate invasions of the galaxy in 4 ABY, the forces of the extragalactic Nagai and Tof species traveled along the same section of the Gamor Run. Between 25 ABY and 26 ABY, after conquering the Daalang system as part of their invasion of the galaxy, the extragalactic Yuuzhan Vong also advanced along the portion of the Gamor Run running through the Imberlin sector before attacking the Osarian and Tynnani systems."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Silorna system was the origin point of the type of crystal known as the Silorna Force Crystal. At some point by 2 ABY, an independent trader ran afoul of Imperial authorities in the Imberlin system. The Gand findsman Lu'daal-ud subsequently captured the trader."}, {"tag": "p", "text": "The Zaraksander system contained the terrestrial astronomical object of the same name. During the Galactic Civil War, the company Eloinie Petro-Munitions was based on Zaraksander. The bounty hunter Valken Gresh visited the celestial body's Fioer desert on two separate occasions and later recorded the experience in the work Great Hunts I've Lived To Tell About."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imberlin sector was introduced in the StarWars.com Online Companion to the 2009 reference book The Essential Atlas, which was written by Daniel Wallace and Jason Fry. In 2012, the Imberlin sector was illustrated on a map designed by Modi and published in the Online Companion feature \"Essential Atlas Extra: Expansion Region.\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}