{"url": "Imar_Deez", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Jedi of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Imar Deez"}, {"tag": "p", "text": "Imar Deez was a Jedi who lived around the time preceding the Great Hyperspace War. While serving in the Jedi Order, Deez taught the Human Relin Druur how to use the Force to shield himself from the effects of the dark side, a technique Druur later passed on to other Force-sensitives."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Imar Deez was a Force-sensitive being who lived during the time prior to the outbreak of the Great Hyperspace War in 5000 BBY. As a member of the Jedi Order, Deez trained in the ways of the Jedi and also taught the Human Jedi Relin Druur sometime before 5,000 BBY. As one of the first techniques that Druur learned as a Jedi, Deez taught him how to use the Force to shield himself from the effects of the dark side by imagining in his mind an impenetrable fortress, of which the walls were the Force and he was the keep."}, {"tag": "p", "text": "Druur eventually became a Jedi Master, and he passed on the lesson that he had learned from Deez to his own Padawan, Drev Hassin. Later, after accidentally traveling through time to 41 ABY, Druur recalled learning the power from Deez as he taught it to the Cerean Marr Idi-Shael, so that Idi-Shael could resist the nauseating effects of Lignan, a powerful dark side ore."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Imar Deez was a Force-sensitive who was accepted into the Jedi Order and trained in the ways of the Jedi. Deez was able to use the Force to barricade the effects of the dark side of the Force on one's mind."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Imar Deez was first mentioned in passing in Paul S. Kemp's debut Star Wars novel, Crosscurrent, released on January 26, 2010. As Crosscurrent specified only that Deez taught Druur the shielding technique, whether or not Druur was officially apprenticed to Deez is ambiguous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}