{"url": "Imarrra", "categories": ["Category:Legends articles", "Category:Females", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Imarrra"}, {"tag": "p", "text": "Imarrra was a female Wookiee that lived during the Galactic Civil War. She was an expert on surviving the wilderness of Kashyyyk and worked as an informant for Queen Kylantha of Naboo."}, {"tag": "p", "text": "1.5 years ABY, Kylantha asked Imarrra and her friends Drrlirm and Orrekazzapirr to travel to their home world Kashyyyk and investigate the news that the Imperial force stationed on the planet was assisting the Trandoshan slavers. On Kashyyyk, Imarrra and her friends tried to investigate the Trandoshans' slaving operations in one of their camps near Kachirho, but were ambushed and overpowered. Imarra and Orrekazzapirr were captured and brought to the slaver camp. Soon after, the Trandoshans sold them to the Empire who shipped them to their prison facility on Dathomir. The Empire didn't want anyone to know about their involvement in the Trandoshans' slaving operations on Kashyyyk."}, {"tag": "p", "text": "Imarra and Orrekazzapirr were lucky, as queen Kylantha grew worried when she didn't receive any news from them and asked an experienced adventurer to investigate. The adventurer found the wounded Drrlirm in the jungles and eventually found out about their imprisonment on Dathomir. After the pilot had managed to sneak through the Imperial blockade around the planet and landed on the planet, the spacer managed to infiltrate the prison facility and help Imarra and Orrekazzapirr escape. Imarra knew the location of an old Alliance hideout on the planet where an old ship was stored. The two Wookiees managed to make their way to the hangar and used the old ARC-170 starfighter to leave the planet. With Imarra at the controls and Orrekazzapirr on the gunner's seat, the two met up with the spacer's starship. Together they managed to punch a hole in the Imperial blockade and escape to Naboo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Imarrra was a Non-Player Character (NPC) in Rage of the Wookiees, the second expansion for Sony Online Entertainment's MMORPG Star Wars Galaxies prior to its closure on December 15, 2011. During the quest To the Queen's Aid the player was sent to Kashyyyk to search for the missing Wookiees. Eventually the player discovered that Imarra and Orrekazzapirr were imprisoned on Dathomir and had to meet them inside the prison. Then, the player had to escort them out of the prison, where they split up. The next part of the mission took place in space above Dathomir and involved destroying several Imperial starfighters before the the quest was completed."}, {"tag": "h2", "text": "Appearances"}]}