{"url": "An_Imperial_Feast", "categories": ["Category:Real-world articles", "Category:Star Wars: Forces of Destiny episodes"], "nodes": [{"tag": "h1", "text": "An Imperial Feast"}, {"tag": "p", "text": "\"An Imperial Feast\" is the fourteenth episode of the first season of the animated micro-series Star Wars: Forces of Destiny. It was first released as part of the first special on October 29, 2017 and it was released on Youtube on October 30."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Leia orders Han to bargain with fellow pilot Hera Syndulla for rations that hungry Ewoks might enjoy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the Battle of Endor, the Ewoks are preparing for a feast. They have gathered various fruits, vegetables, and carbohydrates. The Ewoks have also gathered several captured Imperial stormtroopers to cook for their feast. A gleeful Han Solo and Chewbacca are watching and decide not to intervene. They are interrupted by a displeased Princess Leia Organa, who chastises them for letting the Ewoks cook the enemy. Han responds that he and Chewbacca have just arrived. When Leia asks if he is going to stop the Ewoks, Han says \"off-course and maybe.\""}, {"tag": "p", "text": "While Han is unwilling to intervene, Leia tells one of the Ewoks that they must let the Imperials go and treat the enemy fairly. The Ewok responds by striking a stormtrooper with his ladle. Leia stops the Ewok and tells Han and Chewbacca that the Ewoks are clearly hungry. She tells Han and Chewie to go to General Syndulla's camp and obtain a crate of ration sticks to placate the Ewoks and save the stormtroopers' lives. Leia stays behind to keep the stormtroopers safe. A sulky Han reluctantly accedes to Leia's request."}, {"tag": "p", "text": "Hera's starship Ghost and Solo's Millennium Falcon are parked beside each other in a forest clearing. Accompanied by R2-D2 and Chewbacca, Han visits Hera who is unloading supplies from the Ghost. Chopper is also present. Han tells Hera that he needs snacks for the \"little furballs\" and explains that they need ration sticks to stop the Ewoks from cooking stormtroopers. Hera agrees to give him the ration sticks provided if he says that the Ghost is a superior ship to the Falcon. Han swallows his pride to placate General Syndulla and Leia Organa."}, {"tag": "p", "text": "Satisfied, General Syndulla allows him to take the rations. Chewie helps himself to a ration stick while R2-D2 and Chopper beep at each other. Han slaps the ration stick out of Chewbacca's hand. Back at the Ewok camp, Leia is involved in a \"tug of war\" with an Ewok, who is trying to roast a stormtrooper alive. Han, Chewie and R2-D2 arrive just in time with crates of ration sticks. The Ewoks gratefully accept the ration sticks. Leia is pleased with the outcome and credits General Syndulla for saving the day. When Han asks about his contribution, Leia jokes that nobody believes the Ghost is a superior ship to the Falcon. Han is relieved and tells Leia that she doesn't need to tell him that."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}