{"url": "An_Incident_Report", "categories": ["Category:Real-world articles", "Category:From a Certain Point of View"], "nodes": [{"tag": "h1", "text": "An Incident Report"}, {"tag": "p", "text": "\"An Incident Report\" is a short story in the anthology From a Certain Point of View. The story, written by Daniel M. Lavery, focuses on the point of view of Conan Antonio Motti."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "This short story is a report written from the point of view of Admiral Conan Antonio Motti, the Chief of the Imperial Navy, after he was Force choked by Darth Vader for mocking his religious beliefs in the Force. A day after the morning briefing, Admiral Motti writes that Darth Vader did not have the right to assault him. While willing to submit himself to discipline, Motti believes that he did nothing wrong in stating that the Imperial Navy is a military organization that has a right to place the majority of their hopes on the Death Star, which he regards as technological marvel. Motti adds that the Death Star is the pride of the Imperial Navy and should be put to use quickly."}, {"tag": "p", "text": "Motti writes that he has no objection to Lord Vader's beliefs and states that he is willing to work with Darth Vader. Motti also insists that he is no bigot and takes pride in the fact that his native Seswenna sector is home to over 300 distinct religious traditions with active practitioners. Motti claims that he is a man of faith who believes that Imperial unit can only be strengthened through cooperative and constructive dialogue among its citizens. Motti states that he is willing to learn more about Lord Vader's understanding of the Force, and how it enriches his daily life."}, {"tag": "p", "text": "However, Motti writes that he does not welcome Lord Vader \"literally attempting to shove his religious beliefs down his throat.\" He adds that he will not apologize for asking Lord Vader to refrain from injecting religion into the conversation nor will he apologize for attempting to give credit to the men and women who built the Death Star. Motti tells the reader that if he reviewed the footage, they would have noticed two things. First, he claims that Lord Vader expressed open contempt for the Death Star project in front of his subordinates, many of whom had dedicated their lives to the station. Unlike Vader, Motti is confident in the Death Star's power and views Vader's skepticism as \"workplace proselytization.\""}, {"tag": "p", "text": "Second, Motti states that the footage conclusively proves that Vader Force choked him. Turning his attention to the other Joint Chiefs, Motti disparages Commander Cassio Tagge for his allegedly myopic view of the Rebel Alliance's threat to the Empire. Motti claims that the ragtag insurgents do not pose a threat to the Empire. Motti also claims that Tagge questioning the Emperor's decision to dissolve the Imperial Senate indicates a lack of fitness for command."}, {"tag": "p", "text": "Motti then argues that the theft of the Death Star plans does not pose a threat to the Empire, claiming that the rebels have to wade through a huge amount of blueprints of every Imperial Star Destroyer, governor's mansion, Imperial Palace, and naval shipyard. Motti then takes the opportunity to attack Vader's faith in the Force by claiming that it has not yielded the recover of the stolen data tapes. Motti writes that he found Vader's lack of faith in the military installation disturbing. Motti then reassures the reader that the Death Star is fully operational and has destroyed Alderaan. He places his faith in the weapon's awesome firepower and mocks Lord Vader's \"precious Force.\""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In the original edition of From a Certain Point of View, Motti listed the officers present in the conference room with him as \"Vice Admiral Tallatz, Rear Admiral Tiaan Jerjerrod, Kendal Ozzel, Commander Cassio Tagge, Admiral Nils Tenant, and myself.\""}, {"tag": "p", "text": "Although this list closely mirrors that of the Joint Chiefs in James Luceno's novel Tarkin and includes a character from the short story \"Orientation,\" it does not match the characters actually seen in Star Wars: Episode IV A New Hope."}, {"tag": "p", "text": "However, the latest digital edition of the story has a different list: \"Chief Moradmin Bast, Colonel Wulff Yularen, Chief Siward Cass, General Trech Molock, General Hurst Romodi, Commander Cassio Tagge, and myself.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}