{"url": "Imperial_Academy_of_Mandalore", "categories": ["Category:Canon articles", "Category:Accuracy disputes", "Category:Articles to be expanded", "Category:Imperial Academies", "Category:Sundari locations"], "nodes": [{"tag": "h1", "text": "Imperial Academy of Mandalore"}, {"tag": "p", "text": "The Imperial Academy of Mandalore, also known as the Mandalorian Imperial Academy and formerly known as the Royal Academy of Government, was an Imperial Academy located in Mandalore's capital city of Sundari."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in Mandalore's capital city of Sundari, the Royal Academy of Government was originally an institution that groomed the best and brightest of Mandalorian youth to help steer the planet's future in leadership positions. However, after it was transformed into the Imperial Academy of Mandalore, the school instead taught cadets about combat techniques, weapons technology and repair, and explosives to prepare them for service in the Imperial Military. The academy also had espionage training, attached to which was a unit that taught other languages, including Aqualish and Huttese. Aurebesh, the written form of Galactic Basic Standard, and Mandalorian, the written form of Mando'a, the spoken language of the Mandalorian people, were both used within the academy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "As the Royal Academy of Government"}, {"tag": "p", "text": "During the Clone Wars, a series of conflicts fought between the Galactic Republic and the breakaway Confederacy of Independent Systems, Korkie Kryze, the nephew of New Mandalorian ruler Duchess Satine Kryze, attended the Royal Academy of Government along with his friends Amis, Lagos, and Soniee. At the behest of Duchess Satine, the Jedi High Council sent Jedi Padawan Ahsoka Tano to Mandalore to aid her in exposing corruption in the Mandalorian government, under the guise of instructing cadets at the academy. The young Kryze and his friends, with Tano's assistance, worked to expose Mandalorian Prime Minister Almec's involvement in the black market."}, {"tag": "h3", "text": "As the Imperial Academy of Mandalore"}, {"tag": "p", "text": "After the Clone War's conclusion, the Galactic Empire seized control of Mandalore and transformed the Royal Academy into the Imperial Academy of Mandalore. A star pupil, the Mandalorian Sabine Wren studied the tactics used by Twi'lek freedom fighter Cham Syndulla and Mandalorian Protector leader Fenn Rau used during the Clone Wars and learned that the Empire was developing a new cruiser with gravity well projectors powerful enough to pull a ship out of hyperspace. She was also the fastest cadet to complete the language unit during espionage training. During her time at the academy, Wren encountered a number of Imperial officials that she felt enjoyed being arrogant, comparing them unfavorably with the Lothal Academy's Commandant Cumberlayne Aresko. However, her trusting the Empire and following its orders blindly led to a nightmarish experience that caused Wren to abandon the academy and become a bounty hunter, eventually joining a group of rebels who operated on the planet Lothal."}, {"tag": "h2", "text": "Faculty and staff"}, {"tag": "h2", "text": "Cadets and alumni"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}