{"url": "Imperial_Academy", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Imperial Academies"], "nodes": [{"tag": "h1", "text": "Imperial Academy"}, {"tag": "p", "text": "An Imperial Academy was a military training program run by the Galactic Empire, and primarily focused on training both the enlisted and officer corps of the Imperial Military."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "With the rise of the First Galactic Empire, the massive task of the reorganization, transformation and homogenization of the Republic military training complexes commenced. With the former Republic lacking an institutionalized military force, many regions, sectors, and systems relied on independent training standards of varying scope and tradition to protect their own, localized interests. Occupying much of the Empire's early political focus, Galactic Emperor Palpatine would oversee the absorption of Republic-era military schools four years after the end of the Clone Wars, inviting Commandant Baylo of the Defiance Flight Training Institute, along with other senior officials including the last naval chief of the Galactic Republic, Vice Admiral Tallatz, to discuss the consolidation."}, {"tag": "p", "text": "With the gradual shift of the Imperial armed forces towards non-clone recruits and voluntary citizens, regional governors revamped current training curriculum with rigidly standardized programs. The flags, swords, and other regalia of tradition were replaced with the uniform look of the stormtrooper."}, {"tag": "h3", "text": "Serving the Empire"}, {"tag": "p", "text": "Despite commanding a galaxy-wide Empire, getting into the Academies was very difficult, especially for people from former Separatist worlds. Thane Kyrell and Ciena Ree found themselves very lucky to both be accepted into the Royal Imperial Academy on Coruscant, having spent their entire childhood training for such a career. In fact, while Inner Rim worlds often fielded thousands of candidates for the Imperial Academies, the Empire strictly limited slots for citizens from former Separatist worlds. As the Empire expanded its authority into Outer Rim systems, it altered its language to appeal to new recruits. The lawlessness of the Outer Rim and victimization of remote settlers by the former Republic and criminal elements gave the Empire's offer of retribution and power an appeal to those who felt they lacked control over their own lives."}, {"tag": "p", "text": "During the Empire's reign, not all academies were considered to be equal, with cadets produced from the Academy for Young Imperials, among others, considered \"inferior\" to those trained elsewhere. As a result, the Arkanis Academy's Commandant Brendol Hux would form a secret society known as the Commandant's Cadets, whose goal was to train a new generation of stormtroopers who would be loyal to the Empire from birth. Hux's belief in natural selection led him to kill a number of \"unworthy cadets.\" Hux's ruthless tactics and attempts to create a command structure independent of the Empire alarmed Grand Moff Wilhuff Tarkin, who dispatched Lieutenant Chiron to investigate in 4 BBY."}, {"tag": "p", "text": "With the destruction of the First Death Star, many officers and cadets were pulled out of training to fill the vacuum left by the station's destruction, with the Imperial command hierarchy left in temporary disarray. Many Imperial Academy graduates would see action during the Galactic Civil War. Following the Battle of Endor and the destruction of the DS-2 Death Star II Mobile Battle Station, much of the Empire's top military officials and veteran stormtroopers were killed, resulting in the overall deterioration of Imperial martial forces stationed across the galaxy. Cadets pulled early from training often found themselves on the front lines fighting a war they lacked the will to carry on, resulting in a high number of military desertions to the New Republic. Imperial Academies such as on Uyter often found themselves caught up in the galactic struggle, often being destroyed by advancing Republic troops."}, {"tag": "h3", "text": "Dissolution and legacy"}, {"tag": "p", "text": "With the signing of the Galactic Concordance roughly a year after Endor, the Empire agreed to a total surrender. Along with war reparations and a host of other conditions, the treaty also stipulated the banning on the recruitment and mobilization of stormtrooper forces, along with the abandonment of all Imperial Academy complexes."}, {"tag": "p", "text": "The former Arkanis Academy Commandant Brendol would ultimately flee to the Unknown Regions following its surrender along with much of the Empire's political hardliners, where they would form the Empire's successor state, the First Order. With officers more receptive to his ideas of training regimen, his son General Armitage Hux would continue on the ideas of Brendol well into the future. Along with increasing the operational effectiveness of the First Order's troops, Hux would seek to solve the inconsistent Academy standards of the Old Empire, which often resulted in troops of varying skill and competency."}, {"tag": "p", "text": "The New Republic also created a network of military academies including the New Academy on Chandrila, the Ganthel military academy, and the Hosnian Prime flight academy. At least one Centrist politician regarded the New Republic's academies as a poor imitation of the Imperial Academies. By 28 ABY, the study programs at the old Imperial Academies were being reintegrated into the academies on Centrist worlds."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The main campus of the Imperial Academy, the Royal Imperial Academy, was located on Coruscant. Other academies were located on Lothal, Mandalore, Arkanis, Carida, Uyter, and Prefsbelt. Some planets like the Outer Rim world of Lothal had several regional academies including the Academy for Young Imperials and the Pretor Flats Academy."}, {"tag": "p", "text": "There were three types of academies. One-year junior academies were used to prepare teenage cadets for further training at senior academies. After senior academies, the most talented cadets would enter a specialized service academy for officer training with either the Imperial Army, the Imperial Navy or the Stormtrooper Corps. Lothal's Academy for Young Imperials was an example of a junior academy. Some known senior academies were the Arkanis Academy and the Marleyvane Academy. The Raithal and Corulag academies were regarded as specialized officer-training academies. Some trainees however, would not pursue an advanced education, instead retiring to their everyday lives after completion of their one-year junior academy. Skystrike Academy was an elite pilot school located on Montross. Some academies began training cadets as young as 13 standard years of age."}, {"tag": "p", "text": "While the Imperial Academy focused on military-based training for future servicemen and women, COMPNOR's Sub-Adult Group allowed youths an alternate path to traditional Academy enrollment. Rather than becoming armed soldiers, members of the SAGroup were trained to become able-bodied administrators and bureaucrats."}, {"tag": "p", "text": "Classes in the Royal Academy could include Core Worlds Classical Culture, Security Protocols and Interrogation Techniques, Large Vessel Design, and Amphibious Battle Tactics, along with training in flight simulators. Students were not only expected to remain in peak physical condition, but also learn battle tactics and the finer points of what it took to be an Imperial citizen. The pro-Imperial Current Events class sought to promote a positive view of the Empire to cadets. While the Academy was noted for its rigorous academic programs, a high emphasis on competitive sports also existed—at least within junior academies—and had cadets complete an obstacle course known only as the Well, where ingenuity and courage were key tenants to success."}, {"tag": "p", "text": "The Office of Student Outcomes also existed as part of the bureaucracy of the Imperial Academy, and was tasked with finding ways to push students to their mental and physical limits. Students that exhibited Force-sensitivity would be sent to the Empire's clandestine Project Harvester operation, while those that simply resisted Imperial efforts at indoctrination could be enrolled in Project Unity, which could render the individual completely loyal to the ideals of the New Order through a combination of psychological manipulation and pharmaceutical drugs."}, {"tag": "p", "text": "Upon graduation, officers were enlisted as lieutenants and given their first assignment abroad after a brief graduation ceremony. Top cadets at the Royal Academy could attend a ball at the Imperial Palace, and spark contacts with high-ranking members of Imperial society. It was highly discouraged to take recreational time off, with most members remaining in service until they hit the mandatory retirement age, or died."}, {"tag": "h2", "text": "Notable students"}, {"tag": "p", "text": "Sabine Wren and Ketsu Onyo both attended the Academy on Mandalore before fleeing to become bounty hunters. Sabine's Ghost crewmmate Ezra Bridger attended the Academy for Young Imperials on Lothal as part of an undercover assignment, befriending Zare Leonis and Jai Kell while there. Wedge Antilles and Hobbie were cadets at the Skystrike Academy before defecting to the rebellion."}, {"tag": "p", "text": "Biggs Darklighter joined the Imperial Academy, but defected to the Alliance to Restore the Republic after graduation. His close friend, Luke Skywalker, also longed to join the Imperial Academy and live a star-faring life, but his uncle, Owen Lars, forbade it. Pol Andrissus and his classmate Carver also attended an Imperial Academy but too defected to the Alliance after entering Imperial service and eventually became sergeants in the Alliance's 61st Mobile Infantry."}, {"tag": "p", "text": "Other known Imperial cadets included the Wild Spacer Eli Vanto, who studied at the Myomar Academy, before transferring to the prestigious Royal Imperial Academy during the last three months of his studies. His friend was the Chiss soldier Mitth'raw'nuruodo, who studied at the Royal Imperial Academy for three months as part of an Imperial orientation course. Vanto later became a Commander while Thrawn rose to the position of Grand Admiral; a high achievement for an alien."}, {"tag": "p", "text": "The Jelucani cadets Thane Kyrell and Ciena Ree also studied at the Royal Imperial Academy; a high achievement for two residents of a former Separatist world. Their friends included the Alderaanian Nash Windrider, Jude Edivon of Cloud City, and Kendy Idele of Iloh. All five cadets were tested by the destruction of Alderaan. While Ciena, Nash, and Jude remained loyal to the Empire during the Galactic Civil War, Thane and Kendy defected to the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}