{"url": "Imperial_Aquatic_Garrison", "categories": ["Category:Legends articles", "Category:Imperial garrisons"], "nodes": [{"tag": "h1", "text": "Imperial Aquatic Garrison"}, {"tag": "p", "text": "The Imperial Aquatic Garrison was an Imperial IM-455 modular garrison 200 km southeast of Fitsay, on the water-world planet of Sedri."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It looked exactly like a typical Imperial Garrison base, except that the lower level was under water instead of being underground. It used the basic design of the modular garrison but had modifications for use in a water environment."}, {"tag": "p", "text": "The garrison was surrounded by a nearly invisible underwater energy fence; probe droids and proximity mines were also deployed inside the fence."}, {"tag": "p", "text": "A flotation collar around the base kept the garrison atop the waves, however the garrison was anchored to the sea floor by tractor beam projectors to prevent drift and stabilize the entire structure."}, {"tag": "p", "text": "The doors opened to the ocean to launch ships from vehicle bay, but underwater launch ports were also available."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The structure itself was the typical water-world base, but the Sedri garrison was under construction. It was also understaffed, getting to Sedri was hazardous until the Golden Sun was destroyed, thus the base had less than 250 people instead of 3000."}, {"tag": "p", "text": "Among other personnel and vehicles, the Sedri garrison had 50 stormtroopers, 30 seatroopers, 15 waveskimmers, 3 wavespeeders, 1 AT-AT Swimmer, 10 TIE Fighters and 2 TIE fighter boats."}, {"tag": "p", "text": "The Empire lost interest in the planet months after the vanishing of the Golden Sun, abandoning the garrison. Due to the lack of maintenance, the garrison was expected to sink within a year."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The backcover of Battle for the Golden Sun names it Imperial Sea Garrison, but it is called Imperial Aquatic Garrison elsewhere."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}