{"url": "Imperial_Armory_Complex", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Capital City locations"], "nodes": [{"tag": "h1", "text": "Imperial Armory Complex"}, {"tag": "p", "text": "The Imperial Armory Complex, also known as the Lothal Imperial Factory, was a factory built into the planet Lothal's Imperial Complex that produced a variety of vehicles for the Imperial Military, including speeder bikes, starfighters, and walkers. The TIE/d \"Defender\" Multi-Role Starfighter entered production at the factory, leading the Empire to consider it their most important facility in the region. Phoenix Cell was preparing to attack the Imperial Armory Complex and halt production of the new TIE/Ds, but was prevented from doing so when Grand Admiral Thrawn learned of their plans and launched an assault on their base on Atollon."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Housed in Lothal's Imperial Complex, the Imperial Armory Complex, also known as the Lothal Imperial Factory, utilized citizens as laborers to manufacturer a variety of vehicles for the Imperial Military, including 614-AvA speeder bikes, AT-ATs, AT-DP walkers, TIE fighters. It also had hangars that housed various vehicles produced at the facility, outside of which were landing platforms."}, {"tag": "p", "text": "By the year 2 BBY, the Imperial Armory Complex housed a specialized chamber called Section A2 which contained several Imperial military secrets including Grand Admiral Thrawn's blueprints for a new starfighter equipped with deflector shields: the TIE/d \"Defender\" Multi-Role Starfighter. The factory also housed an east gate that hosted a hangar for Imperial Troop Transports and All Terrain Defense Pods."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Spectres had to escape Lothal in 4 BBY, they infiltrated the Imperial Armory Complex to steal a Sentinel-class landing craft, picking up some shield generators on the way. Before the rebels could board the shuttle, Kanan Jarrus and Ezra Bridger felt the presence of Darth Vader, who was awaiting their arrival to deal with them personally. Despite being outmatched by the Sith Lord, the Jedi were able to escape suffering no casualties."}, {"tag": "p", "text": "By 2 BBY, the former Lothalian Governor Ryder Azadi had founded a rebel cell, which specialized in sabotaging vehicles produced at the Armory Complex. One of the saboteurs was the former farmer Morad Sumar. This led to a high rate of accidents among Imperial forces. In response, Imperial High Command dispatched Thrawn to the factory to investigate. After killing Sumar during a test demonstration on a 614-AvA speeder bike, Thrawn order Governor Arihnda Pryce, Agent Kallus, and Lieutenant Yogar Lyste to lock down the factory and question workers. His inspection coincided with an undercover mission by the rebels Ezra, Kanan, and the astromech droid Chopper to steal the Imperial starfighter blueprints."}, {"tag": "p", "text": "While Thrawn arrested at least one worker for a faulty AT-DP, Chopper managed to steal the plans after Ezra and Kanan stole a passcode from an R4 courier droid. The rebels managed to escape the base with the help of Kallus and a diversionary attack launched by Ryder on the factory's east gate. Ezra's team stole an AT-DP walker and engaged two AT-AT walkers. The successful rebel heist led Thrawn to realize that the Empire had a traitor among their ranks. He planned to turn the traitor into an asset for the Empire."}, {"tag": "p", "text": "Using the information stolen by Chopper, Hera made plans for part of the Phoenix Cell to attack the Imperial factory. Ezra was assigned with collecting reconnaissance on Imperial military movements above the planet. Before they could proceed with the mission, Ezra succumbed to a Force vision created by the former Sith Maul. While Ezra, Kanan, and Sabine Wren dealt with Maul, Hera and the rest of the team traveled to Lothal."}, {"tag": "p", "text": "The TIE/D Defender eventually entered production at the Imperial Armory Complex, which had come to be considered to be the important Imperial facility in the region. The Phoenix Squadron and General Jan Dodonna's Massassi Group prepared for a strike on the complex. However, their planned attack was disrupted by Thrawn, who exposed Kallus and tracked down the location of the rebel base on Atollon. As a result, Imperial forces attacked Atollon."}, {"tag": "p", "text": "In 1 BBY, the Rebel Alliance launched a raid against the Imperial Armory Complex led by Hera. However, Hera's T-65B X-wing starfighter squadron was intercepted by Thrawn's forces and suffered heavy casualties, with many starfighters being destroyed or shot down."}, {"tag": "p", "text": "However, some time later, when Hera has been captured and being interrogated by Governor Arihnda Pryce, Hera is rescued by a strike team of Kanan, Ezra, and Sabine. However, refusing to let them escape, Pryce pursues them with an armor group of All Terrain Armored Transport walkers to the Lothal City fuel depot, ordering her men to fire on the central fuel tank, despite them knowing of what would happen if they do. As a result, the fuel tanks rupture and explode, wiping out the fuel reserves for the Imperial Armory Complex, forcing it to shut down and halt all production of the TIE/D Defender, infuriating Thrawn, who was away to meet with the Emperor on Coruscant regarding the funding for the TIE/D Defender. Though Pryce reveals that Kanan was dead, killed in the explosion as he sacrificed himself to allow Hera, Ezra, and Sabine to escape, Thrawn is unmoved by the Pyrrhic victory, as the TIE/D Defender production would never be completed, and Pryce would face punishment from Thrawn when he returned to Lothal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Armory Complex first appeared, albeit unidentified, in Star Wars Rebels: The Siege of Lothal, a one-hour television movie premiered on June 20, 2015 on Disney XD. The facility was designed by concept artist Chris Glenn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}