{"url": "Imperial_Army/Legends", "categories": ["Category:Legends articles", "Category:Darth Krayt's Galactic Empire military units", "Category:Empire-in-exile military units", "Category:Fel Empire military units", "Category:Imperial Army", "Category:Imperial military units"], "nodes": [{"tag": "h1", "text": "Imperial Army"}, {"tag": "p", "text": "The Imperial Army, also known as the Imperial Strike Force, was a branch of the Imperial Military of the Galactic Empire that had the responsibility of prosecuting ground-based military operations. Operating under the oversight of Army Command, the Imperial Army was formed from the non-clone forces of the Grand Army of the Republic in the immediate aftermath of the Clone Wars in 19 BBY. By the time of the Galactic Civil War around 0 BBY, the Army numbered in the tens of trillions and utilized a wide range of walkers, repulsortanks, wheeled vehicles and ships in support of its infantry. At the decisive Battle of Endor in 4 ABY, the Imperial Military suffered a devastating defeat at the hands of the Rebel Alliance, and the Imperial Army fragmented as the Empire collapsed into warlordism and infighting, losing ground to the New Republic. Imperial Army troops would reconquer Coruscant for the Reborn Emperor in 10 ABY, but it would not be until 12 ABY that the Imperial Military as a whole was reunified as the armed forces of the Imperial Remnant. The Imperial Army remained the ground force of the Empire after its reconstitution as the Fel Empire, and split again in 130 ABY during the Second Imperial Civil War between Darth Krayt's Imperial faction and that of Emperor Roan Fel."}, {"tag": "p", "text": "Imperial Army troopers were by far the most common Imperial soldiers, substantially outnumbering the more-famous Imperial Stormtroopers and forming the garrisons of all occupied worlds. Army troopers piloted nearly all of the Empire's heavy vehicles, including the celebrated All Terrain Armored Transport and All Terrain Scout Transport walkers. Army units were often reinforced by Stormtroopers, although the command structure for the two organizations remained separate. On garrisoned worlds, the Army operated in conjunction with Imperial Starfleet, Stormtroopers, and the local constabulary to maintain order and security."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The goal of the Imperial Army was surface superiority during instances of ground warfare, and were equipped with the means of seizing and defending a planet. While the Imperial Navy controlled space and the Stormtrooper Corps led assaults and established bridgeheads, only the Imperial Army was capable of deploying the heavy equipment and sustaining the long operations required to gain control of planets. As such, the Army encompassed various infantry, armored cavalry, special forces, artillery operators, engineers, scouts, and drivers that came to number in the tens of trillions. This also meant that while they were capable of decisive planetary operations and sustained surface superiority, it took longer to deploy their specialized formations and heavy equipment than other branches of the Imperial Military."}, {"tag": "p", "text": "Aside from this, the Army also had the role of eliminating military threats to the established Imperial political order on planetary surfaces or other inhabited complexes. If on an enemy planet, the Imperial Army was to engage and defeat any local military force that was capable of resistance in order to ensure the transition of control of the planet towards the Empire. The Army when engaged in operations could expect support from the Imperial Navy during the initial drop phase, which included suppressing fire against particularly hard or well-armed targets, as well as \"force reduction attacks\" meant to destroy enemy assets capable of interfering with reorganization after the drop. The Army during later phases of an operation was also allowed to pre-plan for orbital bombardments on specific targets. If the operation proved vital enough, the Army would even work together with naval units on the ground to provide fire support upon being called upon. For garrison duty, their role was largely the same, although they were expected to provide firepower and backup for COMPNOR and Intelligence operatives whenever called upon. Other surface missions undertaken by the Imperial Army included utterly obliterating an enemy possession, engaging enemy infantry and mechanized units, providing strategic insertion of commandos or expeditionary forces, securing control of a key planetary resource or supply line, and/or holding an objective and destroying enemy attackers attempting to reclaim it. Although their primary objective during the Galactic Civil War was the monitoring for and later immediate and decisive eradication of any Rebel presence on planets (with the process being compared to sterilizing wounds by applying heat), the Imperial Army also was cognizant of the criminal underworld, as groups such as the Hutts, smugglers, bounty hunters, as well as others who lived in civilization's fringes were considered enemies even if technically not aligned with the Rebels. The Imperial Army, when hunting for Rebels, didn't need the cooperation of local planetary governments, though they did require obedience from the latter as necessary."}, {"tag": "p", "text": "Imperial Army troopers occasionally operated aboard Naval vessels as marines. When aboard a Naval vessel, their standard duties were to steer clear of Naval soldiers and see their equipment was properly maintained, although they were also charged with defending the vessel if it was boarded by enemy units, with Army officers coordinating the crew of the vessel alongside the soldiers in this event. This also had the consequence of creating a degree of friction between the two services."}, {"tag": "p", "text": "Imperial Army commanders during the Galactic Civil War were noted to be somewhat uncreative, using outdated \"by the book\" tactics learned in the Imperial Academy. Most Imperial commanders could be more easily defeated if faced with an unexpected situation for which there was no conventional solution. The Imperial Army's orders generally came from a top-down aspect, whereby the Emperor supplied the orders which were transmitted from Army Command down through a clear hierarchy. In addition, Imperial commanders were expected to follow established protocol, and often did so by set objectives that defined in the type of units deployed into battle and how these units were to be used. As such, while the Imperial forces could afford to field specialized troopers in great numbers and in various formations, their Rebel counterparts in those fields tended to have greater training than Imperial specialists. In large part because of the top-down structure of orders, the Imperial Army's policy often led to their ignoring civilian complaints due to not answering to them, although the Rebel General Crix Madine, himself a former Imperial soldier, mentioned that units belonging to the Imperial Special Missions generally ignored that aspect of protocol."}, {"tag": "p", "text": "The Imperial Army's tactics emphasized demoralizing the enemy, specifically through the use of overwhelming firepower to leave them shell-shocked and helpless in the face of a massive, numerically superior frontal assault. The Empire also emphasized striking to disrupt the enemy's plans and expose their flaws while they were in disorder. The Imperial Army emphasized the frontal assault as the centerpiece of ground warfare, which drove the development of massive walkers like the AT-AT, which could use its immense height to deliver overwhelming firepower against targets from far outside the range of most artillery or ground vehicles. Repulsortanks and other such repulsorlift vehicles were considered better suited for \"mid-intensity\" combat, such as urban warfare and fast-moving campaigns in grassy or forested terrain."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Formation"}, {"tag": "p", "text": "During the Clone Wars, the Galactic Republic's Judicial Forces and the various Planetary Security Forces were nationalized into the Grand Army of the Republic. These operated in defensive deployments while the Grand Army's clone troopers performed offensive operations. After the Declaration of a New Order in 19 BBY and the establishment of the Galactic Empire, the Planetary Security Forces and Judicials were further amalgamated to form the new Imperial Army, while the clone troopers were split off to form the Stormtrooper Corps."}, {"tag": "p", "text": "The Imperial Army saw heavy action during the first campaign of the Imperial era, the Reconquest of the Rim. Forces led by Generals Hurst Romodi and Jan Dodonna defeated Separatist holdouts during the Ciutric Offensive and Sy Myrthian Insurrection of 19 BBY. Romodi again led troops from the front at the Battles of Kelrodo-Ai and Ord Vaug during the Western Reaches Operation of 17 BBY. Owing to the heavy militarization during the Imperial Period, the Imperial Army saw massive expansions, including even increasing the amount of Sector Armies in the galaxy. In addition, the size of the Imperial Army was such that Rahm Kota mentioned that the army that was at the Emperor's disposal was essentially infinite in numbers, and the Rebel Alliance general Carlist Rieekan even acknowledged that the Rebels stand little to no chance at fighting the Imperials in a straight up battle, due to not having the troop strength to engage battle at the regimental level, as well as admitting that not even guerrilla tactics will be enough to dislodge the Imperial Army from the core systems regarding the Sector Armies."}, {"tag": "p", "text": "The Imperial Army, compared to the pre–Clone Wars Republic Army, was significantly expanded and overhauled, to such an extent that the process of creating the Imperial Army after the rise of the New Order was compared to reviving it from the dead. In fact, refurbishing the structure and personnel of the Imperial Army to the extent that it was established as a branch equal to the Imperial Navy was one of Palpatine's first actions upon creating the Galactic Empire. Examples of some of its overhauls included the re-establishment of rigorous training and recruitment programs, as well as expanding Imperial Army-related missions to include conducting drop missions into hostile territory for standard troopers instead of just for elite units, and training for complex assaults. Probably one of the biggest differences was that when working together, the Imperial Navy was required by doctrine to provide support for Imperial Army forces during critical phases of a military operation, as well as allowing permanent garrisons to have access to various naval assets such as TIE Fighters attached to Army units for the whole of the mission. By contrast, the Republic's Judicial and Planetary Security Forces before the Clone Wars at best qualified as a poorly trained police force with fancy uniforms, with their main role being garrison duty on member worlds of the Old Republic (and even there, largely as a barrier between squabbling locals). They required the Republic Navy to get them to where they needed to go as well as to have what little remained extracted, and largely had to fend for itself during a campaign since the Republic Navy was stretched too thin to be of any help. The Republic Navy also often jealously guarded its starfighters, leaving morale among Army forces very low and actual membership virtually nonexistent. In addition, the pre–Clone Wars Republic Army, due to it largely having its units being under the direct and exclusive command of the planetary governments of the worlds they served, had its worlds pay only half the expenses and provide half the materiel for the units engaged in operations (the Republic Navy, by comparison, often had its expenses paid for by the Republic as a whole). As a result complaints about the costs of deployed surface forces were very common among those member worlds of the Republic who weren't among the wealthiest members, which consequentially resulted in the Army's expenditures plummeting."}, {"tag": "h3", "text": "The Galactic Civil War"}, {"tag": "p", "text": "In the aftermath of the Reconquest, one of the Army's most common duties was the maintenance of planetary garrisons throughout the galaxy, but from 2 BBY it faced a new enemy on the ground in the form of the Alliance Army after the Alliance to Restore the Republic issued the Declaration of Rebellion and began the Galactic Civil War."}, {"tag": "p", "text": "In 3 ABY, the Imperial Army's Blizzard Force led by General Maximilian Veers dealt the Alliance a serious defeat at the Battle of Hoth, forcing the Rebels to flee into space. The next year, however, the Army's Tempest Force was defeated at the Battle of Endor. Emperor Palpatine was killed aboard the Second Death Star, and the Imperial Military began to split up between various Imperial warlords."}, {"tag": "p", "text": "A rump of the Imperial Army remained loyal to Coruscant, and between 4 and 6 ABY engaged the New Republic Army in numerous engagements as the New Republic advanced towards the Core Worlds. In 5 ABY, Army AT-ATs and sappers fought a three-month battle on Milagro that encompassed both armored engagements and subterranean battles. However, the Imperial Army was unable to prevent the Republic's capture of Coruscant in 6 ABY, whereupon the Empire fragmented further."}, {"tag": "p", "text": "The consolidation of Imperial forces under a new Supreme Commander, Grand Admiral Thrawn, in 9 ABY saw the Army's ranks refilled with cloned soldiers. Thrawn used Spaarti cloning cylinders to restore Imperial numbers, with Army officers like Maximilian Veers becoming templates for new clone lines. In 10 ABY, Army troops led by General Alix Balan reclaimed Coruscant for Emperor Palpatine, reborn in a cloned body. However, the Empire soon again fell into infighting, and Army AT-ATs, Century tanks, and XR-85 tank droids clashed in the ruins of Galactic City fighting for numerous factions."}, {"tag": "p", "text": "Imperial Army forces loyal to Palpatine attacked Dac, with a force of World Devastators being led by General Titus Klev. Maximilian Veers died leading Army troops, SD-9 battle droids, and Shadow Droids at the Battle of Balmorra. However, Palpatine's final death at Onderon saw the Imperial Military once again split, and the Army would remain divided until Imperial Reunification in 12 ABY."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Imperial Army became the ground force of the Imperial Remnant following Reunification, and remained the army of the succeeding Fel Empire after the restoration of the title of Emperor under the Fel dynasty. At some point after 44 ABY, the Stormtrooper Corps was merged with the Army."}, {"tag": "p", "text": "From 130 ABY, the split of the Fel Empire in the Second Imperial Civil War would also lead to the splitting of the Imperial Army between the faction of Darth Krayt and the faction loyal to Emperor Roan Fel. At the Battle of Borosk in 137 ABY, Stormtrooper divisions on both sides of the civil war clashed, with the 908th Stormtrooper Division being wiped out to a man by the 407th."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Headquarters"}, {"tag": "p", "text": "Prior to the Battle of Endor and the de facto collapse of Imperial authority, the highest organizational body of the Imperial Military was the Imperial High Command. Below this was Army Command, the organizing body of senior Generals that directed all operations of the Imperial Army, led by the Army Chief of Staff. Army Command oversaw all aspects of the Imperial Army and operated and commanded the ground battles and anything within the Imperial Army's jurisdiction, coordinating the war effort of the Galactic Empire."}, {"tag": "h3", "text": "Administration"}, {"tag": "p", "text": "Below Army Command were three other important organizational distinctions within the Imperial Army: The Assault Armor Division, the Imperial Maritime Division, and the ground support wings. The Assault Armor Division was a branch of the Imperial Army that was responsible for mechanized warfare and utilizing heavy vehicular support. It encompassed all mechanized war machines, which included various walkers, repulsorlift vehicles, and tanks."}, {"tag": "p", "text": "The Imperial Maritime Division acted as the water navy division for the Imperial Army, and as such was capable of operating on oceans, rivers, and urban waterways by utilizing specialized aquatic vehicles such as destroyers, submersibles, and waveskimmers. The ground support wings controlled garrison-based TIE fighters detached from the Navy to support the Army. Although technically originating from the Starfighter Corps controlled by the Imperial Navy, the TIE pilots operated under Imperial Army jurisdiction instead of the Imperial Navy. This was an enforced compromise between the two branches of the Imperial Military, as the Army wanted its own starfighter complement while the Navy wanted exclusive control of starfighters. This incidentally resulted in a massive rivalry between space-borne \"vac-heads\" and \"ground-hog\" TIE pilots."}, {"tag": "h3", "text": "Tactical organization"}, {"tag": "p", "text": "The Imperial Army was structured to provide the greatest possible flexibility to the commander. Because the Empire could afford to field specialized troops in great numbers, Imperial formations, particularly at the lower levels, could be very diverse. As with the rest of the Imperial Service, the Army made a strong distinction between \"combat elements,\" and \"command elements\" or \"support elements.\" Any commander, even a Sergeant, was considered part of the \"command element\" and was not counted among the troopers, despite the fact that they were expected to take part in the fighting. Since unit commanders were considered supernumeraries, the average Imperial Army formation tended to have a larger headcount than an equivalent-strength formation in the Grand Army of the Republic."}, {"tag": "p", "text": "The largest formation of the Imperial Army was the sector army, comprising around one and a half million men commanded by a Surface Marshal, though due to the political complications of sector administration, this was usually an honorary title held by the sector Moff. A sector army was composed of two to four systems armies, each led by a High General and composed of around 393,000 troops, though the systems armies were largely bookkeeping formations used to control reinforcements to subordinate forces, not operational units. Systems armies were formed of one to three armies, each of around 131,000 troops, commanded by a General and comprising four corps, one of each type. The army was considered the minimum strength to capture and control a key star system."}, {"tag": "p", "text": "Below the army level, formations and units began to diversify. The corps, comprising around 33,000 troopers and led by a Major General, was deployed for major planetary operations and was composed of four battlegroups, the exact composition depending on role. The type of corps deployed depended on the planetary environment, population, and level of hostility. The line corps was the standard configuration, while the Atrisian corps were among the elite of the Empire's formations. Armor corps were heavy on tanks and offensive power, while mobile corps emphasized speed and mobility. The corps headquarters also controlled air support through the ground support wing. The corps' four battlegroups, each of around 8,000 troopers and commanded by a Colonel, were the standard deployment for major Army offensives and were capable of capturing a continent. The standard formation was the line battlegroup, while reinforced battlegroups offered a mix of specializations for diverse planetary environments. Armored battlegroups deployed large numbers of vehicles to destroy concentrate knots of resistance, while mobile battlegroups focused more on maneuvering mechanized infantry."}, {"tag": "p", "text": "The battlegroup was composed of four regiments, each of around 2,000 troopers and led by a Lieutenant Colonel. Line regiments were considered the appropriate configuration for the long term occupation of a planetary region while assault regiments formed the vanguard of attacks. Repulsorlift regiments emphasized speed and rapid response while armor regiments and vanguard armor regiments provided heavy mobile firepower. Artillery regiments provided fire support. Four battalions formed the regiment, each of around 512 troopers led by a Major. The minimum deployment for an Army operation unless Stormtroopers were attached, battalions could capture a major urban center. Line battalions were the standard configuration while assault, armor and repulsorlift battalions operated armored vehicles. Artillery battalions provided fire support, while special missions battalions were the largest formations for the Imperial Army's special forces. Security platoons were also included in the battalion to maintain order. Even though CompForce, being an agency of COMPNOR, was not technically part of the Imperial Military hierarchy, let alone the Imperial Army, it had a regiment type within the regiment structure, though it wasn't popular with the Army itself."}, {"tag": "p", "text": "The battalion was formed from four companies, each of around 128 troopers led by a Captain, and was considered sufficient force to control a city. The company was the smallest unit that would receive attachments of support troops, such as logisticians, medics, technicians and droids, for administration and resupply in the field. Line companies were the standard formation, while special missions companies acted as expeditionary and special reconnaissance forces and scout companies, known as troops, provided speeder bike-mounted reconnaissance. Attack and breakthrough armor companies operated heavy vehicles, while repulsorlift companies acted as mechanized infantry and artillery companies, known as batteries, provided long-range fire support. Drop companies were independent formations that acted as pathfinders for larger forces."}, {"tag": "p", "text": "Four platoons of around 32 troopers formed the company, each led by a Lieutenant and a Sergeant Major, and were each capable of capturing a district. Specialization at the platoon level offered the commander more tactical options in action, and they could be deployed with walkers or artillery. The line platoon and assault platoon were basic infantry formations while repulsorlift, heavy weapons repulsorlift, and armor platoons operated in vehicles. Scout platoons conducted reconnaissance while special missions platoons conducted special operations. Artillery platoons, or lines, were the smallest dedicated groupings of artillery pieces."}, {"tag": "p", "text": "The squad of around eight troopers, led by a Sergeant and a Corporal as second-in-command was the smallest unit of the Imperial Army and core to its function. Four formed a platoon, and it could be subdivided into two fire teams. Line squads and heavy weapons squads were the core infantry formations. Engineering squads and sharpshooter squads were composed of Special Missions troopers operating as military engineers and snipers. Repulsorlift squads and heavy weapons repulsorlift squads operated anti-grav vehicles, while armor sections operated walkers and repulsortanks. Artillery sections formed individual gun crews, while scout lances operated on speeder bikers or AT-RTs for battlefield reconnaissance."}, {"tag": "p", "text": "The structure of the Imperial Army was similar to the Grand Army of the Republic with some differences. The following table lists the size and composition of the various units used by the Imperial Army, although given the variety of unit types and possibility for augmentation the numbers listed are only nominal."}, {"tag": "h3", "text": "Augmentation"}, {"tag": "p", "text": "The uniquely Imperial concept of \"augmentation\" was intended to allow the rapid integration of reinforcement units into an existing force while minimizing the number of (relatively scarce) senior officers required. All units from platoon-level and up were expected to maintain a baseline strength which, as the Imperial military grew, could be upgraded to their full strength. Augmentation was part of the Army's Surface Operations Training Doctrine and represented an idealized version of how it was organized."}, {"tag": "p", "text": "On a small scale, augmentation could be compared to unit \"attachments,\" while on a larger scale it could be compared to an active cadre for reserve divisions. The full extent of augmentation could be impressive. For example, a baseline armored battlegroup had 10,090 troops out of 16,346 total, with 1,132 repulsorlift vehicles and 318 tanks. If every unit was augmented to its full capacity, a full-strength armored battlegroup would have 318,062 troops out of 324,318 total, with 36,084 repulsorlift vehicles and 14,480 tanks."}, {"tag": "p", "text": "Augmentation proceeded according to that unit's official Order of Battle (OB), especially for units of company-size and larger; smaller units often got away with more flexibility in how they were augmented. For example a line company was augmented first by a heavy weapons platoon, followed by a second heavy weapons platoon, and then two line platoons. In rare instances an Army unit was augmented in ways other than dictated by the OB. The most common happened when an army commander organized survivors from a battle, creating haphazard units regardless of the OB. The second was when units were augmented with local auxiliaries. Finally a commander could order a special augmentation which he felt was critical to accomplishing his mission. If he succeeded his superiors would overlook this infraction, while failure meant he faced harsh justice. Indeed it was not unknown for an unorthodox commander to violate the SOTD and be executed, only for his methods to be evaluated and adopted after-the-fact."}, {"tag": "p", "text": "When a formation of company-size and larger was augmented, it's second-in-command was charged with commanding the extra units while the commanding officer maintained control of the baseline units. In practice a particularly strong-willed or above-average commander could and did assume direct control over the augmenting units. These violations were largely overlooked by superior officers."}, {"tag": "p", "text": "At the time of the Battle of Yavin the majority of Army units were at their baseline strength. Of the rest eight percent fell below it for reasons other than combat attrition while fifteen percent were above. The limiting factor in the Army's growth was not for lack of resources themselves but in the Imperial Navy: the Army simply could not expanded faster than the number of ships designed to carry it. When necessary new units were raised regardless of naval support but were then bound to that planet."}, {"tag": "h2", "text": "Personnel"}, {"tag": "h3", "text": "Specializations"}, {"tag": "p", "text": "Like other armies during history, the Imperial Army had various specializations for specific soldiers."}, {"tag": "p", "text": "The Imperial Army troopers were the standard infantry for the Imperial Army, as well as the most common soldiers on Empire-controlled worlds. Their uniforms were cut in a similar manner to the Imperial Navy troopers, although they were primarily green on occasion. They also wore plasteel armor of a similar nature to the Snowtroopers. The Imperial Army troopers were deployed to either keep the peace on Imperial-occupied worlds or otherwise conquer nonstrategic worlds for the Empire, in contrast to the Stormtrooper Corps, which were deployed to raid enemy worlds. Although they were often on foot, several, such as Vehicle Command Crewers, were also responsible for manning mechanized vehicles such as the AT-AT walkers. The Imperial Army pilots did not generally wear armor, although some higher ranking officers did. In addition to the regular soldiers, medics were also present among the Imperial Army soldiers, distinguished by navy blue-colored uniforms, and officers that were directly leading the forces often wore darker colored armor."}, {"tag": "p", "text": "Several members were also specialized for a specific environment, with there being various specialist units trained to deal with specific terrain and atmosphere types. For instance, the swamp trooper (not to be confused with the wetland assault stormtroopers of the Stormtrooper Corps) was often deployed near wetlands, and can be identified by wearing a variant of the Imperial Army uniform designed specifically for operation in wetlands."}, {"tag": "p", "text": "The Imperial commandos were also the choice group of the Imperial Officer Corps, and by extension, the Imperial Army. They were distinguished by their tendency of using long-range weapons, due to feeling melee weapons were the arms of their \"lessers,\" as well as helmets similar to that of the Imperial Army Engineers. They were considered to be among the Imperial Army's special forces groups."}, {"tag": "p", "text": "Like other Armies, they were generally led by Field Commanders."}, {"tag": "p", "text": "In addition, a segment of soldiers were also deployed for ground assaults, identified as Imperial land assault troopers. Many of these were stationed aboard the first Death Star before it was destroyed at the Battle of Yavin."}, {"tag": "h3", "text": "Recruitment and training"}, {"tag": "p", "text": "Initially the Army accepted recruits from worlds across the Empire, though this policy was changed in wake of several high-profile defections to the Rebel Alliance, especially in the aftermath of Operation Domino. Emphasis was then placed on recruiting from the Core Worlds, especially with regards to Officer Candidates, and those planets which bordered the Imperial Core. Frontier and primitive worlds were also targeted for recruitment drives, the latter especially for filling the ranks with expendable assault troops, although some care had to be taken to weed out Rebel sympathizers. Those worlds which had been subject to Imperial bombardment or assault within recent memory (i.e., within the past ten standard years), and those with a strong liberal or independent tradition, were considered breeding grounds for the Rebellion and avoided altogether."}, {"tag": "p", "text": "Army cadets began their applications at the system level. Potential recruits would be screened at their local Imperial Recruitment Office, with Screening Officers conducting background checks including looking into the candidate's school reports and home life. While these officers were instructed to watch for any potential Rebel connections, including family members with Rebel sympathies, suspected Rebel infiltrators were encouraged to join and the Imperial Security Bureau informed immediately. Candidates who passed initial screening would then be sent to Training Centers for medical examinations and intelligence assessments, including mandatory retina scans that were matched against available records. Desired traits for recruits included physical fitness, bravery, loyalty, and intellect (although the last one could be waived under certain infantry regiments). Cadets would then attend regional military prep schools, which included the AT-ST Training Program, which acted as a means to enter the Imperial Academy. The best students of these schools were invited to attend Army Officer Training Academies, where they completed basic training, learned military history and courtesies, and took examinations to determine what military career would suit them best. Screening Officers at the sector Recruitment Office would then review the cadet's application and decide the type and duration of the cadet's training program. The basic training itself was difficult, and often required the trainees to endure taking orders, sharing a room with six or seven other people, doing various drills, and looking after their equipment and weapons by maintaining them for hours. The drills themselves included long marches and spending hours building up stamina and strength. This was because, due to the Imperial Army being purported to be the best army in the galaxy, they needed to have all personnel be highly trained to carry out the various jobs demanded of the soldier, as well as it reflecting badly on both the organization and the soldier if they sent troops out half-trained, due to having no use for dead soldiers."}, {"tag": "p", "text": "Basic training took place at one of thousands of drop camps situated across the Empire, each one focused on a different area of operation such as infantry, armor, communications or engineering. Physical fitness, equipment maintenance, team-building drills and indoctrination were all part of training to become an Army trooper. Survival in a variety of environments, from jungles to deserts to swamps to arctic tundra to forests, and under different planetary gravities was standard in most cases. Some drop camps specialized in training units to deal with a specific terrain and atmospheric types, though in these cases most recruits would be drawn from relevant exotic worlds."}, {"tag": "p", "text": "The most promising Army recruits would be invited to attend officer training at the Academy on Raithal, in the Colonies. The cadets endured a grueling one-year training program, which included simulations and live-fire drills in drop camps on a variety of worlds, and rigorous psychological examinations and indoctrination into the precepts of the New Order. The most pursued trait within Imperial Army officers at Raithal was their ability to lead their men through the most adverse of conditions. Raithal was originally geared towards non-clone recruits into the Imperial Military due to the Stormtrooper Corps originally being composed exclusively of clone troopers. Emphasis was placed on an officer's ability to command men through the twofold method of leadership: drawing upon their fear of disobeying orders, which was disciplined into them during training, and gaining their respect by example. Psychological examinations were rigorously performed to test the candidate's mettle, while a week spent in the interrogation center simulated the type of treatment they could expect if they fell into enemy hands. Loyalty to the State and the correct balance between self-sacrifice and self-preservation also formed a critical part of officer training."}, {"tag": "p", "text": "Upon completing a year course on Raithal, most officer cadets were transferred to the Corulag Academy. Corulag provided additional training to Navy Midshipmen, Army Cadets, flight school pilots, and specialists from all Imperial services, with an emphasis on active training. In some cases, however, in large part because of the Stormtrooper Corps including conscripts to replace the aging clone veterans, particularly promising students at Raithal might be transferred to the Academy of Carida instead. The Academy of Carida was a major stormtrooper training facility, and numerous Army, Navy and flight school cadets also spent semesters there. Carida also housed the Officer's Candidate School."}, {"tag": "p", "text": "Where possible recruits would be placed in the branch of service of their choosing, as dissatisfaction with assignment was a major source of morale problems. However, the initial screening tests were used as a guide to help show where a recruit was better suited; for example those with less intelligence were often transferred to the infantry branch. In addition, leaving the service before their contract was fulfilled was strictly forbidden. Those recruits who matched certain criteria were transferred to the Stormtrooper Corps, an entirely different organization."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Uniforms"}, {"tag": "p", "text": "Personnel of the Imperial Army wore an assortment of uniforms according to their particular branch of service. Non-Commissioned Army Officers, similar to officers belonging to the Imperial Navy, wore a gray-green uniform with a double-breasted tunic, trousers, and a matching cap displaying an officer's disc. The Imperial Army trooper generally wore a gray uniform as well as a blast helmet with tinted goggles and a built in comlink such as the DH77 headcomm. They also at times wore body armor. Although those within command structures weren't required to participate on the field, those who did were often identifiable by their darker version of the uniform, including body armor that protected the shoulder plates. Medics also wore this type of armor, although they were colored cerulean."}, {"tag": "p", "text": "The swamp trooper division had its own set of armor, due to the specialized nature of the swamp troopers for marshlands."}, {"tag": "p", "text": "Owing to their belonged to the Imperial Officer Corps., and by extension, the Imperial Army, the Imperial commando uniforms had a strong resemblance to that of the Imperial Army trooper."}, {"tag": "p", "text": "The Vehicle Command Crewers had two different uniforms, depending on the branch. The Heavy Armor division's uniforms were similar in appearance to TIE pilot uniforms, although they were white, and red Imperial crests adorned the helmet. The Armored Cavalry division had superficial similarities to the Army trooper uniforms, although comparatively lightly armed."}, {"tag": "p", "text": "The Land assault troopers wore extensive armor that had a slight similarity to the Heavy Armor Vehicle Command Crewers, although more streamlined."}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "Imperial soldiers were known to employ a variety of weapons, like; the E-11 blaster rifle, E-15 blaster rifle, E-18 blaster rifle, E-19 blaster rifle,  DLT-19 heavy blaster rifle, T-21 light repeating blaster, RT-97C heavy blaster rifle, DH-17 blaster pistol,  DLT-20A blaster rifle, EE-3 carbine rifle, E-11 carbine, slugthrower, blast cannon, repeater rifle, assault cannon,  DXR6 heavy carbine, FC-1 flechette launcher, E-11s sniper rifle, T-28 repeating sniper rifle, Proton rifle, Sonic blaster, ARC caster, Berserker rifle, Plasma caster, CSPL-12 projectile launcher, V-6d mortar launcher, \"Equalizer\" ion cannon, PLX-2M portable missile launcher, PLX-4 Missile Launcher, MiniMag PTL missile launcher, DEMP guns, SE-14r light repeating blaster, Oppressor flamethrower, DXR-6 disruptor rifle, DX-2 disruptor pistol, Stouker concussion rifle, Rail detonator gun,  E-Web heavy repeating blasters or E-Web missile launcher. A variety of grenades, mines, and other demolitions, like thermal detonators, LXR-6 concussion grenade, C-22 fragmentation grenade,  Proton grenade, CryoBan grenade, Gas grenade, Smoke grenade, Ion grenade, Sonic detonator, LX-4 proton mine, KE-6b mine, and anti-vehicular mine. Imperial saboteurs were known to use stealth field generators."}, {"tag": "h3", "text": "Vehicles"}, {"tag": "p", "text": "The Imperial Army was composed of various vehicles, many meeting multiple classifications. Some also had joint use within other branches of the Imperial Military alongside the Imperial Army."}, {"tag": "h4", "text": "Artillery"}, {"tag": "p", "text": "The Imperial Army utilized several Artillery pieces, whether on vehicles or stand-alone."}, {"tag": "p", "text": "Among its static artillery pieces were the heavy weapons like the tremendous C-136 \"Grandfather Gun,\" Turbolaser System I and V-188 Penetrator, although the V-188 could also be mounted on the 440 Super-Heavy Armored Chassis to make it more mobile. For lighter targets the Army employed the DF.9 anti-infantry battery and Twin DF.9 anti-infantry battery. Anti-aircraft artillery included the G-001 Tracker, later replaced by the G-003 Tri-Tracker; while the G-003 could technically be made mobile by mounting it on a repulsor sled, this was less than ideal."}, {"tag": "p", "text": "Self-propelled artillery included a number of walker vehicles. Some were inherited from the Clone Wars era, including the All Terrain-Attack Pod and Self-Propelled Heavy Artillery, and served as inspiration for later models, including the Self-Propelled Medium Artillery, All Terrain-Anti-Aircraft, and All Terrain Ion Cannon, which was essentially an All Terrain Armored Transport with most of the rear removed in place of a massive ion cannon turret."}, {"tag": "p", "text": "A number of repulsorlift-based artillery models were used as well, such as the Energy Pummel, Shock Cannon, SP.9 Anti-Infantry Artillery Vehicle based on the DF.9, Unstable Terrain Artillery Transport developed specifically for unstable terrain, mobile artillery and heavy artillery platforms. Imperial self-propelled artillery included tracked models as well, such as the Leveler I medium concussion missile launcher."}, {"tag": "p", "text": "The MobileMortar-3 was a light artillery piece used by the Imperial Army to provide close fire support."}, {"tag": "h4", "text": "Armor"}, {"tag": "p", "text": "The Imperial Army utilized a wide array of heavy armored tanks. These vehicles included armored repulsortanks such as the S-1 FireHawke Heavy Repulsortank and its replacement, the Imperial Repulsortank 1-H, along with the HAVr A9 Floating Fortress, and the Heavy Assault Vehicle/repulsorlift C10 Siege Tower."}, {"tag": "p", "text": "Among the various walkers employed were the famous All Terrain Armored Transports, successor to the All Terrain Tactical Enforcer and All Terrain Heavy Enforcer inherited by the Army from the GAR. The All Terrain Armored Heavy Transport, based on the original AT-AT, was used by the both the Fel Empire and Darth Krayt's Sith Empire.There were also insect-like armored transports dedicated to mountainous terrain, called Mountain Terrain Armored Transports. The only known facility was destroyed when Carida was destroyed by a supernova, although it was rumored that the Empire had made off with the plans when they evacuated."}, {"tag": "p", "text": "Wheeled assault vehicles included the HAVt B5 Juggernaut, the HAVw A5 Juggernaut, and the HAVw A6 Juggernaut. The XR-85 tank droid was both a tracked and automated tank employed by the Army."}, {"tag": "h4", "text": "Heavy cavalry"}, {"tag": "p", "text": "The Imperial Army also made use of heavy cavalry-type vehicles. A number were hold-overs from the GAR, including walkers like the All Terrain-Experimental Transport and All Terrain Personal Transport, and repulsorcraft including the Infantry Support Platform and TX-130T fighter tank."}, {"tag": "p", "text": "Eventually the Army began employing its own models of heavy cavalry-type vehicles. These included walkers like the All Terrain-Advance Raider, the All Terrain-Scout Transport/Assault and All Terrain Kashyyyk Transport, along with repulsorcraft like the 2-M Saber-class repulsor tank, Imperial Repulsortank 1-L, the 008 Heavy Landspeeder and the Ultra-Light Assault Vehicle. Wheeled vehicles such as the Compact Assault Vehicle/Wheeled PX-10 were employed on remote worlds, while the unique Swift Assault 5 traveled on a cushion of air as opposed to traditional repulsor engines."}, {"tag": "p", "text": "Sienar Fleet Systems also had some involvement in the development of the heavy cavalry vehicles, which resulted in some of their vehicles adopting TIE Series features. These included the TIE ap-1, nicknamed the TIE Mauler, and the Century tank, nicknamed the TIE Crawler."}, {"tag": "p", "text": "The successors of the Galactic Empire; the Fel Empire and Darth Krayt's Sith Empire, made use of heavy cavalry weapons, such as the All Terrain Riot Control Transport."}, {"tag": "h4", "text": "Mechanized infantry"}, {"tag": "p", "text": "The Imperial Army was well known for its mechanized infantry, including especially its walkers. The Empire tended to favor walkers as they possessed several advantages over treaded and repulsorlift vehicles, namely their being able to react to changing surface conditions and shift footing as a soldier would, yet also be able to remain firmly connected to the ground to brace against the recoil of their onboard heavy weapons. Their advantages left them able to operate freely in planets possessing atmospheric conditions prohibit the operation of repulsorlift vehicles. Another reason for their use of walkers was under a more psychological warfare aspect, specifically psychological destabilization of the enemy either due to primitive preconceptions of gargantuan beasts or otherwise citizens being trained by Imperial propaganda that the arrival of a walker meant all was lost. The most famous of these were the quadruped walkers known as the All Terrain Armored Transports, which also featured a heavily armored variant. These acted as the pride of the Imperial Assault Armor Division, and, although technically only functioning as a troop transport, were symbolic of the intense power of the Empire, often reinforced by propaganda. The AT-ATs could also be heavily customized to suit the local environments of various planetary garrisons, with the most notable example being the Aquatic Terrain Armored Transport. Largely because it was the first walker to see extensive combat under modern battlefield conditions and its role in the Clone Wars and being the predecessor to the various walkers in the Imperial Army, the All Terrain Tactical Enforcer was retained in the service of the Empire, many being in active use throughout the Mid and Outer Rim, due to being extremely well built, with their acting as patrol vehicles, often being painted in the local camouflage and outfitted with modifications such as floodlights, underbrush grinders, and flamethrowers. Their magnetized footing also allowed them to be used in extra-planetary environments, such as asteroid surfaces or ship hulls. The Mountain Terrain Armored Transport was also utilized since at least post-Endor. They also utilized some Clone Wars–era vehicles, including the HAVw A5 Juggernaut, the HAVw A6 Juggernaut, and the All Terrain Open Transport. Wheeled and repulsorlift vehicles were also used besides these, such as the HAVt B5 Juggernauts and the HAVr A9 Floating Fortress."}, {"tag": "p", "text": "Armored Personnel Carriers were also utilized to deliver troops and/or prisoners. The Imperial Troop Carrier, 6500 ATVs, GPT-117 Troop Transports, SV-50 Swift-Strike Speeders, Urban Assault Speeders, PX-7 troop transports, and the Reconnaissance Troop Transporters were similar in role to the APCs. In addition, the MTV-7 Multi-Terrain Vehicles were used as scouting vehicles, while Battlespeeders were special World Devastator-developed speeders utilized by the Imperial Army."}, {"tag": "p", "text": "The Imperial Army utilized the Bantha-II cargo skiff as their motorized infantry vehicles, while the CAP-2 Captivator was a small, one-man walker."}, {"tag": "p", "text": "The Galactic Empire's successors, and by extension the Imperial Army's successors, also utilized mechanized infantry. The Fel Empire and Darth Krayt's Sith Empire both utilized the All Terrain Armored Heavy Transports."}, {"tag": "h4", "text": "Reconnaissance"}, {"tag": "p", "text": "Vehicles used primarily for reconnaissance duties were also utilized by the Imperial Army. They included speeder bikes, such as 74-Z speeder bikes, BARC speeders, and XR-10 Shadowhawk Speeder Bikes; sleds such as Storm Skimmer Patrol Sleds and the 64-Y Swift 3 repulsor sleds, and speeders such as the Imperial patrol landspeeders, which included a variant in Mos Eisley on Tatooine, and a tank variant. Repulsor scouts and Sub-ter rovers were also used, as was the Swift Assault 5 hoverscout."}, {"tag": "p", "text": "Tanks could also be used, such as the T2-B repulsor tank."}, {"tag": "p", "text": "There were also some for specific environments, such as the Swamp crawler."}, {"tag": "p", "text": "Walkers primarily designed for reconnaissance were also utilized, such as the All Terrain Scout Transports, All Terrain Force Reconnaissance Walkers, and the All Terrain Recon Transports."}, {"tag": "h4", "text": "Aerial assault"}, {"tag": "p", "text": "The Imperial Army utilized various aerial assault vehicles, some of which were also used by the Imperial Navy. They were primarily used for air patrol purposes."}, {"tag": "p", "text": "Airspeeders utilized by the Imperial Army included the Rapid Deployment Airspeeder, the Tracker-4 military airspeeder, the Shark combat airspeeder, the Deathhawk combat airspeeder, the Shadow V Combat Airspeeder, and the HSP-10 pursuit airspeeder. Post-Endor the Sniper airspeeder came into use, while after 15 BBY the Imperial Army employed Side Gunners and the Imperial Sniper vehicles. The Hover Combat Carrier was primarily used to keep insurgents in line."}, {"tag": "p", "text": "Gunships such as the Low Altitude Assault Transport/infantry and the Multi Altitude Assault Transport were also utilized by the Empire."}, {"tag": "p", "text": "Fighters, including some from the Imperial Navy, were also used by the Imperial Army, namely for reconnaissance. For example, the Imperial Navy fighter called the INT-4 Interceptor, was used by Blizzard Force to scout out Echo Base during the Battle of Hoth. Skim fighters and Imperial Escort Fighters were also sometimes used."}, {"tag": "p", "text": "The Imperial Army also made use of aerial artillery, such as the Lancet Aerial Artillery."}, {"tag": "h4", "text": "Command and combat support"}, {"tag": "p", "text": "The Imperial Army also utilized various vehicles for command and combat support-related duties. They had several jobs, with combat being a minimal requirement. One vehicle that did focus on combat-related duties was the Imperial Repulsortank 1-M. Although vehicles specifically used for combat were rare in command and combat support types, they were equipped with weapons for protection. The Tracked Shield Disabler also disabled shield generators at Rebel bases. Gravtrucks and XP-38 sport landspeeders were also used by the Imperial Army, the latter as support vehicles at Imperial garrisons."}, {"tag": "p", "text": "They also served transport capabilities, including the Combat Attack Transport utilized by Blizzard Force during the Battle of Hoth."}, {"tag": "p", "text": "Heavy recovery vehicles were utilized to recover damaged or disabled vehicles during combat, and at times worked with repulsorlift barges. The Heavy Transport Vehicles had a similar purpose: transporting resupply units and spare parts to the battlefield."}, {"tag": "p", "text": "LAVr QH-7 Chariots were often issued for Commanders for them to enter battlefields with relative protection. Likewise, the PX-4 Mobile Command Bases acted as command centers for Imperial Commanders to issue orders from and relay instructions. They also formerly had a Tracked Mobile Base prototype with similar functions, although it eventually ended up captured by the Rebel Alliance. Another mobile base used by the Imperials was the MFB-4 Mobile Repulsor Base."}, {"tag": "h4", "text": "Combat service support"}, {"tag": "p", "text": "The Imperial Army also utilized vehicles relating to combat service support duties. Because of these duties, they also were utilized by both the Imperial Army and the Imperial Navy divisions of the Imperial Military."}, {"tag": "p", "text": "Several of these were landspeeders for troop transport, such as the 6500 ATVs and the 8880 limousine landspeeders, the latter vehicle being used to transport high officials securely."}, {"tag": "p", "text": "They were also used to deliver supplies. Armored hovertrains were also used for delivering troops/prisoners and supplies. In addition, the All Terrain Tactical Enforcers also have a cargo transport variant."}, {"tag": "p", "text": "Imperial Cargo Traders were utilized to deliver nova crystals to spaceports for export as well as deliver supplies to other outposts. In addition, the All Terrain Construction Transport was created specifically to do construction work, so it didn't have any conventional weapons systems. However, its tractor beam could be used as an unconventional weapon system. The Unstable Terrain Artillery Transport was also used for transportation duties."}, {"tag": "p", "text": "Relatively simple hover-vehicles were also used in environments not suitable for normal repulsorlift craft. These included the 93-B Hovercraft, 101-C Hovercraft and 109-Z Hovercraft."}, {"tag": "p", "text": "For maritime operations, the Imperial ground-skimmer-sls were also utilized to deliver troops."}, {"tag": "p", "text": "Many of their combat service support vehicles also were spacefaring, including the Imperial dropships, the Imperial Dropship Transports, the Imperial transports, and the Clone Wars–era Low Altitude Assault Transport/carrier and Low Altitude Assault Transport/vehicles. Because of the amount of spacefaring these vehicles required, several of these vessels were also under the co-jurisdiction of the Imperial Navy."}, {"tag": "h4", "text": "Aquatic"}, {"tag": "p", "text": "The Imperial Army, under its maritime branch, also utilized aquatic vehicles. During the reign of the First Galactic Empire, it utilized Aquatic Destroyers (including a heavily armed variant), Aquatic Terrain Armored Transports, Aquatic Scout Ships, Aquadon CAVa 400s, Explorer Submergibles, Imperial submarines, aquatic transports, TIE fighter boats, and waveskimmers, such as the AQ-5 Waveskimmer and the single-person waveskimmer. The Amphibion was also utilized during the time of the Dark Empire."}, {"tag": "p", "text": "By the time of the Krayt Empire and the Fel Empires, the successors of the Galactic Empire, they utilized the Acklay-class mobile fortresses, Shark underwater fighters, and modified versions of the Aquatic Terrain Armored Transports."}, {"tag": "h4", "text": "Planetary defenses"}, {"tag": "p", "text": "The Imperial Army also featured several defensive systems for occupied planets. The 1.4 FD P-Tower was a dish-type laser cannon dating back to the Clone Wars, although it was outdated by the time of the Battle of Hoth in 3 ABY. In addition, the company Taim & Bak also developed several of their defensive systems, including the Bp.2 anti-infantry turrets, the Bp.4 anti-vehicle turrets, and the Bp.5 anti-aircraft turret. In addition, the DF.9 anti-infantry battery was also developed both for stationary use and for usage for the Imperial Army's XR-85 tank droids. HVs-2 hypervelocity guns were also able to shoot at Alliance Space Stations. The Army also utilized the LNR Series I Systemary Laser Batteries the LNR Series II Systemary Laser Batteries, and the XX-10 turbolaser towers. It also utilized anti-orbital ion cannons such as V-150 anti-orbital ion cannons."}, {"tag": "p", "text": "It also utilized shield generators, including the GenCore Level I, the GenCore Level IIs, the SLD-14 shield generators, and the SLD-26 planetary shield generators."}, {"tag": "h3", "text": "Mounted creatures"}, {"tag": "p", "text": "Some Imperial Army bases at times required the use of mounted creatures, namely when a local environment had such extreme conditions that mechanized scout vehicles could not be used without being put in the repair bays for weeks. These mounts were generally supplied by Rothana Heavy Engineering, of which five mount species were known: Dewbacks, which were available for use in any planetary base location save for those where the local temperature was below freezing; Aiwhas, which acted as both a flyer and swimmer in shallow water, and thus allowed the Imperial Army to act as a mount in any world with a breathable atmosphere for tasks such as performing reconnaissance at a height of 5000 meters or travelling between Imperial outposts without need of a trail or terrain; Gelagrubs, or more specifically, a genetically stunted version that didn't mature into beetles via pupation and had an exclusive diet of fungi such as mushrooms, or if there weren't any, freeze-dried packets of specially formulated feeds; Cracian thumpers, which kept calm under fire and shouldered heavy loads, as well as kept a steady running pace for hours and remained silent during this, with their being used in scouting enemy lines; and Blurrgs, which were considered reliable due to their hardiness. Most of them had a set credit price (16,000 for a herd of six Dewbacks, 45,000 credits starting price per Aiwha, with larger, cargo-hauling breeds being available at a premium price model; 2,000 per common thumper as well as 5,000–7,000 credits per specialty breeds; and either 12,000 credits for a herd of six or a package pricing of 20,000 credits for a herd of 12 Blurrgs, respectively), although in the case of Gelagrubs, they required a special order and contacting a representative for Rothana to negotiate a price, plus additional costs for the freeze-dried diet packs depending on whether the world had mushrooms or other fungi available."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}