{"url": "Imperial_Army_(Sith_Empire)", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Military units and formations of the Imperial Army (Sith Empire)", "Category:Sith Empire military units"], "nodes": [{"tag": "h1", "text": "Imperial Army  (Sith Empire)"}, {"tag": "p", "text": "The Imperial Army was the ground forces of the Imperial Military of the reconstituted Sith Empire. It fought against the Galactic Republic during the Great Galactic War, the Cold War, and the Galactic War."}, {"tag": "p", "text": "They were involved in the Battle of Bothawui where they faced a devastating defeat against the Republic defenders. The Imperial Army was also involved in the Sacking of Coruscant which brought about the Treaty of Coruscant that left both the Empire and the Republic in a state of cold war."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After fleeing Korriban, the remainder of the Sith Empire stumbled on the jungle world of Dromund Kaas, after drifting in space for years. Once there, the first Grand Moff began a program to make a new Imperial military. He drafted all non-Sith of age into the army and established a training regimen that is still used to this day."}, {"tag": "p", "text": "Over the years, they carved into the jungles of Dromund Kaas, fighting off its hostile beasts to make room for the Empire's new capital city. After the Imperial armada was completed, the Army and Navy were eventually deployed, in what is thought to be the greatest strategic invasion in galactic history, against the Galactic Republic opening the Great Galactic War."}, {"tag": "p", "text": "A notable failure of the Army engagement was the Sith Empire's second attempt at taking Bothawui, where despite vast numbers, greater than the opposition, they failed thanks to the poor strategy of throwing their numbers at the enemy."}, {"tag": "p", "text": "Since the Cold War their engagements have been reduced to peace keeping, as the Treaty of Coruscant forbids Imperial and Republic engagements, despite this they remain in active duty and are still deployed against the Republic in disputed territory."}, {"tag": "p", "text": "By the time of the Cold War, the Army could be found in large numbers across Sith Space. Some of the troopers stationed on Korriban were corrupted by the planet's dark energies and went psychotic, attacking their own comrades."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Imperial Army was the ground forces of the Sith Empire, and the soldiers of the Empire typically wore gray armor (black being used by commandos) and carried TH-17 or DLA-13 blaster rifles into combat. Ground forces begin live-fire exercises in the jungles of Dromund Kaas within weeks of their enlistment into the military, and even those non-combatants in the military were trained in the use of basic weapons, survival skills, and first aid. The Army also made use of Imperial crawler tanks, walkers, and a number of models of war droids. Imperial heavy troopers were issued full-body gray armor crafted from duraplast, with colored markings signifying their unit or special assignments. Their leg armor was specially designed to preserve mobility and to protect from shrapnel, and while their belt housed extra ammunition and grenades for easy access, the armor's bracers housed environmental and targeting controls, and the readouts on the suit's chest provided medical diagnostics for treating soldiers who were wounded in their armor. Heavy infantry soldiers typically wore about a hundred pounds of armor, and most soldiers carried rifles, sidearms, grenades, and five days of rations. The typical service period for an Imperial soldier was twenty-five to thirty years."}, {"tag": "p", "text": "Imperial Army rank structure was as follows: Private, Specialist, Corporal, Sergeant, Ensign, Lieutenant, Captain, Major, Colonel, and finally General."}, {"tag": "p", "text": "The Imperial Army was divided into various subgroups, including:"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}