{"url": "Imperial_Center_Oversector", "categories": ["Category:Legends articles", "Category:Colonies sectors", "Category:Core Worlds sectors", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors", "Category:Oversectors"], "nodes": [{"tag": "h1", "text": "Imperial Center Oversector"}, {"tag": "p", "text": "The Coruscant Oversector, also known as Sector 1, was the theaters of operations of the Republic 1st Sector Army. It was later known as the Imperial Center Oversector as an Imperial Priority Sector. The Imperial Center Oversector was also known among spacers as Sector Zero."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Coruscant Oversector was dubbed Sector One for its traditional place at the beginning of military briefings. It encompassed all the worlds whose galactic coordinates were positive and began with zero. For that reason, it was known among spacers as \"Sector Zero\". The oversector included Coruscant and the Azure sector in the Galactic Core, and stretched out to include Kiribi, 5,000 light-years away in the Colonies. On galactic maps, Sector Zero is a wedge encompassing about a third of a circle and hugging the Deep Core to the \"southeast' of Coruscant."}, {"tag": "p", "text": "Anaxes, known as the Defender of the Core since the Old Republic, served as the sector capital. Imperial justice was swift and unyielding within this sector. Many spacers noted that legal penalties in Sector Zero were harsher than the Inner Rim."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Coruscant Oversector was the theater of operations of the Republic 1st Sector Army during the Clone Wars. The sector was attacked by Dua Ningo's Bulwark Fleet in 20 BBY. The fleet smashed several military outposts throughout the sector, forcing the Republic to launch its newest Victory-class Star Destroyer. Ningo was eventually defeated over Anaxes by Captains Terrinald Screed and Jan Dodonna."}, {"tag": "p", "text": "After the Declaration of a New Order, the Coruscant Oversector was reorganized in an Imperial Priority Sector and placed under the rule of Grand Moff Trachta. Imperial Center Oversector remained unchanged during Grand Moff Tarkin's reorganization of the Imperial Priority Sectors that saw the disappearance of several oversectors and the creation of Oversector Outer."}, {"tag": "p", "text": "Trachta ruled the sector until his death in 1 BBY, during an attempted coup against Emperor Palpatine. Until the Battle of Yavin, the 1st Sector Army (best known as Azure Hammer Command) and all military forces in Imperial Center Oversector were under command of Grand Admiral Osvald Teshik. At its height, this fleet consisted of the Executor-class Star Dreadnought Whelm and 57 other capital ships. It was later under the authority of Grand Admiral Rufaan Tigellinus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}