{"url": "Imperial_Commando:_501st", "categories": ["Category:Real-world articles", "Category:Imperial Commando novels"], "nodes": [{"tag": "h1", "text": "Imperial Commando: 501st"}, {"tag": "p", "text": "Imperial Commando: 501st is a novel by Karen Traviss. It is a continuation of the Republic Commando series. The book also contains a preview of Darth Bane: Dynasty of Evil."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Clone Wars are over, but for those with reason to run from the new galactic Empire, the battle to survive has only just begun…."}, {"tag": "p", "text": "The Jedi have been decimated in the Great Purge, and the Republic has fallen. Now the former Republic Commandos -- the galaxy's finest special forces troops, cloned from Jango Fett -- find themselves on opposing sides and in very different armor. Some have deserted and fled to Mandalore with the mercenaries, renegade clone troopers, and rogue Jedi who make up Kal Skirata's ragtag resistance to Imperial occupation. Others -- including men from Delta and Omega squads -- now serve as Imperial Commandos, a black ops unit within Vader's own 501st Legion, tasked to hunt down fugitive Jedi and clone deserters."}, {"tag": "p", "text": "For Darman, grieving for his Jedi wife and separated from his son, it's an agonizing test of loyalty. But he's not the only one who'll be forced to test the ties of brotherhood. On Mandalore, clone deserters and the planet's own natives, who have no love for the Jedi, will have their most cherished beliefs challenged. In the savage new galactic order, old feuds may have to be set aside to unite against a far bigger threat, and nobody can take old loyalties for granted."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The book starts off three weeks after the end of the Clone Wars and the declaration of the new Galactic Empire under the new Emperor Palpatine's rule. Darman and his brother Niner, who has healed from a spinal injury on the night of Order 66, are now under the rule of Darth Vader's 501st Legion. The purpose of Vader's cadre of Empire loyal clones is to hunt down and kill any remaining Jedi. Additionally, they are to bring back Padawans to serve as the Emperor's Hand. Along with this Jedi-hunting objective Vader is to hunt down any Jedi sympathizers and clone deserters who have left Palpatine's rule, such as the clone members of Clan Skirata."}, {"tag": "p", "text": "Darman is having an inner struggle as he tries to pull himself together following his wife's, Etain Tur-Mukan's, death. Initially, the squad that Darman and Niner are assigned to incorporate two other clones, Bry and Ennen. Bry is killed in the first Jedi hunting mission on Celen. He is soon replaced by a Spaarti-grown clone, Rede. After Ennen terminates a thug suspected to be a Jedi, he commits suicide. Not looking for any replacements for Ennen, the squad decides to be a three-man deal, and Rede is granted respect by Darman and Niner when he single-handedly kills a Jedi named Borik Yelgo aboard a space station somewhere in the Outer Rim. Meanwhile, Darman and Niner are introduced to Roly Melusar, who gains great respect from the clones in the 501st Legion, including Darman and Niner, for his no-nonsense attitude, his deep sympathy for the clones as people and soldiers, and his deep hatred of Jedi and all Force-users in general, including members of the Emperor's Hand."}, {"tag": "p", "text": "Meanwhile, on the planet Mandalore, Kal Skirata sends most of his Null clone sons, Nyreen Vollen and recently adopted Bardan Jusik to extract Darman and Niner from Imperial Center. However, just as Darman has second thoughts about the assignment just as he and Niner head down to meet with the Skrata brothers. Darman realizes that his own force-sensitive son, Kad, could be in danger of being recruited into the Emperor's Hand if found by the 501st Legion. Seeing how he has the entire Clan Skirata watching over Kad, Darman decides to stay in the 501st Legion in order to monitor, and maybe even sabotage, certain activities within the Empire that might compromise Kad's safety. Being one of Darman's closest brothers, Niner decides to stay too, which brings Jusik, now recently adopted as one of Skirata's sons, Vollen and the Nulls back to Mandalore empty-handed. Nevertheless, Ordo has promised Niner to have comlinks installed both of his and Darman's helmets that allows them to communicate to Clan Skirata over on Mandalore. Jaing even manages to get some dirt on Melusar, and reveals that Melusar came from a planet that was erased from the Republic star charts because it was ruled over by a Sith cult that killed his father, thus triggering Melusar's hatred of all Force-users. This hatred of all Force-users, including all of the members in the Emperor's Hand who serve as intelligence for the Empire, allows Melusar to have Darman and Niner, as well as Rede, skim around Imperial Intel to handle out anti-Jedi operations without the Emperor's Hand's knowledge."}, {"tag": "p", "text": "Skirata's plan to reverse the aging in his clone sons' DNA by Dr. Ovolot Qail Uthan is compromised when Uthan's home planet of Gibad is attacked by the Empire because of their reluctance to join the Imperials. Most, if not all, of Gibad's citizens were exterminated by a toxin created by Uthan herself - a bitter irony - while the actual structures of the planet remain intact. Uthan decides to put a halt on the reverse-aging process for revenge on the Empire for what they've done to Gibad by developing another virus she plans to unleash to the Imperials on Imperial Center. Working with Mij Gilamar, who she has a budding romance with, Uthan receives the supplies she needs to create the virus from the clones, but first develops an antiviral that would render whoever would receive the antiviral immune to the virus Uthan is creating. Skirata, Gilamar, the clones and Jusik go into Keldabe to spread the antiviral around so that the citizens of Mandalore wouldn't be affected by Uthan's virus that she plans to unleash unto the Empire. During Clan Skirata's visit to Keldabe, they spot Dred Priest. Priest happens to be a hated Mandalorian, who is an avid member of the Death Watch, a Mandalorian society that wants Mandalore to return to its old imperial days. Priest was also part of the Cuy'val Dar, and on Kamino, he set up a fight club that clones had been involved in, where they were either brutally wounded or killed. For what Priest did on Kamino, Gilamar and Ordo lead Priest down into an underground chasm where Gilamar kills Priest by stabbing him in a vital artery in the leg. Priest dies from severe blood loss, and Gilamar and Ordo toss his corpse into a churning river."}, {"tag": "p", "text": "Also as part of Skirata's plan to reverse the clones' accelerated aging, Ny Vollen ships in the ancient Kaminoan Jedi Kina Ha, who was engineered by the ancient Kaminoans to cheat death via old age. With Kina Ha is Tallisibeth Enwandung-Esterhazy, or Scout for short. Kina Ha's gracious and pleasant persona happens to almost change Skirata's view of Kaminoans, and Scout shows Skirata that the late Etain Tur-Mukan or Bardan Jusik weren't the only \"sensible\" Jedi he felt good to be around. Unfortunately, Clan Skirata comes to struggle with an inner turmoil over what would happen after Kina Ha's genetic material was used to reverse the clones' accelerated aging. Since the Empire is hunting down for Jedi, keeping Kina Ha and Scout for any longer than is needed would compromise Clan Skirata's safety. One alternative is to simply kill the two Jedi so they wouldn't reveal any information about Clan Skirata's location, willingly or otherwise, or they trade them off with maverick Jedi Master Djinn Altis. The Jedi problem merely gets worse for Skirata when Jusik and Vollen pick up renegade clone trooper Maze, and he has Master Arligan Zey with him, whom Ordo believed to be dead under Maze's hands on the night of Order 66. Zey figures out about Kad's nature, his Force abilities and his parents, and Zey finds out about the Jedi Order's flaws, such as how they are viewed as child stealers. Nevertheless, Skirata, against his better judgment and Vau's logic to simply kill the Jedi, decides to deal with Djinn Altis to trade the three Jedi, as well as wiping out their memories of Clan Skirata's location in case the Empire ever caught them and interrogated them about Skirata and his clanmates."}, {"tag": "p", "text": "Darman realizes about the Jedi being under the same roof as Kad via Fi, and regrets his decision about not going with the Nulls, Jusik and Vollen back to Mandalore, believing Zey, Kina Ha and Scout a threat to Kad's well being as a free Mandalorian instead of an orthodox Jedi under Palpatine's rule. He also figures out about Skirata's deal with Djinn Altis, who is viewed as a threat to the Empire of reestablishing the Jedi Order, and Darman decides that he will hunt down and kill as many Jedi as possible, notably under Altis's rule, for Kad's sake, which would compromise Skirata's deal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "On page 46, Jilka Zan Zentis's first name is misspelled as \"Juka.\""}, {"tag": "p", "text": "On page 226, Besany Wennen's name is erroneously spelled \"Besamy.\""}, {"tag": "p", "text": "This novel originally was to have a sequel, but it was cancelled due to Karen Traviss' departure from Star Wars writing."}, {"tag": "p", "text": "The book derived its name from the fan group 501st Legion, founded in 1997."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Imperial Commando: 501st."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}