{"url": "Imperial_Dropship_Transport", "categories": ["Category:Canon articles", "Category:Dropship classes", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Imperial Dropship Transport"}, {"tag": "p", "text": "The Imperial Dropship Transport (IDT) was a type of airspeeder manufactured by Rothana Heavy Engineering for the ground forces of the Galactic Empire. A smaller and cheaper successor to the LAAT/i gunship deployed by the Galactic Republic during the Clone Wars, it was used to transport and deliver stormtroopers, weapons, or medical droids onto the battlefield."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Imperial Dropship Transport (or IDT for short) was a model of transport airspeeder manufactured by Rothana Heavy Engineering for the ground forces of the Galactic Empire. It greatly resembled Rothana's Clone Wars-era LAAT/i gunship, although with a smaller and more angular build that fitted the modern Imperial aesthetics. It had a trapezoidal silhouette with a gently sloping forward face that bore the cockpit. Its center body was a wide-open compartment that could accommodate two full squads of stormtroopers—that is 18 men. Two large wings, joined at the spine, overhang that compartment. When not in use, the two cargo doors protecting the troop bay remained folded under the main body. Like the LAAT/i, it could reach a maximum altitude of 100 kilometers, and only required a crew of two, one pilot and one gunner. However, it was lightly armed, boasting only wing-mounted twin laser cannons and nose-mounted twin light blaster cannons. It was also equipped with short-range sensors and a loudhailer system."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Unlike its predecessor, which could fill support roles such as air superiority and air-to-ground artillery bombardment, the IDT was only a dropship. It was used by the Imperial Military to transport contingents of stormtroopers, notably allowing to insert troops directly within an enemy base. It could also deliver weapons and medical droids through dangerous territory. As such, the IDT could be considered the aerial equivalent of the K79-S80 Imperial Troop Transport: a simple tool in the service of the Empire's logistical might."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At the end of the Clone Wars, the Galactic Republic restyled itself the Galactic Empire, a change of regime that was accompanied by a military reform. In that context, the LAAT/i, a heavy assault airspeeder that had been used by the Republic, came to be replaced with the IDT, a similar but purposely smaller and cheaper model. Early in the Imperial Era, the Imperial forces garrisoned on the planet Agaris used at least one such airspeeder, which was notably deployed during the attempt to apprehend the fugitives Milo and Lina Graf. It was said that not much inspired fear in Rebel Alliance soldiers more than the sight of a fleet of IDTs on the horizon, brimming with stormtroopers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Dropship Transport made its first canonical appearance in Star Wars: Commander, a mobile strategy game which was developed by Disney Interactive and released on August 21, 2014 for iOS devices. However, it was created for Star Wars: The Force Unleashed, a Legends video game that was released on September 16, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}