{"url": "Imperial_Election_of_44_ABY", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Changes of government"], "nodes": [{"tag": "h1", "text": "Imperial Election of 44 ABY"}, {"tag": "p", "text": "The Imperial Election of 44 ABY was the day that citizens of the Imperial Remnant voted for the first time to elect their Head of State. The candidates were incumbent Head of State Jagged Fel, former Imperial Admiral and Galactic Alliance Chief of State Natasi Daala and Imperial Admiral Vitor Reige."}, {"tag": "h2", "text": "Before the election"}, {"tag": "p", "text": "Abeloth, who was posing as Imperial Lieutenant Lydea Pagorski at the time, convinced Natasi Daala that a general election would be the best way to gain control of the Imperial Remnant. Daala, who wanted to take revenge on Jagged Fel for helping the Jedi chase her from Coruscant, managed to have Fel hold the election. Fel later convinced Vitor Reige to enter the race to split the vote of the military which was believed to vote for Daala. Fel also ordered a strike on Daala's campaign headquarters on Hagamoor 3 where Tol Getelles experimented on drochs."}, {"tag": "h2", "text": "Day of the election"}, {"tag": "p", "text": "On the day of the elections, the final debate was held several hours before the polls were opened. Fel started with his opening statements in which he informed the public that the Empire he signed a charter with INN (Imperial News Network) stating that they were free from censoring from the military, the Moffs, and the Head of State. He then went on to confess to ordering the destruction of Daala's headquarters and explained the experiments that took place there. With the help of Getelles who spoke to confirm these facts, Daala was unable to deny the accusations. Fel then announced that he was stepping down from the race, having ordered his name removed from the ballots and resigning as Head of State - instead endorsing Reige. With public opinion swayed by the revelation of the droch experimentation and Fel's endorsement, Reige was able to win the election easily."}, {"tag": "h2", "text": "Appearances"}]}