{"url": "Imperial_Executive_Building", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Coruscant government buildings", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Senate Office Building locations"], "nodes": [{"tag": "h1", "text": "Imperial Executive Building"}, {"tag": "p", "text": "The Imperial Executive Building, also known as the Senate Office Building, was a dome-shaped office building located near the Galactic Senate Building on the planet Coruscant. It was also referred to as the Republic executive building or the Senate executive building during the time of the Galactic Republic. The executive building contained offices for members of the Galactic Senate, as well as the office of Supreme Chancellor Sheev Palpatine. A number of landing bays were located at the upper levels of the building."}, {"tag": "p", "text": "It was from the executive building that Chancellor Palpatine directed the Republic's military efforts during the Clone Wars. When the Jedi Order discovered Palpatine's true identity as the Sith Lord Darth Sidious, four Jedi Masters, including Mace Windu, attempted to arrest him in his office. Palpatine engaged them in a lightsaber duel, killing three Jedi before Windu ultimately overpowered him. However, before Windu could strike the killing blow, Jedi Knight Anakin Skywalker stormed into the chancellor's office and demanded that Palpatine be taken alive, believing Palpatine had the power keep Skywalker's wife, Padmé Amidala, alive. Windu asserted that Palpatine was too dangerous to live, but Skywalker severed his arm, allowing Palpatine to attack Windu with Force lightning—blasting the Jedi champion out of the sprawling office window and to his death. With Windu's demise and Skywalker's fall to the dark side of the Force, Sidious issued Order 66 to the clone troopers of the Grand Army of the Republic, declaring all Jedi enemies of the state."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}