{"url": "Imperial_Environmental_Preservation_%26_Refocusing_Authority", "categories": ["Category:Legends articles", "Category:Articles with an excess of redlinks", "Category:Articles with cut elements", "Category:Imperial Departments"], "nodes": [{"tag": "h1", "text": "Imperial Environmental Preservation & Refocusing Authority"}, {"tag": "p", "text": "The Imperial Environmental Preservation & Refocusing Authority, also known generally as the Imperial Preservation & Refocusing Authority, or the IEPRA for short, was a government department of the Galactic Empire staffed by a Deputy Associate Operations Director, Lieutenant Rille Nuder and other Imperial officials during the time of the Galactic Civil War. The department conducted operations on multiple worlds throughout the galaxy, including Naboo, and comprised of a branch named the Office of Biosphere Control and Repurposing. Although the department was responsible for benefiting planetary environments by reducing the proliferation of dangerous flora, fauna, viruses and diseases, the IEPRA also drew criticism for their policy of exploiting natural resources under the cover of progress, turning natural worlds into factory planets, and endangering entire planetary ecosystems."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Activities on Naboo"}, {"tag": "p", "text": "By the time following the Battle of Yavin in 0 BBY, the Imperial Environmental Preservation & Refocusing Authority, or the IEPRA for short, conducted routine missions to expunge dangerous and nuisance animals from any area where Imperial agents were scheduled to establish service posts on the planet Naboo. According to the IEPRA, these temporary survey sites were established in the wilds of Naboo for the purposes of galactic security. The IEPRA found it expedient to hire private contractors for this type of work, and frequently sent coordinates to hunters who wished to aid the IEPRA in removing wildlife. However, the IEPRA also experienced problems with the larger creatures of Naboo somehow managing to encroach upon their temporary sites. They consulted the Royal Naturalist Society of Naboo for advice, but the IEPRA alleged that they offered no insight as to why their wildlife eradication protocol was failing. As the IEPRA continued to research this problem, they called upon additional hunters to manually clear these areas again, so that their agents could conduct their business in peace."}, {"tag": "p", "text": "Consequently, the Royal Naturalist Society of Naboo became incensed at the behavior of the Imperial Environmental Preservation & Refocusing Authority. According to the Society, to accommodate the various Imperial sites on the planet's surface, the IEPRA had interfered with the rich ecosystem of Naboo. This was argued to have disrupted the natural balance of predator and prey on the lush Mid Rim world. To restore this balance, the Society identified several habitats in which both predatory and prey species needed to be culled in order to realign the population. The Society called on hunters to participate in their program. However, the efforts of the Society did little to deter the actions of the IEPRA. Even after the Society's attempts to preserve the natural balance of Naboo's ecosystem, the IEPRA continued to eradicate additional creatures. The Royal Naturalist Society likened the killers of these animals to \"despicable murderers.\" Feeling as though they had no choice but to respond again, the Society called upon the services of outdoorsmen willing to euthanize the starving animals which survived what the Society referred to as the \"Empire's heartless campaign.\" In an effort to save Naboo from the apparently destructive actions of the Empire, the Society provided the coordinates to the locations of these killing grounds."}, {"tag": "p", "text": "Indeed, the IEPRA was on occasion forced to solve problems created by the very Empire they served. In one instance, local animals ended up ingesting contaminated runoff from the Emperor's Retreat, a private sanctuary for Emperor Palpatine nestled within Naboo's Gallo Mountains. The IEPRA feared that the creatures which ingested the runoff posed a significant risk to the planetary ecosystem. The creatures had since dispersed to various places on the planet, forcing the IEPRA to contract additional hunters to dispose of these animals as quickly as possible. IEPRA satellite droids isolated several potential locations where these contaminated animals might be found. These coordinates were made available to qualified applicants."}, {"tag": "p", "text": "Meanwhile, in Naboo's city of Keren, a petty thief by the name of Brennis Doore made an effort to turn his life around. Feeling as though a government job would be the answer to all his problems, Doore tasked a spacer with delivering an application to Lieutenant Rille Nuder, a representative of the Imperial Environmental Preservation & Refocusing Authority. Although Brennis Doore surmised that the IEPRA was a flawed institution which exploited a planet's natural resources under the guise of progress, he believed himself well suited for a position within the department. The spacer agreed to help Doore, and delivered his application to Lieutenant Nuder, who was conducting business in an off limits area of Naboo being surveyed by the IEPRA. When Lieutenant Nuder finally received Doore's application, the Imperial officer told the spacer that he would review it after he finished processing the almost ten thousand applications waiting for him at his office."}, {"tag": "h3", "text": "Assassination of an Imperial Environmental Refocusing Official"}, {"tag": "p", "text": "In the meantime, a citizen became angered at an Imperial Environmental Refocusing Official for their alleged plans to destroy the ecosystem of their homeworld and turn it into a factory planet. To slow their progress, the citizen took it upon themselves to murder the IEPRA official. However, because the assassin left behind their sniper rifle, the Empire discovered the identity of the assailant. The Empire subsequently issued a bounty on the target, who was believed to be \"moderately armed\" and \"medium-threat.\" A bounty hunter contracted by the Bounty Hunters' Guild ultimately succeeded in locating and eliminating the target, but not without being ordered by the Empire to give the following message to the target before termination: \"You left your sniper rifle behind. Very sloppy.\" Following the death of the target, the Empire sent their congratulations, but discouraged the bounty hunter from publicizing their success. The Empire believed that these types of murderers often wished to die a public death, and become seen as martyrs."}, {"tag": "h3", "text": "Environmental Activities Throughout the Galaxy"}, {"tag": "p", "text": "Despite its often negative reputation, the Imperial Environmental Preservation & Refocusing Authority did on occasion conduct environmental initiatives for the benefit of citizens throughout the galaxy. For instance, the IEPRA, beset by manpower shortages, nevertheless contracted the services of individuals willing to help nerf herders plagued by creatures spooking their nerfs and causing stampedes. Likewise, when a separate group of nerfs infected with an experimental virus were accidentally released into the wild instead of being destroyed, the IEPRA tracked down all the possible locations where the diseased animals may have ended up and performed extensive surveillance. Although the nerfs in those areas were vaporized, some of the areas also contained a variety of other dangerous predators. Not willing to risk the virus spreading, the IEPRA called on individuals to wipe out the predators on the off chance that they devoured infected nerfs. To allay the hunters' concerns, the IEPRA assured them that the virus was harmless to most sentient species. Furthermore, to halt the spread of Hesken Fever, the IEPRA hired individuals to destroy vermin related to the infestation, thus preventing the disease from spreading to other settlements. Every year, the IEPRA also oversaw the extermination of pests during seasonal infestations, paying usual fees for every nest that was cleared. The IEPRA was also forced to undo the damage caused by a geneticist who had been performing illegal cloning and gene manipulation experiments in an attempt to create exotic animal hybrids. Although the geneticist was arrested by the Imperial Office of Criminal Investigations, some of his experiments were already released into wilderness areas so that he could study their adaptability. Unfortunately for the residents of these areas, many of the hybrids survived and began reproducing. With dens of these creatures spread throughout the Empire, the IEPRA deemed it prudent to clean them out. To succeed in this endeavor, they paid enterprising individuals a handsome reward for every den that was destroyed."}, {"tag": "p", "text": "The IEPRA also became concerned with the Periodic Overland Migration, an irregular large-scale movement of local herbivores between widely separated feeding grounds. Predators followed this herd in unusually large numbers. Due to recent settlement of the area around the migration, these predators started to present a danger to the locals. According to the IEPRA's research, if one pack were to make a successful attack on the local sentients, other packs would converge and adopt the practice opportunistically. Ergo, the IEPRA's Office of Biosphere Control and Repurposing began contracting with experienced strike teams to cull designated packs in high-threat areas. The IEPRA instructed these strike teams to report successful culls to their Deputy Associate Operations Director. Additionally, after the fall of the Old Republic, many predators destined for the Geonosian Petranaki gladiator arenas of Geonosis ended up spread throughout the Outer Rim Territories and even in many Core Systems. Most of these beasts died out on their own or were hunted by locals, but a few had survived here and there. The IEPRA paid experienced hunters to visit these systems and wipe out the beasts that survived. In many cases, the IEPRA believed that they would be doing the system's ecology a favor, as many of those creatures should never have made it to those systems in the first place."}, {"tag": "p", "text": "Nevertheless, many of the IEPRA's actions were not necessitated by environmental concerns, but rather by commercial importance. When a dangerous pack of predators began terrorizing the workers of a land owner, the IEPRA demanded a fortune to clear out the pests. Ultimately, the frustrated land owner ended up losing six of his workers to the flesh-eating creatures, while another twelve ended up quitting. Unable to rely on the services of the IEPRA, the land owner resorted to hiring a private individual to eliminate the predators. Although they would not help the land owner, the IEPRA did become involved in the process of clearing other undeveloped land so that Corporate Sector Authority land surveyors could assess the property for purchase. To allay concerns lobbied by the Intergalactic Zoological Society, the IEPRA assured them that the greatest care would be taken in relocating any indigenous creatures. In actuality, however, the IEPRA instructed their contractors to \"just blast those little buggers into oblivion.\" The IEPRA assured their exterminators that if the IZS lodged a protest with their office, they would be able to provide them with proper documentation. The IEPRA made it clear that their only concern was to ensure the absolute safety of the land surveyors. Indeed, the IEPRA often found itself frustrated by the IZS and other wildlife preservationists promoting what the IEPRA called their \"bleeding heart causes.\" Annoyed by the preservationists attempts to save every obscure beast in the galaxy, the IEPRA facetiously considered sending a bill to the Intergalactic Zoological Society for all the nests they had to destroy due to overpopulation concerns."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Imperial Environmental Preservation & Refocusing Authority was a government department of the Galactic Empire tasked with the responsibility of controlling the ecology of multiple worlds throughout the galaxy, including the lush planet of Naboo. This involved clearing away wild vegetation and dangerous fauna which threatened to encroach upon newly constructed Imperial settlements. The IEPRA was also responsible for minimizing the spread of diseases and viruses which posed a risk to the public. This often involved the use of satellite tracking to locate herds of harmful species, as well as the use of private hunters contracted by the IEPRA to expunge large numbers of nuisance creatures. The IEPRA also worked towards controlling the population of various species. However, many of the IEPRA's actions drew ire from citizens and institutions alike for their part in industrializing worlds, exploiting natural resources, and endangering entire planetary ecosystems."}, {"tag": "p", "text": "As a department of the Galactic Empire, the Imperial Environmental Preservation & Refocusing Authority oversaw at least one branch named the Office of Biosphere Control and Repurposing. They also employed a Deputy Associate Operations Director and multiple Imperial officers, including a lieutenant named Rille Nuder who served as a representative of the IEPRA. As representative, Rille Nuder oversaw survey sites and processed thousands of job applications for positions within the department. The department as a whole held something of a rivalry with the Intergalactic Zoological Society and other environmentalists who interfered with the department's objectives. However, the IEPRA did attempt to collaborate with the Royal Naturalist Society of Naboo for advice on how to best pursue their wildlife eradication program."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Environmental Preservation & Refocusing Authority, or the IEPRA, appeared in the 2003 massively multiplayer online role-playing game Star Wars Galaxies: An Empire Divided, developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. In the game, the IEPRA was featured in multiple generic \"destroy\" mission terminal quests of various difficulty, requiring players to destroy creature lairs on multiple planets, including Naboo, for a credit payout. In addition to the standard mission terminal quests, a bounty hunter mission terminal quest titled Killer of Imperial Environmental Refocusing Official also featured the IEPRA. Aside from these mission terminal quests, the IEPRA was also involved in the third and final quest given by Brennis Doore, a non-player character located in the city of Keren. In this quest, Brennis Doore tasked the player with delivering a job application in the form of a datadisc to Rille Nuder, a representative of the IEPRA. For completing this task, the player would receive 100 credits."}, {"tag": "h3", "text": "Cut content"}, {"tag": "p", "text": "The game's directory tree files contain details for additional NPC quests featuring the IEPRA in at least some capacity. Two of these were NPC \"destroy\" quests titled Become a Mighty Hunter, and Balance of Nature. The other two, titled Honor a Pioneer, and Gasbladder Researcher, were designed as NPC \"escort\" quests. The IEPRA is featured in the quest dialogue for all these quests. For instance, Honor a Pioneer includes information on Haum Choda, an individual who started a local bureau of the IEPRA. However, as this specific content is not definitively known to have appeared on the live servers, this article considers the material cut, and therefore non-canon in Legends."}, {"tag": "p", "text": "At some point during the reign of the Galactic Empire, a wilderness aficionado by the name of Haum Choda successfully introduced Imperial environmental regulations to his homeworld and started a local bureau of the Imperial Environmental Preservation & Refocusing Authority. Sometime following 0 BBY, an admirer of Haum Choda went on a hike outside of town to honor the 111th anniversary of his birth. However, when the hiker failed to return home, a concerned neighbor tasked a spacer with finding the scatterbrained wanderer, and returning them safely to town before the weather turned bad."}, {"tag": "p", "text": "Elsewhere, a hired researcher discovered new evidence of the off-world origin of the perennial stinking gasbladder, a noxious type of weed. However, before the researcher could complete their report on the local flora, they ended up getting lost in the wilderness. Nevertheless, the researcher was saved by a spacer tasked with the responsibility of finding and escorting the individual back to safety. After the researcher was rescued, it was believed that the data collected from the study could be used to secure a grant from the IEPRA to destroy all of the noxious gasbladder weeds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}