{"url": "Anacondan", "categories": ["Category:Canon articles", "Category:Anacondans", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Anacondan"}, {"tag": "p", "text": "Anacondans were a snakelike sentient species."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Anacondans were snake-like sentients whose long, tapering, cylindrical bodies could measure up to 4.7 meters in length. Because they lacked limbs, they moved along on the ground with a twisting movement, using their tails to grab hold of objects. Their heads featured a large mouth filled with needle-like teeth and two expressive eyes with lids, but lacked visible ears."}, {"tag": "p", "text": "Their scaly skin could be evenly colored or mottled. Known patterns included rusty grey and red and yellow. Their eye colors ranged from yellow to blue."}, {"tag": "p", "text": "The Anacondans possessed speech organs that allowed them to speak Galactic Basic Standard without difficulty."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Due to their serpentine nature, Anacondans typically wore no clothes at all."}, {"tag": "h2", "text": "Anacondans in the galaxy"}, {"tag": "p", "text": "Due to their appearance, Anacondans were often mistaken for pests. During the High Republic Era, the Anacondan doctor Gino'le served as Chief of Medical Operations aboard the Starlight Beacon space station, having outfitted himself with cybernetic limbs to better treat patients. By the time of the Clone Wars, some Anacondans had made their way to Coruscant, the capital world of the Galactic Republic. One of them worked as a bartender in Trueping's, a dodgy cantina buried in the depths of Coruscant."}, {"tag": "p", "text": "Another Anacondan, named Morley, lived on the junk planet Lotho Minor. Morley cut a deal there with the exiled former Sith Lord Maul as a means of survival."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}