{"url": "Imperial_Government_Complex", "categories": ["Category:Legends articles", "Category:Kal'Shebbol locations"], "nodes": [{"tag": "h1", "text": "Imperial Government Complex"}, {"tag": "p", "text": "The Imperial Government Complex was the name given to Moff Kentor Sarne's headquarters on the planet Kal'Shebbol. It was used as both his command center and personal residence during his time as governor of the Kathol sector."}, {"tag": "h2", "text": "Information"}, {"tag": "h3", "text": "Defenses"}, {"tag": "p", "text": "The complex was protected by an energy shield, although the generators were antique compared to other systems, and 1.4 FD P-Towers provided defense. Elements of Sarne's Stormtroopers were also presumably garrisoned at the base."}, {"tag": "h3", "text": "Facilities"}, {"tag": "p", "text": "The complex contained a command center, able to coordinate the defense of the planet, and the controls for the defense shield was located in the facility. The complex was also associated with the Ubiqtorate; rumors circulated that they used to run their Internal Operations out of the building."}, {"tag": "p", "text": "Sarne kept his quarters in the base, with a secret tunnel leading to a hangar bay where he stored the Carrack-class light cruiser Ambition. The hangar also contained controls for the shields, enabling them to be raised or lowered to allow the Ambition to come and go as it pleased."}, {"tag": "p", "text": "Sarne also maintained a large detention center in the complex, where he kept political prisoners, Imperial officers on the wrong side of his \"loyalty purges,\" and alien gladiators forced to fight for his amusement."}, {"tag": "h3", "text": "The Battle of Kal'Shebbol"}, {"tag": "p", "text": "During the Battle of Kal'Shebbol, the complex was infiltrated by the New Republic's Page's Commandos, who were tasked with disabling the energy shield. Gaining entrance through an armored corridor that had been opened to the outside via an accident with a piece of DarkStryder technology, the commandos successfully infiltrated the complex and disabled the shields, although Sarne managed to escape. However, during his escape, he had ordered the majority of officers to remain at their posts to keep fighting the invasion. These officers and soldiers were presumably either captured or killed when the New Republic took the complex."}, {"tag": "h3", "text": "The New Republic"}, {"tag": "p", "text": "With the New Republic in control of Kal'Shebbol, Lieutenant Judder Page quickly made the complex his command center. Part of his reasoning was to protect whatever Ubiqtorate information may have been left behind. Unfortunately, Sarne had initiated Omega order five, which had wiped the base's computers. The New Republic's Governor Monjai most likely used the facility as her headquarters when she took charge of the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}