{"url": "Imperial_Gozanti-class_cruiser", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:First Order starship classes", "Category:Galactic Empire starship classes", "Category:Gozanti-class cruisers", "Category:Light cruiser classes"], "nodes": [{"tag": "h1", "text": "Imperial Gozanti-class cruiser"}, {"tag": "p", "text": "The Imperial Gozanti-class cruiser, also referred to as the Imperial Gozanti-class TIE carrier and known generally as the Imperial freighter, was a variant of the standard Gozanti-class cruiser used by the Galactic Empire and later by sympathizers of the First Order."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Imperial Gozanti-class cruiser was a 64-meter long starship that served as a light cruiser. It was a modified sub-variant of the civilian Gozanti-class cruiser used by many factions."}, {"tag": "p", "text": "It sported a twin laser turret in a dorsal mount and a heavy laser cannon on its ventral side. The Gozanti also had a loading elevator on the bottom near the nose and docking ports to the side near the cockpit section. The ships had a hyperdrive and three engines. The ships could fit in the main hangar of a Separatist supply ship."}, {"tag": "p", "text": "The Imperial version could choose to carry either four TIE/ln space superiority starfighters, or have one swapped for a TIE/sa bomber, two All Terrain Defense Pods on underside-mounted docking clamps which were connected to corridors inside the vessel. The Imperial ships were wider than standard ones, with new side extensions stretching over the engines, and the dorsal radar dish being moved to the center. The large, ventral, double dish radar was abandoned in favor of docking struts for the ship's complement."}, {"tag": "p", "text": "Some Imperial Gozanti-class cruisers, such as the Vector, featured red markings. The Gozanti-class Assault Carrier was a carrier variant of a standard Imperial Gozanti."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Imperial cruisers"}, {"tag": "p", "text": "Several years after the rise of the Empire, the freighters were converted into TIE carriers via a quartet of ventral-mounted heavy docking clamps. The clamps also double as boarding chutes between the transport and any vehicle they carry. Imperial efficiency expert Count Denetrius Vidian was instrumental in the development program, getting it ready ahead of schedule. Several Gozanti-class cruisers were present at Count Vidian's Calcoraan Depot, and were ordered to protect a Baradium-357 convoy at Gorse."}, {"tag": "p", "text": "During the reign of the Empire, the cruisers were also known as the Imperial freighters and were more common in the Outer Rim despite its use by the Empire. After graduating from the Royal Imperial Academy, Lieutenant Thrawn and Ensign Eli Vanto were stationed aboard the Blood Crow, an Imperial Gozanti-class cruiser under the command of Rik Virgilio. In 5 BBY, a group of rebels known as the Spectres raided Transport 651 in order to rescue a group of Wookiee slaves, but it was a trap set by ISB Agent Kallus. The rebels detonated explosives, destroying the freighter after it was secured in the hangar of the Lawbringer. Soon after, Kallus and a squad of stormtroopers later took a freighter to attack the same rebel cell after they stole a shipment of T-7 ion disruptor rifles. The ship dropped two AT-DPs, which were destroyed by the rebels."}, {"tag": "p", "text": "Weeks later, a convoy of three cruisers were tasked with transporting a large kyber crystal. The same Lothal rebel cell captured an Imperial decoder and discovered the convoy's location. The starship Ghost arrived and launched its shuttle, piloted by former Jedi Kanan Jarrus, to distract the convoy's TIE escorts. The lead freighter attempted to flee back into hyperspace, but was destroyed by the Ghost. The kyber crystal amplified the explosion and destroyed the rest of the Imperial ships."}, {"tag": "p", "text": "In 4 BBY, Transport Ship 63378 was stolen by the same rebel cell on Lothal. The cruiser was used in the action at Mustafar, a rescue attempt by the Spectres to save Kanan, who had been captured by Grand Moff Wilhuff Tarkin, and was being interrogated on his Star Destroyer, the Sovereign, in orbit above Mustafar. The same year, several Gozanti freighters took part in the Imperial blockade of Ibaar. They deployed starfighters against Phoenix Cell ships attempting to break the blockade."}, {"tag": "p", "text": "In 3 BBY, a cruiser was used to deploy two AT-AT walkers to the Imperial depot on Lothal. In 2 BBY, two Gozanti cruisers were used to deploy pairs of AT-AT and AT-DP walkers against a Separatist holdout on Agamar. Imperial forces also lost two cruisers during a skirmish with the Iron Squadron and Phoenix Group above Mykapo. A Gozanti cruiser later accompanied an Imperial light cruiser during a failed attempt to capture the rogue Senator Mon Mothma."}, {"tag": "p", "text": "In 0 BBY, at least two Gozanti cruisers were among a detachment of the Seventh Fleet blockading Lothal."}, {"tag": "h3", "text": "Post-Scarif Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War, smugglers also used the cruisers. Following the Battle of Yavin, Imperial officers Ciena Ree and Berisse Sai were ordered to take a Gozanti to recover Lord Vader. Once they arrived at Yavin, they surveyed the destruction of the Death Star, and then Vader's starfighter docked with them. Vader ordered the two officers into the cargo bay, and piloted the ship himself back to the Imperial fleet."}, {"tag": "p", "text": "While transporting Grakkus Jahibakti Tingi to Akiva in the Millennium Falcon, the smugglers Han Solo and Chewbacca encountered TIE fighters. Wondering where the Imperial starfighters had come from, Solo speculated that there must be a Gozanti-class cruiser nearby."}, {"tag": "p", "text": "Captain Kosh of the Empire stockpiled several cruisers which had been listed as destroyed to use them in his black market operation, although they were discovered by the Rebel Alliance on Tatooine and destroyed by Saponza's partner."}, {"tag": "p", "text": "One of the freighters showed up during Twilight Company's raid on an Imperial heavy freighter, threatening the Thunderstrike. The freighters were present alongside Death Squadron during the Battle of Hoth, where they deployed walkers during the battle."}, {"tag": "h3", "text": "After the Empire"}, {"tag": "p", "text": "Imperial Gozanti-class cruisers continued to be in use during the Cold War on into the First Order/Resistance War. The First Order employed sympathizers that piloted these older Imperial-era ships for use in patrol and surveillance operations."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The young readers book Star Wars Rebels: Head to Head, written by Pablo Hidalgo and featuring various match-ups from the series, placed an Imperial Gozanti cruiser against an Auzituck anti-slaver gunship, with the gunship damaging the cruiser and escaping."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}