{"url": "Imperial_II-class_Star_Destroyer/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Alliance to Restore the Republic starship classes", "Category:Galactic Alliance starship classes", "Category:Galactic Empire starship classes", "Category:Imperial II-class Star Destroyers", "Category:New Republic starship classes", "Category:Star Destroyer classes"], "nodes": [{"tag": "h1", "text": "Imperial II-class Star Destroyer"}, {"tag": "p", "text": "The Imperial II-class Star Destroyer, also known as the Imperial II-class Destroyer and colloquially the ImpStar Deuce, was a Star Destroyer model that was derived from the Imperial I-class Star Destroyer."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Several differences existed between the Imperial I and Imperial II-class Star Destroyer, including the replacement of the tractor beam targeting array between the command tower's sensor globes with a communications tower, as well as the removal of point defense weaponry."}, {"tag": "p", "text": "The Imperial II was built with a heavily reinforced hull, stronger deflector shields, and greater firepower than the original Imperial I class. The prominent quad heavy turbolaser and heavy ion cannon turrets flanking the surface of the Imperial I-class Star Destroyer were also replaced with batteries of eight-barreled turbolasers or ions in unarmored barbette mountings. Another new feature included two parallel \"claws\" for grappling smaller starships placed in the ventral secondary docking bay."}, {"tag": "p", "text": "During the height of the Rebellion, an Alliance Special Operations man said that the Star Destroyer had 174,000 design flaws waiting to be exploited. The command deck was also a vulnerability, as the ship's operations were coordinated there. Removal of point defense weapons was perhaps the greatest issue, due to the Alliance's heavy use of starfighters."}, {"tag": "p", "text": "Despite these flaws as well as the vast resources required to maintain and crew the vessels, they nevertheless remained formidable front line units, even when compared to more efficient and modern designs such as the Nebula-class and Turbulent-class Star Destroyers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The class began with the prototype Imperial II known as the Empire, commanded by Admiral Feyet Kiez. The vessel was more powerful than later vessels of the line and was said to have amassed a reputation similar to that of the Executor. The first operational ships of this class began to appear in service shortly before the Battle of Yavin."}, {"tag": "p", "text": "Many participated at the Battle of Hoth, such as the Avenger and Stalker. During the final years of the Galactic Empire under Emperor Palpatine's rule, this starship was instrumental in the implementation of the Tarkin Doctrine."}, {"tag": "p", "text": "The class also participated in the Battle of Endor in 4 ABY and three Destroyers had their barbette mountings destroyed by Arvel Crynyd to protect the Rebel cruiser Home One."}, {"tag": "p", "text": "The class remained in service for a significant length of time, despite more advanced starship designs being available. These warships were seen even during the Yuuzhan Vong War, being used for both offensive and defensive roles in critical missions. However, use of the Imperial II was not limited solely to the military."}, {"tag": "p", "text": "During the events of the Second Galactic Civil War, the class remained operational, as Jacen Solo commanded the Anakin Solo, a heavily upgraded and modified vessel which was in the service of the Galactic Alliance Guard."}, {"tag": "p", "text": "When the Imperial Remnant finally entered the war, it was able to field a fleet of these vessels, showing the type's prolonged service to the Empire. Supreme Commander Gilad Pellaeon, however, chose the Bloodfin, a newly built Turbulent-class Star Destroyer, as the Imperial flagship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The most prominent weapons on the second Star Destroyer model that appears in The Empire Strikes Back and Return of the Jedi are eight barbette mountings, each mounting eight gun-barrels, which are arranged in rows of four on either side of the superstructure. They replace the heavy turbolasers and heavy ion cannons on the ISD-I."}, {"tag": "p", "text": "Numerous Expanded Universe sources cite the armament of the Imperial II as consisting of 50 turbolasers, heavy turbolasers or turbolaser batteries, and ion cannons."}, {"tag": "p", "text": "At present, there is no canon source defining how the visible guns on the model relate to the armament stated in secondary sources, but the most likely estimation is that they correspond to weapons-distribution similar to earlier models like the Imperial I-class and the Venator-class. The guns on each side of the superstructure would then be the heaviest."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}