{"url": "Imperial_Information_Office", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Imperial Intelligence bureaus and branches"], "nodes": [{"tag": "h1", "text": "Imperial Information Office"}, {"tag": "p", "text": "The Imperial Information Office (IIO) was an Imperial government office that was part of Imperial Intelligence. The Rodian Tseebo was an employee of the Information Office before escaping with the help of the Spectres rebel cell. Later, a team of IIO operatives led by Controller LT-319 tried to expose the location of Chopper Base by hacking into the astromech droid Chopper."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Imperial Information Office was a branch of Imperial Intelligence, which along with the Imperial Security Bureau was one of the Galactic Empire's two major intelligence agencies. Several IIO workers wore AJ^6 cyborg constructs, brain implants which could connect to computers and download information, to increase efficiency. As a branch of Imperial Intelligence, IIO operatives had access to Imperial Intelligence resources such as the IGV-55 surveillance vessel, which were used to monitor communications and scan data for signs of rebel activity and sedition."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Imperial Era, the Rodian Tseebo worked for the Imperial Information Office on the planet Lothal and was outfitted with an AJ^6 cybernetic implant, which he later used to download Imperial secrets onto the headpiece. This data included information on the new TIEs and raptors, schedules of troop movements, tactics, strategies, and a five year plan for Lothal and every other world in the Outer Rim Territories. The vast data surge caused Tseebo to exhibit erratic behavior. On Empire Day in 4 BBY, Tseebo defected from the Empire and escaped offworld with the help of the Spectres. The Spectres spirited Tseebo away into hiding."}, {"tag": "p", "text": "Later, an IIO group lead by Controller LT-319 hacked into the Spectres' C1-series astromech droid Chopper, in order to discover the location of the Phoenix Cell's base. Under LT-319's direction, Chopper attempted to kill his rebel comrades and download the VCX-100 light freighter's Ghost's navigational computer. However, the Spectres and Wedge Antilles managed to retake control of the ship and Chopper. After Chopper's owner Hera Syndulla reprogrammed Chopper, she transmitted the data feed back to LT-319's IGV-55 surveillance vessel, causing a data surge that overloaded the ship's memory core. The Imperial analysts were killed when their ship exploded."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Information Office first appeared in the Star Wars Rebels episode \"Empire Day,\" which premiered on November 10, 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}