{"url": "Imperial_Information_Center", "categories": ["Category:Legends articles", "Category:Data storage and processing", "Category:Imperial Palace locations"], "nodes": [{"tag": "h1", "text": "Imperial Information Center"}, {"tag": "p", "text": "The Imperial Information Center was a facility located deep within the bedrock of Coruscant, part of the Imperial Palace complex. It serviced the Palace of the Republic before it was inherited by the Galactic Empire, and later the New Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built into Coruscant's bedrock deep beneath the Palace of the Republic, the Information Center stored classified government documents, supplementing the Palace's data towers which erupted from its upper levels. Center staff consist human technicians and droids who processed millions reports including political, military and economic. Staffers who worked here were subjected to the mind probes and loyalty conditioning. It was guarded by the elite Imperial Guards. When the Galactic Empire rose to power, the Information Center began to house encrypted military files in addition to the centuries-old weather reports from the surface and other data such as Emperor Palpatine's nightly dinner menu. While highly protected, infiltration was not impossible. Durga the Hutt hired a slicer to gain access to the Center's databanks, successfully stealing information that would go into the completion of the Darksaber Project."}, {"tag": "p", "text": "When the New Republic ousted the Empire during the liberation of Coruscant they took the Palace and managed to preserve the Information Center because it contains important information on the planets former Empire and for intelligence operations. During the New Republic's occupation of the Palace, the Historical Council used files from the Center to write The Essential Chronology."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}