{"url": "Imperial_Intelligence", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Imperial Intelligence of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Imperial Intelligence"}, {"tag": "p", "text": "Imperial Intelligence, also known as Military Intelligence (MI) or Imperial Military Intelligence, was an espionage organization of the Galactic Empire that provided services on their own accord and also fed resources to the other Imperial Military branches, the Joint Chiefs, and Emperor Sheev Palpatine. Imperial Intelligence was organized out of five Galactic Republic intelligence agencies, one of those was Republic Intelligence. The agency orchestrated the Senatorial arrests and played a big role in the intelligence gathering during the Berch Teller campaign. It had oversight of the operations of the Naval Intelligence Agency which was briefly made its own separate organization before being folded back under Imperial Intelligence. MI had weapons development oversight of Advanced Weapons Research. Director Orson Callan Krennic, the leader of the secretive department was a member of Imperial Intelligence. Whilst a member of Military Intelligence, Krennic used every tool at his disposal to find Galen Walton Erso. In 4 BBY, Tseebo, an agent of the MI affiliated Imperial Information Office, fled with confidential data. The Rodian escaped from Lothal into hiding with the help of the Spectres rebel cell. Later on, IIO Controller LT-319 and the personnel of his IGV-55 surveillance vessel embarked on an mission to hijack the Spectres' C1-series astromech droid Chopper and use him to obtain intelligence on the Phoenix Cell's hidden base. However, they were defeated by Chopper's rebel allies and the former Imperial RA-7 protocol droid AP-5. In roughly 1 BBY, a squad of death troopers were tasked with guarding a kyber crystal being transported aboard a freighter to the Tonnis sector for Project Stardust. Death troopers led by Director Krennic executed several scientists to punish their team leader Galen Walton Erso for conspiring with enemies of the Galactic Empire. Furthermore, death troopers participated in the battle of Scarif and the battle for Tatooine during the Galactic Civil War. In around 1 ABY, Imperial Intelligence had leads on a Rebel Alliance outpost, which eventually resulted in its destruction by the members of Task Force 99."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Galactic Empire had carefully divided its intelligence and counter-intelligence efforts beneath two different organizations. Information that dealt primary with military matters fell under Imperial Intelligence, a branch of the Imperial Military. Meanwhile, information that dealt with potential insurrection and treason fell under the purview of the Imperial Security Bureau, a branch of COMPNOR. ISB was a sister agency and rival to Imperial Intelligence over resources, abilities, and areas of responsibility. In comparison to Imperial Intelligence, the Imperial Security Bureau grew from a handful of agents, into an organization double the size of their rival within fourteen years."}, {"tag": "p", "text": "The organization was the direct descendant of the Galactic Republic's four competing intelligence agencies and Republic Intelligence. To prevent corrupt senators from using the agencies they preferred, the intelligence heads combined forces around the time the emperor took control. Unified under a group known as the Ubiqtorate, Imperial Intelligence monitored organizations, enemy forces, governments and corporations. Agents generally regarded their COMPNOR counterparts as inefficient and ineffective compared to their own services and the military."}, {"tag": "p", "text": "They also provided services to the other military branches of the Galactic Empire. In regards to military matters, they focused on issues such as threat reports, analysis, managing assets who were gathered information, and providing briefings to the Joint Chiefs and Emperor Sheev Palpatine. A part of Imperial Intelligence, the Naval Intelligence Agency was made its own separate organization for some time, though it continued to be referred to as \"Military Intelligence,\" before being folded back under Imperial Intelligence."}, {"tag": "p", "text": "Imperial Intelligence focused specifically on information that had direct relevance to military actions and strategic planning. This included traitors within the military and attacks on Imperial facilities or contractors that had housed or supplied the military with necessary resources. The organization was also permitted to investigate leads on suspected military firms that worked in opposition to the Galactic Empire. This included planetary garrisons or mercenary units that had access to military-grade equipment."}, {"tag": "p", "text": "Imperial Intelligence's authority was constrained regarding opposition groups that worked without a military framework. If leads revealed an organization that was essentially a ragtag militia armed with hunting rifles, then that investigation had to be transferred to ISB. Groups that concentrated on civilian targets like food depots, factories or even government buildings were treated similarly, as were individuals who promoted rebellious beliefs, even in public forums. Any such complications prevented Imperial Intelligence from acting upon its leads. Delays in transferring investigations to ISB, often gave suspects opportunities to elude capture, much to the frustration of Imperial agents."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Imperial Intelligence was composed of a leadership; the Ubiqtorate, and six main branches; Analysis, Adjustments, the Bureau of Operations, Intelligence, the Internal Organization Bureau and Sector Plexus. The Internal Organization Bureau was further made up of IntCon and IntSec. Also, the Sector Plexus branch was made up of the System Cells. Furthermore, MI had oversight over the death troopers, the Advanced Weapons Research division, the Naval Intelligence Agency, and the Imperial Information Office."}, {"tag": "p", "text": "Imperial Intelligence officers wore a white uniform that was similar to the ISB. The uniform was composed of a white tunic with a rank insignia plaque and code cylinders; black-flared breaches, a black utility belt, black knee-high durasteel-toed leather boots; and an optional black command cap and leather gloves."}, {"tag": "h3", "text": "Death troopers"}, {"tag": "p", "text": "Death troopers, who wore a specialized stormtrooper armor with a dark gleam, were the elite soldiers of Imperial Intelligence. These soldiers served as bodyguards to high-ranking Imperial officers and were used as elite special assignment commandos."}, {"tag": "h3", "text": "Imperial Military Department of Advanced Weapons Research"}, {"tag": "p", "text": "Advanced Weapons Research was an agency responsible for special research and development of classified weapons, both before and during the Galactic Civil War. Weapons development fell under the arm of Imperial Intelligence while the Imperial Security Bureau defended the agency's secrets."}, {"tag": "h3", "text": "Imperial Information Office"}, {"tag": "p", "text": "The Imperial Information Office was a government office that was part of Imperial Intelligence. Some personnel wore AJ^6 cyborg constructs and brain implants which could connect to computers and download information, to increase efficiency. IIO operatives had access to Imperial Intelligence resources such as IGV-55 surveillance vessels, which were used to monitor communications and scan data for signs of rebel activity and sedition."}, {"tag": "h3", "text": "Naval Intelligence Agency"}, {"tag": "p", "text": "The Naval Intelligence Agency was an intelligence agency that served the Imperial Navy. NavInt was made a separate organization for some time before being folded back under its original parent agency."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Imperial Intelligence was organized out of five intelligence agencies following the transformation of the Galactic Republic into the Empire at the end of the Clone Wars in 19 BBY. One of the five founding organisations was Republic Intelligence. Although their missions differed slightly, there was a rivalry between Intelligence and the Imperial Security Bureau, a sub-agency of COMPNOR. Intelligence agents often derided the Security Bureau's obsession over treason. A common joke among them was; \"How many ISB agents does it take to change a lightbulb? Two. One to remove it. Another to accuse the first of disloyalty!\" One day after the formation of the Empire, Imperial Intelligence arrested 63 senators on charges of conspiracy and treason. These senators were part of the Delegation of 2,000, a group of senators who attempted to limit Palpatine's growing political power."}, {"tag": "h3", "text": "Berch Teller's campaign"}, {"tag": "p", "text": "Five years later in 14 BBY, when Governor Tarkin and Darth Vader visited Murkhana on an investigative mission, former Republic Intelligence officer Berch Teller and a few of his accomplices, including Anora Fair, hijacked Tarkin's vessel, the Carrion Spike. They killed the ship's captain and comms officer, along with two stormtroopers, before taking off. The Imperials forced a local Sugi crime lord to give up his ship to them, and attempted to stop the captured Spike. However, Teller and his crew got away."}, {"tag": "p", "text": "After the successful hijacking, the insurgents of the Carrion Spike went on a campaign of destruction against various Imperial targets, such as Galidraan Station. Imperial Intelligence attempted to track and analysis their activities in order to capture them. The hijacker's information, however, was supplied to them by Vice Admiral Dodd Rancit, the Deputy Director of the Naval Intelligence Agency. However, Rancit was revealed as a traitor and executed on Vader's orders. He was replaced by Wullf Yularen and Naval Intelligence was brought back under Imperial Intelligence."}, {"tag": "h3", "text": "The hunt for Galen Erso"}, {"tag": "p", "text": "After landing a lofty appointment in Imperial Intelligence, Orson Callan Krennic used every tool at his disposal to track down Galen Walton Erso."}, {"tag": "h3", "text": "Fighting the Rebellion"}, {"tag": "p", "text": "On Empire Day in 4 BBY, the Rodian Imperial Information Office employee Tseebo fled into hiding with invaluable data on the new TIEs and walkers, schedules of troop movements, tactics, strategies, and a five year plan for the planet Lothal and every other world in the Outer Rim Territories. Tseebo escaped offworld into hiding with the help of the Spectres rebel cell."}, {"tag": "p", "text": "In 2 BBY, Imperial Controller LT-319 and the crew of his IGV-55 surveillance vessel embarked on ambitious scheme to hijack the Spectres' C1-series astromech droid Chopper and use him to obtain intelligence on the Phoenix Cell's hidden base. However, they were defeated by Chopper's rebel comrades and the former Imperial RA-7 protocol droid AP-5. Chopper's master Hera Syndulla retaliated by transmitting back the data feed to LT-319's ship, creating a data surge that destroyed the vessel and all hands aboard."}, {"tag": "p", "text": "Afterwards in approximately 1 BBY, a squad of death troopers led by DT-F16 was tasked with guarding a kyber crystal being transported aboard Freighter 2716 to the Tonnis sector for the secret Death Star project. Several of DT-F16's troopers were killed by the Partisan leader Saw Gerrera and the Spectres Sabine Wren and Ezra Bridger. DT-F16 survived and took over the defense of the ship. After Gerrera destabilized the crystal, DT-F16 and the ship's stormtroopers tried to flee aboard a Lambda-class shuttle but the Spectres managed to escape with several liberated civilian technicians and engineers. DT-F16 was killed along with the Imperials aboard Freighter 2716 and Captain Slavin's Imperial Star Destroyer."}, {"tag": "h4", "text": "Defection of Galen Erso and Scarif ordeal"}, {"tag": "p", "text": "In 0 BBY, 4D6-J-A7 was a RA-7 protocol droid who served as an administrative assistant in Imperial Intelligence and the Imperial Security Bureau. The droid, worked in the Imperial Office of Security of the Imperial Intelligence and Security Bureau offices, which was inside the Imperial security complex's Citadel Tower on the Outer Rim planet Scarif. While there, the droid was often exposed to classified information."}, {"tag": "p", "text": "4D6-J-A7 was present in the tower when Rebel Alliance agents Cassian Jeron Andor, Jyn Erso and K-2SO infiltrated the structure disguised as Imperial staff. The Alliance trio passed 4D6-J-A7 within the tower while the droid was conversing with a pair of Imperial officers, but the droid failed to recognize the infiltrators as a real threat to the Empire."}, {"tag": "p", "text": "During the same time, when the first Death Star was in its final construction stages, Director Orson Callan Krennic was accompanied by a squad of death troopers, who served as his personal bodyguard. Under Krennic's orders, the death troopers executed several scientists to punish their team leader Galen Walton Erso for conspiring with the Rebel Alliance. Later, the troopers fought Rebel Alliance ground forces and perished during the Battle of Scarif."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Sometime in the Imperial Era, ISB Agent Andressa Divo gave a number of holographic cloaking units that were used by burglars who attempted to steal artifacts from Coruscant's Imperial Museum to Imperial Intelligence, whose weapons divisions examined it closely for possible replication. The device was an evolution of the Holographic disguise matrix that was invented by the Snivvian bounty hunter Sinrich and used during the Clone Wars, in a botched attempt to kidnap Supreme Chancellor Sheev Palpatine, in 20 BBY."}, {"tag": "p", "text": "In a report written by the Chief of the Imperial Navy Admiral Conan Antonio Motti, after he was Force choked by Darth Vader in 0 BBY, aboard the Death Star, for deriding his religious beliefs in the Force, Motti questioned the Chief of the Imperial Army General Cassio Tagge and Vader's argument about the Rebel Alliance being a immediate threat, due to them being in possession of the Death Star plans. In one of his rebuttals, Motti stated that the Galactic Empire had an entire military intelligence unit, whose's only role was to assess the trustworthiness of potential threats to the state."}, {"tag": "p", "text": "Imperial Intelligence and the ISB had regularly cut, sifted, and reconstituted law enforcement intelligence reports in efforts to locate potential locations for outposts that belonged to the Rebel Alliance. The military intelligence agencies ordered a collated analysis of suspicious activity reports on a quarterly basis and reverse-mapped it to population research, honing in on cases clustered in the galaxy's sparsely populated areas. These were then likelihood-studied by AI predictors to generate a prioritized list of targets for the surveys of Imperial probe droids, that scoured the spacelanes in the years following the Battle of Yavin, in 0 BBY."}, {"tag": "p", "text": "A squad of death troopers fought the Rebel Alliance during the Battle for Tatooine."}, {"tag": "p", "text": "Doctor Chelli Lona Aphra claimed to Darth Vader that if Imperial Intelligence had a lead on Luke Skywalker, she bet that the Ante would have a better one."}, {"tag": "p", "text": "In 0 ABY, while undercover in the Staven led Dreamers at their encampment, along with Inferno Squad members Iden Versio, Del Meeko and Gideon Hask; ISB Agent Lar Kantayan (who was under the alias of Azen Novaren) was accused of being an Imperial Intelligence double agent, because of a homing beacon \"found\" by Meeko and Piikow aboard the Dreamers' Jinata Security shuttle. However, under Iden's orders, Meeko had fabricated the evidence from the logs Azen had recorded over the months, while he infiltrated Jinata Security on Vardos. The accusation, resulted in the death of Kantayan, after being tortured by the Dreamers for seven hours."}, {"tag": "p", "text": "Sometime between 0 ABY and 1 ABY, Imperial Intelligence believed that the Rebel Alliance had an outpost somewhere in the Horox system. This turned out to be correct, which eventually resulted in Task Force 99 finding the outpost on Horox III with the help of local villagers. The force led by Sergeant Kreel attacked the outpost, resulting in the base's destruction."}, {"tag": "p", "text": "After a Rebel Alliance raid on an Imperial heavy freighter in 3 ABY, from which supplies were stolen to repair the hyperdrive of the CR90 corvette Thunderstrike; Captain Tabor Seitaron, the commanding officer of the Imperial II-class Star Destroyer Herald stated, if there was a base where the Thunderstrike went to, an Imperial Intelligence agent would've already located it."}, {"tag": "p", "text": "In 4 ABY, when the leader of Alphabet Squadron Yrica Quell first met Balosar New Republic Intelligence agent Caern Adan, the pilot thought if Adan was an agent of Imperial Intelligence, she might have been fearful, although her dread seemed untimely."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Imperial Intelligence was introduced into the new Star Wars canon as Military Intelligence, through the novel Tarkin, which was authored by James Luceno and first released on November 4, 2014. In the book, the Naval Intelligence Agency was a division of Imperial Intelligence, that was made its own agency for some time, but was later folded back into it. It was also referred to as Military Intelligence. The agency's official name, Imperial Intelligence, was first identified in Star Wars: Absolutely Everything You Need to Know, which was published by Dorling Kindersley and first released on September 4, 2015."}, {"tag": "p", "text": "Imperial Intelligence also existed in Star Wars Legends, first introduced through the The Star Wars Sourcebook, which was published by West End Games and first released on October 1, 1987. Notable directors of the agency included Armand Isard, Lord Cronal, and Ysanne Isard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}