{"url": "Imperial_Inspectorate_HQ", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Coruscant government buildings", "Category:Coruscant military facilities", "Category:Galactic Republic military bases", "Category:Imperial military bases", "Category:Prisons"], "nodes": [{"tag": "h1", "text": "Imperial Inspectorate HQ"}, {"tag": "p", "text": "The Imperial Inspectorate HQ, also known as the Naval Intelligence headquarters, was the Imperial Military headquarters of the Inspectorate and the Naval Intelligence Agency. Located on the Core World Coruscant, it was originally a Republic Military facility, known as the Republic Center for Military Operations or the Republic military base, during the final years of the Galactic Republic. The architect who designed the base was Lieutenant Commander Orson Callan Krennic."}, {"tag": "p", "text": "During the Clone Wars, former Jedi Commander Ahsoka Tano was put on trial for treason at the Republic Center for Military Operations. The charges against Tano were dropped after another Jedi, Commander Barriss Offee, was revealed as the true culprit behind the terrorist bombing of the Jedi Temple."}, {"tag": "p", "text": "With the rise of the Galactic Empire, the Republic Center for Military Operations was re-designated as the Imperial Inspectorate HQ. It formed the so-called \"supreme triangle\" in Imperial City's Federal District, together with the Imperial Palace and the COMPNOR arcology."}, {"tag": "h2", "text": "Features"}, {"tag": "p", "text": "The Imperial Inspectorate HQ was a shielded, hardened, near-windowless complex that possessed scanner, sensor, and communications arrays on its roof during the Imperial Era. It also had micro-holocams built in every corner of the complex so that the actions and conversations of every worker could be monitored. The Strategic Planning Amphitheater was located at the summit of the facility."}, {"tag": "p", "text": "The First Battle Memorial was built in the center of the Republic base's plaza, its purpose to honor the clone troopers that were killed in the First Battle of Geonosis. This commemorative monument was constructed on an enormous slab of reddish-brown rock, taken from the planet Geonosis and made into a wall engraved with the designations of the fallen clones."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "During the final years of the Galactic Republic, the Republic Center for Military Operations was the base of operations and strategic center of the Republic Military. Designed by the architect Lieutenant Commander Orson Callan Krennic, it was built in the Federal District of Galactic City on the Core World Coruscant—the galactic capital of the Republic—at the time of the Clone Wars. As the Republic waged war against the Confederacy of Independent Systems across the galaxy, the facility served as the operation hub of the Grand Army of the Republic."}, {"tag": "p", "text": "A committee of Republic officials, known as the Strategic Advisory Cell, convened in the Republic Center's Strategic Planning Amphitheater to discuss plans for the creation of a Republic superweapon in the first year of the Clone Wars. As the conflict dragged on, one of the Jedi Temple's starship hangars was bombed by terrorists, resulting in the deaths of several Jedi, clone troopers, and maintenance workers. A local, Letta Turmond, was arrested by Jedi General Anakin Skywalker and imprisoned at the Republic military base due to her involvement in the attack against the Jedi Order."}, {"tag": "p", "text": "Turmond was subsequently killed by way of the Force while under interrogation by Skywalker's apprentice, Jedi Commander Ahsoka Tano. Accused of murder, Tano escaped from the base and fled into hiding in the lower levels of Coruscant. Pursued by the clone shock troopers of the Coruscant Guard, Tano was eventually captured and taken back to the Republic Center for Military Operations where she faced a military tribunal presided over by Supreme Chancellor Sheev Palpatine. Before sentencing could be carried out, however, Skywalker arrested Jedi Commander Barriss Offee after discovering that she was responsible for the bombing at the Temple as well as the framing of Tano. He took the fallen Jedi to the base's courtroom where Offee confessed to her crimes against both the Republic and the Order. As a result, the tribunal acquitted Tano on all charges, although she declined to rejoin either the Jedi or the Grand Army."}, {"tag": "h3", "text": "The Imperial Era"}, {"tag": "p", "text": "When the war ended in 19 BBY, the Republic was replaced by the Galactic Empire. As a result, the headquarters of the Imperial Inspectorate, as well as the Naval Intelligence Agency, was constructed over the monads of the former Republic military base. Together with the Imperial Palace and the COMPNOR arcology, the Imperial Inspectorate HQ was part of the \"supreme triangle\" in the Federal District."}, {"tag": "p", "text": "In 14 BBY, the headquarters served as the meeting place of Emperor Palpatine, his Joint Chiefs of the Imperial Military, and leaders of the Commission for the Preservation of the New Order, when a group of rebels hijacked Moff Wilhuff Tarkin's personal corvette and used it to go on a rampage throughout the Empire. At one point during the Galactic Civil War, agents of the Alliance to Restore the Republic infiltrated the complex."}, {"tag": "p", "text": "Lieutenant-Inspector Magna Tolvan went to the facility following her promotion to the agency, where she researched her deceased mentor, Thanoth, with an RA-7 protocol droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}