{"url": "Imperial_Intelligence/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Darth Krayt's Galactic Empire military units", "Category:Fel Empire military units", "Category:Imperial Intelligence of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Imperial Intelligence"}, {"tag": "p", "text": "Imperial Intelligence Service, or Imperial Intelligence which can abbreviated as Imperial Intel or I.I, and also known as Military Intelligence, was an intelligence service of the Galactic Empire and its successor organizations. It was dedicated to collecting information, secret and otherwise, for the Imperial government and was a rival to the Imperial Security Bureau."}, {"tag": "p", "text": "Organized into central bureaus, themselves divided into divisions, and with various other units and operations in addition to the central bureaus, Imperial Intelligence was at its peak performance during the twenty-three year rule of Galactic Emperor Palpatine from 19 BBY until 4 ABY. The agency lost its prominence in galactic affairs after the death of Palpatine at the Battle of Endor and after its leadership, central bureaucracy, and most of its top level operatives were killed during the Imperial Civil War which lasted from Palpatine's death until 12 ABY. Though Imperial Intelligence's central organization was largely gutted, individual agents and analysts continued their operations in the following decades providing information and services for the various Warlords, Moffs, Heads of States, and other leaders of the Imperial Remnant. Its size and strength returned under the Fel Empire, the subsequent Galactic Empire of Darth Krayt and the Empire-in-exile."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Imperial Intelligence was the primary intelligence service for the Galactic Empire and its successor organizations. The agency made use of covert operations which it used to spy on its enemies as well as itself and other branches of the Galactic Empire and its successor organizations. They were also responsible for watching the activities of various governments, corporations and other forces in the galaxy. Furthermore, they kept an eye out for any notable mercenary, bounty hunters and other outlaw activities. They also supplied any information to the various branches in the Imperial Military regarding any potential targets and strategies, which made them valuable despite being kept off the front lines."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Leadership"}, {"tag": "p", "text": "Imperial Intelligence was led, during its peak years, by the Ubiqtorate, a type of board of directors. Formed before the formation of the Empire, the Ubiqtorate was a name that in some circles had become synonymous with Imperial Intelligence. The membership of the Ubiqtorate was a closely guarded secret, even to subordinates. The Ubiqtorate formulated strategies for the bureaus of Imperial Intelligence or presented them with a set of goals which the bureaus were then to establish strategies to accomplish."}, {"tag": "p", "text": "The Ubiqtorate was led by the Director of Imperial Intelligence. The Director was also the public face of Imperial Intelligence, an agency that lived on secrecy. Whereas the Ubiqtorate remained in the background and would never communicate with lower branches and divisions, the director would ensure the smooth running of all branches of Imperial Intelligence and would even plan missions directly with agents if the need arose."}, {"tag": "h3", "text": "Adjustments"}, {"tag": "p", "text": "The Adjustments branch was the elite black-ops unit of Imperial Intelligence and answered directly to the Ubiqtorate's members. If a situation devolved to the point that the bureaus and their various branches were unable to control it, an Adjustment unit was sent directly by the Ubiqtorate to take charge of the situation and fix the problem. Orders to Adjustments were always verbal and written records of their missions were never kept."}, {"tag": "h3", "text": "Internal Organization Bureau"}, {"tag": "p", "text": "The Internal Organization Bureau (IntOrg), served as the internal affairs and internal security apparatus. Their goal was the security of Imperial Intelligence, both from an espionage and operations scale, as well as a physical security standpoint. IntOrg agents were well mannered but also ruthless to the core. They rarely if ever abused their power and they enjoyed a good reputation among the rest of Imperial Intelligence, despite their responsibilities. Information inside IntOrg was heavily secured against unauthorized access by other bureaus, but no restrictions against other agents of IntOrg. This was a means for IntOrg to monitor itself: every decision, action or piece of data generated by a member of IntOrg was available for any other agent to examine. This lack of secrecy, and often privacy, made it nearly impossible for an enemy agent to operate within IntOrg."}, {"tag": "p", "text": "IntOrg was separated into two branches: the Internal Security Branch and the Internal Counterintelligence Branch. The Internal Security Branch, or IntSec, were the security police for the physical locations of Imperial Intelligence. They were the only visible uniformed branch of Imperial Intelligence to openly carry weapons in Imperial Intelligence facilities though plainclothes officers monitored crowds outside to spot trouble. The Internal Counterintelligence Branch, or IntCon, was the internal affairs and counterintelligence service of Imperial Intelligence. IntCon was organized as a miniature Imperial Intelligence and divided into three units: Analysis, Operations, and Intelligence. The boundaries between the various units were often blurred and IntCon was known for its informal atmosphere and loose structure."}, {"tag": "h3", "text": "Analysis Bureau"}, {"tag": "p", "text": "The Analysis Bureau responsible for handling large amounts of data from tens of millions of sources, searching for enemy activity by analyzing the patterns or trends in the data they handle and transmitting the information to the Intelligence bureau. Analysis also handled, examined and copied useful technologies, even developing a few of their own. The Analysis bureau had several branches that dealt with various areas."}, {"tag": "p", "text": "The Media Section was the section of Analysis responsible for the handling of public scandocs, newsdocs, holos, comlinks, beamcasts, and every form of media in the Galactic Empire. They searched for patterns of hidden meanings which might betray a clue as to an enemy's plan and operation."}, {"tag": "p", "text": "The Signal section examined the channel through which information was transmitted. Signal sampled and checked carrier wave codes and protocols, scan rates on scandocs, and image packs on holos to see if any vital information was being squeezed through. Signal examined line noise to check if it contained a pattern rather than random error, and broadcasts and beamcasts to see if the backup information sent with the primary information matched, and, if not, how they differed."}, {"tag": "p", "text": "The Cryptanalysis section, or Crypt, was formed from the Cryptanalysis Department of the Senate Bureau of Intelligence. It was responsible for all code-breaking. All evidence of coded communication found through Media and Signal's work were transferred to the Cryptanalysis branch. They had a reputation for bizarre behavior that bordered on the disruptive and were frequently checked by Imperial Intelligence's internal monitors."}, {"tag": "p", "text": "The Tech section was the branch of Analysis responsible for analyzing an enemy's hardware, figuring out how it worked and devising methods to provide Intelligence with superior hardware. Tech was given a lavish budget and a number of highly skilled personnel whose moments of brilliant inspiration could translate into innovative technology. The administration, however, which was chosen from scientists and technologists within the branch, were often lost when having to decide upon the proper priorities for projects which were outside their areas of expertise."}, {"tag": "p", "text": "The Interrogation section was responsible for the handling of enemy agents captured by Imperial Intelligence. Interrogation, while more ruthless than their counterparts in Imperial Naval Intelligence, was not as bloodthirsty as their counterparts in the Imperial Security Bureau, which would reduce their effectiveness in cracking prisoners. Nevertheless, they had a larger purpose, working on the assumption that the Rebellion would work as hard as possible to render any divulged information useless. Unless the captive agent was believed to hold vital information, interrogation was minimal."}, {"tag": "h3", "text": "Intelligence Bureau"}, {"tag": "p", "text": "The Intelligence Bureau would take the data from the Analysis Bureau and run it by a group of experts to predict what the Empire's enemies would do next."}, {"tag": "p", "text": "The Sedition branch predicted trends of groups that offered resistance to the Empire. The Crisis Branch was not permanent but could be formed in times of crisis out of experts from the other branches. It would be under the control of the Ubiqtorate, but could also answer to a Grand Moff or the Emperor himself. Sector branches existed in each sector of the Empire. They were formed of experts that could offer their opinions and analysis to Either the Crisis Branch or Sedition Branch depending on the situation."}, {"tag": "p", "text": "The External Communications (ExComm) section managed the equipment that relayed emergency or high priority messages between the various bureaus of Imperial Intelligence, the Ubiqtorate, and the Imperial military that required fast and immediate delivery."}, {"tag": "h3", "text": "Operations Bureau"}, {"tag": "p", "text": "The Bureau of Operations was the only bureau in the Imperial Intelligence to be called the \"Bureau\". The Bureau handled the covert operations which were beyond the scope or required greater resources than those of the average operations capabilities of local Imperial Intel assets. It was divided into six distinct divisions."}, {"tag": "p", "text": "The Surveillance division kept watch on serious threats to the Empire. Sorting through information and unerringly selecting suspects currently involved in anti-Imperial activity, Surveillance did its job with surprising and deadly efficiency, despite their small size. At the peak of the New Order, Surveillance had less than one agent for every seventy so dedicated in COMPNOR's Imperial Security Bureau. Despite the huge difference in numbers between the two organizations, Surveillance was more successful than ISB in its operations, a point Surveillance took much pride in."}, {"tag": "p", "text": "Renik was the counter-intelligence division of the Bureau and of Imperial Intelligence. While the Internal Organization Bureau performed counter-intelligence operations for the internal operations of Imperial Intelligence, Renik focused on operations within the Imperial government as a whole. They specialized in identifying and dismantling enemy intelligence operations. If a particular operation was considered to be potentially useful to the Empire, Renik would hand over all information on the enemy intelligence operation to the Infiltration branch, who would then take it from Renik and deal with it accordingly. However, if an operation was considered insignificant or too dangerous, Renik would destroy it. Saber Enterprises was a front for most of the division's counter-espionage operations."}, {"tag": "p", "text": "The Diplomatic Services (DiploServ) division of the Bureau amounted for a sizable portion of the personnel for trade and diplomatic missions found in the Empire. They also accounted for the political experts advising the Imperial planetary governors and Moffs. DiploServ personnel were well trained and expected to perform only their overt duties. Others were more clandestine agents, sent on specific anti-Rebellion missions or to establish and organize system cells within their mission area."}, {"tag": "p", "text": "The Infiltration division where they were reassigned to the Intelligence Bureau where they would assist agents within the sector branches, and then later assigned to Sedition section . The agents would undergo intense training and exposed to mnemiotic drugs to enhance their learning. Those who survived with their minds intact acquired a great deal of knowledge, and were then transferred back to the Operations Bureau and assigned to Infiltration. They would be tested to see which mission profile suited them best."}, {"tag": "p", "text": "The Destabilization (Destab) branch was known as \"the quiet branch.\" No one knew much about Destab's operations or personnel. They were, however, known for committing full-fledged atrocities rather than legitimate intelligence operations. Officially, Destab specialized in \"taking the fabric which holds a people, society or government together and unraveling it.\" Agents from other branches suggested Destab's methods closely resembled \"shredding.\" They instilled pure terror into a population, and destroyed any semblance of social order."}, {"tag": "p", "text": "The Assassination division was embraced by other agents, long considered a legitimate means of removal of key members of the opposition. Assassination's agents were trained to take every advantage, to use every trick and matter of subterfuge possible. Assassination was careful to select targets which mission success was probable. Their success ratio was much higher than the theoretical one."}, {"tag": "h3", "text": "Imperial CompLink Bureau"}, {"tag": "p", "text": "The Imperial CompLink was the bureau that used software secretly installed on computers throughout the Empire to monitor electronic communications. The spyware would transmit information packets to orbiting hyperspace transmitters that would forward the information to CompLink Bureau for study by the Analysis Bureau."}, {"tag": "h3", "text": "Sector Plexus"}, {"tag": "p", "text": "The Sector Plexus was the hub for all information processed by Imperial Intelligence. Sector Plexus maintained an enormous database filled with information on every Imperial Intelligence officer, their aliases, and their activities. The Sector Plexus used Plexus courier droids to securely transport this data across the galaxy."}, {"tag": "h3", "text": "Inquisitorius"}, {"tag": "p", "text": "The Inquisitorius were a secret division of Imperial Intelligence consisting of dark side Force-sensitive agents known as Inquisitors. They were considered the highest ranking of the Dark Side Adepts, outranking the Emperor's Hands, Prophets of the Dark Side, and lesser Dark Jedi. They reported directly to the Emperor. Their primary purpose was the interrogation of Jedi or particularly resistant subjects. However, since Imperial Intelligence was quite effective in interrogating the average subject, they rarely required the services of an Inquisitor. Inquisitors instead spent much of their time looking for potential Jedi candidates and Force activity in the backwater parts of the Empire, most often in the Outer Rim Territories, at the discretion of their leader the Grand Inquisitor."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "This intelligence service was one of the few legacies that remained from the Galactic Republic and was completely reformed after the Declaration of a New Order. In the final years of the Galactic Republic at the time of the Clone Wars, there had existed four intelligence networks that supported the governments by gathering as well as analyzing information from the Galactic Senate. These included the Senate Bureau of Intelligence, Interstellar Consortium on Technology, Republic Security Organization, and Special Acquisitions Branch of the Library of the Republic. However, in those years, the directors of the four agencies quickly came to the conclusion that corruption by various Senators led to misinformation being passed through the bribing of lower ranking functionaries. This allowed such individuals to control the information that was being presented to the Galactic Senate. However, they never bribed the operatives of all agencies and instead attempted to rely on the innate distrust between the four intelligence divisions. The four directors later met in negotiations in the last years of the Republic where they agreed to put aside any desire for personal power and instead form an effective intelligence agency. This led to the merger of the four agencies and the Ubiqtorate was formed and saw the intelligence service reorganized with frightening speed."}, {"tag": "p", "text": "Later Imperial accounts spoke of the leaders of these networks being bypassed by corrupt members of the Galactic Senate, who were buying information from lower-level operatives in pursuit of their own political agendas, a description that might have, in fact, alluded to the activities of Mon Mothma and her political faction at the end of the Clone Wars and the time of the Petition of 2000. It was probably in response to this that several of the leaders of the Intelligence organizations, including Armand Isard, Director of the Senate Bureau of Intelligence, concluded an informal alliance, motivated by a belief that democratic government had failed the galaxy, and designed to forge their networks into a single tool in support of Palpatine. After the Declaration of the New Order, the disparate Republic organizations were formally amalgamated into the new Imperial Intelligence, with Isard in charge as Director of Intelligence. Republic Intelligence was likewise made a part of Imperial Intelligence. A Republic military counterespionage officer, Admiral Kiner, appeared to have played a role in the establishment of what became the Renik division of the Bureau of Operations."}, {"tag": "p", "text": "Presumably, the authority of the Senate Intelligence Oversight Committee to interfere in and oversee intelligence affairs was also removed during the reforms, but the speed and efficiency in which the Intelligence community had reorganized itself frightened several of Palpatine's advisors, including Lord Crueya Vandron, and the COMPOR organization was reorganized as COMPNOR to provide a counterpart under their own control. Full and current Imperial Intelligence reports were also considered absolutely necessary for activating the Death Star's superlaser against any targeted world."}, {"tag": "p", "text": "In 0 BBY, Armand Isard was arrested and executed on Palpatine's orders, due to what seems to have been false information that he was aiding the Alliance to Restore the Republic, provided by Isard's own daughter, Ysanne. At some unknown point during the Galactic Civil War, the Emperor arranged for Cronal to leave the Prophets of the Dark Side and serve as his Emperor's Hand whereupon he was placed as the head of Imperial Intelligence. However, in the midst of the Galactic Civil War, Cronal disappeared and Imperial Intelligence fell under the leadership of Ysanne Isard. Palpatine then appointed her to become the new Intelligence director. At some point after the Battle of Yavin, Imperial Intelligence was tasked with tracking and apprehending the Death Star architect; Bevel Lemelisk. Intelligence agents later located the engineer hiding on the planet Hefi and took him to the Emperor. Imperial Intelligence also did investigations on an attack on the Emperor's C-3 passenger liner Excalibur, and discovered that the Zaarin-alinged gunboats responsible had belonged to the Emperor's special reserve guard. They also did extensive study on the captured MC80a Star Cruiser Link's computer systems just in case there was encrypted files on it relating to the Death Star II."}, {"tag": "p", "text": "After the Battle of Endor and the resultant chaos that emerged within the Empire, Imperial Intelligence began to work against the Imperial Security Bureau. This even led to both sides assassinating the others agents. In order to gain an advantage, Intelligence began offering rewards to those that betrayed their comrades such as being allowed to retain their property which worked well initially. This tactic was later copied by Imperial Security during the brief struggle between the two competing agencies.2"}, {"tag": "h3", "text": "Imperial Remnant"}, {"tag": "p", "text": "In 4 ABY, the Epsilon Nine research station in the Cron Drift was charged with developing new spy satellites for Imperial Intelligence. However, the rise of the New Republic meant that the researchers at the station intended to defect to the Republic. This led to Ysanne Isard dispatching her agent Lumiya with a task force of Imperial ships to conquer the facility and return it to Imperial hands."}, {"tag": "p", "text": "By at least 19 ABY, Imperial Intelligence seemed to have become an entity separate from the Ubiqtorate command structure. Imperial Intelligence agents were known to carry out orders of the sector Moffs without regard for commands from Ubiqtorate or High Command, as was the case in the creation of the organization Vengeance and the subsequent destruction of the Bothawui shield generator during the Caamas Document Crisis."}, {"tag": "h3", "text": "Legacy era"}, {"tag": "p", "text": "By 130 ABY, Moff Nyna Calixte was in charge of Imperial Intelligence in the Fel Empire, and later Krayt's Empire, working in collaboration with Darth Maladi, her counterpart in Sith Intelligence and Assassination in Darth Krayt's One Sith. It was through Calixte that Krayt's Sith were able to first approach the Empire."}, {"tag": "p", "text": "Calixte was still in charge of the service under the Sith regime but she was forced to report to Maladi who replaced most of her operatives by Sith-loyal agents, such as Jor Torlin. She was later replaced by Fehlaaur'aitel'loro. Intelligence in the Empire-in-exile was under the direction of Hogrum Chalk, brother of Roan Fel's late wife."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}