{"url": "Anakin%27s_Fate", "categories": ["Category:Real-world articles", "Category:Legends Young Readers"], "nodes": [{"tag": "h1", "text": "Anakin's Fate"}, {"tag": "p", "text": "Anakin's Fate is a children's storybook written by Marc Cerasini and illustrated by John Alvin. It is a Jedi Readers Step 4 (Grades 3-4) young readers publication. It tells the story of an adventure Anakin Skywalker and C-3PO have on Tatooine shortly before Episode I."}, {"tag": "h2", "text": "Publisher's Summary"}, {"tag": "p", "text": "Anakin Skywalker believes that one day he will be more than just a slave. He has dreams. Maybe someday he will leave Tatooine and become a space pilot, or even a Jedi Knight! But how can he become a pilot when he can't win—or even finish—a Podrace? Will Anakin be stuck doing Watto's dirty work forever? Or will he follow his dreams to a greater destiny?"}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "The story begins with Anakin Skywalker participating in a pod race. He rides to victory for the first time and is led to the winner's circle, where he meets a wise man and an angel."}, {"tag": "p", "text": "Suddenly Anakin hears his mother's voice and he wakes up—it had all been a dream. He has his breakfast with his mother and tells her of the dream. On his way to Watto's he also tells his friend Kitster, though Kitster doesn't believe it; he thinks dreams are only for dreaming and they don't come true. Anakin is certain that his dreams will come true."}, {"tag": "p", "text": "Anakin arrives at Watto's and finds his master in a very excited mood. Watto tells Anakin that Jawas at Mochat Steep have found the thrusters from the pod of Regga the Hammerhead, a famous racer that was undefeated until Sebulba cut him off. Watto wants the thrusters, planning to have Anakin use them in the next pod race. He sends Anakin to trade with the Jawas. As Anakin is searching through junk to trade he finds a Vaporator Cylinder of a very old model. A funny feeling tells Anakin to take it and he packs it with the rest of the Junk."}, {"tag": "p", "text": "Before Anakin goes to the Jawas, he stops at home to pick up C-3PO to use as an interpreter. C-3PO is only half finished, as is the pod racer Anakin has hidden with the droid. This is so that they do not appear valuable if Watto finds them; otherwise the Toydarian would steal them."}, {"tag": "p", "text": "Anakin and C-3PO journey to Mochat Steep and try to barter, though the Jawas want money rather than junk parts. One Jawa points at Anakin's water Jerikans and says he wants them. Anakin realizes the Jawas want water and discovers that their water vaporator has broken. Quickly Anakin grabs the Vaparator Cylinder and offers to trade it and repair it for the remains of Regga's pod. The Jawas lead him inside their Sandcrawler and take him to the broken vaporator. After a moment Anakin has it fixed and the Jawas are overjoyed. As promised they give him the remains of Regga's pod, which includes an entire engine. Anakin is stunned and decides to keep the engine for himself to use for building his secret pod."}, {"tag": "p", "text": "That evening, Watto is astounded that Anakin acquired the thrusters with the vaporator cylinder. He orders Anakin to equip his pod with the thrusters the next day and tells him he will fly in the next race."}, {"tag": "p", "text": "Some time later, the day of the race has come. Anakin is ready to go in Watto's pod, though he is parked next to Sebulba, who recognizes Regga's old thrusters. He warns Anakin he has a \"surprise\" for him when they reach Bimmira Canyon. Anakin tries to ignore the Dug and reaches out with his mind as the timer counts down. When the light turns green the racers are off. Anakin reaches the canyon first, foiling Sebulba's trick. Anakin begins to wonder if this is the race from his dream, where he rides to victory and meets an angel. Suddenly Sebulba passes him, followed by Rimkar's bubble pod. When they reach Metta Canyon Anakin senses danger and jerks the controls. Sebulba activates his afterburners and destroys Rimkar's pod. Anakin avoids the blast, but loses control and crashes. Sebulba wins yet again and Anakin is severely discouraged, beginning to doubt his dreams."}, {"tag": "p", "text": "Watto is angered and makes Anakin work on the battered pod until dark. When night falls, Kitster and Seek take Anakin for a drink to cheer him up, though it does little good. They listen to the space pilots tell each other stories, and Anakin becomes sad, thinking that he will always be a slave and never see the stars. One of the pilots sees Anakin and recognizes him as a participant in the pod race. He commends Anakin on his ability to fly a pod, and tells him that he must trust his dreams, or else they would never come true."}, {"tag": "p", "text": "Later that night Anakin wondered if the pilot was the wise man from his dream. Taking the pilot's advice, he resolves to trust his dreams and not to give up hope."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This story goes over the race that Watto refers to in Episode I where he says, \"He smashed up my pod in the last race!\" It also contains a major continuity error. Anakin flies Watto's pod, which looks exactly like his own pod that he flies in Episode I despite the fact that his racer was unfinished and under construction at the time.However, it could be assumed that Anakin built a vey similar pod to Watto's."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}]}