{"url": "Imperial_Maritime_Division", "categories": ["Category:Legends articles", "Category:Imperial Army divisions"], "nodes": [{"tag": "h1", "text": "Imperial Maritime Division"}, {"tag": "p", "text": "The Imperial Maritime Division, also referred to as the Imperial Navy (not to be confused with the Imperial Starfleet), was part of the Galactic Empire's Military that carried out operations on bodies of water of different planets. It was one of the important organizational distinctions of the Imperial Army, the ground forces of the Imperial Military. The Navy's most notable actions were fighting in the battle for the Montrosa Islands and the Liberation of Kashyyyk."}, {"tag": "h2", "text": "Functions"}, {"tag": "p", "text": "It operated on oceans, rivers and urban waterways. When undergoing various missions, it utilized specialized aquatic vehicles, including destroyers, submersibles, and waveskimmers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 0 ABY, the Imperial Navy fought against Rebel Alliance Military forces in the battle for the Montrosa Islands on the agricultural planet Reytha as part of a force led by Darth Vader. The Navy engaged other Rebel Navy units for control of the Montrosa Ocean and supported the Imperial Army operations in that battle. Years later, after the Battle of Endor, naval units also fought against Wookiee forces while trying to defend communication jammers during the Liberation of Kashyyyk, though the Imperials were ultimately defeated in the battle."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Imperial Navy undertook aquatic operations for the Imperial Military. Its bases were constructed by ASP-7 labor droids and utility trawlers gathered resources such as food from aquaharvesters. The Navy used shipyards to construct a fleet of vehicles such as frigates, destroyers, transports, and anti-air destroyers. Although the Navy was powerful in its own right, it was also one of the weaker elements of the Imperial Military overall."}, {"tag": "h2", "text": "Ship classes"}, {"tag": "h3", "text": "Scout frigates"}, {"tag": "p", "text": "Within the Imperial Navy, there were aquatic scout frigates, repulsorlift craft sent to scout ahead on water or escort heavier vessels. Light Scouts were the most basic variant, armed with a captain and at least one gunner. The Standard Scouts succeeded the Light Scouts, and were built with a sleeker cockpit. Heavier-armed variants known as the Advanced Scouts."}, {"tag": "h3", "text": "Destroyers"}, {"tag": "p", "text": "The Imperial Navy also made use of various aquatic repulsorlift destroyers. The standard Destroyer was clam-shelled in shape, and carried one pummel. The Heavy Destroyer variant was largely similar to the standard Destroyer, only with one additional pummel. Both variants were utilized by Darth Vader during the Reytha campaign of the Galactic Civil War."}, {"tag": "h3", "text": "Cruiser"}, {"tag": "p", "text": "Likewise, the Imperial Navy made use of various aquatic repulsorlift cruisers. The standard Cruiser was boat-shaped with a single laser cannon. The Heavy Cruiser variant was largely similar, but possessed two laser cannon turrets and heavier armor."}, {"tag": "h3", "text": "Anti-Air defense ships"}, {"tag": "p", "text": "The Imperial Navy also made use of Anti-Air defense ships, colloquially known as Missile Destroyers due to their common weapon choice, anti-air missiles. The standard Missile Destroyers had thick armored hulls and a single anti-air missile launcher. The Heavy Missile Destroyer variant possessed heavier armor and two anti-air launchers. Both variants were utilized by Darth Vader during the Reytha Campaign of the Galactic Civil War."}, {"tag": "h3", "text": "Other"}, {"tag": "p", "text": "In addition to the vessels in the Imperial Navy directly related to combat, various vessel also served additional purposes. The Transport Ships were utilized to transport various ground personnel and vehicles to various locations on a planet via water, and were boxy/rectangular in shape. They served during the Reytha Campaign in 0 ABY. Utility trawlers were also used by the Galactic Empire to supply their various bases with fish and other aquaculture harvesting, with their models specifically resembling tanker ships of old. The Imperial submarines were vessels that could submerge underwater and are capable of firing torpedoes at enemy fighters. Several were used during the Battle of Dubrillion against Rogue Squadron, when the Rebel squadron attempted to destroy a superlaser test bed that caught their fleet by surprise. Explorer Submergibles served a similar purpose, although it was meant for exploration and assault, possessing heavy weaponry to take out hostile lifeforms. Amphibions were also utilized as early as the Battle of Corellia up to before the revelation of the Dark Empire. The Imperial Navy also had manufactured starfighters that were specifically capable of operating underwater, including the TIE fighter boat and, under the Krayt Empire, the Shark underwater fighter. They also utilized the Aquadon CAVa 400s, modified versions of the CAVw PX-10s for aquatic sieges. Waveskimmers such as the single person ones and the AT-AT derived AQ-5 Waveskimmers."}, {"tag": "p", "text": "During the Krayt Empire and Fel Empires, the Imperial Navy also utilized the Acklay-class mobile fortress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The aquatic Imperial Navy was first mentioned in the strategy guide for the 2001 video game Star Wars: Galactic Battlegrounds, although was not mentioned by name in the game itself. Players get the opportunity to build Imperial Navy units in one of the Darth Vader campaign missions, and face computer-controlled units in one of the Chewbacca campaign missions. The missions and therefore the Navy appear in the game's 2002 expansion pack, Clone Campaigns. The vehicles may also be constructed in multiplayer matches by Imperial players."}, {"tag": "p", "text": "In Chapter 5 of the strategy guide, one of the members of Galactic Battleground's creative team, Matthew Keast, implied that the Empire was at a disadvantage regarding sea-based operations."}, {"tag": "p", "text": "The branch was later given the name of the Imperial Maritime Division in the Star Wars: Imperial Handbook: A Commander's Guide, as well as identified as being a branch of the Imperial Army."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}