{"url": "Imperial_Military/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Articles needing additional sources", "Category:Darth Krayt's Galactic Empire military units", "Category:Empire-in-exile military units", "Category:Fel Empire military units", "Category:Imperial Military", "Category:Imperial military units"], "nodes": [{"tag": "h1", "text": "Imperial Military"}, {"tag": "p", "text": "The Imperial Military, also known as the Imperial armed forces or Imperial Service, was the armed forces of the Galactic Empire, and successor to the Republic Military. It was responsible for carrying out military operations throughout the galaxy as well as maintaining order on Imperial member worlds, governorships, colonies, and protectorates."}, {"tag": "p", "text": "The Imperial Military was a massive organization, as Palpatine did nothing to halt the massive military build up that had produced an army of troopers and enormous weapons of mass destruction following the Clone Wars. Its ranks were filled with tens of trillions of regular army soldiers, trillions of fleet crew, and a sizable force of stormtroopers."}, {"tag": "p", "text": "The Imperial Military was under the direct control of Imperial High Command. Although the Galactic Emperor acted as the Commander-in-Chief of the Military, Palpatine rarely ever left the confines of his palace on Coruscant, leaving a relative few military personnel ever actually seeing him face to face. As such, even though the various commanders merely carry out orders issued by the Emperor, they are considered to be the true positions of power in the New Order. The next highest rank was that of the Supreme Commander. The individual who held this title had complete control over the Imperial Military, and answered only to the Emperor. In the absence of an official Emperor, the Supreme Commander often became the de-facto leader of the Empire, as was seen in the cases of Grand Admiral Thrawn and Gilad Pellaeon. This position was held by several different Imperial officials over the course of the Empire's history, including Darth Vader, Thrawn, and Gilad Pellaeon."}, {"tag": "p", "text": "The Imperial Military was not only a physical superpower, but a mental one as well. Vader's stormtrooper division, the 501st Legion, known as \"Vader's Fist,\" inspired fear in any sentient species. The infamous Death Stars were used by Emperor Palpatine to frighten the galaxy's citizens into submission. These are only a few examples of the fact that pure fear of the Empire's might was often more effective than might itself. Much of the equipment used by the Empire was designed to enhance this effect, the fear-inspiring appearance of the AT-AT being one example of this phenomena."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Foundation"}, {"tag": "p", "text": "The Imperial Military formed as a realignment of the Republic Military. Originally formed when then Supreme Chancellor Palpatine was authorized to create a Galactic Military under his Emergency Powers, the Grand Army of the Republic was formed by clones from facilities on Kamino. These clones were created from the DNA of Jango Fett under orders from Jedi Master Sifo-Dyas."}, {"tag": "p", "text": "Following the Clone Wars and the transformation from Republic to Empire, the clones were given new armor and weapons, and went from fighting droids to suppressing planetary uprisings on planets such as Naboo. Palpatine used the lack of a surrender from the Separatist leaders to continue to build up his army and navy, although he was aware that they were all dead. During the early stages of the Empire's formation, the Imperial Military initially found innumerable recruits among various cadets of the Academy, which had been an elite educational and training institution with campuses throughout the known galaxy. Shortly into the Empire's infancy, however, a military coup was instigated by the first graduating class of the various Military branches, helmed by the then-Imperial Academy headmaster Gentis, in order to end the Emperor's warmongering ways after stumbling upon the Imperial Crematorium, which also led to Palpatine being temporarily poisoned with Aorth-6. After the Kamino Uprising, Palpatine decided that having an entire army based on a single template was too dangerous, and began to diversify, although the 501st Legion remained composed of Fett clones. According to the New Order's ideology of human supremacy, the stormtroopers remained on the whole, human. Early conflicts for the Imperial Military included the Reconquest of the Rim, which brought much of the Outer Rim Territories under Imperial control, and the Kwymar Suppressions."}, {"tag": "h3", "text": "The Galactic Civil War"}, {"tag": "p", "text": "After facing a droid uprising on Mustafar led by Gizor Dellso, the biggest threat to the Imperial Military was the Alliance to Restore the Republic. The two sides fought for years, in a conflict spanning the entire galaxy. The three biggest battles were at Yavin, Hoth, and Endor. At the time of the Battle of Yavin, the Imperial Military, according to Emperor Palpatine, was the largest fighting force in galactic history. Even though the Empire was victorious at Hoth, dealing a grievous blow to the Rebels, the Battles of Yavin and Endor resulted in major Alliance victories. In fact, Endor would see the end of the Empire's founder and his right hand man, Darth Vader, sending the Imperial Military into chaos."}, {"tag": "h3", "text": "Defeat and restoration"}, {"tag": "p", "text": "Following defeat at the hands of the New Republic, the Imperial Military split to follow multiple leaders, depending on their location and direct command. Several factions were led by officers and warlords such as Warlord Zsinj, Ysanne Isard, and Grand Admiral Thrawn. Though they all came close to defeating the New Republic, especially Thrawn, all ultimately failed. When Palpatine returned, much of the military sided with him. After his final defeat in Operation Shadow Hand, they retreated to the portion of space known as Imperial Space. They would later reunite with the New Republic to fight the Yuuzhan Vong. After about 40 ABY, the Imperial Remnant began to regain power; after the Battle of Caamas in 130 ABY, it was once more the dominant faction in the galaxy. However, the Imperial Military was divided again when Emperor Fel was forced out of power. Parts of the military remained loyal to him, and after its formation served the Galactic Federation Triumvirate."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Headquarters"}, {"tag": "p", "text": "The Imperial Military's Commander-in-Chief was the Galactic Emperor Palpatine. However, the Supreme Commander had direct control over the various Imperial forces. Another very high level organizational body was the Emperor's Advisory Committee on Military Affairs, which advised the Emperor on military affairs at least up until the Battle of Yavin. In addition, its highest organizational body was the Imperial High Command, which oversaw the highest levels of the three primary branches of the Imperial Military: Naval Command, Army Command, and Stormtrooper Command, alongside all support branches of the Imperial Military. High Command's role was to plan and coordinate the proper combination of ground, air, space, and special operations forces to achieve the mission objective. High Command was also responsible for synchronizing military efforts with the Commission for the Preservation of the New Order, Imperial Intelligence, the Imperial Security Bureau, and other intergovernmental partners. Although not actually part of Imperial High Command, the Battle Station Command was a similar high position that answered to Imperial High Command, and specifically headed the Battle Station Operations branch, which was formed by Grand Moff Wilhuff Tarkin upon the completion of the Death Star."}, {"tag": "h3", "text": "Administrative organization"}, {"tag": "p", "text": "Imperial High Command had authority over three service branches and seven support divisions. The Imperial Navy was the Empire's spacefaring force and projected power through capital ship such as the Imperial-class Star Destroyer, and controlled the Empire's TIE Fighters through the Starfighter Corps. The Imperial Army was the Empire's planetary invasion and occupation force and controlled the Empire's armored vehicles. The Army also controlled the Imperial Maritime Division, which operated aquatic vehicles and submersibles on ocean planets and surface rivers. The Stormtrooper Corps, the smallest of the branches, was the elite of the Imperial Military, loyal only to Palpatine, and controlled the Empire's distinctive, white-armored stormtroopers, and was responsible for first strikes, shock action, and ensuring the loyalty of crews aboard Navy ships."}, {"tag": "p", "text": "The seven support divisions of the Imperial Military were the Imperial Department of Military Research, the Imperial Diplomatic Corps, the Imperial Engineering Corps, the Imperial Survey Corps, the Imperial Exploration Corps, the Imperial Surgical Corps, and the Imperial Military Police. IDMR was the military's research and development branch for new warships, armaments and battlestations. The Diplomatic Corps negotiated with hostile worlds with the aim of pacifying them without the use of force. The Engineering Corps was tasked with constructing strategic structures like garrisons, ore mines, power generators and space stations. The Exploration and Survey Corps was attached to the Imperial Navy and was used to expand the Empire's borders by finding new planets for conquest. The Surgical Corps was the Empire's medical branch and was also used to develop new bioweapons. Finally, the Military Police ensured discipline in the ranks."}, {"tag": "p", "text": "Other branches of unspecified relationship to the main ten organizations were the Imperial Department of Munitions Resource Development, Imperial Transport, the Internal Safeguards Division, the Imperial Biological Weapons Division, the Imperial Palace Guard, the Imperial Officer Corps, the Imperial Special Forces, an indoctrination program, the Emperor's Demonstration Team, the Imperial Demonstration Team, and the Acolyte and Saber Programs."}, {"tag": "p", "text": "Although technically not actual branches with the Imperial Military, the Department of Public Works and Department of System Exploration had several of its funds diverted at the behest of Emperor Palpatine to fund the development of the two Death Stars as well as the Eye of Palpatine, and top-secret research into starfighter development, several of which were done illegally. The Imperial Advisor Coh Veshiv uncovered the latter instance, although this ended up inadvertently outraging his liege due to a breach in security."}, {"tag": "p", "text": "Although they are not actually part of the standard Imperial Military hierarchy, the Imperial Intelligence and Imperial Security Bureau branches (acting as the intelligence gathering branch and secret police branch, respectively) nonetheless are important enough assets to various Imperial Military operations to allow them to work together with the Imperial Military, as their collected findings and work are vital for their various military operations, as well as to ensure the various branches are ideologically consistent. Similarly, while the Imperial Senate Guards and Imperial Senate Sentinels technically weren't part of the standard Imperial Military hierarchy due to being assigned for guard duty for matters related to the Imperial Senate, they nonetheless have sometimes been attached to and at times even commanded various Imperial Military units should the operation be important enough to require their presence. The Commission for the Preservation of the New Order (COMPNOR), similar to the ISB, was not actually part of the standard Imperial Military hierarchy, but it often was attached to it for largely the same reasons as the ISB (which had itself been a creation of COMPNOR), with the inclusion of CompForce, the military wing of COMPNOR, as an actual regiment in the Imperial Military. Likewise, while not actually part of the Imperial Military, the Imperial Office of Criminal Investigations, and by extension its units the Sector Rangers and Special Enforcement Officers, sometimes worked with the Imperial Military if any criminal investigations happened to involve both parties, as the former had jurisdiction throughout most of the known galaxy."}, {"tag": "p", "text": "The Imperial Military was governed by various regulations. Imperial Military personnel followed and were disciplined under the Imperial Military Code. One regulation required all Imperial vessels to release garbage into the vacuum of space before making a hyperspace jump. Another was that, the moment when an executive vessel (such as a Lambda-class T-4a shuttle) had lowered its ramp, all personnel within the docking area were to stand at attention. One specific set of codes was Section 12-C, which defined capital offenses, which included but was not limited to incitement to mutiny, participation in mutiny, concealing mutineers or evidence of mutiny or planned mutiny and concealing saboteurs or evidence of sabotage or planned sabotage."}, {"tag": "p", "text": "Although technically not part of the Imperial Military, Privateers have an unofficial relationship with the Imperial Military, often raiding enemy shipping under Emperor Palpatine's explicit permission via a letter of marque, with the Imperial Military tolerating their presence in the Outer Rim and letting them have free reign as long as it didn't interfere with their own affairs."}, {"tag": "h3", "text": "Tactical organization"}, {"tag": "p", "text": "The Empire's strategy was described in the Tarkin Doctrine promulgated by Grand Moff Wilhuff Tarkin of Eriadu. Under the Tarkin Doctrine, the Empire's main operational theaters were the Oversectors, which consolidated hundreds of smaller sectors to enable military operations without the interference of political borders."}, {"tag": "p", "text": "Individual sectors were controlled by Moffs and the Oversectors by Grand Moffs, politico-military governors with control over all military assets in their sector. The original twenty sector armies of the Grand Army of the Republic expanded dramatically until the Imperial Army composed of thousands of sector armies and the Navy over a thousand Sector Groups."}, {"tag": "p", "text": "In addition, ambition for the highest posts was encouraged amongst officers to keep competition fierce (with the penalty for failure being death), which likewise meant that a significant number of the Empire's commanders within the New Order being those of formidable military talents, owing to the New Order's valuing ruthless efficiency. However, in some cases, due to bureaucracy and political whims, incapable men were promoted to high posts."}, {"tag": "h2", "text": "Personnel"}, {"tag": "h3", "text": "Specializations"}, {"tag": "p", "text": "Under the Imperial Military's Non-huMan rule, members of the Imperial Military were almost invariably male Humans. Official Imperial policy regarded most alien species as being unfit for command or even self-determination. Those few alien or female military personnel, such as Bertroff Hissa, Mitth'raw'nuruodo, or Natasi Daala rose to high rank through concealing their backgrounds, obtaining powerful patrons, or through raw skill alone."}, {"tag": "p", "text": "The Empire used many foot soldiers in battle. The stormtroopers were the backbone of the Imperial military, serving as the Empire's shock troops, much like many of them did as clone troopers during the Clone Wars. Some stormtroopers were clones left from the Clone Wars, but Emperor Palpatine decided to start cloning other soldiers from different men and start non-clone recruitment after the Kamino Uprising. There were also specialized versions, such as Dark troopers and snowtroopers, that were tasked with specific goals as well as to work in specific environments. Other specializations included the Army Pilots who drove the Empire's walkers and armored vehicles, the Imperial Army troopers who were by far the most common soldiers in the galaxy, the Navy's Gunners, the TIE pilots of the Starfighter Corps, Imperial Marines, specialized stormtroopers trained for shipboard fighting, and the zero-G assault stormtroopers trained for combat in the vacuum of space."}, {"tag": "p", "text": "Imperial officers held command appointments over ships, troops and military units. Such men tended to be Core Worlders, and lack of powerful connections within the military hierarchy could be a bar to high rank. Officers tended to be highly Humanocentric and fully supportive of the New Order's anti-alien policies."}, {"tag": "p", "text": "The most senior officers in the Imperial Military were the twelve Grand Admirals, a cadre of naval strategists, researchers, and New Order partisans appointed by Emperor Palpatine in 2 BBY. Called the \"Circle of Twelve\" by Palpatine, they were assembled to be a leadership cadre for the entire Imperial Military."}, {"tag": "p", "text": "Imperial Missile Launcher Troopers and Imperial Armored Missile Troopers played the role of anti-air infantry during various ground operations. In addition, at least until 2 BBY, the military also had Saber Guards and Imperial Sith Acolytes, which were trained force-sensitive warriors dedicated to lightsaber combat and force abilities, respectively, for use against force users."}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "The Imperial Military took over the ancient system of academies that had trained personnel of the Republic Navy, Planetary Security Forces, and Judicial Forces for millennia. Navy recruits attended Sector Naval Academies, and the most promising graduates could be selected for advanced training at the Imperial Naval Academy on Prefsbelt IV or the Navy War College on Anaxes. Army Officer Training Academies similarly took in prospective soldiers, and the best cadets might be assigned to the prestigious Raithal Academy or the Corulag Academy. The first graduates of the Academy, however, were infamous for instigating a military coup against Palpatine to end the latter's warmongering ways."}, {"tag": "p", "text": "Stormtrooper training took place at the Academy of Carida which used the planet's high gravity to build tougher, more resilient troopers. Training for TIE pilots took place subsequently to basic training for Naval personnel at a flight school, typically aboard a Star Destroyer."}, {"tag": "h3", "text": "Ranks"}, {"tag": "p", "text": "Officer ranks within the Imperial Military was denoted by a specific combination of colored squares and code cylinders worn on the uniform. The Military divided rank into Position, Line rank, and Specialist rank. Position referred to an officer's current assignment on a ship or unit as opposed to permanent rank, and included the honorary titles of High Admiral and Warlord of the Empire, usually granted to Grand Moffs, Grand Admirals and Grand Generals. Other titles included Baron of the Empire and Tan. Ironically, the title of Warlord of the Empire would later become infamous for the splintering of the Empire post-Endor, where various rogue Imperial officers created fiefdoms that feuded with each other, to the extent that they were referred to as Warlords."}, {"tag": "p", "text": "Line ranks were permanent ranks held by those who commanded ships, military units, or fleets. There were very few officers with permanent line ranks above that of Navy Senior Captain or Army Colonel."}, {"tag": "p", "text": "Specialist rank was held by those in the technical branches and broadly mirrored the line ranks of the Imperial Army. Specialists promoted above the rank of General would be promoted into the line ranks but would receive honorary titles related to their branch."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Uniforms"}, {"tag": "p", "text": "Officers in the Army and Navy wore an olive-gray uniform tunic and trousers with matching caps and black leather boots. Officers in the Stormtrooper Corps wore identical uniforms but all-black in color, and in battle wore the same white armor as their soldiers but with rank insignia. Similar black-colored NCO uniforms were also prevalent among veteran pilots and prison guards."}, {"tag": "p", "text": "Enlisted personnel wore a variety of coveralls or jumpsuits depending on role. Imperial Army troopers wore gray battledress with partial body armor and helmets in combat. Imperial Navy troopers wore black jumpsuits and large helmets, while technicians and specialists wore gray jumpsuits with black caps."}, {"tag": "p", "text": "The most striking military uniforms were the stark white uniforms of the twelve Grand Admirals, which also bore gold epaulettes to show the seniority of their rank."}, {"tag": "p", "text": "Around 0 BBY, various Imperial officers had their hair cut in a way that exposed the sideburns, although this practice was discontinued some time after the Battle of Yavin."}, {"tag": "p", "text": "Although technically not a standard uniform for the Imperial Military, various Imperials stationed at Restuss utilized the Crusader Mark III armor provided to them by Black Sun during the battle against Rebel forces for the Star Core. The Rebels, likewise, wore Crusader Mark II armor during that time, and also developed by Black Sun as a way of profiting from the war by selling Crusader armor to both sides without tipping either side off."}, {"tag": "h3", "text": "Ground Vehicles"}, {"tag": "p", "text": "Walkers such as AT-STs and AT-ATs symbolized the might and resources of the Empire. They were giant weapons of war, feared by all. Many believed such weapons to be invincible. However, the AT- AT had two fatal flaws—its neck and its legs. (Rebel Snowspeeder pilots exploited these weaknesses on Hoth.) After the formation of the Empire at the end of the Clone Wars, many vehicles left over from that previous galactic conflict were used by the military, along with Separatist light vehicles, such as the Dwarf Spider Droid. Later on in the Empire's existence as the primary galactic power, older vehicles, such as the AT-AP, Juggernaut,(Juggernauts were used in action on Hoth) and cargo AT-TEs were used in the Outer Rim."}, {"tag": "p", "text": "Less widely known vehicles included the AT-RT, AT-AA, AT-AP, AT-PT, AT-TE, MT-AT, HAVw A6 Juggernauts and the TX-130T fighter tank. These units were not as famous as their counterparts but remained very dangerous to enemy units."}, {"tag": "h3", "text": "Ships"}, {"tag": "p", "text": "Although Venator-class Star Destroyers had served valiantly in the defense of the Republic during the Clone Wars, the rise of the Galactic Empire quickly turned the powerful vessels into symbols of fear and intimidation. The Venator and Victory-class Star Destroyers were stripped of their Republic markings and became the first of many warships that would comprise the Imperial Starfleet. Despite the total collapse of the Confederacy of Independent Systems, the Empire's military spending would only increase, leading to the development of the Imperial-class Star Destroyer. Eventually, the former Republic vessels would be phased out in favor of the new Imperial class, which would become the primary symbol of Imperial space power."}, {"tag": "p", "text": "The Immobilizer 418 cruiser, also known as the Interdictor-class heavy cruiser, Interdictor-class Star Destroyer, or Interdictor-class medium frigate, was a 600-meter-long cruiser built on the standard Vindicator-class heavy cruiser hull. This vessel was equipped with 4 gravity well projectors, massive devices that projected pseudo-gravity that could prevent a vessel from escaping into hyperspace. The New Republic captured the remaining Immobilizer 418s, and upgraded their gravity- well projectors."}, {"tag": "p", "text": "The Empire used many capital ships as frigates. Some of the most common were the Victory II-class Star Destroyer and the Carrack-class light cruiser. They varied in size and power, but each was still a force to be reckoned with. They were more specialized than Star Destroyers, and though Star Destroyers were the backbone of the Fleet, frigates were more commonly used, unless a major battle was at hand.\nThe culmination of the Star Destroyer design came in the form of the Executor-class Star Dreadnought, which was larger and more powerful still. Several Executor-class ships were known to have been constructed, including the original Executor, the Lusankya, the Iron Fist and one other Super Star Destroyer of unidentified class which served much later on fighting against the Yuuzhan Vong."}, {"tag": "p", "text": "The fleet also used two Eclipse-class Super Star Destroyers during Operation Shadow Hand. These mighty ships were equipped with superlasers powerful enough to melt a planet's crust."}, {"tag": "h3", "text": "Starfighters"}, {"tag": "p", "text": "The Empire had millions of TIE Series starfighters, coming in many varieties. All varieties of the TIE (except for the TIE Defender, TIE Hunter, TIE Avenger, TIE Phantom, and the TIE Advanced X1), however, lacked shields. This made the craft more vulnerable than the other ships used in the Imperial Military, forcing the pilots to fly with greater precision, demanding the highest skill from each one."}, {"tag": "p", "text": "The TIE Fighter was the Empire's most common fighter. Though the fighter had no shields, it was very fast, and, most important to Palpatine, it was cheap. There were many variations on the original, such as the TIE Interceptor, the TIE Bomber, and the TIE Defender. With the exception of the Defender, all were relatively cheap and extremely efficient."}, {"tag": "p", "text": "The Imperial R.O.E. (Rules Of Engagement) stated that Imperial TIE Fighters must have a 3 to 1 ratio advantage over enemy fighters in order to engage. Beating the enemy in numbers was a key part of Imperial strategy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In A. C. Crispin's book, The Paradise Snare, it is subtly hinted that The Imperial March is \"the martial theme of the Imperial Navy.\""}, {"tag": "p", "text": "Death Star Designer provides a few information on the color symbolism in the Imperial military. It says \"no one is ever fired or telekinetically executed for choosing Imperial Grey. It's the traditional color for imperial ships and stations\". It also talks about \"Sith Black\", which \"adds a touch of ancient dread to any battle station\". \"Stormtrooper White\" is said to be \"the perfect choice for the battlestation designer that knows that what we don't see is more terrifying than what we do\". Finally, \"Republic Red\" follows the teaching of \"co-opting the legacy of republican traditions\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}