{"url": "Imperial_Military_Department_of_Advanced_Weapons_Research", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Imperial Intelligence bureaus and branches", "Category:Imperial Security Bureau branches"], "nodes": [{"tag": "h1", "text": "Imperial Military Department of Advanced Weapons Research"}, {"tag": "p", "text": "The Imperial Military Department of Advanced Weapons Research, also called the Imperial weapons division, or Imperial Advance Weapon Development, was an agency of the Galactic Empire responsible for the development of emerging technologies for use by the military. Weapons development fell under the arm of Imperial Intelligence, while it looked to the Imperial Security Bureau to defend the agency's secrets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Advanced Weapons Research was responsible for Project Blackwing, a clandestine experiment to revive necrotic tissue. To ensure the secrecy of the Death Star project, the Imperial weapons division used poison canisters to perpetrate genocide against the Geonosian species. In 2 BBY, the Spectres and Saw Gerrera discovered several of these canisters on Geonosis during a mission to investigate the disappearance of the Geonosians. Sabine Wren recognized the canisters as belonging to the Imperial weapons division."}, {"tag": "p", "text": "The group also developed the Electro-Proton Bomb/Defoliator."}, {"tag": "p", "text": "Under the leadership of Director Orson Krennic, Advanced Weapons Research was responsible for the completion of the long-delayed Death Star project. Krennic, however, was killed on the planet Scarif during the battle where the Rebel Alliance managed to extract the Death Star plans."}, {"tag": "p", "text": "Despite Krennic's death, the group continued and was responsible for the construction of the second Death Star."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}