{"url": "Imperial_Mission", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Imperial Departments"], "nodes": [{"tag": "h1", "text": "Imperial Mission"}, {"tag": "p", "text": "The Imperial Mission was an organization that was formed after the Second Galactic Civil War. Members of the Mission, termed Missionaries, devoted themselves to service as the true embodiment of the next Galactic Empire."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "This Mission was created by Jagged Fel as a part of the Victory Without War program, but was actually suggested in a throw-away remark by Han Solo. Its goal was to peacefully spread Imperial influence by providing aid to people and planets ruined by the Yuuzhan Vong War, and to help those generally in poverty."}, {"tag": "p", "text": "Shado and Astraal Vao were taken in by the Mission when they were young orphans. Shado eventually left and became a Jedi, while Astraal remained, becoming a missionary herself."}, {"tag": "p", "text": "Around 130 ABY, it was headed by Moff Konrad Rus, who like the rest of the Moff Council, swore allegiance to the usurper Emperor Darth Krayt after he staged a coup and deposed Roan Fel from the throne, killing Fel's decoy and a group of Imperial Knights in the process."}, {"tag": "p", "text": "In 137 ABY, Darth Talon attacked Marasiah Fel, Elke Vetter, and Astraal at the Mission on Socorro, but Marasiah and Astraal escaped. By this time and thanks to the efforts of Moff Rus, the Sith Empire kept funding the Mission, allowing it to continue aiding the poor of the galaxy."}, {"tag": "p", "text": "However, after Darth Wyyrlok incapacitated Darth Krayt, and put into motion the Dark Lord's vision to bring the entire population of the galaxy into the fold of the One Sith, he ordered that the Imperial Mission's guidelines would be altered so Imperial Missionaries would spread the Sith Code as well as Sith values to the masses of the galaxy."}, {"tag": "p", "text": "After the Battle of Coruscant, which saw the defeat of Darth Krayt's forces, Empress Marasiah Fel disbanded the Imperial Mission due to its unpopularity following the war and the Sith's abuse of it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}