{"url": "Imperial_Naval_Academy", "categories": ["Category:Legends articles", "Category:Galactic Republic academies", "Category:Imperial Academies", "Category:Prefsbelt locations"], "nodes": [{"tag": "h1", "text": "Imperial Naval Academy"}, {"tag": "p", "text": "The Imperial Naval Academy, originally known as the Republic Naval Academy, was the primary naval academy used by the Republic Navy and the Imperial Navy. The Academy was also known by names such as the Prefsbelt IV Naval Academy, Prefsbelt Imperial Academy, Prefsbelt Fleet Camp, and the Imperial Naval College, and though the academy's location was officially classified, it was widely known to be located on the planet Prefsbelt IV. Founded after the Pius Dea Crusades during Admiral Pers Pradeux's restructuring of the Republic Navy, the academy served the Republic for thousands of years, and served its successor state, the Galactic Empire, as one of the three premier institutions of the Imperial Academy system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Naval Academy on the planet Prefsbelt IV was built on the hills surrounding around Castle Pradeux and the Twelve Mounts—a series of peaks named after famous naval battles. A lengthy passage, kilometers long, ran from Castle Pradeux to the heart of the Twelve Mounts, ending at the Naval Crypt where the \"Father of the Navy,\" Pers Pradeux, was entombed. During graduation, midshipmen would walk the length of the passage in silence to the Crypt, where each would dedicate themselves to the naval service. After graduation, midshipmen recessed down the Incline of the Mounts, which was lined with monuments and historical artifacts, and were then conveyed by hovertrain to Prefsbelt Green. The skyhook over Prefsbelt Green led to Prefsbelt Black, where midshipmen would receive their orders. Classrooms within the Academy often included large holoprojectors used to display simulations and records of past battles."}, {"tag": "p", "text": "There was also another portion of the academy located in a barren valley that contained a central tower, at least two hangars, four barred hangars, searchlights, and a landing pad that was guarded by four turrets, with several TIEs often landing on the ground at night. At least three communication arrays and five landing pads were also in close proximity to the building, and the building was also guarded by eight sensor arrays."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Prefsbelt IV was first discovered by Admiral Pers Pradeux of the Republic Navy during the Pius Dea Crusades, and he turned the world into a retreat for naval officers of the Renunciates movement. After the Battle of Uquine brought an end to Pius Dea rule of the Galactic Republic in 10,966 BBY, Pradeux and his fellow officers rebuilt and reorganized the Republic Navy during a series of meetings on Prefsbelt, and the planet was chosen as the site of the Republic Naval Academy. Its location remained secret for more than a thousand years, but even after it became known, the Academy's location remained officially need-to-know; many children from the Core Worlds knew of Prefsbelt from holodramas. Under the Republic, the Republic Naval Academy trained the cadets of the Judicial Forces and Planetary Security Forces for generations; Wullf Yularen was one of many naval officers to come out of Prefsbelt. When the Galactic Empire came to power in 19 BBY, the Academy became a cornerstone of the new Imperial Academy system, with smaller Sector Naval Academies being modeled after the primary Naval Academy."}, {"tag": "p", "text": "Prefsbelt students began with academic study and tactical simulations, and later moved on to leadership courses and active service rotations as ensigns. Most students entered naval service after three years at the Academy, but some students instead shifted to flight schools, and some continued their studies at the Empire's three specialized military schools, as did some graduates of the Imperial Army Academy on Raithal. The Corulag Imperial Military Academy trained cadets from all services, putting an emphasis on active training, while Anaxes focused on active training and combat simulations, serving as a think tank and testing ground for new warships and equipment. Some students also spent semesters at the Academy of Carida, the training academy for the Empire's Stormtrooper Corps. The Academy also included an Officer Candidate School, which Han Solo was recommended for."}, {"tag": "p", "text": "Before the Battle of Yavin, Soontir Fel worked as an instructor at the Academy on Prefsbelt IV, where he trained cadets including Biggs Darklighter, Tycho Celchu, and Derek Klivian, all of whom defected to become heroes of the Rebel Alliance. Nevertheless, Prefsbelt IV produced many notable Imperial officers such as T. Alvak, Terrinald Screed, Zsinj, Evir Derricote, During the Galactic Civil War between the Empire and the Rebel Alliance, the mathematics instructor Greg Somax was an Alliance spy at the Academy, recruiting operatives from the ranks of the Imperial cadets. Delak Krennel was an unarmed combat champion there, while his classmate Wynt Kepporra was an engineering student and a member of the Thespian Union at the Academy."}, {"tag": "p", "text": "In 4 ABY, the Imperial Naval Academy was infiltrated by Rogue Squadron to retrieve the Lambda-class T-4a shuttle Tydirium after it somehow ended up back in Imperial hands."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Naval Academy was first mentioned in the first edition of Star Wars: The Roleplaying Game, the October 1987 rulebook for West End Games's Star Wars: The Roleplaying Game, and its location was established in The Star Wars Sourcebook a month later. However, the 1989 Imperial Sourcebook stated that the Academy's location was unknown even to most of its students. and various subsequent sources did not always refer to the Academy's location. The contradiction was resolved with the 2003 reference book Coruscant and the Core Worlds, which established that the Academy's location on Prefsbelt was common knowledge despite it being officially classified. The Imperial Academy system and the Prefsbelt Academy were further fleshed out in the 2012 reference book The Essential Guide to Warfare by Jason Fry, resolving various contradictions about the Imperial training systems."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}