{"url": "Imperial_Office_of_Criminal_Investigations/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Imperial Office of Criminal Investigations"], "nodes": [{"tag": "h1", "text": "Imperial Office of Criminal Investigations"}, {"tag": "p", "text": "The Imperial Office of Criminal Investigations (IOCI), was the primary law enforcement agency of the Galactic Empire and answered to the Coalition for Progress, a part of the Commission for the Preservation of the New Order. Led by a director, the IOCI was responsible for investigating and fighting criminal activities, specifically those of criminal syndicates and individuals who committed crimes on multiple planets. IOCI also managed the Imperial Enforcement DataCore, a database for posted bounties. The IOCI was formed in 19 BBY from the Republic Office of Criminal Investigations, its predecessor under the Galactic Republic."}, {"tag": "p", "text": "The jurisdiction of the IOCI included most of the known galaxy. As such they frequently worked with local law enforcement agencies, Imperial Intelligence, and various branches of the Imperial Military. They also worked with the Imperial Security Bureau, the Empire's secret police. However, the ISB focused more on political investigations while the IOCI strictly focused on the enforcement of criminal law. Alongside the regular police officers and investigators in its employ, the IOCI had two elite operatives. The first were the Sector Rangers, an apolitical police force in existence since the early days of the Republic, and the Special Enforcement Officers, most who were recruited from the Sector Rangers and conducted undercover operations."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The Imperial Office of Criminal Investigations served as the Galactic Empire's primary law enforcement agency. Though it answered to the Coalition for Progress, a part of Commission for the Preservation of the New Order (COMPNOR), the IOCI was notoriously apolitical and focused strictly on criminal law enforcement in contrast to its secret police counterpart, the Imperial Security Bureau (ISB), which focused on political investigations. The IOCI investigated crimes that occurred in multiple jurisdictions as well as organized crime and criminal syndicates. It also supervised the activities of bounty hunters such as managing the Imperial Enforcement DataCore, which listed all current bounties. When a person wanted someone caught, they paid the full bounty to the IOCI which would extract a fee and then post the bounty on the Enforcement DataCore. The IOCI would also issue Imperial Peace-Keeping Certificates (IPKC), allowing persons to conduct bounty hunting activities and to use lethal force if necessary."}, {"tag": "p", "text": "Led by a director, the IOCI employed police officers and investigators in its service. In addition to them, the IOCI also had two elite operatives, the Sector Rangers and the Special Enforcement Officers. The Sector Rangers were one of the oldest police forces in existence. They were mostly assigned to provide law enforcement services in the farthest stretches of Imperial space and generally worked in pairs or teams. Rangers were authorized to deputize who ever they needed to fulfill their tasks and could commander local police resources or militias if need be. The Special Enforcement Officers (SEO) were mostly recruited from the Sector Rangers. They often conducted highly dangerous or undercover missions and were fiercely independent generally working alone. Both the Sector Rangers and the SEOs were given a large latitude in enforcing the law. As they generally focused on larger targets, petty crimes were often overlooked and their cavalier attitude and willingness to work with pretty much anyone made them popular among the populace, though not necessarily COMPNOR and the ISB."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Under the Judicial Department, the Republic Office of Criminal Investigations served as the primary criminal investigations service during the Galactic Republic. With the formation of the Empire in 19 BBY, it became the Imperial Office of Criminal Investigations. Placed under COMPNOR's Coalition for Progress justice branch, the IOCI continued as it had before with little change, save its name."}, {"tag": "p", "text": "In 1 ABY, the IOCI posted bounties on the Enforcement DataCore for former Senators Mon Mothma and Leia Organa. The posting of bounties for former members of the Imperial Senate was a first in history. That same year at the behest of Moff Landric, the IOCI assigned Inspector Zanza Gata, a Special Enforcement Officer, to bring the art thief known only as the \"Tombat\" to justice. IOCI Director Jacen Corbit introduced the SEO to a packed room of reporters in a dramatic press conference on Danteel. Gata made a brief statement promising to fully investigate the crimes and bring the thief before a court. It was also at that time, the TriNebulon News reporter, Andor Javin, reported to the IOCI his theory that the smuggler Platt Okeefe was the long sought after criminal known as Cynabar. However, the IOCI took little notice of his theory."}, {"tag": "p", "text": "Mulvek Gra was an IOCI Sergeant stationed on the planet Celanon. He was too old for field duty, but had served previously with System Sub-Commander Jared Brojtal and was like an uncle to his son. When the boy was killed during the Bombing of Syndaar Military Prep School, he vowed to assist Jared in any way possible to locate Ort Hoogra-D'En, the terrorist responsible. Mulvek kept an eye on a group of persons who accepted the bounty on Ort, and fed the leads they discovered back to Jared."}, {"tag": "p", "text": "Jerik Snivas served as an investigator for the IOCI for many years. He was eventually promoted to an important position in the local office on Kwenn Space Station. However, years of shady dealings led him to leave IOCI to avoid being investigated and prosecuted. He became a free-lance expediter where his connections allowed him to stay in business."}, {"tag": "p", "text": "After the death of Emperor Palpatine in 4 ABY, the IOCI remained relatively intact but only in those areas under staunch Imperial control. Other Imperial factions operated offices similar to the IOCI. However, the IOCI became increasingly fragmented as the Empire dissolved."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Office of Criminal Investigations was first mentioned in Galaxy Guide 9: Fragments from the Rim, a sourcebook for the Star Wars: The Roleplaying Game from West End Games. It made its first appearances in the Star Wars Adventure Journals and was part of two stories in the No Disintegrations sourcebook. Some missions that players could get at Imperial Mission Terminals in Star Wars Galaxies, wherein it hired players to eliminate certain criminal targets. It received notable mentions in Galaxy Guide 10: Bounty Hunters and Pirates & Privateers an entry in the The Complete Star Wars Encyclopedia and expanded entries in Galaxy Guide 11: Criminal Organizations and the Star Wars: Edge of the Empire Core Rulebook.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}