{"url": "Imperial_Office_of_Customs/Legends", "categories": ["Category:Legends articles", "Category:Imperial Departments"], "nodes": [{"tag": "h1", "text": "Imperial Office of Customs"}, {"tag": "p", "text": "The Imperial Office of Customs, or Imperial Customs was an agency of the Galactic Empire responsible for ensuring imports and exports that traveled through Imperial Space were legal and complied with Imperial laws and regulations. Furthermore, Customs also helped deter pirates and participate in search and rescue missions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Imperial Office of Customs was an agency of the Imperial Military that monitored exports and imports through the space of the Galactic Empire, also making sure that corresponding taxes and tariffs were collected. In that capacity, Imperial Customs engaged legitimate independent spacers and large-scale freight haulers, smugglers, arms runners, spice traders, anyone without proper identification signals and other criminals engaged in the movement and sale of illegal substances. Customs also helped against pirates and participated in search and rescue operations."}, {"tag": "p", "text": "Customs had to answer to the Commerce agency of COMPNOR, which collected information about the impact of piracy on Imperial trade."}, {"tag": "p", "text": "Imperial Customs worked closely with the Imperial Navy and used uniforms that were very similar to those used by the Navy, however both were separate organizations."}, {"tag": "p", "text": "The agency had its own fleet of light patrol starships. The most recognizable symbol of Imperial Customs was the Rendili Star Drive Light corvette, more commonly known as the \"Imperial Customs Corvette\" because the ship was produced exclusively for the Customs office. Customs tried to keep at least one of these vessels on patrol in every system, and backwater systems could expect a visit at least every three to four weeks."}, {"tag": "p", "text": "Other common vessels used by Imperial Customs were the Imperial Customs Frigate and the Guardian-class light cruiser (plus its later variant, the Guardian 334-class light cruiser). A number of old PB-950 patrol boats were part of the Imperial Customs force."}, {"tag": "p", "text": "The Imperial Office of Customs had a significant number of space stations - such as Golan III defensive platforms - under their control at the time of the Galactic Civil War. These platforms were located on common hyperspace corridors of which were serviced and protected by the Imperial Navy. Usually there were also stormtroopers ready to help Imperial Customs. An example of a Customs Outpost of this type would be the platform located in the Zhar system."}, {"tag": "p", "text": "Customs also ran checkpoints in some starports. The agency had formal control over the local starport authorities, but in practice local officers ignored Imperial Customs agents (a situation that smugglers used to their advantage, as local customs employees were more open to bribery). The empire maintained a customs checkpoint in the city of Iziz on Onderon."}, {"tag": "p", "text": "Imperial Office of Customs applied holoseals to inspected cargo, these holoseals had a register code that could be read with a special Imperial Customs tag scanner datapad. The code contained information about where it was issued while the holoseal was hard to remove or modify. Local customs authorities used similar seals but the imperial holoseal was the best coded. Finally Imperial Customs Inspectors were expected to write cargo information into the Imperial Customs database, but they rarely did."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Most Imperial Office of Customs officers were honest, but some of them were so corrupt that even legitimate merchants had fear of being boarded by Customs personnel."}, {"tag": "p", "text": "Early in the Galactic Civil War, the Commerce agency of COMPNOR began to draw Imperial Customs personnel and assets into operations to shut down Rebel supplies. Many leaders of Imperial Customs disagreed with these actions aimed to draw their resources into the war."}, {"tag": "p", "text": "Inspecting commercial vessels was a duty assigned to Imperial Customs, but the Imperial Navy sometimes helped Customs in lawless sectors where more firepower was required. Sometimes the Navy performed its own checks in order to increase the security of installations such as the stardock in Wroona."}, {"tag": "p", "text": "It was considered a class 4 infraction to tamper with an Imperial Customs holoseal (a 1,000 to 5,000 credits fine, up to one month imprisonment and confiscation of cargo). Under some circumstances more severe class 3 or class 2 infractions applied."}, {"tag": "p", "text": "Some officers applied for transfers between the Navy and Imperial Customs, such as Soontir Fel (who spent some time in command of Customs vessels) and Mandus Fouc (who saw his transfer to the Navy permanently delayed after the Battle of Endor). Dwin Arnae was removed from the Navy by his superiors and sent to the Sector Interdiction Office of the Minos Cluster, eventually becoming captain of a customs corvette."}, {"tag": "p", "text": "At some point before the Battle of Endor, a battle took place in the outer edges of the Wroona system when Imperial Customs vessels engaged a pirate fleet."}, {"tag": "p", "text": "Imperial Customs was still operating some time after 4 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The exact name of this organization varies in many sources, it has been called Imperial Customs Office, Imperial Customs Bureau, and most often just named Imperial Customs and referred to as an agency."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}