{"url": "Anakin_Skywalker%27s_Delta-7B_Aethersprite-class_light_interceptor", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Ship stubs", "Category:Delta-7B Aethersprite-class light interceptors", "Category:Jedi starfighters", "Category:Unidentified starfighters"], "nodes": [{"tag": "h1", "text": "Anakin Skywalker's Delta-7B Aethersprite-class light interceptor"}, {"tag": "p", "text": "Jedi Knight Anakin Skywalker flew a Delta-7B Aethersprite-class light interceptor during the majority of the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the battle of Geonosis, Jedi General Anakin Skywalker used the interceptor during a firefight in the Corvair sector. Skywalker then used it to land on Kudo III. Skywalker flew his interceptor alongside Master Obi-Wan Kenobi's interceptor during the battle of Christophsis. Skywalker used his interceptor during the battle of Bothawui against General Grievous' fleet. Skywalker led Gold Squadron and attempted to pursue Grievous' fighter, the Soulless One. Unfortunately, the interceptor was damaged, Skywalker was rescued by Captain Rex, and R2-D2 was left with the interceptor in the asteroid field among battle debris. The interceptor was scavenged by Gha Nachkt's ship, the Vulture's Claw and took R2."}, {"tag": "p", "text": "The interceptor was recovered and took on a new astromech, R3-S6. As Skywalker took the interceptor to search for a separatist spy station, R3, in reality a separatist spy, activated the interceptor's tracking device. Grievous arrived and attacked Skywalker's interceptor. Skywalker attempted to escape but R3 disabled the interceptor's weapons. Skywalker, R3 and the interceptor were then rescued by his apprentice Ahsoka Tano and the Twilight. Skywalker then used his interceptor to rescue R2 from the falling Skytop Station."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}