{"url": "Imperial_Palace/Legends", "categories": ["Category:Legends articles", "Category:Coruscant government buildings", "Category:Coruscant residential buildings", "Category:Galactic Empire", "Category:Galactic Republic locations", "Category:Imperial Palace locations", "Category:New Republic locations", "Category:Palaces", "Category:Twenty Wonders of the Galaxy"], "nodes": [{"tag": "h1", "text": "Imperial Palace"}, {"tag": "p", "text": "The Imperial Palace, originally known as the Presidential Palace or Palace of the Republic, was a massive complex of buildings located in the Palace District of Coruscant, an ancillary of the Senate District. Originally built as a residence for the Supreme Chancellor of the Galactic Republic Senate, the Palace also served as an office building, complementing the delegation offices of the Senate Building. Following the election of Chancellor Palpatine, the Republic Executive Building was erected in the Legislative Borough to accommodate overflow from the Palace."}, {"tag": "p", "text": "Following the catastrophic Clone Wars, Chancellor Palpatine eradicated the Jedi Order and declared the reforming of the Republic into the Galactic Empire and renaming the Palace as the Imperial Palace. Expanding the complex significantly, Emperor Palpatine created a labyrinthine maze inside the pyramidal structure and confined himself to his throne room for most of his reign. Following the death of the Emperor and the conclusion of the Galactic Civil War the Palace was taken by the New Republic and raided, with most functionaries inside being killed in the firefight. After the Palace was secured the New Republic used it as the residence of the Chief of State and maintained a large governmental presence in the building. Despite attempts to rename the building the Capitol or Republic House, or its former title of Presidential Palace, Imperial Palace remained its primary title. For many years, it was regarded as the de facto command center for leadership of the galaxy."}, {"tag": "p", "text": "After surviving several regime changes and millennium of use the Palace was severely damaged during the fall of Coruscant during the Yuuzhan Vong invasion of the galaxy. While several levels were obliterated during the battle, the Galactic Alliance retook Coruscant and the Palace shortly after the end of the war and began the slow process of removing all remnants of the invaders on the uppermost levels of Coruscant's towers. Several decades later the Imperial Remnant, under the command of Emperor Roan Fel, retook the capital and reoccupied the Palace. Not long after the Imperial conquest, the reborn Sith Empire betrayed the Empire which had aligned with it and deposed Fel. As Darth Krayt took over the Empire, he used the Palace as his temporary throne as construction finished up on the nearby Temple of the Sith."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Republic"}, {"tag": "p", "text": "Constructed by the Galactic Republic on the capital world Coruscant during the institution's earlier years, the massive complex known as the Presidential Palace was famed across the stars, earning a place on famed historian Vicendi's list of the Twenty Wonders of the Galaxy in 10,000 BBY. Serving as the formal residence of the Supreme Chancellor for multiple millennia, the Presidential Palace also was a working office for many who served in the Galactic Senate. This tall, brilliant pyramid was located a few bridges away from the Jedi Temple, and could be seen in the distance from the Temple district."}, {"tag": "p", "text": "During the administration of Supreme Chancellor Finis Valorum from 40-32 BBY, the summit office of the central tower served as his residence; Valorum used the area as a retreat from his busier schedule at the Rotunda's working office and often met with advisers and those close to him at the Palace rather than amid the hustle and bustle. During the Invasion of Naboo, the young Anakin Skywalker was brought to Coruscant by Qui-Gon Jinn. As he was waiting outside of the Jedi Temple of Coruscant to know whether he would be trained as a Jedi or not, Skywalker grew impatient, and he decided to explore the vicinity of the Temple district. The Presidential Palace caught his eye, and after crossing many bridges, the young boy finally reached the brilliant pyramid. He had ventured so far from the Jedi Temple that he could not see it anymore."}, {"tag": "p", "text": "When Palpatine of Naboo ascended to the office of Chancellor, he distanced himself from the Palace and the traditional offices reserved for the Chancellor. Instead Palpatine ordered the construction of the Republic Executive Building to serve as an annex to the Senate Rotunda and to take up overflow from the Palace. Instead of residing in the Palace, Palpatine took up an apartment suite in 500 Republica, a stately spire overlooking the Senate District."}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "Following the Clone Wars, a bloody war orchestrated by Chancellor Palpatine's alter-ego Darth Sidious, the Jedi Order was disbanded and the Republic reorganized into the Galactic Empire. Declaring himself Emperor, Palpatine removed himself from public affairs and cloistered himself in an audience chamber atop the newly christened Emperor Palpatine Surgical Reconstruction Center. Using the facility as a temporary base, the Emperor ordered the refurbishment of the stately governmental Palace nearer to the Senate Building, drastically rebuilding the structure until it became the tallest building on the planet. In addition, in large part because of the Imperialization that was occurring around this time, Imperial-issued credit coins worth 1000 credits contained an effegy of the Imperial Palace on one side."}, {"tag": "p", "text": "In the early days of his reign, Palpatine was nearly killed when Gentis, Headmaster of the Imperial Academy, attempted a military coup. The Emperor was poisoned via Aorth-6 in his throne room, and he only survived due to his connection to the dark side of the Force. The finalization of the Imperial Palace was hastened following the attempted coup."}, {"tag": "p", "text": "Taking up residence in the Palace, Emperor Palpatine remained isolated at the heart of the massive pyramid, scarcely wandering far and rarely appearing in public. Despite Palpatine's isolationism the rest of the Palace bustled constantly with activity, from dignitaries to Senators, ambassadors and generals, Darth Vader and the mysterious and anonymous Emperor's Hands. C-3PO briefly worked as a preschool attendant at the Imperial Palace for a year, after an incident during the Emperor's Ball where he mistook the Imperial Supreme Commander Vader for a new model of Guard Droids."}, {"tag": "p", "text": "In the wake of the death of the Emperor at the climatic battle over the Sanctuary Moon of Endor the Imperials residing in the Palace were subject to a power vacuum of those vying for the title of Emperor. As Grand Vizier Sate Pestage declared himself interim Emperor, Director of Imperial Intelligence Ysanne Isard began to position herself for ascension to the throne. At the Palace, a black veil covered the vacant ceremonial throne during Pestage's rule as to maintain appropriate decorum following the Emperor's death. As Pestage plotted, Isard secretly held Emperor's Hand Mara Jade in the dungeons of the Palace and allowed Pestage to feed her information about the mysterious aide to the Emperor."}, {"tag": "p", "text": "Deciding that Jade was too great a threat to be an ally, Isard ordered the Hand to be brainwashed into giving Isard secrets about the Empire that she was not previously aware of. During the process the Emperor's Hand used a mind trick to have her interrogator release her and allow her access to a computer terminal. Isard's men detected this immediately, and she personally began to track Jade through the labyrinthine Palace. Assisted by tech specialist Tal Burren, they eventually realized Jade was in Isard's personal office, but by the time they arrived, she was gone. The Emperor's Hand had stolen one of Isard's datapads with high level security clearance, and was using it to travel through the building unhindered. Jade had left them many false leads, ordering dozens of shuttles to various docking bays; Jade ultimately escaped, something which Isard took personally."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "As the Empire crumbled, the New Republic thrust forward, openly attacking Coruscant and attempting to rout all Imperials on the world. As the fighting drew to a crescendo, Republic forces shelled the Palace, one of the last vestiges of Imperial might on the world. With the Palace's defenses weakened, Jedi Master Luke Skywalker led Republic troops to the Palace, defeating General Tal Ashen's Elite Force in the process. Marching into the Palace, Skywalker and his troops stormed the entire complex, killing off the last of the remaining Imperial Guards and releasing Imperial-held prisoners-of-war. When the Palace was secured and the fighting died down, the Republic forces detained the surviving Imperial officials and functionaries; all of whom were lynched by Republic soldiers, even those who were innocent of any of the Empire's crimes (or at most had only minor crimes by comparsion) and/or were never even reported, and also looted various possessions within the palace."}, {"tag": "p", "text": "As Coruscant regained a sense of normalcy, the Republic began to set-up its Senate and other government agencies on the planet. Using the existing infrastructure, the government took up residence in the Imperial Palace; making significant changes to its exterior, largely to remove damaged structures and repair those areas that were still habitable. The formal residence of the Chief of State, the Palace served as the primary office building for members of the Senate in addition to offices still kept at the Rotunda. Because of the negative connotation associated with the Palace's Imperial name, Republic dignitaries attempted to adopt the title Republic House, even simply calling it Capitol. Despite many attempts, these efforts fell short and the Imperial title remained."}, {"tag": "p", "text": "Under the administration of Chief Borsk Fey'lya an extra-galactic race known as the Yuuzhan Vong began a campaign of conquest and destruction across known space. During this time every being about the Imperial Palace was in a constant flutter to process reports of the last world to fall to the invaders. On one occasion young Finn Galfridian, a Padawan of Master Skywalker's reconstructed Jedi Order, forced his way past the Palace Guards and into the Palace in an attempt to warn Chief Fey'lya of an assassination attempt which has been foreseen by his tutor, Dray. Attacked by the Imperial ambassador, Yarmond, before he could get to the Bothan, Galfridian was able to deduce that Yarmond was actually the Yuuzhan Vong assassin."}, {"tag": "p", "text": "When the Jedi regained consciousness in the confines of a prison cell he was interrogated by Chief Fey'lya despite several attempts to explain himself. Unwilling to believe the Jedi, Fey'lya stormed out of the chamber, unknowingly leaving Galfridian alone to be freed by Dray and his droid Prowl. Agreeing that Fey'lya, despite his temper and belligerence, needed to be saved, the group split up; while Dray hunted down Yarmond, Galfridian would retrieve his lightsaber and other personal belongings. As the Jedi and droid made it to the main levels of the Palace they caused a distraction, only to be captured once more; this time by Guard Captain Kopri. As Galfridian's droid continued to cause chaos outside the Palace by firing fire bombs, the guards became distracted and the Jedi was able to escape and reclaim his gear."}, {"tag": "p", "text": "As the war grew more costly for the Republic and worlds continued to fall, the unthinkable happened. Yuuzhan Vong warships descended on Coruscant, driving the Republic offworld during what history would remember as the Battle of Coruscant. Holed up in the Imperial Palace, Chief Fey'lya drew the onslaught of Yuuzhan Vong warriors up into the heights of the Palace, close enough to the precious data towers that as Chief of State he could not allow fall to the invaders. Surrounded with no way of escape, Fey'lya was executed by Yuuzhan Vong commander Romm Zqar; as the Bothan died, a bomb in tune with his vital signature detonated taking with it 25,000 Yuuzhan Vong warriors, the data towers and most of the Palace's upper levels."}, {"tag": "p", "text": "Before long, Shimrra Jamaane of the Yuuzhan Vong established his citadel over the ruins of the Palace. Occupying the mobile citadel for only a brief time, the structure was violated by the Galactic Alliance during the Battle of Yuuzhan'tar and Jamaane was killed. Jamaane's jester and the actual wielder of the Yuuzhan Vong empire, Onimi, drove the Citadel up into the atmosphere, as it was actually a large ship. Despite his attempt to destroy the Jedi who led the attack against the Citadel, Onimi died and the citadel detonated after the Jedi and Alliance soldiers escaped."}, {"tag": "h3", "text": "Return of the Sith"}, {"tag": "p", "text": "Following the Yuuzhan Vong War and the retaking of Coruscant by the Galactic Alliance, the Imperial Palace lay in ruin; toured by members of the Imperial Remnant leadership in the immediate aftermath of the battle. Despite the damages sustained to the historic structure, the Palace was rebuilt upon the ruins sometime following the stabilization of the government on Coruscant."}, {"tag": "p", "text": "Reoccupied as of 130 ABY, the Imperial Palace was the seat of power for the Galactic Empire once more. After the defeat of the Alliance during a costly war which saw a joint campaign by the Empire and the Sith Empire under the leadership of Darth Krayt, Galactic Emperor Roan Fel took up residence in the Palace and oversaw the functions of the Imperial government. Not long after the conclusion of the war and the surrender of the Alliance, the Sith betrayed Fel and stormed the Palace. Darth Krayt marched into the throne room and assassinated the man seated on the throne, in fact one of Fel's doubles, and declared himself the leader of the new Sith Empire. Krayt ruled with an iron fist from the Imperial Palace; though he quickly moved his base of operations to his newly constructed Temple of the Sith, a massive pyramid erected over the foundations of the conquered Jedi Temple."}, {"tag": "h2", "text": "Layout"}, {"tag": "h3", "text": "Exterior"}, {"tag": "p", "text": "Located just northeast of the Senate District and south of the Jedi Temple district, the Presidential Palace rose from the heart of the Palace District, resembling something like a hybrid of a cathedral and a monumental pyramid. Soaring over all surrounding buildings, the Palace's frame delved deep beneath the scintillating roofs of surrounding structures, finding its roots thrust deep into the planet's bedrock. The Palace was situated at the eastern terminus of the Glitannai Esplanade, a ritzy and famed avenue that ended at the Palace annex known as the Pliada di am Imperium. Aside from the main building, the palace grounds also had several pyramids made of blue-and-green marble as well as shining gold."}, {"tag": "p", "text": "Constructed as a government building and a residence for the acting Supreme Chancellor of the Galactic Republic, the main focal point of the Palace was the Presidential Palace that soared above all surrounding buildings. After the overthrow of the Republic, Emperor Palpatine reconstituted the government as the Galactic Empire and renamed the complex Imperial Palace. Expanding the complex, the Palace bore much resemblance to a Sith Temple as construction droids piled on more and more stone. Palpatine's redesigned Palace had a total height of three kilometers, and over two square kilometers in area. Made up of polished gray-green stone and mirrored crystals, the Palace sparkled in the sun and moon light; even at night the Palace never grew dark since blazing illumination from phosphorescent panels, glowspheres, and electroluminescence strips kept the structure in a shower of blazing light."}, {"tag": "p", "text": "At least seventy-eight towers erupted from the face of the pyramid, all of them filled with dozens of chambers and rooms serving various functions. Some of these spires were the data towers which housed vital and precious records from across the known galaxy, including survey samples and space charts which could be extremely dangerous to allow to fall into the wrong hands. For example, Tower 78 contained at least 443 levels and two hangar bays."}, {"tag": "p", "text": "Following the war with the Yuuzhan Vong, the Palace was reconstructed upon its old foundations. A central tower supported by thick support structures towered above the cityscape, shirking the stone of its previous incarnation and taking on a modern durasteel exterior. Boxy and stepped, the Palace exterior was cris-crossed by many ramps and bridges which kept the building interconnected."}, {"tag": "p", "text": "The grounds surrounding the Palace were open to the public and constantly bustling with foot traffic. The Palpatine Gardens, a lush display of finely maintained shrubbery and trees from across the Empire were open to public viewing and could be found in the shadow of the towering pyramid. The Gardens were likewise a stop for tourists undergoing the Grand Galactic Tour, alongside the Changing of the Imperial Guard. Aside from these gardens, the Palace also had access to various hanging gardens."}, {"tag": "h3", "text": "Interior"}, {"tag": "h4", "text": "Palace Proper"}, {"tag": "p", "text": "The Palace contained over twenty thousand rooms and chambers in fifty connected structures. Numerous architectural styles and design motifs could be found throughout the Palace, changing from one floor to the next. The interior walls of the Palace were made from cortosis, and its flooring included marble tiles imported from Wayland. In many of the public areas the structure was open and airy, heavily illuminated via large transparisteel panes that let in natural light. Other levels deep within the complex were kept dark with carved friezes on the ceiling. As one delved deeper into the sublevels the walls were bare and utilitarian; unadorned floors and chambers were used for military briefings and meetings. At least one part of the palace included a preschool. Various areas of the palace also had endless and gorgeous mazes of crystal roofs."}, {"tag": "p", "text": "The Grand Corridor, a towering hallway that wrapped around the entire complex, began at the main entrance of the Palace. Redesigned and expanded by Emperor Palpatine, the chamber was said to have open areas large enough to accommodate a Victory-class Star Destroyer. The main entrance of the Palace was a massive wall of black stone and red-tinted, cut-glass windows behind which bustled the busy servants of the Empire. Lining the Corridor were rows of exotic ch'hala trees which would continuously change color at sound vibrations. Apparently decorative, the trees served a more sinister purpose; the ch'hala's sound-affected bark was a key part of an intricate spy system used by the Emperor and later Grand Admiral Thrawn, known as Delta Source. Lining the inner wall of the Corridor's upper tier were several cafes and restaurants whose balconies afforded a clear view of the busy corridor below. Among the many displays of artwork and craftsmanship from across the galaxy was a still-life portrait of the former Queen of Naboo, late-Senator Padmé Amidala. Commissioned by Emperor Palpatine himself, the portrait was dedicated to the Emperor's successor and dear friend who lost her life during the \"Jedi Rebellion\"."}, {"tag": "p", "text": "Per design, the Grand Corridor allowed access to most of the other public areas of the building. Opulent passageways branched off from the main hall and led to such areas as the Assemblage Auditorium, the Council of Moffs' meeting chambers and the massive Senate Hall designed after the Grand Convocation Chamber of the nearby Senate Rotunda. Accommodating six hundred, six-person repulsorpods outlined in crimson upholstery, the Senate Chamber was used to hold more private meetings of the Imperial Senate and later the New Republic Senate. Additional pavilions, music rooms, and both summer and winter quarters took up other areas of the Palace; a private aviary of hawk-bats was kept near to the expansive Palace kitchens so that the Emperor and selected guests could have hawk-bat meat or eggs at their leisure. Other areas in the palace included various prisons, treasuries, halls, and various grace-and-flavor residences for concubines, ministers, and trained assassins."}, {"tag": "p", "text": "On the western face of the central building, the Palatial balcony overlooked the Glitannai Esplanade and the Pliada di am Imperium. From the balcony, Emperor Palpatine would oversee the parades of the Imperial Fair, waving down at his people from on high. Also adorning the side of the Palace was an information center for tourists. Located on one of the decks that jutted out from the Palace during the time of the New Republic, brochure droids and sculptures that had been fitted with speakers were used to allow tourists to access information regarding shuttle departure times, lodgings, eating establishments, and guided tours."}, {"tag": "p", "text": "Hangars were situated on multiple levels of the Palace, allowing for emissaries, diplomats, and military personnel to come and go with ease. Access to the Palace airspace was strictly controlled and closely monitored by Palace Traffic Control which was located in one of the Palace's many towers. During the reign of Darth Krayt's Galactic Empire, the 1st Imperial Center Core Defense Squadron was housed within a large hangar near the summit of the central tower."}, {"tag": "p", "text": "While the Palace was primarily an office building, residential floors existed to house visiting diplomats, ambassadors, late-working staff members, and those members of the galactic regime who remained constantly within the building such as guard and high ranking officials. All of the residential floors of the Palace were accessible from the Grand Corridor and contained extensive libraries that were open to browsing by guests. The most finely appointed chambers were found on the President's Guests floor, a richly dressed level paneled with hand-carved fijisi wood. Many famed guests graced the halls of the Imperial Palace throughout its long history. During the New Republic era, Jedi Masters Luke and Mara Jade Skywalker took up residence in the Palace, in addition to Chief of State Leia Organa Solo and her family."}, {"tag": "p", "text": "The Emperor's suite of chambers was buried deep within the Palace on floor ninety five and encompassed the working offices of Darth Vader. During the tenure of Chief Fey'lya as Chief of the New Republic, the Bothan head of state kept his offices in the same area, deep within the Palace core. To give the appearance of being close to the outer wall, Fey'lya ordered the installation of several holoscreens which created the illusion of windows to the outside."}, {"tag": "p", "text": "The upper levels of the central tower housed the private offices and residences of the galactic leaders from the construction of the Palace until its destruction. During the time of the Galactic Republic the summit office of the tower was a four-sided chamber of reinforced transparisteel which gave the Supreme Chancellor an unobstructed 360 degree view of the cityscape. This summit tower would last be used by Chancellor Finis Valorum, as his successor established the Republic Executive Building to house his primary office."}, {"tag": "p", "text": "After declaring himself Emperor and refurbishing the Palace, Palpatine would meet with members of the Imperial Senate in a large reception hall. A large, sunken auditorium similar in appearance to a crater, the sloping walls of the circular room were lined with layers of audience decks Each deck had a series of flat stone benches arranged in long arcs, where visitors could come to hear any pronouncements from the Emperor himself. An engineering marvel, the acoustics of the chamber allowed for the Emperor to emit nary a whisper and be heard by all in the chamber as if it were amplified. In turn, the murmurs of the audience could be heard clearly by the Emperor, perched high in the center of the chamber atop a stone pillar which was guarded at its base by six red-robed Royal guardsmen. The slanted ceiling of the room was surrounded by gigantic purple and red Imperial banners; an angled, prismatic skylight poured rays of light onto Emperor Palpatine's throne. Several of the pronouncements he often gave often related to the Empire's war against the Rebel Alliance. His main throne room was located at the highest room of the tallest spire of the palace, featuring a transparisteel circular window with a webbed framework behind the throne, and was a long room with curved walls. Various platforms where Red Guardsmen and Stormtroopers were posted were also situated around the throne room. An Awards Auditorium was also present at the Imperial Palace, where the Emperor himself would present various medals and honors, including the Emperor's Will medal, to various Imperial Military personnel for tremendous acts of service to the Emperor."}, {"tag": "p", "text": "When the Palace was rebuilt after the Yuuzhan Vong War, a new throne room was built atop its crown. Open-air and spacious, the audience chamber was devoid of furniture save for the throne of the Emperor, which hovered off the marble floor through the employ of a local repulsorlift."}, {"tag": "h4", "text": "Lower levels"}, {"tag": "p", "text": "While the upper levels of the Palace consisted largely of residential floors and government working offices, the lower levels of the Palace were a nerve center for the Imperial Army and Imperial Intelligence. Indeed, Director of Imperial Intelligence Ysanne Isard kept her office within the Palace, as did Moff Morlish Veed some hundred years later."}, {"tag": "p", "text": "Beneath the structure of the Palace and buried in the bedrock of Coruscant were a series of chambers that held the Imperial Information Center, the nerve center of Palpatine's propaganda machine. There was a blast-shielded war room located in the middle of the second floor that saw heavy use during the Galactic Civil War and forced may Imperial military personnel to remain at the Palace in event of a major development. Adjacent to the war room was the Crypt, and a computer slicing and decoding area."}, {"tag": "p", "text": "The Palace also had a personal library where Palpatine conducted his research."}, {"tag": "p", "text": "Like other parts of the Palace, the sublevels held many secrets. The Emperor's Hand, a mysterious group of Force Adepts trained by Palpatine himself and raised in isolation, ignorant to the existence of other Hands, made use of training facilities. The Emperor also maintained a hidden cloning facility deep in the Palace where several clone bodies grew in Spaarti cloning cylinders. The Imperial Palace also included treasuries, including one treasury said to have been built by the legendary \"pirate general\" Toleph-Sor and hidden vaults containing Jedi and Sith artifacts."}, {"tag": "h3", "text": "Annexes"}, {"tag": "p", "text": "Despite the Palace's already gargantuan size, the Emperor continued to expand the complex until it encompassed fifty different structures. Located along the Glitannai Esplanade was the Mon Calamari Inglenook, a wing designed to resemble a coral reef. Enclosed pools within this structure housed protoplasmic glurpfish and other sea life."}, {"tag": "p", "text": "Near to the Palace was a smaller pyramid designed as an exclusive residential complex far closer to the Palace than the older 500 Republica. Of additional note, Emperor Palpatine's Sith apprentice, Darth Vader maintained a tower nearby, making it his primary residence while on Coruscant."}, {"tag": "p", "text": "In addition, several other buildings presumably tied to the Imperial Palace were also located nearby, including a fortress, a War Center, several Airbases and several factories."}, {"tag": "h2", "text": "Palace staff"}, {"tag": "p", "text": "Those individuals employed at the Palace were expected to have a comlink at all times, because it was so easy to get lost. There were multiple tales of people getting lost in the Palace and never being seen again, and at least one, Frona Zeffla, died at her desk and was not found for at least one standard year."}, {"tag": "p", "text": "It was rumored that Palpatine or other high-ranking Imperials covered up unofficial executions as similar disappearances, but those theories were never confirmed. Emperor Palpatine was also said to have encouraged children of workers to play Hunter, a hide and seek like game, while their parents were working. Some games were said to have lasted for days."}, {"tag": "p", "text": "During the Imperial era, the Palace was guarded by a regiment of stormtroopers, as well as the Emperor's Royal Guard and Imperial Intelligence operatives, in a unit known as Imperial Palace Guard. Because of the enormity of the complex, Palace security was independent of the Coruscant Security Force and therefore the head of CSF had no jurisdiction over the Palace. Some of the more secure and private areas were overseen and protected by the mysterious Imperial Sentinels."}, {"tag": "p", "text": "Presumably, some members of the staff included the President of the Bureau of Punishments and the headmaster of the School of Torturers."}, {"tag": "p", "text": "Despite the official policy on Speciesism and to a lesser extent male chauvinism within the Empire and its New Order, however, Leia when recounting the day the New Republic took over the Imperial Palace during the liberation of Coruscant implied that some of the staff that worked there and thus ended up killed by the New Republic soldiers had included various females, alien species, and even children."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Palace was formally introduced, along with the rest of Coruscant, in Timothy Zahn's Heir to the Empire novel, though its origins date back to rough drafts of Star Wars: Episode VI Return of the Jedi. It was first referred to in the 1979 comic book Star Wars 27 in which Princess Leia mentions \"the Emperor... skulking in his palace.\""}, {"tag": "p", "text": "Some fans have gained the erroneous impression that the Palace was seen in the scene of the Coruscant Uprising in the re-released version of Return of the Jedi, but the Palace has, in fact, never appeared in any of the films. The building in question is actually the Jedi Temple."}, {"tag": "p", "text": "The Imperial Palace, or rather, the Presidential Palace, appeared in the May 1999 children's picture book Anakin to the Rescue, written by Cecilia Venn and illustrated by Chris Trevas, although it was not specifically identified as such in the story itself outside of it being a \"tall, sparkly building.\" Chris Trevas, in a PM on Facebook to Wookieepedia editor LelalMekha, confirmed that the pyramidal building in question was intended to be the Presidential Palace, citing that he used the late Ralph McQuarrie's depiction of the Imperial Palace that was first seen in The Illustrated Star Wars Universe as reference, having been sent to him by his publisher."}, {"tag": "p", "text": "Some depictions of the Imperial Palace are non-pyramidal in shape, including the palaces shown in Star Wars: Galactic Battlegrounds, Star Wars: Empire at War, Star Wars: Rebellion, Star Wars: Force Commander, Star Wars: Jedi Knight: Dark Forces II. These depictions may either be non-canonical, or simply depict one of the structures in the Palace complex other than the main pyramid. The Imperial Palace's appearance in Galactic Battlegrounds was reused from the design for the \"Imperial Palace\" monument used frequently by the Empire, including one owned by Moff Darcc. The \"palace\" that appears in Star Wars: Dark Times would be the building Palpatine inhabited while the actual palace was under construction, since those scenes take place within a few weeks to a few months after the events in Revenge of the Sith. In the Non-canon Star Wars Infinities: A New Hope, the Imperial Palace was depicted to be the former Jedi Temple. Ironically, this would later be adopted into the new canon after the Canon/Legends split by Disney."}, {"tag": "p", "text": "It's interesting that some of the latest incarnations of the Imperial Palace seem to depict the non-pyramidal skyscraper like version with a likeness to the Emperor Palpatine Surgical Reconstruction Center building seen in Star Wars: Episode III Revenge of the Sith. Most skyscraper versions seem to occur between Episodes III & IV. This perhaps suggests that later structures were added around the original tower to make it become a pyramid by the time of the events of Star Wars: Shadows of the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}