{"url": "Imperial_Palace", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Coruscant government buildings", "Category:Coruscant residential buildings", "Category:Galactic Empire locations", "Category:Galactic Republic locations", "Category:Imperial Palace locations", "Category:Jedi Temple locations", "Category:Locations of the Sith", "Category:New Republic locations", "Category:Palaces"], "nodes": [{"tag": "h1", "text": "Imperial Palace"}, {"tag": "p", "text": "The Imperial Palace, also known as the Emperor's palace, was a former Jedi temple that Darth Sidious—Dark Lord of the Sith and Galactic Emperor—transformed into his official residence on the Core World Coruscant during the reign of the Galactic Empire. The Palace was located in the Palace Precinct of the Federal District of Imperial City. Although it was purged of its Jedi heritage, the Palace retained its ziggurat form as well as its distinctive crown of four Council Towers and the central Temple Spire that contained the Emperor's throne room."}, {"tag": "p", "text": "The Jedi Grand Temple, also known as the Jedi Temple, was the home of the Jedi Order—an order of Force-sensitive peacekeepers united in their adherence to the Jedi Code and the light side of the Force—during the rise and fall of the Galactic Republic. In addition to its role as the central hub of all Jedi activities throughout the galaxy, the Temple functioned as a monastery for Jedi Knights and Jedi Masters as well as a school for the training of Padawans and initiates. As the headquarters of the Order, the Temple was the location of several key areas such as the Holocron Vault, which housed the Order's closely guarded secrets; the Jedi Archives, the largest repository of information; and the Jedi Council Chamber, where the ruling Jedi High Council convened to ponder galactic events and determine the will of the Force."}, {"tag": "p", "text": "Constructed by the Four Masters millennia before the proclamation of the New Order, the Temple was rebuilt and expanded several times over the centuries. It was built on the foundations of an ancient shrine that the Sith dedicated to the dark side of the Force. The Order's role in the Clone Wars was directed from the Temple after the Jedi rallied to defend the Republic against the Confederacy of Independent Systems, commanding legions of clone troopers as Jedi Generals in the Grand Army of the Republic. In 19 BBY, Supreme Chancellor Sheev Palpatine—the alter ego of Darth Sidious—initiated the Great Jedi Purge through Order 66, which declared all Jedi enemies of the state. His Sith apprentice, the newly-anointed Sith Lord Darth Vader, marched on the Temple at the head of the elite 501st Legion. The siege of the Jedi Temple resulted in the deaths of many Jedi, including the younglings. Sidious, having declared himself Emperor, erased millennia of the Jedi Order's ancient traditions by converting the Temple into the Imperial Palace."}, {"tag": "p", "text": "The Emperor's death in the Battle of Endor in 5 ABY caused the citizens of Coruscant to celebrate in the streets of Monument Plaza while Grand Vizier Mas Amedda and his supporters barricaded themselves in the Palace. Around the same time, the Jedi Knight Luke Skywalker recovered fragments of a Force-sensitive tree that once stood in the heart of the Jedi Temple. In the final days of the Galactic Civil War, Amedda was placed under virtual house arrest in the Palace by soldiers who were loyal to Fleet Admiral Gallius Rax, the self-proclaimed Counselor to the Empire. He later escaped from the Palace with the help of a gaggle of children by the time of the Battle of Jakku in 5 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Jedi Grand Temple"}, {"tag": "p", "text": "Set apart from the rest of the Federal District, the Jedi Grand Temple was located in its own low-rise district known as the Temple Precinct. Dotted by statues and small parks, the Precinct was bisected by the Processional Way, a long road which terminated at a ceremonial staircase that led into the Temple's entrance hall. Crowned by four statues, two Warrior Masters and two Sage Masters, the main entrance was decorated with twelve massive pylons adorned with the depictions of the Temple's founding Four Masters."}, {"tag": "p", "text": "Constructed around and within a natural mountain spire, the Jedi Temple was an agglomeration of a series of shrines, temples, academies, and holy places which had dotted the site for millennia. A sacred place to numerous Force traditions, the Temple preserved some of these ancient structures for their architectural and historical merits, re-purposing them as museums or art galleries. The peak of the mountain spire at the facility's core was surrounded by ancient meditation balconies and access points to the mountain's interior, which was burrowed through with cave chapels and buried shrines. One of the earliest Jedi libraries at the site was eventually converted into a formal banquet hall. As the Jedi cemented their hold on the facility, they began to add their architectural flair to the building, forming a massive ziggurat around the mountain spire that completely encompassed it."}, {"tag": "p", "text": "The base of the ziggurat was a series of pillared halls that supported the weight of the structure above; additional rooms such as the Room of a Thousand Fountains and a rotunda chapel converted into a meditation hall made up the base of the ziggurat. Higher in the main body of the Temple complex was a medical center staffed by the Medical Corps, a transformation chamber where a Jedi could be disguised as another individual, containment cells for hostile Force-users, and a series of workshops, and maintenance facilities. The Temple was also the home of the Jedi Archives, a wellspring of knowledge said to house the collective wisdom of the galaxy's scholars and historians. Aside from its collections of holobooks and artifacts, the Archives housed the secured Holocron Vault, in which the Jedi stored their precious holocrons which was accessible only to Jedi Masters."}, {"tag": "p", "text": "One level of the temple was dedicated to storage. One of its stores was for linen products, while another was for training equipment. The Temple's interior was cluttered with dormitories and classrooms to house and educate the youngest initiates and Padawans. Holographic training suites used sophisticated technology to create realistic combat scenarios for Jedi-in-training to use and better their skill with a lightsaber. A lightsaber crafting facility allowed Jedi to construct or upgrade their weapons between missions. More advanced classes were taught in facilities built after the Temple's initial construction and could be found throughout the Temple Precinct. The surface level of the ziggurat base was dotted with ancient temples and shrines from the Temple's earliest days. The Chamber of Conclave could be found among the shrines, where Jedi from across the galaxy gathered to hear an annual report from the High Council. Modern facilities were erected here too, such as the Temple's main vehicle garage and other facilities to house surface and ground vehicles. Throughout the Temple, visitors could find statues and tapestries that detailed the history of the Jedi Order. One of the Temple's mosaic floors was salvaged from the ancient Jedi Temple at Ossus."}, {"tag": "p", "text": "Stained-glass arcades and ancient tablets depicting battles and the Jedi Code preserved the Order's greatest heroes and most time-honored stories. The site which contained the most art and history was perhaps the central spire of the Temple. Erupting from the center of the ziggurat's flat roof, the central spire soared above the four peripheral towers which crowned the facility. Within its hollowed interior, the central spire contained massive memorial statues suspended on repulsorlift pads. At its peak, the central spire was adorned with three decorative fins, inside which was housed the Hall of Knighthood, wherein the status of Knight or Master was bestowed upon members of the Order. The pinnacle room of the central tower was home to the oldest known texts that the Order possessed. Members of the Jedi High Council would occasionally meet within this chamber to discuss the future of the Order."}, {"tag": "p", "text": "The roof of the Temple's ziggurat was accessible to Jedi and was often used for outdoor sparring sessions by younglings and Padawans alike. A gnarled, ancient tree stood in the shadow of the Temple's five crowning spires, and was a place many Jedi came to find solace. Each of the four lesser towers of the Temple were crowned by an array of powerful reception and transmission antennas which tapped into hyperspace itself so that the Temple could be appraised of information in real-time. A pyramid system of holomaps worked furiously within the towers, starting with twelve teams at the base that monitored disturbances in the Force, before pushing potential threats all the way up to the large galaxy holomap situated below the pinnacle Council Chamber of each tower. Contemplation stations ringed the holomap level of each tower, allowing Jedi waiting to visit the Council to find peace before standing before the leaders of the Order."}, {"tag": "p", "text": "Within the Tower of Reassignment, the Chamber of Judgment was situated where Jedi could be judged when charged with violating one of the Order's strictures or galactic law. Each tower was equipped with a hangar and extendable landing platform where Jedi and visiting dignitaries alike could land and store their ships. These tower hangars, equipped with a carbon-freezing facility where cargo could be frozen for transport, housed Delta-7 Aethersprite-class light interceptors, Low Altitude Assault Transport/infantry, and Eta-2 Actis-class light interceptors during the Clone Wars. Near the base of the High Council tower was the beacon through which the High Council could contact all Jedi across the galaxy."}, {"tag": "h3", "text": "Imperial Palace"}, {"tag": "p", "text": "One year after the end of the war and the fall of the Jedi Order, the Galactic Empire had refitted the ruined Jedi Temple into the Imperial Palace. The Palace was the official residence of Darth Sidious, the Dark Lord of the Sith publicly known as Galactic Emperor Sheev Palpatine. All that remained of the original temple was its quincunx of skyscraping spires, which crowned an amalgam of blockish edifices with sloping façades. The Temple Precinct, renamed as the Palace Precinct, housed a courtyard landing field that was large enough to accommodate Star Destroyers of the Victory and Venator classes. From that courtyard, the Palace's interior could be accessed through elaborate doors. Along with the Naval Intelligence headquarters and the COMPNOR arcology, the Imperial Palace made up the supreme triangle of Imperial City's Federal District. It was regarded as one of the grandest and most elegant structures on the entire planet."}, {"tag": "p", "text": "Inside the Palace, all remnants of the Order had been stripped away, with all of the ancient mosaics, tapestries, and paintings removed. The walls and plinths of the expansive corridors were left bare of statues and other art pieces, though some banquet chambers were draped with Imperial flags and banners. One of the Temple's vast pillared halls had been converted into a ball room, with its walls ornately tiled and mirrored. Crystalline sculptures stood on pedestals and shifted shape from abstract forms into Imperial symbols during a ceremony to honor Imperial cadets."}, {"tag": "p", "text": "The central spire of the Imperial Palace housed the Emperor's throne room, from which he ruled the Empire. The Emperor's receiving room was a dimly lit chamber with huge windows that opened out onto the Coruscant skyline. From within the pinnacle room of the central spire, the Emperor conducted his day-to-day business, descending down into the penultimate level, or the former Hall of Knighthood, to his audience chamber. While most of the Temple had been transformed to serve the Empire, the enormous holographic galactic maps located within the four peripheral towers were maintained so that the Emperor could behold problems within the Empire."}, {"tag": "p", "text": "Swerves of civilian workers and ambassadors of many species flooded the vast halls of the Imperial Palace. The Palace contained a courtroom twenty-levels down from the bottom of the central spire.[source?]"}, {"tag": "p", "text": "Quarters in the Palace were reserved for Grand Vizier Mas Amedda. Amedda's chamber had access to a balcony and a laundry vacu-tube. The windows in his chamber provided a view of Imperial City. Although the Imperial Palace was designed to be impregnable, the laundry tube was big enough for younglings to climb through."}, {"tag": "h3", "text": "Security"}, {"tag": "p", "text": "The Jedi Grand Temple was protected by the Jedi Temple Guard. Jedi Knights who were selected to join the ranks of the Temple Guard became anonymous sentinels as part of their commitment to the Jedi Order. The role of the Temple Guard was considered a higher calling; therefore, they were required to wear formal Jedi robes and face-concealing masks as the ultimate expression of emotional detachment. They were armed with distinctive lightsaber pikes noted for their rare yellow plasma blades."}, {"tag": "p", "text": "The Temple Guard had a command structure staffed by officers such as Captain Kolloma Ree, while the Chief of Security was in charge of the overall organization. By then the Temple Guard was supplemented by clone troopers who were stationed in the Temple's hangars. The Coruscant Guard deployed clone shock troopers to assist the Temple Guard, providing additional security for the Temple during an anti-war protest."}, {"tag": "p", "text": "After the Temple fell, the area around it was secured by the Coruscant Guard as well as the Coruscant Security Force. The Emperor's Royal Guard took on the duty of providing security in the Temple after it was repurposed as the Emperor's residence. In addition to the Royal Guards, stormtrooper units were stationed in the Imperial Palace."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Age of the Jedi"}, {"tag": "p", "text": "The site of the Jedi Grand Temple, and later the Imperial Palace, was considered a holy site on Coruscant for many millennia by dozens of Force-wielding traditions. Constructed around and within a natural mountain spire, these temples and shrines were rich in the Force, that permeated the site and imbued it with radiant energy. After falling under the control of the ancient Sith, the Jedi Order's enemies erected a shrine on the mountain from which they dominated Coruscant. When the Jedi reclaimed the mountain during a war around 5000 BBY, the Jedi reduced the Sith facility to its foundations and stripped away all remnants of their fallen foe. Unbeknownst to the Jedi, a hidden portion of the shrine endured in the foundations of the mountain, forgotten yet still active. As the Order erected the Jedi Temple over the mountain, the shrine's malevolent energies continued to permeate the site, slowly clouding the Jedi's collective use of the Force with the power of the dark side."}, {"tag": "p", "text": "At one time, the Temple housed an artifact known as the darksaber—a black-colored lightsaber constructed by Tarre Vizsla, the first Mandalorian inducted into the Jedi ranks. The darksaber would remain in the Order's possession until the fall of the Old Republic, at which point members of House Vizsla stole the weapon while sacking the Temple."}, {"tag": "p", "text": "During the era known as the Dark Age, during the Jedi-Sith War, the Sith attacked Coruscant and took possession of both the planet and the Temple. Later in the war, the Jedi repelled the invaders during the liberation of Coruscant. The Temple would still bear the scars of Sith occupation around a thousand years later."}, {"tag": "p", "text": "In the ensuing millennium, an era dominated by the Galactic Republic, the Jedi Temple was rebuilt and expanded many times, formed from not a single structure, but many ancient temples and shrines woven together. For centuries the Temple would serve as the headquarters of the Jedi Order, where the youngest initiates were trained in the ways of the Force and elevated to the rank of Jedi Knight. Learning how to use the Force, the martial arts, diplomacy, and meditation, the Jedi thrived within their home as the Republic became increasingly corrupt. The governing body of the Order, the Jedi High Council, sat in the High Council Tower, one of the four peripheral towers around the Temple Spire, in addition to the Council of First Knowledge, the Council of Reconciliation, and the Council of Reassignment."}, {"tag": "p", "text": "After a thousand years of consecutive peace and prosperity, the Jedi Order was plunged into conflict with the Sith once more during the Clone Wars. The Jedi became generals in the Grand Army of the Republic. The Jedi's part in the war effort was coordinated from the Temple, where classrooms were converted into military briefing rooms. As public sentiment turned against the war, protests were staged on the front steps of the Temple, while one of its hangars was bombed by Padawan Barriss Offee, who believed the Jedi only cared about violence. Her actions resulted in the deaths of civilians, clone troopers, and several Jedi who were caught in the explosion. Although the attack occurred on Jedi property, and the Jedi therefore regarded it as an internal affair, the Republic government claimed jurisdiction due to the deaths of clones and Republic citizens."}, {"tag": "p", "text": "The attack on the Temple fueled the Republic citizenry's anti-war sentiment. A crowd of civilians formed along the Processional Way, protesting against the Jedi, the military, and the Clone Wars. The presence of the demonstrators caused the Order to heighten its security measures by stationing guards in front of the Temple's entrance. The Coruscant Guard deployed a contingent of clone shock troopers, armed as clone riot troopers, to assist the Temple Guard."}, {"tag": "p", "text": "Offee's role in the bombing was discovered by the Jedi Knight Anakin Skywalker, who confronted the fallen Padawan in the Temple. A group of Temple Guards converged on their location, ordering the two Jedi to cease hostilities in the Temple's hallowed halls. Nevertheless, the duel moved to the Temple's training grounds where Jedi Master Tera Sinube was instructing a class of younglings. The Temple Guards surrounded the area to protect the students and to cut off Offee's escape. The fallen Padawan was ultimately overpowered by Skywalker who, assisted by the Temple Guards, arrested Offee as a traitor to the Jedi Order and the Galactic Republic."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "At the end of the Clone Wars, Darth Sidious—publicly known as Supreme Chancellor Sheev Palpatine—declared that the Jedi, who had attempted to arrest him after discovering he was the Dark Lord of the Sith, were traitors. He issued Order 66, a command to all clone troopers to kill the Jedi. Meanwhile, Anakin Skywalker fell to the dark side and became the Sith Lord Darth Vader, and he led clone troopers to kill all of the Jedi within the Jedi Temple. This left the Jedi Temple damaged, and the Jedi Order destroyed. Shortly thereafter, Sidious declared that the Republic was to be transformed into the Galactic Empire, with himself as Emperor. This event provided Jedi Masters Yoda and Obi-Wan Kenobi with an opportunity to infiltrate the Temple, where they reprogrammed the Jedi beacon warning their fellow survivors to not return to Coruscant. Kenobi also used the Temple's surveillance system to discover the identity of the Jedi who betrayed them."}, {"tag": "p", "text": "In the aftermath of the Temple's desecration, lightsabers belonging to dead Jedi were incinerated on the steps of the old Temple in a massive celebration. The Grand Inquisitor entered the former Jedi Temple, granted access by Sidious to the Jedi Archives he had been denied as a Temple Guard, but was confronted by Darth Vader, recently returned from his Mission to Al'doleem. Vader damaged the Inquisitor's lightsaber and prepared to strike him down, but was stayed by Sidious, who revealed the existence of the Inquisitorius to Vader. Later, Vader tasked the Grand Inquisitor with searching the Archives for clues to the location of surviving Jedi."}, {"tag": "p", "text": "Jocasta Nu, Chief Librarian of the Jedi Archives, returned to Coruscant in hopes of obtaining a holocron with the list of Force-sensitive younglings. She infiltrated the Temple through a secret entrance and retrieved the holocron, but was compelled to confront the Grand Inquisitor upon seeing the former Jedi desecrating the Jedi Archives. Darth Vader personally led the hunt for Jocasta Nu, ordering Clone Commander CC-1010 to have the Temple locked down by the Coruscant Guard and the Coruscant Security Force. Although the Inquisitor bested Nu, he was prevented from killing her by Vader, whose master sought to capture the archivist for her knowledge. Nu deleted the Archives' contents and fought Vader off with a lightsaber rifle. The Dark Lord tried to pursue Nu when she attempted to escape from the Temple; however, he was fired on by Imperial shock troopers who mistook him for a Jedi. Vader killed CC-1010 for his error and ordered his troops to cease firing on Nu on the Temple battlements, taking her into custody before executing her."}, {"tag": "p", "text": "Sometime after the destruction of the Jedi Order, the Jedi Temple was converted into the Imperial Palace under supervision of Colonel Alva Brenne. Transferring his collection of dark side artifacts stored within the Grand Republic Medical Facility to their new home in the Imperial Palace, the Emperor made it his primary residence, leaving the day-to-day governance of the Empire to his advisers."}, {"tag": "p", "text": "While the former Jedi Kanan Jarrus ruminated on the notion that nothing of the Temple remained, the Imperial Palace endured until after the death of Darth Sidious during the Battle of Endor."}, {"tag": "h3", "text": "Age of the New Republic"}, {"tag": "p", "text": "Grand Vizier Mas Amedda was confined to his quarters in the Imperial Palace on the orders of Counselor to the Empire Gallius Rax. Rax officially acknowledged Amedda as the Empire's legitimate leader, yet he had also effectively usurped the Empire. The Imperial Security Bureau on Coruscant secured the Imperial Palace, but they answered to Rax instead of Amedda. Isolated by ISB, the Grand Vizier was kept under house arrest in his own quarters. At first he attempted to escape, disregarding the Counselor's warning that his soldiers would resort to physical violence. As a result, Amedda's leg was broken by one of the guards."}, {"tag": "p", "text": "Hobbled and unable to leave his quarters, Amedda spent months in isolation apart from the ISB agents who routinely forced him to broadcast speeches, at blaster point, praising the Empire and Rax's leadership. As time passed, he grew more disillusioned with the Empire, now viewing it as a failed state. Although the doors to his balcony were sealed to prevent a suicide attempt, Amedda could see through his windows that Coruscant was in a state of chaos and began to suspect that the Empire no longer controlled its own capital."}, {"tag": "p", "text": "Amedda's quarters were filthy by the end of his confinement, and the laundry tube had ceased functioning. Unbeknownst to Amedda, a group of rebellious adolescents—the Anklebiter Brigade—damaged the vacu-tube in order to climb through it, giving them access to Amedda's room. Their original plan was to assassinate the Grand Vizier, but his disheveled appearance, misery and desperation caused them to hesitate. Amedda begged the adolescents to help him escape, offering to use his executive codes to a turbolift if they overpowered the few sentries guarding his quarters. He also assured them that, with their help, he would use his authority to surrender the Empire and end the war with the New Republic."}, {"tag": "p", "text": "The Anklebitter youths accepted his entreaty and smuggled Amedda out of the Imperial Palace. He resurfaced after Rax was killed in the Battle of Jakku, which left him free to sign the Imperial Instruments of Surrender and the Galactic Concordance that ended the civil war. After the war, Amedda publicly acknowledged the Coruscanti adolescents who freed him from the Palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi Temple was first introduced in the 1999 film Star Wars: Episode I The Phantom Menace. In 2004, the Jedi Temple was added into the ending of Star Wars: Episode VI Return of the Jedi, during the final montage of planets celebrating the death of the Emperor. The Temple then appeared in a number of episodes of Star Wars: The Clone Wars, which aired from 2008 to 2013."}, {"tag": "p", "text": "The idea of converting Coruscant's Jedi Temple into Emperor Palpatine's Imperial Palace originally came from Chris Warner's 2002 Star Wars Infinities story Star Wars Infinities: A New Hope, which was an alternate retelling from the original Star Wars film Star Wars: Episode IV A New Hope. The novel Tarkin by James Luceno, released in 2014, canonized this idea by revealing that the Jedi Temple was converted into the Imperial Palace."}, {"tag": "p", "text": "Some of the earliest concept art for the 2019 film Star Wars: Episode IX The Rise of Skywalker, based on an early draft by J.J. Abrams and Chris Terrio, featured Coruscant's Jedi Temple, with images of it showing Kylo Ren facing ferocious space wolves on the stairs of the temple, now long abandoned like Coruscant itself."}, {"tag": "h3", "text": "Continuity issues"}, {"tag": "p", "text": "The book The Rebellion Begins by Michael Kogge shows Kanan Jarrus remembering the destruction of the Jedi Temple. According to Jarrus, nothing of the Jedi Temple remained when Coruscant became Imperial City. However, Tarkin states that the Jedi Temple was converted into the Imperial Palace. The Special Edition of Return of the Jedi shows the Imperial Palace intact."}, {"tag": "p", "text": "When asked if Jarrus was referring to the Temple's refit into the Imperial Palace or if it was a continuity error, Lucasfilm Story Group's Matt Martin stated that Jarrus was referring to Anakin Skywalker's attack on the Temple during Revenge of the Sith. Martin later admitted that he thinks it was a continuity error, however, as he hadn't joined the Story Group when the book was published so he didn't know the thinking of the text."}, {"tag": "h3", "text": "The Freemaker Adventures"}, {"tag": "p", "text": "The Imperial Palace appears as a plot setting in Bill Motz and Bob Roth's non-Canon 2016–2017 animated television series LEGO Star Wars: The Freemaker Adventures. As in the Canon continuity, the Imperial Palace is depicted as the former Jedi Temple and serves as the headquarters of Emperor Palpatine and Darth Vader. During the first season, the Imperial Palace is damaged during an attack by the renegade Sith Naare. During the second season, the Emperor and Lord Vader interrogate Rowan Freemaker about the location of the kyber crystal planet shortly before the Battle of Endor. The top pinnacle of the palace is later damaged during a skirmish between the Freemakers and the Imperial hunter droid M-OC, causing debris to rain down on the palace's battlements."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}