{"url": "Imperial_Patrol_Frigate", "categories": ["Category:Legends articles", "Category:Frigate classes", "Category:Imperial Patrol Frigates", "Category:Patrol craft classes", "Category:Scout starship classes"], "nodes": [{"tag": "h1", "text": "Imperial Patrol Frigate"}, {"tag": "p", "text": "The Imperial Patrol Frigate was one of the many ships created after the fall of Emperor Palpatine, by the Imperial Core."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The ship itself was a modified EF76 Nebulon-B escort frigate, which had about one-third of the decks removed, causing roughly half of the original crew compliment to no longer be needed. The two rear-facing laser cannons were removed and replaced by tow winches to fit the optional 30,000-meter-long sensor net capable of omni-directional scanning for several light-hours around the ship."}, {"tag": "p", "text": "The net was operated from a gondola trailing bar behind the frigate by a crew of three people, a towmaster and two sensor technicians. The towmaster had to be specially trained in the use of the sensor net, as it was extremely difficult to control due to the possibility of the lines tangling, shredding, or becoming detached from the ship due to maneuvering strain. Due to these facts, the frigate was restricted to slow speeds while the sensor net was engaged, and when the ship entered hyperspace, the net had to either be brought in or abandoned."}, {"tag": "p", "text": "The sensor net itself was actually a marvel technology, featuring many advanced sensors, including dedicated energy receptors, crystal gravfield traps, and hyperspace signal interceptors. With all these sensors, the vessel could detect cloaked ships, as well as ships entering or exiting hyperspace within its range, as well as ships traveling through local hyperspace, as long as the ships were large enough. When it did detect a ship traveling through hyperspace, the patrol frigate would calculate likely vectors, and the crew would then report back to base, causing an alert to be raised."}, {"tag": "p", "text": "As well as detecting ships, the sensors also possessed the ability to detect any and all hyperspace transmissions, including HoloNet comms, although the decoding of such high security transmissions was generally left to the Imperial Intelligence Signal Branch."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}