{"url": "Imperial_Peace-Keeping_Certificate", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Bounty hunter permits", "Category:Bounty Hunters' Guild", "Category:Imperial Office of Criminal Investigations", "Category:Law enforcement documents", "Category:Legal documents"], "nodes": [{"tag": "h1", "text": "Imperial Peace-Keeping Certificate"}, {"tag": "p", "text": "An Imperial Peace-Keeping Certificate (IPKC), also simply known as a bounty hunters' license, was a license issued to bounty hunters by the Imperial Office of Criminal Investigations and the Bounty Hunters' Guild, certifying them to hunt bounties. It also allowed them access to the Imperial Enforcement DataCore, a network that contained information regarding the law enforcement activities of the Galactic Empire and its agents, for a fee at posting agencies."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An Imperial Peace-Keeping Certificate (IPKC) was a license issued to bounty hunters by the Imperial Office of Criminal Investigations and the Bounty Hunters' Guild, certifying them to hunt bounties. Effectively functioning as a license to kill, each Imperial Peace-Keeping Certificate had its own number, which could be requested by Imperial personnel. The license allowed its holder access to the Imperial Enforcement DataCore, a network containing information regarding the law enforcement activities of the Empire and its agents. The DataCore's use was limited only to Imperial personnel and licensed bounty hunters at certain bounty-posting agencies. However, licensed hunters still had to pay a fee of fifteen credits an hour or twenty-five credits a day to access the DataCore."}, {"tag": "p", "text": "The license itself was a rectangular plastic ID card, which had a picture of its holder and listed the holder's name, species, height in meters, weight in kilograms, what weapons the holder was authorized to carry, and what vehicles the holder was authorized to pilot. The card also read, in High Galactic, \"Licensed by the Imperial Office of Criminal Investigation and the Bounty Hunters Guild\" and \"ALL ACCESS,\" while Aurebesh writing decorated the card's background."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One holder of an Imperial Peace-Keeping Certificate was Bossk, a notorious Trandoshan bounty hunter whose Imperial Peace-Keeping Certificate number was 55946112, until it was stolen by Ezra Bridger, a thief whom Bossk had hired as a guide while pursuing a bounty on the planet Lothal. Bridger placed the pilfered card in his private journal."}, {"tag": "p", "text": "Bossk also had in his possession the license of a fellow Trandoshan bounty hunter named Mundokk, whom Bossk claimed no longer needed the certificate. The interstellar lawman-turned-bounty hunter Tam Posla was also an Imperial Peace-Keeping Certificate holder, as was the assassin droid Captivator and his team of bounty hunters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Peace-Keeping Certificate first appeared in the new Star Wars canon in Ezra's Gamble, a junior novel written by Ryder Windham and released on August 5, 2014. It was first canonically pictured in Rebel Journal by Ezra Bridger, a young-readers book written by Daniel Wallace as the in-universe journal of Ezra Bridger, released on October 21, 2014."}, {"tag": "p", "text": "The Imperial Peace-Keeping Certificate was originally created for Galaxy Guide 9: Fragments from the Rim, a 1993 Star Wars Legends supplement written by Simon Smith and Eric Trautmann for Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}