{"url": "Imperial_Palace_Vaults", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Coruscant rooms", "Category:Imperial Palace locations"], "nodes": [{"tag": "h1", "text": "Imperial Palace Vaults"}, {"tag": "p", "text": "The vaults of the Galactic Empire subterranean structure buried deep beneath the Coruscant Imperial Palace and served as the storehouses of Emperor Palpatine's many treasures."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Located deep beneath the Imperial Palace, the vaults of the Emperor were the secret location of the lost Jedi and Sith artifacts confiscated from the ruins of the Jedi Temple and from Palpatine's own collections."}, {"tag": "p", "text": "When the New Republic liberated Coruscant in 6 ABY, the fledgling government ousted all remaining Imperials from the Palace and established it as the base of their government. Looting the vaults, the Republic officials discovered countless treasures including the Sayings of Uueg Tching, several Jedi holocrons, artifacts from the Gree Enclave, Tundan implements, and ancient Sith teachings. After much debate, the Republic leaders decided that the artifacts should be moved and ordered them offplanet. During the transfer however, a breakdown in command saw most of the shuttles diverted or destroyed. One of these shuttles was captured by one of many Imperial Warlords and two vanished into the Deep Core."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "These vaults may be the same as Palpatine's Museum in Forces of Corruption, though that structure may be distinct, as it appears not to be part of the Imperial Palace. In the same game, Tyber Zann also alludes to the hidden vaults of Emperor Palpatine in the ending, noting that it contained billions of credits, decades-spanning technical data, and priceless works of art, although its not specified whether they were intended to be the same vaults as the Imperial Palace Vaults."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}