{"url": "Imperial_Palace_throne_room_(Anti-Sith_conspiracy)", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Coruscant rooms", "Category:Emperor's throne rooms", "Category:Government facilities", "Category:Imperial Palace locations"], "nodes": [{"tag": "h1", "text": "Imperial Palace throne room  (Anti-Sith conspiracy)"}, {"tag": "p", "text": "One of several throne rooms located in the Imperial Palace which served as one of the seats of power for Emperor Palpatine, this throne room was the setting for the final acts of the Anti-Sith conspiracy masterminded by Grand Moff Trachta. Unlike the main palace throne room, this throne room was differentiated by its simple layout and sparse interior."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Located within the Imperial Palace, this throne room was constructed at some point between 19 BBY and 1 BBY. During his rule, Palpatine used this throne room for private meetings with his apprentice Darth Vader, advisors and officials of the Imperial Military."}, {"tag": "p", "text": "In 1 BBY, the Emperor summoned Grand Moff Trachta to the throne room where he preceded to tell the Grand Moff he would be requiring a detachment to join him when he traveled to the Death Star to meet with Grand Moff Wilhuff Tarkin. Palpatine then proceeded to inform Trachta of his plans to dissolve the Imperial Senate. Realizing the perfect time to spring his coup d'état, Trachta inquired whether Vader was to accompany him, Palpatine informed the Grand Moff to attend to only what concerned him. Later, Palpatine summoned Darth Vader to the throne room and ordered the present guards and advisor out so he could speak privately with Vader. Alone, Vader was charged with the task of locating and dealing with a reported lightsaber welding vigilante."}, {"tag": "p", "text": "Several days later, the final stages of the coup took place under command of Moff Kadir who had assumed control after the assassinations of Trachta and Grand Moff Bartam. With fellow co-conspirator Gauer, they entered the throne room with their cadre of special programmed stormtroopers. Just as the troopers aimed their blasters at Palpatine, his Royal Guards leaped from hiding in the room's drapes and engaged Kadir and the stormtroopers in battle. After a while, Palpatine killed the troopers with a great unleashing of Force lightning, sparing only Kadir and his guards. Failing to then shoot the Emperor and being attacked with more lightning, Palpatine continued to inform Kadir that he had been impressed with the young Moff's supposed masterminding of the plot but that his claim of Vader's death, the Dark Lord was still alive. Returning to his throne and activating a holocam, the two proceeded to watch Vader eliminate the remainder of Trachta's stormtroopers and fellow co-conspirator Dezsetes. Palpatine then killed Kadir with an attack of powerful lightning."}, {"tag": "p", "text": "Later, Vader came to the throne room and spoke with his Master of the failed coup and informed him he had successfully accomplished his mission to Dargulli. Emperor Palpatine then informed his apprentice that his next mission would be assisting Grand Moff Tarkin in the final preparations of the Death Star."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}