{"url": "Imperial_Ruling_Council", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Bureaucratic and government organizations", "Category:Imperial organizations"], "nodes": [{"tag": "h1", "text": "Imperial Ruling Council"}, {"tag": "p", "text": "The Imperial Ruling Council, also referred to as the Imperial Advisory Council or the Imperial Council, was a collective body of bureaucrats that constituted the uppermost tier of the Galactic Empire. It was composed of Emperor Sheev Palpatine's closest advisors including: Grand Vizier Mas Amedda, Sate Pestage, Janus Greejatus, Ars Dangor, Kren Blista-Vanee, Verge, and other members of the Imperial Court. They were headquartered on Coruscant, the capital world of the Empire. Members of the Ruling Council were noted for wearing loose-fitting robes of riotous colors and flamboyant hats."}, {"tag": "p", "text": "Some observers saw the councilors as mere \"yes men\" to the Emperor. But in fact, it was the Imperial Ruling Council that managed the daily affairs of the Empire, and its members wielded considerable powers. They had direct access to the Emperor, and all Moffs, generals and admirals reported to them. In spite of that, the councilors were not always privy to the details known to the Imperial Intelligence, as information was closely guarded on Coruscant."}, {"tag": "p", "text": "Governor Everi Chalis served as an emissary to the Imperial Ruling Council during the Galactic Civil War. At some point, she was demoted to a position on Haidoral Prime and eventually defected to the Rebellion."}, {"tag": "p", "text": "Following the Battle of Endor, ambitious members of the Imperial Council attempted to carve their own territories out of the Empire. Due to their inability to successfully run the Empire after Palpatine's death, Fleet Admiral Gallius Rax proposed the creation of a more covert and militaristic body known as the \"Shadow Council\" to replace them, comprised of various advisors and admirals, with Grand Admiral Rae Sloane as the group's de facto leader."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}