{"url": "Imperial_Royal_Guard_Academy", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Imperial Academies", "Category:Royal Guard", "Category:Yinchorr locations"], "nodes": [{"tag": "h1", "text": "Imperial Royal Guard Academy"}, {"tag": "p", "text": "The Imperial Royal Guard Academy, also known as the Imperial Academy of Yinchorr, was a training academy established by the Galactic Empire on Yinchorr, to train the Emperor's Royal Guard. It also served to train officers of the riot stormtroopers and other stormtrooper divisions; they were trained in the complex surrounding the Imperial Guard academy. In large part because of the importance of the Emperor's Royal Guard and their ties to the academy, specific information on the location was considered highly classified, to such an extent that not even officers within the Imperial Military who had high-enough rank to be allowed access to the Imperial Handbook: A Commander's Guide, the official field manual for the military forces in the Empire, were likely to have the clearance level to know anything about the academy beyond generalities. Upon graduation, students of the Academy were required to swear the Oath of Obedience."}, {"tag": "p", "text": "During a yearlong training program, recruits sparred against each other continuously to perfect their combat skills. By working both alone and in pairs, recruits learned how to rely on themselves or on a teammate to achieve victory, a step away from the squad-based stormtrooper training received on Carida. Failure in training often meant death. During their final test, trainees fought each other to the death in an arena called \"The Squall\" before Palpatine himself. Only a handful would survive this final test in a display of their loyalty and skill."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Royal Guard Academy first appeared in the comic series 'Crimson Empire. An \"Imperial Academy of Yinchorr\" was first mentioned in the \"Riot Trooper\" entry in the in-game databank of the PlayStation 3/Xbox 360 versions of Star Wars: The Force Unleashed II, a LucasArts video game released in 2010, though it was not until the 2014 Star Wars: Imperial Handbook: A Commander's Guide that the two were confirmed to be the same."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}