{"url": "Imperial_Scout_Trooper_Forest_Camouflage_Armor", "categories": ["Category:Legends articles", "Category:Stormtrooper armor"], "nodes": [{"tag": "h1", "text": "Imperial Scout Trooper Forest Camouflage Armor"}, {"tag": "p", "text": "Imperial Scout Trooper Forest Camouflage Armor, or Imperial Forest Camouflage Armor for short, was a type of battle armor used by the Galactic Empire during the Galactic Civil War. A recent development from Imperial Ordinance during the time following the Battle of Yavin in 0 BBY, this armor was not routinely issued to troops. Another form of this armor was Imperial Stormtrooper Forest Camouflage Armor."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Created for the Galactic Empire, Imperial Scout Trooper Forest Camouflage Armor was a type of battle armor which closely resembled the armor worn by standard Imperial scout troopers. However, instead of a clean white appearance, the armor was patterned in a mottled greenish-brown hue, which allowed it to blend into the forest environments for which it was designed. The armor also resembled the type of armor worn by wetland assault stormtroopers early in the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Imperial Scout Trooper Forest Camouflage Armor, or Imperial Forest Camouflage Armor for short, was a recent development from Imperial Ordinance which saw limited use during the Galactic Civil War following the Battle of Yavin in 0 BBY. It was not routinely issued to Imperial troops, yet at least one individual, the recipient of an Imperial Medallion of Service, was awarded the armor after loyally aiding influential figures at the Emperor's Retreat on the planet Naboo, including Kaja Or'Zee, Inquisitor Loam Redge, Lord Hethrir, Captain Thrawn, Colonel Veers, Emperor Palpatine, and Darth Vader."}, {"tag": "p", "text": "Although this armor was designed for use by Imperial forces, a female Human terrorist named Delia Visi was known to wear a dark colored suit of Scout Trooper Forest Camouflage Armor, albeit without the helmet. After her involvement in the \"Rori Incident,\" which resulted in the bombing of an Imperial military facility in the Naboo system, she became one of the Bounty Hunters' Guild's top 10 most wanted fugitives. Eventually, a unidentified bounty hunter tracked her down and killed her."}, {"tag": "p", "text": "Another variant of this armor, called Imperial Stormtrooper Forest Camouflage Armor, also saw use by the Empire during the Galactic Civil War. This other version of armor more closely resembled the armor worn by stormtroopers. The Alliance to Restore the Republic likewise made use of their own type of forest camouflage armor, known as Rebel Assault Forest Camouflage Armor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Imperial Forest Camouflage Armor first appeared in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. On September 12, 2007, with the release of Chapter 6.12: Masters of the Wild, this armor was included as the reward for completing various quests of a revamped Imperial Theme Park."}, {"tag": "p", "text": "This armor was originally designed to be the Imperial Stormtrooper Forest Camouflage Armor. However, due to outcry from some players regarding its perceived lack of aesthetics, the developers chose not to include that suit of armor as the player reward. Instead, the new design which more closely resembled scout trooper armor was used. However, unlike the scout trooper armor which was designated in Galaxies as reconnaissance armor, the Scout Trooper Forest Camouflage Armor retained its distinction as battle armor. When examining a piece of the armor, the description read, \"Imperial Scout Trooper Forest Camouflage Armor. A recent development from Imperial Ordinance. Not routinely issued to troops.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}