{"url": "Imperial_Senate/Legends", "categories": ["Category:Legends articles", "Category:Imperial Senate organizations"], "nodes": [{"tag": "h1", "text": "Imperial Senate"}, {"tag": "p", "text": "The Imperial Senate or Imperial Congress was the de jure legislative body of the Galactic Empire, though in fact it held little real authority. Instead, it served mainly as an advisory body to Emperor Palpatine. The Imperial Senate was the successor to the Galactic Senate of the Republic, which was reformed when the then Supreme Chancellor Palpatine declared himself sole ruler."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rise of the Empire"}, {"tag": "p", "text": "The Imperial Senate was established in 19 BBY after the Empire was founded by the self-appointed Emperor Palpatine, transforming the old Galactic Senate. Rather than risk directly seizing power and overthrowing the Senate, Palpatine subtly manipulated the Galactic Senate into voting incrementally more and more emergency powers to the Chancellorship during the Clone Wars. By the end of the conflict, Palpatine had gained near-dictatorial powers. The final stroke came following the death of Separatist leader Count Dooku during the closing days of the war, when Palpatine issued a decree creating a new class of Planetary Governors and Sector Moffs appointed directly by the Chancellorship, to oversee all star systems in the Republic. A minority of Senators protested this action, but Palpatine brushed their complaints aside."}, {"tag": "p", "text": "Within a few days, the Clone Wars ended with the death of General Grievous in a duel with Jedi Master Obi-Wan Kenobi and the execution of the Separatist Council at the hands of Darth Vader. With the justification of a Jedi rebellion, Palpatine ordered Republic troops to wipe out the Jedi Order, and in a speech before the Senate, proclaimed himself Emperor. Senators who vocally resisted were intimidated into silence through brief imprisonment."}, {"tag": "p", "text": "On the whole, however, the transition from Galactic Senate to Imperial Senate went quietly and without major incident. Emperor Palpatine did not want to risk tarnishing his public support by making an open grab for power, so he allowed the organization to continue to nominally exist, though it had been gutted of any real functional power. Under advice from Padmé Amidala shortly before her death, Senators Organa and Mon Mothma, along with other Senators from the Delegation of 2000, did not directly confront Palpatine's declaration of a Galactic Empire. Realizing they had already lost, and that further resistance would only be seized upon by Palpatine as justification for dismantling what little remained of the Senate, they determined that their best remaining option was to bide their time in silence. In addition, the newly formed Empire had always intended for the Imperial Senate to simply be a transitional buffer between the Old Republic and the New Order."}, {"tag": "p", "text": "Although at the time of the Empire's formation a majority of senators were loyal to Palpatine, the Imperial Senate was still a prime (if often clandestine) source of resistance to Palpatine's authority, and despite its changes, came to be known as the \"last remnants of the Old Republic.\" Certain Senators—many of whom later joined the Rebellion—were known for using the Senate as a platform to voice proposals attempting to moderate Palpatine's rule, although always under the guise of perfect loyalty, and some also proceeded to secretly give aid to the Rebel Alliance. However, those senators actions did not go unnoticed by Imperial Intelligence. Prior to its dissolution, the Imperial Senate, under the approval of the Emperor, also issued Intergalactic Passports to anyone in the galaxy to give them expressed permission to travel through the six primary galaxies. Similarly, the Senate also had access to another version of the Intergalactic Passport that was issued by them directly via the President of the Imperial Senate, although it had some restrictions: Namely, it cannot actually guarantee the owners' safety when traveling through any portions of Imperial Space that were under the direct control of the Emperor without either the Emperor's permission, or barring that, meeting with the commander of the Dantooine Base."}, {"tag": "h3", "text": "Dissolution"}, {"tag": "p", "text": "In 0 BBY (35:3:5), Palpatine ordered the Imperial Senate to be shut down \"for the duration of the emergency,\" ostensibly due to the widespread dissemination of the Declaration of Rebellion over the previous months. In truth, the Declaration of Rebellion was merely an excuse to eliminate the Imperial Senate permanently, due to it being a remnant of the Old Republic as well as having Rebel sympathizers among the various senators, and because its role as a transitional buffer had already been expended, with only officers in the Imperial Military being notified of this. As such, it was never revived. To fill the open void in the Imperial government, COMPNOR's Select Committee stepped up to the role of overseeing the vast Imperial bureaucracy and the Imperial Ruling Council became the central leadership within the Empire, while the Moffs and Grand Moffs retained direct control over their territories."}, {"tag": "p", "text": "Eventually the succession of the Imperial legislature was filled by various councils, most composed of Moffs: the Central Committee of Grand Moffs, the Imperial Ruling Council, and finally, the Council of Moffs."}, {"tag": "p", "text": "According to the Bureau of Operations of Imperial Intelligence, the Rebel Alliance managed to rescue many former Senators who were willing to use their political influence to oppose the Empire. To prevent these politicians from openly supporting the Rebellion, Imperial Intelligence sent teams to attack the Senators' hideouts."}, {"tag": "p", "text": "7 ABY marked the year that the Imperial Senate was succeeded by the New Republic Senate."}, {"tag": "h2", "text": "Powers"}, {"tag": "p", "text": "Besides the name, the organization differed somewhat from its Republican forebear. Whereas the Galactic Senate had held both legislative and executive power, the Imperial Senate held only legislative power—though most of this power was in the hands of the Emperor, as he was the overall ultimate authority. Despite such, the Imperial Senate still held limited judicial authority, enough to try high ranking officials in the Empire and, possibly, handle cases tied into the Supreme Court. The Emperor allowed the Senate to provide him counsel in enacting new laws. It also had nominal oversight of the Imperial bureaucracy and worked on the Imperial budget. However, the Emperor made it clear that his judgments would be final: Imperial decrees would be issued without debates, court proceedings, or Senatorial overrides. The Emperor could also call and dismiss the Senate at will. The Senate could also pass amendments to the Imperial Charter and apparently had at least nominal oversight of the Imperial Military."}, {"tag": "p", "text": "The day-to-day head of the Senate was no longer the Vice Chair, but the Grand Vizier as President of the Senate. The Senate was, at least in theory, responsible for choosing a new Emperor upon the death or abdication of the current holder of the throne. As Palpatine had no intention of ever dying or abdicating, this power was merely a formality."}, {"tag": "h2", "text": "Composition"}, {"tag": "p", "text": "The Imperial Senate was made up of groups of congressmen: Senators and representatives, representing sectors in the Empire. Some were elected directly, while others were appointed by a planet's ruler."}, {"tag": "p", "text": "Because of \"Human High Culture,\" most of the alien Senators were replaced by Humans, who ended up representing worlds that were entirely non-human. However, alien senators were not unheard-of, especially in the early days of the Empire. In addition, most power was transferred to the Core Worlds. The reason for the human majority as well as the Core-centric political rule was justified in the official field manual for the Imperial Military with the claim that alien species of the Rim were unpredictable and given to violent outbursts, citing the Republic Senate's history as proof."}, {"tag": "p", "text": "Committees and Subcommittees included:"}, {"tag": "h2", "text": "Documents"}, {"tag": "p", "text": "Documents relating to the Imperial Senate included:"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Palpatine's transformation of the Galactic Senate into the Imperial Senate mirrors how the Roman Republic was transformed into the Roman Empire by its first emperor, Augustus. Rather than risk further confrontation with the Roman Republic's Senate, Augustus allowed the Senators to continue meeting, but they had been stripped of any real executive power, continuing as little more than an advisory council which he could simply ignore at his leisure. The only difference being that unlike Palpatine, Augustus never dissolved the Senate in his lifetime."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}