{"url": "Imperial_Senate", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Imperial Senate organizations"], "nodes": [{"tag": "h1", "text": "Imperial Senate"}, {"tag": "p", "text": "The Imperial Senate, also referred to as the Galactic Senate or the council, was the de jure legislature of the First Galactic Empire. It was the continuation of the Galactic Senate of the Republic, which was reformed into an autocratic regime when Supreme Chancellor Sheev Palpatine declared himself Emperor."}, {"tag": "p", "text": "The Imperial Senate was disbanded after the capture of Princess Leia Organa of Alderaan nineteen years after the formation of the Empire. With Organa being a senator who supported the growing Rebellion against Palpatine's absolute rule, the Emperor used the incident to cast doubt unto the loyalty of the assembly. As such, the Senate was dissolved, with its former prerogatives handed down to the regional governors and the military."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Establishment"}, {"tag": "p", "text": "At the end of the Clone Wars—which he had carefully masterminded—the Sith Lord known as Darth Sidious continued to use his public persona of Sheev Palpatine, the Supreme Chancellor of the Galactic Republic. He ordered a special session of Congress and proclaimed himself Galactic Emperor, turning the old Republic into a New Order in his image. The representatives overwhelmingly supported the announcement, except for a few delegates, including Padmé Amidala and Bail Organa."}, {"tag": "p", "text": "In the wake of the regime change, the Galactic Senate became the Imperial Senate, and the Senate Plaza the Imperial Plaza. Additionally, architectural and design changes would remove any trace of the former Republic, and a giant statue of the Emperor would be erected outside the Senate Rotunda."}, {"tag": "h3", "text": "Oversight of the Empire"}, {"tag": "p", "text": "Making good on his vows to end corruption in the Senate, many citizenry believed that the Emperor was indeed restoring stability to the galaxy. Concurrently, many of Palpatine's political opponents suddenly began to vanish."}, {"tag": "p", "text": "Implied threats and a near-complete lack of trust would permeate among worlds, while the actual enactment of legislation would become an uncommon occurrence. Prior to the mission to Ryloth, Instructor Pell Baylo sought to assassinate Palpatine, having remained loyal to Republic ideals instead of those of the new Empire. Speaking with the Emperor, he denied the idea that the Senate's approval gave legitimacy to the Imperial state, feeling that the Senate had dissolved its pact with the people of the Republic by allowing Palpatine to take over."}, {"tag": "h3", "text": "Decline"}, {"tag": "p", "text": "By its fourteenth year of existence, the new Senate started growing even weaker as the Emperor's planetary governors assumed more responsibility over their territories. By 3 BBY, only forty planets bothered sending representatives to the Apprentice Legislature program—which began under the Galactic Republic and continued in the Imperial Senate. Its decline in activity was parallel to the Senate's decline in actual power."}, {"tag": "p", "text": "Ultimately, the Emperor preserved the Senate in order to make Imperial worlds believe that they still had a part to play in the government. Secretly, the Emperor planned to disband the Senate since the formation of the Empire in the proclamation of the New Order, but needed its body to preserve order until the Death Star was completed, from which he could rule absolute through sheer terror."}, {"tag": "p", "text": "Some representatives, however, did not realize the extent of the Senate's powerlessness. Nadea Tural, senator of Thrad, was still under the impression that she made a difference by voting on important issues. Like many other senators, she assumed that, once the Senate's job was done, the result of a vote was passed into law. Little did Tural know that the Emperor did not actually implement the voted changes, leaving the senators to bask in their fruitless pride."}, {"tag": "p", "text": "Worst of all, as the Emperor was planning to shut down the Senate, the Imperial Military would not obey the laws of warfare they had put in place either. After the fall of the planet Lasan, the Senate banned the use of the T-7 ion disruptor rifle. However, the military ignored the Senate's decree and planned for the disruptors to be produced on Lothal, and violated surrender protocols by destroying damaged transports and unarmed civilian craft. The Senate was also informed about the destruction of Jedha City by the Empire, and was told that it was caused by a mining disaster."}, {"tag": "h3", "text": "Dissolution"}, {"tag": "p", "text": "The Imperial Senate remained in place for most of Palpatine's rule, constituting one of the last remnants of the old Republic. However, the Rebellion against the Empire kept gaining a growing support in that council. Certain senators, including Princess Leia Organa of Alderaan, did not hesitate to use their diplomatic immunity to help the Rebels. The last straw came in 0 BBY, when Senator Leia Organa attempted to smuggle the stolen plans for the Death Star, a moon-sized battle station that could destroy an entire planet. Organa's blockade runner was subsequently captured by Sith Lord Darth Vader, the Emperor's apprentice and right-hand man. Fearful of generating more sympathy for the Rebellion in the Senate, Vader ordered to send a false distress signal and then inform the senators that all aboard Organa's vessel had been killed. Shortly thereafter, the Emperor disbanded the Imperial Senate, passing direct control down to regional governors and the military. At the time of the Senate's dissolution, General Cassio Tagge was concerned that the Rebellion was gaining sympathy in the Imperial Senate, until Grand Moff Wilhuff Tarkin reported the Emperor's decree to the Joint Chiefs. Tarkin assured them that the governors would fill the power vaccuum, and that the DS-1 Death Star Mobile Battle Station would generate fear across the galaxy, thereby keeping the star systems compliant to the Empire's authority. Nadea Tural and a dozen other Rebel sympathizers in the Senate were arrested for their views and imprisoned in the Arrth-Eno Prison Complex on Coruscant. The Alliance made an attempt to both rescue those senators and assassinate the Emperor. Their plans, however, were thwarted, and all captive senators died."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After the Empire was defeated at the Battle of Endor, the Rebel Alliance reorganized into the New Republic and restored the Imperial Senate as the Galactic Senate based on the Old Republic Senate, on the planet Chandrila. Led by the ideals of unity, accountability, and legality, the Senate strove to avoid repeating the mistakes of the past, and attempted to curb the powers of the Chancellor to avoid creating another Emperor. Nonetheless, following the retirement of Mon Mothma, the Senate would split into two factions, the Centrists and the Populists, a political divide that would threaten to undermine the New Republic's egalitarian philosophy, all while an Imperial successor regime grew on the fringes of the galaxy."}, {"tag": "h2", "text": "Powers"}, {"tag": "p", "text": "In basic theory, the Imperial Senate held legislative powers. Although the senators regularly voted issues in the name of the people they represented, only the Emperor had the power to actually pass those votes into law—which he usually did not. However, the Senate had to applaud the Emperor's every decree. Although Palpatine rarely appeared at proceedings, very few senators dared to demand answers in the Senate chamber, lest they be reprimanded, or even silenced. While senators enjoyed diplomatic immunity, they did not have the right to contest an execution order given by a military commander, especially in matters relating to treason."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}