{"url": "Imperial_Space", "categories": ["Category:Legends articles", "Category:Galactic Empire", "Category:Imperial Remnant", "Category:Regions"], "nodes": [{"tag": "h1", "text": "Imperial Space"}, {"tag": "p", "text": "Imperial Space, later called Imperial Sector and Bastion space, was the term given to the region of space controlled by the Galactic Empire, and later the Imperial Remnant and the Fel Empire. During the Imperial Period, it consisted of almost all the known the galaxy, from the Core Worlds to the Outer Rim. This term was mainly used after the New Republic became the dominant galactic government."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Little Empires: 7–8 ABY"}, {"tag": "p", "text": "After the fall of Coruscant and the Core Worlds in 6 ABY, the Empire lost the status of galactic government. At this time, most remaining Imperial territory was shared between warlords."}, {"tag": "p", "text": "The true Imperial territory included some sectors compressed between Zsinj's Empire and the Pentastar Alignment in the Outer Rim Territories, a region at the south of the Pentastar Alignment from the Inner Rim to the Outer Rim and some star systems separated from those areas, throughout the galaxy."}, {"tag": "p", "text": "After the death of Warlord Zsinj, Admiral Teren Rogriss managed to recapture a small part of Zsinj's Empire along the Hydian Way but he was quickly pushed back."}, {"tag": "h3", "text": "Thrawn's Empire : 9 ABY"}, {"tag": "p", "text": "During his short but prolific campaign, Grand Admiral Thrawn conquered a very large amount of sectors and star systems, expanding his empire in all regions of the galaxy, from the Outer Rim Territories to the Core Worlds. At the moment of his death, he controlled more than a third of the galaxy, an equivalent territory to the New Republic. The Empire would never again be as large until the rise of the Fel Empire."}, {"tag": "h3", "text": "The Dark Empire: 10–11 ABY"}, {"tag": "p", "text": "After having come back from death, the reborn Emperor Palpatine unified the various warlords and Imperial factions and launched Operation Shadow Hand in order to reimpose his rule on the galaxy. Using his superweapons, he reconquered an amount of territory spanning from the Outer Rim to the Core Worlds. At this time, the Borderland Regions was a region that separated the New Republic from the Empire."}, {"tag": "h3", "text": "The Crimson Empire: 11 ABY"}, {"tag": "p", "text": "This term referred to the color of the armor of the main Imperial leader of this period: Carnor Jax. Quickly attacked by the New Republic after his takeover, the former Emperor's Royal Guard and his successors lost much of the reborn Palpatine's territory. They were only able to hold onto a strip of of territory that stretched from the Outer Rim to the Colonies. In addition, the Pentastar Alignment and other warlords regained their independence after Palpatine's death. After the fall of the Crimson Empire, the New Republic proclaimed that the true Empire had ceased to exist, as all that was left were the feuding warlords in the Deep Core, various Moffs that were more interested in entrenching themselves on heavily defended fortress worlds, and the Pentastar Alignment, which had no intention of engaging the New Republic."}, {"tag": "h3", "text": "Pellaeon's Empire: 12–17 ABY"}, {"tag": "p", "text": "Pellaeon's Empire was the name given to Imperial Space in 12 ABY, after the Imperial Reunification and the formation of the Imperial Remnant. After the Conference at Tsoss Beacon, Admiral Pellaeon moved the united Deep Core forces to the Outer Rim Territories, stretching as far as Wild Space, and limited at the east by the Hydian Way. This newly established fiefdom included territory from the former Crimson Empire, the former Ciutric Hegemony, what had formerly comprised the Pentastar Alignment, Moff fortress worlds, as well as semi-independent sectors such as Admiral Gaen Drommel's Oplovis Sector and Moff Getelles' Antemeridian Sector."}, {"tag": "h3", "text": "The eight \"backwater\" sectors: 17–29 ABY"}, {"tag": "p", "text": "In response to the Imperial aggression in 17 ABY, the New Republic launched an important campaign employing the full might of the New Republic Fleet. The Imperial forces were decimated and Imperial Space was subsequently reduced to eight sectors. This situation forced Pellaeon to negotiate for peace with the New Republic in 19 ABY."}, {"tag": "h3", "text": "The \"Galactic Empire\": From 30 ABY"}, {"tag": "p", "text": "At the end of the Yuuzhan Vong War, the Imperial Remnant reconquered what territory it had lost to the Yuuzhan Vong, as well as an important number of sectors aligned to the New Republic before the war. Thanks to the weakness of the Galactic Alliance, the Imperial Remnant kept the sectors. At this time, the Imperial Remnant was sometimes referred to as the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}