{"url": "Imperial_Spy", "categories": ["Category:Real-world articles", "Category:Star Wars Kids comic strips"], "nodes": [{"tag": "h1", "text": "Imperial Spy"}, {"tag": "p", "text": "Imperial Spy is a five part comic written by Mike W. Barr and illustrated by Ken Steacy and Glen Mullaly, and was published in issues #11-#15 of the Star Wars Kids magazine. It tells the story of an Imperial spy who stalls the Rebel Alliance's evacuation of Yavin 4."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "With the new X-wings purchased from Vors Voorhorian, the Rebel Alliance plans to evacuate Yavin IV. Several months have passed since the deal with Voorhorian, but the Alliance realizes that the Empire has waited long enough. While Luke Skywalker and Vors Voorhorian are shuttling pilots up to the modified GR-75 medium transport in which the new X-wings are stalled, a CR90 corvette, Bail Organa enters the system, requesting asylum."}, {"tag": "p", "text": "The ship lands on Yavin IV, when it is discovered that it is a refugee ship, carrying Alderaanian survivors from the late planet. Han Solo, on discovering this, orders C-3PO not to tell Leia Organa, the former Princess of Alderaan, citing that she needed sleep after her numerous other escapades."}, {"tag": "p", "text": "A few days later, Lieutenant Rogor, an Alliance officer, discovers an unauthorized intrusion, and notes that someone had been though the Alliance's plans for re-location. Skywalker comes to the deduction that they have a spy on their hands. Leia starts berating Han for ordering that she not be woken up, and then greets the Alderaanian refugees. She is thanked by Tolok, an aristocrat and apparently the leader of the refugees. Leia then discovers a woman named Darlen amongst the crowd. Darlen and Leia had been friends back on Alderaan, and had probably not seen each other in the three years since the Destruction of Alderaan. During their reunion, Leia has an idea, and storms off towards the Yavin control room, where she \"accuses\" Han Solo of being the spy. Solo tries to \"make a run\" for it, and strikes Skywalker. Taking off in the Millennium Falcon, Solo patrols the skies of Yavin IV. The \"accusation\" had in fact been a ruse by Leia to draw the real spy into a false sense of security. Solo and Chewbacca discover an unauthorized transmission emanating from the jungle around the Massassi base. Q-7N triangulates the readings back in the control room and leads Luke and Leia to the source. On getting to the location specified, the three of them find Tolok and Darlen in each others arms."}, {"tag": "p", "text": "Tolok explains that he and Darlen were married, though they had kept it a secret, because they did not feel the right to talk about their happiness with the other refugees. Meanwhile, Luke and Q-7N scout the surroundings and find an autobeacon, which detonates upon their discovery. Han and Chewbacca, in the Falcon, get another signal and track it to one of the many outposts around the Massassi Temple. They try to shoot down the shadowy figure atop the outpost but miss, and the spy escapes. Back at the base, Luke offers to discover the culprit by using the Force on one of the fragments of the destroyed autobeacon."}, {"tag": "p", "text": "Meanwhile, Darth Vader receives a transmission from the spy, who advises him that now is the best time to strike. Vader agrees, and takes the Death Squadron to the Yavin system. The Evacuation of Yavin would begin in mere hours."}, {"tag": "p", "text": "While the Rebel ships were preparing for take off, Luke insisted that by using the Force, he could discover the identity of the spy. As he did so, Rogor, who had been the spy all along, burst out and tried to kill Luke, before running into the main hangar and clambering into an X-wing. Little did he know that it was one of the old X-wings, whose parts had been sacrificed to make the new X-wings operational. Rogor's craft crashed in a swamp near the main temple. He escaped and wandered through the jungle for several hours, before chancing upon the Imperial ground force assault led by Darth Vader. Vader, displeased by the fact that many of the Rebels had been able to evacuate, struck down Rogor with his lightsaber, and the Rebels successfully relocated to Hoth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}]}