{"url": "Imperial_Super_Commando", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Imperial organizations", "Category:Imperial Super Commandos", "Category:Mandalorian organizations"], "nodes": [{"tag": "h1", "text": "Imperial Super Commando"}, {"tag": "p", "text": "The Imperial Super Commandos were Mandalorian warriors loyal to the Galactic Empire whose masterful combat skills were eclipsed only by their ruthlessness. They were led by Gar Saxon, the Imperial Viceroy of Mandalore. Under the leadership of Saxon, the Imperial Super Commandos acted as elite enforcers for the Empire, including ambushing and wiping out the Mandalorian Protectors once learning they were assisting rebel ships through the Concord Dawn system, but failing to kill their leader, Fenn Rau, who was able to escape them with the help of Sabine Wren and Ezra Bridger."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Imperial Super Commandos sported all white Mandalorian armor made from beskar, with helmets that had special visors and a jetpack. Their leader, Gar Saxon, possessed armor with a stark red paint job as a means of displaying his dominance. The commandos utilized blaster rifles which fired yellow blaster bolts. Their armor, while designed and manufactured on Mandalore, bore visual similarities to stormtroopers in order to reflect their alignment with the Galactic Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Imperial Super Commandos served as the soldiers of Viceroy Gar Saxon during the Imperial Era. Saxon was the Emperor's Hand who ruled the Mandalorians on behalf of the Empire. The Commandos were responsible for destroying much of the artwork created by the late Mandalorian artist Veraslayn Kast. As penance for Sabine Wren's escape from the Imperial Academy on Mandalore, Saxon forced Sabine's younger brother Tristan Wren to serve in the Super Commandos in order to prove Clan Wren's loyalty to the Empire."}, {"tag": "p", "text": "In 2 BBY, Saxon and his Super Commandos massacred the Mandalorian Protectors of Concord Dawn to punish their leader Fenn Rau for secretly allowing the rebellion safe passage through the Concord Dawn system. Saxon and his Super Commandos later ambushed the Spectres Sabine, Ezra Bridger, and Chopper at the Protectors Camp on the Third moon of Concord Dawn. Following a skirmish, the Spectres managed to escape with the help of Rau."}, {"tag": "p", "text": "Later, Tristan and his Commandos intercepted Sabine and her Jedi companions Ezra and Kanan Jarrus after they visited Krownest in order to seek Sabine's mother Ursa Wren's support for the rebellion. Viceroy Saxon and his Super Commandos later arrived to apprehend the Jedi and to destroy Clan Wren. Faced between family and Saxon, Tristan chose his family and turned on Saxon and his Super Commandos. Following a skirmish, the Wrens, their Jedi allies, and Rau managed to defeat Saxon and his Super Commandos. Saxon's death plunged Mandalore into a civil war."}, {"tag": "p", "text": "Around 1 BBY, the commandos fell under the leadership of Mandalore's new Imperial governor, Tiber Saxon. The commandos, under Captain Hark accompanied a convoy alongside several scout troopers to escort Alrich Wren to be executed in Sundari. The commandos fought against several members of the Spectres and Clan Wren."}, {"tag": "p", "text": "Saxon then deployed a new weapon against several Mandalorians under Ursa and Tristan. The weapon vaporized all the warriors except the Wrens. Saxon and Hark later set up a trap to capture the weapon's original creator, Sabine. At first, Saxon and Hark were able to force Sabine to enhance the weapon's range, but she was able to modify it to target Saxon's and his stormtroopers' armor. After Sabine destroyed the weapon, Saxon was killed as his Star Destroyer blew up."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The helmet of an Imperial Super Commando was seen at Aunt Z's Tavern on the Colossus during the New Republic Era."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Super Commandos first appeared in the Star Wars Rebels 2016 episode \"Imperial Supercommandos\". According to Pablo Hidalgo in a Rebels Recon video, he and Dave Filoni based the design of the Super Commandos on unused designs for Boba Fett from The Empire Strikes Back, when Boba was himself to be a Super Commando. Hidalgo added that the Super Commandos' armor was designed to emulate the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}