{"url": "Imperial_Stronghold_(Corellia)", "categories": ["Category:Legends articles", "Category:Corellia locations", "Category:Imperial military bases"], "nodes": [{"tag": "h1", "text": "Imperial Stronghold  (Corellia)"}, {"tag": "p", "text": "The Imperial Stronghold was a military base used by the Galactic Empire on the planet Corellia during the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the Suntir Plains, south of Dregan's Pike on the planet Corellia, the Stronghold was a base used by the Galactic Empire during the Galactic Civil War."}, {"tag": "p", "text": "The Stronghold consisted of seven single-story, bunker-like structures, five watch towers, and three landing pads. The majority of the Stronghold was surrounded by a metal wall. It was patrolled and staffed by Triumphant-class dark troopers, non-commissioned officers, Imperial troopers, stormtroopers, and other specialized stormtroopers, such as stormtrooper medics and assault troopers. TIE pilots were also present amongst the Stronghold's two TIE/LN starfighters, one TIE/sa bomber, and one Lambda-class T-4a shuttle. An Imperial Surface Marshal staffed the office of one of the Stronghold's buildings."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The base was built and used by the Galactic Empire during the Galactic Civil War between the Empire and the Alliance to Restore the Republic. The Empire had gone to great lengths to construct this outpost."}, {"tag": "p", "text": "After the Battle of Yavin, very few Corellians knew the exact location of the base and the reason it was constructed. A journalist from Tyrena attempted to investigate the stronghold but he was repelled by Imperial authorities. The excited journalist later tried to recruit a spacer to infiltrate the base in order to find out more about its purpose. The former Follower of Nyax Lock Vlash was also among the few to known the existence of the base."}, {"tag": "p", "text": "Circa 1 ABY, the Imperial Stronghold had become a contested hotspot in the Galactic Civil War and Imperial and Rebel forces fought several times for the control of the base. Rebel forces managed to capture the base several times but Imperial forces had always taken it back. Around the same time, a spacer managed to infiltrate the Stronghold and stole Scout trooper armor boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Stronghold appeared in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. With the release of the \"Publish 1\" update on August 3, 2003, the Imperial Stronghold was turned into a \"Factional NPC Base\". Groups of Rebel players could attack Imperial NPCs and achieve several objectives to take control of the base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}