{"url": "Imperial_Survey_Corps", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Imperial organizations"], "nodes": [{"tag": "h1", "text": "Imperial Survey Corps"}, {"tag": "p", "text": "The Imperial Survey Corps was an organization of the Galactic Empire whose duty was the exploration of the galaxy. During the Age of the Empire, one of the Survey Corps' main goals was to map the farthest reaches of Wild Space, and update hyperspace data."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Imperial Survey Corps was the successor to a Galactic Republic organization founded during the Clone Wars. Upon the formation of the Empire, the Survey Corps offered many members of the Civilian Astrogation Corps military commissions, only to have most reject the offer owing to Imperial stipulations regarding all information on the Unknown Regions be considered a state secret."}, {"tag": "p", "text": "The Cerean Kidi Aleri served as a signals analyst within the corps before deserting to the Alliance to Restore the Republic. During the Galactic Civil War between the Empire and the Alliance, Aleri hoped that her former colleagues in the corps would be granted pardons after the war was over. While participating in Operation Yellow Moon alongside Rebel leader Princess Leia Organa, Aleri argued bitterly with the Dressellian commando Lokmarcha on the subject, as he believed that all Imperials, including the Survey Corps staff, should be imprisoned or executed after the fall of the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Survey Corps was conceived by Greg Gorden for the Imperial Sourcebook, a supplement released in 1989 for the Star Wars Legends Star Wars: The Roleplaying Game. In 2015, the novel Moving Target: A Princess Leia Adventure, by Jason Fry and Cecil Castellucci, reintroduced the Corps to canon.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}