{"url": "Imperial_Throne_Room", "categories": ["Category:Legends articles", "Category:Coruscant rooms", "Category:Emperor's throne rooms", "Category:Imperial Palace locations"], "nodes": [{"tag": "h1", "text": "Imperial Throne Room"}, {"tag": "p", "text": "The Imperial Throne Room of the Imperial Palace on Coruscant served as the seat of the Galactic Emperor Palpatine, ruler of the Galactic Empire. That chamber was used from its construction circa 18 BBY until Palpatine's demise aboard the second Death Star at the battle over Endor in 4 ABY. During the Galactic Civil War between the Empire and the Rebel Alliance, Palpatine frequently summoned his trusted agents in the throne room, including Darth Vader, Mara Jade, and Xizor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At the end of the Clone Wars in 19 BBY, the Supreme Chancellor of the Galactic Republic Palpatine revealed his true nature as a Sith Lord and anointed himself ruler of an authoritarian Galactic Empire. He declared martial order and decreed the extermination of all Jedi, the long-time enemies of the Sith. Palpatine also ordered the refurbishment of the stately Presidential Palace, making the tallest structure on the planet of Coruscant. By 18 BBY, the changes to the Palace were completed. Several audience chambers were integrated into the building, each designed to serve a specific need. One of them served as the Palpatine's public throne room, where bureaucrats and honored citizens were summoned to listen to the Emperor's decrees."}, {"tag": "p", "text": "During the Galactic Civil War that pitted the Empire against the Rebel Alliance, Emperor Palpatine frequently summoned Darth Vader to his favorite throne room for important matters. Shortly before the Battle of Yavin the Empire discovered the location of the Dark Woman, a Jedi who had survived the Jedi purge. Palpatine summoned Vader in the throne room, informing him of the situation, and ordering him to travel to Cophrigin V so he could kill the survivor. Not long thereafter, the Empire's planet-killing Death Star battlestation was destroyed by the Rebel Alliance in the Yavin system. While trying to find the location of the young pilot responsible for the destruction of the Death Star, Vader made reports to the Emperor in the Palace throne room."}, {"tag": "p", "text": "Beside Darth Vader, Emperor Palpatine maintained contact with other agents in his throne room, including his elite operative Mara Jade, and Prince Xizor of the Black Sun. It is also in that room that Palpatine relieved Moff Tiaan Jerjerrod from his work in Logistics and Supply, naming him sole commander of the still-under-construction second Death Star battlestation."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Sunken into the stone, the Emperor's primary throne room was an immense auditorium that could be divided in two sections. The first section, through which visitors entered the room, was an antechamber with curved walls and a number of stations occupied by stormtroopers. The second section was an apse that contained the throne itself, perched atop a dais. Additional stations used by members of the Emperor's Royal Guard jutted from the dais to either sides of the throne. Three circular windows lined with a web-like framework were located behind the throne and on both sides of it. A fourth, much larger window occupied the upper register of the back wall. At the other end of the antechamber, facing the throne, was a turbolift access that lead to the Supplicants Waiting Hall, where courtiers waited for an audience with their Imperial master."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}