{"url": "Anakin_Solo", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Articles with non-canon elements", "Category:Coruscanti", "Category:Engineers", "Category:Force ghosts", "Category:House of Solo", "Category:Humans", "Category:Jedi Guardians", "Category:Jedi Knights of the New Jedi Order", "Category:Males", "Category:Mechanics", "Category:New Republic Starfighter Corps personnel", "Category:Skywalker family"], "nodes": [{"tag": "h1", "text": "Anakin Solo"}, {"tag": "p", "text": "Anakin Solo was a Human male Jedi Knight of the New Jedi Order who was the third child of Han Solo and Leia Organa Solo and the younger brother of Jaina and Jacen Solo."}, {"tag": "p", "text": "Named after his grandfather, Anakin Skywalker, as a child Anakin often feared succumbing to the allure of the dark side and becoming a Sith himself. At the age of eleven, he attended the Jedi Praxeum on Yavin 4, where he became fast friends with Tahiri Veila. Together, they enjoyed numerous adventures, which included freeing the imprisoned souls of Massassi children."}, {"tag": "p", "text": "Anakin was one of the pivotal figures in the Yuuzhan Vong War, participating in several of the major battles and developing effective tactics against the Yuuzhan Vong. As a result of his mission to rescue Tahiri and to help Vua Rapuung compel Mezhan Kwaad to speak the truth, the Jeedai heresy—a heretical movement that ultimately helped bring the end of the war—quickly spread among the Shamed Ones. Later, Anakin led the Myrkr strike team to end the scourge of the Jedi-killing voxyn, where he gave his life to end the threat."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (10.5 ABY–22 ABY)"}, {"tag": "p", "text": "Anakin Solo was born to Leia Organa Solo and Han Solo on the world of Nespis VIII in 10 ABY, a year and a half after his twin siblings, Jacen and Jaina. His birth was prophesied as early as 1000 BBY by a Jedi Master. Originally, Anakin was to be named Han Solo Jr. after his father, but his mother, Leia decided to name the boy after his maternal grandfather, Anakin Skywalker. She wanted to redeem her father's name, and she also thought she could overcome her fear of Darth Vader by seeing, through her son, what her father could have been."}, {"tag": "h4", "text": "Abduction attempts"}, {"tag": "p", "text": "Anakin was born during a time of great instability. The New Republic was faced with the resurgent Imperial factions under the reborn Lord of the Sith and Galactic Emperor Palpatine. On one occasion, the Emperor touched Anakin while he was still in the womb. On another, he attempted to take over the body of the unborn child, in an effort to sustain his spirit in a more powerful form. However, the Emperor was killed, shot by Anakin's father, Han, before he could complete his plan. Though this happened, the dark essence of the Emperor went in the direction of Anakin, however the Jedi Knight Empatojayos Brand protected him and gave his life so he could continue his."}, {"tag": "p", "text": "Anakin spent the first year of his life on Anoth, an isolated planet which his uncle, Luke Skywalker, and the admiral of the New Republic, Gial Ackbar, had fortified to protect the Solo children. There, Anakin was tended to by nanny droids and his mother's best friend, Winter. His parents were allowed to visit every few months. At first his siblings, Jacen and Jaina, lived with him on Anoth but once they reached the age of two they went to live with Leia and Han on Coruscant."}, {"tag": "p", "text": "In 11 ABY, an Imperial strike team led by Furgan, the ambassador of his home planet Carida, invaded Anoth trying to kidnap Anakin. Winter was able to kill most of the invaders by triggering the base's defenses and fighting the Imperials on her own. Eventually, Leia and Ackbar, who had been alerted of Furgan's plan, arrived and saved Anakin from the Ambassador's efforts. After the abduction attempt, Anakin went to Coruscant to live with his parents and siblings."}, {"tag": "h4", "text": "Childhood years"}, {"tag": "p", "text": "Since Leia became overwhelmed in trying to tend to both her motherly and political duties, she enlisted the protocol droid C-3PO's help in taking care of the twins and Anakin. The droid uploaded information regarding child-rearing into his memory banks and met the challenge with initial enthusiasm but mixed results. After Chewbacca returned from Kessel with Han, he also aided in raising the Solo children.[source?]"}, {"tag": "p", "text": "During the Empire Reborn movement of 14 ABY, Anakin and his siblings were kidnapped by Lord Hethrir, the Imperial Procurator of Justice, who wanted to take advantage of their Force powers. During Anakin's captivity, he became attached to Tigris who was his nursemaid and Hethrir's son. Lord Hethrir attempted to sacrifice the Force-strong Anakin to a creature named Waru in exchange for Waru's help. However, Anakin's parents, along with his uncle Luke Skywalker, succeeded in rescuing the children, and Hethrir was destroyed by Waru."}, {"tag": "p", "text": "When Anakin was a child he had recurring dreams of his grandfather Darth Vader. Because Anakin would not confide in Leia, she sent Han to talk to him. Anakin then asked his father what happened to Luke's hand. In order to get rid of Anakin's nightmares of Darth Vader and explain the story of Luke's mechanical hand, Han told Anakin about their adventures during the Galactic Civil War. However, instead of putting Luke in the story he used Luke's hand. When Han finished the story Anakin claimed that he was going to be Luke's hand one day and then went to sleep pitting his hands against his feet."}, {"tag": "h4", "text": "The First Corellian Insurrection"}, {"tag": "p", "text": "In 18 ABY, Anakin accompanied his family on a vacation to the Corellian system. After their arrival, Leia hired a Drall named Ebrihim to tutor the children and act as a guide for the whole family. On their first outing, the family visited Corellia's first major archaeological site. While there, Anakin and his siblings became separated from the rest of the party because Anakin stopped to investigate something he had sensed through the Force. He tracked this sense with his siblings following him and eventually arrived at what would later be identified as Corellia's planetary repulsor, one of which was located on each of the five inhabited planets of the Corellian system. Later, the children told their parents what they had found in the tunnel."}, {"tag": "p", "text": "After several days, during which they toured Corellia's main continent, Anakin and his family relocated their lodgings to Corona House so that Leia could participate in the trade summit that was soon to be held. During the first night of the trade summit, the three children overheard a conversation between their parents, Master Trader Mara Jade, and Governor-General Micamberlecto and learned of a starbuster plot which involved the destruction of entire star systems."}, {"tag": "p", "text": "Anakin, Jacen, and Jaina were confined to Corona House with Chewbacca, Ebrihim, and Ebrihim's astromech droid, Q9-X2, while Leia and Han left to advise Micamberlecto on how to deal with the growing crisis. The Solo children watched from their apartment as enclaves within Coronet City burned to the ground and many people were killed in the first stages of what would later come to be known as the Corellian Insurrection. Soon Corona House itself came under fire and the children and their companions fled to the Millennium Falcon."}, {"tag": "p", "text": "With the Falcon's hyperdrive damaged by a Pocket Patrol Boat, the decision was made to visit Ebrihim's Aunt Marcha, the Duchess of Mastigophorous, on Drall. Once there, Anakin, Jacen, and Jaina related to the Duchess their experience at the archaeological dig, the mysterious installation that they had found there, and the starbuster plot that they had heard about."}, {"tag": "p", "text": "Marcha brought the Solo children to the approximate location of Drall's planetary repulsor and Anakin was able to find the repulsor using the Force. Once inside, he found hidden control panels and used them to operate parts of the repulsor. While everyone else was asleep, he sneaked away and activated the repulsor. Although Anakin was safe in one of the tunnels, the others were in danger of being killed by the energy of the activation. However, they were all eventually able to get to safety inside the Falcon."}, {"tag": "p", "text": "Anakin later met his father's cousin Thrackan Sal-Solo, who came as soon as he learned that Drall's planetary repulsor had been activated. Thrackan, planning to use the repulsor for his own ends, imprisoned Anakin, Jaina, Jacen, Chewbacca, Ebrihim, and Marcha. He then tried to use the children to blackmail their mother into getting the New Republic to recognize Corellian independence."}, {"tag": "p", "text": "Anakin showed Jacen and Jaina how to walk \"in between\" the force field using the Force and the children were able to escape using this technique. However, Chewbacca and the Drall could not get out. The children made their way, along with Q9-X2, to the Falcon, and took off in it. Thrackan came after them, but they managed to evade his ship due to Jacen's piloting, Jaina's gunnery skills, and Anakin's use of the deflector shield to protect the Falcon. The Solo children were then reunited with their parents aboard the Intruder, a New Republic Bakuran vessel that rescued them. However, Han and Leia soon had to leave as they had volunteered to help the Bakuran fleet in its confrontation with the forces of the Sacorrian Triad at Centerpoint Station."}, {"tag": "p", "text": "Because the systems of Drall's repulsor would only respond to Anakin, he and his siblings soon returned to the planetary repulsor. There, Anakin helped the Bakuran technicians as they tried to find a way to use the repulsor to stop the ancient space station, Centerpoint, from exploding the star of Bovo Yagen. Eventually, Anakin used the Force to aim the repulsor and stop the beam of energy coming from Centerpoint, saving billions of lives."}, {"tag": "p", "text": "After the discovery of a partial copy of the Caamas Document in 19 ABY, and because of the scandal that followed, Anakin and his siblings were sent to Kashyyyk with Chewbacca and a group of Noghri for their protection. After the crisis had passed, the three siblings attended the signing of the Pellaeon–Gavrisom Treaty with their parents aboard the Star Destroyer Chimaera. They also attended the wedding of Luke Skywalker and Mara Jade."}, {"tag": "h3", "text": "Jedi training (22 ABY–25 ABY)"}, {"tag": "h4", "text": "Search for the Golden Globe"}, {"tag": "p", "text": "At the age of eleven, Anakin attended the first session for younger students at the Jedi Praxeum in the Great Temple on Yavin 4. There, he met and befriended Tahiri Veila, an orphan from Tatooine. Soon, he and Tahiri began sharing the same dream and decided it was their destiny to do what they did in the dream. Because of this, they sneaked out of the Great Temple taking their uncle's astromech droid, R2-D2, with them. Eventually, they came to the crumbling Palace of the Woolamander inside of which they discovered the Golden Globe and the ancient Jedi Master Ikrit who had guarded it for hundreds of years. Ikrit informed the pair that the Golden Globe contained countless trapped Massassi souls that could only be freed by Force-sensitive children. He also warned them that they could not tell Luke Skywalker about the Globe, or everything would be lost. R2-D2 then led the children and Ikrit safely back to the Great Temple where the children told Luke that they had just become lost taking a walk in the jungle."}, {"tag": "p", "text": "Later, Anakin and Tahiri accompanied the Melodie Lyric to her homeworld of Yavin 8 where she was to undergo an important form-changing ritual known as the Changing Ceremony. After safely delivering Lyric to the cove where she was to undergo the changing, Anakin and Tahiri helped the young Melodies fight off several native predators including an avril, a reel, and several raiths. As a reward for helping guard the changelings Anakin and Tahiri were able to talk to Aragon, the Keeper of Legends and ask him about the ancient carvings they had found at the Palace of the Woolamander. Aragon directed the children to some similar carvings deep within a cave on Yavin 8. From these carvings, the duo learned that Golden Globe contained the souls of the children of the Massassi that had been imprisoned by the Dark Lord Exar Kun in 3997 BBY. They also learned that it was held together by Sith magic that could only be broken by Force-sensitive children, as Ikrit had already told them."}, {"tag": "p", "text": "Tahiri, accompanied by Anakin and the academy historian, Tionne Solusar, returned to her home planet of Tatooine to honor a promise she had made before she left for the Jedi academy. When she arrived on Tatooine, Tahiri was told that if she immediately returned to the academy, the tribe would kill Sliven. However, if Tahiri survived a dangerous trek across the Dune Sea and the Jundland Wastes, the tribe would continue to follow Sliven and would tell Tahiri her history. Tahiri and Anakin chose to attempt the week-long survival trek together. Before they left, Sliven told Tahiri about her parents. Anakin and Tahiri were then left alone out in the desert without food or water. They made their way back to the tribe using their Force abilities to survive the harsh deserts of the Dune Sea, evade a sarlacc, befriend a Jawa clan, and defeat a Krayt dragon. However, both young Jedi were injured during the journey. Eventually, they were able to return to Yavin 4 where their wounds were treated."}, {"tag": "p", "text": "When their injuries from their trip to Tatooine were completely healed, Tahiri and Anakin made their way back to the Palace of the Woolamander to free the trapped souls within the Golden Globe. They were able to use the Force to weaken the force field around the Globe enough that Anakin could enter it. Once inside, Anakin was able to get the Massassi children to join hands and push their way out of the Globe. After the Massassi souls had escaped, the Globe fractured into thousands of pieces. The freed souls thanked the young Jedi and disappeared. Anakin and Tahiri returned to the Great Temple where Luke was waiting for them, having been told about the Golden Globe by Ikrit."}, {"tag": "h4", "text": "Anakin's Quest"}, {"tag": "p", "text": "Anakin remained troubled by visions of himself as a Dark Jedi, and by his heritage as the grandson of Anakin Skywalker, who had become the infamous Darth Vader. Because of this, the young Jedi asked if he could go to the very same Dark Side Cave on Dagobah that Luke had entered years earlier when training with Yoda."}, {"tag": "p", "text": "Before arrangements for the trip could be made, Tahiri and Anakin found a youth named Uldir Lochett stowed away on the Lightning Rod, a supply freighter. Although Uldir lacked obvious Force sensitivity, he was determined to be a Jedi so Luke agreed to let him stay on at the academy for a while."}, {"tag": "p", "text": "Eventually, Anakin, Tahiri, and Ikrit traveled to Dagobah on the Lightning Rod with R2-D2 and Peckhum piloting the ship. Upon arriving, the group discovered that Uldir had again stowed away on the freighter. Leaving Peckhum with the ship, Anakin, Tahiri, Uldir, Ikrit, and R2-D2 set out for the cave. On the way, they encountered several swamp creatures including a knobby white spider. Upon entering the cave, Anakin saw two of his possible future selves—one evil and one good. Ikrit later explained to Anakin and Tahiri that their choices would decide who they became. R2-D2 then guided the group to Yoda's hut. Afterwards, they returned to Yavin 4."}, {"tag": "h4", "text": "Mission to Bast Castle"}, {"tag": "p", "text": "Later that year, the Jedi historian Tionne Solusar discovered that after Darth Vader and Obi-Wan Kenobi's lightsaber duel on the First Death Star in 0 BBY, during which Vader killed Kenobi, Vader had saved Kenobi's lightsaber and had kept it at Bast Castle on Vjun. Since an information broker had sold this information to Tionne, she feared that others may have learned of it before she did and, because of this, quickly informed Luke Skywalker at the Jedi Praxeum. Luke agreed that Tionne should go to Bast Castle to look for the lightsaber and allowed Anakin, Tahiri, Uldir, Ikrit, and R2-D2 to accompany her to Vjun on her personal transport, Lore Seeker."}, {"tag": "p", "text": "Having arrived on Vjun, they discovered another vessel and feared another group had entered the castle first. To reach Bast Castle, the group had to climb a long length of stairs in rain and sleet. Upon entering the castle, the group encountered lasers being shot at them. Anakin arrived at the conclusion that the lasers were automatic and came up with a successful plan to turn them off. The group then began exploring the castle, eventually splitting up into groups. After evading more booby traps, the group discovered Kenobi's lightsaber. However, a man named Orloc, who claimed to be a mage who possessed great powers, stole the lightsaber, dropped Tionne and Ikrit down a trap door, and seemingly disappeared in a cloud of smoke."}, {"tag": "p", "text": "The Jedi trainees, now on their own, decided to pursue Orloc. Uldir and R2-D2 went one way and Anakin and Tahiri went another. Anakin and Tahiri found Vader's bedchamber and discovered that he had kept a hologram of Luke, his son. Uldir was the first to find Orloc and talked with him for a while. Orloc claimed that he could train Uldir in all of the Force skills he desired and also told him that there was a holocron hidden in Vader's bedchamber. Eventually, the other Jedi arrived, rescued Uldir, escaped Bast Castle, and returned to the Jedi Praxeum, with Kenobi's lightsaber and Asli Krimsan's holocron."}, {"tag": "h4", "text": "Mission to Exis Station"}, {"tag": "p", "text": "Despite having escaped Orloc, Uldir was obsessed with what Orloc told him and still believed that the mage would be able to awaken the Force powers within him, which nobody at the Jedi Praxeum on Yavin 4 had been able to do as of yet. Because of this, Uldir stole Ikrit's ship, Sunrider, Kenobi's lightsaber, and the holocron to travel to an abandoned space station called Exis Station where he believed Orloc was staying."}, {"tag": "p", "text": "Upon arriving on Exis Station, Uldir was captured by Orloc. He then offered Orloc the two Jedi artifacts in exchange for Orloc teaching him of the Force. Orloc, who actually had no Force sensitivity, agreed to this arrangement and began using high-tech gimmicks as demonstrations of his \"Force powers\" to deceive Uldir."}, {"tag": "p", "text": "Anakin, Tahiri, Tionne and Ikrit set out to find Uldir on the Lore Seeker and eventually arrived at Exis Station. After avoiding being killed by Orloc's droids and Ranat mercenaries, the Jedi found Uldir and Orloc and tried to explain to Uldir that Orloc was a fraud. The mage began to attack the four Jedi with his high-tech tricks, but the Jedi fought back by using the Force."}, {"tag": "p", "text": "However, Tionne was wounded and Anakin and Tahiri had to protect her by defeating the assassin droids Orloc sent to kill them. Uldir then saw that Orloc was a fake and began to help Anakin and Tahiri but was injured. Ikrit—who had sworn not to wield a lightsaber until he had found worthy students—dueled Orloc who was using Kenobi's lightsaber. Suddenly, Orloc's stolen lightsaber flew across the room to Anakin, who picked it up and began working his way toward Orloc. Upon reaching Orloc, Anakin used the lightsaber to destroy Orloc's controls for all of his technology. Having defeated the mage, the Jedi returned to the Jedi Praxeum, where they recovered from their injuries and Uldir decided to become a pilot instead of a Jedi."}, {"tag": "h4", "text": "Encountering Zekk"}, {"tag": "p", "text": "Anakin later returned to Coruscant and studied under C-3PO's guidance. In 23 ABY, Anakin assisted his siblings, who had returned to Coruscant for a visit, in locating their orphan friend Zekk who had disappeared after being embarrassed during a banquet with the Solo family. Jacen and his fellow Jedi trainee Tenel Ka eventually found Zekk giving a speech to a group of teens from the street gang Lost Ones in the lower levels of Coruscant. Tamith Kai, an assistant at the Second Imperium's Shadow Academy for training Dark Jedi, arrived with Garowyn and Vilas who were to help her recruit people to be trained at the Academy. Jacen and Jaina found out that Zekk was Force-sensitive and had decided to train to become a Dark Jedi at the Shadow Academy but were then stunned by Vilas."}, {"tag": "p", "text": "Thanks to a comlink Jacen was carrying, Leia, Anakin, and C-3PO found Jacen and Tenel Ka. They all returned to the upper levels of Coruscant and eventually the Jedi were able to stop the Second Imperium."}, {"tag": "h4", "text": "Return to Yavin"}, {"tag": "p", "text": "Anakin later returned to the Jedi Praxeum to aid in its reconstruction after it was attacked by the Second Imperium. During 24 ABY, he accompanied his father to Ord Mantell and helped take down the Black Sun. Later that year, he was promoted to an apprentice Jedi Knight along with several other trainees, including his older siblings, during a ceremony at the Jedi Praxeum. He and Jacen then became Luke's apprentices."}, {"tag": "h3", "text": "Yuuzhan Vong War (25 ABY–29 ABY)"}, {"tag": "h4", "text": "Death of Chewbacca"}, {"tag": "p", "text": "His greatest test would come during the devastating Yuuzhan Vong War in 25 ABY. The extragalactic Yuuzhan Vong invaded the galaxy with the intent of conquering it for themselves. Unlike many other sentient species, these fearsome invaders were not touched by the Force. This confounded the Jedi who first encountered the Yuuzhan Vong because virtually all life forms had a Force energy signature in one way or another."}, {"tag": "p", "text": "During this dark time, Anakin traveled to Sernpidal with his father and Chewbacca to pick up a shipment for Lando Calrissian. They discovered the moon was on collision course with the planet, endangering countless lives. This event, unbeknownst to them, was a Yuuzhan Vong tactic, Yo'gand's Core. While trying to evacuate locals, Anakin was knocked down by strong winds into the distance, causing Chewie to run after him. Chewie was able to bring Anakin to the safety of the Falcon, but another blast of wind knocked him out of reach. Anakin piloted the Falcon, while his father stood on the entrance ramp hoping to lift Chewie up, but they were forced to flee from Sernpidal when Anakin realized it was too late to save Chewie. The Wookiee stood in the moon's trajectory, howling defiantly, and was crushed to death. This incident hurt relations between Anakin and his father, who blamed him. It would be months before father and son reconciled."}, {"tag": "p", "text": "Anakin began developing Jedi tactics against the Yuuzhan Vong. At Dubrillion, he rediscovered a lost Force skill, Battle meditation, and initiated a technique known as Force meld between his siblings. This technique was used to coordinate Jedi in battle, namely in spaceflight throughout the war. He also designed the prototype for the Yuuzhan Vong Hunter Droids (YVH) manufactured by Lando Calrissian, as well as a computer program that kept track of usage of data in the library to facilitate missions for the Jedi."}, {"tag": "h4", "text": "A New Student"}, {"tag": "p", "text": "Early on in the war, a new student began to attend the Jedi Academy—Finn Galfridian, prince of Artorias. During one of Finn's training sessions, Anakin, Jaina, Jacen, and Lowbacca approached the new student, who was looking at a large chunk of land. Jacen asked if Finn's rock was underneath, and Anakin followed up by saying Luke did it to everyone—except for Lowbacca."}, {"tag": "h4", "text": "Battle of Dantooine"}, {"tag": "p", "text": "Following that, Anakin accompanied Mara Jade Skywalker to Dantooine where Mara hoped to halt the progress of the Coomb spore disease that was killing her on the planet's unspoiled grasslands. They were soon joined by refugees from Dubrillion, evacuated by Lando Calrissian. While there, Mara gave Anakin important lessons on not using the Force to do the most mundane of tasks, such as lifting boxes. Later, Anakin was approached by a Dantooine native. Anakin was worried that the native would attack, but when Mara gave him a button from her jacket, the native replied by bringing Anakin special roots from a Blba tree. Anakin agreed to give back the roots if the native brought him firewood. The native, misunderstanding, brought Anakin a log. It was later revealed that the root was a powerful medicine, so Anakin gave some to Mara, and it helped her growing disease slightly. Soon afterward, the Yuuzhan Vong followed them and a great massacre began. During the battle, the Yuuzhan Vong unleashed legions of reptoid Chazrach slave soldiers and beetle-like Thrall herders from their galaxy. Anakin and his older brother Jacen would discover that these Chazrach were entirely mindless and were merely the Yuuzhan Vong's equivalent to battle droids. They slaughtered dozens of Chazrach and Luke Skywalker also destroyed a thrall herder, causing much of the enemy force to scatter and allowing the refugees to escape Dantooine."}, {"tag": "h4", "text": "Hunt for Daeshara'cor"}, {"tag": "p", "text": "When Luke discovered that Jedi Knight Daeshara'cor was looking for superweapons, Anakin accompanied his aunt, uncle, and a man named Chalco on his search for her. They first visited Vortex, the homeworld of the Vors. While there, Anakin was ordered to stay aboard the ship with Chalco, while Luke and Mara went to meet Qwi Xux. Xux directed them to the planet Garos IV. While there, Luke again ordered Anakin to stay at the ship, but he and Chalco disobeyed. Anakin discovered Daeshara'cor, but she knocked him out and took him to her apartment, where she tied him up. It was then that Chalco, who Anakin had grown close to, broke in, wearing an ysalamir skin. Daeshara'cor easily deflected the man's stun blast, but Anakin Force-threw the blaster into her head."}, {"tag": "h4", "text": "Battle of Ithor"}, {"tag": "p", "text": "Later, Anakin was among a task force of Jedi present at the Battle of Ithor. Shortly before the battle, Anakin said goodbye to Chalco, who went with Mirax Terrik Horn to take Ithorian refugees to safety. Before the battle, the Jedi were required by the Ithorians to give up a negative trait. Anakin chose to give up self-assuredness, which surprised his brother."}, {"tag": "p", "text": "During the battle, he was teamed up with Daeshara'cor. While fighting a warrior, Daeshara'cor was wounded by an amphistaff's poisonous bite. Wielding both his own violet lightsaber and her crimson lightsaber, he defended her from further injury. Although he had managed to get Daeshara'cor back to the medical bay with the help from his aunt and uncle, she died—reassuring Anakin that she wouldn't have changed anything. Despite her words, Anakin blamed himself for not being able to save her and live up to Chewbacca's sacrifice."}, {"tag": "h4", "text": "Centerpoint Station"}, {"tag": "p", "text": "Despite the growing Anti-Jediism during the war, Anakin's heroic acts led many New Republic citizens to regard him as a galactic hero and the freshest face of the New Jedi Order—much like his grandfather was during the Clone Wars. There were many whispers that Anakin would one day take his uncle's place as the most powerful Jedi. Mara Jade noted that when he walked by, many females turned their heads to watch him."}, {"tag": "p", "text": "Anakin was later asked to repair Centerpoint Station. He accepted, and he and Jacen went to the station. Only after it was fully repaired was it clear that the Yuuzhan Vong had never intended to attack Corellia, but instead had planned a sneak attack on Fondor."}, {"tag": "p", "text": "During the battle, Anakin could have wiped out the assembled Yuuzhan Vong fleet at Fondor through the use of Centerpoint Station had it not been for his older brother Jacen. Jacen dissuaded his brother from using the station as a weapon, on the basis that it was against the Jedi beliefs. Unfortunately, an old enemy in the form of their cousin, the infamous Thrackan Sal-Solo fired the weapon, destroying the Yuuzhan Vong fleet. Though the casualties among the Yuuzhan Vong were great, much of the Hapan fleet was destroyed in the wake of the blast. This incident furthered the rift between the two brothers, Anakin knowing he could have destroyed the Yuuzhan Vong fleet without the collateral damage if he had taken the shot, instead of listening to Jacen."}, {"tag": "h4", "text": "Fall of Duro"}, {"tag": "p", "text": "Two months after the Centerpoint incident, Anakin was meeting with a group of Jedi that consisted of his uncle and aunt, Kenth Hamner, Cilghal, and Cilghal's apprentice, Tekli. When Tekli revealed that there was a possible Yuuzhan Vong spy at the restaurant Leafy Green, Anakin and Mara went to investigate. They tracked the spy—a female Yuuzhan Vong—across Coruscant and into an alley, where Anakin hit her with a short-range variant of the Stokhli spray stick, after fighting off a swarm of Razor bugs. Unfortunately, the spy managed to kill herself by slashing her own throat before scientists could properly study her."}, {"tag": "p", "text": "Anakin traveled with Mara and Luke to Duro after Tresina Lobi's apprentice, Thrynni Vae, went missing. While there, the trio were disguised as Kubaz. Anakin and Luke were standing to the side when Jacen explained to CorDuro's Vice-director, Durgard Brarun, that he was trying not to use the Force. Anakin was unsettled by this, but still participated when his family, now including his older sister Jaina, went to rescue Jacen. It was later revealed that Thrynni Vae had been killed."}, {"tag": "p", "text": "During the rescue attempt, Anakin caused a distraction by jumping on a stage and challenging his uncle to a duel. While the audience was distracted by the swordplay, Jaina sneaked up to Jacen's room and convinced him to leave. Anakin and Luke were then forced to abandon their distraction when armed guards opened fire on the duo. Along with Mara, they held off the guards long enough for Jaina and Jacen to escape, and then followed closely."}, {"tag": "p", "text": "Later, Anakin played an important role during the defense of Duro when he defended the orbital city of Orr-Om by shooting down a serpentine Ychna which was attacking it, shooting a proton torpedo into the creature's mouth. When Mara Jade landed the Jade Shadow in one of the cities to talk with admiral Darez Wuht, Anakin remained in his X-wing, patrolling the area. When Mara took off, and large portions of the docking bay remained attached to the Shadow, Anakin attempted to shoot them off, but was unsuccessful. Unfortunately, the small force was unable to defend Duro alone, and the Yuuzhan Vong finally overtook the planet, forcing Anakin and his family to retreat."}, {"tag": "h4", "text": "Hero to the enemy"}, {"tag": "p", "text": "During a meeting on Coruscant, in which Kyp Durron expressed his distaste for Luke Skywalker's methods, Anakin and his sister, Jaina, tried to keep Durron from leaving Coruscant. Durron argued with both of them that they should come with him, but they both declined."}, {"tag": "p", "text": "Anakin determined that the Vong and their Peace Brigade allies would Attack the Jedi Praxeum on Yavin 4, having had a vision of Tahiri in danger. However, when he told his uncle, Luke told him that he could not go. Knowing Tahiri could die if he did not go, Anakin forged permission to leave Coruscant and set out with his droid, Fiver."}, {"tag": "p", "text": "The Peace Brigade did attack the Praxeum, and Anakin was caught in a firefight in Yavin space. Upon landing, he was greeted by Kam Solusar and later Tahiri. He informed them of the Peace Brigade's imminent attack, and Solusar agreed to let Anakin and Ikrit stay behind to hold of the Brigade."}, {"tag": "p", "text": "Unfortunately, Anakin did not count on Tahiri, Valin Horn, and Sannah sneaking away from the Solusars to assist him. Anakin and Tahiri were forced to steal a Peace Brigade ship belonging to Remis Vehn."}, {"tag": "p", "text": "During their flight from the Temple, however, Ikrit stayed behind to hold off the Peace Brigade and was killed. Tahiri, in an attempt to recover her master's body, leapt from the ship, only to be captured. Anakin, Vehn, Valin, and Sannah were forced to leave Tahiri behind.\nWhile Anakin was in the process of repairing the ship and building a speeder to take him back to the Praxeum, Qorl, a former TIE pilot who had befriended his older siblings, showed up, allowing Anakin to leave him in charge of the repairs. While returning to the Praxeum, Anakin encountered many warriors. He was able to defeat most, but was almost killed before Vua Rapuung, a Shamed outcast Yuuzhan Vong, came to assist him, asking for help."}, {"tag": "p", "text": "Vua Rapuung helped Anakin reach the Yuuzhan Vong encampment. Anakin's lightsaber was damaged in the process, forcing him to rebuild it with a Yuuzhan Vong lambent that he stole while pretending to be a slave. He attuned his lightsaber to himself and discovered a way to sense the Vong through the Force, channeled through the lambent. Anakin was the first Jedi since Vergere to sense the Yuuzhan Vong, and thus called it \"Vongsense,\" a name which Jacen later adopted."}, {"tag": "p", "text": "The Yuuzhan Vong had performed numerous experiments on Tahiri during her captivity, but Anakin and Raapung fought through hordes of warriors and helped her recover from the ordeal. Anakin told Tahiri that he loved her, and she snapped out of the Mezhan Kwaad's shaping. Unfortunately, during their escape, Raapung was killed, although Kwaad admitted that it was she who had shamed him. After their escape, rumors of their exploits on Yavin 4 ran rampant through the labor class Workers and the outcast Shamed Ones of the Yuuzhan Vong, who soon began to see the Jedi as their salvation, as Anakin's exploits had helped remove Vua's shamed status."}, {"tag": "p", "text": "Following that ordeal, Anakin, Tahiri, and Corran Horn traveled to Eriadu. While there, Tahiri and Anakin sensed a Jedi in trouble. Running to the location of the Jedi, they found a dying Rodian Jedi named Kelbis Nu being attacked by a group of Peace Brigaders. After defeating the Brigaders, Anakin ran to Nu's side while Tahiri called for assistance. Nu told Anakin that Yag'Dhul—the homeworld of the mathematical Givin—would be the next target of the Yuuzhan Vong because it was located right where the Corellian Trade Spine and the Rimma Trade Route met."}, {"tag": "p", "text": "Unfortunately, before they could act on this information, they were arrested by the Eriaduan judicials under a Human male named Lieutenant Themion. Tahiri broke free and rescued Anakin—uttering a Yuuzhan Vong war cry—and the two made their escape. In the lobby, they found two judicials dueling with their lightsabers. They Force pulled them away when one judicial made a sloppy slash, making it look like the judicial had knocked both lightsabers away. After reclaiming their lightsabers and hijacking a police speeder, though the two Jedi eventually reached the spaceport and escaped off-world with Corran Horn on their transport Lucre. They came out of hyperspace in the midst of a Vong fleet and landed on what was assumed to be was an asteroid, but was actually a Yuuzhan Vong Yorik-stronha (spy ship-analogue) which was christened Stalking Moon."}, {"tag": "p", "text": "Having arrived, they managed to warn the Givin Dodecian of the impeding invasion of their planet. When the Vong arrived, Anakin Solo dueled a team leader named Shok Choka. He managed to kill Choka before the Givin decompressed the space station to kill the Yuuzhan Vong. Tahiri and Anakin were forced to stay in a storage locker while Horn went to find vac suits. Feeling the end was near, Anakin admitted his love for her and the two shared a kiss. They were later rescued by Corran while the combined Givin/New Republic fleet drove back the extragalactic invaders."}, {"tag": "h4", "text": "Myrkr"}, {"tag": "p", "text": "In 27 ABY, the Yuuzhan Vong had created a new creature called a Voxyn. This creature was proficient in hunting down and killing Jedi. Anakin and his friends—including Tahiri, Raynar Thul, Lowbacca, Jacen, Jaina, and Tenel Ka—later received a report that their friend from the Praxeum, Lusa, had been killed by a Voxyn. During a meeting, Anakin volunteered to lead a strike mission to kill the Voxyn queen. Though his father was at first set against the idea, the mission was approved, and Anakin selected a small band of Jedi."}, {"tag": "p", "text": "The mission began when Lando Calrissian, posing as a defector, offered Anakin and his team to a Yuuzhan Vong commander. During the faked capture, one of the team's members, Ulaha Kore, was badly wounded by a Yuuzhan Vong wielding a Coufee. En route to the Koros-Strohna Baanu Rass, which orbited Myrkr, Yaght took Ganner Rhysode, who was acting as team leader, to the bridge, while torturing Kore. Jacen Solo, using a mind meld, linked the strike team together through the Force. When it looked like Kore would be unable to handle any more torture, Yaght asked Jaina to pick a new subject, forcing her to choose between Anakin and Jacen. Anakin insisted through the Force that she pick him, and reluctantly, she did. Anakin whispered something in Kore's ear, and she attempted to impale her hand upon a Voxyn's poisonous spines."}, {"tag": "p", "text": "Soon, rescue came in the form of two of Lando's YVH droids YVH 2-1S and 2-4S. Jacen confronted Anakin about his discussion with Ulaha, believing he had told her to make the suicidal attack on the Voxyn. However, Anakin told Jacen that he had not done so, and instead told the Bith to reveal the name of Eclipse Station to Yaght. The team successfully rescued Ganner from the bridge, where Tesar Sebatyne shot the Yaght in the face, killing him. Though they successfully reached Myrkr, the Yuuzhan Vong attempted to stop them from landing. Ulaha remained behind to distract the Vong while Anakin and the remaining team members dropped to the worldship. They landed on the worldship, but Kore and the droid 2-1S were destroyed in the process. The group soon stumbled upon an Ysalamir-riddled prison, where Lomi Plo and Welk, two Dark Jedi, were discovered. Anakin allowed them to join the team, but would only give them blasters, not lightsabers. Soon after, 2-4S was destroyed, as well."}, {"tag": "p", "text": "The group soon stumbled upon an AT-AT, which was inactive. The Yuuzhan Vong had placed a trap inside, and small bugs bit and wounded Lowbacca and Jovan Drark. They soon stumbled upon a slave city, where Eryl Besa and Drark were killed, and Anakin was wounded with an amphistaff through his side."}, {"tag": "p", "text": "Soon afterward, Bela Hara was killed, and Tesar Sebatyne took possession of her white-bladed lightsaber. The teams third Barabel member, Bela's hatchmate Krasov Hara, was also killed with voxyn acid in her face. The team soon discovered an escape ship, the Tachyon Flier. Lomi Plo and Welk, sensing that the mission was taking a downward turn and considering Anakin suicidal since he did not have an escape route, stole the ship, which had the wounded Raynar Thul aboard, and wiped most of the team's memory of them. Shortly afterward, Anakin stayed behind in a Grashal to fight off as many Yuuzhan Vong as he could and give the rest of the team time to accomplish the mission. Tahiri, weeping, rejected him a last goodbye kiss, saying he'd have to return for it."}, {"tag": "p", "text": "Anakin was unable to return, as the Vong overwhelmed him, and he began fighting them in an intense battle, pouring pure white energy from his fingers to disintegrate the warriors. The Force energy that he drew upon overwhelmed a damaged body; having been mortally wounded going to his sister's aid, as Anakin died a beacon of light surrounded by the Yuuzhan Vong."}, {"tag": "p", "text": "The remaining team members were assisted by the alien Vergere, who gave Jacen Anakin's lightsaber, while Jaina, Tahiri, and some others went to recover Anakin's corpse. Jacen, Tesar, and the rest assaulted the voxyn queen's cavern, and Anakin's older brother killed the queen by using the Force to make her tail go into a void created by a dovin basal. Jaina and the others managed to steal Nom Anor's ship, the Ksstarr, but Jacen was captured."}, {"tag": "p", "text": "Anakin's death forced Jacen into a prominent role, pushed his sister Jaina to the edge of the dark side, and launched Tahiri into the throes of despair. His sister and the other escapees flew his body to Hapes, where family and friends gathered for a funeral."}, {"tag": "h3", "text": "Funeral"}, {"tag": "p", "text": "The funeral for Anakin was in Hapes, where the survivors from Myrkr (excluding Jacen) gathered, and friends and family. Everyone recognized Anakin as a hero, including small speeches by Tahiri, Han, Kyp Durron and young Tarc. After a memorial ceremony, Anakin was cremated by Luke Skywalker."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "While in captivity on Coruscant, Jacen was tricked by Vergere, who was using Anakin's voice, to keep Jacen from killing the Dhuryam. Jacen also saw the form of Anakin again while running from the Jedi Temple, although this turned out to be a trick of a Yuuzhan Vong Cavern beast. Jacen also may have encountered Anakin's Force ghost on Yuuzhan'tar in the Solo's former apartment. There, the apparition encouraged him to embrace Vergere's view of the Force. However, it is just as likely that the spirit was either a hallucination or a deliberate trick on Vergere's part, and even more so later, when Lumiya used Vergere to lure Jacen to the dark side."}, {"tag": "h4", "text": "Anakin's lightsaber"}, {"tag": "p", "text": "Anakin's lightsaber proved to play a significant role in defeating the Yuuzhan Vong. First, Jacen used the weapon in his final battle with the voxyn queen. After this, Vergere gave the Vong the weapon, and Nom Anor gave it to Jacen in exchange for him converting to their religion. Jacen deceived them, and lied about his conversion. Ganner Rhysode came to rescue Jacen, where Jacen proved his trust in Ganner by giving the other man his brother's lightsaber. Much as Anakin himself had, Ganner became one with the Force and with this tremendous power, used the lightsaber to kill hundreds, perhaps thousands, of Yuuzhan Vong while Jacen sabotaged Yuuzhan'tar's World Brain. Rhysode was eventually killed when he used the Force to bring down the ceiling of the Well of the World Brain, which had formerly been the Senate Rotunda."}, {"tag": "p", "text": "Finally, the lightsaber was used by Supreme Overlord Shimrra for his duel against Luke during the Recapture of Coruscant. Luke pulled Anakin's lightsaber to him with the Force, then decapitated the Dread Lord with the two lightsabers."}, {"tag": "p", "text": "With Shimrra dead, the Yuuzhan Vong surrendered and left for the Unknown Regions with Zonama Sekot. As the newly liberated galaxy celebrated peace, Han Solo placed Anakin's lightsaber in front of a carving of Chewbacca on Kashyyyk, saying farewell to both of them."}, {"tag": "h4", "text": "Anakin Sal-Solo"}, {"tag": "p", "text": "Some time before 40 ABY, a droid, Anakin Sal-Solo with the personality and biometric data of Anakin was built by Thrackan Sal-Solo to operate Centerpoint Station. The droid was built incorporating Anakin's biometric data and thought patterns, which made him believe he was a resurrected Anakin until Ben Skywalker convinced it otherwise. He used magnetics to duplicate the Force, and also jokingly referred to himself as Anakin Sal-Solo, having the mind of Anakin and being built by Thrackan. After realizing the truth, the droid sacrificed itself to stop Thrackan's plans by wiping his memory circuits and scrambling the station's routines."}, {"tag": "h4", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "Years after Anakin Solo's death, his memory would be used as a symbol for the cause of the Galactic Alliance during the Second Galactic Civil War. The year 40 ABY saw the creation of the Alliance's secret police force, the Galactic Alliance Guard, headed by Colonel Jacen Solo. Colonel Solo sought to honor his fallen brother by bestowing Anakin's name on an Imperial II-class Star Destroyer, despite objections from his family. Upon its completion, the Anakin Solo served as the flagship for the Guard."}, {"tag": "p", "text": "As Jacen immersed himself ever further into the allure of the dark side, he began using the Guard and the Anakin Solo with ruthless efficiency to either arrest or kill his enemies. He used the weapons systems on his Star Destroyer in an attempt to destroy the Millennium Falcon and sacrifice his parents' lives in order to pass his final test as a Sith. Although Jacen turned to darkness in order to save the Galaxy from future catastrophes by enforcing order and security, Anakin's death was a factor that sobered his cheery childhood personality. This internal shift, which made him very rational, had a psychological effect that allowed Jacen to become more susceptible to the allure of the dark side. Upon meeting a Sith Lord, Lumiya, Jacen became fully convinced that the Galaxy would never have an enduring era of peace and stability unless he embraced his destiny as a Sith."}, {"tag": "p", "text": "Upon becoming a full-fledged Sith himself, Jacen adopted the name Darth Caedus and took further advantage of his brother's memory. As the Dark Lord of the Sith, Caedus required an apprentice to stand at his side in accordance with the Rule of Two. After much consideration, he settled on Tahiri Veila. Anakin's sacrifice also had a profound effect on the girl he loved, and she never fully recovered from her grief over the loss of her childhood friend. Knowing this, Caedus took advantage of Veila's feelings and used her emotional attachment to bring her over to the dark side. Through a rare Force technique, Caedus enabled Veila to flow-walk into the past so that she could relive her final moments with Anakin just prior to his death. At Caedus' encouragement, Veila pushed her younger self into Anakin, so she gave him the kiss she had denied him."}, {"tag": "p", "text": "Even though Caedus wanted Veila to stop clinging to the memory of a dead boy that she could never have, he continued to use her dependency on him for flow-walking to see Anakin to facilitate her conversion to the Sith. In exchange for these glimpses at Anakin, Veila acted as the Sith Lord's spy emissary, and assassin, eventually becoming Caedus' apprentice as a Sith. But to further ensure Veila's loyalty, Caedus neglected to reveal that the flow-walk ability only allowed users to \"witness\" the past without actually altering events. He knew that Veila wanted to eventually use the technique to prevent Anakin's death, but he also hoped that she would stop caring about Anakin after fully embracing the dark side."}, {"tag": "p", "text": "By that time Caedus grew to despise the memory of his dead brother, whom he dismissed as a brat, and even resented the fact that he named his Star Destroyer after Anakin. Caedus' use of his brother's legacy came to an end with his death during the Battle of Shedu Maad, followed by the dissolution of the Galactic Alliance Guard, the capture of the Anakin Solo and the conclusion of the Second Galactic Civil War. Veila turned her back on Caedus and the Sith shortly after discovering that the flow-walk ability was incapable of altering the past."}, {"tag": "h4", "text": "Lake of Apparitions"}, {"tag": "p", "text": "In 43.5 ABY Luke and Ben Skywalker journeyed to the Maw in order to find out information regarding Jacen's fall to the dark side. The Skywalkers discovered Sinkhole Station, a miniature version of Centerpoint Station. The inhabitants of this station were called the Mind Walkers. With assistance from the Mind Walkers, Luke and Ben entered a realm of the Force known as beyond shadows. While in a region known as the Lake of Apparitions, Anakin appeared to the Skywalkers."}, {"tag": "p", "text": "Ben and Luke assured Anakin that no Jedi since his death had been as strong as him. Anakin's response was to tell Ben to not let other Jedi grow dependent on him and that Jedi must have faith in themselves. He advised his uncle and cousin not to continue through the lake."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like his namesake, Anakin was prodigiously talented in the Force, a gifted pilot, and a skilled mechanic. He was regarded as a genius in his childhood; Jaina once kidded Jacen by commenting, \"I knew I had one brother who was a genius.\""}, {"tag": "p", "text": "From a young age, Anakin's primary interest was in intellectual activities, especially solving mind-bending puzzles, a proclivity which later aided him in many adventures. He excelled in areas of mathematics and engineering, possessing the ability to make anything mechanical work regardless of whether he understood the device's purpose or its components."}, {"tag": "p", "text": "For the pragmatic Anakin, using the Force was \"like breathing for him.\" Consequently, he came to view the Force as a mere tool, a weapon to wield with responsibility. Through Mara's instruction, he began to see it as more than a tool, realizing what a crutch it had become. During his rescue mission on Yavin 4, he concluded that the Force was a manifestation of something greater: an overarching, fundamental truth. Anakin was likened to his father in many ways (though Anakin was far more quiet and reserved): their reckless confidence, their fearlessness and courage, their wry wit and sardonic humor, and their use of the Force had Han possessed the ability to. Though Anakin was introspective, he was also headstrong; fortunately, his instincts and intuitions turned out to be correct most of the time."}, {"tag": "p", "text": "The Yuuzhan Vong War and the death of Chewbacca caused Anakin to take his responsibilities as seriously as he took everything else in life. An adherent to the Living Force, he had a tendency to live for the moment and to be ruled by a stubborn yet compassionate unwillingness to sacrifice others. His belief in his inability to save others made him prone to second-guessing himself and questioning his actions, although once he had made up his mind, he rarely changed it. Anakin's desire to live up to Chewbacca's sacrifice, coupled with his earnestness to save the galaxy—alone, if necessary, motivated him to place himself—sometimes rashly—in the forefront of action."}, {"tag": "p", "text": "His charismatic leadership laid in, among other qualities, his intelligence and resourcefulness. Respected by both militant Jedi vigilantes and those in favor of a more conservative stance, Anakin was expected to take the place of his uncle, whom he had idolized as an adolescent, as the head of the New Jedi Order. But his life was cut short on Myrkr when he sacrificed himself for the sake of his friends and family, as well as for the mission."}, {"tag": "h3", "text": "Relationships"}, {"tag": "h4", "text": "Tahiri Veila"}, {"tag": "p", "text": "Since they met at the Jedi Academy as children, Anakin and Tahiri were best friends whose bond of friendship was strengthened each time after every adventure they went through together. Though he was initially but briefly annoyed with someone who seemed almost entirely different from him, the two complemented each other and reached a level of communication beyond language. During the Yuuzhan Vong War, they developed romantic feelings for each other—though neither of them openly acted upon it until they kissed for the first time on board an airless locker on the Yag'Dhul station. Anakin died before they could even think about planning a future together. This love would continue even after Anakin was killed. When his spirit appeared in the Maw to Luke and Ben Skywalker some 17 years after his death, he asked them to tell Tahiri he still loved her. Han and Leia Solo later did inform Tahiri of this before her trial."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Anakin Solo was born with an incredibly powerful connection to the Force, a power that he inherited through blood from his grandfather and namesake, the Jedi Anakin Skywalker. As with the others who shared in bloodline of the Chosen One, the younger Anakin shared many of the same gifts that his grandfather possessed, especially in raw Force power. Even as a child, the level of his potential was acknowledged by Jedi, Dark Jedi, and Sith alike, such as his uncle Luke Skywalker, Darth Sidious, Ikrit, and Hethrir."}, {"tag": "p", "text": "Through his natural affinity with the Force, Solo was able to utilize powerful techniques such as Battle meditation, a forgotten technique that he personally rediscovered, and Force meld, both of which he used with efficiency in the war against the Yuuzhan Vong. A capable duelist skilled in lightsaber combat, Solo was able to fight with two blades in the Jar'Kai style. Solo was also the first Jedi since Vergere to discover a way to sense the Yuuzhan Vong through the Force, an ability that he dubbed as the \"Vongsense\"."}, {"tag": "p", "text": "As a final testament to the level of the power he possessed before even reaching adulthood, Anakin Solo was able to achieve a state of Oneness with the Force at the time of his death. Regardless of his youth and inexperience, and despite his imminent death, Solo mastered a state of calm and focus while amassing enough Force energy to become a blinding pillar of pure light."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character arc"}, {"tag": "p", "text": "Anakin Solo was first mentioned as a nameless unborn baby of Leia Organa Solo in the fifth issue of the 1991–1992 comic series Star Wars: Dark Empire, which was written by Tom Veitch. The series is set in the year 10 ABY. Veitch developed Anakin as a child was inevitable if Han and Leia get married, so he became surprised when Timothy Zahn's novel The Last Command introduced Anakin's older twin siblings Jacen and Jaina. Veitch also came up with naming Anakin Solo after his grandfather so he would be the embodiment of both the light and dark aspects of the Skywalker bloodline and suffer great inner conflict in his life. These characteristics, however, were largely ignored in later Expanded Universe projects which handled Anakin's character arc."}, {"tag": "p", "text": "Not long afterward, author Kevin J. Anderson was writing The Jedi Academy Trilogy of novels, set in 11 ABY, and he was informed that he needed to build upon the events of Dark Empire. The name \"Anakin Solo\" thus first appeared in Star Wars canon in 1994's Jedi Search, the first book of Anderson's trilogy, and the character made his first appearance in the followup Dark Apprentice. Solo went on to appear in several more novels before his birth was depicted in the sixth issue of Veitch's Star Wars: Dark Empire II, released in 1995."}, {"tag": "p", "text": "During the planning stage of The New Jedi Order series, Anakin was to be the main hero who would eventually take up Luke's role as the leader of the Jedi Order. But the proposal was rejected by George Lucas, who felt that Anakin's trajectory followed his namesake's plotline in the prequel trilogy too closely; thus, creating confusion. As a result, the roles of Anakin and Jacen were reversed, which included the death later scheduled in The New Jedi Order: Star by Star. Troy Denning, who wrote Anakin Solo's death in Star by Star, recalled in 2009 that it had taken him around seven drafts to pen the scene."}, {"tag": "p", "text": "The extent to which the character arcs of the Solo brothers were reversed is unknown. Michael A. Stackpole stated that he thought the decision to kill off Anakin was \"a waste of character\" and that his characterization of Anakin when writing the Dark Tide duology was partly due to the fact that he was \"hoping, hoping, hoping that maybe somebody would decide that [Anakin]'d get a reprieve.\" In addition, the Knightfall Trilogy, starring Danni Quee, was cancelled (even after the first book, Jedi Storm, was finished) in favor of its replacement, the Edge of Victory duology, in which Anakin features prominently."}, {"tag": "h3", "text": "Prophecies"}, {"tag": "p", "text": "There are several prophecies about Anakin that never took place because of his death. In Star Wars: Dark Empire II, Luke had a vision of Anakin and his siblings leading the Jedi Order. Likewise, in The New Jedi Order: Edge of Victory I: Conquest, Ikrit told Anakin that there would be something great born in him and Tahiri. Tom Veitch has stated that his original plan for Anakin's story arc was to follow him on his inner struggles to control the light and dark sides until the former eventually won, yet subsequent Expanded Universes writers opted to constantly focus on Anakin's light side and kill him off heroically. While Veitch doesn't have anything against their decisions, he felt a certain amount of regret that many stories focusing on Anakin's inner conflict were never told."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}