{"url": "Imperial_Weapon_Research_Facility", "categories": ["Category:Legends articles", "Category:Gungan Swamp locations", "Category:Imperial military bases", "Category:Imperial research facilities"], "nodes": [{"tag": "h1", "text": "Imperial Weapon Research Facility"}, {"tag": "p", "text": "The Imperial Weapon Research Facility, also known as the Weapon Development Facility, was an Imperial  military research facility on the planet Naboo during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Imperial Weapon Research Facility was built by the Empire soon after the Battle of Yavin. It was a top secret and restricted area. It was defended by a garrison of stormtroopers and several AT-STs. A commoner from Kaadara once discovered the Facility while getting lost during a trip from Theed to Moenia. The Naboo noble Roric V`lia and his employee Vaik'anna Silverlight had activities related to the Facility."}, {"tag": "p", "text": "Circa 1 ABY, the Weapon Development Facility had become a contested hotspot in the Galactic Civil War and Imperial and Rebel forces fought several times for the control of the facility. Rebel forces managed to capture the facility several times but Imperial forces had always taken it back."}, {"tag": "p", "text": "The superlaser equipped on the Star Destroyer Conqueror was developed at the research facility. Located in the facility were testing bays and fabrication chambers, along with a main control room with computer consoles containing data on the Star Destroyer. It was guarded by the Sith Acolyte Namman Cha at the time. Around 1 ABY, it was raided by the Rebel Alliance's Renegade Squadron, who defeated Cha and gained sensitive information on the Conqueror, which they were later able to use to locate and destroy the vessel."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial Weapon Research Facility appeared in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. With the release of the \"Publish 1\" update on August 3, 2003, the Imperial Weapon Research Facility was turned into a \"Factional NPC Base\". Groups of Rebel players could attack Imperial NPCs and achieve several objectives to take control of the base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}