{"url": "Imperial_callsigns", "categories": ["Category:Legends articles", "Category:Call signs"], "nodes": [{"tag": "h1", "text": "Imperial callsigns"}, {"tag": "p", "text": "Imperial Callsigns were designations used to\naddress certain starships in the Imperial Navy. These call signs were typically names to induce fear, or directly related to the Tionese alphabet."}, {"tag": "h2", "text": "Usage"}, {"tag": "h3", "text": "Capital ships"}, {"tag": "p", "text": "Many Capital Ships in the Imperial Navy had names associated with conquest or subjugation. Examples of this fact are Lord Vader's Super-class Star Destroyer the Executor, Imperial-class Star Destroyer Devastator responsible for the capture of Tantive IV, and Imperial-class Star Destroyer Tyrant a picket ship among Death Squadron at the Battle of Hoth. While this practice was popular among flagships, it was not the standard across the entire Navy."}, {"tag": "h3", "text": "Starfighters"}, {"tag": "p", "text": "Imperial starfighters had a more complex naming system than that of larger vessels. Standard starfighter Flight groups typically received designations derived from the Tionese alphabet, often depending on class of mission role. This practice however was not standard among specialized squadrons such as Darth Vader's Black Squadron."}, {"tag": "h4", "text": "Interceptors"}, {"tag": "p", "text": "Space Superiority fighters typically held designations Alpha, Gamma, and Delta. However if the necessities of battle dictated, letters Zeta, Eta, Theta, and Iota were used. At times Interceptor starcraft shared letter Beta with the bomber role brethren."}, {"tag": "h4", "text": "Bombers"}, {"tag": "p", "text": "Imperial TIE/sa bombers were often designated as Flight group Beta. However due to mission requirements bombing craft also shared designations Alpha, Gamma, and Delta among others of their interceptor brethren, this was typically the result of the necessities of warfare, or the precedent of bombing craft entering the system."}, {"tag": "h4", "text": "Assault fighters"}, {"tag": "p", "text": "Assault Craft such as the Assault Gunboat held callsigns like Tau, Mu, and Nu. Occasionally Gunboat Pilots received the designation Rho, Psi, and Epsilon. While not strictly an assault craft, Missile Boats also received the designations Tau and Mu."}, {"tag": "h3", "text": "Transports"}, {"tag": "p", "text": "Imperial Transports such as the Delta-class DX-9 stormtrooper transport, and the Gamma-class ATR-6 assault transport often received letters Epsilon, Upsilon, Sigma, Omicron, and Omega. Imperial Lambda-class shuttles often received Lambda as a logical designation, but also shared Epsilon, Upsilon, and Sigma with other transports. Transports were not exclusively named from the Tionese alphabet; shuttles Tyderium, Toten, and G'nabgib, along with transports Zack 1, Soyri, and Runner were among those with non-alphabetical names."}, {"tag": "h3", "text": "Utility and Cargo Craft"}, {"tag": "p", "text": "Imperial Naval logistics required entire fleets of utility craft and cargo containers. These craft too received various designations, many of which were derived from the alternate alphabet. Cargo containers such as the Class-A cargo container received letters such as Pi, Chi, and Xi among non-alphabetical names like THX-1138. Starcraft such as Cargo Ferries and Heavy Lifters were titled a mix of alphabetical names like Upsilon, and Sigma, along with names like Mule 1."}, {"tag": "h2", "text": "Notable anomalies"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}