{"url": "Imperial_commando/Legends", "categories": ["Category:Legends articles", "Category:Imperial military specializations", "Category:Imperial Special Forces units"], "nodes": [{"tag": "h1", "text": "Imperial commando"}, {"tag": "p", "text": "Imperial commandos were a choice group of soldiers selected from the Imperial Officer Corps."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "These men consisted only of the most dedicated, excelled, and cunning officers drafted from the Corps, which was a prestigious group in itself, including the earlier Clone commandos also known as Republic Commandos. Unlike other officers, the Imperial commandos had a special knack for combat which, combined with their high status, made them the ultra-elite of the Galactic Empire's ground troops. Their appearance was very similar to that of regular Imperial Army troopers, and the Imperial commandos were likely a specialized branch of the Army troopers. Imperial commandos also wore helmets similar to AT-ST pilots."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Most Imperial commandos harbored a strong dislike of melee weapons, believing them to be the arms of their \"lessers.\" Instead, they carried longer-range blaster rifles, from the standard BlasTech E-11 blaster rifle to the more refined Imperial sonic blaster, V-6d mortar launcher, and Imperial repeating rifle. They also carried emergency flares, ammo, concussion grenades, blank coded thermal detonators, and a comlink. They were also known to make use of Proton rifles as part of their armaments. Rigorous physical training gave them the ability to move quickly over long distances, deal more damage with their weapons, and pilot various vehicles."}, {"tag": "p", "text": "They were considered a special forces unit whose mission would usually involve infiltration and sabotage of enemy positions. As such, they were well known for bringing unrest to an enemy system or for suppressing rebellious actions on Imperial-controlled worlds."}, {"tag": "h2", "text": "Uniform and armor"}, {"tag": "p", "text": "The Imperial commando wore a helmet that was shaped similarly to that of an Imperial Army Engineers. The helmet was open-faced with a chinstrap. Goggles were attached by a strap to the back of the helmet, but these were rarely used when the commando was on foot."}, {"tag": "p", "text": "The commando wore black boots with a gray or black jumpsuit that held pockets. Harnesses around his shoulders and waist were connected to a strap around his groin. He had knee pads beneath his jumpsuit for comfort when kneeling. Even though they usually wore the gray uniform, some like the ones stationed at Gall wore a green jumpsuit, and a matching helmet."}, {"tag": "p", "text": "Because the commando's armor was designed to allow unrestricted movement, he was only armored on his upper body and head. He wore a light chest armor plate under his jumpsuit. He also wore limited shoulder armor, with the Imperial emblem on each side of the shoulder part of the jumpsuit, and long black gauntlets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Imperial Commandos first appeared as enemy sprites in Star Wars: Dark Forces. They are almost identical to the Imperial Navy troopers of the original trilogy and were perhaps designed to represent that rank in the game before being retconned in a specific rank."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}