{"url": "Imperial_escort_carrier/Legends", "categories": ["Category:Legends articles", "Category:Carrier classes", "Category:Galactic Empire starship classes"], "nodes": [{"tag": "h1", "text": "Imperial escort carrier"}, {"tag": "p", "text": "The Imperial escort carrier was a type of capital ship used exclusively by the Galactic Empire's storm commandos."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Storm commandos' Imperial escort carrier was different from the standard escort carrier of the Imperial Navy. It was a nimble, narrow-hulled ship, with a flared arrowhead bow, and three sublight thrusters mounted in a vertical row on the stern. Its most prominent weapons were two single-barreled cannon mounted turrets on the dorsal centerline, with a wide field of fire ahead, above, and to either flank. There were also two double-barreled weapons mountings on the ventral centerline, both fore of the hangar bay, while two small turreted cannons were mounted on the very tip of the bow. They were slower than T-65B X-wing starfighters."}, {"tag": "p", "text": "Like normal carriers, it was capable of deploying TIE starfighters into battle, including the advanced TIE Hunter, and it had a large hangar opening on each side of the hull, but it was also capable of engaging in combat on its own account. Ships of this type were used to attack medium-sized craft and transports of the Rebel Alliance, boarding and seizing the Rebel starships and their crew."}, {"tag": "p", "text": "As the storm commandos were regarded as elite infantry, these ships were capable of deploying troops for planetary assault. The warship carried a complement of four escape pods in case of an emergency, with their designs being reminiscent of the class-6 escape pod."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the Battle of Hoth in 3 ABY, storm commando officer Captain Sarkli flew a modified escort carrier with an improved hyperdrive, in which he abducted scientists during the Raid on Bakura. He later fled to Geonosis, where Wedge Antilles shot his craft down, starting the Second Battle of Geonosis of the Galactic Civil War. Sarkli's ship had personnel who wore stormtrooper armor. During the latter event, he was also accompanied by two other Imperial escort carriers, which eventually ended up destroyed by Antilles via the Void-7 seismic charges included in his retrieved Delta-7 Aethersprite-class light interceptor."}, {"tag": "p", "text": "Imperial escort carriers were known to have guarded the Fondor construction yards, and fought during the Battle of Fondor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Concept art for the Imperial escort carrier depicts a brighter vehicle, with T-shaped wings that tie it more to the TIE line. It is also more lightly armed, more streamlined, and lacks a hangar bay. The original concept art emphasizes the speed of the craft and atmospheric capability, suggesting the original design could have been a transport rather than a capital ship."}, {"tag": "p", "text": "The Imperial escort carriers being exclusive to the storm commandos is ambiguous, as Star Wars: Rogue Squadron III: Rebel Strike depicts soldiers in stormtrooper armor as part of Captain Sarkli's ship's complement. These troops may have simply been storm commandos in stormtrooper armor, or the Imperial escort carriers may have carried a unit of Storm Commandos, as well as standard Stormtrooper elements."}, {"tag": "p", "text": "The Imperial escort carrier bears a name very similar to that of the escort carrier featured in Star Wars: TIE Fighter and its sequels. Wedge Antilles's unfamiliarity with the name used by General Madine for the starship suggests that neither the Storm Commando vessel seen in Rebel Strike nor the standard Imperial Navy starfighter transport seen in TIE Fighter were generally deployed (at least in operations Antilles might have been familiar with) prior to the Raid on Bakura."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}