{"url": "Imperial_dockyard", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:First Order space stations", "Category:Galactic Empire space station classes", "Category:New Republic space stations"], "nodes": [{"tag": "h1", "text": "Imperial dockyard"}, {"tag": "p", "text": "Imperial dockyards were a class of space stations used by the Galactic Empire's Imperial Navy during the Imperial Era, servicing and attending to its many starships. The Fondor Shipyards consisted of at least nineteen such space stations including Fondor Station, while other such dockyards was the Var-Shaa dockyard and the Remitik System munitions depot."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Physically similarly resembling the Golan M3185 due to their wheel-shaped designs, the dockyard could be separated into three smaller sections, operating nearby, or two section with one larger than the other. These sections each had one of three extensions that allowed Star Destroyers to be moored alongside them and then put in place with the use of several clamps at the base of the extension on each side. The extensions also had four hangar-like openings with several internal systems inside, as well as landing pads for shuttles."}, {"tag": "p", "text": "On the dorsal surface where the extensions connected to the rest of the station, a command tower, similar to those on Imperial Star Destroyers albeit with a lack of a tractor beam targeting array or communications tower and a lack of the two deflector shield generator domes. The command tower faced outward, overlooking its respective extension. Additionally on the dorsal surface of the three extensions were a total of thirty double-barrelled turbolaser turrets, that were equally dispersed. The turrets were grouped into groups of two, and each extension had six turrets per side. A further eighteen turbolaser turrets were situated in the inside of the circular hull, with six per section. Those six were further divided into three groups of two turbolasers, each located in the indentations. Also on the surface of the extensions were various landing pads."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Battle of Fondor"}, {"tag": "p", "text": "The Imperial dockyards were in use by the Galactic Empire by the time shortly after the Battle of Endor in 4 ABY during the Galactic Civil War against the Rebel Alliance. At least nineteen dockyards were stationed above the Imperial world of Fondor, and were known as the Fondor Shipyards. The shipyards, despite being Imperial installations, were independently operated. One dockyard that was part of the Fondor Shipyards was Fondor Station, which succumbed to an attack by the Rebel Alliance during the Battle of Fondor shortly after Endor. During the battle, an Alliance Fleet contingent consisting of a modified MC80 Liberty Type Heavy Star Cruiser, at least three CR90 corvettes, and many starfighters attacked the station, while the ISD Dauntless was docked to the station shortly after getting control of climate disruption arrays."}, {"tag": "p", "text": "After repelling Alliance troop transports, corvettes, and starfighters, members of Imperial Inferno Squad board the Star Cruiser and disabled its heavy ion cannons which were crippling the station. Afterwards, Inferno Squad fired on one of the control towers of Fondor Station, destroying it. Subsequently, Inferno Squad destroyed the docking arm control center, and then the docking arms themselves. Their actions freed the Dauntless, allowing it to engage and heavily cripple the Alliance Star Cruiser."}, {"tag": "h4", "text": "Battle of Var-Shaa"}, {"tag": "p", "text": "By the formation of the New Republic in the same year, a New Republic Defense Fleet force, consisting of an MC75 Star Cruiser, an MC80 Liberty Type Heavy Star Cruiser, an MC95E Star Cruiser, an EF76 Nebulon-B escort frigate, two CR90 corvettes, two GR-75 medium transports, T-65B X-wing starfighters, RZ-1 A-wing interceptors, and BTL-A4 Y-wing assault starfighter/bombers, launched a strike against the Var-Shaa dockyard located in orbit above Var-Shaa."}, {"tag": "p", "text": "In response to the attack, the ISD Overseer defended the dockyard, although eventually while several squadrons, including Titan Squadron, launched an attack run on the MC75 Star Cruiser, the dockyard was already lost as it exploded in a fiery inferno, with an Imperial I-class Star Destroyer that was docked also succumbing to many explosions. As a result, Commander Terisa Kerrill ordered all Imperial craft to return to the Overseer in preparation to jump into hyperspace."}, {"tag": "h4", "text": "Remitik System and Fondor Shipyards"}, {"tag": "p", "text": "An Imperial dockyard served as a munitions depot in the Remitik system, and came under attack by the New Republic. Eventually, the Fondor Shipyards were again attacked by the New Republic shortly before the Battle of Jakku, and had successfully taken control of the shipyards."}, {"tag": "h3", "text": "First Order/Resistance War"}, {"tag": "p", "text": "During the First Order/Resistance War, the First Order seized control of the shipyards above Fondor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}