{"url": "Imperial_extermination_ship", "categories": ["Category:Legends articles", "Category:Capital ship classes", "Category:Galactic Empire starship classes", "Category:Imperial extermination ships"], "nodes": [{"tag": "h1", "text": "Imperial extermination ship"}, {"tag": "p", "text": "The Imperial extermination ship was a type of dungeon ship used by the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The class was designed with two massive blocks and a connecting superstructure situated between them. A command center was located on a forward-facing spire, while four great engines flanked each of the blocks."}, {"tag": "p", "text": "The ship's lower thrusters pointed downwards and were used during atmospheric operations. The class was capable of planetary landing.\nThe fusion reactors that powered the ship were used to dispose of the corpses of the peoples massacred inside each vessel."}, {"tag": "p", "text": "Captives were held in large pens, with guard posts overhead. From there, people were either led to experimentation chambers for gruesome tests or to ionization chambers that broke them down into their constituent parts. The survivors worked as slaves, carrying the dead into the fusion reactors."}, {"tag": "p", "text": "The extermination ships had a weak spot near the connecting area of the engines to the rest of the ship. A hit from an ion cannon could penetrate there and overload the engines, forcing the ship to land."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The xenophobic Grand Admiral Danetta Pitta used three such vessels, the Angrix, the Apocahk and the Azgoghk to exterminate species throughout the Outer Rim Territories, during the Galactic Empire's rule over the galaxy."}, {"tag": "p", "text": "Boba Fett penetrated the still-active Azgoghk years after the Battle of Endor and freed the prisoners, killing both Admiral Mir Tork and the sadistic doctor Leonis Murthé on contract for a surviving Gulmarid, Slique Brighteyes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}