{"url": "Imperial_family", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Culture of Naboo", "Category:Families", "Category:Force-sensitive bloodlines", "Category:Palpatine family"], "nodes": [{"tag": "h1", "text": "Imperial family"}, {"tag": "p", "text": "The Imperial family was the first dynasty of the Galactic Empire under\nEmperor Palpatine."}, {"tag": "p", "text": "Originally known as House Palpatine, the family was an ancient noble Human family from the planet Naboo. House Palpatine was known throughout its history on Naboo as a conservative and isolationist family, though it was not as prominent or wealthy as some of the other Royal Houses of Naboo."}, {"tag": "p", "text": "In 65 BBY, House Palpatine was rendered almost extinct when the eldest son of Cosinga Palpatine, who insisted on being known simply as Palpatine, exterminated all of his immediate family, including his father. Palpatine was initiated into the Order of the Sith Lords by Darth Plagueis as Darth Sidious, and later came to rule the galaxy as Emperor of the Galactic Empire for more than two decades. During his rule, many claimants contended blood relation to House Palpatine, and similarly, pretenders sought to legitimize their bid for the throne after the Emperor's fall. The House's color was scarlet, prominently featured on the family crest, which depicted a veermok, an aiwha and a zalaaca."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "House Palpatine"}, {"tag": "p", "text": "According to Cosinga, House Palpatine was one of the six impenetrable gates that held back chaos in Naboo mythology. The patronym may also have derived from an ancient name of state, or the name of a region on Naboo. The House's rigid conservatism had deep roots in the planet's history. Around 135 BBY, again according to Cosinga, his grandfather discovered that Houses Veruna and Tapalo were behind the war with the Gungans. Thus he challenged Bon Tapalo's father to a duel of honor in Convergence, House Palpatine's private resort in the Lake Country area. Palpatine succumbed to his wounds at Tapalo's blade."}, {"tag": "p", "text": "In 82 BBY, Cosinga Palpatine's wife gave birth to their eldest son, Palpatine, who later insisted on being known only by the cognomen in order to spite his father and the rest of the family. The couple also had at least two other sons and two daughters."}, {"tag": "p", "text": "By 65 BBY, Cosinga Palpatine was allied with Naboo's conservative party in opposition to the election of Bon Tapalo as the people's next king. If elected, Tapalo intended to integrate Naboo into the Galactic Republic as a full member state, an action which, Cosinga and his political allies believed, would be to the planet's disadvantage. The conservatives sought to preserve Naboo's independence, but were also concerned that their homeworld's market would be ruined if Naboo joined the greater galaxy, thus exposing it to commercial entities that wanted to exploit its natural plasma resources."}, {"tag": "p", "text": "Since the family patriarch was an opponent of Bon Tapalo, House Palpatine was publicly noted for its allegiance to the conservative faction. In secret, however, the House was divided by the political disagreements between the elder Palpatine and his eldest son, the seventeen-year-old Palpatine. Though he was heir apparent to the House's wealth and properties due to his status as firstborn son, the younger Palpatine was bitter and resentful over his family's lack of prestige in comparison to their royal peers. Despite the pride he felt for his ancestry, Palpatine hated his entire family; his father, for not being intelligent enough to place House Palpatine in a position of true entitlement; his mother, for her subservient nature and lack of opinions; and his younger siblings, for treating him like an interloper."}, {"tag": "p", "text": "Furthermore, Palpatine believed that his father's actions were motivated more by greed than concern for the future of Naboo. Tapalo's chief rival for the monarchy was also the brother of Cosinga Palpatine's mistress, and thus the son suspected that the father was taking advantage of the election in order to attain a position of power in the government. As far as Palpatine was concerned, his father did not deserve power if his only means for obtaining it was through an affair with his ally's sister."}, {"tag": "p", "text": "The elder and younger Palpatine were never able to fully reconcile as father and son. Although they both shared a penchant for violence and fast landspeeders, their differences far outweighed the few traits they had in common. Cosinga Palpatine was frequently forced to intervene on his heir's behalf due to the boy's habit for causing mischief, using both his wealth and aristocratic position to cover up a significant amount of petty crimes and misdemeanors committed, insufferably, by his own son. At one point, Palpatine unintentionally killed two pedestrians in a landspeeder accident. His father forbade him from ever driving again, but the son's persistent defiance eventually wore the elder Palpatine down. Cosinga Palpatine later purchased a prototype patrol-grade Flash as a present for his son, which Palpatine interpreted as a bribe. But as a result of his extreme enthusiasm for fast vehicles, the younger Palpatine accepted the bribe and went on to become a successful competitive racer."}, {"tag": "h4", "text": "Massacre"}, {"tag": "p", "text": "While attending the Legislative Youth Program as a student, Palpatine was discovered by Darth Plagueis, a Muun Sith Lord who was publicly known as Hego Damask, the magister of Damask Holdings. Plagueis used his facade to gain Palpatine's confidence, and learned of his ambitions and insecurities, as well as the animosity he felt against his entire family. When Cosinga Palpatine attempted to sever his son from Plagueis's influence, the enraged adolescent desperately turned to his mentor for advice. Plagueis urged Palpatine to do anything necessary to achieve emancipation. The young noble took the suggestion as implicit permission to physically rebel against his father—an opportunity he took advantage of when Cosinga surprised him by bringing the entire family to Hanna City on Chandrila during one of Palpatine's Legislative Youth Program conferences. His father planned to move him to Chommell Minor, where he would stay with family friends Janus Greejatus and his family, and so brought with him his wife and his several other children, as well as a number of armed guards."}, {"tag": "p", "text": "Just as Palpatine was preparing to leave Chandrila and return to Naboo with his classmates aboard the Jafan III, he was faced in the central passenger cabin by a recently-hired security guard sent to retrieve him. Once out of the Jafan III and aboard the family yacht, Palpatine engaged in an argument with his father that caused their long-standing hatred for each other to burst to the surface. As they travelled through hyperspace along the Hydian Way, Cosinga revealed to his son that he had wanted to murder him since the day of his birth, and Palpatine retorted by saying that he had better do it immediately. When Cosinga took a step in his son's direction, the latter used the Force (prodigious talents for which he'd ever kept shrouded or repressed) to telekinetically smash his father against the bulkhead. Palpatine then proceeded to murder his family and the security guards using the dark side of the Force. When the deed was done, he contacted Damask and was assured by his mentor that none would ever learn of his role in the slaughter of House Palpatine. Damask arranged for all evidence of the crime to be purged, and for Palpatine to return to Chandrila. Shortly afterward, Damask revealed his true identity as Darth Plagueis to Palpatine, who subsequently joined the Order of the Sith Lords as Plagueis' apprentice—neophyte to powerful traditions passed down from a long line of Dark Lords of the Sith—accepting his new Sith name, Darth Sidious."}, {"tag": "h3", "text": "Darth Sidious: the last Palpatine"}, {"tag": "p", "text": "As the sole remaining member of his House, Palpatine inherited his family's fortune and private properties. He later sold his father's estate in the Lake Country before relocating to Coruscant as senator of Naboo. Although Palpatine favored the colors black and blue for his attire, his political colleagues in the Galactic Senate noted that his 500 Republica apartment was mainly arrayed in scarlet hues, to which Palpatine credited his family crest as a source of inspiration."}, {"tag": "p", "text": "Palpatine murdered his Sith Master on the eve of his election as Supreme Chancellor of the Galactic Republic in 32 BBY. He then carried out the Sith Grand Plan according to his own lights, as he understood and wished for it to be, over the next decade. Palpatine's prodigious planning and effort culminated in the creation of the clone army and the outbreak of a galactic civil war, both of which proved essential in manipulating the Senate so that it vested him with dictatorial powers."}, {"tag": "p", "text": "In the early years of his chancellorship, Palpatine secretly commissioned experiments on the spontaneous generation of life. Utilizing a Bordali woman named Niobi as a \"test subject,\" those initially unpredictable experiments ended up producing a three-eyed mutant that was christened Trioculus. However, the mother and child failed to live up to Palpatine's expectations, and were spirited away by Sarcev Quest, one of Palpatine's early political allies, to the Spice Mines of Kessel."}, {"tag": "p", "text": "Eventually, another three-eyed child, Triclops, was born. Rumor had it that his mother was Palpatine's Umbaran aide Sly Moore, who had impregnated herself using DNA from an undisclosed source. Regardless of the veracity of that report, Triclops was regarded as the true son of Palpatine, both by himself and the few high-ranking officials who were aware of his existence."}, {"tag": "p", "text": "Before his election as Chancellor, Palpatine made certain to obscure his own origins in order to prevent anyone from learning of his shady past, particularly his association with controversial figures such as Hego Damask, Bon Tapalo, and Ars Veruna, and to prevent anyone from tracing a connection between his very public persona and Darth Sidious. By the time of his final term, no family record of Palpatine existed. House Palpatine was, therefore, lost without a trace from the historical record as a result of the actions of its most prominent scion."}, {"tag": "h3", "text": "The Imperial family"}, {"tag": "p", "text": "In 19 BBY, Palpatine brought about the culmination of the Grand Plan by declaring himself Emperor of a new galactic government, the Galactic Empire. Thus, absolute power over the galaxy was placed in Palpatine's hands; the kind that attracted ambitious individuals who sought to share in that power and influence. The two brothers Silas and Orman Tagge contemplated the political and financial advantages of uniting their family with the Emperor's clan, specifically by positioning their younger sister, Domina Tagge, into the Imperial family via marriage. At the zenith of Palpatine's reign in 1 ABY, it was believed that he and the deceased Volpau were distant cousins by blood; a plaque accompanying Volpau's remains to Coruscant for ritual incineration aboard the freighter Mingula identified him as Palpatine's third cousin."}, {"tag": "p", "text": "In the aftermath of Emperor Palpatine's demise at the Battle of Endor in 4 ABY, several claimants who made their bid for the vacant Imperial throne did so while claiming to be blood-related to the deceased monarch. Roganda Ismaren tried to rule the Empire through her offspring, Irek Ismaren, whom she declared to be the late Emperor's secret son and true heir. However, an investigation into the matter revealed that the true father of her son was actually Sarcev Quest. For decades, there also had existed rumors that Grand Vizier Sate Pestage was a bastard son sired by Palpatine. However, not only was Pestage older than Palpatine, he was also known to have a large extended family of his own."}, {"tag": "p", "text": "Although rumors of Triclops's existence, as well as his connection to Emperor Palpatine, circulated amongst the Empire's leading government officials, the Moffs ultimately deemed him insane and unfit to succeed to the throne. Instead, they gave their support to Trioculus, whom they falsely identified as Palpatine's illegitimate heir. Triclops, rejected by the Empire, eventually spawned his own son with a \"Jedi Princess\" named Kendalina. As the son of the Emperor's alleged son, Ken was essentially Palpatine's alleged grandson."}, {"tag": "p", "text": "Another claimant to the throne was Ederlathh Pallopides, a remote great-niece of Emperor Palpatine. In an attempt to end the Galactic Civil War, Admiral Betl Oxtroe of the Imperial Navy sought to work with the New Republic in reorganizing the Galactic Empire into a constitutional monarchy. Under this reformed regime, the Imperial throne would effectively be reduced to a powerless, symbolic position. Pallopides, too young to rule at eleven years old, was meant to serve as a mere figurehead while the New Republic Provisional Council ruled as the de facto head of government."}, {"tag": "p", "text": "Ultimately, none of Palpatine's alleged descendants or relatives succeeded him to the throne in an official capacity. At some point after 44 ABY, the New Empire—a state formed from the last remnants of the first Galactic Empire—was ruled by a new hereditary monarchy: the bloodline of Emperor Jagged Fel. Fel's dynasty continued to exist by 138 ABY, with the Empire under the rule of his direct descendant, Empress Marasiah Fel."}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Before the release of Darth Plagueis, it was unknown whether Palpatine was a family name or a name of state adopted once he entered into politics. The book about Palpatine's apprenticeship under Plagueis, however, introduces House Palpatine, with its partiarch Cosinga Palpatine, thus establishing Palpatine as a surname, although Emperor Palpatine remains mononymous."}, {"tag": "p", "text": "See the \"Name\" section of the Palpatine article for more details."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}