{"url": "Imperial_gunner", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Soldier stubs", "Category:Imperial military specializations"], "nodes": [{"tag": "h1", "text": "Imperial gunner"}, {"tag": "p", "text": "Imperial gunners/engineers were members of the Imperial Navy's Starfighter Corps (acting as a special sub-unit of the corps) who manned the various weapons and engine rooms of the Empire's capital ships, military bases, and both Death Stars.The most advanced were involved in the firing and maintainence of the reactors within the first and second death star."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Imperial gunners were recruits from the Imperial Navy's piloting program that were either still in training or washed out. Even though they did not make it into becoming pilots, Imperial gunners nonetheless possessed keen eyes, superior reflexes, and a rapport with specialized equipment, and as such they were tasked to use their skills with weapons to handle the powerful turbolasers and ion cannons of Imperial vessels, such as Star Destroyers and World Devastators. They were trained in repairing and handling engine equipment, light laser cannons, light, medium and heavy turbolasers, as well as ion cannons, missile launchers and tractor beams. As such, their duties included tracking targets during combat, firing at targets, reloading ammunition, and preventing overloads in the weapons systems."}, {"tag": "p", "text": "On both Death Stars, the gunners, often called Death Star gunners, had the additional job of maintaining a careful balance of energy in the battle station's superlaser, avoiding the risk of either an overload of the titanic energies or otherwise it phase imbalances that would result huge internal explosions. Such a job was relegated to those gunners who were of both the highest-rank and the best-trained of their peers. The gunners were trained as a group, and also spent months calibrating weapons and running through countless scenario engagements with battle plans devised by Tarkin's staff as well as simulated fleet battles against the Rebels in the thousands. As a consequence of the drills, alongside their computer-linked helmets, the gunners could aim, power-up, and fire the superlaser with synchronized precision. 168 Imperial gunners were necessary to man the superlaser's eight firing stations at the Superlaser Fire Control for optimum performance, with a minimum of 14 gunners manning each of the controls of the initiator laser cannons. In addition, those Imperial gunners who worked directly in the tributary beam sections often had their backs towards the tributary beam's brilliant stream of energy, which made them unable to actually witness the beam directly despite their visors protecting them. In addition, some also had to close their eyes before the beam blazed at full intensity due to some of them not wearing computerized enclosed helmets."}, {"tag": "p", "text": "Aside from their role of manning various onboard weaponry for various vessels, they have also been trained with activating non-offensive systems such as cloaking devices and when deployed on the ground- they would be attached to provide support for other regiments."}, {"tag": "h2", "text": "Uniform"}, {"tag": "p", "text": "The Imperial gunners wore black durasteel-tipped boots, black bodysuits with a belt, and black durasteel gloves."}, {"tag": "p", "text": "The most distinguishing part of the gunners was their large black neutral-alloy helmets with a slit-like visor fitted with a polarized filter, designed to protect their eyes from the bright flashes of light from turbolaser and superlaser fire. These helmets were also specialized computer helmets that were equipped with macrobinocular viewplates, sensor arrays to assist with tracking fast-moving fighter craft, and sophisticated tracking systems for better fire control assistance, as well as being equipped with a tongue-operated comlink. These helmets, alongside their extensive drills, also resulted in their working in synchronized precision to aim, power-up, and fire the Death Stars superlasers. The helmets also had a transceiver on the left side, with two lights (the top colored blue, and the bottom colored red) and an antenna. The front and back of these helmets are adorned with the Imperial crest, more specifically the Imperial Navy variant. Their helmets remained almost exactly the same throughout the Fel Empire, while their uniforms gained more armor than before."}, {"tag": "p", "text": "Some uniform variants, particularly among Death Star gunners, also utilized helmets that had their lower faces partially exposed, which was suspected by the Rebel Alliance to be to maintain direct audio communication with fellow gunners during tributary beam firing sessions due to the shaft being filled with static charges. They also possessed protective visors, although they didn't actually have much actual use because they often had their backs towards the superlaser tributary beam when it was being fired."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Imperial gunners used a ranking system similar to that of starfighter pilots, with commissioned ranks such as Captain, Major, and Colonel. Some would be deployed in ground operations as battlefield engineers, operating on damaged vehicles and wounded soldiers, and laying down defenses."}, {"tag": "h2", "text": "Notable Imperial gunners"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In land battles in Star Wars: Battlefront II, Imperial gunners are called \"Imperial engineers\" and are armed with a shotgun, detpacks, ammo containers, bacta, and a fusion cutter. Similarly, the ending to Star Wars: TIE Fighter's Collector's CD-ROM features several Imperial gunners given the order to activate the then-recently stolen Vorknkx's cloaking device as they were about to make the jump to hyperspace, implying that the Imperial gunners did have some engineering roles as well. Their functions on both Death Stars bares similarity to the Imperial Navy troopers."}, {"tag": "p", "text": "Industrial Light & Magic modelmakers Grant McCune and Joe Johnston played Imperial gunners in A New Hope. In addition, their helmets were also nicknamed \"Beetle helmets\" during production of the film."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}