{"url": "Analysis_Rooms/Legends", "categories": ["Category:Legends articles", "Category:Coruscant rooms", "Category:Jedi Temple locations", "Category:New Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Analysis Rooms"}, {"tag": "p", "text": "The Analysis Rooms was a series of chambers located in the Jedi Temple on Coruscant. Like the Jedi Archives, operation of the Analysis Rooms was overseen by the Council of First Knowledge."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed during one of the Jedi Temple's numerous expansions, the Analysis Rooms was built to complement the Jedi Archives, using droids and high technology to identify symbols, cultural influences, and other identifiers on objects more quickly than could be done through research in the Archives. Staffed exclusively by SP-4 and JN-66 analysis droids, the chambers in the wing were sealed off to organics; the highly sensitive equipment would be affected by living operators."}, {"tag": "p", "text": "The Analysis Rooms was available to any Jedi for use, helping Jedi research for missions or identify unknown suspects in a crime. On the eve of the Clone Wars, Jedi Knight Obi-Wan Kenobi was investigating the weapon used to kill Galactic Republic Senator Padmé Amidala's would-be assassin, Zam Wesell. Turning to the Temple's analysis wing, Kenobi hoped that the droids would be able to trace the unique edges of the weapon to a known culture or planet. However, the droids rendered no results, suggesting that the dart was unique and handcrafted. Unsatisfied, Kenobi traveled to the Collective Commerce District of Galactic City where his friend Dexter Jettster ran a small diner. Consulting the Besalisk, Kenobi trusted the old prospector when he stated that the dart originated on Kamino, a world located in Wild Space. This led Kenobi to discover that all information on the planet had been deleted from the Archives, revealing why the droids in the analysis wing could not identify it."}, {"tag": "p", "text": "At the conclusion of the Clone Wars, Supreme Chancellor Palpatine was discovered to be Dark Lord of the Sith Darth Sidious. Moving to destroy the Jedi Order, the Sith Lord sent his apprentice Darth Vader to slaughter the Jedi in the Temple. With Operation: Knightfall underway, Vader led the 501st Legion of the Grand Army of the Republic into the Temple and began to secure the building. Fighting through the Jedi, the clone troopers secured the analysis wing, leaving it largely undamaged and still operational."}, {"tag": "p", "text": "After the Sith had gathered all the information needed from the wing, the rooms fell into disuse, lying vacant until the expulsion of the Galactic Empire from Coruscant. When the New Jedi Order, under the leadership of Luke Skywalker secured the Temple, they began to search the ruins for any shread of teachings from the lost Order. With Tionne Solusar working to restore the Archives, the analysis room may have been searched and restored. However, the restoration of the Temple was not to be. The structure was ruined beyond repair during the Battle of Coruscant to the Yuuzhan Vong, leaving the analysis wing a in ruins."}, {"tag": "p", "text": "Following the Yuuzhan Vong War and the retaking of Coruscant by the Galactic Alliance, Chief of State Cal Omas ordered the Reconstruction Authority to rebuild the Temple in accordance to the old blueprints salvaged from the Archives. In 43 ABY, Jedi Knight Jaina Solo accessed one of the wing's laboratories, where she dissected a cleaner droid that had been bugged by reporter Javis Tyrr in order to get footage from inside the Temple. During her investigations her Jedi mother and her father marched into the laboratory and accused her of knowing of an impending attack on the Temple by Mandalorians under the orders of Chief of State Natasi Daala. Admitting that she had been warned by Head of the Imperial Remnant Jagged Fel, she defended her actions and told her fellow Jedi to take the information to the High Council."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Located two stories below the main hall of the Jedi Archives on level Aurek 5, the analysis wing consisted of several laboratories, analysis chambers, and research booths. The sterile analysis chambers hosted state-of-the-art polysensitive graspers and multispectral readers capable of detecting symbols, odor, and skin deposits on any subject. In order to keep a completely sterile environment, the analysis chambers were completely shut of to organics; Jedi would access a booth divided by a transparisteel barrier and place subjects on a tray that would transport the subject through the barrier for study."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the pre-vis for The Force Unleashed, the template character, resembling Maris Brood, uses the Force to repel stormtroopers in this room, along with its equipment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}