{"url": "Imperial_jumptrooper", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Imperial jumptrooper"}, {"tag": "p", "text": "Imperial Jumptroopers, otherwise known as skytroopers, rocket troopers, or air assault troopers, were a variant of stormtrooper trained in airborne environments such as Bespin's Cloud City, or assigned to battlefields with treacherous terrain. They were heavily armed with various projectile launchers or heavy blaster rifles."}, {"tag": "p", "text": "They drew inspiration from the Galactic Republic's  Rocket-Jumper Elite Advance Unit, an elite soldier trained in the use of airborne assaults, or the Grand Army of the Republic's Clone Jet Troopers. Decades after the Battle of Endor, they were stilled used by Supreme Commander Gilad Pellaeon's Imperial Remnant."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The jumptroopers were an air-to-ground attack unit that was trained to engage airborne, entrenched, or otherwise inaccessible enemies. They were also trained in hit-and-run attacks in which they ambushed the enemy from above. They often provided stormtrooper units with air cover during pitched battles. They were the primary Imperial unit designated to \"keep order\" on low-gravity worlds or on atmospheric platforms such as Cloud City."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Many of these soldiers wore specialized stormtrooper armor with breathing hoses attached to the chest unit and a helmet similar to that worn by Clone Commander CC-224. Some jumptroopers wore stormtrooper armor with red decals painted on, along with black shoulder pads and what appeared to be clone trooper chest plates. Furthermore, the forehead of this helmet was shaped in a black \"v\" and had a single red line on it with two red lights by the chin. Later troopers would wear more bulky armor."}, {"tag": "p", "text": "They could use jump packs or jetpacks. Notably, they used AJP-400 Jet Packs or JT-12 Jetpacks. The Merr-Sonn had missile systems integrated in their jetpacks, that when it exploded, acted like a grenade."}, {"tag": "p", "text": "Jumptroopers employed various types of projectile launchers and heavy blaster rifles. Jumptroopers were known to wield plasma casters, long-range flamethrowers. While some used rail detonators or anti-infantry flechette canisters. Some could carry missile launchers. They were armed with plasma disruptors, which were far more powerful than standard Imperial-issued weaponry and were noted for their lack of a recoil. Thus the jumptroopers could discharge the weapon's fiery white bolts without changing their flight path or being knocked off balance while flying. This allowed them to seek a high vantage point in the air and take out their foes at a distance. Besides this, they were occasionally outfitted with rocket launchers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "These troopers were stationed on Felucia, Bespin, Kashyyyk, and the Death Star shortly before the Battle of Yavin. On Raxus Prime, jumptroopers were part of the garrison guarding the Imperial Ore Facility. They engaged in numerous battles against Galen Marek, who came by the planets on which they were stationed."}, {"tag": "p", "text": "A number of jumptroopers were stationed on the planet Kamino, where they attempted to stop the clone test subject of the deceased Starkiller. Despite their best efforts, the clone easily defeated them all and escaped the planet. Later, they fought the clone on Cato Neimoidia under command of Baron Merillion Tarko in the city of Tarko-se. He killed them all. When the Alliance to Restore the Republic attacked Kamino, the clone encountered and killed them also."}, {"tag": "p", "text": "Several were under the command of Darth Vader to capture a rebel agent aboard one of the StarSpeeder 1000s."}, {"tag": "p", "text": "Jumptroopers were later assigned to protect the Thundering Herd's All Terrain Armored Transports during the Battle of Hoth. Some of these airtroopers also accompanied Darth Vader during his attempt to capture Luke Skywalker on Bespin's Cloud City."}, {"tag": "p", "text": "In 14 ABY, rocket troopers were still in service with the Imperial Remnant. They assisted the Disciples of Ragnos, a shadowy cult that had intentions in reviving the ancient deceased Sith Marka Ragnos. They fought Jaden Korr at Taspir III. In the end, the attempt to resurrect Ragnos failed during the Battle of Korriban."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Super Star Wars: The Empire Strikes Back featured airtroopers as one of its many enemies. Their designation as air assault troopers was later revealed in Star Wars Galaxy Magazine 4."}, {"tag": "p", "text": "The Hasbro jumptrooper toy's design was based on the unit in the PS3 and Xbox 360 versions of the game, as it possessed a hose connecting the helmet to a breathing tank on the chest armor. The version in the PS2, PSP, and Wii ports looked more like a standard stormtrooper with heavy shoulder armor. The figure's bio also stated that they were equipped with rail detonators, though these do not feature in the game. The title of \"jumptrooper\" comes from Hasbro toy catalogs and does not feature a jetpack."}, {"tag": "p", "text": "The jumptrooper is called the Raxus Prime Trooper in the Star Wars Miniatures game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}