{"url": "Imperial_loader_shuttle", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Galactic Empire starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Imperial loader shuttle"}, {"tag": "p", "text": "The Imperial loader shuttle was a modified type of Sentinel-class landing craft used by the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Imperial loader was modified with special containers carrying AT-STs and other small vehicles like AT-PTs. Alternatively to carrying AT-STs, Imperial loader shuttles could also carry stormtroopers, scout troopers, and speeder bikes. The container's assault ramp was located on the side, and the landing ramp was under the cockpit. The loader shuttle would carry and drop these ground units onto the battlefield."}, {"tag": "p", "text": "The shuttle could land the containers directly on the ground as well as drop them from the air. Upon approaching its target area, the shuttle would fold its wings up, release its claws to drop the container, fold its claws back up underneath itself while getting the wings back into flight mode and fly out of the combat area. Maneuvering jets were located throughout the craft."}, {"tag": "p", "text": "The loader shuttle was armed with at least eight forward retractable laser cannons, a concussion missile launcher, a retractable ion cannon on the neck, and two repeating blasters next to the cockpit."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Loader shuttles were used in many battles, including the Empire's invasion of Yavin and the Battle of Hoth. As the Imperial loader shuttles were unable to effectively defend themselves against Rebel fighters, they were commonly escorted into battle by a pair of TIE/LN starfighters each."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Loader shuttles appear in the Star Wars: Rogue Squadron video game series. Loader shuttles are included in an alternate history scenario of the Evacuation of Yavin, where the player flies as Darth Vader and destroys Rebel transports at Yavin base."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}