{"url": "Imperial_long-range_rocket_rifle", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Portable launchers"], "nodes": [{"tag": "h1", "text": "Imperial long-range rocket rifle"}, {"tag": "p", "text": "The Imperial long-range rocket rifle was a missile launcher used by the Galactic Empire during the Galactic Civil War. The rocket rifle was outdated by the time after the Battle of Endor, but was still utilized by an Imperial storm commando during an attack on Coronet City on the planet Corellia in 4 ABY. After the storm commando was killed in battle, the Rebel agent Ten Numb used the commando's rocket rifle to destroy an Imperial All Terrain Scout Transport."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A missile launcher designed to destroy a target at a distance, the Imperial long-range rocket rifle was used by the Galactic Empire during the Galactic Civil War. Despite being nearly obsolete by the time of the Battle of Endor's aftermath, the rocket rifle was still highly effective on the battlefield and was powerful enough to take down an Imperial All Terrain Scout Transport walker in one shot. The rocket rifle was a long, black tube with a pair of barrels, one at the missile launcher's front and another at its rear. The rocket rifle also had a pair of scopes located on its center, which assisted the user in aiming the missile launcher. When fired, the rocket rifle launched a missile from its front barrel in an orange blast of light while simultaneously releasing an orange backfire from its rear barrel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 4 ABY, a few weeks after the Battle of Endor, Imperial forces under the command of General Weir launched a raid on Coronet City, the capital of the planet Corellia, to inspire fear amongst the city's populace. One of the storm commandos under Weir's command utilized an Imperial long-range rocket rifle during the raid, demolishing a cantina with the weapon at the start of the battle. However, after firing the missile, the storm commando was killed by a group of Rebel agents defending the city. One of the agents, pilot Ten Numb, took the rocket rifle from the fallen commando and used it against the advancing Imperial soldiers, destroying one of the Empire's All Terrain Scout Transports in the process. After Weir ordered his surviving troopers to pull back, Numb, with the rocket rifle strapped to his back, pursued the fleeing Imperial forces on a speeder bike."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial long-range rocket rifle's first and only appearance was in the comic X-Wing: Rogue Leader 2, written by Haden Blackman, illustrated by Tomás Giorello, and released by Dark Horse Comics in 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}