{"url": "Imperial_motif", "categories": ["Category:Real-world articles", "Category:Articles with conjectural titles", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "Imperial motif"}, {"tag": "p", "text": "The Imperial motif is a minor theatrical theme used in Star Wars: Episode IV A New Hope to represent the Galactic Empire. It is not to be confused with the much more famous \"Imperial March\" which was introduced in Star Wars: Episode V The Empire Strikes Back. Often juxtaposed with the Rebel Fanfare in A New Hope and Star Wars Rebels: Spark of Rebellion, it was written by John Williams and performed by the London Symphony Orchestra in 1977."}, {"tag": "p", "text": "It is first heard in the early scenes of A New Hope during the boarding of the Tantive IV by Imperial troops, in the soundtrack piece known as \"Imperial Attack\". The theme is based on low sinister triplets usually played on timpani, cellos, basses and trombones. It often plays as a counterpoint to the Rebel Fanfare, during both \"Imperial Attack\" and \"The Death Star\"."}, {"tag": "p", "text": "The Imperial motif is considered by some to be an early musical theme for Darth Vader, although another short motif also appears in A New Hope in reference to Vader, consisting of a quiet triplet melody on bassoon over minor key arpeggios played on cellos. This theme features in \"Imperial Attack\" prior to Princess Leia's first confrontation with Vader and during R2-D2's boarding of an escape pod. It is next heard during the scene in Obi-Wan Kenobi's home on Tatooine, sounding quietly on solo clarinet as Obi-Wan explains the history of Darth Vader to Luke Skywalker (\"Tales Of A Jedi Knight\"). It also accompanies scenes of stormtroopers in Mos Eisley (\"Imperial Cruiser Pursuit\") and on the Death Star (\"The Stormtroopers\", \"The Trash Compactor\", \"Chasm Crossfire\"). Both the Imperial motif and the Darth Vader motif were superseded by the \"Imperial March\" in the following film, The Empire Strikes Back."}, {"tag": "p", "text": "A new version of the motif is played in Star Wars Rebels: Spark of Rebellion, when the Spectres rebel cell infiltrates an Imperial Star Destroyer's with the Ghost to rescue Ezra Bridger. The Imperial motif briefly appears in Rogue One: A Star Wars Story, in a scene chronologically occurring immediately prior to the aforementioned boarding of Tantive IV, as a musical foreshadowing of A New Hope (\"Hope\"). The theme is present briefly in Solo: A Star Wars Story during the train heist, when the range troopers arrive."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}