{"url": "Imperial_military_uniforms/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Galactic Empire", "Category:Uniforms"], "nodes": [{"tag": "h1", "text": "Imperial military uniforms"}, {"tag": "p", "text": "The Galactic Empire consolidated several large organizations into the Imperial Military apparatus, and implemented a coded set of Imperial military uniforms to make discerning an individual's affiliation a simple process."}, {"tag": "p", "text": "The Imperial Service Uniforms consisted of a pair of trousers, overfold tunic, and cover, along with standard black plast-leather belt, gloves and boots. Branches received color-coded uniforms with corresponding trousers, tunic and cover, with the exclusion of COMPNOR personnel, which used black trousers and covers. These uniforms served as the core for the majority of personnel, although higher ranking Command and Line officers in each branch were given wider authority to customize their uniforms, as in the case of Ysanne Isard's red uniform. Command cylinders, as well as cover and belt discs, contained clearance, security and vital information."}, {"tag": "h2", "text": "Detailed Descriptions"}, {"tag": "h3", "text": "Army and Naval Officers"}, {"tag": "h3", "text": "Officers in the Stormtrooper Corps, Prison guards, and veteran TIE pilots"}, {"tag": "h3", "text": "Death Star Troopers/Naval Troopers (SNCOs)"}, {"tag": "h3", "text": "Imperial Gunner (Enlisted)"}, {"tag": "h3", "text": "Vehicle Command Crews (VCCs) & Senior Enlisted Crewmen (NCOs)"}, {"tag": "h3", "text": "Technicians (Warrant Officers & NCOs)"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial military's various uniforms bore similarities to the uniforms utilized by Nazi Germany during World War II. George Lucas, in a commentary for Star Wars: Episode V The Empire Strikes Back, even acknowledged that the similarities were intentional by calling them Nazis and specifically stating regarding their uniforms that \"The Nazis are basically the same costume as we used in the first film and they are designed to be very authoritarian, very empire-like.\" This was further verified by costume designer John Mollo, who mentioned that George Lucas specifically requested that the Imperials in general were to look \"efficient, totalitarian, fascist.\" They also bore a further resemblance to Prussian uniforms, specifically those worn by the German Uhlans, who predated Nazi Germany."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}