{"url": "Imperial_military_uniforms", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Articles to be merged", "Category:Incomplete lists", "Category:Galactic Empire", "Category:Uniforms"], "nodes": [{"tag": "h1", "text": "Imperial military uniforms"}, {"tag": "p", "text": "Various uniforms were worn by the officers and technicians of the martial forces of the Galactic Empire. Officers wore a gaberwool uniform consisting of a double-breasted tunic with a round collar and matching trousers, a pair of black boots, a belt and often times a kepi cap. Due to the nature of technicians' work, they wore more lightweight boilersuits, again with a belt and command cap. While free of medals and battle ribbons, officer's uniforms could feature a rank insignia plaque and up to four code cylinders in specifically designed pockets on the front of the tunic. Both uniforms could have officer's disks on both the belt buckle and command cap. They were designed as a replacement for the uniforms that had carried over from the previous government, the Galactic Republic. These designs remained in use for over two decades, but were eventually replaced when the Empire transitioned into the First Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At the conclusion of the Clone Wars, Supreme Chancellor Sheev Palpatine abolished the democratic Republic he presided over, reorganizing it into a First Galactic Empire with him as absolute ruler. As the massive Grand Army of the Republic was progressively transformed into the Imperial Military, the uniform originally created for the Republic officers remained in use during the first couple of years of Emperor Palpatine's reign. However, in or around the year 18 BBY, the scientist Galen Walton Erso and Orson Callan Krennic wore the new uniform when they were in meeting on Coruscant, the Empire's capital world. However, the uniform still wasn't in widespread use by as late as 14 BBY. Moff Wilhuff Tarkin, a decorated Imperial governor from Eriadu, made final adjustments to his personal uniform this year. When Grand Vizier Mas Amedda summoned Tarkin to Imperial Center, Admiral Nils Tenant commented his surprise at seeing Tarkin wearing the new uniform, having not seen it before."}, {"tag": "h2", "text": "Design"}, {"tag": "h3", "text": "Officers' uniforms"}, {"tag": "p", "text": "The uniform jacket was a short skirted double breasted tunic made of gaberwool that fastened with snap closures on the inside. The tunic featured a round choker collar and its skirt extended halfway between the hip and the knee. When closed, the tunic had a vertical left over right closure, when its Clone Wars predecessor extended across the chest on one side and across the midsection on the other. Additionally, the Imperial tunic generally lacked shoulder boards and epaulets, as Emperor Palpatine believed that the use of such put more emphasis on status as opposed to duty. Contrarily to the straight-legged Clone Wars-era trousers, the redesigned ones were flared in the hips and thighs, narrowing at the cuffs so they could be more easily tucked into their wearers' boots. There were laces and lace holes at the lower leg. Officers wore a pair of black, durasteel-toed knee-high boots with turn-down topside cuffs; as Tarkin had stressed the importance of the boots fitting the wearer while designing the uniform, citing the significant distances he had walked while aboard Star Destroyers."}, {"tag": "p", "text": "Common additions to the uniform could include a kepi cap and a belt, both featuring an officer's disk. Rank could be indicated by a rank insignia plaque affixed to the tunic's left breast and a number of code cylinders could be carried in narrow pockets just below each shoulder. Beneath their uniform, officers wore an off-white shirt. Sometimes, the collar and sleeve cuffs of that shirt were slightly visible, protruding from under the tunic. Some officers also wore black gloves, or even a cape. Since Emperor Palpatine was scornful of commendations, there was no place for medals or battle ribbons on the uniform."}, {"tag": "h4", "text": "Variants"}, {"tag": "p", "text": "While the standard-issue uniforms were made of a gray-green fabric, there existed several variants of different colors, such as a black variant worn by noncoms and Stormtrooper officers. There also existed a version of the uniform with a white tunic, black-flared breeches and sometimes a black cap, worn by intelligence officers in Imperial Intelligence or the Imperial Security Bureau. A gray-blue variant affiliated with the Imperial Press Corps also existed, as well as the all white uniforms, complete with golden shoulder boards, worn by Grand Admirals."}, {"tag": "p", "text": "Chief scientists in the Tarkin Initiative wore a uniform with a white patch over the neck and shoulders, and a symbol of the initiative on each arm. The tunic was also in one piece, and lacked the snap closures of the regular design."}, {"tag": "h4", "text": "Additions"}, {"tag": "p", "text": "In potentially hostile situations, officers could wear field armor over their tunic, as well as a protective helmet and goggles similar to those worn by AT-ST drivers. While this armor was dark-grey for officers wearing a regular uniform, officers with different colored uniforms wore armor that reflected this differentially, such as Grand Admirals, who wore white armor, with golden shoulder boards similar to the ones on their regular tunic."}, {"tag": "p", "text": "For more rainy planets, officers wore another layer over their tunic, that would stop water getting in. The layer was the same color as the wearer's tunic and was made from a different material from the regular uniform, being more suitable for wet weather. It required the wearer to move their rank plaque and code cylinders to this new layer, although all cylinders now had to be on the right side of the wearer, whereas they would normally be on both sides."}, {"tag": "p", "text": "On colder worlds, an overcoat could be worn, that extended down to the tops of the wearers boots, with the wearer's belt on top. Some overcoats featured fur around the neck, and a duplicate rank insignia plaque could be worn too, located over the standard one underneath the coat."}, {"tag": "p", "text": "Officers belonging to certain fleets could occasionally wear that fleets symbol on their upper left arm. An example of this was the officers of the Seventh Fleet, who wore a symbol of a stylized chimaera, a creature heavily associated with Grand Admiral Thrawn, commander of the fleet."}, {"tag": "h3", "text": "Technicians' uniform"}, {"tag": "p", "text": "Imperial technicians wore a far more simple uniform. They wore lightweight boilersuits, with boots, a belt that was identical to the one worn by officers, and a command cap. Both the belt and the command cap would also feature officer's disks. Additionally, long metal cylinders were kept in special pockets on the suit's left arm. Pockets with covers were located on the opposite arm, and on the thighs. An Imperial crest was located above both shoulders, and a small metal panel with several buttons was on the left wrist. Headsets were often worn under the cap. The suits could come in light grey or black, and while the black variant had a matching black cap, they grey one could feature either a dark grey or black cap."}, {"tag": "p", "text": "Similar boilersuits were also worn by TIE fighter pilots, who wore a hefty control box and helmet over it, weapons technicians, who sometimes wore additional protection over the torso of the uniform, and AT-ST drivers. Imperial ground crew wore a variation of the uniform, although it was overall tighter and featured vertical grooves in it. Imperial Navy Troopers were known to wear both officers' and technicians' uniforms."}, {"tag": "p", "text": "Scientists in the Tarkin Initiative could wear lightweight, white and blue boilersuits that could change color when harmful radiation was present."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The uniforms created for Star Wars: Episode IV A New Hope varied in color, with some appearing to be a slightly lighter grey than others. White and light-grey uniforms were also made, both with black trousers. The former has been identified to have been worn by members of the intelligence community."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}