{"url": "Imperial_officer%27s_uniform", "categories": ["Category:Canon articles", "Category:Articles to be merged", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Uniforms"], "nodes": [{"tag": "h1", "text": "Imperial officer's uniform"}, {"tag": "p", "text": "The officers of the Galactic Empire's Imperial Officer Corps wore a variety of military uniforms depending on what branch of the Empire they served in and what their current assignment was. Color was used to denote branch, with officers of the Imperial Army and Navy wearing gray-green uniforms, officers of the Stormtrooper Corps wearing black uniforms, and officers of Imperial Intelligence wearing white. Overall, officer's uniforms were designed to be functional instead of fancy."}, {"tag": "p", "text": "The most commonly worn outfit for an Imperial officer was the standard dress uniform. This consisted of a gaberwool tunic, pants, a pair of leather boots and a utility belt. Some officers also chose to wear an Imperial kepi, although others went without a hat. Code cylinders and a rank insignia plaque were worn on the breast of the tunic to denote rank, and officer's disks on the belt and hat also contained information concerning the individual. Officers in combat zones would sometimes wear armor over their dress uniform, with stormtrooper officers donning full stormtrooper armor to fight. Other variations of the officer's uniform existed, including various overcoats."}, {"tag": "p", "text": "Technical officer's uniforms differed from those of military officers, often consisting of the same light gray bodysuit as technical crewman, but still including the officer's kepi, belt and boots."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Designed by Grand Moff Wilhuff Tarkin, the military uniforms of the Galactic Empire's Imperial Officer Corps were made to be functional, not fancy. Tarkin believed that medals and ribbons had no place on a military uniform or within the Imperial Military at all, and so to avoid cluttering the uniform's clean lines, not even ambitious officers such as Governor Arihnda Pryce wore them. The few components of the uniform that did convey rank were the officer's disks worn upon belt buckles and headgear, the code cylinders worn in breast pockets, and the rank insignia plaque worn upon the breast."}, {"tag": "p", "text": "The components of most command staff officer's dress uniforms was the same across the various branches of the Empire, with color being used to distinguish between the different branches or roles. The standard-issue uniform consisted of an Imperial officer's tunic, a pair of flared pants, a black utility belt, a pair of black durasteel-toed boots. An Imperial kepi hat and a pair of black leather gloves were also standard issue, although many officers commonly chose not to wear them."}, {"tag": "p", "text": "The uniforms of support staff varied far more heavily within and across branches, as did the uniforms of officers on combat or security assignments, although many of the variations still used elements of the command staff dress uniform."}, {"tag": "h3", "text": "Imperial Naval uniform"}, {"tag": "p", "text": "The uniform of command staff officers in the Imperial Navy matched the standard command staff uniform and was generally gray-green in color, although some Naval officers such as Admiral Brom Titus wore black uniforms.  Support staff officers within the Navy included both technical and service personnel. This included communications officers, who wore light gray jumpsuits with a black Imperial kepi, a black utility belt and a pair of black boots. Shield relay system operators wore the same outfit, but with a black jumpsuit rather than gray."}, {"tag": "p", "text": "Imperial Navy Trooper officers wore plastoid blast helmets with black officer's tunics, black gauntlets, utility belts equipped with a holster, black pants and black boots. Some also wore black chestplates over their tunics. Officers of the Imperial Starfighter Corps wore TIE fighter pilot uniforms while in the field, including a reinforced flight helmet, a vacuum g-suit made of energy-shielded fabric, a utility belt with an officer's disk, and black boots. While not on combat duty, they either stayed in their flight suit or wore the standard Imperial officer's uniform in a gray color, although without rank plaques or code cylinders."}, {"tag": "h3", "text": "Imperial Army uniforms"}, {"tag": "p", "text": "Amongst the regular Imperial infantry, high ranking officer's uniforms, such as those worn by commanders, majors and captains, differed from those of the soldiers and lower ranking officers under their control. This included wearing fitted, waterproof greatcoats over their armor and unarmored Imperial kepis rather than blast helmets, as the officers rarely left the trenches. They and the troopers all wore utility belts and black boots."}, {"tag": "p", "text": "Outside of combat and security details, stormtrooper officers wore distinctive black caps, boots and dress tunics. Their code cylinders, rank plaques and officers disks and uniform style conform to the Imperial Navy's standards."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}