{"url": "Imperial_officer_battle_armor", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Pages needing citation", "Category:Armor", "Category:Imperial Military"], "nodes": [{"tag": "h1", "text": "Imperial officer battle armor"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Imperial officer battle armor was originally created for the 1980 film Star Wars: Episode V The Empire Strikes Back. It was first identified in the episode guide for \"Zero Hour,\" the the twenty-first and twenty-second episodes of the animated series Star Wars Rebels' third season, which originally aired on March 25, 2017."}, {"tag": "p", "text": "John Mollo explored several options for the Imperial generals in The Empire Stikes Back. At one time, Veers was dubbed a \"field commander\" and was to appear in an Imperial tunic adorned with heavy decorative edging and multiple insignia, paired with an elaborate gorget in place of body armor. Several styles of headgear were also considered, including a wide-profile earphone cap and a decorated Imperial field cap. Mollo's final design for Veers during Battle of Hoth used elements of the snowtrooper costume for visual continuity within the Imperial ranks."}, {"tag": "p", "text": "Over his standard Imperial uniform, Veers wore the same vacuum-formed chest, back, and belly armor as snowtroopers. However, his armor was colored olive to match his officer uniform and finished with different greeblies than those on snowtrooper armor. Imperial-rank insignia bars were also added to match Veers' dress uniform. Finally, a sidearm holster attached to the belt ensured the general was ready for combat. Like his body armor, Veers' helmet was made from the same mold as the snowtrooper helmet, so it had the some basic shape. However, it did not have the eyepiece or vinyl bib installed in the front and the olive helmet had more decorative elements greeblies that its snowtrooper counterpart. An aluminum bar ran down the back of the helmet, along with an intricate greeblie mounted on the temple and two small \"Imperial discs\" on either side of the bottom corners. The interior of the helmet was also finished with olive vinyl as it was visible on camera. It was augmented with a pair of dark goggles, a chinstrap, and microphone piece. Only two helmets were created for production, but they were as a basis for the AT-ST driver helmets created for Star Wars: Episode VI Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}