{"url": "Imperial_repeater_rifle", "categories": ["Category:Legends articles", "Category:Repeating blaster rifles"], "nodes": [{"tag": "h1", "text": "Imperial repeater rifle"}, {"tag": "p", "text": "The Imperial repeater rifle, also known as the Imperial repeater gun or Autogun, was a type of repeating blaster prevalent during the time of and immediately after the Galactic Civil War. The weapon was originally developed by Moff Rebus as a prototype weapon for the Dark troopers, though it was later replaced by the assault cannon. The weapon was primarily found in Imperial armories after that, as well as in space stations including Fuel Station Ergo. After the end of the Galactic Civil War in 4 ABY, the weapon was adopted by the Imperial Remnant forces under the leadership of the Dark Jedi Jerec. It continued in the service of the remnant through 10 ABY during Operation Shadow Hand. By 12 ABY Remnant forces adopted to the Imperial Heavy Repeater, replacing the old weapon entirely."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A fast and highly accurate ranged weapon, the Imperial repeater rifle featured two firing modes: a single shot mode and a slower tri-shot burst mode that fired in a triangular configuration. The tri-shot mode was powerful against Jedi, as they could only block one or two bolts with their lightsaber, while one would always get through. The primary firing mode featured a very high rate of fire that could cut through swaths of enemies in little time, although this brought about the weapon's main flaw; Due to the high rate of fire, the Repeater could burn through ammunition extremely quickly. The primary mode's pinpoint accuracy, however, more than made up for the ammo consumption, as the weapon could effectively be used at great distances, although the projectiles lost momentum the longer they went, thus long range hits wouldn't be as damaging. Granted, the weapon wasn't as damaging as blasters anyway due to the lightness of the projectiles and the lack of force behind the bullets."}, {"tag": "p", "text": "The weapon's housing was constructed in a fairly angular fashion, the barrel housing of the weapon constructed like a triangle. There were three barrels overall, one in each corner of the triangular housing. This was the feature that enabled the tri-shot mode. A drum was attached to the right side of the repeater's body which housed the ammunition. The internal belt was wrapped around the insides of the weapon, and the belt and the rounds were be visible on the left side of the weapon. The projectiles did not use casings. The grip and trigger was on the back of the main body. Most models were equipped with a wood grip. A long thin stock protruded from the back of the grip at the bottom."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to Justin Chin, the Phase II dark trooper was originally going to carry a Imperial Repeater with a ribbon chain clip to an ammo pack slung in the back. However, he doesn't make clear if 'originally' refers to the game designers' or the Imperials' intention."}, {"tag": "p", "text": "The 'Dark Trooper Weapon' Katarn finds in the second level of the game matches indeed a repeater rifle in appearance."}, {"tag": "p", "text": "The resource files for Dark Forces contain an animation labeled \"IDTGUN\", corresponding with a single IDTGUN sprite which is the prototype weapon the player recovers. However, the DTGUN animation is a placeholder animation of a simple character jumping."}, {"tag": "p", "text": "Despite Katarn observing that the weapon is too large to have been carried by a normal human soldier, the Repeater appears to be perfectly usable by Kyle and anyone else and is very much prevalent (and actually appears quite compact) in Dark Forces' sequel, Jedi Knight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}