{"url": "Imperial_remnant_(cold_war)", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles with conjectural titles", "Category:Imperial remnants", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Imperial remnant  (cold war)"}, {"tag": "p", "text": "A remnant of the fallen Galactic Empire was active during the years of the New Republic era. Opposing the surrender of the Empire, a rogue faction of staunch Imperials gradually rose to power, refusing to submit and adhere to the terms of the Galactic Concordance. These hardliners would eventually relocate to the Unknown Regions where they plotted a return to power, and reformed into the First Order, a successor to the Old Empire."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Four years after the Battle of Yavin, the Galactic Empire was in a state of flux. Although Imperial forces secured a strategic victory against the Alliance to Restore the Republic one year earlier on the planet Hoth, during which they nearly quelled the entire rebellion, the continued conflict proved to be strenuous on the Empire's overall resources. During this time, a second Death Star was nearing completion over the Forest Moon of Endor, which, in the eyes of most Imperials, meant the imminent destruction of the Rebel Alliance. Emperor Sheev Palpatine ordered a large fragment of the Imperial fleet to Endor to guard the construction project."}, {"tag": "p", "text": "Before the battle station neared completion, a rebel fleet led by Admiral Gial Ackbar and General Lando Calrissian attacked and successfully managed to destroy the Death Star, killing both the Emperor and his enforcer Darth Vader in the process, as well as a large percentage of Imperial leadership. This victory proved to be a turning point in the Galactic Civil War, and within weeks of the battle, factionalism began to take shape within various elements of the Empire due to the massive power vacuum left behind. As a result, various warlords began to either increase their power bases or take their holdings and leave the Empire entirely, resulting in its overall splintering."}, {"tag": "p", "text": "Although Grand Vizier Mas Amedda did what he could to try and hold the Empire together, the real power of what remained of the Imperial establishment was in the hands of Fleet Admiral Gallius Rax, who declared himself \"Counselor to the Empire\" and set up a governing body called the Shadow Council. While the Empire remained fragmented, Rax managed to unite the Empire on the desert world of Jakku. Rax then lured the fleets of the recently established New Republic to the world, where both navies would do battle. Little to the knowledge of forces on either side but the battle itself was orchestrated by Rax for the sole purpose of carrying out Emperor Palpatine's contingency plan, which would see the Empire torn down and rebuilt from the ashes of the true and loyal. This would be done by destroying the entire planet via the use of ancient Sith artifacts that were stored in the Observatory, an ancient facility on Jakku's surface. Rax was ultimately killed by Rae Sloane. Although the Empire lost the Battle of Jakku, Sloane managed to escape with some forces to the Unknown Regions, where she intended to colonize and consolidate Imperial supremacy over planets in deep space."}, {"tag": "h3", "text": "Rise to power"}, {"tag": "p", "text": "The Battle of Jakku proved to be the last devastating defeat of the Galactic Empire. Although the fighting continued, the Empire scored no major victories in the days following. With Rax's control over the Empire relinquished, Amedda successfully managed to negotiate an official surrender with Chancellor Mon Mothma of the New Republic. The two met on Chandrila soon after and signed what became known as the Galactic Concordance. The terms of the treaty stated that all Imperial fleets were to be relocated to the Core Worlds and Inner Rim. Additionally, all Imperial Academies were to be closed, which would halt the continued training of stormtroopers. Finally, heavy war reparations were to be paid to the New Republic. Other remnants such as in Core who agreed to the terms of the treaty and ordered all remaining Imperial vessels into its new predetermined borders. The Imperial officers who did not agree to the treaty's terms were ultimately branded as war criminals by Mothma."}, {"tag": "p", "text": "Still, many more remnants of the Old Empire refused to obey the Republic's terms as the Core Worlds did, opting to remain heavily militarized. These hardliners saw themselves as true Imperials, having inherited the struggle against the Rebel Alliance. This led to thick tensions between the hardliners and the New Republic, despite the fact that both factions were technically at peace. Still, they proved viable threats to one-another after the conflict came to an end, both controlling militaries of their own, resulting in a Cold War between those unified Imperial factions that refused surrender and the New Republic. Even as other factions of the Old Empire remained at peace with or even opted to join the New Republic, the hardliners refused to let what they believed to be the last true vestiges of the Empire die."}, {"tag": "h3", "text": "Reborn"}, {"tag": "p", "text": "At some point following the signing of the Galactic Concordance, some supporters of the Old Empire would make its way into wings of the New Republic Senate, mostly lobbying to the Centrist movement, which would eventually gain power two decades after the Battle of Yavin. Some members of the Centrist Party were secretly sympathizers of the Empire, wishing to partially restore it by returning central power to the Core Worlds under the New Republic's jurisdiction and building up its navy once more. Even as the cold war continued, hard-liner forces would begin to relocate from Imperial space to the Unknown Regions, where they would have free rein to expand just as Sloane did with her forces years prior."}, {"tag": "p", "text": "In the Unknown Regions, the remnant could escape the notice of the Senate and rapidly rebuild the Imperial Navy, creating a new force away from the New Republic's prying eyes. While not fully regaining the strength that the Empire once had, the hardliners successfully laid the groundworks for a rebirth that would become the First Order."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}