{"url": "Imperial_remnant_(Core_and_Inner_Rim)", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Imperial remnants"], "nodes": [{"tag": "h1", "text": "Imperial remnant  (Core and Inner Rim)"}, {"tag": "p", "text": "A remnant of the Galactic Empire was active in the Core and Inner Rim regions of the galaxy that saw the Imperial Navy within the regions confined to predetermined boundaries set by the New Republic. It was one of several remnants of the Galactic Empire that formed in the waning months of the Galactic Civil War, existing alongside the domain of Governor Ubrik Adelhard in the Anoat sector, the Imperial fleet in the Queluhan Nebula, and the Empire itself on Jakku, where it was led Counselor to the Empire Gallius Rax."}, {"tag": "p", "text": "Within a year of Emperor Palpatine's death in 4 ABY, the forces of the New Republic defeated the Imperial Military at the Battle of Jakku. As a result, the Empire capitulated to the Republic and agreed to the terms of the peace treaty—the Galactic Concordance—that ended the Galactic Civil War in 5 ABY. While some remnants remained defiant, the Core and Inner Rim remnant complied with the conditions of the treaty by keeping the Imperial Navy's vessels contained within the Empire's new boundaries. The Galactic Empire has also surrendered Coruscant to the Republic, which allowed an independent provisional government to administrate the former Imperial capital."}, {"tag": "p", "text": "Despite the remnant's compliance with the Republic in the postwar era, certain elements of the Old Empire rejected the terms of the Galactic Concordance. They fled into the Unknown Regions, joining an exodus of Imperial officers, nobles, and technologists that ultimately resulted in the formation of the First Order. A Cold War ensued between the Republic and the First Order; while the Galactic Senate dismissed the Old Empire's successor as a minor threat, the First Order initiated an extensive rearmament program in defiance of the treaty, fully intending to reclaim the Imperial legacy through the eventual destruction of the Republic."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "For a millennium, the Galactic Republic presided over the galaxy, and sought to uphold peace and prosperity. With the help of the Jedi Order and in the belief the Sith had faded into history, the Republic maintained peace. But the Republic over time became slow and corrupt with politicians unable to deal effectively with disputes that arose in the Galactic Senate. As corruption gripped the Republic, the then senator of Naboo Sheev Palpatine, secretly the Dark Lord of the Sith Darth Sidious, was elevated to Supreme Chancellor during the Invasion of Naboo and set his plan in motion for the restoration of the Sith Empire. As a failsafe, Palpatine developed the Contingency to destroy his Empire should he perish; he was unwilling to have a successor inherit his future Empire. He entrusted Galli, a child from Jakku, to oversee planning."}, {"tag": "p", "text": "He gradually amassed far more emergency powers than were ordinarily allowed at the height of the Separatist Crisis as the galaxy fell into chaos. The Clone Wars with the Confederacy of Independent Systems lasted three years, and Palpatine used this to change the Galactic Constitution and eventually—calling the Jedi's attempt to arrest him a \"Jedi rebellion\"—issue Order 66, purging the Jedi Order. He used this as a pretext for his proclamation of the New Order, officially replacing the thousand-year democracy with the Galactic Empire and appointing himself Galactic Emperor while wiping out the remaining Separatists, ending the Clone Wars and beginning the Imperial Era."}, {"tag": "p", "text": "Following the Galactic Empire's fragmentation in the aftermath of the crushing defeat at the Battle of Endor in 4 ABY, the Galactic Civil War began to tip in the favor of the Rebel Alliance. With Emperor Sheev Palpatine killed and the second Death Star destroyed, the Empire became leaderless. The loss of both the Emperor and the Imperial Ruling Council above Endor resulted in a massive power vacuum, leading to a number of admirals, moffs, and other warlords either trying to seize control for themselves or seceding from the Empire entirely. Although Grand Vizier Mas Amedda tried to maintain order within the leadership, the aftermath of the Emperor's demise left him with little real power. As a result, the Empire almost completely fragmented within weeks due to the lack of a single leader, and Imperial rule beyond the Core began to collapse, while others like Arsin Crassus suggested the Empire sue for peace with the New Republic."}, {"tag": "p", "text": "Several months after the Battle of Endor, Fleet Admiral Gallius Rax united a portion of the old Imperial Navy into a single force, effectively declaring himself the new leader of the Empire and establishing an advisory council to run it, making Grand Admiral Rae Sloane its public face. Unbeknownst to his associates, Rax secretly intended to carry out a contingency order given to him by the late Emperor, which would completely disassemble the Empire. Amassing his united armada above the Inner Rim world of Jakku, he planned to lure the navy of the recently established New Republic to the desert world so that both fleets could destroy one another in one climactic battle. His plan was thwarted by Sloane, even though the Empire was ultimately defeated."}, {"tag": "h3", "text": "Corewards retreat"}, {"tag": "p", "text": "Shortly after the Battle of Jakku, Amedda and Chancellor Mon Mothma of the Republic signed the Galactic Concordance, officially ending the war. Elements of the Imperial Starfleet then retreated to the Core Worlds and Inner Rim and launched no further major offensives, although the conflict did not truly die down for some time. In order to prevent the holdouts of the Empire from regaining a foothold in the galaxy, a series of stipulations were set in place in accordance with the conditions of the treaty. Subsequently, noncombatant functionaries within the old Imperial government were given conditional pardons provided they complied with the articles of the Concordance. As a result, the Empire quickly fell apart, while the New Republic established a new government on the capital world of Coruscant, led by Amedda, although, in reality, the former Grand Vizier was little more than a puppet, making the provisional government a client state of the New Republic's newly asserted hegemony."}, {"tag": "p", "text": "After the formation of the provisional government on Coruscant, the borders of the Imperial Space reorganized ascendancy were drawn, as determined by Mon Mothma, thereby denoting the constraints of Imperial sovereignty. These new borders, which conditionally allowed the remnants of the Empire to peacefully co-exist with the New Republic, were ultimately confined to most of the Core and the Inner Rim, both regions containing some of the wealthiest and most prestigious planets that were historically loyal to the Empire. Despite that, Coruscant did not fall within these boundaries, with the provisional government remaining a vassal state of the New Republic under the rule of Mas Amedda. Several other Core Worlds fell under New Republic control as well, such as Hosnian Prime, which eventually became capital of the Republic. Those other Core Worlds that did not fall under remnant jurisdiction ultimately joined the new galactic government."}, {"tag": "p", "text": "While all noncombatant functionaries who served in the old Imperial government were given conditional pardons, provided they acted by the articles of the Galactic Concordance, the still living Imperial officials who refused to surrender were branded as war criminals. Heeding reluctantly to the provisions of the agreement, all Imperial forces and starships retreated within the new boundaries that were determined by the Galactic Concordance. Unlike the Imperial holdouts that continued to fight the New Republic with no regard for the peace treaty, this holdout itself adhered to the constraints by halting the training of stormtroopers, the closing of Imperial academies, and agreeing to keep all vessels within the remnant's borders. Despite the relatively sizable naval presence, these stipulations heavily regulated what remained of the Empire's military-industrial complex, greatly limiting the Imperial ability to wage war."}, {"tag": "h3", "text": "Tensions arise"}, {"tag": "p", "text": "Although the Imperial Navy agreed to the terms of surrender, a great deal of resentment between the Republic and certain Imperial hardliners remained. These remnants of the Empire entered a Cold War with the Republic that lasted for years. While the remnant in the Core maintained peaceful relations with the New Republic, many rogue military elements of the Old Empire eventually retreated into the Unknown Regions, where a new state was eventually formed, existing separately from the rump state in the Core."}, {"tag": "h2", "text": "Military"}, {"tag": "p", "text": "The remaining Imperial Navy was allowed to operate in boundaries defined by the Galactic Concordance; therefore, it was allowed to continue existing while calling for the banning of the Stormtrooper Corps, although this did not necessarily apply to standard infantry. However, both the defeat at Jakku and the division of the ascendancy as a whole greatly weakened the once-unchallenged navy."}, {"tag": "p", "text": "In spite of all this, loyal portions of the Imperial Navy adhered to the terms of the Concordance and confined themselves to the predetermined boundaries. In turn, the now-reduced Imperial Navy existed as a weakened force. Star Destroyers throughout the Core and Inner Rim did not attack the Republic, and maintained a peaceful co-existence with the reigning galactic government."}, {"tag": "p", "text": "Although the Concordance called for all Imperial vessels to withdraw corewards, some rogue warlords refused, along with an established faction that locked into tensions with the New Republic. Whereas these more aggressive hardliners refused to accept pardons, those Imperial officers who agreed to the New Republic's strict stipulations were not branded war criminals."}, {"tag": "p", "text": "Still, despite the established presence of the navy, the stipulations placed upon it from the New Republic made it difficult for it to renew the Old Empire's campaign against the former Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}