{"url": "Imperial_shock_trooper/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Imperial shock troopers", "Category:Stormtrooper variants"], "nodes": [{"tag": "h1", "text": "Imperial shock trooper"}, {"tag": "p", "text": "Shock troopers were the elite members of the Imperial Stormtrooper Corps, specialized in the use of various non-standard weapons and equipment. They were also distinguishable from standard stormtroopers by their extra heavy plate armor. Some even wore different color markings on their armor similar to the markings used by Phase I clone trooper armor to denote their rank."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Imperial shock troopers were trained to fulfill various battlefield support roles and carried a wide variety of equipment. Shock troopers were effective against enemy armor columns and in infantry lightfight. Some, equipped with MiniMag shoulder-launched proton torpedo launcher and thermal detonators, acted as anti-vehicle units on the battlefield. They also carried additional explosives, including Baradium-core code key thermal detonators and KE-6b mines. Shock troopers also carried SE-14r blasters as a back-up sidearm. Others, equipped with DC-15A blaster rifles and DC-17 hand blasters used by clone troopers during the Clone Wars, acted as security on strategic locations throughout the Empire. Some shock troopers utilized jetpacks for additional mobility in battle, much like the Imperial jumptroopers.[source?] Certain shock troopers wore armor similar to sandtroopers. Other shock troopers wore a different form of armor."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Galactic Empire"}, {"tag": "p", "text": "Shock troopers were part of the Imperial Military since shortly after the Declaration of a New Order in 19 BBY. They saw action in a variety of battlefields, and a number were part of the 501st Legion."}, {"tag": "p", "text": "Many were under the command of Imperial slave driver Zarien Kheev, while others were seen guarding strategic locations throughout the Galactic Empire. During her various missions, Rebel operative Rianna Saren encountered those shock troopers on several occasions."}, {"tag": "h3", "text": "Imperial Remnant"}, {"tag": "p", "text": "Long after the conclusion of the Galactic Civil War, the former Galactic Empire was reduced to a handful of backwater sectors in the Outer Rim Territories, collectively known as the Imperial Remnant. As the Galactic Alliance strengthened its control over the galaxy, the Remnant focused on organizing its few remaining territories while simultaneously keeping the Imperial Military up to date. As a result, the stormtroopers of the Imperial Remnant were superior as professional soldiers in comparison to the stormtroopers of the old Empire. The Remnant also invested a great deal of attention to the shock troopers, the elite within the elite Stormtrooper Corps."}, {"tag": "p", "text": "Together, the shock troopers comprised the Imperial Elite Guard, a well-trained military unit responsible for protecting the government of Bastion. By the time of the Second Galactic Civil War, the Sith Lord Darth Caedus added the Imperial Remnant to the Galactic Alliance's list of allies. Apart from being the legacy of his grandfather, the Remnant possessed enough ships, arms and the right kind of ideology to help the Alliance win the war. But even with all of those assets, Caedus was also very impressed with the Elite Guard's shock troopers and their reputation as highly skilled soldiers on the level of Darth Vader's 501st Legion."}, {"tag": "p", "text": "After Caedus successfully negotiated the Imperial Remnant's entry into the war, the combined naval forces of the Alliance and the Remnant rendezvoused at the planet Fondor, one of the rebellious worlds that betrayed the Alliance in order to join Corellia's Confederation. A contingent of shock troopers were stationed on the Bloodfin, the flagship of Imperial Head of State Gilad Pellaeon. In the midst of the Second Battle of Fondor, the Alliance forces became divided between its two Joint-Chiefs of State, Darth Caedus and Admiral Cha Niathal; the majority of the Alliance fleet remained loyal to Caedus."}, {"tag": "p", "text": "When Tahiri Veila, Darth Caedus' Jedi spy and enforcer, assassinated Pellaeon for siding with Niathal against her master, the Imperial Remnant's Moff Council quickly declared their support for Caedus. However, much of the Bloodfin's crew mutinied in retaliation for the death of Pellaeon, thus splitting up the shock troopers between the ones that remained loyal to the Moffs, and the rest that were loyal to the fallen Grand Admiral. When Jaina Solo and a team of Mandalorians infiltrated the Bloodfin, they became caught in the crossfire between the two Imperial sides. At the same time, the shock troopers were fighting to the best of their ability to protect the Moffs while Veila escaped after being personally rescued by Darth Caedus. In the aftermath of the battle, the Bloodfin was lost and the remaining shock troopers on board were forced to surrender. The Imperial Remnant's shock troopers continued to serve alongside Darth Caedus' Galactic Alliance forces until the end of the Second Galactic Civil War in 41 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The appearance and function of shock troopers varies in different Star Wars video games. While in Lethal Alliance their role and armor is similar to that of regular stormtroopers, in the Battlefront video games, the term 'shock trooper' is applied to what appears to simply be a standard stormtrooper armed and equipped for an anti-vehicle role; they wear the standard armor of an Imperial sandtrooper, with an orange rank pauldron and a large equipment backpack, and they carry a missile launcher well-suited for engaging enemy armored vehicles. Meanwhile, on planets such a Hoth and Rhen Var, Battlefront depicts shock troopers as snowtroopers armed with missile launchers. In the Dark Forces/Jedi Knight video games, they carry light repeating blasters and have armor similar to the shock troopers in Battlefront."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}