{"url": "Imperial_territory_G5-623", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Imperial remnants"], "nodes": [{"tag": "h1", "text": "Imperial territory G5-623"}, {"tag": "p", "text": "Imperial territory G5-623 was an Imperial territory that consisted of the occupied Mid Rim planet of Kashyyyk, whose Wookiee population had been enslaved with inhibitor chips. Following the Battle of Endor, it became an isolated but self-sufficient Imperial remnant that broke off from the Empire. Imperial territory G5-623 ceased to exist after the Liberation of Kashyyyk by the New Republic in 5 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Age of the Empire, the Galactic Empire invaded and enslaved the Wookiee population of Kashyyyk. Following the Battle of Endor, Imperial territory G5-623 became an isolated but self-sufficient Imperial remnant led by Grand Moff Lozen Tolruck, who controlled the Wookiees with inhibitor chips. Like Governor Ubrik Adelhard who ruled another Imperial remnant in the Anoat sector, Tolruck propagated the myth that Emperor Palpatine had survived the destruction of the second Death Star. Tolruck's remnant did not fall in line with the Imperial forces commanded by Grand Admiral Rae Sloane and Fleet Admiral Gallius Rax and managed themselves independently."}, {"tag": "p", "text": "Due to a drop in demand for Wookiee slaves, Tolruck and Commandant Theodane Sardo toyed with the idea of farming the Wookiee population as meat. However, Tolruck and his Imperial forces were defeated in 5 ABY during a mass uprising inspired by Han Solo, Chewbacca, and Sinjir Rath Velus. The remaining Imperial forces capitulated when New Republic forces under Admiral Gial Ackbar, Princess Leia Organa, and Captain Wedge Antilles liberated the system. Wookiee and New Republic forces subsequently conducted mopping-up operations against Imperial holdouts on Kashyyyk including Commandant Dessard's camp."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}