{"url": "Imperial_weapons_technician", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Imperial military specializations"], "nodes": [{"tag": "h1", "text": "Imperial weapons technician"}, {"tag": "p", "text": "Imperial weapons technicians, also known as Imperial gunners or Death Star gunners to those onboard the Death Star and DS-2 Death Star II Mobile Battle Station, were members of the Imperial Military who operated the various weapons of the Galactic Empire's capital ships, military bases, and battle stations."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Imperial weapons technicians, also known as Imperial gunners or Death Star gunners, operated turbolasers and ion cannons of the Galactic Empire's capital ships and military bases, including the first and second Death Star, where elite gunners also controlled battle stations' planet-destroying superlasers while monitoring their titanic energy levels. Many gunners were recruits with the Imperial Navy's piloting program, but were still training or past their prime. Nevertheless, Imperial weapons technicians still possessed the skills and expertise necessary to operate their powerful weapons. Turbolasers were manned by teams of gunners, who monitored the weapons' crucial recharge timings and heat levels while locking onto targets. Imperial weapons technicians also operated the four gravity well projectors aboard the experimental Imperial Interdictor."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Imperial weapons technicians wore black jumpsuits made of energy-shielded fabric, black durasteel gloves and positive gravity pressure boots, and large, specialized black helmets whose slit-like visors were equipped with polarized lens to protect their eyes from the bright flashes of light from turbolaser and superlaser fire, which many gunners found to restrict their all-round vision. The helmets were also fitted with sensors for tracking down enemy fighter craft, as well as a comlink to coordinate, aim and fire with precision."}, {"tag": "p", "text": "Some gunners could also wear quilted black jackets over their jumpsuits. Those working on experimental projects, like the Imperial Interdictor stewarded by Admiral Brom Titus, were distinguished by their light grey jumpsuits with golden yellow Imperial crests. Imperial weapons technicians carried a blaster pistol as a sidearm."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During the superlaser firing sequence in the 1977 original Star Wars film Star Wars: Episode IV A New Hope, the two weapons technicians huddled in the laser cannon conduit were portrayed by Industrial Light & Magic modelmakers Grant McCune and Joe Johnston. During production, the gunners' distinctive headgear was nicknamed the \"beetle helmet.\""}, {"tag": "p", "text": "Additionally, Star Wars: Episode VIII The Last Jedi director Rian Johnson had a cameo as a weapons technician in the 2016 Star Wars Anthology film Rogue One: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}