{"url": "Imperialis", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Captured starships", "Category:Republic Sienar Systems products", "Category:Starships of the Galactic Empire", "Category:Starships of the Order of the Sith Lords", "Category:Yachts"], "nodes": [{"tag": "h1", "text": "Imperialis"}, {"tag": "p", "text": "The Imperialis was a luxury pleasure craft owned by Supreme Chancellor and eventually Galactic Emperor Sheev Palpatine during the Galactic Civil War. While the Imperialis was stolen by the gambler Lando Calrissian and wrecked on the moon Quantxi, the Emperor had several replicas of the vessel housed at his Observatories, which were scattered throughout the galaxy. In 5 ABY, the bounty hunter Mercurial Swift found information about Fleet Admiral Gallius Rax's origins aboard the Imperialis's computers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Imperialis was a sleek, silvery pleasure yacht with two swept-back wings. It was a custom job by Raith Sienar, who owned Republic Sienar Systems. The Imperialis was fast, maneuverable and capable of outrunning Imperial Star Destroyers. The yacht was equipped with advanced defensive systems in its wings that were capable of blasting gravity mines. The ship's cockpit had red tinted screens and could seat a pilot and co-pilot. On one occasion, the smuggler Lando Calrissian was able to use the Imperialis to drag the tractor beam of a Star Destroyer, causing it to collide with another Star Destroyer."}, {"tag": "p", "text": "The Imperialis was filled with treasure from top to bottom including a Gungan fertility totem from the Naboo system. The ship had a securely-locked central chamber that could only be accessed by interface. This chamber stored several Sith artifacts including the mask of Lord Momin and two lightsabers. It was guarded by a pair of the Emperor's Royal Guards. The dark side presence inside the helmet was capable of corrupting any sentient beings in close proximity to it. These artifacts were believed to belong to the Sith sculptor Sith Lord Darth Momin."}, {"tag": "p", "text": "The Imperialis also had a medical bay in the lower deck that contained a bacta tank. The ship also had a well-stocked armory that contained a wide array of blasters. The Imperialis also had an airlock and docking rig that could be remotely operated. The ship's escape pods could also be remotely deactivated by interface. The Imperialis also had a self-destruct mechanism. Lobot's AJ^6 cyborg construct could also connect to the ship's interface."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Serving Palpatine"}, {"tag": "p", "text": "According to Sava Korin Pers, the Imperialis might have been a custom job by Raith Sienar himself. It was in service as early as 30 BBY, when it would be used to ferry Chancellor Sheev Palpatine and his adviser, Yupe Tashu to Jakku for their excavation of the Plaintive Hand plateau. On that occasion, Gallius Rax, a future Fleet Admiral of the Galactic Empire, stowed aboard the ship. Palpatine then gave him the choice of dying or serving him. Rax chose the latter and agreed to guard the excavation site on Jakku. Ten years later, Palpatine appointed Rax as his Contingency aboard the Imperialis and inducted him into the Galactic Empire."}, {"tag": "h3", "text": "Enter Lando"}, {"tag": "p", "text": "While the Imperialis was being serviced at Sienar Fleet Systems' Orbital Shipyard CC-24 sometime after the battle of Yavin, it was stolen by gambler Lando Calrissian, Lobot, Korin Pers, and the alien twins Aleksin and Pavol. In response, the Emperor dispatched three Imperial Star Destroyers to recapture the ship. However, Calrissian was able to use the Star Destroyer's tractor beams to cause them to collide with each other. Calrissian and his companions then fled into deep space."}, {"tag": "p", "text": "The Emperor then sent the bounty hunter Chanath Cha to recover the Imperialis and capture the thieves. The Emperor provided her with the modified Star Courier Scimitar, which was capable of tracking down the yacht's hyperspace signature. He also gave her instructions to destroy the ship should she be unable to recover it. Meanwhile, Lobot was impaled through the gut by the Royal Guards guarding the ship's central room. Lando and Korin managed to evacuate Lobot to the ship's medbay while Aleksin and Pavol defeated and killed the guards. They discovered that the ship was storing several Sith artifacts including a Sith helmet and lightsabers."}, {"tag": "p", "text": "Aleksin and Pavol were corrupted by the dark side presence inside the Sith artifacts and began fighting. Lando and Korin were cornered by Cha, who was an old friend of Lando. Due to her relationship with Lando, Cha decided to spare his life and that of his companions. However, she proceeded with her mission to set the ship to self destruct. Lando and his companions were attacked by the corrupted Aleksin and Pavol, who killed Korin. Lando managed to evacuate Lobot from the medbay and kill Aleksin after tricking him into deactivating his lightsaber. Cha killed Pavol following a knife fight. After Lobot managed to reactivate the ship's escape pods, the three escaped into space."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Imperialis was destroyed by its self-destruct mechanism. Following its destruction, its wreckage was disposed of on Quantxi, the Junk Moon of Ord Mantell. At the request of Grand Admiral Rae Sloane, the bounty hunter Mercurial Swift accessed the ship's computers in 5 ABY and discovered that Rax originated on Jakku."}, {"tag": "p", "text": "Despite the loss of the Imperialis, each of the Emperor's Observatories hosted a functional replica of the Emperor's pleasure yacht. Following the Battle of Jakku, Sloane along with Brendol Hux, Armitage Hux, and Rax's former child soldiers used the replica of the Imperialis stationed at the Jakku Observatory to travel into the Unknown Regions and rendezvous with the Emperor's lost flagship Eclipse."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperialis first appeared in the 2015 Marvel Comics series Star Wars: Lando. The starship was created by Charles Soule, drawn by Alex Maleev, and colored by Paul Mounts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}