{"url": "Imperial%E2%80%93Grysk_conflict", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Articles in need of major additions", "Category:Conflicts involving the Chiss Ascendancy", "Category:Conflicts involving the Galactic Empire", "Category:Conflicts involving the Grysk Hegemony", "Category:Conflicts of the Outer Rim Territories", "Category:Conflicts of the Unknown Regions", "Category:Events during the Imperial Era", "Category:Imperial–Grysk conflict"], "nodes": [{"tag": "h1", "text": "Imperial–Grysk conflict"}, {"tag": "p", "text": "A conflict between the Galactic Empire and the mysterious Grysk Hegemony occurred sometime after the Battle of Atollon. It began when Emperor Palpatine sensed a great disturbance in the Force on the edge of the galaxy. He sent his powerful assets: Darth Vader and Grand Admiral Thrawn. After Darth Vader left the conflict, the military of the Chiss Ascendancy got involved."}, {"tag": "p", "text": "The Imperial capital ship Chimaera traveled to Batuu in order to uncover the cause and meaning of a disturbance in the Force sensed by Emperor Palpatine. As the Chimaera was above Batuu,   Sensor officer Commander Hammerly detected four small transports above the planet in loose formation, and together with the six starships already on Batuu's surface, made for ten. Commodore Karyn Faro spoke with Hammerly as the crew of the Chimaera attempted to gather as much information as they could on the vessels, deducing that they could be either small freighters or small warships. As the information gathering continued, two more ships exited hyperspace straight ahead from the Chimaera at a distance of 400,000 kilometers. Hammerly deduced the ships where a type of long-range heavy freighter at the least, bearing straight for Batuu. Faro believed that all of the unidentified vessels were headed for Black Spire Outpost, where Grand Admiral Thrawn and Darth Vader were investigating."}, {"tag": "p", "text": "Hammerly discovered that the two new starships had arrived from over the Chimaera's shoulder on the same hyperlane that the Chimaera had arrived from. Shortly prior to a skirmish on Batuu between Thrawn and Vader against a group of Darshi, one of the heavy freighters was heading towards Thrawn and Vader's position while the remaining vessels maintained orbit above Batuu. Vader ordered Commander Kimmund and his unit to intercept, examine, and engage the other heavy freighter."}, {"tag": "p", "text": "Shortly after the skirmish, Kimmund and his stormtroopers approached the heavy freighter in the Darkhawk, although the Grysk vessel was able to detect the Darkhawk and broke orbit. Defender Squadron One arrived and was able to prevent its escape by disabling the starship, and later chased away the other smaller transports."}, {"tag": "p", "text": "Kimmund was able to capture mulitple  Grysk warriors, whom Thrawn him to take aboard the Chimaera for examination. Later, Kimmund and his legion were aboard the Darkhawk, when several Grysk prisoners broke free and boarded the Darkhawk. With no means of communication and short on troops, Kimmund thought he would die for sure. Luckily for Kimmund, Thrawn's Noghri assassin Rukh was onboard. Using Rukh's cloaking device as a upper hand, Kimmund and Rukh were able to defeat the retreating Grysks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Imperial–Grysk conflict served as the major Imperial Era plot for the 2018 novel Thrawn: Alliances (half of which was set towards the end of the Clone Wars). Parts of the conflict continued into that novel's 2019 sequel, Thrawn: Treason."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}