{"url": "Implacable_(Acclamator-class)/Legends", "categories": ["Category:Legends articles", "Category:Acclamator-class assault ships", "Category:Galactic Republic starships", "Category:Starships of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Implacable (Acclamator-class)"}, {"tag": "p", "text": "Implacable was an Acclamator-class assault ship that served the Republic Navy during the Clone Wars and was present at the First Battle of Geonosis. It survived the Clone Wars to serve the Imperial Navy in the Galactic Civil War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Built by Rothana Heavy Engineering, the Implacable was a gray Acclamator-class assault ship. Proprietary to the Galactic Republic, the ship was not available for sale to outside organizations. Armed with turbolasers, the ship nevertheless had a low targeting accuracy. Modified with ablative armor to absorb damage, Implacable also boasted powerful deflector shields that could endure sustained fire, making it ideal for troop insertions and extractions during heated conflicts Has a medical bay."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "1.16 days after its participation in the Battle of Geonosis, the Implacable joined in the hunt for Separatist leader Count Dooku."}, {"tag": "p", "text": "Before being sent on the Mission to Qiilura as part of Omega Squad, Theta Squad survivor RC-1136 returned to the Implacable. Shortly thereafter, the Implacable arrived at Ord Mantell, unloading troops and wounded."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In 2007, the Implacable was shown for the first time as a game piece in the Ground Assault expansion of the Star Wars PocketModel trading card game by WizKids, a former division of Topps. It was printed on the styrene model as an unmarked Acclamator-class vessel, the image likely taken, unmodified, from a standard \"Republic assault ship\" stock image."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}