{"url": "Imprint", "categories": ["Category:Real-world articles", "Category:Wookieepedia Good articles", "Category:Hyperspace: The Official Star Wars Fan Club", "Category:Legends short stories from StarWars.com", "Category:Star Wars: Fate of the Jedi"], "nodes": [{"tag": "h1", "text": "Imprint"}, {"tag": "p", "text": "\"Imprint\" is a seven-page short story written by Christie Golden set a few years before, and tying into, the Fate of the Jedi series. The story, for which the cover was drawn by Ian Keltie, was included in the 2009 Star Wars Hyperspace membership kit. \"Imprint\" details how Sith Tyro Vestara Khai obtains Tikk, the uvak she uses for transportation in the second novel of the Fate of the Jedi series, Omen."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Publisher's summary"}, {"tag": "p", "text": "OMEN author Christie Golden wrote a short story that takes place before the events of the Fate of the Jedi series and features a lost tribe of Sith. This 7-page short story is an exclusive for Hyperspace members!"}, {"tag": "h3", "text": "Plot"}, {"tag": "p", "text": "In 37.5 ABY, ten-year-old Sith Tyro Vestara Khai and her father, Sith Saber Gavar Khai, attend Presentation, a festival in Tahv, the capital city of the planet Kesh. One of the events is a competition among the children of the Lost Tribe of Sith, which was stranded on the planet five thousand years earlier, to own a baby uvak—a winged reptilian creature that, once grown, could be used for transportation. Vestara, who is at Presentation specifically for this, takes a seat in the pen where the competition will be held and waits. When the event starts about fifteen minutes later, an incubation droid rolls into the ring, deposits twelve uvak eggs in the center, and then exits the competition area."}, {"tag": "p", "text": "The children, including Vestara, immediately begin attempting to force their will on the about-to-hatch uvaks through the dark side of the Force, the goal being to cause the uvak to \"imprint\" upon the competitor, thus claiming the uvak for their own. Vestara selects one of the eggs and focuses on it as the uvak inside emerges, quickly naming it Tikk due to the clicking sound it makes with its beak. However, another youth, the Keshiri Ahri Raas, picks the same uvak, and Vestara mentally battles with him over it. Raas begins to inflict pain on Tikk through the Force, and Vestara, angry at this, looks at Raas, imploring him to stop hurting the baby uvak. Startled, the Keshiri boy loses control of Tikk, who imprints upon Vestara. She gathers Tikk into her arms, and the hungry uvak nibbles her ear. Gavar, looking on from the spectator area, applauds his daughter's success."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "\"Imprint\" is a tie-in to the Fate of the Jedi novel series in the form of a seven-page short story. The story, placed four years before the events on Kesh shown in Omen—the second Fate of the Jedi novel—shows how Vestara Khai obtains the uvak that she is seen with in that novel."}, {"tag": "p", "text": "The story was released exclusively as part of the 2009 Star Wars Hyperspace fan club membership kit, which began shipping to members on July 17, 2009. It was written by Christie Golden—the author of Omen—and the cover, which features an image of Vestara Khai, was illustrated by Ian Keltie. The booklet also contained a Hyperspace welcome letter from Lucas Licensing Ltd. Executive Editor Sue Rostoni, as well as a welcome letter from Bantha Tracks editor Mary Franklin."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Khai and Raas, along with Tikk, were first introduced in Golden's Omen. Khai went on to become a lead character in the Fate of the Jedi series, while Raas did not, being killed off in Abyss, the next entry in the series. Tikk, whose birth was shown in \"Imprint,\" first appeared in Omen as a means of transportation for Khai, before being killed in the penultimate novel of the series, Ascension."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}