{"url": "In-iK", "categories": ["Category:Legends articles", "Category:Gree Enclave", "Category:Gree technology", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "In-iK"}, {"tag": "p", "text": "In-iK was a droid sent by the Gree Enclave to repair Coruscant during the Cold War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Sacking of Coruscant, the ecumenopolis of Coruscant required repairs. In Coruscant's distant history, the Gree had a hand in building some of Coruscant's infrastructure, so at some point during the Cold War the Galactic Senate reached out to the Gree for aid."}, {"tag": "p", "text": "Isolationists, the Gree themselves did not come. Instead, the Gree Enclave sent droid representatives to aid in the rebuilding efforts. These representatives included Pat-aK, the lead ambassador droid assigned to work with Senator Oranda, Hib-R-ak, the subordinate droid responsible for the waste processing system, Nam-aK, the droid assigned to the hydrosupply, and In-iK, the droid responsible for the power systems."}, {"tag": "p", "text": "Initially, the Gree droids had difficulty communicating with their Human collaborators due to their tendency to fall back on Gree speech patterns when their Basic speech programming was insufficient to convey their ideas."}, {"tag": "p", "text": "An agent of the Galactic Republic who had traveled to Coruscant on other business happened upon Oranda and Pat-aK attempting and failing a conversation and was able to discern much more about Pat-aK's troubles than Oranda was. The individual was able to determine that Pat-aK's subordinates had fallen under attack by hostile forces who had taken control of various sections of Coruscant's lower levels, interrupting the repair work. The Republic agent needed to access these areas anyway in the course of their other business, and so they agreed to take on some jobs for Pat-aK and Oranda to help repair Coruscant."}, {"tag": "p", "text": "After the individual, designated in the Gree language as a \"black bisector\", repaired the hydrosupply systems for Nam-aK and solved a problem with Ugnaught saboteurs for Hib-r-aK, they were contacted by In-iK. In-iK asked them to travel into The Works and repair three damaged power conduits. The individual succeeded in doing so, braving the rogue droids, Cthon, and Imperial forces within the Works and preventing planet-wide blackouts."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "In-iK and the other Gree droid ambassadors were largely similar to basic model protocol droids, but were somewhat dissimilar in their programming. These droids spoke some Basic but fell back on Gree speech patterns of colors and geometry when trying to explain concepts that they were unable to enunciate otherwise."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In-iK was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. After the Republic player has completed the missions \"Gree: Hydrosupply Leak\" and \"Gree: Ugnaught Saboteurs\" on Coruscant, they are given the mission \"Gree: Power Outage\" by In-iK. In-iK asks them to repair three power conduits within the Works, which will prevent a catastrophic power failure and city-wide blackouts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}