{"url": "In_His_Image", "categories": ["Category:Real-world articles", "Category:Legends short stories", "Category:Setkání v mlze", "Category:Short stories republished with novels", "Category:Vader: The Ultimate Guide articles"], "nodes": [{"tag": "h1", "text": "In His Image"}, {"tag": "p", "text": "In His Image is a short story written by Karen Traviss for Vader: The Ultimate Guide. It takes place in 19 BBY and details the creation of Force-sensitive stormtroopers. This story and its sequel, A Two-Edged Sword, were both included in the paperback version of Legacy of the Force: Betrayal."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "One month after the formation of the first Galactic Empire, Darth Vader and Emperor Palpatine begin looking for new troopers, troopers that would obey them. Vader inspects a trooper, who is unfamiliar with the features of his new helmet. After Vader dismisses the trooper, Vader asks his master, who was watching from behind the scenes what he thought."}, {"tag": "p", "text": "Palpatine believes that they still need more obedient troopers, and asks Vader and Sa Cuis (an Emperor's Hand) to go to the Parmel sector in the Outer Rim Territories. When Vader leaves the room, Palpatine asks Sa Cuis to assassinate Darth Vader."}, {"tag": "p", "text": "Later, Vader asks Sa Cuis and Erv Lekauf (Vader's helper) to give the cloners some of their DNA. Soon, Vader realizes that someone has set him up, so that Sa Cuis could kill him. Vader and Sa engage in combat, and Vader asks who he is working for. Cuis says that he will never tell, and Vader kills him."}, {"tag": "p", "text": "Vader then returns to Palpatine and his master tells him that he passed the test. Palpatine tells Vader that they will talk after he has a meeting with the Moffs. Vader then realizes that he is no longer a man or Jedi, but the first Jedi rule is still with him—survive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}