{"url": "Ananuru_Express", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Trains and railways"], "nodes": [{"tag": "h1", "text": "Ananuru Express"}, {"tag": "p", "text": "The Ananuru Express was a luxury monorail train which ran from Ananuru City on the planet Ananuru for tourists to view the unique scenery of the planet such as the \"dustbowls\". The train itself was highly luxurious and was designed to minimize the risks of foundering in a duststorm as well as any other dangers to its rich passengers. It ran on a monorail suspended above the dust seas and both it and the track were protected from the dust by forefields. The monorail was decided upon as it contained various sensor units which allowed the Express to be located quickly in the event of a breakdown whereas a free-traveling repulsorlift craft could easily disappear without a trace in the dust. No weapons of any kind were allowed on the train, and no exceptions to this rule were made."}, {"tag": "p", "text": "The train had two levels to it, the bottom containing a gym, library, videma, weapons locker, crew quarters, stores, and the engines as well as a turbolift to reach the upper level. The upper level contained two observation areas, one on each end of the train, as well as a casino, passenger suites, and a dining room. Each carriage led into the next, with every room bar the gym containing a set of stairs to reach the upper level as well as the single turbolift. The lower deck of each carriage had a way down to reach escape dust-skimmers for use in case of an emergency. The partitions of each carriage were well insulated. There were small bars serving drinks in the casino, dining room, and both observation decks while drink droids circulated the rest of the train."}, {"tag": "p", "text": "Sometime during the Galactic Civil War Hakon deVille, the owner of the Express, obtained a datatape from a secret Imperial RNA brainwashing virus project which had been destroyed under mysterious circumstances. He decided to auction the tape on the Express while it was on a sight-seeing tour of the planet. This attracted many individuals who were interested in obtaining the tape, including Imperial Intelligence agent Secesh Trant and a group of Rebels. Hakon arranged for a group of thugs to attack the train before the auction to test the capabilities of his passengers who managed to push them back. After this attack, several passengers attempted to locate the datatape so that they could make off with it before paying any money. Hakon had in fact hid the datatape in the sleeve of an obscure datachip in the library on the principle of hiding a leaf in a forest."}, {"tag": "p", "text": "The auction eventually went ahead, but when the bid hit 98,000 credits Trent stood up and took the datatape from Hakon, informing all passengers that they were guilty of treasonable activity. She gave them two options; either they continued running their organizations as they had done previously and accept an advisor from her agency or they could find the weight of the Empire coming down on them with full force. A group of Rebels along with Kane Mihal decided to start a fight and so Trant attempted to escape. She was eventually stopped, however, and the Rebel Alliance obtained then presumably destroyed the datatape."}, {"tag": "h2", "text": "Sources"}]}