{"url": "Incident_on_Bal%27demnic", "categories": ["Category:Legends articles", "Category:Battles in the Auril sector"], "nodes": [{"tag": "h1", "text": "Incident on Bal'demnic"}, {"tag": "p", "text": "The Incident on Bal'demnic was a mission undertaken by Bith Dark Lord of the Sith Darth Tenebrous, and his apprentice, the Muun Darth Plagueis, to the planet of Bal'demnic in 67 BBY."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 67 BBY, Subtext Mining provided Darth Tenebrous with secret intelligence revealing large deposits of cortosis ore within the planet's crust. Tenebrous acted on the new information personally, traveling to Bal'demnic with his apprentice, Darth Plagueis. Tenebrous believed by having two Sith Lords mining cortosis at the very apex of the Rule of Two era it would \"Close the Circle\"—a Circle that had begun with Darth Bane starting on the path towards darkness in the Apatros cortosis mines a millennium earlier."}, {"tag": "h2", "text": "The incident"}, {"tag": "p", "text": "In a crystalline cave, Tenebrous commanded Subtext's M-2 mining probe droid to verify the secret mining survey team's claims. During the process, the M-2 unit ceased taking orders from the Sith Lord, and proceeded to drill in the direction of a highly combustible pocket of lethane gas. Having sensed great danger, Tenebrous fled the cave with his apprentice. Before they were able to reach the surface, the Sith Lords were overcome by the large explosion caused by the M-2 unit's breach of the lethane pocket. The surrounding cavern ceiling collapsed, and both Master and Apprentice used the Force to prevent large slabs of rock that were falling to crush them and their ship."}, {"tag": "p", "text": "With Tenebrous distracted, Plagueis realized that the fear his Master had sensed earlier was his own death—at his apprentice's hands. With the Force, Plagueis sent the levitated slabs crashing down on Tenebrous, crushing him almost to death, and damaging his ship. After a brief exchange of words, Plagueis snapped his Master's neck, slowly killing him, when the Bith expressed disappointment in Plagueis for stranding himself on a planet where he was required to wear an enviro-suit. Plagueis then used the Force to observe Tenebrous' midi-chlorians slowly die as he died."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Over a long sleepless night, Plagueis traveled on foot utilizing a Force speed technique to cover hundreds of kilometers to Kon'meas Spaceport. There he stowed aboard the Woebegone, whose crew he killed whilst in transit, and took the ship to Muunilinst."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}