{"url": "Incident_on_Dac", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Dac", "Category:Battles of the Second Imperial Civil War", "Category:Duels"], "nodes": [{"tag": "h1", "text": "Incident on Dac"}, {"tag": "p", "text": "The Incident on Dac was a brief skirmish between the Imperial Knights Sigel Dare and Treis Sinde, which Jedi Master Asaak Dan intervened in to stop."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Sinde, who had been on Dac assisting the Mon Calamari Rangers, had been ordered to return to Bastion by Emperor Roan Fel. Sinde was reluctant to return, feeling that he was serving the Force by remaining on Dac to assist the Mon Calamari who were being targeted for extermination by Darth Krayt's Sith Empire. Emperor Fel, however, wanted the Knight to return to Bastion to train new Imperial Knights. To this end, he dispatched Master Dare to retrieve him."}, {"tag": "p", "text": "Dare used a shuttle obtained from the Galactic Alliance Remnant—which had been part of the complement aboard the Imperious-class Star Destroyer Alliance the Alliance had stolen several months earlier—to bypass Dac's security. She was accompanied by Jedi Master Asaak Dan, who was part of a delegation of Jedi sent to form an Alliance with Admiral Gar Stazi's Alliance Remnant."}, {"tag": "h2", "text": "Knight against Knight"}, {"tag": "p", "text": "As the pair rendezvoused with Sinde, the Knight informed Dare that, despite her efforts, he would not be returning with her. He felt that the Force wanted him to stay on Dac and assist the Rangers. His decision did not sit well with Dare, who ignited her lightsaber and told Sinde that she would kill him if he refused to return to Bastion. Sinde told Dare that an Imperial Knight's duty was not personally to the Emperor, but the Force as embodied by the Emperor (which was something he noticed younger knights were forgetting). Dare responded by attacking her former master."}, {"tag": "p", "text": "The two Knights continued dueling, until Master Dan intervened. After subduing Dare with a Force push, he offered a compromise. Dan thought that if Sinde truly felt the Imperial Knights were favoring duty to the Emperor over the Force, he should return to Bastion to teach them correctly. But he also felt that the Rangers needed someone to assist them, and offered to take Sinde's place with them if he returned to Bastion. Seeing the wisdom in Dan's offer, Sinde accepted and prepared to leave Dac with Master Dare."}, {"tag": "p", "text": "After the confrontation, Sinde scolded Dare for attacking Dan for trying to stop their fight. Dare said Dan had vexed her, but grudgingly admitted that he was brave and skilled."}, {"tag": "h2", "text": "Appearances"}]}