{"url": "Incinerator_rifle", "categories": ["Category:Legends articles", "Category:Incendiary weaponry", "Category:Rifles"], "nodes": [{"tag": "h1", "text": "Incinerator rifle"}, {"tag": "p", "text": "The Incinerator rifle was a type of weapon that was often used by Bothan spies of the Rebel Alliance to hide the evidence of their misdeeds."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Though technically no more powerful than a standard blaster pistol, the incinerator emitted an intense wave of heat that dissolved molecular bonds on any target it was fired upon. By the time the target was killed, the incinerator had broken molecular bonds to the point where the target simply lost all cohesion. Since any object destroyed by the incinerator was automatically disintegrated, one could kill a target and dispose of the body at the same time."}, {"tag": "h3", "text": "Variants"}, {"tag": "p", "text": "Another type of incinerator was essentially no different from an advanced flamethrower. Like a flame projector, this weapon fired streams of fire. Although it also had the capability to completely incinerate an organism, unlike the first type, the second variation left traces of ashes if allowed to burn an entire body. Also, it took much longer than a few seconds to disintegrate an organism using the flame projector variation."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Bothan spies, along with other members of the Renegade Squadron, were known to use this weapon. Most Bothan spies utilized the standard incinerator and used it in conjunction with a stealth field generator. This combination was used effectively in many battles of the Galactic Civil War, in which Bothan spies would sneak past the enemy lines and fire their incinerators at the unwary groups of stormtroopers. This allowed for very little time for them to react before being completely annihilated. The other members of the Renegade Squadron, however, tended to utilize the standard flame projector that was also known as the incinerator."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}