{"url": "Incom_Corporation/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic organizations", "Category:Galactic Republic organizations", "Category:Imperial organizations", "Category:Incom Corporation products", "Category:New Republic organizations", "Category:Repulsorcraft manufacturers", "Category:Shipwrights"], "nodes": [{"tag": "h1", "text": "Incom Corporation"}, {"tag": "p", "text": "The Incom Corporation, formerly known as Torranix Inertial Compensator Corporation, and also referred to as Incom Industries, or more commonly Incom for short, was a Fresia-based corporation known for designing and manufacturing robust, progressively-minded starfighters, airspeeders, and transports. They were renowned for their production of the T-65 X-wing starfighter, which became their logo and, most famously, a key tool and symbol of the Alliance to Restore the Republic during the Galactic Civil War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally, Incom focused on the design and manufacture of high-performance repulsorlift platforms. The most notable product of this was the construction of Bespin's Cloud City, circa 400 BBY. It later switched to specialization in atmospheric and space fighter-craft in 147 BBY, beginning a collaboration with Subpro Corporation that would last for over a century."}, {"tag": "p", "text": "Some time prior to 32 BBY, Incom also created some hull designs, including the T-06 hull for various starships."}, {"tag": "p", "text": "During the waning days of the Republic, Incom and Subpro produced several collaborative designs, including the popular Z-95 Headhunter line. In 22 BBY, though, HoloNet News reported that the relationship between the two companies was dissolved."}, {"tag": "p", "text": "Based on designs they'd formulated in collaboration with Subpro, Incom produced the Aggressive ReConnaissance-170 starfighter during the Clone Wars."}, {"tag": "p", "text": "When the staunchly independent company was nationalized by the Galactic Empire around late 1 BBY, much of its design and engineering staff defected. They made four prototypes of a new breed of starfighter available to the Rebel Alliance and took a course of action to bring the blueprints and production know-how to Alliance facilities."}, {"tag": "p", "text": "In reaction, Imperial officials rounded up the Incom engineers and scientists and expeditiously sentenced them to labor in the spice mines of Kessel. However, they were spared their fate when a Rebel task force led by Captain Raymus Antilles intercepted their transports and brought them into the Alliance's fold."}, {"tag": "p", "text": "Two months after the Battle of Yavin, Incom was able to donate prototype X-wings to the fledgling Rebel Alliance which were stored in isolation."}, {"tag": "p", "text": "The Incom corporation continued, in name, under Imperial contract, but never flourished as it once had. With its innovative soul gone, it only produced \"average\" fighters such as the I-7 Howlrunner. Several employees, not among the group that went off to Alliance service, and who had managed to slip away during the tumultuous days of the Imperial takeover, banded together and established FreiTek, Inc."}, {"tag": "p", "text": "In addition, Incom also manufactured the Y-85 Titan dropship which was used to deploy AT-AT and AT-ST walkers during the Battle of Hoth in 3 ABY. The Y-85 dropship was used begrudgingly by the Empire, which was still bitter towards Incom for supplying X-wings to the Rebellion."}, {"tag": "p", "text": "After the fall of Emperor Palpatine, Incom re-amalgamated itself into a cohesive company once again, with the FreiTek brand becoming a branch devoted to avionics and weapons. They modeled themselves after other similar technology fabricators, by maintaining neutrality and providing wares to both the New Republic and the Imperial Remnant."}, {"tag": "p", "text": "Like Sienar Fleet Systems, Incom had a number of subsidiary plants scattered around the galaxy, most notably one at Ranklinge in the Shelsha sector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}