{"url": "Incom_Corporation", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Alliance to Restore the Republic organizations", "Category:Galactic Republic organizations", "Category:Imperial organizations", "Category:Incom Corporation products", "Category:Shipwrights"], "nodes": [{"tag": "h1", "text": "Incom Corporation"}, {"tag": "p", "text": "Incom Corporation was a starship manufacturer in the galaxy whose designs included starfighters, airspeeders, and transports."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the High Republic Era, the Incom Corporation manufactured starfighters like the Z-24 Buzzbug and the Z-28 Skywing. They later gained additional prominence during the last years of the Galactic Republic, developing the multi-purpose and durable Z-95 Headhunter starfighter in cooperation with Subpro. With the outbreak of the Clone Wars, it produced a variant of the Z-95 that saw prolific use with the Republic Navy during the conflict, as well as the Aggressive ReConnaissance-170 starfighter, or ARC-170, which also saw service with the Republic."}, {"tag": "p", "text": "Incom later went on to develop at least two airspeeder designs for both military and civilian use; the T-47 airspeeder that the Rebel Alliance modified into \"snowspeeders\" on Hoth, and the popular T-16 skyhopper was used by youths on many worlds."}, {"tag": "p", "text": "However, Incom's most notable product was the T-65B X-wing starfighter used by the Rebel Alliance. Designed with the Z-95 and ARC-170 Clone Wars-era fighters in mind, the venerable snub-fighter, though initially in public use, was extensively fielded by the Rebel Alliance throughout the Galactic Civil War against the Galactic Empire."}, {"tag": "p", "text": "Shortly thereafter, Incom went go on to produce the UT-60D U-wing starfighter/support craft, as well as a civilian counterpart, the BT-45D U-wing. However, along with many other corporations during this period, Incom was Imperialized in order to be directly administered by the Empire, thus cutting short the production lines of craft like the U-wing. Despite this, by the time of the First Order's rise to power, Incom had reformed into Incom-FreiTek Corporation, which went on to produce the T-70 and the T-85 X-wing fighters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}