{"url": "Incremental-sequence_bomb", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bombs"], "nodes": [{"tag": "h1", "text": "Incremental-sequence bomb"}, {"tag": "p", "text": "The incremental-sequence bomb was an explosive device that was designed to detonate in sequences. The detonation patterns began as minor explosions and became more powerful with each subsequent explosion such that the final explosion was capable of destroying most starships. An incremental-sequence bomb was installed within a decoy vessel of the bounty hunter Boba Fett's starship, the Slave I. Around 1 ABY, fellow bounty hunters Bossk and Zuckuss boarded the decoy ship in the space outside the Bounty Hunters' Guild's headquarters to confirm whether Fett was on board; however, they discovered the ship to be a fake and accidentally triggered the bomb. Bossk and Zuckuss barely made their escape in time and were forced to put in for repairs after the bomb disabled Bossk's ship, the Hound's Tooth."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The incremental-sequence bomb was a black cylinder that was studded with biosensors and equipped with a miniaturized repulsorlift system. The device was capable of locking onto and tracking a target throughout its detonation sequence."}, {"tag": "p", "text": "Incremental-sequence bombs were designed to detonate in a three-part sequential pattern, with each explosion more powerful than the last. The first sequence of the bomb's detonation pattern was described as a minor explosion and was intended to lure the prey into assuming that the bomb was a mere distraction. The second explosion, however, was calibrated to throw the intended target off-guard, and the third and final explosion was large and destructive, able to disable or outright destroy most starships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 1 ABY, an incremental-sequence bomb was installed within a decoy of the Human bounty hunter Boba Fett's ship, the Slave I. The decoy vessel was encountered in orbit outside the perimeter of the Bounty Hunters' Guild's headquarters by the Hound's Tooth, piloted by fellow bounty hunters, the Trandoshan Bossk and the Gand Zuckuss, the former still ruminating over his failure to capture Nil Posondum—a bounty that Bossk had intended to acquire before Fett beat him to it. In his anger, Bossk, thinking that the ship was the real Slave I, fired at the vessel in an attempt to destroy the rival hunter before he could reach the Bounty Hunters' Guild."}, {"tag": "p", "text": "In order to confirm the kill, Bossk piloted and docked his ship with the supposed Slave I. He and Zuckuss boarded the vessel and explored its interior until Zuckuss discovered that it was a decoy. It was during that exploration that Zuckuss happened upon the incremental-sequence bomb. The device was triggered by the Gand's approach, forcing both he and Bossk to flee to the Hound's Tooth, barely escaping in time. The resulting explosions devastated Bossk's ship, and he and Zuckuss were forced to put in for repairs prior to returning to the Guild's headquarters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The incremental-sequence bomb was created by K. W. Jeter for his June 1998 novel, The Mandalorian Armor, the first book of The Bounty Hunter Wars trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}