{"url": "Incursion_in_the_Bormea_sector", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Cleanup", "Category:Battles in the Bormea sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Incursion in the Bormea sector"}, {"tag": "p", "text": "An incursion into the Bormea sector was conducted by the Galactic Empire, which began by sending IGV-55 surveillance vessels acting as jamming ships in order to break New Republic communications. The incursion escalated with more Imperial forces began appearing in the sector, which Republic Commander Lindon Javes believed was a prelude to invasion."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The New Republic began experiencing communication blackouts and a patrol around the Bormea sector had gone missing. Lindon Javes, recently promoted to commander of the MC75 Star Cruiser Temperance, ordered Vanguard Squadron to investigate. They were split into two teams; Feresk, Grace, and Vanguard Five looked for the missing scouts, while Gunny and Keo Venzee headed off looking for the cause of the communication disturbance."}, {"tag": "h2", "text": "Battle"}, {"tag": "p", "text": "Feresk's group jumped to the planet, where they found the remains of the scouts, with no survivors. Suddenly, they were ambushed by a Imperial Gozanti-class cruiser, which immediately deployed four TIE fighters to attack, but the forces were quickly taken out. Realizing that their friends were walking into a trap, they scanned the Gozanti wreckage and began to look for their friends. Feresk's group ran into two IGV-55 surveillance vessels and their escort of six TIE fighters. The trio attacked and destroyed the jamming ships, freeing up communications within the area. They weren't able to contact the fleet, but were able to find Gunny and Keo, who had already engaged an Imperial force of one Arquitens-class command cruiser, two more Imperial jammer ships, and their TIE fighter escort. The group first targeted the fighters, only to get more reinforcements via a Gozanti cruiser that entered the battle, dropped off four additional TIE fighters, and then quickly retreated. Together, Vanguard Squadron was able to take out the fighters and jammers, freeing up communications, but needed to call in help to finish off the Arquitens. Lindon sent in two CR90 corvettes to assist them in destroying the cruiser."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Communication was restored within the New Republic. This allowed Wedge Antilles to get a message through to the Temperance and requested assistance in capturing an Imperial II-class Star Destroyer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}