{"url": "Industrial_Automaton/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Corporate Sector Authority voting sponsors", "Category:Droid manufacturers", "Category:Industrial Automaton products"], "nodes": [{"tag": "h1", "text": "Industrial Automaton"}, {"tag": "p", "text": "Industrial Automaton (IA) was one of the two primary droid manufacturers in the galaxy, the other being Cybot Galactica. IA was a company specializing in droids for all trades and walks of life. Its most popular products were the R-series astromech droids, in particular the versatile R2-series."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Industrial Automaton was formed over 850 years before the rise of the Empire with the merger of Industrial Intelligence and Automata Galactica. Industrial Automaton became a vastly wealthy company, and vied for control of the droid market with fellow manufacturing giant Cybot Galactica. These rival companies were known as the \"Big Two\" of droid production. IA was known for its high-precision merchandise and deep discounts, and was ruthless enough to survive during the reign of the Galactic Empire. The company was also one of the first Contributing Sponsors of the Corporate Sector Authority. IA maintained factories in many locations, including Rordis City on Nubia."}, {"tag": "p", "text": "Industrial Automaton came to monopolize the droid market through production of its most popular creation; the R-series astromech droids. While early models were deemed a critical failure, IA's R2-series astro-droid became beloved across the galaxy. The success of the R2 led to further R-series models, including the R4 units often used as navigators by Jedi starfighter pilots, and, during the era of the New Republic, the advanced R7 and R8 models. While these designs proved successful, others were not so well received; Industrial Automaton was forced to cancel production of its R5-series droids after poor sales, and later limited the warranty on astromech booster rockets after a series of injuries caused by falling droids."}, {"tag": "p", "text": "Despite these minor setbacks, Industrial Automaton remained a constant presence in the droid market, thanks not only to its astromech designs, but also to the rest of its varied production line. Industrial Automaton created protocol droids such as the LOM-series and the SE4 servant droid, labor droids including ASPs and FLR Loggers, and security droids in the form of Mark IVs and Hound-W2 SPD units. In addition to its droids designs, IA produced a number of automated devices, including targeting computers, that were powered by droid brains."}, {"tag": "p", "text": "Prior to the Dark Nest Crisis, Industrial Automaton produced the R9-series astromech, though during the conflict, the company was purchased by Bornaryn Trading, owned by Aryn Dro Thul."}, {"tag": "h2", "text": "Products"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}