{"url": "Inertial_compensator", "categories": ["Category:Legends articles", "Category:General starship components"], "nodes": [{"tag": "h1", "text": "Inertial compensator"}, {"tag": "p", "text": "The inertial compensator, also known as the inertial damper, acceleration compensator, deceleration compensator, deceleration equalizer, or drive compensatorwas a technology used in starships, especially in starfighters and other high-performance vessels. It compensated for the intense accelerations that a spaceship underwent in the course of its normal activities; without compensators, ships would either have to accelerate much more slowly, or cause a blackout to or even kill their occupants with excessive g-forces."}, {"tag": "p", "text": "An average Human was capable of surviving around 5 gs, while a trained human in a flight suit was generally capable of surviving around 9 gs without suffering of negative effects. Even larger ships such as the Executor-class Star Dreadnought were capable of accelerations of over 1000 gs, which was well above lethal levels of acceleration, necessitating the use of inertial compensators on practically every ship."}, {"tag": "p", "text": "Inertial compensators were often dialed back from full power by experienced pilots (from 97 to 95 percent), giving them just enough inertia to feel how the ship was performing without negatively impacting their ability to pilot the ship."}, {"tag": "p", "text": "Though used primarily in starships, an inertial compensator could be installed in an airspeeder. Senator Simon Greyshade used one in his custom Narglatch XJ-6 airspeeder to protect riders from the harsh maneuvers the craft was capable of."}, {"tag": "p", "text": "Inertial compensators were also used in simulators, making them more realistic by creating artificial sensations of acceleration. They were also used in Senate Building turbolifts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The 1998 Star Wars Encyclopedia has an \"acceleration compensator\" entry, which says these are used in \"medium- and larger-sized spacecraft such as the Millennium Falcon.\" However, earlier books, such as X-Wing: Rogue Squadron, depict acceleration compensators in X-wings."}, {"tag": "p", "text": "Inertial compensators may or may not be the same as repulsor-compensators."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}