{"url": "Infantry/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles needing additional sources", "Category:Military units", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Infantry"}, {"tag": "p", "text": "Infantry were an essential component in any power's armed forces. They often made up the bulk of invasion forces, and were used to defend key installations from the enemy. These soldiers were commonly on foot, although they could be transported to and from battles by vehicles such as dropships. The B1-Series battle droids of the Trade Federation would be delivered to battle fields using the Multi-Troop Transport."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "Infantry were normally equipped with a blaster rifle or some other firearm, and sometimes grenades and a sidearm (normally a blaster pistol). Throughout galactic history, numerous armies have equipped their infantry with specially designed combat armor. Examples of this included the stormtrooper armor for Imperial stormtroopers and clone trooper armor for Republic clone troopers."}, {"tag": "h3", "text": "Anti-infantry tactics"}, {"tag": "p", "text": "Vehicles and tactics that were designed to counter infantry were referred to as \"anti-infantry.\" The All Terrain Recon Transport (or AT-RT) was an anti-infantry vehicle. The HMP droid gunship was an effective craft for destroying infantry and armored units."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Republic Infantry was a division in the army of the Republic Military that fought battles during the Old Republic era. B1-Series battle droids were often used as droid infantry for the Separatists during the Clone Wars, while the Galactic Republic relied on clone troopers to form the bulk of their forces to fight the droid army."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}