{"url": "Infantry_Support_Platform/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic repulsorcraft", "Category:Aratech Repulsor Company products", "Category:Galactic Empire vehicles", "Category:Galactic Republic vehicles", "Category:Hutt Cartel vehicles", "Category:Uulshos Manufacturing products", "Category:Zann Consortium vehicles"], "nodes": [{"tag": "h1", "text": "Infantry Support Platform"}, {"tag": "p", "text": "The Infantry Support Platform (ISP), also known as the swamp speeder, was a repulsorlift speeder first deployed by the Grand Army of the Republic for swamp combat during the late Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It had a semi-circular base protected by a red-and-white armored shell. Mounted on the rear was a large turbofan, which, working with the speeder's repulsorlift drive, propelled the craft through swamps. The 100 kph thrust-fan provided both forward propulsion and a precise braking airblast when reversed."}, {"tag": "p", "text": "It was crewed by two clone troopers that sat on either side of the engine, operating controls or firing the vehicle's two forward-mounted blaster cannons. The cannons are able to cause damage to light-armored targets, and with a precise hit, can rupture heavier targets as well."}, {"tag": "p", "text": "These twin-blasters were highly effective against infantry forces such as B1-Series battle droids and B2 super battle droids, and even the larger units such as the NR-N99 Persuader-class droid enforcers and Heavy Missile Platforms encountered on Felucia and Kashyyyk."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was one of many specialized speeders created towards the end of the Clone Wars and a heavy variant of the BARC speeder. A terrain laser scanner was fitted to the speeder's underside, allowing clone troopers to scout the environment for any foes. It was notably used during the Battle of Kashyyyk and the Battle of Mygeeto."}, {"tag": "p", "text": "Like many other vehicles of the Galactic Republic, the swamp speeder was used during the Galactic Civil War by both Imperial and Rebel forces. Additionally, pirate and planetary organizations would acquire and utilize some units. These would then be used to conduct raids, protect fortresses, or aid allied factions. The most notable organizations to use them were Black Sun, the Hutt Cartel, and the Zann Consortium."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Concept artist T.J. Frame was tasked with developing vehicle designs when he first joined the Episode III Art Department. One of his earliest designs was an extrapolation of a Star Wars-style swamp boat, inspired by the fanboats used here on Earth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}