{"url": "Inexorable_(Imperial_I-class)", "categories": ["Category:Legends articles", "Category:Imperial I-class Star Destroyers of the Galactic Empire", "Category:Starships of Thrawn's fleet"], "nodes": [{"tag": "h1", "text": "Inexorable (Imperial I-class)"}, {"tag": "p", "text": "The Inexorable was an Imperial I-class Star Destroyer that served in the Imperial Navy during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. This ship was present and helpless when the Rebellion captured the shuttle Tydirium shortly before the Battle of Endor but it was best known for its role during Grand Admiral Thrawn's campaign against the New Republic in 9 ABY. As one of the main ships of Thrawn's fleet, the Inexorable fought at the battles of Bpfassh and Sluis Van."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Inexorable was a standard Imperial I-class Star Destroyer. It was a 1,600 meters long warship armed with turbolasers, ion cannons and tractor beam projectors. The ship also carried a complement of TIE starfighters, terrestrial troops and various ground vehicles. Due to the limitations placed upon the Empire after the Battle of Endor, the TIE complement had been reduced from six to three squadrons by 9 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Inexorable was constructed by the Galactic Empire at the Kuat Drive Yards shipyards on Kuat during the Galactic Civil War between the tyrannical Empire and the Alliance to Restore the Republic. It was nearing completion in 3 ABY. Shannon Voorson, the daughter of Kuat Freight Port officials Johan and Nell Voorson, was able to slice its name in an Imperial database along with several other Star Destroyers names and gave it to her cousin, Deen Voorson, a member of the Rebellion."}, {"tag": "p", "text": "In 4 ABY, the Inexorable was seen undergoing weapons testing along with the Imperial-class Star Destroyers Chimaera, Nemesis and Stormhawk in the Carida system. Rebel pilot Ace Azzameen's Otana mistakenly emerged from hyperspace near the Star Destroyers but managed to escape. The Inexorable followed the Otana to the Zhar system but arrived too late to prevent Azzameen and Rebel fighters to steal the Tydirium. This shuttle was later used by the Rebels to allow their great victory at the Battle of Endor."}, {"tag": "p", "text": "After the Battle of Endor, the Inexorable was part of the small Imperial fleet that was commanded by Thrawn, a misknown Imperial Grand Admiral on a mission in the Unknown Regions."}, {"tag": "p", "text": "In the later years, the Rebellion, now known as the New Republic, had become the legitimate galactic government. In 9 ABY, the Inexorable served in Grand Admiral Thrawn's campaign against the New Republic after his return to the known galaxy. The Inexorable was part of the task force of five Star Destroyers led by the Grand Admiral himself and coordinated by the Dark Jedi Joruus C'baoth. During that campaign, Inexorable participated in the Battle of Bpfassh where it destroyed the New Republic starfighter base on the third moon of Bpfassh. Thrawn also used the ship to test a prototype cloaking device, after getting schematics from the secet Imperial storehouse on the planet Wayland. The Inexorable later fought at the Battle of Sluis Van, a failed attempt to steal a large fleet of starships at Sluis Van, a major New Republic shipyard."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Director of Imperial Intelligence Ysanne Isard decided to transfer Major Wortin from the Interdictor Black Asp to the Inexorable as a punishment for his \"incompetence\" in capturing Rogue Squadron pilot Bror Jace in 6 ABY."}, {"tag": "p", "text": "The New Republic Intelligence ignored the identity of the Inexorable's captain at the time of Thrawn's campaign."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Inexorable was created by Timothy Zahn in 1991 book Heir to the Empire. The Heir to the Empire Sourcebook describes it as one of the ship of Thrawn's core fleet but it is not mentioned in the two next books of the Thrawn Trilogy."}, {"tag": "p", "text": "Star Wars: X-Wing Alliance classifies the Inexorable as an Imperial II-class Star Destroyer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}