{"url": "Infiltration_of_Hivebase-1", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Missions of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Infiltration of Hivebase-1"}, {"tag": "p", "text": "In 0 ABY, the Tarkin Initiative's Hivebase-1 was infiltrated by Doctor Aphra, rebel general Hera Syndulla and a group of mercenaries hired by the Son-tuul Pride to recover the memories of the crime lord 0-0-0. They were able to enter the complex by luring in the rebel flight school to distract its defenses. Inside, they found a room of rejected prototypes and listened in as Magna Tolvan took control of the flight school. Aphra convinced her to not destroy it, but her presence in Hivebase-1 was given away."}, {"tag": "p", "text": "The prototypes were defrosted and they attacked the mercenaries. When Tam Posla refused to use his cybernetic weapons to help them, Aphra had his soulmate, Caysin Bog, run into the crossfire. As his partner died, the enraged Posla attacked the prototypes and the others escaped at the same time. They reached the datacore and Posla caught up, soon followed by the Imperial Commander Yewl and a squad of Death Troopers and Hutt clone troopers. As the two sides fought, Aphra controlled the flight school through a bug she had planted and had it seize the datacore, as well as destroying Hivebase-1 with a mass of explosive Tookas."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Doctor Chelli Lona Aphra was being blackmailed by the droid Triple-Zero, who had recently commandeered the criminal gang known as the Son-tuul Pride. She was forced to work with a team of mercenaries, comprising of Tam Posla, Caysin Bog, Sister Six, Rabael Dir Glorio, Dek-Nil, Glahst Ombra and Rexa Go, to search for the droid's original memories. Aphra first left behind Glorio to reduce the weight load of their stolen ship."}, {"tag": "p", "text": "The team went to Skako Minor to search an abandoned Techno Union facility, where Wat Tambor had observed the Triple-Zero protocol personality matrix. There, Aphra and the others were betrayed by their Skakoan guide Hallio Bas, who had led them into a trap. Aphra got them out of it by offering Bas her explosive Tooka Flufto and detonating it. They entered the facility where they were ambushed by more Imperials led by Magna Tolvan. The skirmish activated one of the facility's machines and Ombra fled the scene. After defeating both threats, Rexa discovered Aphra with Tolvan and Aphra shot her. They returned to their ship, with Ombra, and Aphra discovered that Triple-Zero's memories were in the R&D headquarters of the Tarkin Initiative, Hivebase-1."}, {"tag": "p", "text": "Wasting no time, Aphra devised a plan to infiltrate the base and get the memories. She took her team to a rebel flight school where they attempted to get Alliance General Hera Syndulla on board. The Twi'lek imprisoned them when she realized they were mercenaries. During that time, it was discovered that Ombra was really Tolvan wearing her skin and a short confrontation ended up freeing the mercenaries. The mercenaries earned Syndulla's trust by staying in their cells and Syndulla agreed to hear their plan. Sister Six, however, stunned Syndulla and they fled the flight school with her. Once away from the rebels, Aphra contacted Hivebase-1 and offered to turn in Syndulla."}, {"tag": "h2", "text": "The infiltration"}, {"tag": "h3", "text": "Sneaking into Hivebase-1"}, {"tag": "p", "text": "On their way to Hivebase-1, Aphra helped fix Bog's diagnostics which had been damaged at Skako. But as she did that, she also programmed a contingency order into him. Aphra also stopped jamming the frequency of the tracker on Syndulla's General plaque to have the other rebels follow them. Upon arrival at Hivebase-1, Commander Yewl gave them a fixed route to follow and had them escorted until the rebels arrived. The flight school jumped into the area and found itself under attack from the scaraphyte swarm."}, {"tag": "p", "text": "The rebel presence allowed Aphra's ship to sneak into the base with the Imperials distracted. Once on there they entered a room full of failed or rejected prototypes. Meanwhile, the flight school had lost it's shields and the outer decks were beyond repair. Bini attempted to deploy X-wing starfighters but was knocked out by Tolvan, who took control of the bridge and contacted Yewl to notify him of her victory. Yewl ordered Tolvan to destroy the flight school which would kill her in the process. Aphra's pleading over the comms convinced her otherwise. Tolvan contradicted Yewl by stating Imperial protocol was to capture the ship. Unfortunately for Aphra's crew, Tolvan then notified Yewl of their presence."}, {"tag": "h3", "text": "Under heavy fire"}, {"tag": "p", "text": "Yewl ordered the prototypes to be defrosted, and Aphra's team fell under attack from the surrounding cyborgs. Dek-Nil was shot in the crossfire and the others were forced to fall back into cover. Aphra begged Posla to help them out with his cybernetic weapons, but the former cop, claiming they were only victims of experimentation. Aphra therefore activated the contingency programmed into Bog, and the Decraniated prototype advanced into the crossfire, dying instantly. Both shocked and furious, Posla mobilized his array of cybernetic weapons began firing at the army of cyborgs whilst the others retreated."}, {"tag": "p", "text": "Aphra, Six and Syndulla found a terminal at the datacore of Hivebase-1, where they began looking for Triple-Zero's lost memories. Posla caught up with them following his face off with the prototypes and Syndulla began deducing what exactly had happened to Bog. Aphra managed to silence her before she said a word to Posla about the true nature of Bog's death and Six gave her a gun to help protect them. Syndulla, however, pointed her gun at the three mercenaries. She, though, was quickly disarmed by Yewl, who had arrived with two Hutt clone troopers and six death troopers. The logistics cyborg ordered the capture of Syndulla and the deaths of the others."}, {"tag": "p", "text": "Thus another firefight ensued, and Aphra's side took cover. Syndulla covered Aphra while she got to a terminal and began putting together her plan. She had bugged the flight school's control core during her visit there. She used this to control the ship and make it latch onto Hivebase-1. It's X-wings then deployed and back at Aphra's ship, the rest of her Tookas escaped their crate and began roaming the base. As for Commander Yewl and his forces, she shut them out using the base's vaccume seals, forcing them to retreat to their control base. The flight school's X-wing starfighters then towed the data core to it and soon enough, an officer at the control core noticed a new name in the firing registry. It was the code phrase to detonate the Tookas and when he said it, the entirety of Hivebase-1 exploded."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After receiving the datacore, Syndulla congratulated Aphra and the remainder of her crew for what they did to get it. She offered them a ship to get off and Aphra took it. While Aphra was talking to Syndulla, Posla had been sent to find Tolvan in the vents. Tolvan tied him up and took his armor before revealing the location data as he left with Aphra. Sister Six stayed with the rebels, leaving Aphra with only Tolvan. After they parted ways, Tolvan went to Son-tuul with Imperial forces and attacked the Son-tuul Pride, capturing Aphra in the process. Aphra was then imprisoned in Accresker Jail and forced to fight in its convict army."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}