{"url": "Infiltration_of_the_Imperial_Armory_Complex", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Missions of the Galactic Civil War", "Category:Missions to Lothal"], "nodes": [{"tag": "h1", "text": "Infiltration of the Imperial Armory Complex"}, {"tag": "p", "text": "In 2 BBY, the rebels Morad Sumar, Kanan Jarrus, Ezra Bridger, and Chopper infiltrated the Imperial Armory Complex on Lothal. Their mission coincided with an inspection led by Grand Admiral Thrawn to investigate the high rate of sabotage within the factory. Despite Morad being killed by Thrawn during a test demonstration on a 614-AvA speeder bike, the Spectres managed to obtain the blueprints for a prototype TIE fighter. They escaped the factory with the help of the disillusioned Imperial Security Bureau Agent Kallus, who had become an informant for the rebellion. As a result of the rebel attack, Thrawn realized that the Galactic Empire had a traitor among their ranks."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Age of the Empire, the Galactic Empire established a major military presence on the planet Lothal. With the collaboration of Governor Arihnda Pryce, Lothal became the headquarters of the local Imperial presence in the Lothal sector. After escaping an Imperial prison in 3 BBY, the former Lothalian governor Ryder Azadi established a rebel cell based at a stone circle in Lothal's wilderness. This rebel cell consisted of Lothalian residents who were disaffected by the Empire's policies, including the farmers Morad and Marida Sumar, and the Ithorian bartender Jho."}, {"tag": "p", "text": "By 2 BBY, Ryder's resistance cell had embarked on a campaign of sabotaging Imperial vehicles at the Imperial Armory Complex, which manufactured armored walkers, 614-AvA speeder bikes, and TIE fighters for the Imperial Military. This led to a high rate of accidents, injuries, and fatalities among Imperial military personnel. Eventually, Imperial High Command took notice of the suspiciously high rate of accidents involving vehicles manufactured at the Lothal factory and sent Grand Admiral Thrawn to investigate."}, {"tag": "p", "text": "Meanwhile, the rebel cell Phoenix Cell had decided to take out the Imperial Armory Complex on Lothal. Since they lacked a presence on Lothal, they contacted Ryder's resistance cell for help. Phoenix Squadron also received information from Fulcrum that the Empire was developing a new secret weapon at the facility. This Fulcrum agent turned out to be the disillusioned Imperial Security Bureau Agent Alexsandr Kallus, who had become sympathetic to the rebels following his encounter with the Lasat rebel Garazeb Orrelios on Bahryn. He had also helped the Mandalorian Sabine Wren escape Skystrike Academy with two defecting cadets during an undercover mission. Phoenix Leader Hera Syndulla dispatched her crewmembers Kanan Jarrus, Ezra Bridger, and Chopper to infiltrate the factory and gather intelligence on this new secret weapon."}, {"tag": "p", "text": "The crew of the Ghost rendezvoused with Ryder's speeder outside Capital City. After fighting off an AT-DP walker and two speeder bikes, the rebels escaped to Ryder's stone circle encampment in Lothal's wilderness. There, the rebels discussed their information and plans. The former farmer Morad, who now worked as a factory worker at the Imperial Armory Complex, agreed to help Kanan, Ezra, and Chopper infiltrate the factory. Morad informed the rebels that the Empire had tightened security around Section A2 and suspected the plans for the secret weapon were being stored there."}, {"tag": "h2", "text": "Undercover mission"}, {"tag": "h3", "text": "Evading the lockdown"}, {"tag": "p", "text": "Morad, Kanan, Ezra and Chopper infiltrated the Imperial Armory Complex disguised as factory workers and an Imperial astromech droid respectively. The rebels arrived just in time for an Imperial inspection conducted personally by Grand Admiral Thrawn himself. In the presence of Governor Arihnda Pryce, Agent Kallus, and Lieutenant Yogar Lyste, Thrawn gave a speech reprimanding the factory workers for the high rate of accidents caused by vehicles manufactured at their factory. As a deterrent, Thrawn forced Morad to demonstrate the last 614-AvA speeder bike he had inspected. Using a simulator, Thrawn accelerated the speeder to its maximum speed. This caused the faulty engine to overheat and explode, destroying the bike and killing Morad."}, {"tag": "p", "text": "Following Morad's death, Thrawn took the opportunity to warn the workers that they would be responsible for personally testing the vehicles they built. Thrawn then ordered his subordinates to impose a lockdown on the factory and screen every worker. Kanan tried to contact Ryder to warn Hera, but found that the Imperials were jamming their signals. With a security screening underway, Kanan and Ezra realized they had to escape and got Chopper to stage a distraction by destroying a speeder bike."}, {"tag": "p", "text": "After escaping the security screening, the two rebels proceeded on their mission to reach Section A2. Ezra warned Kanan that they would have to get new disguises since the workers were on lockdown. Fortuitously, they ran into a stormtrooper and scout trooper, who the two Jedi promptly knocked out and stripped of their uniforms. After losing contact with Kanan, Ezra and Morad, Ryder contacted Hera via hologram and informed her about the new Imperial officer. Hera recognized the officer as Grand Admiral Thrawn, whom she had encountered earlier on Ryloth. Ryder planned to launch a diversionary attack on the factory's east gate to distract Thrawn."}, {"tag": "h3", "text": "Stealing the plans"}, {"tag": "p", "text": "Ezra, Kanan, and Chopper soon managed to reach Section A2 in their disguises. However, the chamber was guarded by stormtroopers who would only admit R4 courier droids carrying clearance codes. Thrawn had ordered anyone not carrying his personal code in Section A2 to be terminated on sight. Continuing his inspection, Thrawn forced another factory worker to admit that he had inspected an AT-DP on display. Thrawn had Agent Kallus make the walker step forward. When that walker collapsed, he ordered the man's arrest."}, {"tag": "p", "text": "Later, Thrawn was informed of the missing workers by Lieutenant Lyste, and realized that rebel infiltrators had breached the factory. Lyste also told Thrawn that the workers' uniforms had been found, leading him to conclude that the rebels had already found new disguises. He ordered Agent Kallus to secure Section A2."}, {"tag": "p", "text": "Despite Thrawn's stringent precautions, the Ghost crew managed to elude the Imperial guards by incapacitating a courier droid and stealing its clearance code. This allowed Chopper to enter the room and download the design database. Before Chopper could finish his work, Kanan and Ezra were confronted by a stormtrooper corporal and his men, who demanded to know why they were outside their perimeter. Kanan claimed that they were on guard duty."}, {"tag": "h3", "text": "An unlikely ally"}, {"tag": "p", "text": "While the corporal did not buy it, Chopper emerged from the room at that moment. Ezra swiftly claimed that he and Kanan had mistaken Section A2 for Section B17, and the three rebels walked away, only to turn a corner and find Lyste giving stormtroopers orders about establishing a lockdown. They were pursued by the corporal and his troopers as they fled in the other direction. Arriving at a bank of turbolifts, Kanan hit the call button but got no response. He suggested that things might get \"messy,\" but a lift opened to reveal Agent Kallus, who ordered the disguised rebels inside, supposedly to help him secure the perimeter. Inside, Kallus revealed that he knew who the rebels were. Following a brief fistfight, Kallus revealed that he was Fulcrum, managing to convince the rebels of this by using his code phrase and citing his past encounters with their comrades Zeb and Sabine. Kanan and Ezra were still suspicious, but solicited Kallus' help in reaching a communications station so that they could transmit a signal on their comlinks to Ryder. Kallus obliged, and the rebels managed to storm a communications station and stun the stormtroopers and Imperial officer stationed there."}, {"tag": "p", "text": "Once there, Chopper unlocked Kanan and Ezra's comlinks, not needing Kallus' offered access codes. Kanan managed to contact Ryder, who revealed that he was preparing to launch an attack on the east gate. Kallus advised the rebels to escape on an AT-DP walker in the east gate's hangar bay. To conceal Kallus' dealings with the rebels, Ezra hurled the ISB agent through a glass monitor board to make it look like he had put up a fight against them. By this stage, Thrawn had studied the history and art of the crew of the Ghost. After linking the missing factory workers with the unregistered C1-series astromech droid known as Chopper, Thrawn deduced that the rebels were being helped by someone within the Imperial hierarchy."}, {"tag": "h3", "text": "Escaping the armory"}, {"tag": "p", "text": "At that point, Ryder and his rebel cell launched an attack on the east gate, damaging at least one Imperial Troop Transport. Reasoning that Ryder's forces had attacked in order to create a distraction for the rebels to escape, Thrawn decided to play the rebels' game. In response to Ryder's attack, Lieutenant Lyste sent the two AT-AT walkers 271 and 414 to engage the insurgents. Thrawn allowed Lyste to dispatch reinforcements in order to lure Ezra and Kanan into a trap. The crew of the Ghost took the bait and rode out on the AT-DP Walker 216 under the pretext of helping the AT-ATs fight the rebel attackers."}, {"tag": "p", "text": "The AT-ATs asked what Walker 216 was doing at the east gate, and Ezra claimed that they were reinforcements. Studying the rebels' escape patterns, Thrawn realized the rebels had stolen an AT-DP walker and ordered the AT-AT pilots to destroy the walker the rebels had hijacked. Ezra managed to maneuver his walker under one of the AT-ATs. However, the AT-AT pilots aboard proceeded to use their heavy walker to crush the rebels' smaller walker. Ezra and Kanan used their lightsabers to cut themselves and Chopper out of the doomed transport and board the AT-AT walker. After dispatching the pilots, their hijacked AT-AT walker was hit by a rocket fired by Marida, the wife of the late Morad Sumar. She and Ryder had witnessed the hijacked AT-DP exploding, and believed Kanan and Ezra to be dead. Kanan and Ezra managed to fire on and destroy the other AT-AT before their walker collapsed. Exiting the AT-AT walker, the three rebels fled with Ryder, Jho and Marida on two landspeeders."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Returning to Ryder's hideout, Ezra, Kanan, and Ryder were able to send the information from Chopper's memory banks to Sabine, who decrypted them. As a result, the rebels discovered that the Empire was working on a new prototype TIE Interceptor, that was equipped with a deflector shield. The rebels feared that if the Empire produced this new fighter in large numbers, it would pose a danger to the rebellion and their pilots. Ezra and Kanan also informed Hera, Sabine, and Zeb about Kallus assisting their escape. The other Spectres were absolutely shocked, and Zeb deduced that he must have \"accidentally\" recruited Kallus back on Bahryn. Distrusting him, Hera decided that they would wait and see what kind of game their new ally might be playing."}, {"tag": "p", "text": "Back on Lothal, Thrawn discussed his suspicion with Governor Pryce and Agent Kallus that the Empire had a mole among their ranks who was assisting the rebellion. When Governor Pryce advocated questioning all Imperial personnel, Thrawn advised against a mass crackdown. Instead, he proposed setting up a trap for the informant in order to turn that individual into an Imperial \"asset.\" Thrawn wanted to wait for the spy to make their next move. Feigning loyalty, Kallus commended the Admiral for his \"flawless\" strategy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The infiltration of the Imperial Armory Complex serves as the main plot of the Star Wars Rebels episode \"An Inside Man,\" which premiered on Disney XD on December 3, 2016. The episode also featured the TIE Defender, a starfighter which had appeared in several Star Wars Legends products."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}