{"url": "Infiltrator_(armor)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic Special Forces units"], "nodes": [{"tag": "h1", "text": "Infiltrator  (armor)"}, {"tag": "p", "text": "Infiltrators were a special unit of soldiers trained by Beri Tulon to cut their way into Imperial armored vehicles, especially walkers, and take control."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Imperial general Brenn Tantor defected to the Rebel Alliance, he promised to General Tyr Taskeen that he would deliver an AT-AT walker to the Rebellion. In order to do that, he freed Colonel Beri Tulon from imprisonment on Ruul. Tulon, an Imperial who was caught attempting to defect, had served at the Trasse Proving Grounds, where AT-ATs were manufactured and tested."}, {"tag": "p", "text": "Tulon returned to his roots as a training officer by recruiting several soldiers and training them specifically to infiltrate AT-ATs for the upcoming Mission to Trasse. The infiltrators proved up to the task, capturing at least one walker for the Rebellion and surviving the Imperial counterattack afterward. They went on to serve with Tantor throughout his career, up to the capture of Coruscant at least. Tantor frequently used them to seize enemy walkers sent against him and turn them against the enemy."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The infiltrators wore combat suits similar to those of standard Rebel infantry, but all in black. They were also equipped with jetpacks, which allowed them to boost up to the underside of an AT-AT walker, where they could cut through. They clearly carried the tools to cut through the heavy armor of the walkers, and also carried standard-issue blaster rifles."}, {"tag": "h2", "text": "Training and skills"}, {"tag": "p", "text": "All infiltrators were trained specifically to enter and capture Imperial AT-ATs, but also had the skills necessary to capture AT-STs, and their skills could likely transfer to entering other vehicles, though their knowledge of weak spots may have been less. They were also trained to operate Imperial heavy armor, though they initially had some difficulty maneuvering the large walkers swiftly in combat situations. The infiltrators were also generally very skilled at close-quarters indoor combat and could be used to take buildings. Given these skills, it is most likely that the initial recruits were elite urban fighters trained to operate walkers, not the other way around."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The infiltrators were created for the game Star Wars: Force Commander in order to allow the player character to capture and operate AT-ATs as a Rebel, as the Rebels otherwise lacked comparable heavy armor. They are also the best in-building fighters in the game, with statistics higher than stormtroopers, Rebel troopers, or Rebel heavy troopers."}, {"tag": "p", "text": "These infiltrators should not be confused with another type of Rebel soldier known as Infiltrators, who had a history and mission profile dissimilar to these infiltrators."}, {"tag": "h2", "text": "Appearances"}]}