{"url": "Infinite_Engine", "categories": ["Category:Legends articles", "Category:Exotic technology", "Category:Infinite Empire technology"], "nodes": [{"tag": "h1", "text": "Infinite Engine"}, {"tag": "p", "text": "The Infinite Engine was a device created by the Sith Lord Darth Revan that was actually a fragment of the Rakatan Star Forge. During his time as a Sith, Revan took control of the powerful space station and used it to create a fleet that served him in a Sith Empire in the Jedi Civil War. However, he took a small fragment from the machine where he learnt that it had far greater potential, with it even being possible to create entire galaxies given time. The Engine's power allowed it to manipulate energy and create anything that was desired, from air to food or shelter. This fragment was later awarded to a number of alien Ongree servants of Revan who were placed as the machine's guardians and were protected in a complex that was equipped with automated turrets as well as assassin droids. Some details on the machine were recorded in Revan's Journal where he remarked on the potentials of the Engine."}, {"tag": "p", "text": "While within the care of the Ongree, Revan taught his servants that their children should be offered to the Engine that imparted some of its power to them. This allowed the machine to create various essential items for the aliens to continue their existence. When one of the Ongree died, their body was similarly offered to the Engine that absorbed their forms for energy which was used to provide for the rest of their kind. Over the centuries, the Engine grew from a small hand-sized fragment into a larger machine. The existence of the complex holding the Infinite Engine was discovered by the Sith Empire during the Cold War. In this time, the Imperial Reclamation Service was aware that the complex was created by Darth Revan but were unaware of what resided within it. Thus, they charged an Imperial official with entering the complex and uncovering whatever resided within it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Much of the background on the Engine comes from Revan's Ongree servants or his Journal. Its fate depends on the choices of the player with the light side option leading to a fragment of the Engine being given by the Ongree who are allowed to live in peace or killing Revan's servants and taking the entire machine. Regardless of option, the fragment or entire Engine are taken afterwards for study by the Imperial Reclamation Service."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}]}