{"url": "Infiltrator_probe_droid", "categories": ["Category:Legends articles", "Category:Arakyd Industries products", "Category:Fourth-degree probe droid models"], "nodes": [{"tag": "h1", "text": "Infiltrator probe droid"}, {"tag": "p", "text": "The Infiltrator probe droid was a probe droid produced in a collaboration between Arakyd Industries and Imperial technicians under Admiral Damon Krell following the Battle of Hoth. Augmented with superior armor, weapons and computer interface capabilities, an Infiltrator had the ability to tap into and completely control a starship. In 3 ABY, Krell attempted to use an Infiltrator droid to destroy the Rebel fleet, only to die when his plan backfired."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Modeled after the Viper probe droid, an exploration probot that was commonplace during the Galactic Civil War, the Infiltrator probe droid was augmented with superior armor plating, powerful weaponry, and enhanced computer interface systems. Much larger than a Viper droid, the Infiltrator droid was packed with power, with forward laser cannons that were capable of blasting through a CR90 corvette's hull from the outside]], and it was an unrelenting and methodical killer in a combat situation."}, {"tag": "p", "text": "However, the Infiltrator droid's most crucial capabilities were its ability to plug into and control almost any electronic system, including large starships. An infiltrator droid had the ability to completely override every system it came into contact with, essentially making them an extension of itself. As such, it was able to function much more independently than most other probe droids, although Infiltrators could struggle to integrate its augmented programming with its base programming and thus suffer issues with its logic capacitators."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Infiltrator probe droid was produced during the height of the Galactic Civil War, as part of a joint venture between Arakyd Industries and Imperial technicians under the oversight of Admiral Damon Krell. In the wake of the Battle of Hoth in 3 ABY, Krell made the Infiltrator droid the central point of a plot to wipe out the Rebel fleet, and make himself the hero of the war. Krell dispatched an Infiltrator droid designated 13-K to capture a Rebel blockade runner, commandeer the ship, and detonate it at the Rebel rendezvous point. However, the interference of Rebel pilot Luke Skywalker led to the plan's failure, with 13-K instead destroying Krell's Star Destroyer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Infiltrator probe droid first appeared in Star Wars 45, written by Archie Goodwin and released in 1980. The droid was first identified as an Infiltrator probe droid in The New Essential Guide to Droids, released in 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}