{"url": "Infiltrators/Legends", "categories": ["Category:Legends articles", "Category:Infiltrators"], "nodes": [{"tag": "h1", "text": "Infiltrators"}, {"tag": "p", "text": "Infiltrators were an elite military speciality, part of the Special Forces of the Alliance to Restore the Republic. Formed from those beings with a burning hatred for the Galactic Empire, the Infiltrators were the most feared Alliance unit, and the terror of Imperial soldiers throughout the galaxy. Masters of stealth, silent weapons, and hand-to-hand combat, Infiltrators penetrated enemy lines and installations to carry out raids, sabotage, and disruption missions."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Infiltrators were a military speciality of the Alliance to Restore the Republic's Special Forces. The 5th Regiment of a SpecForce division was comprised entirely of Infiltrators. Infiltrators were deployed as SpecForce's eyes and ears; masters of stealth, they were trained to penetrate enemy lines and facilities to sow fear and confusion, conduct sabotage and critical missions, and distract officers to disrupt command and control operations. The most feared of all of SpecForce's soldiers, Infiltrators were highly skilled in hand-to-hand and melee combat, and employed slugthrowers and silent weapons to achieve their objectives. They were able to bypass mechanical and organic security systems, and the perfect Infiltrator mission was one that was not detected for several hours after the Infiltrators had exfiltrated."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, the Infiltrators were the busiest branch of SpecForce, constantly being assigned to missions, sometimes at the behest of Alliance Intelligence, and sometimes loaned to Intelligence to work under their direction."}, {"tag": "p", "text": "An Infiltrator team was deployed during Operation Cobolt, a mission to capture an Imperial Scandoc decoding computer from an orbital base over the planet Mantooine. Twenty Infiltrators were inserted onto the station aboard an Imperial supply craft, where they proceeded to disable the base deflector shields, weapons, and communications. A further assault of Marines assault the station to recover the computer and further sabotage the base, and the assault plan called for the Infiltrators to hold their position until relieved, then extract out on the marine assault shuttles. All Infiltrators were listed as missing, presumed dead, during the operation, which was a success."}, {"tag": "p", "text": "Taskforce Shen was an Infiltrator company based around two Infiltrator platoons, along with a Pathfinder platoon and two squads of Technicians. Major Mart Stevez commanded the company, and their mission profiles included silent raids, ambushes, and striking critical targets. Taskforce Shen was often loaned to Alliance Intelligence to perform extraction missions, usually of data or personnel."}, {"tag": "h2", "text": "Personnel"}, {"tag": "p", "text": "Infiltrators were drawn from recruits that had joined the Alliance after the Empire had torn their lives apart. Many had lost everything that they held dear; refusing to give in to the pain, they vowed to destroy the Empire in return. Commitment and combat performance led to their induction into SpecForce, while their personality and hatred for the Empire got them assigned to the Infiltrators. Their skills were honed to peak perfection, and they were masters of stealth operations. Following drop camp, they received advanced training in hand-to-hand combat, melee combat, and the use of slugthrowers and archaic mechanical weapons. One week of their training involved the recruits being sealed in a black hangar and forced to operate entirely without their vision, relying on their other senses."}, {"tag": "p", "text": "Infiltrators were the terror of Imperial forces; they were quiet, highly focused, and disciplined. They had little interest in anything that did not hasten the destruction of the Empire, and their only desire was to repeatedly hurt the Empire until it was destroyed. Their methodology earned them the nicknames of \"wraiths,\" \"ghosts,\" and \"shadows\" among their fellow Specs."}, {"tag": "p", "text": "Major Mart Stevez commanded Taskforce Shen during the Galactic Civil War. A former member of the Atrisian Royal Corps, his family—wife, son, and daughter—was assassinated by the Imperial Ubiqtorate after his father was considered to be \"politically unreliable.\" Joining the Alliance after neutralizing the assassins sent after him, Stevez assisted in the formation of the first Infiltrator teams."}, {"tag": "p", "text": "First Lieutenant Vu Nin was an Alderaanian SecForce soldier who requested a SpecForce transfer following the destruction of Alderaan. Although she originally wanted to join the Alderaanian Death Legion, she was assigned to Taskforce Shen instead as they needed Infiltrators following a mission that had ended badly."}, {"tag": "p", "text": "Vin Northal, a former member of the Emperor's Royal Guard, served as a training instructor for the Infiltrators in his spare time."}, {"tag": "h2", "text": "Skills"}, {"tag": "p", "text": "Infiltrators were experts in the fields of stealth operations, hand-to-hand combat, and silenced weapons. They were trained to use blasters and firearms such as slugthrowers. They were also proficient in the use of melee weapons, such as vibroknifes. Repulsorlift operation and survival training was drilled into Infiltrators, as well as the skills to defeat security systems, to effectively use demolitions equipment, and to conduct sabotage."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Infiltrators were generally deployed in the field with minimal equipment. Their main weapons of choice were the blaster pistol or heavy blaster pistol, vibroknife, and garrote, and they also favored Merr-Sonn Intimidator IR-5s. Silent weapons were the order of the day for Infiltrators, such as silenced slugthrower pistols—such as the Adjudicator— and silenced subsonic sniper rifles. Melee weapons included slicewire, snap batons, and multi-weapons. Mechanical weapons were also prevalent in the Infiltrator arsenal, including bolt-throwers, magna casters, and vac blades. Fragmentation grenades, stun grenades, and detonite rigged with a timer were also carried by Infiltrators."}, {"tag": "p", "text": "Infiltrators made use of climbing gear for insertions, and had special equipment that allowed them to suspend from ceilings. A surprise attack from above was one of the Infiltrator's favorite tactics. Select units were equipped with shadowsuits, and sensor-baffling No-Shows were deployed when needed. Infiltrators preferred to use jetpacks, such as the Whisper jet pack, for fast movement, and also employed the ShadoWing-4 para-wing glider when necessary. Infiltrators rarely used comlinks, but when they did, theirs were encrypted."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}