{"url": "Ingoda", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Crime lords", "Category:Hutts", "Category:Males", "Category:Slavers"], "nodes": [{"tag": "h1", "text": "Ingoda"}, {"tag": "p", "text": "Ingoda, also known as Ingoda the Hutt, was a minor Hutt crime lord with a masculine personality who operated during the last years of the Galactic Republic. A brutal being, Ingoda enjoyed accumulating Theelins—an artistic but increasingly rare species—as slaves. However, Ingoda regularly fell into debt to the more powerful crime lord Jabba the Hutt and was forced to sell two of his Theelin slaves, Diva Funquita and Diva Shaliqua, to Jabba to repay his debts."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ingoda, often called Ingoda the Hutt, was a Hutt entrepreneur and minor crime lord who was active during the last years of the Galactic Republic. Ingoda made a hobby of \"collecting\" Theelins—an increasingly rare Near-Human species noted for its artistic talent—as slaves. Ingoda also owned slaves of other species, and, unbeknownst to the Hutt, his slaves would mate; two of his slaves produced the Theelin-halfbreed Diva Shaliqua. When Ingoda discovered that his slaves were procreating, he was infuriated. Nevertheless, he allowed Shaliqua to live, believing that it would be more advantageous to own and profit from the female halfbreed if she turned out to possess the natural singing faculties associated with many Theelin females."}, {"tag": "p", "text": "However, Ingoda formed a business rivalry with Jabba the Hutt—a member of the Hutt Desilijic clan and a powerful crime lord operating out of the planet Tatooine. As a result, Ingoda would often become indebted to the more clever-minded Jabba. When he was forced to pay off his debts to Jabba, Ingoda sold two of his Theelin female slaves, Diva Shaliqua and Diva Funquita, to his business rival."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A male Hutt, Ingoda was a cruel being; he made a hobby of accumulating Theelin slaves and was outraged when he discovered that his slaves were reproducing. He let the young Diva Shaliqua live, however, hoping that she would develop into a profitable being in the future. Ingoda's business intelligence was lacking in comparison to those of more infamous Hutt crime lords of his time, such as Jabba the Hutt, and, as a result, Ingoda would often fall into debt to Jabba."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ingoda was first mentioned in the StarWars.com Databank entry for Diva Shaliqua, published as part of the Hyperspace contest What's The Story?, which allowed fans to author certain aspects of the Star Wars saga. Shaliqua's entry was written by Nathan O'Keefe—under the alias \"Valin Kenobi\"—and user \"newlyn53100.\" Although O'Keefe created the section featuring Ingoda, the concept of Ingoda \"collecting\" Theelin slaves was added by StarWars.com during the entry's editing process. Ingoda later received his own entry in the 2008 The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}