{"url": "Inner_Rim", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Inner Rim", "Category:Regions"], "nodes": [{"tag": "h1", "text": "Inner Rim"}, {"tag": "p", "text": "The Inner Rim, also known as the Inner Rim Territories and originally known simply as the Rim, was a region of the galaxy located between the Colonies and the Expansion Region. The planet Onderon was located in the Inner Rim, as well as the planets Riosa, Birren, Bastatha, Arreyel, Li-Toran, Denon, Pasher, Gorse and its moon, Cynda, as well as Jakku."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Inner Rim was a region of the galaxy that was considered part of the \"inner planets.\" It consisted of a ring between the Colonies and Expansion Region."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The Inner Rim was the frontier of galactic civilization for centuries. When originally settled by colonizers spreading out from the worlds of the Core Worlds and Colonies, this area was known simply as \"the Rim,\" but competition for resources saw the need to expand, and the known galaxy grew into areas such as the Mid Rim and the Outer Rim Territories. The Inner Rim remained prosperous, however, as colonization spread outwards. At some unknown time, the Inner Rim planet of Birren was settled by both Alderaanian and Arkanisian explorers. The planet developed a hereditary monarch known as the Supreme governor, which had become purely ceremonial by the time of the New Republic."}, {"tag": "p", "text": "About a thousand years before the Battle of Yavin, the Inner Rim world of Jakku in the Western Reaches was known to be the site of an object of value to Sheev Palpatine, the Sith Lord known as Darth Sidious. In 30 BBY, Palpatine and his Adviser Yupe Tashu visited Jakku to supervise an archaeological dig in Plaintive Hand plateau, where the object was rumored to be buried. During that trip, Palpatine first encountered Gallius Rax, a local slave whom he sensed great potential. With Palpatine's help, Rax later rose to the position of Fleet Admiral in the Galactic Empire."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, the Inner Rim held strategic value to the Confederacy of Independent Systems. The Separatist Subjugator-class heavy cruiser Malevolence crashed onto the Dead Moon of Antar in the Inner Rim during the Battle of the Kaliida Nebula. The Inner Rim world of Onderon later joined Count Dooku's Confederacy. The planet was represented in the Separatist Senate by Mina Bonteri, who was later assassinated by Separatist agents under Dooku."}, {"tag": "p", "text": "The Inner Rim planet Quarzite was home to the warring Belugan and Kage species. In 20 BBY, the bounty hunters Asajj Ventress and Boba Fett accepted a job from the Belugan dictator Otua Blank to deliver a chest. After learning that the chest contained a young Kage woman named Pluma Sodi, Ventress refused to proceed with the mission. When Fett insisted on carrying on with the job, Ventress threw him into the chest and handed Fett to Blank. She then freed Pluma and returned her to her brother Krismo Sodi."}, {"tag": "p", "text": "In 20 BBY, the Galactic Republic sent a team consisting of the Jedi Anakin Skywalker, Obi-Wan Kenobi, Ahsoka Tano, and Clone Captain Rex to the planet Onderon train a resistance movement to fight against the Separatist-backed King Sanjay Rash during the Onderonian Civil War. As a result, the Republic established contact with Mina's son Lux Bonteri and the rebel leader Saw Gerrera. Following a prolonged military campaign, the Republic and their Onderonian allies managed to expel the Separatist forces from Onderon and reinstate Ramsis Dendup as King."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Following the end of the Clone Wars and the establishment of the Galactic Empire, the Inner Rim came to hold strategic significance to the Empire as it had the Separatists before them. Imperial forces under Moff Wilhuff Tarkin led a harsh crackdown on the Inner Rim moon Antar 4 known as the Antar Atrocity in 18 BBY.[source?] Thousands of Gotals and Koorivar, including Republic loyalists, were rounded up, imprisoned, and executed. Although the Commission for the Preservation of the New Order tried to cover up the events, media coverage attracted outrage in the Core Worlds. Emperor Palpatine was forced to reassign Tarkin to the Western Reaches. In 14 BBY, two reporters Anora Fair and Hask Taff, who covered the Antar Atrocity, later joined Berch Teller's rebel cell on a campaign against Tarkin."}, {"tag": "p", "text": "In 11 BBY, the Imperial efficiency expert and industrialist Count Denetrius Vidian embarked on a scheme to defraud the Empire by destroying the planet Gorse's moon Cynda in order to exploit its thorilide reserves. This brought him into conflict with the Twi'lek rebel operative Hera Syndulla and the former Padawan Kanan Jarrus. With the unlikely help of the Imperial Captain Rae Sloane, Syndulla's team managed to expose Vidian's conspiracy. Following Vidian's death, his rival Baron Lero Danthe established surface mining operations on Gorse's sunward side."}, {"tag": "p", "text": "During the Imperial Era, the Empire was known to recruit large numbers of prospective Imperial cadets from the Inner Rim, which it preferred to former Separatist worlds. Seven months after the Battle of Yavin, Imperial forces embarked on a crackdown on the icy Inner Rim planet of Zeitooine which led to the arrest of a local family. Imperial atrocities of Zeitooine and other worlds helped to motivate more people including the former TIE fighter pilot Thane Kyrell to join the Rebel Alliance."}, {"tag": "p", "text": "Following the events above Yavin, the Rebel Alliance Lieutenant Caluan Ematt was ambushed by Imperial forces on the Inner Rim world of Taanab but managed to flee to the planet Cyrkon in Hutt Space. The Empire also annexed the planet Riosa and conscripted the planet's population and resources into building both the first and second Death Stars. Riosa's manpower and resources were plundered to fuel the Imperial war machine, causing great hardship and impoverishment to the planet. The future New Republic Senator Ransolm Casterfo grew up during Imperial rule and lost his parents to hard labor. As a result, Casterfo developed a hatred of Darth Vader."}, {"tag": "p", "text": "After Fleet Admiral Rax seized control of the Imperial fleets, he ordered his armadas to assemble above the planet Jakku for a showdown with the New Republic, the successor government to the Rebel Alliance. The ensuing Battle of Jakku was a cataclysmic battle which ended the Galactic Civil War in favor of the New Republic. As a result of the fighting, Jakku's surface was littered with the wreckage of countless starships from both sides. Jakku became home to scavengers who sifted through the wreckage for objects to sell. A month after the Battle of Jakku, the Empire was confined by the New Republic to parts of the Inner Rim and the Core Worlds as a prelude to the Galactic Concordance."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "At a young age, Rey was abandoned by her parents on the desert planet Jakku and left in the care of the junk boss Unkar Plutt."}, {"tag": "p", "text": "By 28 ABY, the Inner Rim planets Riosa and Bastatha had joined the New Republic. Their senators including Casterfo were aligned with the Centrists, a political faction in the Galactic Senate who favored greater centralization and a stronger military. Riosa remained a backwater manufacturing center which had still not fully recovered from Imperial rule. Bastatha was a barren desert world that hosted an Amaxine warriors' camp led by the former Imperial Arliz Hadrassian, who was an agent of the First Order, a remnant of the Old Empire."}, {"tag": "p", "text": "Following the death of Birren's reigning Supreme governor Mellowyn, the Populist Senator Leia Organa and her son Ben Solo were designated as the heirs to the supreme governorship. Since Leia and Ben were not interested in assuming that office, Organa agreed to support Lady Carise Sindian's bid to inherit the supreme governorship of Birren. However, Sindian was an undercover First Order agent who used her position to discover information about Organa's true parentage as the daughter of Darth Vader. The ensuing scandal destroyed Organa's political career. In retaliation, Organa convinced the Elder Houses to strip Sindian of all her royal titles."}, {"tag": "h3", "text": "The Rise of The First Order"}, {"tag": "p", "text": "In 34 ABY, the Resistance pilot Poe Dameron traveled to Jakku in order to find Lor San Tekka, who had obtained a map that would lead them to the Jedi Master Luke Skywalker's location. First Order forces then attacked Tuanul village and massacred the inhabitants. Dameron was captured by Kylo Ren but managed to hide the map in his droid BB-8. Dameron later escaped with the help of the disillusioned stormtrooper Finn. After crashing their stolen TIE fighter, the two were separated and Finn managed to find BB-8 and Rey. The trio then fled a First Order attack on Niima Outpost and escaped on the Millennium Falcon into space."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}