{"url": "Inquisition_(Old_Republic)", "categories": ["Category:Legends articles", "Category:Galactic Republic organizations"], "nodes": [{"tag": "h1", "text": "Inquisition  (Old Republic)"}, {"tag": "p", "text": "The Inquisition was a special court of the Galactic Republic in the time of the Great Sith War. The court was summoned when dealing with war criminals and in other very special cases. It was headed by the Supreme Chancellor, and the proceedings took place before the Senators of the Galactic Senate."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The first known time the Inquisition convened was in 3996 BBY, to convict former Jedi Ulic Qel-Droma, now a Sith Lord and leader of the Krath. Qel-Droma had defected from the Jedi Order and joined forces with Dark Lord of the Sith Exar Kun to wage the Great Sith War against the Galactic Republic."}, {"tag": "p", "text": "Following a botched attack on the galactic capital of Coruscant, Qel-Droma was captured and incarcerated by the Jedi and Republic authorities. Brought before the Inquisition, he was charged with war crimes, treason against the Republic, and treason against the Jedi Order. Refusing to plead guilty, he instead expressed his contempt for the court, and the Sith plan to do away with the Republic to make way for a reinstated Golden Age of the Sith. Before he could be found guilty, Dark Lord of the Sith Exar Kun infiltrated the Senate Hall with ease and rescued Qel-Droma shortly before an official verdict and sentence could be handed down."}, {"tag": "p", "text": "The ease with which Exar Kun entered the Convocation Chamber of the Senate to disrupt the trial of Ulic Qel-Droma caused the Galactic to take measures prevent such travesties from ever happening again. A modernized facility was constructed to replace the Senate Hall as the new venue for governmental affairs, but the Hall itself remained as a place of ceremonial reverence, occasionally used to house important events due to its large seating capacity. In 3963 BBY, the Inquisition which presided over Ulic Qel-Droma's trial convened again to determine the fate of another galactic criminal: the Mandalorian scientist Demagol."}, {"tag": "h2", "text": "Workings"}, {"tag": "p", "text": "The Supreme Chancellor was the president of the Inquisition. It is not known whether he was assisted by other judges or held supreme authority in his own right. The present Senators may have functioned as a jury, or just observed the proceedings."}, {"tag": "p", "text": "Apparently, the defendant had no intrinsic right to legal counsel, although Jedi, possessing great respect and authority in this time, were allowed to speak before the Inquisition on behalf of the accused should they choose to. Presumably, there was no authority beyond the Inquisition to appeal to. The Inquisition had the authority to order capital punishment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}