{"url": "Inquisitorius/Legends", "categories": ["Category:Legends articles", "Category:Dark side organizations", "Category:Imperial Intelligence bureaus and branches", "Category:Inquisitors", "Category:Jedi hunters"], "nodes": [{"tag": "h1", "text": "Inquisitorius"}, {"tag": "p", "text": "The Inquisitorius was a secret division of Imperial Intelligence consisting of dark side Force-sensitive agents known as Inquisitors (sometimes also as Inquisitioners), or \"truth officers\"."}, {"tag": "p", "text": "Under the control of Emperor Palpatine and Darth Vader, these Inquisitors were considered the highest ranking of the Dark Side Adepts, outranking the Emperor's Hands, Prophets of the Dark Side, and lesser Dark Jedi. They reported directly to the Emperor, although they were officially classified as part of Imperial Intelligence. For a time, they were made subservient to Ferus Olin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Inquisitorius was an organization established around 19 BBY by Emperor Palpatine, also known as Darth Sidious. It consisted of agents referred to as Inquisitors tasked with hunting down Jedi who managed to survive Order 66."}, {"tag": "p", "text": "Potential Inquisitors were put through a rigorous selection process. First, they were extensively tested and examined by Imperial Intelligence, then by the Grand Inquisitor, then by Sidious himself. Applicants had to prove themselves powerful and reliable."}, {"tag": "p", "text": "While many Jedi fell in the Great Jedi Purge, some, such as Antinnis Tremayne and Jerec, betrayed their order and joined the ranks of both the Inquisitorius and the Emperor's Dark Side Adepts. If an Inquisitor captured a Jedi, it was their job to make the Jedi turn to the dark side, and join Sidious' New Order. If the Inquisitor could not, it was their duty to eliminate the Jedi. Inquisitors would also search for non-Jedi Force-users to serve Sidious."}, {"tag": "p", "text": "The Inquisitors were also responsible for awakening Arden Lyn after a twenty-five millennia long sleep. During this time, Inquisitor Valin Draco became involved in Sarlacc Project, the secret construction of a prototype Super Star Destroyer, showing that the order didn't focus solely on matters of the Force."}, {"tag": "p", "text": "Following the first death of the Emperor at Endor, the bureaucracy of the Inquisitorius engaged in infighting with other branches of the government to determine a successor, but some of Sidious's darksiders kept silent, knowing that the Dark Lord of the Sith would return. Many Inquisitors joined the Pentastar Alignment under the title of Great InQuestor of Judgment. One of these was Jerec, who attempted to gain control of the Valley of the Jedi, but was foiled by Kyle Katarn."}, {"tag": "p", "text": "After the last death of the Emperor, the few surviving Inquisitors sent one of their failed apprentices, Brakiss, to infiltrate Luke Skywalker's Jedi Praxeum on Yavin IV. Luke realized what Brakiss was all along, but hoped to redeem him. When Brakiss eventually fled Yavin IV, he did not return to the Inquisitorius, but joined forces with Kueller. However, he did furnish the Inquisitorius with information about the Praxeum before vanishing. Years later, Brakiss formed a similar organization for training darksiders, the Shadow Academy, under the Second Imperium."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Although they used lightsabers, Inquisitors could use vibroblades, electrostaffs, DX-2 disruptor pistols, and DXR-6 disruptor rifles for intimidation tactics."}, {"tag": "h2", "text": "Operations"}, {"tag": "p", "text": "The Inquisitors' primary purpose was the interrogation of Jedi or particularly resistant subjects. Subjects were attained for the Inquisitors by authorization of LAACDocs. When usual methods of interrogation such as torture and Bavo Six injections failed to break a subject, Imperial Intelligence would call upon an Inquisitor, who would use powerful Force skills in conjunction with traditional but effective methods of manipulation to obtain success. In addition, several members of the Inquisitorius were themselves speculated to have been former Jedi."}, {"tag": "p", "text": "However, since Imperial Intelligence was quite effective in interrogating the average subject, they rarely required the services of an Inquisitor. Inquisitors instead spent much of their time looking for potential Jedi candidates and Force activity in the backwater parts of the Galactic Empire, most often in the Outer Rim Territories, at the discretion of their leader the Grand Inquisitor. Malorum, the first Grand Inquisitor, was killed on Naboo by Ferus Olin. He was succeeded by the enigmatic Hydra, who was tasked to assist Olin in locating Force Adepts, and came disturbingly close to discovering the Force-sensitivity of Princess Leia Organa on Alderaan. Lord Laddinare Torbin, the next Grand Inquisitor, was killed by an assassin droid who crashed a shuttle into the Imperial palace on Weerden sixteen years prior to the Battle of Yavin. The title was eventually taken up by the Zabrak Ja'ce Yiaso. The Inquisitorius, while classified as a branch of Imperial Intelligence, report directly to the Emperor."}, {"tag": "p", "text": "The Inquisitorius was originally based on Coruscant, in the Jedi Temple under Malorum and later in the Senate Tower under Hydra. Afterwards, the foreboding Citadel Inquisitorius was built on the planet Prakith in the Deep Core; here, the High Inquisitors were given their assignments and conferred with their colleagues. Captured Jedi were imprisoned and tortured here. The Citadel's security was breached on at least one occasion, by allies of Bail Organa."}, {"tag": "p", "text": "As of 18 BBY, all Inquisitors could be distinguished by enveloping, dark maroon robes of zeyd-cloth that invoked images of dark blood. This uniformity may have been discontinued with time."}, {"tag": "p", "text": "They used Ultrachrome protection, with Taozin amulets creating a void in the Force so its wearer could not be detected by another Force-sensitive."}, {"tag": "p", "text": "Largely because of their secret nature in the Imperial Intelligence department, they received very few mentions even in the official field manual for the Imperial Military, Imperial Handbook: A Commander's Guide, with Luke Skywalker, himself a Force-user, suspecting that the agency was kept secret by the Emperor due to their use of the Force, and also wondered if even the Imperial Military trusted them."}, {"tag": "h2", "text": "Known Inquisitors"}, {"tag": "h3", "text": "Grand Inquisitors"}, {"tag": "h3", "text": "High Inquisitors"}, {"tag": "h3", "text": "Chief Inquisitors"}, {"tag": "h3", "text": "Inquisitors"}, {"tag": "h3", "text": "Apprentice Inquisitors"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Agents of the Inquisitorius are most commonly known as \"Inquisitors\", but some sources such as Zirtran's Anchor use the term \"Inquisitioner\"."}, {"tag": "p", "text": "The term \"Nobody expects the imperial inquisition!\", is a reference to Monty Python's \"Nobody expects the Spanish Inquisition!\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}