{"url": "Anchorite_sect", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Anchorite sect"], "nodes": [{"tag": "h1", "text": "Anchorite sect"}, {"tag": "p", "text": "The anchorite sect was a religious organization which believed that suffering was the basis of life. It operated on the planet Jakku, and was aligned with the light side of the Force."}, {"tag": "h2", "text": "Belief"}, {"tag": "p", "text": "An anchorite of the sect named Kolob held the Eremite with reverence, as maintained principles on suffering were deemed to have stemmed from the deity. A strong believer, Kolob was confident in his own abilities of memorising such precepts, and anchorites regarded the Plaintive Hand plateau on Jakku as a sacred site, for it allegedly once housed the ancient Consecrated Eremite during a more vegetated period of the planet's history."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ancient times"}, {"tag": "p", "text": "According to the Emperor's adviser Yupe Tashu, the group was affiliated with the light side of the Force and had bound themselves to the Jedi Order a thousand years ago."}, {"tag": "h3", "text": "Fall of the Republic and Empire"}, {"tag": "p", "text": "In the last years of the Galactic Republic, Kolob ran an orphanage near the Plaintive Hand plateau and the Valley of the Eremite. He treated the orphans harshly and taught them that life was based on servitude and suffering. Such children included Galli, Brev, Kateena, and Narawal. Around this period, anchorites were known to wear elaborate and dark clothing, which also functioned to control the user's body."}, {"tag": "p", "text": "By the time of the New Republic, the sect's influence was limited, even on their native world of Jakku as few anchorites operated openly, with members of the organization having restricted contributions to the wider galaxy, and such individuals only known by inhabitants of Jakku and, on one instance, by a crazed Sith cultist."}, {"tag": "p", "text": "During her stay on Ahch-To's temple island in 34 ABY, the Caretakers reminded the Jedi-aspirant Rey of the anchorites on Jakku."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Suffering"}, {"tag": "p", "text": "The concept of suffering in Star Wars dates back to the 1999 prequel trilogy film Star Wars: Episode I The Phantom Menace. Jedi Master Yoda prescribed the emotion of fear as a \"path to the dark side of the Force,\" stating that the following states of an individual would include anger and hate, of which would lead to suffering."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}