{"url": "Intendant_caste", "categories": ["Category:Legends articles", "Category:Yuuzhan Vong castes", "Category:Yuuzhan Vong intendants"], "nodes": [{"tag": "h1", "text": "Intendant caste"}, {"tag": "p", "text": "The intendant caste was the political and economic class among the Yuuzhan Vong."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The intendants played a role similar to that of bureaucrats, organizers, and logistics personnel in other species. They were responsible for keeping supply lines open, and for supplying the obedient with their vital needs. They also tended to the creatures made by the shapers and served as the spies and advanced scouts for invasion forces. While the warriors and priests looked down on them as devious, the intendants did the actual governing of the Yuuzhan Vong empire, and had the ability to adapt—something the other castes lacked. Unlike the other elite castes, they did not possess a war cry and were also the smallest of the castes."}, {"tag": "p", "text": "The intendants could worship any god."}, {"tag": "p", "text": "The Praetorite Vong were a military force of the Yuuzhan Vong that were dominated by the intendant caste."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Before the invasion of the galaxy, the intendant-ruled Praetorite Vong made the initial incursion onto the worlds of the Promised Land. They were led by Prefect Da'Gara and made use of a \"defective\" yammosk. Despite their intial progress, the Praetorite Vong were defeated which stalled the invasion until the warrior caste arrived."}, {"tag": "p", "text": "As the Yuuzhan Vong began conquering more territory from the New Republic and other governments, the new territory fell under the administration of the intendant caste."}, {"tag": "p", "text": "The intendant caste joined their brethren castes after the end of the war by living in peace on the living world of Zonama Sekot."}, {"tag": "h2", "text": "Ranks"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}