{"url": "InterGalactic_Banking_Clan", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Company stubs", "Category:Commerce and labor guilds and unions", "Category:Confederacy of Independent Systems organizations", "Category:Conglomerates", "Category:Galactic Republic organizations", "Category:Imperial organizations", "Category:InterGalactic Banking Clan"], "nodes": [{"tag": "h1", "text": "InterGalactic Banking Clan"}, {"tag": "p", "text": "The InterGalactic Banking Clan (IGBC), also known simply as the Galactic Banking Clan or as the Banking Clan, was one of the most influential commerce guilds during the waning days of the Galactic Republic and the most important organization in the Outer Rim. It was governed by the Core Five from the Main Vault located on the Outer Rim world Scipio. The Banking Clan survived into the reign of the Galactic Empire, but the guild found itself embroiled in a series of trade wars with the Hutt Clan."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic Era"}, {"tag": "p", "text": "During the time after the fall of the Old Republic and rise of the Galactic Republic, the settlers of the world of Eriadu lacked the funds needed for mining, processing, and shipping lommite ore, so they were forced to get high-interest loans from the Banking Clan. However, hyperspace travel from their location to the Core Worlds required use of hyperspace beacons and reversions to realspace, meaning ore shipments were often delayed or lost. Until entrepreneurs from the Core planet of Corulag intervened, Eriadu risked becoming a client world to the bankers because of their growing debts."}, {"tag": "p", "text": "Since it left the aurodium standard, the Republic partnered with major banks, including the Banking Clan, to keep a credit reserve. This was to ensure the Republic's money remained stable. During the Clone Wars, the organization joined the Confederacy of Independent Systems, and its chairman, San Hill, was given a place on the Separatist Council. However, the Banking Clan continued to conduct business with the Republic during the conflict, though at exorbitant interest rates, and accordingly was seen as a neutral party."}, {"tag": "h3", "text": "Republic control"}, {"tag": "p", "text": "As a result of their alliance with the Separatists, the Banking Clan was at the verge of bankruptcy as the Clone Wars neared its close. After Senator Padmé Amidala traveled to Scipio to secure aid for civilians displaced by the war, she was informed of a scheme by the Core Five to steal from each bank account, learning of the plot from an old romantic partner, Senator Rush Clovis. After Amidala was able to recover the evidence and return it to Coruscant, Clovis was then chosen to be the next head of the banks. Because he was only able to reach the position with help from Count Dooku, Clovis was forced to raise rates on the Republic and respect a Separatist military presence on Scipio. The Republic then countered with an invasion of Scipio, bringing the banks into the control of the Office of the Supreme Chancellor. Unbeknownst to everyone, this was all a Sith plot for Palpatine's alter-ego, Darth Sidious, to gain more political power for his eventual galactic takeover.."}, {"tag": "p", "text": "Despite the Republic control of the banks, San Hill and the Muunilinst Banking Clan[source?] continued to support the Confederacy and became entrenched on their stronghold of Mygeeto. Jedi Master Ki-Adi-Mundi was dispatched in reaction, leading the 21st Nova Corps against the battle droids until he was executed by his own clone troopers during Order 66."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Having survived the Clone Wars, the Banking Clan continued to do business into the reign of the Galactic Empire, although found itself in a competition with the Hutt Clan known as the trade wars. The Clan's Vice Chairman, the Muun Anolo—who resided on Mygeeto and had come into possession of Ki-Adi-Mundi's lightsaber, which the Jedi General had dropped after being killed—plotted to wage a subtle trade war with the Hutts for the control of their smuggling routes, hiring a Givin codebreaker to advise them on what moves to make; the Givin's brain was linked to the Imperial algorithm that generated security codes. However, Jabba the Hutt came to learn of the Givin and desired to kidnap him to help his smuggling operations, so he hired the veteran bounty hunter Greedo to lead a team to Mygeeto to capture the Givin."}, {"tag": "p", "text": "Making their presence known by firing a sniper shot into the Vice Chairman's office, Anolo instantly sought to evacuate the tower, and Greedo ordered his team of mercenaries to attack the front gates as Anolo and the Givin fled; thus, the Vice Chairman and codebreaker had moved to walls that were weaker than those in the Muun's office and were away from most of the Banking Clan guards, as most of them were dispatched to the front gates. Anolo understood the Hutts were behind the operation, knowing the capture of the Givin could heavily impact the trade wars, but the codebreaker understood the mercenaries had tricked them, and Greedo, joined by Kadas'sa'Nikto operative Takvaa, broke into the room via an explosion at one of the walls. Despite being outnumbered, the two engaged the guards, with Greedo using Takvaa as a living shield to block an electrified baton. With all guards in his immediate vicinity dead, Greedo murdered Anolo, having been reminded by the Vice Chairman that the Banking Clan would never allow him to kidnap the codebreaker and someone with such a high rank."}, {"tag": "p", "text": "However, a new team of guards arrived and were instantly angered by the murder, running at Greedo and making the codebreaker state that the bounty hunter's chances of success had fallen. While being chased, the Rodian locked himself and the Givin in Anolo's office by shooting the door controls after entering, which only lessened their chances at escape because it was the only exit. Learning from the Givin that his blaster pistol would not break the glass of the office windows, Greedo spotted and used Mundi's lightsaber to break the glass as the Muun guards used their heavy blasters to melt through the door. However, Greedo overestimated the strength of the grabbling line the mercenaries fired from their Bantha-II cargo skiff, so the codebreaker fell to his death, robbing both the Banking Clan and Jabba of the Givin's skills. For his failure, Jabba nearly killed Greedo by dropping him into his rancor pit, only stopping when Ithorian collector Dok-Ondar offered to buy Mundi's lightsaber."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "In 34 ABY, Dok-Ondar told the story of how he had come to own Mundi's lightsaber to stormtroopers of the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "According to Pablo Hidalgo of the Lucasfilm Story Group, Muunilinst was a \"colony\" of the Banking Clan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}