{"url": "Interceptor", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Cleanup", "Category:Articles needing additional sources", "Category:Starfighter classes"], "nodes": [{"tag": "h1", "text": "Interceptor"}, {"tag": "p", "text": "An interceptor was a starfighter classification typically applied to starships that sacrificed heavy ordnance payloads, armor, deflector shields, and/or a hyperdrive in favor of pure speed and agility in combat. To compensate for the lack of a hyperdrive, some types of interceptors could dock with an external hyperspace transport ring, allowing rapid interstellar travel through hyperspace. The ones that could do neither of these things were restricted to realspace, and operated in close proximity to a carrier, capital ship, planet, moon, or space station."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly before and during the Clone War, the Jedi Order operated a class of interceptors designated as the Delta-7 Aethersprite-class light interceptor. These starfighters were fast and maneuverable, and equipped with an integral astromech droid for hyperspace jump calculations. Although not equipped with an internal hyperdrive, they could hook up to an external Syliure-31 hyperspace docking ring for superluminous interstellar travel. Obi-wan Kenobi's personal Delta-7 was also equipped with canisters for spare parts, which could be jettisoned in flight. Kenobi put this feature to good use in the dogfight over Geonosis to evade Jango and Boba Fett."}, {"tag": "p", "text": "The Delta-7B Aethersprite-class light interceptor was an upgraded model of the Delta-7. The astromech droid position on this model was relocated to a spot just forward of the pilot's canopy. This thicker area of the ship was able to accommodate a full-size, removable astromech droid such as R2-D2. This model also featured pop-out S-foils that could extend for certain flight maneuvers. It is not known whether this feature was also included in the original Delta-7s. Although most Jedi upgraded to this model (and eventually the Eta-2), Kel Dor Jedi Master Plo Koon reverted to flying a regular Delta-7 after previously flying a Delta-7B."}, {"tag": "p", "text": "The Eta-2 Actis-class light interceptor was developed during the Clone War as a replacement for the old Delta-7 and Delta-7B classes previously operated by the Jedi. These starfighters would see service up until Order 66 with the Jedi Order, and as late as 5 years after with Darth Vader in the era of the Galactic Empire. Grand Master Yoda operated his own customized version of the Eta-2 about 2 years into the Clone War."}, {"tag": "p", "text": "The RZ-1 A-wing interceptor was first deployed about a year after Order 66 with a small, unorganized rebellion against Imperial Rule. These starfighters included hyperdrives and heavy weapons in their original stock configurations. Later, the more organized Alliance to Restore the Republic, New Republic, and Resistance would fly customized versions, stripped of their heavy weapons launchers for increased speed and maneuverability. They retained the hyperdrives, however, as this facilitated quick escapes from Imperial reinforcements. Approximately 2 years before the Battle of Yavin, the rebellion fielded the RZ-1T trainer, an A-wing variant that had been converted to a 2-seat trainer."}, {"tag": "p", "text": "The Galactic Empire's TIE/IN interceptor was developed as a continuation of the TIE Advanced projects, and was deployed as early as 2 years before the Battle of Yavin in crackdowns on rebel activity. Like other TIEs, it lacked a hyperdrive and shielding, but it was heavily armed with no fewer than six laser cannons. The TIE/d \"Defender\" Multi-Role Starfighter was developed by Grand Admiral Thrawn as an upgraded version, with a third pair of solar panels and shielding."}, {"tag": "p", "text": "Although not typically labeled as such, spacecraft as diverse as the Galactic Republic's V-19 Torrent starfighter and the Firespray-31-class patrol and attack craft were also referred to as \"interceptors\" from time to time. By the time of the Cold War, dedicated interceptors were rarely seen in battle. The Resistance continued to operate a small number of A-wings, but largely relied on the multi-role X-wing starfighter line.[source?]"}, {"tag": "p", "text": "The First Order had largely phased out the TIE Interceptors in favor of a new generation of the TIE line, which were equipped with shielding and hyperdrives.[source?] The First Order did create their own TIE/ba Baron Space Superiority Interceptor, however."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In real life, the term \"interceptor\" has a slightly different meaning from that assigned to it in the Star Wars universe. A typical interceptor, like the Convair F-106 Delta Dart, would be designed to combat enemy bombers, not fighters. As such, an interceptor would typically be designed to sacrifice maneuverability and range/endurance in favor of speed, rate of climb, and firepower. Prior to the introduction of guided missiles, interceptors such as the Messerschmitt Me 262 frequently used heavy autocannons or even air-to-air rockets to penetrate the increasingly thick armor of enemy bombers, although accuracy tended to be poor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}