{"url": "Interdiction_field/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:Gravitational technology"], "nodes": [{"tag": "h1", "text": "Interdiction field"}, {"tag": "p", "text": "An interdiction field was an artificial gravity well that disabled hyperspace capability in most starships. It was used to prevent ships from entering hyperspace as well as draw ships out of hyperspace and into realspace. It was able to do this by triggering a hyperdrive's automatic failsafe that triggered when a gravity well was in the path of the ship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Zabrak engineers developed the interdiction technology during the Mandalorian Wars. Soon the Galactic Republic ordered Interdictor-class star cruisers that used powerful tractor beams to produce an interdiction field.[source?] The most notable of those vessels was the Leviathan. However, this form of \"interdiction\" did not produce large amounts of gravity, and was largely ineffective on the hyperspace engines of later years."}, {"tag": "p", "text": "During that same time period, the Mass Shadow Generator superweapon may have been an example of an interdiction field generator that rivaled the ones built by the Empire years later. It required tremendous power which requirements could only be met by using the abnormally powerful gravity wells around the Malachor system. It used a huge burst of gravity to crush ships and much more dangerously—whole planets."}, {"tag": "p", "text": "Advances and countermeasures were researched, soon the Mandalorian Wars' interdictors became useless against new hyperdrive sensors and multiphase null field units."}, {"tag": "p", "text": "A millennium later, the problem of power consumption still made interdiction field generators capable of disrupting modern hyperdrives unpractical. While the theory behind it was well known, movable objects, such as ships, had a difficult time producing enough power to create the mass shadows."}, {"tag": "p", "text": "The Vagaari ship nets seemed to have found a way around the power consumption problem. It is unknown whether this technology was created by the Vagaari or stolen from another race in the Unknown Regions, like most of their other technology. Thrawn stole a \"ship net\" from the Vagaari while he was a commander in the Chiss Expansionary Defense Force. He used this gravity projector successfully in several engagements. The Interdictor technology used on his ships while a Grand Admiral in the Galactic Empire was probably developed separately by the Empire or late Republic—several years after the supposedly \"primitive\" races in the Unknown Regions."}, {"tag": "p", "text": "The Clone Wars allowed the Republic to fund new research and the Empire benefited from these technological advances."}, {"tag": "p", "text": "The Galactic Empire used the Detainer CC-2200 Interdictor Cruiser, Immobilizer 418 cruiser and Dominator Star Destroyer specifically for hyperspace immobilization. The Sovereign-class Super Star Destroyer and the Eclipse-class dreadnought also had gravity well generators, preventing targeted vessels from escaping their firepower."}, {"tag": "p", "text": "Yuuzhan Vong dovin basals were also able to project gravity wells to drag their ships through the interstellar void. When these organisms concentrated their energy wells, they could create massive gravitational anomalies, such as causing a space station to collapse or a moon to collide with its orbital partner, a tactic known as Yo'gand's Core. The Yuuzhan Vong interdictor cruiser-analogue was the Vua'spar interdictor."}, {"tag": "p", "text": "Furthermore, the technology was often put to use by pirates in order to pull vulnerable cruisers out of hyperspace in order to be boarded. It was used by the Republic in the opposite way—intercepting pirate ships before they could escape."}, {"tag": "p", "text": "As with any tactical weapon, innovation created a new technology to void its capabilities. The Bakurans' HIMS generators were capable of nullifying the containment capabilities of interdiction fields. These HIMS generators were fitted onto the vessels of the Bakuran Defense Fleet which consisted of three Bakura-class Destroyers Watchkeeper, Defender and Sentinel, and the Namana-class Light Cruiser Intruder. These starships played an important role during the Battle of Centerpoint Station though half of the fleet was destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}