{"url": "Interdictor-class_Star_Destroyer/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Empire starship classes", "Category:Interdictor-class Star Destroyers", "Category:Interdictor starship classes", "Category:Star Destroyer classes"], "nodes": [{"tag": "h1", "text": "Interdictor-class Star Destroyer"}, {"tag": "p", "text": "The Interdictor-class Star Destroyer was a variant of the Imperial I-class Star Destroyer equipped with gravity well projectors."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Sienar Fleet Systems already produced an Interdictor, the Immobilizer 418 cruiser based on a 600-meter Vindicator-class heavy cruiser (also used for the Enforcer-class picket cruiser). Though it was decently armed for its size, it was a high-priority vessel that was generally unable to hold its own in combat, especially if the battle involved Imperial Star Destroyers and comparable vessels."}, {"tag": "p", "text": "Kuat Drive Yards decided to produce their own Interdictor offering to rival that of Sienar Fleet Systems by using an Imperial I-class Star Destroyer hull as a base.[source?] To make room for the gravity well projectors, half of the turbolasers and ion cannons, as well as eight of the Phylon Q7 tractor beam projectors found on the original Imperial-class Star Destroyer, had to be removed. The Interdictor-class Star Destroyer's reduced hangar held sixteen TIE fighters."}, {"tag": "p", "text": "The Interdictor-class Star Destroyer did not require additional support when performing patrol and customs duties. Some bold commanders such as Loka Hask even used the ship to pull armed convoys out of hyperspace and destroy them."}, {"tag": "p", "text": "Nonetheless, like the Immobilizer, the gravity wells remained a major drain on the ship's main reactor. This had the potential to compromise defenses in heavy combat. For instance, while Loka Hask's Dominator had interdicted and was destroying a New Republic Convoy, Rogue Squadron's X-wings counterattacked by hitting Dominator with a salvo of proton torpedoes. While an Imperial Star Destroyer's shields would have easily held up against such an assault, Dominator's shields partially collapsed, and the hull took some damage, prompting its commanders to call off the battle. Rogue Squadron also successfully used this tactic on the Immobilizer 418 cruiser Aggregator, which caused it to retreat."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Since its conception, the Interdictor-class played a significant role in the Galactic Empire. Commanders frequently used these ships against pirate insurrections and small pockets of resistance. Because this ship's capabilities prevented other ships from escaping, these vessels were also extensively used in raids and invasions. However, despite their capabilities, they were relatively rare in the greater Imperial Navy, mostly due to them \"building big.\" Leia Organa Solo, a high-ranking member of the Rebel Alliance, later noted that it was a hidden blessing for the Rebels that the Empire did not mass-produce the Interdictor-class and similar vessels."}, {"tag": "p", "text": "A ship of this class was used as a command ship by Lord Darth Vader in the months immediately after the Battle of Yavin, but it was destroyed above Jazbina by Rebel pilot Jal Te Gniev."}, {"tag": "p", "text": "An Interdictor Star Destroyer participated in the Battle of the Graveyard against Renegade Squadron. The Star Destroyer's gravity well projectors, which kept the Rebel fleet from fleeing, were destroyed. A few participated in the Attack on Bannistar Station."}, {"tag": "p", "text": "In the months immediately after the Battle of Endor, ships of this class, such as Dominator and Binder, seemed to have been specifically deployed in Imperial efforts to defeat the Rebels' legendary Rogue Squadron."}, {"tag": "p", "text": "By 9 ABY, Grand Admiral Thrawn's fleet at the Battle of Bilbringi included a number of Interdictor-class Star Destroyers."}, {"tag": "p", "text": "Thrawn used these ships in many of his attacks in his campaign against the New Republic. Thrawn ingeniously used these craft on multiple occasions to pull his own ships out of hyperspace, making the jump more efficient, because the incoming vessels could scramble into a situation with almost unprecedented precision."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Before a canonical designation was known, Curtis Saxton documented this ship class on his Star Wars Technical Commentaries website. On his site, Saxton used the provisional name \"Dominator-class Star Destroyer,\" created after the class's first named representative, Dominator."}, {"tag": "p", "text": "The listing of known ships is controversial since Binder, Constrainer, and Sentinel were labeled as Interdictors, and presumed to be Immobilizer 418 cruisers in the novels. They were drawn as Interdictor Star Destroyers in the Dark Horse comic series. However, more corroborating evidence concerning this matter is based on these vessels and the way they are depicted in Empire at War as Immobilizer 418 ships. The matter is still conjectural."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}