{"url": "Intergalactic_Passport", "categories": ["Category:Legends articles", "Category:Galactic Empire", "Category:Legal documents"], "nodes": [{"tag": "h1", "text": "Intergalactic Passport"}, {"tag": "p", "text": "Intergalactic Passports were paper documents delivered by the Imperial Senate and in the name of the Emperor Palpatine at the time of the Galactic Civil War. These documents allowed their bearers to travel freely throughout the star systems controlled by the government of the Galactic Empire. The passports included many details about their bearers' identity, including their name, address, country, planet, system, galaxy, date and place of birth, height, weight, bloodtype, hair and eye color. They also included foreign exchange facility information that the bearer used, including the date accessed, the amount of currency issued, and the bank said currency was issued. They even included identification for the type of spacecraft they were legally qualified to utilize, plus the grade said spacecraft qualified under and the planet the identification was legalized under. In addition, they contained a warning against using it in any systems inside the galaxy that are not controlled by the Imperial government. Contrary to the otherwise similar Galactic Passport, the Intergalactic Passport was entirely written using the High Galactic alphabet. It also allowed their bearers to travel through the six primary galaxies, unlike the otherwise similar Galactic Passport."}, {"tag": "p", "text": "Other than inter-galactic travel, the passports were good for Hoth, Yavin 4, Tatooine (as well as Mos Eisley), Corellia, Rotkan, and Utapau."}, {"tag": "p", "text": "A similar passport existed during the time leading up to the Battle of Yavin, although this one was authorized by the President of the Imperial Senate. It is unclear whether this intergalactic passport allowed for travel outside the galaxy, although it does grant its owner unhindered and undelayed access to various star systems and spaceports to a certain extent and at the very least allows travel from outside the galaxy to inside it, and was not a viable substitute for planetary passports issued on Earth and its various nation-states. It also banned any unofficial changes, and requested for the name, sex, birthplace, birthdate, the issue date of the passport, the user's home planet and galaxy (the latter if the user was extra-galactic in origin), their rank if belonging to the military, indicating whether they flew X-wings, the bearer's signature, and a photograph of the bearer. It also required that it adhere to section H467B-6 of the Galactic Code relating to regulations governing interplanetary and interstellar travel, and also gave pertinent information such as exchanging local currencies for Interstellar Credits at the StarBank main office at Terminal 7 of Mos Eisley, Tatooine, medical suggestions for the Hoth asteroid field, Tatooine, and the Dagobah system's various planets, and also suggesting that the user, if travelling near Imperial strongholds that were directly controlled by the Emperor, get permission from the Commander of the Dantooine Base before heading there, as well as maintain regular contact with the Base via established communication codes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An official statement in the passport mentioned the \"six primary galaxies.\" The meaning of that statement is undetermined, but it is known that the Star Wars galaxy was orbited by seven satellite dwarf galaxies: the Rishi Maze, Firefist, and Companions Cresh through Grek."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}