{"url": "Intermission,_Part_I", "categories": ["Category:Real-world articles", "Category:Star Wars Adventures (2017) lead stories"], "nodes": [{"tag": "h1", "text": "Intermission, Part I"}, {"tag": "p", "text": "\"Intermission, Part I\" is the first part of a story about Anakin Skywalker and Padmé Amidala. The story was published as the lead story of Star Wars Adventures 12 on July 25, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The play"}, {"tag": "p", "text": "At the Jedi Temple on the planet Coruscant, Jedi Knight Anakin Skywalker began his report alongside senator Padmé Amidala in front of the Jedi High Council."}, {"tag": "p", "text": "Earlier, Anakin and Padmé were were heading towards the starship of the actress Risha Synata. Onboard the ship, Risha Synata was playing a Jedi and dueling Darth Krist-Ov. Darth Kist-Ov was also played by an actor But when Krist-Ov knocked her lightsaber away she looked on to an audience. Before she could be struck down Risha used \"The Force\" to strike down the \"Sith\" instead."}, {"tag": "p", "text": "Back on the ship carrying Anakin and Padmé, Padmé prepared for a party that Risha Synata had invited her to on her private ship."}, {"tag": "h3", "text": "Meeting the actress"}, {"tag": "p", "text": "After landing on the ship, Anakin and Padmé took a ride on a personal transport where they passed roads lined with film posters of Risha Synata surrounded by a forest behind a fence. A forest was present on the ship with gundarks in order to show off Synata's immense wealth. Anakin and Padmé reached the entrance to a ballroom where the actress was being announced in front of a crowd. Padmé and Anakin greeted Synata as she walked down to them. She was very surprised to see a Jedi there and thought that they must see the Madam Synata's Genius of A Thousand Faces Museum, much to Padmé's annoyance. But Padmé managed to convince Risha Synata to move their viewing of the museum to the following day. Risha Synata ordered Padmé to get out of her way because she was in her light."}, {"tag": "p", "text": "Later, Padmé explained to Anakin what the museum was. She believed that it was just for Syanta to continue to show off. But Anakin saw this trip as a chance for him and Padmé to have some fun in their relationship without the having to fear the Jedi Council discovering them. Padmé agreed and asked Anakin for a kiss."}, {"tag": "h3", "text": "Morning at the museum"}, {"tag": "p", "text": "The next morning, Anakin and Padmé took a visit to the Thousand Faces Museum. A recreation of scenes starring Risha Synata  using mannequins were in each display. Padmé dismissed the historical inaccuracies in the scenes as the two passed one of Synata dressed as Padmé when she was the Queen of Naboo. They then walked by a display of members of the Jedi Council. But unbeknownst to them the mannequin of Grand Master Yoda activated with glowing red eyes."}, {"tag": "p", "text": "Padmé Amidala was drawn to the half finished painting of the Varykino, where Anakin and Padmé got married. Anakin and Padmé shared a romantic moment but where interrupted by mannequin Yoda who told her, \"No getting out of it this time, Padmé!\" More of the mannequins became alive and Anakin ignited his lightsaber to defend Padmé. They both realized that Risha Synata did not like Padmé as the mannequins. Anakin and Padmé fought the attackers off and made a move. They ran through the Endor and Hoth displays before hiding in a diner. Padmé found a fake door in the diner and they both went through to a new hallway as the mannequins broke into the diner. They found multiple banners with the icon of the Confederacy of Independent Systems. Next to the banners was a portrait of Risha Synata dressed as a Sith. Padmé went behind one of the banners to find the bridge of the ship and the hologram of the Dark Lord of the Sith, Darth Tyranus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}