{"url": "Internal_Affairs/Legends", "categories": ["Category:Legends articles", "Category:Imperial Security Bureau branches"], "nodes": [{"tag": "h1", "text": "Internal Affairs"}, {"tag": "p", "text": "Internal Affairs was a branch of the Imperial Security Bureau. Their mandate was to watch the Commission for the Preservation of the New Order for any signs of disloyalty or behavior against the tenets of the New Order. They took a keen interest in the Commerce, Justice, and Science branches of the Coalition for Progress, and the Enforcement branch of the ISB. It did not consider the Select Committee to be above suspicion, but whether or not it had the authority to investigate members was unclear. Internal policing of the Commission was always lax, allowing Internal Affairs to use the ambiguity and gray areas to expand their influence and power base."}, {"tag": "p", "text": "Internal Affairs agents were isolated from the rest of the Commission, and lone agents had a great degree of authority and autonomy. Field agents were referred to as \"keyns\", while investigative staff were known as \"dirtbugs.\" Internal Affairs also deployed protocol officers to military units to investigate traitorous activities."}, {"tag": "p", "text": "The branch used a wide array of innocuous terms to describe their activities and operations. An \"audit\" was the process of openly investigating a target and everyone connected to them. \"Finesse\" was the term used to describe the process of a target for help in targeting other potential traitors with the hope that the initial target would give up incriminating evidence about themselves. Grabbing an innocent target and watching the reaction of their associates was known as \"scattering.\" \"Crustbusting\" was the act of harassing a target with the intention of them eventually committing a criminal act. The process of allowing a minor target to go about their business in the hopes of catching them and associates in a larger crime was referred to as \"cultivation,\" while \"irrigation\" was applied to the act of staging events to force a \"cultivated\" target to perform the larger crime. The \"Jabba\" was a ploy that placed a target in a no-win scenario, forcing them to commit a crime to resolve the situation. Internal Affairs would then offer to forgive the transgression in return for assistance in other matters—which would then lead to the target committing further crimes, leaving him further in debt to Internal Affairs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h3", "text": "Non-canon sources"}, {"tag": "h2", "text": "Notes and references"}]}