{"url": "Intimidator_(Executor-class)", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Captured starships", "Category:Executor-class Star Dreadnoughts of the Galactic Empire", "Category:Flagships", "Category:Starships of the Imperial Remnant", "Category:Yevethan starships"], "nodes": [{"tag": "h1", "text": "Intimidator (Executor-class)"}, {"tag": "p", "text": "The Intimidator was an Executor-class Star Dreadnought used by the Imperial Navy's Black Sword Command during the Galactic Civil War. Originally undergoing work at a shipyard in the Core Worlds, it was transferred to the Empire's Black-15 shipyard above the planet N'zoth in the Koornacht Cluster to free up space for similarly-sized warships. Eight months after the Rebel Alliance's victory at the Battle of Endor in 4 ABY, the Black Fleet—comprising the Intimidator and all warships present, along with their crews—was seized by N'zoth's native Yevetha workers under resistance leader Nil Spaar as part of their mutiny against the Imperials, who had been in the process of withdrawing all military personnel and equipment from the Cluster."}, {"tag": "p", "text": "Renamed the Pride of Yevetha, the Super Star Destroyer served as Spaar's flagship as he was elevated to Viceroy of the Duskhan League during the Black Fleet Crisis, which pitted the Yevethan government against the New Republic under Chief of State Leia Organa Solo. In 16 ABY, the Pride of Yevetha was one of numerous vessels that participated in the Great Purge, an ethnic cleansing of the Koornacht Cluster enacted by the xenophobic Yevetha. In an effort to determine the strength of the Duskhan League's forces, several New Republic reconnaissance flights were sent into the Cluster, leading to the discovery of the Pride of Yevetha in the N'zoth system. The New Republic's leadership was shocked to learn that the Yevetha were in possession of a Star Dreadnought."}, {"tag": "p", "text": "Unbeknownst to the Yevetha, Imperial personnel captured during the Yevethan mutiny thirteen years before had spent their imprisonment installing slave circuitry into the Imperial-designed ships, including the Super Star Destroyer, in preparation for a revolt. Their work was completed by 17 ABY, just as a combined New Republic fleet arrived in the N'zoth system with an ultimatum for Spaar to surrender. Before the two fleets could begin the Battle of N'zoth, Imperial leader Major Sil Sorannan assumed command of the Intimidator—at the same time rejecting its Yevethan name—and activated the slave circuitry, bringing all the Imperial warships of the Black Fleet into hyperspace, with the Imperial throne world of Byss, in the Deep Core, as their destination. However, unknown to the liberated Imperials, Byss had been destroyed six years earlier. The Black Fleet arrived at the remains of the planet and, after a month, had gradually dispersed. The Intimidator disappeared, although it was discovered four years later near the Unknown Regions, abandoned and destroyed."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Intimidator was a 19,000-meter-long Executor-class Star Dreadnought, though like its sister ships, the warship was sometimes referred to as a Super-class Star Destroyer. The Intimidator was modified beyond its stock statistics; among its improvements was an additional shield generator mounted on the ship's midline. During the vessel's time in the hands of the Yevetha, the Imperial captives of Camp Pa'aal Squadron installed slave circuitry—a feature that enabled one person to assume remote command of an entire fleet's worth of enslaved ships—into the Intimidator and the other ships of the Black Fleet. The installation of the slave circuitry had been done piecemeal during their years of captivity, and the last necessary components were assembled and delivered to their respective ships in 17 ABY in preparation for an Imperial revolt."}, {"tag": "p", "text": "The Yevetha also made several modifications to the Intimidator. Darama Nil Spaar had three of the warship's detention blocks transformed into breederies for his offspring, each possessing forty-eight alcoves serving as birth-casks. For the purpose of housing prisoners, three of the Super Star Destroyer's cargo bays were converted into large holding cells, with minimal facilities capable of supporting a thousand beings. The breederies and holding cells were completed by 16 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Docked at the Black-15 shipyard"}, {"tag": "p", "text": "The Intimidator was one of three Executor-class warships assigned to the Black Fleet of Black Sword Command, a unit within the Imperial Military tasked with the defense of the Core Worlds. Eight months after the Rebel Alliance's victory and the death of Emperor Palpatine at the Battle of Endor in 4 ABY, the Intimidator was stationed at the Black-15 shipyard above the Yevethan homeworld of N'zoth in the Koornacht Cluster, having been transferred from the Core Worlds, where it had been undergoing work, to free up the necessary amount of space for construction of another Executor-class vessel. Out of the nine ships undergoing repairs at the Black-15 dock, only the Intimidator was spaceworthy."}, {"tag": "p", "text": "When Imperial garrison commander Jian Paret received an order to withdraw all military personnel from the system and destroy whatever had to be left behind, Paret used the Intimidator as his command ship during the evacuation, having moved to it within an hour after receiving his orders. With only one-third of a crew aboard, and the need to transfer all of the garrison's assets and personnel to the warship before destroying the repair yard, Paret was unable to leave as quickly as he had wanted. To avoid any potential hostile moves from the predominantly Yevetha work force, Paret hid the true nature of the Imperial evacuation behind the facade of a departure drill."}, {"tag": "p", "text": "However, Yevetha underground leader Nil Spaar knew of the imminent Imperial withdrawal and had chosen the time to seize the Black-15 shipyard and all of the vessels present as part of a plan to revolt against the Imperials five years in the making. With the transfer of the Victory-class Star Destroyer Harridan from patrol duty to active service at the battlefield at Notak, Spaar saw that the Imperials were essentially defenseless. In Sections 17 and 21 of the Intimidator, over a dozen external hatches were rigged to report their status as secured and sealed during an emergency battle-stations lockdown. The Yevetha leader had taken additional precautions should the ship attempt to escape—a package of explosives, disarmed only by a constant signal, would destroy the ship if the shields were activated, blocking the signal and detonating the bombs. With these measures in place, two Yevetha commando teams—one led by Spaar and the other by his second-in-command, Dar Bille—boarded the Intimidator through the rigged hatches. Silently and quickly, the two teams converged on the bridge without having to fire a single shot. When they breached the command deck, they killed seven of the Imperial crew present before securing the remainder."}, {"tag": "p", "text": "As the events unfolded, Imperial Governor Crollick's shuttle and a convoy of Imperial transports rose from N'zoth's surface toward the Intimidator as the warship slid out of her berth at the shipyard. When the transports began decelerating in preparation for docking, Spaar ordered all of the warship's autotargeting batteries to open fire on the inbound ships, a move that killed 20,000 Imperials: soldiers, technicians, bureaucrats, and families. Spaar concluded the bloodshed by executing Paret with his dew claw, a retractable blade that emerged from a Yevetha's wrist. The Yevetha leader wasted no time in announcing that the remaining crew were now the prisoners of the Duskhan League, the Yevethan government. The other eight Star Destroyers present at the shipyard were also captured. The captive Imperials, approximately 300,000 crew members from the Intimidator and the Victory-class Star Destroyer Valorous, were transferred to Pa'aal, the primary moon of N'zoth, to serve the Yevetha in operating and constructing their warships."}, {"tag": "h3", "text": "In the service of the Yevetha"}, {"tag": "p", "text": "By 16 ABY—twelve years after the failed Imperial evacuation of N'zoth—the Yevetha had learned how to operate the captured ships from their onetime oppressors, who were now prisoners themselves. However, unbeknownst to their overseers, the Imperials had begun the installation of slave circuitry in all the former Imperial warships, work done piecemeal over the years in preparation for a counter-revolt. The Intimidator was renamed Pride of Yevetha and was pressed into service as the flagship of Darama Nil Spaar, viceroy of the Duskhan League. At the time, Dar Bille served as the primate of the warship. Spaar's personal staff—including his primary and secondary mates; his first attaché Eri Palle; and Vor Duull, the proctor of information science from the thrustship Aramadia—were transferred to the Pride of Yevetha as well. It was from the bridge of the Super Star Destroyer that Bille, acting on an edict from Spaar, ordered the Yevethan warships to begin the Great Purge, an ethnic cleansing of the Koornacht Cluster. The Pride of Yevetha participated in the extermination of a colony of Kubaz at Morning's Bell and the capture of a former Imperial factory farm at Pirol-5, while the rest of the Black Fleet succeeded in ridding the Cluster of the foreign \"vermin.\""}, {"tag": "p", "text": "Though New Republic Chief of State Leia Organa Solo was appalled by the Duskhan League's actions, the New Republic could not defend the conquered worlds of the Koornacht Cluster, as they were not members of the galactic government. Certain members of the New Republic Senate were directly opposed to Republic involvement in the conflict, but Organa Solo nonetheless issued an ultimatum for Spaar—the Duskhan League was to withdraw from the worlds it had seized, or the New Republic would declare war. Spaar would not back down, however; the New Republic was unaware of the League's full military strength and the existence of the Intimidator, which Spaar could use to his advantage. The New Republic made the first move with a blockade of Doornik-319 that proved disastrous and prompted members of the Senate to move against their Chief of State."}, {"tag": "p", "text": "While this internal strife continued, several New Republic reconnaissance flights were made into the Koornacht Cluster to ascertain the Duskhan League's military strength. Lieutenant Rone Taggar of the New Republic Fifth Battle Group's 21st Recon Group was dispatched in his Recon-X starfighter Jennie Lee to the N'zoth system to record statistical data on the Yevethan forces present. As the five-minute flight proceeded, the Jennie Lee's on-board R2-R unit was able to identify Aramadia-class thrustships, Victory-class and Imperial-class Star Destroyers, and a lone Executor-class Star Dreadnought—the Pride of Yevetha. Taggar's data, along with that of the other recon flights throughout the Cluster, was transmitted to the New Republic Defense Force headquarters, where it was reviewed by Organa Solo, Admiral Ackbar, and others. The Tammarian officer Ayddar Nylykerka from the Asset Tracking office, who was on hand to identify the warships of the Black Fleet, was the one who confirmed the presence of the Intimidator, knowing it only by its Imperial name. Nylykerka deduced the ship's identity from the additional shield generator tower on the warship's centerline—a trait common to all late-production Executor-class ships. All present to hear the Tammarian's revelation realized that nothing in the New Republic Navy could outmatch a Super Star Destroyer."}, {"tag": "p", "text": "In preparations for war with the Yevetha, the Chief of State dispatched her husband, Commodore Han Solo, to assume command of the New Republic Fifth Fleet. En route, he was captured by the Yevetha and imprisoned on N'zoth. He was later transferred to one of the Pride of Yevetha's unused cargo areas, where he and the other captives were intended to be used as living shields in the case of a New Republic attack. Unbeknownst to the Yevetha, members of the Fallanassi, a Force-based religion whose members were adept at creating illusions, had managed to rescue most of the prisoners before their transfer to the Super Star Destroyer. A few Fallanassi had stayed behind in order to project the illusion that all the captives were still present."}, {"tag": "p", "text": "Spaar used the bridge of the Pride of Yevetha as the backdrop of a holorecording designed to lead the Republic into believing that a \"Grand Imperial Union\" under a Moff \"Tragg Brathis\" had entered into a mutual agreement with the Duskhan League. Ackbar was able to confirm that both the Grand Imperial Union and Moff Brathis were non-existent, falsifications fabricated by Spaar, but the presence of a sizable amount of Imperial Star Destroyers in the recording was still enough to concern the Republic's leadership."}, {"tag": "p", "text": "Meanwhile, the Wookiee Chewbacca and members of his family, including his son, Lumpawarrump, and cousins Jowdrrl, Shoran, and Dryanta, launched a rescue mission to retrieve Solo from the Pride of Yevetha in the N'zoth system, using New Republic Fleet Intelligence information—such as a technical readout of a Super Star Destroyer—provided by the Yao information broker Formayj. Piloting the light freighter Millennium Falcon, Chewbacca utilized firecracker mines to blind the Super Star Destroyer's sensors, allowing him to perform a quick in-system hyperspace jump that brought him to 1,100 meters off the Pride of Yevetha's starboard bow without the gun batteries being able to track him. The Wookiees utilized a hull-cutting ring to board the warship, and Chewbacca, Shoran, and Lumpawarrump traversed through the Super Star Destroyer's converted detention blocks, severely damaging the breederies in the process. The strike team eventually arrived at the cargo hold where Solo was being kept. With Solo freed, the group escaped in the Millennium Falcon, leaving many of the warship's Yevetha crew and soldiers dead from the raid."}, {"tag": "p", "text": "Following the attack, Spaar focused on replenishing the breederies, but this task was interrupted when three Republic stasis probes—harbingers of an impending Republic attack—arrived in the N'zoth system. Spaar rushed to the bridge and ordered that the Pride of Yevetha break orbit to intercept and destroy the probes, despite Proctor of Defense Tho Voota's fears that N'zoth would be left undefended. As the Pride of Yevetha moved forward, the New Republic fleet emerged from hyperspace, just out of range of the Yevethan fleet's batteries. Republic General Etahn A'baht used the opportunity to deliver a final ultimatum to the Yevetha Viceroy."}, {"tag": "h3", "text": "The Empire strikes back"}, {"tag": "p", "text": "From the flagship's fire control center, the Imperial resistance leader, Major Sil Sorannan, listened patiently, marveling at how the New Republic had matured from the hit-and-run tactics of its predecessor, the Rebel Alliance. When the Pride of Yevetha was merely a minute away from being able to fire upon the nearest Republic vessel, Spaar issued his own challenge; simultaneously, Sorannan began his revolt. Using the slave circuitry that he and his Imperial allies had installed over the time of their captivity, Sorannan assumed command of the Black Fleet, bringing all the Star Destroyers to a halt. While the Yevethan ships continued their attack, Sorannan—identifying himself as acting captain of the Intimidator—contacted A'baht and informed him that his Camp Pa'aal Squadron was leaving the battle. The long-delayed withdrawal of Black Sword Command was finally completed when the Star Destroyers made the jump to hyperspace, the Imperial throne world of Byss, in the Deep Core, as their destination."}, {"tag": "p", "text": "With the heart of their fleet gone, the Yevetha were now outnumbered five-to-one. Spaar had been aboard the Intimidator when it departed, leaving the Yevetha leaderless. Despite these setbacks, the Duskhan League engaged the New Republic fleet with what they had left: D-type fighters and forty-four Aramadia-class thrustships. After inflicting heavy casualties, the Yevethan force was obliterated, and the Black Fleet Crisis came to an end. Spaar was taken captive by the Imperials aboard the Intimidator; in revenge for the years of servitude, Sorannan had Spaar placed in an escape pod and launched into hyperspace, where he would eventually die and from which his remains would never be recovered. The Black Fleet eventually arrived in the Beshqek system, but where Byss had once been was merely an asteroid field, created after the throne world had been destroyed by the Galaxy Gun superweapon approximately six years earlier. After a month, the fleet dispersed—some elements defected to the New Republic, while other warships joined up with some of the surviving factions of the Empire. The Intimidator vanished entirely; it was discovered four years later near the Unknown Regions, abandoned and irreparably damaged."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Before the Yevethan revolt, the Intimidator was crewed by one-third of the amount of personnel required to operate the ship. Approximately thirteen years later, in its service to the Duskhan League, the Pride of Yevetha's personnel included over 15,000 Yevetha and 513 veterans from Black Sword Command."}, {"tag": "h3", "text": "Jian Paret"}, {"tag": "p", "text": "Jian Paret was the commander of the Imperial garrison on N'zoth in 4 ABY and the supervisor of Black Sword Command's withdrawal from the N'zoth system. He took the Intimidator as his command ship during the retreat, as it was the only spaceworthy vessel present at the Black-15 shipyard. Paret was captured during the Yevetha takeover of the Super Star Destroyer, and he watched helplessly as the Yevetha turned the warship's gun batteries on the evacuation shuttles. Immediately after, Nil Spaar executed him with a slash of the Yevetha's dew claw."}, {"tag": "h3", "text": "Nil Spaar"}, {"tag": "p", "text": "Nil Spaar, before becoming viceroy of the Duskhan League, was a Yevetha resistance leader who personally led the uprising that captured the Intimidator. By 16 ABY, he had ascended to the position of viceroy and was regarded as the darama, or \"chosen one.\" In the same year, he took the renamed Pride of Yevetha as his flagship, transferring most of the crew from his previous flagship, the thrustship Aramadia, to the Super Star Destroyer, including his attaché Eri Palle, Proctor of Information Science Vor Duull, his breeding mates, and his honor guard. The Viceroy had three of his flagship's detention blocks converted into breederies for his children. Brutal and xenophobic, Spaar oversaw the \"cleansing\" of the Koornacht Cluster and manipulated strife within the New Republic Senate to his advantage. His plans came to an abrupt halt when the Imperials of Camp Pa'aal Squadron revolted and assumed control of the Intimidator and Black Fleet, taking Spaar captive in the process. Sil Sorannan put Spaar in an escape pod and launched him out into hyperspace, from which he was never recovered."}, {"tag": "h3", "text": "Dar Bille"}, {"tag": "p", "text": "Dar Bille served as Nil Spaar's second-in-command during the Yevetha uprising, leading the second of two commando teams in the capture of the Intimidator during the failed Imperial withdrawal from N'zoth. Twelve years later, he was the primate, or commander, of the Pride of Yevetha during its operational service with the Duskhan League. Bille oversaw the Pride of Yevetha's participation in the Great Purge, and he was still in command when the warship was seized by Camp Pa'aal Squadron during the Battle of N'zoth."}, {"tag": "h3", "text": "Sil Sorannan"}, {"tag": "p", "text": "Sil Sorannan served as a major in Black Sword Command, having previously worked with a research team attempting to drop bombs from hyperspace and into realspace. During the Yevetha uprising, Sorannan was one of the 300,000 Imperials captured and forced to aid the Yevetha in operating their newly-acquired warships, including the Intimidator. Over time, Sorannan became the leader of Camp Pa'aal Squadron, the Imperial resistance movement. He oversaw the construction and distribution of the slave circuit technology that, when the time was right, would give him complete control of the Black Fleet. While aboard the Pride of Yevetha—which he often had to remind himself was properly known as the Intimidator—he served in the fire control center of the Super Star Destroyer, maintaining the data server for target registry. Before the Battle of N'zoth could properly commence, Sorannan began his revolt and assumed command as acting captain of the Intimidator. He activated the slave circuitry, tasking the Imperial warships with jumping into hyperspace and heading for the Imperial throne world Byss. En route, he utilized his experience of dropping bombs into hyperspace when he left Nil Spaar stranded there in an escape pod."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Intimidator first appeared in the novel Before the Storm, the first book of The Black Fleet Crisis trilogy, written by Michael P. Kube-McDowell and released in 1996. The warship went on to appear in the other two books of the trilogy and was mentioned in later sourcebooks, which revealed its fate following the Battle of N'zoth. The Intimidator received its first visual depiction in The Official Star Wars Fact File 22, released in May of 2002, six years after the publication of Before the Storm."}, {"tag": "p", "text": "Though the Intimidator is continually referred to as a \"Super-class Star Destroyer\" throughout the trilogy, the second book in the series, Shield of Lies, was the first to provide the designation \"Executor-class Star Destroyer\" for the Intimidator and her sister ships. However, recent sources, such as the StarWars.com Databank's Super Star Destroyer entry and an article on the Wizards of the Coast Web site, have updated the name as \"Executor-class Star Dreadnought,\" in addition to increasing the length of the class from 8,000 meters (as reported in the books of the trilogy) to 19,000 meters. This article reflects these changes."}, {"tag": "p", "text": "Although Before the Storm and Tyrant's Test make it clear that the majority of the Intimidator's Imperial crew was captured during the Yevetha revolt, both the Star Wars Encyclopedia and A Guide to the Star Wars Universe, Third Edition, Revised and Expanded state that the entire crew was killed during the takeover. This article assumes the canonicity of both Before the Storm and Tyrant's Test."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}