{"url": "Into_the_Unknown", "categories": ["Category:Real-world articles", "Category:Star Wars Resistance episodes"], "nodes": [{"tag": "h1", "text": "Into the Unknown"}, {"tag": "p", "text": "\"Into the Unknown\" is the twenty-second episode and the season premiere for the second season of Star Wars Resistance. The episode premiered on April 15, 2019 at Celebration Chicago. It premiered on television on October 6, 2019, on Disney XD."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Following their battle with the First Order, Kaz and his friends hope to reach the Resistance base on D'Qar. But the Colossus has suffered damage, and there may be other threats lurking in the shadows..."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Captain Phasma's orders"}, {"tag": "p", "text": "The episode opens with a speagull resting on the wrecked solar collector of a downed First Order TIE/fo space superiority fighter. The camera then shows a wide shot of several wrecked TIE fighters lying in Castilon's ocean. Several racing rings still hang over where the Colossus used to lie."}, {"tag": "p", "text": "A TIE fighter soars through the air into space to meet a white Resurgent-class Star Destroyer in orbit. Captain Phasma speaks with Commander Pyre and Agent Tierny via hologram, inquiring about the status of the refueling station known as the Colossus. Pyre tells Phasma that the Resistance fighters have seized control of the station and disappeared into hyperspace."}, {"tag": "p", "text": "Phasma is displeased because she regards the refueling station as a valuable resource to General Leia Organa. She warns Commander Pyre not to let the station fall into the grasp of the Resistance. Tierny is confident that they will succeed. Phasma orders them to recover the station or to destroy it if they can't recover it. She also warns them that she will see to their execution if they fail."}, {"tag": "p", "text": "Shortly later, a stormtrooper ushers Tamara Ryvora into the bridge. Commander Pyre welcomes her aboard and says that they look forward to hearing more about her friends. Tam gasps before regaining her composure."}, {"tag": "h3", "text": "Voyage to D'Qar"}, {"tag": "p", "text": "Insider Hangar B2, Bucket, and CB-23 stare into lightspeed as the Colossus exits hyperspace. Kazuda Xiono asks Neeku Vozo how far he got them close to D'Qar. Neeku admits that he has no idea but hopes that they are relatively close to D'Qar. Neeku says that the feel of discovery is exhilarating before talking about the sun rising and setting."}, {"tag": "p", "text": "Kaz decides to check with Captain Imanuel Doza if he has a better idea where they are. They walk past the Frigosian Opeepit in the corridor. Kaz says that they are lucky they made the jump in one piece despite taking a hit from that Star Destroyer. Neeku replies that the repairs will be extensive and that they cannot afford to be attacked again up until the main systems are operational. Kaz hopes that the First Order doesn't know where they are. Neeku laughs and says he likes Kaz for finding the positive side in dire and difficult situations like this."}, {"tag": "p", "text": "The two enter Captain Doza's office. Captain Doza tells Jarek Yeager over the intercom that he needs him to complete a full diagnostic SCAN of the platform. Yeager responds that this will take some time. Doza suggests that they start with their primary systems and work their way from down there. Kaz offers to help, blaming himself for bringing the trouble with the First Order."}, {"tag": "p", "text": "Doza responds that he himself is responsible for bringing the First Order onto this platform. Kaz is still shocked by the Hosnian Cataclysm and wonders whether his parents survived it. Captain Doza reassures Kaz that he took the right choice and adds that this is the only choice in times like these. He walks away from his desk and heads upstairs."}, {"tag": "p", "text": "He tells Kaz and Neeku that he lived through the Imperial Era and had hoped that Kaz and his daughter Torra Doza would never have to live through a time like that. Doza surmises that the galaxy doesn't learn enough from its mistakes but tells them not to despair about truths and \"non-truths\" that they don't know."}, {"tag": "h3", "text": "The command deck"}, {"tag": "p", "text": "Doza leads Kaz and Neeku into the Colossus's command deck, telling them that he has reopened it to aid with navigation for their journey ahead. Yeager, Torra Doza, and several droids are manning the deck consoles and computers. Kaz is amazed and says that he never knew this place was up here."}, {"tag": "p", "text": "Yeager delivers his damage report and tells Captain Doza that they have malfunctions across the board including defensive cannons, deflector shields, and sublight engines. A repaired 4D-M1N tells them that the hyperdrive is out of coaxium fuel and that is preventing them from making another jump."}, {"tag": "p", "text": "Torra says that she is amazed that they made the jump at all with a ship this old. When Captain Doza asks his daughter their position, she replies that they are three parsecs from D'Qar. Neeku cheers and Kaz adds that there is a Resistance base hidden on that planet. Yeager asks him how certain he is about the location of the Resistance base. Kaz is certain because he heard it from General Organa herself."}, {"tag": "p", "text": "Yeager tells 4D-M1N to send a transmission to D'Qar. However, they discover that their long range communications are not operational. Neeku tries to strike a positive note by saying that the First Order doesn't know where they are. Captain Doza says that they have only bought time and warns that the First Order is already hunting them down. Kaz says that it is urgent that they get to D'Qar."}, {"tag": "h3", "text": "Gravity issues"}, {"tag": "p", "text": "Just then the artificial gravity system stops working, causing them to float in zero gravity space. Kaz panics while 4D clings on to CB-23. Torra is surprised that Kaz has never been in zero gravity before. Kaz and Neeku crash into each other. Captain Doza tells Yeager to add the gravity issue to their list. Yeager responds that he thinks that the engines and shields should take priority."}, {"tag": "p", "text": "Kaz volunteers and Yeager accepts his help, telling him to check on the transmission relay while in the engineering deck. Torra volunteers to help and Doza allows her to go. Kaz says that you won't regret it but trips down the stairs. Torra says she will keep an eye on him."}, {"tag": "p", "text": "While running through the corridor, Torra asks Kaz if he knows anything about fixing gravity generators and transmitter relays. Kaz claims he knows how to do it because they are bigger machines that he, Neeku, Tam, and Yeager worked on. Kaz bumps into a metal frame and gets swept up into zero gravity space."}, {"tag": "p", "text": "Kaz bumps into Opeepit, who is trying to reach a bar of chocolate. Kaz, Neeku, Torra, and CB-23 float down into the engines deck. Neeku discovers that the Chelidae have retreated into their shells, which means that they are afraid of something. Kaz responds that they need to get the gravity back on and to check on those relays."}, {"tag": "h3", "text": "The hidden danger"}, {"tag": "p", "text": "As they float deeper into the engineering deck, the First Order BB-series astromech droid MB-13A watches them menacingly through a ventilation shaft. His visual processor is cracked but still operational."}, {"tag": "p", "text": "Inside the Colossus hyperdrive chamber, Kaz and his team struggle with the controls for the innovative relays. Kaz wishes that Tam was here. Neeku jokes that she is much better than them. Kaz sends Neeku to ask the \"shell folk\" for help. Neeku speaks to Vil'pak and reassures him that the danger is finally past."}, {"tag": "p", "text": "Speaking in the Chelidae language, Vil'pak tells them they should leave because it is dangerous down here. Neeku translates for Vil'pak. Kaz thinks that the Chelidae are still shell-shocked by the recent battle. Torra reminds him that they still have to fix the gravity generator. She says that the long range transmitter is attached to the power-burst relay in the function valve down in the maintenance tunnel."}, {"tag": "p", "text": "Kaz tells Torra that they can take care of the gravity generator. He sends CB-23 into the shaft to fix the long range transmitter. Neeku laughs while floating in zero gravity. CB-23 heads down the corridor and opens a generator panel. She inspects the tubes in the shaft and switches the generator back on. Just then, MB-13A ambushes her from behind, having been stalking her."}, {"tag": "h3", "text": "Repair complications"}, {"tag": "p", "text": "Neeku hears her cries. While fixing the gravity generator, Kaz complains that the wiring is a jumbled mess. Torra reminds him that everyone is counting on them. Kaz thinks that everyone upstairs is miserable with the gravity off. However, Aunt Z, Kragan Gorr's Warbird gang and the patrons are enjoying themselves at Aunt Z's Tavern in zero gravity, occasionally bumping into each other. Aunt Z serves her customers beverages in zero gravity form. Al floats after his drink while Flix remarks that their present circumstances are not good for business. However, Orka is too busy enjoying himself floating around."}, {"tag": "p", "text": "Neeku notices that it is taking CB-23 a long time to get the long range transmitter working. Kaz manages to repair the gravity generator, causing several patrons to drop to the floor at Aunt Z's Tavern. Flix tells Orka he \"asked for that\" while Al grumbles at the puddle of his liquor on the floor."}, {"tag": "p", "text": "Back in the hyperdrive room, Torra tells Kaz that the gravity is too strong and that they are struggling to move. Kaz struggles to adjust the gravity controls but instead causes it to return the zero gravity mode. Kragan Gorr, Gork and Leoz float in zero gravity. Kaz manages to restore the gravity setting and they come tumbling down, but the gravity quickly fails yet again."}, {"tag": "p", "text": "Torra points out that they are not getting power to the induction coil. Kaz grumbles that it should be working and asks \"Tam\" to hand him the fusion spanner. Torra reminds him that her name is Torra. Kaz apologizes and Torra understands that it can be hard to lose a friend."}, {"tag": "h3", "text": "Joining the First Order"}, {"tag": "p", "text": "Aboard the Resurgent-class Star Destroyer, Tamara tells Agent Tierny that she told her everything. She explains that the Resistance starfighter pilot Poe Dameron was friendly with Yeager and that he left his BB unit with Kaz for a while. She says that she had no idea that they were spying for the Resistance. Tam pleads for Tierny to believe her."}, {"tag": "p", "text": "Tierny asks Tam how she feels about the Resistance. Tam responds that the Resistance is full of outlaws and liars like the people she thought were her friends. When Tierny asks her about the First Order, Tam thinks that they are trying to \"make the galaxy safe again.\" Tierny asks Tam about her motives for joining the First Order."}, {"tag": "p", "text": "Tam responds that she is an excellent pilot and that she wants to use those skills in service of a cause she believes in. Tierny responds that she believes her and places her arms on her shoulders. She tells Tam that for her to rise through the ranks, she would require her total cooperation. Tam says she understands and agrees to help the First Order to locate the Colossus even though it might put her \"friends\" in jeopardy. Tam responds that they are not her friends anymore."}, {"tag": "p", "text": "Tierny is pleased and ushers her towards Commander Pyre, who orders her to report to the Quartermaster and to pick up her uniform, addressing her as Cadet Pilot DT-533. Tam walks down a turbolift while Tierny smiles at Commander Pyre."}, {"tag": "h3", "text": "Ambushing Neeku"}, {"tag": "p", "text": "Back in the Colossus hyperdrive room, Kaz is stung by an electric shot. He wonders what is taking CB-23 so long. Neeku volunteers to go and check on CB-23. Kaz tells Neeku to tell CB-23 to hurry. Neeku travels down the corridor and calls for CB. He notices that the lights in the corridor have been switched off. He soon discovers that CB-23 has been decapitated."}, {"tag": "p", "text": "MB-13A floats behind Neeku. Neeku grabs CB's head and tells the droid that he will get her running again. Just then, MB-13A grabs Neeku with a grappling hook and drags him away. Kaz is stung when a cable short-circuits and bumps his head. He emerges from the gravity generator and tries to contact CB-23 and Neeku by comlink."}, {"tag": "p", "text": "Torra asks what is going on and Kaz thinks that Neeku is trying to fix more than he told him to. Torra says that they were sent to fix two things and that they still haven't fixed them. She leads Kaz down the corridor to investigate. Venturing into the corridor, they hear Neeku's faint groans. Torra starts to look worried."}, {"tag": "p", "text": "They find Neeku bound to the ceiling with a cable. Torra thinks that Neeku is playing games. Just then, a droid drops behind them. Thinking it is CB-23, Torra asks where she has been only for her and Kaz to discover that it is the First Order droid MB-13A, which he had encountered earlier. Kaz thinks they are in trouble."}, {"tag": "h3", "text": "Fighting MB-13A"}, {"tag": "p", "text": "Back in the command deck, 4D-M1N reports to Captain Doza that the long range transmitter has been restored. However, the artificial gravity, deflector shields, and propulsion systems are still non-operational. Doza wonders what is taking the kids so long. Yeager responds that Kaz and Neeku can handle any problems. He adds that they have Torra with them, which Doza regards as a good thing."}, {"tag": "p", "text": "Back in the tunnel, Kaz is surprised that MB-13A survived their last encounter. Torra responds that the First Order makes them tough. The droid unleashes its electro-shock prod and fires a grappling cable. Kaz and Torra narrowly escape its charge. Kaz tells Torra to take care of Neeku while he deals with the droid. Torra fights off MB-13A and struggles to free Neeku from his bonds."}, {"tag": "p", "text": "Kaz leads MB-13A on a chase through the dark corridor but is electrocuted by the droid. Torra rushes to his aid and evacuates him out of the transmission shaft. MB-13A pursues them into the engine room. Torra revives Kaz while hiding behind an exhaust pipe. While Torra and Kaz hide in the ceiling shafts, MB-13A connects to a network terminal and begins activating communications. Torra and Kaz realize that the First Order droid waited for them to fix the communications so that it could alert the First Order."}, {"tag": "p", "text": "In the command deck, 4D-M1N reports that a coded signal is being beamed back to Castilon by a satellite. Captain Doza and Yeager realize that something is wrong. Doza orders that the signal be shut down. He fears that if the signal gets back to Castilon, the First Order will know of their location. 4D reveals that the intruder has bypassed Doza Tower control. While MB-13A is transmitting the signal, Kaz dives at the First Order astromech droid and twists its head. He leads the droid on a chase and MB-13A pursues him with his electro-shock prod. Torra goes to the transmitter while Kaz flees MB-13A."}, {"tag": "h3", "text": "Sucked into space"}, {"tag": "p", "text": "Meanwhile, a bound Neeku grabs CB-23's body with his legs, telling the deactivated droid that he will restore her. Kaz leads MB-13A into the ceiling shafts while Neeku struggles to reactivate CB-23's head. Torra is in the process of deactivating the coded signal. Just then, Neeku steps on the panel on CB-23's head which reboots the droid and she reconnects to her body. Neeku tells CB-23 that Kaz and Torra need her help because a First Order \"rollie\" is out there. He tells CB not to worry about him but not to forget him if she survives."}, {"tag": "p", "text": "MB-13A corners Neeku at an exhaust pipe but CB-23 intervenes and knocks the First Order astromech droid into a corner. Kaz cheers as both ball droids activate their electro-shock projectors. Torra tells Kaz she has deactivated the transmission feed. Kaz enlists her help in lifting a floor shaft."}, {"tag": "p", "text": "Kaz tells Torra and CB-23 to hang onto something as he opens the trapdoor to the vacuum of space. CB-23 uses her grappling hook to latch onto the ceiling. As Kaz and Torra cling onto to the machinery, MB-13A grabs Kaz's leg with one of its appendages. It drags Kaz down and CB-23 drops her grappling hook for Kaz to cling on."}, {"tag": "p", "text": "Kaz falls but manages to cling onto a panel. Torra manages to seal the trapdoor, slicing through MB-13's grappling cable. The droid floats through the vacuum of space. Kaz tells Torra he is okay. Torra replies that they should get that gravity back on. Neeku calls out to his friend and reminds them not to forget about him."}, {"tag": "h3", "text": "A strained friendship"}, {"tag": "p", "text": "The gravity field is soon restored to the command deck and Aunt Z's tavern. Kragan Gorr and his pirates drop to the floor. Kaz tells Torra, Neeku, and CB-23 that they managed to intercept the First Order droid's transmission. Kaz wonders whether he should explain himself to Tam. Neeku thinks this is risky but he suggests sending a message to her personal comlink on a secure frequency. Torra still thinks this is dangerous but Kaz still regards Tam as his friend and believes he owes her that."}, {"tag": "p", "text": "Aboard the Resurgent-class Star Destroyer, Tam enters her quarters in her new First Order TIE Fighter Pilot uniform. She puts down her old mechanic clothes on her bunk and inspects the helmet in her closet. Tam is pleased that she has become a pilot. Just then, she receives a recorded transmission on her comlink from Kaz."}, {"tag": "p", "text": "Kaz apologizes for lying to her about why she came. In anger, Tam shuts off his message and throws the comlink on the bed. She takes her helmet out of her closet and dons it. The camera focuses on her helmet before panning out."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}