{"url": "Into_the_Great_Unknown", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Real-world articles", "Category:Wookieepedia former Featured articles", "Category:Non-canon Legends articles", "Category:Star Wars Tales 19"], "nodes": [{"tag": "h1", "text": "Into the Great Unknown"}, {"tag": "p", "text": "\"Into the Great Unknown\" is a ten-page non-canon comic story that was written by W. Haden Blackman. Within its pages, Han Solo and Chewbacca pilot their starship, the Millennium Falcon, blindly into hyperspace and end up crashing into the planet Earth's Pacific Northwest. Solo is attacked and killed by a group of Native Americans, and, 126 years later, his skeleton is discovered by the archaeologist Indiana Jones, who is searching the area for the fabled Sasquatch (in fact Chewbacca)."}, {"tag": "p", "text": "\"Into the Great Unknown\" was included in the comic book Star Wars Tales 19, which was released on May 14, 2004. The story is notable for being the first officially-licensed work to include both Han Solo and Indiana Jones, two characters portrayed on film by Harrison Ford in the 1970s and 1980s. The idea to write a story featuring the two was floated by staff at Dark Horse Comics, who then asked Blackman to pen it. While writing, he inserted references to both film franchises into the story, hoping to appeal to a wide range of fans."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Sometime after the Battle of Endor, Han Solo and Chewbacca, respectively the Human pilot and Wookiee co-pilot of the YT-1300 light freighter Millennium Falcon, run afoul of an Imperial fleet after leaving the moon Hovan 99. As they evade a Star Destroyer and several TIE Fighters, Solo takes the Millennium Falcon blindly into hyperspace rather than taking the time to calculate jump coordinates. The ship emerges in an unfamiliar system that contains several planets and moons, and the pair lands on a blue world after detecting life on it."}, {"tag": "p", "text": "The ship's rear repulsorlift controls give out on their way into the planet's atmosphere, causing the Millennium Falcon to crash into a forest that reminds Solo of the moon of Endor. As they search for a settlement, Solo and Chewbacca are attacked by a group of Humans who wield spears, bows, and axes. Chewbacca fights them off with his bowcaster and his own strength, knocking some of them off a cliff to their demises, but Solo is struck by several arrows and begins to slowly bleed to death. Anticipating that he will not survive, he asks his co-pilot to return him to the Millennium Falcon, where he passes away in the captain's chair."}, {"tag": "p", "text": "126 years later, three Humans make their way through the same forest—an archaeologist named Dr. Jones, his sidekick Shorty, and their guide, in search of a legendary monster that has been sighted in the area. Chewbacca watches from afar as they come across the Millennium Falcon, board the ship, and discover Solo's skeleton. The skeleton feels familiar to Jones, and, rather than continue his search for the monster, he decides to leave it as part of the \"Great Unknown\"."}, {"tag": "h2", "text": "Main characters"}, {"tag": "h3", "text": "Han Solo"}, {"tag": "p", "text": "After fleeing blindly into hyperspace from an attacking Imperial fleet, Han Solo and his co-pilot Chewbacca crash their starship, the Millennium Falcon, into the forests of an unfamiliar planet. After leaving the downed vessel to search for a settlement, they are attacked by a group of primitive Humans, who fire several arrows at Solo and pierce his skin. He realizes that he is going to die, and asks Chewbacca to bring him back into the Falcon so that he may spend his final moments there."}, {"tag": "h3", "text": "Chewbacca"}, {"tag": "p", "text": "Chewbacca the Wookiee is flying with Solo as the Millennium Falcon lands on the unfamiliar planet, and he kills all of the attacking Humans with his bowcaster and his brute strength, although he is too late to save Solo from dying. After Solo passes away, Chewbacca begins roaming the nearby forest and is referred to as \"Sasquatch\" by the natives. He is still present 126 years later, watching over the Millennium Falcon."}, {"tag": "h3", "text": "Dr. Jones"}, {"tag": "p", "text": "126 years after Solo's death, Dr. Jones and his partner Shorty are drawn by reported sightings of a monster to the forest where the Millennium Falcon lies. They are guided by a Human who shows them the starship, and after they board it, Jones discovers Solo's skeleton and finds something about it familiar. He decides to leave it, and the supposed monster, be."}, {"tag": "h3", "text": "Shorty"}, {"tag": "p", "text": "Shorty accompanies Indiana Jones on his expedition to the forest, and boards the Millennium Falcon with him. When Jones remarks that Solo's skeleton seems familiar, Shorty asks if they should continue looking for the supposed monster."}, {"tag": "h2", "text": "Conception"}, {"tag": "p", "text": "In 1999, Dark Horse Comics began publishing Star Wars Tales, a monthly series of comic books that featured several short Star Wars stories in each issue. Leland Chee, the keeper of the Holocron continuity database, declared that most Tales stories were S-canon, which rendered them non-canon unless referenced in a source other than Tales. Any completely outrageous or intentionally comic stories would be definitively non-canon, however."}, {"tag": "p", "text": "With the freedom to tell apocryphal stories, staff at Dark Horse began tossing around the idea of telling a story that involved both Han Solo and Indiana Jones, both of whom were characters created by George Lucas and portrayed by Harrison Ford. Solo was a Star Wars character while Jones was not; the two had respectively been main characters in the Star Wars and Indiana Jones movie franchises in the 1970s and 1980s. Although Jones had previously made a cameo in the computer game Star Wars: Yoda Stories, he and Solo had never been involved in a crossover together. Eventually, Dark Horse contracted author W. Haden Blackman to write a story featuring both characters."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "While conceiving the story's plot, Blackman recalled stories from the set of the 1983 film Star Wars: Episode VI Return of the Jedi. The stories claimed that Peter Mayhew, the actor who played Chewbacca, was required to be accompanied by crewmembers who wore brightly-colored vests while in the Californian forests of the Pacific Northwest, filming scenes set on Endor, so as not to be mistaken for Bigfoot and shot. Working from there, Blackman crafted a story that involved Solo and Chewbacca landing on Earth in the Pacific Northwest, Solo dying, and Chewbacca being mistaken for Bigfoot while roaming the forests in the proceeding years. Taking the long life spans of Wookiees into account, he decided to have Indiana Jones discover Solo's remains over 100 years later."}, {"tag": "p", "text": "Blackman included several explicit references to both the Star Wars and Indiana Jones films in the story in an effort to appeal to fans of both franchises—for example, Solo compares Earth to Endor, referencing the fact that Return of the Jedi's Endor scenes were filmed in the Pacific Northwest (Chewbacca is also called \"Sasquatch\" in the comic by the local Native Americans). Solo utters the line \"I have a bad feeling about this place,\" a variation on a line spoken in every Star Wars film, and, just before dying, tells Chewbacca \"I'm going first into the great unknown,\" echoing a line spoken by Jones's friend Wu Han in the film Indiana Jones and the Temple of Doom. The story's title, \"Into the Great Unknown\", also comes from Wu Han's line, and is written on the first page of the comic in the style of the Indiana Jones franchise logo. Indiana Jones is accompanied to the Pacific Northwest by Short Round, his sidekick from Temple of Doom, although only the nicknames \"Dr. Jones\" and \"Shorty\" are used in the comic. Additionally, as both Solo and Jones were played by Harrison Ford, Jones calls Solo's skeletal remains \"familiar.\""}, {"tag": "p", "text": "In 2008, Blackman called \"Into the Great Unknown\" one of the most fun Star Wars stories that he had ever written. After he penned it, the comic was penciled and inked by Sean Gordon Murphy, lettered by Steve Dutro, colored by Dan Jackson, and included as a ten-page story in the nineteenth issue of Tales, which was published on May 14, 2004. Ten days prior to its release, \"Into the Great Unknown\" was previewed on Indianajones.com. Tales 19 was later collected in the 2005 trade paperback Star Wars Tales Volume 5, and 2008 saw \"Into the Great Unknown\" re-published in the comic Star Wars Fan Club Special 2008."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Although Blackman conceived of \"Into the Great Unknown\" as taking place in Earth's Pacific Northwest, the planet in the story is never identified as Earth. Its star system, however, is mentioned as being \"no longer far away,\" a play on the events of Star Wars taking place \"A long time ago in a galaxy far, far away…\" Similarly, Indiana Jones and Short Round are never explicitly identified, only being referred to as \"Dr. Jones\" and \"Shorty,\" respectively. Blackman confirmed in an interview with Vanity Fair's Frank DiGiacomo that the character was indeed Indiana Jones, and DiGiacomo has posited that the planet is in fact Earth, \"Shorty\" Short Round, and the local Humans Native Americans."}, {"tag": "p", "text": "In the story, when Solo is dying after being riddled with arrows by the Native Americans, he says to Chewbacca that he always though that it was Chewbacca the one who was going to be die while saving him or his children, referencing Chewbacca's heroic albeit controversial death while saving Anakin Solo in R. A. Salvatore's novel The New Jedi Order: Vector Prime."}, {"tag": "p", "text": "\"Into the Great Unknown\" does not indicate when its story takes place, although Solo does mention his children, the first two of whom were born in 9 ABY; while Indiana Jones' mention of Atlantis would indicate that the story takes place during or after 1939. Blackman eventually clarified that the story doesn't have any exact date because it wasn't canonical, though he sets the story seven or eight years after Indiana Jones and the Temple of Doom, setting the story around 1942 or 1943, which in turn would set the date in which Han and Chewie crashed the Falcon at the Earth around 1816 or 1817."}, {"tag": "p", "text": "Although the story is non-canon, the moon Hovan 99 and its system were later canonized in The Essential Atlas Online Companion, which placed them in the Senex sector. Earth and the \"Earth system\" were mentioned in the 2011 Disney Theme Park ride Star Tours: The Adventures Continue and its promotional materials, and Solo and Jones both appeared in the 2011 non-canon video game LEGO Star Wars III: The Clone Wars."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "Due to its merging of the Star Wars and Indiana Jones franchises, \"Into the Great Unknown\" has received significant attention on several websites. Frank DiGiacomo of Vanity Fair wrote an article on the story in the website's \"Culture\" section, and contacted W. Haden Blackman to find out more about the story's development. Comicgasm.com also spotlighted the comic in 2009, and Cyriaque Lamar of the blog io9 wrote an article on the comic in May 2011 that highlighted what he saw as the depressing nature of its story. Although \"Into the Great Unknown\" is the first officially-licensed work to include both Solo and Jones, two creations of George Lucas, Blackman is unsure whether Lucas is aware of the story's existence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Further reading"}, {"tag": "p", "text": ""}]}