{"url": "Invasion_of_Begeren", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Battles in the Sith Worlds", "Category:Battles of the Great Galactic War", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Invasion of Begeren"}, {"tag": "p", "text": "The Invasion of Begeren was a major engagement between the Galactic Republic and the Sith Empire during the Great Galactic War. Begeren, a mineral-rich world in the Outer Rim Territories, had historically belonged to the ancient Sith Empire, but after the Great Hyperspace War of 5000 BBY, the Republic claimed the planet as its own and installed a governor to oversee mining operations. In 3681 BBY, the revitalized Sith Empire emerged from hiding and initiated the Great Galactic War to reclaim their lost lands and destroy the Republic. Although the war swiftly spread across the galaxy, the Sith's first targets lay in the Outer Rim, and in 3678 BBY the Empire launched its massive invasion of Begeren in the hopes of securing the planet and ousting the entrenched Republic regime."}, {"tag": "p", "text": "The Imperial Army contingent that was landed on the world consisted of 10,000 Imperial soldiers under the command of a military officer and aided by the aspiring Sith assassin, Teneb Kel. The fiercest fighting occurred just outside the Republic Governor's palace in the planetary capital, and saw the Empire's Aurek Battalion engage Republic soldiers, towering war droids, and crippling laser turrets. The Imperial Army forces were waiting on word from Kel that he had successfully infiltrated the palace and assassinated the Governor, and although Aurek Battalion was devastated by bombing runs from Republic Liberator-class starfighters, Kel continued on with his mission and successfully killed the Advozse Governor of Begeren. The conflict was one of many Imperial successes early in the war, and helped to put Teneb Kel on the path to Lordship. Begeren remained in Imperial control for many decades following the conquest."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the reign of the ancient Sith Empire, the area of space surrounding the capital of Korriban was all part of the Sith dominion. The planets within the Stygian Caldera—later known as the Sith Worlds—formed the core of the Empire, with the worlds of the Esstran sector at its heart. Begeren, a mineral-rich terrestrial planet in the Esstran sector near Korriban, belonged to the Empire and, much like the capital, was developed into a monument world meant to honor icons of Sith culture and history. On the cliffs of Begeren, Imperial masters directed their slaves of the Grotthu class to construct massive statues of Sith Warriors, alchemists, and the great philosophical minds of the Sith religion. Over the course of the building projects, 100,000 slaves lost their lives, but the Begeren monuments stood as a testament to the Sith masters."}, {"tag": "p", "text": "After the end of the Great Hyperspace War in 5000 BBY, the Sith Empire was shattered and the Galactic Republic was victorious. At the direction of Supreme Chancellor Pultimo, the Republic Military undertook a counterinvasion of the Sith Empire that subsequently engulfed the Sith Worlds of the Stygian Caldera and outlying Sith colonies further afield. On Begeren, the Sith inhabitants were forced out by Republic occupiers who claimed the world as their own before proceeding to tear down the great monuments. The Republic installed a governor to oversee the planet and a new mining industry based around selling gemstones found within the Sith statues."}, {"tag": "p", "text": "Despite the Republic victory over the Empire, a group of Sith led by the mysterious Lord Vitiate were able to escape into the Unknown Regions and rebuild their society. In 3681 BBY, this revitalized Sith Empire emerged from hiding and initiated the Great Galactic War to reclaim their ancestral worlds and exact revenge on the Republic that had defeated them a millennium prior. After retaking Korriban and much of the Outer Rim Territories early in the conflict, the Empire set its sights on Begeren and prepared to invade the planet in 3678 BBY. The invasion was to be led by the Imperial Military and aided by the disgraced Sith apprentice and aspiring assassin Teneb Kel, who had been granted a brief reprieve by the Empire's ruling Dark Council from a punishment inflicted on account of transgressions committed by Kel's Master Calypho."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "The Empire landed on Begeren with an army consisting of 10,000 Imperial soldiers, plunging the planet into violent warfare. Losses were heavy for both the Imperials and the Republic during the Invasion of Begeren, but the Empire managed to march onward toward the capital city of Begeren, where the planet's Advozse Governor made his home. The army's siege of the city was led by Aurek Battalion, and was initially successful; however, the Empire was forced to engage in extended trench warfare outside of the Governor's palace. Led by an Imperial commander, Aurek Battalion was pinned down in the trenches by the Republic Army's soldiers, massive defense droids, and heavy laser turrets."}, {"tag": "p", "text": "Despite taking heavy losses, the Imperial forces remained stationary, as their Commander had agreed to hold position until he received word from Teneb Kel that he had successfully infiltrated the palace and killed the Governor. Kel did indeed manage to breach the palace's security cordon, but the Governor fled from the assassin to find safety in his blast shelter. While the army waited for the signal from the young Sith, the Republic employed cacophanizer shells to immobilize their opponents. That, combined with the laser turret barrage, resulted in the loss of Aurek Battalion's Squad Three, Squad Eight, and Squad Fifteen. Although Squad Seventeen survived the assault, the cacophanizer shells made it impossible for the soldiers to move even a meter without using sonic dampers. Teneb Kel's slave, the Abyssin known as Maggot, had accompanied his master to Begeren, but remained with Aurek Battalion to act as a warrior and as a liaison between the Imperial Commander and the Sith. The Commander, increasingly frustrated by the lack of contact from Kel, demanded that Maggot answer for his master's apparent failure. While the two argued, Republic Liberator-class starfighters soared over the battlefield to deliver a payload of bombs. The explosives detonated in the center of the Imperial line, decimating Aurek Battalion and killing the Commander."}, {"tag": "p", "text": "Having reached the uppermost floors of the Governor's palace via grappling hook, Teneb Kel witnessed the bombing runs, but continued with his mission regardless. He caught up with the Governor and his escort of two Republic soldiers as they raced toward the blast shelter, but the Advozse's protectors were able to push their charge into the bunker before Kel could complete his task. Angered by the Republic's decimation of Begeren's Sith heritage, Kel quickly slew the Governor's two guards through his expert use of the Force and his double-bladed lightsaber, crushing one man's windpipe and dispatching the second with a toss of his weapon. The assassin the proceeded to cut through the shelter door and execute the unarmed Governor. With his mission complete, Kel contacted Imperial High Command to inform them that the palace had been secured."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the Governor dead and the capital city fallen, Teneb Kel searched the battlefield for survivors. He came upon the body of his slave, Maggot, and discovered that the hearty Abyssin had killed many of the enemy and survived the Republic bombing, despite the fact that all of the Human Imperials around him had perished. Kel helped Maggot out of the trenches and walked with his slave back to the Imperial command center. Once there, he decreed that the Imperial soldiers who participated in the battle would be permitted to celebrate their victory, provided they not attempt to profit from Begeren's natural wealth. Kel was met by an Imperial major who had arrived to convey news from the Imperial capital of Dromund Kaas."}, {"tag": "p", "text": "According to the Major, the Dark Council was pleased with Kel's work, but demanded that the young Sith return to the Sith Citadel in Kaas City to answer for the crimes of his disgraced former Master, the Sith Lord Calypho. On Dromund Kaas, grand celebrations were held in the city streets to recognize the recent string of Imperial successes in the war, including the victory on Begeren and Lord Nankrang's incursion into the Mid Rim. The battle also served as a career springboard for the Imperial soldier Bessiker, who continued on to serve with distinction at the Sacking of Coruscant and the long-running Battle of Balmorra. Begeren, now in Imperial control, was absorbed into the territory of the growing Sith dominion. Moff Harvus was placed in charge of the world, and slave pits were built to provide the Empire with a supply of laborers. Later in the Great War, an anti-Imperial terrorist cell was formed in the slave population, but fell apart when the son of two terrorists killed his parents and exposed the cell to Moff Harvus. Begeren remained in Imperial control until the Sith Lord Tytonus rebelled against the Emperor and the Dark Council by seceding from the Empire. She declared herself queen of a new Sith kingdom and took Begeren as her throne. In response, the Dark Council excommunicated Tytonus from the Sith Order and the Empire, leaving Begeren as her isolated prison, and her kingdom crumbled when she allied herself with the rogue Sith Lord Grathan and earned the Empire's wrath."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Invasion of Begeren was first seen as the introductory setting of Star Wars: The Old Republic, Blood of the Empire, the second story arc in The Old Republic comic series. The battle appeared in the first pages of Act 1: Shades of the Sith, published in 2010 as part of a webcomic series. Later that year, Blood of the Empire was released as a printed series, with the Invasion of Begeren making a repeat appearance in The Old Republic 4: Blood of the Empire, Part 1. With the release of the LucasArts/BioWare video game Star Wars: The Old Republic in 2011, the Invasion of Begeren was given several mentions in the in-game codex, as well as historical context with regards to the Begeren terrorist cell and Tytonus's revolution. The Invasion was again mentioned in several contexts in the 2012 sourcebook, Star Wars: The Old Republic Encyclopedia, which identified the battle's name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}