{"url": "Invasion_of_Belsavis", "categories": ["Category:Pages needing citation", "Category:TOR dates usages without act argument", "Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Articles to be expanded", "Category:Battles of the Galactic War"], "nodes": [{"tag": "h1", "text": "Invasion of Belsavis"}, {"tag": "p", "text": "The invasion of Belsavis, also known as the Belsavis prison break, was a battle that occurred during the Galactic War between the Galactic Republic and the Sith Empire around 3640 BBY after the Empire discovered the location of the Belsavis prison, a top-secret Republic penal colony on the planet Belsavis. A small strike team followed by orbital bombardment saw the Republic prison heavily damaged, and the Empire incited riots throughout the complex as they worked to free important prisoners such as the Sith Lords known as the Dread Masters. Unbeknownst to the Empire, the attack on Belsavis was a distraction to hide the efforts of Executor Krannus, who sought to destroy the entire world for the Sith Emperor but was stopped by the Jedi Knight known as the Hero of Tython."}, {"tag": "p", "text": "Chaos raged in the Minimum, High, and Maximum Security Sections of the prison colony, but as Imperial forces penetrated the Tomb—the ancient prison complex upon which the Republic facility was built—the battle changed. In their search for the Dread Masters and their efforts to sow chaos, Imperial forces broke open a number of sealed vaults, unleashing horrors that had been locked away by the Rakata who had built the Tomb. The violent Esh-kha species overwhelmed much of the Imperial forces in the Tomb, though the Dread Masters were successfully extracted and the Republic stopped the Esh-kha from releasing an entity known as the World Razer."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The conflict on the planet Belsavis centered around the Belsavis prison, a prison colony run by the Galactic Republic that was constructed atop an even older prison—the Tomb, built thousands of years before by the Infinite Empire of the Rakata species. The existence of the Tomb was discovered by the Republic around 3691 BBY, and upon discovering the horrors contained within the ancient Rakatan vaults, the Republic established their own prison atop the Tomb. During the Great Galactic War between the Republic and the Sith Empire, the population of Belsavis prison swelled with captured Sith Lords, Mandalorians, and criminals. Imperial Intelligence, the intelligence arm of the Sith Empire, spent years searching for the prison as rumors of its existence spread."}, {"tag": "p", "text": "The Empire first learned of the Belsavis prison's location around 3642 BBY, when the Rattataki inmate Ivory used a subspace transmitter, one that he had built over the last few decades using Rakata technology, to contact the Empire. IvoryAround a year after the Empire learned about the complex, during the Galactic War between the Empire and the Republic, the Sith Emperor dispatched his agents throughout the galaxy to commit genocide—the Emperor planned to use a Sith ritual to consume all life in the galaxy, and his ritual required a sacrifice on a planetary scale. The Emperor's servants influenced the Empire to attack Belsavis, thus providing a distraction for Executor Krannus and his death cult to carry out their plans to destroy the planet."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Initial strikes"}, {"tag": "p", "text": "The Empire's attack on Belsavis came as a complete surprise to the Republic, which were unaware of Ivory's message to the Empire and also believed that the facility was not a prime military target. The Empire began their invasion by landing a small team of Sith and elite soldiers onto the surface, and the strike force was tasked with freeing as many prisoners as possible to throw the prison into chaos. Some of the freed prisoners, a large number of whom were Imperial prisoners of war, joined the Imperial forces, while the remainder joined the riots and attacked everyone. As the Republic security forces struggled to respond, the Empire converted the remains of a camp used by early Republic explorers into a fortified lodgement in the prison's Minimum Security Section. and brought in a mobile battle platform, Proculus Station, into the planet's orbit. From their new ground base, Imperial forces made surgical strikes to breach cell blocks and destroy dividing walls; numerous barrier walls in the Minimum Security Section had massive holes torn in to them by explosives, and Imperial bombardment wreaked further havoc. The prison armories were also blown open by Imperial forces, allowing the rioters access to weaponry that put them on equal footing with the guards."}, {"tag": "p", "text": "The Republic withdrew many of the prison guards and their families to the complex's security and administrative centers; due to their focus on the prisoners and not the invaders, the Republic was unable to drive off the small number of Imperial forces before enemy reinforcements arrived. The Republic Military soon arrived to support the prison security forces, which were struggling to contain the prisoners under the leadership of Warden Playt, but it was some time before the Republic could mobilize significant forces to counter the Imperials. Many of the civilians were hidden in the Prisoner Intake yards, and after Officer Mark Vempor was able to acquire transport to evacuate the guards' families and the other civilians, Republic forces were able to clear a path for the civilians to reach the Perimeter Patrol Command Post."}, {"tag": "p", "text": "Meanwhile, the Empire began recruiting forces from the Belsavis prisoners, taking Imperial prisoners of war as well as violent criminals willing to serve. The Jedi Knight Enna Tabord arrived on Belsavis around the time of the invasion; she had been tasked with scouting the area and locating Executor Krannus in advance of the arrival of the Hero of Tython, a powerful Jedi Knight who was rushing to Belsavis to stop Krannus's plans. However, she was overpowered and fatally injured while out scouting, and barely managed to reach a guardpost and inform the criminal-turned-guard Pak Taldine about spotting Krannus's forces near the Minimum Security power generators. Early in the invasion, Captain Rago's attempts to retrieve the Belsavis prison records from the Detainee Processing Center was foiled when the New Men, a cult of cybernetic criminals, took control of the facility. When Imperial reinforcements finally pushed through the New Men and a small group of Republic soldiers who sought to stop the Imperials from accessing the records, the Empire was able to download the prison records and locate persons of interest throughout the complex."}, {"tag": "p", "text": "The primary objective of the Imperial forces, under the leadership of Commander Calum of the Imperial Guard, was to free the Dread Masters—six powerful Sith Lords who were captured during the last war. Five Special Operations Groups were deployed to penetrate deeper into the prison; Special Operations Group Five, under the command of Lord Medechas, was tasked with securing the Minimum Security Section. However, Republic forces anticipated the Empire's target and relocated the Dread Masters to the Tomb. When Imperial forces breached the High Security Section to the west, Special Operations Group Four established an Imperial Command Post in the ruins of a damaged Republic watchtower, and the three other groups continued onward into the Maximum Security Section. However, when the Imperial forces reached the Ancient Prison Caverns—the first level of the Rakatan prison—beyond Maximum Security, their efforts to breach the Rakatan vaults had dire consequences. While Groups One and Two moved onward to locate the Dread Masters in the Tomb, Group Three cracked open a number of vaults and released the Esh-kha, a violent species of warriors that had been entombed within Belsavis by the Rakata. The Esh-kha overran the Imperial forces and spilled out into both Maximum Security and the Tomb, and Colonel Grang withdrew the remains of Group Three to the Imperial frontline camp in Maximum Security."}, {"tag": "h3", "text": "Riots and chaos"}, {"tag": "p", "text": "During this time, the Imperial agent Feldon made contact with Nyranos, the Kaleesh leader of the prisoners known as the Condemned. The Condemned were the Belsavis-born descendants of earlier prisoners, but Warden Playt had refused to allow them to leave Belsavis despite never being sentenced there. Under Feldon's direction, the Condemned attacked the Prison Command Center and killed Warden Playt, though his assistant Graal survived and became the new warden. Republic forces were able to restore the generators powering the command center's shields, and when the Condemned raided a nearby armory for shield-disrupting magnetar rifles, military and security forces eliminated the Condemned there before they could attack the command center again. A pre-emptory strike against the Condemned stopped the criminals' plans to use a neural disruptor against prison guards, but the Condemned overran the command center with Imperial aid."}, {"tag": "p", "text": "However, Nyranos ended his agreement with Feldon upon taking the command center, as he only wished to negotiate with Warden Graal; an angered Feldon and several Condemned traitors turned against Nyranos but were killed. Despite Graal's anger about Playt's death, Nyranos's requests of farmlands and supplies for his people were met by the Republic, and the Condemned withdrew from the command center."}, {"tag": "p", "text": "Elsewhere in the Minimum Security, the efforts of Marshal Ellis Ruger, an offworld enforcer brought in by Warden Playt, began to regain a semblance of control in areas of the Minimum Security Section. As a result, Lord Medechas's forces attacked and destroyed many of Ruger's warden droids in order to rally the rioters' enthusiasm. Medechas's forces also overran the Carbonite Prisoner Storage, killing the Crisis Response Unit guarding it and releasing numerous psychotic prisoners to fuel the riot. Ruger was protected by force fields in Republic Guardpost Delta, but the Empire recovered the key to Ruger's guard station from Gholan, the Devaronian prisoner who had stolen the key from Ruger. After the force fields were deactivated, Imperial forces overran the guardpost and killed Ruger."}, {"tag": "p", "text": "When Master Sergeant Korum's forces breached Vault K-66, a Rakatan vault in Minimum Security, they released ancient Rakatan war droids that resisted Imperial attempts to control them; Korum lost thirty men trying to take control of the droids with computer spikes before Imperial forces were successful. One of the prisoners released by the Empire was the Sith Lord Ferrid, who had been captured during the previous war. He recruited Imperial forces to raid Republic Guardpost Alpha, as he suspected they were hiding something valuable; the raid yielded information on the prison schematics and hidden inmates."}, {"tag": "p", "text": "A group of Mandalorian escapees raided the Republic supply depot in Minimum Security and made off with a large number of supplies, including the motivator coils that Officer Brad Narong needed to fix a host of damaged warden droids. Fortunately for Narong, he was able to recruit Republic reinforcements that attacked the Mandalorian camps in the Mercenary Containment Cells, destroying the turrets that used the stolen motivator coils. Amid the chaos, Agent Firehawk of the Republic Strategic Information Service, the Republic's intelligence agency, enlisted military aid in locating Agent Mynock, Firehawk's informant among the prisoners. Though Mynock was dead by the time that the Republic forces found him in the caves along the western cliffs of Minimum Security, Mynock's findings on Imperial traitors among the guards were retrieved from his body."}, {"tag": "p", "text": "As the fighting spread to the High Security Section, the battle became a veritable free-for-all—the High Security Section was populated by violent members of alien species, and was the site of the illegal Domination Experiments. Pioneered by Senator Tudos, designed by a number of Republic scientists who were unaware of the tests' purposes, and led by Doctor Neeya, the experiments—codenamed \"Project Noble Focus\"—saw the alien inhabitants of High Security pitted against each other in order to analyze the military capabilities of the species in monitored combat scenarios. The aliens who participated were freed by Operations Group Four during the Imperial invasion, and quickly took controls of swaths of territory in High Security, attacking both the Empire and Republic and wiping out most of Operations Group Four."}, {"tag": "p", "text": "Captain Vandorn ordered Imperial reinforcements to strike back at the gangs; however, the Trandoshan prisoners refused to back down after the initial attacks, leading the Empire to invade the vault that they had overtaken. When the Trandoshan leader Ssevrek was defeated and collared by the Imperials, the rest of the Trandoshans fell into line."}, {"tag": "p", "text": "Republic forces under the command of Colonel Hauer at the Republic watchtower found themselves under attack by Rattataki prisoners, who stole power cores from warden droids and tried to use them to build bombs and blast their way out of their holding cells. Republic forces put a stop to the Rattataki's efforts, but Senator Tudos's involvement in the Domination Experiments was exposed by a Weequay prisoner named Nah Vee. Under the leadership of a criminal named Sulkhaz, the Blood of Talath Rattataki tribe attacked the nearby detention compound that held Neimoidian prisoners, though Republic forces drove back the Blood of Talath and rescued the Neimoidians. His role in the Domination Experiments revealed, Senator Tudos was arrested."}, {"tag": "p", "text": "The Empire managed to seize control of the Power Generation Center in the northern High Security Section, wiping out Major Camren's unit in the process. Furious at the death of his men, Camren came up with a plan to destroy the center's power relays with detonite charges, robbing the Empire of their prize. During the fighting against the Rattataki, the aliens were able to capture a number of guard towers without communicating amongst themselves; however, Officer Serik used the protocol droid C-5D1 to determine that the Rattataki were using bird calls, allowing the Republic to regain the advantage."}, {"tag": "h3", "text": "Horrors of the deep"}, {"tag": "h3", "text": "The Eternity Vault"}, {"tag": "h3", "text": "Section X"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}