{"url": "Invasion_of_Bakura", "categories": ["Category:Legends articles", "Category:Battles of Bakura", "Category:Battles of the Galactic Civil War", "Category:Battles of the Ssi-ruuvi invasion", "Category:Rogue Squadron battles"], "nodes": [{"tag": "h1", "text": "Invasion of Bakura"}, {"tag": "p", "text": "The invasion of Bakura was the attempt by the Ssi-ruuvi Imperium to invade the remote Imperial planet Bakura in 4 ABY. The battle took place during and days after the Battle of Endor. Only the timely arrival of Alliance to Restore the Republic forces led by Commander Luke Skywalker and the Alliance Escort Carrier Flurry and its unlikely alliance with Imperial forces stationed at Bakura temporarily drove the Ssi-ruuk to fringes of the Bakura system, thus saving Bakura for the time being."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "For millennia, the saurian Ssi-ruuk had ruled an isolated interstellar empire in the distant reaches of the Unknown Regions. Their technology relied on entechment—whereby the souls of a sentient being were drained into a mechanical conduit. However by 1 BBY, resources were becoming scarce in their isolated region of space."}, {"tag": "p", "text": "In 1 BBY, the Ssi-ruuvi's supreme ruler—the Shreeftut—received visions through the Force of a hooded Human who revealed himself to be Emperor Palpatine, ruler of the galaxy. He offered the Ssi-ruuvi dozens of worlds and millions of Humans to entech, in exchange for the use of Ssi-ruuvi technology. The shreeftut agreed. In response, they decided to venture into Wild Space where they conquered the small Human colony of G'rho; capturing numerous members of the populace for entechment."}, {"tag": "p", "text": "Among their captives was a human boy named Dev Sibwarra, whom the Elder Sh'tk'ith brainwashed through mind manipulation techniques. What astounded them was the boy possessed strange powers to sense others. From the boy, they learnt that humans had a longer containment time when enteched and could last longer than most other species."}, {"tag": "p", "text": "Over the next years the invaders attacked several other colonies and enteched the small populations. The Empire covered up these incidents, blaming Rebels or citing them as various disasters. The Ssi-ruuvi armada was en route towards another small colony world when Sibwarra felt the death of the Emperor during the Battle of Endor. Now that the pact that Palpatine had once forged was no longer in effect, the Ssi-ruuk set course for Bakura, a heavily industrialized and populated world in the Shiritoku Spur."}, {"tag": "p", "text": "The fleet was only a small advance group of the real Ssi-ruuvi fleet, and was running low on resources. A victory was necessary for the future invasion to happen. While the battleships engaged the Imperial forces, the planetary attack carrier and the construction ship stayed behind near Arden."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "Six-day siege"}, {"tag": "p", "text": "The Imperial fleet at Bakura was taken completely by surprise. Since the only threats so far had been pirates, a full-scale invasion was too much for the outdated fleet. Commander Pter Thanas still obeyed his orders and defended the planet while governor Wilek Nereus requested reinforcements."}, {"tag": "p", "text": "HoloNet requests to Coruscant and to the Second Death Star were left unanswered, so Nereus decided to use a different method: He launched an antiquated messenger drone to Endor, knowing that the Emperor had been there to visit the Death Star, but still unaware that Palpatine was already dead."}, {"tag": "p", "text": "In the meantime, Bakura's defense force was slaughtered: TIE/LN starfighters were almost always destroyed while the capital ships were first disabled, then captured and the crews enteched. All system-wide colonies and outposts, including the one on Bakura-6 were destroyed. Recovery teams found no bodies or survivors, but most of them were captured, too. Only a few returned to Bakura. Governor Nereus - an expert on non-human parasites - tried to wipe out the Ssi-ruuk by infecting his men. However, the bodies of enteched prisoners were disposed too fast for this tactic to have any effect."}, {"tag": "p", "text": "When the Rebels would finally arrive, only the Dominant, two gunships and a few damaged patrol boats and TIEs were left. The populace had been prepared to leave the cities and hide in the mountains as the Ssi-ruuk launched their final attack."}, {"tag": "p", "text": "To fulfill the demands of entechment, all bodies, including those wounded or captured alive, were taken back onboard to the entechment labs onboard the Ssi-ruuvi capital ships. This practice baffled the local Bakuran and Imperial recovery crew. Due to his ability to communicate with the predominantly human prisoners in their native language, Dev was pressed into service at the entechment rig on deck 16 throughout the night shift."}, {"tag": "p", "text": "Accompanied by Master Firwirrung, Dev played an active role in \"calming\" the entechment subjects while Firwirrung carried out the mechanical process of \"transferring\" life sources. These life sources would be used to power battle droids. Among those enteched was a wounded male Imperial officer who attempted to persuade Dev to not carry out the procedure. Brainwashed into believing in the benefits of entechment, he merely brushed aside the man's pleadings. Later, a female prisoner was killed during an escape attempt. Thoroughly indoctrinated, Dev merely sighed at the loss."}, {"tag": "p", "text": "In an attempt to persuade the Bakurans to capitulate, the Ssi-ruuk transmitted a holo-recording from Dev Sibwarra, who told them of the fate they would soon experience—that of entechment—and although Sibwarra described it as an eternal release, the Bakurans knew that was a lie."}, {"tag": "h3", "text": "Rebel Intervention"}, {"tag": "p", "text": "The messenger drone arrived at Endor while the Alliance was reestablishing their sensor perimeter, literally the day after the Battle of Endor. Despite the fact that the message came from a relatively unimportant world, it opened a great opportunity for the Rebels; Bakura had only been occupied for a few years, so the people could still remember their independence. Bakura also had a large repulsorlift industry, and the Imperial garrison only had outdated equipment available. The Alliance also saw an opportunity to prove to the citizens of the galaxy that the Rebels were not the brutal terrorists as portrayed by Imperial propaganda. With the Imperial fleet in disarray after Endor, Bakura could only expect reinforcements in a matter of weeks - too late for the remote planet."}, {"tag": "p", "text": "A small carrier group was assembled, consisting of the Flurry, an Alliance Escort Carrier fresh from the Virgillian Civil War equipped with the experimental Battle Analysis Computer, five Corellian Gunships, a Corellian Corvette, 20 X-wings, three A-wings, four B-wings, and the Millennium Falcon. Princess Leia Organa was chosen as diplomat and Commander Skywalker, despite his injuries, as military commander. Early the next day, the small fleet left for Bakura with the mission to defeat the unknown attacker and bring Bakura over to the Alliance."}, {"tag": "p", "text": "Despite Captain Manchisco's impatience, the task force first dropped out of hyperspace outside the system to scan the area. After contacting the Imperial commander, Commander Pter Thanas, Skywalker decided to intervene, but sent the Falcon to wait at Bakura-6, since the security of the only diplomat had a higher priority."}, {"tag": "p", "text": "Skywalker microjumped to Bakura at the same time that the Ssi-ruuk attempted their final push towards the planet. Starfighter groups Rogue and Gold attacked a lone Wurrif-class light cruiser while Red Group split up: One through Four secured an escape corridor for the advancing squadrons while the rest protected the Flurry. While the Alliance fighters tried to lure the enemy away from the planet, Skywalker reached out with the Force and sensed two presences being extinguished aboard the Ssi-ruuvi droid fighters by Wedge Antilles. This startled the Jedi Knight and he opened himself to the Force once more: when Gold Leader eliminated several fighters at once, Skywalker felt human force signatures."}, {"tag": "p", "text": "Only moments afterward, the BAC marked the Ssi-ruuvi cruiser as vulnerable and Skywalker had to divert his attention back to the battlefield; he ordered Rogue Squadron to engage, only to have them abort as the cruiser launched a new wave of fighters. In the meantime, Imperial Commander Pter Thanas had made good use of the reprieve and organized his ships into a counter-offensive formation."}, {"tag": "p", "text": "Suddenly Skywalker felt danger in the force and he saw an enemy picket ship approaching Rogue Squadron as they made another attack run on the cruiser. Skywalker tried to warn Antilles and sent the remaining fighters of Red Group into battle, but due to heavy Ssi-ruuvi jamming, the orders were garbled. Rogue Squadron still managed to evade, but two X-wings flew right into the cannons of the picket ship and were destroyed. With the Flurry lacking a starfighter screen, the Ssi-ruuk sent masses of their droid starfighters against the Alliance cruiser."}, {"tag": "p", "text": "Leaving the defense of the ship to Captain Manchisco, Luke Skywalker once again opened himself to the Force. He gained an insight how the droid fighters operated and felt the constant agony of the enslaved souls. He found one specific fighter and planted the suggestion in it that it was better to die than to live in enslavement. The enteched soul understood and rammed itself into another one, a maneuver that allowed Antilles to escape."}, {"tag": "p", "text": "Only moments later the Flurry losts its shields. Skywalker recalled all starfighters, but last-minute help came from another side: After escaping a few remaining battle droids near Bakura-6, General Solo had decided to join the main fleet and jumped to Bakura. The Falcon emerged from hyperspace near the Flurry and destroyed several fighters and a picket ship."}, {"tag": "p", "text": "After the Falcon's intervention, the battle began to slow down. Red Squadron, under guidance from Skywalker and the BAC, managed to finally destroy the cruiser. Meanwhile, Sibwarra sensed the arrival of a powerful Force-strong Jedi among the new arrivals—later revealed to be Skywalker. However, he refrained from telling his superior Bluescale since it meant confessing a guilty \"secret habit\". With these unexpected losses, the Ssi-ruuk retreated to the edge of the system."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Ssi-ruuk had completely underestimated the Rebel forces and were forced to make an emergency jump into hyperspace, the first time since Cattamascar. They sustained considerable losses including a cruiser and several drone fighters from attacks by the Alliance ships. Additionally they had lost almost all superior human-enteched starfighters and without new prisoners were unable to power up, or even build new ones. This unexpected change forced the Ssi-ruuvi leadership to analyze the newcomers' different tactics, starships and command style."}, {"tag": "p", "text": "Having helped beat off the Ssi-ruuvi attack on the system, the Alliance ships were holding position near the planet. The few remaining Imperial patrol craft and half of the TIEs required extensive repairs at the Orbital Station, but were later integrated into the combined defense grid. Following the Ssi-ruuvi withdrawal, Leia Organa contacted the planetary government and was able to arrange a meeting between the Rebel Alliance delegation and Governor Nereus, as well as the Bakuran Senate."}, {"tag": "p", "text": "With the retreat of the enemy, an uneasy truce between the Empire at Bakura and the Rebellion was forged. The political situation on Bakura however proved to be unstable and Governor Nereus used the situation for his advantadge. He infected Skywalker with parasites and handed him over to the Ssi-ruuk, again hoping to wipe them out. This resulted in a second Invasion only two days later."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Second Battle of Bakura first appeared in the novel The Truce at Bakura. The battle was conceived and written as an element within a step-stair plot structure by the author Kathy Tyers. Tyers used this battle as a device to introduce the nature of the Ssi-ruuvi threat along with two other important Expanded Universe players in the story plot—the Imperial commander Pter Thanas and the Force-sensitive Human slave Dev Sibwarra."}, {"tag": "p", "text": "During an interview with Ilene Rosenberg for Star Wars Adventure Journal 4, Tyers said that her editor Janna Silverstein had asked her to have five concepts for the storyline. The one that Tyers liked the most involved an alien menace that would force the Rebel Alliance and the Empire to briefly work together."}, {"tag": "p", "text": "There is some discrepancy between The Truce at Bakura and The Truce at Bakura Sourcebook regarding the IR-3F Patrol Craft: The Sourcebook claims that two of the five were destroyed during the siege with Digit/Bakura II, III and V remaining, but the book mentions Digit/Bakura VI being destroyed in the final battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}