{"url": "Invasion_of_Fondor", "categories": ["Category:Legends articles", "Category:Battles of Fondor", "Category:Battles of the Galactic Civil War", "Category:Rebellions and uprisings"], "nodes": [{"tag": "h1", "text": "Invasion of Fondor"}, {"tag": "p", "text": "The Invasion of Fondor was a battle which began as a riot during the Galactic Civil War."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "While Darth Vader's forces based on Fondor were distracted fighting Rebel forces on Thyferra, the treacherous Moff Kalast had his Rebels take control of many cities on the Imperial factory world. The local citizens began to riot and assisted the Rebels in taking down the factories. Without the planet, construction on many key Imperial ships would be shut down."}, {"tag": "p", "text": "Darth Vader's force on Thyferra had won their battle and quickly found out about the disaster back on Fondor. He sent an imperial force that penetrated Fondor's defenses and landed in Fondor City. Routing the local Rebel Alliance troops and supporters, the retrieval force moved through the city."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Destroying civilian buildings claimed by the Alliance, the troops eventually captured an abandoned sensor array, where they were able to get intelligence and targeting information on the city."}, {"tag": "p", "text": "The main city plaza was raked with fire, where the Imperials bombed and destroyed factories captured by the Alliance. Most rebels were soon destroyed or scattered, leaving the stragglers to be executed."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the Fondor Uprising put down, Darth Vader could once again concentrate his efforts on getting Kalast. Vader eventually hired Boba Fett to venture to Ilum, where a pirate organization that supplied Kalast with weapons was found to be based."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This battle was the second mission of the Imperial campaign in the 2006 video game Star Wars: Empire at War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}