{"url": "Invasion_of_Dearic", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Battles in the Corellian sector", "Category:Battles of the Galactic Civil War", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Invasion of Dearic"}, {"tag": "p", "text": "The Invasion of Dearic was an invasion by the Alliance to Restore the Republic to retake the Talusian city of Dearic in the year 1 ABY, in an attempt to free the Talusian people from an Imperial presence in the region. The primary target for the Alliance was an Imperial General, who was vital to the Empire's efforts. They figured that taking him out would cripple Imperial operations in the area. The only way that such a move would be successful was to take the city by an invasion, as the Imperials possessed a sizable defense - an entire battalion of stormtroopers were stationed in the city."}, {"tag": "p", "text": "Once the Alliance had the signal to attack, they attacked from various sections of the city - primarily by the starport to the west, the hotel to the east, and the theater to the south. Unfortunately for the Rebels, Imperial spies had already stolen the plans for the assault and the Imperials erected several choke points where the Rebels were significantly halted in their advance. Heavy fighting erupted outside the starport and just beyond the hotel. Many on both sides were soon seen wounded, demoralized or both. Medics rushed in to aid the wounded, and certain troopers entertained and rallied the demoralized troopers. As the Imperial lines of defenses fell, the Imperial troopers were soon forced to fall back deeper with in the city, and soon the remaining squadron of Imperial troopers retreated to the General."}, {"tag": "p", "text": "The Imperials made one brilliant last stand -- they fought with all they had and kept the lines of defense together as best they could, but now they were too concentrated and cornered. While the Rebels had suffered heavy casualties, they still had an edge in numbers. The remaining Imperials were placed under a barrage of trooper and tank fire, and the defensive structures soon gave way. The Imperials eliminated many Alliance troops, but eventually the Imperial General had fallen. With the battle over, the Imperials attempted to retreat, which itself was a challenge. Many Imperials fell in the aftermath of the battle and their attempt to retreat, though a few had managed to survive the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}