{"url": "Invasion_of_Naboo/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Battles of the Invasion of Naboo", "Category:Battles of the Naboo Crisis", "Category:Blockades", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Outer Rim Territories", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Invasion of Naboo"}, {"tag": "p", "text": "The Invasion of Naboo, also known as the Battle of Naboo, Battle for Naboo, Subjugation of Naboo, or the Naboo Blockade, was a significant galactic conflict that occurred on the planet Naboo in 32 BBY, where the planet's capital city, Theed, and surrounding regions were invaded and occupied by the battle droid Army of the Trade Federation."}, {"tag": "p", "text": "The Trade Federation was controlled in secret by two Sith Lords in their plot to destroy the Jedi Order and rule the galaxy: Darth Plagueis, also known as Hego Damask of Damask Holdings and the InterGalactic Banking Clan; and his apprentice Darth Sidious, under the guise of popular Senator Palpatine of Naboo. After infiltrating the Galactic Republic, they would ensure the fall of Supreme Chancellor Finis Valorum and that Palpatine was elected in his place, with Hego Damask as Co-chancellor."}, {"tag": "p", "text": "Two Jedi, Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi, were sent as ambassadors to negotiate with the Trade Federation. But Darth Sidious ordered the Neimoidian leaders of the Trade Federation to destroy them and deploy all forces on Naboo. The Jedi escaped the flagship, though. Soon, the Jedi rescued and escaped with Queen Padmé Amidala, who was under pressure by the Federation to sign a treaty to legalize the invasion. Amidala hoped to have the Galactic Senate assist in outlawing the Trade Federation's activities on Naboo."}, {"tag": "p", "text": "The Naboo Royal Cruiser was damaged in the escape, forcing them to divert to Tatooine for three days. They met the slave Anakin Skywalker, who raced in the Boonta Eve Classic to win parts for the starship. With the Jedi and the queen on the run, Darth Sidious sent his personal assassin, Darth Maul, to track them down on Tatooine. In Maul's brief duel with Qui-Gon Jinn, in which the Jedi Master withdrew aboard Amidala's royal starship, the Sith had revealed themselves to the Jedi Order."}, {"tag": "p", "text": "Queen Amidala arrived on Coruscant to ask the Senate in Naboo's time of need. But Senator Palpatine, as discussed with Darth Plagueis in private, persuaded the queen to move for a Vote of No Confidence in the leadership of Supreme Chancellor Valorum. Thus, the Senate would select a new chancellor. Amidala then decided to return to Naboo to liberate her people from the Trade Federation's grasp. Upon her return, she met with Boss Rugor Nass of the Gungans, and they forged an alliance."}, {"tag": "p", "text": "The Gungan Grand Army was to act as a decoy while the queen and the Naboo Resistance forces stormed the Theed Royal Palace to capture Viceroy Nute Gunray. The decoy movement succeeded, and the Naboo forces were able to launch starfighters to attack and destroy the Droid Control Ship. Skywalker delivered the killing blow to the ship."}, {"tag": "p", "text": "The crisis ended with the capture of Viceroy Gunray. As a result, the Naboo and Gungan peoples became closer. On Coruscant, Senator Palpatine, shortly after betraying and murdering his Sith Master Plagueis, took the seat of Supreme Chancellor of the Galactic Senate and began rising tensions ultimately leading into the Clone Wars ten years later. The events of the Naboo Crisis are often depicted as a prelude to those of the Separatist Crisis."}, {"tag": "h2", "text": "Origins"}, {"tag": "h3", "text": "Naboo in the galactic community"}, {"tag": "p", "text": "The galaxy at large was first exposed to the planet Naboo in the backwater Chommell sector around 67 BBY, when Subtext Mining discovered rich veins of plasma. Members of Subtext Mining were hired by the King Bon Tapalo's opposition to conduct surveys. Sith Lord Darth Plagueis, in his guise of Hego Damask of Damask Holdings, visited the world to discuss mining rights. He visited with disgruntled members of the nobility, including Ars Veruna. Plagueis was able to negotiate with the Naboo to expand their spaceport facilities and build a processing facility on the Solleu River. Outer Rim Construction and Assembly was contracted to build the facility."}, {"tag": "p", "text": "As part of the deal, Plagueis agreed to finance Tapalo's election to the throne. Damask's support of Tapalo led to the Nubian's election as king and an opening of Naboo to interplanetary trade. King Tapalo and his chief advisors, led by Ars Veruna, succeeded in negotiating a contract with the Trade Federation to ship out the plasma from Naboo and sell it to other planets along the Hydian Way. The deal with the Trade Federation allowed a great period of economic prosperity to settle on the Mid Rim world but the Naboo quickly begun to grow dissatisfied with the result: while they sold their plasma to the Trade Federation for fixed prices, the latter could sell the plasma at inflated prices on the open market, reaping much larger profits than the Naboo. As a result, a great deal of resentment against the Trade Federation developed on Naboo, specifically amongst the Royals who had opposed Tapalo's election to the throne, led by Senator Vidar Kim. Secretly, Tapalo and his advisors had made a profit themselves for agreeing to the deal with the Trade Federation."}, {"tag": "p", "text": "Veruna, upon his election as King of Naboo after Tapalo's term had ended, became intent on forcing a confrontation with the Trade Federation over control of Naboo's plasma resources. As such, he created a corps of Nubian Design Collective starfighters. He also planned to have the Trade Federation's part in the transport of plasma from Naboo taken over by the Hutts, namely his ally, Gardulla Besadii, whose transports would move the plasma from Naboo to its client worlds, under the protection of Black Sun and the Bando Gora. The move was opposed by Naboo Senator Palpatine, who later split with Veruna and convinced the young Padmé Amidala, the popular Governor of Theed, to run against the king in the following election. Amidala's platform concentrated on a renegotiation of the original contract with the Trade Federation while Veruna planned a more militaristic approach. Eventually, Veruna was forced to abdicate and Amidala won the throne by a landslide."}, {"tag": "p", "text": "In secret, Plagueis and his apprentice, Darth Sidious—the Sith identity of Senator Palpatine—had manipulated events to cause a crisis between the Trade Federation and its client worlds. With Naboo seeking to renegotiate its contract with the Trade Federation, they had what they needed to throw the Republic into chaos. Just as they had secretly replaced Veruna by engineering Amidala's election, they placed their puppet, Trade Federation Viceroy Nute Gunray, as the overall leader of the conglomerate by having the Trade Federation Directorate killed during the Eriadu Trade Summit."}, {"tag": "h3", "text": "The growth of the Trade Federation"}, {"tag": "p", "text": "An ever-expanding trading alliance, the Trade Federation, headed by the Neimoidian Viceroy Nute Gunray, would purchase victories in the Galactic Senate with their immense resources. As an independent entity, they even had their own senator, Lott Dod, and went so far as to \"persuade\" the weapons inspectors of the Galactic Republic to ignore the arming of their onetime cargo craft. Secretly, the Federation had converted these shipment vessels into lethal battleships. The modifications were made ostensibly to defend against increasing pirate activity in the Outer Rim Territories. Following the buildup, the battleships and battle droids largely replaced the Trade Defense Force and its marine forces."}, {"tag": "p", "text": "Gunray was granted a permanent seat on the Trade Federation Directorate following the acquisition of exclusive shipping rights of lommite ore from the planet Dorvalla in 33 BBY."}, {"tag": "p", "text": "An invasion force of deadly battle droid soldiers was built in addition to the increasing number of the Federation's disguised warships by Baktoid Armor Workshop and Haor Chall Engineering on schedule but at the cost of an exorbitant amount of credits. They were part of a plot quietly masterminded by Darth Sidious as part of his scheme to establish himself, beneath his public persona of Senator Palpatine, as Supreme Chancellor. Sidious had approached the Federation's Viceroy Nute Gunray and suggested a test for the new army. Gunray suggested Eriadu, but Sidious countered by suggesting the home of Senator Palpatine, a world which would not respond with force."}, {"tag": "p", "text": "Later, Sidious contacted them and ordered a fleet assembled."}, {"tag": "p", "text": "Deputy Viceroy Hath Monchar left the flagship Saak'ak in a scoutship and took a Sith holocron with information about the impending blockade. Sidious' apprentice, Darth Maul, was tasked with recovering the holocron, which he eventually took from the Coruscant information broker Lorn Pavan. During the hunt for the holocron, Maul engaged and killed the Jedi Anoon Bondara and his Padawan Darsha Assant, ensuring the secrecy of the return of the Sith. Kenobi investigated their deaths and suspected Black Sun involvement. When Kenobi returned to the Jedi Temple, he discovered that he and his master had been assigned as ambassadors to the blockade."}, {"tag": "h3", "text": "The taxation of trade routes"}, {"tag": "p", "text": "By 33 BBY, the Federation's opponents in the Galactic Senate were pressing Valorum to slow the trade organization. The Supreme Chancellor responded by calling for the disbandment of the Free Trade Zones, albeit granting additional defensive allowances. Following the Eriadu incident, the Republic soon passed legislation calling for the taxation of trade routes to outlying star systems. The reason for this was two-fold; it would serve to weaken the growing Federation, and would recoup funds for the ailing Republic. Unfortunately for the Republic, the Trade Federation felt offended, and was determined to strike back. The Federation also pursued alliances with the InterGalactic Banking Clan, Corporate Alliance, and Techno Union, groups which were also affected by increased taxation."}, {"tag": "p", "text": "Jedi Council member Adi Gallia monitored the actions of the Trade Federation following the Summit, and it was her who alerted the Jedi Council to suspicious activities in the Naboo system."}, {"tag": "h3", "text": "The Blockade of Naboo"}, {"tag": "p", "text": "Five months after the death of the Directorate members, and after procuring the necessary resources on a number of planets, including Esseles, Eos, and Alaris Prime, the Trade Federation blockaded the Mid Rim world. The invasion fleet gathered at Enarc."}, {"tag": "p", "text": "Right after the Blockade commenced, Gunray stated that it was a protest of the new shipping-lane taxes, and threatened that any attempts to break the embargo would be met with deadly force, and was prepared to see Naboo starve unless the regulations were removed. Amidala then contacted Supreme Chancellor Valorum and informed him that the Trade Federation battleships encircled Naboo. Senator Palpatine was there in the office at the time, and told the queen that he could contact the Trade Federation delegates and demand the termination of the blockade. In response, Amidala requested formal Republic intervention. Valorum promised to convene a special Senate session. Once the message ended, Valorum advised Senator Palpatine to prepare to be thrust into the spotlight."}, {"tag": "p", "text": "As the blockade started, head of the Security Forces Captain Quarsh Panaka took the precaution of arming their Flash speeders in the event they would need to cover the queen's escape. He also assigned the Security Forces to patrol Theed and maintain order. Soon after, the blockade failed to have an immediate effect in the Galactic Core. Palpatine made several futile attempts to meet with the Trade Federation's Senator, Lott Dod. At one point in the blockade, the Federation tried to kidnap Queen Amidala, but the attempt failed."}, {"tag": "p", "text": "One month into the blockade, supplies were scarce, leaving the Naboo people with an eerie quiet in the streets and a sense of panic. Amidala's Council of Governors advised her to wait while Palpatine tried to find support in the Galactic Senate. Amidala contacted the Supreme Chancellor and told him she was holding him responsible for the blockade, that he was taking bread out of the mouths of Naboo's children. Her words visibly shocked him, but they were successful in convincing him to send aid. To stabilize his support base, Valorum used his friendship with Jedi Master Adi Gallia to appeal directly to the Jedi Council to ask for mediators; by not informing the Senate, his actions broke protocol. Master Windu secretly dispatched two Jedi, Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, to meet with the Federation Viceroy and ensure the Federation's withdrawal from the system."}, {"tag": "h2", "text": "The conflict"}, {"tag": "h3", "text": "Negotiations"}, {"tag": "p", "text": "The two Jedi were scheduled to meet with Viceroy Gunray immediately after arriving at Naboo in the starship Radiant VII. However, TC-14, the hostess protocol droid which they encountered first, promptly informed Gunray, his lieutenant, Settlement Officer Rune Haako, and invasion force Captain Daultay Dofine, that the ambassadors from Coruscant were Jedi Knights. Terrified at the prospect of facing Jedi, and Dofine having realized beforehand that the Jedi had most likely been sent to force a settlement regarding the dispute, Gunray contacted Sidious and presented the situation, also sending TC-14 to distract them due to Dofine being unwilling to face them. Jinn also noticed that there was an unusual amount of fear among the Neimoidians, especially for what was apparently as minor as a trade dispute. Sidious, realizing Valorum's role in bringing the Jedi to the ship, ordered Gunray to kill the Jedi at once and begin landing his troops on Naboo for an invasion, and when Gunray questioned the invasion's legality, Sidious replied that he would make it legal. Sidious also told Gunray to make sure that any future contacts to him exclude Dofine from participation after the latter implied they should call off the plan due to fear of the Jedi. In order to ensure the Jedi couldn't escape even if they did survive the dioxis, the Saak'ak's docking bay fired its turbolaser turrets at the docked Radiant VII, destroying the ship before its captain could give the order to ready its shields."}, {"tag": "p", "text": "The toxic gas dioxis then flooded the ventilation system in the Jedi's waiting room, and Gunray dispatched a squad of security battle droids to ensure the destruction of the Jedi. After the OOM droids arrived at the room, Gunray contacted them stating the Jedi should be dead by that point before ordering them to dispose of their corpses. TC-14 exited and asked to be excused as she passed by them. The OOM droid leader, OWO-1, then ordered the corporal to go in while they provided cover. Before they could enter, however, Jinn and Kenobi revealed their survival by igniting their lightsabers. The droids attempted to blast them. Jinn and Kenobi, though, proved more than a match for the droids. The commotion did not go unnoticed by Gunray. After learning from Tey How that they had lost communications with the security droid unit, Gunray ordered the bridge sealed off, although his admission to Haako that he'd never dealt with a Jedi before caused Haako to doubt they'd survive the altercation. As a backup plan, they dispatched droidekas, which were more formidable due to their shield generators. Jinn attempted to use his lightsaber to force his way into the bridge, causing Gunray to order them to close the blast doors, believing that would hold them. However, Jinn proceeded to nearly cut through the blast doors to the bridge, much to Gunray and Haako's horror before the latter demanded to know what was taking the droidekas so long. At that moment, the droidekas arrived, ultimately chasing away the Jedi, with one of their blaster fire also detonating the weakened door. Although Haako, who had witnessed this due to the destroyed door, was relieved that the Jedi were no match for the droidekas, How informed them that the Jedi entered the ventilation shaft."}, {"tag": "p", "text": "The two Jedi navigated the ship and emerged in a hangar where they witnessed the preparation of several AATs, MTTs, and C-9979 landing crafts, causing them to deduce that the Neimoidians were planning an invasion. In order to hide the massive army the Trade Federation had secretly amassed from Republic customs shortly beforehand, the Neimoidians claimed they were simply the components to the latest, expensive Binary loadlifters despite their suspicious appearances as well as denying any military purposes to the components. Obi-Wan Kenobi, referring to Qui-Gon's earlier assessment regarding to how long the negotiations would take, sardonically commented he was right about the negotiations being short. They then stowed away on separate invasion craft, with Kenobi forcing his to make a crash landing on Naboo."}, {"tag": "p", "text": "Meanwhile, Tey How reported to her superiors that a transmission from the planet was incoming. Haako realized that the sender was Queen Amidala. Amidala warned the Viceroy that they wouldn't tolerate their blockade any longer and that Valorum had sent ambassadors to meet them. Gunray feigned ignorance regarding the ambassadors, and also claimed that they won't do anything to Naboo without approval from the Senate before claiming she is assuming too much. Haako, as the transmission ended, admitted that Amidala was right about her accusations and implied that they should back out, though Gunray sternly reminded him that it was too late to do so. Gunray, although he was unsure if Amidala did indeed suspect an attack from them, nonetheless ordered that they black out all communications on the planet so they could go on with the invasion."}, {"tag": "h3", "text": "The Subjugation of Naboo"}, {"tag": "p", "text": "The invasion craft landed in groups of three to cut off Naboo cities from each other. Gunray contacted OOM-9, commander of the Trade Federation Droid Army, warning him of the Jedi's presence among them and to not underestimate them. From their landing areas in the swamps, the invasion force was sent out towards New Centrif, Vis, and Parrlay, in order to disable the communication transmitters and keep the event secret from Coruscant. Attacks started on Harte Secur and Spinnaker, the last frontier before spreading to the Naboo capital of Theed."}, {"tag": "p", "text": "The loss of communications occurred as Amidala was consulting with Senator Palpatine. The failure prompted Theed's Governor Sio Bibble to say that it was an invasion, with Amidala also expressing disbelief that Gunray would go that far. Captain Panaka of the Royal Security Forces (RSF) offered to institute a perimeter to defend Theed, although Amidala reconfirmed her pledge of no fighting. She soon switched places with her decoy Handmaiden Sabé. Within hours, the armies had taken Theed, subduing Naboo's small Royal Naboo Security Forces and leaving the planet completely under the control of the Federation. Nute Gunray himself landed in Theed and assumed control from Queen Amidala's own throne room, also declaring victory as soon as one of his droids confirmed the queen's capture. After Amidala refused to sign a treaty legitimizing the occupation, she and her retinue were to be processed into Camp Four."}, {"tag": "p", "text": "However, the two Jedi had survived and reached the Naboo swamps. After having run into local Gungan Jar Jar Binks and contacted Boss Rugor Nass in the underwater city of Otoh Gunga, leader of the Gungans, both Jedi Jinn and Kenobi finally made it to Theed. There they found the queen and her entourage held hostage by battle droids. The Jedi made quick work of the droids, and the queen agreed to return with them to Coruscant, where she could plead before the Senate for help against her planet's cruel and abrupt siege."}, {"tag": "p", "text": "Getting past the Trade Federation blockade proved difficult, and the queen's ship barely scraped by, its shields repaired by astromech droid R2-D2 at the last moment. Since the hyperdrive was leaking badly during the escape, the group decided to hide on Tatooine in the Outer Rim Territories until a replacement could be found."}, {"tag": "p", "text": "Before they left, Panaka ordered the RSF volunteers to evacuate the city and to engage the Droid Army only in self-defense."}, {"tag": "p", "text": "In the following days, Trade Federation continued to take over the planet, eventually taking complete control. Due to glitches in the battle droids' programming, particularly in threat recognition, a number of unarmed citizens were mistakenly gunned down. Following the subjugation of the planet, command transferred from the Saak'ak to the Droid Control Ship, and the blockade dispersed."}, {"tag": "h3", "text": "Resistance"}, {"tag": "p", "text": "After the queen escaped, the Security Force formed resistance cells, utilizing the Flash speeder in hit and run raids. The droids actively hunted the Security Forces. Following Panaka's evacuation order, the Security Forces gathered what they could, fleeing in speeders, N-X Police Cruisers, or civilian transports. They hid anywhere they could before they got the chance to regroup, although many were killed or captured. The Security Forces, civilians, government officials, and even off-worlders found themselves in hiding and vowing to find a way to strike back."}, {"tag": "p", "text": "Naboo's small settlements gave the Security Forces an advantage, as did their knowledge of the local terrain. Lakeside communities were evacuated and their citizens fled to small islands, and gave aid, supplies, and shelter to the resistance. Additionally, the dense swampland confused the droids. The resistance cells tended to be made up of mixed bunches who helped out in small ways."}, {"tag": "p", "text": "After escaping from Theed, they assisted local farmers and rescued a police officer, Vedd Deviss, who informed them of a mysterious smuggler located in the mountains. Kael, Gavyn and Vedd soon found out that this smuggler was Borvo the Hutt. After they escorted the Hutt to his base, Borvo joined the Resistance and provided it with starfighters. With the help of Borvo they destroyed the Trade Federation Comm 4 satellite, and annihilated the disrupted Trade Federation base. Sykes stole a gunboat and used it to liberate Naboo slaves. However, Borvo soon revealed himself as a traitor and killed Kael. Lieutenant Sykes then assumed command and forced the Hutt to retreat to Nal Hutta. With the information from Kol Kotha, Borvo's mercenary, who defected from his former employer, Gavyn liberated the notorious Camp 4. After the queen returned home, Sykes joined the efforts to retake the capital, and destroyed Federation Army C."}, {"tag": "p", "text": "After breaching the blockade, Bravo pilot Rhys Dallows, along with the pirate Nym, Toydarian Reti, and mercenary Vana Sage, also joined the Resistance. While Reti and Rhys delivered the supplies, Vana and Nym defended one of the Resistance outposts against the Trade Federation attack. They also rescued some Naboo prisoners."}, {"tag": "p", "text": "One resistance group, called the Naboo Underground and led by Lucos Dannt, included a group of off-world students who were sent to Royal House of Learning prior to the Invasion, some of whom were even Jedi Padawans. The Naboo Underground conducted a number of successful operations against the occupying forces, primarily involving weapons theft and liberation of prisoners. In one daring operation, they liberated the Naboo Minister of Culture, Kyu Tane."}, {"tag": "p", "text": "At one point in the Invasion, the Trade Federation built a secret underground facility, which Doctor Nuvo Vindi took possession of during the Clone Wars to reproduce the Blue Shadow Virus."}, {"tag": "h3", "text": "Return of the Sith"}, {"tag": "h4", "text": "Arrival"}, {"tag": "p", "text": "After finding out that the queen had escaped the blockade, Darth Sidious was furious. He sent his apprentice, Maul, to find the queen and the Jedi, destroy the latter, and bring the former back. Using an edited holomessage of Sio Bibble, Naboo's governor, to pinpoint where the queen's ship may have gone, Maul discovered that Tatooine was that destination. Now was the time for the Sith to unmask themselves to the Jedi after almost a thousand years."}, {"tag": "p", "text": "After the queen's ship landed on Tatooine, Qui-Gon Jinn went with Amidala (disguised as a handmaiden) and Jar Jar Binks to Mos Espa, where he attempted to barter for parts with Watto, the Toydarian owner of a junkyard. They also met the young slave Anakin Skywalker, who invited them back to their home. Jinn helped him find parts for his podracer."}, {"tag": "h4", "text": "Second day"}, {"tag": "p", "text": "They bartered with Watto and were allowed to enter Skywalker's podracer in the Boonta Eve Classic. The Jedi and Amidala helped Skywalker complete his podracer. When cleaning a small cut, Jinn acquired a blood sample, which he sent over his communicator to Kenobi. The sample revealed a startling discovery—over 20,000 midi-chlorians, things which resided in each individual and allowed them to commune with the Force."}, {"tag": "p", "text": "One night during their stay on Tatooine, Tusken Raiders boarded the Royal Cruiser and captured Queen Amidala. Panaka asked Kenobi to rescue her, and the Padawan chased the Raiders to their burial ground. He confronted the Tusken war chief and defeated him and was allowed to take the queen home."}, {"tag": "h4", "text": "Boonta Eve"}, {"tag": "p", "text": "Skywalker won the podrace and was granted his freedom, and Watto gave the Jedi a replacement T-14 hyperdrive generator. Young Skywalker agreed to return to Coruscant to be trained as a Jedi. As he packed, Obi-Wan made the necessary repairs."}, {"tag": "p", "text": "On his ship, Scimitar, Maul traveled to Tatooine. He touched down on the planet's sand and sent probe droids to different locations to find his targets. Jinn destroyed one of the probe droids upon discovering it tailing them. Later that day, as the Jedi returned to their ship, Maul ambushed Jinn and his new protégé, Anakin Skywalker. Maul leaped from his speeder and clashed with the Jedi. It was only through extreme concentration that Qui-Gon could defend himself against Maul's heavy attacks. As he fended off a blow from the Sith, Qui-Gon told a puzzled Anakin to leave and tell the Naboo pilot to take off. While he was driven back, Skywalker boarded the Royal cruiser and did as Jinn said. Maul attempted to take Jinn by leaping over him, but Jinn blocked the strike to his back and jumped onto the ramp. Saved from the clutches of the Sith, the queen and her entourage departed Tatooine for Coruscant. Down in the cruiser's boarding ramp, Jinn expressed his worries and introduced Skywalker to his future master."}, {"tag": "h3", "text": "Amidala before the Senate"}, {"tag": "p", "text": "The day after the duel on Tatooine, the Jedi and Queen Amidala arrived on Coruscant following their layover on Tatooine. They were met on the landing platform by Senator Palpatine and Chancellor Valorum. Palpatine brought them to his apartment. While acting as Palpatine, Sidious, having fully intended to have Amidala captured by Darth Maul, reworked his plot to take into account of her arrival."}, {"tag": "p", "text": "On their way back to the Temple, the Jedi were attacked by mercenaries led by a thug boss hired to prevent their return. They defeated the mercenaries and returned to the Temple."}, {"tag": "p", "text": "Count Dooku met with Palpatine, and revealed to him the prophecy of the Chosen One, and that Skywalker was to be tested for Force sensitivity. Plagueis, informed by Sidious in turn, went back to his apprentice's apartment as Magister Demask to see for himself, using a mind trick on one of the handmaidens, but Skywalker had been taken away by Jinn."}, {"tag": "p", "text": "Jinn, Kenobi, and Skywalker appeared before the Jedi Council. Jinn reported his encounter with Maul, leaving the Council to consider the possibility that the Sith had returned after a thousand years. Skywalker was tested, and although he demonstrated Force-sensitivity, he was denied admittance. The Council cited his advanced age as the deciding factor, and ordered Kenobi and Jinn to return to Naboo with the queen and find out what they could about her mysterious assailant to bring the existence of the Sith to light."}, {"tag": "p", "text": "In a special meeting of the Galactic Senate, Amidala spoke before the thousands of galactic delegates. Her pleas were instantly called lies and baseless accusations by the Senator of the Trade Federation, Lott Dod, who recommended appointing a commission to ascertain the truth. Senator Aks Moe of Malastare agreed with Dod. The blatant corruption of the Senate dismayed Amidala, shaking her faith in its ability to govern. Valorum was interrupted by Vice Chair Mas Amedda, and when he spoke to Amidala, it was to ask her if she would defer her motion and allow the commission to proceed. Amidala responded by saying that she would not defer."}, {"tag": "p", "text": "At the behest of Palpatine, Amidala shocked the Senate by moving for a vote of no confidence in the leadership of Chancellor Valorum. Although she was reluctant to make the motion, it was taken up enthusiastically by the Senators. A recess was then called, and Valorum was not seen at the podium afterward."}, {"tag": "p", "text": "Within hours, Palpatine was named one of the nominees to succeed Valorum and promised Queen Amidala to clean up the rampant corruption. Bail Antilles was nominated by Com Fordox, and Edcel Bar Gane nominated Ainlee Teem. Orn Free Taa was the one who nominated Palpatine."}, {"tag": "p", "text": "Against Palpatine's request, Amidala returned to Naboo, deciding that her fate belonged with that of her people. Back on Naboo, Neimoidian counterfeiter Gode Takrab produced a fake treaty which showed Amidala in support of the invasion. Following his defeat on Tatooine, Darth Maul was ordered to proceed to Naboo to assist in rooting out any resistance. He noticed several flaws in the Trade Federation's strategy, but did not seek to correct them. Infiltrating Naboo secretly, he dismantled several patrols then used the head of an OOM security droid as a comlink to contact Viceroy Gunray and demand that he be recognized as the droid's supreme commander. Once he arrived in the Theed Palace control room, he was briefed by Viceroy Gunray on the resistance, and the Viceroy mentioned several setbacks perpetuated by Lieutenant Sykes' resistance group. He then informed the Neimoidian leadership of the threat the Gungans posed and led the search personally."}, {"tag": "p", "text": "The day before the vote, reports indicated that Amidala assembled the Gungan Army. That night, Damask met holographically with representatives from the various corporations and warned that the Trade Federation leadership had doomed themselves with the blockade, and that the organization would be dissolved. He cautioned the corporations to start a withdrawal from the Senate. He then attended a performance at the Galaxies Opera House with Palpatine."}, {"tag": "p", "text": "Afterward, they joined Free Taa and Amedda and a select group of politicians in a private room at the Manari. Darths Sidious and Plagueis then retired to his penthouse, where they discussed the plans to make Damask Co-Chancellor. Palpatine succeeded in getting the Muun drunk on half-century-old Sullustan wine, then killed his Master with Force lightning, fulfilling the next step in the Sith Grand Plan. He basked in the moment, accepting the will of the dark side of the Force."}, {"tag": "p", "text": "Palpatine then won the Chancellorship by a wider margin than predicted. His first duty was to return to his home planet in the aftermath of the Trade Federation's defeat."}, {"tag": "h3", "text": "The battle for freedom"}, {"tag": "p", "text": "Darth Maul led the assault personally into the Rellias Straits. He ordered OOM-9 to draw the Gungans out, then searched for the coordinates of the Gungan city. He met with the former chief of the Security Forces, Maris Magneta, then executed her when she tried to ambush him. He then sought out Leika, who told him of the closest Gungan cities. Maul then captured and tortured Boss Ganne to find out where the Gungans were hiding. By the time OOM-9's scouts reached Otoh Gunga, the city had been abandoned. Maul then received word that the queen and her Jedi escort were returning."}, {"tag": "p", "text": "When Maul returned to Theed, he ordered the security patrols to sweep the area every five minutes and to increase security at the detention camps."}, {"tag": "p", "text": "By the time the queen arrived, two days had passed since Otoh Gunga was assaulted and the Gungans fled to their Sacred Place."}, {"tag": "p", "text": "Upon their arrival back on Naboo, Amidala and the Jedi formulated a plan to capture Viceroy Gunray in Theed, thus taking back the planet. With the aid of Jar Jar Binks, an alliance was formed with the proud Boss Nass and the Gungans, and Captain Quarsh Panaka organized all Resistance cells. OOM-9 was near the Sacred Place at the time. Flash Speeders were used to ferry the resistance leaders. Maul secretly watched the meeting in the Sacred Place using his probe droids."}, {"tag": "p", "text": "During the conflict, Master Yoda asked a Jedi to go to Naboo to assist Master Jinn in stopping the Sith Lord on Naboo."}, {"tag": "p", "text": "Members of one of the resistance cells, including Pars Varqom, were contacted by Captain Panaka to join the assault, but were too far from Theed. They were instead assigned to liberate a detention camp in the Penladen Hills."}, {"tag": "p", "text": "The plan was for the Gungan Grand Army to engage the Droid Army of the Federation in open combat while the queen and the Jedi quietly infiltrated the palace in Theed with the remainder of the Royal Security forces to capture the Viceroy. The small number of pilots in the Naboo security forces would then fly into space and attempt to destroy the only battleship still in orbit: the Droid Control Ship, where all the battle droids were controlled from a single computer brain."}, {"tag": "p", "text": "Meanwhile, Maul and the Federation leaders contacted Sidious, who ordered them to wipe them all out. Maul returned to the Theed hangar and ordered all but sixty droids to reinforce the security platoons, then worked out the upcoming duel with the Jedi in his mind."}, {"tag": "p", "text": "The plan began as intended, but the entire dynamic of the situation changed with the appearance of Maul. The two Jedi engaged the Sith Lord in battle while the queen led a raid into the throne room. Soon after, Amidala and her Security Captain Quarsh Panaka captured both Gunray and Rune Haako. Maul led Jinn and Kenobi through the hangar and into Theed's power generator complex, where Maul kicked Kenobi, who fell several stories. Jinn knocked Maul back and jumped down after him, but the Sith Lord got up. Maul moved back, surprised by Jinn's stamina. They moved down the catwalk near the refinery."}, {"tag": "p", "text": "The resistance cells occupied the Droid Army's attentions in the streets, drawing attention away from the Palace."}, {"tag": "p", "text": "Meanwhile, Kenobi jumped up to the catwalk Jinn and Maul were on, and ran to help Jinn. But Jinn, Kenobi and Maul were stuck behind the laser shields, each cut off from the other. Maul waited impatiently, looking in mocking contempt at Jinn, who was calmly meditating, possibly as an attempt to strike the Sith Lord off guard. The walls shut down, Kenobi ran, and Jinn jumped up and battled Maul once again. At the melting pit, Maul battled the Jedi and mortally wounded Jinn. He then had to face Kenobi. The wall once again shut down and Kenobi was left to face Maul, alone. Maul managed to kick Kenobi into the pit, but Kenobi grabbed hold of a nozzle which was jutting out a little below Maul. The Sith Lord then kicked Kenobi's lightsaber into the bottomless shaft, past the still-hanging Jedi. Calling his Master's lightsaber to him, Kenobi jumped and cut through the Sith Lord's waist. Maul fell into the shaft. Kenobi joined his dying Master who, in his final words, told him to train Skywalker, the fabled \"chosen one\" destined to bring balance to the Force. Jinn died in a distraught Kenobi's arms. With Maul presumed dead, Amidala's assassination failed, but the Droid Army was still active, until the Droid Control Ship was destroyed by an unexpected participant in the day's events: young Anakin Skywalker."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "With the defeat of the Trade Federation and the deactivation of its mechanical army, the Invasion was over. Peace and order were restored, as were positive relations between the Gungans and the people of Naboo. Soon after, Palpatine arrived on Naboo with members of the Jedi High Council to oversee the arrest of Gunray and Haako. Yoda promoted Kenobi to full Jedi Knight and assigned him to train Skywalker. That evening, Qui-Gon was given a Jedi funeral. During the funeral, due to being confronted with irrefutable evidence that the Sith had returned, Yoda and Mace Windu, knowing that the Sith have operated under the Rule of Two, started theorizing that there's still one Sith left out there. During Jinn's funeral, the recently honored students were approached by Sabé, and asked to help end a minor rebellion by a dark-side force-adept. The day after, the Gungans and Naboo celebrated with a parade in Theed, complete with overflights by N-1 starfighters, N-X Police Cruisers, and NB-1S Royal Bombers. Amidala and Boss Nass shared the Globe of Peace as a Gungan band played \"Symponik Nabooalla,\" a piece created by Augara Jowil."}, {"tag": "p", "text": "After the battle, young Skywalker wrote a journal about his experience with the Jedi. The Security Forces and resistance fighters assembled in the Theed Hangar to see both him and his Master off as they left in the Royal Starship. Palpatine promised to bring Gunray and his lieutenants to justice and end the corruption of the Senate."}, {"tag": "p", "text": "Following Skywalker and Kenobi's return to Coruscant, a promising young recruit of the Jedi Order was sent by Yoda to help the Naboo return to a state of peace. The recruit took part in the preparation of the Victory Races of Naboo, a friendly competition between Queen Amidala and General Binks, but also helped eliminate the last few battle droids that lingered in the Sacred Forest of Naboo."}, {"tag": "p", "text": "The students from the Royal House of Learning aided in liberating the Trade Federations remaining prison camps, and cleaning up the deactivated battle droids, when they were reunited with captain Nuun Pargen of the Crescent. They were also honored in a minor ceremony by the queen. The Gungan and Naboo civilizations became closer, with the Gungans colonizing one of Naboo's moons, Ohma-D'un."}, {"tag": "p", "text": "Many reports were made about the Invasion, as the Battle on the Grassy Plains represented a part of warfare rarely seen in the galaxy at that point. Other reports suggested that the droid starfighters performed sluggishly, as the Central Control Computer also had to direct large numbers of ground forces. Political pundits discussed what Palpatine's election would mean, and if other planets might follow Naboo's lead in challenging galactic powers. Other questions facing the galaxy were if harsher legal enforcement would force an exodus of galactic consortiums from the Republic. For his part, Darth Sidious was disappointed in how easily the Trade Federation was defeated."}, {"tag": "p", "text": "Three years later, Supreme Chancellor Palpatine forced a stand-down in a secret meeting attended by Commander Wilhuff Tarkin of the Outland Regions Security Force. Over the following months, the Trade Federation's security forces were to be disbanded and assimilated into the Republic. A number of Federation warships were acquired by Tarkin and the Outland Regions Security Force and used in an attack on the sentient planet Zonama Sekot."}, {"tag": "p", "text": "Within a month of the end of the Invasion, Jedi Master Dooku left the Jedi Order as a result of Jinn's death and planned on reclaiming his family's title of Count on Serenno. He revealed to Palpatine that he wanted to find the Sith and learn the secrets of the dark side. He also revealed that Master Sifo-Dyas had plans of his own."}, {"tag": "p", "text": "However, after four trials in the Supreme Court, Gunray remained Viceroy of the Trade Federation. Gunray, likewise, eventually admitted Sidious' existence and role in the invasion to Count Dooku during this time, who in turn would eventually reveal this to Kenobi nearly a decade later. Eventually, Amidala's term as queen expired. Although the Naboo people were willing to amend the Constitution, Amidala stepped down, and Jamillia was elected as her successor. Amidala then accepted the position as Naboo's senator. Eventually, Dooku was apprenticed to Darth Sidious, but became the public face of the Separatist Crisis. Gunray continued to despise Amidala for her part in his defeat and sought revenge against her."}, {"tag": "p", "text": "The ascension of Palpatine to the post of Supreme Chancellor was part of the Sith Grand Plan, which had been in motion for a millennium by numerous masters."}, {"tag": "p", "text": "Although Maul was believed by the Jedi to have died, he had survived, but was crippled, and ended up going into hiding until he was found by his brother, Savage Opress. His survival was eventually exposed publicly during the Skirmish on Florrum."}, {"tag": "h2", "text": "Major players"}, {"tag": "h3", "text": "Padmé Amidala"}, {"tag": "p", "text": "Padmé Amidala was Naboo's young queen, elected six months before the start of the Invasion. Her chief of security, Captain Panaka, worked with her to create a system of decoys for her safety. During the blockade, she came before the Trade Federation to plead for her people, and was committed to a peaceful resolution. She was also committed to democracy, and when the Federation invaded, refused to sign a treaty legitimizing her occupation. On Coruscant, it was she who called for the Vote of No Confidence in Chancellor Valorum. Her leadership is what saved her people from the Federation."}, {"tag": "h3", "text": "Qui-Gon Jinn"}, {"tag": "p", "text": "Qui-Gon Jinn was the Jedi Master dispatched by Chancellor Valorum along with his Padawan, Obi-Wan Kenobi, to resolve the Federation blockade. After the Federation terminated the negotiations, Jinn befriended the Gungan Jar Jar Binks and helped Queen Amidala escape. Jinn was a maverick who believed in the concept of the Living Force, and believed it was the will of the Force that he discover young Skywalker on Tatooine. The Jedi Master defied the wishes of the Jedi Council in regards to training Skywalker. Jinn, although a strong warrior, fell in battle against Darth Maul during the fight to retake Naboo. Before he died, he told his Padawan to train Skywalker in his stead."}, {"tag": "h3", "text": "Rugor Nass"}, {"tag": "p", "text": "Boss Nass of the Gungans was a descendant of Boss Gallo, who had united the warring Gungan tribes three millennia previously. He was mistrustful of the Naboo people, but joyously agreed to help take back the planet from the Federation Droid Army after Queen Amidala humbled herself before him. He called forth the Gungan Grand Army, which for hundreds of years had only been marshaled for training, Boss Nass agreed to have the Grand Army serve as a diversion to allow Amidala and a strike force to infiltrate Theed and capture Viceroy Gunray. Following the victory, Nass received the Globe of Peace from Amidala and the two races became closer."}, {"tag": "h3", "text": "Palpatine/Darth Sidious"}, {"tag": "p", "text": "Naboo's Senator, Palpatine was on Coruscant during the blockade. Just prior to when the invasion was launched, he was in communication with Supreme Chancellor Valorum, who assured him that he was sending ambassadors. When Amidala traveled to Coruscant to seek help from the Galactic Senate, Palpatine maneuvered her to call for a Vote of No Confidence in the Supreme Chancellor, who up to that point had been their strongest supporter. The Senator was quickly added to the list of possible successors. Amidala soon after returned to Naboo and Palpatine was elected as Valorum's successor. Palpatine was actually the Sith Lord Darth Sidious, who was the heir of a hidden legacy a millennium long. For decades Palpatine and his Master Darth Plagueis had plotted against the Republic and fostered the corruption in the Senate that had allowed the Federation free reign to launch the blockade. The invasion was only part of the long plot to restore Sith rule to the galaxy. On the eve of the election, Sidious eliminated his Master and accepted the will of the dark side of the Force."}, {"tag": "h3", "text": "Darth Maul"}, {"tag": "p", "text": "Darth Maul was a Sith Lord and the Apprentice of Darth Sidious. He had been trained from a young age as a tool who was sent against the Sith Lords' less salient enemies. After the Trade Federation failed to secure the queen, Maul was assigned to track them down. He discovered that they had traveled to Tatooine, and in his attempt to capture the queen, dueled Jinn. That revealed to the Jedi Order that the Sith had returned. Following the incident on Tatooine, Maul traveled to Naboo and became a commander of the Droid Army. He personally led the assault against the Gungan city of Otoh Gunga, but it was found abandoned. He then returned to Theed and prepared for the arrival of the Jedi-escorted queen. He engaged the two Jedi in a lightsaber duel in the Theed Hangar and killed the Master. He then taunted the Padawan, who leapt out of the generator shaft and cut into Maul. Maul survived his grievous injury and was deposited on the planet Lotho Minor, where he spent over a decade in exile before resurfacing during the Clone Wars."}, {"tag": "h3", "text": "Nute Gunray"}, {"tag": "p", "text": "Viceroy Nute Gunray of the Trade Federation was a longtime ally of Darth Sidious. Following the death of the Trade Federation Directorate members on Eriadu, Gunray advocated striking back, but Sidious convinced him to target Naboo, a world which could not strike back. During the invasion, Gunray questioned the legality of landing ground forces, but was quickly rebuffed. Gunray also had doubts when Sidious was sending Maul to join them. Gunray tried to force Amidala to sign the treaty, but at the end of the invasion, it was he who had to negotiate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Invasion of Naboo was first shown in the first film of the Star Wars prequel trilogy, Star Wars: Episode I The Phantom Menace, released in May of 1999."}, {"tag": "h3", "text": "Conception"}, {"tag": "p", "text": "The screenplay for Star Wars: Episode I The Phantom Menace was started on November 1, 1994. Although the Star Wars universe started in the middle, with the original trilogy, creator George Lucas had always conceived of the films as being part of a multi-film saga. It was written, like the rest of Lucas' scripts, on loose-leaf paper with pencil in a red binder."}, {"tag": "p", "text": "The Art Department was led by Design Director Doug Chiang. During pre-production, Lucas and Producer Rick McCallum met weekly with the Art Department. Costume Designer Trisha Biggar and her staff of 40 made over 1,000 costumes for the film. Additionally, Industrial Light & Magic created dozens of full-scale models."}, {"tag": "p", "text": "Filming began on the first prequel 20 years after the first Star Wars had been released, as George Lucas felt that technology had sufficiently matured. Principal photography was done at at Leavesden Studios. The sets were constructed under the supervision of Production Designer Gavin Bocquet. Among the sets were the Tatooine slave hovel, the Royal Starship cockpit, Theed Hangar, Jedi Council Chambers, the Trade Federation battleship generator core, and more. Scenes in the Theed Royal Palace were shot at Caserta, Italy, and Tatooine returned to location in Tunisia. Portions of the Gungan city were done in CGI."}, {"tag": "p", "text": "The score was done by Star Wars composer John Williams."}, {"tag": "h3", "text": "Alternate viewpoints"}, {"tag": "p", "text": "The battle was also represented in LEGO form in 2005 in LEGO Star Wars: The Video Game and its 2007 compilation re-release, as well as the young readers book LEGO Star Wars: The Phantom Menace."}, {"tag": "p", "text": "The video-game adaptation of The Phantom Menace features a mission on Coruscant which contradicts the film; therefore, this article assumes it is non-canon. In the mission, Amidala is captured on the landing platform by the Sun Guard, and Panaka must rescue her, eventually dueling the Thug leader."}, {"tag": "p", "text": "There are various inconsistencies between the film and the video-game adaptation, Star Wars: Episode I Jedi Power Battles, and Star Wars: Obi-Wan. The respective battle articles have more information."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}