{"url": "Invasion_of_Lorrd", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Kanz Disorder"], "nodes": [{"tag": "h1", "text": "Invasion of Lorrd"}, {"tag": "p", "text": "The Invasion of Lorrd was a conflict during the early stages of the Kanz Disorders which pitted the Myrialites of the Argazdan Redoubt against the Lorrdians. The battle saw the conquest of Lorrd and the mass enslavement of the entire Lorrdian species for the next three hundred years until they were liberated by Jedi/Galactic Republic forces in 3670 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Mandalorian Wars, the Argazdans of Argazda came under the influence of a secessionist movement known as the Myrialites led by Provisional Governor Myrial. Perceiving the Galactic Republic as \"corrupt and faithless\", they launched a violent revolt and annexed the Kanz sector; renaming it the Argazdan Redoubt. In the ensuing conflict, the Myrialites invaded and annexed several planets within the region including the Amaltannans, whom they proceed to enslave."}, {"tag": "p", "text": "The Lorrdians supported the Amaltannan resistance, earning the ire of Myrial who ordered that they be conquered and enslaved as well. The Argazdan military fleet orbitally bombarded the Lorrdian homeworld of Lorrd; devastating major centers like Frezen and New Shallos. This resulted in enormous casaulties among the civilian population and the survivors fled to the sparsely-populated province of Kinyov which had escaped the naval bombardment."}, {"tag": "p", "text": "However, they were quickly rounded up by Argazdan ground troops and slavers. Kinyov's capital of Qatamer became a center of slaving operations and the headquarters of the occupation government. The enslaved Lorrdians were forbidden by their masters from communicating with each other. As a result, they were forced to develop a system of subtle gestures, facial expressions, and body postures to talk to each other known as kinetic communication."}, {"tag": "p", "text": "The Myrialites established a totalitarian regime that would last for three hundred years. Any attempt made by the Galactic Republic and the Jedi to end the disorders was cut short by the Mandalorian Wars followed by the more devastating Jedi and Sith Civil Wars.Around 3670 BBY, the Lorrdian Jedi Knight Mari-Elan Nora led a joint Jedi and Republic task force to liberate the Kanz sector. Despite dogged resistance from the Argazdans, the Jedi and Republic forces defeated the Argazdan Redoubt."}, {"tag": "h2", "text": "Appearances"}]}