{"url": "Invasion_of_Naboo", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Cleanup", "Category:Battles of the Invasion of Naboo", "Category:Battles of the Naboo Crisis", "Category:Blockades", "Category:Conflicts of the Core Worlds", "Category:Conflicts of the Mid Rim", "Category:Conflicts of the Outer Rim Territories", "Category:Invasions", "Category:Jedi", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Invasion of Naboo"}, {"tag": "p", "text": "The Invasion of Naboo, also known as the the Naboo conflict, the Naboo Crisis, the occupation of Naboo, and remembered by Galactic Republic critics as the \"debacle at Naboo,\" was a pivotal galactic conflict that was centered on the Mid Rim planet of Naboo in 32 BBY during the Republic Era. Ten years prior to the Clone Wars, the conflict laid the seeds for the war itself. The crisis publicly started with the blockade of Naboo, which began the Trade Federation's month long blockade of the planet, before escalating when its capital city, as well as its surrounding regions, were conquered by the battle droids of the Federation Army. The Federation was secretly in league with the Sith led by the Sith Lord Darth Sidious, who was Naboo's senator, Sheev Palpatine. The Dark Lord intended to use the crisis as a pretext to remove the Galactic Republic Supreme Chancellor Finis Valorum from office and have himself elected in his place as Chancellor."}, {"tag": "p", "text": "During the initial blockade, Valorum sent two Jedi, Qui-Gon Jinn and Obi-Wan Kenobi, to negotiate with the Federation, but Sidious ordered that they be killed and that the Federation deploy their forces to Naboo. The Jedi escaped and rescued Queen Padmé Amidala from the Federation, making their way to the world of Tatooine that was controlled by the Hutt Clan for refuge after their vessel was damaged while escaping the blockade. There, Jinn discovered a young slave named Anakin Skywalker, the Chosen One destined to bring balance to the Force."}, {"tag": "p", "text": "The group repaired their damaged vessel and made their way to the Republic capital world of Coruscant, where Amidala pleaded for assistance before the Galactic Senate. The Republic's bureaucracy was unable to help Amidala, who called for a vote of no confidence in Chancellor Valorum, leading to an election in which Palpatine was a favorite to win. Knowing she would find no help on Coruscant, Amidala returned to Naboo with the Jedi and planned to defeat the Federation on her own."}, {"tag": "p", "text": "Upon her return, Amidala met and forged an alliance with the Gungans who lived in Naboo's oceans, and the Gungans agreed to join the fight against the Federation. In the final battle, the Gungan army took on the Federation army as a diversion; a wing of starfighters attacked the droid control ship in orbit; and Amidala and the Jedi infiltrated the palace to capture Nute Gunray, the Federation viceroy. By the battle's end, Skywalker had destroyed the Federation control ship, the Gungans were victorious, Gunray was captured, and the Sith Lord Darth Maul was defeated—at the cost of Jinn's life."}, {"tag": "p", "text": "The crisis ultimately allowed Palpatine to achieve his goals; with a strong sympathy vote, Palpatine was elected Supreme Chancellor. Over the next ten years, he furthered his Sith plot to take over the Republic and destroy the Jedi, launching the Clone Wars that would allow him to form a Galactic Empire and destroy the Jedi Order."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "At least a millennium before the Invasion, the Jedi and Sith were at war. The war ended in the Sith's defeat, as their thirst for power caused them to turn on each other, weakening themselves as a result, which allowed the Jedi to nearly destroy them. However, the Sith remained alive through one survivor, Darth Bane, who created the Rule of Two in order for the Sith to operate in secret. Bane's tradition continued throughout the centuries. Eventually, Darth Sidious, apprentice to Sith Lord Darth Plagueis, killed his master in his sleep and succeeded him as the Sith Master. Sidious also took on an apprentice of his own, Darth Maul."}, {"tag": "p", "text": "Wilhuff Tarkin's stonewalling of the attempts to investigate the Eriadu Conference, during which the Nebula Front had killed the previous leadership of the Trade Federation, which allowed the anti-Galactic Republic Nute Gunray to rise to be the Viceroy of the Trade Federation, helped to foment and hasten the Naboo invasion."}, {"tag": "p", "text": "Prior to the invasion, the Federation used the Free Trade Zones to conduct untaxed business. The Galactic Senate, however, passed Prop 31-814D, which made them eligible for taxation. This angered the Federation, which decided to retaliate by blockading the Mid Rim planet Naboo. However, there was more at play with the invasion: in actuality, the invasion was engineered by the shadowy Sidious, who the Federation had allied themselves with. Sidious had been the one who suggested Naboo be the Federation's target, as, in his guise as Naboo Senator Sheev Palpatine, he planned to use his people's suffering in a bid for political sympathy, which would push him to be the Supreme Chancellor of the Galactic Republic, allowing him to further his own plans. To that end, Sidious, in his public persona, had engineered various taxation bills into being presented to the Senate which he, as Palpatine, publicly opposed."}, {"tag": "p", "text": "That same year, the Naboo had held one of their biannual elections, in which the incumbent Queen, Sanandrassa, was defeated by the heavily-favoured candidate Padmé Amidala. Sanandrassa had held to a policy of isolation which unwittingly assisted Sidious' plans by weakening Naboo and depleting its stocks of food, leaving its people in danger of starvation if the planet was cut off. Amidala had not publicly criticized these beliefs of Sanandrassa's while campaigning, but after her coronation, she began working to undo the policies. Eventually, Amidala organized a summit, to which she invited the heads of state of every other Republic member world in the Chommell sector. When he was informed of the summit by Amidala herself, Palpatine realized his plans would have to be accelerated. Although many of the planets to which Amidala had extended invitations did not send ambassadors, the summit was otherwise a success. However, the Trade Federation arrived the day the summit ended, with orbital sensors picking up unusual feedback that prompted Amidala's chief guard, Captain Quarsh Panaka, to have Governor Kelma of Karlinus, the last guest to leave, expedite her departure."}, {"tag": "p", "text": "The Federation blockaded Naboo with a fleet of Lucrehulk-class Battleships, warships illegally modified from the organization's Lucrehulk-class LH-3210 cargo freighters. Ultimately, the month-long blockade would leave the planet ill-supplied and starved. Amidala worked closely with various officials to find allies to help them. On the seventh day of the blockade, an agricultural transport from Karlinus attempted to bring a shipment of grain to Naboo, but the ship war turned away and diverted to Enarc, where the grain was placed into cold storage. When Graf Zapalo told Amidala that the planet would begin to suffer with its food supply due to the first yield of crops being turned into fertilizer, Amidala ordered the planet to begin rationing."}, {"tag": "p", "text": "In response to Queen Amidala's requests for help, Supreme Chancellor Finis Valorum dispatched two ambassadors to speak to both the Naboo and the Trade Federation, sending Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi. Jinn had previously been reading up on the taxation bills going before the Senate that were the public cause of the situation, as he had sensed something amiss with them, but neither he nor Kenobi had been able to pinpoint exactly what the problem was."}, {"tag": "h2", "text": "The conflict"}, {"tag": "h3", "text": "Negotiations"}, {"tag": "p", "text": "The two Jedi were scheduled to meet with Viceroy Gunray immediately after arriving at Naboo in the starship Radiant VII. However, TC-14, the hostess protocol droid which they encountered first, promptly informed Gunray, his lieutenant, Settlement Officer Rune Haako, and invasion force Captain Daultay Dofine, that the ambassadors from Coruscant were Jedi Knights. Terrified at the prospect of facing Jedi, Gunray contacted Darth Sidious and presented the situation. Sidious said the Chancellor should never have bought them into crisis and ordered Gunray to kill the Jedi at once and begin landing his troops on Naboo for an invasion, and when Gunray questioned the invasions' legality, Sidious replied that he would make it legal. Sidious also told Gunray to exclude Dofine from any future communications after the latter implied calling off the plan."}, {"tag": "p", "text": "Toxic dioxis gas then flooded the ventilation system in the Jedi's waiting room, and Gunray dispatched a squad of battle droids to verify that the Jedi had been destroyed. They had survived the gas, however, and Qui-Gon Jinn and Obi-Wan Kenobi decimated the OOM command battle droid and OOM-series security droids. The two Jedi continued to cut through the security droids and made their way throughout the ship. Jinn then attempted to cut through the blast doors to the bridge where the Federation leadership was waiting. They nearly succeeded, but the arrival of two shield-bearing droidekas forced them to flee the scene. The two Jedi made it to the ship's hangar where they observed thousands of B1-series battle droids being loaded onto landing craft. Realizing that an invasion of Naboo was imminent, they stowed away on separate droid invasion craft to escape to the planet's surface. Kenobi's transport was forced to crash-land on Naboo, although the Jedi was uninjured."}, {"tag": "h3", "text": "The subjugation of Naboo"}, {"tag": "p", "text": "After learning the Jedi had escaped, Gunray contacted invasion commander, an OOM command battle droid named OOM-9, and warned him of the Jedi's presence among them and to not underestimate them. OOM-9 had his droid troops and pilots take out communication transmitters, stopping the Naboo population from reporting the invasion or calling for aid, and occupy settlements."}, {"tag": "p", "text": "In the capital city of Theed, a communications jam occurred as Padmé Amidala was consulting with Senator Palpatine. The failure prompted Theed's Governor Sio Bibble to say that it was an invasion, although Amidala reconfirmed her pledge of no fighting. But realizing an invasion was underway, she soon switched places with her decoy Handmaiden Sabé. Within hours, the Trade Federation military had taken Theed, subduing Naboo's small Royal Naboo Security Forces and leaving the planet completely under Federation control. Nute Gunray himself landed in Theed and assumed control from Queen Amidala's own throne room. After Amidala refused to sign a treaty legalizing the occupation, she and her retinue were to be processed into Camp Four."}, {"tag": "p", "text": "Meanwhile, Kenobi and Jinn had reached the Naboo swamps. After running into local Gungan Jar Jar Binks, the Jedi went underwater and contacted Boss Rugor Nass, leader of the Gungans, in the underwater city of Otoh Gunga. Although the Gungan leader refused to get involved in the fighting on the surface, he did lend them a Gungan transport, which they used to travel to Theed with Jar Jar. There they found the Queen and her entourage held hostage by battle droids. After a brief skirmish against the escorting droids, the Jedi implored the Queen to travel with them back to Coruscant. Not only would she be safer there, but she would be able to ask the Senate to condemn the invasion and take military action. She eventually agreed."}, {"tag": "p", "text": "However, getting past the Trade Federation blockade proved very difficult and the Queen's ship was barely able to scrape by, its damaged shields needing repair by astromech droid R2-D2 at the last possible moment. Since the hyperdrive had begun to leak badly during the escape, the group decided to hide on Tatooine in the Outer Rim Territories until a replacement could be found."}, {"tag": "p", "text": "In the following days, the Trade Federation continued to take over the planet, eventually taking complete control. Following the subjugation of the planet, command transferred from the Saak'ak to the Droid Control Ship Vuutun Palaa, which had been at the heart of the Federation's blockade. After this was done the blockade dispersed, but the Yuutun Palaa stayed, and the commander's of the Saak'ak transferred to the control ship."}, {"tag": "h3", "text": "Return of the Sith"}, {"tag": "h4", "text": "Arrival"}, {"tag": "p", "text": "After finding out that the Queen had escaped the blockade, Darth Sidious was furious. He sent his Sith apprentice, Darth Maul, to find the Queen and the Jedi, destroy the latter, and bring the former back. Now was the time for the Sith to unmask themselves to the Jedi after almost a thousand years."}, {"tag": "p", "text": "After the Queen's ship on Tatooine, Qui-Gon Jinn went with Amidala (disguised as a handmaiden) and Jar Jar Binks to Mos Espa, where he attempted to barter for parts with Watto, the greedy Toydarian owner of a junkyard. They also met the young slave Anakin Skywalker, who invited them back to their home."}, {"tag": "p", "text": "On the second day on Tatooine, they bartered with Watto and were allowed to enter Skywalker's podracer into the Boonta Eve Classic. The Jedi and Amidala helped Skywalker complete his podracer. When cleaning a small cut, Jinn was able to acquire a blood sample, which he sent over his comlink to Kenobi. The sample revealed a startling discovery—over 20,000 midi-chlorians, things which resided in each individual and allowed them to commune with the Force."}, {"tag": "h4", "text": "Boonta Eve"}, {"tag": "p", "text": "Skywalker won the podrace and was granted his freedom, and Watto gave the Jedi a replacement T-14 hyperdrive generator. Young Skywalker agreed to return to Coruscant to be trained as a Jedi. As he packed up, Obi-Wan made the necessary replacements."}, {"tag": "p", "text": "On his ship, Scimitar, Maul traveled to Tatooine. He touched down on the planet's sand and sent probe droids in different locations to find his targets. One of the probe droids ended up destroyed by Jinn upon discovering its tailing them. Later that day, as the Jedi returned to their ship, Maul ambushed Jinn and his new protege, Anakin Skywalker. Maul leaped from his speeder and clashed with the Jedi. It was only through extreme concentration that Qui-Gon could defend himself against Maul's heavy attacks. As he fended a blow from the Sith, Qui-Gon told a puzzled Anakin to leave and tell the Naboo pilot to take off. While he was driven back, Skywalker boarded the Royal cruiser and did as Jinn said. Maul attempted to take Jinn by leaping over him, but Jinn blocked the strike to his back and jumped on the ramp. Now saved from the clutches of the Sith, the Queen and her entourage departed Tatooine for Coruscant. Down in the cruiser's boarding ramp, Jinn expressed his worries and introduced Skywalker to his future master."}, {"tag": "h3", "text": "Amidala before the Senate"}, {"tag": "p", "text": "After the duel on Tatooine, the Jedi and Queen Amidala arrived on Coruscant. They were met on the landing platform by Senator Palpatine and Supreme Chancellor Finis Valorum. Palpatine brought them to his apartment."}, {"tag": "p", "text": "While in the apartment, Palpatine explained to the Queen how corrupt and inefficient the Republic had become and expressed scepticism about the possibility that the Senate could act on the invasion; he also underlined the fact that Chancellor Valorum had little real power and that the bureaucrats were in fact the true rulers of the Republic by that point. Given the situation, Palpatine suggested that the Queen called a vote of no confidence on the Chancellor, in order to give the Republic a more effective government; or, in alternative, to submit a plea to the Galactic Courts of Justice."}, {"tag": "p", "text": "Jinn, Kenobi, and Skywalker appeared before the Jedi Council. Jinn reported his encounter with Maul, leaving the Council to consider the possibility that the Sith had returned after a thousand years. Skywalker was tested by the members of the Council, who recognized the boy to be a Force-sensitive, but expressed concern about young Skywalker's feelings of fear and loss."}, {"tag": "p", "text": "In a special meeting of the Galactic Senate, Palpatine and Amidala spoke before the thousands of Galactic delegates. Their pleas were instantly accused of being lies and baseless accusations by the Senator of the Trade Federation, Lott Dod, who recommended appointing a commission to ascertain the truth; Dos's proposal was almost immediately supported by senator Aks Moe of Malastare. Valorum tried to silence Dod and Moe, but he was interrupted by Vice Chancellor Mas Amedda; after consulting with Amedda and his aide Sei Taria, Valorum asked Amidala if she would defer her motion and allow the commission to proceed. The Queen responded by saying that she would not defer and that she had not been elected to see her people suffer and die while the Senate discussed the invasion in a committee."}, {"tag": "p", "text": "Exasperated by the Republic's inefficiency and corruption, Amidala shocked the Senate by moving for a vote of no confidence in the leadership of Chancellor Valorum, as it had been suggested to her by Palpatine himself. The proposal caused an uproar in the Senate, with many senators calling to proceed to the vote immediately, while Amedda vainly called for order."}, {"tag": "p", "text": "Within hours, Amidala's motion of no confidence was passed and Valorum removed from power. Palpatine was nominated as one of the candidates to succeed Valorum and promised Queen Amidala to clean up the rampant corruption; Bail Antilles and Ainlee Teem were nominated as well."}, {"tag": "p", "text": "Against Palpatine's suggestions, Amidala returned to Naboo, deciding that her fate belonged with that of her people. Soon after that, Qui-Gon Jin and Obi-Wan Kenobi met again with the Jedi Council: the Council denied admittance to Anakin in the Jedi Order, citing his advanced age as the deciding factor, and ordered Kenobi and Jinn to return to Naboo with the Queen and find out what they could about her mysterious assailant to bring the existence of the Sith into light."}, {"tag": "h3", "text": "The battle for freedom"}, {"tag": "p", "text": "Upon their arrival back on Naboo, Amidala and the Jedi formulated a plan to capture Viceroy Gunray in Theed, thus taking back the planet. With the aid of Jar Jar Binks, an alliance was formed with the proud Boss Nass and the Gungans, and Captain Panaka organized together all Resistance cells."}, {"tag": "p", "text": "The plan was for the Gungan Grand Army to engage the Droid Army of the Federation in open combat while the Queen and the Jedi quietly infiltrate the palace in Theed with the remainder of the Royal Security forces to capture the Viceroy. The small number of pilots in the Naboo security forces would then fly into space and attempt to destroy the only battleship still in orbit: the Droid Control Ship, where all the battle droids were controlled from a single computer brain."}, {"tag": "p", "text": "The plan began as intended, but the entire dynamic of the situation changed with the arrival of Darth Maul. The two Jedi engaged the Sith Lord in battle while the queen led a raid into the throne room. Soon after, Amidala and her Security Captain Panaka successfully captured both Gunray and Rune Haako. Maul led Jinn and Kenobi through the hangar and into Theed's power generator complex, where Maul managed to kick Kenobi, who fell several stories below. Jinn was then able to knock Maul back. Jinn jumped down after him, but the Sith Lord managed to get up. They moved down the catwalk near the refinery."}, {"tag": "p", "text": "Meanwhile, Kenobi was able to jump up on the catwalk Jinn and Maul were on, and ran to help Jinn. But Jinn, Kenobi and Maul were stuck behind the laser shields, each cut off from the other. Maul waited impatiently looking in mocking contempt at Jinn, who was calmly meditating, possibly as an attempt to strike the Sith Lord off-guard. The walls shut down, Kenobi ran, and Jinn jumped up and battled Maul once again. At the melting pit, Maul battled the Jedi and mortally wounded Jinn. He then had to face Kenobi. The wall once again shut down and Kenobi was left to face Maul, alone. Maul managed to kick Kenobi into the pit, but Kenobi grabbed hold onto a nozzle which was jutting out a little below Maul. The Sith Lord then kicked Kenobi's lightsaber into the bottomless shaft, past the still hanging Jedi. Calling his Master's lightsaber to him, Kenobi jumped and cut through the Sith Lord's waist. Maul then fell into the shaft, presumed dead. Kenobi joined his dying Master who, in his final words, told him to train Skywalker, the fabled \"Chosen One\" destined to bring balance to the force. Jinn died in a distraught Kenobi's arms. With Maul presumed dead, Amidala's assassination failed, but the Droid Army, however, was still active, until the Droid Control Ship was miraculously destroyed by an unexpected participant in the day's events: young Anakin Skywalker. The destruction of the control ship shut down every Federation droid, with even OOM-9 being temporarily inactive."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "h3", "text": "Effect on Naboo"}, {"tag": "p", "text": "With the defeat of the Trade Federation and the deactivation of its mechanical army, the invasion was over. Peace and order were restored, as were positive relations between the Gungans and the people of Naboo. Soon after, Palpatine, who had been elected as new Supreme Chancellor in the meantime, arrived on Naboo with members of the Jedi High Council to oversee the arrest of Gunray and Haako. Yoda promoted Kenobi to full Jedi Knight and assigned him to train Skywalker. That evening, Qui-Gon was given a Jedi funeral. The Council members believed that Kenobi had destroyed Darth Maul, but he had in fact survived and went into exile. The day after, the Gungans and Naboo celebrated with a parade in Theed, complete with overflights by N-1 starfighters of Bravo Flight. Amidala and Boss Nass shared a symbolic globe as a Gungan band played music."}, {"tag": "p", "text": "In honor of the five hundred forty-three Gungans who had been killed in the battle at the Great Grass Plains, Nass and Amidala vowed  to work together, hoping for a new era made up of cooperation and openness, and forged a Naboo—Gungan pact. The subsequent treaty had immediate benefits, providing low-cost medicinal herbs to Theed, mechanical parts used in seawater pumps to Otoh Gunga's engineers, and new trade lines. Even though some Gungans went as far as to relocate to the surface settlements in order to sell their products, the planet's old sentiments made it so the exchange between both civilizations had all but ceased in quiet within a year of the invasion. Nevertheless, relations remained friendly into the Clone Wars, with Battle of Naboo veteran Roos Tarpals strongly believing in friendship between the Gungan and Naboo civilizations."}, {"tag": "h3", "text": "Galactic consequences"}, {"tag": "p", "text": "The Federation and Valorum were faced with most blame for the invasion, and every subsequent anti-Republic speech called out the \"debacle at Naboo.\" Following the invasion, the Federation's monopoly on shipping in the Outer Rim Territories was broken. This, combined with Valorum Shipping's loss of prestige due to scandals and Chancellor Valorum's truncated term, allowed Eriadu Mining and Shipping to prosper. Palpatine had also promised to bring Gunray and his lieutenants to justice and end the corruption of the Senate. However, while Gunray was indicted for his crimes in the Republic Courts, he, after four trials, was eventually acquitted by the Supreme Court and was thus able to retain his assets and titles, also maintaining his position as Viceroy of the Trade Federation. A short time prior to his final trial, Amidala's term as Queen expired. Although the Naboo people were willing to amend the Constitution, Amidala stepped down and former Queen Réillata was elected her successor. The new Queen offered Amidala a position as Senator to replace the outgoing Oshadam, which she accepted. Eventually, Count Dooku was apprenticed to Darth Sidious, but became the public face of the Separatist Crisis. Gunray continued to despise Amidala for her part in his defeat and sought revenge against her."}, {"tag": "p", "text": "The ascension of Palpatine to the post of Supreme Chancellor was part of his grand scheme to put himself in total control of the galaxy. Thanks to the invasion, three major flaws in the Republic government—the lack of an official military, the weak central authority, and layers of bureaucracy—were all exposed on the full galactic stage, but Palpatine was gifted a reputation of being a crusader for reforms to the Republic government. Although Maul was believed to have died, he had in fact survived, but was crippled, and ended up going into hiding until he was found by his brother, Savage Opress. During all those years, Maul grew obsessed with the concept of having revenge on Kenobi, blaming the Jedi Padawan for his misfortune."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Invasion of Naboo first appeared in the 1999 film Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}