{"url": "Invasion_of_Mon_Cala", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Battles of Dac", "Category:Battles of the Great Jedi Purge", "Category:Duels", "Category:Early rebellion against the Galactic Empire campaigns", "Category:Evacuations", "Category:Invasions"], "nodes": [{"tag": "h1", "text": "Invasion of Mon Cala"}, {"tag": "p", "text": "The invasion of Mon Cala began after the former Jedi Padawan Ferren Barr began influencing the King of the planet Mon Cala, Lee-Char, in negotiations with the Galactic Empire. When the Galactic Emperor Sheev Palpatine recognized these negotiation techniques, he sent his Sith apprentice Darth Vader with three Inquisitors and some Purge Troopers to investigate this possible Jedi."}, {"tag": "p", "text": "Shortly after Vader's arrival, an Imperial Ambassador was assassinated by Barr and so Moff Wilhuff Tarkin, aboard the Imperial I-class Star Destroyer Sovereign his superiors sent forces down to invade Mon Cala. During the initial battle at Dac City, Vader and his troops captured and interrogated Lee-Char. However, they were interrupted by a tsunami created by a school of large fish-like creatures which wiped out the Imperial forces on the surface of Mon Cala."}, {"tag": "p", "text": "While Vader and his Inquisitors regrouped, the Imperial Colonel Bergon was fighting in Mon Cala's northern regions aboard an aerial landing platform. The Mon Calamari Gial Ackbar led an assault on the platform and destroyed it with Bergon aboard. Around the same time, in the southern regions, the Mon Calamari Admiral Raddus interlinked the shields of merchant ships from the Mon Cala Mercantile Fleet to combat Imperial forces, something which Tarkin commended."}, {"tag": "p", "text": "Shortly after, Vader and his group attacked Barr and his disciples and pursued them to the underwater settlement Bel City. While Vader was redirected by Tarkin to track down Lee-Char, the Inquisitors and the Purge troopers cornered Barr and his last remaining disciple. Barr, though, used a mind trick to turn the Purge troopers against the Inquisitors, allowing the Padawan to escape."}, {"tag": "p", "text": "Vader went to capture Lee-Char and showed him as Tarkin began an orbital bombardment of Mon Cala. Barr soon arrived and fought Vader. When Barr revealed he'd deliberately kick-started the war, Lee-Char panicked and ordered a cease-fire of his forces, although Tarkin continued it for a while. Vader then killed Barr and arrested Lee-Char. At the same time, Raddus escaped with a handful of his merchant ships."}, {"tag": "p", "text": "After being arrested, Lee-Char was imprisoned on Strokill Prime. The Empire proceeded to subjugate Mon Cala. The Mon Calamari, however, launched a mass exodus aboard spaceworthy structures disguised as city buildings. The Mon Calamari became one of the key species of the Alliance to Restore the Republic, supplying capital ships to their fleet, which were converted for war by rebels in the Telaris system."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "At the end of the Clone Wars, the Jedi were almost completely wiped out by the clones of the Grand Army of the Republic. Coinciding with their destruction came the reorganisation of the Galactic Republic into the Galactic Empire by the new Emperor, Sheev Palpatine. To ensure that all of the Jedi were dead and Palpatine founded the Inquisitorius, a group of former Jedi who were tasked with hunting their former brethren. At the head of the group was Darth Vader, a Sith Lord, apprentice to Palpatine and formally the Jedi Knight Anakin Skywalker."}, {"tag": "p", "text": "Among the few Jedi survivors was the Iktotchi Padawan Ferren Barr, who began investigating the reason for the swift defeat of the Jedi and learned of Skywalker's involvement and the conspiracy of Order 66. Angered by this, he decided to take action against the Empire. Barr took on six disciples. Although the first five—Nipaltoo, Orvek, Rebb, Stell and Daren— were swayed to pursue revenge against the Empire, the sixth, Verla was force-sensitive and so Barr swore to teach her. Barr took the six of them to Mon Cala, where he conspired with the King, Lee-Char."}, {"tag": "h2", "text": "The invasion"}, {"tag": "h3", "text": "Invasion preparations"}, {"tag": "p", "text": "By 18 BBY, Barr and his disciples were on the ocean planet Mon Cala, hidden away in a cave refuge. Barr began influencing the negotiations between the Mon Cala and the Empire. This caught the attention of Palpatine, who suspected the negotiating to be of Jedi technique. Being just one year into the Empire's reign, Palpatine wanted to show the galaxy his iron fist and decided that silencing Mon Cala's defiance would make it a great example for this. Palpatine told Darth Vader to investigate the possible Jedi presence on Mon Cala and left the military aspects to Moff Wilhuff Tarkin, who parked his Imperial-class Star Destroyer, the Sovereign, above Mon Cala."}, {"tag": "p", "text": "Aboard the Sovereign Tarkin briefed his top military officers on how they would invade Mon Cala if one became necessary to them. He then discussed the readiness of Major Rantu's troops and a possible military opportunities for their invasion with Commander Jordo. Colonel Bergon argued that an orbital bombardment would be more efficient, but Tarkin informed her that the power of the Empire was from what it controlled and not what it destroyed. Meanwhile, on Mon Cala, the Imperial ambassador Telvar was negotiating with Lee-Char and his subjects. When asked the king if Mon Cala wished to remain in the Empire, Lee-Char argued that his proposed trade deal would allow the Empire to strip the planet of its exports. Telvar replied that the Empire protected Mon Cala but Lee-Char pointed out that there was nothing to protect his people from."}, {"tag": "p", "text": "Vader arrived at Dac City with three Inquisitors—the Sixth Brother, Ninth Sister and Tenth Brother—and fourteen Purge Troopers. Upon their arrival, Lee-Char's Chief of Security, Gial Ackbar, confronted Vader's team, asking of their business. While Ackbar went back and forth with, Ambassador Telvar was leaving from another unsuccessful negotiation with the king. Barr sabotaged his shuttle and it exploded in front of Vader and Ackbar, killing Telvar and the rest of his crew."}, {"tag": "h3", "text": "Battle of Dac City"}, {"tag": "p", "text": "As a response to Telvar's assassination, Moff Tarkin sent his forces down to Mon Cala to invade Dac City and the other surface settlements. Lee-Char warned Barr of this. When he described Vader, Barr immediately called him by his former name, Anakin Skywalker. Vader and his group turned on the Mon Calamari and began fighting them on the landing pad, soon liberating it from the defending Mon Calamari and Quarren. The Ninth Sister asked Vader where they were going next and Vader directed the three towards the palace. Inside the palace, Lee-Char assigned Ackbar and Raddus to the defense of each hemisphere and they left the king to do their duties. Lee-Char then attempted to negotiate a ceasefire with Tarkin, but the man refused, stating that the fact an Imperial asset had been killed in the hands of the Mon Calamari meant that Lee-Char had to stand down first."}, {"tag": "p", "text": "At the same time, Barr announced the arrival of \"Anakin Skywalker\" to his disciples. Barr claimed he was at the center of Order 66, the Chosen One. Barr had his R1-series astromech droid Endee show a file on Skywalker and showed his disciples what he knew of the man, eventually presenting the image of Skywalker leading the Siege of the Jedi Temple. Barr told the disciples that Skywalker was a pivotal aspect of Order 66, being responsible for the deaths of many young Jedi. Furthermore, Barr explained that Skywalker now took the name Darth Vader and how he hunted the surviving Jedi with the Inquisitors. After this, Barr contacted Lee-Char, who asked him of whether they should give in to Tarkin's demands. Barr claimed the Empire would never leave and told him to take drastic action."}, {"tag": "p", "text": "Vader and the Inquisitors arrived inside the palace and the Ninth Sister began interrogating Lee-Char for the location of Barr. But Lee-Char had already organized for a school of large creatures to wreck havoc on the Imperial forces. The creatures did so and generated waves so large, they wiped the Imperial forces off the surface of Mon Cala as well as the surface settlements they were attacking. Although the Ninth Sister managed to obtain the location of Barr from Lee-Char, she, Vader and the others were swept away as well."}, {"tag": "h3", "text": "The next wave"}, {"tag": "p", "text": "Aboard the Sovereign, Bergon was surprised that the Mon Calamari had sacrificed their surface settlements. Tarkin reminded her that they had a thousand times as many underwater settlements. He left Bergon in charge of the next wave as Rantu, who had been at Dac City, was assumed lost. With no surface settlements to use as staging grounds, Bergon concluded that she would use aerial landing platforms. Tarkin further had Jordo double his efforts on predicting the tactics of the Mon Calamari."}, {"tag": "p", "text": "Vader awoke to find himself in the Great Ungeness Trench under Mon Cala's vast oceans. There he saved himself from the ocean by making himself an air bubble with the force. Vader was then attacked by a squid-like creature which he killed by using the force. Vader was then picked up by the Inquisitors in an Imperial submarine. All but two Purge troopers in Vader's group had all survived the waves, and Ninth Sister told Vader of Barr's location, to which they traveled towards. Lee-Char was rescued by his subordinates and tended to at a hospital bed."}, {"tag": "p", "text": "Colonel Bergon began fighting above Mon Cala on her aerial landing platform. Her campaign, however, was cut short when Ackbar attacked her base with over half a dozen aquatic vehicles. They emerged from under Bergon's sky-base and fired their missiles at it. Before Bergon could respond, she was incinerated as her platform exploded. By this time, the Sovereign had been joined by two more Star Destroyers above Mon Cala. Tarkin was soon informed of Bergon's demise and was unhappy with Commander Jordo for not alerting them to the Mon Calamari's vehicles. He had Jordo put into stormtrooper armor and sent down to Mon Cala."}, {"tag": "h3", "text": "Ensuing conflict"}, {"tag": "p", "text": "Upon waking up, Lee-Char realized Barr's location was in peril and immediately contacted him. Barr was shocked and told his disciples to prepare to leave. As they all equipped underwater gear, Barr wiped Endee and set him to self-destruct. Endee blew up the refuge once they left on their aquatic machines. However, upon leaving the refuge, the disciples were cut off by Vader's submarine. Nipaltoo attacked Vader's submarine but Vader crushed his helmet, killing him. The others made towards Bel City, and Orvek turned around to slow Vader down. Eventually they made it to Bel City and Rebb decided to stay behind in order to slow Vader down even more. Stell pledged to stay with her, and Barr and his final two disciples made for a landing pad."}, {"tag": "p", "text": "Back on the Sovereign, Tarkin received word from his Lieutenant that the Imperial forces were succeeding in their engagements below. However Tarkin was worried that there were too many engagements. He had noticed that the Mon Calamari and Quarren defenders were either holing up in their underwater cities and forcing the Imperial forces to fight them corridor to corridor in unfamiliar territory; or were scattering to the far reaches of the oceans in order for the Imperial forces to split up to hunt them down, requiring constant resupply. As Tarkin explained this to his Lieutenant, Raddus emerged from hiding with his own strategy. Raddus had taken vessels from the Mon Cala Mercantile Fleet and linked them together. With their strong shields combined, the five Star Cruisers and the many smaller ships connected to them generated a protective bubble around them able to repel the Imperial forces without receiving a single dent. Tarkin considered it a fortress."}, {"tag": "h3", "text": "Pursuit in Bel City"}, {"tag": "p", "text": "Vader and the Inquisitors reached Bel City and marched through it with the Purge troopers at their rear. Vader was then contacted by Tarkin who wanted him to capture Lee-Char and end the fighting on Mon Cala. Vader refused at first but Tarkin insisted, telling Vader that he would owe him a favor if he did so. Vader complied and left the Inquisitors to lead the hunt for Barr. Barr and his last two acolytes reach a landing pad to find it empty. As Barr stressed about their situation, the Inquisitors had already found them. Sixth Brother threw his lightsaber and cut Daren in half. They then cornered Barr and Verla. Verla attempted to confront the Inquisitors but Barr already had a plan stepped in first, dropped his lightsaber to the floor."}, {"tag": "p", "text": "In a following exchange of words, Barr used his knowledge of the Inquisitors' past to claim that they were still truly Jedi, despite their protest at this. Barr recognized the clones had not yet had their inhibitor chips activated. Using that to his advantage, Barr used a mind trick on the troopers telling them to \"execute order 66\"."}, {"tag": "p", "text": "The Purge troopers' inhibitor chips forced them to comply as the Inquisitors were indeed former Jedi. The troopers opened fire, shooting down the Tenth Brother in the process. Barr and Verla took advantage of the fighting and they leapt over the firefight, landing and escaping on the other side. As the two sprinted down the hallway, Barr parted with Verla, telling her to leave Mon Cala and find another surviving Jedi. The Sixth Brother and Ninth Sister force pushed the other troopers to the side to make way for them. The Sixth Brother then cut off Ninth Sister's leg, leaving her to fend off the final troopers for him."}, {"tag": "h3", "text": "Final actions"}, {"tag": "p", "text": "Vader arrived at Lee-Char's command bunker and quickly dispatched the Mon Calamari guards before disarming Lee-Char. Tarkin, who was in contact with Vader, then ordered him to bring Lee-Char to a window. Vader did so and Lee-Char watched as the three orbiting Star destroyers began bombarding the northern hemisphere of Mon Cala. They interrupted by Barr, who confronted Vader with the intention of fighting him. Meanwhile, Raddus had received word of the bombardment as a fifth settlement, Zeran Town, on Mon Cala's northern hemisphere had been destroyed. Raddus's commander assured him the Star Destroyers were not yet targeting the southern hemisphere and Raddus told him they were to keep fighting."}, {"tag": "p", "text": "Barr and Vader fought each other while Barr taunted Vader with his success over the Inquisitors and his assassination of Telvar to start the war on Mon Cala. Lee-Char heard Barr's words and realized that the Jedi had caused the fighting on Mon Cala. Without hesitation, Lee-Char ordered a planet-wide ceasefire of all Mon Cala forces. Lee-Char then contacted Tarkin saying he was ready to talk terms if Tarkin stopped the bombardment. Tarkin accepted the surrender but continued the bombardment. The Star Destroyers now began hitting targets in the southern hemisphere, forcing Raddus to take action and order his vessels to launch."}, {"tag": "p", "text": "Vader and Barr continued to fight and Barr began laughing. Lee-Char recalled one of Barr's prophesies in shame. Barr told Lee-Char that he wasn't wrong about that and explained that the Mon Calamari vessels would be at the forefront of a great rebellion. At the same time, Raddus's ships disconnected their shields and charged for the blockade over Mon Cala. As they flew past the three Star Destroyers, two of the MC80 cruisers were destroyed. Tarkin let the final three go assuming they would be found eventually."}, {"tag": "p", "text": "Vader eventually defeated and slew Barr in front of Lee-Char, leaving him sprawled face down on the floor as the clones arrived to arrest Lee-Char. Lee-Char told Vader that Mon Cala would rise again before he was taken away. Vader told Lee-Char that there was no Mon Cala and he escorted Lee-Char back into the shuttle where they left Mon Cala."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Lee-Char was imprisoned on Strokill Prime following his arrest. The Empire began subjugating Mon Cala. However, the peaceful Mon Calamari, having learned harsh and costly lessons during the Clone Wars, were ready. The Imperial occupation heralded a mass exodus, triggering a launch of spaceworthy structures that the Empire mistook for city buildings, which disappeared into hyperspace. In retaliation, the Mon Calamari became one of the key species of the Alliance to Restore the Republic, supplying capital ships to the Alliance Fleet, despite its limited effectiveness against the occupation, which were converted for war by rebels in deep-space facilities located in the remote Telaris system, far from Imperial naval patrols."}, {"tag": "p", "text": "Raddus and Ackbar became Admirals in the Alliance's fleet. Raddus eventually led the Alliance fleet's first victory at Scarif, where he was killed. Ackbar tried to convince Mon Cala's regent, Urtya, help the Alliance. Urtya refused, fearing the safety of the Mon Calamari. Ackbar's operatives took matters into their own hands and tried to break Lee-Char out of prison. They found him barely alive and on life support. They recorded a message from him to his people and stormtroopers intervened, killing Lee-Char. After his death, Lee-Char's message was broadcasted to the Mercantile Fleet and they orchestrated a mass mutiny. These ships made it to the Alliance to be converted to war."}, {"tag": "p", "text": "Ackbar eventually led the Alliance fleet into a battle that saw not only a victory but the deaths of Emperor Palpatine, Darth Vader and the beginning of the end for the Empire. At least thirteen Mon Calamari vessels participated in the battle, leading the charge as Barr also foresaw. The Empire fell a year later and the galaxy became free under the rule of the New Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The invasion of Mon Cala was first mentioned, albeit unidentified, in the new Star Wars canon in the Mon Calamari's entry in the now-discontinued Encyclopedia on StarWars.com, which was carried over to its replacement, the Databank. It was first identified in the novelization of Rogue One: A Star Wars Story, written by Alexander Freed and released on December 16, 2016. The event was originally created for The Star Wars Sourcebook, a Star Wars Legends sourcebook written by Bill Slavicsek and Curtis Smith for Star Wars: The Roleplaying Game and released on October 1, 1987."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}