{"url": "Invasion_of_Sriluur_(Yuuzhan_Vong_War)", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Periphery", "Category:Battles of the Yuuzhan Vong War"], "nodes": [{"tag": "h1", "text": "Invasion of Sriluur  (Yuuzhan Vong War)"}, {"tag": "p", "text": "In 26 ABY, during the Yuuzhan Vong War, the Yuuzhan Vong invaders invaded the planet Sriluur."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "When the Yuuzhan Vong War erupted, it was not long before Yuuzhan Vong coralskippers were spotted near Sriluur, in Outer Rim's Si'Klaata Cluster. This led to a mass exodus of people who feared an imminent invasion of the planet. Many Weequay clans chose to stay behind and form militias to fight for their world. The Yuuzhan Vong-aligned Peace Brigade infiltrated Sriluur, harassing its inhabitants and attempting to clear the world of technology in preparation for the Yuuzhan Vong invasion."}, {"tag": "h2", "text": "The invasion"}, {"tag": "p", "text": "When the Yuuzhan Vong finally began, a group of spacers encountered the Black Sun member Falloon while they were trying to leave the planet. They agreed to help him and his droid 9T-LOM to reach his ship and escape the planet together. They fought Peace Brigade goons and Chazrach in the streets of Meirm City to find the spaceport already invaded by Yuuzhan Vong warriors. After a lightfight, they managed to get on Falloon's yacht, the Gilded Thranta. As they entered the upper atmosphere, the ship was attacked by coralskippers. Fortunately for the spacers, the Gilded Thranta was modified with powerful weaponry and was able to resist the fighters assault until they entered hyperspace."}, {"tag": "p", "text": "Elsewhere on Sriluur, the low defense put up by the natives was quickly overrun. The entire planet was conquered in a matter of days, and its inhabitants were enslaved to serve the occupation force. Many fleeing transports were destroyed above the planet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the conquest of Sriluur and the Si'Klaata Cluster, the Yuuzhan Vong began the invasion of Hutt Space with an attack on the Cyborrea system."}, {"tag": "p", "text": "Even though their homeworld was terraformed by the occupants, the Weequay adapted and continued to live on Sriluur after the war ended."}, {"tag": "p", "text": "Falloon and the spacers left Sriluur to Coruscant. He later reveled to them he was in fact the chief accountant for the Black Sun in this sector and his droid contained centuries' worth of financial records of the criminal organization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}