{"url": "Invasion_of_the_Tython_system", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Tython system", "Category:Conflicts involving the Infinite Empire", "Category:Conflicts involving the Je'daii Order", "Category:Pre-Republic events and conflicts"], "nodes": [{"tag": "h1", "text": "Invasion of the Tython system"}, {"tag": "p", "text": "In 25,793 BBY, the Infinite Empire of the Rakata species invaded the Tython system. Under the command of Predor Skal'nas, who sought the Infinity Gate rumored to be located on the planet Tython, the Infinite Empire laid waste to the Settled Worlds, but met resistance in the allied Je'daii Order and the forces of the Settled Worlds."}, {"tag": "h2", "text": "The invasion"}, {"tag": "p", "text": "In 25,793 BBY, the forces of the Rakatan Infinite Empire invaded the Tython system. Skal'nas sought to reverse his species's gradual loss of control over the Force by acquiring the Infinity Gate said to exist on the planet Tython, and his forces attacked the space station Fury Station on the edges of the system before capturing both of the gas giants Obri and Mawr. The Rakata and their Flesh Raider soldiers attacked Tython, but were repelled by the Je'daii Order; the Infinite Empire fell back to the forest world of Ska Gora and conquered it before establishing their main command post there. By the end of the first year, the Je'daii had allied themselves with the forces of the Settled Worlds, placing Je'daii Master Rajivari in command of the joint forces. The Order also constructed Forcesabers, the dark side weapons of the Rakata, and armed themselves with the weapons as they recalled the insane Daegen Lok to lead them in battle as Lok had foreseen. Ultimately the War ended in a Je'daii victory; with Skal'nas's fall most of the Rakata turned on each other and fled, leaving behind a large degree of slaves."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}