{"url": "Invasion_of_Yavin_4", "categories": ["Category:Legends articles", "Category:Battles of Yavin", "Category:Battles of the Yuuzhan Vong War", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Invasion of Yavin 4"}, {"tag": "p", "text": "The Battle of the Jedi Praxeum took place at the Jedi Praxeum on Yavin 4 during the Yuuzhan Vong War in 26 ABY. The Yuuzhan Vong and Ylesian Republic conquest of the jungle moon was partially due to the fact that the New Republic was unwilling to provide aid for the New Jedi Order. The battle was divided into two phases: the initial Peace Brigade attack, and the subsequent attempts to recover the Jedi who remained trapped on the jungle moon as the Yuuzhan Vong consolidated their presence in the system."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Following his humiliating defeat at the hands of Jedi Knight Jacen Solo during the assault on Duro, Warmaster Tsavong Lah called for the lives of every Jedi alive. Any world which gave a Jedi refuge would be targeted for attack. But, he suggested, worlds and groups who cooperated with the invaders in eliminating the Jedi would be spared."}, {"tag": "p", "text": "Many in the New Republic obeyed his call. Some genuinely believed that they could secure peace with the Yuuzhan Vong, or else that it was a choice between defeat and cooperation. Others blamed the Jedi for provoking the war. Some were simply in it for the credits. The situation also fuelled recruitment for the Peace Brigade paramilitary organization created by Nom Anor, who obtained an extensive list of Jedi from highly-placed sympathizers."}, {"tag": "p", "text": "Dorsk 82 was slain by a mob on Ando and Swilja Fenn was captured by the Peace Brigade on Cujicor, while Cheklev narrowly escaped when the planetary government on Devaron handed him over to the invaders. Even non-Force-sensitive Academy tagalong Uldir Lochett, now flying for the Space Rescue Corps, was almost killed by his own copilot."}, {"tag": "p", "text": "One particularly vulnerable target was the Jedi Praxeum, which now lay some distance beyond the space under effective New Republic control. With the Jedi Knights scattered across the Galaxy, only a handful of adult Jedi remained to protect the young Jedi trainees, and there was some concern as to whether the Fallanassi illusion which was the Academy's primary defense would remain effective against the nulling effect that the Yuuzhan Vong had in the Force. Thrackan Sal-Solo, attempting to save the Corellian sector from attack, informed the Yuuzhan Vong as to the Academy's location."}, {"tag": "p", "text": "On Coruscant, Jedi Master Luke Skywalker realized the danger, but the New Republic stalled on sending a ship to evacuate the children, and although he also made efforts to locate Booster Terrik in the hope that his Star Destroyer, the Errant Venture, would be able to pull them off, he had little progress in tracking him down."}, {"tag": "p", "text": "At this point, Jedi Apprentice Anakin Solo approached his uncle. Although he often refused to admit it, the young Jedi was growing troubled by Luke's limitations and failures of judgment, and he was now being haunted by nightmares of his childhood friend Tahiri Veila, who had remained at the Academy. Luke's wife Mara suggested that she contact her former boss Talon Karrde, a smuggler turned information broker who still controlled a sizeable and well-armed fleet, and who could rescue the students. Luke agreed, and explicitly forbade Anakin to do anything rash—but his nephew was certain that Karrde would be too late, and mounted a one-man rescue mission."}, {"tag": "h2", "text": "Peace Brigade raid"}, {"tag": "p", "text": "Using slicing tricks taught to him by Mara, Anakin sneaked out through Coruscant's security perimeter aboard his XJ X-wing Starfighter with his astromech Fiver. On arriving in the Yavin system, he discovered the presence of a Corellian light freighter in orbit around Yavin 4, scouting the place out. Although the ship initially claimed to be a corusca gem prospector, a heavily-armed flotilla of twelve more ships now dropped into the system, including several starfighters and corvettes and a frigate. Anakin realized that his worst fears had been correct: the Peace Brigade had arrived in strength."}, {"tag": "p", "text": "Anakin managed to fight his way past the Brigaders, and landed at the Great Temple, where he found that Streen and Peckhum had taken the Academy's only hyperspace-capable transport on a supply run to Corellia, leaving only Kam and Tionne Solusar and his own former Kushiban mentor Ikrit guarding the Jedi children. While Kam and Tionne took the children to hide the passageways and caves that spread beneath the Temple area and the surrounding river land, Ikrit and Anakin remained at the Academy to create a diversion against the Brigade assault—five ships full of troops, led by Lieutenant Kot Murno. However, Anakin was appalled to discover that Tahiri Veila had also remained in the Temple, along with fellow students Valin Horn and Sannah, naively determined to help fight off the attack."}, {"tag": "p", "text": "Meanwhile, Talon Karrde arrived in the system with the Wild Karrde to find the other seven ships of the Peace Brigade squadron in orbit around the planet. A tense standoff ensued, but while Captain Imsatad, the ex-Imperial commander of the Brigader force, distrusted the former smuggler, Karrde was able to tempt him with an offer vornskrs and ysalamiri to track down the Jedi. This proved too much for Imsatad to resist, but although he attempted to control the situation to his advantage, Karrde successfully double-crossed the Brigaders and rescued Kam, Tionne and the Jedi children who had been hiding with them."}, {"tag": "p", "text": "Moreover, as the Wild Karrde ran the blockade, the rest of Karrde's fleet arrived, turning the tables on the Brigaders—but then a point a powerful Yuuzhan Vong task force showed up, led by two Miid ro'ik warships. Karrde quickly dispatched the Jedi children to the relative safety of Coruscant in the care of his partner Shada D'ukal, while he himself remained on the edge of the system with most of his ships, in the hope that the Jedi remaining on the planet would also be able to escape."}, {"tag": "p", "text": "On the surface, Anakin managed to hijack a Peace Brigade light freighter piloted by Remis Vehn, but Ikrit was slain covering the escape, and Tahiri was taken prisoner. Anakin, with Valin, Sannah and the captive Ven, fled with three of the smaller Peace Brigade ships in pursuit, but although they were able to take out their pursuers, the damaged freighter was itself shot down and crashed deep in the jungle. Anakin began to lead a salvage mission to repair the ship so they could flee the planet."}, {"tag": "h2", "text": "Standoff and Anakin's rescue mission"}, {"tag": "p", "text": "Days passed, and the standoff above Yavin 4 continued between Karrde and the invading forces, while Tahiri languished in Peace Brigade captivity. In the jungle, Anakin worked to repair the freighter, and also to improvise a repulsorsled out of a crashed E-wing: he was determined to go back for his friend, as he had promised her. A week passed, and he dreamed of her again, now seeing her shaped and turned to the dark side by the Yuuzhan Vong."}, {"tag": "p", "text": "At this point, the young Jedi was joined by Fiver with his damaged X-wing, and also by the ex-Imperial pilot Qorl, who had been living on Yavin 4 for many years as a hermit, and who brought him news of the arrival of the Yuuzhan Vong. Anakin asked the old TIE pilot to take charge of the others, and left them to repair the damaged freighter, while he himself set out to rescue his friend."}, {"tag": "p", "text": "At around the same time, a senior Yuuzhan Vong officer, Commander Tsaak Vootuh arrived on Yavin 4. It is not clear whether the initial Yuuzhan Vong task force of a week before had come to raid the Academy, or, as they claimed to the New Republic, simply to tap water from Stroiketcy, but now they had resolved to hold and garrison the jungle moon, take possession of any Jeedai they could find, and establish a damutek colony for the Shapers. Tsaak Vootuh had Imsatad executed, and took Tahiri into his own custody, while his warriors rounded up the other Brigaders for interrogation and ritual execution."}, {"tag": "p", "text": "A fortnight later, Master Shaper Mezhan Kwaad arrived on Yavin 4. A secret heretic answering directly to the Supreme Overlord, she and her apprentice Nen Yim claimed Tahiri as a specimen for their experiments. Their aim was to physically and psychologically transform her into a Force-sensitive Yuuzhan Vong, replacing her personality with a new identity named Riina Kwaad, based on memories copied from Nen Yim's own childhood."}, {"tag": "p", "text": "Meanwhile, Anakin journeyed through the jungle, occasionally evading Yuuzhan Vong patrols. He discovered that the damuteks had flattened the Great Temple, and encountered a Yuuzhan Vong outcast named Vua Rapuung. Once a renowned Warrior, he had been the lover of Mezhan Kwaad, but when he decided to break off the affair, she had infected him with a virus that caused his body to reject his ritual implants, making him seem to be a Shamed One. Rapuung, however, knew that Kwaad was responsible, and believed that Anakin could help him vindicate his honor."}, {"tag": "p", "text": "Weeks more passed, while Tahiri's brainwashing continued, and Anakin, disguised as a slave, infiltrated the Yuuzhan Vong colony and repaired his lightsaber. Together with Vua Rapuung, he broke into the damutek where Tahiri had been shaped, but even as they made their way towards the heart of the Shaper facility, Mezhan Kwaad was being apprehended by Tsaak Vootuh on a charge of heresy. Anakin arrived just in time to see the commander and his personal guard leading away the captive Shapers, accompanied by the brainwashed girl who now believed herself to be Riina Kwaad."}, {"tag": "h2", "text": "Escape"}, {"tag": "p", "text": "Anakin and Vua fought their way across the compound, to where Tahiri and the prisoners were being hustled aboard a ship for transport off-world. In front of dozens of Yuuzhan Vong, ranging from Intendants to Shamed Ones, Vua Rapuung confronted his former lover, and demanded she speak the truth. Mezhan Kwaad calmly and proudly proclaimed her heresy, then killed Tsaak Vootuh and his surviving guards with a weapon concealed in her Shaper Hand, before using it to hobble and overpower Anakin and Vua, ordering Nem Yim to take them aboard the ship for transport to the Supreme Overlord."}, {"tag": "p", "text": "At this point, however, Tahiri used Anakin's lightsaber to decapitate the Master Shaper, and the badly-injured Vua Rapuung fought to give Anakin and her enough time to escape aboard the ship. The two young Jedi joined up with Qorl and the others on the now-repaired freighter, and ran the Yuuzhan Vong blockade, just in time to be rescued by Karrde's ships—restored to full strength by Shada's return—and the newly-arrived Errant Venture, and a force of X-wings with pilots including Corran Horn and Jacen and Jaina Solo."}, {"tag": "p", "text": "A space battle followed, in which Karrde's fleet, augmented by the Star Destroyer and the additional starfighters, destroyed the Yuuzhan Vong ships in orbit and bombarded the colony on the surface, destroying the damuteks and more ships that had been brought into land. Karrde then deployed troops, who liberated the enslaved captives the Yuuzhan Vong had been using, leaving the Shamed Ones and a few other survivors to await rescue by their own people."}, {"tag": "p", "text": "Although Karrde withdrew from the system, and the Yuuzhan Vong eventually reoccupied Yavin 4, the battle was in most respects a victory for the Galaxy's defenders. Tahiri had been scarred mentally and physically by her ordeal, but of all the Jedi at the Academy, only Ikrit had been lost, and all the children had been saved, along with the slave population that the aliens had subsequently brought to the jungle moon. On the military level, Karrde and Terrik's irregulars had wiped out a Yuuzhan Vong task force and utterly destroyed the most important Shaper compound in the Galaxy."}, {"tag": "p", "text": "Moreover, a belief developed among the Shamed Ones that Vua Rapuung had been redeemed in his death thanks to his alliance with Anakin. This marked the beginning of the Jeedai heresy, an underground movement which regarded the Jedi as saviors rather than enemies, and which would eventually erupt as a full-scale revolution led by Kunra during the Battle of Yuuzhan'tar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}