{"url": "Invasion_of_the_Bactranate", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Grumani sector", "Category:Battles of the New Sith Wars", "Category:Conflicts of the Outer Rim Territories"], "nodes": [{"tag": "h1", "text": "Invasion of the Bactranate"}, {"tag": "p", "text": "In 1032 BBY, the joint forces of the Sith Lords Daiman, Odion, Lioko, and Malakite spearheaded an invasion into the holdings of the Bactranate, the territory of the Sith Lord Ayanos Bactra. The invasion began with an attack on the Bactranate's capital planet, Jutrand, which was conquered by Odion. Shortly thereafter, the Bactranate was wholly dissolved."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following the conquest of Jutrand, Odionate, Daimanate, the Menagerie and Lioko's forces invaded the Bactranate which collapsed within a few days. During a subsequent bequest convened by Vilia, Daiman obtained control of Industrial Heuristics, the most prized of Bactra's corporate assets. However, Odion protested and claimed that he had a right to the company since it had been headquartered on Jutrand, which had been bequeathed to him. As quid pro quo, Vilia allowed him to keep Jutrand and arrange for the transfer of two legions of Trandoshan slave warriors from her own forces to augment Odion's troops. Bactra's remaining corporate assets were redistributed among her other grandchildren particularly Lioko and Malakite whose forces had also participated in the invasion. During the bequest, Vilia's granddaughter and Sith Lord Arkadia Calimondra cited an intelligence source that Bactra had gone into hiding at a Quermian retirement colony."}, {"tag": "p", "text": "The Sith Lord Odion also acquired Jubalene where he enslaved the population and put them to work in war forges. Meanwhile, he had all the children within his portion of the former Bactranate including those in Jutrand and Jubalene imprisoned and indoctrinated at planet-sized orphanages known as cloisters. To satisfy his sadistic nihilistic pleasures, Odion also made use of Bactra's now redundant bankers and attorneys by coercing them into participating in violent arena fights against wild beasts like rancors and gundarks. The elimination of the Bactranate also enabled Odion to restart Project Pandemonium, a project to locate the ancient Sith artifact known as the Helm of Ieldis. It was capable of driving sentient beings into a mindless homicidal frenzy. As part of his campaign to launch a galactic apocalypse, Odion's forces also invaded Sarrassia to secure information on the Helm. While Sarrassia had nominally been under the influence of Bactra who ended the religious conflict between the Grumani Hierophants and the Spumani Crusaders, he had left the planet alone. Odion in contrast destabilized Sarrassian society."}, {"tag": "p", "text": "After acquiring the Helm on Skarpos, Odion attempted to launch his apocalypse from his base at Vanahame by using the emotional energies of the imprisoned children. However, he was foiled by the Jedi Knight Kerra Holt and his former second-in-command, General Beld Yulan. Following his death, the Odionate collapsed and its territories were divided up among the Calimondra territory."}, {"tag": "h2", "text": "Appearances"}]}