{"url": "Inyri_Forge", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Antilles's Rogues", "Category:Females", "Category:Galactic Alliance individuals", "Category:Humans", "Category:Personnel of Delak Krennel's regime", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Inyri Forge"}, {"tag": "p", "text": "Inyri Forge was a Human female from Kessel. The younger sister of former Rogue Lujayne Forge, Inyri joined Rogue Squadron shortly after the conquest of Coruscant."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Inyri was born on Kessel to Kassar and Myda Forge. Kassar was a teacher who volunteered to go to Kessel under a Galactic Republic program to educate inmates on how to re-enter society upon release. Her mother was one of the inmate students who fell in love with him and decided to stay with him on Kessel."}, {"tag": "p", "text": "Inyri had multiple brothers and sisters (including Lujayne), all of whom were still alive and living on Kessel in 6.5 ABY."}, {"tag": "p", "text": "While planning the Coruscant battle, officials decided to free some high profile prisoners in order to cause chaos in the heart of the Galactic Empire. One of those prisoners was Zekka Thyne, of the Black Sun organization. Along with Zekka came Inyri, his \"glitterstim cutter\" and lover. Inyri, being born on Kessel, and not sent there, was not a criminal, but she was insistent on staying with Zekka, even when the squadron offered to aid her."}, {"tag": "p", "text": "However, things changed as the undercover mission on Coruscant progressed. Inyri began to rethink her loyalty towards Zekka, especially after an incident when they came under fire, and he ran to save himself while Rogue member Gavin Darklighter came to her aid."}, {"tag": "p", "text": "Finally, things came to a head when Zekka attempted to kill Corran Horn, whom he blamed for putting him on Kessel in the first place. Inyri shot and killed Zekka before he could go through with it. Having proven herself, Inyri joined the Rogues for the Coruscant battle, and was inducted formally into the squadron in the celebration afterwards."}, {"tag": "p", "text": "Inyri had been a steady member of Rogue Squadron ever since. She was a member of Requiem Squadron where she was disguised as Inyon Fass. She had bright red hair and was the sister of Teekon Fass."}, {"tag": "p", "text": "Later she achieved the rank of Major during the Caamas Document Crisis, and continued to serve with the squadron well into the Yuuzhan Vong War, fighting in the Battle of Dantooine and the Battle of Kalarba."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}