{"url": "Inysh", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Core Worlds planets", "Category:Galactic Empire planets", "Category:Mining planets", "Category:Southern Core planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Inysh"}, {"tag": "p", "text": "Inysh was a Core Worlds planet that was home to the Abinyshi. A sentient, passive species of reptilians, the natives of Inysh were among the first species to achieve space travel, although their interstellar colonization was limited. The Galactic Empire eventually discovered the planet had vast reserves of the kalonterium ore and proceeded to strip-mine the world."}, {"tag": "p", "text": "The ecology of Inysh was devastated as a result, with toxic waste being dumped across the planet and native flora and fauna dying off. The Abinyshi were enslaved and brought to the brink of extinction, and the galaxy at large was misled to believe the species had eradicated itself in a civil war. At some point, the Empire abandoned the mining operations on Inysh, leaving the natives on their ruined homeworld."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Inysh was a terrestrial planet located in the Inysh system, a part of the Southern Core portion of the Core Worlds. It was home to both plant and animal life until mining operations carried out by the Galactic Empire led to the collapse of the planet's ecology."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The native Abinyshi of Inysh became one of the first species to achieve space travel, taking to the stars at approximately the same time as Humans. However, the reptilians' ability to colonize territories outside their home system was limited due to their small population."}, {"tag": "p", "text": "At some point, scouts of the Galactic Empire and officials of the Mining Guild discovered on Inysh the presence of massive deposits of kalonterium, an ore used in weapons manufacturing and starship construction. Subsequently, the Empire established mining operations on the planet and proceeded to strip the world of its kalonterium reserves."}, {"tag": "p", "text": "As a result, the ecology of Inysh was devastated due to the Empire dumping toxic waste products from the mining process all across the planet, and the world's native flora and fauna died out. All but a few thousand Abinyshi were enslaved to mine kalonterium for the Empire or were otherwise trapped on Inysh, and the species was brought to the brink of extinction. Disinformation due to Imperial propaganda led to nearly all beings in the galaxy believing that the natives of the world had been rendered extinct as a result of cataclysmic civil war. When other, higher-quality ores eventually became available elsewhere, the Imperial mining installations on Inysh packed up and left the planet, abandoning the Abinyshi to suffer on their ruined homeworld."}, {"tag": "p", "text": "Approximately two decades later, around 1 ABY, the Abinyshi S'itl Thirr approached Professor Tem Eliss of the University of Sanbra. Thirr requested that Eliss publish the truth about Inysh and its fate. Eliss agreed and eventually included an entry dedicated to the Abinyshi in his work, The University of Sanbra Guide to Intelligent Life."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Inysh was the homeworld of the Abinyshi, a species of sentient bipedal reptilians. The Abinyshi were a passive and gentle culture, and their main exports to the wider galactic community were their cuisine and literature."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Inysh was introduced in an August 1997 article of the \"Alien Encounters\" series, which was written by Trevor J. Wilson and Craig Robert Carey and included in Star Wars Adventure Journal 14. The 2009 reference book The Essential Atlas placed the Inysh system, and therefore the planet Inysh, in grid square J-12."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}