{"url": "Iokath", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles with gameplay alternatives", "Category:Iokath locations", "Category:Iokath technology", "Category:Space structures", "Category:Type I atmosphere planets", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Iokath"}, {"tag": "p", "text": "Iokath was a massive artificial sphere constructed around a star located in the Unknown Regions by a technologically advanced species at some point before the Manderon Period. Every orbital body in the system was demolished and salvaged for core elements, from which an impervious habitat for the species was constructed, using all of it star's energy output. The species of weapon designers created many technological wonders such as the Gravestone, the Eternal Fleet, the GEMINI droids, SCORPIO and the Old Gods, using their superweapons on dozens of different worlds for live testing. When a civil war broke on Iokath, both sides began using their superweapons against each other, which led the engineers to drive many of their creations into Wild Space with their memory cores locked. However, that did not save them, as the Six Gods were unleashed on Iokath, eradicating all organic life on it and leaving a single self-aware droid known as ARIES to reshape the world in his image. Few visitors that found Iokath over the centuries were all killed by ARIES in brutal tests, until many new arrivals came to Iokath around 3631 BBY, in the middle of the war against Zakuul. Iokath creation SCORPIO, who uncovered her origins, brought to Iokath the Eternal Fleet and the Gravestone, with the personnel from two warring factions still onboard. ARIES used a superweapon to knock every organic on those ships unconscious and placed them across the surface of Iokath to test in combat simulations. Independent from each other, Alliance and Eternal Empire forces reunited with their allies, working against ARIES to escape from Iokath. The Alliance had retrieved their main combat vessel Gravestone while Eternal Empire forces led by their Empress Vaylin regained control over the Eternal Fleet warships. ARIES prepared to use his superweapon again, killing all organics and damaging the GEMINI droids, but SCORPIO found the location of his base and assisted the Alliance in stopping him, allowing everyone to leave. The superweapon exploded, covering the entire world in a pulse of deadly radiation and making Iokath unsafe to explore. By the time the radiation levels subsided, Empress Vaylin was dead and the Alliance had conquered Zakuul, transforming itself into the Eternal Alliance. A group known as the Order of Zildrog learned the location of the Six Gods and leaked it to the Eternal Alliance, Galactic Republic and the Sith Empire simultaneously. All three parties arrived on Iokath and converged on the superweapon at the same time, leading to the War on Iokath, in which the Eternal Alliance joined the side of one galactic government to stand against another. During the battle, leader of the faction rejected by the Eternal Alliance attempted to gain control over the Six Gods through an Iokathi throne, but failed and was killed by a power flux, leading to the first of the Six Gods awakening. The Eternal Alliance Commander used the Eternal Fleet to knock the droid Tyth out of commission, after which the Scions of Zakuul urged them to finish the deed and subdue the Gods once and for all before they could destroy them all."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Iokath was not technically a planet, but a massive artificial sphere that completely engulfed the star inside it, absorbing all its energy for maximum solar efficiency. The exterior side of the self-sustaining ecosphere possessed impenetrable defenses, while the interior side housed various biomes that served different needs, from living habitats to research purposes, and the whole structure could be altered and expanded as needed. The massive sphere was constructed of giant hexagonal sections and contained several openings that allowed ships to travel in and out. While the air inside was breathable, there was no natural water or soil on Iokath, and the species that lived on it also constructed gardens, parklands and entire biomes that were overgrown with plant life. The mundane tasks of Iokath inhabitants were tended by a variety of droids, who served a multitude of purposes from protection and security to maintenance and restoration of the entire world. Every kilometer of the planetary megastructure was connected by a complex network of tubes that doubled as both cooling matrix for the technological world as well as a transportation system, with pneumatic trams that could speedily transport passengers and cargo across the distance of entire continents. The entirety of Iokath also served as a massive information storage network that could be accessed through the technoliths spread across the surface."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Iokath was constructed sometime before the Manderon Period by a mysterious species that originated in the Unknown Regions and was unknown to the larger galaxy. Its society composed of scientists and engineers, the species build a highly advanced civilization, with technology far exceeding its contemporaries. Focused on creating the greatest weapons in the galaxy, the species spend hundreds of years and countless design cycles designing and developing superweapons, which they then tested on unsuspecting worlds throughout the Unknown Regions, gathering feedback data to further perfect their weaponry. Eventually, the civilization decided to turn their attention inward and the Master Designers Council announced commencement of Project Iokath, a massive undertaking with the goal to fabricate an expandable and adaptable home for the entire species that was also secure against any outside force. To that end, they picked an unremarkable star in the Unknown Regions and demolished every orbital body in its system down to the last asteroid, salvaging them for core elements, while the remaining materials formed an orbital ring around Iokath. Pneumatic trams propelled by pressurized gas were built as energy-efficient method of moving construction supplies across great distances. Once the massive habitat named Iokath was completed, it allowed no light from its star outside, and the entire system became undetectable to the rest of the galaxy. New modules and biomes continued to be added to Iokath to accommodate the endlessly-breeding populace, while a multitude of droids tended to day-to-day needs of Iokath's inhabitants. A massive Necropolis was constructed as a crypt for dead Iokath creators, eventually housing billions of dead bodies. As centuries went on, Iokath technology resulted in creations such as the enormous Eternal Fleet acting in unison through its GEMINI captains, the combat frigate Gravestone armed with a massive omnicannon, advanced artificial intelligence in form of a long-extinct species called SCORPIO, a superweapon that could knock unconscious or kill thousands of organic beings across hundreds of kilometers, and the Old Gods - massive titan battle droids designated Izax, Scyva, Tyth, Aivela, Esne, and Nahut - designed to pacify, subjugate, and destroy entire civilizations."}, {"tag": "p", "text": "Though impervious to any outside threat, Iokath society eventually destroyed itself from within. An act of sabotage ignited the pressurized gas in the pneumatic tram system and sparked a catastrophic explosion that killed thousands and leveled a nearby settlement. This attack sparked the Iokath civil war, in which both sides had access to multiple superweapons of mass destruction. The conflict lasted for centuries, and in an attempt to save themselves, Iokath's engineers drove many of their creations, including the Eternal Fleet, the GEMINI droids and SCORPIO, into Wild Space with their memory cores locked, preventing them from finding their way back to Iokath. However, it proved only a temporary solution, as one side eventually did the unthinkable and unleashed the Six Gods on Iokath, leading to eradication of all organic life on the world. In the aftermath of the conflict, only one self aware droid remained on Iokath - ARIES, a combat droid designed to oversee and coordinate advanced warfare simulations. ARIES used the massive population of service droids as his slaves and soldiers to remake the world in his image, and over centuries consolidated power as Iokath's sole caretaker. The purpose of the self-perpetuating service droids slowly changed, and the mandates of the newer generations shifted from preservation of Iokath to aggression toward any foreign entity, with virtually every droid on Iokath becoming in some way weaponized. For thousands of years, Iokath remained hidden from the rest of the galaxy, while the few visitors who managed to stumble upon it were tested by ARIES in brutal scenarios to determine whether any of them were worthy of inheriting Iokath, though none have survived."}, {"tag": "h3", "text": "Rediscovery"}, {"tag": "p", "text": "Iokath was rediscovered in 3631 BBY when SCORPIO, seeking to uncover the origins of herself and the GEMINI droids, hijacked the Gravestone from the Alliance opposing the Eternal Empire of Zakuul that dominated the galaxy with the might of Iokath's Eternal Fleet. Within the Gravestone databanks SCORPIO discovered Iokath's coordinates, sending the Gravestone there and using her link to the GEMINI captains to bring the Eternal Fleet warships along as well. All those vessels emerged from hyperspace in Iokath system, with the personnel from the Alliance and the Eternal Empire, including its Empress Vaylin, still onboard. As the vessels approached Iokath and entered the giant sphere, ARIES activated his superweapon that emitted a bright light and knocked all organics aboard the ships unconscious. He then moved the new arrivals to the surface of Iokath, placing them in different environments to test in various combat scenarios. When his captives awoke, they came under attack from ARIES' droids, though some were also assisted by Iokath remotes. Alliance member Theron Shan used his cranial cybernetic implant to contact other Alliance members, directing everyone to the Tributary, where they fought and reprogrammed a colossus droid. Unable to locate the Gravestone, Theron Shan used his implant to remotely pilot the shuttle that was left inside its hangar to the Tributary roof, where everyone got onboard while the Alliance Commander used the colossus droid to distract hostile droids from their position."}, {"tag": "p", "text": "Imprisoned by ARIES, SCORPIO tricked him by leaving a holographic disguise in her place and escaped before ARIES decided to blast her with laser fire. Concluding that none of the new arrivals were worthy of inheriting Iokath, ARIES activated a massive energy shield that would destroy any vessel attempting to leave and started recharging his superweapon, intending to use it on the lethal setting. However, his multiple holo-transmissions allowed SCORPIO to pinpoint the location of his base in Iokath's southern hemisphere and transmit it to the Alliance, asking them to stop ARIES. Eternal Empress Vaylin also escaped her cell and came across the remains of her forces, rallying them to retake the Eternal Fleet from ARIES. They found the control console, from which a GEMINI captain released the docked Eternal Fleet warships, which prepared to leave, but began smashing into ARIES' energy shield. Reaching the ARIES base in his shuttle, Theron Shan dropped the Commander and Vette off to deal with ARIES, while the rest of the Alliance went to reclaim the Gravestone. The Commander and Vette attacked ARIES, who after a prolonged fight was shot in the back and destroyed by SCORPIO, who then lowered the energy shield and urged the Alliance to escape before the capacitors on the superweapon could overload and cover the entire world with a pulse of deadly radiation. SCORPIO announced her intention to upload her consciousness into the planetary network, becoming one with Iokath, and the Commander allowed her to merge with Iokath. The Commander and Vette were picked up by their fellow Alliance members on the Gravestone shortly before the superweapon exploded, prompting both the Gravestone and Vaylin's Eternal Fleet to escape into hyperspace. The radiation covered the entirety of Iokath, disrupting navigation and comm signals, although SCORPIO's consciousness endured and began making a home within Iokath's massive planetary network. The Alliance later deployed scouts to Iokath system, but the radiation levels made any exploration impossible."}, {"tag": "h3", "text": "A battleground"}, {"tag": "p", "text": "By the time the radiation levels on Iokath returned to the safe level, the Alliance had defeated the Eternal Empire and conquered Zakuul, transforming itself into the new Eternal Alliance. A secret group known as the Order of Zildrog uncovered the location of the Six Gods on Iokath and leaked this information to the Eternal Alliance, Galactic Republic and the Sith Empire simultaneously. Seeking control of the powerful superweapon, all three governments dispatched military forces to Iokath, with the Republic forces led by Supreme Commander Jace Malcom, Imperials led by Sith Empress Darth Acina, and the Eternal Alliance initially represented by a search party led by Lana Beniko. Finding the location of the Six Gods, the Imperial and Republic forces came into contact and opened fire on each other, while Beniko's team avoided detection and established a base at the Fleet Spire, while informing the Alliance forces on Odessen of the situation. She was visited by the emissaries from the other two sides - Republic Army Captain Elara Dorne and Imperial Army Major Malavai Quinn - but believing them to be assassins, she ordered to take both of them captive. The Alliance Commander ordered the Eternal Fleet, which they now controlled from the Eternal Throne, to converge on Iokath, while the Commander and Theron Shan traveled there in a small starfighter. Upon arrival in Iokath system, they noted that Republic fleet and the Imperial fleet were not attacking each other and merely held their positions, and at the same time, a signal coming from the surface of Iokath scrambled the Eternal Fleet's weapon systems, leaving it offline. The Commander ordered the GEMINI captains to find a workaround, and they proceeded to look for the source of the transmission on Iokath."}, {"tag": "p", "text": "Upon landing on Iokath, Theron Shan and the Commander joined Lana at the Fleet Spire, where her captives requested an audience with their superiors, leading to a three-way holoconference between the leaders of the present governments. Both Supreme Commander Malcom and Empress Acina claimed ownership of the superweapon, and formally asked the Eternal Alliance to join their side in the War on Iokath. The Alliance Commander agreed to enter a pact with one of the factions, to which the other responded by immediately launching an attack on their ground base, while the fleets in orbit have engaged each other as well. The Alliance helped their new ally to defend their base against the assault, after which the Commander and Theron Shan ventured inside a nearby weapons cache to retrieve Iokath weapons and knowledge on how to use them. Inside, Theron Shan downloaded the files from an ancient console, learning that the superweapon everyone was fighting over was powerful enough to wipe all organic life on Iokath in distant past, in addition to ten trillion lives on other planets. When they returned to their base with the obtained data, the opposing faction's leader contacted them and informed that their engineers have discovered a backdoor into the superweapon, on which they were about to gain control. Rushing to prevent the superweapon's activation, Theron and the Commander used a walker to reach the hostile side's base, where opposing faction's leader attempted to control the Six Gods through an Iokathi throne, but was unsuccessful and killed by a power flux. This resulted in the Six Gods awakening, but also killed the signal keeping the Eternal Fleet in lockdown, bringing it back online. Theron Shan stayed behind to delay the superweapon activation, while the Commander ordered the Eternal Fleet to charge the turbolaser batteries and went to the superweapon control center. Inside, the Commander assumed another Iokathi throne, allowing them to communicate with Tyth, the first of Six Gods to have re-awakened. Having introduced himself as the God of Rage, Tyth informed the Commander about a traitor within their ranks, just as the throne they were on was sabotaged. Tyth emitted an energy beam that destroyed an Eternal Fleet warship, but the Commander ordered the rest of the Fleet to fire on the giant droid, knocking it out of commission."}, {"tag": "p", "text": "The Commander was shocked from being on a throne when it was sabotaged, and their unconscious body was brought back to Fleet Spire to recuperate. After they awoke, they were informed by Lana Beniko and their allies that despite the loss of opposing faction's leader, the battle for Iokath was still raging on, while Tyth was gearing up for a counterattack. Committed to secure full control over Iokath's resources, the Alliance continued to fight for the control over its surface, while the Commander met with the Scions of Zakuul, who traveled to Iokath to aid them in fulfilling their destiny. The Scion leader Oramis told the Commander about the significance of the Six Gods to Zakuul's history, while explaining the grave danger they possessed. The Alliance forces eventually confronted the Six Gods directly, destroying them before could wreak havoc on the galaxy once again."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Iokath first appeared in Star Wars: The Old Republic: Knights of the Eternal Throne expansion, where the players can allow SCORPIO to merge with its planetary network for Light Side points, or destroy her for Dark Side points. Iokath was later revisited in the \"War for Iokath\" storyline released with Game Update 5.2., in which players are forced to ally with either the Galactic Republic or the Sith Empire independent of their original faction, leading to significant story deviations, including the death of either Jace Malcom or Darth Acina and gaining either Elara Dorne or Malavai Quinn as a companion. Following the completion of that storyline, Iokath becomes a daily area, where players can gain reputation with either faction and complete rotating objectives for various rewards. Later updates also added a new \"Battle Over Iokath\" map for Galactic Starfighter and \"Gods from the Machine\" operation, where a group of players must face and defeat Tyth, Aivela and Esne, Nahut, Scyva and Izax."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}