{"url": "Iol", "categories": ["Category:Legends articles", "Category:Low-gravity planets", "Category:Unknown Regions planets"], "nodes": [{"tag": "h1", "text": "Iol"}, {"tag": "p", "text": "Iol was a lifeless planet in the Unknown Regions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A starship pilot discovered valuable ore for durasteel-making after crashing on the planet, and attempted to make a claim to the world, naming it after a god of death. The company Tangan Industries altered this claim after one of their cargo ships picked up his transmission and begin their own mining operations on the world after his rescue."}, {"tag": "p", "text": "Three cities dedicated to mining colonies were established on the planet. Despite attempts at unity under the Tangan Industries banner, their mining crews often quarreled over competing claims, at some points engaging in outright combat."}, {"tag": "p", "text": "During the Mandalorian Wars, a rogue Jedi known as Revan led a group of ships that came across the mining planet. In exchange for technology, Revan and his gang gained fuel and supplies from the colony administrator. The board of directors at Tangan Industries did not sanction the transaction, but kept quiet due to being the recipients of valuable technology."}, {"tag": "p", "text": "Due to the extensive transaction, the colonies had less resources to draw upon, and prices for goods sold internally skyrocketed to compensate for diverting more supplies to the world. An organization known as the Miners' Union was established to rebel against Tangan and end the starvation and misery. The Union demanded the miners run the colonies independently and attempted to storm the administration building. Though pushed back by the administrator's guards, the administrator opened direct negotiations with the rebel leader, ending the protests when the prices were lowered once again."}, {"tag": "p", "text": "In the time of the Galactic Empire, the colonies planned on striking out as an independent state again, but Tangan Industries reached an agreement with the colonial administration which made improvements to the living conditions of the miners, increasing productivity and improving their morale."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}