{"url": "Ion_cannon/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Ion cannons"], "nodes": [{"tag": "h1", "text": "Ion cannon"}, {"tag": "p", "text": "An ion cannon was a weapon which fired highly ionized particles or highly ionized plasma."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ion cannons fired particles that seriously interfered with the operation of electronics and computer systems, shorting circuits and often disabling them outright, in much the same manner as an electromagnetic pulse. The actual physical damage would sometimes result in fused joints on machines, due to the heat produced. Ion cannons could also slow down malfunctioning door shutters or otherwise disable shield generators, as evidenced by the Fondor shipyard assault and the Battle of Dubrillion, respectively."}, {"tag": "p", "text": "Large negative-ion pulses were charged in a turbine generator then channeled into a plasma charge or released as a large pulse towards a target. As a result, ion cannons were the weapon of choice for subduing, rather than destroying, enemy starships, vehicles, shields, or droids. There were many types of ion cannons, including ground-based ones like the N-K7, planet-based cannons such as the V-150 at Echo Base, and starship-mounted ion cannons such as the one on the Malevolence, not to mention the walker-based AT-IC."}, {"tag": "p", "text": "The ion cannon was not without its weaknesses, however. For instance, it lacked tight-beam accuracy, to the point that a ground-based ion cannon might hit the defender's own battle stations as well as its intended targets. Moreover, capital ships would have crewmen that could repair any damage done, which would allow the vessel to continue fighting."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "They were often used on capital ships, such as Star Destroyers, to facilitate the capture of enemy vessels or disable them to allow safe close-range fire. They also helped to drop shields prior to destroying enemy vessels. Fighters such as the B-wing, Y-wing, TIE/D Defender, TIE Hunter and the Razor fighter in some cases, were also equipped with ion cannons, of much smaller size. Ships owned by bounty hunters were sometimes modified to use ion cannons, such as Boba Fett's Slave I."}, {"tag": "p", "text": "A more powerful form of the ion cannon, the massive ion pulse cannon, was used in the Clone Wars, mounted on the Confederacy of Independent Systems ship the Malevolence. It could disable Venator-class Star Destroyers and stop entire fleets in their tracks with a single shot. The weapon overloaded near the Balmorra Run thanks to the efforts of Anakin Skywalker, Ahsoka Tano, and Master Plo Koon. The Malevolence's sister ship, the Devastation, was even larger and more powerful than the Malevolence. The ship's ion cannons were as powerful as a shot from the Death Star's superlaser, and could destroy any capital ship or even a planet. They were so powerful because the Devastation's pair of ion cannons and the Death Star's superlaser ran on the same type of power source: Force crystals."}, {"tag": "p", "text": "They could also be planet-based weapons, as seen in the Battle of Hoth, where the Rebel Alliance used a stolen V-150 Planet Defender to disable the Star Destroyer Tyrant, allowing a transport to escape through the Imperial blockade."}, {"tag": "p", "text": "Certain types of ion cannons were meant to do more physical damage with electrical disruption as a plus. These types of ion cannon, however, had a low firing rate and were often just replaced with heavy turbolasers."}, {"tag": "p", "text": "One type of ion cannon was the v-200 ion cannon, used to break through shielding and bring down heavily armored vehicles. There was also a specialized version for taking down the heavily armored spacetroopers."}, {"tag": "p", "text": "The Galactic Empire experimented with ion cannons by modifying AT-ATs to become All Terrain Ion Cannons, or AT-ICs, effectively creating a mobile ion cannon. The AT-ICs saw limited action during the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Due to their unique mission profile as a disabling weapon, ion cannons have been popular in franchise video games, particularly the Star Wars: X-Wing and Star Wars: Rogue Squadron series. Ion cannons play a significant role in starfighter combat in these games, in contrast to the films, where starfighters are never seen to fire ion weapons. In the X-Wing series, a few seconds of sustained fire from a single fighter's ion cannons can permanently disable any capital ship that has lost shields, while it might take several minutes to destroy the same ship using lasers."}, {"tag": "p", "text": "In another departure from the movie appearance, the discharge of an ion blast was colored cerulean blue in both series (all of which predate the blue laser bolts seen in Star Wars: Episode III Revenge of the Sith)."}, {"tag": "p", "text": "Despite the real-world physics of spaceflight, disabling a craft with ion cannons in the X-wing series of games had the effect of stopping it dead in space rather than simply crippling its flight control system. Contradictorily, the use of a Y-wing starfighter's ion cannons to disable Kasan Moor's TIE/IN interceptor just above the surface of Gerrard V in a cutscene appeared to disable the Imperial craft's flight-control systems, but not its engine system, resulting in the interceptor flying in a straight line without being able to deviate from its course."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}