{"url": "Ion_drive", "categories": ["Category:Legends articles", "Category:Engine types", "Category:General starship components", "Category:Ion engines"], "nodes": [{"tag": "h1", "text": "Ion drive"}, {"tag": "p", "text": "The ion drive was a type of engine used to propel most starships at sublight velocities. Ion engines were fueled by power cells, liquid chemical reactants, onboard generators, or virtually any other device capable of providing sufficient power. The engine utilized internal fusion reactions to produce a stream of highly charged particles that were forced through the engine's exhaust port at nearly the speed of light. Ion engines were sometimes called ion rockets."}, {"tag": "p", "text": "Ion engines emitted mildly radioactive byproducts, requiring onboard technicians to wear protective gear. Because of this radioactivity, and the disabling effects that ions had on electronics and electrical systems, it was common protocol for most ships to utilize repulsorlifts for propulsion during atmospheric flight and reserve use of the more powerful ion drives for orbital navigation."}, {"tag": "p", "text": "The most noted craft using ion drives were TIE Fighters, which received their name from the number of ion engines they used: Twin Ion Engine."}, {"tag": "h2", "text": "Models"}, {"tag": "h3", "text": "Replacement Drives"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ion drives are becoming real devices as the first successful test of the Dawn spacecraft's ion engines used Xenon propellant. It burned for 27 hours and only expended 10 ounces of fuel. Real ion thrusters look very similar to the engines on Star Destroyers. However, they have a very low thrust-to-weight ratio; this problem is fixed with the introduction of very similar plasma engines, which have a variable and scalable thrust-to-weight ratio."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}