{"url": "Ione_Marcy/Legends", "categories": ["Category:Legends articles", "Category:Coruscanti", "Category:Criminals", "Category:Females", "Category:Individuals of unidentified species", "Category:LGBTQ+ individuals"], "nodes": [{"tag": "h1", "text": "Ione Marcy"}, {"tag": "p", "text": "Ione Marcy was a female criminal who lived during the Clone Wars. She and Cassie Cryar, her partner-in-crime, engaged in many illegal activities, which included the theft of Jedi Padawan Ahsoka Tano's lightsaber and the murder of Nack Movers, a Trandoshan assassin. Searching for the stolen lightsaber, Tano and Cosian Jedi Master Tera Sinube, who wanted to help her, interrogated Bannamu, the pickpocket who originally took the lightsaber, and discovered he had sold it to Movers. When the Jedi arrived at Mover's apartment, they found Marcy, who hid Cryar in the next room and posed as an innocent bystander. However, Cryar was found by Tano and tried to utilize the lightsaber, but was unable to turn it on, and so escaped through the window, and was chased by Tano through Coruscant. Meanwhile, at the apartment, Sinube, who began to question Marcy's innocence, secretly planted a tracking beacon on her. Upon being accused of the killing and of being the intruder's accomplice by Sinube, Marcy escaped in her airspeeder, and picked up Cryar. The two thieves then made their way to a train station, but were followed there by Tano, Sinube, and police droids, and were arrested."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on Coruscant, Ione Marcy was a successful thief and Coruscant underworld figure during the waning days of the Galactic Republic, and often paired up with fellow thief Cassie Cryar."}, {"tag": "p", "text": "Around 21 BBY, Marcy and Cryar were the culprits behind the murder of Nack Movers, a Trandoshan criminal. After the killing, Marcy looted several rare items from him, among them was Jedi Padawan Ahsoka Tano's lightsaber, which Movers bought from a merchant named Bannamu. When Tano and Cosian Jedi Master Tera Sinube, who was helping her find her lightsaber, arrived at the apartment of Movers' girlfriend, where Movers was living at the time, to search for Tano's missing weapon, Marcy quickly hid Cryar in a nearby room while she tried to pose as an innocent bystander. When Tano and Sinube questioned her about Movers' dead body on the floor, Marcy insisted that the murderers were several men and that they had escaped to the next building. Unfortunately for Marcy, Tano decided to check a room near them, where Cryar had been hiding. Upon discovering that Tano was the stolen lightsaber's owner, Cryar quickly broke through the window and jumped out."}, {"tag": "p", "text": "Meanwhile, Marcy kept up her act and awaited the police droids with Sinube, believing he assumed she was innocent. However, after he mentioned he had doubts about her made-up story, she summoned her airspeeder and escaped in it. The police arrived merely a few seconds later, but they already were too late to stop her. She then proceeded to pick up her accomplice, who was being chased through the city by Tano. Unbeknownst to Marcy, Sinube had secretly planted a tracking device on her and was following her with Tano while the two thieves escaped."}, {"tag": "p", "text": "Cryar and Marcy traveled to a nearby train station to make their way to a spaceport in another district, where they would get a ship and leave Coruscant. However, Tano and Sinube were already there with a squad of police droids, ready to arrest them before they could board. While waiting in line for a spot on the train, Cryar found the tracking device planted on Marcy and disposed of it, but she was too late to stop them from being found by the Jedi and the police. While Marcy was immediately arrested, her partner's arrest was delayed as she used the stolen lightsaber to destroy the droids holding her captive and escaped, but was ultimately subdued and arrested a few minutes later by Tano and Sinube."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Being a murderer and thief, Marcy was accustomed to lying and cheating to accomplish her goals. Unlike her partner Cassie Cryar, Marcy was not as skilled physically, though this was in part because Marcy was not a Terrelian jango jumper. However, she made up for this with cunning, orchestrating the murder of Nack Movers and the duo's escape plan. Marcy had oval-shaped yellow eyes and was a pink aquatic-like species."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ione Marcy first appeared in \"Lightsaber Lost,\" the eleventh episode of the second season of the Star Wars: The Clone Wars television series, which aired on January 22, 2010. Marcy was voiced by Meredith Salenger."}, {"tag": "p", "text": "Ione's appearance and costume appear to be based on unused concept art by Doug Chiang for a female Sith in Attack of the Clones."}, {"tag": "p", "text": "Though not a unanimous opinion, some viewers of \"Lightsaber Lost,\" including several on a Jedi Council Forums thread in 2011, noted subtext that suggested Ione Marcy and Cassie Cryar were in a romantic relationship. In 2016, Pablo Hidalgo stated via Twitter account that Ione Marcy and Cassie Cryar were written to be a couple."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}