{"url": "Ione/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Anoat sector planets", "Category:Corellian Trade Spine", "Category:Galactic Republic planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Ione"}, {"tag": "p", "text": "Ione was a thriving spaceport world lying along the Corellian Trade Spine in the Anoat sector of the Outer Rim Territories. Originally settled by the Galactic Republic centuries before the Galactic Civil War, Ione occupied a key intersection on the Trade Spine that made it the sole hyperspace link to the Greater Javin region's four Mining Worlds."}, {"tag": "p", "text": "The Figg Excavations mining company used Ione as its entry point for operations throughout the surrounding area. In 3 ABY, Imperial Star Destroyers from Darth Vader's personal Death Squadron likewise used the Ione system as their staging point for launching reconnaissance probe droids to neighboring planets in search of the secret Rebel Alliance base."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Ione was the namesake of the Ione system in the Anoat sector of the Greater Javin region, within the Western Reaches portion of the Outer Rim Territories. A thriving spaceport world, Ione lay at the heart of the sprawling Ivax Nebula and sat at a strategic intersection point along the Corellian Trade Spine hyperlane. Ione's position made it the sole link between the Trade Spine and the four Greater Javin planets known collectively as the Mining Worlds: Burnin Konn, Allyuen, Tokmia, and Isis."}, {"tag": "p", "text": "Ione featured a primarily terrestrial surface of urban development, seas, and plateaus, and the planet offered a temperate climate. A day on Ione lasted twenty-three standard hours, and a year 390 local days. The planet had standard gravity and a Type I atmosphere breathable for Humans."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Republic settlement and FiggEx mining"}, {"tag": "p", "text": "A thousand years before the onset of the Galactic Civil War, the planet Ione lay in a largely uncharted region of space beyond the Mid Rim, which was considered then to be a part of Wild Space. At a time when the Corellian Trade Spine had yet to extend past the edge of the Mid Rim, only scouts and the most daring traders traversed this imperfectly surveyed frontier region of the galaxy. Efforts by hyperspace explorers to expand the Trade Spine's economic opportunities were long hampered by the dominating presence of the giant Twin Nebulae gas clouds, which proved a great impediment to navigation."}, {"tag": "p", "text": "Following a brief, one-sided war between the Galactic Republic and the region's native Mugaari, Republic cartographers established the new Javin sector in the Outer Rim, and a host of planets running Rimward along the Trade Spine, including Ione, were settled. Republic traders, staging from these newly settled planets, continued to search for a hyperspace shortcut through the Twin Nebulae, but centuries passed before the entrepreneur Ecclessis Figg succeeded in finding a route. Figg's success turned Ione's region into an economic powerhouse."}, {"tag": "p", "text": "Circa 400 BBY, Ione was reorganized into the Republic's new Anoat sector. Eventually, Figg Excavations, the mining subsidiary of Figg's Outer Javin Company, began using Ione as its entry point for operations throughout the Ivax Nebula, including the four systems branching off from Ione known as the Mining Worlds. A less-than-loyal member of the Mining Guild, Figg Excavations represented the public face of the Figg conglomerate in the area around Ione."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "During the Galactic Civil War, a once-secret hyperroute connected Ione with the one-time Rebel Alliance safe world Isis. In 3 ABY, the Ione system served as the staging point for the Imperial Star Destroyers Avenger and Stalker, temporarily detached from the Dark Lord of the Sith Darth Vader's personal Death Squadron, as they launched reconnaissance probe droids to surrounding planets in the Empire's ongoing search for the secret Rebel headquarters."}, {"tag": "p", "text": "From Ione, the two Star Destroyers dispatched probots to the nearby Allyuen, Tokmia, and Hoth systems. Ultimately, the probe sent to Hoth by the Stalker led to the discovery of the Rebels' hidden Echo Base and the subsequent Battle of Hoth."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Ione boasted a mixed-species population of 1 billion inhabitants. The population was evenly distributed among Humans, Lutrillians, Nothoiins, and Ugnaughts. Ione's populace was governed by a corporate entity."}, {"tag": "p", "text": "The planet's primary imports included technology and foodstuffs, and its exports included ores and gems."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Regarded chiefly as a port world, Ione featured two stellar and three standard spaceports."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ione was created for \"Galactic Gazetteer: Hoth and the Greater Javin,\" a 2004 Wizards of the Coast online Star Wars Roleplaying Game supplement. The Essential Atlas, published in 2009, established the Ione system as the setting for the opening scene of the film Star Wars: Episode V The Empire Strikes Back, in which an Imperial Star Destroyer launches the probe droid that discovers the Rebel base on Hoth."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}