{"url": "Ipsus", "categories": ["Category:Legends articles", "Category:Cities on Genarius"], "nodes": [{"tag": "h1", "text": "Ipsus"}, {"tag": "p", "text": "Ipsus was one of the floating cities on the planet Genarius. The station was funded by the Naescorcom company as a manufacturing center in 36 BBY. It was constructed on minimal funding due to some Naescorcom's representative reluctance to invest more than a minimal budget until they began getting a profit (which had not happened as of 32 BBY). As such, the city's design was purely functional, with almost no ornamentation. Its buildings were like boxes which stood in long rows. The city's radiation shield was an unusual box shape made of alloys treated with chromium. This coating deflected radioactive waves from ion storms."}, {"tag": "p", "text": "Ipsus was built with seven sections, though by 31 BBY, only two of those were in use. Line One was dedicated to the manufacturing of textiles, a low demand but steady profit line, with little security. Line Two manufactured thermal detonators. As such, Naescorcom kept Line Two under tight security. Naescorcom believed in product diversification, and though the combination of textiles and thermal detonators seemed strange, Naescorcom facilities in other systems proffered even stranger combinations."}, {"tag": "p", "text": "Two operations overseers oversaw the lines for Naescorcom, whose board of directors governed the city remotely. Naescorcom also sent security advisor Loa Tibeeme and detonator production archivist Nui Gneppe to work in the Ipsus facilities. Despite five of its lines being inactive, Ipsus quickly garnered enough wealth and power to gain two seats on the Central Council of Genarius."}, {"tag": "p", "text": "Ipsus eventually became a waypoint for independent gas miners who visited the city to obtain rare gases and energy stored on the station."}, {"tag": "p", "text": "Naescorcom leaders of Ipsus have claimed mining rights on the inhospitable moon of Ulbasca, disputing them to rival company SoroSuub, even though none of them have ever made a real effort to mine there."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}