{"url": "Irek_Ismaren", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Cyborgs", "Category:Dark Side Adepts", "Category:Humans", "Category:Jedi hunters", "Category:Males", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Irek Ismaren"}, {"tag": "p", "text": "Irek Ismaren was a Human male from the planet Alderaan, the son of Sarcev Quest and Roganda Ismaren, one of Emperor Palpatine's concubines. Due to his mother's position, Irek was rumored to be the Emperor's son, and Roganda cultivated these rumors, raising her son as a possible heir to the throne. Irek was Force-sensitive, and he began to train in the dark side of the Force from an early age under the tutelage of his mother and the Imperial scientist, Nasdra Magrody. When Irek was five, Magrody installed a subelectronic converter into his brain, allowing him to control droids and computers through the Force. Midway through Irek's training, Palpatine was killed in 4 ABY at the Battle of Endor, but the eight-year-old Irek was not ready to stake a claim to the Empire. His mother retreated with Irek to her childhood home on Belsavis, continuing Irek's training to prepare for a future bid for the throne. In 12 ABY, Irek's mother had formulated a plot to reunite the fractured Empire and place Irek as the new Emperor. Irek used his abilities to summon the Eye of Palpatine, a massive dreadnaught abandoned in the Moonflower Nebula. The ship was to be a bargaining chip for financial backers from Senex-Juvex, who would use the Eye of Palpatine as the centerpiece of an allied fleet that would help them rebuild the Empire. However, when the dreadnaught arrived above Belsavis, Irek found that he could no longer control it. Irek and his mother abandoned Belsavis, and the ship was destroyed by saboteurs from the New Jedi Order."}, {"tag": "p", "text": "Irek and his mother made their way to Coruscant where they took up residence in a hidden laboratory. While there, Irek was subjected to growth hormones and cybernetic enhancements, greatly increasing his strength and causing him to grow to three meters in height. Additionally, lightsabers were installed in his elbows, forearms, wrists, and knees. During this transformation, Irek's mother recruited Lord Cronal to continue his training. However, during one of his lessons, Irek instigated a lightsaber duel with Cronal. He was able to defeat his teacher, but sustained a lightsaber thrust through the skull. Brain-dead, Irek was placed into suspended animation by his mother as she attempted to repair him. The damaged parts of Irek's mind were replaced by computer parts, but his personality and identity was gone. Desperate for her son to return, Roganda planned to install operational programming and memories into Irek to bring him back. Before this could occur, a groundquake caused by the Yuuzhan Vong's conquest of Coruscant freed Irek from stasis. With no knowledge of who he was or what had happened to him, he murdered his mother and escaped from the laboratory, seeking out a wellspring of Force energy nearby. The wellspring was protected by the ruins of the old Jedi Temple, and Irek commanded legions of displaced refugees to help him break past the barrier. His minions, frightened of Irek's monstrous form and incredible powers, dubbed him Lord Nyax, from the Corellian legend about a dark spirit. With no knowledge of his own past, Irek took up the moniker for himself. Irek eventually broke into the Force nexus, granting him greater control over the Force than ever before. However, he was confronted by a taskforce led by Jedi Master Luke Skywalker. One of the Jedi in the taskforce, Tahiri Veila, used Yuuzhan Vong technology, unable to be sensed in the Force, to ambush \"Lord Nyax\". Badly injured by thud bugs, Irek fell, using the last of his energy to propel a torrent of rubble and debris at his attackers. The effort imprinted Irek's anger and frustration in the area where he had collapsed. Skywalker and the other Jedi sensed Nyax's death through the Force, but later reports claimed that he escaped."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Childhood"}, {"tag": "p", "text": "Irek was born on the planet Alderaan, in 4 BBY. He was the son of Roganda Ismaren and Sarcev Quest, who were both Emperor's Hands, elite dark side users that reported directly to Galactic Emperor Palpatine. From his birth, Irek was rumored to be the son of the Emperor, due to his mother's role as one of Palpatine's concubines. His mother cultivated these rumors, hoping to set her son up as the heir to the Imperial throne. While still a child, Irek began to train in the dark side of the Force under his mother, who hoped to develop him into a talented Force user. To aid her son's progress, Roganda kidnapped the Imperial scientist Nasdra Magrody to help train Irek. Magrody was chosen due to his research into the possibility of implanting a device into a Force-sensitive's brain to allow that person to manipulate technology through the Force. When Irek turned five, the captive Magrody implanted his invention, a subelectronic converter into Irek's brain, allowing the young boy to use the Force to affect machinery. Two years later, at the age of seven, Irek began further training in the dark side of the Force, overseen by Magrody, who had a modicum of Force-sensitivity. Magrody also schooled Irek in scientific lessons, using accelerated learning techniques that he had developed at Omwat orbital station. Through the use of his subelectronic converter, Irek was taught to control machines through the Force by visualizing their schematics. To accomplish this, Irek studied a wide variety of technology and memorized common droid graphics."}, {"tag": "p", "text": "In 4 ABY, Emperor Palpatine was killed in the Battle of Endor. This badly damaged Roganda's plans for Irek to take the throne, since he was only eight years old, and Roganda did not have the support to repel others who were vying for the Imperial throne. When Trioculus was crowned Emperor by the Central Committee of Grand Moffs on the claim that he was Palpatine's legitimate son, the Ismarens realized they had missed their chance, and they departed from Coruscant. They attempted to find refuge on a number of worlds still loyal to the Emperor's memory, but persons there remembered Roganda's days as Palpatine's concubine, and would not allow her to stay. By 5 ABY, the Ismarens had settled on the world of Belsavis in the village of Plett's Well to wait for the right opportunity to return to the Empire."}, {"tag": "h3", "text": "Training on Belsavis"}, {"tag": "p", "text": "Irek's mother had chosen Belsavis due to previously living on the world during her youth. However, over the intervening years since Roganda had resided in Plett's Well, the village had become a hub for smuggling activities. The operation was led by the town boss, Nubblyk the Slyte, who had access to a wealth of salvage located in an underground city below Plett's Well. The abandoned city, which Irek's mother was familiar with, had been previously used by Jedi refugees hiding from the Galactic Empire. Roganda arranged Nubblyk's disappearance, and the Ismarens took possession of his home, a place on Painted Door Street. To keep the smuggling business of Plett's Well from drawing attention to them, Roganda orchestrated the disappearance of several other smugglers who had worked for Nubblyk, including Mubbin the Whiphid and Drub McKumb, crippling their operation and ensuring that Plett's Well would be left in obscurity. The captive smugglers were then brainwashed and drugged to use as guards for the underground city. Irek also used his powers to command the local kretch creatures, using them as additional protection for the hidden city. Irek continued his training on Belsavis under Magrody, who was kept imprisoned in the Jedi settlement and forced to continue Irek's lessons under threats to his wife and daughter, Elizie and Shenna. Jedi training tools left behind in the underground city were given to Irek to help develop his Force powers. By the time he had turned twelve, Irek was well versed in Magrody's lessons, knowledgeable enough for an advanced degree in subelectron physics or a position as a droid motivator technician."}, {"tag": "p", "text": "By the time Irek had turned thirteen, his control over droids and other technology through the subelectronic converter implant was considerable. He was able to alter sensor fields and stayed abreast of all new standard droid models. Due to his training, Irek developed into a talented Force-user, more powerful than his own mother. Although skilled in the Force, Irek resented the demanding nature of his training, and as a form of rebellion, he would occasionally cause droids in Plett's Well to malfunction and dabbled in substances such as yarrock that he knew his mother would disapprove of. After Irek had learned all that he could from Magrody, his relationship with the Imperial scientist ended. Irek eventually came into possession of a black-hilted lightsaber with an amber blade, but was less than skilled with its use."}, {"tag": "h3", "text": "Bid for the throne"}, {"tag": "p", "text": "By 12 ABY, Irek's mother had decided that the time was right to make a bid for the Imperial throne. To do so, Roganda developed a plot involving the aristocratic lords of the Senex and Juvex sectors. Using his mastery over technology, Irek summoned the Eye of Palpatine, a colossal asteroid shaped dreadnaught that had been disabled in the Moonflower Nebula in 18 BBY. The Ismarens recruited Ohran Keldor, the original designer of the vessel, into their scheme, so that Irek could learn the schematics of the Eye of Palpatine, which would allow him to take control of it. From a great distance, Irek was unable to take direct control of the battlemoon, but he was able to activate a signal relay that had been damaged on the ship. With the relay activated, the Eye of Palpatine returned to its previously programmed mission, the destruction of the underground Jedi settlement on Belsavis. The Ismarens hoped that once the device was in range of Belsavis, Irek could take full control over the ship. Using the promise of control over the Eye of Palpatine as a bargaining chip, Roganda requested financial and military support from Senex-Juvex in a campaign to reunite the fractured Empire and place Irek as the new Emperor. The heads of six or seven noble houses who had tried to stay out of the Galactic Civil War, including Lord Garonnin and Lord Drost Elegin, agreed to come to Belsavis to hear the Ismarens' proposal. Additionally, ex-governors from the worlds of Veron and Mussubir Three, and the heads of the Mekuun and Seinar Corporations also agreed to the meeting."}, {"tag": "p", "text": "As preparations for the meeting began, the Ismarens' plan was interrupted by the arrival of the Chief of State of the New Republic, Leia Organa Solo. She had come to Belsavis with her husband Han Solo, his copilot Chewbacca, and the astromech droid R2-D2. Organa Solo and her husband had come to the planet to investigate claims from the crazed Drub McKumb, who had escaped his captivity from under Plett's Well and told them of the Jedi settlement on Belsavis. Upon their arrival, the group discovered the drugged and brainwashed smugglers protecting the tunnels into the underground city. Worried that Organa Solo would uncover their plotting, Irek used his abilities to take control of R2-D2, ordering the droid to assassinate the group. However, the droid was caught in the act and deactivated, foiling the attempt. The apparent malfunction of their droid increased Organa Solo's curiosity, and she uncovered the plot when she witnessed the Ismarens and their allies, Drost Elegin, Ohran Keldor, and Garonnin descending into the tunnels below Plett's Well. When Organa Solo pursued them, the group captured the Chief of State, using Irek's control of the kretch. However, her droid, R2-D2, broke away from their grasp when Irek was unable to control the droid due to it being rewired following the first attack. No longer familiar with the droid's schematic due to its rewiring, Irek was unable to command R2-D2 as before, and the droid escaped out of the tunnels. Furious over his failure, Irek wanted to kill Organa, but Roganda and her allies knew that the Chief of State would be much better use as a hostage, and they imprisoned her in the underground settlement."}, {"tag": "h3", "text": "Meeting the supporters"}, {"tag": "p", "text": "With the Chief of State imprisoned, the Ismarens prepared to host their potential supporters. The large contingent that arrived on Belsavis included Lady Theala Vandron of Karfeddion, Lord Vensell Picutorion, Lady Carbinol, one of the lords of House Sreethyn, representatives of the Mekuun Corporation, and the president of the board of directors of the Seinar Corporation. Before the banquet began, Irek visited Organa Solo, as he had left a pouch of yarrock drugs in a secret chamber within her cell. He used the drug to calm his nerves before the meeting. Dressed in a conservative black outfit, Irek charmed the guests, convincing them that his control of the Eye of Palpatine would be the start of an allied fleet that would put the group in a position of power against the New Republic. During the meeting, Irek sensed Organa Solo projecting her spirit into the banquet hall. Still angered over Organa Solo humiliating him, Irek decided to capture Organa Solo's spirit, imprisoning her outside her body. One of the Jedi training tools from the underground settlement had been designed to project one's spirit inside it, and Irek brought the device to Organa Solo's cell. When she attempted to return to her body, Irek attempted to draw her inside, but he was interrupted by the arrival of the Eye of Palpatine. Organa Solo was able to return to her body as Irek returned to the meeting."}, {"tag": "p", "text": "With the Eye of Palpatine arriving, Irek overloaded the central servomotors controlling the landing silos to keep those on Belsavis from leaving before they could witness the battlemoon's power. However, when the weapon came in range of the planet, Irek found that he could not control it, despite being familiar with the ship's design. Unknown to the Ismarens, the Jedi Master Luke Skywalker had damaged the computer core, keeping Irek from tapping into the battlemoon's systems. The Ismarens believed that Irek's inability to control R2-D2 earlier was tied into his struggle to control the Eye of Palpatine, and they summoned Organa Solo to interrogate her. The Alderaanian princess revealed that R2 had been rewired, which caused Keldor and the Ismarens to surmise that the battlemoon had been damaged. As the landing silos had been shut down, the group planned to commandeer Theala Vandron's shuttle to board the Eye of Palpatine and attempt to repair the weapon."}, {"tag": "h3", "text": "Defeat and escape"}, {"tag": "p", "text": "As the group readied to depart Belsavis for the Eye of Palpatine, Organa Solo alerted one of the financial backers, Garonnin, of their departure. To keep the man from revealing that he did not have control of the weapon, Irek killed Garonnin with his lightsaber, cutting him in half. In the commotion that ensued, Organa Solo fled into the tunnels, pursued by Irek and Keldor. Organa Solo jumped into the hanging vines of the underground city, swinging above a deep pit in her attempt to escape. Irek lunged after her, swinging his lightsaber and cutting the vines and catwalks above the chasm below. In the pursuit, Keldor was able to cut Organa Solo off, but the intervention of Han Solo resulted in Keldor falling to his demise. Irek did not attempt to save Keldor and ran back to his mother. Without Keldor's help, the Ismarens could not fix the Eye of Palpatine, and they abandoned their plans and their potential supporters. Making their way out of the tunnels, Irek and his mother incapacitated the guards watching over Lady Vandron's Tikiar starship and used it to depart Belsavis. Following their departure, the Eye of Palpatine arrived above Belsavis, ready to bombard the planet. However, Luke Skywalker and one of his students, Cray Mingla, had activated the self-destruct of the ship, and before it could begin its attack, the battlemoon exploded."}, {"tag": "p", "text": "The Ismarens made their way to the Atravis sector, where heavy concentrations of Admiral Harrsk's troops had been reported. The New Republic's Admiral Ackbar eventually gathered intelligence on their destination. To counteract Irek's abilities with electronics, the Republic planned to modify the schematics of their starfighters and warships to keep them from being sabotaged and to keep Harrsk from using the Ismarens in his attacks against the New Republic. The individuals who had come to Belsavis to listen to the Ismarens' proposal were not charged for their involvement, due to the fact that they had only listened and not acted upon the plan."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "By 14 ABY, Roganda and Irek Ismaren had settled back on Coruscant and obtained a handful of Sith scrolls containing information on the ancient art of mechu-deru, of which Irek's brain implant gave him an enhanced mastery. These scrolls also contained the secrets of the Draggulch Period Dark Lord Belia Darzu. In a laboratory inside the Bluenek Section Pasarian Memorial Atmospheric Reclamation Complex Project on Coruscant, the Ismarens made their residence. While there, Roganda hired Lord Cronal, a former Prophet of the Dark Side, and Emperor's Hand to continue Irek's training. Fearing that other Force users might discover them, Irek's mother brought ysalamiri from Myrkr to mask their presence. A group of scientists placed Irek into suspended animation, and while there, his mother had scientists modify Irek's body. Muscle mass and bone were added to his frame and lightsaber blades were implanted into his wrists, elbows, and knees. Fail-safes were also installed to automatically deactivate the implanted lightsabers if they came into contact with his body, keeping Irek from impaling himself. Activation of these lightsabers were also hardwired to his subelectronic converter to give him greater control. However, during one of her son's lessons, Irek lost his temper, initiating a lightsaber duel with Cronal. Although Irek's skill with a lightsaber was poor, records showed that Cronal was killed in the fight. However, Cronal was actually able to escape, using technobeasts but not before stabbing Irek through the head with his lightsaber. Irek was brain-dead, but Roganda and her medical droids were able to maintain his autonomic functions and keep his body alive."}, {"tag": "p", "text": "Over the years, his mother ordered medical droids to subject Irek to growth hormones and cybernetic stimulation. Under these conditions, Irek grew to three meters in height. Armor plates were installed in his head, torso, elbows, and knees, and the missing portions of his brain, mostly those pertaining to human memory, were replaced with cybernetics. During Irek's transformation, the droids working on him were programmed to not record his presence, keeping the efforts to repair Irek hidden. Irek's subelectronic converter was also augmented, so that it would stimulate the remaining portions of his brain to increase his control over the Force. However, these efforts could not repair Irek fully, and he was unable to speak or remember his past life. Desperate to bring her son back, Roganda created operational programming and prefabricated memories in an attempt to fully restore Irek, at least artificially. Before this programming could be installed in Irek's destroyed brain, Coruscant fell to the Yuuzhan Vong and a groundquake caused ceiling rubble to drop on Irek's suspended animation chamber, also killing one or more of the ysalamiri. Irek, his brain devoid of anything but his implant, his instincts, some combat programming, and some deep-level motivations like killing Jedi and taking over Force nexuses, awoke and killed his mother, cutting her into approximately eight pieces with his lightsabers. Irek escaped the laboratory and began to wander the surface of Coruscant."}, {"tag": "h3", "text": "Force nexus"}, {"tag": "p", "text": "Upon his escape, Irek sensed the power of a Force nexus nearby and he made his way there. During his trek, he encountered Yuuzhan Vong Warriors in the Government district and massacred them. During this attack, Irek sensed the fear of a Corellian named Yassat. The man, remembering stories of his childhood about the dark spirit known as Lord Nyax, believed that Irek, with his projection of dark side energy, was the same evil spirit. Irek pursued Yassat, but he escaped when he led Ismaren to a group of cannibals led by a man known as Skiffer. Skiffer's group attacked Irek, but they experienced the same fate as the Yuuzhan Vong, hacked to pieces by Irek's lightsabers. Irek eventually arrived at a large black wall that was part of the old Jedi Temple. The wall was protecting a well of Force energy, but even with his implanted lightsabers and great strength, he was unable to get past it. However, Irek sensed a man named Ryuk nearby, and he projected an image of getting past the wall into his brain, ordering him to find a method to cut through the black wall. Ryuk brought a flame torch to the wall, but it was unable to cut through, and Irek telekinetically smashed Ryuk against the wall, killing him."}, {"tag": "p", "text": "Still determined to break through, Irek gathered a large contingent of workers with his powers. The group were able to cause some damage to the wall but were largely ineffective. However, one of the women who was working envisioned a large construction droid smashing through the barrier, and Irek mentally ordered her to retrieve one. A damaged construction droid was found in the wreckage of a building by Irek's workers, and they began to slowly repair it. Many of these workers also believed as Yassat did, that Irek was the actual Lord Nyax from legend. Because he had no idea who he was or what had happened to him, Irek determined that \"Lord Nyax\" was his true identity. As the work continued, Nyax sensed someone searching for him through the Force, and he went out to meet them, planning to bend them to his will. During his search, he instead discovered a Yuuzhan Vong war party led by Denua Ku, Raglath Nur, and Viqi Shesh. The Yuuzhan Vong were also accompanied by voxyn, Force-sensitive beasts that had been engineered to hunt Jedi. Nyax easily defeated this party, killing the voxyn first. However, Viqi Shesh escaped, and Nyax pursued her as she fled, killing anyone who stood in his way. The woman escaped by climbing into a small shaft that Nyax could not fit into, and Nyax abandoned his pursuit."}, {"tag": "h3", "text": "Confrontation"}, {"tag": "p", "text": "As the work continued on the damaged construction droid, Nyax sought out those that were pursuing him, discovering a taskforce led by Luke Skywalker. Nyax delved into Skywalker's mind, trying to force the Jedi Master to jump to his death, but he was unsuccessful. Additionally, Denua Ku, who had also escaped, returned with Viqi Shesh, almost two dozen warriors, and another voxyn to kill Lord Nyax. Shortly after his slaves had finished repairing the construction droid, the Yuuzhan Vong began their attack. Compelled by Lord Nyax, the unarmed slaves attempted to overwhelm the warriors but were cut to pieces by Denua Ku's men. However, the distraction allowed Nyax to cut their voxyn in half and prevented the Yuuzhan Vong from surrounding him. In the ensuing fight, Nyax repelled their razor bugs and thud bugs, using his implanted lightsabers to tear through their ranks. However, the Yuuzhan Vong were joined by Luke Skywalker and his fellow Jedi, Tahiri Veila, and his wife, Mara Jade Skywalker."}, {"tag": "p", "text": "Working together, the Yuuzhan Vong and the Jedi pushed Nyax back, but he activated the construction droid, tearing apart the complex where they were fighting. Denua Ku and his warriors were killed in the wreckage, and Nyax was able to escape. As the droid made its way towards the black wall, Nyax led the Jedi on a chase, trying to keep them from deactivating his droid before it could reach the ruins of the Jedi Temple. Yuuzhan Vong warriors who spied the construction droid rushed to destroy it, but Nyax commanded his slaves to ward off the attack. As the fighting intensified, the construction droid reached the black wall and began to smash through it. Nyax was forced to engage the Jedi again when they arrived at the black wall, keeping them from stopping his droid. Just as the Jedi had taken the upper hand against him, the construction droid blasted through the wall, releasing the energy behind it."}, {"tag": "p", "text": "With the wall breached, Nyax accessed the Force wellspring within it to grow even more powerful. He released the people he had enslaved to his will and used the Force to levitate himself above the Force nexus, bathing in its power. Yuuzhan Vong coralskippers, drawn by the commotion, attacked Nyax, but he smashed them apart with massive chunks of rubble. The Jedi continued their attack, also using the Force wellspring to augment their powers. As the two Skywalkers distracted Nyax, Veila surprised him with a trio of thud bugs, which he could not detect in the Force, shattering his lower back. Nyax fell into a pit within the ruined Jedi Temple platform, where he lay injured, but managed to tap into the Force nexus beneath the Temple. Sensing that two Yuuzhan Vong mataloks were approaching, and believing that the Jedi had taken refuge aboard the alien ships, he hurled several tons of rubble into the air, in an attempt to knock them out of the sky. The cruisers responded with a plasma cannon volley, and after a brief flair of pain, Nyax's grip on nearby beings seemed to fade. Nevertheless, columns of rubble continued to fly out of the Temple ruins and target the Yuuzhan Vong capital ships, which continued to fire back in a bizarre duel in the skies of Coruscant."}, {"tag": "p", "text": "Watching the events, Luke Skywalker sensed that Nyax had died in the initial bombardment, and that all that remained was his last intention to destroy the mataloks, imbued on the surroundings and guiding the Force energy from the nexus. However, later reports claimed that Nyax had in fact survived, and escaped."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Irek Ismaren was a wiry, slender young man with aristocratic features, distinguished by a prominent nose. He had curly shoulder-length black hair, the same color as his mother's, and eyes of a sea-blue color. His skin was slightly golden in color, but due to spending the majority of his life in the underground city of Plett's Well and in an underground laboratory on Coruscant, his skin was pale from lack of sunlight. Due to his training, Irek had a great knowledge of technology, and by age thirteen, he could qualify for a number of scientific degrees. He could also read and write Binary and also speak it. Following his transformation into a cyborg, Irek was no longer slender, having developed increased muscle mass and height through growth hormones and cybernetic stimulation. He had plates of armor surgically installed in his torso, elbows, knees, and head, but was still recognizable by his curly black hair. Additionally, due to being kept in suspended animation during his transformation, his aging was suspended, and despite being around thirty years of age in 27 ABY, he was physically younger, with the look of a youthful man."}, {"tag": "p", "text": "While on Belsavis, Irek dressed in simple conservative garments, but he carried himself with confidence and a sense of superiority. The implantation of the subelectronic converter gave Irek a strong sense of focus, bordering on monomania, and he thought very highly of himself. Irek also dabbled in use of the drug yarrock, believing that it would help increase his focus and Force abilities, despite its addictive nature. Irek was able to charm those who he wished to influence, showing good manners and tact to convince others to support him. He also played the role of a dutiful son, obeying his mother in front of others. However, Irek had a rebellious and petulant nature. His use of drugs was partly to spite his mother, and he would use his gifts to control droids for cruel pranks, forcing them to do things for his own amusement. This childish arrogance eventually led to him being badly injured by Lord Cronal, as he lost his temper during a lesson with the Dark Jedi and foolishly engaged him in a duel."}, {"tag": "p", "text": "After Irek was rendered brain-dead, he lost his identity and personality. Besides the armor plates, he wore a faded kilt-like wrap around his midsection. His hands were covered by fingerless gloves, and various shiny items dotted his body. With the great damage to his brain, Irek had very little humanity left and was driven only by a need for power and control over others. When Luke Skywalker confronted him, he attempted to reach the man that Irek had been before, but he could find no trace of him. However, some of his dark nature remained, as he found joy in slaughtering Yuuzhan Vong and was elated by the thought of conquering Coruscant and bending the minds of those that lived there to his will."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Irek was very talented in the Force, a prodigy with abilities much greater than his age would suggest. He had an unique control over machines, granted by a subelectronic converter implanted in his brain that allowed him to use mind tricks on droids. However, his control was based on memorizing the schematics of the devices he was attempting to tap into. This resulted in a weakness to his ability; if the schematics changed even slightly, he could no longer control the object. He was talented in telekinesis, able to choke individuals through the Force. He used it on Leia Organa Solo, all the while dueling her simultaneously; Organa Solo barely managed to hold the choke hold off with her strength in the Force. He could also influence minds, being able to instill a sense of fatigue in his targets. He had a minor talent with the lightsaber, but wielded it poorly and in an unorthodox manner. Instead of using a two-handed grip, he wielded it with one hand, in the fashion of an aristocratic dueler."}, {"tag": "p", "text": "As Lord Nyax, the training Irek had accumulated was lost, and he only had raw uncontrolled power. With his augmentations, he possessed immense physical strength, having been medically altered to grow well past a normal human size. Eight lightsabers were surgically implanted into his body along with sub-dermal armor pads, and he wielded them instinctively, slashing wildly at his enemies. His subelectronic converter had been modified to stimulate parts of his brain and grant him greater mastery over the Force. His telekinetic powers and power over minds increased dramatically as a result. Unable to speak, he forced images into sentient brains to communicate. With this ability, he was able to compel individuals to work for him, forcing them into service against their will. His incredible power made him a beacon in the Force, easily noticeable by those with Force-sensitivity. His desire for dominance and power caused his abilities to be rooted in the dark side of the Force, affecting those that reached out to him with dark energy. After accessing the wellspring of Force energy under the Jedi Temple, Irek's abilities increased even further. He could use the Force to levitate and lift large columns of debris effortlessly. He was also almost powerful enough to convince trained Jedi to answer his bidding and obey his commands. Upon his defeat, he projected his will and anger into the area around his dying body, guiding telekinetic attacks despite succumbing to his injuries. Despite doing this, Nyax was able to survive, escaping from the pit he had fallen in."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Irek Ismaren was created by Barbara Hambly as one of the antagonists in the 1995 novel, Children of the Jedi. During the story, Irek is rumored to be the son of Emperor Palpatine by his concubine, Roganda Ismaren. However, in the story, Leia Organa doubts that this is his true parentage. This backstory was referenced in The Essential Guide to Characters, noting Irek to be the \"possible heir of Palpatine\". Irek's true parentage was eventually elaborated upon in the Star Wars Gamer 5 article, The Emperor's Pawns, which named Irek's true father as Sarcev Quest, a member of Palpatine's court. In 2002, Irek appeared in another novel, The New Jedi Order: Enemy Lines II: Rebel Stand by Aaron Allston. This story featured Irek heavily and explained that the character had been badly injured following The Children of the Jedi and transformed into a cybernetic monster. The character was defeated by the protagonists in the novel, who stated that they felt Irek die, but did not actually witness his death. However, in Lord Nyax's entry in 2008's The Complete Star Wars Encyclopedia, it states that \"a concerted effort to disable him using rocks and boulders proved effective enough to crush him to death.\" Despite this, the 2009 role-playing book, Jedi Academy Training Manual, claimed that Irek had survived the attack on Coruscant and escaped."}, {"tag": "p", "text": "Children of the Jedi was originally dated to 11 ABY according to Barbara Hambly. This date is implied in the novel, as it states that Yoda had died \"about seven years ago\". However, The Essential Chronology, and later, The Essential Reader's Companion dated the novel to 12 ABY. This movement of the timeline allowed the defeat of the Eye of Palpatine, which had occurred \"thirty years ago\", to happen after the events of Star Wars: Episode III Revenge of the Sith, which was dated to 19 BBY. However, this placement affected Irek's backstory and some of the ages stated in Children of the Jedi. In the novel, Leia states that Irek is \"fourteen or fifteen years old\", and The Essential Guide to Characters definitively states that Irek was fourteen at the time of Children of the Jedi. Moving the novel to 12 ABY has rendered some of these dates erroneous."}, {"tag": "p", "text": "In the Jedi Academy Training Manual, the entry on Irek Ismaren states that Irek and his mother escaped into the jungles of Belsavis after the destruction of the Eye of Palpatine and then later booked passage to Coruscant from Belsavis. This directly contradicts Children of the Jedi which shows the Ismarens commandeering a ship and escaping into the Atravis system. The image of the cyborg Irek in the Jedi Academy Training Manual does not perfectly match the description from Enemy Lines II: Rebel Stand. In the novel, Irek is described as wearing a kilt-like adornment and sparse armor on his head, torso, elbows, and knees, described as an \"inadequate set of armor\". However, the illustration shows Irek in full body armor, which also conceals the top of his head, despite the novel describing his hair. Despite this, the illustration shows lightsabers protruding from his elbows, forearms, wrists, and knees, the same orientations described in Enemy Lines II: Rebel Stand."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}