{"url": "Ire_Eleazari", "categories": ["Category:Legends articles", "Category:Healers and doctors", "Category:Ithorians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ire Eleazari"}, {"tag": "p", "text": "Ire Eleazari was a male Ithorian doctor. Unknown to Eleazari's herd, Oosea, one of their herd members began cooperating with the Galactic Empire. With his cooperation, the Imperials began plans to create a base on the planet Ithor. When Oosea was discovered, he framed Ire Eleazari. Eleazari was banished from the herd for 30 seasons after being framed, but worked with the Erling Tredway to clear his name. In the meantime, Oosea began working with the Imperials to track down and eliminate Eleazari so that he could not reveal his treachery to the herd and damage Imperial plans for Ithor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 0 ABY, Ire Eleazari was hiding in the Sil'Lume system in a secret asteroid base at coordinates 506.34-604.342-47.65. While he was hiding from Imperial agents, he encountered Luke Skywalker who was bringing the injured Dena Tredway to his asteroid for healing. Eleazari was a friend of the Tredway family and he agreed to allow Skywalker to land at his base to offload Dena, but requested that they leave quickly to keep from drawing attention to his location. As Skywalker left, he gave the Rebel pilot information on how to find Erling Tredway, Dena's brother, who was imprisoned in the Deathblock on Tol Ado."}, {"tag": "p", "text": "After Skywalker rescued Erling Tredway, he returned to Eleazari's and spoke with him about joining the Rebellion, as a doctor would be a valuable resource. However, Eleazari refused to join the Rebels until he had cleared his name by exposing Oosea's treachery."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ire Eleazari was created by Troy Denning and appeared in one of the role-playing strands of the 1990 West End Games role-playing supplement Jedi's Honor. Based on the player's choices in the scenario, Skywalker can witness Oosea working alongside the Imperials, exposing his treachery, but this adventure strand prevents Skywalker from completing his mission. If Skywalker does complete his mission, Oosea's treachery has not yet been exposed, but Eleazari is confident that he will soon gather information that Oosea is working with the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}