{"url": "Iridium", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Atrivis sector planets", "Category:Pentastar Alignment planets"], "nodes": [{"tag": "h1", "text": "Iridium"}, {"tag": "p", "text": "Iridium was a planet in the Atrivis sector of the Outer Rim Territories. It was home to the infamous Pirates of Iridium, who utilized Iridium \"power gems\" to disable the shields of their victims' starships, raiding Atrivis space lanes for a year. However, a task force of Jedi and Galactic Republic Judicials routed the pirates in a battle over Vuchelle in 22 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Iridium was a planet located in the Atrivis sector of the Outer Rim Territories. In the years leading up to the pan-galactic Clone Wars, the planet was home to the Pirates of Iridium. The pirates raided the trade routes of the Atrivis sector for a year, taking grain and spice shipments. The infamous pirates made use of Iridium \"power gems,\" which generated an aura capable of disrupting starship shields. This gave them a significant advantage in their raids, until they were routed by a force of Jedi Knights and Republic Judiciaries at a battle over the planet Vuchelle."}, {"tag": "p", "text": "Iridium fell within the borders of the Pentastar Alignment between the years 4 ABY and 12 ABY."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "During the early years of the Clone Wars, Iridium was inhabited by a pirate group known to include Humans such as Raskar. They were believed by Republic sources to be working as privateers for the Confederacy of Independent Systems, and made use of Longprow attack cruiser, #2 Warpod pinnaces, and Z-95 Headhunter starfighters; however they were completely routed and dispersed in 22 BBY at Vuchelle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Iridium was first mentioned in The Power Gem, a weekly comic strip written by Archie Goodwin and illustrated by Al Williamson, published weekly by the Los Angeles Times Syndicate from July to October 1982. The strip never specified Iridium was a planet, only using it as part of the organization known as \"the Pirates of Iridium;\" however, the Star Wars Encyclopedia later confirmed its status as a planet. The HoloNet News website again referenced the planet in the build-up to the release of Star Wars: Episode II Attack of the Clones, detailing the destruction of the Pirates first mentioned in the initial comic strip. It was later included in The Essential Atlas."}, {"tag": "p", "text": "The name of the planet, \"Iridium,\" appears to be a reference to the real-world element found in meteorites."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}