{"url": "Irmenu", "categories": ["Category:Legends articles", "Category:Belsmuth sector planets", "Category:Type I atmosphere planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Irmenu"}, {"tag": "p", "text": "Irmenu was an oceanic planet located in the the fringes of the Crombach Nebula, in the Belsmuth sector of the Outer Rim Territories. Isolated from the rest of the galaxy for millennia, it was a feudal world known for its seafaring and stern religious traditions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Irmenu's location in the hazardous Crombach Nebula contributed to its isolation from the rest of the galaxy. It was an ocean-covered planet with a single submerged continental shelf covering half its surface. The continental shelf was mostly covered with shallow seas, with the highest points reaching above the water to form island archipelagos. These islands ranged from sandy spits of land to crags of rock that could reach hundreds of meters into the air, topped by forests and meadowlands."}, {"tag": "p", "text": "Irmenu had a single large moon that followed an eccentric orbit. Consequently, the planet had dramatic and complex tides. Away from the continental shelf, Irmenu's oceans were deep and stormy and had numerous abyssal trenches."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Irmenu was one of the galaxy's many lost colonies; the circumstances of its founding by Human colonists were shrouded in mystery. An emperor ruled Irmenu centuries before the rise of the Galactic Empire, but the tyrannical imperial family was overthrown by the Irmenu aristocracy several centuries before the Battle of Yavin, leaving the imperial palace in ruins."}, {"tag": "p", "text": "The planet was rediscovered by the galaxy several centuries before the Clone Wars, which led to increased trade, as well as the offworld exile of those Iremnu that had fallen afoul of the Imperius priesthood. Tales told by these exiles made Irmenu an object of curiosity in the wider galaxy. Notable exiles during the Republic Classic era included Walon Vau, the son of the Count of Gesl who was exiled after a doomed love affair with the princess of a neighboring province. He later became a Mandalorian and a member of the Cuy'val Dar. Another such exile was Natasi Daala, who grew up on Botajef but later discovered that she was an Irmenu princess from a family whose holdings had been overrun and seized by rivals. The rest of Daala's family had been put to death, but a younger son of the victorious family took pity on the baby and smuggled her offworld, leaving her as a foundling at a Botajef orphanage."}, {"tag": "p", "text": "Around the time of the Galactic Civil War, Irmenu had a population of some 5 million Humans."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "A feudal, caste-based society, the Irmenu lived in kingdoms, holds and crofts and were ruled by an aristocracy of kings, dukes, counts, marquises, barons and cavaliers. These nobles had near-absolute dominion over commoners bound to them by ancient blood oaths. Irmenu noblemen were known to engage in ceremonious duels. Outside of this rigid social structure was the hierarchical priesthood of the Imperius, and the outcasts and excommunicates who had been exiled by them. Many of these exiles lived as pirates, and were simultaneously loathed as threats to the peace and envied and romanticized for their freedom."}, {"tag": "p", "text": "The Irmenu were excellent sailors, taught from birth to understand the workings of winds and tides and to map the shallow seas around their home islands. Wooden-hulled sailing ships like caravels and galleons were common sights in feudal fleets. Vendettas and wars of conquest between fiefs were common, and Irmenu nobles were expected to be good naval warriors and commanders. The Imperius prevented feuds from spiraling out of control with the threat of spiritual censure, which could be as extreme as excommunication and exile. The Imperius also operated the Imperial Irmenu Navy, which patrolled the seas, rescued sailors in distress, and fought pirates; tours of duty in the navy were a religious obligation for members of the aristocracy. Second sons who would not inherit wealth or a title would often go into its permanent service. Ancient Irmenu military doctrine had it that prisoners of war were both burdens to their captors and liabilities to their own side, and warned against either taking prisoners or surrendering. Rumor had it that this doctrine continued to by practiced as late as the Clone Wars."}, {"tag": "p", "text": "Irmenu maintained contact with the greater galaxy via a single spaceport run by the Imperius, which had allowed some technology like blasters and comlinks to reach the planet. These formed somewhat incongruous sights when used aboard ancient wooden-hulled caravels and galleons flying heraldic banners. The Counts of Gesl even maintained a bank vault in the Dressian Kiolsh Merchant Bank on Mygeeto to store their fortune. However, both the Imperius and the Irmenu themselves were ambivalent about such contact. One benefit of contact, however, was that Irmenu who ran afoul of their society's mores could be exiled to other worlds instead of to inhospitable islands."}, {"tag": "p", "text": "The Irmenu had a story of a warrior-sailor known as Darakaer in their folklore. It was said that he would come to their aid should they ever need it if they summoned him by beating his ancient drum. Natasi Daala was inspired by the story to create a coded signal she gave to Gilad Pellaeon to use should he ever need to summon her after her self-imposed exile from the galaxy at large in 12 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Irmenu was first introduced to Star Wars Legends in the Republic Commando novel True Colors, written by author Karen Traviss and published October 30, 2007. Subsequently, the planet went on to receive mentions and references in a number of other Traviss works, including True Colors' sequels, Order 66 and Imperial Commando: 501st, the Star Wars: Legacy of the Force novel Legacy of the Force: Revelation, and her two Star Wars: The Clone Wars tie-in novels, the film novelization and No Prisoners."}, {"tag": "p", "text": "Irmenu received a brief mention in Star Wars reference guidebook The Essential Guide to Warfare, co-authored by Jason Fry and Paul R. Urquhart, and published April 3, 2012. The world was originally set to feature more prominently in the book, but a section on Irmenu was cut from the final draft, only to later feature in the fifth installment of Jason Fry's official Star Wars Blog series, Star Wars: The Essential Guide to Warfare Author's Cut."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}