{"url": "Irol_Faunor", "categories": ["Category:Legends articles", "Category:Assassins", "Category:Bounty hunters", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Irol Faunor"}, {"tag": "p", "text": "Irol Faunor was a male Human bounty hunter and assassin who worked with his brother, Nevo Faunor on many jobs. Irol was experienced in his work, but he, his brother, and their hired help had to abandon their capture of a scientist named Min Erethen because they were chased off in combat by another group of mercenaries. Irol and his brother paid their men well, the men were loyal to them, and the men each had a blaster cannon. Irol was armed with a DL-12 heavy blaster pistol and a LaserHone Duelist vibrorapier, which he favored over the blaster. He usually wore a combat jumpsuit for protection."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Irol Faunor had a good deal of experience and success as a bounty hunter and assassin. He preferred using stealth to take out his enemies, but he would charge and attack out in the open if stealth was not an option. If he was heavily wounded while trying to apprehend or kill a bounty, he would give up on the job and retreat."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Irol Faunor was trained in the use of blaster pistols, blaster rifles, vibro weapons, and heavy weaponry. Faunor also had training in the use of light armor. He was good at obtaining information individual and also was trained in tracking people, both of which aided him in his profession of assassination and bounty hunting. Faunor was a highly trained pilot, and he was also skilled in using computers and had some repair skills."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When on the mission to Krykas V to either capture or kill Min Erethen, Irol Faunor was armed with a DL-12 heavy blaster pistol and a LaserHone Duelist vibrorapier, which he favored over the blaster. He also wore a combat jumpsuit for protection."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Irol Faunor made his first appearance in Bloodhawk Down, a free Star Wars Roleplaying Game adventure written by Owen K.C. Stephens and posted on the Wizards of the Coast website on October 10, 2002. The adventure was for use in any era, so identifying the era in which Irol Faunor appeared is impossible. In the adventure, Irol Faunor, along with his brother, Nevo Faunor, and their hired help, were the enemies of the player characters. Due to the randomness of a roleplaying adventure whether the player characters or the Faunors win the battle, but if the Faunors won the battle they were gong to kill Min Erethan since the player characters got there first. However, the Faunors may retreat due to being injured, or they could be killed by the characters run by the players."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}