{"url": "Iron_Knight", "categories": ["Category:Legends articles", "Category:Iron Knights", "Category:Jedi organizations"], "nodes": [{"tag": "h1", "text": "Iron Knight"}, {"tag": "p", "text": "The Iron Knights were Force-sensitive Shards that trained under the Sunesi Jedi Master Aqinos. Like all Shards, the Iron Knights required droid bodies to interact with the world, hence their name. They used Juggernaut war droids, FLTCH-series battle droids, and Uulshos justice droids as their hosts. Many Iron Knights took as their name that of lightsaber crystals, reflecting both their connection to the Force and their crystalline bodies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Their first major appearance in the galaxy was at the Arkanian Revolution, where they assisted a team of Jedi sent by the Republic to end the conflict. The Jedi Council, however, was horrified that Aqinos had taught inorganic crystals about the Force, and felt that they could not truly understand the Force. Aqinos was excommunicated, and the Iron Knights went with him. Many survived the Great Jedi Purge by hiding out on the planet Dweem."}, {"tag": "p", "text": "They were later discovered by a group of students from the New Jedi Order, who put together clues provided by Callista Ming. After hiding out for 70 years, the Iron Knights were keen to rejoin the galaxy, and were accepted into the new Jedi Order without prejudice."}, {"tag": "p", "text": "Iron Knights were on the front lines against the Yuuzhan Vong, and fought on the planets Osarian and Uffel—against the Red Knights of Life—and reportedly even saved Kligson's Moon. When Hosk Station was destroyed, one Iron Knight, Luxum, was driven to the dark side."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the comic Jedi Academy: Leviathan there appears to be a droid sitting in the Jedi Praxeum cantina. When asked about this character on the Jedi Council Forums, Abel G. Peña replied that \"the timing seems just about right, so I'd say that mug-of-something drinking droid is an Iron Knight, all right.\""}, {"tag": "p", "text": "In an earlier draft of Droids, Technology and the Force: A Clash of Phenomena, Peña had included an adventure seed where a group of Iron Knights went in search of Skippy, an R5-D4 unit portrayed as Force sensitive in the Tales comic \"Skippy the Jedi Droid\". The explanation was to be that a Shard lived in the droid, but Peña felt the idea was \"too warped\" and so removed it from the final version."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}