{"url": "Iron_Fist_(Executor-class)", "categories": ["Category:Legends articles", "Category:Executor-class Star Dreadnoughts of the Galactic Empire", "Category:Flagships", "Category:Zsinj starships"], "nodes": [{"tag": "h1", "text": "Iron Fist (Executor-class)"}, {"tag": "p", "text": "Iron Fist was an Executor-class Star Dreadnought, under the command of Imperial Admiral Zsinj. Originally named Brawl, it was renamed by Zsinj after his first command. The ship went on to become the symbol of Zsinj's reign during his breakaway from the Empire, serving as his flagship."}, {"tag": "p", "text": "Iron Fist was employed against both the New Republic and the Galactic Empire by Zsinj throughout the ship's career. It spearheaded attacks at both Noquivzor and the ambush at Alderaan against the New Republic and at the Battle of Kuat against the Empire. Zsinj's flagship, believed destroyed in the aftermath of the Battle of Selaggis, survived to return to Zsinj's Dathomiri shipyards, where it was ultimately destroyed by General Han Solo and the Hapan Royal Navy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally commissioned as Brawl, this vessel was the fourth Executor-class Star Dreadnought produced for the Imperial Navy."}, {"tag": "p", "text": "The ship was given to Captain Zsinj by Emperor Palpatine upon his promotion to Admiral shortly before the Battle of Endor and promptly rechristened the Iron Fist in honor of his original command, becoming the heart of the reinforced Queli sector fleet Zsinj commanded."}, {"tag": "h3", "text": "Flagship of Warlord Zsinj"}, {"tag": "p", "text": "The vessel soon became a great thorn in the side of the New Republic during Zsinj's bid for power as an Imperial Warlord.  The Battle of Corsin (5 ABY) saw the ship overwhelm Admiral Kalback's attempt to establish a foothold in the Galactic North, winning the world for Zsinj."}, {"tag": "p", "text": "In the events surrounding the Fall of Coruscant to the New Republic, Zsinj began to use Iron Fist more overtly against the Republic, bombarding Noquivzor after Rogue Squadron destroyed one of his scouting probes to the system. Though the vessel caused significant damage to the base, the Rogues had already left on a covert assignment to Coruscant."}, {"tag": "p", "text": "Iron Fist would also later intercept a bacta convoy in the Graveyard of Alderaan, destroying all of the freighters except the Pulsar Skate along with an ersatz Rogue Squadron made up of Imperials that were dispatched by Imperial agent Kirtan Loor. Zsinj would later excuse his destruction of the valuable bacta by claiming that Rogue Squadron had tainted it."}, {"tag": "h3", "text": "Against the Wraiths"}, {"tag": "p", "text": "The destruction of the bacta convoy forced the New Republic to step up its efforts against Zsinj. Iron Fist became the subject of numerous sabotage attempts and attacks as Wraith Squadron and the Solo Fleet attempted to hunt her down. The Wraiths correctly theorised that Zsinj saw Iron Fist as a status symbol of his rise from relative obscurity to the most powerful warlord in the galaxy, and accurately guessed that as he believed he was the only one capable of operating such ships, he would attempt to acquire another ship like it. The Battle of Kuat saw the Iron Fist at the head of Zsinj's attempt to steal another Executor-class Star Dreadnought, the Razor's Kiss. Iron Fist's firepower heavily damaged and possibly destroyed Mauler during Zsinj's escape, but the subsequent Battle for the Razor's Kiss saw the Razor's Kiss destroyed and Iron Fist forced to flee after Voort saBinring destroyed one of its shield generator domes."}, {"tag": "p", "text": "Following this setback, Zsinj increasingly saw the conflict as a personal duel between himself and Han Solo. The Battle of Levian Two saw Iron Fist clash once more with its New Republic counterpart Mon Remonda, failing to destroy it due to the fighter tactics of Wedge Antilles and tactical mistakes by Zsinj. As Zsinj's Empire came under increasing attack from both Solo's fleet and Teren Rogriss' Imperial ant-Zsinj taskforce, Zsinj realised that his opponents were obsessed with Iron Fist's destruction and devised a plan to appear to give them what they wanted while still retaining his flagship. He gathered as much wreckage of the Razor's Kiss as he could, incorporating it into a decoy vessel called the Second Death. The Second Death was set to be destroyed when Zsinj show his enemies a destroyed Star Dreadnought, giving the illusion that the Zsinj's flagship had been destroyed. In the meantime, Zsinj became exceedingly cautious about risking the ship, refusing to bring her into any gravity wells in case he was unable to flee. This led his enemies to collaborate in the Battle of Vahaba, with an Imperial Interdictor cruiser brought in to prevent the ship's escape. The plan failed due to  Zsinj sacrificing several of his own ships, but Lara Notsil, a former Wraith determined to bring Zsinj down from the inside, sabotaged the ship's hyperdrive and broadcast the ship's location to Solo's forces. The subsequent Battle of Selaggis saw Iron Fist badly damaged by Mon Remonda and her starfighter complement, but Zsinj's foresight in creating Second Death paid off as the ship's Orbital nightcloak fooled New  Republic sensors into losing track of the Star Dreadnought. Iron Fist fled to hyperspace as Second Death detonated, with the Razor's Kiss wreckage and that of her own starfighter screen (sacrificed by Zsinj) deceived Solo into thinking Iron Fist was finally destroyed."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "Iron Fist would flee to Zsinj's Dathomir Shipyards for repairs, and fate would dictate it soon encountered Solo again. When Zsinj's nemesis, not realising Dathomir was such an integral part of Zsinj's operations, crashed on the planet, he was soon followed by a Hapan Battle Dragon carrying Isolder and Luke Skywalker, which took advantage of the confusion to pummel the inactive Iron Fist before escaping. Zsinj reinforced the shipyards with numerous Star Destroyers, and when the Hapan Battle Fleet returned to rescue Isolder, the Battle of Dathomir erupted. Possibly still damaged from the previous battles, Iron Fist soon found itself in trouble, besieged by numerous Battle Dragons, and had to call in both other Star Destroyers and starfighter support. With Zsinj distracted by the battle, Solo - flying the Millennium Falcon - destroyed the top half of Iron Fist's forward command module with two concussion missiles, killing Zsinj. With her shields gone, she soon fell victim to the Hapan Battle Fleet and a bombardment of proton torpedoes that finally finished the huge ship off."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Official Star Wars Fact File lists Iron Fist's original name as Brawler, while Cracken's Threat Dossier and The New Essential Guide to Characters list it as Brawl. Cracken's Threat Dossier actually lists it as The Brawl in Zsinj's biographical information, but the definite article was probably added to the proper name in error. Later sources, such as The Essential Guide to Warfare, continued to use Brawl."}, {"tag": "p", "text": "There are some inconsistencies on the construction site of the Brawl: The New Essential Guide to Characters states that the warship was one of the first four Super Star Destroyers to come out of the Kuat shipyards, whereas The Essential Guide to Warfare states that the Brawl was nearing completion at Scarl when Darth Vader attacked the rebel base at Laakteen Depot with his new flagship, the Executor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}