{"url": "Andasala", "categories": ["Category:Legends articles", "Category:Andasala locations", "Category:Cor'ric sector planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Andasala"}, {"tag": "p", "text": "Andasala was a mining world, located on the Llanic Spice Run in the Andasala system near Svivren."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A haven for criminals and pirates, the world was settled as a mining colony for Gesenix Mining. Seeing a flood of settlers after word of its lush natural resource supply spread, many colonists came from nearby Svivren."}, {"tag": "p", "text": "Andasala was a notable transshipment point in the spice trade."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Discovered after the Ruusan Reformation of the Galactic Republic, Andasala remained outside the Republic's borders throughout its history."}, {"tag": "p", "text": "Avoiding the Clone Wars, Andasala attracted attention during the Galactic Civil War, as many Imperial battles were fought along the shipping lanes surrounding the world. It wasn't until the rise of crime lord Valis Lorn that the world began to nationalize, with the settlements further developing and cleaning up, as the seedier parts were cleared out and made relatively safe. With Lorn's cartel running the government, the small time criminals were driven offworld. The Devaronian Sires Vant ran a money-lending system on the planet. Establishing the Andasala Achievement News, the inhabitants of the world stayed on top of galactic events."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Andasala was created for the eleventh issue of the Galaxy Guide, published in 1994. It was later mentioned in the The Essential Atlas, which perpetuates the misspelling Andalasa, first found in Pirates & Privateers. The mistake was eventually corrected in The Essential Atlas Online Companion."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}