{"url": "Isela_Talsava_Norand", "categories": ["Category:Legends articles", "Category:Fallanassi", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Isela Talsava Norand"}, {"tag": "p", "text": "Isela Talsava Norand was a member of the Fallanassi council on Lucazec. She betrayed the order to the Galactic Empire and was subsequently exiled. She was the mother of Akanah Norand Goss Pell."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "As a Fallanassi"}, {"tag": "p", "text": "A member of the secretive group known as the Fallanassi, Talsava was well respected and liked among the Fallanassi. Marrying a young man by the name of Joreb Goss, Talsava gave birth to one daughter, whom she named Akanah."}, {"tag": "p", "text": "Talsava had a perfect life, but greed got the better of her. Tempted by worldly pleasures she drove her husband to treasure hunting, and when he failed to return, Talsava used other methods. It just so happened that the new Galactic Empire was offering a reward for any information on the whereabouts of the Fallanassi. Selling the information to the Imperials, Talsava was greatly rewarded and planned to live a life of leisure."}, {"tag": "p", "text": "Feigning ignorance, Talsava was able to convince the Fallanassi leader, Wialu, to refuse to surrender to the advancing Imperials. However, Talsava's secret did not stay hidden for long. Learning of the treachery, Wialu had Talsava exiled from the Fallanassi, but offered to provide training for her young daughter. Talsava boldly refused and fled to Carratos."}, {"tag": "h3", "text": "On Carratos"}, {"tag": "p", "text": "While on Carratos, Talsava had a hard time holding on to her money. The planet was plagued with thugs and swindlers, and it wasn't long until Talsava began to doubt her ability to provide for her young daughter. Contacting the Fallanassi one last time, Talsava pleaded for their help in teaching her young daughter the ways of the Fallanassi. Wialu reluctantly agreed and sent a Fallanassi woman, Nashira, to aide Talsava in training Akanah."}, {"tag": "p", "text": "Sometime later, Nashira was forced to leave the mother and child and make her way back to the Fallanassi. It was not long before Talsava's doubts about raising and providing for Akanah resurfaced. In an emotional breakdown and just three years after arriving on Carratos, Talsava gathered all of their savings and purchased passage offworld, abandoning her fifteen year old daughter on the ruthless planet."}, {"tag": "p", "text": "The whereabouts of Talsava are unknown. Years later Akanah discovered her mother's deep flaws, and it is unknown whether she ever contacted or reunited with her mother."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}