{"url": "Ish-Bel_Tur", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Ish-Bel Tur"}, {"tag": "p", "text": "Ish-Bel Tur was a male Jedi Knight who served the Jedi Order at the Almas Academy, a Jedi training institution on the planet Almas, during the final decades of the Galactic Republic. Around 20 BBY, after the activist Gerta Haman was arrested for denouncing the Thaereian military, which the Republic had tasked with defending Almas and the rest of the Cularin system, Tur was assigned to accompany a Thaereian naval vessel that was transporting Haman to the planet Coruscant. However, the ship exploded en route on the edge of Thaereian space, and Tur and Haman were killed. Tur's lightsaber was later seized as a trophy by the Force-sensitive wampa Ku-Kak and wielded by the Anzat Force Adept Mischa Vorfren."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Service as a Jedi"}, {"tag": "p", "text": "Ish-Bel Tur was a Force-sensitive male individual who served the Jedi Order during the final decades of the Galactic Republic. Tur was based at the Almas Academy, a Jedi training facility on the planet Almas in the Cularin system, and he attained the rank of Jedi Knight. He also constructed for himself a green-bladed lightsaber."}, {"tag": "p", "text": "In about 20 BBY, during the time of the Clone Wars, the activist Gerta Haman was interviewed by the journalist Ryk Osentay for the news feature \"Eye on Cularin\" about a recent popular campaign in the Cularin system to denounce the Thaereian military, an armed force from the Thaereian system that the Republic had tasked with maintaining security on Cularin. However, Haman was arrested by the Thaereian military police during the broadcast after she claimed that some senior Thaereian officers had received a payment of 200 million from the InterGalactic Banking Clan, which was allied with the Republic's opponent in the Clone Wars, the Separatists. The Thaereians agreed to transport Haman to the planet Coruscant to meet with Lavina Wren, the senator for Cularin, to discuss Haman's accusations, and Tur was assigned by the Jedi to accompany Haman, both as a guardian and as a representative of the Almas Academy."}, {"tag": "p", "text": "En route to Coruscant, the Thaereian naval ship carrying Tur and Haman fell under attack on the edge of Thaereian space. The vessel sent out a distress signal, but it exploded three minutes later, resulting in the deaths of Tur, Haman, and the entire Thaereian crew. Following the explosion, the Thaereian Government offered a sizable reward for information on the cause of the ship's destruction. Shortly afterward, Ryk Osentay broadcast news of the explosion and the demise of Tur and Haman on an edition of \"Eye on Cularin.\""}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Tur's lightsaber was later seized as a trophy by Ku-Kak, a Force-sensitive wampa who served as a bodyguard of the slaver Phylus Mon. The Anzat Force Adept Mischa Vorfren, another of Mon's minions, took the weapon as his own and learned how to fight with it."}, {"tag": "p", "text": "Mon and his minions later ventured to the Cularin system on a mission to break into the Sith fortress on Almas and recover the secrets of the creation of Sith battlelords, a class of soldier developed by the Sith Lord Darth Rivan. However, Mon and his associates were defeated aboard Mon's vessel Animiasma by a group of freelance agents who operated in the system known as the \"Heroes of Cularin,\" and the agents recovered Ish-Bel Tur's lightsaber from Vorfren."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ish-Bel Tur wielded a green-bladed lightsaber that was marked on the hilt with his own personal emblem."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ish-Bel Tur was first mentioned in \"Thaere Is Not Your Friend,\" a short story written by Morrie Mullins and published on Wizards.com in November 2003 as a tie-in to Night's Homecoming, a roleplaying supplement in the Living Force campaign. Tur received a further mention in the 2004 Living Force module A Mon Alone, also by Mullins. Neither source specifies Tur's species."}, {"tag": "p", "text": "In A Mon Alone, the players roleplay as the Heroes of Cularin, and it is possible for them to obtain Tur's lightsaber during their battle against Phylus Mon and his minions, either by looting it or by being given it willingly by Mischa Vorfren in return for ionizing a small explosive that Mon had placed in the Force Adept's heart in order to be able to control him. If any of the player-characters are Jedi, then they have the option to petition the Jedi Masters Lanius Qel-Bertuk and Devan For'deschel for permission to keep the weapon as a tribute to Tur, or otherwise it must be returned to the Almas Academy for use in training Jedi Padawans."}, {"tag": "p", "text": "Though it did not mention Ish-Bel Tur, the 2008 compendium The Complete Star Wars Encyclopedia introduced a minor contradiction regarding Tur's final moments. Whereas \"Thaere Is Not Your Friend\" states that the Thaereian vessel that was carrying Tur and Gerta Haman at the time of their deaths was traveling to Coruscant, Shaman's entry in the encyclopedia states the ship was en route to the planet Thaere Privo when it was destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}