{"url": "Ishi_Tib/Legends", "categories": ["Category:Legends articles", "Category:Amphibian sentient species", "Category:Aquatic sentient species", "Category:Ishi Tib", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Ishi Tib"}, {"tag": "p", "text": "Ishi Tib were a sentient species from the planet Tibrin."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Ishi Tib were amphibious beings with large eyes on stalks and beak-like mouths. Their heads were often described as star-shaped, with their eyestalks, beaks, and cheek pouches forming a five-pointed star. Their lungs doubled as internal gills, and they had an acute sense of smell on land or in the water. Their green skins retained humidity, but an Ishi Tib had to bathe in salt water every thirty hours or so, or their skin would crack open, resulting in internal and external bleeding and death. Their language was Tibranese."}, {"tag": "h2", "text": "Society"}, {"tag": "p", "text": "Ishi Tib evolved from fish who escaped predators by jumping out of the oceans and on to the above-water portions of Tibrin's coral reefs. As they evolved intelligence, their cities were built on these same coral reefs, with underwater farms which grew fish, seaweed, and crustaceans for food. Their society was centered on small communities (called \"schools\") of up to 10,000 Ishi Tib. Schools were governed by representatives who were elected to one-year terms. The most important laws of the Ishi Tib were concerned with ecological preservation."}, {"tag": "p", "text": "Ishi Tib reproduction was governed by the needs of the school, with fertilized eggs laid in hatcheries near the reefs, and children raised communally. Marriage was unknown among the Ishi Tib, and no Ishi Tib knew who his or her parents or children were."}, {"tag": "p", "text": "Ishi Tib were considered meticulous strategists and managers. The minority of Ishi Tib who left Tibrin often found work offworld as executives, accountants, and project managers. Their organizational skills and drive to complete their projects placed them in high demand, making many offworld Ishi Tib quite wealthy. Ishi Tib were also known for their environmental consciousness, often choosing to work in positions where reverence for nature was as or more important than profit. There was also a primal undercurrent to their personalities, however—they were ferocious in combat, often tearing opponents apart with their beaks."}, {"tag": "p", "text": "Ishi Tib enjoyed listening to music that had loud sirens, along with clanging, whoops, flashing lights, and ringing bells."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Ishi Tib were divided in their loyalties—Tibrin was brought into the Confederacy of Independent Systems by Count Dooku, though it was still represented in the Galactic Senate by Gume Saam. However, the majority of Ishi Tib on Tibrin itself overwhelmingly supported Dooku, at least initially, as he had liberated their planet from the tyrannical rule of Suribran Tu. At least one Ishi Tib pirate was a member of the Ohnaka Gang."}, {"tag": "p", "text": "In 19 BBY, shortly after the end of the Clone Wars, a less-than-reputable Ishi Tib named Haka Hai made his base on the swampy world of Mimban. Hai commanded a number of thugs and involved himself in illegal deals. He was responsible for the imprisonment, torture, enslavement, and in some cases death of crew-members off of the freighter Uhumele."}, {"tag": "p", "text": "Shortly before the Battle of Yavin an Ishi Tib Rebel leader was captured by Imperial agents while returning from a secret meeting, and he was forced to kill himself to escape the interrogator droids. In 4 ABY, there was an Ishi Tib in Jabba Desilijic Tiure's palace, as well as four Ishi Tib at the Rebel briefing before the attack on the second Death Star. During the time of the Dark Nest Crisis there were two female Ishi Tib in a Killik cantina in the Lizil nest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Ishi Tib were designed for Return of the Jedi by concept sculptor Chris Walas. Nicknamed \"Starfish,\" the early maquettes had pink instead of green skin."}, {"tag": "p", "text": "The Ishi Tib lurking in Jabba's palace was called \"Birdlizard\" during shooting."}, {"tag": "p", "text": "\"Ishi Tib\" may have been originally designated as a character name, rather than a species. James Kahn's Return of the Jedi novelization refers to \"Ishi Tib, the Birdlizard\" as one of Jabba's courtiers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}