{"url": "Isila_Drutch", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Individuals of unspecified species", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Isila Drutch"}, {"tag": "p", "text": "Isila Drutch was a female from the New Territories planet Parshoone, born prior to 10 BBY into a family affiliated with the Galactic Empire. At the age of seventeen, Drutch applied to an army concentration in the Parshoone Sector Service Academy, and after a year, transferred to the Academy of Carida, an elite military institution, after passing the test. Four years of hard training later, Drutch became a stormtrooper in the 291st Legion Dalisor, with a designation of TD-4388."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Isila Drutch, a female, was from the New Territories planet of Parshoone, and was born prior to 10 BBY. Her father served on the Galactic Republic Tector-class Star Destroyer Archer at the end of the Clone Wars, a conflict between the Confederacy of Independent Systems and the Republic, which would later be transformed into the Galactic Empire. Even though her father talked about his navy days, Drutch was one for solid ground. She grew up drawing fortifications and arranging skirmish lines instead of playing with Tooka dolls."}, {"tag": "p", "text": "As Drutch grew up, she was never idle and worked with the rest of the Parshoone inhabitants. At the age of seventeen, she applied to the Imperial-aligned Parshoone Sector Service Academy where she trained in an army concentration. After her first year there, Drutch was at the top of her class, which caused the commandant to offer to sponsor her at the prestigious Raithal Academy. Drutch instead asked for an alternative: the equally prestigious Academy of Carida. A major was sent out from Carida to assess Drutch, and took her through three days of very hard training, with Drutch not being able to sleep during the whole test. The major, having finished assessing her, approved her transfer to Carida. Drutch later arrived on Carida, and although she had to put up with the strange looks shot at her because she was female, they later subsided because she had proven herself as fit as any of them."}, {"tag": "p", "text": "After four years of training, Drutch became a part of the Stormtrooper Corps as she joined the 291st Legion Dalisor, and was given the designation TD-4388. She became the first female stormtrooper in her company, though there were two others in her legion; TD-5144 and TD-1123. While in the 291st, Drutch shared the barracks with the men even though she was female. Sometime after becoming a stormtrooper, Drutch was on leave in a low-quality cantina when some members of her squad pointed out a poster of a female stormtrooper in femtrooper gear, an overly feminized version of stormtrooper armor, to Drutch, and asked why Drutch was not in the right gear. This incident caused Drutch to laugh. In 33 ABY, Drutch was still with the 291st, though the Empire had been replaced with the Imperial Remnant, and she had a set of memoirs documenting her life."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Drutch was shorter than most stormtroopers due to her sex, and was physically fit, so much so that she could endure a three day physical training assessment with no sleep. She could also shoot straighter and last longer in combat than most other troopers. Drutch was a natural soldier, drawing up military installations and forces instead of playing with dolls when she was young. Drutch chose the Academy of Carida over Raithal when the commandant offered to sponsor her."}, {"tag": "p", "text": "During the four years of training to become a stormtrooper, Drutch's mindset was changed to only think like a stormtrooper, and she fought together with the other troopers even though she was female. Drutch had many views about female stormtroopers and thought that it was mainly due to ignorance that many people were not aware that there was female stormtroopers serving in the Corps. Drutch agreed that there were fewer females in the Stormtrooper Corps; she knew that was the case because there were no female clone lines and because most females would not make it through to become a stormtrooper because of their physiology."}, {"tag": "p", "text": "When compared with a female in femtrooper gear, Drutch laughed. Drutch believed the femtrooper gear was useless due to a chest plate that appeared to have two gravity well projectors and a bare midriff, with which Drutch recommended not going into combat."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Isila Drutch was first mentioned in 2012's The Essential Guide to Warfare, written by Jason Fry and Paul R. Urquhart as a guide dedicated to the conflicts in the Star Wars galaxy."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}