{"url": "Isiring", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Braxant Run", "Category:Cassandran Worlds", "Category:Galactic Empire planets", "Category:Imperial Remnant planets", "Category:Mining planets", "Category:Pentastar Alignment planets", "Category:Tendrannan sector planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Isiring"}, {"tag": "p", "text": "Isiring was an Outer Rim Territories world located in the Cassander sector. An ore-rich mining world, Isiring became a part of the domain known as the Cassandran Worlds, founded by the former businessman Cassander Tadrin during the reign of the Galactic Republic. When the Galactic Empire later divided the domain into subsectors, Isiring became the capital of the Tendrannan sector. The world was subsequently a part of the Pentastar Alignment and the Imperial Remnant."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Isiring was an ore-rich mining world located in the Isiring system. It was a part of the star cluster that eventually became the Tendrannan sector, a subsector of the Cassander sector in the New Territories portion of the Outer Rim Territories. Isiring was situated on the Braxant Run hyperlane, which connected it to the New Bakstre system as well as the Vuchelle system of the Atrivis sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A century before the disestablishment of the Galactic Republic in 19 BBY, the former businessman Cassander Tadrin led the colonization of the domain that became known as the Cassandran Worlds. Over the subsequent decades, the domain grew to include more than a hundred worlds, including Isiring."}, {"tag": "p", "text": "When the Galactic Empire took over the Cassandran Worlds shortly before the Battle of Yavin, the domain was divided into three subsectors, including the Tendrannan sector, with Isiring becoming its capital. Between 4 ABY and 12 ABY, Isiring was situated in the territory of the Pentastar Alignment, and it fell within the borders of the Imperial Remnant between 12 ABY and 13 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Isiring was first mentioned in the 2004 Wizards of the Coast sourcebook Geonosis and the Outer Rim Worlds. The 2009 reference book The Essential Atlas placed the Isiring system, and therefore Isiring itself, in grid square L-5."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}