{"url": "Isis", "categories": ["Category:Legends articles", "Category:Mining Worlds", "Category:Safe worlds", "Category:Terrestrial planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Isis"}, {"tag": "p", "text": "Isis was a terrestrial planet in the Anoat sector of the Outer Rim Territories. The homeworld of the Gutretee, it was a secret Rebel Alliance safe world during the Galactic Civil War, and later became one of the Mining Worlds under the control of the Figg conglomerate."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Isis was a crystalline world that was often considered unreachable. Hidden in the fringes of the Ivax Nebula, it could only be reached from Ione on the Corellian Trade Spine via the Ione–Isis hyperroute, a secret hyperlane that passed by the Mining World of Burnin Konn."}, {"tag": "p", "text": "Isis' surface was covered with large translucent crystalline mountains and spires. The crystals refracted the incoming sunlight and filled the skies with countless rainbows. The canyons had an average width of 750m and a height of 12,500m. The crystal were rich in minerals and ores, but also disrupted all communications and sensors, even from orbit. Despite its unusual environment, the planet was hospitable to most sentient life."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Owing to its location in the Ivax Nebula, the planet remained unknown to the rest of the galaxy for a long time. During the last years of the Old Republic, it was discovered and explored by an Alderaanian scouting expedition. Then-First Chairman Bail Organa foresaw the need for a hidden base in an eventual galactic uprising and kept the information about Isis to himself."}, {"tag": "p", "text": "As the Civil War escalated, Isis became home to those who opposed the New Order, secreted away by Bail Organa. The colonists founded the city of Neskroff, the planet's only spaceport, located in a giant crystal mesa. Later engineers joined the colonists as well and the Human population soon reached over 100,000 people. The planet's natural resources were mined, refined and processed and manufactured into starfighters, making about 30% of the Rebel Alliance's starfighter production capability. In contrast to other safe worlds, the Isis colony enjoyed a relative high level of technology, even having a starport and with several hyperspace-worthy spaceships, including several squadrons of X-wing and Y-wing starfighters. The DP20 frigate Handree was also based on the planet. However, due to the crystal's disrupting nature, all communication had to be transmitted via fiber-optics."}, {"tag": "p", "text": "The native Gutretee were mostly befriended by the colonists and learned to speak basic. Several tribes became sympathetic to the Rebel cause and helped them mining and building, but they were forbidden to ever leave the planet.There were also tribes that remained outright hostile to the Rebels."}, {"tag": "p", "text": "The coordinates of Isis were a close-guarded secret of the Alliance, although rumors circulated among the Imperials about the base. The Imperial scout vessel Wanderer almost discovered the planet during the height of the civil war, but was intercepted by Rebel agents in time. The system itself did not appear on any maps until the New Republic era."}, {"tag": "p", "text": "The Rebels abandoned the planet soon after the Battle of Yavin. Isis later came under the control of the mining interests of the Figg conglomerate."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "h3", "text": "Gutretees"}, {"tag": "p", "text": "The Gutretees were a crystalline, mineral-based mono-gendered species. They lived in primitive, nomadic tribal societies and had the ability to interact with the natural crystals of the planet. Their unique physiology allowed them to copy and absorb each other memories, similar to data-files."}, {"tag": "h3", "text": "Humans"}, {"tag": "p", "text": "Most of the Humans on Isis were political criminals or similar refugees who had fled here with the aid of Bail Organa during the ascension of the New Order. With the continuing Civil War, more Humans from other societies joined the colony."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}