{"url": "Ismaren_plot", "categories": ["Category:Legends articles", "Category:Battles in the Bozhnee sector", "Category:Galactic Civil War campaigns", "Category:Galactic Empire"], "nodes": [{"tag": "h1", "text": "Ismaren plot"}, {"tag": "p", "text": "The Ismaren plot, also known as the Eye of Palpatine crisis or Eye of Palpatine incident, was a plan executed by Roganda Ismaren and House Sreethyn in 12 ABY in an attempt to revitalize the Galactic Empire following the string of defeats that had occurred over the past several years."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "The instigator of the plot was Roganda Ismaren, an Emperor's Hand who had fled to the backwater world of Belsavis following the death of Palpatine. From there, she spent the years leading up to 12 ABY beginning to set her plan in motion."}, {"tag": "p", "text": "The center of the plot was Roganda's son, Irek, whom she took with her to Belsavis. Irek's father was another Emperor's Hand, Sarcev Quest, but Roganda maintained that it was Palpatine himself, thus providing Irek with a claim to lead and reunify the fractured Empire in its war against the New Republic. Roganda educated him in the use of the dark side of the Force, and had him implanted with a subelectronic converter. Along with the education of the captured Professor Nasdra Magrody and the advanced learning techniques developed by Wilhuff Tarkin for his facility over Omwat, Irek became skilled in the control of machinery."}, {"tag": "h2", "text": "The plot thickens"}, {"tag": "p", "text": "The next part of Roganda's plan was the location of the Eye of Palpatine, a lost battlemoon from the earliest days of the Empire. Using Irek's abilities, she had it activated and began to approach Belsavis. She then approached the lords of the Senex and Juvex sectors, a region dominated by powerful, oligarchic families that supported themselves by slaving, had fared well under Palpatine, and who had opposed the New Republic."}, {"tag": "p", "text": "Assembling them on Belsavis, she presented Irek to them as Palpatine's son. New Republic Chief of State Leia Organa Solo, who with her husband Han had been investigating suspicious activities on the world, had been captured by the Ismarens and was also presented to the Lords, along with the statement of the reactivation and summoning of the Eye of Palpatine. With the combined wealth and influence of the Senex and Juvex Lords, the abilities of the Ismarens, the Eye of Palpatine and other weapons Roganda had been smuggling to Belsavis over the years, and the Chief of State their hostage, she hoped to deal a decisive turning point to the civil war."}, {"tag": "h2", "text": "Failure"}, {"tag": "p", "text": "However, Leia's brother Luke Skywalker, along with Callista Ming, Nichos Marr, and Cray Mingla were able to destroy the Eye of Palpatine while Han Solo, along with Mara Jade, R2-D2, and C-3PO, managed to overrun the assembled Lords. The plot fizzled, and although the Ismarens escaped, they never again managed to rise to prominence."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}