{"url": "Isotope-5", "categories": ["Category:Legends articles", "Category:Minerals"], "nodes": [{"tag": "h1", "text": "Isotope-5"}, {"tag": "p", "text": "Isotope-5 was one of the rarest substances in the known galaxy, secretly discovered by deep-core mining operations on the planet Makeb after it was conquered by the Hutt Cartel in 3638 BBY. Discovered to be a radioactive form of illerium, and named for the fifth known isotopic variation of an element normally found in neutron stars, isotope-5 had powerful warping effects on gravitational and electromagnetic fields even in minuscule quantities. Research into the substance's capabilities showed that it was relatively stable, and could theoretically be altered into a form capable of channeling massive amounts of energy through particle bombardment. Such was the nature of isotope-5 that scientists speculated a single microgram of the substance could power a datapad for an entire century. The gravity-warping properties of isotope-5 were believed to be the cause of Makeb's atmospheric interference and the unusual mesa formations that dotted the surface."}, {"tag": "p", "text": "Isotope-5 was a major part of Toborro the Hutt's plan to raise the Hutt Cartel as a galactic superpower to rival the Galactic Republic and the Sith Empire. During the battle for Makeb, the Hutt scientists developed a number of combat uses for the substance, including a series of war droids to attack Makeb's civilians and resistance forces, powered by isotope-5 fuel rods that generated stronger energy shields and more powerful blaster fire."}, {"tag": "p", "text": "Brought to the brink of collapse by the reversals of fortune in the Galactic War, the Sith Empire sent a small strike force under the command of Darth Marr to the planet in order to either obtain the substance for themselves, or destroy the Hutt Cartel's efforts in obtaining it. Unfortunately, they used all but one sample of isotope-5 in developing their droids and there was no way to extract it from them. Worse yet, the Hutts' mining had destabilized Makeb's core, causing groundquakes and threatened to destroy the planet, thereby ruining the Empire's plans. However, an Imperial think tank was able to devise a way to use mining lasers to set off controlled groundquakes, setting the core towards equilibrium."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}