{"url": "Isshaddik", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Smugglers", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Isshaddik"}, {"tag": "p", "text": "Isshaddik was a Wookiee male criminal who was exiled from his homeworld of Kashyyyk and joined the crew of the starship Trader's Luck along with his mate, Dewlannamapia. Isshaddik performed smuggling raids on behalf of Trader's Luck's captain, Garris Shrike, and was killed in 19 BBY during one such raid to the planet Nar Hekka."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Isshaddik was a male Wookiee, the mate of Dewlannamapia, and the father of several cubs. When translated from the Wookiee language of Shyriiwook to Galactic Basic Standard, Isshaddik's name could be roughly interpreted as \"dark sentinel.\" Around 20 BBY, Isshaddik was exiled from his homeworld of Kashyyyk for a crime he had committed. Although she was not required to do so, Dewlannamapia followed Isshaddik into exile, leaving behind her home and their cubs. The two joined the crew of Trader's Luck, a starship crewed with criminals and captained by a Human named Garris Shrike. Isshaddik started participating in Shrike's criminal activities, working for him as a smuggler. Only a year later, however, he was killed during a smuggling run to the planet Nar Hekka in Hutt Space. After his death, Dewlannamapia remained aboard Trader's Luck and befriended a young Corellian boy named Han Solo, who was working for Shrike. Around 10 BBY, Dewlannamapia sacrificed her life while helping Solo escape from Shrike and pursue his dreams."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Isshaddik was first mentioned in The Paradise Snare, a 1997 novel written by A. C. Crispin. Through a mention of Dewlannamapia's status as a widow, Isshaddik was later indirectly mentioned in A Guide to the Star Wars Universe, Third Edition, Revised and Expanded, a 2000 reference book authored by Bill Slavicsek. In 2008, Isshaddik received an entry in The Complete Star Wars Encyclopedia. Galactic Campaign Guide, a Star Wars Roleplaying Game supplement published by Wizards of the Coast in August of 2003, included a translation of some common Wookiee name prefixes. Due to the complexity of Shyriiwook, each part of a Wookiee's name is translated separately. According to Galactic Campaign Guide, \"Issh\" means \"black, dangerous, dark, deep,\" while \"addik\" means \"guardian, guard, sentinel.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}