{"url": "It%27s_Not_Wise_to_Let_Your_Guard_Down", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:Hasbro Star Wars Mission Fleet"], "nodes": [{"tag": "h1", "text": "It's Not Wise to Let Your Guard Down"}, {"tag": "p", "text": "\"It's Not Wise to Let Your Guard Down\" is a non-canon animated short in the Hasbro Star Wars Mission Fleet series. It was released online on the Star Wars Kids YouTube channel on February 18, 2021."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "Han Solo and Chewie learn to stay focused when Boba Fett—the galaxy's most feared bounty hunter—gets the Millennium Falcon in his sights."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Chewbacca and Han Solo are in the Millennium Falcon arguing over who will fly the ship. Chewie growls, and Han shrugs, letting him take the controls. As the Falcon takes off from Tatooine, Boba Fett checks the bounty for Solo and Chewbacca on his gauntlet's hologram projector, then activates a winged jetpack to pursue the departing freighter."}, {"tag": "p", "text": "Han activates the Falcon's autopilot, and he and Chewie settle back for a game of dejarik in the hold as Fett lands on top of the ship. Fett tries cut through the hull with a laser but fails, so he tries to pull the hatch open, but this activates an alarm. Chewie rotates the ship's rectenna, knocking Fett off the ship, but he uses his jetpack to fly back. Han and Chewie race back to the cockpit, and Han sees Fett standing on a cargo container, so he ejects the cargo from the front mandibles. Fett resumes his pursuit, firing on the ship with his blasters, but it jumps into lightspeed before he can reach it."}, {"tag": "p", "text": "Realizing they should not have let their guard down, Solo ends the dejarik game and he and Chewie return to the cockpit, where Han wipes his brow in relief and fist bumps with his Wookiee friend."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}