{"url": "It_Gets_Ugly", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:LEGO Star Wars: All-Stars"], "nodes": [{"tag": "h1", "text": "It Gets Ugly"}, {"tag": "p", "text": "It Gets Ugly is the second episode in the LEGO Star Wars: All-Stars television series. It debuted on October 30, 2018."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The episode opens with Lieutenant Valeria recounting a space battle to General Hera Syndulla aboard the Home One. Hera is about to recount a story about flying the Ghost into an asteroid field when Roger barges in and asks the if they want to hear him recount the time that he saved the day. Oblivious to Valeria and Hera's annoyance, Roger reads Chapter 18 of his autobiography From Trenches to Wrenches: The Roger Story: \"It Gets Ugly.\""}, {"tag": "p", "text": "Roger recounts that he was working for his first master, a Corellian mechanic named Pace Freemaker. Pace has been working to restore Delta-7B Aethersprite-class light interceptor and its Syliure-31 hyperspace docking ring for several years. Pace celebrates that this ship is going to sell a fortune. Rogers offers to celebrate Pace's victory with freshly-baked bantha bread. However, he trips on a fallen rag and lands on the starfighter's booster ring. Roger is then catapulted onto the front of the yellow starfighter while the hot bantha bread lands on Pace, burning his hands. Pace accidentally starts the starfighter, sending the ship and its hyperspace booster ring into lightspeed."}, {"tag": "p", "text": "Exiting hyperspace, they are dragged into Dathomir's orbit. Pace asks where they are going but Roger retorts how should he know since Pace was the one who kicked the button. The Delta starfighter separates from its booster ring and crashlands. Pace is distraught that his starfighter is ruined while Roger is upset that his bantha bread is ruined. Something roars behind Roger and the two discover that the rock is a rancor."}, {"tag": "p", "text": "The two flee and are pursued by the rancor, which awakens two other rancors. Roger and Pace fleet into a cave which the rancors are unable to reach. Pace asks how they are going to get out of this. Roger adds by asking how they are going to get home since he can only see the parts of wrecked ships that were stupid enough to come to this \"dump planet.\""}, {"tag": "p", "text": "Pace sees a TIE fighter power coupling and a Y-wing starfighter repulsor. He decides they will build their way out and tells Roger to run out and draw the rancors' attention. Roger reluctantly draws the rancors away from the cave by leading them on a chase with the offer of bantha bread. In the meantime, Pace builds an Ugly out of starship parts. Roger trips on a landing gear, causing it to crash near Pace."}, {"tag": "p", "text": "Pace realizes this is what he needs. One of the rancor cataches up with Roger and is about to devour him when Pace flies by in his X-wing–TIE Ugly hybrid and spirits him to safety. Back at Pace's hangar, Pace laments that he once had a gorgeous starfighter but now all he has is this Ugly. However, a human woman offers to buy it for 10,000 credits. Pace accepts her offer."}, {"tag": "p", "text": "Returning to the story, Roger says that Pace found success selling Uglies all thanks to him. Hera disagrees and says that Pace flew it and named it. Valeria agrees and says that story is about how Pace found in spite of Roger. Roger counters that he liked this version better."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}