{"url": "Ithia", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Baran Do Sages", "Category:Females", "Category:Hidden Ones", "Category:Kel Dor"], "nodes": [{"tag": "h1", "text": "Ithia"}, {"tag": "p", "text": "Ithia was a female Force-sensitive Kel Dor from the planet Dorin. She became a member of the Baran Do Sages, a Force-based organization on Dorin, and later joined the Hidden Ones, a secret sect of the Baran Do dedicated to preserving their knowledge. She was present in the sect's caverns in 43.5 ABY, when former Jedi Grand Master Luke Skywalker—recently exiled from Coruscant and the Jedi Order for dereliction of duty—and his son, Jedi Knight Ben Skywalker, traveled to Dorin to speak with Baran Do Master of the Order Koro Ziil to learn more about Jedi Knight-turned-Sith Lord Darth Caedus's fall to the dark side of the Force. They eventually discovered the Hidden Ones, and Ithia greeted Ben upon their arrival. The Skywalkers met with Ziil, who had become the sect's leader, and Ziil revealed that, in order to protect the sect's secrecy, no one would ever be allowed to leave the caverns. Luke eventually turned Ithia and the Hidden Ones against Ziil and defeated him in a battle of Force powers, and Ithia and the Hidden Ones returned to the surface of Dorin."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A female Force-sensitive Kel Dor from the helium-rich planet of Dorin was a member of the Baran Do Sages, a Force-based organization for Kel Dor on Dorin. During her time with the Sages, she was trained in fighting technique, which was relatively rare among the Sages, and she was considered one of their most skilled combatants. She frequently dueled fellow Sage Charsae Saal—also one of the Baran Do's best fighters—and rarely lost to him. Sometime prior to 43 ABY, the female Kel Dor decided to join the Hidden Ones, a secret sect of the Baran Do tasked with preserving the Baran Do's knowledge so that if the organization was ever destroyed, it could be reinstated. In doing so, she changed her name to \"Ithia,\" as the Hidden Ones required their members to change their names and accept that they were dead to the outside galaxy, resigning themselves to their duties as members of the sect. During her time in the Hidden Ones' home, a series of caverns deep below Dorin's surface, Ithia became resigned to her \"death\" and did not feel the need to practice her skills. As such, her strength of will and Force powers diminished over time."}, {"tag": "p", "text": "In 43.5 ABY, former Jedi Grand Master Luke Skywalker—recently exiled from the galactic capital of Coruscant and the Jedi Order for dereliction of duty—arrived on Dorin with his son, Jedi Knight Ben Skywalker, to find Master of the Order Koro Ziil. They hoped to find out more about why Jedi Knight Jacen Solo had turned to the dark side of the Force. Upon their arrival in the Baran Do temple, however, they were told that Ziil had died, and they decided to stay and train with the Baran Do Sages. Before long, Saal, now the Sages' senior combat instructor, decided to join the Hidden Ones. He held his \"dying ceremony,\" in which a Sage pretended to die and then traveled to join the Hidden Ones in their caverns. Luke was not fooled by Saal's apparent death, however, and, after searching the site, he and Ben found Saal alive and well. Realizing that Ziil was also likely still alive, they agreed to travel with Saal to the Caverns of the Hidden One. Ithia was present when Saal and the Skywalkers arrived in the caverns; she greeted the younger Skywalker and revealed to him that he would have to choose a new name, considering Ben Skywalker to be dead. There, the Skywalkers found that Ziil was indeed still alive and had become the Hidden Ones' leader, taking the title of simply \"the Hidden One.\" They spoke with him, and he revealed to them that in order to protect the sect's secrecy, no one who entered the caverns was ever allowed to leave."}, {"tag": "h3", "text": "Leaving the Hidden Ones"}, {"tag": "p", "text": "A few days after joining the sect, Saal—who had taken the name of \"Chara\"—dueled with Ithia in a set of three matches. Ithia had grown weaker than Chara, and he defeated her in every match. Observing, Luke developed a theory that the Hidden Ones—by turning their backs on life, energy, and vitality—had turned their backs on the Force, causing their powers to weaken. Ithia later went to Ziil's throne chamber when the Skywalkers announced that they would be holding a naming ceremony, in which new members of the Hidden Ones took new names. Once the Hidden Ones had gathered in the chamber, however, Luke revealed that they intended to rename some or all of the Hidden Ones instead of themselves. Luke went on to present his theory about how the Hidden Ones were weakening; to prove it, he suggested that Ben duel Chara. Ithia provided Ben with a hardwood staff, and he and Chara, the latter similarly armed, proceeded to fight. Chara—though by far Ben's superior, having instructed him in combat technique at the temple mere days before—lost the duel, as he lacked the will to win."}, {"tag": "p", "text": "Ziil, however, refused to accept the turn of events, claiming that Luke had brainwashed Chara into believing that he was growing weaker, but the other Hidden Ones began to agree with the Skywalkers. Angered, Ziil revealed that he had told those on the surface that the Skywalkers had died when a cave collapsed; as such, they would no longer need their oxygen-nitrogen canisters. Without the canisters, the Skywalkers would die from Dorin's helium-rich atmosphere within a couple of days. The Hidden Ones protested, and Ithia spoke out in support of the Skywalkers' idea. She told Ziil that she believed that the \"experiment\" that was the Hidden Ones had failed. Finally pushed over the edge, Ziil attacked Luke, and the two engaged in a duel of Force powers. The duel, won by Luke, left Ziil exhausted and collapsed on the floor. Ithia was the first to rush up and check on him; she determined that he would recover. She continued to tend to Ziil as Ben triggered a series of explosives, sealing off the tunnel that was believed to be the only entrance or exit from the caverns, and revealed the many lies Ziil had told the Hidden Ones. Although Ziil continued to be defiant, Burra, one of the eldest members of the sect, gave in and revealed the location of a secret turbolift chamber that led out of the caverns. Ithia and the Hidden Ones returned to the Baran Do on the surface, and the Skywalkers left Dorin soon after."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ithia was renowned as one of the best combatants of the Baran Do Sages, and, until Chara joined the sect, she was the best fighter in the Hidden Ones. She knew that Luke Skywalker's theory on the Hidden Ones' waning powers was correct, as she recognized that the Hidden Ones were weakening and realized that her own skills had diminished greatly as well. When few others would speak up against Ziil, Ithia was one of the first to confront the Hidden One with these problems and debated in open support of the Skywalkers. Despite verbally opposing Ziil, however, she was concerned for him after his fight with Luke left him collapsed on the ground, as she was the first to reach his side to assess his condition."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ithia was one of the few Baran Do to be trained in combat, as fighting techniques were not required for the Sages. She became a very skilled combatant and was said to be the Baran Do's best; when dueling with Chara, she would consistently win at least two out of three matches. When she joined the Hidden Ones, however, she was forced to turn her back on life, and thus her fighting skills and her connection to the Force weakened. In 43 ABY, when she again dueled with Chara, he defeated her in each of their three matches."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ithia was created by Star Wars author Aaron Allston for his first novel in the nine-book Fate of the Jedi series, Fate of the Jedi: Outcast, released March 24, 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}