{"url": "Ithor/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Darth Krayt's Galactic Empire planets", "Category:Destroyed planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Ithor locations", "Category:Jungle planets", "Category:Lesser Plooriod Cluster planets", "Category:New Republic planets", "Category:Ottega sector planets", "Category:Spice producing worlds"], "nodes": [{"tag": "h1", "text": "Ithor"}, {"tag": "p", "text": "Ithor was the fourth planet located in Ottega system of the Mid Rim. One of the oldest members of the Galactic Republic, it was a planet full of lush life, and the planet's surface had not a touch of civilization on it. The Ithorians themselves, otherwise known as \"Hammerheads,\" built great floating cities that did not harm the surface, which they considered to be sacred. Entry upon the surface was forbidden, unless one stayed there permanently. Some Ithorians such as the Oracle were compelled to go down to the planet surface, however, as they \"heard the call\" of Mother Jungle, the Ithorian religion's personification of Ithor's world-spanning jungle. The surface of the planet of Ithor played host to numerous plants, including the bafforr tree, which possessed telepathic capabilities. The planet contained andurite stone, and every three Ithorian years was the center of the Time of Meeting. The planet had many moons in its night sky."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ithor joined the Galactic Republic prior to 8000 BBY. In 3963 BBY, when Republic fleet encountered a Mandalorian raiding force in an asteroid field near Ottega system, Dace Golliard predicted they would attack Ithor next, although it turned out to be a ruse set up by Zayne Carrick and Cassus Fett to capture Golliard. In 439 BBY, scientists attempted to bond the telepathic capabilities of the bafforr tree with another, more vicious tree on the planet surface. The result was a new parasitic life form named \"Spore,\" but its parasitic hostility forced the Ithorians to lock it away in an asteroid 300 BBY. It was long afterwards discovered by miners."}, {"tag": "p", "text": "In 19 BBY, Grand Master Yoda of the Jedi Order, was reported dead in an incident on Ithor."}, {"tag": "p", "text": "Sometime before the Battle of Yavin, Ithor came under siege by the Galactic Empire, which demanded access to Ithorian agricultural techniques and technology in an attempt to locate biotech for military applications. Lead by Captain Alima he threatened the Ithorians with the destruction of their sentient forests, the Cathor Hills. However the Empire was ousted from the planet through a deal formulated by Momaw Nadon, where he bargained with the Empire to reveal the secrets of the Ithorians' technology and agricultural ceremonies, in return for the protection of their 'mother jungle'."}, {"tag": "p", "text": "Sometime after the Battle of Yavin, the Galactic Empire planned to attack the planet. The Rebel Alliance heard of these plans prior to the attack and dispatched Han Solo to rescue a group of Ithorians wishing to evacuate. Just a few minutes before the attack, Han and his co-pilot Chewbacca were able to rescue the Ithorians. A small battle raged afterwards, with many TIE Fighters. Han and Chewbacca managed to dodge space slugs in a nearby asteroid field and place the Ithorians on Bimmisaari."}, {"tag": "p", "text": "Umwaw Moolis represented the planet in the New Republic Senate."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "However, by 25 ABY, Ithor's tranquil existence came to an end. The Yuuzhan Vong War blazed a trail from the Outer Rim, and Ithor lay directly in their path. Retreating from Dantooine and Dubrillion, the New Republic made a stand at the planet, hoping to resist the invasion long enough to make use of the bafforr tree pollen, which had somehow reacted violently with the living armor of the Yuuzhan Vong. The battle entered into a state of stalemate, until Jedi Knight Corran Horn dueled Shedao Shai, the leader of the Yuuzhan Vong forces, with the planet Ithor at stake. Though Horn was victorious, Shai's subordinate, Deign Lian, was ordered by Warmaster Tsavong Lah to unleash a plague of toxins upon the planet, in order to eliminate any chance of a pollen-based bioweapon. The virulent biochemicals (a biological gray goo) rapidly turned Ithor's verdant forests and animal life into a black ooze which spread and destroyed everything it touched.\nIn retaliation, the assembled Remnant and New Republic forces fired massive barrages of concussion missiles and proton torpedoes at the Yuuzhan Vong command ship, Legacy of Torment, which broke into three sections. The rear end of the massive warship tumbled into the now hydrogen-oxygen rich atmosphere and ignited it, turning Ithor into a firestorm ridden inferno of a planet."}, {"tag": "h3", "text": "Ithor's legacy"}, {"tag": "p", "text": "As of 35 ABY, when the Dark Nest Crisis began and ended, the Ithorians were attempting to relocate to Borao. This attempt almost failed due to the presence of the RePlanetHab organization, who claimed the rights for the world. Chief of State Cal Omas was able to block RePlanetHab's attempts at the \"suggestion\" of Leia Organa Solo. By the end of the Swarm War in 36 ABY, some scientists were residing on the planet, studying it in hopes of rehabilitation, but most Ithorians settled on Borao along with Felucia, Öetrago and the worlds of the Upell system."}, {"tag": "p", "text": "However, considering the Ithorians' skills in ecology and their previous experience in re-terraforming worlds such as Telos IV, they hoped that Ithor could have been reinhabited one day. Abandoning the Ossus Project of Jedi Master Kol Skywalker, the Ithorians decided to rebuild their world using the same technology as during the Restoration of Telos IV. By 137 ABY much of the planet's surface remained rocky and dry, but genetically engineered dangerous plants and animals began to slowly transform the planet's soil and atmosphere into livable state. Visitors to the planet surface were still required to wear breath masks to avoid a large number of toxins in the atmosphere, but enviro-suits were no longer necessary."}, {"tag": "h2", "text": "Biosphere"}, {"tag": "p", "text": "The surface of the planet Ithor was formerly an immense jungle. Following the Ithorian belief in the Law of Life, most Ithorians never actually set foot on their own planet, instead they lived in floating cities above their world called herdships. Only three of their continents had been explored and harvested, the other two never having been touched by Ithorian hands, demonstrating their devout belief in the protection and sustainability of their environment."}, {"tag": "p", "text": "Such protectionism toward their environment gave rise to numerous native plants and animals."}, {"tag": "h3", "text": "Flora"}, {"tag": "p", "text": "The bafforr tree was considered semi-sentient and possessed telepathic capabilities and acted as a sort of distributed intellect - the larger the forest was, the higher the collective intellect."}, {"tag": "h3", "text": "Fauna"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The PC game Star Wars: Rebellion mistakenly places Ithor in the Calaron sector of the Outer Rim."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}