{"url": "Ando_(star)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Ando system", "Category:Lambda sector stars", "Category:The Slice stars"], "nodes": [{"tag": "h1", "text": "Ando  (star)"}, {"tag": "p", "text": "Ando was a star in the star system of the same name, located within the Mid Rim region of the galaxy. The star was orbited by three planets: Andando, Ando with its two moons, and Ando Prime. The Ando system also contained a small planetoid and an asteroid field."}, {"tag": "p", "text": "Ando appeared from the surface of Ando Prime to be yellow in color. The star was visible in the skies of Ando Prime when the monks of the mystic Order of Dai Bendu entered the Tho Yor starship that was resting on the world. Millennia later, Ando was observed again on several instances from the planets of Ando and Ando Prime as well as the namesake system's planetoid."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ando was a star in the star system of the same name, located within the Lambda sector, a part of the galaxy's regions known as the Mid Rim and the Slice. The star was orbited by three planets: the molten rock world Andando, blasted barren and uninhabitable as a result of a civil war among the Aqualish species; the oceanic planet Ando together with its two moons; and the frozen world Ando Prime. The Ando system also contained a small planetoid with a single moon that was located near the inner edge of an asteroid field. Ando appeared from the surface of Ando Prime to be yellow in color, and the sunlight reflected from the glass-like surface of Ando's oceans was highly intense."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 36,453 BBY, the star Ando emerged from the clouds in the sky of Ando Prime when the Tho Yor starship, which had been resting on the planet's surface for some time, beckoned the local monks of the mystic Order of Dai Bendu to enter the vessel. Millennia later, while the Republic Military was attacking a Separatist base in the Ando system during the Clone Wars, the namesake star dimly illuminated the remote planetoid on which the base was located. Around the time of the battle on Ando Prime during the same conflict, the star was seen during its sunset on the snow-covered world."}, {"tag": "p", "text": "In the following decades, Ando was observed on several occasions from its namesake planet. Two such instances happened during the rule of the Galactic Empire. One of them was when the Aqualish Myinyar rendezvoused with a Human female, who wanted to purchase the rare alloy sedrellium from Myinyar. The other sighting was when the pirate vessel Majestic attacked the fishing ship Nanda's Luck. In addition, when the Gambit, a space yacht carrying a team of Rebel Alliance agents, approached Ando and entered its atmosphere, the agents were nearly blinded by the bright reflection of Ando's sun in its oceans. In 26 ABY, the sun of Ando was seen by the Khommite Jedi Knight Dorsk 82 while he was protecting a crowd of droids in the city of Imthitill from a mob of the local Aqualish wanting to destroy them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The star Ando first appeared in \"Courier's Deal,\" a short companion narrative published in the 1994 sourcebook Creatures of the Galaxy that served as a supplement to West End Games' Star Wars: The Roleplaying Game. Ando was later depicted in the Star Wars Roleplaying Game web supplement \"Ando: Planet of the Walrus Men,\" which was published on the Wizards of the Coast website in July 2003 and provided the star's proper name."}, {"tag": "p", "text": "\"Twinkle, Twinkle Little Star, How I Wonder Where We Are,\" a 1990 roleplaying game source article published in Voyages SF 13, placed the Ando system, and therefore the star Ando, in the \"Imperial Core\" sector. Since that article was released outside of the Lucas Licensing process, its canonicity within the Star Wars Legends continuity was never confirmed. The 2009 reference book The Essential Atlas subsequently placed the Ando system in grid square Q-15, relatively far from the galaxy's Core Worlds, and the StarWars.com Online Companion to the book further overrode the Voyages SF 13 placement by establishing that the system was situated in the Lambda sector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}