{"url": "Ixll", "categories": ["Category:Legends articles", "Category:Avian and airborne sentient species", "Category:Hutt Space species", "Category:Mammalian sentient species"], "nodes": [{"tag": "h1", "text": "Ixll"}, {"tag": "p", "text": "Ixlls were a sentient race of flying creatures native to the moon Da Soocha V, also known as the Pinnacle Moon."}, {"tag": "p", "text": "Ixlls were descended from omnivorous predators, and had a well-developed feudal society that was generally peaceful; they also had an aptitude for tool and craft making, creating simple but elegant bags and ornaments, as well as black powder grenades they called \"exploding stones.\""}, {"tag": "p", "text": "Their language consisted of high-pitched chirps, clicks, and whistles that carried over great distances in the thin air of the pinnacles. They lived in warrens at the tops of the flattened pinnacles, and often collected odds and ends to decorate them. To see in the dark, they had natural sonar. They could fly at speeds of up to 80 kilometers per hour, and glide at around 64 kilometers per hour."}, {"tag": "p", "text": "Pinnacle Moon was home to Pinnacle Base, a New Republic fortification used after the fall of Coruscant to Imperial warlords prior to the resurrection of Palpatine. Ixlls often flew through the pinnacles of the moon and darted around New Republic ships. They also demonstrated great friendliness and playfulness with New Republic personnel, and were quickly learning about galactic technology, even learning to use their whistling speech to reprogram astromech droids as pranks. Their legends often centered around tumnors, large predators of their young."}, {"tag": "p", "text": "When the New Republic evacuated the world in advance of the Galaxy Gun's projectile, they took several Ixlls with them; eventually, they established a colony on one of the uninhabited moons of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}