{"url": "Ando_Prime/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Ando Prime locations", "Category:Ando system", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Ice planets", "Category:Lambda sector planets", "Category:Mining planets", "Category:New Republic planets"], "nodes": [{"tag": "h1", "text": "Ando Prime"}, {"tag": "p", "text": "Ando Prime was a planet in the Mid Rim. It was a snow-covered—yet hospitable—planet. It was the third planet in the Ando system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For a long time, the only inhabitants on the planet were the native Talid and the ancient Order of Dai Bendu monks, of which some went in the Tho Yor off to Tython."}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the reconstituted Sith Empire, a group of antique collectors gave off a distress call because they were burried under an avalanche."}, {"tag": "p", "text": "Sometime during the reign of the Galactic Republic, Jedi Padawan Obi-Wan Kenobi would provide an exploration to find a Force nexus on Ando Prime that was detected by the Jedi Council."}, {"tag": "p", "text": "In later years, the planet had a population surge, following the establishment of several mining communities, including the capital Elesa. Giant water pipes were constructed to supply the growing towns and cities, and took years to finish."}, {"tag": "p", "text": "Although the planet was covered with snow, it hosted many podraces during its history. Most of these courses were controlled and sponsored by the Desilijic Hutt clan. Some of these events were televised across the galaxy, even viewed by patrons of nightclubs and sports bars on cosmopolitan worlds like Coruscant. Ando Prime's podracing courses included:"}, {"tag": "p", "text": "At some point before 27 BBY, aspiring Human crime lord Kaeline Ungasan attempted to wrest the criminal control of podraces in Ando Prime from the Hutts. He sponsored his own podracing event, the Ungasan Cross Country, whose course changed every time it was run. Ungasan secretly used the Cross Country as a cover for his illegal mining operation of vonium, which was present in Ando Prime. The Hutts sent the bounty hunter Davon Gitta to find Ungasan on Ando Prime. In 27 BBY, Ungasan's shady activities and his use of the Cross Country as a front were discovered, in what was the first of many controversies in podracing, leading to the ultimate criminalization of the sport."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the 1999 video game Star Wars Episode I: Racer, the name of the planet was (pronounced /ɑndəʊ priːm/) (rhyming with \"cream\") instead of the usual /ɑndəʊ praɪm/ (rhyming with \"crime\"). Ando Prime is the only planet represented in all four of the game's circuits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}