{"url": "Iziz/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Capital cities", "Category:Confederacy of Independent Systems cities", "Category:Galactic Empire cities", "Category:Galactic Republic cities", "Category:New Republic cities", "Category:Onderon locations"], "nodes": [{"tag": "h1", "text": "Iziz"}, {"tag": "p", "text": "Iziz was a massive, walled city and the only modern settlement on the planet Onderon. Ruled by a popular monarchy, it served as the Japrael system's capital. The city was well-known for its defenses, which were devoted to keeping out the flying beasts that attacked the planet from the nearby moon of Dxun."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Established originally as a colony of Humans pacifists, the city of Iziz quickly expanded as permanent settlements were established on the world. Growing to a massive sixteen hundred square kilometers, the city was protected from the jungle and the dangerous beasts which lived there by high walls and a fortified defense grid. Turret towers mounted at points along the wall and security stations at each access point ensured that peace was kept in the city and the wild beasts of both land and the air were kept at bay."}, {"tag": "p", "text": "Centered around a steep hill, the Iziz Royal Palace was the center point of the city, looking over the city for millennia. The home of the Monarchy of Iziz, the King and Queen presided over the government of Onderon while the Iziz Council dealt with the affairs of the city. Accessed by a sky ramp the palace was rebuilt several times before being replaced entirely by the Unifar Temple by the time of the Clone Wars.[source?]"}, {"tag": "p", "text": "The Merchant Quarter of the city of Iziz was located at the southern gates of the city and contained many locally owned shops and stores which catered to the locals, trading in goods brought from outside the city and those goods produced within. The Merchant Quarter led directly to the sky ramp and later Yolahn Square, serving as one of the most active areas of the city for commerce. Towards the Palace district stood the city's primary, which gave access to the sky ramp and the palace itself. Past the commerce district was the area known as the Western Square, an area of the city controlled by the Exchange during the Onderon Civil War and the location of the city's power generator."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Naddist era"}, {"tag": "p", "text": "The occupants of the city had been pacifist colonists until faced with the threat of the horrible drexls from Dxun. Fortifying their massive city against the beasts of the jungle, the hardened-Onderonians were war-oriented and established a strong defensive barrier to protect themselves. Establishing the Onderon Royal Family, the city's fear of attack left them prone to attacks of a different nature. Fallen Jedi and Dark Lord of the Sith Freedon Nadd became shipwrecked on the planet and quickly made his way to Iziz, infiltrating the city and placing himself in a leadership position by 4400 BBY, usurping the throne and signaling the beginning of a long reign of darkness. The dark side theocracy Nadd established would see the living conditions of the city plummet and public health completely erode. Long after Nadd's death, the political party known as the Naddists held the planet in thrall for generations, with Naddist kings ruling over the people with an iron fist. Exiling all political opponents, criminals and those who fell out of favor with the crown to the jungle and an inevitable death, the monarchy did not count on these exiles surviving and thriving in the jungle. However, after taming the beasts of the wilds, the so-called Beast Riders led attacks against the city and became a very real threat to the city of Iziz."}, {"tag": "p", "text": "The Beast Wars lasted from until 4000 BBY, with the final battles serving as the opening salvos of the Great Sith War. At this time, the Beast Rider King Oron Kira wed Princess Galia of the city and peace emerged between the Riders and the citizens of the city."}, {"tag": "p", "text": "Two years later, during the removal of former Queen Amanoa and Freedon Nadd's corpses from the planet, Iziz was attacked by a secret group of Naddists which had persisted in the city. Known as the Freedon Nadd Uprising, the Jedi Knights assigned to restoring Iziz were able to kill the leader, Warb Null. Despite their efforts on the battlefield, a darkness lingered in the Force and Jedi Master Arca Jeth quickly discovered that King Ommin persisted below the palace in a secret chamber, preserved by his immersion in the dark side and the spirit of Freedon Nadd. As Ommin captured the Jedi Master, the other members of the Jedi delegation were forced to retreat from Iziz and regroup. Rallying the Galactic Republic to their cause, the Jedi were reinforced by Republic rocket-jumpers, who aided in wiping out the Naddist militants and eventually killing the old King Ommin and freeing Jeth. Upon Ommin's death, the darkness over Iziz was lifted and Queen Galia was able to lead her people back towards the light and the Republic."}, {"tag": "p", "text": "As the Great Sith War tore across the galaxy, the Brotherhood of the Sith and the Mandalorian Crusaders set their sight upon Iziz near the end of the conflict in hopes of a last-ditch victory against the Republic. Attacking the planet, Mandalore the Indomitable and his forces were swiftly driven to the Demon Moon of Dxun by a concerted effort by King Kira and the Republic. Upon the moon, Mandalore was devoured by the drexl beasts there, and the Mandalorian fleet collapsed."}, {"tag": "h3", "text": "Onderon Civil War"}, {"tag": "p", "text": "Since the conclusion of the Great Sith War, Onderon had endured a period of peace, led by descendants of King Kira and Queen Galia who had aligned the planet with the Republic and the Jedi Order. While the Jedi Civil War had not affected the planet, five years after the conclusion of the conflict, Iziz was thrown into a civil war of its own when a power struggle within the royal family erupted. Queen Talia, the planet's young ruler, was struggling to maintain Onderon's allegiance to the Republic as the Dark Wars appeared to have finally defeated the Republic and the Jedi. As Talia struggled to maintain the peace her cousin and leader of the Onderonian military, General Vaklu, secretly allied with the Sith Triumvirate and his call to cut ties with the Republic quickly gained him the support of the citizens of Iziz. During the opening salvo of the Civil War, Vaklu declared martial law on the city and ousted his cousin from the throne."}, {"tag": "p", "text": "During the battle the exiled Jedi Knight Meetra Surik landed on the planet in search of one of the last members of the Jedi High Council, Master Kavar. Searching the city, Surik quickly learned that the Merchant Quarter at the southern end of the city had been occupied by the Onderon separatists and the Western Square was under the authority of the Exchange. Venturing into a local cantina, Surik and her companion, Mandalore the Preserver searched for a man named Dhagon Ghent in hopes of gaining his assistance. Learning that Ghent had been arrested on bogus charges for murdering Captain Sullio of the Onderonian Military, Surik sought out evidence that Ghent was innocent. Discovering the head of the droid S-0D3-GE3, she bought its missing parts from a droid merchant, 1B-8D-GE3, at the scene of crime. After assembling the parts she showed it to a slicer named Kiph, and Nikko, one of Ghent's friends. Kiph retrieved the droid's last holorecord from its parts, which the droid made during the murder, before the droid itself was also destroyed by the assailant. This holorecord proved Ghent's innocence, and the Exile was able to contact Master Kavar."}, {"tag": "p", "text": "Setting up a meeting Surik interrogated Kavar regarding his motives for sentencing her to exile, however, Colonel Tobin tried to capture the Jedi during the meeting. Unwilling to be captured, Kavar used the Force to stun Tobin's men and fled to the Royal Palace, while the Exile fought her way back to the city's main starport to escape back to Dxun. As civil unrest choked the city the dispute escalated into a second uprising after which Queen Talia reclaimed control of the city and its defenses, while General Vaklu would stand trial for treason. While Iziz was reclaimed, much of the city itself was destroyed in the war. The palace itself would be rebuilt as the Unifar Temple, while the sky ramp was tore down and replaced by Yolahn Square.[source?]"}, {"tag": "h3", "text": "Separatist rule"}, {"tag": "p", "text": "By the time of the Separatist Crisis, Onderon continued to have a voice in the Galactic Senate and was represented by Senator Mina Bonteri. When the Republic and the Separatists declared the beginning of the Clone Wars, King Sanjay Rash ousted the current monarch, Ramsis Dendup, and allied Onderon to the Confederacy by the Treaty of Iziz. Bonteri relocated to Raxus Secundus to represent Onderon in the Separatist Parliament, but she was assassinated after attempting to open peace talks with the Republic."}, {"tag": "p", "text": "Sanjay Rash enforced martial law was enforced across Iziz, inviting the Separatist Droid Army to begin an occupation of the city. A band of rebels were trained by Jedi Knights Anakin Skywalker and Obi-Wan Kenobi, who were tasked by the Jedi High Council with testing a new war strategy of training guerrillas to fight for their own freedom. As Padawan Ahsoka Tano participated in a mission in Iziz with guerrilla leaders Steela Gerrera, her brother Saw, and the son of the former senator, Lux Bonteri, the Separatist forces in the city began to prepare for an assault. After the liberation of deposed king Dendup, the rebels mounted a full-scale assault on the Separatists in the Onderon highlands to the east of Iziz, defeating Rash's forces. Confederate General Kalani was ordered by Confederate Head of State Count Dooku to withdraw their forces to Agamar, and Kalani executed Rash before leaving, leaving the throne to be reclaimed by Dendup."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "With conclusion of the Clone Wars and the Galactic Empire's rise to power, Iziz became a major Imperial military ordnance center. During the Galactic Civil War, members of the Rebel Alliance destroyed the ordnance center in 2 ABY, crippling Imperial operations in the region by interfering with their ability to properly resupply. This attack was among the first of many major confrontations to be seen between Alliance and Imperial forces as the conflict spread across the Galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Iziz is also the name of a prominent Jawa chieftain from Anchorhead on the planet Tatooine in the video game Star Wars: Knights of the Old Republic."}, {"tag": "p", "text": "As seen in \"Front Runners\", the design of Iziz draws heavily from ancient Rome. Besides the city itself, King Sanjay Rash's design heavily features Roman influences, including a headband that suggests gilded laurel leaves at his temples."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}