{"url": "Iziz_defense_tower", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Ground emplacements", "Category:Military bases", "Category:Onderon locations"], "nodes": [{"tag": "h1", "text": "Iziz defense tower"}, {"tag": "p", "text": "The Iziz defense towers were a series of battlestations that were designed to protect the walled city of Iziz, the capital and only settlement on the Inner Rim world of Onderon. The towers were armed with ranged energy weapons, such as turbolasers and ion cannons, that were capable of repelling both land-based and aerial assaults."}, {"tag": "p", "text": "The network of defense towers saw action in 4000 BBY, during the Battle of Iziz, where they were employed against the Beast Riders from Onderon's wilderness. These emplacements were subsequently destroyed, when Iziz was virtually leveled after the battle. However, they would be replaced some fifty years later by a network of air defense towers. The new defensive network would see action during the Onderon Civil War, when the Jedi Exile returned to that world to help Queen Talia fend off the Sith-backed coup d'état staged by her cousin, General Vaklu."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Defense towers were planetary emplacements, built and stationed along the walls of Iziz, the capital city of Onderon. They carried armaments of both long-range defensive turbolaser batteries and ion cannons. These weapons were manned on swiveling platforms by Wave gunners, a faction of\nIziz's army. The towers were specifically designed to combat the flying beasts ridden by the Beast Riders of Onderon's wilderness. While offering ample protection from land-based attacks, defense towers were less protected from aerial assaults, as their tops were open to allow for greater firing mobility. However, the towers were easily destroyed when subjected to precision strikes from the Beast Riders' heavy blaster rifles."}, {"tag": "p", "text": "Turbolasers and ion cannons were mounted on the uppermost section of the tower, allowing for full range when targeting drexls or invading aircraft alike. Laser fire from the batteries manifested as a concentrated blast of yellow energy, capable of vanquishing a Drexl-mounted Beast Rider with a direct hit. Also, the recharge time between turbolaser blasts was relatively short. This allowed the Wave gunners to fire at targets constantly, and stir enough apprehension within approaching enemies to cause them to rethink their attack strategy. A new network of defensive structures was put in place some time prior to 3951 BBY. These towers were enclosed structures, manned by at least four gunners, led by an officer, and equipped with one pair of laser cannons apiece."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Beast Wars"}, {"tag": "p", "text": "In the year 4000 BBY, Iziz requested aid from the Galactic Republic, who in turn sent a number of Jedi Knights on their behalf to quell the prolonged civil war which had plagued the planet. When the Jedi arrived, they were attacked by Oron Kira's Beast Riders, who knew of their arrival before the citizens of Iziz did. The Jedi immediately called for assistance from the city, and the defense towers were ready; they opened fire with their defensive batteries, downing several of the pursuing Riders."}, {"tag": "p", "text": "During the Battle of Iziz of the same year, the defense towers again saw action against those same Beast Riders, who were led this time by Oron Kira's father, the Beast-Lord Modon Kira. Four defense towers were situated along the northern wall of Iziz, and these were the first to meet the oncoming Beast Riders in battle. Upon sight of their approach, Queen Amanoa of Iziz instructed her servant Novar to order the Wave gunners to fire their turbolasers and ion cannons, in an attempt to repel the attack. The gunners did as commanded, but had quickly become overwhelmed by the onslaught of Beast Riders, who had amassed the largest army the city-dwellers had ever seen. As the Beast Rider ground troops made their way over the city ramparts, several of them were able to scale the defense towers. Gunner 1, the Wave gunner from the first of the defense towers, noticed the Beast Riders preparing to attack the fourth tower, and commed Gunner 4 in an attempt to warn him. Gunner 4 received the link, albeit static-filled, just as the first defense tower was destroyed by incoming blaster fire. The transmission gave way to full static at the same moment that Commander Gobee of the Beast Riders appeared behind him. Gobee proceeded to shoot the gunner down while mocking his fallen comrade, Gunner 1. The remaining defense towers were destroyed toward the end of the battle when the forces of Iziz were defeated."}, {"tag": "h3", "text": "Onderon Civil War"}, {"tag": "p", "text": "By the time the Jedi Exile visited Iziz nearly fifty years later, the defense towers had been replaced by a network of air defense towers. During the Onderon Civil War's second battle, these towers attempted to shoot down a modified Basilisk war droid that had been loaned to the Exile by the Mandalorians under Mandalore Canderous Ordo, which she used to return to the planet in order to relieve Onderon Royalist forces protecting Queen Talia. The towers failed, as the assault vehicle was too fast and too heavily-armored for them to destroy. The Exile and her companions successfully landed amidst the ruined Merchant Quarter and set out to engage those troops loyal to General Vaklu's Sith-backed attempted coup d'état. After its crew was killed by Royalist forces, one of these towers was hijacked by the Exile, which she then used to shoot down a number of Vaklu-aligned Aurek fighters that were attacking Royalist positions within the Iziz Royal Palace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "These structures first appeared in the Tales of the Jedi story arc Ulic Qel-Droma and the Beast Wars of Onderon, and were mentioned in the audio dramatization. In the computer and video game Star Wars: Knights of the Old Republic II: The Sith Lords, they again make an appearance, however the structure of the towers is depicted differently. They are described by Captain Riiken as an \"air defense tower\" in the game's dialogue; in addition, the officer will give the player a small briefing on the Beast Wars if asked."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}