{"url": "Izri_Dazh", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Keshiri", "Category:Legislators and councilors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Izri Dazh"}, {"tag": "p", "text": "Izri Dazh was a Keshiri male member of the planet Kesh's ruling Neshtovar, active in the era of the Great Hyperspace War. Although considered to be quite aged by the year 5000 BBY, Dazh led the Neshtovar as the High Councilor, presiding over the Circle Eternal in the city of Tahv. In 5,000 BBY, Dazh presided over hearings regarding supposedly heretical teachings by geologist Adari Vaal, that presented a view of Kesh's creation that ran contrary to the prevalent Keshiri religion of which Dazh was a devout follower. The sessions were heated, but they were interrupted by a sudden explosion in the nearby Cetajan Mountains, which Dazh and the other Keshiri took as a sign from the Keshiri gods, the Skyborn. Harassment from Dazh and other Keshiri drove Adari Vaal to flee into the mountains, where she found the source of the explosion—a group of crash-landed Sith. Through Vaal's assistance, the Sith made their way into civilization, where they claimed to be the Skyborn. Although initially skeptical, Dazh became completely convinced of their divinity and grew devoted to serving the supposed Skyborn. With the Sith firmly entrenched as rulers of Kesh, Dazh eventually died sometime before 4975 BBY, his religious faith seemingly affirmed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Izri Dazh was a male Keshiri, a native of the planet Kesh, who was a high-ranking member of the world's Neshtovar ruling council. A veteran rider of Kesh's native uvak beasts by the year 5000 BBY, Dazh was considered to be aged at that point in his life—he had developed a physical ailment that caused him to hobble, forcing him to use a cane—and had risen to the position of High Councilor, presiding over the Neshtovar's court at the Circle Eternal in the city of Tahv. That year, Dazh and the Neshtovar presided over a major issue. Geologist Adari Vaal had uncovered evidence that the land of Kesh had been formed naturally by the planet's volcanoes, contradicting the prevalent Keshiri religion. Dazh had a connection to her family, as he had eulogized her husband Zhari, a member of the Neshtovar, after he was killed in an uvak-riding accident. After teaching her findings to geology students, Vaal was called before the Neshtovar. A devout religious man, Dazh directly confronted her about her teachings in a series of public hearings. During one particular hearing, Vaal presented physical evidence in the form of \"flamestones\" gathered from all across Kesh, Dazh refused to accept her protests, and accused her of being a heretic. Furthermore, Dazh hinted that Vaal's teachings could ultimately bring harm upon all the Keshiri by bringing upon the wrath of their gods, the Skyborn. Suddenly, a massive, fiery explosion rocked the nearby Cetajan Mountains, the force of which threw Dazh to the ground. He was helped to his feet by Vaal, confident that the Skyborn had sent them a message."}, {"tag": "p", "text": "The meeting adjourned after the incident, as Dazh quibbled with his colleagues about what the explosion meant. By the next day, even though the still-burning mountain had been determined not to pose any threat to Tahv, the focus turned to Adari Vaal as a large mob formed in front of her home. Dazh joined the group and tried to speak with Vaal, but the woman was spooked by the mob's torches and fled on the back of her late husband's uvak, evading Neshtovar riders as she made her way into the mountains. Vaal discovered a group of Sith that had crash-landed in the Cetajan range—the source of the previous explosion—and aided them in reaching the mainland. Upon their arrival in Tahv, they claimed to be the Skyborn. Dazh was initially skeptical, but he was convinced of their divinity after being levitated through the Force. Afterward, Dazh humbly greeted their leader, Yaru Korsin, in the Circle Eternal in front of thousands of Keshiri and officially proclaimed them to indeed be their gods. With the Skyborn returned to Keshiri society, their members were quartered in the homes of the Neshtovar, with Korsin and his wife Seelah residing in Dazh's domicile. In order to show devotion, Dazh declared that all Neshtovar, including himself, should move to humbler homes. Dazh died sometime before 4975 BBY, and his former home was used as a meeting-place for the Keshiri resistance—including some of Dazh's sons and grandsons—that opposed the rule of the Sith."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Izri Dazh was a devoutly religious individual, and very slow to accept any notion that contradicted his prior beliefs. Dazh rejected anything that went against the common religious beliefs in any way, and was even skeptical when presented with the purported Skyborn gods. Dazh was especially dismissive of Adari Vaal and her geologic teachings, regarding her as a heretic. In fact, Vaal's ideas provoked Dazh into outright rage in her hearings before the Neshtovar, and he constantly railed against her and her beliefs. Dazh felt his faith justified with the arrival of the Sith, and his initial skepticism gave way to devotion and subservience to the supposed Skyborn. Dazh had lavender skin, and by 5,000 BBY, as an aged man, had gone completely bald. Dazh also suffered from a physical ailment which caused him to hobble when he walked, forcing him to make use of a cane."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Izri Dazh first appeared in Lost Tribe of the Sith: Skyborn, a 2009 eBook by John Jackson Miller. Thus far, it is his only appearance in the Star Wars canon, although he was mentioned in one of Skyborn's sequels, Lost Tribe of the Sith: Savior."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}