{"url": "Izvoshra", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Military units", "Category:Phrases"], "nodes": [{"tag": "h1", "text": "Izvoshra"}, {"tag": "p", "text": "Izvoshra was the name given by Grievous to his elite cadre of Kaleesh warriors. The word Izvoshra simply meant \"elite.\" There were only eight warriors in Grievous's cadre, a number sacred to the Kaleesh. One of them was Bentilais san Sk'ar."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Though not formed into the \"elite\" until after the death of Ronderu lij Kummar and Grievous's journey to Abesmi, several of the Izvoshra had already been fighting at Grievous's side for years. Among the Izvoshra was a warrior found by Grievous while shipwrecked on Grendaju, and believed to be from the same hunter race as Ronderu. Another was the revolutionary counterpart to Grievous, who fought on the other side of the planet, and another still was a former member of the Muja Bandits who used to desecrate Kalee's sacred temples. Each warrior was an almost unbeatable fighter, but were much more than that. Each warrior was a khan in charge of their own brigade of kolkpravis soldiers and they were chosen for their abilities and devotion to Kalee."}, {"tag": "p", "text": "The Izvoshra followed Grievous in his very successful campaign of revenge during the Huk War, slaughtering countless Yam'rii, driving them from Kalee and overrunning Huk colony worlds. After the war's abrupt defusal by the Jedi, Grievous became an enforcer for the InterGalactic Banking Clan, but the IBC refused to hire his elite. Instead, with the permission of Count Dooku, San Hill commissioned a series of advanced IG-100 MagnaGuards to serve as replacements. After a time, Grievous grew so disgusted as he watched his homeworld suffer under Republic embargoes while the Huk went unpunished for their various atrocities, that he broke his contract with the IBC, gathered together the original Izvoshra aboard the Martyr, and prepared to return to Kalee and reignite the war. The Izvoshra were all believed to have been killed aboard Grievous's ship when the Confederacy sabotaged it, planting an ion bomb aboard the shuttle that detonated above the Jenuwaa Sea."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "After being rebuilt as a cyborg and becoming the General of the Droid Armies of the CIS, Grievous personally trained his MagnaGuards and adorned them with Kaleesh cloaks and headwraps, in tribute to his original khans. Towards the end of the Clone Wars, Grievous organized an experiment on the planet Nelvaan, where Techno Union scientists were mutating the native Nelvaanians in an attempt to produce powerful organic warriors. Intrigued by the similarity of the Nelvaanian people to the Kaleesh, Grievous may have intended to make some of these augmented Nelvaan warriors into his new elite forces. Any plan the general had in relation to them had to be scrapped when the subjects escaped and the testing was destroyed by Anakin Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}