{"url": "J%27Quille/Legends", "categories": ["Category:Legends articles", "Category:B'omarr Monks", "Category:Cyborgs", "Category:Desilijic servants", "Category:Hunters", "Category:Males", "Category:Spies", "Category:Tatooinians", "Category:Whiphids"], "nodes": [{"tag": "h1", "text": "J'Quille"}, {"tag": "p", "text": "J'Quille was a male Whiphid hunter who served in Jabba Desilijic Tiure's court during the Galactic Civil War. He was a former lover of Lady Valarian and secretly worked as a spy for her in Jabba's presence. He was heavily prone to paranoia. He was also known be a great fighter because of his hunting skills."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "J'Quille was a male Whiphid hunter who served as a spy and assassin for the crime lord Lady Valarian. At some point in time prior to 4 ABY, J'Quille became a member of Jabba Desilijic Tiure's court, secretly sent by Lady Valarian to kill her rival Jabba. As part of his plan to assassinate the Hutt, J'Quille paid Phlegmin the kitchen boy to put slow-acting poison into Jabba's food, however some unknown being blackmailed him, forcing him to pay them 10,000 credits to keep quiet. Matters were worsened when J'Quille saw Porcellus and Ree-Yees standing over Phlegmin's dead body. This unfortunate turn of events made him realize that he had to change his plan. Unsure what to do, J'Quille contacted Valarian. She mentioned something about a B'omarr Monk, but her statement was cut across by Jabba's booming laugh. He rushed to Jabba's court to see Leia Organa, disguised as Boushh and Han Solo pleading with Jabba."}, {"tag": "p", "text": "Later, J'Quille got an anonymous message from someone who claimed to know who was behind the blackmailing, who told him to meet them on the citadel roof at sunfall. On his way to meet this stranger he noticed a shifty B'omarr Monk whom he'd seen near the kitchen when Phlegmin was found dead. Unbeknownst to J'Quille, the corrupt, embodied monk was working for Lady Valarian and had been trying to inform J'Quille that Phlegmin was in fact the blackmailer. However, J'Quille misinterpreted Valarian's comment about a B'omarr monk, and believed that the monk had been blackmailing him. After a misunderstanding, the Whiphid hunter stabbed the monk with his vibro-blade, which had been a gift from Lady Valarian in the first place."}, {"tag": "p", "text": "In the monk's hands was the thermal detonator used by Princess Leia Organa (as Boushh). He planned to make up for his mistakes to Valarian by planting the detonator on Jabba's sail barge, but it was soon stolen from him by Bib Fortuna. After Jabba's death, J'Quille attempted to return to Toola, only to discover that Lady Valarian had put a huge bounty on his head if he ever left the planet Tatooine. With nowhere else to go, he returned to Jabba's Palace and joined the B'omarr Monks having his brain removed from his body."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "J'Quille was portrayed by mime artist Tim Dry."}, {"tag": "p", "text": "During production of Return of the Jedi this character was nicknamed \"Tooth Face\", due to the production team being unable to develop a character or species name. After the movie release, Lucas and others developed the official species name of Whiphid, and Tooth Face the individual's name, J'Quille, was revealed in Tales from Jabba's Palace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}