{"url": "J%27Quille", "categories": ["Category:Canon articles", "Category:Wookieepedia Featured articles", "Category:B'omarr Monks", "Category:Bounty hunters", "Category:Desilijic servants", "Category:Males", "Category:Spies", "Category:Tatooinians", "Category:Whiphids"], "nodes": [{"tag": "h1", "text": "J'Quille"}, {"tag": "p", "text": "J'Quille was a Whiphid male from the planet Toola. During the Galactic Civil War, he worked as a bounty hunter for the Hutt crime lord Jabba Desilijic Tiure on the planet Tatooine. Unbeknownst to Jabba, the Whiphid truly served as a spy for the Hutt's rival Lady Valarian, with whom J'Quille had a romantic affair, and planned to kill Jabba for her by poisoning the Hutt's food. J'Quille was present in Jabba's Palace in the year 4 ABY, when a group of rebels attempted to rescue the smuggler Han Solo from Jabba's clutches. The Whiphid witnessed the arrival and capture of each member of the group."}, {"tag": "p", "text": "After the final rebel, the Jedi Luke Skywalker, was captured, J'Quille traveled on the Hutt's sail barge, the Khetanna, to witness the rebels' planned executions at the Pit of Carkoon. However, the rebels managed to defeat Jabba's forces there and kill the Hutt, destroying his sail barge as they escaped. J'Quille survived the explosion but found that Valarian had placed a bounty on him, since he had not been personally responsible for Jabba's death. Unable to leave Tatooine, J'Quille joined the B'omarr Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A spy in the palace"}, {"tag": "p", "text": "The Whiphid J'Quille was born on the frozen world of Toola, but he dwelt on the desert planet Tatooine during the Galactic Civil War between the Galactic Empire and the Rebel Alliance. On Tatooine, he served the crime lord Lady Valarian, a fellow Whiphid with whom he had a romantic affair."}, {"tag": "p", "text": "Acting as a spy for Valarian, J'Quille took up work as a bounty hunter for the Hutt crime lord Jabba Desilijic Tiure, Valarian's biggest rival on Tatooine. While living in Jabba's Palace, the Whiphid planned to poison the Hutt's food in order to kill him for his lover."}, {"tag": "h3", "text": "Throne room spectator"}, {"tag": "p", "text": "At some point between 19 BBY and 0 BBY, J'Quile was amongst a crowd of spectators in the palace's throne room who witnessed the Rodian Greedo return from an unsuccessful mission to the planet Mygeeto. Jabba was about to drop the Rodian into his rancor pit for his failure, when Greedo offered up the lightsaber of Jedi Master Ki-Adi-Mundi as tribute. The Ithorian Dok-Ondar immediately offered to buy the lightsaber from Jabba, causing the Hutt to show leniency to the Rodian."}, {"tag": "p", "text": "In the year 0 ABY, J'Quille was again present in the throne room when the Sith Lord Darth Vader paid Jabba a visit in order to request the services of Jabba's bounty hunters. During the negotiations, J'Quille and the other members of the crime lord's court were dismissed from the room in order to give the pair privacy."}, {"tag": "h3", "text": "A message from a Jedi Knight"}, {"tag": "p", "text": "J'Quille was again present in Jabba's Palace four years later, when the droids C-3PO and R2-D2 delivered a message to Jabba from self-proclaimed Jedi Knight Luke Skywalker, who wished for the release of his captured friend—the smuggler Han Solo, frozen in carbonite. While the holographic message was displayed, J'Quille sat in one of the throne room's booths with the Yarkora Saelt-Marae. J'Quille watched in awe as the message ended with Skywalker gifting the two droids to Jabba, and the pair was taken away and put to work in the palace."}, {"tag": "p", "text": "Having moved to a different booth within the throne room, J'Quille later sat behind the Elom Tanus Spijek during a musical performance put on for Jabba by the Max Rebo Band, which ended when Jabba dropped one of the dancers, a Twi'lek named Oola, into a pit before his throne that contained the carnivorous rancor Pateesa. J'Quille did not get up to view the dancer's demise but raised his arms and cheered along with the other members of the Hutt's court."}, {"tag": "h3", "text": "The rebels arrive"}, {"tag": "p", "text": "Moments later, the Whiphid was caught by surprise when Princess Leia Organa, disguised as the bounty hunter Boushh, entered the throne room with the captured Wookiee Chewbacca, a companion of Solo's. Their arrival was part of a plan to free Solo that also involved Skywalker's two droids as well as Lando Calrissian, a friend of Solo's who was working undercover as one of Jabba's guards. Standing directly in front of J'Quille, Organa claimed she had come to collect the bounty on Chewbacca's head but demanded that Jabba pay more than originally promised. After Organa threatened the room with a thermal detonator, the crime lord agreed to pay the higher bounty, and the Wookiee was taken away."}, {"tag": "p", "text": "Organa remained in the palace, believing that her disguise had worked; however, the Hutt had seen through the costume and, after pretending to leave the throne room later that night, remained in hiding along with much of his court. Believing the throne room to be clear, Organa sneaked in and freed Solo from his carbon-freeze, after which Jabba and his court revealed their presence. J'Quille stood upon a set of stairs into the throne room and watched as both Solo and Organa were captured."}, {"tag": "p", "text": "When Skywalker himself arrived at Jabba's Palace shortly thereafter to enact the final part of the rebel plan, J'Quille was once again in a booth in the throne room, sleeping along with a number of other members of the court. The Whiphid awoke to see Skywalker attempt to negotiate with Jabba before threatening him with a blaster pistol. In response, the Hutt dropped the Jedi and the Gamorrean guard Jubnuk into the rancor pit. The court cheered for Pateesa as they watched the fight in the pit play out, but Skywalker slew the beast, causing Jabba to order the execution of Skywalker, Solo, and Chewbacca at the Pit of Carkoon."}, {"tag": "h3", "text": "Skirmish at the Pit of Carkoon"}, {"tag": "p", "text": "J'Quille and many other court members accompanied Jabba on his sail barge, the Khetanna, to view the planned executions at the pit, where the rebels would be thrown into the jaws of a sarlacc. However, once at the pit, the rebel prisoners freed themselves and defeated Jabba's guards, while Organa, who had been chained to Jabba as a slave, strangled the Hutt. Skywalker then boarded the sail barge and rescued Organa, who pointed a turret on the barge's top deck to shoot at the vehicle itself, causing it to explode as the rebels escaped."}, {"tag": "p", "text": "J'Quille managed to survive the sail barge's explosion but later discovered that Valarian, his former lover, had placed a large bounty on his head, as he had not been the one to kill Jabba. Finding himself unable to leave Tatooine due to the bounty, the Whiphid chose to join the B'omarr Order, a group of monks who lived within Jabba's Palace. J'Quille was mentioned in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "J'Quille was a brutal and fearsome-looking member of the large Whiphid species, with coarse, gray fur and powerful tusks. He stood two meters tall with pink skin and retractable, black-colored eyes. By the time that J'Quille encountered Luke Skywalker at Jabba's Palace, the Whiphid had fought and won many battles, which the Jedi could immediately tell despite never having met him before."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "J'Quille had above average strength and average fighting skills, speed, and intelligence. He had below average diplomatic skills and was not Force-sensitive."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Design and casting"}, {"tag": "p", "text": "J'Quille first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The character was designed by Creature Consultant Chris Walas and a maquette of the character measuring ten by two by eight centimeters was made for the film. J'Quille was played by mime artist Tim Dry, who was not credited. At the time, Dry was one half of the mime duo Tik and Tok with fellow mime artist Sean Crawford, and neither had ever appeared in a film before. They were cast together after being invited by their former teacher Desmond Jones to a casting session with producer Robert Watts, who was looking for around nine mime artists to fill creature roles in the upcoming Star Wars movie."}, {"tag": "p", "text": "Neither Dry nor Crawford knew who they would be portraying until they first visited Elstree Studios, where most of their characters' scenes were filmed. Dry was assigned J'Quille, who was known only as \"Tooth Face\" during production, while Crawford was assigned the character Saelt-Marae, known at the time as \"Yak Face.\" Dry's contract stated that he would receive £300 per week for two weeks of guaranteed work on the film, and then £65 for any additional days after that."}, {"tag": "h3", "text": "On set"}, {"tag": "p", "text": "The J'Quille costume consisted of three layers: a white lycra body suit, a padded foam suit, and then a fur-covered shirt and pants on top, along with the costume head, which had eye slits in the nostrils for Dry to see out. The entire outfit was fairly heavy to wear and extremely warm inside, meaning that Dry had to remove the head in between takes so that he could be cooled down with hair dryers to prevent overheating. This was particularly an issue during the filming of the sail barge scenes, which were shot in the Arizona desert."}, {"tag": "p", "text": "The positions of J'Quille and each of the other extras in Jabba's Palace was chosen by first assistant director David Tomblin, who placed Dry and Crawford seated together in one of the palace's booths for their first scene. While seated together, the two were unable to actually turn their heads and face each other while in costume. Between the takes of this scene, Dry and Crawford befriended Luke Skywalker actor Mark Hamill, who was a similar age to them."}, {"tag": "h3", "text": "Naming"}, {"tag": "p", "text": "\"Tooth Face\" first received the name J'Quille in the short story \"Let Us Prey: The Whiphid's Tale,\" written by Marina Fitch and Mark Budz, and included in the 1995 Star Wars Legends anthology book Tales from Jabba's Palace. The character's name was brought into the new Star Wars canon by the mobile app Star Wars: Force Collection, which was released on September 4, 2013. Although its release predates the reset of the Star Wars canon on April 25, 2014, following The Walt Disney Company's acquisition of the franchise, Lucasfilm Story Group member Leland Chee later confirmed that the game was kept updated to fit with canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}