{"url": "J%27oopi_Sh%C3%A9/Legends", "categories": ["Category:Legends articles", "Category:Jedi Generals", "Category:Jedi Sentinels", "Category:Kadas'sa'Nikto", "Category:Males", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "J'oopi Shé"}, {"tag": "p", "text": "J'oopi Shé was a male Kadas'sa'Nikto Jedi Master allied with the Republic Group, a secret organization within the Galactic Senate; Master Shé was also a member of the Order's technical division."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Kadas'sa'Nikto, J'oopi Shé was trained in the ways of the Force by the Jedi Order. Raised at the Coruscant Jedi Temple, Shé trained as a Jedi Sentinel, crafting a green-bladed lightsaber before attaining the rank of Jedi Master. Earning a place in the Order's technical division, Master Shé was stationed on Coruscant throughout the Separatist Crisis when he came to be associated with the secret organization calling itself the Republic Group."}, {"tag": "p", "text": "When the Clone Wars erupted between the Republic and the Confederacy of Independent Systems, Master Shé took up the mantle of General in the Grand Army of the Republic, largely serving on Coruscant throughout the war. As part of his work with the Republic Group, Master Shé associated himself with Senators Des'sein and Largetto and began to take part in their efforts to restore the Republic."}, {"tag": "p", "text": "When the war came to Coruscant, Master Shé aided the Republic thwart the Separatist forces on the planet, later attending a briefing given by Master Obi-Wan Kenobi at the Temple. Immediately before that briefing, Master Shé accompanied Senators Des'sein and Largetto as they met with the captain of the Stellar Envoy which was docked at the Republic Executive Building."}, {"tag": "p", "text": "As the ship's cargo was unloaded, Master Shé installed a transponder of unusual design in the ship's holds; Captain Tobb Jadak was told an Antarian Ranger named Folee would know what to do with the transponder when it arrived at its destination. During the meeting, the Senators and the Jedi were unaware they were being watched by members of the Senate Bureau of Intelligence. When Director Armand Isard made the decision to arrest all members of the Republic Group, Master Shé was forced to take the Senators to a safer place as Captain Jadak and the Stellar Envoy were pursued by clone shock troopers. After escorting the Senators to safety, Master Shé returned to hear Kenobi's report at the Temple."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}