{"url": "J-1_proton_cannon", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Droid stubs", "Category:Confederacy of Independent Systems vehicles", "Category:Droid vehicles", "Category:Mobile artillery"], "nodes": [{"tag": "h1", "text": "J-1 proton cannon"}, {"tag": "p", "text": "J-1 proton cannons were a form of droid anti-aircraft cannon that fired proton bombs. They were used by the Confederacy of Independent Systems during the Clone Wars against the Galactic Republic. They were deployed by the Separatists on the planets Ryloth, Geonosis, and Anaxes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Confederacy of Independent Systems's occupation of Ryloth, the tactical droid, TX-20 and his battle droids set up a battery of five of these proton cannons in the city Nabat. When the Grand Army of the Republic attempted to land, the cannons were able to destroy one of the three assault ships. The cannons were then destroyed when Jedi General Obi-Wan Kenobi hijacked one, and proceed to fire on the others. During the Second Battle of Geonosis, they were used to stop Republic forces from reaching the primary droid foundry. A proton cannon used against the Republic ships during their landing phase was taken out by BTL-B Y-wing starfighter/bombers. After their ground forces reached Point Rain, Jedi General Anakin Skywalker led his Padawan—Jedi Commander Ahsoka Tano—and clone troopers into the enemy lines, where they used Electro Magnetic Pulse grenades to take out the scanners on proton cannons. This allowed All Terrain Tactical Enforcers to enter without incident and take out the Geonosian defenses, including the proton cannons and the shield generator. The cannons also saw action at the Battle of Anaxes, which turned out to be a key Republic victory during the Outer Rim Sieges."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The J-1 proton cannon first appeared in the opening newsreel of The Clone Wars: Season One episode \"Innocents of Ryloth.\" They later appeared in the unfinished storyreel of the episode \"Unfinished Business,\" as well as its completed Disney+ adaptation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}