{"url": "Andoan_Wars/Legends", "categories": ["Category:Legends articles", "Category:Battles of the Andoan Wars", "Category:Conflicts of the Mid Rim"], "nodes": [{"tag": "h1", "text": "Andoan Wars"}, {"tag": "p", "text": "The Andoan Wars was a conflict between the despotic rulers of the Andoan worlds, known as the Spiverelda, and the Andoan Free Colonies. The war ended at the Battle of Raquish in 39 BBY, a decisive victory for the Spiverelda. However, it turned into a debacle with the intervention of a sizable fleet of the Republic Judicial Forces which ordered the demilitarization of the sector."}, {"tag": "h2", "text": "The conflict"}, {"tag": "p", "text": "The Andoan Wars, a conflict between Ando and the Andoan Free Colonies, began in the year 57 BBY. The Andoans, convinced that the Galactic Republic would do nothing more than discuss Andoan demilitarization in committee, had little concern for the prospect of Republic involvement in the fighting. The Harch known as Trench emerged as Ando's greatest military leader during the conflict, defeating the Free Forces at Arbular, Horos, and finally the decisive Battle of Raquish in 39 BBY. The victory at Raquish proved to be a debacle for Ando, however, as the firepower displayed at the battle and the ruthless tactics employed by Trench prompted the Republic to intervene, separating the two sides and sparing the Free Colonies."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "While a sizable Judicial Forces fleet enforced demilitarization of the sector, the Andoan leadership was driven to radicalization by the outcome of the Andoan Wars. Ando became one of the first worlds to secede from the Republic during the Separatist Crisis in 23 BBY, and First Minister Daragi Hoba alluded to Republic-enforced demilitarization during an address to Andoans celebrating the secession. Trench continued his military career after the conclusion of the Andoan Wars, serving the Corporate Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Andoan Wars were first mentioned in The Essential Guide to Warfare, a 2012 reference book written by Daniel Wallace and Jason Fry. When asked on Twitter if the Andoan Wars and Jorus C'baoth's intervention with the Ando Demilitarization Observation Group were linked, Wallace and Fry answered this was \"likely\" and \"a fair assumption.\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}