{"url": "JA189", "categories": ["Category:Canon articles", "Category:Death Squadron personnel", "Category:Humans", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Individuals of unspecified gender"], "nodes": [{"tag": "h1", "text": "JA189"}, {"tag": "p", "text": "JA189 was a TIE fighter pilot who served the Galactic Empire during the Galactic Civil War. After the Battle of Hoth, JA189 and three other pilots were sent into the Hoth asteroid belt to chase down the Millennium Falcon. Imperial Lieutenant Commander Ciena Ree helped coordinate the four pilots from on board the Executor-class Star Dreadnought Executor, but even with her aid all four TIE/ln space superiority starfighters crashed within the belt while chasing the Falcon. JA189 was the second to crash."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "JA189 was the designation of a human TIE fighter pilot who served in the Imperial Navy of the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic. JA189 was stationed on board an Imperial-class Star Destroyer, when it traveled to the Hoth system as part of an attack on the Rebel Base located on the planet Hoth. The Empire successfully defeated the Alliance on the surface of Hoth, but a large number of the Rebels escaped the planet in transports protected from the Imperial fleet by an ion cannon. Following the conclusion of the battle, the Sith Lord Darth Vader demanded that at least three of the six Imperial-class Star Destroyers present for the battle, chase and capture one Rebel vessel in particular, the YT-1300 light freighter named the Millennium Falcon."}, {"tag": "p", "text": "The Falcon fled from the Imperials into an asteroid belt located in the Hoth system in the hopes of hiding from them there. As the Star Destroyers were unable to give chase in the belt, JA189 and three other TIE pilots were dispatched from one of the Destroyers and gave chase in TIE/ln space superiority starfighters, despite entering such a belt in an unshielded craft being tantamount to suicide. Lieutenant Commander Ciena Ree provided auxiliary navigational assistance for the four pilots from onboard the bridge of Vader's personal flagship, the Executor-class Star Dreadnought Executor. Despite her assistance, the TIE pilot CR978's vessel collided with an asteroid and exploded. Moments later, Ree gave warning that JA189's computer was not linking up, but was too late, as a small asteroid clipped JA189's TIE and caused it to spin out of control and then explode, killing the pilot. The two remaining pilots, OL701 and NA811, soon suffered a similar fate to JA189, and the Falcon ultimately escaped Imperial clutches. Ree was deeply disheartened by the deaths of the four pilots, but was congratulated for her work helping them by Admiral Firmus Piett, the commanding officer of the Executor. Piett believed the four pilots had never stood a chance anyway, and that Ree had managed to keep them alive longer than they would have survived on their own."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "JA189's TIE fighter first appeared in the original release of Star Wars: Episode V The Empire Strikes Back in 1980, although the pilot was not visible in the film. JA189 was first identified and heard in the novel Lost Stars, which was written by Claudia Gray and released in 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}