{"url": "JS-1975", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Humans", "Category:Males", "Category:Members of Gideon's Imperial remnant"], "nodes": [{"tag": "h1", "text": "JS-1975"}, {"tag": "p", "text": "JS-1975 was a human male scout trooper who was a member of Moff Gideon's Imperial remnant during the New Republic Era. Around 9 ABY, he guarded the entrance to Nevarro's city alongside AP-1982, another scout trooper, when Gideon's forces took control of the city. He later assisted in securing an infant whom Gideon wished to acquire. When they arrived at the city's outskirts, they awaited for confirmation to enter until they were approached by IG-11, who incapacitated both of them and secured the Child."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Guarding the city"}, {"tag": "p", "text": "A human male, JS-1975 was a scout trooper who served as a member of an Imperial remnant led by Moff Gideon during the New Republic Era. Around 9 ABY, the scout trooper guarded the entrance to Nevarro's city alongside another scout trooper, AP-1982, after Gideon's forces took control of the city and drove its residents away."}, {"tag": "p", "text": "Sometime later, he watched as Bounty Hunters' Guild agent Greef Karga entered the city with Din Djarin in cuffs, accompanied by Carasynthia Dune and Grogu's pram. When Gideon arrived in front of the city's cantina with his forces and cornered Karga and his allies, JS-1975 and AP-1982 overheard a communication from Djarin and learned of the Child's true location. The two activated their speeder bikes and tracked him down. Upon catching up to the Child, they fired at the Ugnaught carrying him as well as his blurrg, killing them both. After securing the Child, they made their way back to the city."}, {"tag": "h3", "text": "Standing by"}, {"tag": "p", "text": "Arriving at the outskirts of the city, JS-1975 activated his comlink and requested confirmation to enter the town, but was told to stand by as Gideon had just entered the area and had his forces kill a group of local troopers. He noticed the Child squirming in the sack and immediately knocked the infant on the head. AP-1982 questioned the action by Gideon's forces, to which he replied saying that Gideon always enforced the law when they entered the town."}, {"tag": "p", "text": "JS-1975 knocked the Child again when the infant began growling. AP-1982 accompanying him questioned what was inside the sack, to which he replied he did not know and that he didn't concern himself with what Gideon's plans were for the infant. AP-1982 then asked if he could see it, but JS-1975 responded stating that Gideon killed a dozen of his own men to make a statement, asking AP-1982 if he understood it."}, {"tag": "p", "text": "AP-1982 then pulled out his blaster and began firing at a nearby object out of boredom, but was unable to land a shot. The action prompted JS-1975 to pull out his own blaster and start firing. Ultimately, neither of them could hit the object. AP-1982 then asked if they should provide the Child with water, but JS-1975 called him out, stating that he only wanted to see the infant. AP-1982 claimed he was able to see it, but he clarified that he barely able to do so as he only picked him up and put him into the sack, and stated that he would not take him out until it was delivered to Gideon. AP-1982 conceded, and the two then idled on their speeders."}, {"tag": "h3", "text": "Incapacitated"}, {"tag": "p", "text": "JS-1975 activated the comlink again, requesting an update on the situation. He was informed that Gideon killed an officer for interrupting him and that receiving confirmation would take longer than expected. AP-1982 voiced his concerns over the Child's condition, saying that he did not move for a while. He then suggested that they should check on the infant's condition. He stated that Gideon would not be happy to find him dead in the sack. JS-1975 finally conceded and opened the sack to reveal the Child. They questioned what the infant was, as AP-1982 poked its forehead. When the Child bit his finger, JS-1975 stated that it served him right."}, {"tag": "p", "text": "The two troopers were then confronted by IG-11, who stated that he was the child's nurse droid. As they trained their blasters at the droid, they questioned his purpose, as IG droids were usually bounty hunters. As IG-11 approached the two, JS-1975 fired a warning shot, telling him to leave. The droid then grabbed his arm and twisted it, breaking his hand and flipping him over. He then incapacitated AP-1982 and commandeered the bike holding the sack that contained the Child, making his way to the city."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A human male, JS-1975 feared Moff Gideon greatly, explaining his authority to AP-1982 upon learning that the moff had a group of local troopers killed, but grew more frustrated as he awaited for confirmation to enter the city. He repeatedly punched the Child as he squirmed inside the sack in order to stop him completely, and refused to reveal him to AP-1982 until the former finally conceded."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a scout trooper, JS-1975 wore the same armor as other scout troopers, though it was visibly dirtier. He rode a 74-Z speeder bike and carried a EC-17 hold-out blaster, which were also scout trooper mainstays. JS-1975 also carried a sack, which was used to transport the Child on his speeder."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "JS-1975 appeared in the 2019 Disney+ television show The Mandalorian, and was played by Jason Sudeikis in the eighth episode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}