{"url": "JT-12_jetpack/Legends", "categories": ["Category:Legends articles", "Category:Jetpacks", "Category:Mandalorian armor", "Category:Merr-Sonn Munitions, Inc. products"], "nodes": [{"tag": "h1", "text": "JT-12 jetpack"}, {"tag": "p", "text": "The JT-12 jetpack was a personal jetpack manufactured by Merr-Sonn Munitions, Inc. prior to the Clone Wars."}, {"tag": "p", "text": "The JT-12 was a compact jetpack featuring an MM9 missile launcher. This model was similar to the more heavily-armored Mitrinomon Z-6 jetpack. Both models were favored by the bounty hunter Jango Fett."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While Fett was hunting down Meeko Ghintee, he lost his JT-12 when an arena insectoid Borhek hit him. Fett found his JT-12 on the Outland Transit Station, using it to track down his bounty, Meeko Ghintee, through the twisting streets of the station's commercial sector. Fett continued to alternate between his JT-12 and Z-6 models, until the latter was destroyed during a battle with Obi-Wan Kenobi on Kamino. Fett equipped his JT-12 during the flight to Geonosis, later using it to launch himself into the Petranaki arena to face Mace Windu in single combat. However, Fett was charged by a disgruntled reek, and his jetpack suffered damage. Mace Windu sensed that he could kill Jango because he was now weakened and injured. Fett, off-balance and weak from the reek attack, noticed Windu charge at him. Jango tried to fire his jetpack, but the device failed to launch. With an arcing swing of his lightsaber, Windu decapitated the injured bounty hunter, severing the top of the warhead missile in the process."}, {"tag": "p", "text": "A modified version would be used extensively by clone jet troopers and members of the Mandalorian Death Watch, who replaced the MM9 missile with the larger Z-6 antivehicle homing missile."}, {"tag": "p", "text": "Similar to the Z-6, the fuel tank held enough fuel for one minute of continuous operation (20 three-second blasts). Each three-second blast moved the wearer up to 100 meters horizontally or 70 meters vertically. A user of standard height and weight could reach a top speed of 145 kilometers per hour with a maximum range of two kilometers. Directional thrusters featured gyro-stabilizers to apply counterthrust for maneuvering and landing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}