{"url": "Jabba%27s_Game_Plaza", "categories": ["Category:Legends articles", "Category:Events"], "nodes": [{"tag": "h1", "text": "Jabba's Game Plaza"}, {"tag": "p", "text": "Jabba's Game Plaza was an game venue on Tatooine, in the city of Mos Espa. It was host to a gaming event organized by the Hutt crime lord Jabba Desilijic Tiure."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "The gaming fair known as Jabba's Game Plaza was organized the Hutt crime lord Jabba Desilijic Tiure as a new way to make money. The Game Plaza itself was located on planet Tatooine, in the city of Mos Espa, in the vicinity of Watto's Shop and personal hangar. It consisted of four tents hosting gambling activities. The Dug racer Sebulba hosted the game of Dueling Dice, the Aleena Ratts Tyerell played his own mini race game, the Veknoid Teemto Pagalies played Digotto, and Jabba himself participated in the event, acting as the gambler's opponent in the game of holochex."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Some time prior to the Boonta Eve Classic of 32 BBY, a spacer participated in the gaming event of Jabba's Game Plaza in hopes of winning Wupiupi credits. The stranger had been forced to stop on the sun-scorched planet because of their damaged starship, and they needed to buy replacement parts from the junk trader Watto. The deal required more money than the spacer could possibly afford. Eager to turn the stranger into a paying customer, Watto provided them with a map of Mos Espa and allowed them to use his Z-P70 assistant droid. Through participating in the games, the spacer finally won enough money to buy the parts and repair their ship, and they eventually flew off Tatooine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jabba's Game Plaza was the setting of Star Wars Math: Jabba's Game Galaxy, an educational video game released by Lucas Learning in 2000."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}