{"url": "Jabba%27s_Palace/Legends", "categories": ["Category:Legends articles", "Category:B'omarr monasteries", "Category:Dune Sea locations", "Category:Palaces"], "nodes": [{"tag": "h1", "text": "Jabba's Palace"}, {"tag": "p", "text": "Hutt Castle, often simply called Jabba the Hutt's Palace after its owner, was a large sandrock and durasteel complex located at the fringes of the Northern Dune Sea on the planet of Tatooine. Originally erected as a monastery of the B'omarr Order, the buildings eventually fell into the hands of two major crimelords: first an outcast and gang leader called Alkhara and later Jabba the Hutt, a notorious crime lord from Nal Hutta."}, {"tag": "p", "text": "While the structure underwent many additions in the way of fortification and technological advances, the basic structure of the complex remained the same throughout its existence. Composed of a central rotunda and a taller spire adjacent to it, the ridge-side retreat also boasted an underground hangar and maintenance bay. Deep in the monastery's subterranean chambers, Jabba the Hutt made a throne room which sat on top of a pit that housed a pet rancor. The Hutt used the beast for a dual purpose: protection and entertainment. At the flick of a switch, a concealed door in the floor of the chamber could deposit a threatening guest into an inescapable pit while onlookers could watch as the rancor made short work of its meal."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Home of the B'omarr Order"}, {"tag": "p", "text": "Circa 700 BBY, the strict religious Order of the B'omarr monks commissioned the construction of this monastery on the fringes of the Northern Dune Sea on Tatooine. Far from any other settlements so as to amplify the monks' detachment from the universe, the environment of Tatooine allowed the Order's members to concentrate on their studies, furthering their goal of complete disconnection from all external sensation. The monks' lifestyle of solitude meant that the monastery seldom had visitors, trading occasionally with the nomadic Tusken Raiders that roamed the region, some of which may have had a hand in helping build the structure."}, {"tag": "h3", "text": "Alkhara's criminal operations"}, {"tag": "p", "text": "Nearly a century and a half after its original construction, the monastery was discovered by the outcast Alkhara and his band of thieves. While prepared to lay siege to the monastery, Alkhara was surprised when the monks opened up the monastery to the army, allowing them to make the complex their home of operations. Because the monks were few in number and otherwise concerned with their own business, Alkhara was free to use the monastery for his own needs, such as a stronghold against the Tuskens, and a staging ground from which his people preyed on the moisture farmers of Tatooine. Alkhara continued to improve his hideout over his thirty-four years as its steward, augmenting its corridors and great halls while his followers upgraded the living quarters and added a set of dungeons and underground chambers, with the monks' approval. He cut a road from the citadel to the Western Dune Sea and Pit of Carkoon, during this time, also adding battlements to the building, and the renovation of a nine-story tower to which he gave his name."}, {"tag": "h3", "text": "Under Jabba's regime"}, {"tag": "p", "text": "It wasn't until 516 BBY that the Hutt named Jabba Desilijic Tiure discovered the citadel and ousted Alkhara and seized the monastery. Like Alkhara and his predecessors, Jabba maintained a good relationship with the monks, adding on to their monastery and generally avoiding the strange religious people. Along with plating the exterior walls with ditanium, Jabba built an expansive hangar and garage for his fleet of ships and swoops. Erecting a throne room in the subterranean bowels of the citadel, the Hutt transformed the complex into a palace."}, {"tag": "p", "text": "As Jabba's criminal empire grew in reputation, more and more miscreants began to occupy the palace. Jabba employed many Gamorrean guards, allowing their families to reside in a wing of the palace in exchange for security. The Hutt occupied the palace for centuries, dividing his time between this retreat, and his home on Nal Hutta."}, {"tag": "p", "text": "When the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Jabba plotted ways to profit from the war. In 22 BBY, Jabba's son, Rotta, was kidnapped by an unknown assailant, causing Jabba to turn to the Supreme Chancellor of the Republic for aid. Hoping that the Republic could win over Jabba's support and his invaluable knowledge of secret trade routes, Chancellor Palpatine dispatched Jedi Knight Obi-Wan Kenobi to negotiate with the Hutt, while Jedi Anakin Skywalker and his new Padawan, Ahsoka Tano, sought the missing Huttlet."}, {"tag": "p", "text": "As the Republic investigated, the leader of the Confederacy, Count Dooku, approached Jabba and convinced the Hutt that the Jedi were responsible for kidnapping the Huttlet. Dooku made Jabba suspect that the Jedi were using the Huttlet as a way of bartering with the crime lord and eventually toppling his regime, when in fact Dooku was responsible for arranging the kidnapping in the first place. An enraged Jabba was led to believe the Jedi killed his son, despite the fact the Jedi had rescued him, and ordered that the Jedi responsible be put to death. As the Jedi arrived back on Tatooine to return the infant Hutt to its parent, Dooku and his forces engaged Jedi Skywalker and Padawan Tano, but they were driven off. Having forced Dooku to flee, Jedi Skywalker turned over the Huttlet to Jabba, who graciously granted the Republic forces safe passage through Hutt Space and the Arkanis sector."}, {"tag": "p", "text": "In 20 BBY After Darth Maul and Savage Opress allied themselves with Death Watch, they invaded Nal Hutta to force the Hutt Grand Council in joining their Shadow Collective. Some council members escaped to Jabba's palace, and Maul's attacked it. Jabba's forces were easily overcome, and the Hutt decided to join Maul's army."}, {"tag": "p", "text": "Decades later, during the era that in which the reign of the Galactic Empire was threatened by the Galactic Civil War, Jabba remained wealthy and corrupt. Having captured smuggler and Rebel Alliance member Han Solo in carbonite, the Hutt displayed the Human on his trophy wall for all to see. An asset to the increasingly powerful Alliance, Princess Leia Organa was dispatched with the Wookiee Chewbacca to rescue the man. Disguised as the bounty hunter Boushh, Organa attempted to treat with the Hutt, but her attempt was thwarted and the two were imprisoned. Not long after, the Alliance sent Jedi Knight Luke Skywalker to recover all three Alliance agents. When Skywalker's attempts failed, he was cast into the rancor pit as a form of public execution. Skywalker, after defeating the rancor, was handed a harsher punishment: Jabba would cast Skywalker and his friends into the maw of the sarlacc at the Great Pit of Carkoon."}, {"tag": "p", "text": "While most of Jabba courtiers followed him to the pit, very few returned. Indeed, Jabba and most of his minions died in a fiery explosion that engulfed the Khetanna, his private sail barge, and the Alliance members escaped. Some of those who survived returned to the palace in an attempt to take over the crime lord's empire or to steal his wealth. Many fell victim to B'omarr initiation rituals and had their brains removed. The palace eventually was shut down, the gates refusing to open for anyone. While many of Jabba's relatives or opponents attempted to take the palace, the walls were impenetrable and it eventually fell into abandonment."}, {"tag": "h3", "text": "Abandonment"}, {"tag": "p", "text": "Several years after Jabba's demise, Luke Skywalker and Han Solo returned to the empty palace to locate vital records pertaining to a newly developed Hutt superweapon called the Darksaber. Disguised as Tuskens, the two destroyed the sentry guard, got the great door open, and entered the domain of the B'omarr monks. Most of the complex had been looted during the mass exodus of Jabba's court, but many secrets remained. Consorting with a monk named Maizor, the duo learned of the Hutt's plans and used spare parts in the abandoned motor pool to return to Anchorhead. One year later, Jabba's empire was restored by his father and then nephew. However, Jabba's Palace remained abandoned to the monks, and the palace of Gorga the Hutt became the new headquarters of the criminal empire."}, {"tag": "h2", "text": "Layout"}, {"tag": "h3", "text": "Palace Rotunda interior"}, {"tag": "p", "text": "A large, squat rotunda topped with a ditanium-reinforced cupola, the palace was accessed via a dimly lit stone corridor which led from the main entry portcullis. A large durasteel door, the front gate was equipped with a semi-intelligent droid gatewatcher. This droid, little more than an electronic eye on a stick embedded in the gate itself, would interrogate visitors before deciding whether to allow them to enter. Once through the gate, the corridor led into the structure's central chamber the Great Room of the Enlightened, a vast and cavernous place that was filled with an eerie silence. Prayer banners hung from the ceiling, gently swaying over the multi-tiered chamber used as a place of worship for the disembodied brains of enlightened monks. Reposing in niches along the tiers that made up the chamber, the center of the room was occupied by floor-to-ceiling supports for the rotating ventilation wheel, which shifted the otherwise still air to keep the rotunda cool. The room was encircled on its exterior by a ceremonial concourse that ran underneath the cupola; weapons stations were scattered along the walkway which otherwise gave an unobstructed view of the Dune Sea."}, {"tag": "p", "text": "The upper portion of the cupola was made up of several smaller rooms used strictly for maintenance, defense, and the everyday technical needs of the complex. Among the rooms located here was a hydroponics chamber where the amphibious delicacies of Jabba's diet were grown and genetically altered. Amongst the ventilation equipment and moisture converters was a chamber which had been taken over by a band of Jawas, scavenging what they could while attempting to remain undetected."}, {"tag": "h3", "text": "Alkhara's tower and power facility"}, {"tag": "p", "text": "A nine-story tower named after the man who ordered its construction, this structure contained a circular stairway that spiraled down from its summit to its base. Capped with a communications dome, the tower's exterior was pockmarked by hyperwave transceivers that kept the palace tuned into the HoloNet and much less official communications networks."}, {"tag": "p", "text": "Just to the north of Alkhara's tower stood a shorter rotunda that served as the main power facility to the complex. While the above-ground portion of the tower housed a holoprojector that displayed the entire galaxy, the subterranean base was home to the palace's major power facility. Reached by a spiraling stair, enjoyed by the B'omarr monks for the hours of meditative walking it provided, the power plant generated enough energy to power the palace without needing to connect to existing power grids. Off one of the plant's corridors, a forgotten B'omarr ritual room remained unnoticed. Inside the ornately decorated dome, a seemingly bottomless sacrificial pit was used to dispose of the brainless bodies of enlightened monks."}, {"tag": "h3", "text": "Motor pool and subterranean passages"}, {"tag": "p", "text": "Located below ground, the motor pool area was carved out under Jabba's orders to contain the Hutt's many skiffs, barges, and animal mounts. Like the rest of the palace, the motor pool hangar had a polished stone floor and a massive durasteel gate that opened onto the harsh desert landscape of Tatooine. An underground roadway stemming from the hangar made a circuitous path from the palace to the city of Mos Eisley. Housing not only Jabba's sail barge the Khetanna, the hangar was home to the Bantha-II cargo skiffs that patrolled the grounds. As of 4 ABY, the motor pool was overseen by a Klatooinian named Barada."}, {"tag": "p", "text": "Additional subterranean passages delved deeper into the ground than the motor pool. Long since forgotten, a chamber housing the regeneration gems of the B'omarr Order was protected by a triple set of heavy doors. As of 4 ABY, a looter had penetrated one of the doors after burrowing through a tunnel. Levels below that, the Hutt crime lord had established a spice-cultivating chamber, where only the highest quality of the illicit substance was produced."}, {"tag": "h3", "text": "Throne room"}, {"tag": "p", "text": "A renovated B'omarr chapel, Jabba the Hutt made his throne room deep in the subterranean chambers of the palace complex. Accessed by a winding stone stair, the throne room's air was constantly filled with spiced t'bac smoke and the sounds of jizz per Jabba's delight in theatrics. Reposing on a large dais backed by a rotisserie cooker, Jabba could oversee the gathered masses he permitted to enjoy his company. Behind Jabba, his majordomo had their own private turbolift which allowed them to greet guests at the front gate, allowing for the crime boss' second in commanded to either welcome, turn away, or kill them. The likes of bounty hunters, assassins, smugglers and more filled out the often crowded alcoves of the chamber, many of whom plotted to one day overthrow the Hutt or kill him."}, {"tag": "p", "text": "At the center of the room, the polished stone floor gave way to a viewing grille which looked down upon a large pit where Jabba's beasts would fight, entertaining the Hutt and his guests. Amongst the beasts were Jabba's prized rancor and a krayt dragon. A trap door in the floor in front of Jabba's dais could be opened by a trigger mechanism in the Hutt's hookah pipe, dropping threatening or otherwise bothersome guests into the pit to be devoured. The throne room was host to Jabba's private band, the Max Rebo Band in the Hutt's last days. The band, headlining vocalists Sy Snootles and Joh Yowza, performed at Jabba's whim, occupying a loft directly off of the chamber."}, {"tag": "p", "text": "The largest alcove in the room, hosting the stairs to the Dancers' Pit, band lounge, and the massive private elevator that ferried Jabba up to his private chambers, was also home to a wall of trophies collected by the Hutt. Amongst these items were the taxidermied heads of a jerba and tauntaun and, for a short time, the carbonite-encased form of the smuggler Han Solo."}, {"tag": "p", "text": "The levels below the throne room were prison cells for Jabba's enemies, torture chambers whose occupants often suffered a slow, public death. The boiler room that sat opposite the prison facility was overseen by the droid EV-9D9, a sadistic droid who oversaw that assessment of all droids that would see service in Jabba's court. Additionally, it was in these dank levels that the Gamorrean guards resided with their families. The males maintained order in the palace, while their women raised their children and kept the lower levels tidy. Many stairwells and ancient halls had been deliberately blocked with debris to keep out intruders, though it did not deter them from trying."}, {"tag": "h3", "text": "Sub-levels"}, {"tag": "p", "text": "Below the dungeon levels were cellars in which Jabba kept various flasks and barrels of clarets. Deeper were various passageways, tunnels and chambers in which the B'Omarr monks lurked and went about their practices. Even deeper still below these levels were vast networks and labyrinths of tunnels and corridors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jabba's Palace was originally to be located on the planet Sicemon, but was later moved to Tatooine when the former was cut from the final version of Star Wars: Episode VI Return of the Jedi."}, {"tag": "p", "text": "There is some conflicting information on the location of Jabba's Palace. All sources before Inside the Worlds of Star Wars Trilogy, including all West End Games game material and Star Wars Galaxies, place it on the northern edge of the Western Dune Sea, not too distant from Wayfar, while newer material shows it located on the edge of the Northern Dune Sea, north of Mos Eisley. This article presumes that the newer map is correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}