{"url": "Jabba%27s_Throne_Room", "categories": ["Category:Legends articles", "Category:Bars and clubs"], "nodes": [{"tag": "h1", "text": "Jabba's Throne Room"}, {"tag": "p", "text": "The Jabba's Throne Room was a club-bar on Atzerri during the Black Fleet Crisis in 16 ABY. It was exactly modeled after the throne room of the late Hutt crime lord Jabba Desilijic Tiure on Tatooine. Although the architecture and atmosphere was authentic, some of the dimensions had been stretched to accommodate more seats."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "It served a variety of cuisines including roast nerf. The club's staff consisted of look-alikes of former entourage members, including a \"Bib Fortuna\" impersonator. The clientele of this restaurant was noticeably better behaved than those in other restaurants and bars in the Trader's Plaza."}, {"tag": "p", "text": "It purported to host the original Max Rebo Band and was said to resemble the Palace Museum on Tatooine. Jabba's Throne Room offered patrons the opportunity to \"Visit Jabba's Guest Quarters with a Pleasure Slave\" and \"Face the Mighty Rancor in the Pit of Death.\" To most victims of Jabba, the restaurant was amusing at best, and outright insulting at worst."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 16 ABY, Luke Skywalker visited the club-bar after purchasing the bestselling The Lost Secrets of the Jedi from a branch of the Galactic Archives. In here, Skywalker was amused to find a not-so-perfect representation of the galactic gangster's intimidating headquarters, though he decided to stay for dinner after hearing the surprisingly good music and catching a glimpse of the roast nerf. Skywalker was seated underneath a \"frozen Han Solo in carbonite\" and served a drink from an \"Oola\" look-alike. He finally called it quits after a Wookiee actor failed to impress him with his Chewbacca impression, and was relieved he didn't stick around long enough to see the Leia impersonation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}