{"url": "Jabba%27s_champion", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Articles with gameplay alternatives", "Category:Gladiators", "Category:Individuals of unidentified species", "Category:Individuals of unspecified gender", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Jabba's champion"}, {"tag": "p", "text": "Jabba's champion was a pet name for the large reptilian-humanoid beast that was Jabba Desilijic Tiure's champion fighter in 32 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Unlike many of Jabba's monstrous pets, the champion didn't live in Jabba's Palace, but rather in the Hutt's suite in Mos Espa, where it had a small room full of spikes next to the suite's spike-pit arena. Jabba used it to get rid of undesirable individuals."}, {"tag": "p", "text": "In 32 BBY, shortly before the Boonta Eve Classic Podrace, Jedi Master Qui-Gon Jinn, whose ship had been stranded on Tatooine, was searching for a source of peggats to make a bet with junk dealer Watto. Jabba, who was looking for amusement, lured Jinn to the arena, and promised to give the needed money to him if the Jedi could defeat his champion. With no other options left, Jinn agreed."}, {"tag": "p", "text": "On Jabba's signal, the champion emerged from its room, roaring with rage, and immediately attacked the Jedi Master. However, the beast proved no match for Jinn, who used the Force to push the champion against the spiked walls of the pit and overcame the monster with his lightsaber. The beast was soon defeated and, shouting its last cry, fell lifeless to the ground."}, {"tag": "p", "text": "After the battle, Jabba thanked Jinn for the entertaining duel, gave him the peggats he needed, and released him. Because of the combat skills he had shown against the champion, Jinn was under the admiration and respect of Jabba and his criminal empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jabba's champion was a beast-like creature, and didn't show any kind of humanity or compassion towards its victims. It was savagely violent, and continued to beat its victims even after killing them. It wasn't able to intelligently communicate, and could only babble with primitive voices such as howling and growling. In battle, it was resolute, not giving up the fight even when seriously injured."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The predator was a powerful creature, which awarded it with the title of champion. It had a large belt, which was ornate with three skulls, presumably remains of its former victims. In battle, it used mostly its burly fists to strike its enemies down. When in Jabba's arena, it often cropped spikes from the wall, which it then used as a dagger. Alternately, the champion could throw the spikes at its victims with great accuracy. It was also robust, being able to live in a room which was crowded with pointed spikes and withstand even the hits from a lightsaber for a while. However, the creature was not fast enough to defeat a Jedi Master such as Qui-Gon Jinn, who avoided and blocked the champion's strikes and ultimately defeated it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Due to an in-game bug, it is possible that if the champion managed to kill Qui-Gon, it remains too close to the spikes and gets itself killed. Even though Jinn is already dead, Jabba will speak like he is still alive, thanking the Jedi for the fight."}, {"tag": "p", "text": "It is possible that Qui-Gon managed to acquire a blaster before his confrontation with the champion, and defeated it by staying out of its reach and wearing it down with repeated blaster fire, though this would be inconsistent with his portrayal in the movie and other sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}