{"url": "Jabba%27s_rancor", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with conjectural titles", "Category:Articles with elements from unlicensed sources", "Category:Pets", "Category:Rancors", "Category:Unidentified individual creatures", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Jabba's rancor"}, {"tag": "p", "text": "Jabba's rancor was a rancor given to the Hutt kajidii Jabba Desilijic Tiure as a birthday present from his henchmen. It was kept beneath a trapdoor in his chamber at his palace. He was fond of dropping people into the rancor's pit and watching them be eaten."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The rancor was being transported from the Tarsunt system by Grizzid for a Bothan merchant named Grendu, when it broke out, killing Grizzid and his crew, and causing the ship to crash on Tatooine. A Jawa Sandcrawler captain named Tteel Kkak discovered the wreckage and informed Jabba's servants Bib Fortuna and Bidlo Kwerve. They presented it to Jabba as a birthday present. Fortuna was rewarded by being made Jabba's majordomo, while Kwerve was fed to the rancor."}, {"tag": "h3", "text": "Serving Jabba"}, {"tag": "p", "text": "Malakili was bought from the Circus Horrificus in order to care for the rancor. He became very emotionally attached to it. While he took the rancor for a walk in the desert, it saved him from a small gang of Sand People. Jabba enjoyed pitting the rancor against other exotic monsters for his amusement. It always won, but was seriously wounded by three Caridan combat arachnids. When Malakili discovered that Jabba planned to pit the rancor against a krayt dragon, which would surely kill it, he made plans to betray Jabba to Lady Valarian and escape Tatooine with the rancor."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Jabba frequently used his rancor as an amusing form of execution. Oola, a Twi'lek dancer, was dropped in for resisting Jabba. At some point, Jabba's Tusken battle talisman somehow ended up falling into its pit, where the rancor ate it, too. Later, Jabba used it against Luke Skywalker, accidentally dropping a Gamorrean guard named Jubnuk in as well. The rancor ate Jubnuk, but Skywalker proved to be more of a challenge: the young Jedi Knight, when it first attempted to eat him, placed a large femur between its jaws, forcing the rancor to let him go before snapping it in two with effort. It tried to devour him again, but Luke smashed its hand in self-defense with a rock. Luke, out of options due to the rancor's handlers preventing him from escaping, lured it under a heavy portcullis, then smashed the control panel with a skull, causing the gate to pierce and crush the beast's skull, killing it. Ironically, the skull Luke threw had belonged to its first victim, Kwerve. As it was dying, the rancor moaned weakly, with Malakili rushing to the rancor's aid and then breaking down in tears when he discovered it was too late."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Jubnuk was later cut out of the rancor's stomach, still alive due to both his armor and the Tusken battle talisman he found inside the stomach, which he had been tasked to find earlier."}, {"tag": "p", "text": "Later, Luke stated that he had another reason for killing it, other than defending himself. The rancor was so abused and mistreated that rehabilitating it would have been impossible, and Luke believed that it would be best to put the poor creature out of its misery."}, {"tag": "p", "text": "Even two decades after the fact, Luke expressed that it was a shame that he had to kill the rancor. He felt that as a species, they were such fine creatures."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "An image often mistaken to be the rancor battling a krayt dragon is in reality, a joke from the crew of ILM. They placed a model of one of the dragons from the film Dragonslayer in the arms of the rancor model and took a picture. The picture was included in the book Star Wars: Chronicles. A creature based on the appearance of this dragon appears in one of Jabba's creature pens in Inside the Worlds of Star Wars Trilogy."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The rancor is a mini boss in Lord Starkiller's Mission To Tatooine. The rancor also acted as a boss in the Return of the Jedi chapter of Star Wars Trilogy: Apprentice of the Force. Although its fate was overall the same, the rancor can also \"summon\" more Gamorrean guards by stomping and causing more to fall down everywhere, alongside rocks. After the player backs it up to the gate, the player then delivers the coup de grace by Force-pushing a rock at the control panel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}