{"url": "Jabba%27s_private_box", "categories": ["Category:Legends articles", "Category:Mos Espa locations", "Category:Residential buildings"], "nodes": [{"tag": "h1", "text": "Jabba's private box"}, {"tag": "p", "text": "Jabba's private box was one of Jabba Desilijic Tiure's houses in 32 BBY, located in the Mos Espa Grand Arena."}, {"tag": "h2", "text": "Occupants"}, {"tag": "p", "text": "Jabba's private box was a personal house of Jabba, and the Hutt used it when he attended the Boonta Eve Classic podrace. It is unknown whether he used it when there were no races to watch. When Jabba was in the box, he was always accompanied by several of his servants and slaves, like his Interpreter, Bib Fortuna, Diva Shaliqua, Tann Gella, R5-X2, Chokk, and many others."}, {"tag": "p", "text": "Sometimes Jabba also invited guests to the suite, like his rival Gardulla Besadii the Elder and the corrupt Senator Orn Free Taa."}, {"tag": "p", "text": "There was at least one permanent occupant, a gladiator beast that was Jabba's champion in death matches. It lived in a small room, which was filled with pointed spikes, next to the arena of the suite. Jabba sometimes dropped fighters into the arena, and watched as they dueled the predator."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Jabba's private box wasn't as large as the Hutt's palace. The suite had few parts: the small room of Jabba's champion, the spike-pit arena, which was connected to the hall of Jabba's bed, and the balcony, which he used to watch the podrace."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 32 BBY, Jabba lodged the suite in order to attend the Boonta Eve Classic podrace. However, Jabba didn't care about the sport itself, and he only thought about the profits he would earn by betting on the race. Jabba found the race itself to be boring and he was always looking forward for new sources of entertainment. Jabba was more than happy to hear about the Jedi whose ship had been stranded on Tatooine: Qui-Gon Jinn. The Jedi Master needed peggats to make a bet with the junk dealer Watto. Tann and Ann Gella showed Qui-Gon how to find Jabba, and when he arrived, Jabba lured the Jedi into the arena of the suite. He then promised to give the money to Jinn, if he could defeat his champion warrior. With no other options left, Jinn agreed, and he then proceeded to kill Jabba's champion in combat. Jabba thanked him for providing \"worthy entertainment\", and released him. Shortly after this, Jabba started the race."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}