{"url": "Jabba_Desilijic_Tiure%27s_criminal_empire", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Criminal organizations", "Category:Galactic Empire-aligned governments", "Category:Galactic Republic-aligned governments", "Category:Planetary governments"], "nodes": [{"tag": "h1", "text": "Jabba Desilijic Tiure's criminal empire"}, {"tag": "p", "text": "A criminal empire was led by Jabba the Hutt. Its base was Jabba's Palace on the desert planet of Tatooine."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Age of the Republic"}, {"tag": "p", "text": "In 22 BBY, Jedi Knight Anakin Skywalker, along with his Padawan Ahsoka Tano returned Jabba's son Rotta, to Tatooine in hopes of the Galactic Republic gaining access over the Hutt's secret hyperspace routes against the Confederacy of Independent Systems despite sabotage from Asajj Ventress and Sith Lord Count Dooku. Subsequently the Hutt Clan, became an ally of the Galactic Republic signing a treaty with them."}, {"tag": "h3", "text": "Era of the Empire"}, {"tag": "p", "text": "By 0 BBY, Han Solo, Jabba's best smuggler on his payroll, was forced to jettison a shipment of Kessel spice when the Millennium Falcon was boarded by a patrol of the Galactic Empire. Jabba wanted to gain compensation for his spice, so the Hutt sent bounty hunters after Solo. After the Rodian Greedo was killed by Solo, the smuggler spoke with Jabba at Docking Bay 94 in Mos Eisley, and the crime lord gave him more time. Shortly after the Battle of Yavin, in which the Alliance to Restore the Republic, with Solo's help, managed to destroy the Death Star, the Empire decided to negotiate with an envoy in Jabba's employ on Cymoon 1, in the Corellian Industrial Cluster. Sith Lord Darth Vader, was send as the Imperial negotiator with the intent of forcing Jabba's envoy in a deal favorable to the Empire. The envoy's vessel was hijacked by the Rebel Alliance, and with a team of rebels including Solo, they used it to assault and destroy Weapons Factory Alpha on Cymoon 1. Emperor Palpatine sent Vader to Jabba's Palace to negotiate. Once there, Jabba was not interested in negotiating with Vader, and his Gamorrean guards were sent to eliminate the Sith, but Vader killed Jabba's guards and briefly choked Jabba in order to show what his fate will be if he didn't listened to him. The next day, Vader ended his negotiations with Jabba and left his palace."}, {"tag": "p", "text": "Hiring him for a number of jobs, one of the bounty hunters Jabba often employed was the highly paid Boba Fett, who was regarded as the most notorious hunter in the galaxy. Three years after the Battle of Yavin, Fett was hired by Vader track down the Millennium Falcon. Following the ship to Cloud City, Solo was frozen in carbonite and taken to Jabba by Fett."}, {"tag": "h3", "text": "Dissolution"}, {"tag": "h4", "text": "Death of Jabba"}, {"tag": "p", "text": "One year after Solo's capture, Solo's friend Jedi Knight Luke Skywalker and his rebel party attempted to convince Jabba to liberate Solo. Skywalker sent the droids C-3PO and R2-D2 to Jabba's Palace to negotiate with Jabba via hologram. However, the Hutt was uninterested in Skywalker's proposal. After a dance of Jedi Rocks, which was watched by various individuals in the place like Harc Seff, and the capture of Leia Organa and Chewbacca, Skywalker presented himself at his palace and after Jabba tried to execute him. However, Skywalker killed Pateesa, Jabba's pet rancor."}, {"tag": "p", "text": "Furious about his pet's death, Jabba attempted to execute Skywalker and his friends at the Great Pit of Carkoon as food for the Pit's Sarlacc. Jabba and the members of his empire went to the Pit aboard Jabba's sail barge. Skywalker warned Jabba once more, but he chuckled at the young Skywalker's warnings. This decision cost Jabba not only his empire, but also his life, as Organa, who Jabba made his slave after her capture, choked him to death with a chain. At the end, members of Jabba's empire fell into the sarlacc's mouth or were killed when Organa and Skywalker blew up Jabba's sail barge."}, {"tag": "h4", "text": "The return of Boba Fett"}, {"tag": "p", "text": "Following Jabba's death, his former majordomo, Bib Fortuna, returned to the palace and took over its operations as a crime lord. However, around 9 ABY, Boba Fett returned to the palace. Joined by his accomplice Fennec Shand, the two killed all the guards, followed by Fett executing Fortuna and taking the throne."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}