{"url": "Jabba_Desilijic_Tiure%27s_criminal_empire/Legends", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles to be expanded", "Category:Cleanup", "Category:Articles needing additional sources", "Category:Criminal organizations", "Category:Galactic Empire-aligned governments", "Category:Galactic Republic-aligned governments", "Category:Planetary governments"], "nodes": [{"tag": "h1", "text": "Jabba Desilijic Tiure's criminal empire"}, {"tag": "p", "text": "Jabba Desilijic Tiure's criminal empire was a criminal organization led and formed by Jabba the Hutt. Its base was Jabba's Palace on the desert planet dunes of Tatooine."}, {"tag": "p", "text": "Jabba hired smugglers such as Han Solo to smuggle such things as glitterstim spice, and bounty hunters like Boba Fett and Zuckuss to eliminate enemies of the Hutt crime lords."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jabba's criminal empire was one of the most powerful criminal organizations in the Outer Rim, perhaps even the galaxy since it controlled the entire Arkanis sector and a great deal beyond."}, {"tag": "p", "text": "In 21 BBY, Anakin who was betided with his apprentice Ahsoka Tano, was reluctant to return to Tatooine, via the Twilight, due to Jabba allowing the Republic access over the secret Hutt Hyperlanes against the CIS for rescuing his son Rotta on the Teth Monastery. The Jedi emerged victorious at delivering Rotta to Jabba's Palace, despite sabotage from Asajj Ventress and Count Dooku. Thus Jabba's Empire and subsequently the Hutt Cartel, became an ally of the Republic, as well as the Clone Army been allowed safe passage through Hutt Space and the Arkanis sector."}, {"tag": "p", "text": "Jabba's Empire had to face many of the Hutt's enemies such as Tyber Zann, who waged a grudge war against the Hutt for getting Zann sent to the spice mines of Kessel, and the Rebel Alliance when Jabba had received Han Solo frozen in a block of carbonite and refused to give it up."}, {"tag": "p", "text": "This organization employed more than smugglers and bounty Hunters. Jabba also employed dancers, bands, and bikers for entertainment. Most notable was Big Gizz and his gang. They would go and do dirty work for Jabba for low pay and enjoyed every second of it. This all ended when Jix betrayed Jabba and Gizz and Spiker never saw their boss alive, and in person, again. His popular band was the Max Rebo Band, who played for the Hutt until his demise."}, {"tag": "h3", "text": "Dissolution"}, {"tag": "p", "text": "This high life would all end in a matter of minutes. For Luke Skywalker and friends destroyed the very existence of one of the most powerful crime sects ever during the battle at the Great Pit of Carkoon. With Jabba and more than half his court killed on Jabba's barge, his empire along with the Cartel collapsed. Jabba's Palace fell to the B'omarr Monks."}, {"tag": "p", "text": "The remnants of Jabba's criminal empire were carved up by his surviving lieutenants, employees and members of his own clan. One lieutenant, Llleag'Mak implemented intimidation and bribery to take control over bits and pieces of Jabba's empire. The mercenary Brasck grabbed as many followers as he could and set up his own smuggling operation, which included kidnapping and slavery. Kumac the Hutt would seize much of Jabba's holdings in the Expansion Region and calling in favors from her Imperial contacts to establish herself as one of the most powerful Hutts of the time."}, {"tag": "p", "text": "Kumac's old rival, Jelasi, had also performed well in the aftermath of Jabba's demise, claiming for himself the Ig'zxyck Flare syndicate and attempting to \"legitimize\" much of Jabba's operations, assassinating those who opposed the new direction he was taking. Kumac and her clan were enraged by this, as they wished to carry on in the same vein as Jabba, using crime and intimidation to gain power. As it happened, though, the two emerged as the new joint leaders of the Desilijic clan—and, by extension, the leaders of Hutt Space, because of Desilijic's dominance—after a brutal round of infighting, because they had both claimed more of Jabba's holdings than anyone else."}, {"tag": "p", "text": "Their reign would be short, due the release of Jabba's father."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Everyone went their own way, while others were assimilated by the B'omarr Monks. It wasn't until well over a year later his father came and resurrected his empire. Zorba discovered Jabba's \"true will and testament\", which entitled the elder Desilijic to all of Jabba's holdings. Through the courts, Zorba was able to take control of the clan and wrest Kumac and Jelasi's criminal empires from their helpless hands. However, his reign was only brief and ended after a series of events included his attempted revenge against his son's killer and the will declared a forgery by the Hutt courts. Zorba was disgraced and went into hiding, thought to have died. Soon after that, Jabba's nephew began to slither in his uncle's footsteps and grow Jabba's empire farther than the Hutt himself. The palace of Gorga the Hutt became the new headquarters of the criminal empire."}, {"tag": "p", "text": "During the New Republic era it was supported by Hutt Space and during the Yuuzhan Vong War most of Hutt Space was devastated by the invaders, Gorga's Palace was the base of operations for the Hutt Underground for one year. When the war had ended the Hutt rebellion against the Yuuzhan Vong returned to Nal Hutta. A year later, the Galactic Alliance had claimed authority on Tatooine, leaving a question if the Desilijic Empire would meet a second demise."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": "Star Wars: Villains (Indirect mention only)"}, {"tag": "h2", "text": "Notes and references"}]}