{"url": "Jabba_Desilijic_Tiure/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Business owners and executives", "Category:Collectors", "Category:Hutt Council", "Category:Hutts of the Desilijic clan", "Category:Nar Shaddaa residents", "Category:Podrace hosts", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Jabba Desilijic Tiure"}, {"tag": "p", "text": "Jabba Desilijic Tiure, better known as Jabba the Hutt and often called \"the Bloated One\", though never to his face, was one of the most notorious Hutt crime lords in the galaxy, who governed a large criminal empire located in the Outer Rim Territories from his desert palace on Tatooine. At the height of his power, Jabba was one of the most powerful crime lords in the galaxy, even having contact with Prince Xizor, the head of the Black Sun Syndicate."}, {"tag": "p", "text": "Jabba had started as a small crime lord, but quickly spread his influence into a variety of illegal activities, including spice-smuggling, gunrunning, slavery, and sometimes outright piracy. Known for his cruelty and carnal fancies, Jabba the Hutt was powerful enough to command respect and payment from the Galaxy's ruling government, so much so that during the Clone Wars the Republic went to great lengths to avoid Jabba's displeasure. He later placed a hefty death mark on Han Solo, a former employee of his, after Solo lost a load of spice to an Imperial patrol vessel. He would finally get his revenge on Solo when the carbonite-encased Corellian was delivered to him by Boba Fett, one of the many bounty hunters Jabba was known to employ. However, this mission was Jabba's undoing, as a rescue mission and subsequent battle with Luke Skywalker and his allies resulted in the Hutt's demise at the hands of Leia Organa."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (600 BBY–22 BBY)"}, {"tag": "h4", "text": "Rise of the crime lord"}, {"tag": "p", "text": "Jabba, who was born on Nal Hutta, was the child of Zorba Desilijic Tiure. He took formal control of the Desilijic kajidic around 2 BBY, when he killed the offspring of Jiliac, the former leader. The old Hutt died following a grueling fight to the death with Durga Besadii Tai."}, {"tag": "p", "text": "At the incredibly young age of 80, the up-and-coming gangster established his criminal empire on the remote desert world of Tatooine, located in the Tatoo system. In 516 BBY, he moved his criminal operations into an old B'omarr Monastery, safely nestling himself in the planet's comfortable obscurity."}, {"tag": "p", "text": "Jabba started small, finding early work as a high-risk gunrunner, along with his lifelong friend Ephant Mon. During Senator Palpatine's rise to power, the Hutt was one of several gangsters who made his bid for dominance. His competitors included Sise Fromm, the then-kingpin of organized crime in the galaxy and Prince Xizor, fledgling heir to the Black Sun criminal empire. Though neither Xizor nor Jabba were by any means young, both had just been handed the reins of power established by their respective criminal families. While Fromm played war games, Xizor and Jabba sensed the winds of change and spent their resources garnering favor with those who seemed to be shifting into power."}, {"tag": "p", "text": "Due to the attractive nature of becoming a gangster during the galaxy's time of change, he attained minions. A Twi'lek spice smuggler from Ryloth, Bib Fortuna would become his majordomo early on. He was always in attendance where Jabba was, be it podraces, the Palace, or other ventures. Bib would later be replaced by Naroon Cuthus, only to take power again years later."}, {"tag": "p", "text": "Jabba kept an enormous, reptilian-humanoid creature as his champion gladiator in a spike-pit arena under his suite in the Mos Espa Grand Arena, where he used the beast to get rid of undesirable individuals in death matches for his own amusement. Upon learning that Jedi Master Qui-Gon Jinn needed peggats in order to bet on Anakin Skywalker in the Boonta Eve Classic podrace, Jabba lured Jinn to his arena, and offered him the money he needed if he could defeat his champion. Jinn was successful in killing the predator, and an impressed Jabba thanked the Jedi Master for \"providing such worthy entertainment,\" rewarded him with 50 peggats and released him from the pit."}, {"tag": "p", "text": "Jabba was known to bet on podraces. He often lost, due to the recommendations of his incompetent astromech droid, R5-X2. During such races he was, on occasion, the host, such as at the Boonta Eve Classic, which Xizor also attended. Jabba never had any interest in the sport—sometimes falling asleep during the race—other than the profits made from inside bettors and the joy that came from having others owe him credits, especially the junk dealer Watto. When Jabba did win, he was rewarded with slave girls and credits. He made sure that he always got his money's worth \"the easy way, or the hard way.\""}, {"tag": "h4", "text": "Interfering with Jedi business"}, {"tag": "p", "text": "Ephant Mon and Jabba made an ill-fated plan to smuggle goods onto Cerea where they encountered Jedi Master Ki-Adi-Mundi, whose daughter and a friend of his had been enslaved by the Hutt. Mundi had to wait for a dangerous lightning storm before he had a chance to free his daughter and friend from the Hutt's slimy grasp, though he was successful in rescuing both Sylvn and her friend Twin. On his mission, Mundi found evidence that linked Jabba with the Trade Federation's arming in preparation for its invasion of Naboo, but the Hutt escaped any serious retribution."}, {"tag": "p", "text": "When Mundi later returned to Tatooine to seek safe passage across the desert dunes, Jabba thought he recognized the Jedi Master, and lied to him about being an honorable being. He sent Mundi out on a skiff, accompanied by a few of the Hutt's guards, who were to \"keep him safe from harm\"; however, Bib Fortuna, the Hutt's majordomo, noted that they had sent the Jedi towards a sandstorm. Mundi realized this early on during the ride, to which Jabba sarcastically replied:"}, {"tag": "p", "text": "Fortuna and the Hutt laughed as the skiff rode further towards the sandstorm ahead, though Mundi survived and continued to oppose Jabba in his efforts to incite the locals against the Sand People."}, {"tag": "h4", "text": "Rivalry with Gardulla"}, {"tag": "p", "text": "Jabba had a fierce rivalry with Gardulla Besadii the Elder that lasted for decades. Gardulla's attempt to establish a new podrace course on Tatooine brought the Besadii into conflict with the Desilijic, and the two clans were vying for control of the planet as early as 54 BBY. The gang war would continue for nearly three decades until 33 BBY, when Jabba, with Bib Fortuna, Ephant Mon and Diva Shaliqua, had a clandestine meeting with Magister Hego Damask II on Sojourn. Damask was secretly the Dark Lord of the Sith Darth Plagueis, but Jabba demanded that he end his and elements of the InterGalactic Banking Clan's support for Gardulla. In exchange, Jabba offered information on the Bando Gora terrorist syndicate that had been targeting the leadership of some of the shipping cartels Plagueis backed: Komari Vosa, believed dead after a disastrous mission to Baltizaar and the former Padawan of Jedi Master Dooku, was alive and had come to lead the cult. Jabba further revealed that Vosa had entered into a plan with Gardulla, a Dug named Sebolto, and Senator Ainlee Teem to distribute contaminated death sticks to draw new members to the cult."}, {"tag": "p", "text": "Plagueis saw the information as a chance to draw Master Dooku closer to the dark side of the Force, and also to push his apprentice Darth Sidious closer to the position of Supreme Chancellor (Teem being a competitor for the Chancellorship). Jabba was subsequently able to warn Plagueis ahead of time of an attempt on his life by Gardulla, the Bando Gora, and Black Sun organized by Plagueis' one-time associate King Ars Veruna of Naboo. Plagueis was able to escape the conspirators' bombardment of Sojourn undetected and was rescued by Jabba's yacht Star Jewel. Perhaps coincidentally, Jabba had also played a small part in the acquisition of the nuclear device used against Plagueis: Darth Sidious had sent his own apprentice, Darth Maul, to the Cog Hive Seven prison to retrieve the weapon from the arms dealer Iram Radique, with the eventual aim of delivering it to the Bando Gora so it could be used to kill his master. When Jabba had attacked the prison with the Star Jewel, Maul was able to escape (with the aid of Komari Vosa) aboard Jabba's ship, whereupon he passed the weapon on to Vosa. Whether this is how Jabba learned of Vosa's identity and of the attempt on Plagueis' life is unclear."}, {"tag": "p", "text": "In 32 BBY, at the height of the Naboo crisis, Jabba and his rival met prior to the Boonta Eve Classic of that year. Gardulla had made a full model of the racecourse, surprising Jabba. She also owned a machine that would tell her and Jabba the winner. To Jabba's surprise, it said the winner would be Gasgano, whereas Jabba's droid, R5-X2, showed Sebulba would come in first, Gasgano in second, and Mawhonic in third; the droid also favored Gardulla's former slave, Anakin Skywalker."}, {"tag": "p", "text": "When the race began, Jabba hosted Gardulla as his guest as he presided over the race. Entering his box at the Mos Espa Grand Arena to wild cheers, Jabba signaled the start of the race by spitting a gorg into the starting gong. When the race concluded, Jabba had to be awoken by Bib Fortuna after falling asleep during the race; though as Anakin Skywalker had come in first, Jabba had outsmarted Gardulla and won the bet."}, {"tag": "p", "text": "During the battle that occurred in the Jundland Wastes, Gardulla conceived a plot to assemble all her criminal underlings to launch an assault on the Tusken Raiders, dispatching the notorious bounty hunter Aurra Sing to destroy their Jedi leader, Sharad Hett. Contemporaneously, Jabba had the idea of sending out his thugs to raid the Tusken camps, inciting the Sand People to launch their own raids. Jabba then planned to profit from this by selling Dreddon's overpriced surplus weapons to defensive civilians. Gardulla's plot failed, forcing her to retreat to her palace in Mos Espa. This would be one of the Hutt's last confrontations with Gardulla."}, {"tag": "p", "text": "When the rivalry got out of hand, Jabba hired Jango Fett—who had won an audience with the Hutt for bringing in the bounty for Longo Two-Guns—to finish her off once and for all. Jabba led Jango Fett to Gardulla, and was quite pleased to hear that Gardulla was \"eaten\" by her pet krayt dragon, surprised though he was that Jango Fett never came to receive his bounty for Gardulla's death. He discovered the answer soon enough, for he later found out that Jango Fett was killed on Geonosis by Jedi Master Mace Windu. Later on, Jabba would do business with Jango Fett's clone son, Boba."}, {"tag": "h4", "text": "The Clone Wars"}, {"tag": "p", "text": "Following the recapture of Sarapin during the Clone Wars, Jabba found himself in a position he'd never imagined: aiding a top general for the Galactic Republic during the Second Battle of Tatooine. Since Boorka the Hutt (a rival of Jabba's) was in league with the Confederacy of Independent Systems, Jabba concluded that his fellow gangster had gone too far with his antics. Thus, when the Republic's newly arrived clone army proved too small to attack the Confederacy's base on the planet, Jabba became involved."}, {"tag": "p", "text": "After bolstering their forces, Jedi Generals Echuu Shen-Jon and Naat Reath successfully engaged the Separatist enemy and slew Boorka. For their troubles, Jabba gave them five thousand nova crystals; glad to be rid of the rival."}, {"tag": "p", "text": "But Jabba, being a true crime boss, always tried to make profits by doing business with both sides of a war. When Separatist Council member Wat Tambor, Foreman of the wealthy Techno Union, contacted him, Jabba agreed to help the Separatist smuggle huge shipments of construction materials and cortosis to the planet Metalorn to aid in the construction of the newly-created C-B3 cortosis battle droid. His involvement with the Confederacy was discovered by Republic informant Raala Ponchar, but battle droids under the command of the Dark Acolyte Saato captured her and she was imprisoned in his palace. When the Jedi Council learned of Ponchar's disappearance, they sent Anakin Skywalker to investigate. Jabba, however, quickly learned of Anakin's presence on Tatooine and his intentions after he was tipped off by Aurra Sing, and posted a bounty on Anakin's head. Despite having to contend with scores of bounty hunters, the young Jedi managed to free Ponchar from the palace's dungeon; he then killed Saato and relayed the information about Jabba's involvement to Master Obi-Wan Kenobi."}, {"tag": "p", "text": "Some time afterward, Boba Fett, the cloned \"son\" of Jango Fett, read his father's \"book\" which instructed him to visit Jabba. Fett had a run-in with the dangerous Separatist Commander Durge, however, before he could do so. Fett soon managed to escape Durge, and quickly found himself in Jabba's employ. One of the reasons Jabba accepted Boba was to repay the favor Jango Fett did him by killing Gardulla the Hutt a decade earlier. While working for Jabba, Boba had separate plans that had nothing and everything to do with the Hutt at the same time. Besides this, Fett still had connections with the Separatists and Count Dooku."}, {"tag": "p", "text": "As the war progressed, Jabba requested the Jedi's help in finding his son, Rotta, in exchange for passage through Hutt space, for the Separatists controlled all the major hyperspace lanes. He had dispatched a group bounty hunters who tracked his son to Teth, but they all were returned beheaded. Count Dooku and the CIS kidnapped Jabba's son, allowed the Jedi to get him back, and employed lies, a secret video, and an all-out assault to get him back and to curry the crime lord's favor. Ultimately, the Jedi proved victorious and eventually earned Jabba's trust for a time, thus allowing his Empire to ally with the Republic against the CIS during the war. Jabba was angry at the main instigator of the plot, his own uncle Ziro Desilijic Tiure, who was planning to take control of his nephew's empire."}, {"tag": "p", "text": "Some time later, Jabba was later approached by Baron Notluwiski Papanoida, the Chairman of the Pantoran Assembly, who held in a standoff against one of Jabba's bounty hunters, Greedo. He appealed to Jabba as a fellow parent to ask for assistance in tracking down his daughters Chi Eekway and Che Amanwe. He reasoned that if Greedo's blood matched the sample that he found on Coruscant, then it will prove that the Rodian was involved in the kidnapping. No sooner did Jabba did permit a blood sample to be taken, did Greedo spill that he was working for the Separatists. He then led the Pantorans to Mos Eisley, where one of the girls was located. During another time, Jabba hired bounty hunter Cad Bane to get information about the Senate building. After Bane's success, Jabba talked to the Hutt Council to see if Ziro should be released from prison. The Hutts hired Bane and he succeeded. Then, Jabba hired Sy Snootles to steal information from Ziro. Sy betrayed Ziro and killed the Hutt, and gave Jabba the diary of the Hutts."}, {"tag": "p", "text": "In 20 BBY, Darth Maul, his brother Savage Opress, and Pre Vizsla of the Death Watch went to the Hutt Ruling Council in their chambers on Nal Hutta to ask for an alliance with the Hutts, promising to spare their lives in exchange for the Hutt territories and everything in it's borders. Jabba and the other elders just laughed and sent bounty hunters after them. While Gorga and Jabba were seen on holograms, the others, except for Oruba, escaped from the skirmish. Maul and company soon arrived at Jabba's Palace on Tatooine, where they launched an attack on the Monastery. Maul and the others found Jabba, with Gorga, in his throne room, where they forced the mighty crime lord to join the Collective."}, {"tag": "h3", "text": "Underling mayhem (22 BBY–3 ABY)"}, {"tag": "h4", "text": "Majordomo"}, {"tag": "p", "text": "Jabba had several lieutenants, and over time, each one helped him control a certain part of the growing criminal empire of Jabba's. His oldest, and best, majordomo was Naroon Cuthus, whom Jabba respected but couldn't let retire, since he knew too much about Jabba's activities. So, in return for his long service, Jabba gave him a quick death. The ensuing power vacuum created a rivalry between Bib Fortuna and a Human smuggler named Bidlo Kwerve for the seat as Jabba's right hand man. Jabba enjoyed watching the competition and pitted the two cronies against one other. When Jabba was given his \"beloved\" pet rancor, Kwerve got the pleasure of being the monster's first public feast, with Fortuna becoming Jabba's new majordomo by default."}, {"tag": "p", "text": "In 22 BBY, Jabba's father, Zorba, was imprisoned after being tried for illegal gemstone mining, convicted, and sentenced to prison on Kip. After a bribery attempt to free Zorba failed, Jiliac assumed control of the Desilijic clan, with Jabba next in the line of succession."}, {"tag": "p", "text": "Jabba also regularly employed many bounty hunters, one of his favorites being a Gand named Zuckuss. Jabba hired the bounty hunter for many successful yet infamous missions. Jabba eventually suggested that Zuckuss team up with a modified protocol droid named 4-LOM, who had been given a programming upgrade by Jabba's workers. Jabba was pleased with the pair's work and frequently employed them."}, {"tag": "h4", "text": "Dealing with scum"}, {"tag": "p", "text": "At an unknown point between the Declaration of a New Order in 19 BBY and the Battle of Yavin, Jabba ended up getting a bounty on his head by the Galactic Empire."}, {"tag": "p", "text": "Around five years before the Battle of Yavin, Jabba took his yacht, Star Jewel, and set off for the headquarters of Gaar Suppoon, an old acquaintance of the Hutt's. Jabba informed Gaar that there was a bomb in his palace, but when the Galactic Empire sent Kosh Kurp to investigate, no bomb was discovered. After a heated trade war, with Jabba outwitting Gaar on every trade, Gaar tried to kill the Hutt."}, {"tag": "p", "text": "Jabba responded by letting loose a fatally poisonous Tromonid on Gaar, which bit him almost immediately. Threatening to blow everyone up with a bomb he possessed, Jabba persuaded Gaar to give him everything they traded for an antidote to the fatal bite. When Gaar was reminded about the bomb, he played along and asked Jabba to detonate it."}, {"tag": "p", "text": "Things took a turn for the worst when Jabba called Gaar by his real name, Sonopo Bomoor. Kurp, recognizing the name as that of the man who had killed his family, took a shot at the man. The blaster bolt ricocheted, exploding Gaar's head. Kurp realized he was the actual \"bomb\", and had played right into Jabba's plan."}, {"tag": "p", "text": "While leaving the planet, Scuppa, the captain of Jabba's ship, spotted a Nuffin freighter, which they believed to have a wealth of riches ripe for the taking. Jabba, Bib Fortuna, and two Weequays boarded the ship, leaving a Gamorrean guard behind to guard the Star Jewel. When the group entered the vessel, they were taken captive by the Princess Nampi."}, {"tag": "p", "text": "Nampi put the guards and Bib into the larder, while Jabba and Scuppa confronted her. Jabba was eventually sent to the larder as well, refusing to give up the riches in the ship. Scuppa, being an opportunist, realized that he was now in charge of Jabba's finances and agreed to marry Nampi to preserve his life. The act was foolish, and he didn't realize in his haste that Nampi's species ate the male on the wedding night. In horror, Scuppa realized that he'd become Nampi's appetizer. When Jabba was called into her chambers to be the main course, the Hutt quickly deduced what had happened, and used the situation to his advantage."}, {"tag": "p", "text": "Long beforehand, Jabba had installed a remote in Scuppa's skull that released Xenoboric acid should his captain ever betray him. Now in control, he offered Nampi a chance to give over her riches, lest he detonate the remote. Upon her refusal, he pushed it, without a hint of regret, and, in a matter of seconds, Nampi exploded. The guards and Bib were soon unlocked, and started to loot Nampi's hold. Humorously, Jabba suggested that his Twi'lek majordomo \"wear his boots\" into the exploded viscera."}, {"tag": "p", "text": "Jabba planned to sell Nampi's ship to Cabrool Nuum when they were finished with it. When faced with what to do with the deceased Princess's guards, however, Bib at first suggested selling them to Nuum as slaves, but Jabba had a more sadistic idea. He decided to launch them into the vacuum of space to \"see 'em pop\". At first, when Jabba met up with Nuum, the meeting between the two crime lords was friendly. Things began to turn sour, however, because of an argument with Nuum about the offer of Jabba murdering Vu Chusker, Nuum's rival. Nuum sent Jabba to a spare room, where, afterward, Nuum's son, Rusk, soon contracted Jabba to kill his father instead. Jabba proudly obliged."}, {"tag": "p", "text": "With Nuum suffocated in his sleep, Jabba enlisted Rusk as a dealer and partner. Rusk objected, and sent Jabba to the deep holds. While in the prison, Jabba met another member of Nuum's family, Norba, Rusk's sister, who wanted Rusk dead. Jabba agreed, and crushed Rusk in the creature's office with his own two hands, helped in part by Norba. Norba then proceeded to send the Hutt to the deep hold."}, {"tag": "p", "text": "When Norba came to visit the Hutt, Jabba laughed when she said she wanted Vu Chusker dead. Jabba leaned towards the bars of the cell, telling her to listen up. When she leaned in to listen, he pulled her into his mouth and ate her. He then grabbed the keys and escaped. During his escape, Jabba ran into—of all beings—Vu Chusker. Without warning, Jabba crushed Chusker into the ground and hovered to his ship via repulsor sled. The Hutt thought, in hindsight, thought he should have just killed Chusker in the first place."}, {"tag": "p", "text": "At the time Jabba returned to his palace, his devious majordomo, Bib Fortuna, had recruited six of Jabba's more dissatisfied minions (including Nivek) to kill Jabba's guards after making them tell all of their secrets to him. Unfortunately, shortly after they started putting the plan into action, guards Gru'um and Miramba unleashed a pack of freckers, thus spoiling the plan. Bib and the would-be assassins managed to kill all the freckers, earning thanks from the Hutt for remaining a loyal hero. Fortuna couldn't bring himself to kill Jabba following this. After all, Nivek and the other co-conspirators died in the struggle with the freckers, taking Bib's failed plan with them to the grave."}, {"tag": "h4", "text": "Intrigue among the Hutts"}, {"tag": "p", "text": "Soon, the talents of a young, roguish smuggler named Han Solo caught the eye of Jabba and his great-uncle, Jiliac. Impressed with the boy's performance, the pair hired Han to smuggle spice throughout the galaxy, thus profiting from the distribution of the illegal drug. Han quickly proved his mettle, and was given tougher and more exciting assignments such as the infamous Kessel Run."}, {"tag": "p", "text": "Initially unbeknownst to Han, Jiliac and Jabba were preparing to make their bid for supremacy among the Hutt kajidics by targeting the Besadii clan's spice refining operation on Ylesia. Han's piloting abilities while flying for the Desilijic clan allowed him to narrowly escape a brutal pirate attack, the blame of which was this laid upon the Besadiis. Aruk the Hutt, clan leader of Besadii, and his offspring, Durga, were outraged at the ensuing claims. A Council was convened on Nal Hutta to discuss the recent events, the resulting verdict finding the Besadii clan innocent of all transgressions. It was then that Jabba and Jiliac decided that Aruk needed to die. Contacting the High Priest Teroenza of Ylesia, Jabba and Jiliac arranged for a Malkite poison to be used to kill Aruk."}, {"tag": "p", "text": "Although Aruk was successfully slain, Imperial entanglements threatened to ruin life for the Hutts when Moff Sarn Shild announced a campaign against Nal Hutta and Nar Shaddaa. The savvy Hutt families tried to bribe Shild, but when that failed, Jabba and Jiliac instructed Han Solo to contact the Imperial Admiral leading the attack and subvert him. Solo was successful in buying the Imperial battle plan, and began preparations to defend Nar Shaddaa. As a backup, the Hutts hired Drea Renthal's mercenary fleet to protect Nal Hutta. Surprisingly, the smugglers and spacers of Nar Shaddaa, with the aid of Drea Renthal and the Imperial battle plan, defeated the Imperial forces, allowing the Hutts to escape the wrath of the Empire."}, {"tag": "p", "text": "It wasn't long before Aruk's son, Durga, suspected Jiliac's involvement in his father's demise and challenged Jiliac's right to rule under Old Law. In the impending duel, Durga slew Jiliac. Whereas most beings would have felt grief or anger, Jabba only saw an opportunity to advance. By killing Jiliac's helpless orphaned youngling, Jabba successfully established himself as the leader of the Desilijic kajidic."}, {"tag": "h4", "text": "Smuggler scandal"}, {"tag": "p", "text": "A Rybet named Moruth Doole was Jabba's main source of spice. Doole's knack for picking competent smugglers made transport much easier. Having encountered Han Solo and Chewbacca many times on their spice runs, Doole had no objections about turning in the smuggler to the authorities, if it paid the right amount. The ensuing Imperial patrol came crashing down on one of Jabba's spice runs that Solo was hauling."}, {"tag": "p", "text": "Unknown to many, Doole was the reason for Solo's loss of Jabba's paid-in-advance spice cargo. Originally, Jabba held Han solely accountable; however, Jabba eventually found out that Doole was spice skimming, and, suspecting Doole's betrayal, posted a contract on him. Doole staged a prison revolt on Kessel in order to draw attention away from himself. Although the warden worked for Jabba, more than half the guards of the prison were secretly being paid by Doole, making the ploy that much easier. However, Doole was captured, and was soon brought before the Hutt. In an act of mercy, he begged to be left alive: Doole traded one of his eyes for his life. The price of the lost cargo was once more attributed to Solo."}, {"tag": "p", "text": "Seven years after Jabba's demise, Moruth Doole would meet his end at the fangs of a hungry energy spider."}, {"tag": "h4", "text": "Underworld overlord"}, {"tag": "p", "text": "By the dawn of the Rebellion, Jabba had become the most powerful crime lord in the Outer Rim, perhaps even the galaxy. This was largely due to his near monopoly of the glitterstim spice business. By this time, the Desilijic kajidic had become the largest and most powerful among all the Hutt dynasties, trumping even their sworn enemies, the Besadii Hutts; Jabba using every opportunity to destroy the rival clan's conglomerate."}, {"tag": "p", "text": "Even at the height of his reign, the crime lord dealt with recurring problems: chronic illness caused him constant discomfort, and even his closest lieutenants had begun plotting his demise. The Hutt put his trust in no one other than his Nimbanel accountant Mosep Binneed and Ephant Mon, whom he made Chief of Security of his palace."}, {"tag": "p", "text": "It was at this time that the Hutt suffered a major financial loss when Han Solo, his best smuggler, dropped an entire cargo of valuable glitterstim while on a dangerous mission near Kessel. The spice was dropped because Han was boarded by an Imperial customs team. Jabba demanded that Han pay him the value of the cargo, but when the smuggler failed to reimburse his long-time employer, the Hutt put a bounty on Han's head. Greedo attempted to collect the bounty, but was killed by Han."}, {"tag": "p", "text": "Following the death of Greedo, Jabba confronted Han in the Millennium Falcon's hangar bay, where he agreed to let Han go in exchange for a premium of fifteen percent. He left Han with a warning that if he delayed payment again, he would put a price on his head so high that Han would not \"be able to go near a civilized system.\" Han then sarcastically acknowledged Jabba as being a \"wonderful human being.\""}, {"tag": "p", "text": "After the Battle of Yavin, it was speculated that Jabba was the underworld kingpin who funded the Imperial Dark trooper project and provided the Empire with smuggling ships. His thugs hunted Kyle Katarn, since General Rom Mohc put a bounty on his head. Katarn, along with Jan Ors, however, managed to complete their mission on Nar Shaddaa by vanquishing all the thugs that hunted him. However, Jabba's ship captured the Moldy Crow, Katarn's ship, as they left the moon. Katarn and Jan Ors were imprisoned in the Star Jewel and were to be fed to kell dragons, but Katarn was able to escape Jabba's clutches. This setback, however, was not a major concern for the criminal overlord."}, {"tag": "p", "text": "Days after the Battle of Yavin, Solo paid Jabba 500,000 credits worth in ancient Sith treasure, through Sprool the Trader. Jabba accepted the gift, but kept the bounty on Han, for it was too little, too late. However, Jabba soon forgave Solo's debt after the smuggler saved his accountant Mosep Binneed (under the alias Jabba the Hut) from the stone-mites on planet Orleon. After that Han even made another Kessel Run for Jabba. But this quiet period for Solo was short-lived, because when Mosep found Crimson Jack's wrecked ship—which Jabba helped to refit and recondition—and learned about Han's part in destroying it, the bounty was once again placed on his head."}, {"tag": "p", "text": "In the years following the Battle of Yavin, Jabba the Hutt went into a strong rivalry with Lady Valarian and her criminal organization, also based on Tatooine. At some point, Lady Valarian tried to have Jabba assassinated by a team of elite off-world specialists. However, the Hutt crime lord discovered the plot and Jabba's henchmen killed Lady Valarian's team during an assault on the Valarian Strategic Command Bunker."}, {"tag": "h4", "text": "Jabba and the Zann Consortium"}, {"tag": "p", "text": "Some time before the Battle of Yavin, Jabba entered into a partnership with the weapons dealer Tyber Zann. However, neither partner apparently planned on this alliance being permanent. When Tyber learned that Jabba had purchased an artifact that had cost him half his great wealth the young smuggler struck. Tyber took several squads of mercenaries to Felucia, where Jabba met the Imperials to whom he was selling the artifact. Tyber managed to steal the artifact, but was captured. Transmitting to Zann on Kessel, he told him that he'd be dead, because he had sent an assassin to kill him. However, Tyber's associate, Urai Fen, managed to free him, and Tyber would go on to form the Zann Consortium, and decided to get his revenge on Jabba. He would go on to steal the Holocron."}, {"tag": "p", "text": "One battle of note between Jabba and the Consortium was the Battle of Hypori. Using a listening post on Saleucami Jabba had pinpointed the Constortium's bases and sent saboteurs to hit them. Although he was initially successful, Tyber rebounded and tracked down Jabba's droid factory on Hypori, to which he sent an attack force. Jabba suffered a rare defeat when Bossk switched sides for triple pay and Tyber and Urai were able to slice the Droideka Mark II's programming. With his newfound power Tyber killed Jabba's men and forced the Hutt to agree to a ceasefire that gave Tyber control of Saleucami and Hypori and the bounty on his head called off."}, {"tag": "h3", "text": "Chaos on Tatooine (3 ABY–4 ABY)"}, {"tag": "h4", "text": "Black Sun"}, {"tag": "p", "text": "At the time of Jabba's campaign against the Jedi Order during the Purge, Jabba and Xizor built powerful criminal empires parallel to and in symbiosis with Palpatine's New Order. In the wake of the Clone Wars, c. 15 BBY, the galaxy's seats of power were still realigning. The Fromm family had begun to invest heavily in a covert project to build a powerful weapons satellite, dubbed Trigon One. Using its orbital laser, Fromm made ambitious power grabs in his home system of Annoo. However, when both the Trigon and his palace were destroyed, Fromm's plans were foiled. Soon after, Jabba made a political move that established him as the galaxy's leading gangster."}, {"tag": "p", "text": "The quick-witted Hutt struck while the iron was hot and placed a bounty on the heads of the entire Fromm organization, aiming to crush them while they were still reeling from their losses. Because of a series of run-ins with Boba Fett, the elderly Annoo-dat gangster was captured and executed along with his son and chief officer of security."}, {"tag": "h4", "text": "Solo, paid in full"}, {"tag": "p", "text": "After the Battle of Hoth, Anakin Skywalker, now the Sith Lord Darth Vader, sent an agent named Jix to spy on Jabba, and to keep an eye out for his son Luke, making sure nothing happened to the boy. While on Tatooine, he ran into Big Gizz and his swoop gang. They brought him before Jabba, since he was \"looking for a job\". When Jabba received word that Luke was more valuable dead than alive, Jix was confused; he thought Vader wanted the boy alive. With that in mind, when the gang ambushed Luke, Jix stopped Gizz from fatally shooting the young Jedi by knocking the swooper out cold with a rock. Luke took out the rest of the gang, while Spiker, another swooper, rode off with Jix. Jabba was furious and yet curious about the situation at the same time. He believed that it had been a great amount of luck for one man. Jabba then explained that a change of plans has happened: Lord Vader wanted his son dead, though unbeknownst to the Hutt, it was really Xizor who was after Luke. He had his suspicions about Jix, since he knew the other bikers were too stupid to betray him. In the meantime, Boba Fett was trying to get the bounty for Solo by bringing the smuggler to the Hutt."}, {"tag": "p", "text": "When one of Jabba's aides found Jix messing with the security codes for a transmission, Jix killed the aide and took the key to the security code and transmitted to Vader. Right before Fett arrived, Jabba wondered why one of his aides was murdered. Right after he accused Jix, Fett arrived. He offered five thousand credits to anybody who could bring him Solo (so that he would not have to pay Fett the outrageous price). However, Fett did manage to come through and collect the bounty that Jabba was so hesitant to pay. Bossk and Fett would continue to stay in Jabba's court for the remainder of the time Solo was his captive. Zuckuss left, since he had business elsewhere, while the others stuck around at Jabba's palace."}, {"tag": "p", "text": "At the same time, the Hutt grew increasingly hedonistic, spending millions on a vehicular demolition event with few survivors and even fewer rules after he received the frozen Solo. However, Jabba's victory was soon disrupted by two droids and a message."}, {"tag": "h4", "text": "The infiltration"}, {"tag": "p", "text": "The Hutt was greatly pleased with Han's delivery, turning the carbon-frozen captive into his \"favorite decoration,\" having him hung on a wall in his audience chamber. However, the Rebel Alliance wanted Han back, and to do so, they concocted an elaborate plan. First, Luke Skywalker sent R2-D2 and C-3PO to Jabba with a message, and as a gift. Escorted past Jabba's Gamorrean guards, the droids delivered Luke's message, asking to bargain for Solo. Jabba, bemused, rejected the offer and put his new droids to work."}, {"tag": "p", "text": "Afterward, the Hutt listened to the Max Rebo Band sing \"Jedi Rocks,\" as Oola, his Twi'lek slave girl, danced for him. Demanding a repeat, Jabba tried to bring Oola to him, but she resisted and Jabba pressed his trapdoor button and let his rancor eat her. Directly after the death of Oola, Princess Leia Organa, disguised as the bounty hunter Boushh, brought Chewbacca as her \"prisoner\". Jabba and the ersatz Boushh bargained over the price on the Wookiee's head, eventually agreeing on 35,000 credits after the bounty hunter pulled a thermal detonator out and threatened to activate it. Chewbacca was imprisoned in Jabba's dungeons, while Boushh remained in the Palace, waiting for evening."}, {"tag": "p", "text": "Later that night, Leia thawed Han Solo out of the block of carbonite he was in. However, Jabba caught her and Han. Han tried to bargain with the gangster, saying that he was sidetracked, but Jabba said it was too late. Coincidentally, Han was put in the same cell as Chewbacca while Leia was taken as Jabba's new slave."}, {"tag": "p", "text": "After a few days, Luke Skywalker finally arrived at Jabba's Palace. Luke demanded the return of Solo and the Wookiee, warning that Jabba would be destroyed if he didn't comply. After Luke Force pulled a gun from a neighboring guard named Nizuc Bek, Jabba caused the young Jedi and a nearby Gamorrean named Jubnuk to drop down a trap door, into the lair of Jabba's rancor. The rancor ate Jubnuk first as Jabba laughed in amusement, then went for Luke. After bashing its claw with a rock and ramming a bone into its mouth, Luke ran between the monster's legs to the other side of the monster's lair. There, he managed to kill the ferocious beast by destroying the control panel for the door thus dropping a gate on the monster; the sharp points at the bottom of the door piercing the beast's skull and killed it."}, {"tag": "p", "text": "Mara Jade was present at Jabba's Palace on Palpatine's orders, disguised as the dancing girl Arica, planning to kill Luke, whom she would later marry and become a member of the New Jedi Order. Melina Carniss, a member of Jabba's secret security detail, suspected her of being out to assassinate the Hutt and attempted to have her imprisoned, despite failing this she had made it impossible for Mara to complete her mission."}, {"tag": "h4", "text": "Showdown at the Pit of Carkoon"}, {"tag": "p", "text": "An enraged Jabba, translated through Threepio, stated that Solo, Chewbacca, and Luke were to be taken to the Great Pit of Carkoon, to be fed to the fearsome sarlacc. Only Leia was spared from execution as Jabba found her attractive and had other plans for her. Jabba and his entourage traveled aboard Khetanna, his private sail barge, while the prisoners were carried to their doom on a smaller skiff. On the way, Leia attempted to watch the proceedings out of the window, but Jabba would not allow it and boasted that she would soon learn to appreciate him."}, {"tag": "p", "text": "Later, once they reached the pit, Jabba offered the prisoners a chance to beg for mercy. Luke warned Jabba once more, but the Hutt ignored the offer and ordered them to be thrown in. Just as Luke was to be thrown to the sarlacc, R2-D2, who was working on the sail barge at that time, launched Luke's lightsaber from a hidden compartment in his dome. Luke immediately launched an attack against the skiff guards, causing a state of panic to break out onboard Khetanna. Amid the chaos, Leia shorted the lighting system, distracting Jabba."}, {"tag": "p", "text": "During the distraction, Leia jumped over Jabba's tail, wrapped her chain around the crime lord, and strangled him to death. After being freed from her restraints by R2-D2, Leia and Luke met on the top deck of Jabba's Sail Barge. Luke had Leia point the deck gun into the bowels of the ship and set it off. Escaping to one of the skiffs, the successful rebels sped away from the exploding sail barge, which had become a funeral pyre for the once-great Jabba the Hutt."}, {"tag": "h3", "text": "Aftermath (4 ABY—)"}, {"tag": "p", "text": "Immediately following Jabba's demise, fighting broke out between the remnants of his criminal empire. Two small time criminals named Qes Dollis and Kisa Shaki tried to take over the Mos Eisley portion of his smuggling business, sparking a gang war. Meanwhile, a group of four war droids called the Mos Eisley Mourners were activated within a week and attempted to wipe out anyone that they identified as a possible responsible party."}, {"tag": "p", "text": "The death of Jabba canceled the debts of many individuals, because of which Luke was held with considerable favor for removing that dangerous complication in people's lives. In response to his son's death, Zorba (fresh out of galactic prison) placed a bounty on Leia, which the Desilijic kajidic later extended to Han, Chewbacca, and Luke. The bounty was not formally rescinded until Leia's election as Chief of State, since the Hutts did not wish to further antagonize the New Republic."}, {"tag": "p", "text": "Because of Luke's involvement in Jabba's death, Ka'Pa, if not all the Hutts, grew distrustful to the Jedi, which caused negotiations with Mara Jade on behalf of the New Republic to be a bit shaky."}, {"tag": "p", "text": "Gorga the Hutt, Jabba's nephew, went to Jabba's palace seeking a part in his uncle's will. Gorga was given a small statue of a Hutt; a statue that held the key to Jabba's prized treasure trove. Gorga also desired the funeral urns of Jabba, but he had some competition: Spiker (who had somehow survived his encounter with Solo and Fett) and Big Gizz (who was found to have survived his encounter with Jix and Luke Skywalker). Upon learning of their boss's death, the happily reunited swooper duo sought out the deceased Hutt's legendary treasures, joined by Jabba's former servant, Onoh."}, {"tag": "p", "text": "When the trio discovered the vaults, however, they activated a security system that nearly killed them. It was a recording made by Jabba, who knew that Gizz was still alive and had predicted that he would try to steal his riches. In its self-destruction, the booby-trapped tape almost killed the bikers. Later, to Gorga's horror, Gizz and Spiker dropped Jabba's urns on Gorga and his henchmen. The urns, of course, were destroyed in the process."}, {"tag": "p", "text": "Many years after Jabba's death, many Hutts wished that he still lived, for if he had, the Hutts believed that they would have avoided the disastrous Darksaber project and their treacherous deal with the Yuuzhan Vong. However, Jabba's organization did unwittingly help the Darksaber project; by scouring the Hutt's palace on Tatooine, Durga's Besadii agents procured the access codes to the ex-Imperial databases on Coruscant, where they found the Death Star plans needed to assemble their own superweapon."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jabba, a typical Hutt, was greedy, malicious, pragmatic, and adept at bending others to his will. He was also prideful, and he collected things like trophies and trinkets as reminders of his power. He also enjoyed cruelty, in the form of torture, executions, and subjugation (as with the case of his palace). He did this for enjoyment, as well as for practical purposes of logistics and need. He kept the oddity Salacious B. Crumb simply because he was as humorous to him as he was annoying to others. He also had a lust for female humanoids, often enslaving them for his pleasure, such as Oola and Leia. His humanoid female fetish was also implied by close Hutt associates of Jabba to not be a typical Hutt trait. However, this trait turned out to be his downfall when Leia killed him."}, {"tag": "p", "text": "Despite his cruel, greedy and sadistic nature, Jabba had shown a softer side as evident when he was overjoyed at the return of his Huttlet, Rotta. He was also furious and a little shocked at his uncle Ziro's hand in his son's kidnapping. These two attributes point to the possibility that Jabba cared about and respected family, to a certain extent. Likewise, he also seemed to contain some empathy to other people's love of their offspring, as evidenced by his ultimately allowing Notluwiski Papanoida, who arrived to search for his daughters, to present evidence and arrest the Rodian bounty hunter Greedo after Papanoida reminded him of his love for his own son. He also expressed regret when Ephant Mon implied that he thought his relationship with Jabba was based on a debt, not on friendship. Jabba considered Han Solo his best smuggler, and had a measure of fondness for him, though he was frustrated that Han had once \"dropped his cargo at the first sign of an Imperial starship\" and placed a bounty on his head when Han was unable to pay Jabba the money he owed him."}, {"tag": "p", "text": "Jabba eventually grew tired of Han and, no longer concerned about Han's debt to him, kept his frozen state (brought to him by Boba Fett) as a wall decoration. When Han was freed from cryogenic freezing by Leia, Jabba had Han taken prisoner and later attempted to feed him, along with Luke Skywalker and Chewbacca, to the sarlacc."}, {"tag": "p", "text": "Jabba's right arm bore a tattoo of his kajidic clan, the Desilijic."}, {"tag": "p", "text": "While fighting Beldorion on Nam Chorios, Leia Organa Solo remembered from her time in Jabba's palace that Jabba's fat hid a great deal more muscle than anyone suspected, and for all his apparent sluggishness, he could move deceptively fast across a room, particularly when his temper was roused."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "Jabba Desilijic Tiure was created by George Lucas, the creator of Star Wars, but was known only as Jabba the Hutt until his identification as a member of the Desilijic Kajidic in later Expanded Universe works. Jabba the Hutt appears in Lucas's second draft of Star Wars, 1975's Adventures of the Starkiller, Episode I: The Star Wars, as the larger and mangier slavering hulk of two gruff and grisly pirates. The pirates, along with Han Solo and Chewbacca, work for the pirate Captain Oxus aboard a TDF104 starship. Lucas's third draft, entitled The Star Wars: From The Adventures of Luke Starkiller, introduced Jabba as the leader of a band of pirates who had paid for Han Solo's ship. Still a gross and slavering hulk, Jabba approaches Solo in Mos Eisley and demands use of the ship, but is thwarted when the Corellian blasts away from Utapau with Luke, Kenobi, and the droids. A tweaked version of this latter scene went on to appear in the final script, and was filmed during production of the first Star Wars film. However, time and money constraints prevented Lucas from including it in the film's final cut."}, {"tag": "p", "text": "The final script of Star Wars changed the spelling of his name to \"Jabba the Hut\" and described him as a \"fat, slug-like creature with eyes on extended feelers and a huge ugly mouth.\" Lucas intended for him to be a furry, Chewbacca-esque character, and had actor Declan Mulholland play the role wearing a shaggy coat. Mulholland would have been replaced with a stop-motion creature during post-production had the scene not ended up on the cutting room floor. The scene did appear in the film's novelization and comic adaptation, however, both using the \"Hut\" spelling of the screenplay. The film's 1981 radio drama replaced Jabba with his henchman Heater."}, {"tag": "p", "text": "The novelization describes Jabba as a \"great mobile tub of muscle and suet topped by a shaggy scarred skull,\" while in the comic issue Star Wars 2, Jabba appears as a member of a walrus-like species also present in the Mos Eisley Cantina, later identified as a Nimbanel. This depiction of Jabba went on to appear in two additional issues of the Marvel Comics-issued Star Wars series. Although no official retcon has addressed this issue, Abel G. Peña, a Star Wars author who has fit other continuity problems from the Marvel series into Star Wars canon, has suggested that the discrepancy between Jabba's Nimbanel appearance and his canonical depiction as a slug-like creature can be explained by retconning \"Jabba the Hut\" into actually being Mosep Binneed, Jabba the Hutt's Nimbanel accountant."}, {"tag": "p", "text": "Although not present in the final version of Star Wars, Jabba is mentioned several times in the film as being owed a large sum of credits by Han Solo. In 1980's Star Wars: Episode V The Empire Strikes Back, Jabba again does not appear, but Solo's continued debt causes him to be frozen in carbonite and taken to the Hutt during the climax of the film. The official Databank entry claimed that the release of Empire solidified the spelling of \"Hutt,\" with a double t, but in fact his name is still spelled with a single t in the Empire novelization and comic adaptation. It was not until the publication of material contemporaneous with Return of the Jedi in 1983 that the spelling was officially changed to \"Hutt.\""}, {"tag": "p", "text": "But nothing specified, as of 1983, whether \"Hutt\" was a title, family name, species, or other identifier. Jabba was the only Hutt in canon, and was not necessarily considered typical of his species: the Return of the Jedi novelization stated that Jabba had once had hair, which he had lost to disease."}, {"tag": "p", "text": "Several years later, West End Games sourcebooks contradicted this by specifying that all Hutts shared Jabba's basic form, including hairlessness. They also established that \"Hutt\" was the name of Jabba's species."}, {"tag": "h3", "text": "A slug is born"}, {"tag": "p", "text": "Jabba the Hutt appeared and played a large role in Richard Marquand's 1983 film Star Wars: Episode VI Return of the Jedi. Lucas wanted the character redesigned, and told Industrial Light & Magic visual effects supervisor Phil Tippett to design something alien, grotesque, and like the actor Sydney Greenstreet. Tippett settled on the idea of Jabba being a large, sluglike pulsating mass of flesh, although the film's costume designer, Nilo Rodis-Jamero, had conceived of him being a refined character similar to an older Orson Welles. One of Tippett's concept models of the character saw Jabba wear a Fez hat in the style of Greenstreet."}, {"tag": "p", "text": "After constructing several models, Tippett turned work over to makeup supervisor Stuart Freeborn, whose team built a one-ton puppet over the course of three months costing half a million dollars. During filming, the puppet was operated by a team of puppeteers. One puppeteer stood behind Jabba and controlled his head; each of the Hutt's arms were controlled by someone sitting inside of the puppet; two little people sat inside the puppet and controlled Jabba's tail; and his eyes were radio-controlled by a final operator. David Barclay was the chief puppeteer and controlled the right arm and mouth, Toby Philpott controlled the left arm and tongue, and Mike Edmonds was inside the tail. Sculptor John Coppinger has credited the team's performance as having allowed the other actors on set to react and relate to Jabba, and Philpott has praised the builders of the puppet for allowing the character to come alive."}, {"tag": "p", "text": "The interior body of the fifteen-foot-long puppet was made of fibreglass floating on springs that angled down from posts set onto an industrial turntable. The puppeteers sat inside of the fibreglass shell, and airbags and latex skin were layered on its outside in order to fabricate the shape of Jabba's stomach. Philpott has described the interior as smelling like a fine collection of fumes of lubricants, paints, and glues. For several weeks, he and Barclay would spend most of a day inside the puppet, where they had access to a single headset and a monitor showing them a view of the puppet's exterior. On their request, Director Richard Marquand would speak and issue instructions directly to Jabba as if the Hutt were a real person. The exchanges helped them continuously practice controlling the puppet, and sustained the illusion of Jabba's reality for the other actors on set."}, {"tag": "p", "text": "The Jabba puppet was filmed on three different sets. On the sail barge set, the scene featuring his death originally called for Carrie Fisher, the actress playing Princess Leia, to attack him from the front and kill him. His manner of death was changed to feature Leia attacking him from behind and choking him to death on the advice of George Lucas. Lucas was inspired by a scene depicting an obese character's death in the 1972 film The Godfather. The puppet had to be repaired following each take of its death scene."}, {"tag": "p", "text": "Jabba's Huttese dialogue was recorded and spoken by Larry Ward. Sound effects accompanying movement of the puppet's limbs and mouth were created by a hand running through a bowl of cheese casserole and a muddy towel scraping along the inside of a garbage can. Jabba's Theme, a musical leitmotif played on the tuba, was often played during Jabba's screen time in Return of the Jedi."}, {"tag": "h3", "text": "From puppet to CGI"}, {"tag": "p", "text": "In 1997, Lucas re-released each entry of the Star Wars trilogy as a Special Edition to commemorate the twentieth anniversary of the original film's release. His intent was to restore the deteriorating film negatives of the original movies while improving special effects and adding in scenes that hadn't previously been included. One such scene was Jabba's appearance in the original Star Wars, as Lucas wanted to connect the film to Return of the Jedi. Recent improvements in computer-generated imagery techniques allowed for Declan Mulholland to be replaced by a CGI Jabba. Visual effects supervisors working on the Special Edition created a CGI model of Jabba in a five-shot project that took one year to complete, but faced the problem of Han Solo's actor Harrison Ford having walked around Mulholland's back. On Lucas's advice, they edited the scene to make Solo step on Jabba's tail. The CGI Jabba was further polished and improved when the film was released on DVD in 2004."}, {"tag": "p", "text": "Jabba was given a cameo in the 1999 film Star Wars: Episode I The Phantom Menace. In the movie, he was again a CGI model, and was credited as playing \"himself.\" His theme music can be heard briefly in the film, as well as in the DVD release of A New Hope."}, {"tag": "h3", "text": "In Star Wars media"}, {"tag": "p", "text": "In addition to appearing in three of the primary films of the Star Wars saga, Jabba has been featured in a wide variety of Expanded Universe works. The 1996 anthology of short stories Tales from Jabba's Palace explored the lives and backstories of the patrons of his court, revealing that many of them were plotting to kill him. Dark Horse Comics released several one-shot Jabba comics in 1995 and 1996, and several reference books have expanded the character's backstory. The 1991 novel Heir to the Empire established that the smuggler Talon Karrde replaced Jabba at the top of the criminal underworld following the Hutt's death, and a series of young-reader novels involved Jabba's father Zorba attempting to enact revenge on Princess Leia following the death of his son."}, {"tag": "p", "text": "Jabba played a large role in the 2008 film Star Wars: The Clone Wars. In the movie, following the kidnapping of the Hutt's son, Anakin Skywalker and his Padawan Ahsoka Tano embark on a quest to rescue the young Huttlet, hoping to gain the Republic access to hyperspace routes through Hutt Space during the Clone Wars. Jabba was voiced by Kevin Michael Richardson. David Barclay, one of the Return of the Jedi puppeteers, voiced the character in the 1994 video game Super Star Wars: Return of the Jedi,[source?] while Ed Asner provided vocal talents in the Return of the Jedi radio drama. Clint Bajakian has voiced the Hutt in the video games Bounty Hunter, Galactic Battlegrounds, Demolition, Star Wars: Episode I The Phantom Menace video game,[source?] and Racer Revenge. Archive footage of Larry Ward's performance from Return of the Jedi was used in two LEGO Star Wars video games.[source?]"}, {"tag": "h3", "text": "Impact on popular culture"}, {"tag": "p", "text": "In the years since the release of Return of the Jedi, a wide variety of Jabba-related merchandise has been released, including scores of action figures, busts, and Halloween costumes. The character has been parodied many times, including on the American cartoons Family Guy[source?] and South Park. Mel Brooks's 1987 Star Wars spoof Spaceballs features a character named Pizza the Hut, who satirizes both Jabba and the American fast-food restaurant Pizza Hut.[source?]"}, {"tag": "p", "text": "In literature and popular culture, Jabba's name and appearance have been used to represent obesity, corruption, greed, and anarchy. Authors Marian Keyes and Laura Kalpakian have referenced the Hutt in their novels, respectively in regards to gluttony and a character's weight, while comedian Roseanne Barr was frequently compared to Jabba by The New York Observer columnist Michael Thomas in what author W.C. Goodman called \"vitriolic attacks based on her weight.\" Michael Jordan biographer Mitchell Krugel asserted that Chicago Bulls manager Jerry Krause had a \"Jabba the Hutt\" image after making negative comments on Jordan's multi-million dollar contract. Further comparisons of the Hutt with greed, as well as anarchy, have been made by author Koenraad Kuiper."}, {"tag": "p", "text": "In his book The Dharma of Star Wars, Matthew Bortolin asserted that Jabba's way of life is contrary to the pursuit of the Buddhist Noble Eightfold Path. California Democratic legislator Jackie Goldberg has been caricatured as a grotesquely overweight Jabba the Hutt–like figure by the newspapers Los Angeles Daily News and New Times LA, the latter calling her \"a human Jabba the Hutt who consumes the good while producing the bad.\" Finally, critic William Ouchi has accused American public school systems of being run by inefficient bureaucracy covered with Jabba-like layers of organizational fat."}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "p", "text": "In the alternate comic series Star Wars Infinities: The Empire Strikes Back, Han Solo and Chewbacca arrive at Jabba's Palace to pay him, but are denied the opportunity by the Hutt and sentenced to die. Pitted against Nexus in a gladiatorial arena, the pair escape with the help of R2-D2 and unleash a Nexu into Jabba's court. In the wake of the beast's rampage, Darth Vader arrives and demands to see Jabba's captives. The Hutt is forced to tell the Dark Lord that they escaped. He adds that he hopes never to see or hear of Solo again."}, {"tag": "p", "text": "Star Wars Infinities: Return of the Jedi recreates the events of its original incarnation until Princess Leia, disguised as the bounty hunter Boushh, activates her thermal detonator and destroys the throne room, killing Jabba."}, {"tag": "p", "text": "Jabba is seen in LEGO Star Wars: The Padawan Menace, where he has the captured group of Jedi younglings along with C-3PO and R2-D2. He orders the two droids to fight to the death for his amusement but after the younglings encourage C-3PO the group eventually escapes Jabba's clutches."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Ambiguously-canon appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}