{"url": "Jabrogg_Thung", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Criminals", "Category:Gamorreans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jabrogg Thung"}, {"tag": "p", "text": "Jabrogg Thung was a male Gamorrean who lived during the last decades of the Galactic Republic. He partook in the sport of nerf-throwing, and became the intergalactic nerf-throwing champion. During his sporting career he fatally injured several nerfs which lead to the Galactic Humane Society placing a bounty on his head. The Mandalorian bounty hunter Jango Fett encountered Thung on Outland Transit Station in 32 BBY and captured him alive, claiming the bounty for 2,000 credits."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the year 32 BBY, the Gamorrean Jabrogg Thung had taken up a career in the sport known as nerf-throwing, and whilst working as an athlete, he was responsible for the fatal injury of several nerf, a species non-sentient grazing animal. Thung's prowess in the sport lead to him being considered the intergalactic nerf-throwing champion, but his involvement in the death of the nerfs resulted in the Galactic Humane Society placing a bounty on his head. The organization offered 2,000 for his capture alive, but would only pay 1,000 if he was killed. In 32 BBY he was on a space station named Outland Transit Station in the Outer Rim Territories. Whilst Thung was there the Mandalorian bounty hunter Jango Fett also arrived on the station and begun hunting down the Muttani criminal Meeko Ghintee as a favor to the stations Toydarian owner Rozatta."}, {"tag": "p", "text": "Whilst Fett was hunting Ghintee he encountered Thung in the entertaiment district of the station. Upon seeing the hunter Thung and several other Gamorreans and some Trandoshans he was with attacked the Mandalorian. However Fett managed to successfully capture the sports champion alive and later claimed the bounty of 2,000 from the Galactic Humane Society."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jabrogg Thung was a male Gamorrean with green skin and yellow eyes. Upon seeing Jango Fett he attacked him immediately, whilst backed by several other assailants."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "In combat Thung used a Vibro-ax and wore brown armor including a helmet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Thung first appeared in the video game, Star Wars: Bounty Hunter developed by LucasArts and released in 2002. In the game Jabrogg is the second of five possible secondary bounties that a player can secure in the pit fighters arena section in the games first chapter. Players have the option of taking him alive or killing him but this article assumes that he was captured alive as this is the option with the highest reward. He also was mentioned in the Star Wars: Bounty Hunter: Prima's Official Strategy Guide which was released along side the game by Prima."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}