{"url": "Jac_Lodain", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Batuu residents", "Category:Farmers", "Category:Males", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Jac Lodain"}, {"tag": "p", "text": "Jac Lodain was a Twi'lek male who worked as a farmer at Kat Saka's farm on the planet Batuu. His parents settled with him on Batuu after his father and aunt fought against the Galactic Empire. Months after the Hosnian Cataclysm, he was the leader of a group of thirteen-year-old farmhands who harvested purple Surabat grain at Saka's farm. When the smuggler Izal Garsea came to Batuu, Lodain and his group shared conversation over a meal. He later helped her fill canteens for the farm's overtime workers. Lodain's smug demeanor reminded Garsea of her former boyfriend, fellow smuggler Damar Olin."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Twi'lek Jac Lodain was born to his mother and father around 18 ABY. His father and aunt had fought against the Galactic Empire, and the former had lost his arm, while the latter had died. The Twi'lek's parents then settled with him on the Outer Rim planet Batuu. At some point after the Hosnian Cataclysm of 34 ABY, Lodain's mother had noticed Resistance presence around Batuu's ancient ruins, but his father had entreated to keep it quiet because of the First Order's stormtroopers deployed on the planet."}, {"tag": "p", "text": "Months after the Hosnian Cataclysm, Lodain worked at Kat Saka's farm as a harvester of purple Surabat grain. He was the leader of a group of thirteen-year-old farmhands, including the human Shari, a Sullustan, and a Gungan. The group was surprised by the smuggler Izal Garsea's appearance when their former colleague Julen Rakab brought her to the farm. Garsea told them that she was in between jobs, and the group was impressed that she owned her own starship, the light freighter Meridian. When Shari and the Gungan entreated Garsea to stay at the farm, Lodain rebuffed Shari's suggestion smugly, pointing out that her grandparents needed somewhere to hide after the Clone Wars. Garsea then deescalated the argument, and the group ate together."}, {"tag": "p", "text": "Lodain later went with Garsea to fill canteens for the overtime workers at the farm's well. He was skeptical of her reason for being on Batuu and suspected she came for the Resistance. Garsea denied the claim but noticed that Lodain's lekku denoted he was pleased with her admission that a smuggler was always between jobs. Garsea shared Lodain's father's sentiment of keeping sightings of the Resistance quiet and listened to Lodain outline his aspirations of bravery and grandeur, advising that he fight for his relatives. Upon learning she had not chosen any family yet, Lodain offered that she could always choose the farmhands. As the overtime alarm sounded, Lodain shook her hand and said goodbye."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jac Lodain dreamed of being brave enough to leave Batuu to fight for something. He wanted to follow in the footsteps of his father and aunt, who had fought against the Empire. As the leader of a group of farmhands at Saka's farm, Lodain thought himself above his younger companions and dismissed a suggestion of Shari's bluntly. When with Izal Garsea, Lodain had a smug demeanor that reminded her of her former boyfriend and smuggler, Damar Olin. She noted that Lodain wanted to impress her and that he expressed his smugness through his lekku movements. Lodain took a liking to Garsea and offered that she could always choose the farmhands to be her family."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jac Lodain appeared in A Crash of Fate, a 2019 young-adult novel written by Zoraida Córdova."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}