{"url": "Jacen_Solo%27s_lightsaber", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles to be expanded", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Jacen Solo's lightsaber"}, {"tag": "p", "text": "Jacen Solo's lightsaber was a weapon constructed by Jedi Knight Jacen Solo in 23 ABY. He used it until his fall to the dark side in 40 ABY, at which point it was confiscated by Luke and Ben Skywalker."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation and training"}, {"tag": "p", "text": "By the age of thirteen, Jacen began attending his uncle Luke Skywalker's Jedi Praxeum on Yavin IV. There, along with the rest of his class, he constructed his lightsaber, using a precious, powerful Corusca Gem acquired from Lando Calrissian's GemDiver Station to power the weapon. At one point, during an ill-fated sparring exercise, Jacen accidentally cut off Tenel Ka Djo's left arm with his lightsaber after her own lightsaber failed."}, {"tag": "h3", "text": "Jedi tool and Sith weapon"}, {"tag": "p", "text": "Jacen fought in the Yuuzhan Vong War alongside his family and friends. During the Battle of Duro, he used it against Warmaster Tsavong Lah, who was torturing his mother, Leia Organa Solo. After he was captured during a disastrous mission to Myrkr, Jacen's lightsaber was taken by the mysterious Fosh Jedi Vergere. Vergere later returned the lightsaber to Jacen, however, and he wielded it for the remainder of the war, as well as the later Dark Nest Crisis and Swarm War."}, {"tag": "p", "text": "During Second Galactic Civil War, Jacen turned to the Dark Side under the influence of the Sith Lady Lumiya. However, Jacen initially still used his Jedi weapon, much like his grandfather almost sixty years earlier. He used it to kill his former apprentice Nelani Dinn and duel the bounty hunter Aurra Sing aboard his flagship, the Anakin Solo. Weeks later, he used the lightsaber against his aunt, Mara Jade Skywalker, when she tried to assassinate him after learning of his treachery. Jacen proved less than a match for Mara, and he only barely survived the encounter by killing her with a poison dart, becoming the Sith Lord Darth Caedus thereafter."}, {"tag": "h3", "text": "Final use and confiscation"}, {"tag": "p", "text": "The lightsaber's final use in Caedus' hands was against Luke Skywalker himself in a vicious duel aboard the Anakin Solo during the Battle of Kashyyyk. Each severely injured the other before Ben Skywalker, Luke's son whom Caedus had captured prior, plunged a vibrodagger into Caedus's back. Caedus's lightsaber remained lit even after he dropped it, but as he continued to reach for it, Ben took it and prepared to finish him off, believing Caedus was responsible for his mother's death. However, Luke, realizing how close he and his son had come toward the Dark Side, convinced Ben to spare Caedus' life. As the battered Skywalkers fled the Anakin Solo, Ben gave Jacen's lightsaber to Luke. What became of the lightsaber afterward is unknown."}, {"tag": "p", "text": "After recovering from his battle with his uncle and cousin, Caedus later built a red-bladed lightsaber as per the usual traditions of the Sith, and wielded that weapon until his death at the hands of his sister, Jaina."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}