{"url": "Jack_Purvis", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Stay On Target", "Category:Articles needing illustration", "Category:People stubs", "Category:Deceased actors", "Category:Star Wars original trilogy actors"], "nodes": [{"tag": "h1", "text": "Jack Purvis"}, {"tag": "p", "text": "Jack Purvis (July 13, 1937 – November 11, 1997) was an actor in the original Star Wars trilogy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born in London, England, with dwarfism, Purvis stood only 4 feet 1 inch once reaching adulthood. Purvis became an artist, and he met and befriended Kenny Baker, with whom he acted in nightclubs and theatres. They eventually became partners in a joint show, The Mini Tones."}, {"tag": "p", "text": "Purvis married his wife, Marjie, in 1964. They became parents in 1964 with the birth of their son Andrew, and in 1966 their daughter Katie, who shared her father's dwarfism, and later took part in the production of Star Wars: Episode VI Return of the Jedi. The family was further populated in 1971 with the arrival of Jason."}, {"tag": "h3", "text": "Career"}, {"tag": "p", "text": "Purvis began working in cinema with Star Wars: Episode IV A New Hope in 1977. His partner, Baker, was in negotiations to act as R2-D2. As that would have forced him to cancel the rich summer season of his theater show, which would have been a blow to Purvis' career, Baker and Purvis convinced the producers to hire both of them for the movie. Purvis began acting as the Chief Jawa, seen as he attacked and disabled his friend's droid character. His other characters in the film include the cantina patron Kitik Keed'kak and a power droid in Mos Eisley. After that, Purvis' height made him a great choice for other roles with similar requirements, including Wombling Free (1977), a movie adapting the children's novels based on The Wombles."}, {"tag": "p", "text": "Purvis was called upon again to act in Star Wars: Episode V The Empire Strikes Back. Although there were no Jawas in that movie, there was another role for a man of his size: the Chief Ugnaught. Later identified as Ugloste by the Expanded Universe, Purvis can be seen on Cloud City, where Han Solo was frozen in carbonite."}, {"tag": "p", "text": "He drew the attention of cult director Terry Gilliam, who considered both him and partner Baker for main roles in his 1981 movie Time Bandits, narrating the adventures of interstellar thieves of short height. Purvis' character (Wally) again attacks Baker's (Fidgit) in the movie. Purvis then worked with Jim Henson in his puppet fantasy The Dark Crystal, although his role is clearly diluted in the background of the movie."}, {"tag": "p", "text": "Jack Purvis returned to the Star Wars saga for the final time in Star Wars: Episode VI Return of the Jedi. Although there were Jawas in this installment, they only served as background characters. Instead, Purvis played a member of a new species, the Ewoks. His character, Teebo, was an axe-wielding gray Ewok using a skull as a helmet. Thus, he is the only person to be credited in the three original films as playing different characters in each installment. Purvis' then-teenage daughter Katie also appeared in the film as an Ewok mother, holding a Wokling in her arms."}, {"tag": "p", "text": "After Return of the Jedi wrapped its shooting, Purvis performed in a TV version of The Invisible Man in 1984, before working again with Terry Gilliam in the much-acclaimed Brazil, the second installment of a presumed Gilliam trilogy talking about the ages of man (Time Bandits referred to childhood and Brazil to maturity, followed by the movie The Adventures of Baron Munchausen, about old age). Purvis' character was a competitive and exploitative plastic surgeon."}, {"tag": "p", "text": "Purvis continued his career, usually paired with Baker in non-starring roles. For instance, in 1986, they acted in both Neil Jordan's Mona Lisa and in an almost uncredited role as a goblin in Jim Henson's Labyrinth. Purvis' later role as a Nelwyn band member in Lucas' 1988 film Willow was uncredited."}, {"tag": "p", "text": "Later in 1988, however, Purvis had a major role in Terry Gilliam's The Adventures of Baron Munchausen. He was one of the amazing servants of the Baron, a short guy with great lung power; his mere whisper became a hurricane."}, {"tag": "p", "text": "Purvis also acted in Danny Elfman's music-video collection Oingo Boingo: Skeletons In the Closet (1989), and in C.S. Lewis' TV version of the Narnia saga, Prince Caspian and the Voyage of the Dawn Treader (1989). His last role was on Caspian director Alex Kirby's TV fantasy The Silver Chair (1990), again from the Narnia saga."}, {"tag": "h3", "text": "Later life and death"}, {"tag": "p", "text": "Jack Purvis later suffered an accident with his own vehicle after he'd parked it. The car's brakes failed and rolled backwards, crushing him between its bumper and a wall, breaking his neck, and paralyzing him for the rest of his life. Purvis died in November 1997 in Bushey Hertfordshire, England. He was sixty years old."}, {"tag": "p", "text": "After his death (and David Rappaport's earlier in 1990), Terry Gilliam indefinitely shelved the possible sequel to Time Bandits, which would have centered on both Purvis' and Rappaport's characters."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}