{"url": "Jacob_Nive", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Humans", "Category:Khuiumin Survivors", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Jacob Nive"}, {"tag": "p", "text": "Jacob Nive was a Human male who employed himself as a pirate with the Eyttyrmin Batiiv organization based on Courkrus during the Galactic Civil War. When the band was all but wiped out by Imperial forces, he became the leader of their remnants, dubbed the Khuiumin Survivors. An intelligent tactician and a man of handsome bearing, Nive typically wore his blond hair in a long braid. He was a competent leader who cared about his men and enjoyed drinking lum in moderation."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Most of Nive's adult life was spent as a member of the Eyttyrmin Batiiv pirates, where he moved up the ranks to become Captain of the Corellian Corvette Backstab. In the Battle of Khuiumin, ninety-seven percent of the eight thousand Batiiv pirates were killed in an Imperial attack. In the aftermath of the raid he became the leader of the remnant by default, but he did not lack tactical competence; during the fight he managed to save lives that would otherwise have been lost to the attacking Victory-class Star Destroyers. Renaming themselves the Khuiumin Survivors, the remaining pirates swore bloody vengeance against the Empire; in the years to follow, Nive led the Survivors on hit-and-run raids against Imperial installations and convoys. Some time later he and the rest of his people would become a part of the Invids under the renegade Admiral Leonia Tavira, staging out of Nal Hutta, providing her with some of her best starfighter pilots."}, {"tag": "h3", "text": "Leader of the Survivors"}, {"tag": "p", "text": "In the wake of the Batiiv massacre, Nive insisted that the Survivors, who were essentially the best of the gang prior to the Imperial attack, begin an intense regimen of military-style training. This training focused on discipline as well as tactics; Nive forced the Survivors to adopt and wear uniforms whenever they were on duty. He was extremely dedicated to his men and despite his lust for Imperial blood, went to great lengths to ensure their safety."}, {"tag": "p", "text": "By 11 ABY Nive and his second-in-command Tyresi Gurtt, had led the Survivors back to Courkrus, the site of the Batiiv pirates' original base, along with many of Tavira's other groups, such as the Blackstar Pirates, Riistar's Raiders, the LazerLords, the Red Nova crew and the Fastblast. Later that year he participated in a raid on a pair of luxury passenger liners, the Tinta Palette and Tinta Rainbow, a raid in which \"Jenos Idanian\", actually the disguised Corran Horn, was caught in the middle. When Jenos later showed up at the Survivors' base to join the group, bringing with him the shuttle Tinta Blue Seven, Nive, after sorting out the details of the Corellian's brazen arrival, welcomed him with open arms and assigned him to Rock Squadron over the objections of newly-elected Bolt member Remart Sasyru."}, {"tag": "p", "text": "Not long after Jenos had joined up with the pirate gang, Nive and the Survivors left Courkrus to capture Zlece Oonaar. Oonaar had been the captain of one of the two Victory-class Star Destroyers that had carried out the original Batiiv massacre. The Survivors' mission proved successful and it was Nive who personally executed Oonaar, shoving a credit coin into the ex-Imperial's mouth and spacing him out of the Backstab's airlock."}, {"tag": "p", "text": "During the mission itself, however, a private yacht happened upon the Galaxy Chance, the ship on which Oonaar had been traveling. The yacht sent its guard of six Z-95 Headhunters after the Survivors' tri-fighters. In the dogfight that followed, Jenos used his craft's ion cannons against the interlopers, preferring to leave them to be picked up instead of outright killing them. When Nive asked the newcomer about his choice of tactics, he reacted favorably to Idanian's reasoning."}, {"tag": "p", "text": "In the months that followed, Nive continued to lead the Survivors on raids at the behest of Tavira. Notable missions included and participating in the Battle of Xa Fel and raiding the Caamasi Remnant colony of Morymento on the world of Kerilt. However, not long after the Kerilt action, things began to change drastically for Nive and the Survivors."}, {"tag": "h3", "text": "Joining the New Republic"}, {"tag": "p", "text": "In the wake of the Kerilt raid, a series of bizarre incidents began happening all over the Aviary, the area of Vlarnya where the Invid crews made their homes. The first event occurred when Nive and Idanian \"witnessed\" a vision of Oonaar visiting the Crash cantina in order to return the credit coin that Nive had given him according to an old superstition. Over the next three weeks the pirate crews were hit by a Ghost Jedi wielding a lightsaber; as this was going on Nive grew more and more reclusive and despondent over the declining morale of the pirates, particularly in the wake of Shala the Hutt's death at the hands of the mysterious interloper; he increasingly resorted to drinking to ease his suffering."}, {"tag": "p", "text": "Eventually, the arrival of Tavira's advisors on Courkrus forced the Ghost Jedi into a corner, only to be rescued when Jedi Master Luke Skywalker arrived and assisted in subduing them. In the wake of the brief skirmish and having exposed the Jensaari, Luke and \"Ghost Jedi\" Corran revealed themselves to Nive. The two Jedi offered the leader of the Survivors a deal: take care of the Jensaari prisoners and make sure that they could not warn Tavira, and in return he could start a new life with the New Republic, taking the Survivors with him. Along with the Jensaari, they would eventually form the core of the defense fleet for the newly-liberated moon of Susevfi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jacob Nive was known to be a competent leader, if a bit more on the superstitious side than the typical spacer. Though he was a pirate, Nive nonetheless did possess a sense of professional compassion; this was demonstrated in his agreeing with the false Jenos Idanian that it was better to disable rather than kill a group of bodyguards that happened upon the Survivors during a mission. Idanian suggested that this would discourage future needless bloodshed in any future encounters of that nature. Given an opportunity to back down, pilots and bodyguards who were not otherwise the targets of a raid would more likely take the chance instead of going at the Survivors full-out, knowing that they would die anyway."}, {"tag": "p", "text": "Nive's dedication to his crew and their dedication to him was well-established in the wake of the Batiiv massacre. It was his tactical shrewdness which enabled him to save as many members of the group as he did. He was quite handsome and could be very charming as well; as the leader of the Survivors, Nive was also reluctant to shed innocent blood; whenever his band encountered civilian shipping he preferred to rob instead of kill."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jacob Nive first was created by Simon Smith and Eric S. Trautmann when they wrote Galaxy Guide 9: Fragments from the Rim which was first published in 1993. He later appeared in Michael A. Stackpole's 1998 novel I, Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}