{"url": "Jad_Bean", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:First Order Navy officers", "Category:Humans", "Category:Imperial Navy personnel of the Galactic Empire", "Category:Males", "Category:Zeta Squadron personnel"], "nodes": [{"tag": "h1", "text": "Jad Bean"}, {"tag": "p", "text": "Jad Bean, nicknamed \"Scorch,\" was a human male who served in the Galactic Empire as a Death Star Trooper during the Battle of Endor. Bean later served the First Order as a flight instructor, and as the commander of Zeta Squadron, a squadron of TIE/fo space superiority fighters. Even by First Order pilot standards, Bean was very fanatical to the First Order's cause. Bean and his squadron participated in the siege of D'Qar, engaging MG-100 StarFortress SF-17 bombers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "Jad Bean, nicknamed \"Scorch,\" was a human male who lived during the Imperial Era. By 4 ABY, Bean served as a Death Star Trooper of the Imperial Navy on the second Death Star and was situated in a control room. During the Battle of Endor against the Rebel Alliance, Bean was in the room alongside Death Star commander Moff Tiaan Jerjerrod and Lieutenant Endicott."}, {"tag": "p", "text": "After Jerjerrod was ordered by Emperor Palpatine to fire the superlaser and the gunners were ready to fire, Jerjerrod signaled to Bean to fire. Bean reacted to Jerjerrod's command and the battle station fired on the Alliance Fleet, destroying the MC80 Star Cruiser Liberty. Eventually, the Rebel Alliance succeeded in destroying the second Death Star, and the battle resulted in the death of Emperor Palpatine, Darth Vader, and many Imperials."}, {"tag": "h3", "text": "Serving the First Order"}, {"tag": "p", "text": "Bean survived the destruction of the second Death Star and the end of the Galactic Civil War, eventually joining the First Order, a successor military junta of the Empire. Bean, now a First Order TIE Fighter Pilot, rose to the rank of commander and served as Zeta Leader of Zeta Squadron, a starfighter squadron in the First Order military."}, {"tag": "p", "text": "Concurrently, Bean also served as a flight instructor in the First Order. Bean participated in the Siege of D'Qar against the Resistance in 34 ABY, leading his squadron of TIE/fo space superiority fighters against the Resistance's MG-100 StarFortress SF-17 bombers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "During the Battle of Endor, Jad Bean did not hesitate to Jerjerrod's orders of firing the superlaser of the second Death Star. Years later, Bean had risen through the ranks and taught pilots. While serving the First Order, Bean was extremely fanatical to the Order's principles, even by the standards of First Order pilots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jad Bean first appeared in the 1983 original trilogy film Star Wars: Episode VI Return of the Jedi. He was first identified in the 2019 reference book TIE Fighter Owners' Workshop Manual."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}