{"url": "Jade%27s_Fire", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:New Jedi Order starships", "Category:Personal Luxury Yacht 3000s"], "nodes": [{"tag": "h1", "text": "Jade's Fire"}, {"tag": "p", "text": "The Jade's Fire was a highly modified luxury yacht owned by the industrialist Ja Bardrin. However, prior to being owned by Mara Jade, it was named The Winning Gamble. The ship had been upgraded with state of the art weapons tracking systems and a unique shoot back system that would detect the angle of incoming enemy shots and return fire back along the projected route. Mara's later ship, the Jade Shadow, also possessed the special firing system. Ja arranged to have it and his daughter, Sansia, kidnapped so that it could collect sensor data on the defenses of Chay Praysh's headquarters. He then forced Mara Jade to rescue the ship and his daughter, holding the crew of Wild Karrde as hostages."}, {"tag": "p", "text": "When Sansia learned of her father's involvement in the affair upon her rescue and return home, she gave the ship to Mara Jade to jointly compensate for her rescue from Torpris and annoy her father. It became the first ship that Mara would privately own, free and clear, and she renamed it Jade's Fire."}, {"tag": "p", "text": "It consisted of a wide fuselage flanked by two engine nacelles. It was painted orange and red in a flame pattern. A Personal Luxury Yacht 3000, Jade's Fire featured a remote beckon call. The Jade's Fire, piloted by Mara Jade, joined forces with Lando in the Lady Luck, Han Solo and Leia Organa Solo in the Millennium Falcon, and Luke Skywalker in his enhanced X-wing to battle the Sacorrian Triad fleet in the Battle of Centerpoint Station."}, {"tag": "p", "text": "The vessel was destroyed over Nirauan during Luke Skywalker and Mara Jade's attempt to infiltrate The Hand of Thrawn. She achieved this by intentionally crashing her ship into the docking bay there. The ship was of the same class as Lando Calrissian's Lady Luck."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}