{"url": "Jade_Rats", "categories": ["Category:Canon articles", "Category:Articles with conjectural capitalization", "Category:Company stubs", "Category:Criminal organizations", "Category:Thieves"], "nodes": [{"tag": "h1", "text": "Jade Rats"}, {"tag": "p", "text": "The Jade Rats were a gang of thieves active towards the end of the High Republic Era in the Heaven system of the Oplovis sector. Its membership numbered around twenty, and the group was based on a smuggling ship. They plagued the space station Fire with the help of one of its corrupt managers. Around 82 BBY, the Jade Rats, led by their ill leader, the rat king, stole a shipment of enigmatic tenebrae from the Knights of Silver Dawn. Enigmatic tenebrae was the primary raw material needed for a new water-purifying technology, and the Knights' shipment was transported from the planet Earth to Fire in the Heaven system, where it was stolen by the Jade Rats. The thieves then sold it to the Blue Dragon, the most powerful pirate organization in the system, in exchange for enigmatic yellow blood, a substance rumored to grant immortality. While the rat king was skeptical of the rumors, he was willing to try anything to keep himself from succumbing to death; the rat king had already drank nine cycles elixir and charm water in his desperate pursuit of immortality."}, {"tag": "p", "text": "While the Jade Rats had a flawless record of evading capture and defeat, they were betrayed by the Fire station's manager, Zhang Jincheng, and were attacked by the Knights of Silver Dawn, who sought to retrieve their lost shipment of enigmatic tenebrae. After being defeated by the Knights' elite red apricot squad at Stars Pavilion on Fire, the rat king directed the Knights to the Blue Dragon, providing a tracking device leading to the location of the Dragon's stronghold. The Jade Rats also yielded their profits to red apricot squad, allowing them to leave with a large bag of the local currency."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}