{"url": "Jade_Shadow", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Galactic Alliance starships", "Category:New Jedi Order starships", "Category:New Republic starships", "Category:SoroSuub Corporation products", "Category:Yachts"], "nodes": [{"tag": "h1", "text": "Jade Shadow"}, {"tag": "p", "text": "The Jade Shadow was a heavily modified SoroSuub Horizon-class Star Yacht owned by Jedi Master Mara Jade Skywalker, which replaced her previous ship, Jade Sabre."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like thousands of star yachts that cruised the galaxy, the Jade Shadow was built around a sturdy frame that was fairly wide at the engines and tapered off until it reached the narrow, triangular cockpit. Although the ship was equipped with several support features to allow Mara to operate the starship alone, the bridge was designed for a pilot, copilot, and navigator. Above the cockpit was a large, transparisteel canopy that provided breathtaking views of space, and a crystal clear image of hostile starships."}, {"tag": "p", "text": "A pair of retractable Corellian Engineering Corporation AG-1G laser cannons were installed with help from Lando Calrissian and Talon Karrde. The cannons were mounted on turrets which allowed them to have a wide firing arc, and were equipped with stutter-fire capabilities. They also equipped the vessel with two concealed Dymek HM-8 concussion missile launchers, each carrying magazines of eight high-yield missiles. The ship also sported a retractable blaster cannon."}, {"tag": "p", "text": "Many of the Jade Shadow's systems were voice-activated. When piloting the craft, system data was displayed on unobtrusive holograms synced to a retinal tracker, which positioned these readouts just outside the pilot's forward line of sight. All of the weapons systems on board were connected to a central targeting computer that was configured with many different options and settings; one of the most notable was the \"shoot-back\" setting, which directed the ship's targeting computer to automatically shoot down any craft that opened fire on the ship. Mara and her husband, Jedi Master Luke Skywalker, also added an autopilot system, which was programmed with a variety of evasive maneuvers. Captain Han Solo added an advanced long-range sensor suite, complete with port and starboard visual scanners, jamming devices, sensor decoys and false transponder codes, which allowed the ship to slip through defenses without revealing who her true owner was. Mara also added a powerful, albeit costly, holographic communications array that had enough range to send and receive messages from Coruscant to the Outer Rim Territories. Like Mara's previous ships, the ship was equipped with a remote-controlled slave circuit, that could summon it over short distances."}, {"tag": "p", "text": "Han Solo worked to increase the Jade Shadow's speed, fine-tuning the twin ion drives and reworking the hyperdrive to allow speed on par with that of the Millennium Falcon. However, the Jade Shadow's towing capacity was more limited due to her yacht-class drive units."}, {"tag": "p", "text": "Luke and Mara Skywalker reconfigured the aft docking bay to contain her modified Z-95 Headhunter starfighter or even carry an entire X-wing, the preferred starfighter of her husband. The Jade Shadow also allowed for an astromech droid to plug into and fly the ship at a droid station located on the flight deck."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After her previous ship, Jade Sabre, was destroyed on Dantooine during the Yuuzhan Vong invasion of that planet, Mara Jade Skywalker found herself without a ship—but that situation would not last long. Within a few months of the attack on Dantooine, Lando Calrissian gave Mara the gift of a SoroSuub space yacht that he had recently purchased from spice merchants. Calrissian's wife, Tendra, dubbed the ship Jade Shadow because of its non-reflective gray hull. While most star yachts were used for pleasure, in the chaos of the Yuuzhan Vong War, Mara and her allies joined forces to transform an ordinary, utilitarian vessel into a powerful tool for the New Jedi Order. From thereon, the Jade Shadow would remain in Mara's possession as her personal starship."}, {"tag": "p", "text": "During the Dark Nest Crisis, Mara, Luke, and their son, Ben, traveled in the Jade Shadow to Qoribu in an attempt to negotiate peace between the Killik colonies and the Chiss. During the trip, Ben overheard Luke using vulgar language as he fiddled with a malfunctioning R2-D2, to the embarrassment of the elder Skywalker."}, {"tag": "p", "text": "In 40 ABY, during the Second Galactic Civil War, Mara and Luke took the Jade Shadow to Roqoo Depot to confront Sith Lady Lumiya and renegade Dark Jedi Alema Rar. Mara was murdered by her corrupted nephew, Jacen Solo, later that year, and the Jade Shadow remained berthed for the remainder of the war. Two years later, the ship became the mobile home of Luke and Ben after the former was exiled by Chief of State Natasi Daala, and saw action against the resurgent Lost Tribe of Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Fate of the Jedi series the beginning of each chapter contains a picture of the Jade Shadow, the ship that Luke and Ben Skywalker travel in throughout the series.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}