{"url": "Jaden_Korr", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Articles with gameplay alternatives", "Category:Coruscanti", "Category:Galactic Alliance individuals", "Category:Human clones", "Category:Jedi Coalition personnel", "Category:Jedi Knights of the New Jedi Order", "Category:Jedi Sentinels", "Category:Males", "Category:Mechanics", "Category:New Republic individuals", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Jaden Korr"}, {"tag": "p", "text": "Jaden Korr was a Human male Force-sensitive who was accepted to train as a Jedi at Jedi Master Luke Skywalker's Jedi Praxeum on the moon of Yavin 4 in 14 ABY. Assigned as an apprentice to Jedi Master Kyle Katarn, Korr participated in the fight against a newly emerged dark side cult called the Disciples of Ragnos, which sought to resurrect an ancient Sith Lord, Marka Ragnos. Korr undertook multiple missions throughout the galaxy, foiling the cult's plans as best as he could and earning himself a promotion to the rank of Jedi Knight. Eventually, Korr defeated the leader of the cult, Tavion Axmis, on the Sith world of Korriban, stopping the Disciples of Ragnos."}, {"tag": "p", "text": "In 40 ABY, during the Second Galactic Civil War, Korr participated in an attack on the Corellian superweapon known as Centerpoint Station, during which he killed over two dozen people aboard Centerpoint by spacing them, an act he later came to regret deeply. Having struggled throughout his whole life with the feeling of doubt and afraid of his natural affinity for dark side powers, Korr became disillusioned with the Jedi Order and his own role with the Force. He distanced himself from the Jedi and lived in a self-imposed exile on Coruscant until he received a vision from the Force that directed him to a frozen moon in the Unknown Regions. Korr then enlisted the crew of the salvage ship Junker, the Human Khedryn Faal and the Cerean Marr Idi-Shael, to fly him to the moon from his vision. Arriving there, Korr and his companions received a distress signal coming from the surface of the moon and also encountered the ancient Sith dreadnaught Harbinger, as well as Jedi Master Relin Druur. Both Druur and the crew of the Sith vessel had unknowingly traveled five thousand years through time from the Great Hyperspace War."}, {"tag": "p", "text": "While Druur went on his separate path and destroyed the Harbinger carrying the cargo of powerful Lignan crystals, Korr followed his vision and landed on the frozen moon, where he found an abandoned Imperial research facility, in which the Empire's scientists had been conducting experiments on creating clones from combined Jedi and Sith DNA which was authorized by Grand Admiral Thrawn. However, the clones had gone mad and had killed their creators. As the surviving clones escaped from the moon, Korr and the crew of Junker pursued them, with Korr taking on the Force-sensitive Idi-Shael as his apprentice. His experiences on the frozen moon also taught Korr to accept the feeling of doubt as an integral part of himself. Following the clones' trail, Korr also discovered that one of the clones, Soldier, had been produced from his DNA."}, {"tag": "p", "text": "Eventually, Korr and the two scavengers tracked the clones to an ancient Rakatan space station, which had developed its own consciousness and which the clones venerated as \"Mother.\" Aboard the station, Korr and Idi-Shael were ambushed by the Umbaran Nyss Nenn, an agent of the One Sith organization. Korr killed the Umbaran but was in turn killed by the Iteration, another clone of his created by the One Sith and intended to replace Korr in the Jedi Order as their agent. Thanks to Idi-Shael's quick thinking, however, Korr's consciousness was preserved in the Iteration's body; Korr's apprentice used the mindspear device to transfer Korr's memories into the clone, after which Korr and his Padawan escaped from Mother. Korr remained unaware of the transfer that had occurred, and he returned to the Jedi Order, continuing his respectable career."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jaden Korr was a Human male raised on the galactic capital planet of Coruscant by adoptive parents during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. When Korr was just a young boy, his adoptive parents died in a shuttle accident, and his uncle Orn took the boy in and took care of him."}, {"tag": "p", "text": "Korr remembered very little of his adoptive parents, mostly vague details like the smell of his mother's hair, and he knew them mostly through family holographic pictures and video recordings. While living with his uncle, Korr jokingly referred to his caretaker as \"Uncle Orn the Hutt,\" due to the man's obesity and wheezing laugh."}, {"tag": "p", "text": "As an adolescent, Korr accidentally scarred his right cheek with one of his uncle's tools; the scar never properly healed and remained there from that point on. The death of Korr's parents caused him to retreat deep within himself and to become overly philosophical for his age. Over the years, that self-seclusion led to Korr's discovery of his latent Force-sensitivity."}, {"tag": "h3", "text": "Thrawn's experiments"}, {"tag": "p", "text": "In the year 9 ABY, Korr was inadvertently involved in Imperial Grand Admiral Thrawn's experiments with cloning. Thrawn hoped to produce Force-sensitive individuals inside a research facility on a frozen moon in the UR-2212-GR system in the Unknown Regions."}, {"tag": "p", "text": "Supplying the project with the recently discovered Spaarti cloning cylinders as well as DNA samples of various Jedi and Sith, Thrawn tasked the scientists working at the facility with producing clones from the combined DNA to create powerful Force-users to serve the Empire who could wield both sides of the Force effectively."}, {"tag": "p", "text": "Aware of Korr's Force-sensitivity, the Imperials obtained the young Korr's genetic sample, using it to create one of the nine clones, Soldier. Soldier was the latest of the clones produced and was the most stable of the clones, not suffering from the sickness that affected the other clones and caused their bodies to deteriorate if not administered the metacycline drug. Korr was unaware of his clone's creation; Soldier was none the wiser as to the identity of his genetic template, as the clone lived in isolation at the facility, a subject of constant scientific experiments."}, {"tag": "h3", "text": "Arrival at the Jedi Academy"}, {"tag": "p", "text": "In 14 ABY, guided by the Force, Korr went to his uncle's workshop. In a dreamlike state, he used whatever spare parts he could find inside the workshop to construct a working purple-bladed lightsaber, a rare feat for an untrained Force-sensitive. Marveled by the blade he had created, Korr showed the lightsaber to Orn."}, {"tag": "p", "text": "Concerned by Korr now possessing such a dangerous weapon, Orn reported his nephew to the New Republic authorities on Coruscant, and within two days Korr was enrolled into Jedi Master Luke Skywalker's Jedi Praxeum on the moon of Yavin 4 to be trained as a Jedi. After a series of space flights and multiple changes of transports, Korr ended up on the shuttle Yavin Runner II, bound for the Jedi Praxeum."}, {"tag": "p", "text": "During the ride, he met a fellow recruit, Rosh Penin, who was intrigued by Korr's lightsaber and inquired Korr about its origins. Before Korr could answer, their shuttle was shot down by hostile forces as it approached the surface of Yavin 4, although the shuttle pilot managed to crash-land the transport without any casualties."}, {"tag": "p", "text": "However, Korr and Penin were separated from the rest of the group during the crash and could not join the other students, who were escorted to a nearby Massassi temple by the pilot. Skywalker was planning to pick the students up with a shuttle and deliver them to the main Academy site, the Great Temple. Korr and Penin, meanwhile, proceeded to the nearby temple on their own, but they ran into a group of stormtroopers and a darksider wielding a red lightsaber. After Korr defeated the enemies, he crossed a moat surrounding the temple and climbed up one of its alcoves. From that hiding spot, he saw three figures standing at the entrance to the temple, a female and two males. The female was pointing a glowing scepter at the building, linking the two by a beam of pulsing energy."}, {"tag": "p", "text": "However, Korr's eavesdropping efforts were detected, and the mysterious figures turned on him, emanating a bright flash of light from the scepter that knocked Korr unconscious. Upon awakening, Korr witnessed that the three figures were gone. He was reunited with Penin and the other students, who had arrived on site. Korr then met Jedi Masters Kyle Katarn and Skywalker, who had arrived to retrieve the Jedi initiates. The Jedi Masters welcomed their new students to the Jedi Academy and questioned Korr about what he had seen. The incursion by the unknown forces, which bore striking semblance to a Sith cult, worried the Masters, as did the fact that the aura around the temple had become much weaker after the attack."}, {"tag": "h3", "text": "First training exercise"}, {"tag": "p", "text": "Shortly thereafter, Korr and Penin attended Skywalker's welcoming ceremony at the Grand Audience Chamber inside the Praxeum. During the ceremony, Skywalker assigned the new recruits to their Masters. Both Korr and Penin were assigned to Katarn as students, and they were taken to a nearby Jedi training course to be instructed in basic Force abilities such as telekinesis, Force speed and Force sense. Overseen by Katarn, Korr and Penin took separate routes to the finish line of the course. On the way, however, Penin set loose a lightsaber practice droid upon Korr in the hope of slowing him down so he could finish the exercise first, but Korr defeated the machine."}, {"tag": "p", "text": "After they completed the course, Korr became angered at Penin for his actions, but Katarn warned Korr that anger could lead to the dark side of the Force, and Korr accepted Penin's apology, cementing the friendship that had started to develop between them."}, {"tag": "p", "text": "Skywalker then informed the three that he had analyzed a piece of clothing worn by one of the Sith Cultists whom Korr had encountered, discovering that it bore the symbol of Marka Ragnos, an ancient Dark Lord of the Sith Empire who had died more than five thousand years earlier. The Jedi Master told Korr and Penin that they would be assigned on different missions throughout the galaxy and instructed them to look for more information regarding the cult during those missions."}, {"tag": "h3", "text": "Disciples of Ragnos crisis"}, {"tag": "h4", "text": "Teaming up with Chewbacca"}, {"tag": "p", "text": "Having heard that members of the mysterious cult were trying to recruit mercenaries and smugglers on the desert planet Tatooine to transport a special cargo, Skywalker sent Katarn and Korr to investigate the matter. Reaching the city of Mos Eisley aboard Katarn's starship, the Raven's Claw, Korr and his Master discovered the legendary YT-1300 light freighter Millennium Falcon, standing empty in one of the city's hangars."}, {"tag": "p", "text": "Katarn then left to meet his contacts in the nearby Krayt Cantina while Korr guarded the door to the hangar. Korr soon heard blaster fire and lit his lightsaber to face the attackers, but instead it was the Wookiee Chewbacca, the co-pilot of the Falcon, who ran through the door, escaping from a group of mercenaries. The famous Wookiee, who was on the planet for a mission in connection with Chief of State Leia Organa Solo, helped Korr to get rid of the members of the Tatooine underworld that assailed them both, and together they eliminated many of the thugs."}, {"tag": "p", "text": "In an attempt to stop Korr and Chewbacca's advance, the mercenaries then activated tractor beams that prevented the Raven's Claw and the Falcon from taking off. Korr and Chewbacca split up, and while the Wookiee distracted the mercenaries, the young Jedi handled the deactivation of the tractor beams. Upon reaching the tractor beam control room, however, he was confronted by a lightsaber-wielding enemy, a member of the same Sith cult that Korr had previously engaged on Yavin. Korr defeated the opponent and deactivated the tractor beams."}, {"tag": "p", "text": "Korr and Chewbacca reunited and then eliminated the last mercenaries, who had prepared an ambush around the Falcon. It was at that moment that Katarn came back to the hangar, sharing the intelligence he had gathered from his contacts with Korr and the Wookiee. Katarn had learned that the mercenaries were known to take a high price for their services, a fact that led Katarn to suspect the Imperial Remnant in financing the cult. Before the Jedi left, Chewbacca showed his affection for Korr, and Master Katarn instructed the Wookiee to inform Organa Solo of his discoveries."}, {"tag": "h4", "text": "The deserts of Tatooine"}, {"tag": "p", "text": "Korr and his Master were then informed by Skywalker that a Tatooinian moisture farmer had overheard smugglers talking about the cult in a cantina, and had ordered his R5 droid to record it. Having taken flight, the farmer had sold his droid to the Jawa scavengers and had left the planet. Traversing the deserts of Tatooine, the apprentice and his Master attempted to retrieve the R5 unit before the Jawas could erase its memory and sell it."}, {"tag": "p", "text": "Katarn instructed his apprentice to attempt to locate the Jawas sandcrawler in a nearby canyon, while he was collecting information from local farmers. On his way to the sandcrawler, however, Korr bore witness to a Tusken Raider attack on the Jawas. Korr was forced to eliminate the Tusken warriors and snipers located in the canyon before reaching a deserted settlement, inhabited only by a few droids and marauding Tuskens."}, {"tag": "p", "text": "After passing through a tunnel network infested with Tuskens, Korr eventually reached the Jawas' sandcrawler, which had been taken over by the Sand People. Korr managed to penetrate the vessel's hold in search of the droid and defeated the infesting Sand People. As most of the Jawas had been killed in the Sand People attack, Korr believed that there was no one left to negotiate the trade with, so he extracted the droid from the sandcrawler. After dealing with a final Sand People attack outside, Korr reunited with his Master. The droid was delivered to the Academy, where Skywalker's own astromech droid R2-D2 scoured the unit's memory banks for useful information."}, {"tag": "h4", "text": "Incursion on Bakura"}, {"tag": "p", "text": "On another occasion, the authorities of the planet Bakura enlisted the aid of the New Jedi Order when a power plant on the planet had been infiltrated by strangers. After a Bakuran team sent to investigate on the intrusion did not return, Skywalker assigned Korr on a follow-up mission, asking him to wait for Katarn's arrival before dislodging the unknown forces from the power plant. The Jedi were instructed to ensure that the station—built on the crater of a dormant volcano—remained intact, because the awakening of the volcano could destroy a crowded city."}, {"tag": "p", "text": "Arriving on Bakura in his starfighter, the Z-95 Headhunter Far Wanderer, Korr waited for Katarn for an extended period of time on the landing pad. After a while, Korr lost his patience and decided to explore the vicinity of the plant alone. Following a trail of corpses of the Bakuran rescue team, he infiltrated the facility and checked the security system of the plant."}, {"tag": "p", "text": "Korr discovered that the infiltrators, forces of the Imperial Remnant, had placed five bombs at crucial points throughout the facility. In an effort to prevent the sabotage, the young Jedi fought through the Imperial infiltrators equipped with stealth generators, and defused the bombs."}, {"tag": "p", "text": "Fleeing the power plant after having removed the Imperial threat, Korr was attacked by enemy reinforcements that he promptly eliminated as well, before heading to his starfighter. As he was leaving Bakura, Korr received a message from Katarn, who apologized for being unable to come. The apprentice then made his report to Skywalker, who, in turn, had recently discovered that a member of the cult had infiltrated his quarters during the incursion on Yavin 4 and had sliced into his personal records."}, {"tag": "h4", "text": "Answering a distress call"}, {"tag": "p", "text": "Having completed his previous mission, Korr was briefed on another urgent assignment. The Jedi Academy had recently picked up a distress call from a merchant ship, which had been attacked by an Imperial Immobilizer 418 cruiser and had crashed on the planet Blenjeel. Korr was then sent to the supposedly uninhabited planet to rescue any survivors. Once on site, the aspiring Jedi was caught in a storm and several essential pieces of his rescue vessel were damaged by lightning. Having managed to land without too much damage next to the wreck of the merchant ship, Korr attempted to find the survivors of the crash."}, {"tag": "p", "text": "He soon found a single crewmember still alive. The man, however, was devoured before his eyes by the huge worms living in the sands of Blenjeel. With nothing else to achieve on Blenjeel, Korr sought to recover parts of the merchant vessel to repair his own ship and return to Yavin 4."}, {"tag": "p", "text": "The task turned out to be perilous, as the sand creatures tried to eat the Jedi on numerous occasions, but Korr finally managed to find a number of spare parts for his ship: a power converter; an energy cell for the cooling unit, a power coupling for the inertial compensator and a damper for the hyperdrive motivator. He left the planet, and the Jedi Order signaled the dangerous nature of Blenjeel to the authorities of Coruscant so that the planet could be marked as hazardous on the star-charts. A beacon was also installed on the planet, warning visitors to stay away from it."}, {"tag": "h4", "text": "Saving Coronet"}, {"tag": "p", "text": "After reuniting with his Master at the Academy, Korr left with Katarn for the planet Corellia aboard the Raven's Claw, on a mission to investigate reports indicating the presence of members of the Sith cult in the capital, Coronet City. As they flew over the city aboard the Raven's Claw, the Jedi received a distress call from the pilot of a maglev train attacked by the cultists and their mercenaries. Katarn dropped off Korr on the train, while himself engaging the ships of the cult in the skies."}, {"tag": "p", "text": "Korr began to jump from wagon to wagon, eliminating the mercenaries and even several Dark Jedi who barred his way. As he reached the middle of the train, he located a bomb protected by another Dark Jedi, killing the enemy and deactivating the explosive. With the bomb disabled, the saboteurs accelerated the train in order to collide with a nearby train station. To prevent the potential catastrophic damage of such a terrorist act, Korr hurried to the front of the train and proceeded to take over the controls of the vehicle, thus avoiding the deaths of a large number of Corellians."}, {"tag": "p", "text": "Later, Master Skywalker summoned Korr and other available Jedi to inform them on the course of the investigation on the cult. The Jedi Master stated that the person who had sliced into his records had stolen his journal containing the names of places where he had found a very strong connection to the Force. The Massassi temple on which the cultists had used the scepter had also lost its dark side aura, which had been absorbed by the artifact. Worried of what the enemy was planning, Skywalker sent the Jedi to various places mentioned in his journal."}, {"tag": "h4", "text": "Arrival on Hoth"}, {"tag": "p", "text": "Korr was dispatched to the frozen world of Hoth, where Master Skywalker had seen an apparition of his dead mentor, Obi-Wan Kenobi, shortly before the Battle of Hoth in 3 ABY. Upon landing on the planet, Korr could not sense any Force disturbance there, as it had already been drained by the Disciples. Investigating further, he soon found a number of flashing relay beacons."}, {"tag": "p", "text": "Following their trail, he found that Imperials were patrolling the area. Encountering some local tauntaun creatures, Korr climbed on the back of one of the creatures and cut his way through Imperial patrols to a cave, where he encountered a wampa beast. After defeating the wampa, Korr proceeded to follow the flashing beacons placed by the Imperials, and reached an outpost abandoned by the Rebel Alliance during the evacuation from Hoth."}, {"tag": "p", "text": "Before penetrating into the base, the young apprentice had to fight his way through the All Terrain Scout Transports, Viper probe droids and Imperial troopers guarding it, and then he had to eliminate the Imperial soldiers who were patrolling the inside of the outpost. Upon arriving at the exit, Korr was assaulted by a squad of snowtroopers that he killed with an abandoned E-Web heavy repeating blaster."}, {"tag": "p", "text": "He then eliminated the stormtroopers stationed around the wreckage of the Battle of Hoth before reaching Echo Base, whose entrance was blocked. Locating the entrance to series of tunnels dug from underneath the remains of an All Terrain Armored Transport and which the Imperials used to get into the structure, he entered the former base of the Rebellion."}, {"tag": "h4", "text": "Battle with Alora"}, {"tag": "p", "text": "Korr infiltrated Echo Base and passed through the storage room and the infirmary of the base. The Jedi navigated corridors infested with troopers, until he got to the old computer room used by the Rebels. Unnoticed, the Jedi apprentice overheard a Sith cultist talking on a comlink to another Dark Jedi named Alora about the fact that Skywalker had traveled to the planet Dagobah after the Battle of Hoth. Korr then defeated the Cultist and proceeded to go after Alora, the female Twi'lek whom the cultist had been speaking to."}, {"tag": "p", "text": "Korr soon confronted her, while Alora was conversing with her own Master, the mysterious leader of the cult, via a comlink. Alora noticed the Jedi and briefly spoke to him, revealing the cult's name as the Disciples of Ragnos. The two engaged in a lightsaber duel, and though initially evenly matched, Korr soon began to gain the upper hand. Realizing her imminent defeat, Alora escaped through a caved-in section of Echo Base, taunting Korr as she fled."}, {"tag": "p", "text": "Back on Yavin 4, Korr made his report to Skywalker and Katarn, who informed Korr that the Force had not only been taken on Hoth but everywhere Jedi had been sent. The accounts of the mission on Hoth were later documented in Korr and Katarn's datacard report entitled Tauntaun Feathers A1, which was later donated by Skywalker to the New Republic Historical Archive."}, {"tag": "h4", "text": "Hostage rescue"}, {"tag": "p", "text": "In the meantime, Penin had still not returned from his mission to the remains of the planet Byss, prompting Katarn to search for him. Korr, worried for his friend, volunteered to help, but Skywalker instead instructed him to continue with his training, going on various missions across the galaxy. Now a formal Apprentice of the New Jedi Order, Korr also learned a new style of lightsaber combat—either fast or strong—in addition to his medium style. With both Katarn and Skywalker away from the Academy, Korr was given directions by a Jedi Praxeum protocol droid."}, {"tag": "p", "text": "The first assignment took Korr to the planet Nar Kreeta. There, a group of elders from the local Mining Guild had tried to negotiate with a local Hutt crime lord. The elders were instead captured by the Hutt, who claimed that they never visited him in the first place. Katarn, who was nearby on his search for Penin, was available to assist Korr on the mission. Flying him to the Hutt's palace on the Raven's Claw, Katarn dropped off Korr at the entrance to a ventilation system and remained there to pick up the prisoners."}, {"tag": "p", "text": "Covertly making his way into the palace, Korr overheard from the Hutt's guards and learned that the Hutt was using his prisoners in a deadly gambling event, where he pitted them against a rancor creature. Korr located and freed the elders, escorting them back to the Raven's Claw. However, the elders informed the Jedi about three more holding cells containing more prisoners being held by the Hutt. Fighting his way through the Hutt's guards while avoiding the rancor that had been unleashed, Korr liberated the remaining prisoners and escaped with them aboard Katarn's ship."}, {"tag": "p", "text": "Korr was then sent to the planet Zonju V, where he was to meet a spaceport worker in possession of important information regarding the Sith cult. The meeting was to take place in an abandoned outpost three kilometers outside the city of Zoronhed. Purchasing a Flare-S swoop to make his way to the outpost, Korr embarked on the journey there, but he was soon attacked by members of a swoop gang working for the Disciples of Ragnos."}, {"tag": "p", "text": "Evading pursuit, Korr reached the outpost and met with his contact, and the two attempted to take shelter from the gangsters inside the building. They acted too slow, however, and a sniper shot killed Korr's contact before the man could share any important intelligence with the Jedi. Korr made his way through the outpost alone, where he found another swoop parked at the other side. Using the vehicle, he made his way back to safety and left the planet, his mission a failure."}, {"tag": "h4", "text": "Raid on Kril'Dor"}, {"tag": "p", "text": "No sooner had Korr finished with his previous assignment than he was recruited on another mission on behalf of the New Republic. New Republic Intelligence had discovered an Imperial tibanna gas mining facility on the planet Kril'Dor, which was being used to supply the Disciples. A daring raid was planned by General Wedge Antilles, with Korr playing a crucial role, having been recommended for the mission by Skywalker. Korr and Antilles arrived at the facility, with the Jedi landing his Z-95, while Antilles remained in air aboard his T-65 X-wing starfighter."}, {"tag": "p", "text": "Acting on Antilles' instructions, Korr placed targeting beacons at crucial areas of the installation, which included the deflector shield generator, the hangar, the garrison, the communications array, the generator powering the turbolasers, and the command center. Throughout the mission, Korr fought a large number of Imperials, including Imperial jumptroopers and several Sith Cultists."}, {"tag": "p", "text": "Hoping to deny the New Republic their victory, the remaining Imperial forces attempted to destroy the tibanna gas platforms, but Korr successfully disarmed their demolition charges before escaping from the facility, allowing the New Republic to secure the platform and cut the supplies to the Disciples. In the meantime, Skywalker and Katarn continued with their respective missions. Skywalker found out that the cult had been able to siphon the energy from the Dark Side Cave on Dagobah, and Katarn learned that Penin had been captured by the Disciples during his mission on Byss."}, {"tag": "h4", "text": "Apprehending Lannik Racto"}, {"tag": "p", "text": "After receiving reports of illegal assassin droids flooding the Invisible Market, the New Republic contacted the New Jedi Order for someone to Coruscant and capture the criminal Lannik Racto, who was believed to be behind the influx of illegal droids. Korr was dispatched to his home planet to apprehend Racto. Confronting him at a landing pad, Korr was delayed when Racto used explosives to destroy a bridge leading to his office, forcing the Jedi to detour through Coruscant's skyscrapers, whilst fighting mercenaries, assassin droids and Sith Cultists protecting the criminal."}, {"tag": "p", "text": "When Korr finally reached Racto's office, the man sealed himself behind a blast door and activated four assassin droids to kill the Jedi. Korr dealt with the droids and snuck up on Racto, igniting his lightsaber at his throat, forcing Racto to surrender and reveal the location of a droid factory on Nar Shaddaa, which was promptly shut down by the New Republic."}, {"tag": "p", "text": "New Republic Intelligence also intercepted strange transmissions coming from the planet Dosuun. Suspecting them to be linked with the Disciples, the New Republic asked for the Jedi Order's help, and Korr was sent to investigate. Upon arriving on the planet, Korr discovered an Imperial operation led by the human Rax Joris but was ambushed and captured by the enemy. With his lightsaber confiscated, Korr was placed in a holding cell. Joris, bored with his duties, however, would often toy with his prisoners, giving them a chance to escape, only to hunt them down."}, {"tag": "p", "text": "He challenged Korr to make his way out and deactivated the ray shields protecting his cell. Korr made his way through the facility, armed with weapons he procured from enemy troops and even hijacking an AT-ST, until he finally made his way to the hangar where his captured Z-95 was being held. Joris attacked him there with a Stouker concussion rifle, hoping to stop the Jedi from escaping. This backfired however, with Korr killing the Imperial, before retrieving his lightsaber and escaping from Dosuun."}, {"tag": "h4", "text": "Following Penin's trail"}, {"tag": "p", "text": "Master Skywalker recalled Korr and other available Jedi to Yavin 4, informing them that the cult had already siphoned power from every place mentioned in his journal, as well as some that Skywalker had deliberately left out, like Dagobah. Afraid that the Disciples would pierce together clues that would lead them to other places with Force auras, he assigned the Jedi to investigate those secretive locations. The Jedi were instructed to work in pairs to avoid disasters like Penin's capture, with Korr being assigned Katarn as his partner."}, {"tag": "p", "text": "Korr and his Master were sent to investigate the late Lord Darth Vader's Bast Castle on the planet Vjun. Katarn and Korr navigated the wilderness of Vjun, travelling through the acid rain and encountering heavy opposition from members of the Sith cult, including a number of previously-unseen Dark Side Adepts called the New Reborn. Those powerful darksiders were the successor organization to the original Reborn, a group of Force-users previously led by the Dark Jedi Desann in a bid for galactic conquest, before Desann had been slain by Katarn two years earlier."}, {"tag": "p", "text": "The two soon ran into several TIE bombers blocking the way into the castle by making continuous bombing runs, but Korr took them out using a captured turbolaser emplacement. With the bombers cleared, the two Jedi infiltrated the lower levels of the fortress, only to find their way up blocked by a closed door. Korr and Katarn then went through a garbage chute, eventually reaching a room filled with water."}, {"tag": "p", "text": "When Katarn attempted to use a switch to open a closed door, a power conduit broke off from the ceiling, though Katarn held it aloft with the Force to prevent it from falling in the water and electrifying it, which could kill both Jedi. After Korr found a way to pump the water out, the two Jedi went through the hole where the power conduit had been. Upon reaching the castle's power generator, the two redirected the power back into the generator, causing it to explode and creating a passage deeper into the castle. However, Korr and Katarn were separated as a result of the explosion."}, {"tag": "h4", "text": "The fallen apprentice"}, {"tag": "p", "text": "Alone and ahead of Katarn, Korr fought his way through the fortress, finally confronting none other than Penin in Vader's throne room, who was using the Scepter of Ragnos to harness power from Darth Vader's meditation chamber. Penin was accompanied by the Kothos twins, Vil and Dasariah, the two men Korr had seen siphoning the Force from the Massasi temple during the Sith cult's incursion on Yavin 4. Penin had turned to the dark side following his capture, believing that Katarn had been holding him back during his training. He boasted of the power of the dark side to Korr, and—along with the Kothos twins—engaged Korr in battle."}, {"tag": "p", "text": "During the fight, the twins kept using the Force to heal Penin and to augment his dark side abilities. As such, Korr focused first on eliminating the twins, who displayed a variety of dark side powers and were adept at dodging lightsaber attacks. Defeating the twins sequentially, Korr hoped that Penin would stand down without their influence. Nevertheless, Penin continued fighting, causing Korr's anger towards him to build again. After Korr defeated Penin, Katarn finally reached the throne room."}, {"tag": "p", "text": "As Penin lay disarmed on the floor, the leader of the cult, Tavion Axmis—whom Korr had also seen alongside the Kothos twins on Yavin 4—chose to appear at that moment. After rebuking Katarn for sparing her during their previous encounter, Axmis ripped Korr's lightsaber from him with the Force, threw it at the heavy ceiling and brought the weakened ceiling down on the Jedi with the Scepter of Ragnos, before escaping with Penin. Korr was able to use Katarn's lightsaber to cut a hole in the floor for both to escape while Katarn held the heavy rubble aloft with the Force."}, {"tag": "p", "text": "Katarn and Korr returned to the Academy and reported what they had discovered about Axmis. Korr also came up with the theory that Axmis was using the scepter's power to not only absorb Force energy, but to also discharge the energy to empower and corrupt her followers, which Katarn and Skywalker found highly plausible. Skywalker, impressed with Korr's achievements, promoted the young student to the rank of Jedi Knight. Nevertheless, Katarn warned Korr that he felt Korr's anger toward Penin, and despite being a Jedi Knight, he must still beware of giving in to the dark side."}, {"tag": "h4", "text": "The tomb of the Barsen'thor"}, {"tag": "p", "text": "Following his promotion, Korr built a new green-bladed lightsaber to replace the one he had lost on Vjun and became even stronger with the Force, learning the third and final of the combat styles practiced by the New Jedi Order. Now a Jedi Knight, he was deemed worthy to be given more dangerous assignments by Skywalker and Katarn, in their continuing efforts to stop the Disciples."}, {"tag": "p", "text": "When the officials of the planet Chandrila contacted the Order for assistance, Korr was dispatched as a Jedi Order representative. On Chandrila, the Disciples of Ragnos had discovered the tomb of an ancient Jedi Master, the famous third Barsen'thor of the old Jedi Order, and they attempted to secure it in preparation for the arrival of Axmis, who intended to harvest its Force aura."}, {"tag": "p", "text": "Traversing through the ancient tomb, located among the deep chasms of the area called the Crystal Canyons, Korr confronted numerous cultists, although Axmis herself was not yet present. Navigating the crumbling passages of the tomb, Korr reached the resting place of the Jedi Master. Using his Force-sense ability, Korr revealed a pair of hidden panels in the walls surrounding the coffin. Pushing those buttons with the Force, Korr sealed the sarcophagus, but doing so triggered a cave-in. Korr barely escaped from the tomb as it was buried forever, ensuring that the ancient Jedi's remains would be safe from outsiders."}, {"tag": "p", "text": "Meanwhile, Katarn continued his investigation on the cult, discovering that Axmis had procured the Scepter of Ragnos from a collector on the planet Commenor, whom she had then killed. Korr next ventured to Taanab, where a freighter captain had reported seeing Sith Cultists in the Taanab Spaceport. Upon arriving there, Korr witnessed the cultists releasing a mutant rancor, intending to unleash it upon a nearby city and use the chaos to steal credits and supplies. However, the act backfired upon the Disciples, as the rancor attacked everything in sight, including them. Luring the rancor to a conveyor belt, Korr trapped it between a ray-shielded door and a large cargo container, killing it."}, {"tag": "h4", "text": "Mission to Yalara"}, {"tag": "p", "text": "After dealing with the tense situation on Taanab, Korr was dispatched on another mission. Jedi librarian Tionne had discovered the whereabouts of the planet Yalara from a Jedi holocron. The planet was said to be inhabited by a primitive species, the Yalarans, who were not yet ready to be integrated into the galactic community. Because of that, an ancient Jedi, Broden Kel Verdox, had installed a cloaking device on Yalara, hiding the planet from the rest of the galaxy. However, the Order learned that the Disciples had found Yalara and had sent forces to capture the cloaking device. Afraid to let such a powerful machine fall into enemy hands, Skywalker sent Korr to Yalara to secure it or destroy it, if needed."}, {"tag": "p", "text": "On the planet, Korr confronted not only a large number of unified Remnant and Disciples forces, but also a third party, the Noghri Death Commandos, who were fighting for control of the cloaking device. Battling his way to the top of the complex containing the device, Korr destroyed it as he realized he could not secure it, returning to the Praxeum after doing so. Skywalker believed that his father, the late Darth Vader, had long ago sent the Noghri to kill the Yalarans and guard the cloaking device. With the device destroyed, the surviving Noghri were relocated to their homeworld of Honoghr."}, {"tag": "h4", "text": "Encounter with Boba Fett"}, {"tag": "p", "text": "Since Penin had never completed his mission to the remains of Byss, the Jedi Order never learned if Axmis had managed to obtain the power from there. As such, Korr and Katarn were dispatched to the destroyed planet, where they confirmed that Axmis had already been there. As they prepared to leave, however, the Raven's Claw was caught in the tractor beam of an Imperial Dreadnaught-class heavy cruiser and was brought aboard the ship. Splitting up, Katarn—familiar with the layout of such ships from his days at the Imperial Academy—went to trigger the ship's self-destruct mechanism, while Korr fought his way to the tractor beam controls, disabling the beam holding the Claw."}, {"tag": "p", "text": "In order to make a clean exit corridor for the Raven's Claw, Korr manned one of the dreadnaught's turbolaser turrets, destroying some of its TIE fighter escorts. Korr then returned to the Raven's Claw and met up with Katarn, who had successfully sabotaged the Imperial ship. The two escaped from the dreadnaught moments before it exploded, taking the remaining fighters with it."}, {"tag": "p", "text": "Korr was then dispatched to Ord Mantell, where a large weapons stockpile had been found unattended. In hopes of preventing the weapons from falling to the enemy, Korr was tasked with destroying the weapons."}, {"tag": "p", "text": "After he destroyed one of the caches, however, he was confronted by the bounty hunter Boba Fett, who had an agenda of his own. Fett offered Korr a chance to leave the planet, but Korr refused, and the bounty hunter attacked him. Evading fire from Fett, Korr destroyed all the remaining weapons caches. He then made his way back to his Z-95 and defeated Fett in combat, forcing the hunter to retreat."}, {"tag": "h4", "text": "Rescuing a friend"}, {"tag": "p", "text": "Skywalker then recalled Korr to Yavin, having uncovered the cult's ultimate goal. Skywalker believed that Axmis was planning to use the power stored in the scepter to resurrect Marka Ragnos, the ancient Sith Lord after whom the Cult was named. Skywalker then assembled the Jedi for an all-out attack on the Sith graveyard world of Korriban, the resting place of Ragnos. However, before embarking on the mission, Katarn informed Korr that he had received a message from Penin, who claimed to have repented of his actions and wished to rejoin the Jedi Order but was being held captive on the planet Taspir III."}, {"tag": "p", "text": "Korr suspected that Penin might be leading them into a trap, but Katarn was willing to take the risk if it meant saving his other student. Korr and Katarn therefore detoured to Taspir III to rescue Penin from the cult. Once there, Katarn dropped Korr of at a landing pad near the power plant where Penin was supposedly being held, while he took the Raven's Claw to approach from another direction, believing that the two had better chances to complete the mission if they split up."}, {"tag": "p", "text": "Navigating through the multiple levels of the plant, Korr encountered Alora, who taunted him, claiming that Penin had fully embraced the dark side. Pursuing Alora through automated conveyor belts, Korr finally reached Penin, but at the sight of him seemingly unharmed, his anger rose, believing that his former friend had lured him into a trap. Alora, who stood on a balcony above them and watched, thought Korr's feelings could drive him to the dark side, and she tried to amplify his rage to gain a new ally and make him kill Penin. Penin became afraid of Korr's growing anger and admitted to him that that he had fallen due to his fear. He also reminded Korr that anger was the path to the dark side."}, {"tag": "p", "text": "Katarn also contacted Korr mentally, urging him to forgive Penin. The combined words of his friend and his mentor allowed Korr to let go of his anger, realizing he had let it control him, and he did not attack Penin. With her gamble having failed, Alora attacked Penin herself, slicing off his left arm, and engaged Korr in battle. Since their last encounter, Alora had trained extensively to avenge her defeat on Hoth and was now wielding two lightsabers simultaneously, however Korr was able to defeat her in battle, killing her. When Katarn caught up with his students, he commended Korr for not giving into the dark side, but Korr gave the credit to Penin for having reminded him of the dangers of anger."}, {"tag": "h4", "text": "Confronting the Sith Lord"}, {"tag": "p", "text": "Leaving Penin in the care of Katarn, Korr flew to Korriban, where he joined up with Skywalker's Jedi strike force to stop the cult once and for all. Assisted by his fellow Jedi, he fought numerous Disciples of Ragnos and Remnant forces throughout the Valley of the Dark Lords and finally reached the Tomb of Marka Ragnos, where he confronted Axmis before she could resurrect Ragnos. Axmis, believing that by killing Korr she would convince Katarn of his failure as a Master and would bring her old nemesis over to the dark side, fought with fury and hatred, using the Scepter of Ragnos in addition to her lightsaber to boost her advantage."}, {"tag": "p", "text": "Axmis used the weapon to fire beams of energy at the Jedi, while also using her Force powers to create earthquakes. However, Korr was able to overcome the Dark Jedi's assault and defeated her, though Axmis refused to surrender. She used the scepter on a statue of Ragnos, resurrecting his spirit, who possessed her. Ragnos revealed that the scepter doubled as a holster for a Sith sword, and he fought Korr with the weapon."}, {"tag": "p", "text": "The possessed Axmis was bolstered by the power of the Sith sword, which kept replenishing her energy and made her invulnerable for short periods of time. Despite her advantage, Korr defeated her and destroyed the scepter, causing Ragnos to leave Axmis's body, vowing to have his revenge another day. Axmis's body could not withstand the corruption and died shortly thereafter. Korr left the tomb and used his lightsaber to seal it forever."}, {"tag": "p", "text": "He was joined by Skywalker and Katarn on the steps of the mausoleum, who commended him on his efforts and proclaimed him a true Knight of the Order. New Republic reinforcements arrived at Korriban, destroying an Imperial-class Star Destroyer in orbit of the planet and defeating all Remnant forces allied with the cult. With the scepter destroyed, the remaining Disciples of Ragnos lost their power and were soon rounded up. Back at the Jedi Praxeum, Korr visited Penin, who had received a new prosthetic arm and was recovering after his brush with the dark side. Katarn and Skywalker then came in, informing Korr that the threat of the Disciples of Ragnos was gone and asking Korr to be ready for more missions as a valuable member of the Jedi Order."}, {"tag": "h3", "text": "Knight of the New Jedi Order"}, {"tag": "p", "text": "Korr continued to serve the New Jedi Order and the New Republic in the decades that followed, seeing the end of the Galactic Civil War and participating in the war against the extra-galactic Yuuzhan Vong invaders. During the war, in 27 ABY, Korr was on a mission when his homeworld of Coruscant fell to the Yuuzhan Vong. He later learned that his uncle Orn had been killed in the battle."}, {"tag": "p", "text": "Following the end of the war in 29 ABY, Korr's former Master Katarn disappeared while investigating the region of space called The Cloak of the Sith. Korr teamed up with Katarn's longtime partner, Jan Ors, in her search for Katarn. They spent every spare moment searching for any clues indicating where Katarn could have been."}, {"tag": "p", "text": "Eventually, a team of Jedi Knights and Alpha Blue agents—assembled by Ors and Luke Skywalker's wife and Katarn's one-time apprentice Mara Jade Skywalker—located Katarn, captive of the fallen cyborg Jedi Knight Daye Azur-Jamin. The team freed Katarn and attempted to redeem Azur-Jamin, who informed them that he had been corrupted by a Force-sensitive female Yuuzhan Vong and that she likely had a master."}, {"tag": "h3", "text": "Declining Mastery"}, {"tag": "p", "text": "Korr's successes as a Jedi earned him the trust of the Masters of the Jedi Council, who offered him a promotion to the rank of Jedi Master. However, filled with doubts, Korr refused the offer, because he did not feel himself ready. At some point, Korr also returned to Vjun, where he successfully retrieved his first lightsaber, and he kept it mostly as a memory, rarely using it in place of his current one."}, {"tag": "p", "text": "In 40 ABY, a conflict known as the Second Galactic Civil War broke out, initially fought between the Galactic Federation of Free Alliances—the New Republic's successor state—and the Confederation led by Corellia. However, as it became apparent that the Galactic Alliance Joint Chief of State, Jacen Solo, had fallen to the dark side, Grand Master Skywalker rebelled against his nephew's regime, distancing the Jedi Order away from the Alliance. Korr followed Skywalker and became a member of the newly formed Jedi Coalition. Around this time, Jedi Master Tionne documented Korr's campaign against the Disciples of Ragnos in her work titled Jedi vs. Sith: The Essential Guide to the Force."}, {"tag": "h3", "text": "The infiltration of Centerpoint"}, {"tag": "p", "text": "When Jacen Solo—who had secretly taken the name Darth Caedus and had become a Dark Lord of the Sith—attempted to capture Centerpoint Station, a superweapon owned by the Corellians, Skywalker decided to foil his nephew's plan. A strike team of Jedi, led by Jedi Master Kyp Durron and Doctor Toval Seyah was assembled with the purpose of infiltrating the station and sabotaging it, preventing it from falling into Solo's hands. Korr was a member of the strike team, and, donning the uniform of the Galactic Alliance Guard, Solo's secret police, boarded the troop transport Broadside."}, {"tag": "p", "text": "Arriving in the Corellian system in the midst of the Battle of Centerpoint Station between the Confederation and the Galactic Alliance, the forces of the Jedi Coalition joined the fray. While Skywalker led another group on a separate mission to rescue the young Chume'da Allana, the Broadside flew straight to the station, under staged fire from the Jedi Rakehell Squadron, as part of the ruse of the Broadside being a part of Solo's force. The tactic worked, and the transport was allowed to land safely aboard Centerpoint."}, {"tag": "p", "text": "When the shuttle landed, the strike team split into several groups and proceeded to advance to different areas of the station, fighting through both the Confederation and the Galactic Alliance forces. Korr was given command of one of the groups and received orders from Durron to advance quickly and leave no enemy forces behind. During the mission, Korr and his team encountered stiff resistance from the Confederation and Corellian sympathizers. After a short battle, the soldiers and several members of the station's crew retreated into a cargo hold, blocking off the Jedi's way."}, {"tag": "p", "text": "Left without the time to force them out or negotiate a surrender, Korr opened the hold to space, killing the soldiers and civilians alike, more than two dozen people in total. Meanwhile, Durron and Seyah successfully sabotaged the station, and Korr and the strike teams retreated to the Broadside, escaping shortly before the station's destruction. Although the mission was a success, Korr would later reflect on his actions with doubt and remorse, feeling guilt for killing so many people over politics, despite having followed the orders of a fellow Jedi."}, {"tag": "h3", "text": "Discovering the Community"}, {"tag": "h4", "text": "A vision from the Force"}, {"tag": "p", "text": "Months later, in 41 ABY, the Second Galactic Civil War had ended. Korr had exiled himself from his friends and fellow Jedi, living in a Coruscant apartment outside the Jedi Temple with only his astromech droid R6 as his companion. One night, however, he received a vision from the Force. In the vision, Korr found himself on the surface of a frozen moon near a blue ringed gas giant in the Unknown Regions, surrounded by the voices of Jedi and Sith, most of them dead, calling his name."}, {"tag": "p", "text": "One of the voices, belonging to the deceased Mara Jade Skywalker, told him to seek answers in the \"black hole on Fhost.\" Korr then heard a voice calling for help and witnessed an explosion in the sky that rained down dark side energy, leaving him sickened. As his consciousness drifted back into reality, Korr felt perplexed by the instructions given to him by Jade Skywalker in his vision, since he knew that there were no black holes anywhere near the planet Fhost. He asked R6 to search HoloNet for any star systems like the one he had seen in a vision, but the search returned no results. Hoping to find answers that would bring him peace of mind, Korr took the Far Wanderer and R6 and left for Fhost without informing the Jedi Order."}, {"tag": "p", "text": "Upon his arrival, Korr landed at Farpoint, the sole city located on the planet, built on the remains of a crashed starship, where he learned of the existence of the Black Hole cantina. While staying at the cantina, Korr heard rumors that the crew of the salvage vessel Junker had stumbled on an automated distress beacon in the Unknown Regions, in a star system whose description sounded similar to the one from his vision. Convinced that the scavengers would lead him to his goal, Korr waited for Junker's captain, Khedryn Faal, in the cantina on Fhost, posing as a scrap dealer from the Core Worlds."}, {"tag": "p", "text": "When Faal arrived at the cantina, Korr approached him and attempted to use a mind trick on Faal in order to secure passage aboard his ship. He was interrupted by Faal's first mate, the Cerean Marr Idi-Shael, who urged Faal to partake in a sabacc game with fellow scavenger Reegas Vance. Korr agreed to wait until the game was over and observed it from his table. Faal lost the data crystal containing the coordinates of the moon to Vance, but he still remembered the coordinates and was intent to get to the star system first, causing Vance to agree to a double-or-nothing round for the exclusive rights to the coordinates. Sensing that the game was rigged in Vance's favor, Korr used the Force to help Faal win the crystal back, causing one of Vance's cronies, Earsh, to accuse Faal of cheating and start a brawl. In the ensuing fight, Korr was forced to kill Earsh and then helped the crew of the Junker escape from the cantina to their parked swoop bikes and make it back to their freighter."}, {"tag": "h4", "text": "Meeting Druur"}, {"tag": "p", "text": "The spacers agreed to bring Korr to the frozen moon of his vision for a sizable monetary reward, but since Faal did not tolerate droids, Korr was prevented from bringing R6 aboard. Korr then contacted his droid, whom he had left at the Far Wanderer, telling him to take the Z-95 to orbit and wait for him for two weeks; if Korr did not return by that point, R6 was instructed to return to Coruscant and inform Grand Master Skywalker of Korr's whereabouts. Korr also discovered that Idi-Shael, a mathematical savant, was in fact Force-sensitive. The Jedi and the crew of Junker arrived at the system and picked up the distress call coming from the frozen moon."}, {"tag": "p", "text": "Soon thereafter, they witnessed the arrival of an unknown vessel, and Korr felt a dark side aura emanating from it, which he identified as Sith. Something then attached itself to Junker, and Korr, sensing that an intruder was trying to get aboard, rushed to confront that person. The object that attached itself to the hull of the salvage ship turned out to be an escape pod. It's sole occupant—a man who was missing one arm and looked sick—attacked Korr with an archaic lightsaber, with a powercord attached to a battery pack on his belt. After a brief duel, Korr and the intruder sensed that neither of them was Sith; they were both Jedi."}, {"tag": "p", "text": "The man was named Relin Druur, and he was a Jedi Knight from a different time period. Five thousand years prior, during the Great Hyperspace War, Druur had tried to stop the Sith starship Harbinger, captained by his Padawan-turned-Sith Saes Rrogon. After losing his arm in a duel with Rrogon, Druur sabotaged the ship's hyperdrive—exposing himself to fatal doses of radiation which would soon kill him—before taking the escape pod, causing the dreadnaught to misjump five thousand years through time, pulling the pod with it."}, {"tag": "h4", "text": "Descent on the moon"}, {"tag": "p", "text": "Druur was determined to finish his job and destroy the Harbinger, which carried aboard a cargo of powerful Lignan crystals that could amplify dark side powers and which Korr recognized as the source of sickness in his vision. Korr felt Druur falling to the dark side in his anger over the death of his other Padawan, Drev Hassin, who had perished in the initial attack on the Harbinger. Druur in turn felt Korr lost in doubt, and they both agreed that they had to go separate ways to deal with the issues plaguing them. Aboard the Harbinger, Rrogon also realized what had happened, and he sent several Blade-class starfighters to destroy Junker and kill Druur."}, {"tag": "p", "text": "Since Faal's ship had no weapons equipped, Korr used the Force to help him pilot the freighter through the belts of debris orbiting the gas giant, while Druur manned the rear mounted tractor beam to pick up massive rocks from the debris field and redirect them into the pursuing Blades. Faal then jettisoned the contents of Junker's cargo hold so that they created an explosion when they collided with the rocks, causing the remaining Blades to believe that the salvage vessel had been destroyed and to report back to the Harbinger."}, {"tag": "p", "text": "After convincing the crew of Junker that the Force had brought them all to the moon, the two Jedi decided that Idi-Shael would fly Druur into the Harbinger's landing bay to destroy the ship, while Faal would land Korr on the moon using a small Starhawk shuttle, Flotsam, attached to the scavenger vessel. After landing on the moon and following the distress beacon, Korr and Faal discovered Thrawn's secret research facility. By investigating the facility and managing to restore some of the old recordings, they learned that the clones had gone mad. They had managed to find parts to create lightsabers and had killed all the scientists and stormtroopers. Faal suggested leaving the moon at once, but Korr was too obsessed to turn around and told Faal to leave while he continued alone to the lower levels of the installation. Although initially hesitant to leave Korr alone, Faal's self-preservation instinct convinced him to walk away."}, {"tag": "p", "text": "Hoping that clones who could use both the dark and light sides like himself would provide him with answers to his dilemma, Korr advanced through the site of the carnage until he reached a Spaarti cloning cylinder—made into an altar for someone the clones called \"Mother\"—which the clones had filled with the remains of the scientists and stormtroopers. There, he encountered Alpha, a clone of Jedi Master Kam Solusar, who informed him that the clones would use Korr's ship to leave the moon."}, {"tag": "p", "text": "The two fought until Alpha took three fingers off Korr's right hand with his lightsaber, leaving only the thumb and the forefinger and causing Korr's lightsaber to get lost in the cloning tank. Alpha then tried to drown the Jedi in the waste filling the cloning cylinder. Faced with fear of death, Korr briefly unleashed Force lightning upon Alpha, but he realized just in time that he had let the dark side swell in him. Right when Alpha was about to deliver the killing blow, Korr pulled out his purple-bladed lightsaber and killed the clone by stabbing him through the chest."}, {"tag": "h4", "text": "Attaining clarity"}, {"tag": "p", "text": "Exhausted, Korr left the cloning cylinder only to run into Kell Douro, an Anzat assassin and an agent of the One Sith organization, whom Korr had first unknowingly encountered at the Black Hole cantina on Fhost, where Douro had been posing as a drunken spacer and had bumped into Korr. Having lost sight of the Jedi during the brawl inside the cantina, Douro had followed him from Fhost to the frozen moon, believing that he would find revelation by consuming a Jedi's brain material. Too weak to fight back, Korr was assaulted by Douro but was saved by Faal, who had returned to help his friend and who killed Douro with a blaster shot to the head. With his other lightsaber nowhere to be found, Korr picked up Alpha's weapon and left the station with Faal, heading toward Flotsam. On the surface of the moon, they witnessed the assassin's CloakShape fighter Predator landing beside them, the remaining Community of clones and their children, ten beings in total, aboard."}, {"tag": "p", "text": "Believing that the clones would not kill them, Korr promised to hunt them down should they escape from the moon and turned his back to them. The clones indeed did not kill the Jedi, instead leaving the moon, right as the Harbinger was destroyed. The clones took the CloakShape through the scattered remains of the Lignan crystals in the atmosphere of the moon, which greatly amplified their powers but also accelerated the sickness, which was caused by the genetic instability that the clones experienced."}, {"tag": "p", "text": "Korr and Faal then witnessed Junker, piloted by an injured Idi-Shael, approaching the surface. Korr and Faal found Idi-Shael unconscious inside the ship, and they tended to his wounds. When the Cerean awoke, he told his companions that Druur, having fully embraced the dark side, had killed himself to destroy the Harbinger. He also related Druur's last words to Korr, that there was no certainty, just the search for it, and the danger was only when one thought that he had found the certainty. Korr realized that he could not rid himself of doubt, but he should rather embrace it."}, {"tag": "p", "text": "He accepted that his role as a Jedi personally involved the acceptance of doubt. He suspected that his Master had known this all along and that his ordeal with his new friends was designed to teach him that lesson. Korr, Faal, and Idi-Shael then decided to hunt the remaining clones together. Idi-Shael, having also explored some of his Force-sensitivity with Druur aboard the Harbinger, asked Korr to take him on as an apprentice. Believing Idi-Shael to be too old for training, Korr decided that he would need to ask permission from Grand Master Skywalker first."}, {"tag": "h4", "text": "Pursuit of the clones"}, {"tag": "p", "text": "After leaving the frozen moon, Korr privately contacted Grand Master Skywalker to get further instructions. Apologizing for not informing him of his departure, Korr told Skywalker everything about his doubts, his journey to the frozen moon, the encounter with Druur and the discovery of the clones. Master Skywalker, though concerned with Korr's action in not leaving a flight schedule, told him to destroy the clones if they proved to be beyond the hope of saving. Skywalker promised to send help to deal with the clones, but he was afraid the reinforcements would not arrive soon enough. Skywalker also gave Korr approval to train Idi-Shael in the ways of the Force. Korr then returned to his friends, discovering that Idi-Shael had already put his mathematical talent to good use and had charted an approximate area of the Unknown Regions where the clones could have gone."}, {"tag": "p", "text": "Korr, however, decided to start their search by going back to the Fhost system. On their way, Korr informed Idi-Shael that he was now his apprentice, and the two proceeded into the freighter's cargo hold. There, Korr gave Idi-Shael his original purple-bladed lightsaber, making him disassemble and reassemble the weapon to learn its inner workings. He then sparred with the Cerean using Alpha's lightsaber and trained Marr in the deflection of blaster bolts, teaching his apprentice how to use his mathematical genius to calculate the correct angles of attack and deflection. Telling his apprentice to keep the lightsaber, he made his way into one of the passenger cabins with the one he had claimed from Alpha, where he used the Force to cleanse the clone weapon's crystal of impurities."}, {"tag": "p", "text": "In doing so, Korr removed any traces of the dark side from the crystal, which was also turned from red to yellow. Idi-Shael later informed Korr that he believed that the clones did not deserve to be hunted and asked his Master why they could not just let them go free, but Korr—having witnessed the carnage at the facility on the frozen moon—was intent on stopping the escapees."}, {"tag": "h4", "text": "Enter Soldier"}, {"tag": "p", "text": "As they reached the planet Fhost, Korr received a distress call from R6, who was still aboard the Far Wanderer in orbit of the planet. The droid informed him that a medical facility in Farpoint was under attack, all clues indicating that the attackers were the escaping clones. Korr realized that the clones were sick and that they intended to capture a medical supply ship to procure medicine to combat their condition, so he ordered Faal to land Junker on the roof of the medical facility, while Idi-Shael raised a schematic of the hospital. Once their ship made contact with the roof, Korr planted one of the transponder beacons, which the scavengers used to mark their findings to track them later, onto a parked medical supply ship, and he and Idi-Shael separated in order to block off any means of escape via the roof and intercept the clones as they made their way upstairs."}, {"tag": "p", "text": "As Korr made his way down the west stairwell, he heard the sounds of a commotion three floors below him. Korr used the Force to jump down and informed Idi-Shael of his whereabouts. Korr then engaged one of the clones, Runner, the clone of Kyle Katarn, knocking him unconscious, before being attacked by another clone, Soldier. After more than thirty years since the Empire had taken a DNA sample from him without his consent, Korr finally discovered that there existed a clone of himself, which shocked him. The other three clones present at the scene were Seer, whom Korr recognized as the clone of the dead Dark Lady of the Sith Lumiya; the red-haired female Hunter, who was unconscious and was being carried by her comrades; and the young girl Grace. The rest of the clones who had left the frozen moon had succumbed to their genetic sickness and had died by that point."}, {"tag": "p", "text": "Korr's surprise at the discovery of Soldier's identity left a hole in his defense, which Soldier exploited, hurtling him into a wall. Soldier and Runner, who had come to his senses, then assaulted Korr with blasts of the Force from two sides, forcing Korr to channel all his powers to resist the attacks. While the two clones nearly overwhelmed him, he was able to combat their powers with his own, and Seer was forced to enter the fight in order to overpower his Force defenses. Korr ultimately could not handle the onslaught and gave way to the clones' powers, and Soldier blasted him with Force lightning, injuring him. As Runner moved in to execute him, Korr, on the edge of his consciousness, blocked Runner's killing strike, only to have the clone kick him in the face and send him flying down the next landing of the stairs. Preparing for a follow-up attack, Korr rose up to his feet, but a misstep caused him to fall even further down the stairs."}, {"tag": "h4", "text": "Battle in open space"}, {"tag": "p", "text": "The clones chose not to pursue the Jedi and escaped. A few minutes later, Idi-Shael discovered his Master lying unconscious and helped him to the roof of the facility, only to find out that Faal was missing. The two found the captain and the first mate of the medical ship, who informed them that Faal had saved the crew of the ship when he had forced them to evacuate the ship before the clones captured it. However, the clones had taken Faal, intending to learn from him how Korr had been able to find them. Korr and Idi-Shael then departed Fhost aboard Junker, but not before picking up R6 from the Far Wanderer."}, {"tag": "p", "text": "With the tracker aboard the medical supply ship, Korr and Idi-Shael were able catch up to the transport in a star system with two gas giants, where they were hailed by an Umbaran who identified himself as Nyss Nenn, another agent of the One Sith. Claiming that he had taken control of the clones' ship, he demanded Korr to take a hardsuit and fly alone toward the medical ship to trade himself for Faal. If Korr refused to comply, Nenn would kill Faal."}, {"tag": "p", "text": "Korr was forced to agree to the terms and exited Junker into open space, when he was contacted by Faal, who informed the Jedi that he had already escaped from the ship with Grace's help, and he was currently located inside one of the two escape pods that had just launched from the medical ship. The second escape pod carried Nenn aboard, who had himself escaped from the transport after Soldier and Seer—the only two clones still alive after the Umbaran had killed Hunter and Runner—had taken back control of the medical ship."}, {"tag": "p", "text": "Once Korr and Faal were at the midpoint of the ships, another vessel entered the fray, a scout flyer piloted by the Umbaran's sister, Syll Nenn, who fired at Faal's pod. In a split second, Korr reached out with the Force to pull Faal's pod out of harm's way. A second shot was fired, but this time Korr grabbed onto the pod's antennae for purchase and used the Force to guide his lightsaber as it met with the projectile and redirected it back to the ship's cockpit."}, {"tag": "p", "text": "The impact killed Syll, just as Nyss returned to the scout flyer and fled. Korr's usage of the Force applied too much stress to his hardsuit, causing it to tear and allow oxygen to vent, resulting in Korr nearly losing his consciousness, but he was quickly dragged back inside Junker by Idi-Shael. Korr, Faal, and Idi-Shael made their way to the cockpit, and Faal sent the freighter into hyperspace in pursuit of the clones, following the beacon still planted aboard their ship."}, {"tag": "h4", "text": "Aboard Mother"}, {"tag": "p", "text": "The moment their ship came out of hyperspace, Korr and his companions saw a system containing a pulsar, two tide-locked planets and an asteroid belt of unnatural origin. Korr and Idi-Shael speculated that the asteroid belt had been created as a result of the destruction of a device belonging to an ancient civilization, like the Celestials or the Rakatan Infinite Empire, and that the system's star had been turned into a pulsar in the process. Korr then had R6 send a message to the Jedi Order, notifying its members of his discoveries up until that point."}, {"tag": "p", "text": "The system was filled with radiation coming from the pulsar and appeared lifeless, leading Faal to believe that the clones had gotten away, but Korr felt a disturbance in the Force and directed Faal to fly toward the space between the two planets. On the dark side of the nearest planet, they found a massive space station that was emanating dark side power. The station, organic in composition, was connected to the planet below by a long tether. Believing the station to be Rakatan in origin, judging by its dark side aura, Korr witnessed the medical supply ship docked with it. Approaching the station, Korr and Idi-Shael used Flotsam in order for them to dock with the station, deeming it too dangerous for Faal to go there and relegating him to fly Junker to a safe distance."}, {"tag": "p", "text": "Once the shuttle docked with the station, Korr and his apprentice continued their pursuit of the clones. Along the way, the station, seemingly self-aware, appeared to have sensed the presence of the Jedi, as corpses of various sentient beings, reanimated with the power of the dark side, were appearing before them, ready to kill the two. Korr and Idi-Shael ignited their lightsabers and took their stand against the impending danger."}, {"tag": "p", "text": "After the confrontation, the pair used separate kilometer-long shafts to descend to the planetary levels of the station; they proceeded further and further on, even as the aura of the dark side grew. With little warning, Nenn, who had also infiltrated the station, attacked Idi-Shael and Korr with a vibroblade, using his unique gift to block the pair's connection with the Force. The Cerean was attacked first and was knocked out, then Nenn turned to Korr, heavily injuring him. However, the Umbaran stopped to speak a code word in a language unfamiliar to Korr. Judging by Nenn's reaction, the word was meant to have some kind of effect on the Jedi. When the phrase did not work, Korr used Nenn's confusion to launch a surprise melee attack and, after a brief fight, he strangled the Umbaran to death."}, {"tag": "h4", "text": "The apprentice's secret"}, {"tag": "p", "text": "After the scuffle, Korr passed out due to loss of blood and was approached by the Iteration, another clone of himself, brought aboard by Nenn and created by the One Sith with the purpose of replacing Korr as an inside agent within the Jedi Order. The clone stuck the device called the Rakatan mindspear into Korr's brain, filling it with Korr's memories and killing Korr in the process. The clone intended to transfer those memories later into his own brain to update the information he had already had on Korr's life. Idi-Shael, however, came to his senses and fought against the clone, but was soon disarmed. Korr's apprentice, however, was able to incapacitate the clone with his bare hands."}, {"tag": "p", "text": "Realizing that his Master's body had no pulse, Idi-Shael acted on instinct and used the mindspear to transfer Korr's memories into the clone, before the Iteration was completely ready to accept them. In doing so, the Cerean hoped that instead of fulfilling the Iteration's plan he would have his Master be reborn in the Iteration's body. In an effort to hide the events that had transpired, Idi-Shael dressed the Iteration in Korr's clothes, hid Korr's body and severed three fingers from the Iteration's hand to match Korr's injury. After about a few minutes, Korr woke up from his unconscious state and pulled himself up off the ground."}, {"tag": "p", "text": "He initially did not remember anything about who he was, but Idi-Shael soon called him out, and his voice caused the memories to flood Korr, with the exception of the last few moments of his life. Korr did not remember himself dying, believing that he had been merely knocked unconscious by the Umbaran. However, Korr did notice that his three missing fingers had started to bleed, and he wondered why the wound had opened again. Idi-Shael, meanwhile, was taken hostage by Soldier, who wished to escape from the station with Grace."}, {"tag": "p", "text": "Soldier was disillusioned with Seer's promises to meet \"Mother\"—the consciousness of the Rakatan station that had been calling the clones from the time they had first heard it on the frozen moon—after witnessing Mother killing Seer. Seeing that Soldier did not harm Idi-Shael when he had the chance and hearing that Soldier had not personally killed any innocents on Fhost, Korr believed Soldier's intentions, and the four—Korr, Idi-Shael, Soldier and Grace—attempted to make their way back to Junker. As they made their escape, Korr also noticed that his apprentice behaved himself strangely, seemingly feeling cautious of his Master. However, they were soon confronted by Seer, her body inhabited by Mother and covered in organic filaments peeling away from the walls of the station. After a fierce fight, Korr barely managed to wound Mother."}, {"tag": "h4", "text": "The escape"}, {"tag": "p", "text": "Realizing that they were no match for the entity, Korr, Idi-Shael, Grace and Soldier hurried to escape from the station. On their way, they were contacted by Faal via comlink, who had ventured inside the station in an effort to warn them about Nenn, but had been knocked unconscious by the Umbaran. Hoping to destroy the station, Korr directed Faal to the still docked medical supply ship, instructing him to set its systems on overload, deducing that the explosion of the ship as large as the medical transport would take out the entire station."}, {"tag": "p", "text": "Faal did as instructed, and Korr, Idi-Shael, Soldier and Grace took the organic lifts back up to the space portion of Mother, still pursued by the maddened entity, and they met Faal there. Stating that Grace needed medicine to combat the genetic instability, Soldier told Korr that he would attempt to get some from the medical ship before it exploded, and they would then escape aboard Nenn's ship, docked near the medical transport. Korr agreed to that plan, and Soldier took Grace and parted ways with his genetic template. Korr, Idi-Shael and Faal ran to the docking bay, raising R6 on the comm, as Mother also went up the lifts and continued her pursuit. The droid prepared Junker for takeoff, and when everyone was aboard, R6 sped away from the station."}, {"tag": "p", "text": "The ancient space station was then destroyed, taking Mother's new body with it. Soldier and Grace had also been able to escape, hoping to find a safe haven to live out the rest of their days in peace. As Korr made his way to the confines of the freighter, he presented his report to the Jedi Order and then cleaned himself up. However, as he was about to shave, Korr noticed that the facial scar he had gotten when he was a young child had vanished. Korr looked at himself in the mirror, at where his scar once was, and he then wondered why Idi-Shael had been acting strange since their departure from the station."}, {"tag": "h3", "text": "Jedi madness"}, {"tag": "h4", "text": "The Force psychosis"}, {"tag": "p", "text": "After the events on the Rakatan space station, still living in the Iteration's body, Korr eventually returned to the Jedi Order. Two years later, in 43 ABY, a mental disease called the Force psychosis struck the Order. Among the Jedi affected were Bazel Warv and Yaqeel Saav'etu, and arrest warrants were issued against them by the government of the new Galactic Alliance Chief of State Natasi Daala. Acting Grand Master Kenth Hamner—who had taken the title after Skywalker had been exiled by Daala for not preventing Jacen Solo's fall to the dark side—called a meeting of the Council to discuss how to proceed with the arrest warrants."}, {"tag": "p", "text": "Korr was stationed outside the High Council Chamber alongside a Human male and a Mon Calamari female apprentices by order of Hamner, with explicit instructions not to let anyone in while the discussion took place, especially Leia Organa Solo and her husband, Han Solo. Korr was warned by Hamner that the two could be very persuasive. Indeed, the couple soon arrived in the foyer to the chambers, and Korr initially upheld his mandate to bar entrance to everyone. However, as Solo pulled Korr aside to inform him that an attack on the Temple by Mandalorian Supercommandos hired by Daala to carry out the arrests was imminent, Organa Solo forced her way past the apprentices."}, {"tag": "p", "text": "Believing that the Council needed to hear the Solos' information, Korr was intent to let them pass anyway. Jedi Master Corran Horn and Grand Master Hamner expressed their displeasure with Korr's decision to let the Solos interrupt the Masters, who had already decided not to hand over the Jedi and smuggle them offworld instead."}, {"tag": "h4", "text": "Battle at the Krabbis Inn"}, {"tag": "p", "text": "Later, Korr, along with Jedi Knight Avinoam Arelis, were assigned by the Masters to help the Solos with moving Saav'etu, Warv, and two more affected Jedi, Seff Hellin and Natua Wan. The Jedi attempted the move in a lower level hangar in the Temple district, using tranquilizer darts to subdue Hellin, Wan, and Saav'etu and placing them into stasis beds aboard a FloatVan airspeeder to be transported to the planet Shedu Maad in the Hapes Cluster."}, {"tag": "p", "text": "However, Warv, a hulking Ramoan, was resistant to tranquilizers, so he had to be restrained and escorted to the FloatVan while being conscious. In order to prevent Warv from escaping, Korr and a number of other Jedi carried ysalamiri creatures that were able to block an individual's connection with the Force. The Solos had found out that the Mandalorians hired by Daala were stationed in the nearby Krabbis Inn, and Han requested Korr and Arelis to help them against a possible Mandalorian attack, while the other Jedi continued to try moving Warv. When discovered, most of the Mandalorians tried to escape in order to hide their ties with Daala, while five Supercommandos attacked the Solos as a distraction."}, {"tag": "p", "text": "Korr and Arelis each engaged one Mandalorian, who were equipped with lightsaber-resistant armor made from beskar iron. Four of the Mandalorians were killed, but when only one was left standing, he was suddenly attacked by Warv, who had escaped from custody. Warv grabbed the Mandalorian and, surprisingly for Korr and the Solos, demonstrated a unique ability to phase through solid matter, bypassing the armor completely and killing the Mandalorian with his bare hands—an ability that had developed as a side effect of the Force psychosis. After the fight was over, Warv, still delusional, refused to go to the Hapes Cluster, and Korr and his companions were prepared to subdue him."}, {"tag": "p", "text": "However, Jedi Knight Raynar Thul arrived at the scene, and together with Organa Solo, they were able to convince Warv to load aboard the FloatVan. As the Solos prepared to leave with the sick Jedi, Korr and Arelis agreed to stay behind and cover up the mess before the Galactic Alliance Security. When questioned about the skirmish, the two maintained that the Solos were not present there. Korr and Arelis also lied about not knowing how the Mandalorian with the intact armor had died, in order to hide the fact that a psychotic Jedi possessed such powerful abilities."}, {"tag": "h3", "text": "Sith return"}, {"tag": "p", "text": "Later, while investigating a rise in the Black Sun criminal organization activity, Korr found evidence of the existence of a cult that venerated Prince Xizor, the long-dead onetime leader of the organization. In a holographic communication to Grand Master Hamner, Korr reported his discovery. When Hamner asked him if it was possible that Xizor might be alive, Korr responded that he had yet to find any evidence indicating that. Korr suggested, however, that if a member of the Black Sun had managed to acquire a tissue sample of Xizor, they could have cloned the Prince, and Hamner ordered Korr to follow up on the issue."}, {"tag": "p", "text": "The next year, Korr was tasked with investigating increasing pirate activity throughout the galaxy, his efforts mostly focusing on the middle Hydian Way. During his investigation, Korr charted maps of the pirate attacks in the region. Jedi Knight Jaina Solo referred to his reports and Korr's maps in her briefings to the Jedi Council. It was eventually revealed that the majority of those pirate raids were being performed by members of the newly rediscovered Lost Tribe of Sith, who were stealing ships for their fleet for an upcoming invasion of the galaxy. The Sith successfully infiltrated the highest ranks of Galactic Alliance government for a time, but they were eventually driven out by the Jedi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Physical appearance"}, {"tag": "p", "text": "Jaden Korr was a tall—taller than Faal by an entire head—brown-haired Human male with light skin and slender face with narrow, angled features and a hatchet nose. He had piercing deep-set gray eyes, which Faal found intense and haunted when Korr was obsessed with his vision. By the time of his encounter with the clones, Korr appeared to be around forty years old, by Faal's estimation. He preferred to keep his hair short, but he had let his facial hair grow out by 41 ABY, and he styled it in a neatly trimmed goatee, similar to the one worn by his former Master, Kyle Katarn."}, {"tag": "p", "text": "The encounter with Alpha cost Korr three fingers on his right hand. He initially considered to replace them with prosthetics, but he then decided to keep his hand maimed as a constant reminder of the price he had paid to rid himself of his fear of doubt."}, {"tag": "p", "text": "After transferring his consciousness in the Iteration's body, Idi-Shael did not tell his Master about his original body's death, and Korr believed that he had been merely knocked unconscious. However, he did find it strange that his hand injury had reopened, and he noticed that his apprentice was more cautious of him. He later discovered the scar on his cheek he had had from his youth was also missing."}, {"tag": "h3", "text": "An eternal thinker"}, {"tag": "p", "text": "As a result of his adoptive parents' deaths, Korr grew up as a detached, overly philosophical child, traits that led to his discovery of his connection with the Force. Those qualities transitioned even into Korr's adult life, and he was considered by his peers to be overly serious and staid, always lost in his thoughts and looking for hidden meaning in everything."}, {"tag": "p", "text": "Due to his philosophical nature, Korr was struggling with doubt throughout his entire life, which led him to decline the promotion to the rank of Master, as he felt himself not ready for the responsibility. The feeling of doubt only intensified after the mission to Centerpoint Station. Thinking that it was wrong to kill the Corellians who merely fought for their planet's independence, Korr felt soiled by his participation in the battle and the actions he had committed during it. Believing that killing over politics made the Jedi Order no different from the Sith, and that justifying the atrocities by claiming that they had been done in the name of the light was wrong, Korr became plagued by doubt about his role in the Force."}, {"tag": "p", "text": "Taught by Katarn that the Force was merely a tool, Korr found it hard to accept it as nothing more than that, as that would invalidate the entire concept of the light and dark sides. Korr instead viewed the Force as a moral compass that guided him through his life, and he was afraid of using dark side powers, which he seemed to have an uncanny affinity for. Feeling that there was no one in the Order who could understand him, Korr distanced himself from the Jedi."}, {"tag": "h3", "text": "Coming to terms with doubt"}, {"tag": "p", "text": "Believing that by following his vision he would receive the answers to his questions, Korr embarked on his quest, which led him to meet Faal, Idi-Shael, and eventually Druur. When he met the ancient Jedi, Korr considered him somewhat of a kindred soul, feeling that his obsession with stopping Rrogon was similar to his own doubts about the Force. The two individuals agreed that Korr's vision had led them all to meet together aboard Junker, but they were meant to walk their own paths after that."}, {"tag": "p", "text": "After his experiences on the frozen moon and after hearing Druur's final words relayed to him by Idi-Shael, Korr finally found the answer to his moral dilemma. Believing that his vision quest was never meant to rid him of doubt but instead was meant to teach him to embrace it, Korr accepted the feeling. He believed himself unique among other Jedi, thinking that for him, there was no light side or dark side, there were only beings of darkness and beings of light. Doubt was a crucial part of Korr's personality, and it was the thing that kept him in balance, preventing him from tipping over to either of those extremes."}, {"tag": "h3", "text": "A career Jedi"}, {"tag": "p", "text": "As a Jedi apprentice, Korr was a steadfast learner, who followed his Master's directions and spent a lot of time studying. At the Jedi Praxeum, Korr studied diplomacy and history, among other topics. Korr was particularly versed in ancient galactic history, learning about the powerful species that had once dominated the galaxy, like the Celestials and the Rakata, finding it highly plausible that the Infinite Empire could have possessed technology powerful enough that its destruction could turn stars into pulsars. Korr knew about the existence of the Massassi species, and he was surprised to find bodies of several members of the species aboard Junker after Idi-Shael returned from the Harbinger."}, {"tag": "p", "text": "Korr was also knowledgeable of the course of the Great Hyperspace War and Jedi Master Jorus C'baoth's madness that had led to the failure of the Outbound Flight Project. Korr felt that he was discovering something new every day and believed that the never-ending process of learning made the path of a Jedi both challenging and rewarding. He was used to things not going according to plan and tended to improvise his way out of tough situations. Occasionally, that improvisation went hand in hand with a fair amount of disobedience, such as when Korr did not follow Katarn's orders to wait for him on Bakura and proceeded with the mission alone."}, {"tag": "p", "text": "As an apprentice, Korr received high praise from Chewbacca on his skills, after successfully defeating the mercenaries on Tatooine. After dealing with a number of major threats, like the Disciples of Ragnos and the mad clones, Korr was considered a valuable member of the Jedi Order, his achievements valued by fellow Jedi, including Grand Master Skywalker. Although some other Jedi, like Kyp Durron, did not like Korr's overly serious attitude, they still respected the career he had made as a Jedi."}, {"tag": "h3", "text": "Moral compass"}, {"tag": "p", "text": "Korr always strove to uphold his orders, and he was ashamed that he had disobeyed Hamner's instructions by letting the Solos pass into the Council chambers. However, he also felt that his disobedience was justified, since he believed that the Council needed to listen to what the Solos had to say. Furthermore, Korr fully expected the couple to find a way to gain entrance anyway. Later, Korr was willing to lie to the Galactic Alliance Security to cover up the Solos' escape."}, {"tag": "p", "text": "Korr was always trying to prevent unnecessary loss of life. As an apprentice, he was unwilling to hurt the wampas that he ran into on Hoth, but he was forced to do so when the creatures attacked him. During the skirmish at the Black Hole cantina on Fhost, Korr chose to disarm Vance's Weequay bodyguards, but he was later forced to kill Earsh by stabbing him through the skull, and he regretted taking the gangster's life. When attacked by the Mandalorian commandos, Korr intentionally held back, trying to force the Mandalorians to surrender instead of killing them."}, {"tag": "h3", "text": "Views on the Community"}, {"tag": "p", "text": "After discovering the facility on the frozen moon and witnessing the carnage created by the clones, Korr was determined to stop them at all costs, even if it meant killing them. His apprentice Idi-Shael, on the other hand, believed that the clones, as sentient beings, deserved a chance to live their lives. Although Korr thought that people could change and believed in the possibility of redemption, having previously witnessed the cause of Penin, he also believed that by killing so many innocent people the clones had passed beyond their chance at self-determination."}, {"tag": "p", "text": "Korr was surprised that one of the escaping clones was a clone of himself, having no explanation for how Thrawn's scientists had managed to obtain a genetic sample from him before he had even joined the Praxeum. While chasing the clones at Farpoint's medical center and meeting the captain and the first mate of the supply ship, Korr was in a hurry to explain his motivations to the pair. Therefore, he only told them that the beings who had taken their ship were the \"bad guys\" and he and Idi-Shael were the \"good guys.\""}, {"tag": "p", "text": "Later, while leaving the medical center in pursuit of the clones, Korr witnessed the supply ship's first mate waving him a goodbye. The man's gesture was heartwarming to Korr and reaffirmed his belief that he was, indeed, \"a good guy.\" During the events aboard the Rakatan station, Korr decided to let Soldier go free, believing the clone's words that he would not harm anyone and would care for Grace."}, {"tag": "h3", "text": "Attachment to personal belongings"}, {"tag": "p", "text": "Korr appreciated the beauty of certain things. He was marveled by the purple-bladed lightsaber he had created as a child and was amazed by the Crystal Canyons on Chandrila that contained the tomb of the Barsen'thor. He was attached to some of his personal belongings, flying his trusty Z-95 Headhunter, the Far Wanderer, as of 41 ABY, even though the craft was severely outdated by that point. Korr also developed an affection for his astromech droid, R6, finding it hard to leave him behind on Fhost as he departed for the frozen moon."}, {"tag": "p", "text": "After retrieving his first lightsaber from Vjun, Korr also kept it with him at all times, keeping it in his apartment on Coruscant as a good-luck charm and carrying it attached to a clip at the small of his back while in the field. He eventually decided to give his first lightsaber to Idi-Shael, as a symbolic gesture that signified Korr of letting go of his past."}, {"tag": "h3", "text": "Relationships"}, {"tag": "h4", "text": "Family"}, {"tag": "p", "text": "Korr remembered little of his adoptive parents, only minor details, like the smell of his mother's hair, a scent like that of wildflowers. Korr fondly remembered his uncle Orn, whom he gave the nickname \"Uncle Orn the Hutt,\" due to his obesity. After Orn's death, Korr had no family left, and he found it odd how destiny unfolded for him to be practicing the Jedi tenets of non-attachment not by choice but by circumstances."}, {"tag": "h4", "text": "Friendships"}, {"tag": "h5", "text": "Rosh Penin"}, {"tag": "p", "text": "During his training, Korr befriended Penin, and when his friend had gone missing, he was worried for him and volunteered to participate in the search for him. However, he did find it irritating that Penin always tried to surpass him in training. Korr was disappointed to find that Penin had gone to the dark side, and when he confronted the unharmed Penin on Taspir III, he believed that the fallen apprentice had led him into a trap. Korr nearly let his anger take the better of him, but Penin and Katarn's warnings about the dangers of the dark side allowed him to hold back and spare his fellow apprentice."}, {"tag": "h5", "text": "Khedryn Faal and Marr Idi-Shael"}, {"tag": "p", "text": "One major outcome of Korr's vision quest was his meeting with Idi-Shael, who requested to become his apprentice. Taken aback at first, Korr asked permission from Grand Master Skywalker to teach the Cerean. Skywalker agreed, believing that Idi-Shael would make a good student for Korr, despite his age. Idi-Shael and Faal eventually became Korr's close friends, with Faal even saving Korr's life on the frozen moon by deciding to come back after him and killing Douro."}, {"tag": "p", "text": "The influence of the two scavengers allowed Korr to ease up a little, cracking an occasional joke and adopting the spacers' affinity for caf—sometimes stretched with a hint of alcoholic pulkay—and chewstim. Korr was protective of his newfound friends, especially Faal, who was not a Force-sensitive, and as such, was more vulnerable in Korr's opinion to the adversaries they were trying to stop. Korr was willing to trade himself to Nenn to save Faal, and he usually instructed the scavenger to stay behind on Junker while he and Idi-Shael handled things, although Faal tended to disobey the Jedi's orders."}, {"tag": "h4", "text": "Fellow Jedi"}, {"tag": "p", "text": "Overall, Korr respected Katarn's training, believing that it had allowed him to become the Jedi that he was and to overcome the Disciples of Ragnos. Years later, he still remembered Katarn's teachings fondly, and he found it unfortunate that his duties prevented him from seeing his former Master more often, and he intended to remedy that after dealing with the clones. He also respected Grand Master Skywalker, finding that no matter how many years had passed, he always felt himself a student when talking to him, and the very notion to address him by his name rather than his title, which Faal demonstrated, seemed incongruous to him. It also saddened him to learn of Mara Jade Skywalker's death."}, {"tag": "p", "text": "In his communication to the Grand Master after the events on the frozen moon, Korr found great relief in telling Skywalker everything that had plagued his mind, and he felt more himself after the conversation, a fact that did not escape Skywalker's eyes. Korr also had some sort of affectionate relationship with the young Jedi Valin Horn, who had participated in the mission to Centerpoint Station, and he regretted distancing from him. Korr was also acquainted with Jedi Lassin, who died shortly after the Disciples of Ragnos crisis. Lassin was one of the Jedi whom Korr saw in his vision."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "h3", "text": "Force powers"}, {"tag": "h4", "text": "Telekinesis, Force speed and jump"}, {"tag": "p", "text": "Korr first experienced his connection with the Force when he was just a young man. The experience was comparable to a feeling of unadulterated joy that suddenly filled him. The Force then guided Korr's actions as he created his first lightsaber, although he did not remember the actual construction process. After joining the Jedi Praxeum, Korr continuously improved his Force abilities, becoming an advanced practitioner of Force Jump, Force speed, Force sense and telekinesis. He demonstrated a remarkable level of telekinesis when he used the Force to push down a large pillar in order to make a bridge during the battle on Korriban, as well as to move large boulders to clear his way in the Barsen'thor's tomb on Chandrila and push heavy crates to open passages during his other missions."}, {"tag": "p", "text": "He demonstrated Force jump on the frozen moon, using it to make his way through otherwise unreachable portions of the facility. On Fhost, he used the Force to jump three flights of stairs and land safely on his feet. He was capable of knocking Runner unconscious by Force-shoving him against the wall, and he was able to combat the combined powers of Runner and Soldier, only giving in when Seer joined the onslaught."}, {"tag": "p", "text": "Korr was able to hurl concentrated blasts of the Force at his opponents as well as to resist similar applications of the Force. Korr employed Force speed to rescue Faal's escape pod, slowing down his perception of time to give him a window of opportunity to react to Syll Nenn's shots and move the escape pod away from the line of fire."}, {"tag": "h4", "text": "Mind control and Force sense"}, {"tag": "p", "text": "Korr was able to sense that the Harbinger was crewed by Sith and later detected Druur attempting to infiltrate Junker. He felt that Druur's aura, while still that of a Jedi, was tainted with the dark side, which ultimately led to the ancient Jedi's complete fall to it later. In general, Korr's Force sense ability was exceptionally developed, and he was able to detect both living beings and inanimate objects from far away."}, {"tag": "p", "text": "In the case of living beings, Korr's abilities also allowed him to sense their attunement to the light or the dark side. Inside the Barsen'thor's tomb, this ability allowed him to reveal the switches that sealed off the ancient Jedi's resting place. Korr could even sense how his own presence felt, experiencing it as the presence of a light side user who was tainted by something, which proved to be his feeling of doubt."}, {"tag": "p", "text": "Korr was able to influence the minds of other beings with the Force, and he tried to use the technique to influence Faal in order to convince him to listen to him during his first meeting. Faal, born to survivors of the Outbound Flight Project and therefore familiar with Jedi and their powers, later asked Korr to never attempt a mind trick on him again. Sensing that Vance was using some kind of device to influence his hand during the sabacc match that won him the data crystal, Korr was able to use the Force to allow Faal to get the winning combination of cards during the rematch round."}, {"tag": "p", "text": "Korr was also able to sense whether a person was telling the truth through the Force, and he attempted that technique on Han Solo—whose mind was easier to read than his wife's since he was not a Force-sensitive—when confronted near the Jedi Council chambers. For Korr, the dark side felt like rage manifested in its purest form, although the presence of Mother, while dark, was more subdued. He felt the influence of the Lignan crystals from far away, and the feeling was so intense that it caused him to experience nausea."}, {"tag": "h4", "text": "Dark side powers"}, {"tag": "p", "text": "Korr's most peculiar trait was his capacity for mastering both light and dark-side oriented Force powers, especially Force lightning. When he felt angered or afraid, Korr tended to uncontrollably produce a powerful, green-colored variation of Force lightning. Korr's Master, Kyle Katarn, who also displayed similar feats through his use of Force lightning and Force choke, told his student to embrace that trait. Katarn taught Korr that the Force was inherently neither light nor dark, and one could use the powers traditionally affiliated with either side."}, {"tag": "p", "text": "According to Katarn, transcending the constant desire to categorize things would lead Korr to a deeper understanding of his own role in the Force. Unlike Katarn, Korr was for the longest time plagued with doubt over his ability to utilize dark side techniques, questioning his identity as a Jedi. Each time Force lightning cracked at the tips of his fingers, he felt as if his hands were betraying him and he had to restrain himself from using it during his fight with Alpha."}, {"tag": "p", "text": "However, after reaching the end of his vision quest, Korr accepted what his Master had been trying to tell him all along. He knew that he would never fall to the dark side, as he knew it too well. From that point on, Korr felt secure in his knowledge that he would always have control of his powers and would never subconsciously summon lightning from his fingers anymore."}, {"tag": "h4", "text": "Other Force techniques"}, {"tag": "p", "text": "Having been taught by Katarn how to protect his mind from the influence of the dark side, Korr could shield himself from it by imagining in his mind an impenetrable fortress with the Force acting as the walls, and he himself was the inner \"sanctum.\" Using the technique caused the dark side to no longer affect his body, although he still felt it as pressure in his mind."}, {"tag": "p", "text": "He was also able to perform, to a high degree, an advanced application of the Force that allowed him, through deep meditation, to cleanse and purify certain objects, like lightsaber crystals, from the influence of the dark side. When Idi-Shael asked his Master why he could not apply the technique to the clones, Korr admitted that living beings were far too complex for the technique to work on them."}, {"tag": "h3", "text": "Lightsaber mastery"}, {"tag": "p", "text": "Korr was highly skilled with a lightsaber, echoing his master's swordsmanship. At first, he utilized the medium style but eventually mastered both the fast and strong styles. In his later years, even though he carried two lightsabers, Korr tended to favor using only one lightsaber in combat. He was evenly matched with Druur, a trained Jedi Master, but he was overwhelmed by the maddened assault of Alpha, whom he barely killed."}, {"tag": "p", "text": "He demonstrated masterful use of the lightsaber when defeating Alora, Axmis and the spirit of Ragnos, in addition to multiple other adversaries, including the Sith Cultists and the New Reborn. Korr was adept in fighting multiple lightsaber and Force-wielding enemies, even up to a three-on-one match, as demonstrated by his duel with Penin and the Kothos twins. He was also able to hold his own against the famed bounty hunter Boba Fett, an experienced Jedi killer. He was more than a match for trained Mandalorian Supercommandos, even while holding back his fighting skills."}, {"tag": "p", "text": "Korr was proficient at deflecting blaster shots with his weapon, using that technique many times during the Disciples of Ragnos crisis and later during the brawl at the Black Hole cantina and during his training with Idi-Shael aboard Junker. He was even able to deflect shots from small spacecraft, such as Nenn's scout flyer. Korr was able to use the blade of his lightsaber to absorb and contain Force lightning directed at him, which he then could throw back at his opponent."}, {"tag": "p", "text": "He was able to manipulate his lightsaber with the Force, using the technique to cut the rocks at the entrance to Ragnos's tomb in order to seal it. During his mission to Zonju V, he proved to be an adept swoop rider and demonstrated his mastery of mounted lightsaber combat both during that mission, using the technique to battle the gangsters attacking him, and the mission to Hoth, fighting the Imperial forces from atop a tauntaun."}, {"tag": "h3", "text": "A skillful combatant"}, {"tag": "p", "text": "Korr's Force proficiency and lightsaber skills allowed him to defeat a large number of adversaries during his career as a Jedi, ranging from mercenaries to Sand people; Imperial stormtroopers, infiltrators and saboteurs; assassin droids; Noghri commandos; monstrous rancors; and a variety of darksiders, including the Community of maddened clones."}, {"tag": "p", "text": "During the Disciples of Ragnos crisis, Korr fought various types of Sith Cultists, who wielded lightsabers or blasters in addition to various Force powers. He also defeated a large number of New Reborn, including a handful of highly skilled Reborn Masters. His most notable adversaries during that time included the Kothos twins, Alora and Tavion Axmis, as well as the spirit of Marka Ragnos himself. Korr also had several run-ins with Mandalorians, surviving an encounter with the bounty hunter Boba Fett early on in his career and later fighting Mandalorian Supercommandos on Coruscant."}, {"tag": "h3", "text": "Other talents"}, {"tag": "p", "text": "Korr was a highly skilled pilot, and frequently flew his Z-95 Headhunter, the Far Wanderer. Korr was adept at using the Force to help him pilot a vehicle, which he demonstrated by piloting Junker through the gas giant's heavily dense rings of rubble. The technique, however, was very taxing on Korr, both physically and mentally, and he could not perform it for long periods of time."}, {"tag": "p", "text": "When the Raven's Claw was towed into an Imperial dreadnaught by a tractor beam, he also was shown to be at least a moderately skilled gunner, as he had to destroy some flying TIE fighters with a turbolaser. Korr also used mounted weapons during his other missions, using a turret to destroy TIE bombers on Vjun and using abandoned E-Web blasters on Hoth. Korr was somewhat skilled in demolitions, being able to diffuse bombs planted by his adversaries on multiple occasions."}, {"tag": "p", "text": "Korr was very skilled in unarmed combat, a skill that allowed him to defeat and kill Nyss Nenn while injured, even though Nenn himself was a formidable combatant. He was also able to understand Shyriiwook to at least some extent as demonstrated when he met Chewbacca, and he had a minimal understanding of droidspeak that allowed him to grasp the general meaning of what R6 was trying to say to him. At some point in his life, long before the mission to the frozen moon, Korr underwent training in zero-gravity maneuvers, and he knew how to operate a hardsuit. He was also a moderately skilled mechanic, able to repair his transport on Blenjeel using scrap found from the wreck of the merchant transport."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Lightsabers"}, {"tag": "p", "text": "Throughout his lifetime, Korr wielded three different lightsabers. His first lightsaber was created from spare parts in his uncle's workshop and was powered by a striated violet-colored crystal to produce a thin but powerful purple blade, which Korr found beautiful. The fact that he had managed to construct a functional lightsaber was a great feat for Korr and brought him to the attention of Skywalker. Korr used that lightsaber throughout his training under Katarn, only parting with it once, when it was confiscated from him by Joris on Dosuun, but he soon retrieved it during his escape. That lightsaber was later lost during the events on Vjun. After his promotion to Jedi Knight, Korr constructed a replacement lightsaber, a green-bladed weapon with a short, one-handed hilt. He used that lightsaber to defeat the Disciples of Ragnos, and it remained as his primary weapon for years, even after recovering the purple-bladed one from Vjun."}, {"tag": "p", "text": "The second lightsaber was lost in combat with Alpha on the frozen moon, when it flew into the Spaarti cloning cylinder. Korr replaced the lost weapon with an unstable, red-bladed lightsaber taken from Alpha, giving his original lightsaber to his apprentice. Alpha's weapon was crude, lacking an auto-off switch, but it was otherwise similar in design to Korr's first lightsaber, and it could even work in the vacuum of space. When he purified Alpha's lightsaber crystal, it turned from red to yellow. Korr recognized that the color in ancient times identified the lightsaber's user as a Jedi Sentinel, a branch of Jedi that strove to find balance between combat and the search for knowledge. Believing that the change in color was influenced by him thinking of Druur during the cleansing procedure, Korr found the new color fitting of his own nature."}, {"tag": "h3", "text": "Other equipment"}, {"tag": "p", "text": "In addition to the lightsabers he wielded at different points of his life, Korr also carried a DL-44 heavy blaster pistol as a backup weapon. Occasionally, Korr would arm himself with a number of other projectile, explosive, and energy weapons, including a DXR-6 disruptor rifle, a Wookiee Bowcaster, an Imperial Heavy Repeater, Destructive Electromagnetic Pulse 2 ion carbine, FC-1 flechette launcher, Stouker concussion rifle, PLX-2M portable missile launcher, thermal detonators, laser trip mines and detonation packs. He also employed personal energy shields while out on missions and used medpacs to quickly heal his injuries."}, {"tag": "p", "text": "Korr utilized a hyperdrive-equipped Z-95 Headhunter named the Far Wanderer, which was colored yellow-and-white as of 41 ABY, to get from planet to planet when not flying with Katarn aboard the Raven's Claw or employing other transport, like on Zonju V, where Korr purchased a Flare-S swoop bike. He was quick to learn controls of other craft as well, able to operate Imperial AT-ST walkers and piloting both Junker and Flotsam on several occasions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "Jaden Korr was created as the playable character for the 2003 video game Star Wars: Jedi Knight: Jedi Academy, developed by Raven Software and published by LucasArts. In the game, the male Korr was voiced by Philip Tanzini and the female Korr was voiced by Jennifer Hale. Hale, a prolific Star Wars voice actress, praised the character, finding Korr to be well-written and interesting."}, {"tag": "p", "text": "The character went relatively unreferenced in the Star Wars Legends continuity for several years, aside from brief mentions in The Dark Forces Saga, a series of web supplements for the Star Wars Roleplaying Game published on the Wizards of the Coast website, and a number of reference books recounting his actions during the course of the Jedi Academy game."}, {"tag": "p", "text": "Korr made his second in-universe appearance in the 2007 novel Legacy of the Force: Fury by Aaron Allston, albeit in a minor non-speaking cameo, mentioned as one of the Jedi present during the infiltration of Centerpoint Station. In 2009, Korr played a larger role in Fate of the Jedi: Abyss by Troy Denning, appearing in two chapters and having a few speaking lines. On January 26, 2010, Korr received a starring role in Crosscurrent, written by Paul S. Kemp, which took place in the gap between Fury and Abyss and expanded upon Korr's appearance in the former novel. In 2011, a sequel to Crosscurrent, titled Riptide, was released, authored by Kemp as well."}, {"tag": "h3", "text": "Author comments"}, {"tag": "p", "text": "Although Kemp had never played Jedi Academy himself before writing the novels, he did a lot of research on Korr's character and the Star Wars setting before writing Crosscurrent through material provided to him by the Del Rey publishing house, message boards and Wookieepedia. Kemp conceptualized the novel as the intersection of fates of two Jedi, one on his way toward the dark side, the other on a journey to achieve deeper understanding of his role in the Force and the light side."}, {"tag": "p", "text": "Throughout the novel, Kemp used the phrase \"there be dragons,\" uttered by Korr on multiple occasions. According to Kemp, the phrase was used on ancient real-life maps to denote the end of the then-known world, and Kemp used it in a similar sense in Crosscurrent to allude to Korr's limited knowledge at the time. Finding it easy for him to create compelling personalities for mostly unexplored characters and enjoying portraying people plagued with doubt, Kemp saw the potential in the portrayal of Korr struggling with the fact that \"light\" and \"dark\" were merely conventions."}, {"tag": "p", "text": "During the writing of the novel, Kemp was given a lot of creative freedom by his editor at Del Rey, and his pitch was quickly approved. After the publication of Crosscurrent, Kemp initially considered portraying Korr's construction of his first lightsaber in a short story, but he eventually included it as backstory in Riptide."}, {"tag": "h3", "text": "Character customization and appearance"}, {"tag": "p", "text": "Originally, Korr's true nature remained ambiguous, as the in-game avatar for Star Wars: Jedi Knight: Jedi Academy is customized by the player, and so it can be a male or female Human, female Twi'lek, male Rodian, female Zabrak or male Kel Dor, some of those choices also having multiple variations in appearance, such as the color of skin and hair. Korr was often portrayed in promotional art, on the back cover of the game disc—with the same image reused for the back cover of the game's official guide as well—as a male Human with reddish-brown hair but was also portrayed as a Twi'lek female in the Planet Hoppers—Hoth: Under the Ice web supplement."}, {"tag": "p", "text": "The first information on Korr's identity came from the 2005 reference book The New Essential Chronology, which addressed Korr as a \"he,\" invalidating all female options in the game. Despite mentioning Korr, Fury remained ambiguous on his appearance. However, Abyss established him as a brown-haired male. Although it did not necessarily specify his species, it excluded Rodian and Kel Dor from consideration, as all Kel Dor and all male Rodians are naturally hairless, only leaving Human as a possibility. The description in the novel matched one of the Human avatars in the game, the exact one used to portray the character in promotional art."}, {"tag": "p", "text": "Korr's subsequent portrayal in Crosscurrent and Riptide reaffirmed the description outlined in Abyss, explicitly stating that Korr was a Human. Kemp's novels also established that Korr wore a goatee as of 41 ABY, which the author wrote in as a homage to Katarn, signifying the fact that Korr leaned heavily on his Master's teachings during his crisis of faith. Riptide also retconned Korr's appearances in the Fate of the Jedi series being that of the Iteration, inhabited by Korr's persona."}, {"tag": "p", "text": "During the writing of Crosscurrent, Kemp received several fan e-mails asking him to make Korr a Kel Dor. Although he still settled on making the character Human, the words \"Kel Dor\" subconsciously resulted in him naming the Anzat character, who thematically symbolized the \"certainty\" to Korr's doubt, \"Kell Douro.\""}, {"tag": "h3", "text": "Other gameplay alternatives"}, {"tag": "p", "text": "At the beginning of Star Wars: Jedi Knight: Jedi Academy, the game provides the possibility to choose the hilt variation and the blade color of Korr's first lightsaber. After the mission to Vjun, players have an option to build a single new lightsaber, two new lightsabers or a double-bladed one, with in-game dialogue stating that Korr's first lightsaber was destroyed on Vjun."}, {"tag": "p", "text": "However, Crosscurrent featured Korr in possession of two lightsabers, establishing that Korr's first weapon was purple in color and his second one was a green-bladed single lightsaber. This information also established Korr's mastery of all three lightsaber styles of the New Jedi Order, as one could master all three only by choosing a single lightsaber after Vjun in the game. When asked how Korr came in possession of his first lightsaber once again when it was stated to have been lost on Vjun in the game, Kemp responded that he assumed the lightsaber was later recovered from Vjun, and he considered portraying this event in a short story. According to Kemp, Korr uses the medium style of lightsaber combat throughout Crosscurrent."}, {"tag": "p", "text": "In addition to the so-called \"core powers\"—telekinesis, Force speed, Force Jump and Force sense—Jedi Academy lets the player decide which additional Force powers to learn and improve. The available options include Force protection, Force healing, Force absorb, Force drain, Force rage, and Force choke. Those powers bear no influence on the storyline, with the exception of Kyle Katarn's comments between missions. Depending on which Force powers, light or dark, are leveled more by the player—or if they are completely even—Katarn will voice his pride or concern for Korr."}, {"tag": "p", "text": "Jedi Academy presents the opportunity for the player to choose the order in which to do most of the missions. The game is divided into three sets of five missions, completing any four out of them, in any order, allows the player to either advance the story to crucial plot missions—Hoth, Vjun, and Taspir III—or choose to complete the final mission. Throughout the course of the missions, the number of enemies defeated by Korr is also left up to the discretion of the player, as many of them can be avoided. However, the official game guide presents its walkthrough in the order the missions are laid out on the mission select screen, so this article follows that order and assumes that Korr completed every available mission and defeated every single adversary. Additionally, certain entries in the 2008 The Complete Star Wars Encyclopedia referenced events of Jedi Academy, confirming Korr's participation in the missions to Blenjeel, Nar Kreeta, Coruscant, and Dosuun."}, {"tag": "h3", "text": "Jedi Academy alternative ending"}, {"tag": "p", "text": "Star Wars: Jedi Knight: Jedi Academy presents two possible endings for Korr: the light side ending, confirmed to be proper in future Legends material, and the dark side ending. In the dark side ending, when Korr meets Rosh Penin on Taspir III, he gives in to his anger and strikes down his former friend in cold blood. After that, Alora commends Korr on killing Penin and offers him the possibility to join the Disciples of Ragnos. Korr confidently turns down the offer, claiming that the Scepter of Ragnos will belong to him alone, defeating and killing Alora."}, {"tag": "p", "text": "Soon afterward, Korr travels to Korriban to take down Axmis and with that become a true Sith Lord. On Korriban, Korr faces both Axmis's forces as well as his old fellow Jedi. He has to simultaneously fight Jedi and Dark Jedi alike, as well as stormtrooper forces, before confronting Axmis herself in the Tomb of Marka Ragnos. After Axmis is defeated for the first time, unlike the light side path, she does not try to resurrect Ragnos and lets Korr kill her."}, {"tag": "p", "text": "At that point, Katarn, who is after Korr, arrives in an attempt to bring Korr back to the light side. Nonetheless, Katarn fails in persuading Korr to change his mind. Korr and his former Master duel in a final fight, with Katarn employing his full arsenal of lightsaber moves and Force abilities against his fallen student, proving to be a much more difficult opponent than Ragnos himself. The fight ends with Korr using the Scepter of Ragnos to collapse the ceiling on his former Master, burying him underneath a pile of rubble. Korr then escapes through a hole in the wall made with the Scepter and flees from Korriban with his ship to the Imperial Star Destroyer orbiting Korriban, forcibly taking control of it."}, {"tag": "p", "text": "Meanwhile, Skywalker meets Katarn, who has managed to escape from the debris unscathed, at the Tomb of Ragnos, and they agree that they have to stop Korr from using the Scepter of Ragnos for his own needs. Katarn, distraught for losing both of his apprentices, vows to track down Korr and takes a leave of absence from the Praxeum while he does so. Skywalker, however, senses that there is still some good left in Korr and that he might still be saved. Finally, on the bridge of the capital ship with the Scepter of Ragnos in hand and the body of a dead Imperial officer lying on the floor, Korr sets a course for an unknown destination."}, {"tag": "h3", "text": "Errors and contradictions"}, {"tag": "p", "text": "There is a minor conflict in the description of Korr's eyes between Abyss and Crosscurrent. Whereas Abyss describes Korr as having \"dark\" eyes, Kemp's novels state that his eyes are gray in color, although Riptide does establish that Korr's appearances post-41 ABY are in the Iteration's body, and the Iteration's eyes, though also gray and similar to Korr's, are different-looking. The 2012 reference book The Essential Reader's Companion notes that Korr's participating in the Battle of Centerpoint Station is first established in Crosscurrent, and he does not appear in Fury, which depicts that event. This is incorrect, as the character does indeed appear in the latter novel."}, {"tag": "p", "text": "There is a lack of consistency regarding which of Korr's hands were maimed by Alpha. In Crosscurrent, it was his right hand. However, in Riptide, his left hand is mentioned as the one with the injury. Korr was slated to be featured in The Essential Characters reference book, with artwork done by artist Douglas Wheatley. The image of Korr revealed on Del Rey's Facebook page depicted him as he would appear post-Riptide, without the beard and missing three fingers on his hand. The image portrayed his left hand with the injury, adding to the confusion. Regardless, the book was eventually canceled."}, {"tag": "p", "text": "Riptide states that Korr has had a scar on his right cheek throughout most of his life, while Korr's model in Jedi Academy lacks any visible scars. Korr's entry in The Complete Star Wars Encyclopedia claims that Penin was captured by the Disciples of Ragnos near Nar Kreeta, while in fact he was captured on Byss, and it was Korr who went to Nar Kreeta. It later states that Alora killed Penin on Taspir III instead of just cutting off his arm."}, {"tag": "p", "text": "The article Hoth: Under the Ice is written from the perspective of Katarn, presenting the events in a way as if Katarn was accompanying his apprentice during the mission, while in the game, Korr went to Hoth alone. In Crosscurrent, Korr laments distancing himself from Valin Horn, indicating some sort of relationship between the two. After the publication of the novel, when asked what their relationship was, Kemp said that he could not reveal it yet. However, the following novel, Riptide, provided no explanation to their connection and Horn was not mentioned a single time throughout it. Riptide states that Korr entered the Jedi Praxeum nine years after the death of Emperor Palpatine, which occurred in 4 ABY. However, the events of the Jedi Academy video game are actually dated to 14 ABY, ten years after the Emperor's death."}, {"tag": "h3", "text": "Ambiguous information"}, {"tag": "p", "text": "Before the establishment of Korr's appearance through information presented in Abyss and Crosscurrent, a figure titled \"Exceptional Jedi Apprentice\" was featured in the 2009 Jedi Academy expansion for the Star Wars Miniatures game. The piece greatly matched Korr's appearance that would later be confirmed in the Legends continuity. However, the figure was never identified as Korr and, contrary to information presented in Crosscurrent, it wielded a yellow double-bladed lightsaber."}, {"tag": "p", "text": "Paul S. Kemp has stated that he intended Zeerid Korr, a character from The Old Republic: Deceived, his other novel set thousands of years before the events of Crosscurrent, to have been an ancestor of Jaden, however no Legends source confirmed that the two were indeed related.\nSeveral times in Riptide, and even in certain parts of Crosscurrent before that, Kemp seemingly hints at the possibility of Korr himself being a part of Thrawn's cloning program, planted on Coruscant as a sleeper agent in his youth."}, {"tag": "p", "text": "In Crosscurrent, the clone Alpha casts a \"knowing look\" at Korr and calls him \"one of us,\" referring to the Community of clones. Furthermore, the early chapters of Riptide feature a scene set on the Sith world of Korriban, in which Sith Lord Darth Wyyrlok and the Umbaran Nyss Nenn see a recording of Korr's fight with Alpha on the frozen moon. As they see Force lightning cracking at Korr's fingertips, the two comment that it is \"too soon\" for Korr to fall, as the leader of the Sith, Darth Krayt, was not expecting Korr to fall quite yet. As a result of witnessing the recording, Nenn is dispatched on his mission to replace Korr with the Iteration."}, {"tag": "p", "text": "When talking about the Iteration, Wyyrlok also states that his appearance has been adjusted to that of the \"mole,\" referring to Korr. At the climax of the novel, Nenn, despite wanting revenge on Korr for his sister's death, suddenly stops and speaks some sort of a code word in a language unknown to Korr. The scene is described from Korr's point of view, and he does not recognize the code, which surprises Nenn and allows Korr to kill him. Earlier on in Riptide, however, it is established that the code word is a special phrase meant to incapacitate clones, as the Umbaran uses it to subdue the Iteration at one point."}, {"tag": "p", "text": "At the end of the novel, Soldier also surmises that he has met a \"clone of himself\" when referring to Korr, although it is not elaborated whether this phrase means that Soldier was the original Korr or if it is simply misused to mean that he met his genetic template. However, the novels never explicitly state that Korr is a clone and leave this matter ambiguous. Kemp himself has acknowledged the existence of such ambiguity in an interview, stating that it was unclear in the novels if that was really \"Jaden,\" in quotation marks, that the One Sith were after."}, {"tag": "p", "text": "Another ambiguity results from the cliffhanger ending of Riptide. Realizing that his Master is dead, Idi-Shael transfers his memories and consciousness into the Iteration's body, something that was part of the Iteration's plan to begin with. However, the Iteration is stated to be \"not yet ready\" to receive the memories when Idi-Shael performs the procedure, and Korr's persona seemingly takes control of the clone's body. As the novel ends, although Korr seems to act the same as he has been before his death, Idi-Shael and the reader are left wondering how much of Korr is left remaining and whether the Iteration is actually still in control of the body, simply lying dormant for the time being."}, {"tag": "h3", "text": "Canceled content"}, {"tag": "p", "text": "Believing that Riptide brought closure to Korr's emotional plot threads but also acknowledging that it raised many questions, thus opening up the possibility to explore the intellectual side of Korr's story, Kemp originally had plans to follow it with more novels about Korr and his companions, building up on the major reveals in the previous two books. However, any possibilities of such follow-up novels ceased to exist on April 25, 2014, when the Expanded Universe was rebranded as the non-canon Star Wars Legends continuity, with no more works planned to be released in it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}