{"url": "Jaden_Korr%27s_first_lightsaber", "categories": ["Category:Legends articles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Jaden Korr's first lightsaber"}, {"tag": "p", "text": "Jaden Korr's lightsaber was a weapon constructed by Jedi Knight Jaden Korr in 14 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "In 14 ABY Jaden constructed this purple-bladed lightsaber in his Uncle's workshop while in a dreamlike state. He showed off the lightsaber to a surprised Orn, who immediately contacted the local authorities, and had him enlisted in the Jedi Praxeum on the moon Yavin 4 within two days."}, {"tag": "h3", "text": "First encounter with the Disciples of Ragnos"}, {"tag": "p", "text": "During the ride, he met Rosh Penin, who was very impressed with Korr's lightsaber and proceeded to ask him how he got it. Before Jaden could answer, their shuttle was shot down by members of the Disciples of Ragnos cult as it approached the surface. After the crash, Korr and Penin were separated from the rest of the students and proceeded to the nearby Massassi temple, Korr used his lightsaber to cut a few trees down to make bridges and they fought several howlers. Eventually they ran into some stormtroopers and a member of the cult. After Korr defeated the cultist he investigated the temple. He saw three figures, one of which was holding a glowing scepter; they were later revealed to be the Kothos twins and Tavion Axmis using the scepter to drain the Force from the temple. However, Jaden's eavesdropping efforts were detected, and the mysterious figures turned on him, knocking him out."}, {"tag": "h3", "text": "Jedi apprentice"}, {"tag": "p", "text": "Upon awakening, Jaden met with Jedi Masters Kyle Katarn and Luke Skywalker, who welcomed their new student to the academy and questioned him about what he saw. Shortly afterward, he and Rosh were assigned to Kyle as pupils, and they passed their standard Force abilities course. On the way, Rosh set loose a lightsaber practice droid upon Jaden in the hope of slowing him down so he could finish the course first, but Jaden defeated the droid. After the training, Kyle admonished Rosh heavily for this careless decision, stating that it was not a competition and that if the droid had been set to Skywalker's training module, it would've killed Jaden. Feeling guilty, Penin apologized for the incident. Jaden was angry that Rosh could do such a thing, but Kyle warned him not to feed his anger, and Jaden accepted Rosh's apology."}, {"tag": "p", "text": "Korr and Penin were sent on a series of missions, helping to track down the growing cult. Jaden visited various worlds, including Blenjeel, Corellia, Tatooine, Chandrila and Bakura. Although Katarn went with Jaden on most of his missions, due to unexpected events, all of Jaden's missions were more hazardous than expected. Through them all, Jaden kept a cool head and came out on top."}, {"tag": "p", "text": "Later, Master Skywalker summoned all available Jedi to inform them that—during the downed shuttle crisis—someone had sliced into his records and stolen his journal containing names of places where he had found a very strong connection to the Force. Worried of what the slicer could be planning, he sent the Jedi to various places mentioned in his journal. Jaden went to Hoth, where Master Skywalker had had a vision of Obi-Wan Kenobi shortly before the Battle of Hoth."}, {"tag": "p", "text": "Upon landing on the planet, Korr couldn't sense anything out of place there, but as soon as he started investigating, he found that the Imperials were guarding Echo Base. Jaden infiltrated the base and overheard a Sith Cultist talking on a comlink to Alora, Tavion Axmis's apprentice, about Skywalker having traveled to Dagobah after the battle.\nKorr defeated the Cultist and confronted Alora. The two engaged in a lightsaber duel, and were at first evenly matched. After Jaden began to gain the upper hand, Alora escaped through a caved-in section of Echo Base, taunting Jaden as she left. The accounts were documented in Korr and Katarn's datacard report entitled Tauntaun Feathers A1."}, {"tag": "p", "text": "Rosh was captured during his mission to Byss, and Katarn spent time looking for him. Jaden, now promoted to Apprentice, worked on more missions, until Master Skywalker assigned the Jedi to investigate other strong Force sensitive places that weren't mentioned in his journals. The Jedi students were instructed to work in pairs because of Rosh's capture. Kyle and Jaden were assigned to investigate Darth Vader's Bast Castle on Vjun."}, {"tag": "p", "text": "Katarn and Korr infiltrated the fortress, but soon after became separated. Alone and ahead of Kyle, Jaden fought his way through the fortress, finally confronting none other than Rosh Penin in Vader's throne room. Rosh had turned to the dark side following his capture. He boasted of the power of the dark side to Jaden, and—along with the Kothos twins—engaged him in battle. The battle seemed impossible to win, as the twins kept empowering Rosh with life energy. However, Jaden killed the Twins, hoping that Rosh would stand down without their influence. Nevertheless, Rosh kept on fighting, causing Jaden's anger towards him to build again. After Jaden defeated Penin, Katarn reached the room. As Rosh lay disarmed on the floor, Tavion chose that moment to appear, declaring her part in the Cult. After rebuking Katarn, Tavion ripped Jaden's lightsaber from him with the Force, threw it at the heavy ceiling and brought the weakened ceiling down on the Jedi with the Scepter of Ragnos, knocking away Jaden's lightsaber in the process. Thanks to Katarn's quick thinking, Korr was able to use Katarn's lightsaber to cut a hole in the floor for both to escape while Kyle held up the tremendously heavy rubble with the Force. Unfortunately, Tavion and Rosh fled. Kyle and Jaden returned to the academy and reported what they discovered and about Tavion. Jaden came up with the theory that Tavion might be using the scepter's power to not only absorb Force energy, but to also discharge the energy to empower and corrupt her followers, which Katarn and Skywalker found highly possible. Skywalker, impressed with Jaden's actions, promoted the young student to the status of Jedi Knight. Nevertheless, Kyle warned Jaden that he felt Jaden's anger towards Rosh, and despite being a Jedi Knight, he must still be aware of giving in to the dark side."}, {"tag": "h3", "text": "Recovery"}, {"tag": "p", "text": "At some point after the Disciples of Ragnos Crisis, Jaden recovered his lightsaber from Bast Castle and continued to carry it. In 41.5 ABY he used the lightsaber to kill the clone Alpha grown from Kam Solusar's DNA. He later gave this lightsaber to his first apprentice Marr Idi-Shael."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}