{"url": "Jae_Juun", "categories": ["Category:Legends articles", "Category:Galactic Alliance Intelligence personnel", "Category:Males", "Category:Pilots", "Category:Smugglers", "Category:Sullustans"], "nodes": [{"tag": "h1", "text": "Jae Juun"}, {"tag": "p", "text": "Jae Juun was the Sullustan pilot of the XR808g, and later the DR919a, and a smuggler. His copilot was a feisty and unfriendly Ewok named Tarfang."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Juun was enamored with Han Solo, and based all of his strategies as a smuggler upon Solo's legendary adventures. However, upon meeting Solo at the Lizil nest, Juun altered his opinion after Solo and his friends attempted to coerce Juun into helping them discover the whereabouts of Jaina Solo and other Jedi that disappeared into the Unknown Regions. Nevertheless, Juun held Solo in high esteem, although his obsession with proper procedure and protocol brought him into conflict a number of times with Solo, who often used unorthodox means to outwit his enemies. Juun was a great fan of historical holovids on Solo, and made many references to them while in his company. Juun was not technically adept, nearly killing himself and others when activating a poorly soldered circuit panel aboard his ship."}, {"tag": "p", "text": "After the Killiks resettled in the Utegetu Nebula, Juun and Tarfang procured jobs delivering spinglass sculptures for the Squibs. Little did they know, however, that the sculptures secreted tiny Gorog assassin bugs, which were let loose aboard Alliance warships. A year later, Jae and Tarfang again encountered Han and Luke Skywalker when they were captured by the Saras nest. Juun helped them escape, and accompanied the Alliance heroes as they launched a mission to track down Lomi Plo. When they finally encountered the Night Herald, Juun proved to be the only one who could see her. With Juun acting as his \"eyes\", Luke fought Plo, though both survived the battle."}, {"tag": "p", "text": "Following the battle, Admiral Nek Bwua'tu offered both Juun and Tarfang lucrative contracts working for Galactic Alliance Intelligence. Juun read Kyle Katarn's Spy Primer as part of his training, considering it an orthodox intelligence manual (unaware that Katarn's career had been anything but orthodox). The pair would later be encountered by the Solos at the Lizil nest. Tarfang and Juun apparently were watching Killik movements while disguised as Fefze beetles."}, {"tag": "h3", "text": "Second Galactic Civil War"}, {"tag": "p", "text": "During the Second Galactic Civil War, Juun and Tarfang were still working for the GA. This time they were on Kashyyyk sent to monitor the Wookiees who were currently deliberating on whether to support the GA or not. There Juun and Tarfang saw the Solos who had a warrant out for the arrest so they tried to stop the Solos from talking to the Wookiees which they succeeded at by bringing up the law. This however did not work the second time and the Wookiees allowed Leia to talk but Tarfang stepped in to challenge her, while Juun watched."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}