{"url": "Jadthu-class_landing_ship/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic starship classes", "Category:New Republic starship classes", "Category:Republic Sienar Systems products"], "nodes": [{"tag": "h1", "text": "Jadthu-class landing ship"}, {"tag": "p", "text": "Jadthu-class landing ships were heavy troop transports used prior to and throughout the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Introduced prior to the Clone Wars, they were produced by Republic Sienar Systems and based on modified Incom shuttle designs."}, {"tag": "p", "text": "Possibly one of the most heavily armored landers of the time, Jadthus were essentially flying bunkers, entering major war zones and remaining there long enough to deploy its troops while under heavy fire. Each lander carried 60 clone troopers, not including pilots and gunners. The landers were fast when going in a straight line, but they were ponderous and unable to take any effective evasive action."}, {"tag": "p", "text": "They were lightly armed, having only two heavy laser turrets and an Arakyd Industries Caltrop-5 chaff gun, which sprayed durasteel slivers designed to distort sensors. It was quickly discovered that, due to the speeds at which starfighters flew, the chaff could be a lethal weapon, perforating the armor of fast-moving fighters."}, {"tag": "h2", "text": "History of use"}, {"tag": "p", "text": "Although in existence before then, Jadthu-class ships were used during the Clone Wars as heavy transports. They were looked upon with faint disdain by clone troopers, who considered their armor and effectiveness against droid starfighters, but also reflected on their lack of mobility and hyperdrive capability. They were also known for the ability to mag-clamp to an assault ship's hull rather than take up hangar space. Jadthu-class landers, deployed in this very respect, were used in the Battle of Haruun Kal in 22 BBY."}, {"tag": "p", "text": "Following the Battle of Endor in 4 ABY, Jadthu-class landers were part of the Rapid Response Task Force of the New Republic. They were used to transport infantry forces to the the surface of Mindor during the fighting there in 5.5 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}