{"url": "Jaesa_Willsaam", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Alderaanians", "Category:Empire's Wrath's crew", "Category:Fallen Jedi", "Category:Handmaidens", "Category:Humans", "Category:Jedi trainees of the Jedi Order", "Category:LGBTQ+ individuals", "Category:Members of the Sphere of Military Offense", "Category:Members of the Sphere of Sith Philosophy", "Category:Sith acolytes and apprentices of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Jaesa Willsaam"}, {"tag": "p", "text": "Jaesa Willsaam was a Human female Jedi Padawan who studied under the tutelage of Jedi Master Nomen Karr and later the apprentice of the Empire's Wrath, who convinced her to abandon the Jedi Order and join the Sith during the Cold War."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jaesa Willsaam was born on Alderaan to Gregor and Parvin Willsaam, and spent her early life as a handmaiden to Gesselle Organa of House Organa. Her family was not wealthy, and her parents had hoped to increase their family's lot when it was decided that she would marry an Organa noble. Fate interceded when her Force-sensitivity manifested itself. Recognizing the tremendous opportunity for their child, her parents allowed her to be taken for training by the Jedi."}, {"tag": "h3", "text": "Jedi apprentice"}, {"tag": "p", "text": "For an unknown length of time, Willsaam was trained in the ways of the Force by Jedi Master Yonlach on Tatooine. During one of her trials, she faced the sand demon unarmed and walked out unscathed."}, {"tag": "p", "text": "But soon Nomen Karr recognized that Willsaam had a unique Force ability, the ability to see and effortlessly determine the true nature of other sentients. In her, Karr saw an opportunity root out and dismantle the intelligence network of his longtime Sith rival, Darth Baras. At her master's behest, Willsaam was able to identify some of Baras' operatives on Balmorra and Nar Shaddaa."}, {"tag": "p", "text": "Her existence and talent–though not her identity–were uncovered by Baras on Dromund Kaas, by torturing the information out of a captured agent of the Republic. Baras quickly assigned his most promising new apprentice to seek out and destroy individuals from Willsaam's past, hoping to draw her out of anonymity."}, {"tag": "p", "text": "After two of the spies she had uncovered were silenced by the Sith apprentice, Willsaam began more and more to feel the approach of the dark side. The Sith soon began tracking down people she was close to. The apprentice first sought out Master Yonlach on Tatooine. Willsaam's old master managed to warn her via their Force bond that the Sith were attempting to draw her out of hiding before he met a painful death. And when Willsaam finally felt her own parents' deaths on Alderaan, she decided to take matters into her own hands. She contacted the Empire's Wrath to arrange a one-on-one meeting without her Master's knowledge."}, {"tag": "p", "text": "Master Karr quickly discovered Willsaam's plan and, after judging it foolish and forbidding her to go through with it, sent Jedi Knights Zylixx and Ulldin to eliminate the Sith threat. The two Knights would prove to be no match for the Sith, and were easily defeated. Karr was finally determined to end the threat to Willsaam's life, and arranged for a duel to the death with Darth Baras on Nal Hutta to resolve their conflict."}, {"tag": "p", "text": "In order both to protect himself and to put Karr off-balance, Baras sent his mighty apprentice to the duel in his stead. As Jedi Master and Sith apprentice clashed, the Sith tricked the old Jedi into falling to the dark side in order to further taunt Willsaam."}, {"tag": "p", "text": "When her Jedi Master was defeated, Willsaam finally emerged from hiding, sensing that he was being tortured and saw her Master in his twisted state. At first, she considered the possibility that Karr had been hiding this all along, but then accused the Warrior of corrupting her Master. The Warrior encouraged her to use her power on Karr to see the truth. Willsaam complied and despite seeing dark traits within Karr, she refused to believe it. The Warrior continued to taunt her into releasing her anger and battled the Padawan, easily able to defeat the young Jedi. Defeated, Willsaam became convinced that Karr's teachings about the light side being stronger than the dark side were nothing but a lie. Karr reminded her that she hasn't completed her training and promises that when she fully communed with the light side of the Force, no Sith could be her match. Nonetheless, Jaesa acknowledged the Warrior's power and was accepted as a Sith apprentice. Her first act was to strike down her former master with her own hands. Though Karr pleaded her not to let the Sith turn her into a murderer, Willsaam coldly retorted that the Jedi hypocritically do likewise to justify their actions, and decapitated Karr."}, {"tag": "h3", "text": "Agent of the Sith Empire"}, {"tag": "p", "text": "Willsaam joined the Sith Warrior as a newly-anointed Sith apprentice when they departed from Nal Hutta. The Warrior was granted the rank of Sith Lord for success in hunting her down, and she became a willing agent of the Empire."}, {"tag": "p", "text": "Their adventures would take them across the galaxy, as they sought to undermine both the Republic and the Jedi, and worked tirelessly to re-ignite open war between the Republic and the Sith Empire. She demonstrated devotion to her Master, vowing never to follow the Sith traditions involving killing the Master. When her Master was chosen as the Emperor's Wrath, Jaesa became excited, knowing that this would place them closer to the Sith Emperor and ultimate power, believing that the Wrath could lead the Empire to glory. Ultimately, Jaesa vowed to stay by her Master's side to help mold future apprentices."}, {"tag": "p", "text": "Eventually, Jaesa became aware that many Sith were leaning towards the light side. With her master's leave, Jaesa used her free time find Sith who followed some aspects of the light side. Eventually, she learned of Lord Cendence, who was tasked by the Dark Council in eliminating light side Sith. However, Jaesa became concerned over Cendence's high kill list. Upon gaining an audience, she quickly realized that Cendence simply killed whomever he wished; very few of his targets were light side Sith. Cendence recognized that Jaesa's power would validate his work. He attempted to convince her to betray her Master but she simply laughed in his face and killed him. Caliqu, the Dark Council's emissary and Cendence's superior, was present at the time and granted Jaesa Cendence's mandate."}, {"tag": "p", "text": "Willsaam continued to serve her master over the next few years, becoming one of the Wrath's closest friends and confidants. She stood by their side during the Conquest of Makeb and the Revanite crisis, when the former dark lord Revan attempted to revive the slumbering Sith Emperor, who's previous host body was slain by the Hero of Tython three years earlier. The victory of the Yavin Coalition resulted in a brief period of stability returning the the Sith Empire, which had been on the verge of total collapse. In order to ensure that the Sith remained a united force, Darth Marr made Jaesa's master the \"Empire's Wrath\", who became Marr's right hand along with Darth Nox, another member of the Dark Council. During the remainder of her tenure as the Wrath's apprentice, Willsaam continued to serve both the Sith Lord and the Empire loyally."}, {"tag": "h3", "text": "Rise of the Eternal Empire"}, {"tag": "p", "text": "In 3636 BBY, a mysterious army initiated an incursion into both Republic and Imperial space. During this time, as Darth Marr organized a joint expedition into Wild Space, the de-facto Emperor's fleet was attacked by another armada of mysterious origin. This battle became the catalyst to the rise of a third galactic power: the Eternal Empire. Immediately after, the Wrath mysteriously disappeared."}, {"tag": "p", "text": "After the Wrath's sudden disappearance from the Galactic stage, the Sith Lord's crew began to mourn the loss of their leader. Willsaam was seemingly not as affected by the loss as much as the others, even becoming slightly irritated by the constant grief that her friends displayed. The former apprentice believed that the loss of her master would be the perfect opportunity to increase her own power base, trying to succeed her master in keeping the Wrath's influence intact. She ended up garnering a rival, and this person made an attempt to take over the dark center that she tried so hard to secure."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a handmaiden and Jedi pupil, Jaesa was somewhat naive, unintentionally allowing her mistress to exploit her talents. After the murder of her master and parents at the hands of Baras's apprentice, Jaesa became rattled and attempted to challenge the apprentice. Her fatal flaws were her recklessness and her need to count on someone who was strong and dependable. When the apprentice showed her her master's hypocrisy and bested her in single combat it took little convincing to defect and join with the Sith. After her defection, she embraced her inner power, and gladly served the future Empire's Wrath in unleashing her inner strength as she engaged in many bouts of relatively petty sadism in service to the dark side. As she indulged in her passions, she gave little thought to murder or casual relationships, to the point of either having carnal relations with or killing a random Imperial soldier while in a party and being only moderately confused, rather than thoroughly unnerved, by the acts of passion and possible death, seeing it as \"playing hard\" since she works hard."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Jaesa was adept at wielding a double-bladed lightsaber and demonstrated her ability at using the Soresu form while she was fighting the future Emperor's Wrath."}, {"tag": "p", "text": "Jaesa also had a special talent similar to Force sight that allowed her to see the alignment and personality traits of other people. With training, she was able to scan entire planets and even quadrants of the galaxy, eventually finding Light Sith. Still, finding individuals over that distance required concentration and time in order to separate out identities and locations."}, {"tag": "p", "text": "She also held the power to use Force lightning, unlike her master, and she was quite proficient in telekinesis."}, {"tag": "p", "text": "Due to her powers, Jaesa was also skilled with both interrogation and diplomacy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jaesa Willsaam is voiced by Rachael Leigh Cook."}, {"tag": "p", "text": "Whether Jaesa remains on the light side or falls to the dark side depends on how the Sith Warrior known as the Empire's Wrath recruits her."}, {"tag": "p", "text": "In the original Sith Warrior class storyline, male player characters can romance her and later marry her, but if both the player and Jaesa are aligned to the dark side of the Force. However, if the player is also courting Vette, Jaesa expresses jealousy and suggests he ends his relationship with the Twi'lek. If the relationship between the master and apprentice furthers and the player is still romanced with Vette, Jaesa will plead with him to end his relationship with the Twi'lek. Likewise, Vette will also question this, resulting a confrontation between the three characters, and the player must decide between both of them. If the player wants both, Vette refuses to be a part of it and ends their romance. If both Jaesa and the male Sith Warrior follow the light side and he does not romance Vette, the player is given the option of having children with her, as their offspring would have great advantages. However, the player can have Jaesa's children and still romance with Vette during the romance conversation with Vette later at the end."}, {"tag": "p", "text": "If the Alliance Commander is a Sith Warrior, their reunion with Jaesa Willsaam after the Nathema Conspiracy will depend upon Jaesa's alignment, but not upon the player character's gender. Female and male Sith Warriors can begin a new romance with her, or the latter can continue a prior romance. If Jaesa had fallen to the dark side, she will start attacking Alliance troops and personnel on Iokath, for which Lana Beniko will arrest her and bring her to the Commander. Jaesa will tell her master all about how she felt after their disappearance, saying that she tried to get over their presumed death, and will additionally state that they abandoned her and now she wanted revenge. She will state that she deserves to be punished for what she has done and tell her master to go ahead. The player can choose to fight her and kill her, imprison her, or forgive and optionally romance her."}, {"tag": "p", "text": "If Jaesa was allowed to remain on the light side, the Alliance Commander will meet her on Ossus. She will tell them about how she tried to find other light-leaning Sith but could not, and barely escaped from a trap from an enemy posing as a light Sith. She will also explain that she met Master Gnost Dural who took her to Ossus to redeem her and have her rejoin the Jedi Order, but now that she is reunited with her master, her path is with them. She will ask them to spare Gnost Dural. The Commander will then take her to Odessen where she will join the Alliance, then she confesses that she has the type of feelings for her master that the Jedi normally forbid and that she considers herself a fool. The player can then choose either to romance her, or simply be a good friend."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}