{"url": "Jaffkee", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Coruscant Security Force officers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jaffkee"}, {"tag": "p", "text": "Jaffkee was a Human male who lived on the planet Coruscant during the Cold War between the Galactic Republic and the reconstituted Sith Empire. At that time, Agent Jaffkee served as a police officer with the Coruscant Security Force. He was assigned to the Justicars' Sector and was tasked with setting up listening devices and communications to monitor the Justicars' Brigade militia."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A young Human male, Jaffkee lived on the planet Coruscant during the Cold War between the Galactic Republic and the Sith Empire. He became a police officer with the Coruscant Security Force, which, at the time, had undergone severe hardships. The Imperial Sacking of Coruscant and the immediate aftermath of rioting and looting had drained the CSF in lives lost and in resources. Police officers were unable to prevent Black Sun thugs from claiming complete control of various sectors as their own. The formation of the Justicars' Brigade militia in response to that had at first been greeted with enthusiasm by the CSF, including Jaffkee. However, the Justicars quickly established themselves as outside of Republic influence and brutally expelled both Black Sun and the CSF."}, {"tag": "p", "text": "At one point, Jaffkee had a run-in with several Justicars and barely managed to escape with his life. Around 3643 BBY, Jaffkee had attained the rank of agent and was sent as an undercover operative to the Justicars' Sector to try to plant listening devices and monitor Justicar communications. However, the Justicars had set up several jamming devices that prevented Jaffkee from monitoring them. It was then that Jaffkee met a Republic individual who offered to assist Jaffkee in disabling the jamming devices."}, {"tag": "p", "text": "The individual was able to locate all the jamming devices and destroy them. That allowed the CSF's listening devices to come back online. Jaffkee reported his success to his superiors at CSF Headquarters."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jaffkee was a younger man with blue eyes and light-colored skin. Dedicated to his job and displaying enthusiasm for it, Jaffkee remained at his post in the Justicar sector despite the constant threat of discovery and ultimately death. Though he remained brave, Jaffkee held a healthy awareness of the dangers and knew not to mess with the Justicars and to avoid their patrols as much as possible. Despite his young age and enthusiasm, Jaffkee displayed the characteristic bitterness of many of the CSF's younger officers and recruits. The resentment came about as the Republic put greater emphasis on allocating money and manpower for the military and not the CSF. And, while Jaffkee was determined to complete his mission, he did not possess the support or manpower to do so on his own."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jaffkee appears in the mission \"White Noise\" in Star Wars: The Old Republic, a massively multiplayer online roleplaying game by BioWare released on December 20, 2011. The mission is available only to Republic-sided players and can either be completed for light side points or refused for no points."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}