{"url": "Jagomir", "categories": ["Category:Legends articles", "Category:Esstran sector planets", "Category:Jagomir locations", "Category:Swamp planets"], "nodes": [{"tag": "h1", "text": "Jagomir"}, {"tag": "p", "text": "Jagomir was a humid planet in the Jaga's Cluster of the Outer Rim Territories. The Rebel Alliance set up a base there after being forced to abandon their base on Arda I. While it had no known native sentient species, Jagomir was teeming with thousands of plants and animals, many of which were extremely dangerous."}, {"tag": "p", "text": "The surface of the planet contained thirty continents and a number of seas. Nearly seventy-five percent of the planet's surface was swampland."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Jagomir was a planet located in Jaga's Cluster, a part of the Outer Rim Territories' Esstran sector. The planet's orbit lasted 329 days and its rotations lasted thirty hours."}, {"tag": "p", "text": "Two-thirds of Jagomir was covered by swamps  and other wetlands. The planet had about thirty mountainous landmasses on its surface, which were divided by deep seas. Jagomir's atmosphere was humid and rich in oxygen, though it was sometimes uncomfortable to breathe. The planet's environment was made more unpleasant by its high temperatures and because vehicles could break down easily if not properly secured against the humidity."}, {"tag": "p", "text": "Jagomir was a dangerous world. Some of its hazards were biological, such as the venomous evarrian hunters and multiple diseases. Others were ecological, such as sinkholes and thick mist."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Some time before the Galactic Civil War, a group of pirates built a base in Jagomir's Aethrorn Mountains. Years later, the Alliance to Restore the Republic would construct a facility code-named Resolute Base in the same mountains. Jagomir was chosen as a potential base because it was located far from Imperial activity. Regardless, it was only used as a base by a group of Rebels who were fleeing their base on Arda I, which had recently been attacked by Imperial forces."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Jagomir had no native sentient species, although it was home to the azurdactyl, which was semi-sentient. After fleeing their base on Arda I, 306 members of the Alliance to Restore the Republic landed on the planet. That group was primarily composed of Humans and Bothans. Sometime prior to the arrival of the Rebels, a group of pirates also called the planet home."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}