{"url": "Jailbreak", "categories": ["Category:Legends articles", "Category:Battles in the Callia sector", "Category:Rebellions and uprisings"], "nodes": [{"tag": "h1", "text": "Jailbreak"}, {"tag": "p", "text": "The Jailbreak was an event that occurred on the penal colony of Ord Vaxal in 20 BBY. It began when a chain gang in a medium-security facility subdued their guards and took over. News of their success spread quickly throughout the planet, sparking mutinies in the other prisons. Within two weeks, armies of convicts had made their way to the planet's spaceports. In response, the Republic dispatched naval forces to besiege Ord Vaxal. Since the prisoners had become too deeply entrenched on the surface, the Republic focused on preventing their escape. Ord Vaxal's spaceports were bombarded from orbit, stranding the great mass of prisoners on the planet. A period of feudal warfare followed as some prisoners set up fiefdoms based around the former prison facilities. The situation eventually settled into a tenuous peace, although the Republic maintained pickets in orbit on a rotating basis."}, {"tag": "p", "text": "At some point after the situation on the surface reached an equilibrium, Palpatine decided to use Ord Vaxal as a repository of political dissidents, rebels and other criminals. Throughout the Imperial Period, condemned beings would be dumped on Ord Vaxal without regard to their fate on the surface."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jailbreak was first mentioned in the article Ord Vaxal: Prison Planet of the Empire, published in issue #165 the roleplaying game magazine Polyhedron in 2003, written by Gary Astlefords. The article mentions that the Jailbreak occurred 20 years before the Rebellion era, which begins in 0 BBY. However, it mentions that Palpatine \"came to power\" after the naval forces of the Republic had established a garrison in the orbit of Ord Vaxal. Palpatine was elected to the office of Supreme Chancellor in 32 BBY and established the Grand Army of the Republic in 22 BBY. The reference could, however, be interpreted as referring to Palpatine's reorganization of the Republic into the Galactic Empire in 19 BBY."}, {"tag": "h2", "text": "Notes and references"}]}