{"url": "Jaizen_Suel", "categories": ["Category:Legends articles", "Category:Females", "Category:Individuals of unidentified species", "Category:Jedi aces", "Category:Jedi Generals", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Jaizen Suel"}, {"tag": "p", "text": "Jaizen Suel was female Jedi Knight who served the Jedi Order and the Galactic Republic as a pilot in the Jedi Starfighter Corps during the final decades of the Republic Classic era."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Discovered to be Force-sensitive at an early age, Jaizen Suel was inducted into the Coruscant Jedi Temple's academy where she was taught the ways of the Force. Eventually attaining the rank of Jedi Knight, Suel began independent studies on the path of the Jedi Guardian, studying to become a member of the Jedi Starfighter Corps. Becoming a well respected pilot ace, Jedi Suel was considered to be a maverick among the Jedi, involving herself in local matters such as piracy and slavery, while ignoring the advice of the Jedi High Council."}, {"tag": "p", "text": "Despite this reputation, Jedi Suel responded to Master of the Order Mace Windu's rallying cry at the height of the Separatist Crisis and piloted her Delta-7 Aethersprite-class light interceptor above Geonosis, supporting the newly unveiled Grand Army of the Republic against the Confederacy of Independent Systems. Piloting her starfighter through Geonosis' asteroid belt, Suel flew under the command of High Councilors Adi Gallia and Oppo Rancisis during the battle."}, {"tag": "p", "text": "Taking up the rank of General within the army, Suel spent much of her time on the Outer Rim, participating in what came to be known as the Outer Rim Sieges throughout the war. During the final days of war, Suel traded her traditional Jedi starfighter in for a modified CloakShape fighter named Dawn Raider."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}