{"url": "Jaing", "categories": ["Category:Legends articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Mandalorian Neo-Crusaders", "Category:Mandalorians"], "nodes": [{"tag": "h1", "text": "Jaing"}, {"tag": "p", "text": "Jaing was a male Mandalorian training master who had left the order during the New Sith Wars era."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jaing was a former Neo-Crusader Shock Trooper who survived the Mandalorian Wars. Living for more than two thousand years after the end of the Mandalorian Wars, he reigned in the remaining clans and eventually fell in with a group under the leadership of Ung Kusp. Believing that the Mandalorians under Kusp had lost their honor, Jaing went out on his own until he met the Gen'Dai Durge, whom Jaing trained in the fighting techniques and tactics of the Mandalorians."}, {"tag": "p", "text": "Sometime later Jaing came in contact with a scientist who had created a unique set of armor that he was willing to test on Jaing and Durge. Jaing accepted and both he and Durge were given sets of the armor, but at a price."}, {"tag": "p", "text": "The scientist wanted protection for himself and the rare Sith artifact that the other Mandalorians wanted. Jaing promised this protection, but as he did so a Mandalorian clan under Kusp burst through a wall in the lab, and tried to take the artifact."}, {"tag": "p", "text": "Jaing and Durge made short work of the intruders until one of them threw a thermal detonator, and Jaing was fatally injured in the blast. Enraged, Durge routed the rest of the clan, and promised to kill every Mandalorian alive."}, {"tag": "p", "text": "Unknown to Durge, the events had been meticulously planned by the scientist himself, who told Jaing that his plan to start a war between the Mandalorians and the Sith had come to pass. As Durge left, the scientist assured him that Jaing could be easily resuscitated. Jaing apparently died shortly after."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}