{"url": "Jaius_Yorub", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Galactic Alliance Defense Fleet officers", "Category:Males", "Category:Resistance fighters", "Category:Sullustans"], "nodes": [{"tag": "h1", "text": "Jaius Yorub"}, {"tag": "p", "text": "Jaius Yorub was a male Sullustan who served in the Galactic Alliance Defense Force. A naval officer, he was captain of the MC140 Scythe-class main battle cruiser Indomitable during the Sith–Imperial War of 127–130 ABY. The Indomitable served as the flagship of the Galactic Alliance Core Fleet, under the command of Admiral Gar Stazi. During the final engagement of the Sith–Imperial War—the Battle of Caamas in 130 ABY—Stazi took elements of the Core Fleet and began a resistance against the combined forces of the Fel Empire and the One Sith rather than surrender. Yorub accompanied the admiral into self-imposed exile."}, {"tag": "p", "text": "Over the course of the next seven years, Yorub served Stazi as an aide and confidante while the Core Fleet continued to embody the ideals of the Galactic Alliance. In 137 ABY, Yorub and Stazi planned the theft of the Imperious, the prototype vessel of the new Imperious-class Star Destroyer line, being constructed at the shipyards orbiting the planet Dac. During the subsequent engagement, the Indomitable suffered crippling damage and Yorub was injured. Although Stazi was prepared to sacrifice himself in a suicide attack—by crashing the Indomitable into the shipyards—Yorub knew that the Alliance could not survive without the Duros admiral. He ordered Lieutenant Jhoram Bey, commander of the elite Rogue Squadron, to evacuate the admiral from the Indomitable, which the Weequay achieved by striking Stazi and rendering him unconscious. With Stazi clear of the Indomitable, Yorub guided the vessel into the shipyards, sacrificing his own life by triggering an explosion that destroyed the ship and a third of the docks."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Serving the Galactic Alliance"}, {"tag": "p", "text": "Jaius Yorub was a male Sullustan career officer serving in the Galactic Alliance Defense Force during the years leading up to the Sith–Imperial War. Yorub achieved the rank of captain, and commanded the MC140 Scythe-class main battle cruiser Indomitable, the flagship of Duros Admiral Gar Stazi. The Indomitable was part of the Galactic Alliance Core Fleet, the military formation tasked with protecting the capital planet of Coruscant and the surrounding Core Worlds."}, {"tag": "h3", "text": "The Battle of Caamas"}, {"tag": "p", "text": "Yorub served throughout the Sith–Imperial War—a conflict fought between the Galactic Alliance and the combined forces of the Fel Empire and One Sith—acting as an aide to Admiral Stazi as well as commanding his flagship. He was present at a meeting of the Galactic Alliance's Triumvirate in 130 ABY when Rear Admiral Piers Petan revealed a plan to strike at a secret meeting between Emperor Roan Fel and delegations from the Chiss Ascendancy and the Hapes Consortium near the planet Caamas. Petan's battle plan called for a major strike at the meeting, including using the Core Fleet as part of the assault force, a move that would strip Coruscant's defenses. Although Admiral Stazi believed that the information had been fed to them, and that it was a trap, the Triumvirate approved Petan's plan. As the meeting broke up, Stazi and Yorub made preparations to keep a \"back door\" open at Caamas, by using hyperspace routes known only to spacers."}, {"tag": "p", "text": "During the subsequent Battle of Caamas, Stazi's fears were proved right as the Alliance forces were engaged by an Imperial fleet under the command of Grand Admiral Morlish Veed. At the same time, the Sith feinted at Coruscant, holding the forces of the Jedi Order and stopping them from reinforcing the Alliance fleet at Caamas. Captain Yorub reported this news to Admiral Stazi shortly before Rear Admiral Petan broadcast to the fleet that he had agreed to terms of surrender with Grand Admiral Veed, and that the Alliance forces were to stand down. Yorub expressed the opinion that all was lost, and that the Empire would be installed on the capital inside a day. Stazi, however, refused to surrender, and broadcast to all Alliance forces that any unit wishing to join him in continuing to resist the Sith and the Empire was to form up with the Indomitable. Yorub noted that some Alliance ships and fighters were joining with them; Stazi ordered him to use the Indomitable to cover those vessels that had suffered heavy damage. Yorub complied, and also patched through a hologram of Admiral Nict, commander of the Pride of Corellia. Stazi informed his fellow officer that he intended to use hyperlanes known to spacers to escape Caamas. As the fleet prepared to jump, Yorub reported that the Pride of Corellia had taken a fatal hit and had been destroyed. Stazi noted that there would be time to mourn later, and ordered the fleet to jump into hyperspace."}, {"tag": "h3", "text": "Resisting the Sith"}, {"tag": "p", "text": "Following the Battle of Caamas, Admiral Stazi continued to resist the Sith Empire with the forces available to him. Yorub remained in command of the Indomitable, and served as Stazi's advisor and confidante. In 137 ABY, Yorub attended a meeting between Stazi and Monia Gahan, a Mon Calamari member of Rogue Squadron—the Galactic Alliance's elite starfighter squadron—and niece of former Galactic Alliance Triumvir Gial Gahan. Stazi intended to capture the Imperious, the first vessel of the new Imperious-class Star Destroyer line being built in the shipyards around the water world of Dac, the homeworld of the Mon Calamari and Quarren races. Stazi had dispatched Gahan to convince her uncle to aid them in their effort. Stazi wanted the vessel to increase his force's military capability, as well as deny its use to the Sith Empire. Gahan informed Stazi and Yorub that her uncle would aid them, giving them the security codes to the planetary and shipyard defense networks. When Yorub asked about her uncle's intentions after the Alliance completed their mission, Gahan told the two officers that he intended to stay behind and take the blame for the incident himself."}, {"tag": "p", "text": "After dismissing Gahan, Stazi asked Yorub his opinion on the entire mission. The Sullustan told him it sounded a lot like the previous incident at Caamas, to which the Duros admiral agreed. They both felt that the Imperious had been used as bait in a trap, one set by Imperial Admiral Dru Valan, who had failed to stop Stazi's retreat from the Battle of Caamas and who carried a personal grudge. Yorub voiced his concerns, and told Stazi that they should not risk their forces as they were all that remained of the Galactic Alliance. The admiral, however, refused to consider that option, feeling that, for the Alliance to survive at all, they needed the Imperious to make military strikes or risk becoming another pirate fleet. Despite this, he noted that if one knew where a trap lay, then it was possible to make it work for you, rather than against you."}, {"tag": "h3", "text": "Battle of Dac"}, {"tag": "p", "text": "Stazi laid out his plan for capturing the Imperious; Gial Gahan would deactivate the planetary and shipyard defenses, while Galactic Alliance Core Fleet Commandos stormed the Star Destroyer and subdued its crew. Once the capture was completed, Stazi intended to jump in with elements of the Core Fleet to secure the prize and escort it to safety. However, he also expected Admiral Valan to anticipate his tactics, and to counter them accordingly by retaking control of both the defense network and the Imperious. In response, Stazi placed Monia Gahan on the Mon Calamari Shipyards with remote access to the defense networks, ready to bring them under Alliance control at the proper time. Hondo Karr—a former Imperial stormtrooper with the 407th who defected following the Battle of Borosk—led a second force of commandos disguised as Imperial troopers onto the Imperious, posing as the units intending to take back the Star Destroyer from the Alliance assault force. With all of his pieces in place, Stazi led the Core Fleet to Dac. Yorub commanded the Indomitable from his side, was present on the bridge as the ship reverted from hyperspace, and listened as Admiral Valan called for Stazi's surrender, believing that he had trapped the Alliance fleet between his own Outer Rim Third Fleet and the shipyard defenses."}, {"tag": "p", "text": "Stazi ordered the Core Fleet to attack the Imperial fleet, with the Indomitable leading the charge. Admiral Valan ordered the shipyard defenses to target Stazi's fleet, unaware that the Alliance had regained control of them. The combined fire from the Core Fleet and the shipyards heavily damaged several vessels in the Imperial formation. Yorub monitored the battle as it unfolded, relaying the information to Stazi that Karr's team had regained control of the Imperious, and that their own shields were failing. Stazi's response was to order the Imperious to make for the rendezvous point, and to take the Indomitable and the fleet behind the shipyards, using them as a shield between Valan's fleet and their own. Yorub complied with both orders."}, {"tag": "p", "text": "Taking cover behind the docks, Stazi ordered Yorub to relay instructions to the fleet to move around Dac, using the planet as a shield before jumping to hyperspace while they remained in position with the Indomitable to cover the withdrawal. Admiral Valan, believing that Stazi's death would signal a death knell for the Alliance, ordered his forces to fire through the docks to strike at the Indomitable. The vessel took several crippling hits along its forward blade, and an explosion on the bridge injured Yorub, throwing him backwards off the command pedestal. Stazi came to Yorub's aid, intending to get the Sullustan some help before enacting the last part of his battle plan. He intended to detonate the Indomitable in the heart of the shipyards, crippling warship production; to this end, he ordered the crew to turn over all command and control functions to the bridge, and then abandon ship. However, Rogue Squadron leader Jhoram Bey had returned to the vessel after losing communication with the Admiral. Stazi intended to remain on the Indomitable to the end, and sacrifice himself. He ordered Bey to evacuate Yorub in his CF9 Crossfire starfighter. Yorub, however, refused to go, believing that Stazi—as a symbol of the Alliance—needed to remain alive to lead their forces. He believed that Stazi held the Alliance together, that others would rally to him, and that his death would shake the Core Fleet to its foundations. Yorub intended to take the Indomitable in, but Stazi still refused, believing that the task should fall to him as the commanding officer, and not taking the idea of himself being a symbol as important. Yorub turned to Bey, and ordered him to \"do his duty;\" Bey complied, punching the admiral and knocking him unconscious. As Bey evacuated Stazi in his starfighter, Yorub took control of the Indomitable. Broadcasting his resolve and commitment to the Galactic Alliance, Yorub crashed the vessel into the shipyards. The resulting explosion destroyed the ship and killed Yorub, but the Alliance force was able to withdraw with the Imperious."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Yorub's sacrifice resulted in a third of the Mon Calamari Shipyards being destroyed, with a further quarter heavily damaged. Admiral Stazi estimated that it would take several years for the Empire to recover its productivity at the docks. Stazi's survival was of paramount importance to the Galactic Alliance, as the Duros had become seen as the heart of the movement. Yorub's death meant that Stazi needed a replacement for his second-in-command, promoting Jhoram Bey to the post, partially as a punishment for striking a superior officer. The successful capture of the Imperious, along with the successful rescue of Alliance personnel by Imperial Knights Sigel Dare and Treis Sinde from detention centers on Dac in the aftermath of the battle, was instrumental in setting the foundations of an alliance between the Core Fleet and Emperor Roan Fel's Empire-in-exile. Yorub's sacrifice did have a negative impact, however; Darth Krayt took note of the Mon Calamari's assistance in the theft of the Imperious. Although Gial Gahan protested that he acted alone, Krayt punished the entire Mon Calamari race by initiating an extermination program against them for their collaboration."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jaius Yorub had black hair and eyes, and was a being dedicated to the ideals of the Galactic Federation of Free Alliances. During the Sith–Imperial War, he served with diligence, and accompanied Admiral Stazi into self-imposed exile following the Battle of Caamas to preserve a remnant of the Galactic Alliance. Yorub and Stazi had a close working relationship to the point of being on first name terms with each other despite their rank difference. Yorub served as Stazi's chief advisor, and used his cautious nature to counter the Duros admiral's bold behavior. He knew that Stazi was more than just the leader of the Galactic Alliance; he was also its heart, and a symbol that others rallied to. He feared that the loss of Stazi would doom the remnants of the Alliance. To this end, he sacrificed his own life to preserve Stazi's, even when offered the chance of rescue, knowing that the Alliance would survive without him."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Yorub was a competent and effective commander, fully versed in combat tactics and strategies and how best to apply them to any given situation. He was also a skilled linguist, able to speak Basic, Binary, Bocce, Bothese, Durese, Mon Calamarian and Sullustese."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jaius Yorub was featured in the Indomitable arc of Star Wars: Legacy, which ran in issues 20 and 21. The arc was written by John Ostrander and illustrated by Omar Francia. Yorub met his end in the second issue of the arc, but was featured in the Legacy Era Campaign Guide published by Wizards of the Coast in 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}