{"url": "Jakku", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Arboreal planets", "Category:Desert planets", "Category:First Order planets", "Category:Galactic Empire planets", "Category:Inner Rim planets", "Category:The Interior planets", "Category:Jakku locations", "Category:Type I atmosphere planets", "Category:Western Reaches planets"], "nodes": [{"tag": "h1", "text": "Jakku"}, {"tag": "p", "text": "Jakku was a remote desert planet located in the system of the same name, within the Western Reaches of the galaxy's Inner Rim. Though considered by many within the galaxy to be distant and relatively worthless, Jakku was the site of important events that would shape galactic history. In 5 ABY, Jakku was the site of the pivotal Battle of Jakku, which ended the Galactic Civil War in favor of the New Republic. A generation later, the planet was the home of the scavenger Rey, who became involved in the events of the Cold War after helping the former First Order stormtrooper Finn and the astromech droid BB-8 escape offworld with a map leading to the missing Jedi Luke Skywalker."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "An isolated planet located in the Jakku system within the Western Reaches of the galaxy's Inner Rim, Jakku was once a verdant world with forests and water, but some past calamity turned it into a barren globe of scorched badlands and marching dunes. It hosted the Wheel Races in the north and mining operations dotted the planet. Buttes were located in the south in which lichen could be scraped off of to create the alcoholic beverage Knockback Nectar. One could become an Anchorite if certain vows were taken, while scavengers often used luggabeasts to carry supplies across the desert."}, {"tag": "p", "text": "Tuanul, Reestkii, and Cratertown were settlements on the planet, while the trading post Niima Outpost was considered the only major settlement on the planet, and was guarded by the humorless Constable Zuvio and his Niima Outpost Militia. Lacking a communications grid, spacers seeking to escape debts, create a new life or simply see the galaxy often wound up at Niima Outpost, owing to it having the only navigational beacon. Not all residents were scavengers, however, with the isolated villagers of Tuanul worshiping the Church of the Force, an underground faith of Jedi worshipers hiding from first the Galactic Empire."}, {"tag": "p", "text": "Owing to the planet's distance from populated space, it served as a jumping-off point for warships heading into the Unknown Regions in the final years of the Galactic Civil War. Nearby worlds to Jakku included Ogem and Ponemah Terminal, the latter of which was connected to Jakku by the Burke's Trailing hyperspace route, which also linked Jakku to Adrathorpe."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Contingency"}, {"tag": "p", "text": "Eons ago, the planet Jakku was once covered with green vegetation and oceans. At some unknown point, the planet was reduced to a barren desert wasteland. However, the planet's core still had the vital spark of life essence, something which disgusted Sheev Palpatine. About 1,000 standard years before the Battle of Yavin, the Plaintive Hand plateau was the site of an event that was regarded as significant by Palpatine. He believed that the site would become significant again in the future."}, {"tag": "p", "text": "The human boy known as Galli grew up on Jakku. As an orphan, he was raised at an orphanage run by the Anchorite Kolob, who lived a life of austerity and strict obedience. Galli chafed under Kolob's care and longed to travel to a better world. In 30 BBY, Palpatine and his Adviser Yupe Tashu traveled to Jakku to supervise an archaeological dig on the Plaintive Hand plateau. During that trip, Palpatine encountered a twelve-year old Galli, who had stowed aboard his yacht Imperialis. He took the young boy as a protege and tasked him with guarding the excavation site against any intruders."}, {"tag": "p", "text": "Rax spent the next ten years guarding the Plaintive Hand plateau, which became the site for the Jakku Observatory. The Observatory was part of Palpatine's Contingency plan to destroy the Galactic Empire in the event of his death. Palpatine had no wish to leave his Empire to a successor and tasked Galli with executing the Contingency when the day of his death arrived. The Jakku Observatory was home to computers that projected paths into the Unknown Regions, a collection of Sith relics, and a borehole which led to the planet's core. Palpatine instructed Galli to use the borehole to detonate the planet and the remnants of the Empire. Galli adopted the persona Gallius Rax and later became a Fleet Admiral in the Imperial Navy."}, {"tag": "p", "text": "At some point during the Age of the Empire, the Galactic Empire established a secret research base. Later, the Hutt crime lady Niima established a presence on Jakku and lorded over several slaves."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Rax's return"}, {"tag": "p", "text": "In the months following the Battle of Endor, war refugee Corwin Ballast headed to Jakku, believing it to be a worthless rock floating in space and thus of little importance to the galaxy-wide conflict between the New Republic and Empire. If there was any place to escape the war, he hoped Jakku to be it. After learning about Fleet Admiral Rax's connection to Jakku, Grand Admiral Rae Sloane and the rebel Brentin Lore Wexley traveled to Jakku to hunt down and kill Rax. Shortly later, Rax proclaimed himself Counselor to the Empire and led the remnants of the Imperial Navy to Jakku."}, {"tag": "p", "text": "Counselor Rax established a base beyond the Goazon Badlands and the Sinking Fields. Claiming that the harsh, desert world would test the spirit and mettle of his Imperial forces, Rax implemented a harsh and violent training regimen on his stormtroopers and officers. For several months, the Imperials gathered their forces while waiting for the New Republic to launch their attack. In addition, Rax struck up a deal with Niima to guard the pass leading to the Observatory and to kidnap local orphans from the Anchorites. The former Commandant Brendol Hux trained these orphans into Rax's personal guard of child soldiers. Rax also settled scores with his former guardian Kolob and killed him as a sacrifice to the dark side of the Force."}, {"tag": "p", "text": "While hunting for Sloane, the New Republic operative Norra Wexley, her son Temmin Wexley, Sinjir Rath Velus, Jas Emari, and the B1-series battle droid Mister Bones discovered the Imperial remnant forces above Jakku. Temmin and Sinjir escaped on their starship Moth back to Chandrila to warn the New Republic. Norra and Jas took an escape pod to Jakku's surface to continue their hunt for Norra. Under the orders of Temmin, Mister Bones took another escape pod to Jakku to look after his mother Norra. Norra and Jas were captured by Imperial forces and separated."}, {"tag": "p", "text": "Norra eventually escaped Imperial custody with Mister Bones's help. She then reunited with Jas, who had escaped Niima's custody, and the trio continued their search for Sloane. Meanwhile, Sloane and Brentin learned about Rax's origins from Kolob and later convinced Niima to take them to the Plaintive Hand plateau, which Niima believed held a weapons facility. However, Rax learned about Sloane's presence and bombarded Niima's convoy with turbolasers. Before Norra and Jas could catch up with Sloane, Rax's Imperial forces captured Sloane and Brentin and brought them to his headquarters."}, {"tag": "h4", "text": "Battle of Jakku"}, {"tag": "p", "text": "After the New Republic's Galactic Senate voted to intervene on Jakku, the New Republic dispatched military forces to the planet. Several New Republic figures including Admiral Ackbar, Commodore Kyrsta Agate, Captain Wedge Antilles, Temmin Wexley, and Jom Barell would see action in the cataclysmic Battle of Jakku. The battle would take place one year and four days after the Battle of Endor. It became the last major stand of the Galactic Empire and last major battle of the Galactic Civil War. In secret, the Battle of Jakku served as a pretext for Rax to facilitate the final stage of the Contingency."}, {"tag": "p", "text": "During the Battle of Jakku, Imperial and New Republic forces fought on both space and land. The Imperial fleet formed a tight defensive formation around the Super Star Destroyer Ravager. The New Republic Defense Fleet was unable to penetrate this thick wall until the Star Destroyer Punishment broke formation and rammed the Starhawk-class battleship Amity. This explosion created a gap which allowed the Amity's sister ship Concord to bombard the Ravager. Despite being crippled, the Concord's commander Agate used her ship's powerful tractor beam to drag the Super Star Destroyer down to the surface; turning the tide of the battle in the New Republic's favor."}, {"tag": "p", "text": "Meanwhile, New Republic ground forces under Lieutenant General Brockway assaulted the main Imperial base and weapons facility. Many from both sides were killed or crushed by falling debris from the space battle. Mister Bones was destroyed during the battle after reuniting with Temmin. In an attempt to prevent New Republic forces from capturing her ship, Captain Ciena Ree crashed her Star Destroyer Inflictor onto the planet's surface. She was rescued by her lover New Republic pilot Thane Kyrell. Meanwhile, Norra joined forces with Sloane and Brentin to hunt down Rax."}, {"tag": "p", "text": "After launching the battle, Rax traveled with Yupe Tashu, Brendol, his son Armitage Hux, and the child soldiers to the Observatory to initiate the last stage of the Contingency. While the Huxes and the child soldiers boarded a replica of the Imperialis, Rax and Tashu entered the Observatory to initiate the planet's destruction. After performing a Sith ritual, Rax threw Tashu, who was wearing Sith relics, down the borehole to Jakku's core. Before he could leave, Rax was killed by Sloane with the aid of Norra and Brentin. Sloane managed to stop the planet's destruction by sealing the borehole. She then joined the Huxes and the child soldiers on their journey to the Unknown Regions where they rendezvoused with the Super Star Destroyer Eclipse."}, {"tag": "p", "text": "While the battle was taking place, the New Republic's Chancellor Mon Mothma and the Imperial Grand Vizier Mas Amedda signed the Galactic Concordance on Chandrila; formalizing the Empire's surrender and ending the Galactic Civil War. However, Imperial forces on Jakku and elsewhere continued fighting the New Republic for several months. As the battle turned against them, the Imperials locked tractor beams onto the ships of the New Republic Starfleet, crashing them into the surface below in a desperate gamble. New Republic forces eventually captured the base after fierce fighting. Due to the Battle of Jakku, the planet's surface was covered with wrecked starships and weapons. Niima established a black marketing operation based on selling recovered weapons, computers, and engines."}, {"tag": "h3", "text": "Rise of the First Order"}, {"tag": "p", "text": "After the Battle of Jakku, wreckage from the battle was strewn across a region of desert aptly named the Starship Graveyard. Sometime after the battle, Niima the Hutt established Niima Outpost, in an effort to scavenge leftover wreckage from the destructive battle."}, {"tag": "p", "text": "In 34 ABY, the up-and-coming First Order, successor state to the Galactic Empire, deployed the Resurgent-class Star Destroyer Finalizer to Jakku in an effort to recover a fragment of a map that led to Jedi Master Luke Skywalker, who had gone into self-imposed exile following a failed attempt at resurrecting the Jedi Order. The First Order forces, led by Kylo Ren, attacked the village of Tuanul, where the mystic Lor San Tekka lived and kept the map to Skywalker. However, San Tekka was able to give the map to Poe Dameron, who in turn hid it in his droid, BB-8, before Dameron was captured by Kylo Ren."}, {"tag": "p", "text": "The attack led to the defection of stormtrooper FN-2187, who aided Dameron's escape from the Finalizer in a stolen TIE/sf space superiority fighter. Ultimately, FN-2187, nicknamed \"Finn\" by Dameron, would escape the planet with an unknowingly Force-sensitive girl named Rey."}, {"tag": "p", "text": "By 35 ABY, Jakku was in open rebellion against the First Order."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The settlers and war refugees who inhabited Jakku cobbled together clothing from recycled material that they scavenged, as clothes were not something they could afford to waste money on when water and nourishment cost a premium."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jakku appeared in the 2015 film Star Wars: Episode VII The Force Awakens. The scenes on Jakku were shot in the deserts of Abu Dhabi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}