{"url": "Jakku_Raider_Speeder", "categories": ["Category:Canon articles", "Category:Landspeeders"], "nodes": [{"tag": "h1", "text": "Jakku Raider Speeder"}, {"tag": "p", "text": "Jakku Raider Speeders were a model of landspeeder built from scavenged parts that were used on the desert planet Jakku."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Jakku Raider Speeder was a landspeeder built from scavenged parts that was then customized to survive harsh desert terrains, but only a few were ever made. They were white in color, with two steering vanes at the front, and the engines on either side of the rear. The driver's seat was located between the engines, next to a single passenger seat and beneath a corroded sunshield and rollbar."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 34 ABY, one such speeder drove past Niima Outpost on Jakku just as the scavenger Rey and the astromech droid BB-8 were arriving together. The outpost was attacked shortly afterwards by the First Order military faction, who were searching for BB-8."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jakku Raider Speeder was created for the film Star Wars: Episode VII The Force Awakens, which was released in North America on December 18, 2015. It was first seen by the public in toy form as part of the The Force Awakens toy line made by Hasbro Inc. and released as part of the \"Force Friday\" promotional event on September 4, 2015. The toy was simply titled \"Desert Landspeeder\" and included a detachable laser cannon located above the steering vanes."}, {"tag": "p", "text": "The speeder also appears in a promotional video made exclusively for Facebook for the film."}, {"tag": "p", "text": "The speeder then received its full name in the reference book Star Wars: The Force Awakens: The Visual Dictionary, which was written by Pablo Hidalgo and released in conjunction with the film. The speeder also appeared in various other tie-ins to the film, including the Jakku Spy and LEGO Star Wars: The Force Awakens non-canon video games, the latter of which included it as an unlockable vehicle the player could ride."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}