{"url": "Jakobeast/Legends", "categories": ["Category:Legends articles", "Category:Creatures of the Outer Rim Territories", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Force-sensitive creatures", "Category:Herd and pack creatures", "Category:Mammals", "Category:Non-sentient species", "Category:Snow and tundra creatures"], "nodes": [{"tag": "h1", "text": "Jakobeast"}, {"tag": "p", "text": "Jakobeasts were Force-sensitive arctic herd animals found in the tundras of icy planets in the Outer Rim. Jakobeasts were introduced by colonists that sought herd animals capable of defending themselves. As a result of the settlers' efforts, the creatures spread to hundreds of worlds, occasionally surviving long after the settlers themselves had vanished into history."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "A large, shaggy creature roughly the size of a bantha, a jakobeast's fur was very fine and shining, and striped in gray and white to provide camouflage on the tundra. Two thin tusks emerged from its jaw. Highly sensitive and extremely strong, the tusks were used to forage for vegetation in the packed snow and ice. Two horns swept back from the crown of the head. Black, ribbed, and elongated, the horns were used to establish dominance within a herd, and could be used to channel the Force into a unique defense against predators. Collectively, the jakobeasts gathered energy to repulse attackers, generating a massive Force Push. When attacked by wampas or snow-white arctic nighthunters, the herd would surround its young while the elder bulls turned outward to face the threat. Jakobeasts could aid one another in generating the Force Push, creating a massive wave of pressure capable of bowling over an entire forest. After being repeatedly hurled to the ground by an invisible force, all but the most determined predators would seek easier prey."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jakobeasts were domesticated primarily for their meat, milk, and fur. While excellent livestock, they were ill-suited to serve as mounts, guards, or attack animals. In the wild, jakobeasts were hunted for their horns, which supposedly possess mysterious properties. Poachers typically killed a jakobeast, stole its horns, and left the carcass to rot with the spring thaw. Fringers who depended on jakobeasts for their own survival on cold-swept planets learned to hate these poachers."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}