{"url": "Jakoli/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Bounty hunters", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Jakoli"}, {"tag": "p", "text": "Jakoli was a male Rodian bounty hunter who lived during the Clone Wars. He was known for never bringing anyone back alive. This was Count Dooku's introduction to him on Serenno prior to the bounty hunters entering The Box."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jakoli grew up in the jungles of Rodia, where he survived by being as ruthless as possible. He never took any chances when he was going after a bounty, and always killed it even if it was wanted dead or alive."}, {"tag": "p", "text": "Eventually, his success as a bounty hunter caught the attention of Count Dooku who wanted him to compete with other bounty hunters in the Box, a death machine designed by Moralo Eval that was located on Serenno to win the honor of kidnapping Supreme Chancellor Palpatine."}, {"tag": "p", "text": "Once he got to Serenno, he witnessed Cad Bane murder another bounty hunter called Bulduga to get his hat. After that, Dooku briefed everyone on the challenge the bounty hunters had to face including telling them about The Box. They were all deprived of their weapons and soon they entered The Box. Their first challenge was to escape a room that was filling with dioxis gas. Platforms began to rise from the ground and all the bounty hunters including Jakoli climbed on top of them. Another bounty hunter, Rako Hardeen who was actually Jedi Master Obi-Wan Kenobi in disguise found a secret tunnel underneath the ground. All the hunters followed him through the tunnel, thus surviving the first round."}, {"tag": "p", "text": "In the second round, ledges began to slide out of the walls with a sword resembling a lightsaber swinging around on its front. Bulduga's brother Onca quickly fell prey to the blades. As before, Hardeen saw an open tunnel on the ceiling. Using the ledges, he and Bane hopped to the top towards the tunnel with the other bounty hunters following behind. Bounty hunters Kiera Swan and Sinrich were killed, but Jakoli escaped the challenge along with the remaining bounty hunters."}, {"tag": "p", "text": "The third challenge involved the whole room being ray-shielded and the walls closing in. The switch to deactivate the shields was located in a shaft in the wall behind a smaller ray-shield. Eval provided a special serum that, if injected can provide the person temporary immunity to the ray-shields. Platforms began to rise out of the center of the ground. Jakoli was standing on the side of the room because he was trying to find a secret way past the shield as he walked to the far wall, and watched as the other hunters rose higher above him. However, the ground he stood on became ray-shielded and he got electrocuted which instantly killed him. His body was last seen rising along with the pillar that rose granting access to the switch before it fell back into the ray shields below."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jakoli was voiced by Dave Filoni, the supervising director of the Star Wars: The Clone Wars TV series, who also voiced Embo in the episode \"The Box\". Jakoli's body model was a repainted and modified model of Greedo, another Rodian who appeared earlier in the series in the episode \"Sphere of Influence\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}