{"url": "Jal_Shey", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Force-based organizations"], "nodes": [{"tag": "h1", "text": "Jal Shey"}, {"tag": "p", "text": "The Jal Shey were an ancient order of users who studied the Force from a purely intellectual perspective, forsaking the more spiritual paths taken by the Jedi and Sith. Jal Shey were typically more known for diplomacy, on par with the greatest Jedi negotiators, but, unlike the Jedi and Sith, they were less successful in physical pursuits, even where the Force was involved. The Jal Shey were also a nomadic group, traveling the galaxy in search of new locations to study the Force, and they were particularly selective about recruiting new members."}, {"tag": "p", "text": "Because they lacked the physical abilities of the Jedi, Jal Shey members often wore various types of armor to protect themselves. They also created other devices such as Jal Shey meditation gloves and Jal Shey belts to further augment their physical abilities, imbuing them with the Force. The Jal Shey were known to have three ranks: mentors, advisors, and neophytes. The organization survived into the time of the Galactic Empire but was considered a viable target for Imperial persecution in the midst of the Great Jedi Purge. Imperial commander Roly Melusar at one point contemplated dispatching Imperial commandos in pursuit of the Jal Shey."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Jal Shey order was considered one of the oldest Force-using traditions as early as 4000 BBY. By the time of the Jedi Civil War, they were known to be widespread and items crafted by them could be found across the galaxy. They were nomadic by nature and did not settle for long in any particular place. Instead, they searched for places that could improve their understanding of the Force. Yet the Jal Shey were not only scholars and observers of the Force; they also participated in the life of the society in which they operated, using their knowledge to help improve the lives of beings around them. The Jedi largely considered them just another Force-using sect comparable to the Zeison Sha. Following the Great Sith War, they roamed the galaxy and were regarded as militant, but retained their philosophy of viewing the Force intellectually rather than spiritually. The Mabari, an order of warrior knights that lived on the planet Zolan, eventually developed from Jal Shey teachings. The Jal Shey remained in existence circa 19 BBY, during the formation of the Galactic Empire. Roly Melusar, commander of the Imperial Commando Special Unit, at one point considered dispatching his Imperial commandos to hunt down other Force-users besides Jedi; his list included the Altisian Jedi and Jal Shey."}, {"tag": "h2", "text": "Hierarchy"}, {"tag": "p", "text": "The Jal Shey categorized themselves into three different classifications. Mentors were known for their intelligence and understanding of the Force and were considered an equivalent to the rank of Jedi Master. Peet Sieben was one known Jal Shey mentor. Advisors were assigned to diplomatic missions and could be encountered throughout the galaxy. Neophytes were new acolytes who studied with mentors until they were ready to accept investigative and diplomatic missions of their own."}, {"tag": "h2", "text": "Philosophy"}, {"tag": "p", "text": "The Jal Shey were considered especially adept at diplomacy, negotiation, and spirited debate. Jal Shey could be found acting as negotiators in disputes ranging from simple arguments to negotiated settlements of great complexity, including wars. They were regarded as particularly skillful at diplomacy and comparisons were made between Jedi and Jal Shey negotiators. With the use of the Force, they could often catch their opponents off guard, allowing them to keep any potential opponents off-balance."}, {"tag": "p", "text": "The Jal Shey recruited Force-users from a variety of worlds and species, but they were selective, choosing only those who they believed would accept the Jal Shey way of life and contribute to their scholarly and diplomatic efforts. Individuals they saw as tainted with the dark side and those who presented an affinity for combat were typically not selected. They were not known for being particularly numerous."}, {"tag": "p", "text": "They did not consider themselves tied to one location, but instead moved from one destination to the next in search of places that would improve their understanding of the Force. Studying such things as Force nexuses, the history of certain species, and other Force traditions, Jal Shey used their vast knowledge of the Force to help others reach their full potential."}, {"tag": "p", "text": "Many Jal Shey learned basic lightsaber techniques for defense, but they rarely specialized in them. Unlike the Jedi, the Jal Shey shunned physical pursuits, preferring to hone their understanding of the Force, negotiate settlements, and imbue items with the Force."}, {"tag": "p", "text": "Due to their lack of emphasis on physical exercise or combat, they preferred to use their talents to create armor, belts, and other items to augment their own Force powers. The Jal Shey eventually learned how to produce items that not only enhanced the abilities of the creator when worn, but would benefit any who wore or wielded them. Even robes created and worn by Jal Shey could provide a positive benefit to the wearer. Jal Shey perception gloves or meditation gloves were worn during meditation and served to augment the user's awareness, while both regular Jal Shey belts and the more effective belts worn by mentors could provide one with mental fortitude against the dark side of the Force. The light armor worn by Jal Shey was, like the Jal Shey themselves, described as having an aura of dignity and competence, and did not restrict the use of Force powers by the wearer. There were multiple types of armor, depending on the rank of Jal Shey, and each successively higher rank was more beneficial to the user than that of lower ranks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "There are many player-usable items in Knights of the Old Republic II created by the Jal Shey. As their armor does not inhibit Force powers like most armor, Jal Shey items can be useful to characters specializing in Force skills. The Jal Shey themselves did not directly appear in the game, although a brief description of their philosophy was given in the in-game description of each item."}, {"tag": "p", "text": "The Jal Shey had later appearances in the Knights of the Old Republic Campaign Guide and one of its web enhancements, which expounded upon their backstory. The campaign guide also served to provide the Jal Shey with known Force talents and expounded upon their role in the galaxy. They were mentioned in the sourcebook Scum and Villainy, and also had a brief entry in The Complete Star Wars Encyclopedia, which described them as being \"militant\" and roaming the galaxy in the years after the Great Sith War."}, {"tag": "p", "text": "Author Karen Traviss mentioned them in two of her novels, Star Wars: The Clone Wars and Imperial Commando: 501st. In particular, those novels identified an individual Jal Shey mentor, Peet Sieben, and established that the Jal Shey were still an active Force-using sect as of 19 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}