{"url": "Jamaane_coup", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Changes of government", "Category:Yuuzhan Vong culture"], "nodes": [{"tag": "h1", "text": "Jamaane coup"}, {"tag": "p", "text": "The Jamaane coup was a coup against Supreme Overlord Quoreal by Domain Jamaane which made Shimrra Jamaane the Supreme Overlord of the Yuuzhan Vong. It occurred in 29 BBY."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "After the discovery of Zonama Sekot by Supreme Commander Zho Krazhmir, Quoreal was reluctant to send the Yuuzhan Vong across the void to conquer what was to be their new home because of the supposed threat that Zonama Sekot would present to them. He argued that the presence of a living world would doom the Yuuzhan Vong. When he voiced his desire not to invade, he quickly became unpopular among the Yuuzhan Vong. Even if the Yuuzhan Vong had heeded their Overlord's demands, there were serious logistical problems, as the Yuuzhan Vong worldships were dying, and they did not have time to find a new galaxy."}, {"tag": "h2", "text": "The coup"}, {"tag": "p", "text": "Shimrra, Domain Jamaane's leader and a candidate for the Overlordship, insisted that the Yuuzhan Vong invade the galaxy immediately, believing they could win a war easily. He had come to realize that Vong society was falling apart, and that a unifying cause was needed for them to rally behind. Shimrra, gathering loyal warrior domains, including Domains Choka, Lah, Shai, and the Praetorite Vong, along with the warriors of Domain Jamaane, launched a sudden attack on Quoreal's warriors. Quoreal was then killed, along with priests loyal to him, and any other so called Quorealists. Shimrra thus became Supreme Overlord of the Yuuzhan Vong, and ordered the Warriors to prepare for the invasion."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the coup, Shimrra erased as much information from the Qang qahsa and other data storage mediums as possible, allowing him and his followers to spread an official, propagandist version of the accession."}, {"tag": "p", "text": "Although Shimrra supported continuing the plans for the invasion, it was nearly fifty years until it actually began."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}