{"url": "James_Howe", "categories": ["Category:Real-world articles", "Category:Young Reader authors"], "nodes": [{"tag": "h1", "text": "James Howe"}, {"tag": "p", "text": "James Howe (born August 2, 1946, Oneida, New York) is an American author of several juvenile and young adult books, who wrote How the Ewoks Saved the Trees: An Old Ewok Legend."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "At the age of nine or ten, Howe wrote a play based on the \"Blondie\" comic strip as well as a variety of short stories and self-published newspapers, his favorite being \"the Gory Gazette,\" made for a self-founded club: Vampire Legion. Howe would continue to write plays during his theater studies at Boston University, and eventually move to New York City to pursue a career as an actor and model while directing plays and working as a literary agent."}, {"tag": "p", "text": "In the mid-70s, Howe's wife, Deborah, encouraged him to create a children's story based on the Dracula movies of the 70s. With his wife, he created Bunnicula: A Rabbit Tale of Mystery, about a pet rabbit suspected of being a vampire. The book would go on to win more than ten Children's Choice awards, including the Dorothy Canfield Fisher Award and the Nene Award, and eventually evolve into a series. Shortly after Bunnicula was published Deborah fell victim to cancer and died, inspiring the creation of The Hospital Book."}, {"tag": "p", "text": "In 1981 Howe began writing full-time. In addition to the Bunnicula series, Howe has written picture books, children's novels, nonfiction, adaptations of classic stories, and screenplays for movies and television. Recently he published his first two young adult novels, The Watcher and The Misfits. The Misfits was the inspiration behind GLSEN's annual. After the death of his first wife, Howe remarried and fathered a daughter, Zoey, but eventually divorced."}, {"tag": "p", "text": "In 2007, James Howe was the recipient of The E.B. White Read Aloud Award for Picture Books for his book Houndsley and Catina, illustrated by Marie-Louise Gay, and published by Candlewick Press."}, {"tag": "h2", "text": "Star Wars bibliography"}, {"tag": "h2", "text": "External links"}]}