{"url": "Jamillia", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Females", "Category:Humans", "Category:Monarchs of Naboo"], "nodes": [{"tag": "h1", "text": "Jamillia"}, {"tag": "p", "text": "Jamillia was a human female who served as the Queen of Naboo during the final years of the Galactic Republic. She ran for the office of queen as Padmé Amidala's term ended, but lost to Réillata. Jamillia later served as queen at the outbreak of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A human female, Jamillia hailed from the planet Naboo. When Queen Padmé Amidala, elected sovereign of Naboo, finished her two two-year terms, her people tried to amend their constitution so she could remain in office. However, Amidala declined the honor, and Jamillia ran for the position of Queen, but lost to Réillata. Sometime later Jamillia ran again and was elected queen."}, {"tag": "p", "text": "Ten years after the Invasion of Naboo, Amidala was the victim of an attempted assassination by the Confederacy of Independent Systems, a coalition of star systems that wished to secede from the Republic. With Amidala's life threatened, both the Supreme Chancellor of the Republic and the High Council of the Jedi Order sent her to a secure retreat on Naboo. At the beginning of Amidala's sojourn, Jamillia met her predecessor in the Royal Palace, and the two discussed the probability of an imminent full-scale conflict between the Republic and the Separatists. Not long afterwards, those concerns came true as the Clone Wars broke out between the two factions. After a four-year reign, Jamillia was succeeded by Queen Neeyutnee."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Queen Jamillia was relatively small, measuring 1.57 meters. She had a round face with full lips, a narrow chin and pronounced cheeks. Both her hair and eye color were dark brown. She was an ardent defender of democracy, and she also genuinely cared for the safety of her senator, Padmé Amidala."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Jamilla wore a black robe and a golden headress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jamillia was portrayed by Indian actress Ayesha Dharker in the 2002 film Star Wars: Episode II Attack of the Clones. In some early scripts of Episode II, the character was identified as \"Jamilla.\" Dharker spent a month in Australia, a week-and-a-half in Lake Como and then a few days in Caserta, Italy for only half-a-day of shooting."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}