{"url": "Jang_Li-Li", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Wookieepedia Good articles under probation", "Category:Females", "Category:Humans", "Category:Jedi Generals", "Category:Pilots", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Jang Li-Li"}, {"tag": "p", "text": "Jang Li-Li was a Human female Jedi Knight who served as a Jedi General in the Clone Wars. In her youth, she was trained by many Masters at the Jedi Temple, Dooku being one of them. Li-Li died when her starfighter was destroyed by the Confederate-allied Dark Jedi Asajj Ventress, who later scoured the debris and found Li-Li's severed hand still clutching her lightsaber's charred handle. Ventress took Li-Li's remains and lightsaber to Count Dooku, the Head of State of the Confederacy. Dooku mourned her passing and sent Li-Li's lightsaber to Jedi Grand Master Yoda with a concealed holorecorder. In the holographic message, Dooku asked to meet with Yoda on the planet Vjun to discuss a ceasefire to the war."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human female Jang Li-Li was a Jedi Knight who lived during the waning years of the Galactic Republic. She underwent training in the Jedi Temple on the planet Coruscant in her youth. She was one of the one of the many students Dooku helped train as a Jedi Master. At some point in her studies in the temple, Li-Li became good friends with fellow Jedi trainee Politrix."}, {"tag": "p", "text": "Her first assigned responsibility as a Jedi was a diplomatic mission to Sevarcos, for which she began by seeking advice from her mentor, Dooku—considered to be one of the strongest and wisest Jedi of the Order—before going. Dooku thought of her as a beautiful young woman with a lot of potential, someone who would do well in life."}, {"tag": "p", "text": "During the Clone Wars, the Jedi were tasked with leading the clone troopers of the Grand Army of the Republic, and Li-Li served as a Jedi General. Shortly before leaving the Temple on a mission, Li-Li shared kitchen duties with her colleague, Maks Leem.  Sometime in 19.49 BBY, Li-Li was flying her starfighter in deep-space when her ship's reactor chamber was shot by Confederate-allied Dark Jedi Asajj Ventress from her personal starfighter Last Call, causing it to explode and kill Li-Li."}, {"tag": "p", "text": "Seeking to collect a trophy from what would be the sixteenth Jedi she had killed, Ventress spent hours searching the debris field and was able to find Li-Li's severed hand clutching her partially destroyed lightsaber handle. Ventress took the hand and lightsaber to Count Dooku, who was the leader of the Confederacy. He found himself mournful of her death, remarking that many lives were made better because Li-Li lived her life in service. Packing the remains of Li-Li's lightsaber inside an incendiary packet, Dooku sent a Troxan diplomat to personally deliver the packet to the Jedi Order's Grand Master, Yoda."}, {"tag": "p", "text": "Arriving on Coruscant, the Troxan diplomat was barred entry to the temple by the assigned youngling, Whie Malreaux, on sentry duty. Malreaux diffused the standoff by calling for his Master, Leem, who used the Force to calm the agitated diplomat and assured him that she will deliver the packet herself. She found the Grand Master meditating in the Room of a Thousand Fountains, and when Yoda opened the packet, he recognized Li-Li's lightsaber and was saddened by her passing. Leem herself wished that Li-Li became one with the Force where she could be happy, safe and free. After Leem had left the room, Yoda activated the lightsaber, prompting a holorecording of Dooku to appear, asking his former Master to meet with him on the planet Vjun to discuss a ceasefire to the war. Contemplating Dooku's offer, Yoda went back to his meditation and as he sank deeper into the Force, one of the thoughts that he remembered was of a young eight year old Li-Li, gleefully creating rainbows in the room by puffing water with her mister."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Dooku remembered Jang Li-Li as an attractive young woman with distinctive and steady gray eyes. When she was young, Li-Li had a carefree attitude, and was excited and happy at the thought of being able to create rainbows using a plant mister. Moments before her death, Li-Li's first reaction was to grab her lightsaber. Ventress later commented on how unusual this was and attributed it to the Jedi's instinctive habit."}, {"tag": "p", "text": "Jang Li-Li also had a sense of humor. On her last stay at the Temple, she was assigned to kitchen duty with Jedi Maks Leem. While picking vegetables for the evening dinner, Li-Li made light of their duty by jokingly asking Leem whether shelling Antarian peas using the Force would be considered an abuse of power."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Trained as a Jedi since her youth at the Jedi Temple on Coruscant, Jang Li-Li was fully capable of utilizing the Force. Even on her first diplomatic mission, she managed to make an impression on Dooku, who at the time was considered to be one of the most exceptional Jedi in existence. He believed that Li-Li had great potential and would do well as a Jedi. Li-Li was also an accomplished pilot."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "After becoming a Jedi Knight, Jang Li-Li crafted a lightsaber containing a blue crystal. When she died, Dooku modified her partially destroyed lightsaber by outfitting it with a holorecorder to deliver a private message to Yoda."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jang Li-Li was a character created by author Sean Stewart for the 2004 novel Yoda: Dark Rendezvous."}, {"tag": "p", "text": "According to Li-Li's entry in The Complete Star Wars Encyclopedia, published in 2008, she accompanied Jedi Master Jai Maruk on a mission to Vjun to investigate the buildup of Separatist forces in the sector. In the novel, however, Maruk's debriefing report to the Jedi High Council stated that he was alone in his mission. This article assumes that the novel version is correct, since Li-Li's encyclopedia entry also stated that she was captured by Asajj Ventress and later engaged the Dark Jedi in single combat, whereas in the novel, only Maruk fought and was later captured by Ventress, and Li-Li was killed when Ventress vaporized her ship."}, {"tag": "p", "text": "In Yoda: Dark Rendezvous, Dooku remembered Li-Li as having gray eyes, while Maks Leem recalled that she had almond-colored eyes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}