{"url": "Jango_Fett", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles in need of updating", "Category:Assassins", "Category:Bounty hunters", "Category:Confederacy of Independent Systems individuals", "Category:Foundlings", "Category:Humans", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Jango Fett"}, {"tag": "p", "text": "Jango Fett was a  Mandalorian human male bounty hunter and the clone template of the Grand Army of the Republic. Known as the best bounty hunter in the galaxy during the final years of the Galactic Republic, Fett was proficient in marksmanship as well as unarmed combat. The Mandalorian armor that he wore featured various weapons and gadgets, including a flamethrower, dual WESTAR-34 blaster pistols, and a jetpack. His personal starship was the Firespray-31-class patrol and attack craft Slave I."}, {"tag": "p", "text": "Hailing from the planet Concord Dawn, Fett was a foundling of the Mandalorians and at one point fought in the Mandalorian Civil Wars before becoming a bounty hunter. Prior to the Clone Wars, the Sith Lord Darth Tyranus hired Fett to serve as the genetic foundation of an army secretly bred on the extragalactic world of Kamino. His DNA spawned millions of clone troopers who shared his face, voice, and were trained to become soldiers. As part of his payment, Fett was given an unaltered clone whom he raised as his son, Boba Fett. In the last days of the Separatist Crisis, Fett was involved in the failed plot to assassinate Senator Padmé Amidala on Coruscant. The Jedi Order investigated the incident, forcing Fett to leave the Kaminoan homeworld after he was confronted by Jedi Knight Obi-Wan Kenobi."}, {"tag": "p", "text": "Kenobi tracked Fett to Geonosis where he discovered the bounty hunter's connection with Count Dooku and the Confederacy of Independent Systems. Fett fought against the Jedi assault team during the First Battle of Geonosis, and was beheaded by Jedi Master Mace Windu in 22 BBY. His legacy survived not only through the millions of clone troopers that formed the backbone of the Republic Military, but also Boba, who became a bounty hunter like his father before him. By the era of the Galactic Empire, Boba possessed the same set of Mandalorian armor worn by Jango, although its appearance had been altered significantly."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jango Fett was born in the years prior to the Invasion of Naboo, on the planet Concord Dawn. Though he told others he came from this Mandalorian world, his exact history remained unknown, much to Fett's enjoyment. At some point, he was taught by a mentor and became a Mandalorian foundling, participating in the Mandalorian Civil Wars. Given his own set of Mandalorian armor, Fett served as a Mandalorian commando but eventually pursued a career as a bounty hunter. Although he retained his Mandalorian armor, Prime Minister Almec of the New Mandalorians disavowed any connection to Fett, claiming that he was simply a bounty hunter who had somehow stolen an artifact from Mandalore's troubled past."}, {"tag": "p", "text": "Fett rose to the top of the bounty hunting trade, where he used his advanced armor and twin blaster pistols to hunt down fugitives. At some point in his career Fett began to work with Zam Wesell. At another, Jango Fett was also an associate of pirate captain Hondo Ohnaka and fellow bounty hunter Aurra Sing. Cad Bane, a Duros who was a major bounty hunter by the time of the Clone Wars, came to owe Fett several favors that he never payed off. Ultimately, Fett became widely regarded as the best bounty hunter in the galaxy, but this notoriety eventually drew the attention of the Sith."}, {"tag": "h3", "text": "Separatist Crisis"}, {"tag": "h4", "text": "Clone template"}, {"tag": "p", "text": "Shorty after the Invasion of Naboo, and in the years before the Clone Wars, on the moons of Bogden, Fett was recruited by the Sith Lord Darth Tyranus (the Sith identity of Count Dooku) to be the genetic template for the clone army created by the cloners of the planet Kamino. Fett agreed and, in addition to his fee of twenty million credits, also requested an unaltered clone for himself, one who was not subjected to the typical growth acceleration and behavioral modifications given to the clone troopers. Fett raised this clone as his son, whom he named Boba Fett, and remained on Kamino to supervise the flash-training of the clone troopers. The only other known clone who was effectively an unaltered copy of Fett was an enhanced female clone named Omega. The Kaminoans did not question Tyranus' decision for the clone template, given that Fett was known as the best bounty hunter in the galaxy at the time."}, {"tag": "p", "text": "All of the training programs that his clones went through were designed with input from Fett. Despite providing the genetic template for and overseeing the training of the clones, Fett felt no particular pride in them and viewed them as the Kaminoans' achievement. By tampering with Fett's genetic samples, the Kaminoans ensured that his clones aged twice as fast while possessing less independence than their donor. Aside from these modifications to their genetic structure, the clones were otherwise physically identical to Fett. The first battalions consisted of two-hundred thousand units; in time Fett's clones numbered in the millions. Notwithstanding Fett's view of his clones as cannon fodder, Taun We and Prime Minister Lama Su considered them magnificent, calling them one of the finest armies ever grown on Kamino."}, {"tag": "h4", "text": "Training Boba Fett"}, {"tag": "p", "text": "Fett continued to take jobs as a bounty hunter, which spread confusion throughout the bounty hunting community, as rumors had spread that Fett had a job with a mysterious client. A hunter named Neelda assumed Fett simply was not satisfied by doing only one job, although Fett was also looking to use such jobs to help in training Boba."}, {"tag": "p", "text": "At some point during Boba's childhood, Fett brought him along on a mission to retrieve a Twi'lek girl who had run away from home with her Falleen lover Griph. Fett and his son traveled to Telerath where they met with the team of bounty hunters they would be completing the mission with, a Rodian named Neelda, a Gand named Rinn, and a Chadra-Fan named Tiver. The three bounty hunters agreed to let Fett bring Boba along on the mission, and the group departed for Ord Mantell."}, {"tag": "p", "text": "During the flight from Telerath to Ord Mantell, Boba complained to Fett about having to work with the three bounty hunters, asking why they could not work with bounty hunters like Cad Bane, Zam Wesell, or Aurra Sing instead. Fett explained to his son that the point of the mission was to teach Boba about adapting to unknown conditions, hence working with bounty hunters Boba did not know."}, {"tag": "p", "text": "On Ord Mantell, Fett and his team quickly tracked the Twi'lek and Griph to a bar where the two were discussing their plan to join Black Sun. While Boba and the trio of hunters cornered the lovers on the bar's balcony, Fett waited below in case his hunch was correct that the Twi'lek girl would jump. When she fell from the balcony, Fett caught and stunned her. Fett then brought her unconscious body to Slave I in order to bring her back to her father."}, {"tag": "p", "text": "Reuniting with his son and the other hunters, Fett and Boba were betrayed by Rinn and Tiver. Tiver pinned Boba, commanding Fett to give them the Twi'lek girl and forfeit his share of the bounty or she would kill his son. Fett, confident in his son's abilities, told her she could try to kill him. Boba, having hidden a small blaster on himself before the mission, killed both Tiver and Rinn before turning his blaster on Neelda. Boba asked Fett for guidance, and Fett told him that what happened to Neelda was his choice. Because Neelda had not aided Tiver and Rinn but also had not opposed them, Boba allowed Neelda to leave alive but without his share of the bounty."}, {"tag": "p", "text": "As Fett and his son left Ord Mantell to collect their bounty, the two discussed how Boba had done on the mission. Boba asked if he had done all right despite what had happened, and Fett told Boba that he had shot well, trusted his judgement, and started to build his reputation. Fett said that a father could not ask for a better start to his son's legacy."}, {"tag": "h4", "text": "Assassination plot"}, {"tag": "p", "text": "Towards the end of his life, Fett was involved in the assassination attempts against Senator Padmé Amidala, who was secretly being targeted by Dooku at the request of Nute Gunray of the Trade Federation. Fett had subcontracted the Clawdite bounty hunter Zam Wesell to carry out these attempts. After Wesell failed to kill Amidala upon the Senator's arrival to Coruscant, Fett provided her with a pair of deadly kouhuns and tasked her to kill Amidala in her sleep. The plan was foiled by two Jedi that had been assigned to protect the Senator, Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker. Wesell fled, but was apprehended by the Jedi after a lengthy pursuit throughout Coruscant. However, before she was able to reveal the identity of her employer to the Jedi, Fett killed her at a substantial distance with a Kamino saberdart."}, {"tag": "h4", "text": "Discovered by the Jedi"}, {"tag": "p", "text": "As part of a Jedi investigation into the assassination attempts, Fett was tracked back to Kamino by Kenobi after the Jedi was able to determine the Kaminoan origins of the saberdart used to kill Wesell. There, the two met under civil circumstances at Fett's apartment in Tipoca City. Fett was questioned by Kenobi, who wished to know the details surrounding the creation of the clone army and Fett's knowledge of Jedi Master Sifo-Dyas. After speaking to Boba in Fett Code, the bounty hunter only told Kenobi that he had never heard of anyone named Sifo-Dyas, and that he was recruited by someone called Tyranus. After Kenobi left, Fett told Boba they were leaving. However, on the landing platform where Fett's ship, Slave I, was docked, they were ambushed by Kenobi. The two battled for a short time before Kenobi went over the edge of the landing platform, giving Fett an opportunity to escape. Fett was followed to the planet Geonosis by Kenobi, who had placed a homing beacon on Slave I's hull. Fett led Kenobi on a prolonged chase through Geonosis' asteroid field and eventually locked onto his ship with a missile, believing Kenobi to have perished."}, {"tag": "h4", "text": "Death on Geonosis"}, {"tag": "p", "text": "Fett later captured Skywalker and Amidala in the droid factory on Geonosis during their attempt to rescue Kenobi, who had been taken prisoner by the Separatists. In the Petranaki Arena, during the scheduled execution of Amidala, Kenobi, and Skywalker, Jedi Master Mace Windu led a Jedi assault team to rescue the three prisoners in what would be the first battle of the Clone Wars. Fett protected Dooku during the skirmish, killing Jedi Master Coleman Trebor before joining the melee in the arena and attacking Windu. Fett tried to take Windu's lightsaber, but was run over by a stampeding reek. The reek charged at Fett a second time, who dispatched it with one shot. Fett was then rushed by Windu and began firing at the Jedi, who deflected the bounty hunter's shots. Fett attempted to use his jetpack to get away, but was unaware of the malfunction caused by the reek, and was subsequently killed by Windu, who first cut his blaster in half and then decapitated him, with his headless corpse falling to the ground seconds later.  After the battle quieted down, Boba cradled his father's helmet and mourned his death."}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Era of the Clone Wars"}, {"tag": "p", "text": "After the death of Fett, his legacy was carried on by the millions of clone troopers that had been made in his image. They went on to form the backbone of the Grand Army of the Republic, which the Jedi Order held authority over through their new title as Jedi Generals. They were loyal to the Republic and the Jedi, and the Jedi encouraged Fett's clones to embrace their individuality instead of thinking in lockstep."}, {"tag": "p", "text": "During Kenobi's visit to the planet Mandalore, he had a brief conversation with Prime Minister Almec about the late Jango Fett. Almec declared that Fett was just a common bounty hunter rather than a Mandalorian despite the armor he wore."}, {"tag": "p", "text": "Fett's death inspired Boba to pursue a vendetta against Windu for the murder of his father. He teamed up with Sing, the Trandoshan bounty hunter Bossk, and the Klatooinian bounty hunter Castas in order to avenge his father's death. Boba infiltrated Windu's Star Destroyer, the Endurance, above the world of Vanqor and sabotaged it, causing it to crash on the planet's surface. He then attached a bomb to Jango's helmet and placed it in the bridge of the Endurance for Windu, hoping that when Windu came looking for survivors he would be killed by the bomb. However the attempt was unsuccessful and Jango's helmet was blown to pieces with one side of the helmet remaining."}, {"tag": "p", "text": "By the end of the Clone Wars, the fall of the Republic was complete. The Sith used their secret weapon, the clones of Jango Fett, to exterminate the Jedi. Supreme Chancellor Sheev Palpatine—the Sith Lord Darth Sidious—triggered the clones' secret programming through Order 66, the directive to kill all members of the Jedi Order on sight. Following the success of Order 66 and the Republic's transformation into the Galactic Empire, the remaining Fett clones became the first generation of Imperial stormtroopers. Subservient to the will of the new Galactic Emperor, they enforced the laws of the New Order and suppressed Sidious' enemies during the early days of the Imperial Era. In the end, however, the clones were decommissioned and replaced with natural-born human recruits."}, {"tag": "h4", "text": "Boba Fett, the galaxy's best hunter"}, {"tag": "p", "text": "Jango's ship, Slave I, saw frequent use in the Clone Wars and later the Age of the Empire. It was initially inherited by Boba, who used it during the war along with Aurra Sing, but Sing crash landed it on the surface of Florrum during a fight with the Padawan Ahsoka Tano. Hondo Ohnaka, the leader of the pirate Ohnaka Gang, dragged Aurra from the wreckage of the ship and rebuilt the vessel, adding it to his personal fleet of ships. In the last year of the Clone Wars the Separatists invaded Florrum and destroyed Hondo's arsenal, prompting him to escape the planet in Slave I. Sometime later, Boba reclaimed the ship and continued using it to carry out bounties for the Empire."}, {"tag": "p", "text": "Boba followed in his father's footsteps and became a freelance bounty hunter. By the time of the Galactic Empire, Boba was widely considered to be one of the deadliest bounty hunters in the galaxy, and, like Jango before him, Boba came to be seen as the galaxy's best bounty hunter. Boba used his father's name when he posed as a pit fighter on Nar Shaddaa, remembering holding Jango's empty helmet on Geonosis after his death before entering the pit. Shortly afterward, seeking to collect a bounty placed on Boba by crime lord Jabba Desilijic Tiure, bounty hunters Zuckuss and 4-LOM placed a charge on the Slave I, creating a trap that slightly damaged the vessel. Fett was angered, believing they had disrespected the ship and reminding them that it had belonged to his father."}, {"tag": "p", "text": "Fett was defeated combating the Rebel Han Solo on the planet Tatooine, but Boba was able to survive being devoured by the sarlacc. His armor, once that of Jango's, was scavenged by Jawas and claimed by Cobb Vanth, though Vanth later gave the armor to Din Djarin as payment for helping to take down a krayt dragon. Boba used Slave I to go to Tython in order to reclaim the armor from Djarin. He used the armor's inputted Mando'a chain code which included his and Jango's respective designations to prove to Djarin his rightful claim to the armor. Djarin then upheld his claim, noting that Jango was a foundling, and that Boba was of Mandalorian heritage."}, {"tag": "p", "text": "Shortly thereafter, Boba defended his claim to his armor from Bo-Katan Kryze and Koska Reeves after he doubted Kryze could reclaim Mandalore, noting that the armor belonged to Jango. However, Kryze referred to Jango as Boba's donor instead of his father and insulted him for being a clone, which irritated Boba and caused him to provoke Reeves into fighting him by threatening Kryze."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jango Fett was a calm, analytic, and crafty mercenary, as well as  an expert fighter, and reputedly, the best bounty hunter in the galaxy. He was also an honorable man according to his friend, the pirate Hondo Ohnaka. As a combatant, he was proficient in both marksmanship and unarmed combat. By the time of the Separatist Crisis, his face had several scars that he chose to conceal with a Mandalorian helmet. In combat, Fett favored the advantage of speed and height that his jetpack provided him with against his opponents. During a bounty hunting assignment, he warned Zam Wesell to be careful when handling a pair of poisonous kouhuns. However, he later killed his partner to prevent Wesell from revealing his involvement in Amidala's assassination attempt to her Jedi captors."}, {"tag": "p", "text": "As a mercenary, Fett favored financial rewards for his services. Although he was generously compensated for his service as a clone template, he surprised his Kaminoan benefactors by requesting the creation of a clone for himself. This clone was unaltered in accordance with Fett's wishes, unlike the others who were modified for growth acceleration and enhanced docility. Fett provided the clone with a name, Boba Fett, and chose to raise him as his own. He cared greatly for his son, who learned combat skills and ruthlessness from the elder Fett, in contrast to the clone troopers that Fett called \"livestock bred as cannon fodder.\""}, {"tag": "p", "text": "He was loyal to his employers whilst they retained his service as a mercenary. After Wesell failed in her first attempt on Amidala's life, Fett set a new plan into action and emphasized to his partner that their employer's patience was waning. He later served as Count Dooku's personal bodyguard during the battle between the Jedi and Separatists. Despite his combat skills, Fett was no match for Mace Windu—the Jedi Order's greatest champion—who severed the hunter's head from his neck with one swing of his amethyst-bladed lightsaber."}, {"tag": "p", "text": "Fett was a human male who stood at 1.83 meters. He had black hair, brown eyes, and tan skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Jango Fett wore a set of energized Mandalorian armor and piloted a customized Firespray-31-class patrol and attack craft named Slave I throughout his career, which his son Boba inherited upon his death."}, {"tag": "p", "text": "Fett also carried a vast array of equipment on his person. He owned a pair of customized Concordian Crescent Technologies WESTAR-34 blaster pistols with hollowed-out grips and used a Z-6 jetpack with a built-in missile launcher. Jango was also known to use the JT-12 jetpack which was a lighter weight model of the Z-6. This jetpack was worn in the arena on Geonosis. He used a number of gadgets hidden in his gauntlets, including retractable vibroblades, a whipcord thrower, a wrist mounted grappling hook, and a ZX miniature flame projector."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "Jango Fett, named J'mee in early drafts, made his first appearance in the 2002 film Star Wars: Episode II Attack of the Clones, where he was portrayed by Temuera Morrison."}, {"tag": "p", "text": "Jango's armor revisits the original 1970s-era designs for Boba Fett's armor. It was originally colored white like the clone troopers (a nod to Boba Fett's concept design during the development of The Empire Strikes Back), but at the end, it was changed to silver and blue."}, {"tag": "h3", "text": "Discrepancies"}, {"tag": "p", "text": "Jango Fett was a Mandalorian in the lore of Star Wars Legends. In the \"Creating Mandalore\" featurette on The Clone Wars: Season Two DVD set, however, series director Dave Filoni explained that, according to George Lucas, the Fetts were not Mandalorians. After the creation of the new official Star Wars canon, Pablo Hidalgo of the Lucasfilm Story Group reiterated that the Fetts are not Mandalorians, though they might claim to be. However, Jango was stated to be a Mandalorian in the Z-6 Jetpack entry on the StarWars.com Databank and in Star Wars Helmet Collection 17. In addition, one of the announcement teasers for The Mandalorian described Jango and his son Boba as Mandalorians, leaving their actual status as Mandalorians ambiguous. The discrepancy was resolved in \"Chapter 14: The Tragedy\" of The Mandalorian Season Two, which revealed that Fett was a Mandalorian foundling."}, {"tag": "p", "text": "Ultimate Star Wars is ambiguous on how often Fett worked with Zam Wesell. The book states that Fett and Wesell were sometimes partners and also names Wesell as a frequent accomplice of Fett's."}, {"tag": "h3", "text": "Other appearances"}, {"tag": "p", "text": "Before the cancellation of Star Wars: The Clone Wars TV series, Jango's son Boba was set to star in a four-episode arc featuring him and fellow bounty hunter Cad Bane. During a \"rescue mission\" on Tatooine in order to save a child from Tusken Raiders, the story would emphasize Boba's and Cad's relation to one another as Cad had known Jango."}, {"tag": "p", "text": "In the non-canon video game Angry Birds Star Wars II, Fett's role differs from that in the films. He is present during the events of The Phantom Menace and assists Darth Sidious as his main ally. During the events of Attack of the Clones, his death was changed being accidentally shot apparently by a stormtrooper, rather than beheaded by Mace Windu."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}