{"url": "Jango%27s_grunts", "categories": ["Category:Legends articles", "Category:Mandalorian organizations"], "nodes": [{"tag": "h1", "text": "Jango's grunts"}, {"tag": "p", "text": "\"Jango's grunts\" was the name given to a group of True Mandalorian soldiers under the command of Jango Fett during the mission to Korda Six to rescue pinned-down Kordan Defense Force personnel from hostile territory. A rearguard infantry unit, \"Jango's grunts\" were named as such by the True Mandalorian Montross during the pre-mission briefing; Montross was also responsible for assigning the unit to defend the Mandalorians' extraction point, and provide covering fire for the True Mandalorians' other divisions."}, {"tag": "p", "text": "Despite intelligence reports denoting minimal resistance to be expected, the native Kordans assaulted the True Mandalorian mercenaries in force as they made to land. Amidst the chaos, Jango Fett and his grunts made an improvised push toward the location of the True Mandalorians' targets, only to find a trap laid out for them by the Death Watch, a renegade Mandalorian splinter-faction in sworn opposition to the True Mandalorians. Fett's unit was able to repel the ambush—killing several Death Watch troops using blasters and gauntlet-mounted flamethrowers—and moved to reinforce their fellow True Mandalorians on the battlefield, but failed to reach their leader, Jaster Mereel, before he was mortally wounded by the Death Watch's own leader, Tor Vizsla. As Mereel died, Fett was chosen to succeed him as leader of the Mandalorians, and \"Jango's grunts\" dispersed back into the larger ranks of the True Mandalorian forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Jango's grunts\" were first introduced to Star Wars in the second issue of the Jango Fett: Open Seasons comic book series, written by Hayden Blackman and published June 17, 2002."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}