{"url": "Jango_Fett:_Open_Seasons", "categories": ["Category:Legends articles", "Category:Jango Fett"], "nodes": [{"tag": "h1", "text": "Jango Fett: Open Seasons"}, {"tag": "p", "text": "Jango Fett: Open Seasons is a comic series that delves into the dark past of Jango Fett. Most notably, the series reveals how Fett became a Mandalorian warrior, and how he was recruited by Count Dooku. It is a tie-in to Star Wars: Bounty Hunter video game, which includes a virtual version of the real comic as unlockable content."}, {"tag": "p", "text": "The series is composed of 4 issues released between May and September 2002, and compiled in a trade paperback edition in January 2003."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "'Jango Fett: Open Seasons 1'"}, {"tag": "p", "text": "The story begins with Count Dooku talking to his master Darth Sidious about the bounty hunter Jango Fett who should be a good clone donor because he has been pitted against the most dangerous mercenaries and was victorious. He then tells of how Jango became a Mandalorian. The story then flashes back to the Mandalorian Civil War on Concord Dawn, where the Death Watch led by Tor Vizsla and the True Mandalorians led by Jaster Mereel, Mereel's men where beaten back and are scattered. Days later Jaster and his soldiers found the Fetts, Jango's dad gives them food telling his son that they are just beggars. The Death Watch followed the True Mandalorians to the Fett house, where they kill Jango's parents. However Jango manages to escape and meets with Jaster and his men. Vizsla's men then proceed to burn the fields where Jaster, Jango and the Mandalorians were hidden, but Jango leads them to a irrigation tube and they escape the blaze. With Jango's help the True Mandalorians set an ambush for when the Death Watch enter a nearby town. When the seemingly victorious Death Watch come through town they are attacked from several directions and are nearly wiped out, however Vizsla escaped. After the battle Jaster welcomes Jango into the Mandalorians."}, {"tag": "p", "text": "'Jango Fett: Open Seasons 2'"}, {"tag": "p", "text": "On a mission to rescue a trapped Korda Defense Force training squad from a local uprising, the True Mandalorians divided up into three squads: Vertigo Squad, an aerial-attack company under Montross; Headhunter Squad, a heavy cleanup company under Jaster Mereel, and a basic infantry and security squad under Jango Fett, Jango's grunts. This was the first time Fett had been made a squad commander."}, {"tag": "p", "text": "The True Mandalorians left their carrier ship over Korda Six in Meteor-class Q-Carriers. The first sign of trouble was when they came under ion cannon fire while landing, causing one to crash, killing all aboard, and at least one other to land disabled and damaged. They encountered a greater resistance than expected, and as the survivors formed up they came under intense and coordinated Kordan blaster fire, catching the Mandalorians unprepared and causing many casualties."}, {"tag": "p", "text": "Mereel ordered Vertigo Squad to abort their attack on the Kordan gun emplacements, but Montross refused, leading his squad into heavy fire, and only surviving when Mereel's forces came to his aid. Fett used the aerial attack as a diversion, taking his squad to rescue the trapped Korda Defense Force training squad, but instead became ambushed by a Death Watch unit. When Vizsla appeared on the battlefield in a large battle transport, Montross ignored Jaster's call for an airlift and jetpacked away, leaving Jaster under a barrage of blaster fire. Montross tried to take control of the Mandalorians and claim the title of Mandalor, saying Jango had been killed trying to save Jaster. But when Fett showed up carrying Jaster's body the Mandalorians said they would only follow him, Jango banished Montross as a traitor and became Mandalor and Jaster's legacy."}, {"tag": "p", "text": "'Jango Fett: Open Seasons 3'"}, {"tag": "p", "text": "The Governor of Galidraan had secretly been hiding the Death Watch on his world. He was also facing an insurrection by some of his colonists, so he hired the True Mandalorians, under Jango Fett, to eliminate the rebels, which they did. However, under the advice of the Death Watch leader, Vizsla, the governor also informed the Jedi Council that a group of Mandalorians were murdering \"political activists.\" A group of Jedi were dispatched to the planet to deal with the Mandalorians, led by Jedi Master Dooku and his Padawan Komari Vosa. In the resulting battle, the True Mandalorians on the planet were wiped out. Jango, the sole survivor, became enraged and demonstrated his amazing physical abilities by killing many of the attacking Jedi with his bare hands before finally surrendering. The Jedi turned Jango over to the custody of the Galidraan government and the governor had Jango sold into slavery. The Death Watch were victorious"}, {"tag": "p", "text": "'Jango Fett: Open Seasons 4'"}, {"tag": "p", "text": "Jango goes to Dooku's estate and tells him how he escaped slavery, and tracked the Death Watch to Corellia. Then how he avenged Jaster Mereel's death, killing Vizsla (with the help of a family of dire-cats) and most of the Death Watch."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jango Fett's line in Open Seasons is similar to Anakin Skywalker's line to Padmé Amidala in Star Wars: Episode II Attack of the Clones about the Tusken Raiders:"}, {"tag": "h2", "text": "Issues"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "Bibliography"}]}