{"url": "Janna_Tammok", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Janna Tammok"}, {"tag": "p", "text": "Janna Tammok, often called \"Officer Sunshine\" by her staff, was a Lieutenant Commander in the Imperial Service, who served on Bothawui as chief of security for Consul-General Dandamont Pring."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A lean, military-looking woman who often wore her dark hair pulled back in a bun, Janna Tammok was known as a highly professional leader, but she had no discernible personality, and her attitude earned her the ironic nickname \"Officer Sunshine.\" True, she would occasionally be spotted off-duty with her senior aides, relaxing a little—but only a little. In truth, she was frustrated by what she saw as a meaningless posting in Drev'starn, and held onto the forlorn hope that Consul-General Pring would notice her diligence, and recommend her for promotion."}, {"tag": "p", "text": "Tammok's primary duties were twofold: she had to ensure the security of the diplomatic compound at all times, and protect the mission's computer systems; and to these ends, her command was divided between a military detachment and a cadre of slicers. Generally, they were successful in their duties—no mean feat on Bothawui. But they were frustrated by the fact that enemy agents among Pring's aides could simply pull information out of the computers under their security clearance—people like the young Alliance to Restore the Republic spy who had fallen in love with the Consul-General's daughter Praleena Pring."}, {"tag": "p", "text": "Those enemy agents who were compromised, however, were generally left in place, and used by the Consul-General to pass on false intelligence to the Empire's enemies. Although she obeyed her orders diligently, implementing this strategy was the only aspect of her duties that Janna Tammok found genuinely distasteful. To her way of thinking, such people should simply have been seized by the Empire and interrogated until they died."}, {"tag": "p", "text": "It is known that Tammok remained on Bothawui shortly before the Battle of Endor, but it is not certain what became of her after that—although her failure to prevent the defection of Praleena and her lover probably lost her an opportunity to really catch the eye of her superiors and get herself of Bothawui to a more meaningful command."}, {"tag": "h2", "text": "Sources"}]}