{"url": "Andrid", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Army generals of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Andrid"}, {"tag": "p", "text": "Andrid was a male Human who served as a General in the Galactic Empire, reporting directly to Darth Vader. Andrid was stationed in the Belderone sector and was charged with destroying the Rebel base on the planet Kulthis."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The head of several other officers in the Belderone sector, Andrid had several agents on the planet Belderone where he was running a factory charged with creating All Terrain Armored Transports. Darth Vader planned to load a group of AT-ATs aboard bulk cruisers and send them to the nearby planet of Kulthis to wipe out the Rebel presence there. Andrid was skeptical of this plan, believing that it was quite idealistic, but Vader rebuked him, claiming that he would kill the general if he questioned him again."}, {"tag": "p", "text": "Eventually, the Rebels received word of the Imperial's presence on Belderone and they sent a task force made up of Luke Skywalker, Leia Organa, Lando Calrissian, Chewbacca, C-3PO, and R2-D2 to investigate. Upon entering Zana's tavern, the Rebels were recognized by a woman working in the building, and she contacted General Andrid to tell him the news. Andrid decided not to bother the Dark Lord with the news and he sent three local assassins to the restaurant to take out the Rebels. However, the group was quickly defeated, with one assassin actually committing suicide to prevent his own capture."}, {"tag": "p", "text": "Vader was incredibly displeased by this turn of events, as he knew that the Rebels would now be certain that the Empire had a foothold on Belderone. Angered by Andrid's foolishness and for keeping information from him, the Dark Lord Force choked the man to death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}