{"url": "Janus_Greejatus/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Commission for the Preservation of the New Order personnel", "Category:Galactic Republic senators", "Category:Humans", "Category:Imperial Inner Circle members", "Category:Males", "Category:Sith acolytes and apprentices"], "nodes": [{"tag": "h1", "text": "Janus Greejatus"}, {"tag": "p", "text": "Janus Greejatus was a Human male Dark Side Adept and an Advisor to Galactic Emperor Palpatine. From an early age, while growing up on his homeworld of Chommell Minor, Greejatus bore unbridled hatred toward non-Humans, since they had damaged his family's finances severely in years prior. Greejatus and Palpatine became acquainted before either of them entered politics, as young members of the Legislative Youth Program. Entering Chommell Minor politics, Greejatus earned the notice of Palpatine, elected to the position of senator of the Chommell sector in 52 BBY. When Palpatine became Supreme Chancellor of the Galactic Republic, Greejatus succeeded him as senator, but was soon drummed out of the office by influential politicians on Naboo, who disagreed with his closed-border policies."}, {"tag": "p", "text": "Palpatine offered Greejatus a new role: that of advisor to the Supreme Chancellor. The Chommell Minor native accepted, and continued to serve Palpatine in that role when the Supreme Chancellor made himself Galactic Emperor, and transformed the Republic into the Galactic Empire. Under the new regime, Greejatus became a member of the Imperial Ruling Council, helped shape the Commission for the Preservation of the New Order, and was trained in the ways of the dark side of the Force, becoming a Dark Side Adept. He also founded the Imperial Department of Redesign—a secretive team dedicated to the suppression and elimination of non-Human species. Greejatus later attempted to convince Grand Moff Wilhuff Tarkin to seize power, and was found out by Palpatine. The Emperor subsequently decided to keep Greejatus on a tighter leash, bringing him to the Death Star II in 4 ABY. Greejatus perished during the Battle of Endor, when the Rebel Alliance destroyed the battle station."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Janus Greejatus, a Force-sensitive Human male, was born to a family that once enjoyed prominence and fortune on his homeworld of Chommell Minor. That fortune had been effectively lost due to the actions of non-Human workers, to the bitterness of Greejatus's father. He instructed his son to never let non-Humans get the better of him in life, and this spurred Greejatus on to rise through the ranks of Chommell Minor's political community. He maintained his ingrained views toward non-Humans, but was careful to mask them with more demure language. Nevertheless, he did make some polarizing statements, but was still able to build himself a strong political standing on Chommell Minor."}, {"tag": "p", "text": "As a young man, Janus Greejatus participated in the Legislative Youth Program and became acquainted with Palpatine, an ambitious young man from Naboo. The Palpatine and Greejatus families had friendly relations, and Palpatine's father, Cosinga, was willing to overlook the Greejatuses' chauvinism, as he saw them as a positive influence on his son. After Palpatine became a spy for Hego Damask on Naboo, working to sabotage the royals' campaign for the throne that his father supported, Cosinga decided to send his son to live with the Greejatuses on Chommell Minor, based on the rapport he perceived between Janus and Palpatine the last time they visited. The Palpatines traveled to Hanna City on Chandrila, where Palpatine was participating in a month-long retreat for members of the Legislative Youth Program, retrieved him, and set course for Chommell Minor in the family yacht. Cosinga's plan was foiled when Palpatine slaughtered the entire family and their security guards. With the help of Hego Damask, all the evidence was swiftly extirpated, and Palpatine went on to start a political career on Naboo."}, {"tag": "h3", "text": "Palpatine's ally"}, {"tag": "p", "text": "Greejatus rose to prominence on Chommell Minor, and garnered Palpatine's attention. The relationship Greejatus had with his political benefactor was one of friendship—or so he was led to believe. Palpatine was careful, however, not to echo the most controversial of Greejatus's statements, at least not in public. Greejatus proved constantly to Palpatine that he had an aptitude for politics, and he became part of the Senator's cabal, along with Kinman Doriana, Sim Aloo, and Sate Pestage. At some point, Palpatine began to suspect that Greejatus had some strength in the Force."}, {"tag": "p", "text": "In 54 BBY, Janus Greejatus attended the funeral of senator Vidar Kim's wife, two sons, and their pilot and copilot, in Theed. Two years later, the senator was assassinated by a Maladian contract killer on Coruscant, and King Tapalo dispatched Greejatus to Galactic City for the funeral in the Naboo Embassy. Greejatus transported Senator Kim's ashes to Naboo, where they were scattered in the Solleu River. The contract had been arranged by Sate Pestage under orders from Darth Sidious, publicly known as Ambassador Palpatine, and Darth Plagueis, publicly known as Magister Hego Damask of Damask Holdings. Palpatine succeeded Kim as Senator of the Chommell sector."}, {"tag": "p", "text": "In 33 BBY, Senator Palpatine traveled with Sate Pestage to Naboo to visit King Veruna. Upon landing, they met with Greejatus, and together they rendezvoused with Veruna and several members of his advisory council at the Theed Hangar to watch a display of the newly-formed Naboo Starfighter Corps, Veruna's pet project. After Palpatine made clear the purpose of his visit in urging Veruna to support the pro-Trade Federation vote against the taxation of outlying free-trade zones, the King warned Palpatine to keep himself, his cabal—including Greejatus—and Damask out of his affairs."}, {"tag": "p", "text": "By the time of Palpatine's next meeting with Veruna before the start of the Eriadu Trade Summit, the situation had reached a boiling point; with the election approaching, and Palpatine's candidate Padmé Naberrie gaining in popularity, the King had allied himself with Black Sun, the Bando Gora, and Gardulla of the Besadii kajidic. He had also put together a task force to kill Hego Damask on Sojourn. Veruna intended to replace Palpatine in the Senate with his Prime Councilor Kun Lago as soon as he was reelected; when Palpatine suggested that Janus Greejatus would be a better choice, Veruna replied that a suggestion from him amounted to a \"condemnation.\""}, {"tag": "h3", "text": "Senatorial duties and rise to advisor"}, {"tag": "p", "text": "As a result of his and Damask's machinations, Palpatine was elected to the position of Supreme Chancellor of the Galactic Republic in 32 BBY, and Greejatus succeeded him as senator of the Chommell sector. His succession of Palpatine, however, was not a particularly popular move amongst the influential politicians of Naboo, which was the foremost world of the Chommell sector. In light of the Invasion of Naboo, and the treaty the Human Queen Amidala had struck with Boss Rugor Nass of the Gungans, the Naboo possessed a distinctly more multicultural mindset than their new representative in the Senate, who was working with a closed-borders policy."}, {"tag": "p", "text": "After just two years of service, in 30 BBY, Greejatus was ousted from his office, and replaced by Horace Vancil, a native of Naboo. According to Quarsh Panaka of the Royal Naboo Security Forces, Greejatus sought to restore the defensive capabilities of Naboo. However, Queen Amidala personally opposed that rearmament project and had him removed. Following the ousting of Greejatus, the rest of the Chommell sector's representatives in the Senate until its dissolution would all hail from Naboo."}, {"tag": "p", "text": "Now out of a job, Greejatus was not totally without options, as Palpatine still found him valuable, and, as such, the Chommell Minor native was enlisted as an advisor to the Supreme Chancellor. In 19 BBY, Greejatus, along with fellow advisors Sly Moore, Sate Pestage, and Sim Aloo, Director of Republic Intelligence Armand Isard, Senator Jannie Ha'Nook of Glithnos, as well as Vice Chair Mas Amedda, attended a meeting in Palpatine's office. Later that year, Palpatine seized unlimited power for himself, replacing the Galactic Republic with a Galactic Empire, with him as Galactic Emperor. In the wake of the Declaration of a New Order, Greejatus was appointed to the new Imperial Ruling Council. Simultaneously, he helped shape the Commission for the Preservation of the New Order, alongside Crueya Vandron and Ishin-Il-Raz. Being Force-sensitive, he was made a Dark Side Adept, alongside fellow advisor Sim Aloo. He and Aloo, as well as Palpatine's other advisors, were commonly dismissed as Palpatine's yes-men, but in fact they were being groomed to replace the Empire's moffs and governors, so the Emperor could control the galaxy with more ease. In 17 BBY, Greejatus was at the Emperor's side, along with Armand Isard and Grand Moff Wilhuff Tarkin, when Lord Darth Vader and the stormtrooper commander Hock Malsuum came to explain themselves after the debacle of the Shrouded Offensive on Ostor—which had turned to be one of the biggest military disasters for the Empire."}, {"tag": "p", "text": "Utilizing his newfound power, Greejatus also founded the Imperial Department of Redesign—an obscure agency dedicated to the suppression and liquidation of non-Human species. Among its most secretive projects was \"The Heart of Steel\", overseen by Grand Moff 4-8C. The aim of the project was to create a way to control any computer in the galaxy at will, and it was so closely guarded that not even Imperial Intelligence or Imperial High Command knew of its existence. Over time, Greejatus realized that he could develop his own projects without Palpatine's permission or observation, and his ambition grew as a result."}, {"tag": "h3", "text": "Ambition"}, {"tag": "p", "text": "When Grand Moff Wilhuff Tarkin completed his planet-destroying superweapon, the Death Star, Greejatus served as an advisor on the battlestation. While there, he attempted to convince Tarkin to seize power with the battlestation, but both the Death Star and Tarkin were later destroyed by the Alliance to Restore the Republic at the Battle of Yavin. Palpatine learned of Greejatus' encouragement of Tarkin, and decided to keep the Chommell Minor native close at hand. At some stage, Greejatus and Aloo featured in an advertisement for the latest BlasTech Industries blaster. Four years later, Palpatine brought Greejatus along with him to the Death Star II, which was being constructed over the forest moon of Endor."}, {"tag": "p", "text": "Joined by Aloo, Kren Blista-Vanee, and other advisors, Greejatus accompanied Palpatine as he was given a large reception in one of the Death Star II's docking bays. Along with Aloo, he later sat in on a meeting between Palpatine, Lord Darth Vader, and Moff Tiaan Jerjerrod, in which the Emperor ordered Vader to send the Imperial fleet amassed at Endor to the far side of the moon, where it would remain until ordered to move by Palpatine. Vader was concerned about the reports of an Alliance to Restore the Republic fleet amassing at Sullust for a strike against the battlestation, but the Emperor was not worried in the slightest, as he intended to trap the attackers with the soon-to-be-hidden fleet, and summarily destroy his enemies with the station's operational superlaser. Sure enough, the station was attacked by the Alliance to Restore the Republic, in a pivotal battle of the Galactic Civil War. Contrary to Palpatine's expectations, General Lando Calrissian and Wedge Antilles succeeded in destroying the station during the battle, and Greejatus, along with the other advisors, perished in the ensuing explosion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A cruel man at heart, Greejatus had been raised to hate non-Humans. His hatred for them ran deep enough for him to put it across in his political views—although he was skilled in masking his beliefs in order to rise to prominence on Chommell Minor, he was disliked on Naboo, which cost him his position as senator of the Chommell sector. In his own eyes, he was good friends with Palpatine, and his skill in the political arena afforded him longevity as one of the Supreme Chancellor's, later Emperor's, advisors. Later in his career, he founded the Imperial Department of Redesign—an organization whose objectives matched his political view on non-Humans closely. Greejatus lusted for power his whole life, however, and that ambition would later cost him his autonomy, as he was forced to stay close to Palpatine following his encouragement of Tarkin to rebel. He was also a predictable man, and easy to control. Greejatus could manipulate and utilize the Force to some extent, and, in his capacity as a Dark Side Adept, he served the Emperor faithfully, on occasion. Greejatus had brown hair and light skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Janus Greejatus first appeared in the novelization of Richard Marquand's 1983 film, Star Wars: Episode VI Return of the Jedi. He and Palpatine's other advisors were referred to by author James Kahn as \"the Emperor's courtiers\". In the film itself, Greejatus was portrayed by an unnamed background extra. The character's costume was designed by Nilo Rodis-Jamero, who based the costume on that of a Catholic bishop. An image of the character later appeared in Bill Slavicsek's West End Games sourcebook, the Death Star Technical Companion, published in 1991. In that book, however, the character was intended to be Ars Dangor, until in 2001, he was identified as \"Janus Greejatus\" in the \"Death Star II Limited\" set of the Star Wars Customizable Card Game. In the 1998 CD-ROM Star Wars: Behind the Magic, the character's image was used in a fictional advertisement for the \"BlasTech\" company and action figure of Greejatus was later made by Hasbro, in their \"Death Star Procession\" subset. The character also featured briefly in Kevin Rubio's non-canon comic, The Return of Tag & Bink: Special Edition."}, {"tag": "p", "text": "In October 2007, Greejatus was one of several subjects of the Hyperspace \"What's The Story?\" feature, allowing Hyperspace members to write Databank entries on background characters from the Star Wars films. Hyperspace member Timothy S. Maddocks, under the username \"vader_of_bast,\" wrote the winning entry. Maddocks has written a blog on StarWars.com in which he credits the Star Wars Missions series of novels with inspiring him to tie Greejatus into the obscure Imperial Redesign Team and fellow \"What's The Story?\" contributor Kyle Jewhurst with inspiring him to use Greejatus to fill the senatorial vacancy created by Palpatine's election to the post of Supreme Chancellor. To fit the Redesign Team reference, he portrayed Greejatus as a fierce speciesist, and to expand the scope of Chommell sector's representation beyond one planet, Maddocks gave the character's homeworld as Chommell Minor. Maddocks's conception of Palpatine, partly shaped by Wookieepedia's article on the Emperor, led him to portray Greejatus as duped into believing Palpatine held him in much higher regard than he in fact did. Star Wars Missions further sparked Maddocks to suggest that Greejatus could get away with secret projects, and portrayed this as building a hubris which caused Greejatus to overreach while on the Death Star—tying into the Death Star Technical Companion image—and caused Palpatine to keep him close and under watch thereafter, explaining his presence on the Death Star II. Elements cut from Maddocks's original submission include Greejatus attempting to flee the Death Star II only to find his shuttle stolen by Luke Skywalker and the alteration of the Imperial Redesign Team to the Imperial Department of Redesign; additionally, some changes to the prose were made. Maddocks's entry was later used, almost verbatim, in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}