{"url": "Jar%27Kai/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Lightsaber combat", "Category:Martial arts"], "nodes": [{"tag": "h1", "text": "Jar'Kai"}, {"tag": "p", "text": "Jar'Kai was originally a style of swordplay that utilized dual blades, developed by the Yovshin Swordsmen. A similar dual-blade technique referred to as Niman was developed by the Royale Macheteros of the Kashi Mer monarchy. Niman was adopted by the darksider group known as the Legions of Lettow during the First Great Schism, as well as the Jedi Order itself. Niman was developed into the sixth form of Lightsaber combat, retaining its name, while Jar'Kai became something of a blanket term for dual-blade combat.[source?]"}, {"tag": "p", "text": "It should be noted that the fourth form of lightsaber combat, Ataru, was also known to employ dual blades as part of its training regimen. Ahsoka Tano was a master in this form when she was only a Padawan, an accomplishment that Jedi Masters would have serious troubles in achieving."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Jar'Kai style developed by the Yovshin Swordsmen was named for a city on Atrisia. The city of Jar'Kai was also the site where the original Jar'Kai dueling sabers were crafted. These weapons were utilized by the Yovshin and were designed for the express purpose of being dual-wielded."}, {"tag": "p", "text": "Niman, the dual-blade style developed by the Royale Macheteros of the Kashi Mer, was named for the dual triumvirate of the Kashi deities. The style was adopted by the Legions of Lettow, a group of Dark Siders responsible for the First Great Schism of the Jedi Order. After the defeat of the Legion at the hands of the Jedi, Niman was adopted by the Jedi order, eventually being refined into the sixth form of lightsaber combat, referred to by the same name. It should be noted that there were Jedi who engaged in dual-blade combat prior to the adoption of Niman by the Order, an example being Awdrysta Pina, who wielded a pair of Jedi katanas in battle. Many Jedi Knights and Sith Lords trained to use Form VI in the hopes of gaining a basic knowledge of the dual-bladed combat, but very few ever achieved complete mastery of Niman."}, {"tag": "p", "text": "Both styles predated the invention and usage of lightsabers, but being designed to be practiced with swords, they were easily adapted. In addition, the word \"Jar'Kai\" became a blanket term for dual-blade combat in general, leading to the birth of the term \"Jar'Kai tactic\", which was to simply employ two blades in combat, regardless of whether one had received training in any dual-blade fighting style.[source?]"}, {"tag": "p", "text": "Dual-blade practitioners of Niman included Jedi Master Kavar, who utilized a shoto as his secondary weapon, and the Jedi trainee turned Sith Lord Exar Kun, who took up an additional weapon on occasion. However there were few dual-blade duelists that practiced classic Niman, though the Jar'Kai tactic saw fervent usage. Numerous Jedi and Sith were known to take up a secondary blade in combat, though few did so regularly."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Dual-blade fighters, whether classical Niman duelists or individuals applying the Jar'Kai tactic, were able to maintain a strong offense, as the speed of attack that two blades allowed would overwhelm most opponents. A typical maneuver was to continually attack with one blade while relying on the other for defensive coverage, ensuring that the duelist could keep up his guard even as he attacked. However, it was common that both blades were used for offensive purposes, keeping up a continuous wave-front assault."}, {"tag": "p", "text": "Another advantage of Jar'Kai was that the two blades made it easier to hold off multiple opponents, as one simply had more blades to parry with. Asajj Ventress, a dual-blade practitioner, demonstrated this during her mission on Ruul, where she held her own against up to three Jedi simultaneously. Dual blades could also be used as a defensive or compensatory measure when engaging another opponent who utilized multiple blades in combat, as shown when Kit Fisto stole and took up one of the blades of the cyborg General Grievous, whose mechanical anatomy allowed him to wield up to four lightsabers at once."}, {"tag": "p", "text": "Known Jar'Kai techniques and maneuvers include the \"Rising Whirlwind\", which consisted of a duelist swinging his blades about his body, creating a \"whirlwind\" of deadly attacks, and the \"Twin Strike\", in which both blades were swung in an arc towards the opponent in a deadly power attack."}, {"tag": "p", "text": "Though a complete fighting system in and of itself, Jar'Kai was easily adapted to other styles. After beginning her tutelage under Darth Tyranus, Asajj Ventress quickly applied Makashi techniques to her practice of Jar'Kai. As Makashi was Tyranus's favored form, Jedi Master Luminara Unduli was able to recognize his training techniques in Asajj's fighting abilities, stating as much. Mace Windu also infused Jar'Kai tactics into his own Vaapad style while on a mission on Haruun Kal, his former apprentice, Depa Billaba, doing likewise."}, {"tag": "h3", "text": "Weaknesses"}, {"tag": "p", "text": "Despite the advantages offered, Jar'Kai was not without its drawbacks. Firstly, as both hands held individual lightsabers, two-handed blows were impossible, and the duelist was unable to put all his or her weight behind blocks, weakening the defensive capabilities. Thus, an enemy with a single hilt could simply assault a Jar'Kai practitioners defense with brute force, battering away until the dual-blade duelist's guard gave way, as shown during Anakin Skywalker's duel with Asajj Ventress on Yavin 4. However, this weakness was hardly absolute, as some duelists possessed the physical strength to block power attacks with only one arm, examples including Grievous, whose mechanically augmented strength allowed him to both effectively defend against and dole out heavy power blows. Asajj Ventress eventually developed the physical strength necessary to compensate for this weakness, being able to hold up simultaneous bladelocks with both Anakin Skywalker and Ahsoka Tano, both of whom were Form V practitioners; she had even withstood two separate bladelocks with the towering General Grievous, who was using all four of his lightsabers."}, {"tag": "p", "text": "Secondly, because of the gyroscopic effect inherent in lightsabers, dual blades were more difficult to control than a single blade. Due to this, special training was required to practice Jar'Kai, and without it, a secondary blade was more often a hindrance than an advantage. Fortunately, dual-blade training was often quite standard amongst most Force-using organizations, though advanced training seemed somewhat rarer."}, {"tag": "p", "text": "A third trait worthy of note is that Jar'Kai practitioners were often overly reliant on their weapons and bladework, leaving their abilities in other areas undeveloped. An example of this weakness was evident in the Jedi Battlemaster Raskta Lsu, who was an exceptional duelist, but in her devotion to lightsaber combat, she never developed her abilities in the Force, forcing her to rely on both her skill with the blade(s) and the support of more Force-adept allies to compensate. Some duelists, such as Asajj Ventress, would become overly reliant on simply having two blades to back up one another, and would be left at a disadvantage if deprived of the one; however, this weakness could be overcome with time."}, {"tag": "p", "text": "Darth Maul, while facing the Dark Jedi Komari Vosa on Cog Hive Seven, saw Jar'Kai as \"predictable.\" This would make sense, given that his mentor, Darth Sidious, could wield two sabers at any time."}, {"tag": "h3", "text": "Weapon Specifications"}, {"tag": "p", "text": "As both Niman and Jar'Kai were developed prior to the invention of lightsabers, they were designed with metal blades in mind. Jar'Kai even had a type of sword created that was specialized to the use of the dual-blade style, the Jar'Kai dueling saber. However, due to the sword-like nature of lightsabers, the styles were relatively easily adapted."}, {"tag": "p", "text": "Traditional Niman dual-blade regiments were based around wielding a short lightsaber, the Shoto, as the off-hand weapon, as the smaller blade was easier to control. This seemed to be a relatively common practice amongst Jar'Kai duelists within the Jedi Order, with such individuals such as Sora Bulq, Aayla Secura, and others doing so. The Zabrak Maris Brood even took this idea a step further and wielded dual guard shotos in combat."}, {"tag": "p", "text": "However, since such specialized weapons were not required to utilize Jar'Kai, many dual-blade combatants simply wielded two standard blades in combat. In fact, weapons other than lightsabers have even been wielded as secondaries, examples including electrostaffs, as demonstrated by Shaak Ti and Obi-Wan Kenobi, swords composed of a lightsaber-resistant material, which Revan or Meetra Surik conceivably did, or even simple knives, as shown by Mara Jade Skywalker. Obi-Wan Kenobi even used a lightwhip on one occasion. Also, the number of lightsabers wielded was not limited to two, depending on the duelist's anatomy. Among the Jedi, Priapulin Master Skwelli was renowned for wielding six lightsabers. General Grievous would often wield four, splitting his mechanical arms to produce an extra set of appendages. Thanks to Repulsorlifts built into his legs, Grievous was capable of wielding six sabers, grasping them in his talon-like feet, though he has never been recorded doing so. The Besalisk Jedi Pong Krell would also take advantage of his extra set of arms to dual-wield double-bladed lightsabers."}, {"tag": "h2", "text": "Applications"}, {"tag": "p", "text": "Anakin Skywalker applied Jar'Kai in battle, in conjunction with his skills in Ataru, during his duel with Count Dooku on Geonosis. While his sudden flurry of attack momentarily caught Dooku off guard, Skywalker's lack of advanced training in either Jar'Kai or Ataru allowed Dooku to break through the Jedi's array of weapons, forcing Skywalker onto the defensive before destroying one of the lightsabers. Skywalker's master, Obi-Wan Kenobi, also displayed skill in dual-blade combat, taking up the lightsaber of deceased Jedi Ky Narec, alongside his own during his duel with Narec's fallen student, Asajj Ventress, on Rattatak. Skywalker himself applied Jar'Kai in battle several more times during the Clone Wars, such as during a battle with fallen Jedi Barriss Offee in the aftermath of the bombing of the Jedi Temple."}, {"tag": "p", "text": "Ventress, herself a Jar'Kai practitioner, originally took up the style after Narec's death, wielding his lightsaber alongside her own. However, without Narec's guidance, she spiraled down the path of the dark side, and this showed in her bladework, which became furiously aggressive. She demonstrated her skills to Count Dooku during his visit to Rattatak, viciously killing off the competitors in The Cauldron in a furious display of bladework and raw power in the Force. During her subsequent duel with the Count, she fell on him in a blind fury, but was nonetheless defeated. However, she did impress the Count and his Sith Master, Darth Sidious, with her skills. The Count awarded her with a high-ranking position within the CIS military, and the twin curved lightsabers of his former student, Komari Vosa. Wielding these new lightsabers, Ventress developed her skills under Dooku's tutelage, applying her skills in dual-blade combat to Makashi. Eventually, her prowess as a duelist allowed her to hold her own against up to three adversaries with little difficulty, as she demonstrated during her mission to Ruul."}, {"tag": "p", "text": "Her skills even advanced to the point where she was able to battle and defeat or at least hold her own against Jedi Council masters, something few of her contemporaries could do. However, despite her skills, she was not without her weaknesses. During her earlier years, she lacked the major levels of physical strength to compensate for the inherent weaknesses of Jar'Kai; her blows lacked power, as shown by Dooku's casual defensive moves during their bout on Rattatak; and she was left vulnerable to power attacks, as shown by her retreat before Anakin Skywalker's offensive frenzy during their duel on Yavin IV. However, she eventually developed the physical strength necessary to compensate for this weakness, demonstrating the ability to hold up simultaneous bladelocks with both Anakin Skywalker and his Padawan, Ahsoka Tano, both of whom were Form V practitioners."}, {"tag": "p", "text": "It is also known that Darth Maul trained in Jar'Kai and had mastered it enough that even Darth Plagueis acknowledged Maul's skill in dual-blade combat. However, Maul rarely used Jar'Kai and preferred to wield a saberstaff instead, as shown during his duels with Jedi Master Qui-Gon Jinn on Tatooine and Naboo. During much of the Clone Wars, he also seemed to favor more of a single-blade approach than dual-wielding, as seen in his duels with Obi-Wan Kenobi. However, he had managed to defend against and defeat Komari Vosa, even if she had a two-to-one saber advantage over him. In his final duel on Mandalore with Darth Sidious, Maul took up both his own saber and the Darksaber. Despite rarely using it, his skill in Jar'Kai had clearly greatly improved, managing to fight almost evenly with his former master, who also used dual blades, although he was ultimately overpowered. When the reborn Maul dueled with Darth Vader on Kalakar Six, he employed Jar'Kai after his saberstaff been sliced in half, enabling him to cut loose and bring Vader to his knees."}, {"tag": "p", "text": "Luke Skywalker initially took to wielding dual-blades to combat Lumiya's lightwhip, as the multiple extensions of the elaborate weapon made short work of a standard defensive technique. In their rematch, Skywalker used his newly fabricated shoto to back up his full-length lightsaber, entangling the energy beams of her whip with one blade while cutting apart the physical strands. Skywalker managed to disarm Lumiya by shorting out the energy beam of her whip with a power attack, though he lost his lightsaber in the process, before he attacked her with the shoto. Dual-blade combat became one of Skywalker's preferred methods for dealing with lightwhips, and he utilized it several times during various rematches with Lumiya, though in their last engagement, he fought her only with a single weapon. He also encouraged his wife, Mara Jade Skywalker, to construct a shoto of her own for the same reasons. Skywalker would also display his skills with dual blades while training his students."}, {"tag": "h2", "text": "Practitioners"}, {"tag": "p", "text": "While many duelists have utilized Jar'Kai at some point, fewer combatants did so on a regular basis. Among the ancient Jedi who did so are Awdrysta Pina, who practiced with a pair of Jedi katanas, Kavar, Bastila Shan, Vandar Tokare and Fortris Gall."}, {"tag": "p", "text": "During the Jedi Civil War, many of the Dark Jedi that pledged their allegiance to Darths Revan and Malak's Sith Empire used Jar'Kai against their former Jedi brethren. Many of the Sith following Darth Traya's Sith Triumvirate applied the Jar'Kai form in combat."}, {"tag": "p", "text": "During the New Sith Wars, the Sith Lord known as the Dark Underlord practiced Jar'Kai, wielding two Sith swords. During this time, the style also had its share of Jedi practitioners, including the Echani Jedi Master Raskta Lsu, and the Twi'lek Jedi Newar Forrth. Over a millennium later, the Twi'lek Dark Jedi Boc Aseca attempted to imitate Forrth, resulting in a clumsy, though effective fighting method."}, {"tag": "p", "text": "During the Clone Wars, General Grievous included elements of Jar'Kai in his style of combat. He commonly utilized two lightsabers in battle, but demonstrated the ability to wield four lightsabers, achieving this by splitting his mechanical arms and hands along their lengths, resulting in four arms. Grievous' contemporaries, Asajj Ventress, Sora Bulq and Saato also utilized Jar'Kai in combat. Bulq himself, a master of all known forms of lightsaber combat, often wielded a shoto in combat as his secondary weapon, applying his skills in Jar'Kai to his practice of Vaapad, the legendary Form VII variant that he had aided Mace Windu in developing prior to his defection to the CIS. Other Jar'Kai practitioners active during the Clone Wars included Jedi Keelyvine Reus and Pong Krell. Darth Sidious also was extremely skilled in Niman/Jar'Kai, utilizing both his primary and backup lightsabers to fight his former Sith apprentice Darth Maul and Savage Opress, although he rarely used it, his skill allowed him to prevail against their combined abilities and overpower Maul using the same shortly after his brother's death."}, {"tag": "p", "text": "Ahsoka Tano was also skilled in the use of Jar'Kai and wielded both a lightsaber and a shoto. She employed an extremely complicated Ataru-Shien reverse grip style to her Jar'Kai tactic that was worthy of mastery. She was able to hold her own against both Anakin Skywalker and Obi-Wan Kenobi on Mortis and provide a challenge for Grievous, who was himself a master of Jar'Kai and was using four lightsabers at the time. Tano lasted far longer against Grievous than she had in their previous duel on Skytop Station, which happened before she started using two lightsabers. Tano later lost her shoto and it was shown that she had become somewhat vulnerable to the weakness of getting too reliant on it, a trait she shared with Asajj Ventress, and when using a single lightsaber, she was unable to defeat the treacherous Barriss Offee in combat."}, {"tag": "p", "text": "It should be noted that Count Dooku, a famed Makashi practitioner, considered dual-blade combat styles inferior, believing that duelists should either make do with a single blade or not at all. He even went so far as to fault double-bladed lightsabers for this."}, {"tag": "p", "text": "During the Dark Times, a notable Jar'Kai practitioner was the Zabrak Jedi Padawan Maris Brood, who used two guard shotos in combat against Darth Vader's secret apprentice, Galen Marek. Many of Marek's unstable clones—including the two more successful clones, Starkiller and the Dark Apprentice—adopted the form during their training under Vader, utilizing it during their emergence. Starkiller studied Ataru and Niman to take advantage of their dual-blade training regimes and facilitate his mastery of Jar'Kai, also frequently chaining in Force-based attacks as part of Niman into his bladework. Two of Darth Sidious's Dark Jedi, Jeng Droga and Sa Cuis favored dual-blades."}, {"tag": "p", "text": "Fourteen years after the destruction of the second Death Star, many of New Reborn were trained to use the Jar'Kai style, most notably Axmis' apprentice, Alora. Many Jedi also used Jar'Kai to combat Axmis' Reborn."}, {"tag": "p", "text": "Clone Wars-era Jedi Knight A'Sharad Hett was a known dual-blade fighter, using his late father's weapon alongside with his own. After he fell to the dark side and became the Sith Lord Darth Krayt, he continued to practice Jar'Kai in conjunction with his knowledge of Form VI lightsaber combat. Various members of Krayt's Sith Order also practiced Jar'Kai, including the third Darth Wyyrlok and Darth Reave."}, {"tag": "p", "text": "Other Jar'Kai practitioners included the Jedi Micah Giiett, Joclad Danva, and Serra Keto."}, {"tag": "h3", "text": "Alternative Uses"}, {"tag": "p", "text": "Some duelists maintain skill in dual-blade combat, and utilize it often, but not on a regular basis."}, {"tag": "p", "text": "In the final year of the New Sith Wars, before the events of the Seventh Battle of Ruusan, the Sith Lord and Sith Blademaster Kas'im displayed his skills in dual-blade combat against against Darth Bane, utilizing the Ataru subform. Kas'im, who had mastered all of the seven classic forms and normally used a double-bladed lightsaber, always discouraged his students at the Korriban Sith Academy against using Jar'Kai, claiming that it was inherently flawed. However, Kas'im's expertise with Jar'Kai was such that he was able to confuse Bane and nearly defeat him."}, {"tag": "p", "text": "Jedi duelists known to apply Jar'Kai on occasion include Aayla Secura, who wielded a shoto alongside her lightsaber during many of the more chaotic battles of the Clone Wars, though she was perfectly able utilizing a regular blade as her secondary weapon."}, {"tag": "p", "text": "The Grand Master of the New Jedi Order Luke Skywalker displayed his skill with the dual-bladed tactic during the Yuuzhan Vong War, often utilizing it with a shoto in conjunction with his regular lightsaber. Approximately five years after the end of the Swarm War, Skywalker applied Jar'Kai in actual combat against the Dark Lady Lumiya on Roqoo Depot and at Gilatter VIII during the Second Galactic Civil War. Luke Skywalker's wife Mara Jade built a shoto per his request when Lumiya re-emerged. She was with Luke on Roqoo Depot when he fought Lumiya; at the same time she dueled Dark Jedi Alema Rar. Mara Jade also used a variant of Jar'Kai when she dueled her nephew and Lumiya's Sith apprentice Jacen Solo on the planet Kavan, using her shoto and vibroblade."}, {"tag": "p", "text": "The Sith Master Lomi Plo used Jar'Kai against Skywalker twice out of the three times they dueled, using a standard lightsaber and a shoto."}, {"tag": "h3", "text": "Situational Applications"}, {"tag": "p", "text": "During the Battle of Korriban during the Great Galactic War, Jedi Master Kao Cen Darach wielded his own single-bladed and his apprentice's double-bladed lightsabers against Vindican and his apprentice, Malgus. While Darach injured Vindican, Malgus followed the Jedi's example and took up his own master's lightsaber, using the extra blade to counter Darach's array of weapons and cut him down."}, {"tag": "p", "text": "Kit Fisto took up the lightsaber of his former Padawan, Nahdar Vebb, during his duel with General Grievous, in order to even the odds against the General's multiple weapons. Using the lightsaber, he unleashed his own skill with Jar'Kai, utilizing it in conjunction with his mastery of Form I lightsaber combat, driving back Grievous and holding his own against three of the General's IG-100 MagnaGuards."}, {"tag": "p", "text": "In addition to his use of the fighting method against Dooku on Geonosis, Anakin Skywalker performed Jar'Kai against Duros bounty hunter Cad Bane, using his own lightsaber and that of his Padawan, Ahsoka Tano, in the Devaron system, and in the Progate Temple on Geonosis, using Luminara Unduli's lightsaber before releasing her from Queen Karina the Great and returning it to her. He also used Jar'Kai against former Knight Barriss Offee."}, {"tag": "p", "text": "During their participation in the Summertime War on Haruun Kal, Mace Windu and his former student, Depa Billaba, both applied their mastery of Form VII lightsaber combat with dual blades on occasion. Shaak Ti also appeared to have some training in the style, as she expertly wielded an electrostaff in conjunction with her lightsaber during the Battle of Coruscant; sources describe her wielding dual lightsabers after the Jedi Purge."}, {"tag": "p", "text": "Former Jedi Barriss Offee also displayed considerable prowess in Jar'Kai having stolen Asajj Ventress' lightsabers. Her skill was great enough to overwhelm Ahsoka Tano and hold her own very well against Anakin Skywalker."}, {"tag": "p", "text": "It is known that many, if not all, duelists have applied Jar'Kai in combat at some point, even if they lacked specialist knowledge, usually doing so whenever the situation demanded and/or facilitated it. Duelists known to do so include Exar Kun, Aurra Sing, Lycan, Quinlan Vos, Corran Horn, Anakin Solo, Saba Sebatyne, Vestara Khai, and Kol Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Due to George Lucas' original conception that lightsabers were extremely heavy and difficult to handle, the idea of dual-blade combat was accordingly rendered impossible. However, Lucas eventually decided to make lightsabers lighter to facilitate the faster choreography in Star Wars: Episode V The Empire Strikes Back, consequently inferring the possibility of dual-blade fencing. Dual-blade combat made its first appearance in Star Wars 96, which depicted Luke Skywalker fighting with a short lightsaber as an off-hand weapon to counter Lumiya's use of the lightwhip."}, {"tag": "p", "text": "William C. Dietz and Dave Dorman's novella Dark Forces: Jedi Knight, suggests the dual-blade combat predates the invention of the lightsaber. Furthermore, in the Star Wars computer game Star Wars: X-Wing Alliance, there is a pair of \"Jar'Kai dueling sabers\" that are ordinary metal swords. This also suggests that Jar'Kai predated lightsabers, even though the release of X-Wing Alliance was before the behind the scenes \"invention\" of lightsaber forms. This was confirmed by a Wizard of the Coast supplement, which revealed that the Jar'Kai style, and swords, originated with the Yovshin Swordsmen of Atrisia."}, {"tag": "p", "text": "Originally, Dooku was planned to display ability with two blades against Jedi Master Yoda in Star Wars: Episode II Attack of the Clones, which would have made him a possible Jar'Kai practitioner. However, the idea was later dropped, and in the novel Labyrinth of Evil, Dooku was stated to dislike usages of multiple blades, which made him no longer likely to be a Jar'Kai practitioner. Photos with Christopher Lee wielding two lightsabers with visual effects became promotional pictures; one of them can be seen in the Star Wars: Attack of the Clones: The Visual Dictionary. Also, the scene where Dooku is wielding two lightsabers was seen in the comic version of Attack of the Clones."}, {"tag": "p", "text": "In the video game Star Wars: Knights of the Old Republic, a character's skill in the Jar'Kai form was measured by a set of three feats called Two-Weapon Fighting. Acquiring these feats made the character excel in dual sword or lightsaber combat, but it also increased the character's proficiency in wielding double-bladed lightsabers and swords, and even dual blasters. However, in the game's sequel, Star Wars: Knights of the Old Republic II: The Sith Lords, one of the available implants, called the Enhancement D-Package, allowed a character to use two weapons effectively without having to purchase the Two-Weapon Fighting set of feats. Furthermore, Sith Marauders and Jedi Weapon Masters had the opportunity of learning the \"Superior Two-Weapon Fighting\" feats, enabling unparalleled mastery of two-weapon combat."}, {"tag": "p", "text": "Similarly, in the Star Wars Roleplaying Game: Saga Edition characters can take Dual Weapon Mastery feats which serve the same function; oddly enough, none of these feats are required to take the Jar'Kai talent of the Jedi Knight prestige class, although Niman is a prerequisite."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}