{"url": "Jarak", "categories": ["Category:Legends articles", "Category:Anomids", "Category:Males", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Jarak"}, {"tag": "p", "text": "Jarak was a male Anomid scientist interested in researching the living brain through whatever methods necessary. His colleagues disapproved of his techniques, but could not argue with results, as Jarak had developed a gruesome but effective brainwashing method. He had many potential buyers, but accepted the offer to work for Eternal Emperor Valkorion, leaving the known space to work in the Sanitarium on Nathema. There Jarak was tasked with conditioning Valkorion's daughter Vaylin, an extremely powerful Force-user, and eventually succeeded after exhausting all conventional methods."}, {"tag": "p", "text": "Years later Vaylin became the Eternal Empress of Zakuul and ordered Jarak to find a way to undo his work and remove her conditioning. Jarak developed a ritual that none of the test subjects could survive, but Vaylin agreed to it nonetheless. However the ritual went wrong and Vaylin's power went out of control, threatening to destroy the Sanitarium and everyone in it. Jarak escaped and ran into Lana Beniko and the Alliance Commander, convincing them to escort him inside the Emperor's Vault, which could shield them from the blast. The three of them barely managed to get inside the vault in time, but the energy blasts overloaded the circuits, trapping them inside. Jarak asked his companions to activate the backup generators, but while they were busy with it, he was killed by the vault guardian."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Unlike others of his species, Jarak was not interested in researching technology, but preferred to focus on the mysteries of a living brain. To better understand the mind, Jarak used increasingly painful methods, believing individual suffering to be necessary for scientific process. Eventually, his research produced a method of brainwashing patients to obey any command for up to ten hours, with the side effects of hives, delirium and a 90% death ratio. Nevertheless, multiple buyers ranging from private military organizations to criminal cartels expressed interest in the method. Jarak, focused on pursuing his research, eventually accepted an offer that promised him unlimited test subjects, ownership of facilities, and complete control of methods. The offer came from Valkorion, an alter-ego of the Sith Emperor Vitiate, who ruled the Eternal Empire of Zakuul in the Wild Space, unknown to the larger galaxy."}, {"tag": "p", "text": "Disappearing from known space, Jarak came into Valkorion's employ some time after the beginning of the Cold War. Valkorion's daughter Vaylin had by that point shown both immense strength in the Force and an inability to control it. Seeing her as danger to others and a threat to his plans, Valkorion send Vaylin to the Sanitarium on Nathema, the world on which he consumed all life in the Ritual of Nathema thirteen centuries prior. Jarak was given a laboratory in the Sanitarium, tended by Nathema Zealots, and free reign over Vaylin. Allowed to cross any line except death, Jarak had to find a way to condition Vaylin's behavior with a great variety of assets and test subjects at his disposal. Jarak subjected Vaylin to many horrors during her stay on Nathema, and she was tested both physically and mentally in constant fear, pain and isolation. She was made to observe test subjects being torn apart by creatures, witness the dissection of their corpses following the experiments and experience the effect of chemicals and implants. Eventually Jarak exhausted conventional methods and subjected Vaylin to torture by machines of his own design. In the end, Vaylin's mind was broken and while she herself became a cruel, vindictive person prone to temper tantrums; remaining unaware of the true purpose of her stay on Nathema - being conditioned to become powerless against whoever spoke the phrase \"Kneel before the Dragon of Zakuul\" in her presence."}, {"tag": "p", "text": "Years went by and Valkorion was eventually killed, his Eternal Throne assumed first by his son Arcann, and then by Vaylin. After a confrontation aboard the Gravestone made Vaylin aware of her conditioning, she contacted Jarak again and used her new authority as the Eternal Empress to order him to break her conditioning. Jarak returned to Nathema's Sanitarium, where Vaylin provided him ample test subjects. Eventually Jarak made a breakthrough and contacted the Empress during the Grand Festival of Empress Vaylin. Vaylin soon came to Nathema, where Jarak witnessed her slaughtering his test subjects with a lightsaber and expressed gratitude that she did not possess such weapon as a child. He then explained that the process to break her conditioning would be even more extreme, with nobody else surviving it so far. However, Jarak also assured the Empress that her unparalleled strength in the Force gave her a chance that nobody else had. Vaylin agreed to the process, but soon after it started, she was overloaded with pain and her power went out of control, obliterating several Zealots and Keepers. Jarak himself escaped the room, but was confronted with an unlikely presence - Lana Beniko and the Alliance Commander who followed Vaylin attempting to stop her from breaking her bonds. Jarak quickly explained that only he knew a location of a safe place and only his captors would be able to escort him there through the beasts that went mad from Vaylin's power. Working together, Jarak brought the two to the Emperor's Vault, where Valkorion held artifacts even he deemed too dangerous to use. Once safely inside, he gave them a helpful suggestion on how to restore the Vault's power, allowing them to eventually get out. However, while Beniko and Alliance Commander were restoring the power and exploring Dramath's holocron, Jarak was ambushed and killed by a Vault Guardian."}, {"tag": "p", "text": "After Jarak's death, the new Zakuulan government released Felix Iresso, a Republic soldier who was captured and tortured by Jarak as to extract a Sith holocron embedded in the soldier's mind."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}