{"url": "Jarek_Yeager%27s_Repair_Station", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Structure stubs", "Category:Colossus locations"], "nodes": [{"tag": "h1", "text": "Jarek Yeager's Repair Station"}, {"tag": "p", "text": "Jarek Yeager's Repair Station, also known simply as Yeager's repairs, was a repair shop owned by Jarek Yeager on the Colossus. His employees included the the mechanics Neeku Vozo and Tamara Ryvora, and the astromech droid Bucket. During the Cold War, he allowed Kazuda Xiono to work in the shop as a member of Team Fireball but wanted nothing to do with the Resistance spy's mission."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Jarek Yeager's repair station was located in the refueling platform Colossus's Quadrant 3.27. The shop had hangar space to repair ships, as well as room for the antiquated racer known as the Fireball. Inside the shop was tables to store parts and tools, and the workshop opened to the outside of the station. In addition, the repair station housed a secret hangar containing Jarek Yeager's racer."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "After Jarek Yeager ended his racing career following the deaths of his wife and daughter during a racing accident, he migrated to the Colossus refueling platform on the Outer Rim ocean world of Castilon. There, he established himself as a starship mechanic and the owner of a repair station. Yeager's employees included his astromech droid Bucket, the Nikto Neeku Vozo, and the aspirant racer Tamara Ryvora. Together, the group was known as Team Fireball."}, {"tag": "h3", "text": "The novice spy"}, {"tag": "p", "text": "Prior to the outbreak of the First Order/Resistance War, Yeager agreed to help his old friend Resistance pilot Poe Dameron by giving shelter to the new Resistance spy Kazuda Xiono, who posed as a mechanic in order to maintain his cover as spy. Kaz's mission was to gather intelligence on First Order activity on the Colossus. Yeager's repair station became his home while he was based on the Colossus."}, {"tag": "p", "text": "Later, the Neimoidian pirate Hallion Nark, who was a member of the Warbird gang, visited Yeager's repair station, seeking repairs for his shuttle. In truth, he was there to gather intelligence about an incoming triple dark storm, which would allow the pirates to raid the Colossus. Yeager assigned his mechanics including Tam and Xiono with repairing the shuttle. Xiono suspected that Hallion was a pirate and stole his comlink. When the Warbirds raided the Colossus, Xiono managed to drive them away by jamming their communications."}, {"tag": "p", "text": "While Xiono was struggling to adapt to life as a mechanic and spy, he was befriended by the local racer and troublemaker Jace Rucklin. Rucklin exploited his friendship with Xiono to steal a vial of coaxium from Yeager's garage under the pretext of wanting to see Yeager's racer. After Bucket reported that the coaxium vial was missing, Xiono went to stop Rucklin from racing. Though Xiono managed to save Rucklin's life, he earned Rucklin's enmity by accidentally destroying his racer while forcibly removing Rucklin from his ship."}, {"tag": "p", "text": "Due to frequent power cuts at the Colossus, Team Fireball had to suspend work on  and retreated to Aunt Z's Tavern to bid their time. Later, the inexperienced Kaz damaged an acceleration compensator, angering Tam. While searching for a new one, Kaz encountered the refugee children Kel and Eila, who had escaped a First Order massacre on Tehar. During the adventure, Kaz and Neeku managed to hide the children from the First Order with the help of the Chelidae and also obtained an acceleration compensator."}, {"tag": "h3", "text": "The undercover pirate"}, {"tag": "p", "text": "Later, Yeager awoke Kaz for a \"salvage run,\" which turned out to be a secret training mission with his mentor Poe. While investigating a damaged freighter, they rescued a female Mirialan who turned out to be a pirate named Synara San."}, {"tag": "p", "text": "While working on a targeting computer in the repair station, Yeager sent BB-8 to find Kaz. Following a \"wild goose chase,\" BB-8 discovered that Kaz had already returned to the garage. Team Firebird later worked on the targeting computer, which was part of the Colossus's anti-air defense system. Before they could repair the computer, the Colossus was raided by the Warbirds, who were helped by intelligence from Synara. Though Yeager and Kaz managed to restore the anti-air defense system, the second raid convinced the Colossus's leader Captain Imanuel Doza to reconsider the First Order's offer of protection."}, {"tag": "h3", "text": "Old wounds"}, {"tag": "p", "text": "Later, Yeager's estranged brother Marcus Speedstar visited Yeager's repair station in an attempt to reconcile with his older brother. However, Yeager was still bitter towards Marcus for his role in his family's deaths. While taking part in the Platform Classic, the two reconciled after Yeager realized that Marcus wanted to free his friend Oplock from the Guavian Death Gang. After reconciling, the two spent time at Yeager's repair station."}, {"tag": "h3", "text": "Casual adventures"}, {"tag": "p", "text": "After Kaz borrowed the Fireball for a recon flight with Poe Dameron, Tam revealed that she had not fitted the ship with a new stabilizer as an insurance; regarding the Fireball as her own ship."}, {"tag": "p", "text": "After losing his hard hat, Bucket went searching for it through the garage and the Colossus. Unable to find the hat, he returned to Yeager's repair station only to discover that Tam had allowed BB-8 to try the hat on."}, {"tag": "p", "text": "Later, Kaz's friend Torra Doza, the daughter of Captain Doza, got Kaz to babysit her pet voorpak Buggles. However, the pet escaped and went on a run before ending up in the cockpit of the Fireball. Xiono later raced with Torra aboard the Fireball but ended up crash-landing in Yeager's repair station, damaging the ship."}, {"tag": "h3", "text": "Bibo incident"}, {"tag": "p", "text": "While visiting Synara San in the loading docks, Neeku adopted a baby rokkna which he nicknamed \"Bibo.\" Bibo created havoc in Yeager's repair station, prompting him to remind Neeku that he did not allow pets. Neeku convinced Yeager to give him a second chance but was unable to control the creature. When Neeku demanded Bibo's expulsion, a distraught Neeku threatened to leave and searched for Bibo. After Bibo's mother attacked the Colossus during the \"Bibo incident,\" Neeku returned Bibo to his mother."}, {"tag": "h3", "text": "The approaching storm"}, {"tag": "p", "text": "As Kaz's mechanical skills improved, he was able to install a GX engine into the Fireball, impressing Tam, Yeager, and Neeku. Prior to the kidnapping of Torra Doza, Kaz, and Neeku worked on a speeder bike while BB-8 played a prank on Bucket, leading to a fight. Tam later suggested that Kaz and Neeku check up on Synara."}, {"tag": "p", "text": "When the First Order occupied the Colossus, several stormtroopers visited the garage, seeking information on Synara San. Kaz, Yeager, and Neeku managed to avoid trouble with the First Order. Kaz and Neeku later help Synara San escape First Order forces in an escape pod and rejoin her fellow Warbirds."}, {"tag": "p", "text": "During the occupation, Yeager and his employees had a tense debate in the station about the First Order and the Empire. While Yeager regarded the First Order and Empire as malevolent, Tam liked the stability and security brought by both regimes. Shortly later, Kel and Eila, who had knocked out the stormtrooper CS-515, sought Kaz's help in checking that the stormtrooper had not reported their presence. Neeku and Tam accompanied Kaz. Following the adventure, Kaz obtained a data rod containing the First Order's fleet movements and shared this information with Yeager inside the station."}, {"tag": "p", "text": "Poe managed to visit the garage and enlisted Xiono and BB-8 for a mission to the Dassal system. The two managed to evade the First Order occupation by sneaking off in the Fireball and rendezvousing with CB-23 and Poe's T-70 X-wing starfighter in the upper atmosphere. After returning from the mission, Xiono returned with CB-23, who had replaced BB-8 as his minder. Xiono kept the details of his offworld mission secret from everyone but Yeager, which earned Tam's resentment and distrust."}, {"tag": "h3", "text": "Resisting the First Order"}, {"tag": "p", "text": "The following day, Tam questioned Xiono about the damage to the Fireball's injection turbine and hull but he denied that he had been in a firefight with the First Order. After the First Order banned races and dissidents began disappearing, Yeager held a secret meeting with Captain Doza to discuss the situation. Later, First Order stormtroopers led by Commander Pyre raided and arrested members of Team Fireball."}, {"tag": "p", "text": "When Yeager demanded to know why they were being arrested, Pyre revealed that the Fireball had been spotted in Sector Epsilon 51-3, which was considered First Order space. Kaz realized that his cover as a spy had been blown while Tam was horrified. Most of Team Fireball managed to escape the garage after Bucket released white foam. However, Tam allowed herself to be arrested, believing the situation to be a misunderstanding. Yeager and Kaz started the Colossus resistance and expelled the First Order from the station. Meanwhile First Order Security Bureau Agent Tierny managed to turn Tam against Yeager and Kaz, by claiming they had taken advantage of her. Tam subsequently joined the First Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jarek Yeager's Repair Station first appeared in \"The Recruit.\" the first episode of the animated series Star Wars Resistance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}