{"url": "Jarell", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Kathol sector species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Jarell"}, {"tag": "p", "text": "Jarells were a humanoid reptiloid species native to the planet Oon Tien in the Kathol sector. They developed a primitive society on their homeworld, organized into matriarchal city-states, before contact with colony ships from the Galactic Republic approximately three centuries prior to the Battle of Endor."}, {"tag": "p", "text": "Jarells were a historically violent species; the various monarchies that ruled Jarell society forced their own young into periods of indentured servitude in exchange for weapons and technology. Since their discovery by the Republic, Jarells migrated to several other planets in the Kathol sector and were often found serving private citizens, corporations, and criminal organizations as hired muscle."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Jarells were a large humanoid reptiloid species who possessed great strength. Jarells had mottled skin, which was predominantly purple and white, but included blue patches on the arms and forehead."}, {"tag": "p", "text": "They had wide skulls with four bony cranial ridges that were present on their heads, starting at the brow and running over the scalp to the nape, from which short spikes protruded. Jarells possessed red eyes. Instead of a mouth, Jarells had a mass of thick tendrils that covered the lower portion of their face. Several small bony growths sprouted on their elbows, and their fingers terminated in sharp claws."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Jarells were a society ruled by monarchies, divided into various city-states across their homeworld of Oon Tien. A historically violent species, Jarells were considered to be dim-witted by other beings. However, Jarells were actually a creative and perceptive species, with excellent memories and a tradition of oral storytelling. They spoke Jarellian, a language that had several different dialects, but no written form."}, {"tag": "p", "text": "Following contact with the outside galaxy, many of the planet's monarchies made arrangements for young Jarells to serve periods of indentured servitude to corporations, private citizens, criminal organizations, and even Imperial governors as hired muscle and general servants. The length of service was usually between seven and eleven years, and while it was essentially slavery, young Jarells were socialized to accept it as a natural period of their lives. They saw it as a period of maturation, symbolizing their transition from child to adult."}, {"tag": "p", "text": "While few Jarells actually ever profited from the arrangement, they hoped that their servitude would introduce them to beings who could make them powerful, or help them acquire wealth. As a result, young Jarells on the cusp of their service looked forward to the time with excitement and purpose. While generally loyal to their employers, some Jarells were willing to undermine them if it would benefit them to do so."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jarells originated on the planet Oon Tien in the Kathol sector. The species lived in monarchic city-states and had a knowledge of basic metal-working when they were first contacted by colony ships from the Galactic Republic approximately three hundred years before the Battle of Endor."}, {"tag": "p", "text": "The Human settlers subsequently established several settlements on Oon Tien, and lived side-by-side with their Jarell neighbors. Although technologically primitive, the Jarell monarchies began trading gemstones and periods of indentured servitude from their young in exchange for weapons and other high-technology items with the Humans. The weapons were used by the monarchies in a series of armed conflicts and revolutions that changed Jarell society, although the fighting never spread to any of the Human settlements on the planet."}, {"tag": "p", "text": "Following contact with the Republic, Oon Tien became a vital part of the Kathol sector, with manufacturing and agriculture being important parts of its industry. Jarells settled on other worlds in the Kathol sector, including Kolatill, Pembric II, and Corjain."}, {"tag": "h2", "text": "Jarells in the galaxy"}, {"tag": "p", "text": "Jarells were found in the Kathol sector, usually engaged in their period of indentured servitude to whomever had contracted their services. These jobs took advantage of the Jarells' strength and historically violent nature."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jarell were created for The DarkStryder Campaign, a supplement for Star Wars: The Roleplaying Game by West End Games published in 1995."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}