{"url": "Jaric_Kaedan", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi High Council members", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jaric Kaedan"}, {"tag": "p", "text": "Jaric Kaedan was a Human male Jedi Master who served the Jedi Order and the Galactic Republic during the Great Galactic War against the resurgent Sith Empire. Also known as the Order's Watchman, Kaedan was born in the Outer Rim Territories in the decades before the war and taken in for training by the Jedi at the age of twelve, becoming a Jedi Knight under the tutelage of Ngani Zho. Serving valiantly on battlefields across the galaxy during the war, Kaedan was instrumental in the capture of the Sith Lords known as the Dread Masters in 3668 BBY, and as a Jedi Master he fought in the Battle of Rhen Var in the last months of the war. When the Treaty of Coruscant brought the war to a close in 3653 BBY, Kaedan was appointed to the Jedi High Council in the subsequent Cold War and accompanied the rest of Order to their recently rediscovered homeworld of Tython. Training a Sullustan Padawan by the name of Nae Nuuv to Knighthood, Kaedan remained ever-vigilant against the threat of the Sith, and he joined the Republic Military in combating the Empire on Ilum in 3640 BBY after the Galactic War began. Leading a contingent to reclaim the Jedi's Ilum Temple on the Order's sacred world, Kaedan was killed by a Sith strike team during the Battle of Ilum."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human male, Jaric Kaedan born in the Outer Rim Territories sometime before the year 3691 BBY. He was discovered by the Jedi Order at the age of twelve and underwent training in the ways of the Force by Jedi Master Ngani Zho, attaining the rank of Jedi Knight sometime during the Great Galactic War between the Sith Empire and the Galactic Republic. In 3668 BBY, Kaedan led a team of troopers from the Republic Special Forces Division on a mission to capture the six Sith Lords known as the Dread Masters. Kaedan and the Special Forces team infiltrated the dreadnought and successfully defeated them in combat, withstanding the Sith's ability to influence their opponents' fear through battle meditation. Kaedan also downloaded the dreadnought's entire Imperial database before scuttling the vessel, gaining a valuable source of intelligence for the Republic and convincing the Empire that the Dread Masters had been killed in the assault. Sometime after becoming a Knight, Kaedan had a hostile encounter with the Cult of M'dweshuu, a brutal religious sect of the Nikto species, and Kaedan was rescued from the situation by Master Zho. However, Kaedan became angry with Zho as a result of the encounter, and he still had not spoken with his former Master by the time of Zho's death in 3643 BBY."}, {"tag": "p", "text": "As the war neared the end of its third decade, Kaedan was sent to the planet Rhen Var alongside Satele Shan, Syo Bakarn, and Bela Kiwiiks, all of whom were former students of Master Zho. By that time, Kaedan had become a master of a variation of the seventh form of lightsaber combat known as \"Juyo-Kos,\" and he was considered to be living weapon who was guided by the Force itself. The four Jedi found the Republic Military's Forty-fifth Battalion in disarray after a brutal Imperial invasion, and Kaedan discussed their plans with Kiwiiks and Shan while Bakarn healed wounded soldiers. He scoffed at what he saw as fear on the behalf of Kiwiiks, claiming that the Jedi would easily hold off the enemy at the pass, but he was contradicted by Shan. Under the leadership of Shan, the Jedi and the remaining Republic troopers launched a furious assault on the Imperial forces, and Kaedan cut down many enemy soldiers and Sith with his twin green-bladed lightsabers. During the battle, Kaedan rescued Bakarn from an attacking Sith by shoving his fellow Jedi out of the way and blocking the enemy's blade with his own weapons. The battle ended when Shan defeated Darth Mekhis, the Sith commander on Rhen Var and a member of the Empire's ruling Dark Council, in a duel within the Sith's fortress. The war ended not long afterwards with the signing of the Treaty of Coruscant in 3653 BBY, which forced the Republic to withdraw all of their forces and submit to the Empire's terms on account of the Imperial invasion of the capital planet Coruscant."}, {"tag": "p", "text": "During the subsequent Cold War, Kaedan was made a Jedi Master and later appointed to the Jedi High Council alongside Bakarn, Shan, Kiwiiks, Orgus Din, and another Jedi, as six of the Council members had been killed during the Sacking of Coruscant."}, {"tag": "p", "text": "Some time later, as Tol Braga's strike team, which included himself, Leeha Narezz, Warren Sedoru and the Hero of Tython, was preparing to depart for the Emperor's cloaked space station in hopes of capturing him so he could be redeemed, the Jedi Council and Jedi Knight Jomar Chul chose to intervene. Kaedan expressed uncertainty that Braga's plan would succeed, but Chul had a more disturbing revelation. Chul explained that he had a vision of the Hero falling to the dark side and becoming Sith and insisted he take the Hero's place on the mission. However, Satele and Kiwiiks expressed confidence in the Hero's loyalty and sanctioned the mission, to Chul's frustration as he stormed out of the Council chamber. Kaedan pleaded one last time with Braga to abandon his plan, but the latter insisted it would work."}, {"tag": "p", "text": "Soon, the Council heard nothing from Braga's strike team until the Hero returned some time later, revealing that the mission had failed. As the Hero explained, the Emperor overpowered the strike team and had them under thrall. However, Lord Scourge, the Emperor's Wrath, helped the Hero and company escape. Kaedan didn't trust him, stating that Sith were selfish by nature. Scourge explained that his change of allegiance was to stop the Emperor from destroying the galaxy. Three centuries ago, he had a vision of the Emperor performing a dark side ritual that would consume all life in the galaxy, but the Hero would be the one to stop him. But the ritual required a sacrifice of billions of simultaneous deaths, which would occur on Belsavis and urged haste in saving the planet. Kaedan remained suspicious of the Sith's intentions, even putting a lightsaber to Scourge's throat. Scourge insisted that he was the foremost expert on the Emperor and he was more use to them free with the Jedi; he believed could defeat the Emperor. Satele Shan sensed the truth in his words and consented to an alliance."}, {"tag": "p", "text": "During the Battle for Ilum, Jedi Master Jaric Kaeden was placed in command of a Republic ground assault team, whose goal was to halt the Empire's Adegan crystal mining operation. Sith forces on the planet were tasked, by Grand Moff Ilyan Regus, with dispatching Jaric Kaeden (operation \"First Strike\"). The mission was ultimately a success, leading to the death of the famed Jedi at the hands of the Sith."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "To his students, Master Jaric Kaedan was a harsh taskmaster, driven by the knowledge that his lessons may one day save their lives. He believed that the greatest threats to a Jedi came from within, and encouraged his students to master themselves before seeking mastery over a lightsaber. To the Sith, he was known for being a formidable enemy. He was firm in his convictions that peace in the galaxy could not be achieved whilst the resurgent Sith Empire existed. However, he showed paranoia and fear as well. When the Barsen'thor was recruiting an army on Voss, he tried to stop the Barsen'thor with fearful talk about their Force use and tried to reject a proposal by a Mystic to have more Jedi learn on Voss. He also would criticize and hastily judge others, including fellow council members; those he was to judge included Yuon Par and Kira Carsen. However, he was able to gracefully admit when he was wrong, as seen by the fact that he accepted Carsen after she overcame the Emperor's will in the heat of battle. However, he also viewed Lord Scourge with intense distaste, even threatening him with a lightsaber."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Powerful in both the use of the Force and lightsaber combat, Kaedan was considered to be a master of Juyo-Kos, the seventh combat form. In battle, Kaedan became a living weapon of the Force, and even as a Jedi Knight he was able to withstand the powerful influence of the fear-wielding Dread Masters in order to capture the six Sith Lords."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}