{"url": "Jaunty_Cavalier", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Smuggler starships", "Category:YT-series freighters"], "nodes": [{"tag": "h1", "text": "Jaunty Cavalier"}, {"tag": "p", "text": "The Jaunty Cavalier was a YT-series freighter owned by the Wookiee Rufarr, who operated it alongside a crew of six beings. The vessel was a common sight around the planet Bakura in the Outer Rim Territories during the conflict fought by the denizens of the galaxy against the extragalactic Yuuzhan Vong. In 28 ABY, the crew of the Jaunty Cavalier was contracted by Molierre Cundertol, Prime Minister of Bakura, to take delivery of a Human replica droid made in his image and take it to Lwhekk, the Ssi-ruuk homeworld. The crew then staged Cundertol's kidnapping to transport the Prime Minister to the same location."}, {"tag": "p", "text": "Cundertol was in league with the Ssi-ruuk, a reptilian species that inhabited a star cluster near to Bakura. After a failed invasion attempt on Bakura twenty-four years earlier, the Ssi-ruuk were looking to try again. In exchange for using the Ssi-ruuvi entechment process to transfer his life essence into the Human replica droid, Cundertol was to assist them in taking the planet. With the process completed, the Jaunty Cavalier took Cundertol back to Bakura. However, to ensure secrecy about his new immortal condition, Cundertol murdered the crew of the Jaunty Cavalier and sabotaged the ship. The vessel was destroyed shortly after exiting hyperspace above Bakura, but the Prime Minister ejected in an escape pod. After being rescued, he spun a tale of being kidnapped by the crew of the Jaunty Cavalier, escaping and overpowering them before turning the ship around to make it home."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Jaunty Cavalier was a Corellian Engineering Corporation YT-series freighter with an asymmetrical design. The ship, which regularly operated with a crew of seven and carried at least one escape pod, was in a state of disrepair by 28 ABY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Operating around Bakura"}, {"tag": "p", "text": "The Jaunty Cavalier was a YT-series vessel owned by the Wookiee Rufarr, who captained the ship alongside a crew of six other beings. By 28 ABY, the Jaunty Cavalier operated in the Outer Rim Territories close to the planet Bakura and was a regular visitor to the planet. During one such visit, Rufarr ended up owing an operator working with Bakura Orbital Control a sum of credits."}, {"tag": "h3", "text": "Contracted by Cundertol"}, {"tag": "p", "text": "During the war against the extragalactic invaders known as the Yuuzhan Vong, Rufarr and the crew of the Jaunty Cavalier were contracted by Prime Minister Molierre Cundertol of Bakura to take delivery of a Human replica droid that had been made in Cundertol's image and deliver it to Lwhekk, the Ssi-ruuk homeworld. As part of the deal, the Jaunty Cavalier crew were to also transport Cundertol to the location, but it had to be done in secrecy."}, {"tag": "p", "text": "Cundertol had secretly negotiated an agreement with the Ssi-ruuk, a reptilian species from a nearby star cluster that had previously attempted to invade Bakura twenty-four years earlier. In exchange for using their entechment technology to transfer his life essence to the Human replica droid—in effect, gaining immortality—Cundertol promised to assist in their second attempt to invade Bakura."}, {"tag": "p", "text": "Rufarr and the Jaunty Cavalier crew staged the kidnapping of the Prime Minister and spirited him off to the secret location where the transfer was successfully completed. In doing so, they were implicated as radical members of the Freedom resistance movement, an anti-New Republic organization that supported a more independent Bakura free of outside influence. The Jaunty Cavalier was then used to take Cundertol back to Bakura. However, the Prime Minister could not risk the crew of the Jaunty Cavalier contradicting any story he came up with to cover his disappearance, so he murdered the crew and sabotaged the ship."}, {"tag": "h3", "text": "Return to Bakura"}, {"tag": "p", "text": "As the Jaunty Cavalier exited hyperspace over Bakura, it went into an uncontrolled spin and its drive units fired at random intervals. The vessel's orbital insertion took it close to the Lancer-class frigate Pride of Selonia, a Galactic Federation of Free Alliances ship that had arrived at Bakura on a mission to re-establish contact with worlds that had been cut off from the galaxy due to the Yuuzhan Vong advance across the galaxy. Since the Jaunty Cavalier was out of control and dangerously close to the Pride of Selonia, the commander of the Alliance frigate's starfighter squadron, Jagged Fel, attempted to hail the vessel, instructing them to change course or action would be taken."}, {"tag": "p", "text": "When no response was forthcoming, and with the possibility that the Jaunty Cavalier might hit the Pride of Selonia, Fel requested and received permission from Bakura Orbital Control to attempt to nudge the wayward freighter out of the Pride's way. Fel—along with four other fighters from Twin Suns Squadron—moved in close, using their shields to gradually move the Jaunty Cavalier clear of both the Pride of Selonia and Bakura's atmosphere. During the maneuver, the Jaunty Cavalier's engines abruptly flashed and died."}, {"tag": "p", "text": "Fel, recognizing the beginnings of an explosive drive failure, ordered his fellow pilots to break away from the freighter immediately. The drive unit exploded, destroying much of the vessel. Only part of the forward structural chassis remained recognizable. Despite the force of the Jaunty Cavalier's explosion, Fel and his fellow pilots managed to escape the blast wave."}, {"tag": "h3", "text": "Cundertol's deception"}, {"tag": "p", "text": "Just prior to the explosion, an escape pod launched from the Jaunty Cavalier containing Cundertol. Rescued by Fel, the Prime Minister was taken aboard the Pride of Selonia, where he relayed a story to Captain Todra Mayn, the frigate's commander, about being kidnapped by the crew of the Jaunty Cavalier inside the Bakuran Senate Complex and being smuggled out of the spaceport disguised as a box of records. He told those assembled in the medical bay—which included Fel—that he believed he had been kidnapped with the express intention of being interrogated and then killed. Because of this, Cundertol chose to attempt to escape and managed to get free from his restraints. He told them a tale of how he overpowered the crew, then turned the ship around and headed back to Bakura, where the Jaunty Cavalier developed \"system rot\" and began falling apart around him, barely escaping the vessel in time."}, {"tag": "p", "text": "Eventually, Cundertol's involvement in the subsequent Ssi-ruuvi invasion of Bakura was discovered, and the truth behind the Jaunty Cavalier's mission and later destruction was revealed."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Jaunty Cavalier was owned and commanded by Rufarr, a Wookiee. The vessel was crewed by six other beings in addition to Rufarr—four Humans and two Rodians."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jaunty Cavalier first appeared in the 2003 novel The New Jedi Order: Force Heretic II: Refugee, the second book in The New Jedi Order's Force Heretic trilogy, written by Sean Williams and Shane Dix. The Jaunty Cavalier's entry in The Complete Star Wars Encyclopedia indicated that the vessel exploded shortly after exiting hyperspace near Bakura due to Cundertol's sabotage; while Cundertol's sabotage did result in the destruction of the ship, it did not happen immediately after reverting to realspace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}