{"url": "Jauxson", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Gotals", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Jauxson"}, {"tag": "p", "text": "Jauxson was the Gotal captain of a gang of pirates who operated on the planet Clak'dor VII. After serving with various pirate crews throughout the galaxy from childhood, Jauxson split off to form his own band. He and the group eventually abandoned space raids in favor of planet-based operations on Clak'dor VII, the homeworld of the Bith species."}, {"tag": "p", "text": "Targeting three domed Bith cities, Jauxson and his men negotiated entry into the cities by threatening to destroy their domes, thus exposing the citizens to the harsh atmosphere of their world. Sometime during the Galactic Civil War, two Bith citizens of the city of Buerhoz hired a group of spacers to put an end to Jauxson's predations. When the Gotal and his crew were confronted by the spacers and the army they had gathered, the pirates were defeated and Jauxson was deposed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jauxson was a male Gotal who spent his early life and career serving other pirate leaders, including some of the more notorious and feared pirates throughout the galaxy. Jauxson himself eventually became the leader of his own pirate gang, which eventually comprised twenty members. The group plied the spacelanes until growing tired of such raids and relocating to the planet Clak'dor VII. They set up a temporary headquarters in a mountainous region near the domed city of Buerhoz, using environment suits and breathers to shield themselves from Clak'dor VII's harsh atmosphere. They singled out Buerhoz and two other cities for their main targets, raiding them weekly."}, {"tag": "p", "text": "Jauxson's gang typically spent two days per week at their camp and then sped to their planned raiding site on swoops and speeder bikes in groups of ten or fewer. At the target city, Jauxson and his crew demanded entry into the dome lest they destroy them and expose the citizens to the toxic atmosphere outside; the Bith citizens regularly complied. Once inside, the Gotal pirate and his crew raided the population centers, roaming the streets and often stealing foodstuffs and alcoholic beverages, among other things. Jauxson met any hesitation on the Bith's part with violent reprisals, including hostage-taking. These raids impeded city commerce and forced the populations to live in constant fear."}, {"tag": "p", "text": "At some point during the Galactic Civil War, two Bith citizens of Buerhoz, tired of Jauxson's predations, hired a group of spacers to help them gather a small army to fight off the Gotal and his bandits and free the city. When a raiding band met this resistance, they fled to their camp to gather reinforcements. Jauxson and his crew returned to Buerhoz with a larger force, but the spacers had also gathered more combatants to face them. During the ensuing battle, Jauxson and his men were defeated, and the Gotal captain was deposed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jauxson was a fierce pirate, and he was unrelenting in his raids of Bith cities. His threats to destroy the cities' protective domes and thus expose the inhabitants inside to the harsh atmosphere of Clak'dor VII frightened the Bith into giving in to his demands and allowing him free reign inside their population centers. During the raids, Jauxon regarded the property of his victims to be his own; he and his gang roamed the streets without fear and took whatever they desired—namely food and alcohol. Jauxon's ruthlessness also manifested in his treatment of any Bith resistance to his raids: he met such acts with violence and kidnapping."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jauxson appears in \"A Fistful of Credits,\" an adventure scenario written by Bill Olmesdahl and published by West End Games in 1992 as part of the Star Wars Gamemaster Screen. The adventure outline casts the player-characters as the offworlders hired by the Bith of Buerhoz to repel Jauxson and his forces, but it does not specify whether they put an end to Jauxson's operations. However, Jauxson's entry in The Complete Star Wars Encyclopedia, published in 2008 by Del Rey, indicates that the Gotal pirate captain was in fact bested by these spacers and deposed from the leadership of his gang."}, {"tag": "p", "text": "Variants and customization options allow the gamemaster to add extra characters to the scenario, one of whom is \"the Heroine.\" This character is a self-reliant woman who is determined to fight off the bandits. Her description suggests that Jauxson is enamored of her and that his crimes are actually aimed at having her for his own. Another variant suggests that Jauxson may challenge one of the characters to a \"fair fight\" like in a typical film set in the American Old West."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}