{"url": "Jav_Mefran", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Alliance Military enlisted personnel", "Category:Alliance Special Forces personnel", "Category:Humans", "Category:Males", "Category:Rogue One personnel"], "nodes": [{"tag": "h1", "text": "Jav Mefran"}, {"tag": "p", "text": "Jav Mefran was a human male soldier who served as a corporal in the Alliance to Restore the Republic at the beginning of the Galactic Civil War. He participated in the Battle of Scarif as part of the Rogue One squad, and perished during the fighting."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jav Mefran served as a wilderness fighter specialist with the 4th SpecForce Regiment of the Rebel Alliance Special Forces. When the Rebel Alliance relocated from Dantooine to Yavin 4, Mefran assisted in clearing out the jungle brush which surrounded the Great Temple."}, {"tag": "p", "text": "As a corporal, Mefran became a member of the Rogue One squad, and fought at the Battle of Scarif. Although he had misgivings about the mission, Mefran masked them by focusing on the beautiful tropical environment of Scarif, having an affinity for rainforest surroundings. As the fighting progressed from landing pad nine, Corporal Mefran remained with the Zeta-class Heavy Cargo Shuttle SW-0608 alongside Corporal Stordan Tonc and other Pathfinders. Initially hiding from Imperial reinforcements, he helped defend the vessel when the Empire came to investigate, and exchanged blaster fire with enemy troops outside the shuttle. However, although Bodhi Rook was able to open communications with the Alliance Fleet above the planet, Mefran was shot by Imperial forces."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Gruff and grizzled, Jav Mefran served as a wilderness fighter specialist. He had an affinity for rainforest surroundings, and enjoyed focusing on the beauty of his environment as a means of masking any misgivings about a current mission or operation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mefran was played by Francis Magee in Rogue One: A Star Wars Story, where the character was credited as \"Grizzly Rebel.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}