{"url": "Andy_Craven", "categories": ["Category:Real-world articles", "Category:Star Wars game developers"], "nodes": [{"tag": "h1", "text": "Andy Craven"}, {"tag": "p", "text": "Andy Craven is a former video game developer who founded Vektor Grafix, a United Kingdom-based computer game development company. The company's first products were ports of Star Wars: The Arcade Game and Star Wars: The Empire Strikes Back for home computers."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Before Craven designed video games, he was a rock musician, touring Europe with various bands. He often played on British and American military bases. Eventually he stopped touring and got married."}, {"tag": "p", "text": "Craven taught himself computer programming in the 1980s, as was the norm in that era. He eventually became an instructor in programming qualifications in Leeds, where he met Daniel James Gallagher. Craven and Gallagher founded Vektor Grafix in June 1987, hiring Ciaran Gultnieks as the first employee. Within a month, the three men won a contract to port Star Wars: The Arcade Game to three period home computers: the ZX Spectrum, Commodore 64, and BBC Micro."}, {"tag": "p", "text": "The results were satisfactory, and Vektor was given the contract for the next game in the series, The Empire Strikes Back. The company underwent a number of personnel changes at that point. Gallagher departed, and several new developers were hired: industry veteran Ian Martin, and newcomers Derrick Austin and Bill Pullan."}, {"tag": "p", "text": "Craven proceeded to produce a variety of other games with Vektor Grafix, until the firm was bought out by MicroProse in 1992."}, {"tag": "p", "text": "Craven then entered business with fellow developer Ian Oliver, of Realtime Games Software. Craven and Oliver formed Cross Products Ltd, which released a game development system. Cross Products Ltd. was sold to Sega in 1994. Oliver stayed with the company until it was sold again in 2001, while Craven went on to found Proactive Events, an Events Services company."}, {"tag": "h2", "text": "Works"}, {"tag": "h3", "text": "Star Wars"}, {"tag": "h3", "text": "Other"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}