{"url": "Jax_Pavan", "categories": ["Category:Legends articles", "Category:We're Doomed!", "Category:Humans", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Knights", "Category:Private investigators", "Category:Whiplash members"], "nodes": [{"tag": "h1", "text": "Jax Pavan"}, {"tag": "p", "text": "Jax Pavan was a Human male Jedi Knight who served the Jedi Order during the waning years of the Galactic Republic. His father, Lorn Pavan, was once employed at the Jedi Temple. He was trained by Even Piell, and during the Great Jedi Purge wielded a blue lightsaber. Following the Purge, he went underground, living in Coruscant's underworld. However, he was hunted by Darth Vader, Dark Lord of the Sith, forcing him to do whatever he could to survive."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jax's father worked at the Jedi Temple until the Jedi realized the Force potential in his two-year-old son. However, after agreeing to let the Jedi train Jax, Lorn was requested to leave the Temple, as Jedi trainees were seldom allowed contact with their parents. Lorn acquiesced, but missed his son terribly, and became extremely hostile towards the Jedi."}, {"tag": "p", "text": "Shortly before the Battle of Naboo, Lorn and his partner I-5YQ were chased by Darth Maul, who sought a holocube Lorn had obtained from Hath Monchar which detailed the planned blockade of Naboo. Lorn shut I-Five down for his own safety and entrusted him to an acquaintance with instruction to take the droid to the Jedi Temple. The acquaintance, however, saw the value in the modified droid and wiped his memory. Lorn was ultimately killed by Maul, who would in turn be defeated by then-Jedi Padawan Obi-Wan Kenobi, when he cut the Sith Lord in half during the Duel in Theed. It would be over a decade before Maul returned to the galaxy as a cyborg."}, {"tag": "p", "text": "As Kenobi's Padawan, Anakin Skywalker befriended Jax Pavan and confided in him. Anakin gave Jax a gift, a pyronium crystal. Jax was knighted three months before the Clone Wars ended."}, {"tag": "p", "text": "During the Clone Wars, I-Five found himself attached to a Republic Mobile Surgical Unit, with Sullustan Den Dhur and Padawan Barriss Offee. He worked at reconstructing his memories, and finally recalled Lorn's final request to him—to watch over his son. I-Five returned to Coruscant to find Jax and fulfill this request."}, {"tag": "h3", "text": "After the purge"}, {"tag": "p", "text": "Jax survived Order 66 living as a private investigator in the Blackpit Slums. During this time he discarded his Jedi robes for \"a nondescript vest of black bantha leather, threadbare gray trousers, and black boots, with an ankle-length, gunmetal-colored greatcoat over it all,\" cut his dark brown hair and dyed it black, and permanently depilated his beard, in order to disguise himself, so he wouldn't be recognized as a Jedi. He worked with the underground organization Whiplash, who worked to create the \"Underground Mag-Lev\" to ferry politicians and others, including Jedi, who had incurred the Empire's wrath, off of Coruscant. Jax would eventually be reunited with his fellow freedom fighter Nick Rostu, who told him that Jax's Jedi Master, Even Piell, had before his death told Jax to find the protocol droid 10-4TO, nicknamed \"Bug-Eyes\", who held information crucial to the burgeoning rebellion. Jax would also ally with Laranth Tarak, I-5YQ and Den Dhur. During their search, Jax learned from Nick Rostu that Darth Vader was seeking him, for a reason unbeknownst to anyone."}, {"tag": "p", "text": "Jax and company tracked the droid, with the grudging help of Rokko, to Factory District on Coruscant, where he found Bug-Eyes in the possession of Prince Xizor. After a blistering battle with both the Falleen and the feral droids of the Factory District, Jax and company narrowly escaped the arrival of Darth Vader and returned to the sectors of Coruscant they called home. Although they could have left the planet, Jax was determined to stay and continue his work against the new order, and the others (the party now also included Kaird of the Nediji and Haninum Tyk Rhinann) agreed to stay with him."}, {"tag": "h3", "text": "Whiplash"}, {"tag": "p", "text": "Jax and his group of friends became a part of the Whiplash movement on Coruscant, helping beings to escape offworld. One of their missions was to help the Zeltron Dejah Duare leave the planet. Her partner, however, the famous Caamasi artist Ves Volette, was murdered shortly after she came to them for help. They agreed to help her find Volette's killer. When Jax and his friends finally ended the investigation, they arranged for Dejah to leave, but were attacked at the spaceport by none other than the famed bounty hunter Aurra Sing, who Vader had hired to capture Jax. Sing engaged Jax in a duel, in which Jax survived by outsmarting Sing and dropping her into a reposicator, where he presumed she was killed. Afterwards, a gravely injured Laranth decided to leave Jax's group, while Dejah decided to stay on Coruscant and join it."}, {"tag": "p", "text": "Several months later, Jax and Laranth found and decided to train a young Force-adept named Kajin Savaros, who was being hunted by the Inquisitorius. Kajin's anger issues made it difficult for Jax to train him, and eventually Dejah, whose romantic overtures had been repeatedly spurned by Jax, betrayed the group by allying herself with Inquisitor Probus Tesla and Darth Vader, leading to Laranth and Kajin being kidnapped. Vader erased Kajin's memories and sought to train him as one of the Inquisitors, and had Laranth tortured in an attempt to acquire the bota plant extract Barriss Offee had given to I-5 and the Sith holocron that Rhinann had stolen."}, {"tag": "p", "text": "When Jax attempted a rescue mission, Dejah revealed that she had betrayed the group because of a sensual addiction to the energies given off by Force-users, which Jax had been unwilling to allow her access to. Vader attempted to analyze the bota extract but it was absorbed by his system, causing an uncontrolled manifestation of Force energy that killed Dejah and injured Tesla, with Vader then attempting to kill Kajin and Jax. Rhinann attacked Vader and distracted him to the point where Kajin and Jax were freed, but paid for the effort with his life."}, {"tag": "p", "text": "Jax, Laranth, I-5 and Kajin escaped, aided by members of Whiplash, but Kajin's memories were possibly permanently erased, and Jax sent him to the planet of Shili, where he could lead a peaceful life. Jax decided to stay on Coruscant and continue helping Whiplash, then confronted Laranth about their feelings for each other, refusing to allow her to dismiss the subject as she had previously done. Upon sharing their emotions through the Force for a second time, Jax and Laranth realized that they loved each other, however, they mutually came to a decision to not rush into anything."}, {"tag": "p", "text": "When looking back at the previous battle, Jax remembered Vader demanding that he return the pyronium nugget. This led him to what he found to be an impossible conclusion, but dreaded it to be true: Anakin Skywalker, Jax's Padawan-time friend, was Darth Vader."}, {"tag": "p", "text": "Returning to the group's dwelling, Jax experienced a momentary connection to the Cosmic Force, and realized that with the loss of the bota extract, only the Force itself could have made such an experience possible. Jax felt this was the Force's way of letting him know that he was fulfilling his purpose, and then turned his attention to a new client."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jax was a deep thinker, often to the point of over thinking things. He would often wonder about the nature of a person's connection to the Force as well as himself and his decisions. Although he had had rather long brown hair and a beard and wore the typical robes of a Jedi before Order 66, Jax afterward dyed his hair black, permanently removed his beard, and took to wearing a long, high-collared, gray greatcoat."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Jax was skilled with the Force, but he lacked a constant connection with it. He viewed the Force as ribbons of color that extended into multiple dimensions, with which he could manipulate the things around him, view the \"auras\" of people, or sense webs of personal connections. He was also skilled with a lightsaber and lightwhip. He had been trained a bit with lightwhips at the Jedi Temple, but was not a master with that weapon. From his training under Even Piell Pavan had at least basic knowledge of all the lightsaber combat forms but was especially proficient in Makashi."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Unlike most Jedi, Jax had a small stash of personal items which he had kept after the Purge. These included a holocron of Yoda, a crystal from Dantooine, and a reliquary containing a stone Skywalker had given him. Also unlike most Jedi, Pavan used a red lightsaber during a duel with Aurra that belonged to her and was sent to Pavan by Captain Gregar Typho."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jax Pavan's physical appearance resembles Star Wars's creator, George Lucas, during his youth."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}