{"url": "Jaxsinne_Tamm/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:Galactic Republic intelligence personnel", "Category:Imperial defectors", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Information brokers"], "nodes": [{"tag": "h1", "text": "Jaxsinne Tamm"}, {"tag": "p", "text": "Jaxsinne Tamm was a female intelligence officer who worked with the Grand Army of the Republic during the Clone Wars, and later the Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During her service to the Galactic Republic, Jaxsinne Tamm worked as a military intelligence officer. When Order 66 was initiated at the end of the conflict, Tamm helped the Galactic Empire track surviving Jedi through their data trails, leading to several deaths. Her final target was slain in a ruined city on a planet in the Outer Rim. Regretting her actions, Tamm retired and went into hiding, emerging during the Galactic Civil War as an information broker. Claiming to have the hyperspace coordinates to an ancient Jedi temple, Tamm demanded that the spacer that she encountered take her with them on their journey to the ancient site."}, {"tag": "p", "text": "Providing the information to an interested party free of charge, Tamm accompanied them on the journey. Ambushed by Imperial agents, Tamm was imprisoned within a high-security brig. Because Tamm had encoded the coordinates, her new business partners were compelled to liberate her if they wished to complete their journey. Once freed, Tamm led them to the Outer Rim world where her last target perished. Revealing that she sought closure for her terrible actions against the Jedi, the party finds the ruined city occupied by the security droids that still served to defend the ruins. Despite the danger, Tamm and her companions sought to find the temple and secure the hidden wisdom lost in its ancient ruin."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}