{"url": "Jaxxon", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Adubans", "Category:Lepi", "Category:Males", "Category:Nar Shaddaa residents", "Category:Smugglers", "Category:Star-Hoppers of Aduba-3"], "nodes": [{"tag": "h1", "text": "Jaxxon"}, {"tag": "p", "text": "Jaxxon was a quick-witted Lepi smuggler from Coachelle Prime. The most rambunctious of his family's thirteen children, he left his homeworld at an early age, after stealing an unprotected freighter. He made his way to Nar Shaddaa, where he began to perform odd jobs, quickly becoming familiar with the important elements of fringe culture. After a short stint as a mercenary, he decided to try his hand at smuggling, and he bought a WUD-500 star yacht, christening it the Rabbit's Foot. However, the starship was fraught with mechanical problems and he was forced to land at the shady spaceport of Aduba-3. Needing to acquire funds in order to make repairs, he accepted a job from Han Solo, and became part of the Star-Hoppers of Aduba-3, a mercenary force tasked with defending the small village of Onacra. After protecting the community from Cloud-Riders, the group was forced to fight off the Behemoth from the World Below. Due to Solo's efforts, the giant monster was killed, and Jaxxon was able to get the money needed to repair his ship."}, {"tag": "p", "text": "Later, Jaxxon paired up with one of his fellow Star-Hoppers, Amaiza Foxtrain, to help him in his smuggling business. Using her skill at gambling, the two eventually built up enough money to modify the Rabbit's Foot considerably, making it a formidable smuggling vessel. A short time after the Battle of Yavin, bounty hunters loyal to Beilert Valance, who were looking for clues to the whereabouts of Luke Skywalker, captured Jaxxon. The hunters had inadvertently confused one of Jaxxon's fellow Star-Hoppers, Jimm Doshun, with Skywalker, and knew that Jaxxon would know his location. After prying the location of Aduba-3 from Jaxxon, Valance and his crew went to the world to capture \"Skywalker.\" However, Jaxxon and Foxtrain got there first, and in a carefully executed plan they were able to defeat Valance's men, leaving only him alive at the end of the encounter. Once Valance had realized his mistake, he fled from Aduba-3, claiming that the Star-Hoppers would never stop him from locating his quarry."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jaxxon was born on the planet Coachelle Prime to a small family by Lepi standards. One of thirteen children, Jaxxon was the most rambunctious of the bunch and had dreams of seeing the larger galaxy. However, his family was quite conservative, keeping a quiet house, and his mother had hopes that Jaxxon would grow out of his restlessness and settle down, hopefully to marry a nice girl and father a large family. Despite his mother's hopes, Jaxxon remained uncontrollable, and even before his teenage years, he had spent a decent amount of time in the planet's juvenile remand centers. As the odd one out among his family, Jaxxon decided to go off-world. At the age of twelve, he stole a poorly-guarded freighter and headed for parts unknown."}, {"tag": "p", "text": "On a course for the Outer Rim Territories, Jaxxon eventually landed on Nar Shaddaa, the Smuggler's Moon. Although he had neglected his studies on his homeworld, Jaxxon quickly took to his new life on his own, becoming well-schooled in the elements of fringe culture and streetwise survival. To earn a living, Jaxxon began taking on assorted odd jobs, eventually falling into a tougher crowd. By the time of the Clone Wars, there was a price on his head. He joined the mercenary squad known as the Boys of Corus a short time later. Based out of the Corus system, the group helped Jaxxon hone his marksmanship skills, and he was soon well-versed in the use of weaponry. However, during one operation in the Corporate Sector, the group was subject to a double-cross by their employers. The event marked the end of the mercenary squad, and Jaxxon returned to Nar Shaddaa without a steady-paying job."}, {"tag": "p", "text": "Starved for a source of income, Jaxxon decided to pursue a career in smuggling. With the small amount of funds that he had saved up, Jaxxon invested in a WUD-500 starship, a beat-up freighter that he christened the Rabbit's Foot. However, the used Corellian craft was rife with problems. On a run through the Aduba system, mechanical problems forced Jaxxon to make a stop on the planet of Aduba-3. Stuck until he could repair his starship, Jaxxon set out to gather supplies to begin fixing the Rabbit's Foot."}, {"tag": "h3", "text": "Star-Hoppers of Aduba-3"}, {"tag": "p", "text": "Unfortunately for Jaxxon, the purchase of his ship had left him short on funds and unable to perform repairs. However, while waiting in Locru's Central Saloon, he heard of a quick job for hired guns. Hoping to make use of his mercenary background, Jaxxon answered the call, lining up outside the employer's door with several other hopefuls. The hirer turned out to be none other than Han Solo, a famed smuggler, who, along with his Wookiee co-pilot, Chewbacca, was lying low on the world to avoid the bounty on his head placed by Jabba the Hutt. While there, Solo had answered the pleas of Ramiz, a villager from the nearby village of Onacra, to protect his people from the murderous gang known as the Cloud-Riders. To help him in this endeavor, Solo had decided to recruit as many of the locals as he could."}, {"tag": "p", "text": "After the first ten hopefuls had been rejected by Solo, the next three, including the Spiner Hedji, the pirate Amaiza Foxtrain, and the purported Jedi Knight Don-Wan Kihotay, were all accepted into Solo's band. As the next in line, Jaxxon had become incredibly impatient, and he urged the ancient Kihotay to hurry out of Solo's room. However, before Jaxxon could make it into the room to meet Solo, he was pushed out of the way by Warto, a Boltrunian thug that insisted that he needed to be next to meet with the employer. Jaxxon attempted to dissuade Warto, but the Boltrunian simply turned and hit Jaxxon, knocking him to the floor. Irritated by Warto's tactics, Jaxxon responded by kicking the Boltrunian with his powerful legs, propelling him down a flight of stairs. The confrontation happened to be witnessed by Solo, and, impressed by the Lepi's fighting skills, he offered him a place in the slowly growing mercenary band. Jaxxon accepted and agreed to meet with the rest of the group at dawn the next morning. Solo completed the group by hiring Jimm Doshun and FE-9Q after Jaxxon had left. The Star-Hoppers of Aduba-3 were complete."}, {"tag": "p", "text": "At dawn, the Star-Hoppers met and began to familiarize themselves with one another as Solo laid out the plan to defend Onacra from the Cloud-Riders. However, just as Solo had begun to explain, the Cloud-Riders appeared on their skyspeeders, having heard of the group that was set to oppose them. Solo and the Cloud-Riders' leader, Serji-X Arrogantus, began to negotiate over the upcoming battle, but neither would back down. As the Cloud-Riders prepared to leave, Jaxxon was surprised to see that Warto had actually joined the Cloud-Riders, intent on getting revenge against Jaxxon and Solo, who had brawled with the Boltrunian before he had tried to tangle with Jaxxon. With a feeling of foreboding in the air, the Star-Hoppers secured a group of banthas for riding and made their way towards Onacra."}, {"tag": "h3", "text": "Onward to Onacra"}, {"tag": "p", "text": "On the outskirts of the village, Solo spotted a large group of predators flying through the air. Doshun, the only native to Aduba-3 identified the birds as high-hounds, large beasts that were known to attack the people's crop of maze-stalks. Since the Star-Hoppers had been tasked with protecting the village, Solo rallied the group to action, and they began to fend off the high-hounds. With a blaster pistol in each hand, Jaxxon killed many of the beasts before they decided to scatter. During the fighting, Jaxxon began to fall into sync with Foxtrain, and together, the two blew apart many of the creatures. Although Jaxxon attempted to flirt with the woman, claiming that they could make \"beautiful blaster-music\" together, Foxtrain fended off his advances, adverse to working with someone who looked like a \"big green rabbit.\""}, {"tag": "p", "text": "As the high-hounds fled from their attackers, the Star-Hoppers made their way into the village. After tethering their banthas in a local stable, the group began to unload their munitions that they had brought with them. As the last of the weapons and power packs had been unloaded from their mounts, the Star-Hoppers were confronted by the Old One, who claimed that they were not needed, and that he would be able to summon a great monster to save the village. Solo shrugged off the old man's apparent delusions, and began to ready his force to combat the Cloud-Riders. As the Star-Hoppers prepared themselves, Jaxxon was the first to spot the Cloud-Riders advancing on the village, with Arrogantus in the lead, firing his blaster wildly."}, {"tag": "h3", "text": "Showdown"}, {"tag": "p", "text": "As the Cloud-Riders descended on the village, Jaxxon and the Star-Hoppers immediately began to open fire. Although drastically outnumbered, the group put up a strong fight, blasting the Cloud-Riders off their mounts. However, the intensity of the fighting eventually saw FE-9Q destroyed due to a sneak-attack from the ground. The same attack also saw Don-Wan Kihotay badly wounded, taking him out of the fight."}, {"tag": "p", "text": "The Star-Hoppers continued to fight on, eventually eliminating those that were attempting to attack from the rear. Although they had come fully stocked with additional weaponry, Solo began to worry about running out of ammunition, as a renewed attack by the Cloud-Riders came upon the village. However, before the attack could come, the Star-Hoppers were surprised by a new factor. The Old One, who had been busy performing a ritual, even as the battle raged around him, had actually summoned his monster. The Behemoth from the World Below, a centuries old beast originally created by the Sith Lord Seviss Vaa, had been awoken by the ancient Aduban elder."}, {"tag": "h3", "text": "Battle with a monster"}, {"tag": "p", "text": "As the Star-Hoppers stood in awe of the gigantic beast, the Behemoth began to attack the Cloud-Riders. Using a lightning attack from its forehead, the beast had soon nearly wiped out all of Arrogantus' forces. The Cloud-Riders began to charge the Behemoth, trying to destroy it, but they were unable to stop the monster's rampage. As the Behemoth destroyed their opponents, the Star-Hoppers decided to lay low, letting the monster defeat their adversaries for them. Consequently, the Behemoth seemed to ignore the Star-Hoppers completely, and it appeared that the Cloud-Riders would be wiped out without another shot being fired. However, Arrogantus was able to spot the Old One, gesturing towards the Behemoth as though he was controlling its actions. Believing that taking out the Old One would stop the beast's rampage, Arrogantus charged the ancient man. Just as he was about to crash into him, both Arrogantus and the Old One were crushed by the Behemoth with a large stamp of its foot. With their leader dead, the rest of the Cloud-Riders quickly succumbed to the Behemoth's assault."}, {"tag": "p", "text": "Since the Cloud-Riders had been destroyed, several of the Star-Hoppers proposed leaving the village. After all, they had only been hired to defend Onacra from the Cloud-Riders, not from a near-unbeatable beast. However, Solo claimed that there would be no reward if they didn't protect the village from being destroyed. With the Old One dead, the monster was likely to rampage through the village, and Solo demanded that the Star-Hoppers stay to defend the people. Jaxxon, who had tired of just sitting around, immediately jumped out from his hiding place and began to charge the monster, firing his blaster, though the Behemoth was too quick for the Lepi, nearly killing him with a deadly blast of lightning. Jaxxon avoided the deadly fire, but the aftershock of the blast caused a small landslide, knocking Jaxxon's weapon out of his hand. As the Lepi smuggler tried to retrieve his weapon, Foxtrain, who was concerned for his safety, yelled at him to get back to his hiding place. Jaxxon teased the woman about her sudden interest for his welfare, but decided to go for his blaster anyway. Jaxxon regained his weapon, but escaping was another matter. Foxtrain and Jaxxon returned to the other Star-Hoppers, but only after they had both sustained minor injuries from the rubble that the beast was creating with his laser blasts."}, {"tag": "p", "text": "Back with the group, Solo suggested that they just lay low, and hopefully the beast would believe that he had killed them. Unfortunately for the Star-Hoppers, the Behemoth continued to fire shots near their location, and Jaxxon and the rest of the group were forced to run, both from the monster and the landslides he was creating with his attacks. As Solo began to formulate another plan, the Star-Hoppers were surprised to see Don-Wan Kihotay out from their hiding place. Wielding his lightsaber, the man had decided to face the Behemoth in single combat. Although the majority of the Star-Hoppers were unsure of how to respond, Hedji charged out to rescue the old man, but he was quickly killed by the Behemoth. As the remaining Star-Hoppers watched Don-Wan Kihotay attempt to attack the beast, Solo noticed that the old man's lightsaber was repelling the Behemoth's attack. Surmising that the lightsaber was the key to defeating the monster, Solo took the man's lightsaber and plunged it into the Behemoth. The monster began to spasm from the attack, thrashing wildly and firing its laser. In a burst of light, the creature disintegrated, ending its threat to the village. Victorious, the Star-Hoppers claimed their reward and returned to the spaceport in Tun Aduban."}, {"tag": "h3", "text": "Further exploits"}, {"tag": "p", "text": "With the funds he had earned from the Onacra villagers, Jaxxon was able to repair his ship. Having formed a good friendship with Foxtrain over the course of the Onacra battle, he decided to ask her to join him in his smuggling career. She had come to Aduba-3 to find a job after her pirating career had abruptly ended, and so she accepted Jaxxon's offer. The duo set up shop at Jaxxon's old residence on Nar Shaddaa, where they began to build up the Rabbit's Foot to prime condition for smuggling operations. Due to her skill at gambling, the two were quickly able to increase their meager funds into enough to modify their ship. The Rabbit's Foot was soon equipped with augmented shielding, advanced weaponry, and its previous mechanical problems were excised. Now with a capable ship, the duo's smuggling operation was able to begin."}, {"tag": "p", "text": "During one of their nights on Nar Shaddaa, Jaxxon tried to convince Foxtrain to come with him for a night on the town. However, she refused the offer, claiming that high life on backwater worlds could quickly become lowlife. After promising to oversee the ship's refueling, she left Jaxxon to see the sights on his own. Immediately after Foxtrain had bid him farewell, Jaxxon began to stroll through the streets of the city, concentrating on how much he had grown to like the woman. However, as he walked under an overpass, he was suddenly draped in an electro-net. The shock of the device quickly knocked Jaxxon into unconsciousness, and he woke up to find himself hanging upside down amongst a group of bounty hunters led by Dafi and Remel Fud. The group was working for Beilert Valance, and had overheard Don-Wan Kihotay mention Han Solo, Jaxxon, and \"the kid\" during an attack on Anglebay Station, where Kihotay was receiving treatment. Believing \"the kid\" to be Luke Skywalker rather than Jimm Doshun, the hunters had tracked down Jaxxon in order to discover the world where the Star-Hoppers had fought together. The hunters were under the impression that they would be able to find Skywalker on that planet, and Jaxxon happened to be the easiest member of the Star-Hoppers to find."}, {"tag": "p", "text": "Attaching an agony inducer to his ear, Fud began to interrogate the Lepi, but Jaxxon refused to tell them anything. To force him to talk, Dafi activated the agony inducer, filling Jaxxon's body with pain. However, he still refused to tell them anything, merely cursing them for their lowlife tactics. The hunters decided to just continue the torture, until Jaxxon would give them the information; but before they could continue, they began to be cut down by blaster fire. Foxtrain had decided to come back to rejoin Jaxxon, and finding him at the mercy of the bounty hunters, she quickly dispatched the majority of them. As she approached her partner to untie him, she let slip that it was just like old times on Aduba-3. One of the hunters who had survived Foxtrain's assault overheard the information and fled back to Valance, telling him that \"the kid\" was on Aduba-3."}, {"tag": "h3", "text": "Back to Aduba-3"}, {"tag": "p", "text": "As a result of the interrogation, Jaxxon knew that Valance and his men would go to Aduba-3 to track down Doshun. Foxtrain and Jaxxon resolved to get there first and stop Valance from attacking their friends. Due to the superior speed of the Rabbit's Foot, the duo made their way to Aduba-3 well before their opponents, warning Doshun and his wife, Merri, that bounty hunters were coming to the world to capture him. Although Doshun was in disbelief over their story, he agreed to help them prepare for the hunters' attack, rallying the villagers in Onacra and preparing them for an outside assault. As the people of Onacra prepared themselves, Foxtrain and Jaxxon went back into space to prepare for Valance's arrival. When Valance's ship dropped out of hyperspace above the planet, Jaxxon opened fire, surprising the bounty hunters and damaging their vessel. Although Jaxxon was optimistic of their chances of defeating the crew in space, Foxtrain doubted that their much smaller craft would be able to destroy Valance's ship. True to her predictions, Valance and the hunters regained their composure and fired on the Rabbit's Foot with their blaster cannons. The metal plating on Jaxxon's ship was damaged, and he was forced to crash-land on the outskirts of the village."}, {"tag": "p", "text": "After crashing their ship, Jaxxon and Foxtrain immediately departed the Rabbit's Foot and hid in the tall grasses nearby. Once Valance's crew had landed, Valance sent out a first squad commanded by Slssk to search the crashed ship. When Slzzk's group was in range, Jaxxon and Foxtrain opened fire, pinning them between their attack and their downed ship. Although the group tried to mount a counter-attack, before they could advance on the duo, Doshun and the villagers incited a stampede of the local banthas. The large creatures trampled through the hunters' formations, killing nearly their entire force, save Slzzk and Valance. Foxtrain picked off Slzzk when he showed his head through the reeds, and Valance was quickly captured by the group when he tried to mount a similar attack. With the bounty hunter leader before them, Jaxxon quickly questioned the man as to what he wanted with Doshun. As Valance heard the name, he realized that he had come for the wrong boy. Laughing bitterly over the fruitless endeavor that had cost him his entire crew, Valance abruptly opened fire on the group with a blaster contained in his artificial left hand. However, quick reflexes saved Jaxxon and his comrades, and they were able to jump out of the way of the attack. Valance fled back to his ship, rocketing away from Aduba-3, intent on tracking down the real Skywalker this time. The group was quite confused as to the turn of events but were happy that the attack was over. Leaving Doshun with his people, Jaxxon and Foxtrain returned to their smuggling business."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jaxxon was a quick-witted individual with a street smart personality and a quick temper. Tall and lanky, with a large pair of buck teeth and short green fur, he easily stood out in a crowd and was often the victim of stabbing insults for his peculiar appearance. However, Jaxxon always responded in kind to these rude responses, giving his attackers a strong kick in the chest or a blaster shot to the face. Jaxxon was not hesitant to speak his mind, constantly voicing his complaints during the operation on Aduba-3, much to Han Solo's irritation. Additionally, when he found himself attracted to Amaiza Foxtrain, he made no secret of his admiration for her, complimenting her even during the heat of battle with the Cloud-Riders. However, for all his bravado, Jaxxon was a calculating Lepi, and during the attack of Beilert Valance's hunters on Aduba-3, he was able to help Foxtrain carefully craft a plan of attack, defeating the soldiers despite being heavily outnumbered."}, {"tag": "p", "text": "In regards to fighting technique, Jaxxon was known to fire two blasters simultaneously in each hand, although he was fully capable of using only one. When fighting on Aduba-3, Jaxxon was seen fighting with his fists and feet, as well as his weapons, showing his skill in hand-to-hand combat. Jaxxon also proved incredibly quick on the battlefield. He was the quickest of the Star-Hoppers, and during their battle with the Behemoth from the World Below, he was able to avoid being killed by the monster's laser attack several times, despite being in point blank range of its attack. Although his species was omnivorous, Jaxxon was inclined towards eating meat. He disliked space carrots and enjoyed a good steak over other foods. Although not overtly religious, Jaxxon was known to exclaim to the Holy Hutch several times over his career."}, {"tag": "h2", "text": "Relationships"}, {"tag": "h3", "text": "Amaiza Foxtrain"}, {"tag": "p", "text": "During his exploits with Amaiza Foxtrain, Jaxxon came to admire the woman, finding her very attractive for a being with no fur. Although she was initially hostile to Jaxxon's advances, during the attack of the Behemoth, she showed some concern for his well-being, causing the Lepi to remark that perhaps she did have some feelings for him after all. While not necessarily romantically linked, the two did strike up a partnership following the Aduba-3 affair, working together out of Jaxxon's residence on Nar Shaddaa. Although Foxtrain declined to go with Jaxxon for a night on the town, she eventually decided to meet up with him, saving him from several of Beilert Valance's men who were torturing him. The rescue was marked with Foxtrain's relief that Jaxxon had not been badly hurt, showing that she had some affection for her business partner."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jaxxon was created by Roy Thomas and Howard Chaykin for use in Marvel Star Wars' Star Wars 8. A large anthropomorphic bunny, he was created in homage to Warner Brothers cartoon star Bugs Bunny who often addressed strangers with the generic nickname \"Jackson\" in his 1940s cartoons. As a member of a band of mercenaries brought together by Han Solo, Jaxxon joined the group on a quest to free the local Adubans from the tyrannical Serji-X Arrogantus. This story, inspired by the film The Seven Samurai, was one of the earliest stories to appear in the Expanded Universe, making Jaxxon one of the first characters to be created outside the films. After Archie Goodwin took control of the storyline in Star Wars 11, Jaxxon played a much smaller role in the comic. He was seen in a flashback in issue 11, and played a small role in Star Wars 16, before departing fully from the storyline. Jaxxon's abrupt departure caused some fans to surmise that George Lucas himself had asked that Jaxxon make no more appearances. However, this rumor is unsubstantiated."}, {"tag": "p", "text": "After his appearance in the Marvel story arc, Jaxxon went unreferenced for over twenty years. He was brought out of obscurity in the 2001 Star Wars Gamer 4  article The Starhoppers of Aduba-3, by Pablo Hidalgo, Cory J. Herndon, and Michael Mikaelian. This article gave background information on Jaxxon and his species, as well as summarizing his actions in the Marvel run. Akin to the creators of Jaxxon, Hidalgo drew inspiration from Bugs Bunny in his choice of Coachelle as Jaxxon's homeworld. In the 1953 short \"Bully for Bugs,\" Bugs asks, \"Excuse me, can you direct me to the Coachella Valley and the Giant Carrot Festival…therein?\" Hidalgo carefully mirrored this sentence during the article, also ending his in \"therein.\" Additionally, Hidalgo drew references to another Looney Tunes short, \"What's Up Doc?,\" when mentioning Jaxxon's former mercenary group, the Boys of Corus. These references to Bugs Bunny were not without precedent, as Goodwin also played up this relationship in Star Wars 16: The Hunter, naming two bounty hunters that were trying to capture Jaxxon as Dafi and Fud. These names were references to the Looney Tunes characters Daffy Duck and Elmer Fudd, who were constantly trying to capture Bugs."}, {"tag": "p", "text": "Although popular with several Star Wars authors, such as Jeff Grubb, Joseph Bongiorno, Abel G. Peña, and most notably, Pablo Hidalgo, Jaxxon is usually cited as a character that represented the silliness of Marvel Star Wars, and so has been dismissed by some fans. This feeling of animosity was reflected in the Star Wars Insider 83 article 20 Most Memorable Moments of the Expanded Universe, which placed the introduction of Jaxxon as one of the five goofiest moments in Expanded Universe history. He was also claimed to be \"Marvel's most-infamous addition to the Expanded Universe\" in Comic Marvels, an article in Star Wars Insider 91. This factor has led to Jaxxon being equated with the prequel trilogy character Jar Jar Binks on several occasions. In addition, Jaxxon's lack of popularity has been shown in polls on StarWars.com. In the first from December 2000, asking, \"Which Expanded Universe character would you next like to see depicted by an actor or model?,\" he received only 3% of the vote. He fared even worse in a later poll in January 2002, which asked, \"Which Expanded Universe character would you most like to see as a cameo in Episode II or III?\" He was left with only 2% of the vote, with Thrawn the winner at 54%. However, in a 2012 poll conducted by Star Wars Insider asking fans which Star Wars character they wanted made into an action figure, Jaxxon placed third."}, {"tag": "p", "text": "Jaxxon, and the Lepi species bear a remarkable similarity to the Larry Hama character of Bucky O'Hare who was also a large green rabbit. Another character, Jazz Jackrabbit, also shares a striking similarity."}, {"tag": "p", "text": "A Lepi can be seen in the background of strip 36 of Rookies: Rendezvous. Since Pablo Hidalgo, writer and illustrator of Rookies: Rendezvous, is a known fan of Jaxxon, it has led some fans to believe the Lepi is in fact Jaxxon. This speculation is based on Hidalgo's mention of \"a big green bunny\" appearing in this strip on his blog, a term that he has used several times on message boards and blogs when referring to Jaxxon."}, {"tag": "p", "text": "Jaxxon's most recent \"appearance\" was in the The Clone Wars: Invitation Only web comic by Pablo Hidalgo and Tom Hodges, where he can be seen on a \"Wanted\" poster. His name is written in the Aurebesh below the picture. In the original webcomic, the name is partially obscured by a big, red stain; in the Star Wars: Tales from the Clone Wars reprint, the stain is missing and the poster definitely says \"Jaxxon\"."}, {"tag": "p", "text": "In The Clone Wars episode A Sunny Day in the Void, the skeleton found in a crashed shuttle wears a suit similar to Jaxxon. The skull even has long incisors. This is acknowledged in Star Wars: The Clone Wars: Episode Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}