{"url": "Jay_Igno/Legends", "categories": ["Category:Legends articles", "Category:Coruscanti", "Category:Males", "Category:Nimbanels", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Jay Igno"}, {"tag": "p", "text": "Jay Igno was a male Nimbanel who worked as a air taxi driver on the planet Coruscant during the Clone Wars. At one stage during the war he gave a ride to CT-5555, an Advanced Recon Commando known as Fives on the run from the Galactic Republic. The clone asked to be taken to 79's, a clone bar which the driver knew. En route to the bar the commando told Igno there was a conspiracy against the Republic and the Jedi Order; although the driver was used to such tales from his passengers. Upon reaching 79's, Fives left the taxi and didn't pay, much to Igno's annoyance."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Nimbanel Jay Igno live on the planet Coruscant during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. On Coruscant, which was the capital of the Republic, Igno worked as a air taxi driver, transporting beings around the ecumenopolis that covered the entire planet. During the war he transported two Twi'lek women to their desired destination in his air taxi, and after they paid him accepted a new passenger. When the passenger, an Advanced Recon Commando designated CT-5555 and known by the nickname Fives, asked to be taken to the bar known as 79's, Igno recognized the bar as one frequented by clone troopers serving in the Grand Army of the Republic. Realizing his passenger was a clone, Igno tried to make conversation with Fives and the clone ended up telling him about a conspiracy involving organic inhibitor chips implanted in the brain of clone troopers. Upon reaching 79's, Igno parked outside and let Fives out of the taxi. When the clone began to walk away, the driver asked for payment, but Fives told him charge the trip to the Republic. A group of inebriated clones approached and laughed at Fives comment, arguing with Igno and then throwing bottles at his craft as he flew away."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Igno had purple eyes and brown hair, with tan skin mottled with brown. He flirted with a pair of female Twi'leks he gave passage to and tried to make small talk with Fives when he took the clone to 79's. Igno dismissed Fives's claims of conspiracy as he heard such crazy stories often from his passengers. After the clone didn't pay Igno insulted him and his fellows. While driving his taxi, the Nimbanel wore a jacket and a green cap and listened to music."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jay Igno first appeared in \"Orders,\" the fourth episode in The Clone Wars: The Lost Missions, which first aired in 2014. He was not named in the episode, but was identified in the episode guide posted on StarWars.com, which also revealed the name was a reference to Reverend Jim Ignatowski, a character in the sitcom Taxi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}