{"url": "Jaybo_Hood/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Humans", "Category:Males", "Category:Mechanics"], "nodes": [{"tag": "h1", "text": "Jaybo Hood"}, {"tag": "p", "text": "Jaybo Hood was a young Human male who lived on Iego during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "After the Separatists abandoned Iego in 22 BBY, Jaybo reprogrammed the battle droids left behind, and used them as servants to suit his own needs. He used a macro protocol to wipe all of their programming simultaneously. When General Obi-Wan Kenobi and General Anakin Skywalker arrived on the planet looking for an ingredient in the antidote to the Blue Shadow Virus, the latter brashly destroyed eighteen of the defenseless droids."}, {"tag": "p", "text": "Hood served as their guide around the planet and its creatures, and grew fond of the two Jedi during their stay. Jaybo told the two Jedi of \"Drol,\" the \"god\" of Iego, even mentioning Taquito, a friend of his who was killed upon attempting to leave the planet. Skywalker and Kenobi attempted to leave the planet themselves, but were stopped by a laser field installed by the Separatists to prevent its inhabitants from leaving. Jaybo lent them several of his commandeered Vulture droids to help them get off-planet and destroy the field. In doing so, Hood indirectly helped free all the marooned inhabitants of Iego, allowing them to leave whenever they wished."}, {"tag": "h3", "text": "The return of Drol"}, {"tag": "p", "text": "Not long after, Anakin Skywalker and Obi-Wan Kenobi returned to Iego and Jaybo told them about a mysterious situation taking place in the planet's orbit. After they checked it out, they discovered it was assassin droid HELIOS-3D who was running out after successfully executing the Senate hostage crisis."}, {"tag": "p", "text": "When he was discovered, 3D escaped and fled away from the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jaybo Hood was voiced by David Kaufman in the The Clone Wars television series Season One episode \"Mystery of a Thousand Moons\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}