{"url": "Je%27daii_Order", "categories": ["Category:Legends articles", "Category:Je'daii", "Category:Pre-Republic"], "nodes": [{"tag": "h1", "text": "Je'daii Order"}, {"tag": "p", "text": "The Je'daii Order was an ancient organization unified by its belief and observance of the Force on the planet Tython, in the galaxy's Deep Core. Focusing on maintaining a balance in the Force, a state at which Tython was itself hospitable, the Je'daii saw the Force as three aspects of a whole; the Ashla (Light), the Bogan (Dark), and the Bendu (balance). They saw this duality in the Force represented in the night sky of Tython in the form of two natural satellites; one bathed in light, the Ashla, another shrouded in darkness, the Bogan. In keeping with their view of balance, Je'daii who fell too far to either the light or dark were exiled to the respective moon to meditate until they returned to balance."}, {"tag": "p", "text": "The Order's presence on Tython was distributed between nine Temples, each of which was presided over by a Je'daii Temple Master. In order to gain mastery in the Order, all Je'daii were expected to travel to each of the Temples to hone different skills. The Order was led by a Council of Masters, consisting of the nine Temple Masters, which decided important matters and directed the Order. Surviving on Tython for millennia in isolation from the rest of the galaxy, the Order was deeply shaken by the arrival of a Force Hound from the Infinite Empire."}, {"tag": "p", "text": "In the years following the Hound's initial crash landing on Tython, a schism shook the Order to its foundation. After a bloody civil war, known to history as the first conflict between light and dark side philosophies, the dark side adherents were routed while the Jedi Order thrived. A large group of Jedi departed Tython, eventually finding a new home on Ossus, where they would eventually join the Galactic Republic as defenders of the peace."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "In the year 36,453 BBY, the Tho Yor—eight great pyramid ships that were scattered across the galaxy—called out to the inhabitants of the planets they were located on, including Ando Prime, Kashyyyk, Manaan, Ryloth, and Dathomir. Through the Force, the Tho Yor convinced the Force-sensitive sentients around them to board the starships, and the pyramid ships then departed the planets upon which they had sat for so long and set out into the galaxy. The Tho Yor then traveled the galaxy, gathering Force-sensitives of many other species, so that by the time the eight ships journeyed into the Deep Core together, they carried members of the Wookiee, Selkath, Twi'lek, Miraluka, Iktotchi, Cathar, Devaronian, Noghri, Sith, Talid, Zabrak, Mirialan, Human, Sullustan, and Krevaaki species, as well as the species later known as the Koorivar. The eight Tho Yor traveled into the Deep Core to the planet Tython, where a ninth and far larger Tho Yor awaited them as it floated above a pinnacle of stone. The arrival of the Tho Yor was heralded by an immense Force Storm that swept over the entire planet, and the eight Tho Yor first gathered around the ninth Tho Yor before scattering themselves across the planet."}, {"tag": "p", "text": "The Tho Yor Arrival, as the event came to be known, saw each Tho Yor deposit their passengers at their final destination and remain there, with some of the ships burying themselves in the landscape while others remained floating in the sky. The Force-sensitive pilgrims immediately realized that Tython was uniquely strong in the Force, and the pilgrims—known collectively as the Tythans—soon realized that they had been brought to Tython in order to study the Force and to learn to control and master the abilities it granted them. However, Tython's beauty came with dangers, and the pilgrims' lives became a constant form of moving meditation on the Force, rather than sitting in silent meditation. The pilgrims also realized that Tython itself reacted violently with Force Storms and quakes to imbalance between the light and dark sides of the Force, which they named Ashla and Bogan after Tython's two moons: the bright satellite Ashla, and the dark moon of Bogan. The pilgrims therefore formed the Je'daii Order, taking their name from the language of the Dai Bendu monks of the Talid species: combining the words je, meaning mystic, and dai, meaning center."}, {"tag": "p", "text": "The philosophy of the Balance became essential to survival on Tython, as harmony and balance between Ashla and Bogan maintained the peaceful beauty of Tython and prevented the chaos and destruction that came with imbalance. Over the next thousand years, the Je'daii built the Je'daii Temples, cities and centers of learning and healing that each centered around one of the Tho Yor. Padawan Kesh, the Je'daii academy, was established by the year 36,019 BBY, when Nordia Gral was serving as Padawan Kesh's first Temple Master. Around that time, Master Gral helped develop the tradition of the Great Journey, a pilgrimage across Tython to each of the Temples that all Je'daii would take upon graduating from the rank of Padawan to Journeyer. However, as the years passed, the Je'daii began to have children who were not Force-sensitive, and it eventually became clear to the Tythans that the planet was not safe for those who could not touch the Force after the city of Aurum was destroyed. Therefore, during the second millennium after the Tho Yor Arrival, a second migration occurred: all Tythans who were not Force-sensitive were made to leave the planet, even if it broke up families, and the non-Force-sensitives settled first on Ashla and Bogan before spreading out to the other worlds of the Tython system."}, {"tag": "h3", "text": "Era of peace"}, {"tag": "p", "text": "Despite the services the Order provided to the other Settled Worlds, the existence of the Je'daii on their isolated world of Tython became a thing of legend. It wasn't until the reign of Queen Hadiya of Shikaakwa that a full-blown conflict erupted between the Order and the non-Force-sensitives that shared the star system. In a system-wide conflict known as the Despot War, Queen Hadiya led her army against Tython in a series of campaigns in 25,805 BBY. Despite massive casualties on both sides, the Je'daii Order was able to vanquish Hadiya and her forces and return the balance to Tython. While balance was indeed restored, turmoil festered on Tython just twelve years later when the Je'daii Order found the wreckage of the first ship to enter the system since the Tho Yor brought their ancestors to the world. The ship, of unknown origin, crashed on Tython in area known as the Rift, close to the Temple of Anil Kesh, and the mass deaths sparked a Force storm of proportions not seen since the arrival of the Tho Yor. Representatives of the Order investigated the crash site and encountered a sole survivor: a mysterious man named Xesh who carried a bizarre weapon known as a Forcesaber."}, {"tag": "p", "text": "In 25,793 BBY, the forces of the Rakatan Infinite Empire invaded the Tython system. Skal'nas sought to reverse his species's gradual loss of control over the Force by acquiring the Infinity Gate said to exist on the planet Tython, and his forces attacked the space station Fury Station on the edges of the system before capturing both of the gas giants Obri and Mawr. The Rakata and their Flesh Raider soldiers attacked Tython, but were repelled by the Je'daii Order; the Infinite Empire fell back to the forest world of Ska Gora and conquered it before establishing their main command post there. By the end of the first year, the Je'daii had allied themselves with the forces of the Settled Worlds, placing Je'daii Master Rajivari in command of the joint forces. The Order also constructed Forcesabers, the Dark side weapons of the Rakata, and armed themselves with the weapons as they recalled the insane Daegen Lok to lead them in battle as Lok had foreseen."}, {"tag": "h3", "text": "The Force Wars"}, {"tag": "p", "text": "In the ensuing decade, the balance of the Je'daii Order was shattered. Two splinter groups emerged, one which held the Ashla as the main power of good in the universe, and another whose members found power only in the Bogan. In a tumultuous conflict known as the Force Wars, former allies were pitted against each other and all that the Je'daii Order had become was torn asunder."}, {"tag": "p", "text": "In 25,783 BBY the war had raged for nearly a decade, leaving the planet a ruined waste. The light-siders, led by Je'daii Masters Rajivari, Garon Jard, Cala Brin and Ters Sendon, founded a new group known as the Jedi Order and deemed that they would only use their powers for the protection of the weak and disenfranchised. From this group, Master Rajivari broke away and formed a dissident group of dark siders. Building an army of dark side monstrosities, Rajivari and his followers seized the Temple of Kaleth and attempted to defeat the Jedi Order. Following the defeat of Rajivari's forces and other dissidents like him, the Je'daii Order was finished, the Jedi Order standing in its place. Having witnessed the destructive power of the dark side first hand with the ruination of their homeworld, a large group of Jedi set out from Tython to settle other worlds far from the Deep Core, eventually establishing a headquarters on the far-flung world Ossus."}, {"tag": "p", "text": "The Je'daii's successor group, the Jedi would ultimately go on to defend the galaxy for millennia to come. The Galactic Republic made use of the Je'daii Order's Bendu symbol, particularly during the Clone Wars, and Emperor Palpatine of the Galactic Empire—the Republic's successor state—instituted a six-spoked Imperial crest reminiscent of the Bendu symbol."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "Structure"}, {"tag": "p", "text": "A monastic order of scientists, scholars, warriors, philosophers, and artisans that were the sole inhabitants of the planet Tython, the Je'daii Order was governed by the Je'daii Council, also known as the Masters' Council or the Council of Masters. The Council was composed of the nine Je'daii Temple Masters, the highest rank a Je'daii could achieve in the Order, who each oversaw one of the nine Temples that were scattered across Tython. Though there were nine Je'daii Temples, the actual number of Temple Masters occasionally varied from nine; a mated Selkath couple named Calleh and Naro jointly held the position of Temple Master at Mahara Kesh, the Temple of Healing. The Je'daii Council met in holoconference or in person at Kaleth, and the Council had the authority to exile Je'daii to the moons of Ashla or Bogan if they strayed too close to one side of the Force."}, {"tag": "p", "text": "After the departure of all non-Force-sensitives from Tython, it became customary for any Force-sensitives who were born on the other worlds to be sent to Tython, where they were trained as Je'daii. Any non-Force-sensitives who were born on Tython were tested to see if they possessed any aptitude for the Force, but if not, they were asked to leave the world, as it was unsafe for those who could not touch the Force. Young Force-sensitive initiates were trained and housed at Padawan Kesh until they were taken on as a Padawan by a Je'daii Master. Once a Padawan's training was complete, normally when the Padawan was in their teens, they were made Je'daii Journeyers and sent on their Great Journey: an odyssey across the surface of Tython to visit each of the Temples. Great Journeys typically lasted two years, and Journeyers would trek unaccompanied and largely by foot across Tython to reach each of the Temples, where they would spend several weeks learnings the skills taught at each Temple. Most Journeyers chose a discipline to specialize in during their Great Journey, and many returned to the Temple that taught that discipline later in life as Rangers or Masters."}, {"tag": "p", "text": "If the Journeyer survived, upon the successful completion of their Great Journey they were elevated to the rank of Je'daii Ranger. Rangers were deployed by the Je'daii Council all across the Tython system, fulfilling assignments and missions requested by the Council or the other Settled Worlds. Rangers wore a badge known as a Ranger star to signify their rank, and they were given their choice of a starship: either a Hunter-class starfighter, or the larger Peacemaker-class cruiser. Rangers were tasked with missions of diplomacy, tracking fugitives, ending conflicts, and a wide variety of other missions, and some Rangers rarely returned to Tython. If a Je'daii Ranger had shown sufficient experience, wisdom, and understanding of the Force, they might be promoted to the rank of Je'daii Master, which was the highest rank a Je'daii could achieve other than a Temple Master. Numerous Masters made their home at each Temple, providing their knowledge to younger Je'daii and studying the Force and other pursuits."}, {"tag": "h3", "text": "The Temples"}, {"tag": "p", "text": "Early in the Je'daii Order's history, the Order established their nine Je'daii Temples around the nine Tho Yor across Tython. While other cities and settlements were later built, the nine Temples were home to most of the planet's inhabitants and were the seats of the Order's presence upon Tython. Akar Kesh, the Temple of Balance, was considered to be one of the most sacred Temples, and it was built within the great pinnacle of stone above which the largest Tho Yor hovered. The Temple of Science, Anil Kesh, straddled the planetary rift known as the Chasm near its floating Tho Yor, and its inhabitants meddled in science and alchemy. The Temple of Healing, Mahara Kesh, was located in the Deep Ocean, and the Temple of the Arts, Bodhi, was located on the plains of the continent Masara."}, {"tag": "p", "text": "Padawan Kesh housed and trained young Je'daii before they became Padawans, while the Temple of Martial Arts, Stav Kesh, was located high in the Ice Giant Range next to the Tho Yor that had buried itself in the mountains. Vur Tepe—the Forge—was located directly over an active volcano near its floating Tho Yor, and its inhabitants focused themselves on the creation of weapons and anything else that Anil Kesh's scientists could think of. The Temple of Force Skills, Qigong Kesh, was located in an enormous cavern beneath its floating Tho Yor in Tython's Silent Desert, and the last Temple—Kaleth, the Temple of Knowledge—was home to the Je'daii Library and the meeting place for the entire Order."}, {"tag": "h2", "text": "Philosophy"}, {"tag": "p", "text": "The Je'daii Order's primarily philosophy was that of the Balance—because of Tython's intense reactions to imbalance in the Force, the Je'daii strived to maintain personal balance between the light and dark sides of the Force. This philosophy was also inspired by Tython's moons: bright Ashla represented the light side of the Force, and the dark moon Bogan represented the dark side. In Je'daii philosophy, they acknowledged the fact that there was always a light within darkness, and darkness within light, so that it was impossible for one to ever be truly free of either. Unlike the later Jedi Order, Je'daii were encouraged to give into the temptations of both the light and the dark, as they believed it was necessary to embrace both in order to learn more about the Force. The Je'daii viewed living on Tython as a near-constant meditation and study of the Force, and the Great Journey was intended to expose young Journeyers to the various disciplines and arts that were studied at each temple."}, {"tag": "h3", "text": "Code"}, {"tag": "p", "text": "The Je'daii Order developed their own code, which illustrated the primary tenets of the Order's philosophy, and was taught at all of the Temples across Tython. Because of Tython's proclivity for Force Storms, the Je'daii took it upon themselves to police their ranks for those who fell out of balance, and they exiled those who were out of balance to Tython's moons. Those who delved too deep into the dark side were exiled to Ashla, where they were instructed to meditate on the light side and the bright moon of Ashla. On the other hand, those Je'daii who clung to the light side over the Balance were sent to Bogan, where they meditated on the darkness of the moon to bring themselves back into balance. Exiles on Tython's moons received regular deliveries of foodstuffs, and they were kept separate from other exiles by their cuffs and the sentry droids that patrolled the moons."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}