{"url": "Jedha", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Desert moons", "Category:Freestanding subsectors moons", "Category:Galactic Empire moons", "Category:Jedha locations", "Category:Jedi moons", "Category:Locations of Force-based groups", "Category:Mid Rim moons", "Category:Terrabe sector"], "nodes": [{"tag": "h1", "text": "Jedha"}, {"tag": "p", "text": "Jedha, also known as the Pilgrim Moon, or as the Cold Moon, was a small desert moon which orbited the planet NaJedha. Located in the Jedha system of the galaxy's Mid Rim, the moon had a cold climate due to its lasting winter. The historical and spiritual significance of Jedha led the moon to become a world of worship for those who believed in the Force, and a holy site for pilgrims who sought spiritual guidance."}, {"tag": "p", "text": "Sometime before the Battle of Yavin, the Galactic Empire occupied the moon to control its kyber crystal resources that were once used by the Jedi Order as components for their lightsabers. The occupation later provoked an insurgency to oppose the Imperial tyranny, coordinated by the rebel extremist Saw Gerrera. Jedha's heritage and Gerrera's resistance—the aptly named Partisans—led to it being chosen in 0 BBY for a test of the Death Star's superlaser, a superweapon capable of destroying entire planets. Though Director Orson Krennic had planned to destroy the moon, Grand Moff Wilhuff Tarkin overrode him, stating that the destruction of the Holy City would serve as a sufficient test."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Jedha was a moon located in orbit around the planet NaJedha, situated in the Jedha system of the galaxy's Mid Rim, due galactic west of the Deep Core. 11,263 kilometers in diameter, Jedha was a small desert moon defined by its jagged rock formations, broad mesas, narrow spires, and rocky dustbowls. Frosted by a permanent winter, Jedha had a cold climate and an atmosphere breathable to oxygen-breathers, such as humans. Within the moon's sandstone crust were rich deposits of kyber crystals—Force-attuned crystals that were fundamental in lightsaber construction. Many settlements on the moon, such as the ancient Holy City, sat atop the world's natural mesas. Though Jedha's sands remained parched for much of its year, there were instances of powerful torrents of rainfall, a cause for celebration among the people of Jedha."}, {"tag": "p", "text": "Jedha's ancient structures were some of the earliest examples of architecture known to exist in the galaxy. The weathered sandstone structures and statues dotted Jedha's landscape, a testament to its ancient past."}, {"tag": "p", "text": "Being an antiquated destination, Jedha was surrounded by uncharted systems, making it a reliable replenishment port for travelers. Jedha was connected to Adrathorpe and the planet Ord Mantell via the Burke's Trailing hyperspace route."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "The ancient world of Jedha was home to one of the first civilizations to explore the nature of the Force and was considered a spiritual home of the Jedi Order, with many scholars believing the moon owes its name to the ancient religion. Some scholars made a case for Jedha as the location of the Jedi Order's first Temple, alongside other candidate worlds, such as Ahch-To, Coruscant, Ossus, and Tython. As well as the Jedi, the Disciples and Guardians of the Whills represented a dominant faith on Jedha. They, along with the Church of the Force, were centered at the Temple of the Kyber, a great temple located in the city of NiJedha. This spiritual history led to Jedha becoming an important location for pilgrims of various faiths, including those of the Brotherhood of the Beatific Countenance, the Clan of the Toribota, and the Central Isopter."}, {"tag": "p", "text": "As more of the galaxy was mapped, more direct hyperspace routes were discovered. These new passages made the old, winding routes, such as those connecting with Jedha, obsolete. The once-popular Jedha became an antiquated curiosity rather than a relevant destination, a location for those who desired spiritual guidance, a deeper purpose, or to simply exile themselves from the larger galaxy."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Sometime after the fall of the Jedi Order and the Galactic Republic, its successor state—the Galactic Empire—occupied Jedha in order to mine its kyber crystal deposits. Unknown to all but the most high-ranking officials in the Empire, the crystals were being used as components in the construction of an Imperial superlaser capable of destroying entire planets. The Imperial occupation included specialized units, due to its urban landscape and importance to the Death Star project. These units were charged with restricting access to the Temple of the Kyber and protecting kyber crystal mining operations. The streets of Jedha were patrolled by stormtroopers, scout troopers with speeder bikes, combat assault tanks, and AT-STs. The scout and tank troopers wore lighter armor for better mobility in the urban environment and were specially trained for reconnaissance and urban warfare. However, the occupation did not go unopposed. Under the coordination of Onderonian rebel extremist Saw Gerrera and his Partisans, an insurgency was formed, targeting the Empire's kyber shipments. The increasing violence prompted the Empire to place the Dauntless, an Imperial I-class Star Destroyer, directly over the Holy City."}, {"tag": "p", "text": "In 0 BBY, an Imperial defector by the name of Bodhi Rook was captured by Gerrera's rebels, claiming he had a message from Galen Erso, an Imperial scientist whose research helped create the Empire's superweapon. Tasked with retrieving this message, Rebel Alliance soldiers Cassian Andor and Jyn Erso, the daughter of Galen, undertook a mission to Jedha to meet with Gerrera and retrieve the former Imperial pilot's message."}, {"tag": "p", "text": "Making their way through Jedha City, the pair became involved in a firefight between Imperial and insurrectionist forces but managed to escape. Minutes later, they were captured by Gerrera's insurgents and spent the night trekking through the desert outside the city before reaching a weathered monastery known as the Catacombs of Cadera. At the same time, all Imperial forces on Jedha were ordered to evacuate immediately. Unknown to them, the Empire's colossal, superlaser-equipped battle station, the Death Star, was moving into position above the moon. Though the Death Star project's director, Orson Krennic, intended to destroy the entire moon, Grand Moff Wilhuff Tarkin ordered only the Holy City be destroyed using a single-reactor ignition blast from the station's superlaser. After a short exchange, Gerrera revealed to Jyn the holographic message of her father. As she watched, the Death Star moved into position over NiJedha, eclipsing the sun before firing its emerald beam and completely obliterating the city. The immense explosion caused the surrounding land to crumble, sending swaths of rubble into the air and allowing some to reach escape velocity. Before the blast could reach the Catacombs of Cadera, however, Andor, Jyn and Rook, along with two Guardians of the Whills named Chirrut Îmwe and Baze Malbus, managed to escape into hyperspace aboard a U-wing starfighter and relay the event to Alliance High Command."}, {"tag": "h3", "text": "Destruction of Jedha City"}, {"tag": "p", "text": "To prevent word getting out about the nature of the Holy City's destruction, the Imperial Senate on Coruscant was informed that the explosion was due to a mining disaster. During the Battle of Scarif, Jedha was used as a battle cry by several Rebel soldiers."}, {"tag": "p", "text": "Following the Battle of Yavin, several of the partisans under Benthic continued to fight the Empire on Jedha. The Empire under Commander Befa continued to harvest the remaining kyber crystals from the surface. Befa, however, was unable to deliver a single shipment of kyber crystals and the Empire sent Queen Trios of Shu-Torun and Commander Kanchar to retrieve the remaining kyber crystals. Princess Leia Organa, Luke Skywalker, Han Solo, R2-D2 and C-3PO traveled to Jedha to make contact with the surviving partisans and to convince them to rejoin the Alliance."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The moon of Jedha had a human-dominant population, with many other species being pilgrims from other worlds passing through to bask in Jedha's spiritual heritage. Most of Jedha's 11.3 million inhabitants were centered around elevated settlements on rocky mesas, whose streets were filled with priests, scholars and holy men and women. The natives of Jedha were as a whole a spiritual people and were gracious and tolerant of outsiders who practice peace and respect. After Imperial occupation, prohibitions on trade and commerce lead to the cultivation of a black market, with some cynical entrepreneurs making a profit off the disadvantaged populace. Local merchants would offer Imperial officers goods—both legal and illicit—to ensure they were happy and that their attention was diverted from possible infractions. Transportation of goods to and from Jedha became a lucrative business, with only specially licensed spacers allowed access to the moon's spaceports. The subsequent insurgency made life dangerous for the civilians of Jedha, especially with the rebels preferring guerrilla tactics, meaning anywhere could become a warzone instantly."}, {"tag": "p", "text": "Jedha was the homeworld of the Imperial-turned-Rebel pilot Bodhi Rook, the warrior monk Chirrut Îmwe and his freelance assassin friend Baze Malbus. Shortly after the destruction of NiJedha, the trio took part in the Battle of Scarif as part of the Rebel squad \"Rogue One\" and were instrumental in stealing the plans to the Death Star."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Jedha had several settlements across its surface, the most prominent being the ancient Holy City of NiJedha. This large walled city stood atop a large mesa and was a spiritual hub for many faiths. At its edge was the Temple of the Kyber, a towering triangular structure that rose high above the city walls and was held sacred by followers of the Whills and the Church of the Force. Other significant locations in the city included the Holy Quarter, the Path of Judgments, and the Dome of Deliverance."}, {"tag": "p", "text": "Located half a day's walk from the city were the Catacombs of Cadera, an ancient monastery that was used to hold the skeletal remains of the dead. At some point, the monastery was occupied by the religious group known as the Church of the Contained Crescent. During the Imperial occupation of Jedha, Saw Gerrera made the Catacombs the base of operations for his Partisans, naming it the Gut."}, {"tag": "p", "text": "Located thousands of kilometers away from NiJedha were the desiccated tablelands, an area consisting of massive, barren mesas."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jedha is a moon that was created and developed for the 2016 film Rogue One: A Star Wars Story. The moon was named after the real world city of Jeddah in Saudi Arabia.[source?] The moon's holy city was inspired by real life holy cities such as Mecca and Jerusalem. The city also has Middle  Eastern influences with its narrow market alleyways, desert sands, and Ottoman-inspired architecture. The moon was also filmed in the Middle East, specifically Jordan's Wadi Rum desert. First footage of Jedha was released with the teaser trailer for Rogue One: A Star Wars Story, on April 7, 2016. The moon was fully revealed during the Rogue One panel at Star Wars Celebration Europe 2016, on July 15, 2016. In various sources, Jedha was mistaken for a planet, but it was later clarified and Jedha was identified as a moon with the addition of Jedha's Databank entry on the official Star Wars website, on August 10, 2016."}, {"tag": "p", "text": "Early concept art for Rogue One used the planet Mimban, before Jedha was settled on. Mimban would, however, make an appearance in Solo: A Star Wars Story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}