{"url": "Jedi%27s_Honor", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:West End Games adventure supplements"], "nodes": [{"tag": "h1", "text": "Jedi's Honor"}, {"tag": "p", "text": "Jedi's Honor was a solitaire adventure written by Troy Denning and published on June 1, 1990 by West End Games."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "After the Battle of Yavin, the Alliance needed a secure site to base their operations. Luke's dual mission: to search for a world the Empire has overlooked, and to observe local systems along the way. But in the Sil'Lume Asteroid Belt, the search takes on a personal twist- a local agitator taken prisoner by the Empire is reputed to be the son of a Jedi Knight! Should Luke pursue the rumor, or is his mission for the Alliance paramount?"}, {"tag": "p", "text": "Luke Skywalker—Jedi-in-training, Hero of Yavin—stars in this fast-paced tale of quick wits and tough decisions. You'll choose his best options and fight his opponents. Sometimes logic is your best tool as you analyze the situation as Luke sees it. Sometimes you have to trust in Luke's piloting prowess. And sometimes the young Rebel's untrained ability with the Force is all that stands between him and destruction!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "As a choose-your-own-adventure-style story, Jedi's Honor does not have a concrete plot. However, the story only contains two end scenarios which are designated as an \"end.\" Other endings to the adventure either have Skywalker captured by the Empire, having fled his mission, or unable to determine the secret behind rebel activity in the Sil'Lume system. The story begins in a cantina at the Sil'Lume Asteroid Belt where Skywalker is searching for a new base for the Rebel Alliance following the Battle of Yavin. He witnesses a group of stormtroopers led by Governor-General Sebastian Parnell attempt to arrest Erling Tredway, a peaceful resister of the Galactic Empire. Skywalker can either fight the Imperials or passively allows the arrest, but either way Tredway is captured. Skywalker meets two miners of the asteroid belt, Gideon Smith, who has a grudge against the Empire, and Sidney Shortfang, a Pada pacifist who is a follower of Tredway's philosophy. Shortfang asks that Skywalker try to rescue Tredway from the Imperial prison on Tol Ado while Smith tells the group that they should warn Tredway's family on 24 Tredway first. If Skywalker goes to Tol Ado first without investigating 24 Tredway, he will be unable to convince Erling to come with him, as he is determined to die a martyr to his cause. In this scenario, Skywalker will be forced to abandon Erling and return to the Rebellion. Although Skywalker's infiltration of Tol Ado allows him to expose Oro, a Mon Calamarian traitor, Rebel leaders Mon Mothma and Jan Dodonna are disappointed that Skywalker was unable to rescue Tredway as he was important to a future Rebel mission. This ending is designated as \"An End\", implying that it is less than desirable."}, {"tag": "p", "text": "However, if Skywalker decides to go to 24 Tredway first to warn the Tredway family, he discovers Imperials led by Governor-General Parnell bombarding the asteroid and destroying the Tredway mining operation. With Gideon and Sidney, he is too late to save the Tredway workers who have been massacred by the Empire. However, several droids have survived the attack, and they lead him to Erling's sister, Dena Tredway, who has been badly injured. Dena, who is a secret Rebel agent reporting to Mon Mothma, pleads for Skywalker to rescue Erling, who is important to a future Rebel mission. Shortly thereafter, Dena falls into a coma and Skywalker is forced to bring her to Ire Eleazari, an Ithorian friend of the Tredway family who can heal her. At Eleazari's urging, Skywalker heads for Tol Ado to rescue Erling. Having gone to 24 Tredway first, Skywalker's encounter with Erling is different. Upon hearing that his home has been destroyed and the workers at the facility massacred, Erling has a change of heart and agrees to join Skywalker in an escape. However, Erling is a poor combatant and his recklessness causes the death of Gideon Smith. Additionally, Erling causes Sidney Shortfang to be either badly injured or killed based on Skywalker's decisions in the scenario. Following an encounter with escapees from the Imperial prison in the sub-facility, Skywalker and Erling are able to get ahold of an outfit that allows Erling to pose as Darth Vader. The arrival of the real Darth Vader complicates matters, but careful decision making allows Skywalker and Erling to escape on an Imperial shuttle while Governor-General Parnell is executed by Vader for his incompetence. While making their escape, they are cut off by a squadron of TIE fighters, but Erling tells Luke to jump to hyperspace while he inputs the coordinates manually. If Luke trusts Erling, they escape Tol Ado and reunite with Dena and Ire Eleazari. Upon their reunion, Dena tells Skywalker that Erling has the ability through the Force to immediately navigate hyperspace jumps. His ability is invaluable to the Rebellion, as Erling can use this ability to visualize potential Rebel bases and immediately know the coordinates. Upon completion of the mission, Dena tells Skywalker that she hopes to see him at the main Rebel base in the future. This ending is designated as \"The End\", implying that it is the preferred ending and allows the reader to visit both 24 Tredway and Tol Ado and rescue Erling."}, {"tag": "p", "text": "Whether Skywalker decides to go to Tol Ado or 24 Tredway first, he can be captured during his mission and taken to his own prison cell on Tol Ado. In this scenario, Skywalker is unable to complete his mission, but he is able to escape the prison and return to the Rebellion. This ending is designated as a failure with directions to return to the start of the scenario and try again. Likewise, Skywalker can completely avoid interacting with 24 Tredway or Tol Ado. He is able to bring intel on the Sil'Lume Asteroid Belt back to General Dodonna as a possible Rebel base. Although Dodonna supports his suggestion, Mon Mothma overrules the decision, due to her involvement with the Tredways and her hope to use Erling in the future. Like his escape from Tol Ado, this ending is also designated as a failure with directions to start over."}, {"tag": "h2", "text": "Appearances"}]}