{"url": "Jedi_Academy:_Attack_of_the_Furball", "categories": ["Category:Real-world articles", "Category:Star Wars: Jedi Academy"], "nodes": [{"tag": "h1", "text": "Jedi Academy: Attack of the Furball"}, {"tag": "p", "text": "Jedi Academy: Attack of the Furball is a title in the Star Wars: Jedi Academy series. It was released on September 3, 2019."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Christina Starspeeder saga continues in this laugh-out-loud epic from author Amy Ignatow and illustrator Jarrett Krosoczka in the New York Times bestselling series, Star Wars: Jedi Academy!"}, {"tag": "p", "text": "As told through a mix of comics, doodles, and journal entries, it's a new year at Jedi Academy! Christina Starspeeder made it through her first year at the advanced Jedi Academy . . . Barely . . . And year two isn't looking any easier! Christina still apprentices under Jedi Master Skia-Ro while enduring the non-stop sass from droid Q-13. But this year, she has to balance her studies with constant travel, accompanying Skia Ro [sic] on non-stop trips to new worlds full of cool creatures. And those cool creatures are the start of all Christina's problems this year."}, {"tag": "p", "text": "When working on the planet Cholganna, Christina falls in love with a baby nexu - a cat-like creature who's [sic] fluffiness is impossible to resist. But when she sneaks the nexu - named \"Fluffernut\" - back into the dorms, Christina slowly begins to realize why it's never a good idea to take wild animals for pets. Fluffernut begins growing and growing - she'll eventually grow to be 14 feet long and 3 feet tall! Plus, she's chewing up EVERYTHING in sight. And if that weren't bad enough, a mysterious bounty hunter seems to be on her trail, trying to steal Fluffernut back. Can Christina escape this jam without getting thrown out of Jedi Academy? Or will this be the end of her Jedi Academy career?"}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "External links"}]}