{"url": "Jedi_Academy:_A_New_Class", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Jedi Academy"], "nodes": [{"tag": "h1", "text": "Jedi Academy: A New Class"}, {"tag": "p", "text": "Jedi Academy: A New Class is a title in the Star Wars: Jedi Academy series. The title features a new group of students, focused on a new Padawan named Victor Starspeeder, and features a new author for the series, Jarrett J. Krosoczka, replacing Jeffrey Brown. It is 176 pages in length and was published in both hardcover and eBook formats on July 26, 2016."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Victor Starspeeder is psyched to be starting school at the Jedi Academy. His sister, Christina does not share an enthusiasm for Victor's newfound educational path. She's horrified that her annoying baby brother will be there to cramp her style."}, {"tag": "p", "text": "While Victor means well, his excess energy leads him to spend a lot of time in detention with the little, green sage, Yoda. Yoda wants to channel Victor's talents, so he makes the young Padawan join the drama club. Victor is not pleased. \"Learn to control your anger, you must! Successfully manage their emotions, a good Jedi can. Box step and jazz hands … hee hee … young Padawan will!\""}, {"tag": "p", "text": "Victor will have to make new friends, get on his sister's good side, learn to use the force, and hope the year's drama club performance (\"Wookie [sic] Side Story\"? \"Annie Get Your Lightsaber\"?) goes off without a hitch!"}, {"tag": "h2", "text": "Opening Crawl"}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "As of at least April 27, 2016, advance copies of the title have been made available to librarians, signed by Jeff himself. Barnes and Noble's exclusive edition of the title features trading cards of the characters. As of at least July 7, 2016, a preview of the title is posted on Amazon's page for the title via their \"Look Inside\" feature, showing seven pages of content by default and as many as 32 pages, as well as the book's back cover, if the \"Surprise me!\" feature is used."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}