{"url": "Jedi_Academy:_Return_of_the_Padawan", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Articles that need plot summary", "Category:Incomplete lists", "Category:Star Wars: Jedi Academy"], "nodes": [{"tag": "h1", "text": "Jedi Academy: Return of the Padawan"}, {"tag": "p", "text": "Jedi Academy: Return of the Padawan is a non-canon junior novel written and illustrated by Jeffrey Brown. It is the sequel to Jedi Academy (2013) and is the second volume of the Star Wars: Jedi Academy series. It was first published by Scholastic on July 29, 2014."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Author/illustrator Jeffrey Brown returns in the highly anticipated sequel to the NY Times Bestseller Star Wars: Jedi Academy!"}, {"tag": "p", "text": "It's time to return to middle school in a galaxy far, far away….After surviving his first year at Jedi Academy, Roan Novachez thought his second year would be a breeze. He couldn't have been more wrong. Roan feels like he's drifting apart from his friends, and it's only made worse when Roan discovers he's not the amazing pilot he thought he'd be. When the school bullies take him under their wing, he decides they aren't so bad after all—or are they? This year, Roan will have to face alien poetry tests, menacing robots, food fights, flight simulation class, online bullies, more lightsaber duels, and worst of all…a girl who is mad at him. This incredible, original story captures all of the humor, awkwardness, fun, and frustrations of middle school—all told through one boy's comics, journal entries, letters, sketches, e-mails, and more."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}