{"url": "Jedi_Academy:_The_Phantom_Bully", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Articles that need plot summary", "Category:Book stubs", "Category:Star Wars: Jedi Academy"], "nodes": [{"tag": "h1", "text": "Jedi Academy: The Phantom Bully"}, {"tag": "p", "text": "Jedi Academy: The Phantom Bully is the third book in Jeffrey Brown's Star Wars: Jedi Academy series. It was released on June 30, 2015."}, {"tag": "p", "text": "Jeffery began work on the title sometime in or before July 2014."}, {"tag": "p", "text": "Jedi Academy: The Phantom Bully sees the lead character of the series, the Padawan Roan Novachez, training under the Jedi Master Mr. Garfield. The title also includes the resolution of the conflict that had been developed between the two characters in the first two installments of the series. It sees Roan working to try avoid the sorts of problems that plagued his sophomore year at the school. The book is intended the final installment in the series, though a supplementary book, Jedi Academy: Attack of the Journal, was also made available."}, {"tag": "p", "text": "Brown began scanning final artwork for the title on October 31, 2014 and stated that he hoped to have it fully finished by November 27 (U.S. Thanksgiving)."}, {"tag": "p", "text": "The title features the return of Voorpee, the voorpak first seen Jedi Academy: Return of the Padawan."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Award-winning author/illustrator Jeffrey Brown returns for the third installation of the NY Times Bestseller Star Wars: Jedi Academy!"}, {"tag": "p", "text": "After last year, Roan will attempt to redeem himself, avoid the Dark Side, be a better student, and a better friend. But as he and his friends deal with substitute teachers, new aliens, more robots, vegan food, braces, final exams, and more middle school awkwardness, will Roan be able to stay the path of the Jedi?"}, {"tag": "p", "text": "It's hard to believe this is Roan's last year at Jedi Academy. He's been busier than ever learning to fly (and wash) starships, swimming in the Lake Country on Naboo, studying for the Jedi obstacle course exam, and tracking down dozens of vorpak [sic] clones--don't ask. But now, someone is setting him up to get in trouble with everyone at school, including Yoda. If he doesn't find out who it is, and fast, he may get kicked out of school! Why can't middle school just be easy. . ."}, {"tag": "p", "text": "This incredible, original story captures all of the humor, awkwardness, fun, and frustrations of middle school--all told through one boy's comics, journal entries, letters, sketches, e-mails, and more."}, {"tag": "h2", "text": "Opening crawl"}, {"tag": "h2", "text": "Special editions"}, {"tag": "p", "text": "Barnes and Noble's exclusive edition of the title features exclusive Jedi Academy trading cards."}, {"tag": "p", "text": "It was collected in Jedi Academy: Trilogy Box Set."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The novel's title is an obvious joke on the title of the first film of the Star Wars prequel trilogy, Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "At some point on or prior to May 30, 2015, Amazon.com made a preview of the book's contents available via its \"Look Inside!\" feature."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}