{"url": "Jedi_Apprentice:_The_Call_to_Vengeance", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Jedi Apprentice"], "nodes": [{"tag": "h1", "text": "Jedi Apprentice: The Call to Vengeance"}, {"tag": "p", "text": "Jedi Apprentice: The Call to Vengeance is the sixteenth in a series of young reader novels that chronicle the adventures of Qui-Gon Jinn and Obi-Wan Kenobi prior to Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Qui-Gon Jinn is a man on the edge. His heart has been shattered. His beliefs have been destroyed. And now he is dangerously close to stepping over a line that no Jedi dares to cross."}, {"tag": "p", "text": "He wants revenge."}, {"tag": "p", "text": "His fellow Jedi—his apprentice Obi-Wan Kenobi, and Jedi Council member Mace Windu—will try to stop him. But when Qui-Gon strikes out on his own, anything can happen. Revenge is not a Jedi trait…but it is a Human one. Can Qui-Gon separate his personal feelings from his Jedi training?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Qui-Gon Jinn's heart is not in his work. After the death of his truest love, he is finding it hard to continue as a Jedi Knight. When he and his apprentice Obi-Wan are sent to a hostile planet to protect the only witness willing to testify against an evil crime family, he finds it hard to focus. But when the witness is suddenly under attack and the crime family makes a move to ensure its survival, Qui-Gon must keep the peace...and fight both the foes who attack and the enemies within. A Master is supposed to help his Padawan resist the lure of the Dark Side, but can Obi-Wan handle it the other way around, restraining a man not known for his obedience who is as dangerous to himself and those around him as he is to his target?"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Jedi Apprentice: The Call to Vengeance."}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}