{"url": "Jedi_Apprentice", "categories": ["Category:Real-world articles", "Category:Book stubs", "Category:Jedi Apprentice"], "nodes": [{"tag": "h1", "text": "Jedi Apprentice"}, {"tag": "p", "text": "Jedi Apprentice is a series of young-reader novels written by Jude Watson (except for the first book, which was written by Dave Wolverton) that chronicle Qui-Gon Jinn and Obi-Wan Kenobi's exploits prior to Star Wars: Episode I The Phantom Menace. They are published by Scholastic. The back of each volume bears the inscription \"Peace over anger. Honor over hate. Strength over fear\" above the story's synopsis."}, {"tag": "p", "text": "The Rising Force and The Dark Rival concern Qui-Gon taking Obi-Wan as a Padawan and introduce the series' main villain: Xanatos. The Hidden Past and The Mark of the Crown appertain to Obi-Wan and Qui-Gon's further missions in the Trans-Hydian. The Defenders of the Dead and The Uncertain Path are about restoring peace to the war-torn Melida/Daan, a mission during which Obi-Wan temporarily leaves the Jedi Order. In The Captive Temple and The Day of Reckoning, Obi-Wan and Qui-Gon fight a final battle against Xanatos."}, {"tag": "p", "text": "The Fight for Truth and The Shattered Peace detail missions in the Outer Rim. Books 11, 12, and 13 form their own story arc with Jenna Zan Arbor as the antagonist. Books 14–16 concern Obi-Wan and Qui-Gon's mission to help Tahl on the Mid Rim planet of New Apsolon. Books 17 and 18 detail missions in the Core and the Outer Rim, respectively."}, {"tag": "h2", "text": "Books in the series"}, {"tag": "h2", "text": "Special editions"}, {"tag": "h2", "text": "The Rising Force"}, {"tag": "p", "text": "The Rising Force is the only book in the series written by Dave Wolverton. In this book, Qui-Gon declines to take Obi-Wan as a Padawan. Together they defeat some evil Hutts and their minions."}, {"tag": "h2", "text": "The Dark Rival"}, {"tag": "p", "text": "The Dark Rival introduces the first major villain: Xanatos, Qui-Gon's former apprentice. Xanatos is the head of a mining company who is after a valuable substance below a planet's surface. In this book, Qui-Gon takes Obi-Wan on as an apprentice."}, {"tag": "h2", "text": "The Hidden Past and The Mark of the Crown"}, {"tag": "p", "text": "In The Hidden Past, Qui-Gon and Obi-Wan befriend some petty criminals in order to stop a government takeover, in which a major character in The Mark of the Crown, Prince Beju, is helping plot to be the ruler of his home planet. In The Mark of the Crown, Qui-Gon and Obi-Wan travel to Beju's home planet, Gala, to oversee the election of a new ruler. However, Qui-Gon has left to seek another child of the Queen, and Obi-Wan is left to try to find out why the Queen is so sick."}, {"tag": "h2", "text": "Bibliography"}]}