{"url": "Jedi_Apprentice:_The_Death_of_Hope", "categories": ["Category:Real-world articles", "Category:Jedi Apprentice"], "nodes": [{"tag": "h1", "text": "Jedi Apprentice: The Death of Hope"}, {"tag": "p", "text": "Jedi Apprentice: The Death of Hope is the fifteenth in a series of young reader novels that chronicle the adventures of Qui-Gon Jinn and Obi-Wan Kenobi prior to Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "\"I pledge myself to you, Tahl.\""}, {"tag": "p", "text": "\"I pledge myself to you, Qui-Gon.\""}, {"tag": "p", "text": "With these words, two Jedi Knights acknowledged that their bond had grown beyond friendship and into love."}, {"tag": "p", "text": "Now Tahl has been abducted in a trap that Qui-Gon feels he should have foreseen. Consumed by dark visions, Qui-Gon and Obi-Wan Kenobi must do everything in their power to get her back before it's too late. But that won't be easy in a land where nobody can be trusted…and everyone has something to hide."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Blinded from injuries sustained at Melida/Daan, Tahl is nonetheless a great Jedi renowned for her diplomatic skills. She shares a powerful friendship with Qui-Gon Jinn; the two are connected through the Force in a way that's stronger than friendship, deeper than love. Now, Qui-Gon experiences great loss as Tahl is kidnapped in a trap he should have foreseen. He and his young apprentice, Obi-Wan Kenobi, set out to rescue her. They set out on the trail of Balog, Tahl's kidnapper, with a probe droid tracking him they got from Mota."}, {"tag": "p", "text": "While pursuing Balog, they encounter Eritha, who reveals to them her sister Alani's plot to take over the government. She joins them on their mission. Soon after she joins them, they are attacked by the Rock workers, a group of miners whose lives are endangered by the Absolutes. When the Rock Workers attack, Obi-Wan is injured. They take him back to the Workers' settlement for medical treatment. While Obi-Wan is healing, Qui-Gon questions the workers about the Absolutes, hoping to get some leads on Balog and Tahl's whereabouts, but finds out nothing that could help them."}, {"tag": "p", "text": "As soon as Obi-Wan is fit to travel, they set off again, only to be delayed once more when Yanci, the Rock Worker medic who treated Obi-Wan, begs them to come back because the Absolutes are attacking their settlement. Qui-Gon sends Obi-Wan and Eritha to go help, but decides to pursue Balog himself. However, he follows the Jedi Code and decides to go help the Rock Workers instead. By the time help got there, everybody had already been killed. However, it did give them a lead on where the Absolutes were from the type of soil carried in from their boots."}, {"tag": "p", "text": "The Jedi and Eritha were able to locate the Absolute hideout. They infiltrated it and found Balog with Tahl in a sensory deprivation device. Balog realized the Absolute hideout would no longer be hidden so he ordered an evacuation and destroyed it. They got Tahl out and swam in a lake where the hideout was hidden away form it. Qui-Gon took Eritha's speeder and took Tahl to the city of New Apsolon to be received by medics."}, {"tag": "p", "text": "While Qui-Gon is waiting for word from the doctor, Obi-Wan and Eritha arrive. They think about Tahl's kidnapping and if anyone else was behind it. Then the doctor comes and tells Qui-Gon that Tahl's damage is severe, but Qui-Gon is confident she will recover. He goes into the room where Tahl is, and she promises that wherever she is headed she will wait for him. Then she dies. Obi-Wan feels a disturbance in the force, and rushes into the room where Tahl lay. Qui-Gon's grief for her shocks him, and Qui-Gon tells his Padawan that their was no help for him now, only revenge."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Jedi Apprentice: The Death of Hope."}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}