{"url": "Jedi_Apprentice:_The_Ties_That_Bind", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Jedi Apprentice"], "nodes": [{"tag": "h1", "text": "Jedi Apprentice: The Ties That Bind"}, {"tag": "p", "text": "The Ties That Bind by Jude Watson is the fourteenth in a series of young reader novels called Jedi Apprentice. All the books in the series are written by Jude Watson, except for the first book, Jedi Apprentice: The Rising Force, which was written by Dave Wolverton. The series explores the adventures of Qui-Gon Jinn and Obi-Wan Kenobi prior to Star Wars: Episode I The Phantom Menace."}, {"tag": "h2", "text": "Product details"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Six years ago, Qui-Gon Jinn and Tahl helped the people of the planet Apsolon choose their first free leader. It seemed that peace had arrived at last."}, {"tag": "p", "text": "Now the leader has been killed. His daughters have been kidnapped. And Qui-Gon and Tahl have returned to Apsolon with Qui-Gon's apprentice Obi-Wan—against the wishes of the Jedi Council."}, {"tag": "p", "text": "The ties that bind Qui-Gon and Tahl are about to experience their most powerful test yet."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Qui-Gon Jinn and his Padawan Obi-Wan Kenobi are on a training mission on the planet Ragoon VI. They are following a trail left behind by another Jedi, Rana. But before they can complete their tracking exercise they are attacked by a pack of Malia. After defeating several of the creatures, one of them suddenly drops dead and the rest of the pack flees. Then a group of Ragoon hunters, using poisonous blow-darts, reveal themselves and tell the Jedi that their deaths will be less painful at their hands. Qui-Gon, however, realizes that the hunters merely want the dead Malia. He offers them to the hunters and they are free to leave. When they return to their exercise Qui-Gon suddenly stops as he receives a vision. He informs his Padawan that they should return to the Jedi Temple immediately. In his vision Tahl was in great distress."}, {"tag": "p", "text": "Qui-Gon and Obi-Wan rush back toward their transport, although it still takes them three days to reach it, and hurry back to Coruscant. When they reach the temple Qui-Gon asks the Jedi Knight stationed at the security checkpoint to contact Tahl. He informs Qui-Gon that she is still in the Jedi Temple, but is not answering her comlink. Qui-Gon deduces that she then must be at the Jedi Council Room and hurries to it. He rushes in, not bothering to request entrance, and sees Tahl reporting to the Jedi Council. Despite his breach of protocol Qui-Gon is allowed to stay and Tahl continues with her report. She first relates her mission with Qui-Gon to New Apsolon six years earlier. Now she has been contacted by two girls she had met then, they are in terrible danger and request help. Tahl proposes that she retrieve the girls. Qui-Gon insists on coming along, but his offer is turned down by the Jedi Council. Outside the Council Room, Tahl gets angry with Qui-Gon, thinking he has doubts about her abilities now that she is blind."}, {"tag": "p", "text": "Tahl had told her Padawan Bant Eerin about what had happened in the Council Room, and she in turn informed Obi-Wan. Bant was upset as Tahl had left for a mission without her again Bant was afraid Tahl did not trust her yet. Obi-Wan tries to console her, but he cannot take away the fact that Tahl's mission is taking longer than expected, she has already been gone for two weeks, while the mission should not have lasted more than three days. Meanwhile, Qui-Gon is trying to lose himself in training, but that night he has a nightmare of a dying Tahl. He decides to finally act upon his vision. He informs the Council of his decision to follow Tahl to New Apsolon, and despite their advice, he stubbornly goes on with his plans. Obi-Wan joins him, even though Qui-Gon tries to have him stay in the Temple."}, {"tag": "p", "text": "Arriving in the capital city of New Apsolon Qui-Gon and Obi-Wan dress themselves as common travelers. They make their way from the Workers sector to the Civilized sector, there they discover several pieces of graffiti opposing Roan.\nThey continue their path towards the Administration Services Building for a mandatory security check. They are greeted by Balog, the head of security, who warns them that the planet soon could be very dangerous for offworlders, as there is some political unrest. Qui-Gon asks the man if he believes if the planet's leader, Roan, is in danger of being assassinated as his predecessor was. Balog tells them it is unlikely, as Roan is popular with most of the inhabitants of both the Workers and the Civilized sectors. He even informs them that the two girls Tahl had been sent to rescue, Alani and Eritha, are safely living two blocks away and have been adopted by Roan."}, {"tag": "p", "text": "Qui-Gon and Obi-Wan make their way to the house and inside Qui-Gon is warmly greeted by the two girls. When Qui-Gon informs if they had contacted Tahl for help, they tell him they did not. Qui-Gon and Obi-Wan leave to solve this mystery."}, {"tag": "p", "text": "First they decide observe the city and happen upon the Museum of the Absolutes, the former secret police. Their guide is Irini, a former prisoner of the Absolutes. She tells them about the time before the revolution six years earlier. She also tells them that many of the Absolutes are still free and have gone underground or were protected by the Civilized.\nRecently, records of the Absolutes had been discovered, but the government sealed them, angering many of the Workers."}, {"tag": "p", "text": "Outside the museum Qui-Gon alerts Obi-Wan that they are being followed by a probe droid, even though they are illegal on New Apsolon. They enter an alley and quickly hide, there Qui-Gon confronts the droid and cuts it in two with his lightsaber. Immediately after blaster fire erupts from above them. Unable to move freely in the narrow alley they move up to an adjoining roof. The blaster fire stops, but they see no trace of their assailant. They only find a transmitter for the probe droid and an ammunition pack branded with the same symbol as Irini wears on a necklace."}, {"tag": "p", "text": "They wait outside the museum until Irini appears, they follow her into an airbus. They get off at the same stop as Irini and continue to shadow her. Irini enters a building slated for demolition, Qui-Gon and Obi-Wan enter the building next door. They make their way up, following sounds they hear in the other house. They eventually manage to find a way into Irini's building and move toward the source of the sound. They overhear Irini discussing with a group of Workers. They see Roan as Ewane's murderer and plan to overthrow him, also because they believe that Roan is behind the re-formation of the Absolutes. Lenz informs the group of new leadership within the Absolutes, but he does not know who they are. Then Lenz's comlink goes off, he is informed that the Absolutes are raiding the building. The group flees to the roof, but before the two Jedi can escape the Absolutes discover them. Rather than fight Qui-Gon orders Obi-Wan to submit."}, {"tag": "p", "text": "They were blindfolded and bound, then they were transported to another building. Qui-Gon tried to get some information from one of their captors, but he did not learn much except that the captors knew they were Jedi and did not support the current government. After an hour they were again moved to another room where Qui-Gon heard Tahl speaking."}, {"tag": "p", "text": "Apparently Tahl had managed to infiltrate the Absolutes. They were questioned by another person in the room. After Qui-Gon did not answer their question to their satisfaction they discuss what to do with the Qui-Gon and Obi-Wan. Tahl suggest letting them go as their deaths surely would send an investigation by the Jedi and the Senate, and they also would lose any hope of gaining backing from the Senate. The others left and Tahl took off Obi-Wan and Qui-Gon's blindfolds and bounds."}, {"tag": "p", "text": "Obi-Wan watches as Qui-Gon and Tahl seem to forget the whole world around them. Then Tahl leads them to the exit, in a large warehouse owned by the Absolute, on the edge of the Civilized sector. As they are about to part ways with Tahl, Qui-Gon asks her her plan. She tells them that Alani and Eritha did contact her, but lied to Qui-Gon to protect Tahl. The twins were quite informed about the situation on New Apsolon and realized that they could not leave the planet as they were symbols for the new government. The Absolutes, however posed a threat against them and the government so Tahl had agreed to go under cover and find out how strong the Absolutes actually were. She discovered that they were not that powerful, but they had important backing and were amassing weapons. She asks Qui-Gon to find the backer, but Qui-Gon cannot help her, as there has been no official request by any party in the government. After some arguing Tahl proposes a compromise, she will remain under cover for one more week while Qui-Gon and Obi-Wan will investigate Ewane's murder. Qui-Gon accepts reluctantly and Tahl suggests they start by questioning Manex, Roan's brother."}, {"tag": "p", "text": "Qui-Gon and Obi-Wan spend the night in a guesthouse, but Qui-Gon can not get to sleep as the gnawing feeling he has had since his vision still has not gone, even though he now is on a path to help Tahl. The next morning they head to Manex's palace-like mansion. They are heartily welcomed by Manex, but their conversation does not leave them much wiser. Manex denies that he was behind Ewane's murder, nor does he believe that his brother Roan is behind it as Ewane was like a brother to Roan."}, {"tag": "p", "text": "Next Qui-Gon decides the Supreme Governor, Roan. As they neared Roan's residence Obi-Wan alerts him to a tracking droid hovering in front of the house. Qui-Gon soon noticed another. Apparently, Roan or someone else had reason to improve surveillance of the house. As they near the house Qui-Gon senses a disturbance in the Force. They ring the security button, but no one answers. Obi-Wan suggests they try entering the house through the gardens. They jump over the wall and Qui-Gon searches for a way in, when Obi-Wan suddenly alerts him to a few masked people carrying a large black package over the garden wall. When he sees a blond strand of hair sticking out, Qui-Gon quickly realizes the twins are being kidnapped. The intruders spot them and one of them activates a transmitter, calling probe droids that attack the Jedi. The kidnappers flee while they have the advantage, Qui-Gon and Obi-Wan ignore the probe droids and pursue. On the other side of the wall the intruders have loaded the twins on swoops and take off. Then a secret door opens and Balog and security forces emerge. Qui-Gon quickly explains the situation and Balog calls for air support to follow the kidnappers. Balog moves away to inform Roan what happened.\nQui-Gon remarks to Obi-Wan that he might already know and be behind the kidnapping."}, {"tag": "p", "text": "They meet with Tahl to discuss the situation. She does not believe that the Absolutes are behind the kidnapping, because then she would probably know of the kidnapping. She suggest that Irini and her group might have taken the twins to keep them away from Roan.\nObi-Wan suggests they try to meet with Roan again, but just at that moment Qui-Gon's comlink signals. Roan is asking the Jedi to meet with him. Qui-Gon and Obi-Wan discuss the situation with him when Roan's comlink signals. It is the kidnappers, in exchange for the twins' safe return Roan has to resign without mentioning the kidnapping. Roan agrees to their terms, he will be contacted when and where to pick up the twins. Qui-Gon warns him not to go alone, when he is contacted he must ask if he can take the Jedi as escorts."}, {"tag": "p", "text": "They have just left Roan's office when Tahl contacts them. The Absolutes have found out she is a Jedi. They have sent probe droids to hunt and kill her, and because she cannot see or sense the droids she cannot destroy them. She is hiding in a memorial in the Workers sector. Qui-Gon and Obi-Wan hurry toward her. Qui-Gon worries if his vision of Tahl's death is about to come true. As they near Tahl's location Obi-Wan urges him to be careful as the probe droids might be looking for them as well. They find Tahl where she said she was and they decide to return with her to Roan's house. The Workers on the street seem to be heading to a demonstration, but in stead of hiding in the crowd, they move on toward the Civilized sector. Then a probe droid appears, Qui-Gon quickly slashes it out the sky, but soon three more arrive. While Qui-Gon protects Tahl, Obi-Wan uses his liquid-cable launcher to reach a higher ledge, meanwhile taking out one of the probe droids. The two other droids divide their attention between Tahl and Obi-Wan. Obi-Wan takes out the one attacking him, but Qui-Gon has trouble defending Tahl. He pushes her behind some garbage bins where she will be safe. Obi-Wan jumps off the roof, while Qui-Gon also jumps at the last droid, they take it out together. They run toward the crowded streets of the Civilized sector, and into Institute of Government Service where Roan's office is located. But Roan is not there, his assistant informs them he has gone to meet with the kidnappers. After waiting for hours in Roan's office, Bolag arranges accommodations for them in Roan's residence. When they move to the residence Qui-Gon spots a large package near the house. When they near it, they discover it is Roan, he is dead."}, {"tag": "p", "text": "They carry the body inside. Bolag thinks it best to not reveal Roan's death yet, they first need to find the twins. Qui-Gon remarks it will be hard to conceal the death, as Roan's killers will want it to become known. Bolag goes to inform Manex of his brother's death, before he finds out in another way. Not much later Manex arrives in distress, he goes to sit with his brother's body. Later that night, Qui-Gon hears a noise outside, when the three Jedi reach the door it just opens and the twins enter. They immediately ask where Roan is, they had heard rumors of his death on the street after their kidnappers had let them go. When they hear the rumor confirmed they blame themselves for his death, but Tahl consoles them by telling them it was Roan's own choice to find them. She suggest the twins go back to Coruscant with her in the morning and the twins agree. When the twins have gone to see Roan, Bolag informs the Jedi that a peace meeting is being set up between the Civilized, the Workers, the Absolutes and him to stabilize the government. But most parties have asked for a Jedi to attend the meeting. Qui-Gon consents to go, but Tahl insists that she go instead, because she knows the most about the Absolutes. Then, Qui-gon realizes something very important that he feels he must tell Tahl as soon as possible. He requests to speak with Tahl alone in another room."}, {"tag": "p", "text": "Tahl expects another argument, but Qui-Gon just wishes to tell her something. First, he agrees that she should attend the meeting, but he will not leave New Apsolon before she returns from the meeting. He tells her he believes that if he does he will not see her again and has felt this way since his vision. The second thing he wants to tell is of a more personal nature. He reveals to her that he has fallen in love with her. After a while she speaks, she actually feels the same way. Then they pledge themselves to each other. They acknowledge that their lives will be full of separations from each other, but they still decide to be together."}, {"tag": "p", "text": "When Qui-Gon and Tahl leave the room, Qui-Gon informs Obi-Wan of their decision. Tahl will go to the peace meeting, while they wait with the twins for her return. Then they will return to the Jedi Temple, unless the government officially asks them to stay. Obi-Wan notices a change in the look on his Master's face, he no longer looks haunted. Tahl and Balog leave for the meeting. In the morning Qui-Gon and Obi-Wan start packing for their return to Coruscant when they hear a scuffle outside. When they go to look they find Irini in the grip of a security guard. She asks them why they need security, as they are Jedi. Qui-Gon tells her of the probe droids, carrying ammunition with the same insignia as the one on Irini's necklace. She informs them that it is the Workers logo, but she does not believe the Workers have attacked the Jedi, instead she believes someone is misusing the logo. She then tells them she has some useful information for the Jedi, if they are really present to guard the peace. They reassure her and she tells them that the Workers have found it was not one of them that kidnapped the girls. She also informs them that the girls could be kidnapped because someone at the highest levels of security had changed the security procedures. Qui-Gon and Obi-Wan reach the same conclusion, Balog was behind the kidnapping and the death of Roan. They warn Irini that Bolag has a hidden agenda and that she should be careful at the peace meeting, but she has no idea what meeting they are talking about."}, {"tag": "p", "text": "Qui-Gon and Obi-Wan rush toward the Institute of Government Service, and there they force Bolag's assistant to take them to the secret meeting room where the meeting was to take place. Outside they see a bin with several blasters and Tahl's lightsaber inside it. The room itself was empty. Qui-Gon is frustrated and afraid his vision of Tahl in danger will come true."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Jedi Apprentice: The Ties That Bind."}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}