{"url": "Jedi_Apprentice_Special_Edition:_Deceptions", "categories": ["Category:Real-world articles", "Category:Jedi Apprentice"], "nodes": [{"tag": "h1", "text": "Jedi Apprentice Special Edition: Deceptions"}, {"tag": "p", "text": "Jedi Apprentice Special Edition: Deceptions is the first of two books bridging the gap between the Jedi Apprentice and Jedi Quest series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "As an apprentice, Obi-Wan Kenobi is blamed for the death of another Jedi student. With the help of his Master, Qui-Gon Jinn, Obi-Wan must fight to clear his name. But even if he is found not guilty, he has gained an enemy for life—the dead boy's vindictive father."}, {"tag": "p", "text": "Twelve years later, Obi-Wan is a Jedi Knight, with his own young apprentice, Anakin Skywalker. Anakin doesn't know about the secrets Obi-Wan is hiding. But as the past comes back to attack them, Obi-Wan and Anakin must fight deception with truth—and face off against enemies both new and old."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Obi-Wan Kenobi was still reeling from the death of his fellow Jedi and rival, Bruck Chun. Now the deceased boy's father and son, Vox and Kad Chun respectively, had arrived at the Jedi Temple to hear a report out Bruck's death. After a terrible hearing, Obi-Wan was left in a state of guilt. The next day, the Jedi Council informed Obi-Wan that Vox Chun had made an inquiry to look into the death of Bruck Chun. Qui-Gon Jinn, feeling that this would take its toll on his Padawan, attempted to cheer him up by telling him that as long as he spoke the truth, he had nothing to worry about."}, {"tag": "p", "text": "During the hearing, a group of Senators, Qui-Gon, Obi-Wan, and Bant Eerin—a the victim in the Sabotage of the Temple—attended. Sano Sauro, who was a friend of Vox Chun, was also present. Qui-Gon spoke first and stated that Xanatos and Bruck Chun had attempted to sabotage the Temple. After this, Bant Eerin spoke and felt guilt after she had been forced to accept that she didn't know if she was close to death."}, {"tag": "p", "text": "Qui-Gon felt that his Padawan needed some time on his own to think. He went to Centax-2, where there were sabotaged Jedi starfighters. He assisted Tahl in capturing the culprit, Tarrence Chenati, and he was able to flee. At the hearing, Obi-Wan was starting fall apart, until Qui-Gon turned up with some new evidence. Stating that Xanatos never trusted anyone, he believed Bruck had a device that would give him access to his conversations. After revealing the device, the Senators listened to the recordings and made their decision. Obi-Wan was innocent and was free to go, but not before meeting Kad Chun. After exchanging a few words, Kad had tried to strike Obi-Wan, but his wrist had twisted. Kad left, but not before saying that in his eyes, Obi-Wan was a killer."}, {"tag": "p", "text": "Years later, Obi-Wan and his Padawan, Anakin Skywalker, were sent on a mission to investigate a ship called the BioCruiser. After being denied free access throughout the ship, Obi-Wan threatened to return to Coruscant and then the full might of the Galactic Senate would be unleashed on the Cruiser. After being lead towards the bridge, they discovered that the person that was in charge was Kad Chun. After a brief meeting with Vox and Kad, Anakin started to wonder why these people hated his master. After being granted a tour of the Cruiser, Obi-Wan met a friend from his past, Andra. Soon after they had met another friend of Obi-Wan's, Denetrus."}, {"tag": "p", "text": "The next day Den turned up with some confidential files. Soon after this Vox and Kad learned that their files had been broken into. They immediately burned the Jedi and had requested them to leave. After calling back their transport, and having no intention to leave, Obi-Wan and Anakin decided to dig deeper into revealing what was going on. They learned that the BioCruiser was set to blow, and that a company called Offworld was behind it."}, {"tag": "p", "text": "After informing Kad and Vox, Vox denied any involvement but Kad had just received a incoming call explaining that Offworld shipping were surrounding them. Vox explained that Offworld would take care of them but Kad refused and went into discussing what to do. After deciding to deal with the droids that were boarding, Obi-Wan went to deal with them, leaving Anakin and their transport driver, Garen Muln, to deal with the attacking ships. It was then revealed that Biocruiser had been sabotaged and the person that was responsible was the same person that sabotaged the Jedi starfighters years ago: Tarrence Chenati. After killing Vox Chun, he fled the ship. The remaining people were soon able to get to the closest planet."}, {"tag": "p", "text": "When they were on the planet, Kad and Obi-Wan exchanged words, and Kad said that he didn't blame Obi-Wan after all."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}