{"url": "Jedi_Apprentice_Special_Edition:_The_Followers", "categories": ["Category:Real-world articles", "Category:Jedi Apprentice"], "nodes": [{"tag": "h1", "text": "Jedi Apprentice Special Edition: The Followers"}, {"tag": "p", "text": "Jedi Apprentice Special Edition: The Followers is the second book that bridges the gap between the Jedi Apprentice and Jedi Quest series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Who are the followers of the Sith? Devoted to the study of the dark side of the Force, they live an underground existence…but their threat is growing. Although they do not have Sith power, they are on a constant search for it. Nothing—not even the Jedi Knights—will get in their way."}, {"tag": "p", "text": "Dr. Lundi is the leader of the Sith followers. As he gets closer to attaining a Sith Holocron, he comes face-to-face with Qui-Gon Jinn and his apprentice Obi-Wan."}, {"tag": "p", "text": "Ten years later, when the Sith followers reappear, Obi-Wan and his own apprentice, Anakin Skywalker, must rely on Lundi to help them. But he is to be feared, not trusted."}, {"tag": "p", "text": "The Sith are on the rise. The Jedi must stop them."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Professor Murk Lundi was a historian who had an interest in the Sith. After learning this, Qui-Gon Jinn and Obi-Wan Kenobi followed him on a ship that is headed for Lisal. During the trip, Lundi convinced the ship's captain to go to Nolar, stating that he didn't need to go to Lisal."}, {"tag": "p", "text": "The two Jedi followed the professor until they were attacked by a group of thugs. Soon, the Jedi located Lundi in a shop where he wanted to buy a Nolarian 6000 drill. After being told that the store didn't have any, Lundi said that he didn't really need one. He just needed to time it well."}, {"tag": "p", "text": "The Jedi followed Lundi to Kodai, which was rumored to have a Sith holocron on the planet. Soon after, they were able to find Lundi but only to discover that the Sith holocron had fallen deeper into the geyser it was in. Lundi, now completely insane, started to ramble on about been deprived of his chance to get the holocron."}, {"tag": "p", "text": "Years later, Obi-Wan and Anakin Skywalker were asked to retrieve the Sith holocron from Kodai. After enlisting the help of Lundi, the Jedi were off. Lundi confirmed that Norval They eventually came to one of Lundi's old followers, Omal. They witnessed how the holocron had turned Omal insane, just as it turned Lundi insane."}, {"tag": "p", "text": "The Jedi went back and searched the geyser only to find the holocron was missing and that Norval had it. Lundi mentioned that numerous parties had promised vast riches should the holocron ever be found and that one of the parties arranged to meet him at Ploo II. The Jedi, sensing that Lundi was telling the truth and headed for Ploo II."}, {"tag": "p", "text": "Upon arriving at Ploo II, the Jedi came across Norval's ship. While Obi-Wan boarded his ship, Anakin was left to pilot their borrowed ship from harms way. Obi-Wan caught up with Norval and he revealed that he had crafted his own lightsaber. After a short battle, Obi-Wan was able to overpower Norval, retrieve the holocron and leave the ship before it was destroyed. After returning to his ship, Obi-Wan arrived just in time to witness Lundi die. Anakin had let him out of his cage saying that he didn't he should spend his last moments in a cage."}, {"tag": "p", "text": "Obi-Wan and Anakin arrived at the Jedi Temple and stored the holocron inside a vault. The Jedi requested that Lundi should be attended to."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Jedi Apprentice: The ."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}