{"url": "Jedi_Council:_Acts_of_War_1", "categories": ["Category:Real-world articles", "Category:Jedi Council: Acts of War"], "nodes": [{"tag": "h1", "text": "Jedi Council: Acts of War 1"}, {"tag": "p", "text": "Jedi Council: Acts of War 1 is the first issue of the Jedi Council: Acts of War comic series, released June 21, 2000 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Even in the days before the shadow of the Star Wars: The Phantom Menace fell upon it, the rule of the Senate was no guarantee of peace. Trouble could come in many forms to any of the thousands of worlds that made up the Republic. When conflict arose, it was the duty of the Jedi Knights, under the guidance of the Jedi Council, to protect the innocent and set things right."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In 33 BBY, the Yinchorri—a warlike species in the Expansion Region—launched an invasion of non-Yinchorri settlements outside their home territory during the Yinchorri Uprising. Yinchorri attack ships assault Mayvitch 7, one of the moons of Amador in the Chalenor system where the Immalians maintained a mining operation. The Yinchorri quickly massacred the defenders but one of the soldiers managed to send a distress transmission to the Jedi Order. Four days later, this transmission was played during a meeting of the Jedi Council at the Jedi Temple on Coruscant. By then, the Yinchorri had seized control of the moon and the system. Jedi Master Mace Windu addressed the Jedi Masters and surmised that the raids were carried out by the Yinchorri rather than pirates."}, {"tag": "p", "text": "The Yinchorri were recent members of the Galactic Republic's Senate and they had obtained interstellar capabilities through illicit means. The Jedi Council then proceeded to discuss the Yinchorri threat. Earlier, the Order had dispatched two Jedi—Jedi Knight Naeshahn and her Padawan Ebor Taulk—on a mission to Yinchorr, the species' homeworld. However, they were murdered and their mutilated bodies were delivered to the door step of Supreme Chancellor Finis Valorum's chambers. Prior to their deaths, the two Jedi envoys found that the Yinchorri were immune to Force manipulation and that their society was divided into two castes: a ruling intelligentsia and a warrior caste. The Yinchorri's recent acquisition of cortosis technology was also a source of further concern among the Jedi leadership."}, {"tag": "p", "text": "Later that night, the two members of the underground Sith Order Darth Sidious and his Zabrak apprentice Darth Maul watched the Jedi Temple from an unidentified skyscraper. Sidious had orchestrated the upcoming confrontation between the Jedi and the Yinchorri species in order to bring about two changes that would be beneficial to Sith interests. Sidious viewed the Force-resistant Yinchorri as a threat to his future ambitions and wanted to use another enemy to bring them down. He also wanted several Jedi to die in the Yinchorri Uprising in order to lessen the Jedi threat to his plans to destroy the Republic. Maul wanted to play a part in Sidious' Yinchorri plans but Sidious wanted to conceal the presence of the Sith for the moment. Instead, they would work through intermediaries like the Yinchorri and the Devaronian mercenary Vilmarh Grahrk, a smuggler who had supplied arms to the Yinchorri."}, {"tag": "p", "text": "During a conversation via hologram, the Devaronian explained to his Sith master Sidious that he had arranged for an upcoming confrontation between the Yinchorri and the Jedi. Vilmarh had leaked intelligence of the upcoming Jedi visit to the Yinchorri. Through his services, Vilmarh had developed a close partnership with Darth Sidious but the Sith Lord refused to let him see his face since he reasoned that it was better that few knew of his true identity as Senator Palpatine of Naboo. The following day, the Jedi Order assembled a mission to the Yinchorri system. Prior to their departure, Master Giett and the Padawans K'Kruhk and Obi-Wan Kenobi played a game that involved rotating three white stones and one black stone under four cups. The object of the game was to keep track of the black stone but also helped test the Jedis' Force sensing abilities. Master Giett won the game by using his superior mastery of the Force to cloud his competitors' perceptions by tricking them into following their own expectations and assumptions."}, {"tag": "p", "text": "Prior to the Jedi mission's departure, Master Windu gave the assembled Jedi a rousing speech. After thanking them for volunteering for the mission, he expressed his reluctance to resort to force but stressed that the Jedi had sworn to protect the Republic and could not afford to ignore the threat posed by Yinchorri belligerence nor the cold-blooded murder of two of their Jedi compatriots. He then warned the Jedi to put away any feelings of righteousness and reminded them that while right was on their side, they would carry out justice dispassionately and without rancor. The Jedi mission consisted of twelve Jedi and was made up of three groups, each assigned with a Consular-class space cruiser since there were only three habitable worlds in the system. Mace Windu, Saesee Tiin, Qui-Gon Jinn and his Padawan Kenobi were assigned with visiting the harsh Yinchorri homeworld of Yinchorr while Adi Gallia, Eeth Koth, Tsui Choi and Theen Fida were assigned to the ocean world of Yitheeth. Masters Plo Koon, Micah Giiett, Lilit Twoseas and her Padawan K'Kruhk were sent to Yibikkoror, a tiny world with a dense atmosphere. All three groups would search for a rumored Yinchorri command center."}, {"tag": "p", "text": "As the Jedi ships departed, Master Yoda conferred with the Quermian Master Yarael Poof. The latter noted that the former was troubled. Yoda replied that the Yinchorri Uprising marked the first threat to emerge after many years of relative peace. He commented that the Jedi mission was flying into danger but added that those who remained also faced uncertainty. During the journey, Giett and K'Kruhk had a training session in lightsaber combat which involed a cortosis shield. Since the Yinchorri had access to that technology, the Jedi had to know how to deal with opponents wielding cortosis shields. Having jumped out of hyperspace in the Yinchorri system, they were immediately attacked by Yinchorri starfighters, spacecraft that had been stolen from the Golden Nyss Shipyards. The Jedi were disadvantaged since their cruisers were unarmed. However, during the engagement, Gallia's cruiser succeeded in destroying two fighters by tricking a third into destroying them before continuing to Yitheeth."}, {"tag": "p", "text": "Meanwhile Windu's cruiser had its shields disabled by an enemy fighter. However, they evaded destruction due to the efforts of Tiin, who made a jump into hyperspace past a planet. To their Yinchorri pursuers, it appeared that their target had made a jump into hyperspace through the planet. By the time they found out, it was too late since the cruiser had headed to Yinchorr. Meanwhile, Micah and K'Kruhk's cruiser was hit by enemy fire but managed to fly towards Yibikkoror while still being pursued by three Yinchorri fighters. Later that day, the Jedi Temple on Coruscant intercepted communications between the Yinchorri fighter groups. One Yinchorri report confirmed that one Jedi cruiser had been shot down by two Yinchorri fighters. A Bith Jedi also cited another report claiming that Mace's ship had been destroyed above Yinchorr. However, other reports claimed that the ship had vanished from their screens. There were also three separate reports confirming that a cruiser had been brought down by direct hits. Yoda was worried by these offworld developments but also expressed concerns of another threat. Meanwhile, several armed Yinchorri warriors arrived on the outskirts of the Jedi Temple's compound on Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Collections"}]}