{"url": "Jedi_Council", "categories": ["Category:Canon articles", "Category:Jedi Councils"], "nodes": [{"tag": "h1", "text": "Jedi Council"}, {"tag": "p", "text": "A Jedi Council was an organized body of Jedi, charged with overseeing one or more of the Jedi Order's many affairs."}, {"tag": "h2", "text": "Overview"}, {"tag": "h3", "text": "Councils of the Jedi Order"}, {"tag": "p", "text": "During the rule of the Galactic Republic there were four councils in operation that oversaw the Jedi Order's affairs. Each council was housed in one of the four Council Towers that surrounded the Temple Spire."}, {"tag": "h4", "text": "Jedi High Council"}, {"tag": "p", "text": "The Jedi High Council, informally referred to as the Jedi Council, was the primary ruling body of the Order. Situated atop the High Council Tower of the Jedi Temple, the Council consisted of twelve Jedi Masters, chaired by a Grand Master, who oversaw and governed the Order as a whole. Though the Order's allegiance was to the Galactic Senate, the Council was given the autonomy to govern Jedi affairs without interference."}, {"tag": "h4", "text": "Council of First Knowledge"}, {"tag": "p", "text": "Led by the Caretaker of First Knowledge, the role of the Council of First Knowledge was to procure advice on matters requiring ancient Jedi wisdom. Convening in the Tower of First Knowledge, the Council oversaw the curriculum of the Temple and the Order's repository of knowledge—the Jedi Archives."}, {"tag": "h4", "text": "Council of Reconciliation"}, {"tag": "p", "text": "The Council of Reconciliation convened in the Tower of Reconciliation and was charged with attempting to settle interplanetary disputes. It worked with the Galactic Senate and the Republic Diplomatic Corps to achieve this end."}, {"tag": "h4", "text": "Council of Reassignment"}, {"tag": "p", "text": "The Council of Reassignment organized work for Jedi younglings not chosen to be elevated to the rank of Padawan. Convening in the Reassignment Council Tower, the Council also held jurisdiction over the Jedi Service Corps."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}