{"url": "Jedi_Council:_Acts_of_War_3", "categories": ["Category:Real-world articles", "Category:Jedi Council: Acts of War"], "nodes": [{"tag": "h1", "text": "Jedi Council: Acts of War 3"}, {"tag": "p", "text": "Jedi Council: Acts of War 3 is the third issue of the Jedi Council: Acts of War comic series, released August 23, 2000 by Dark Horse Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "What began as Mace Windu and the Jedi Council's covert search for the secret government headquarters of the warlike Yinchorri has turned into a confrontation with the military might of an entire planet. The result is a full-scale battle pitting a vast army of heavily-armed alien warriors against twelve lightsaber-wielding Jedi. Pity the poor Yinchorri!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In 33 BBY, the Jedi Order dispatched a Jedi mission consisting of three Consular-class space cruisers to the Yinchorri system in an attempt to end the Yinchorri Uprising. Upon arriving in the Yinchorri system, the Jedi cruisers were pursued and attacked by Yinchorri starfighters but managed to evade their pursuers and land in their designated destinations. Their mission was to find and disable the Yinchorri command center. Jedi Master Adi Gallia's team lands on the watery moon of Yitheeth where they captured the Devaronian mercenary Olmar Grahrk, who was part of a Sith conspiracy to pit the Yinchorri species against the Galactic Republic and their Jedi defenders. Meanwhile, Master Micah Giiett's team lands on Yibikkoror only to be trapped by their Yinchorri pursuers."}, {"tag": "p", "text": "In the exposition, Jedi Masters Mace Windu and Qui-Gon Jinn's team land on the Yinchorri homeworld of Yinchorr, a desert world. During the mission, Jinn and his Padawan Obi-Wan Kenobi went on a recon probe of the surrounding area and find that the Yinchorri are mustering their forces. They also confirm the earlier Jedi mission's report that the Yinchorri species are immune to mind control but fail to find any sign of the Yinchorri command center. Instead, they find that Yinchorr is being used as a staging ground for an invasion. The pair narrowly evade a Yinchorri patrol and report back to Masters Windu and Saesee Tiin. Meanwhile, a Yinchorri patrol stumbles upon their Consular-class space cruiser and detonate the vehicle. However, they fail to find the Jedi occupants."}, {"tag": "p", "text": "Meanwhile on Yibikkoror, Master Giett's team fight off their Yinchorri pursuers, killing many of the enemy with their lightsabers. Master Gallia's Consular space cruiser arrived above the Yibikkoror balloon city but was unable to land due to a lack of space on the floating platform, which was already swarmed with throngs of hostile Yinchorri. Thus, the four Jedi stole a balloon in their attempt to reach the cruiser. Having reached its docking rig, they were greeted by the Zabrak Jedi Master Eeth Koth who managed to get the Padawan K'Kruhk, Masters Lilit Twoseas and Plo Koon inside. However, before Micah could get it, he came under attack from more Yinchorri donning flutter-packs. Micah then grabbed the balloon and made another jump while the cruiser moved downwards to allow him to descend down the docking rig. The two reunited Jedi teams then departed to Yinchorr to assist Jedi Masters Windu, Jinn, Tiin, and Padawan Kenobi."}, {"tag": "p", "text": "Back at the Jedi Temple on Coruscant, Masters Yoda and Yaddle received word from the Jedi teams that they had survived and would rendezvous on Yinchorr. However, the Jedi teams had been unable to find the Yinchorri command center. Yoda and Yaddle both sensed that something \"shrouded and obscured\" was influencing the Yinchorri Uprising from behind the scenes. The Human Jedi Master Soon Bayts then entered the room to inform his compatriots that Master Gallia's team had taken a Devaronian prisoner named Olmar Grahrk, the cousin of the smuggler Vilmarh Grahrk. That Jedi also speculated that the Devaronians had been engineering the Yinchorri unrest. Meanwhile, the Galactic Republic's Senate was still deadlocked over planning its response to the Yinchorri problem."}, {"tag": "p", "text": "At an unknown location of Coruscant, the Sith Lord Darth Sidious learnt about the capture of Olmar and informed his cousin Vilmarh. Sidious threatened the Devaronian with death if the captive Olmar revealed their secret plans to the Jedi. A desperate Vilmarh promised Sidious and his apprentice Darth Maul that he would make sure that his cousin would not disclose anything about the Sith's plans. Gallia's Jedi cruiser traveled to Yinchorr to reinforce Master Windu's team. However, the Jedi were unable to interrogate the captive Olmar since they were already nearing Yinchorr and the Yinchorri had just discovered Windu's hiding place."}, {"tag": "p", "text": "The Consular-class space cruiser arrived on Yinchorr in the middle of a battle between Windu's Jedi team and an army of Yinchorri. Since the Jedi were greatly outnumbered, Master Eeth Koth suggested a rescue mission to extract Windu's team. Gallia, Theen Fida and Tsui Choi would stay with the ship while the remaining Jedi would join the battle. Master Koth's Jedi succeeded in opening a second front and diverting the bulk of the Yinchorri force away from Windu's team who were holed up on a hill. Windu's team were then able to descend down the hill and rejoin Koth's team. During the fighting, Saesee Tiin immobilized a Yinchorri tank by killing its driver. While Koth's and Windu's teams were reunited, the Yinchorri force turned its attention to the Consular cruiser. During the melee, K'kruhk's master Lilit was killed by a Yinchorri. In retaliation, her enraged Padawan beheaded her attackers with his lightsaber."}, {"tag": "p", "text": "Back on Coruscant, the Supreme Chancellor Finis Valorum concludeds a crisis meeting with several Republic senators who agree to support a blockade and an embargo against the Yinchorri in return for keeping promises that he had made to them over the past five years. Following the meeting, Valorum contacted Master Yoda and expressed his weariness at having to make several concessions in order to gain the necessary votes to support military intervention in the Yinchorri system. Master Yoda sympathized with the Chancellor but commented that his sacrifice was necessary since it was small in comparison to the lives that the Order sacrificed during the mission. Koth and Windu's teams managed to return to the cruiser only to discover a bloodbath. While Gallia's team had managed to fight off their Yinchorri attackers, two Jedi had also been slain: Tsui's Padawan Fida and Master Twoseas."}, {"tag": "p", "text": "Windu ordered the Jedi to evacuate the bodies of their slain compatriots aboard the ship. He then ordered Tiin to prepare the cruiser for immediate takeoff and to send a transmission to Master Yoda. Upon arriving inside the ship, the Jedi found that Olmar had broken free of his bonds and had headed to the command bridge where he was contacting his cousin Vilmarh. He tried to get his older cousin to help him out and reported that one of the Jedi had been killed. However, Vilmarh was furious that his cousin had contacted him from the Jedi ship since the Jedi would be able to trace his signal and apprehend him. Master Choic apprehended the Devaronian."}, {"tag": "p", "text": "Meanwhile, Windu and the other Jedi recovered Lilit's body after fighting off several Yinchorri with the Force. The Yinchorri retreated but then regrouped to launch a second assault on the cruiser. Giett and Koon offered to stay behind and cover their retreat and were joined by Jin and his Padawan Obi-Wan. Windu agreed but reminded that their action was a tactical retreat rather than a last stand. He ordered the Jedi to join him as soon as they could since they did not want any further casualties."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}]}