{"url": "Jedi_Covenant", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Jedi organizations", "Category:Secret societies", "Category:Treasure keepers"], "nodes": [{"tag": "h1", "text": "Jedi Covenant"}, {"tag": "p", "text": "The Jedi Covenant was a secret organization of Jedi headquartered on Coruscant in the time of the Old Sith Wars. It was established after the end of the Great Sith War by Krynda Draay, who felt that it was her failing for not sensing the fall of Exar Kun to the dark side. The Covenant's goal was to use Jedi Consulars as Shadows to search for a shatterpoint that might lead to the resurrection of the Sith, and then take any action necessary to prevent that. The Covenant hated the Sith with a passion, which in itself was an aberration of the Jedi Code. They believed that had such an organization existed before the Sith War, they could have recognized the threat posed by Exar Kun when he was still a Jedi."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Founding"}, {"tag": "p", "text": "As the organization's founder, Krynda Draay had personally trained many, if not all, of its greatest Consulars. However, her obsession blinded her to the true threat when it eventually developed. She had a special interest in the Miraluka and was known to have several of them at her home at a time for teaching."}, {"tag": "p", "text": "The existence and motives of the Covenant remained unknown to the Order as a whole; even the membership of the Jedi Enclave Council and Jedi High Council were ignorant to its existence. However, Krynda had many allies throughout the Republic. Although she was no longer in the hold of the Order itself, many Jedi brought students to her to train; though she only accepted the most gifted. After the Sith War, Seers were hard to find, and when they could be found they needed to be trained by the best. Jedi from all over the galaxy brought students to the Draay Estate, and when they were trained they were allowed to enter the order on a trial basis and were often times accepted."}, {"tag": "h3", "text": "Padawan Massacre"}, {"tag": "p", "text": "There were no lengths to which the Covenant would not go in order to prevent the rise of the Sith. Such determination led to The Covenant's First WatchCircle—Feln, Q'Anilia, Raana Tey, Xamar, and Krynda's son Lucien— carrying out of the Padawan Massacre of Taris after the Tarisian Jedi Masters had a vision of the destruction wrought by the Mandalorian Wars, Jedi Civil War and the First Jedi Purge. It appeared to be carried out by a Sith Lord in red armor, a possible symbol that one of their Padawans would fall to the dark side, considering they were all wearing red environmental suits at the time the visions took place."}, {"tag": "p", "text": "The Padawan Massacre of Taris was executed, but was not completely successful, for one Padawan escaped. Much to their surprise Lucien's own Padawan, Zayne Carrick, was the survivor and the masters knew he had to die to completely ensure that their vision did not come true. After being captured by bounty hunter Valius Ying, Zayne was returned to the Jedi Tower. But again he escaped his fate with the help of Jarael who had disguised herself as the Sith Lord from the masters' visions. As a result, riots broke out on Taris and the Covenant was forced to withdraw to Coruscant. But before leaving they received a message from Zayne assuring them that he would hunt down each of them, only sparing the one who confessed and cleared his name of the atrocity they committed. He also told them that if he did indeed bring about the Jedi Order's demise, they were to remember that it began with them."}, {"tag": "h3", "text": "First WatchCircle separated"}, {"tag": "p", "text": "The members of the Covenant returned to Coruscant and attempted to meet with their leader and associate, Krynda Draay, but were denied entrance to her estate. Later, they met with the Jedi High Council; a meeting in which Vrook Lamar ordered that they be separated due to the events that had transpired on Taris, although the Council did not know of the masters' specific acts."}, {"tag": "p", "text": "During their separate missions, several Covenant members were experiencing visions of very terrible events: Q'Anilia sensing the many deaths on Serroco, Raana having nightmares of Zayne's possible revenge, and Lucien being betrayed and captured by his old friend, Arkoh Adasca, who reunited him with Zayne on Omonoth. Zayne later escaped back to Taris after Adasca was killed by his family's own creation."}, {"tag": "p", "text": "When Zayne returned to Taris, Raana had beat him to the punch and ordered Shad Jelavan's younger sister, Shel, to kill Zayne. However, the Taris Resistance needed everyone to help drive the Mandalorians away from the planet, even fugitives like Zayne. Raana disagreed with having a \"future Sith\" as a comrade. Raana was the first of the Covenant to die, having been caught in the explosion of the Jedi Tower on Taris."}, {"tag": "h3", "text": "Muur Talisman"}, {"tag": "p", "text": "Zayne then met an agent of the Covenant named Celeste Morne. Morne was ordered by Lucien to kill Zayne, but she couldn't do it after seeing Zayne risk his life to save others. After she fell under the control of the Muur Talisman, Zayne chose to help Morne by putting her in stasis until he could get her some help. Before being put into stasis, Morne asked Zayne to reach Krynda and stop the Covenant's corruption, believing that she wouldn't have allowed the massacre on Taris. Zayne then resolved to end the Covenant once and for all."}, {"tag": "h3", "text": "Odryn"}, {"tag": "p", "text": "On Coruscant, Haazen (former \"failed\" Padawan of Arca Jeth, servant of Barrison Draay, close associate of Barrison's wife Krynda Draay, member of her Jedi Covenant and the former mentor of her son) was able to get Lucien on the Jedi High Council so the Covenant's agents could move about freely."}, {"tag": "p", "text": "With his companions, Zayne traveled to Odryn, where the Sanctum of the Exalted, a storehouse of Sith artifacts, was located. He and Marn Hierogryph took as much evidence as they could to expose the Covenant. They were captured by the locals, and were imprisoned in the Sanctum. Feln arrived there and destroyed the Sanctum when he heard that Zayne's allies were returning. His arrogance cost him his life as his own people turned on him and killed him. Zayne left the planet with several Sith artifacts that the Moomo Brothers had smuggled onto their ship when they dropped Zayne off in the first place."}, {"tag": "h3", "text": "Endgame"}, {"tag": "p", "text": "Zayne headed to Coruscant and, after dodging a Republic fleet that was charged with destroying his ship, Zayne and Gryph landed on the planet. But they were soon apprehended by Xamar. But this proved to be a blessing: Xamar confessed to the Jedi Council that Zayne was innocent shortly after capturing him. Xamar realized that the Rogue Moon Prophecy was coming true, and wanted to ensure Krynda would be safe from it."}, {"tag": "p", "text": "Xamar brought both Gryph and Zayne (disguised as a Dark Jedi) to the Draay Estate as part of a plan to get Krynda to safety. After Zayne was revealed to working for the Jedi Council, members of the Order stormed the Estate. Haazen, who was really a servant of the Sith, chose this moment to make his move: he usurped leadership of the Covenant from Krynda and ordered the Covenant Jedi to destroy the Jedi High Council, claiming it to have been influenced by the dark side and ordered them to capture the Council's cache of Sith artifacts. He also took control of the Republic fleet in orbit through a flaw in the Vanjervalis Chain, having them fire on the Jedi Knights, instigating a civil war between the Jedi that began to destroy Coruscant. Once Haazen had gained the artifacts, he slew the couriers and prepared to destroy the Jedi Council so that an emergency Council would be formed under his command. But when Zayne and Lucien tricked and killed him, the Covenant was ultimately dissolved."}, {"tag": "p", "text": "The existence of the Covenant taught the Jedi Council the dangers of having cabals from within their own Order and furthered their opposition to the Revanchists."}, {"tag": "h3", "text": "Wasted efforts"}, {"tag": "p", "text": "Unknown to the Covenant, long before the Great Sith War, the Sith were not entirely destroyed as they, the rest of the Order, and the Republic had believed. After being driven from Korriban in the waning hours of the Great Hyperspace War, remnants of the original Sith Empire had slipped into uncharted space and had been reorganized and restrengthened under their new leader. For over a thousand years, the Sith remained hidden until their surprise attack on the Republic."}, {"tag": "p", "text": "The Covenant was also unaware of the Lost Tribe of Sith, descendants of the crew of the Omen who crashed on Kesh during the Great Hyperspace War. When former Covenant Shadow Jelph Marrian discovered this by accident in 3960 BBY, he attempted to warn the Republic, but was chased off by Sith Saber Orielle Kitai and his starfighter was destroyed, leaving him trapped."}, {"tag": "h2", "text": "Organization"}, {"tag": "h3", "text": "WatchCircles"}, {"tag": "p", "text": "The Jedi Covenant was composed of several WatchCircles that specialized in different types of visions. The five Masters of the Taris Jedi Tower—Lucien Draay, Q'Anilia, Feln, Xamar, and Raana Tey— were known as the First WatchCircle. The first four were among the greatest Consulars of the Jedi Order, and were apparently the premier prognosticators of the Covenant while Lucien served as its \"hand.\" Another Watchcircle was known as \"WatchCircle Vodo\", though it was felt among some of the masters that they were not as effective."}, {"tag": "p", "text": "The Economic Study Circle was a group of seers used by the Covenant to study changes in the Draay Trust's stocks and to protect it from bankruptcy."}, {"tag": "p", "text": "Apart from the Seers, the Covenant also had agents known as Shadows; in which all records of their existence had been erased and were known only to a few of the Covenant's members. The Shadows were used to hunt Sith treasures, one of which was the Muur Talisman on Taris. Shadow Celeste Morne was known to have destroyed the last copy of the Epistle of Marka Ragnos, and recovered Jori Daragon's amulet and the Eye of Horak-mul. Any retrieved items had a microtag attached to them and were distinctive Covenant Identichips. This was only after these artifacts were coated in Nullification resin."}, {"tag": "p", "text": "Failed Padawan Haazen was taken under the wing of Krynda and became her Hand; serving to maintain the Draay Trust and to employ contacts and resources to keep the Covenant functioning."}, {"tag": "h3", "text": "Executors"}, {"tag": "p", "text": "The different WatchCircles were led by a single Jedi Guardian who was given the title of Executor and acted as a facilitator that managed the logistical details so that the group could perform their duties. They were chosen from those that lacked the capacity for precognition in order to ensure that such individuals did not alter the findings of the WatchCircle that they oversaw. In addition to this role, they also reported any findings of the WatchCircle to Haazen as well as gave a report on their activities. Furthermore, they also acted independently where they provided general security duties to the Jedi Covenant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}