{"url": "Jedi_High_Council_(New_Jedi_Order)", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:NPOV disputes", "Category:Galactic Alliance organizations", "Category:Jedi Councils", "Category:New Jedi Order organizations"], "nodes": [{"tag": "h1", "text": "Jedi High Council  (New Jedi Order)"}, {"tag": "p", "text": "The Jedi High Council, formerly known as the Masters' Council, was the leading body of the New Jedi Order founded by Luke Skywalker. As of 35 ABY, the Masters' Council had formed as an informal body responsible for the leadership of the Order. However, at the conclusion of the Swarm War, Grand Master Skywalker formed an official High Council, from the loose collection of Jedi Masters, that mirrored the Council of the Jedi Order of the Galactic Republic. Both the Masters' Council and its successor consisted of the Order's twelve wisest and most powerful Masters."}, {"tag": "h2", "text": "History of the High Council"}, {"tag": "h3", "text": "Masters' Council"}, {"tag": "p", "text": "During the early years of the reformed Jedi Order, Master Luke Skywalker had refrained from creating a High Council and from basing their operations on Coruscant; with knowledge of past corruption, Skywalker hoped he could avoid creating a body that would be the puppet of the galactic government. However during the Dark Nest Crisis a schism threatened to rip apart the fledgling Order as infighting prevented any decisions from being made and unruly Knights began to do things that did not benefit the Order's public standing. Forced to take control, Skywalker declared himself Grand Master at a conclave within the Ossus Academy and ordered any Jedi who could not put the Order first to resign. To assist him in his leadership position, Skywalker created the twelve member council that mirrored its predecessor from the Old Republic. Unlike the old Council however, the body was not as formal and did not take absolute control of the Order for the first few years. Convening in chambers on Ossus and within the Temple on Coruscant, the Council met with the two Joiner Knights sent by UnuThul to persuade the Masters' Council to assist the Killiks in a border conflict with the Chiss Ascendancy. Uncovering the existence of the Dark Nest, Gorog, which was manipulating the conflict without the knowledge of UnuThul and the rest of the Colony, the Council dispatched Grand Master Skywalker, and Masters Mara Skywalker and Saba Sebatyne to destroy Gorog. Aided by Knight Leia Solo and several other Jedi, the Masters ended the conflict."}, {"tag": "h3", "text": "Jedi High Council"}, {"tag": "p", "text": "Following the events of the Swarm War and the way it was instigated by rogue Knights, Grand Master Skywalker decided that a more authoritative High Council was necessary. Taking the formal Council chamber on Coruscant as the permanent meeting place of the group, the Masters' Council was formalized into a High Council and began forming its close ties with the Office of the Chief of State."}, {"tag": "p", "text": "Making decisions on behalf of the Order, the number of Knights during this time flourished and began to grow to numbers comparative to those before the Great Jedi Purge. Recovering lost information and texts, the Council drew on the teachings of the old Order to better the curriculum at the academy. In 40 ABY, after the Telos Holocron was recovered, many Jedi feared that there may be attempts to steal it. Calling it to a vote, nearly half the Council suggested destroying it; though the motion was struck down and the artifact locked away in the Temple vaults."}, {"tag": "p", "text": "When the Second Galactic Civil War erupted, the High Council was largely ineffective, as it failed to prevent the fall of Jacen Solo to the dark side. Catering to Grand Master Skywalker's wishes, the Council was constantly rendered inert as it clashed with Chief Cal Omas and each other. With Dark Lady Lumiya orchestrating events, Dark Jedi Alema Rar on the loose, and a conflicted membership, the Council was unable to prevent the death of countless Alliance personnel, citizens, and two of their own: Masters Tresina Lobi and Mara Skywalker. With the Grand Master's wife dead and his son under the pall of the corrupt Colonel Solo, the Council failed to take action when Galactic Alliance Guard members infiltrated the Temple itself in an attempt to arrest Knight Leia Solo and her husband Han. When Chief Omas was assassinated and replaced by Colonel Solo himself, the Alliance government constantly harried the Order by attacking the Ossus Academy which nearly saw the death of Council members Kam and Tionne Solusar. When Colonel Solo began to burn Kashyyyk, the Council finally withdrew from the Alliance and went into exile on the Sanctuary Moon of Endor. With the help of Alliance personnel under Admiral Cha Niathal's command and the fleets of Imperial Grand Admiral Gilad Pellaeon, the newly formed Coalition eventually brought an end to Solo's regime and took back the Alliance."}, {"tag": "p", "text": "Following that conflict, the Order helped install former Admiral Natasi Daala as Chief of the Alliance and Captain Jagged Fel as Head of State of the Galactic Empire. During Chief Daala's tenure, she ordered the arrest of Grand Master Skywalker on the charges of dereliction of duty for not preventing Colonel Solo's rampage. Instead of being imprisoned, Skywalker negotiated a deal with Daala; Skywalker would go into exile, cutting off all ties with the Order until he could discover what had cause Solo's mania. In his stead, Council member Kenth Hamner would take up the mantle of Grand Master and lead the Order until the time that Skywalker could return. Agreeing to the terms set forth, Daala was appeased until several Knights began to be overcome with an enigmatic psychosis. Deeming them a threat to civilization, Daala ordered their arrest and began a campaign against the Jedi to recover the supposedly insane Knights. Freezing Council member Corran Horn's two Jedi children in carbonite, Daala continued to stand unopposed by the Council, as Grand Master Hamner encouraged patience. When Daala instigated a Mandalorian siege on the Temple which resulted in the cold-blooded murder of Jedi Kani Asari, the High Council continued to grow impatient with Hamner's stance of inaction."}, {"tag": "p", "text": "When Hamner made a secret deal with Admiral Nek Bwua'tu to end the siege, the Bothan was attacked and fell into a coma. While waiting for him to awaken, the Knights under medical watch recovered, while a slave revolt broke out on the Outer Rim. With so much happening at once, Hamner became completely overwhelmed, and when the High Council learned of his secret agreement with Bwua'tu which had kept them trapped in the Temple, the High Council dismissed him as Grand Master and ordered him to his chambers for confinement. Completely hysterical, Hamner attacked his guards and hid amongst the catwalks of the Operations Hangar in preparation to strike down his opposition amongst the Council. Attacking Master Saba Sebatyne, Hamner engaged in a fierce duel, eventually impaling the Barabel with his lightsaber. To late to gain the trust of the other Jedi in the hangar preparing to launch their StealthXs to aid the imperiled Master Skywalker, Hamner attempted to take out the hangar doors but was stopped by Sebatyne, who defeated the former Grand Master by blasting him off a catwalk with the Force. As she tried to stop his lightsaber strike on the hangar doors telekinetically, Sebatyne was forced to release her Force grasp holding Hamner aloft, who then plummeted to his death several meters below. Following Hamner's death, Sebatyne reluctantly became the Order's acting Grand Master."}, {"tag": "p", "text": "Nearly a century later, the High Council continued to preside over the Order's affairs, with Grand Master Skywalker's descendant, Kol Skywalker, as its leader. However, with the Imperial victory during the Sith–Imperial War and the subsequent Massacre at Ossus, the Jedi Order was decimated, and the High Council scattered. Fleeing extermination, three Masters reconvened the august body within the halls of the Hidden Temple of Taivas. Made up of three Masters, T'ra Saa, Tili Qua and K'Kruhk, the Council was dedicated to rebuilding the Order. When an Imperial delegation of the Fel Empire discovered the Temple's location, the Council received them to discuss an alliance. During the same meeting the Council listened to Cade Skywalker's plans to assassinate the Emperor and Sith Lord Darth Krayt. After meditating on the consequences of joining with Roan Fel and wiping out the Sith leadership, the Council decided that only the former option was the best way to proceed. Arguing that killing Krayt would only cause more dangerous factions to arise, the Council was more determined to wait patiently as the Order grew strong enough to strike at the Sith."}, {"tag": "p", "text": "After the apparent death of Darth Krayt the Jedi Council felt it was time again to take part in the struggle against the Sith. To this end they sent Te Corso, Sayar Dun'La, Asaak Dan, and Drok to meet with Admiral Gar Stazi and form an alliance with him."}, {"tag": "h2", "text": "Organization and politics"}, {"tag": "p", "text": "Unlike the Council of the Old Order, originally Grand Master Skywalker intended it to serve as an advisory body that would assist in guiding Knights to where they needed to go. However, this structure failed when wayward Knights nearly dragged the Order and the Alliance into all out war with the Chiss Ascendancy on behalf of the Killik Nests. After some reform the High Council became the unquestioned leader of the Order, assigning missions and expecting reports afterward. Like the old Council, this body worked closely with the executive branch of the galactic regime, advising and assisting the Chief of State of the Alliance on important diplomatic matters. Membership on this august body was limited to twelve Masters at a time, with each member appointed by unanimous vote of the current members. It was not unheard of that seats would remain unfilled for an extended period of time; following the deaths of Mara Jade Skywalker and Tresina Lobi, their seats remained vacant for years. With the death of Kenth Hamner in 44 ABY, the Council had only nine sitting members."}, {"tag": "p", "text": "Convening with the austere High Council Chamber in the Coruscant Temple, the Masters elected one of their own to serve as secretary during the early years after the Swarm War. Not infrequently, the High Council would request the presence of any available Master, bringing in extra chairs to suit the needs of those in attendance."}, {"tag": "p", "text": "The relationship between the High Council and the Alliance government was often tense, and a matter of contention within the Council. Some Masters, such as Corran Horn and Kenth Hamner, believed the Order was primarily responsible to serve the needs of the Alliance, which funded the Order during, including the actually reconstruction of the Temple following the Yuuzhan Vong War. Others, including Mara Skywalker and Kyp Durron, believed that giving preference to the Alliance's interest made the Jedi nothing more than mercenaries, and that the Jedi should preserve peace without favoritism, even at the expense of the Alliance. Despite their official stance, the Galactic Alliance bureaucracy came to see the Jedi as their own private diplomatic corps and police force. Both sides were convinced that they were in the right, with some arguments coming close to being decided at saber-point, and it was only Master Skywalker's moral authority that kept the Council from splitting violently."}, {"tag": "h2", "text": "Known members"}, {"tag": "p", "text": "Those Jedi who attained the title of Master of the Order or Grand Master are listed in bold."}, {"tag": "p", "text": "As of 138 ABY:\n(†=confirmed death);\n(ω=Also a member of original Jedi Order)"}, {"tag": "h3", "text": "New Jedi Order era/Early Legacy era (35 ABY–44 ABY+)"}, {"tag": "h3", "text": "Late Legacy era (130 ABY–138 ABY)"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}