{"url": "Jedi_Initiate_Trials", "categories": ["Category:Legends articles", "Category:Ceremonies", "Category:Jedi culture"], "nodes": [{"tag": "h1", "text": "Jedi Initiate Trials"}, {"tag": "p", "text": "The Jedi Initiate Trials were the tests by which Jedi Initiates were given as prerequisite in order to progress to the level of Padawan within the Jedi Order. Like the Trials of Knighthood, these tests were required to be taken by all students in order to proceed to the next rank in the Jedi Order."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "During the days of the old Order, the Initiate Trials were begun as tests used to gauge an Apprentice's progress in the Order. Often times, because a Master might have two or more students under their tutelage, the test would be given simultaneously. Because of the less restrictive age discrimination rules of the era, the test was often taken by students well into their teens or even twenties, depending on species' maturation stages. As the Order evolved and war ceased to plague the galaxy, some of the tests changed to suit the non-militaristic and more formalized academy on Coruscant."}, {"tag": "p", "text": "The first test was designed to test one's knowledge of the Jedi Code. A vital part of Jedi teachings, the Code was reviewed over and over throughout an Initiate's life, typically everyday during meditation or class. If an Initiate did not memorize the mantra, then they would no longer be a member of the Order."}, {"tag": "p", "text": "The second was not consistent throughout the Order's history. Originally, the test consisted of lightsaber construction using crystals provided by the master. As the Order came into a new era following the Ruusan Reformation, the trial was altered to test self-discipline. Demonstrating competency through meditation or staged lightsaber combat with a hood, this test was not so much a demonstration in skill so much as technique."}, {"tag": "p", "text": "For the third and final trial, a great difference existed between the Jedi who fought in the New Sith Wars and those raised during the Golden Age of the Old Republic. Because of the lack of age restrictions seen early on in the Order's history, sometimes Initiates would be assigned to perform a specific yet simple task, such as solving a judicial case or providing aid to a citizen in need. The Jedi Council of Dantooine required Initiates in the Order to complete a task to see the dark side for themselves and find a way to conquer it. A famous example of this is the Trial of Revan, to locate and redeem the fallen Cathar apprentice Juhani. During the glory days of the Republic, Initiates were asked to prove that their connection to the Force was strong and that they were capable of meeting the standards of being a Jedi."}, {"tag": "p", "text": "Following the successful completion of each of these tasks, an Initiate would follow one of three paths. Most Initiates went on to be chosen as a Padawan by a Knight or Master. To gain the attention of a potential master, students participated in the annual Apprentice Tournament at the Jedi Temple so that they could exhibit combat skill and Force talents. On the other hand, some students were never chosen and were then sent to the Jedi Service Corps by order of the Council of Reassignment. While still members of the Order, these students did not continue training in the Force, instead using their limited abilities to aid the galaxy from a grass-roots level. The third option left open to an Initiate is to leave the Order. Some may not be content with life in the Service Corps, or the High Council may not see them walking the Jedi Path. Should this be the case, the Order recommends a student walk away in peace, and use what they had learned to better society."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}