{"url": "Jedi_Initiate/Legends", "categories": ["Category:Legends articles", "Category:Jedi ranks", "Category:Jedi trainees", "Category:Jedi trainees of the New Jedi Order"], "nodes": [{"tag": "h1", "text": "Jedi Initiate"}, {"tag": "p", "text": "A Jedi Initiate, Jedi Trainee, or Youngling referred to a Force-sensitive child who was undergoing the early stages of Jedi training at a Jedi academy. In the Old Order, the term was used to denote members of the Order from the time they joined communal learning group known as a clan, until the time they passed the Initiate Trials and were selected by a Jedi Knight or Master for one-on-one training as a Padawan. During peacetime when the academy functioned on a standard teaching regimen, Initiates' training was restricted to the academy at which they were based, rarely venturing outside of its walls. Youngling was a term that existed in Galactic Basic Standard to refer to a child in a species-neutral way; the term was often used affectionately by the handlers that oversaw Initiate training."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Because the Order was comprised of many different species that matured at different rates, the rank of Initiate was not given at a certain age, but when an individual reached the maturity to begin formal education at the academy. While still in infancy, the Jedi fosterers that oversaw the care of the babies would foresee where an individual belonged and would organize the soon-to-be-Initiates into clans. These clans stayed together day and night, learning, eating, and sleeping together from around the age of three standard years until they were chosen as a Padawan around adolescence."}, {"tag": "p", "text": "During the Order's early years and those years following reform or a purge, the Initiate stage did not exist, or if it did, it was not the prime source of future Knights. During these times, any individual with an affinity with the Force would be accepted by a Master and taught. During the New Sith Wars, Knights and Masters actively collected Force-sensitives as they moved from campaign to campaign and taught them the militaristic style of the Army of Light. When formal teaching resumed, however, clans were formed and the High Council enforced the age restrictions that aided in the indoctrination process."}, {"tag": "p", "text": "After enjoying a Golden Age, the Order and the Republic were destroyed following the end of the Clone Wars, a war created through the machinations of a Dark Lord of the Sith, who had led the Confederacy of Independent Systems as Darth Sidious and the Republic as its Supreme Chancellor. While most of the academy's members were slaughtered during the initial execution of Order 66, a standing order was put in place within the Galactic Empire's Stormtrooper Corps demanding that all Initiates found during the Imperial Period be captured alive for interrogation and torture. While some Initiates escaped the initial stages of the Purge, most were later hunted down by the Galactic Empire and killed or converted to the dark side of the Force."}, {"tag": "p", "text": "As the Order was rebuilt by Luke Skywalker during the reign of the New Republic, he tried to come up with an appropriate way of teaching students without anything to start from. After finding a few surviving holocrons, Skywalker began to introduce some of the Old Order's methods, but out of necessity, Skywalker refrained from imposing the age restriction until the Order had a large number of Masters and Knights in its service."}, {"tag": "h3", "text": "Youngling Clans"}, {"tag": "p", "text": "Upon arriving at the Temple, Initiates were sorted into one of a host of clans by fosterers who used the Force to place each child. Each clan was made up of about ten Initiates who lived and studied together for a little over a decade. Each clan was tended to by a trained instructor who would lead their charges in the early exercises, guide them to meals in the refectories, and ensure that they were assimilating well into Jedi life."}, {"tag": "p", "text": "When the Order was rebuilt following the Galactic Civil War, Luke Skywalker did not initially form clans, a fact he thought may have led to the defection of two of his first students. Following his recovery of a copy of The Jedi Path, Skywalker launched the Ronto and Veermok Clan, the first of many clans that would be formed during the New Order."}, {"tag": "h3", "text": "Instruction"}, {"tag": "p", "text": "Upon entering into a clan, Initiates would begin basic training in the Order's academy. Morning rituals consisted of Force studies, leading into the midday political science classes and the study of the histories of a thousand worlds and cultures. Following a midday meal, clans engaged in mandatory physical training, honing the Initiate's body into prime condition. In addition to classes, students were required to set aside time for five mandatory meditation sessions each day. Every new class of students began their education with the teaching of the Jedi Code and the Three Pillars--the Force, Knowledge, and Self-Discipline. It was these pillars that would support each individual as they moved through their lives. In addition to class-specific course material, each Jedi was given a copy of the guidebook, The Jedi Path: A Manual for Students of the Force. Aside from their class work, students were expected to know the layout of the Temple by heart, as well as the names and histories of the Jedi memorialized in the Temple. It was vital that Jedi be not only aware of their history, but intimately familiar with the tradition and philosophies of the Order."}, {"tag": "p", "text": "Drawing upon each other for assistance as they studied and practiced together, clan-mates were meant to view each other as family as they learned the Jedi ways. In their studies in the Force, Initiates were first taught the ideas of Control, a set of abilities which require self-control. While not the most exciting abilities a Jedi will ever learn, they are necessary building blocks in the progression to mastery. It was mastery of this ability that added several decades onto a Jedi's life, preventing decay and illness that would kill other beings. Before a student could begin their training in the art of the lightsaber, they first had to prove themselves in their other classes; otherwise, they would not progress to wield a weapon. When learning the Third Pillar, Initiates were first instructed to learn more advanced meditation forms so as to discipline one's mind for battle. Following courses in the six levels of lightsaber combat, students would be ready to take the Initiate Trials. Failure was not acceptable, and while the Trials could be repeated, an Initiate could not train for an additional year at the academy. One had to progress, or leave the path of the Jedi."}, {"tag": "p", "text": "The Initiate Trials were given when an Initiate had completed their initial training at the academy. The Trials consisted of three main tests: a demonstration of knowledge of the Jedi Code, observation of meditation and dueling technique, and fluidity in Force wielding. While all Initiates were required to take the examination, not all passed the tests. If one was not to become a Padawan, the Reassignment Council would intervene and place the individual in the Jedi Service Corps where they would continue serving the Order through tasks that did not require skill with a lightsaber or expertise with the Force. A third option was left open for those students that the High Council deemed unfit to walk the Jedi Path. Students could come to their conclusion themselves and walk away, using their skills learned at the academy to make the galaxy a better place through a civilian's work."}, {"tag": "h3", "text": "Dress"}, {"tag": "p", "text": "Like the rest of the Order, Initiates had a standard dress code that was encouraged by the High Council. As representatives of the Order, Initiates were expected to wear some form of uniform from the time they could walk. Like the standard attire of Padawans, Knights and Masters, Initiates were given tan or gray tunics and pants with accompanying brown leather boots and a belt. The uniform's condition was to be maintained by the individual, and although laundry facilities did exist at the Temple, they were to be used in addition to daily cleaning."}, {"tag": "p", "text": "Because not all Jedi were humanoid, those with a body structure or composition that did not allow for full coverage were permitted to wear a sash at the least. Casting off the flashy colors or soft fabrics of the outsiders, Jedi were meant to be and appear humble, not only representing their own values, but those held by the entire Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic, before Revan becomes a Padawan again in the Jedi Enclave of Dantooine, he is referred to as an apprentice and not an initiate. This choice of words is peculiar; at that point the amnesiac Revan had not yet achieved Padawan rank and is therefore still an initiate, not an apprentice. Nevertheless, not only is it likely that the term is employed colloquially without regard for Revan's specific rank (as part of the byplay that takes place during the initial conversations with the Jedi Council), but also because Revan had been trained to the level of Jedi Knight before, as was revealed later in the game. It is also probable that he was given this rank due to his age, which was well beyond the limit for a typical Jedi Initiate."}, {"tag": "p", "text": "In the Jedi Knight series of first-person shooter games (Star Wars: Jedi Knight II: Jedi Outcast, Star Wars: Jedi Knight: Jedi Academy, etc.), Jedi Initiate is also used in references to some gameplay mechanics, particularly in multiplayer difficulty modes and the skill of \"bots\" used in matches."}, {"tag": "p", "text": "The Clam Clan was an Old Order clan that was not canon; it was introduced in the comic, Tag & Bink: Revenge of the Clone Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}