{"url": "Jedi_Initiate", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Jedi ranks", "Category:Jedi trainees"], "nodes": [{"tag": "h1", "text": "Jedi Initiate"}, {"tag": "p", "text": "Jedi Initiates, also known as Jedi younglings, were Force-sensitive children recruited by the Jedi Order from various species across the galaxy. At an early age they began their initial lessons in the Jedi arts at the Jedi Temple on Coruscant, although their training also extended to the planet Ilum where younglings were required to undergo a sacred rite of passage known as the Gathering where the younglings would claim their kyber crystal to use in their lightsaber. Before the time came for a youngling to advance to a higher degree of education, Grand Master Yoda served as an instructor in the ways of the Force to all younglings in the course of his long career. In order to qualify for the rank of Padawan, younglings had to complete a series of tests—the Initiate Trials—in order to become apprenticed to more experienced Jedi such as Knights and Masters."}, {"tag": "p", "text": "Over the course of the Clone Wars, the Jedi Order's future was threatened by machinations of Darth Sidious the Dark Lord of the Sith and nemesis of the Jedi. Seeking to train a force of dark side acolytes who would serve as his enforcers in the New Order, Sidious orchestrated the abduction of several Force-sensitive infants who were chosen to become Jedi younglings. The Jedi succeeded in foiling his plot, however. Yet despite their efforts to safeguard the next generation of Jedi, the younglings perished along with the majority of the Jedi Order as a result of Order 66 and the subsequent rise of the Galactic Empire."}, {"tag": "h2", "text": "Overview"}, {"tag": "h3", "text": "Future of the Jedi"}, {"tag": "p", "text": "The Jedi Order, a monastic organization dedicated to the preservation of peace and justice in the Galactic Republic, recruited its members shortly after birth. Utilizing blood tests to estimate the midi-chlorian count of prospective students, the Order was able to identify Force-sensitive younglings of various species throughout the galaxy. Before their training, younglings were frequently only skilled in a single aspect of the Force, while they would begin to advance in others once their training began. After their sensitivity to the Force was confirmed, the infants or young children were brought to the crèche of Jedi Temple on Coruscant, where they were to live until they were chosen to become a Padawan. There they quickly learned that their true family was the Jedi Order."}, {"tag": "p", "text": "The Jedi maintained a list pertaining to confirmed Force-sensitive infants, particularly their identities and locations. Due to the children's importance to the future of the Jedi, the High Council went to great lengths to keep the list's contents internal to the Order. The list itself was contained within the kyber memory crystal which could only be accessed through a holocron, an informational device stored within the vaults of the Temple. Only a Force-sensitive, trained in the use of telekinesis, had the ability to combine the crystal with a holocron. The crystal itself was entrusted to a member of the Order who served as its keeper."}, {"tag": "h3", "text": "Youngling clans"}, {"tag": "p", "text": "Jedi younglings were divided into ten clans consisting of approximately twenty students. Among these groups was Bear Clan, a class of younglings between the ages of four and eight. The youngling clans would remain as one unit, living and training together, until the time came to go their separate ways as Padawan learners. The younglings who were not chosen to become Padawans were supervised by the Council of Reassignment."}, {"tag": "h3", "text": "Instruction"}, {"tag": "p", "text": "Upon joining a clan, younglings began their basic training in the Jedi arts. Their lessons included various tests and rituals that had to be completed in order to advance to the higher levels of the Jedi arts. Between the ages of four and eight, younglings acquired the basic skills of lightsaber combat using low-powered training sabers to practice the deflection of blaster shots fired by training droids."}, {"tag": "p", "text": "The next step in their progress as aspiring Jedi was the construction of a genuine lightsaber—the signature weapon of the Jedi which first required a kyber crystal. This lesson ultimately led to the creation of the Gathering; an ancient and significant tradition that began centuries before the events of the Clone Wars, the Gathering tested the younglings' ability to locate their particular crystal through the Force. It required younglings to travel offworld from the Jedi Temple on Coruscant to the Crystal Cave of Ilum, a frigid world located in the Unknown Regions and most sacred to the Jedi Order. After acquiring their crystal, the younglings had to use the Force to telekinetically combine all of the necessary components into a lightsaber."}, {"tag": "p", "text": "For almost a millennium of the Jedi Order's history, all younglings were trained by Yoda, the ancient Grand Master who also served as an instructor in the Jedi arts for eight centuries by the time of the Clone Wars. Yoda provided the younglings with a beginner's education in lightsaber combat, a practice which incorporated lessons on using the Force to guide and enhance their reflexes. In addition to teaching the basic skills of lightsaber combat, Yoda also served as a guide for younglings who participated in the Gathering."}, {"tag": "p", "text": "Tera Sinube, another ancient Jedi Master, also took on the responsibility of overseeing the younglings' development as lightsaber duelists. In addition to guiding the development of their students, it was the Master's prerogative to introduce a Padawan as a guest lecturer to a youngling clan. The task of educating younglings in the proper construction of a lightsaber was the duty of Huyang; an architect droid professor based out on the Jedi vessel, the Crucible, he personally oversaw the creation of lightsabers by younglings of a thousand generations—a record which included the one-time youngling Yoda."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the Sith arranged for the theft of both a holocron and the memory crystal in order to abduct members of the Jedi's next generation. Darth Sidious, the Dark Lord of the Sith publicly known as Supreme Chancellor Sheev Palpatine, intended to use the younglings in an experimental procedure to create a force of dark side adepts that would serve him in the New Order. However, the plan was thwarted by the efforts of the Jedi, particularly the Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, both of whom rescued the children from captivity."}, {"tag": "p", "text": "Later, Skywalker became instrumental in the fall of the Order following his seduction to the dark side as the Sith Lord Darth Vader. With the initiation of Order 66, Vader led a military assault on the Temple at the behest of his new Master, who commanded him to spare none of his former comrades. This command extended to the younglings, a group of which were confronted in the High Council Chamber by Vader. One boy, recognizing Skywalker and thinking he was still a Jedi Knight, asked him what they should do against the overwhelming number of clones, but Vader did not respond and instead slaughtered the children. In the aftermath of the Galactic Empire's rise to power, the majority of Jedi were slain along with the youngest of their brethren, resulting in the destruction of the next generation of the the Jedi Order."}, {"tag": "p", "text": "Despite the loss of the Order, the remnants of the Jedi endured throughout the Dark Times, surviving both the Sith and their Empire. However, the survivors elected to remain secret, so many Force-sensitive children were left in the galaxy without the chance of becoming Jedi. When the Empire located any Force-sensitive children, they were taken by Vader or members of the Inquisitorius to be made part of Project Harvester, fulfilling Sidious's plan from the Clone Wars."}, {"tag": "p", "text": "After the fall of the Empire, the Jedi Order was reborn as a new, albeit short-lived, generation under Jedi Master Luke Skywalker. The Jedi practice of recruiting younglings also served as inspiration to Commandant Brendol Hux, an Imperial Academy instructor who greatly admired the training methods of both the Jedi Order and Grand Army clone troopers. His illegitimate son, General Armitage Hux, incorporated his father's views into the military training program of the First Order, causing an entire generation to become stormtroopers—super soldiers programmed from birth and exceptionally trained in Armitage's view."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jedi younglings were first introduced in the 2002 film Star Wars: Episode II Attack of the Clones, the second installment of the Star Wars prequel trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}