{"url": "Jedi_Praxeum", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:Jedi academies", "Category:New Jedi Order locations", "Category:Yavin 4 locations"], "nodes": [{"tag": "h1", "text": "Jedi Praxeum"}, {"tag": "p", "text": "The Jedi Praxeum, also known as the Jedi Academy, was an academy that was founded by Jedi Master Luke Skywalker on Yavin 4 in 11 ABY during the era of the New Republic."}, {"tag": "p", "text": "The ancient Jedi scholar Karena coined the term praxeum to describe a Jedi academy as a place for the \"distillation of learning combined with action.\" In the days of the Galactic Republic, well-known praxeums included those on Teya IV, Arkania, Ossus and Dantooine."}, {"tag": "p", "text": "Inspired by the parting words of Obi-Wan Kenobi and the several Force-sensitive individuals he had encountered, Skywalker began planning for a unique institution where new and old Jedi could learn together."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Students at the Praxeum trained in the ways of the Force, learned to defend themselves with a lightsaber, and studied diplomacy, history and more."}, {"tag": "p", "text": "Most of the Jedi in Skywalker's Jedi Order were trained at the Academy and learned somewhat directly from him, although most were trained by the battlemaster of the academy, Kyle Katarn. The Jedi Praxeum, wherever it was, tended to be a base of operations for the Jedi, and often a home when they were not performing other jobs for Master Skywalker or going about their personal lives."}, {"tag": "p", "text": "Skywalker was known to leave the Academy in times of crisis to help the New Republic, leaving it in the capable hands of Streen, or Kam and Tionne Solusar."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Layout"}, {"tag": "p", "text": "Once the project was sanctioned by Chief of State Mon Mothma, Skywalker asked Leia Organa Solo to come up with a location to set up the academy. Mon Mothma suggested Yavin 4 to Organa Solo, who in turn recommended it to Skywalker. Skywalker agreed that Yavin 4 was the perfect location. He decided to set it up in the Great Temple that housed the earlier Alliance base at the time of the Battle of Yavin. Internally, the Praxeum made use of the four level design of the Great Temple, with each floor making up a step of the ziggurat. Thus, all floors were based on similar plans with small cells, chambers and corridors around a large central space."}, {"tag": "p", "text": "The topmost level, almost entirely taken up by the Grand Audience Chamber, was used as a ceremonial hall by the Alliance garrison and later employed by the Jedi Academy as a teaching space. The next level was converted entirely to accommodations for the Jedi Masters and their students, with any extra space being used for storage. On the level below, the central chamber was named the Strategy Center, with the surrounding rooms on this level used as meeting rooms, communications and computing bays, kitchens and dining halls."}, {"tag": "p", "text": "The lowest level of the temple continued to serve as a vast hangar bay for starfighters and other vehicles, with a second hangar underneath, and cellars and catacombs that remained largely unused. Access to the hangar was by a set of ground-level blast doors opening onto a landing pad. After the Galactic Civil War the average ground level around the structure's exterior had risen, so that the main entrance was at War Room level, and many of the students thought of the entire hangar complex as being essentially underground. Although the hangar doors remained accessible, the area in front of them no longer served as the main landing zone."}, {"tag": "p", "text": "The academy had many training grounds equipped with remotes, ASP-19 battle droids, training lightsabers and other technology to challenge the new apprentices."}, {"tag": "h3", "text": "The first students"}, {"tag": "p", "text": "After the transition from Rebel base to Jedi academy was complete, Skywalker recruited twelve students: Tionne, Dorsk 81, Kirana Ti, Kam Solusar, Brakiss, Streen, Gantoris, Corran Horn (under the alias of Keiran Halcyon), Madurrin, Kyle Katarn (who soon left due to his concerns about the dark side of the Force), and two other cadets (possibly Havet Storm, Keyan Farlander, Nichos Marr or Harlan). They were joined shortly thereafter by Kyp Durron, Mara Jade, Cilghal and Dal Konur."}, {"tag": "h3", "text": "Prodigal sons"}, {"tag": "p", "text": "A Chistori student named Desann proved very talented, but struck down his training partner Havet Storm in a fit of rage. He fled the academy, only to return later as a Dark Jedi determined to destroy the academy with a huge invasion force of the Empire Reborn."}, {"tag": "p", "text": "Horn left the academy early on, frustrated with Skywalker's training methods, and eager to find his kidnapped wife, Mirax. Horn doubted that he could use his Force abilities for anything and chose instead to rely on detective skills learned during his years with CorSec. He realized that it was possible to combine his detective and Jedi skills. After he rescued his wife, he eventually returned to the academy."}, {"tag": "p", "text": "Mara Jade was initially only loosely attached to the academy. She would stay there for some time and train with the other students and teach them what she knew. She did not feel ready to commit herself fully to the way of the Jedi yet, as she still had many unresolved issues. Eventually she became more and more attached to the academy, and to Luke Skywalker, whom she eventually married."}, {"tag": "p", "text": "Like Horn, Katarn, who had trained informally with Jade prior to the establishment of the Praxeum, returned to the academy to assist the Jedi in defeating Galak Fyyar and Desann's invasion force of stormtroopers, swamptroopers, Reborn warriors and shadowtroopers. After defeating Desann in a lightsaber duel deep in the Great Temple, Katarn decided to stay at the Praxeum."}, {"tag": "p", "text": "All three were to become central figures in Skywalker's Jedi Order. By the start of the Crisis of the Disciples of Ragnos, Katarn and Horn had apprentices under their tutelage. Katarn had attained the rank of Jedi Master at that time. Jade and then Horn would later advance to the rank of Jedi Master."}, {"tag": "h3", "text": "Later students"}, {"tag": "p", "text": "Later, students such as Jaden Korr, Rosh Penin, Cray Mingla, Nichos Marr, Ganner Rhysode, Wurth Skidder, Octa Ramis, Miko Reglia, Raynar Thul, Lusa, Tenel Ka, Lowbacca, Zekk, Tahiri Veila, Tekli, Eryl Besa, Ulaha Kore, Jovan Drark, Zak Arranda, Tash Arranda, Daeshara'cor, Dolph, and Raltharan attended. Anakin, Jacen, and Jaina Solo also attended the Praxeum to develop their abilities."}, {"tag": "p", "text": "Students as diverse as Rodians, Humans, Twi'leks, Kel Dors and Zabraks attended the academy in this period."}, {"tag": "p", "text": "Penin turned to the dark side during the crisis of the Disciples of Ragnos but was redeemed by Korr and Katarn. Most of the students at the academy participated in the epic battle on Korriban where the Disciples of Ragnos were defeated once and for all."}, {"tag": "p", "text": "In 14 ABY, it was common that multiple students were assigned to only one Master due to the small number of Jedi Masters, like in the case of Kyle Katarn and his apprentices Jaden Korr and Rosh Penin."}, {"tag": "h3", "text": "The Battle of the Jedi Praxeum"}, {"tag": "p", "text": "After receiving information from Zekk that the Jedi Praxeum was in danger from attack by the Second Imperium, Jacen, Jaina, Lowbacca and Tenel Ka alerted Luke Skywalker and the rest of the Jedi trainees of the incoming attack."}, {"tag": "p", "text": "As the trainees prepared, the Shadow Academy and the Empire appeared in the sky above the Jedi Praxeum and unleashed swarms of TIE fighters, stormtroopers and Dark Jedi adepts. Using TIE stealths, the invaders flew under the academy's shield and destroyed the generator leaving the academy open to aerial assault."}, {"tag": "p", "text": "As Masters and trainees engaged the enemy, Brakiss attacked his former master Luke Skywalker. After retreating, Brakiss demanded to see the Emperor. He would later discover that the Emperor had never returned. Back on the ground, the remaining Imperial forces saw the destruction of the Shadow Academy and surrendered. In a final attempt to gain victory, an officer of the Empire slipped into Praxeum and planted a time bomb. The bomb exploded and destroyed a large portion of the building though no Jedi was badly injured."}, {"tag": "p", "text": "Reconstruction took place on the Jedi Praxeum. The Jedi trainees helped clear debris and also hunted for shards of carved stone blasted from the ancient structures, cataloging them so that the pieces could be reassembled. Off-world engineers, architects and laborers were also called in to help in the restoration efforts. New Republic military forces and planetary shields were installed on the Praxeum to defend it."}, {"tag": "p", "text": "Sometime after this battle, the New Republic stationed a fleet over the moon to protect it."}, {"tag": "h3", "text": "Final Destruction"}, {"tag": "p", "text": "The second battle of the Jedi Praxeum occurred during the Yuuzhan Vong War in 26 ABY. The battle was fought between the Jedi and the Peace Brigade, who attacked, causing the Jedi to flee into the jungle as the Yuuzhan Vong consolidated their presence in the system."}, {"tag": "p", "text": "Talon Karrde and Booster Terrik helped the few Jedi Knights and the many Padawans escape the clutches, making the Errant Venture and then the Shelter in the Maw the new home of the Jedi Academy. After the end of the Yuuzhan Vong War, the Praxeum was reestablished on Ossus."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}