{"url": "Jedi_Order", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:We're Doomed!", "Category:Galactic Republic military units", "Category:Jedi organizations", "Category:Religious organizations"], "nodes": [{"tag": "h1", "text": "Jedi Order"}, {"tag": "p", "text": "The Jedi Order, also known as the New Jedi Order under Jedi Master Luke Skywalker, was a noble religious order of protectors united in their devotion to the light side of the Force. With a history dating back thousands of years before the rise of the Galactic Empire, the Jedi Knights—noted for their lightsabers and natural ability to harness the powers of the Force—stood as the guardians of peace and justice in the Galactic Republic. The Order was originally established on Ahch-To in the Unknown Regions. In later years, the Jedi Grand Temple on the Core World Coruscant served as the hub of all Jedi activity in the galaxy. The Temple was also a training school for younglings and Padawans, who learned the ways of the Force under the supervision of Jedi Masters, twelve of whom were elected to serve on the Jedi High Council—the Order's highest governing authority. The High Council's staff officers were the Grand Master, who functioned as the leader of the Order and was a title reserved for the wisest Jedi Master, and the Master of the Order, who served as the Council's appointed leader. The Jedi Code governed the Order's way of life; therefore, every Jedi was duty-bound to observe and uphold the Code or else risk banishment from the Order's ranks."}, {"tag": "p", "text": "The emergence of the Sith Order was the result of a schism that fractured Jedi unity, dividing the Order between the Jedi who remained faithful to the light and a group of renegades that followed a rogue Jedi into exile for exploring the dark side of the Force. Thenceforth, the Jedi and Sith warred with each other for centuries. Although the last conflict concluded with the fall of the Old Republic, the ancient Sith all but perished as well, allowing a new Galactic Republic to rise under the protection of the Jedi Order. Unknown to the Jedi, however, the Sith endured in secret for a millennium beginning with Darth Bane, the sole-surviving Dark Lord of the Sith who reformed the Sith way by creating the Rule of Two—a rule limiting the Sith Order's ranks to two members: a Sith Master to embody the power of the dark side, and a Sith apprentice to covet that power. While the Jedi and Republic moved on, their ancient wars with the Sith fading from memory, Bane's legacy spawned a lineage of Sith Lords that culminated in the rise of Darth Sidious approximately three decades before the Battle of Yavin."}, {"tag": "p", "text": "During the final years of the Republic, the galaxy was beset by political instability and social unrest which, in turn, created a secessionist crisis that ultimately resulted in the formation of the Confederacy of Independent Systems. Lacking the sufficient manpower needed to protect the galaxy, the Jedi became commanders and generals in the newly-formed Grand Army of the Republic. For roughly three years they commanded armies of clone troopers in a conflict known as the Clone Wars, engaging the Confederacy's battle droid forces led by Count Dooku—a former Jedi Master who became a Sith Lord—and the cybernetic warlord General Grievous. Though the Jedi fought to preserve the Republic, the government they served was secretly taken over by Sidious who, as Senator Sheev Palpatine of Naboo, rose to power in the Senate and became the last Supreme Chancellor of the Republic."}, {"tag": "p", "text": "The Chancellor's machinations culminated in the execution of Order 66, a secret protocol that turned the Jedi's clone soldiers against them, leading to an all but total extermination of the Jedi Order. With the most of the Jedi eliminated, Sidious supplanted a thousand years of democracy with a new government known as the Galactic Empire. In addition, Sidious succeeded in turning Anakin Skywalker—the prophesied Chosen One who was destined to bring balance to the Force by destroying the Sith—to the dark side and renamed him Darth Vader. As a Sith Lord, the former Jedi Knight served the self-proclaimed Galactic Emperor by hunting down the few surviving Jedi, who had gone into hiding across the galaxy. In spite of the Sith's efforts, however, the Jedi continued to endure. Within a generation of the Empire's rise to power, Obi-Wan Kenobi and Yoda—both of whom survived the initial purge of the Order—trained Vader's son, Luke Skywalker, in the Jedi arts. Luke would later redeem his father, causing him to return to the light and fulfill his destiny as the Chosen One, destroying both himself and his Master during the Battle of Endor."}, {"tag": "p", "text": "The Empire dissolved into various remnants as a result of their defeat in the Galactic Civil War, allowing the Alliance to Restore the Republic to rise as the New Republic. Under the new era, Luke Skywalker endeavored to rebuild the Order by training a new generation of Jedi. Among Skywalker's students was his nephew Ben Solo, the son of his twin sister, Princess Leia Organa, and the famed smuggler Han Solo. Ben, however, was seduced by the dark side of the Force at the coaxing of Snoke, an enigmatic figure who spearheaded the Imperial-inspired First Order. As a result, Ben adopted the name and persona of Kylo Ren, a First Order warrior and master of the Knights of Ren."}, {"tag": "p", "text": "The new generation was betrayed and destroyed by Ren, who left the Jedi training temple burning by the time Skywalker recovered from the attack. Feeling responsible for Ben's fall and the massacre of his apprentices, he went into exile and disappeared from the galaxy, leaving only traces of his location on a star map. The First Order and the Resistance both sought to acquire the map, but ultimately it was the latter that succeeded due to the actions of the Jakku scavenger Rey. She followed the map to the planet Ahch-To, where the last Jedi had taken refuge in the first Jedi Temple."}, {"tag": "p", "text": "Skywalker, stricken by grief and believing his return would only cause more problems, was reluctant to train Rey or another generation of Jedi. However, the last Jedi eventually returned to the fight, buying time for the Resistance to escape the siege of Crait led by Kylo Ren, who became the new Supreme Leader after killing his master, Snoke. Skywalker became one with the Force after exerting a great amount of energy to project himself across the galaxy to face his fallen nephew, but not before acknowledging that he would not be the last Jedi. His heroic tale spread across the galaxy, inspiring others and giving hope in a time of rising darkness."}, {"tag": "p", "text": "Having returned from death, Darth Sidious urged Kylo Ren to end the Jedi Order by killing Rey, who was his granddaughter. After Ren renounced the dark side, Sidious attempted to turn Rey until he discovered her bond with Ben Solo. Realizing they were a dyad in the Force, Sidious nearly drained them of their life force to regain his full power. Though weakened by Sidious' attack, Rey was strengthened by the spirits of past Jedi, allowing the apprentice to stand against the Dark Lord of the Sith. She destroyed her grandfather using his own Force lightning against him, preventing the rebirth of the Sith Order, but the effort left her dead. Solo resurrected her at the cost of his life, becoming one with the Force as the last Skywalker. The Jedi Order and the Skywalkers were gone, but their legacy endured through Rey, who took the Skywalker name to honor her mentors."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "The Jedi Knights were a noble order of Force-sensitive protectors—united by their ability to use the Force—who upheld peace and justice in the Galactic Republic for over a thousand generations, carrying out what they sensed to be the will of the Force as its instruments. As keepers of the peace, the Jedi Order undertook diplomatic missions on behalf of the Galactic Senate, and pursued interplanetary criminals across the galaxy. In contrast to the Sith, the Jedi's historic foes, who harnessed the dark side, the Jedi drew their power from the light side of the Force. The Jedi Code, along with a collection of other foundational texts, guided the Jedi way of life, governing the behavior of individual Jedi to the philosophy and training regimen of the Order as a whole."}, {"tag": "p", "text": "As the Jedi were instructed in the ways of the Order and the Force; as their knowledge grew, each member progressed through several different ranks. With the exception of Anakin Skywalker, prospective Jedi were identified a short time after birth by the quantity of midi-chlorians in their blood, a factor which indicated the level of a subject's Force-sensitivity.  Many of these children were listed within Jedi holocrons before being identified by the order. Training began at the level of the Jedi youngling; at some point in their training, younglings were expected to find their own Kyber crystal—the heart of the lightsaber, a distinctive and elegant weapon of the Jedi—in order to pass an ancient rite of passage known as The Gathering."}, {"tag": "p", "text": "Younglings who succeeded in their trials graduated to the level of Padawan, the apprentice of a more experienced member of the Order. In accordance with the Jedi Code, a Master could instruct only one student in the ways of the Force at any given time. The Padawan braid, a symbol that represented a Jedi apprentice's status in the Order, was worn in the hair or head, depending on the Padawan's species."}, {"tag": "p", "text": "The Jedi Trials were a series of tests that ultimately determined whether a Padawan was worthy of the rank of Jedi Knight. After becoming a full-fledged member of the Order, a Jedi could choose to adopt a Padawan of their own as part of the Order's tradition in training the next generation of Jedi. The most powerful and legendary Jedi held the rank of Jedi Master. Again with exception of Skywalker, the Jedi High Council—the highest governing body of the Order—consisted of Masters throughout the history of the Order. Among the Council, the title of Grand Master was conferred on the oldest and wisest member of their group, while Council's leadership rested with the Master of the Order."}, {"tag": "h3", "text": "Locations"}, {"tag": "p", "text": "The first Jedi Temple was built atop a sacred island on Ahch-To tens of thousands of years before the First Order/Resistance War. The temple rose high above the surrounding sea, and was worn down by erosion and time. Some signs of its past remained, however, such as mosaics and an ancient meditation ledge."}, {"tag": "p", "text": "The Jedi Order made its home in the Jedi Grand Temple on Coruscant, the capital world of the Galactic Republic. Over the millennia, the Temple served as the central hub of all Jedi activities in the galaxy; it was a school, a monastery, and the headquarters of the Jedi High Council. As a school, the Temple was the largest active Jedi training center in the galaxy where younglings trained to become Padawans and ultimately full-fledged Jedi Knights. The Jedi Archives, the source of all knowledge accumulated by the Order, was located inside of the Temple."}, {"tag": "p", "text": "As the symbol of the Order, the Temple signified the Order's status in galactic affairs. While access to the Temple was not restricted to just the Jedi, all non-Jedi personnel were required to undergo compulsory entry tests before becoming employed at the Temple. Those who worked in the Temple often dedicated their whole life to serving the Order. Having sustained extensive damage during the fall of the Jedi, the Temple was renovated and renamed as the Imperial Palace, with only the original structure's corpse and five skyscraping towers remaining intact."}, {"tag": "p", "text": "In addition to the Temple on Coruscant, the Order maintained several ancient temples spread across the galaxy. One such temple was located on Lothal, and was only accessible if both the Master and Padawan were present. The Lothal temple was where Padawans were sent to confront their fear without the support of the Masters, some of whom ultimately died while waiting for their students who never returned, leaving the temple's antechambers littered with their skeletal remains. Other Jedi enclaves included the Temple of Eedit on Devaron, the Temple of Vrogas Vas, and the Temple of Ilum where younglings were sent to participate in The Gathering."}, {"tag": "p", "text": "While Ilum was regarded as the most sacred planet to the Jedi Order, the desert moon Jedha—a holy site and home to one of the first civilizations that explored the nature of the Force—was considered a spiritual home of the Jedi. Like Ilum, Jedha contained the kyber crystals that the Jedi used to create their lightsaber. It was also a holy site for pilgrims throughout the galaxy, who sought spiritual guidance in the Holy City of Jedha. At one time it was an important world to the Jedi."}, {"tag": "p", "text": "The Jedi Order established smaller outposts at various locations around the galaxy, including one on Elphrona. These outposts were believed to date as far back as the High Republic Era and contained various artifacts that were important to the history of the Jedi."}, {"tag": "p", "text": "The Jedi also maintained a connection to Tython, and one of their sacred texts described \"notable beasts of Tython.\""}, {"tag": "p", "text": "Another Jedi temple and a structure known as the \"Great Jedi Library\" were located on the planet of Ossus. The Library was destroyed before the Clone Wars, and was found by Luke Skywalker to be in complete ruins. Despite this, Skywalker still located an original copy of the Rammahgon, one of the sacred Jedi texts, on the planet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Ancient times"}, {"tag": "p", "text": "The precursors of the Jedi were the Dai Bendu, but the Jedi Order itself was founded in the distant past on planet Ahch-To by the Prime Jedi. At the dawn of their order, the Jedi came into possession of Ilum, an ancient planet encased in ice and littered with kyber crystals, the heart of the Jedi lightsaber. Considered the Jedi Order's most sacred world, its ancient Temple would eventually host the Gathering, a tradition that would continue up until the fall of the Order. As the Jedi were spread throughout the galaxy, they acquired a vessel called the Crucible that would ferry students to Ilum so that they could perform the Gathering. It would become the base of the architect droid, Professor Huyang, for over a thousand years as he instructed on lightsaber designs and kept records of every single Jedi weapon created. During this early period, the Order also established itself on Xenxiar, Jedha, and other worlds."}, {"tag": "p", "text": "The Jedi religion, as it was called by Luke Skywalker, was based around eight \"sacred texts\" that \"describe tenets, history, and specific guidance to those studying the path of the Jedi.\" These texts included the Rammahgon and the Aionomica (separated into two volumes, Aionomicum I and Aionomicum II). These books included a number of aspects of the Jedi religion that appeared to have little influence on later Jedi, such as references to \"gods\" and the World Between Worlds. They also included more mundane information, such as lightsaber designs. The theology of the Jedi religion changed over time; many Jedi, such as Master Odan-Urr, annotated even the sacred texts. Much was added to the Jedi canon over time, giving rise to the belief that the Aionomicum II doubled in size during its compilation."}, {"tag": "p", "text": "During the Hundred-Year Darkness, the Sith were born. Once brothers in the Force, the Sith Order was founded by a rogue Jedi who had come to the understanding that the true power of the Force lay not in contemplation and passivity, and instead sought abandon and strength through the dark side of the Force. The Jedi Council at the time balked at this new direction, and the fallen Jedi was outcast, but he eventually gained followers to his new order. The power-hungry Sith sought to control the galaxy and opposed the Jedi, against whom they waged a series of wars which brought destruction to many worlds—including the Sith homeworld of Moraband, which the Sith were eventually forced to abandon. On another occasion, the Jedi Order and the Sith fought a battle on the planet Takodana. These wars also saw the construction of ancient superweapons powered by giant kyber crystals which possessed the power to destroy entire planets. These weapons, along with the crystals, were destroyed and a thousand years later believed by many Jedi to be merely legends."}, {"tag": "p", "text": "About five-thousand years before the Battle of Yavin, the Order eventually came to be headquartered at Coruscant, wherein they built a Temple that would pose as their main hub for thousands of generations. Underneath the structure lay buried an ancient Sith shrine, the inherent power of which was believed by the contemporary Jedi to have been neutralized and successfully capped. In truth, that power had seeped upward and outward since its entombment, infiltrating the hallways and rooms above, and weakening the Jedi Order for millennia without their knowledge."}, {"tag": "p", "text": "It was during this time that the Jedi Order came into the service of what would be later called the Old Republic. Promising to uphold its ideals, the Jedi fought to maintain peace and freedom. When the Old Republic outlawed slavery, the Jedi set about to free those held, notably under the Zygerrian Slave Empire. The Jedi declared war on Zygerrians, whose economic success had resulted from enslaving beings from all corners of the galaxy before selling them at auctions. The Jedi Order managed to put an end to their practices, destroying their empire and exiling them to their homeworld, Zygerria. The Zygerrians developed a fierce hatred for the Jedi as a result."}, {"tag": "p", "text": "At one point, a Jedi sect known as the Ordu Aspectu broke off from the Jedi Order. Led by the enigmatic Rur and his second in command, Amon, they sought to achieve the secrets to immortality. Eventually, a conflict broke out between them and the orthodox Jedi. The conflict ended with the signing of a peace treaty. The treaty allowed the Ordu Aspectu to continue their research but under Jedi scrutiny. During his experimentation, Rur attempted to copy his intellect into his citadel's computer core, only to accidentally transfer his very sentience as well. When the Jedi sought to investigate the computer closer, the computer activated the citadel's security droids, killing all members of the Ordu Aspectu and Jedi alike; but not before it was deactivated by Rur and Amon before they died themselves, thus ending the Ordu Aspectu."}, {"tag": "p", "text": "Conflicts also arose between the Jedi and the inhabitants of the world of Mandalore who had rapidly developed into a warlike culture in which strength was valued above all else. Their beliefs of continual warfare went contrary to the Jedi's mission of protecting the weak, they quickly mobilized to stop the destructive Mandalorians from expanding in the galaxy. The constant warfare was a strain and, as the Old Republic crumbled, the Mandalorian warriors sacked the Jedi Temple on Coruscant, an event during which Pre Vizsla's ancestors stole the Darksaber."}, {"tag": "p", "text": "Prior to 1032 BBY, the galaxy entered an era known as the Dark Age. During this time the Jedi-Sith War occurred. Early on in the war, the Sith attacked and captured Coruscant and with it the Jedi Temple. Towards the end of the war the Jedi reclaimed the Republic capital and their temple during the liberation of Coruscant."}, {"tag": "p", "text": "Even as the Old Republic collapsed, the Jedi emerged victorious from their wars with the Sith. In their constant thirst for power, the Sith had weakened themselves through infighting, which allowed the Jedi to defeat the weakened Sith. Unbeknownst to the Jedi however, one Dark Lord of the Sith remained: Darth Bane. Setting out a new guiding principle for the Sith called the Rule of Two, Bane declared that there could be no more than two Sith in existence: a master and an apprentice, to prevent the infighting of the past from ever destroying the Sith again. Despite discovering his principles, when he was defeated, the Jedi believed that, with Bane dead, the Sith were extinct from the galaxy."}, {"tag": "p", "text": "In approximately 320 BBY, a copy of a third volume of the Aionomica was put forth. Though the existence of Aionomicum III had been rumored, this volume was later found to have been forged, causing a scandal."}, {"tag": "h3", "text": "Keepers of the peace"}, {"tag": "h4", "text": "Knights of the High Republic"}, {"tag": "p", "text": "It was after these events that the modern Galactic Republic was formed and ushered in a new era of democracy, peace, and prosperity under the Galactic Senate and its elected leader, the Supreme Chancellor. Due to the Galactic Republic's demilitarization, the Jedi Order fully embraced their responsibilities as peacekeepers and rejected their roles as soldiers. Assisted by the Republic Judicials, the Jedi were responsible for maintaining law and order, namely by mediating conflicts to bring about peaceful solutions between various rival factions and planets, as well as serving as interplanetary law enforcement by pursuing wanted and dangerous criminals, pirates, and smugglers. While they ultimately collapsed, the Galactic Republic and the Jedi Order were able to preside over a thousand years of peace sustained without major warfare. One of their philosophical sayings was \"the simplest gesture of kindness can fill a galaxy with hope.\""}, {"tag": "p", "text": "The Republic reached the zenith of its power and influence in a time remembered as the High Republic Era. During that time, the Republic relied heavily on the Jedi Order to render aid and settle disputes through peaceful methods. Even though some of its members would come to question whether it was right to do so, the Jedi worked closely with the Republic, with each organization respecting the strengths of the other. Thus, the Jedi aided the Republic Defense Coalition and—through their outposts built to explore and help people in the wild portions of the Outer Rim—became the only group upholding justice in the Outer Rim Territories before the Dedication of the Starlight Beacon. During the era, the Order's understanding of the Force was expanded thanks to the actions of Jedi Knight Elzar Mann, who liked to \"experiment\" with his Force techniques in ways that sometimes failed. Even though he never attempted such actions when lives were at stake, his experiments often meant he worked alone."}, {"tag": "p", "text": "Despite the High Republic's supposed peace, the Jedi were suddenly faced with a crisis during the Great Hyperspace Disaster in the Hetzal system. Jedi Master Avar Kriss commanded the rescue operation, yet she learned via her Force bond to the other Jedi that the fragments raining upon the Hetzal system contained living beings; unknown to the Jedi, the disaster had been masterminded by Eye of the Nihil Marchion Ro—who wanted revenge on the Jedi due to past events involving their Order and an artifact—had destroyed the transport starship Legacy Run in hyperspace, making its remains rain upon the system. Towards the end of the crisis, the Jedi worked together—ultimately being joined in the Force by members of their Order who were even further away—to push a fragment containing liquid Tibanna past the system's R-class star. Their successful rescue of the system was broadcasted across the Outer Rim and even reached the Republic's inner planets."}, {"tag": "p", "text": "Nevertheless, the remains of the Legacy Run continued to rain upon Outer Rim systems as Emergences, forcing the Republic to blockade hyperspace routes and making the Jedi Council realize the Jedi would be needed in the Outer Rim more than normal. In time, the Order began to battle the Nihil raiders."}, {"tag": "h4", "text": "Beginning of the end"}, {"tag": "p", "text": "However, as the Republic reached its zenith and disputes became more common between the Republic's member worlds, tensions arose between Jedi Master Sifo-Dyas and the rest of the High Council. Foreseeing an upcoming full-scale conflict, he started advocating for the creation of an army for the Republic. His fellow councilors deemed his ideas too extreme and Sifo-Dyas was removed from his position. Even though the other Jedi had rejected his project, he found a way to carry it out without their consent. Sifo-Dyas contacted the Kaminoans, who were reputed for their clone hatcheries, and secretly commissioned them to grow a clone army for the Republic, which he pretended was a request of the Senate. Unbeknownst to Sifo-Dyas, the Sith Lord Darth Sidious plotted a conspiracy with the Prime Minister of Kamino, Lama Su, to implant a behavioral modification biochip in all clones so that they would turn against the Jedi and bring about the destruction of the Jedi Order when the time was right."}, {"tag": "p", "text": "To silence Sifo-Dyas, Jedi Master Count Dooku, who had fallen to the dark side and had become one of Sidious' apprentices under the name Tyranus, paid the Pyke Syndicate to kill Sifo-Dyas on his mission to Oba Diah as assigned by Supreme Chancellor Finis Valorum. When Sifo-Dyas was assigned to a mission on Felucia and his negotiations with the Pykes were postponed, he and Aide Silman left Oba-Diah for Felucia. Subsequently, the Pykes shot down their shuttle over the moon. Although the crash killed Sifo-Dyas, Silman survived; captured by the Pykes, they kept his survival a secret in case they needed leverage. The Pykes turned over Sifo-Dyas's corpse to Dooku, who brought the body to Felucia. There, the tribal inhabitants cremated his body. The Jedi Council, being led to believe that Sifo-Dyas had been killed by the Felucians, closed the case."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "In 32 BBY, Chancellor Valorum requested the Order's assistance in negotiating a dispute between the planet Naboo and the Trade Federation that had resulted in a blockade of the world. The Council dispatched Jedi Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi, to negotiate with the Trade Federation. However, Darth Sidious, whose public persona was Senator Sheev Palpatine of Naboo, insisted that the Trade Federation, which was under his sway, initiated an invasion of Naboo and overwhelmed the Royal Naboo Security Forces. Circumventing a trap by the Federation, Jinn and Kenobi were able to escape to Naboo and arrive in Theed in time to rescue the Naboo Queen, Padmé Amidala, who was being held captive by Federation forces. Together with the Queen's Handmaidens and her close security detail, the Jedi fled the planet but their ship was damaged in the escape, causing them to land on the desert planet of Tatooine."}, {"tag": "p", "text": "While stranded on Tatooine, the two Jedi discovered a young slave named Anakin Skywalker, whom Jinn believed to be the Chosen One. By betting on the boy winning the Boonta Eve Classic, Jinn was able to secure both Skywalker's freedom and the needed parts to repair the Queen's ship to reach Coruscant. It was after this that Jinn was attacked by Darth Maul, apprentice to Darth Sidious, who had dispatched Maul to kill the Jedi. As the Jedi had believed the Sith to be extinct, Jinn was at first unsure of who Maul was except that he had been trained in lightsaber combat. Arriving at the Jedi Temple on the Coruscant, the Council refused to induct Skywalker into the Order because, according to the the Code, he was too old. The Council then ordered Jinn and Kenobi to protect Queen Amidala on her return to Theed. At the same time, Amidala called for a Vote of No Confidence in Chancellor Valorum, which would eventually lead to the election of Palpatine to the chancellorship. Jinn and Kenobi then assisted Amidala and her forces during the ensuing battle against the Trade Federation, when Maul killed Jinn in combat, only for the Sith to be defeated by Kenobi. Given the status of Jedi Knight afterward, Kenobi took Skywalker as his apprentice, despite Yoda's reluctance, and the Jedi Order was left in the dark as to what the Sith's actions were for ten years."}, {"tag": "h3", "text": "Separatist Crisis"}, {"tag": "p", "text": "Having broken all ties to the Jedi Order, secretly replacing Maul as Sidious' apprentice, Dooku was believed to be a mere \"political idealist\" by his peers at the Jedi Order. For eight years, Dooku was scarcely heard about until he staged a theatrical return to public life by delivering a rousing speech that condemned the Republic and essentially set the stage for the Separatist Crisis. At the same time, he fomented political turmoil in many worlds, including Ryloth, Kashyyyk, Sullust, and Onderon, or tried to convince their leaders to leave the Republic, as in Eriadu's case. Soon enough, Dooku became the face of the Confederacy of Independent Systems, convincing several thousand systems to leave the Republic."}, {"tag": "p", "text": "As the Jedi Order was overwhelmed, whose limited numbers made it difficult for them to maintain peace and order in the increasingly volatile galaxy, the Republic's Senate debated a Military Creation Act to form a standing army for the Republic's protection against the Separatist threat. As the vote to decide for the Republic became imminent, assassination attempts on Senator Padmé Amidala―who opposed the army's creation―soon led Jedi Knight Obi-Wan Kenobi to trace bounty hunter Jango Fett to Kamino, where he discovered the clone army's creation at the request of Sifo-Dyas, and reported it to the High Council. After a small confrontation, Kenobi followed Fett to Geonosis, where his capture and intel on a Separatist droid army prompted the Senate (with the High Council's approval) to give Chancellor Palpatine emergency powers so as to raise the Grand Army of the Republic. Soon enough, a Jedi task force and a contingent of clone troopers, led by Mace Windu and Yoda respectively, arrived to participate in the First Battle of Geonosis against the Confederacy's army, marking the beginning of a galaxy-wide conflict known as the Clone Wars."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "With the Republic now at war with the Separatists for control over the galaxy, the Jedi Masters and Knights were dispatched as Generals, and their Padawans as Commanders, leading the armies from the front. During the Clone Wars, the Jedi were victorious in battlefields such as Christophsis, Ryloth, Umbara, and Geonosis. By leading the Republic's army in various battles throughout the galaxy, the Jedi came to be seen as great warriors. Jedi Knight Anakin Skywalker, for example, was considered by some to be the greatest warrior of the Jedi Order."}, {"tag": "p", "text": "During the time of the Alderaan Refugee Conference, Padme Amidala stated that over one hundred Jedi had been killed in the war. By last year of the war, many Jedi had been killed, and several had turned to the dark side, such as Pong Krell and Barriss Offee. The latter believed the Jedi had deviated from their course as peacekeepers and so arranged a bombing at the Jedi Temple, for which framed fellow Padawan Ahsoka Tano. Tano, in turn, left the Jedi Order unable to trust the Council after turning its back on her during her trial. Eventually, the High Council came to be aware of Dooku's hand in the creation of the clone army, and of the lies and mistrust that surrounded them, both inside the Temple and the Senate. Grand Master Yoda even foresaw that the Jedi would not win the Clone Wars, just as public support for the Jedi weakened due to their management of the conflict."}, {"tag": "p", "text": "The war would come to an end in 19 BBY, following the rescue of Supreme Chancellor Palpatine and the death of Count Dooku aboard the Invisible Hand in the Battle of Coruscant, and the death of General Grievous in the Battle of Utapau, as carried by the Jedi Generals Anakin Skywalker and Obi-Wan Kenobi. However, Skywalker's turmoil clouded his judgment. Though he informed Windu of his discovery of Palpatine's identity as Darth Sidious, allowing Windu to assemble a team composed of himself, Kit Fisto, Agen Kolar, and Saesee Tiin, to arrest Palpatine, the young Jedi Knight intervened in their duel against the Dark Lord of the Sith. Skywalker chose to save Sidious, leading to Windu's death, and became his apprentice as \"Darth Vader\" to save his secret wife, Padmé Amidala."}, {"tag": "h3", "text": "The purge"}, {"tag": "p", "text": "Branding Windu's actions as treason, Palpatine declared the Jedi to be enemies of the Republic and sent Vader to kill the ones who still were in the Jedi Temple, including the Initiates. Palpatine then personally contacted clone commanders and commanded them to execute Order 66, causing them to turn on their Jedi Generals and execute them on the spot. Throughout the galaxy, thousands of Jedi were killed by the obedient clones including Ki-Adi-Mundi on Mygeeto, Aayla Secura on Felucia, Plo Koon on Cato Neimoidia, Stass Allie on Saleucami, Depa Billaba on Kaller, and Jaro Tapal above Bracca."}, {"tag": "p", "text": "Of an estimated number of ten-thousand Jedi, just a few survived to see the proclamation of the New Order, marking the inception of the Galactic Empire and the rise of Palpatine as its Emperor. Survivors included Yoda, Obi-Wan Kenobi, Ahsoka Tano, Caleb Dume, Cal Kestis, Cere Junda and her Padawan Trilla Suduri, Taron Malicos, and at least initially, Uvell, Luminara Unduli, Oppo Rancisis, Eeth Koth, Coleman Kcaj, Jocasta Nu, Kirak Infil'a, Selrahc Eluos, Ka-Moon Kholi, Zubain Ankonori, Khandra, Mususiel, Nuhj, Ferren Barr, and possibly Quinlan Vos. During their self-imposed exile, Kenobi and Yoda, along with Senator Bail Organa, hid Vader's newborn children, the Force-sensitive twins Luke Skywalker and Leia Organa, from the Sith, hoping that in time they would become the key to the Jedi Order's future to stop the dark side."}, {"tag": "p", "text": "Word about the supposed Jedi rebellion and the Order's destruction spread throughout the galactic population, and clone troopers were ordered to hunt down any Jedi survivors. According to Imperial Admiral Rae Sloane, the Jedi that had survived Order 66 made a last stand against a clone trooper charge led personally by the future war veteran and Shadow Council member Hodnar Borrum, who was known to hold disdain for the Force, on a mountain fortress on either Madar or Morad. In the matter of a short five years since the Order's dissolution, the combined efforts of the Empire's policy of silence about the Jedi, the unceasing, extensive hunts carried out by the Inquisitorius, and the systematic destruction of their temples made the Jedi already seem a distant memory. Educational studies concerning the Jedi were prohibited, with instructors who specialized in Jedi history (such as Sava Korin Pers of the University of Bar'leth) losing their positions. Any Jedi survivors were captured and brought to Mustafar for interrogation and execution, but also to the Spire on Stygeon Prime, wherein the body of Luminara Unduli was preserved to lure out any surviving Jedi. Among the last reservoirs of knowledge of the Order were Antron Bach's vault in an abandoned colony, created at Uvell's behest, and Grakkus the Hutt's private collection on Nar Shaddaa. Safeguarding holocrons, lightsabers, journals, archives, and other artifacts, they partially preserved the teachings of the fallen Order."}, {"tag": "h3", "text": "Dark times"}, {"tag": "h4", "text": "Fallen order"}, {"tag": "p", "text": "For nearly twenty years, the Empire was able to expand without opposition of a disbanded Jedi Order. A few of its former members, however, stayed true to their code of honor and continued to fight the Empire's injustice, albeit in different ways. Though former Padawan Ahsoka Tano had become disillusioned by the Council's actions and no longer identified as a Jedi, she came into contact with Bail Organa from Alderaan, with whom she worked to coordinate the efforts of a rebellion under the codename \"Fulcrum,\" fifteen years after the fall of the Republic."}, {"tag": "p", "text": "Five years after the rise of the Empire and the destruction of the Jedi Order, there was an attempt to bring the Order back. Padawan Cal Kestis, who had been hiding on Bracca since Order 66, was recruited by the former Jedi Knight Cere Junda, who believed that the return of the Jedi Order was the best option to defeat the Empire. To accomplish this, they sought to recover a holocron that had been hidden on the planet Bogano by Jedi Master Eno Cordova. This holocron contained a list of the locations of Force-sensitive children across the galaxy."}, {"tag": "p", "text": "After scouring ancient ruins for clues left behind by the extinct Zeffo civilization, Kestis succeeded in unlocking the Vault that contained the holocron, but the artifact was taken by the Second Sister, an Inquisitor who had been Junda's Padawan before the Purge. Junda proclaimed Kestis a Jedi Knight, and together they pursued the Second Sister to the Fortress Inquisitorius on the ocean moon Nur. They succeeded in retrieving the holocron from the Second Sister, who was executed by Darth Vader. The Dark Lord overpowered both Jedi, wounded Kestis for refusing to surrender the holocron, and goaded Junda to embrace the dark side. Ultimately, though, Kestis and Junda managed to escape from Vader with their allies' help. Despite Kestis' commitment to the restoration of the Jedi Order, the young Jedi Knight destroyed the holocron to protect the Force-sensitive younglings, entrusting their fate to the will of the Force."}, {"tag": "h4", "text": "Rebellion and war"}, {"tag": "p", "text": "Eight years after the end of the Clone Wars, Caleb Dume, who had assumed the identity of Kanan Jarrus, joined forces with the Twi'lek rebel fighter Hera Syndulla. Together, the two established a small rebel cell based on the starship Ghost. Fifteen years into the Imperial Era, a number of inaccurate tales about the Jedi started to appear. For example, the bounty hunter duo Gowski and Fissol were under the impression that Jedi aged backward, were able to fly, and had unusually dense bones. About five years before the Battle of Yavin, Jarrus took on a Force-sensitive teenager named Ezra Bridger as his apprentice."}, {"tag": "p", "text": "Kanan's decision to ignite his lightsaber on Kessel drew the attention of the Grand Inquisitor, whom Vader had tasked with hunting down Jedi and recruiting the \"children of the Force.\" Under Kanan's tutelage, Ezra trained as a Jedi while evading the Grand Inquisitor and other Imperial agents. Ezra completed his Jedi Trials at the Lothal Jedi Temple under the guidance of Master Yoda, who also counseled Jarrus to continue training Ezra. At the instigation of Grand Moff Wilhuff Tarkin, the Grand Inquisitor and Agent Kallus concocted a trap that captured Jarrus. However, Ezra and the other rebels mounted a mission to rescue Jarrus and killed the Grand Inquisitor. In the process, they encountered other members of the rebellion including the former Padawan Ahsoka Tano, who had become a key rebel leader."}, {"tag": "h3", "text": "Return of the Jedi"}, {"tag": "p", "text": "During a mission, they inspired not only the people of Lothal to fight the Empire, but also the early \"Alliance\" to finally organize and to bring several Rebel cells together, paving the way for the Alliance to Restore the Republic. An underground faith known as the Church of the Force emerged in support of the Jedi and their ideals, believing that only their return could restore balance to the Force."}, {"tag": "p", "text": "In 0 BBY, Obi-Wan Kenobi emerged from his exile on Tatooine, not only to help deliver the plans of the Death Star to the Rebel Alliance as requested by Rebel leader Princess Leia Organa but to begin training Luke Skywalker to become a Jedi Knight, in the hopes that Skywalker would be able to defeat both Vader and the Emperor. Through Skywalker, with Kenobi's guidance, the Rebel Alliance achieved a significant victory in the Battle of Yavin, which meant a turning point for the Alliance in the Galactic Civil War. In 3 ABY, Skywalker received training from Yoda on Dagobah, allowing him to defeat and redeem his father, Darth Vader, and bring about the death of Emperor Palpatine during the Battle of Endor. Hailed as \"the last of the Jedi,\" Skywalker was told by Yoda to pass on what he had learned so that the legacy of the Jedi Order could go on."}, {"tag": "p", "text": "After the Battle of Jakku, the Empire officially surrendered to the New Republic by way of the Galactic Concordance, which put strict provisions on the rump state. In the Unknown Regions, however, fleeing Imperial officers and nobles conspired to rebuild their armies and fleets, culminating in the rise of the hermetic First Order. In the meantime, Skywalker gained a new ally in an individual named Lor San Tekka, a member of the Church of the Force during the dark times, who believed the return of the Jedi was necessary to have balance in the Force and aided Skywalker in retrieving lost Jedi lore."}, {"tag": "h3", "text": "An order reborn"}, {"tag": "h4", "text": "A new generation"}, {"tag": "p", "text": "Following the Battle of Endor, the Alliance General Han Solo and the former Princess of Alderaan, Leia Organa, were married and after the defeat of the Empire at Jakku, they had a son named Ben Solo. Ben was Luke Skywalker's nephew, as Organa was his twin sister, a fact Skywalker only learned from the Force spirit of Obi-Wan Kenobi following Yoda's death. On Ajan Kloss, Skywalker trained Organa in the ways of the Jedi as his first student. She even constructed her own lightsaber, but after seeing a vision of her son's death as the culmination of her Jedi training, Organa declined to progress further. She then directed her focus to the future of the New Republic."}, {"tag": "p", "text": "Around five years after the Battle of Endor, Skywalker helped rescue Grogu, a mysterious alien that shared the same species as Yoda. The alien had previously demonstrated many remarkable feats in the Force. Skywalker expressed his desire to train the individual in the ways of the Force. He carried Grogu and proceeded to leave accompanied by R2-D2."}, {"tag": "p", "text": "Skywalker began training his nephew in the ways of the Force at Organa's behest. In many ways, Solo reminded his parents of his grandfather, Vader, therefore Organa wanted him to train with his uncle in the hope that he would not turn to the dark side as well. In addition to Solo, Skywalker recruited several other students including Hennix, Tai, and Voe during his visits to many worlds over two decades. During this time, Solo was trained in lightsaber combat and became skilled with the Jedi weapon. The Jedi Temple of Luke Skywalker was founded as a training center for a generation of new Jedi all looking to the guidance of one master."}, {"tag": "p", "text": "While the younger Solo was still an adolescent, Skywalker traveled with his nephew and Lor San Tekka to the Jedi outpost on Elphrona seeking Jedi artifacts. The trio were accosted by a dark side sect known as the Knights of Ren. Master Skywalker used his Force powers to defeat the Knights. Before leaving, the Knights' leader Ren told Solo to contact the Knights should he ever consider exploring the dark side further."}, {"tag": "h4", "text": "The temple's destruction"}, {"tag": "p", "text": "Solo's family would ultimately learn that he was gradually seduced to the ways of the dark side through the machinations of the First Order's ruler, Supreme Leader Snoke. Organa blamed Snoke as the sole cause of her son's descent into darkness, culminating in the destruction of the Jedi Temple, but Skywalker felt responsible for his nephew's fate. Sensing the dark side's influence within Solo, Skywalker probed his nephew's mind and beheld visions of the dark warrior that he was becoming. Skywalker instinctively raised his lightsaber to kill his nephew while he slept, believing Solo would destroy all that he loved; however, he stopped himself from killing his sister's son, and was overcome by shame. He then saw that Solo had awoken. He saw fear in the eyes of his young nephew, and in that moment Skywalker felt he had failed as a Jedi Master."}, {"tag": "p", "text": "Solo reached for his blade and razed the hut using the Force, collapsing it in on his uncle. As Solo struggled to comprehend the situation and lost control of his emotions, the Jedi Temple was destroyed by a powerful storm, killing most of Skywalker's other students. Shortly later, Hennix, Tai and Voe returned from an offworld trip. They confronted Ben Solo, who told them that Skywalker had tried to murder him. Skeptical, they tried to detain him but Solo fled following a brief skirmish and sought Snoke. Hennix, Tai and Voe resolved to find Solo and investigate what had happened. Meanwhile, Solo sought out Snoke and the two decided to seek out the Knights of Ren."}, {"tag": "p", "text": "Skywalker regained consciousness in the rubble of his nephew's hut too late to prevent Solo's destruction of the Jedi temple and the deaths of the students inside. Solo had already fled, and Skywalker could only witness his temple still burning alongside his astromech droid, R2-D2. Skywalker felt responsible for the ordeal and decided to exile himself, although those closest to him learned that he was also searching for the first Jedi Temple. Skywalker only left traces of his location in a single star map, with the remaining data being present in old Imperial records. Skywalker eventually found the first Jedi temple on the aquatic world of Ahch-To, where he took up refuge and lived in exile as a hermit. Skywalker vowed to never attempt another rebirth of the Jedi Order, and therefore resolved to die as the last Jedi."}, {"tag": "h4", "text": "The Jedi Killer"}, {"tag": "p", "text": "Traveling to the Jedi outpost on Elphrona, Solo contacted Ren, who told him to find the Knights of Ren on Varnak. However, Hennix, Tai and Voe caught up with the fugitive Solo. Though Tai preferred to reason with Solo, Voe and Hennix fought him, believing that he had a role in destroying the Jedi Temple and killing their brethren. Solo killed Hennix in self-defense before fleeing to Varnak. However, Ren was still unsatisfied that Solo was worthy to become a Knight of Ren but took him on a trial run."}, {"tag": "p", "text": "To test Solo's worthiness for the dark side, the Knights of Ren enlisted his services in obtaining a Force relic called the Mindsplinter from a group of Mimbanese on the Minemoon. Using Tai's connection to Solo, Tai and Voe tracked him down there. During the ensuing skirmish, Tai tried to reason with Solo but was murdered by Ren, who deemed him unworthy. Consumed by rage and grief, Solo killed Ren and Voe, embracing the dark side. Taking the path of darkness, Solo became the Master of the Knights of Ren, adopting the name \"Kylo Ren\" and bleeding his kyber crystal."}, {"tag": "p", "text": "Solo turned to the dark side of the Force and became an apprentice of Snoke, joining the First Order and the Knights of Ren in the process and taking on the new identity of Kylo Ren. By the time of the outbreak of the First Order/Resistance War, Ren had gained a reputation of a \"Jedi killer\" due to Ren's skills with his lightsaber and his role in destroying Skywalker's new Jedi and his hopes of fully restoring the Jedi Order. Ren had become obsessed with fulfilling the legacy of his grandfather, but recognized him by his dark persona of Darth Vader rather than that of the redeemed Anakin Skywalker."}, {"tag": "h3", "text": "An awakening"}, {"tag": "p", "text": "As Luke Skywalker's efforts to rebuild the Jedi Order had seemingly failed, the Jedi Master's fabled return became a symbol of hope for those who believed in him and the Jedi. For others, he remained a myth, but he also posed a threat for those who feared his reappearance, such as Supreme Leader Snoke and the First Order, who believed Skywalker's return would also mean the rise of the new Jedi. It was by this time that an awakening occurred within the Force. Snoke and Ren both sensed it; Snoke was certain that as his apprentice grew stronger with the dark side, his counterpart in the light would rise as well. Convinced that it was Skywalker, Snoke directed Ren to seek out and destroy his former master."}, {"tag": "p", "text": "While Skywalker's location was unknown to the galaxy at large, his old ally, Lor San Tekka, came into possession of a piece of a star map to the first Jedi Temple some thirty years after the Battle of Endor. When the Resistance, a splinter cell of the New Republic Defense Force led by General Leia Organa that opposed the First Order, learned of this, General Organa dispatched Poe Dameron to attempt to retrieve the map from San Tekka's residence on Jakku. The First Order, however, also seeking Skywalker in an effort to destroy the last of the Jedi, likewise learned of San Tekka's findings and attacked Jakku in an effort to retrieve it. An astromech droid named BB-8, with the map in tow, successfully escaped from Jakku with the aid of a Force-sensitive scavenger named Rey and a First Order stormtrooper deserter named Finn, who previously helped Dameron escape the First Order's custody. They met and traveled alongside Han Solo and his Wookiee partner, Chewbacca, in a journey to return BB-8 to the Resistance."}, {"tag": "p", "text": "After a devastating attack against the New Republic's capital by the First Order's Starkiller Base, the Resistance sought to destroy the First Order superweapon. Once there, Han Solo attempted to turn his son back to the light, but he was killed by Ren instead, who was attempting to fully commit to Snoke and the dark side. Rey subsequently defeated Ren in a lightsaber duel and Starkiller Base was destroyed, after which the Resistance finally pieced together the map to Skywalker with help from R2-D2. Organa, relieved to finally find her brother, sought to bring him home. She sent Rey, along with Chewbacca and R2-D2, to Ahch-To, where the young girl found Skywalker among the refuge of the first Jedi temple."}, {"tag": "p", "text": "There, Rey presented the Jedi Master with his father's lightsaber—which he had lost on Cloud City decades prior— as a symbol of the only hope the galaxy had left in defeating Kylo Ren, Snoke, the First Order and Knights of Ren by bringing about the return of the Jedi Order."}, {"tag": "h3", "text": "Last of the Jedi"}, {"tag": "p", "text": "Rey was surprised to find that Luke Skywalker, the last Jedi, instead rejected her plea for help, tossing his father's lightsaber over his shoulder and confining himself within his hut near the first Jedi Temple. Undeterred, in part thanks to her past as a Jakku scavenger, Rey followed Skywalker as he carried on his daily routine despite Skywalker telling her and Chewbacca that he would not face down the First Order. Skywalker was intrigued by Rey, however, when she felt voices calling her through the Force to an uneti tree containing the sacred Jedi texts. After sneaking aboard the Millennium Falcon and being shown a hologram of his sister's call for help to Jedi General Obi-Wan Kenobi decades earlier by R2-D2, however, Skywalker changed his mind and agreed to teach Rey the ways of the Jedi—and why, in his mind, it was time for the Jedi to end."}, {"tag": "p", "text": "Meanwhile, however, a Force-bond had opened up between Rey and Kylo Ren, something that Rey decided not to tell her new master. When Skywalker discovered this, he abruptly ended his training of Rey, telling her to leave. After a brief duel, Skywalker finally confessed to Rey the truth of the night his nephew destroyed his fledgling Jedi Order. Rey, who had grown sympathetic to Ren's conflict over their shared feelings of abandonment, decided to leave Skywalker in an attempt to redeem Ren in the light side, as Skywalker had done to his father decades earlier."}, {"tag": "p", "text": "Rey traveled to the Supremacy, where Ren took her before his dark side master, Supreme Leader Snoke. Snoke proceeded to use the Force to tortuously probe Rey's mind, finding Skywalker's location. Snoke vowed to obliterate the last Jedi after dealing with the Resistance. Rey defied Snoke, trying to lash out at him; deeming her to have \"the spirit of a true Jedi,\" he commanded Ren to execute Rey. Instead, however, Ren used his grandfather's lightsaber to bisect the Supreme Leader. Ren and Rey then fought Snoke's Elite Praetorian Guard, defeating them. However, Ren did not turn back to the light side as Rey believed, rather he usurped his master, fully engrossed in the dark side. Ren offered Rey the chance to rule the galaxy by his side, but instead, the two fought over Skywalker's lightsaber, eventually tearing it in half using the Force, knocking both unconscious."}, {"tag": "p", "text": "After regaining consciousness, Rey escaped the Supremacy, regrouping with Chewbacca and R2-D2 above the Millennium Falcon. They came to the aid of the Resistance during Ren's siege of Crait—as did Luke Skywalker. After reuniting with his sister Leia, Skywalker faced his nephew before the First Order's army. However, Skywalker was in fact projecting himself across the galaxy from Ahch-To, buying time for the Resistance's survivors to escape. By the time Ren realized this, it was too late; the remaining survivors of the Resistance, including Poe Dameron, Finn, and Leia Organa, had escaped aboard the Millennium Falcon with Chewbacca and Rey, who Skywalker acknowledged as a Jedi. Skywalker's projection disappeared and back at the first Jedi Temple, Skywalker, having exerted a great amount of energy, passed away, becoming one with the Force before the twin suns of Ahch-To. Rey, meanwhile, had recovered Skywalker's lightsaber and began working with the Resistance on the process of building a rebellion against the First Order, while Skywalker's heroic tale spread across the galaxy, inspiring others as the First Order rose to power."}, {"tag": "h3", "text": "Return of the Sith"}, {"tag": "p", "text": "In the year following the Battle of Crait, Rey continued her Jedi training under Luke Skywalker's twin sister, Leia Organa, who had once briefly trained under her brother as a Jedi herself. Meanwhile, Kylo Ren and the First Order cracked down on any worlds that spread the tale of his defeat at the hands of Luke Skywalker. During that time, a cult of loyalists to the extinct Sith, the Sith Eternal, revealed themselves to the galaxy from the Unknown Regions by broadcasting the voice of the late Emperor Palpatine, the public identity of Darth Sidious, who was thought to be dead since the Battle of Endor. After obtaining a Sith wayfinder from Mustafar, Ren traveled to Exegol and found Sidious, who promised Ren the Final Order, a massive fleet of Xyston-class Star Destroyers, if he killed Rey, the last Jedi and the granddaughter of Sidious."}, {"tag": "p", "text": "After a series of missions, Rey was able to obtain Ren's wayfinder. However, through Kylo Ren, who she defeated in a lightsaber duel among the Death Star ruins on Kef Bir, Rey learned of her true lineage. Rey stopped at the first Jedi Temple on Ahch-To to exile herself as her master had, afraid of her powers and her potential for the dark side as a descendant of Darth Sidious. The spirit of Luke Skywalker appeared before Rey to motivate and encourage her, teaching his student one last lesson: that confronting fear was the destiny of all Jedi. Skywalker gave Rey his sister's lightsaber and lifted his old X-wing out of the Ahch-To seas with the Force, allowing her to use the wayfinder to travel to Exegol. Rey charted her path through hyperspace and transmitted the coordinates to the Resistance, allowing them to travel to Exegol as well."}, {"tag": "p", "text": "A battle erupted between the Resistance and the Sith Eternal as Rey confronted her grandfather, who offered her the Throne of the Sith and asked her to take her revenge for having her father and mother killed by sacrificing him as part of a ritual, allowing the Sith to reborn and ending the Jedi. However, a redeemed Ben Solo, who had renounced the dark side and shed his identity as Kylo Ren, arrived to help Rey. Solo defeated the Knights of Ren, but he and Rey were caught by Sidious, who learned that the two were a prophesied Force dyad. Sidious used their bond to heal himself, drawing on their combined life force to restore his body before tossing Solo into a nearby abyss to take his revenge on the Skywalker family for killing him years earlier at the Battle of Endor. Sidious then unleashed his Force lightning on the Resistance and their citizens' fleet above. However, Rey was able to reach out to the past Jedi. The Jedi Order was gone, but their strength remained."}, {"tag": "p", "text": "Upon hearing their voices call to her, Rey was strengthened and rose to face her grandfather. Sidious redirected his Force lightning towards Rey, who defended herself with the lightsabers of her masters. As Sidious boasted that he was all the Sith, Rey responded that she was all the Jedi, and she deflected Sidious's lightning back towards him, causing the Emperor to disintegrate and be destroyed at last, preventing the rebirth of the Sith."}, {"tag": "p", "text": "A massive explosion burst out and erupted, causing the Sith Citadel beneath Exegol to collapse and crumble on the Sith Eternal cultists. Rey sacrificed herself to stop the Emperor, but Solo, having survived and climbed out of the pit, gave his life to resurrect Rey. Although the Skywalker bloodline was extinct, their actions allowed the Jedi to live on. Some time later, Rey buried her mentor's lightsabers at the Lars moisture farm on Tatooine, the homeworld of the Skywalkers, and unsheathed her own lightsaber. When a local elderly woman stumbled upon Rey using her lightsaber, she asked the scavenger her name. Seeing the spirits of Luke and Leia in the distance, Rey responded that she was \"Rey Skywalker\"."}, {"tag": "p", "text": "In the aftermath of the First Order/Resistance War, the Jedi Order was still in the process of rebuilding itself. Rey eventually gained the status of Jedi Master while fighting to restore galactic peace, but the Order had not yet returned to its former glory."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "During the Imperial Era, the Jedi Order's reputation was maligned by the Galactic Empire. Grand Vizier Mas Amedda publicly denounced the Order as a symbol of fear and that their downfall marked the dawn of a new \"age of freedom.\" After the fall of the Empire, the Order's memory was rehabilitated in the form of a myth. The Jedi were romanticized during the New Republic Era, becoming deified symbols of a bygone era. Despite the Order's extinction, Supreme Leader Snoke endeavored to eradicate all traces of its past, believing that the Jedi inspired hope in the enemies of the First Order."}, {"tag": "p", "text": "Luke Skywalker, a legendary Jedi Master, devoted years to rediscovering the Order's history which he chronicled in the book The Secrets of the Jedi. Although Skywalker held individual Jedi, such as Mace Windu or Qui-Gon Jinn, in high esteem, he became disillusioned by the Order's actions toward the end of its history prior to the rise of the Empire. He faulted the Order for not thwarting the machinations of Darth Sidious, causing the extinction of the Jedi. Skywalker also believed that his old mentor, Obi-Wan Kenobi, was responsible for his father's transformation into Darth Vader. After his faith in the Jedi was restored by Rey and Yoda, Skywalker's final stand allowed the legend of the Jedi to spread once more, bringing hope to the galaxy as the First Order advanced. Depsite being almost extinct, the Galaxy views Rey as their last hope, drawn into recruitment to the Resistance because of her, and people patted her on the back for killing Palpatine."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi Order first appeared in Star Wars: Episode I The Phantom Menace. The lore of the Jedi Order and of the Force was greatly expanded upon during the Star Wars: The Clone Wars TV series. The role of the Jedi Order in preserving the peace of the Republic and later the controversy of them stepping into the role of military leaders is a pivotal plot point that eventually leads to the Order's downfall in Star Wars: Episode III Revenge of the Sith. Prior to that, they had been mentioned indirectly as the Jedi in the original trilogy as Luke Skywalker encounters Jedi Master Obi-Wan Kenobi and later Master Yoda. In Star Wars: Episode VI Return of the Jedi, Yoda charges Luke with carrying on the lessons and legacy of the Jedi Order."}, {"tag": "p", "text": "The Jedi Order originated in the rough draft of Star Wars as the Galactic Emperor's bodyguard. They became affiliated with the Republica Galactica in the second draft. Later, when composing background information for licensees in 1977, George Lucas described the Jedi Order as being \"several hundred thousand\" strong before the Purge."}, {"tag": "p", "text": "For the word \"Jedi,\" Lucas took inspiration from the Japanese term \"Jidaigeki,\" which refers to a drama set during the Edo period of Japanese history, when samurai were still in activity."}, {"tag": "p", "text": "Luke Skywalker's new generation of Jedi was first mentioned in the 2015 film Star Wars: Episode VII The Force Awakens, along with the film's novelization and junior novelization. Further background details about the Jedi and their massacre, which saw the end of Luke's students, can be found in the reference book Star Wars: The Force Awakens: The Visual Dictionary by Pablo Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}