{"url": "Jedi_Quest:_The_Changing_of_the_Guard", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Book stubs", "Category:Star Wars: Jedi Quest (novel series)"], "nodes": [{"tag": "h1", "text": "Jedi Quest: The Changing of the Guard"}, {"tag": "p", "text": "The Changing of the Guard is the eighth in a series of young reader novels that chronicle the adventures of Obi-Wan Kenobi and Anakin Skywalker between Star Wars: Episode I The Phantom Menace and Star Wars: Episode II Attack of the Clones."}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The planet of Romin is a hotbed of villainy and corruption. It is a refuge for criminals from across the galaxy—including evil scientist Jenna Zan Arbor, an arch-enemy of the Republic."}, {"tag": "p", "text": "In order to foil Zan Arbor's insidious plans, Obi-Wan Kenobi, Anakin Skywalker, and a team of Jedi must infiltrate Romin—disguised as a band of thieves. Where lawlessness is the law, the Jedi will have to master the art of deception to trap a master deceiver."}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "Evil scientist Jenna Zan Arbor is hiding on Romin. The ruler of the planet, Roy Teda, is a dictator who shields criminals in exchange for large sums of money. Obi-Wan and Anakin team up with Siri and Ferus, taking on the identities of the Slam gang, in order to get onto Romin and capture Zan Arbor."}, {"tag": "p", "text": "When they arrive on the planet, the are contacted by the leader of the Romin citizen resistance, Joylin. They agree to help the resistance to overthrow the current oppressive government in exchange for Zan Arbor's safe extrication from the planet. But after the plan falls apart, the Jedi receive a call from the escaped Teda and Zan Arbor, requesting to meet with them."}, {"tag": "p", "text": "After their Slam-gang cover is blown, the Jedi are left to fight the rest of Teda's army until they receive assistance from a Jedi rescue team, which includes Jedi High Council member, Master Mace Windu. After arriving back at the capital, the Jedi approach Joylin. Soon after, they realize that Joylin was bribed by Zan Arbor to set her free along with Teda. The two criminals escape the planet, but with a tracking device placed on their ship by Anakin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}