{"url": "Jedi_Search", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: The Jedi Academy Trilogy"], "nodes": [{"tag": "h1", "text": "Jedi Search"}, {"tag": "p", "text": "Jedi Search is a Star Wars Legends novel written by Kevin J. Anderson. It is the first volume of Star Wars: The Jedi Academy Trilogy, and it was first published in paperback by Bantam Spectra on February 1, 1994. A sequel, Dark Apprentice, was published later that year."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "As the war between the Republic and the scattered remnants of the Empire continues, two children—the Jedi twins—will come into their powers in a universe on the brink of vast changes and challenges. In this time of turmoil and discovery, an extraordinary new Star Wars saga begins…."}, {"tag": "p", "text": "While Luke Skywalker takes the first step toward setting up an academy to train a new order of Jedi Knights, Han Solo and Chewbacca are taken prisoner on the planet Kessel and forced to work in the fathomless depths of a spice mine. But when Han and Chewie break away, they flee desperately to a secret Imperial research laboratory surrounded by a cluster of black holes—and go from one danger to a far greater one…."}, {"tag": "p", "text": "On Kessel, Luke picks up the trail of his two friends, only to come face-to-face with a weapon so awesome, it can wipe out an entire solar system. It is a death ship called the Sun Crusher, invented by a reclusive genius and piloted by none other than Han himself…."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Han Solo and Chewbacca travel to Kessel as representatives of the New Republic, but are attacked and imprisoned by the ragtag forces of Moruth Doole. Doole fought for and won control of the spice mining planet and its prison facilities after the fall of the Galactic Empire, and holds a grudge against Solo from their smuggling days. Han and Chewbacca are forced to mine luminous glitterstim in the underground darkness where it grows."}, {"tag": "p", "text": "On Coruscant, Luke Skywalker is given governmental permission and resources to search for any Force-sensitive individuals that may be left scattered across the galaxy, in hopes of founding a new Jedi academy. He eventually finds Gantoris on Eol Sha and Streen on Bespin. Lando Calrissian's search of another lead on Umgul does not pan out, but does lead to an unexpected and much-needed financial payoff."}, {"tag": "p", "text": "Leia Organa Solo tries to balance her governmental duties with the return of her two older children, the toddlers Jaina Solo and Jacen Solo, from protective hiding. Han's disappearance weighs heavily on her mind, although he and Chewbacca manage to escape with fellow slave Kyp Durron, only to stumble on Maw Installation, a secret, hidden Imperial military research-and-development facility home to a Death Star prototype. Its residents are waiting in vain for Grand Moff Tarkin to send orders to deploy the deadly Sun Crusher."}, {"tag": "p", "text": "Han convinces scientist Qwi Xux of the evil her creations are used for, causing her to help steal the Sun Crusher and defect with the escaped prisoners. Kyp uses his latent Force abilities to guide the ship around a maze of black holes where they run into the recaptured Millennium Falcon, piloted by Luke and Lando. The pursuing fleets of Kessel and Maw Installation are left to battle each other."}, {"tag": "p", "text": "Meanwhile, Leia and Mon Mothma select the moon Yavin 4 as the location for a new Jedi academy. Luke is pleased with the selection, and invites Kyp Durron to join in future training."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "In the novel, Luke thinks back to his duel with Darth Vader on Bespin and recalls that Vader told him, \"Luke, I am your father!\" In Star Wars: Episode V The Empire Strikes Back, in which the duel appears, Darth Vader's actual quote is, \"No, I am your father.\""}, {"tag": "p", "text": "In The Essential Reader's Companion (2012), the events of Jedi Search are dated to 11 ABY, being placed after the comic book miniseries Star Wars: Empire's End (1995) and before Dark Apprentice (1994)."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}