{"url": "Jedi_Shuttle_634", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Eta-class shuttles", "Category:Galactic Republic starships", "Category:Jedi starships"], "nodes": [{"tag": "h1", "text": "Jedi Shuttle 634"}, {"tag": "p", "text": "Jedi Shuttle 634 was an Eta-class shuttle and served as a Jedi ambassadorial shuttle during the Clone Wars. It was flown by Anakin Skywalker and Obi-Wan Kenobi, as well as Ahsoka Tano to the planet Mortis."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Galactic Republic picked up a 2,000 year old distress signal, the Jedi High Council sent Obi-Wan Kenobi and Anakin Skywalker along with his Padawan Ahsoka Tano to investigate this mystery on this ship."}, {"tag": "h3", "text": "Mission to Mortis"}, {"tag": "p", "text": "Fearing that it may be a Separatist trap, the three Jedi were to meet up with Captain Rex in a heavily armed cruiser. Both groups were at the rendezvous point but weren't able to see each other. Captain Rex confirmed that they were indeed in the same location. Then the shuttle was suddenly pulled into a monolith which caused the three Jedi to black out."}, {"tag": "p", "text": "Once the three woke up, the shuttle was safely on the ground of a mysterious planet known as Mortis that was strong with the force. The three were then approached by Daughter who attempted to bring them to Father but were separated into groups after a rockslide. Obi-Wan and Ahsoka decided to head back to this shuttle but was mysteriously gone and were approached by Son."}, {"tag": "p", "text": "After finishing the test the Jedi attempted to leave the planet onboard this shuttle with the permission of Father but were infiltrated by Son who kidnapped Ahsoka causing Kenobi and Skywalker to go back for her. This shuttle then crashed in a field near the tower where Ahsoka was taken."}, {"tag": "p", "text": "After freeing Ahsoka from the tower she offered to fix this shuttle but was unable to fix the heavily damaged ship. Once the harsh battle that took the lives of Daughter, Son, and Father ended, the crystal above the monastery fell and hit the tip of the tower causing it to shatter, making the three black out again. When they awoke they found themselves in space inside this shuttle and were contacted by Rex. The three were confused to learn that it had been only moments since they had lost contact."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}