{"url": "Jedi_Shadow", "categories": ["Category:Legends articles", "Category:Jedi Consulars", "Category:Jedi Sentinels", "Category:Jedi Shadows", "Category:Law enforcement ranks", "Category:Jedi ranks"], "nodes": [{"tag": "h1", "text": "Jedi Shadow"}, {"tag": "p", "text": "A Jedi Shadow was a Jedi Sentinel who had pursued a unique focus of training. Working directly under the Council of First Knowledge, Shadows were sent to destroy anything and everything connected with the Sith and their followers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Dating back as far as the Great Hyperspace War, the Jedi Shadows were dispatched in its aftermath to find and destroy any artifacts left behind by the seemingly destroyed Sith Empire. This led to the destruction of Sith amulets, talismans, and other relics that were tainted with the power of the dark side of the Force. However, Sith artifacts continued to exist, even during the years of the Great Sith War, when it was believed that the menace of the Sith had ended. Jedi Shadows usually wore white/black robes occasionally donning armoured leg plating and/or chest plating (this was due to the fact that they were trained to always expect a battle). Jedi Shadows were prone to carrying double-bladed lightsabers."}, {"tag": "p", "text": "After the Great Sith War, a secret fringe group known as the Jedi Covenant used Consulars for the same purpose as the Shadows, using visions to remain vigilant for any sign of the dark side. Under the instruction of retired Jedi Master Krynda Draay, a secret group of Shadows was created by deleting records of willing Jedi or by falsifying their deaths on long missions. These Jedi, including Celeste Morne, were all but extinct following the failed Vindication of Haazen during the Mandalorian Wars."}, {"tag": "p", "text": "During the Great Galactic War and the Cold War, Jedi Shadows were employed by the Galactic Republic against the returned Sith Empire. These shadows were specialized Jedi Consulars."}, {"tag": "p", "text": "Over the next millennia, the Shadows were still in use, striking down enemies of the light and ensuring the continued peace within the Galactic Republic. Some of the last Shadows of the Order existed during the Clone Wars, including Jedi Master Taria Damsin and Jedi Knight Maw; the latter was corrupted by the Inquisitor Jerec following the Great Jedi Purge."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "Dubbed Shadows, and mostly made up of elite Jedi Sentinels, these Jedi became what their name suggested; shadows of themselves and the Jedi Order. Working in secrecy, the First Knowledge Council would hand pick the ranks of this task force and send its members to locations strong in the dark side of the Force, in hopes of vanquishing whatever artifact or dark side practitioner that may be causing the disturbance. Often engaged in information-gathering roles, Shadows were always sure to obtain all possible data on their target before making a decisive blow against them. Due to their missions, Jedi Shadows were often noted for being loners with a black-and-white perception of the world around them. This could manifest itself as paranoia, wherein they saw signs of the dark side in everything, including their own comrades. As such, they were often deployed cautiously and only in times after a great conflict. Shadows did not hesitate in their duty and were willing to betray those that they considered evil, but they often practiced restraint, as they recognized that their definition of such foes did not always match those of the Council. Some among their rank believed that more aggressive actions were needed in order to destroy the followers of the dark side."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi Shadow is also the name of an advanced class for the Jedi Consular class in the Star Wars: The Old Republic MMO video game. This advanced class specializes in the use of the double-bladed lightsaber, stealth, and dealing bursts of damage in battle. They additionally can be able to tank, using Force Powers and Lightsaber skills to protect the Shadows and their allies. The Imperial counterpart for this archetype is the Sith assassin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}