{"url": "Jedi_Temple_(Auratera)/Legends", "categories": ["Category:Legends articles", "Category:Auratera locations", "Category:Buildings", "Category:Jedi temples"], "nodes": [{"tag": "h1", "text": "Jedi Temple  (Auratera)"}, {"tag": "p", "text": "The Jedi Temple at Acablas was a series of temples built and rebuilt many times by the Jedi Order at the site of a vergence in the Force known as Acablas on the planet Auratera. The last temple constructed at Acablas was built at the end of the New Sith Wars when the Jedi Order regained control of the planet and destroyed the Sith Temple there."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built and rebuilt over the millennia, the Jedi Temple of Auratera was built on the lip of Aca's Funnel at the Acablas vergence. Constructed on the site of several ancient temples, the Jedi Order's structure was a series of old and new architecture that formed a winding and labyrinthine structure. During the New Sith Wars, the Temple was destroyed and only rebuilt after the conflict ended. Under the control of Jedi Master Nareen Cale, the Temple's location, as well as all star charts describing the facility's location were altered to protect the facility from falling into the hands of the Sith ever again. Because the local populace had grown war-weary from the constant fighting between Jedi and Sith, the Order did not use the site as an active temple but used it instead as an archaeological site. When the Clone Wars erupted across the galaxy, the Jedi Master and their apprentice who served as caretakers of the site were recalled to Coruscant and left the care of the facilities in the hands of droids. With the caretaker gone, the Temple and its surrounding buildings were forgotten; plant life and wild animals returned to the area, and the auxiliary buildings began to crumble and fall apart in storms."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Built on the ruins of older temples, the two towers of the Jedi Temple flanked a taller central building that overlooked Aca's Funnel. The main entrance to the Temple was located atop a monumental stair that led halfway up the funnel's outer slope. The Temple's exterior was dotted with stone overlooks where Jedi would train at lightsaber combat and meditation. Because of its close proximity to the vergence, it was unsafe for Padawans and even Knights to reside within the Temple. To this end, auxiliary buildings were constructed nearby from stone and metal around the landing zone used by the Order's ships. Apart from serving as residence halls, these buildings contained research and data storage facilities, gardens, training rooms, dining halls, and repair bays."}, {"tag": "h2", "text": "Sources"}]}