{"url": "Jedi_Temple", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Coruscant government buildings", "Category:Galactic Republic locations", "Category:Jedi Temple locations", "Category:Jedi temples", "Category:Libraries", "Category:New Republic locations", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Jedi Temple"}, {"tag": "p", "text": "The Jedi Temple (also known as the Palace of the Jedi) was the headquarters of the Jedi Order from the conclusion of the Great Sith War to the Great Jedi Purge and during that time was home to its major training, bureaucratic and dormitory facilities. Jointly operated by the Order and the Galactic Republic, the Temple was sealed to all but the Jedi and their allies, with very few public areas. The complex would be abandoned and largely destroyed at the time of the Declaration of a New Order when the Order was utterly routed by the Galactic Empire. Upon the rise of the Galactic Alliance, the Temple was rebuilt for the reformed Order under the leadership of Luke Skywalker."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Old Republic"}, {"tag": "p", "text": "The Coruscant Temple's origins date back to 5000 BBY when, at the beginning of the Great Hyperspace War, the Galactic Republic granted the Jedi land on Coruscant over the sacred spire, which contained a Force nexus. A holy place for the local Coruscanti, the Republic hoped by granting the Order land they would build a massive fortress like those they had established on Ossus, Falang Minor, and Haashimut. However, the Order did not wish to entangle themselves with the politics of the capitol or become a symbol of war and opted to build only a small meditative enclave. It wasn't until the Old Sith Wars saw the devastation of Ossus and the Great Jedi Library located there that the Order decided to re-establish its academy at the sacred spire. At the behest of the Order's wisest thinkers, the Four Masters began the painstaking task of building the Temple Ziggurat. Growing steadily for the next thousand years the Temple incorporated various pieces of historical works and architecture from their past, including tiles and stained-glass mosaics from the lost complex on Ossus."}, {"tag": "p", "text": "Following the construction of the four Jedi Council spires, the Jedi High Council moved from their temporary meeting place and permanently relocated to the High Council Chamber at the top of the northwestern tower. As the Order became more and more tightly-linked to the Republic they protected, the Order closed some of its satellite facilities and began moving all artifacts from Exis Station to the Temple's Archives. After the failed Jedi Conclave at Katarr, the Temple was abandoned as the remaining Jedi Knights went into hiding as Darth Nihilus and Darth Sion began the First Jedi Purge. Abandoned for only a brief period, the Jedi reorganized and returned to the Temple following the defeat of both the Sith Lords."}, {"tag": "p", "text": "For the next 300 years the Temple would stand as a beacon of the Jedi's light in the galaxy, aiding the ailing Republic during the trying Great Galactic War. It was at the climax of this conflict that a dormant Sith Empire returned to the known galaxy and struck at the Temple during the Sacking of Coruscant in 3653 BBY. Marching up to the gates of the Temple, a raiding party of Sith led by Darth Malgus entered the Temple and slaughtered the complex's main line of defense in order to shut off Galactic City's security network. Once dismantled, Malgus' assault team planted bombs within the Temple and detonated them when the Sith fleet opened fire from the skies. The exterior of the Temple crumbled, the four stately towers falling upon the tiled roof, an empty ruin of its former self. However, much of the interior remained intact, symbolic of the Order's state of affairs following the attack."}, {"tag": "p", "text": "After the signing of the Treaty of Coruscant the Galactic Senate voted to hold off on rebuilding the Temple indefinitely due to the lack of funds. Interim Supreme Chancellor Paran Am-Ris informed Grand Master Zym of the vote and was promised that the Temple would eventually be rebuilt and the Sith routed. Soon after, Grand Master Zym was anonymously summoned to the Temple ruins in order to receive an important message. Discovering Commander Gin Lesl amongst the rubble, Zym assumed that she was prepared to tell him something. However she was just as confused as the Kel Dor Jedi. It was at that point the bounty hunter Braden revealed that he had information regarding the Sith assault on the Envoy and the subsequent death of Master Dar'Nala. Commander Lesl was confused as to why she had been summoned before Braden shot her for having him arrested on Dantooine. Drawing his lightsaber Zym demanded that Braden allow him to arrest him; Braden refused and attacked, killing the Jedi Grand Master and leaving both bodies amongst the ruins."}, {"tag": "p", "text": "Following the defeat of the Sith Empire the Order was able to rebuild the Temple. Expanding over the next three millennia, with major additions beginning circa 3500 BBY, seeing the completion of the Jedi Archives circa 2519 BBY, another addition in 2000 BBY, and the rebuilding of the Temple Spires in 1019 BBY. It was only after the defeat of the Brotherhood of Darkness during the New Sith Wars and the end of the Republic Dark Age that the Temple would see its reconstruction completed with the refocusing of the Order at the Ruusan Reformation. Consolidating most of their efforts on Coruscant, the Order closed most of their satellite facilities and dismantled the Army of Light and began getting away from the militaristic teachings left over from the war with the Sith. With the Sith believed to be extinct, the Order and the Republic entered into a time of peace and prosperity known as the Golden Age. Unbeknownst to the Jedi, the Temple had been infiltrated by one of the last Sith following the Reformation. Darth Zannah, apprentice to Darth Bane, scoured the Archives in the guise of Padawan Nalia Adollu in order to find a cure for the orbalisks that were killing her master. Discovering the Sith too late, a task force was sent to defeat the Sith on Tython. The mission failed but was erroneously deemed a success and the Sith managed to avoid Jedi detection for the next thousand years."}, {"tag": "h3", "text": "The Fall of the Jedi"}, {"tag": "p", "text": "Following nearly a thousand years of peace, the Order was threatened by a new darkness. The future became even more clouded than was usual, the High Council could not predict events or sense disturbances as it once could. It was during this time of uneasiness in the ranks of the Order that the Temple became prone to attack."}, {"tag": "p", "text": "The Temple first came under siege in 44 BBY when a series of robberies plagued the Temple. The High Council ordered Masters Qui-Gon Jinn and Tahl to uncover the thief and present him before the Council for judgment. Ranging from shredded tunics to missing training lightsabers, the threat became more serious when the Healing Crystals of Fire went missing. Even more extreme, while he wandered through the Room of a Thousand Fountains, an attempt was made on Grand Master Yoda's life. While Yoda came away unscathed, the entire Temple was stricken with fear as its walls were no longer a buffer against attack. When it was discovered that apprentice Bruck Chun was working in league with the mysterious intruder, the Dark Jedi Xanatos, Masters Jinn and Tahl began pondering on what Xanatos' true intentions were. Gathering information from Master Yoda the two investigating Jedi deduced the Dark Jedi was after the vertex stored in the Temple Treasury. Planning on setting a trap while Tech Specialist Miro Daroon began cycling the sabotage Temple power grid, Jinn and his Padawan managed to lure Xanatos and Chun to the top of the High Council Tower. While Jinn was able to protect the Temple and recover the Healing Crystals, Xanatos escaped to plague the Order for a time, while Chun was defeated by Obi-Wan Kenobi and accidentally killed, having fallen off a waterfall in the Room of a Thousand Fountains. The Temple was also referred to as the Palace of the Jedi."}, {"tag": "p", "text": "Eleven years after Xanatos' invasion as the Force grew more and more murky, The High Council dispatched six of its members along with several other members of the Order to put an end to the Yinchorri Uprising. Taking advantage of the absence of High Council members, the mysterious Dark Lord of the Sith Darth Sidious orchestrated an assault on the Temple. Hiring a terror group of Yinchorri they silently landed on the Temple Ziggurat and entered through the Atrium off the High Council Tower. Inside the invaders found the accommodation sector abandoned and were eventually met with a group of Jedi led by Grand Master Yoda. When the Yinchorri attacked, the Jedi were able to defeat them all, suffering only the deaths of Jude Rozess and Tieren Nie-Tan."}, {"tag": "p", "text": "When the High Council became aware of a Sith resurgence following the Invasion of Naboo and the appearance and subsequent death of Darth Maul, they began to prepare themselves for an inevitable confrontation. Adding new hangar facilities to the Council Towers during the Separatist Crisis to house the Order's new Delta-7 Aethersprite-class light interceptor, the Council caught the flak of the People's Inquest group. Demanding that the Council release its financial reports, they would gain further fuel during the \"Baby Ludi\" custody case when an Ord Thoden woman accused the Order of kidnapping her daughter, Ludi Billane. Camping outside the Temple's main entrance, the Inquest movement saw escalation when a group of University of Coruscant students breached the Second Atrium of the public entrance during the early morning. As two Padawans attempted to calm the riotous students who were throwing graffiti bombs across the Atrium, Masters Koon and Mundi quickly disposed of the marchers with a Jedi mind trick. The students were then cuffed and handed over to Judicial officers and hauled away. When the High Council decided to transport the child in question to the Kamparas Training Facility the protesters who had camped outside the complex for months began a rally led by Firris Palbert. Attempting to provoke the Jedi the group yelled into loudhailers but were only met by Judicial Cerisa Vosengoor who dismissed the claims of Jedi tyranny."}, {"tag": "p", "text": "When the Clone Wars erupted across the galaxy the Temple became a major military planning center as the Jedi took up the mantle of General within the Grand Army of the Republic. With Jedi Command now reviewing and appraising all battle plans and major military campaigns, the High council was in near constant communications with the Office of the Supreme Chancellor. Chancellor Palpatine and several Senators would make several visits to the Temple during the war; an event that was, at most, uncommon pre-war time. The Temple began to show signs of wear as time once devoted to polishing marble floors and cleaning the bronzium gutters of the exterior was diverted to more urgent tasks such as maintaining the Order's spacecraft."}, {"tag": "p", "text": "Darth Sidious would continue to cause problems for the Temple during the war. Ten months into the war Count Dooku, Head of State of the Confederacy of Independent Systems, led his Droid Army and the Dark Acolyte Trenox into the Temple on a mission to destroy the invaluable Temple Archives. Jedi Knight Anakin Skywalker was at the Temple when the Sith led army entered the Archives and was able to kill Acolyte Trenox and defeat the C-B3 cortosis battle droids that sought to destroy the Stacks. While Skywalker dealt with the droids, Dooku was able to steal a precious holocron from the repository of knowledge and flee the Temple unscathed. The Temple Library would soon after be attacked by Sith-employed bounty hunters Cad Bane and Cato Parasitti. Using schematics provided by Sidious, Bane circumvented the exterior defenses and was able to navigate the ventilation system with the help of Parasitti, who was stationed in the Library in the guise of Master Ord Enisence. While Parasitti would be captured by Padawan Ahsoka Tano, Bane was able to distract the other Jedi long enough for him to break into the Holocron Vault and escape the planet."}, {"tag": "p", "text": "Sometime in 20 BBY one of the hangers of the Jedi Temple was bombed. A further investigation at the hands of Anakin Skywalker and his Padawan Ahsoka Tano led to the arrest of Letta Turmond who planted nano-droids in to her husband, a Temple worker blowing up the hanger."}, {"tag": "p", "text": "In 19 BBY following the Battle of Coruscant and the work done by Judicial Captain Dyne, the High Council came to be suspicious of the Office of the Supreme Chancellor and linking Darth Sidious to influencing the Chancellor. It was eventually discovered by Knight Anakin Skywalker, following the defeat of General Grievous on Utapau, that Chancellor Palpatine and Darth Sidious were one and the same. Moving to remove the Sith, Masters Mace Windu, Agen Kolar, Kit Fisto, and Saesee Tiin, left the Temple in the care of Master Shaak Ti and Gate Master Jurokk. Turning off all nav beacons and signal lights, arming all of the older Padawans, and sealing all blast doors, the Temple was prepared for a Sith attack. The duel with the Sith turned sour, however, as Jedi Knight Skywalker betrayed his masters and aided Sidious in the murder of Master Windu. Sidious ordered that Skywalker, now Darth Vader, Dark Lord of the Sith, raid the Temple with the assistance of the 501st Legion. Marching on the Temple steps, Vader slew the unsuspecting Gate Master Jurokk and began the brutal slaughter of every Jedi present. While many Jedi were dying around the galaxy as part of Order 66, many of the Order's brightest died at the Temple. Vader stormed the Archives and slew Chief Librarian Jocasta Nu as she refused access to the Temple beacon. Jedi Battlemaster Cin Drallig led a final stand of younglings and Padawans in the Fountain Room but was unable to defend his charges from the superior number of blaster bolts. Additionally, Three Jedi Masters attempted to retake the Archives from the 501st, but were all defeated."}, {"tag": "p", "text": "Although many Jedi and Temple employees died within the Temple that night, Jedi Master Shaak Ti led a retreat of a group of several Padawans and their masters. Master Kazdan Paratus was another Jedi who escaped the Temple safely, fleeing to Raxus Prime to live in madness having failed to save the Temple. Securing the building, Vader reported to his new master before being sent to Mustafar to slaughter the Separatist Council stationed there."}, {"tag": "h3", "text": "Abandonment"}, {"tag": "p", "text": "Following the Declaration of a New Order and the rise of the Galactic Empire the Sith used the Temple as a trap. Broadcasting a false signal to surviving Jedi telling them to return to the Temple as the Clone Wars were over, the Empire planned to execute the survivors of Order 66 as they returned to their home. Fortunately for the remaining Jedi, Grand Master Yoda and Master Obi-Wan Kenobi had been rescued by Senator Bail Organa and decided to return to the Temple and deactivate the beacon. Entering through a sublevel hangar the Jedi slew Decoy Squad Five and made their way through the Temple until they reached the central security station where they were able to recalibrate the beacon to warn the survivors to run and hide. While there Kenobi delved into the security holos and confirmed his worst fear, the man behind the slaughter was Anakin Skywalker, his former student and friend. The two Jedi separated in order to hunt down the two Sith and kill them; neither succeeded but Vader was critically injured, setting back Sidious's expectations for him."}, {"tag": "p", "text": "After checking the names of the dead off against the Archives roster, the clone troopers dragged the bodies of the dead Jedi out onto the public steps and heaped them on a make-shift pyre for all passersby to see. In the days following the Temple's occupation, a group of Jedi gathered in the crowd outside the public entrance, though only one stepped forward. This lone Jedi attacked the troopers stationed on the steps, urging his brother and sister Jedi to join him, only to be cut down by a hail of blaster fire."}, {"tag": "p", "text": "Vader would be sent back to the Temple by his master in order to retrieve the Sith holocrons stored there. Vader knew this to be a test of his will, if he could pass through the Force-imbued Temple without succumbing to the horrors wrought there he would be commended. Vader was accompanied by Head of Imperial Intelligence Armand Isard whose men had detected a hacker in the Archives. Vader suspected that it was Purge fugitives Roan Shryne and Olee Starstone. While Isard got a location for the two Jedi, Vader wasn't able to get to them before they slipped away again. The Imperials failed to detect Padawan Ekria, who was able to slice into the database and delete all records of herself and fellow Padawans Drake Lo'gaan and Zonder."}, {"tag": "p", "text": "Jedi and Sith were not the only visitors to the Temple following its abandonment. Captain Gregar Typho, the former bodyguard of the deceased Senator Padmé Amidala, broke into the Temple in an attempt to discover the cause of her death. While rummaging through the Temple Library Typho encountered the bounty hunter Aurra Sing, who was searching the Temple for details on the whereabouts of the Jedi Jax Pavan. In the resulting duel Sing was knocked unconscious and Typho escaped unscathed and none the wiser of Amidala's death."}, {"tag": "p", "text": "With the Temple largely cleared of all valuable information by the Dark Side Adepts, the Empire maintained a small presence to maintain defenses in the event of a Jedi intrusion. Grand Inquisitor Malorum set up his office in the Temple, operating out of the former living quarters of the Grand Master. While Malorum was meeting with Darth Vader in the Temple's main levels, ex-Jedi Ferus Olin and his friend Trever Flume infiltrated his office and began searching for information on Polis Massa on behalf of Master Obi-Wan Kenobi who had ordered the mission. Eventually Malorum and Vader returned to the office and, with no other choice, Olin and Flume leapt out the window and managed to escape to Coruscant's Underworld. Shortly after Olin returned to the Temple, this time with Master Fy-Tor-Ana accompanying him and Flume. Using Master Ana's knowledge of the Temple's additions during the Clone Wars, the three were able to use a maintenance hatch to infiltrate the Storage Level. While searching for a rumored Jedi prison, the group would discover that in fact that no prison was there, simply a large storage chamber filled with the lightsabers of their slain brother and sister Jedi and a motion sensor that would summon stormtroopers to their position. Fleeing through the Temple, the group discovered that the complex was rigged to implode using a device placed in the Temple's core by Inquisitor Malorum. Refusing to leave the Temple to be utterly destroyed, the Jedi plus Flume raced to the Temple's reactor core and, using Flume's talents with explosives, were able to deactivate the weapon. While their mission seemed a success, Olin was captured by stormtroopers before he could follow Ana and Flume to safety."}, {"tag": "p", "text": "While Olin managed to escape Sith custody several months later, he was struggling with the powers of a Sith holocron that he had been given by Darth Sidious. Returning to the Temple to uncover the truth behind the supposed resistance leader Flame, Olin realized that the woman was really working for the Empire. Olin attempted to contact the Resistance members that were meeting with the traitor but was unable to prevent their slaughter. Before escaping the Temple, Olin was confronted by the dreaded Sith Lord Darth Vader. The confrontation between Vader led Olin to the Chambers of the High Council before Olin was cut down in the High Council tower atrium. Believing Olin was dead, Vader left the Temple and his body to rot; however Olin was indeed alive and escaped the Temple for the final time."}, {"tag": "p", "text": "Activity at the Temple slowly dwindled to only a small group of troopers charged with keeping out intruders. Completely secured, Emperor Palpatine had some areas modified to encourage the idea that the ancient Order were indeed a cruel and malevolent threat all along. Archived data was changed to make Masters appear as corrupt as the Separatist leaders, and Sith statues further discredited the Order. All of this propaganda was set up in anticipation of Palpatine's guided tours through the Temple—an honor reserved for the Empire's most high-ranking members and the elite-of-the-elite. Stationed at every entrance, Shadow Troopers protected the Temple's treasures under the command of Imperial Senate Sentinels."}, {"tag": "p", "text": "In 2 BBY, following years of undisturbed ruin, Darth Vader sent his secret apprentice, Starkiller, to the Temple to complete the Jedi Trials. On Starkiller's first mission he defeated the troopers stationed at the Temple steps and confronted the simulacrum of Sith Lord Darth Desolous in the Jedi Trials Chamber. Fighting the illusion, the assassin emerged victorious and left the Temple before reinforcements arrived. Soon after, Starkiller returned and broke into the Archives to complete the Trial of Insight before hunting down the elusive Jedi Master Shaak Ti. In the Archives, Starkiller met blades with a simulacrum of Darth Phobos and overcame her illusionary tricks before defeating her. It would be several months before Starkiller would return to finish his Trials, but this time he would do so on his own accord, not under the commands of Lord Vader. During this mission in the Temple, Starkiller entered the Tower of First Knowledge and defeated the troopers stationed within. Entering into the Holocron Chamber, Starkiller was ordered by the Gatekeeper of a large holocron to delve into the depths of the Temple and complete the Trial of the Spirit. Within the ruins of the Temple's basement, the assassin was able to defeat a mirror of himself and left the Temple for the third and final time."}, {"tag": "p", "text": "Standing as a symbol of what happens to those who defy the Empire, the Temple would survive past the destruction of the second Death Star, 23 years after its initial abandonment. It wasn't until the New Republic drove the Empire from Coruscant that the Temple would be visited again. With the capitol in the hands of the Republic, Luke Skywalker travelled to the ancient edifice in order to learn what he could of his lost heritage. Once Skywalker decided to revive the Order he invited one of his students, Tionne, to restore the Archives to their former glory and to add information from the Galactic Civil War. Eventually the Temple's five towers crumbled during the catastrophe with the Lusankya and were cleared away, their places filled with a new enclave that served as a diplomatic way-point and a training ground for new Jedi away from the Jedi Praxeum on Yavin 4. It was here that Skywalker held his wedding ceremony to Master Mara Jade. The facility would remain in use until the Order was forced to withdraw back into hiding when the Yuuzhan Vong invaded the galaxy and captured Coruscant."}, {"tag": "p", "text": "During the war Masters Skywalker and Knight Tahiri Veila journeyed to a \"Vong-formed\" Coruscant after receiving a dark vision. Along their travels along the planet's surface, the Jedi team was led to the Temple's ruins by a deranged figure known to the Coruscanti he had enslaved as Lord Nyax. Amongst the ruins of the Temple the Jedi found Nyax's slaves hard at work destroying the old structures encasing the Force-nexus at the heart of the sacred spire. Determined to prevent a disaster in the Force, the Jedi engaged Nyax in a fierce battle which saw the further destruction of the once mighty complex. Fueled by the unlimited wellspring that was the sacred spire, all four combatants were equally matched. Eventually Veila was able to injure Nyax having diminished her presence in the Force long enough to get close to the Dark Jedi. Using razor bugs to do her work, Veila pierced Nyax's armor deep enough to causing him to lose the battle. Before he could rise again two Yorik-et fighters opened fire on him and destroyed him. Before his death Nyax imbued his hate and despair on the sacred spire, muddying the Force energies emanating from its peak."}, {"tag": "p", "text": "Within weeks of Nyax's death, the imprisoned Jedi Jacen Solo was chased to the ruins of the Temple by Yuuzhan Vong warriors. Managing to get inside of an area that was still standing he was able to feel the dark energies of the place. He was rescued from certain death by his adopted teacher, the mysterious Vergere. Leading Solo through the ruins, Vergere brought him to a dimly lit room. From the vaulted ceiling hung glow globes which revealed dozens of Yuuzhan Vong warriors. Solo drew upon the Force energies which were laden with the dark side in order to destroy the hall, bringing down the ceiling of the room and crushing the Yuuzhan Vong warriors. Broken and injured, Vergere asked Jacen why, if the Jedi supported peace, they would knowingly build their Temple on a dark side nexus. Withholding information of the Nyax fight, and ignoring the events of Order 66, Vergere manipulated Solo by telling him that there was no light or dark side and therefore the nexus held no allegiances."}, {"tag": "h3", "text": "Reconstruction"}, {"tag": "p", "text": "After the Yuuzhan Vong War, the Galactic Alliance's Chief of State Cal Omas ordered that a new Temple be erected for the Order. Using blueprints salvaged from the ruined Archives, the Reconstruction Authority built the new Temple almost exactly as it had stood several decades before. However the structure did not lack its differences. A new transparisteel and duracrete pyramid was built over the exterior, encasing the Council spires within it. Many on the reformed High Council feared the determination to preserve the past was a sign that the Jedi could not move forward and would once again be tools of the government, rather than a dignified tribute to their ancient Order."}, {"tag": "p", "text": "After years of standing watch over Coruscant, the Temple was conquered in 130 ABY and was renamed the Temple of the Sith after Darth Krayt and his new Sith Order took control of the Galactic Empire. With the transparisteel pyramids stripped away Krayt redesigned the Temple so that its appearance caused fear and forced obedience. From the central stone pyramid smoke constantly billowed filling the Precinct with a dreary smog."}, {"tag": "p", "text": "It was subsequently retaken by the Galactic Alliance and the New Jedi Order in 138 ABY and returned to it's orginal design."}, {"tag": "h2", "text": "Layout and architecture"}, {"tag": "p", "text": "A massive structure which soared over a kilometer above the surrounding rooftops, the Jedi Temple had the appearance of a fortress but was really a place of meditation and gentle reflection. Located in a strategically isolated area of Coruscant which neighbored the Senate District, the Temple rested on a large city block in the Temple Precinct. Concealed within the heart of the Temple ziggurat was the upper reaches of the Sacred spire, a towering mountain that jutted from the crust of the planet deep below. The upper most summit of the mountain erupted from the top of the Temple's base and formed the foundations of its central tower, Tranquility Spire. Surrounding the tallest tower's finned peak were four shorter towers located on the ordinal-oriented sides of the complex. Each contained an austere Council Chamber at its summit and served as the meeting rooms of the four Jedi Councils. The ziggurat shape of the edifice, coupled with the five spires, was designed to symbolize a Jedi's climb to enlightenment through the Force."}, {"tag": "p", "text": "The Temple, separated from the surrounding city sprawl by the sprawling Temple Court dotted with bronzium statues of long dead Jedi heroes and scholars, was accessed primarily by the Processional Way. This broad promenade which bisected the Court and led to the stairs of the main entrance was crowned by four bronzium statues. The outer statues depicted Warrior Masters with their lightsabers ignited, while the two inner statues were depictions of two hooded Sage Masters. Beyond these statues, a series of monolithic pylons stood amid the entrance courtyard. Standing four across and three back, the front pylons were adorned with reliefs depicting the Four Masters; Jedi who helped found the Temple in ancient times. The entrance staircase beyond these pylons led into the Temple's cavernous main hall, which stretched beyond to the formal Great Hall. The main hall's pillars and soaring mezzanines stretched out and around the base of the Temple, connecting with the other three formal entrances and forming the Temple's support structure."}, {"tag": "p", "text": "Three other entrance to the Temple were located on the other cardinal-oriented sides of the Temple: the northern public entrance was reserved for non-Jedi visitors and consisted of several public annexes. To ensure the safety and privacy of the Temple, five Padawans were tasked with guarding the Temple during the day, while two Knights would oversee the watch in the evening. All guard duties Temple-wide were overseen by the Jedi Gate Master. Following the Temple's destruction during the Yuuzhan Vong War, the Reconstruction Authority recreated the ancient edifice almost perfectly. The stairs were reconstructed without the statues of the Four Masters, while the main hall had extra security systems built in. Security droids were stored in several pillars along the hall, controlled by Temple Security and programmed to detain any intruders that might break into the Temple."}, {"tag": "p", "text": "Construction on the Temple worked its way from the central, natural mountain outward over the centuries in a circular pattern before the structure took on its ziggurat form. The Temple could be divided into wings or quarters for administrative purposes; though for the Jedi, the Temple was a unified entity and utilized by almost every Jedi since its conception until the Great Jedi Purge. Each quarter was crowned by the tower of the Council which held authority over the specified chambers in the sector of the Temple. The northwestern quarter of the Temple was overseen by the Council of First Knowledge, a body which ran the Jedi academy of Coruscant. Located in this quarter, the Academy was attended by every member of the Order, while graduation came upon an initiate's selection for further training by a Jedi Master. In the southwestern quarter, the High Council maintained its headquarters and housed the offices of the Jedi Service Corps. The diplomatic heart of the Order, this area also housed many training facilities for the practice of lightsaber combat along with facilities where Jedi could build or repair their lightsabers with the help of a weapons specialist. Because most of the Temple was restricted to the Order's members only, the northeastern area under the Council of Reassignment was dedicated to the Public Center. Located in the southeastern quarter was the administrative headquarters of the Order, an area furnished with many gardens and offices used by the Council of Reconciliation."}, {"tag": "h3", "text": "Spires"}, {"tag": "p", "text": "Fully rebuilt in 1019 BBY as part of the last major expansion of the Temple complex, the five towers of the complex were supported by a highly-tensile substance known as magnate, which aided in the support of the thin frame of the towers. The central and tallest tower, known as Temple Spire, was built over the last visible peak of the sacred spire and was the tallest structure for kilometers. Traditionally the most important tower, Tranquillity held the most sacred chamber in the complex which held the ancient texts of the founding Jedi, some of which having survived from Ossus. Temple Spire contained the Hall of Knighthood near its summit, meditation chambers farther below, large memorial statues of the most revered Jedi suspended in the tower by repulsorlift pads, then the peak of the mountain around which the Temple was constructed. The peak was surrounded by a meditation balcony with a lower balcony presenting a series of holo-depictions of the history of the Order. The smallest younglings were brought here by their masters for their first introduction into Jedi knowledge. From this point the ancient meditation chapels of the sacred spire were accessible via stone bridges, passage through which led deep into the mountain's core. On the northern slope was located the Chamber of Conclave, a place that hosted an annual conclave where outlying Jedi reported to the High Council on important events or projects."}, {"tag": "p", "text": "Crowned with a set of high-gain transmission antennae, the spires served as a means for the communication center to stay in contact with the thousands of far-flung worlds across the stars. Jedi Command was based out of the Towers during the Clone Wars and maintained a Situation Room in each with a constant connection to the HoloNet. The large Operations Planning Center below the Council Chamber was a open air room with a holomap upon which hotspots across the galaxy could be analyzed by the Councils. The southwestern spire known as the High Council Tower was home to the Jedi High Council, the governing body of the entire Order. The northwestern tower held the meeting place of the Council of First Knowledge, the leaders of the Jedi academy on Coruscant. Across from this Spire stood the Reassignment Council Tower from which the Council handled the organization of work for young Initiates who had not been chosen by Jedi Masters to become apprentices. To the southeast of this tower was the Tower of Reconciliation; the Council that sat in these chambers sought to find peaceful settlements to political disputes across the Republic."}, {"tag": "p", "text": "Near the central spire's base was an ancient gnarled tree with golden boughs. Lightsaber training classes were held by the tree during the time of the Clone Wars."}, {"tag": "h3", "text": "Temple Ziggurat"}, {"tag": "p", "text": "Having expanded outwards from the sacred spire several times over the millennia in a circular pattern, the Temple Ziggurat could be dissected in shells to see the history of the place. Directly around the sacred spire were the ancient meditation chambers and grand stone structures that made up the original enclave. These temples, chapels and sanctuaries were some of the largest in the entire Temple and were capable of housing hundreds of Jedi at a time. By the time of the Clone Wars, many of these ancient halls had fallen out of use and were dusty relics of a grander era. As the Temple Precinct rose to modern levels and the Temple Court took shape, the Order built outward and upward erecting towering stone buildings which served as office space and dormitories. Stone towers and obelisks which jutted up from the mountain and its rocky outcroppings were labyrinthine in design and later abandoned by the much of the Temple's occupants. By the time of the Clone Wars, only the eldest Jedi Masters had the skill to navigate the ancient designs of the oldest Temple structures and unlock the secrets hidden within. The ancient library and study halls were built above the main entrance, a monolithic chamber where bronzium statues lined the main entry mezzanine. As time progressed, the stone structures were covered with a dark durasteel outer layer which incorporated red stone, giving the Temple a dark and sedated appearance from the exterior. What eventually became the base of the Temple's Ziggurat was made up of columns and supports which held the structure up. The construction of the Room of a Thousand Fountains, the ceiling of which reflected the sky of a terrestrial garden world, and other Meditation Gardens brought to the Temple a rediscovered sense of nature and harmony not found elsewhere on the city-covered world. The Lake Level, and an expansive menagerie beneath the Temple brought additional places of natural beauty and study to the Temple's halls. The Detention Center was built above the Fountain room and used to contain the Sith Lords and their creatures that ran rampant during the early Republic era. The Temple's architects brought in recovered materials from Ossus that had been stored at Exis Station and incorporated them into the Temple's design. Marble tiles were placed in halls and chambers while a portion of a recovered stained-glass arcade were placed in the Meditative Walkway that ran the perimeter of the Temple's base. At each corner, chapels were built to mirror the aspects of the Force reflected in the towers that would be constructed upon the Temple rooftop later in its history."}, {"tag": "p", "text": "While there were many attacks on the Temple during the early years of the Republic, it would continue to be restored and rebuilt stronger than before. Following the rebuilding of the Temple in 3500 BBY, several decades after the Sacking of Coruscant, the Temple was once again home to the Order and its academy which had previously transferred to the Order's homeworld of Tython. Repurposing of architectural treasures saw the old library and its study halls transformed into a museum of Temple history and a formal banquet hall after the Jedi Archives were established in 2519 BBY. The Temple's structure continued to expand through 2000 BBY and eventually the Temple's spires were rebuilt in 1019 BBY signaling the end of all major expansions to the Temple. The pale stone exterior finished, the Temple now shone out as a bright beacon of hope and a firm reminder of the strength of the Order. Statues, memorials, and gardens covered the roof of the Ziggurat, along with wide open plazas which doubled as landing platforms for visiting diplomats. Clerestories were incorporated into the roof to allow natural light to spill into the Temple's halls and gardens, while the rest of the Temple was lit with a soft, soothing blue light. The accommodation sector of the Temple was crafted so that the rooms could be adjusted to make the many species of Jedi comfortable through the use of specialized atmosphere adaptors."}, {"tag": "p", "text": "As part of the Jedi Service Corps research operations, the Agricultural Corps maintained a laboratory at the Temple. The Medical Corps had a presence in the Halls of Healing, with an express turbolift connecting the Temple to the Republic Central Medcenter. The Healing Halls was the place where the Jedi healers practiced the most sacred techniques of the Order, saving the lives of countless Jedi over the years."}, {"tag": "p", "text": "In the years leading up to the Clone Wars, it was noted that the Temple, particularly the exterior, was suffering from neglect. Flaking paint was evident around the mid to lower levels and long green streaks from bronzium gutters ran down the sloping walls. Electrochemical corrosion was occurring where molded metal sheets had lost cathodic insulation buffers. The massive architecture of the Temple was capable of concealing many of the transparisteel windows, imbued with permem to help maintain a constant gravity balance, and balconies that stemmed from the structure. The ventilation system of the Temple funneled all outward air out through ray shield-protected vents that were hidden in an overhang near the roof. Plumbing concerns were run through municipal water ways, with small alcoves for access to the machinery built into the walls of the tunnels. During the Separatist Crisis, hangars were constructed in each of the four Council towers to house Delta-7 Aethersprite interceptors, and the later Eta-2 Actis interceptor model. The hangars each had an extendible landing platform"}, {"tag": "p", "text": "While war broke out around it, the Temple managed to maintain some of its normality. The rooftop gardens continued to fuel the Order through the refectories and kitchens. Located near the Tower of Reconciliation were the gardens overseen by Master Yoland Fee. All food that Fee could not grow was shipped into the Temple by food companies and deliver in lower level hangars. The Jedi academy held an annual Apprentice Tournament along with other special tests open to all members of the Order in a specialized sparring arena. The tests held here were used to monitor a students abilities as well as expose them to the scrutiny of Jedi looking for potential candidates for apprenticeship."}, {"tag": "p", "text": "When the Temple was raided and ruined, the interior architecture was pock marked and riddled with blasterfire. The ceiling was collapsed in areas and pillars crisscrossed ancient halls. Marble floors were cracked and bookshelves toppled. The stormtroopers stationed at the Temple had blocked off areas by erecting large blastdoors, sealed off to all but the Emperor himself. On the outside the Temple simply looked like a burnt-out husk of its former self, a testament to fighting the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi Temple first appeared in 1999 with the release of Star Wars: Episode I The Phantom Menace. The Temple was added to Star Wars: Episode VI Return of the Jedi in a DVD release."}, {"tag": "p", "text": "The interior layout of the Jedi Temple was heavily detailed by Christian Piccollo who was the artist responsible for creating the cross-section of the Temple for the book, Star Wars: Complete Locations. It was this depiction which first placed the location of the Jedi Archives, main entrance, and the first depiction of the sacred spire at the heart of the Temple."}, {"tag": "p", "text": "In Star Wars Infinities: A New Hope, the Jedi Temple is turned into the residence of Palpatine following the creation of the Empire. This was later an element adopted and officially brought into official canon as of 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}