{"url": "Jedi_Temple_(Tython)/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Jedi academies", "Category:Jedi temples", "Category:Tythonian Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Jedi Temple  (Tython)"}, {"tag": "p", "text": "The Jedi Temple, also known as the Jedi Academy, was the headquarters of the Jedi Order after the Galactic Republic's defeat in the Great Galactic War, thus replacing its counterpart, the Jedi Temple on Coruscant, as the heart of the Order. The new Temple was constructed on the legendary Deep Core World of Tython, the planet on which the Jedi Order was founded thousands of years in the past."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the waning days of the Great Galactic War, the Imperial forces of the resurgent Sith Empire launched a daring assault on Coruscant, the capital world of the Galactic Republic and home to the Jedi Order. The fall of Coruscant resulted in not only a great deal of devastation inflicted upon the ecumenopolis, but also caused the near destruction of the Jedi Temple, much of which had been reduced to ruins by the Sith."}, {"tag": "p", "text": "With the Temple in ruins and Coruscant no longer being a safe location, the Jedi High Council relocated its headquarters to Tython, thus making the planet once more the heart of the Order. Discovering ruins of many ancient Jedi temples, the High Council fasted for a week and sealed themselves away in deep meditation before selecting the spot upon which to build. Nestled next to a small mountain range and built on the foundations of an ancient temple, the High Council commissioned the construction of their new home using local timber and stone to craft the temple."}, {"tag": "p", "text": "Around 3637 BBY, the Sith launched an invasion of Tython, causing severe damage to the Temple and the surrounding grounds, and killing all present, including Jedi Council member Oric Traless. Master Satele Shan was away at the time and unable to assist. Her son, Theron Shan, helped lead a counter-invasion and the Temple was retaken."}, {"tag": "h2", "text": "Layout"}, {"tag": "h3", "text": "Exterior"}, {"tag": "p", "text": "A departure from the monolithic ziggurat built on Coruscant, the High Council sought to embrace the Jedi Code's restrictions on attachment by incorporating new architecture and ideas into their new home. Drawing upon the shapes and architecture of Alderaan bastions and B'omarr monasteries, the Temple consisted of three equidistant cupolas surrounding a large central one, and two open air hangar bays. Highly advanced security and defense systems were hidden beneath the elegant architecture, maintaining an air of meditation while ensuring the occupants' safety. A broad promenade extended from the front doors of the Temple with training grounds spreading out into the surrounding, forested landscape. Large carved wood statues stood at attention at the main entrance to the Temple, opening into the cool interior of the main cupola of the complex."}, {"tag": "h3", "text": "Interior"}, {"tag": "p", "text": "Along the curving polished wood walls of the Temple were holoprojectors displaying the images of many famed Jedi; wooden statues of Knights and Masters watched over the halls as Jedi paced in quiet reflection. Inside the main spire was an enormous dodecahedron-shaped monument known as the Eye of Zallow was suspended between dual sweeping ramps that led to the upper stories, while two smaller holocrons orbited it. From the domed ceiling hung several heritage tapestries that gently swayed in the still interior of the spacious chamber. Passages on the ground floor led off into numerous lecture halls, study halls, and dining facilities, as well as the offices of prestigious Jedi Masters. The northern most spire was home to the Council of First Knowledge and was the location of the Archives room which had been meticulously created by Jedi archivists. The eastern spire, built into the cliff face behind the temple, housed the chamber where the High Council met behind heavy double doors. Opposite of the Jedi Archives in the southern tower was the Temple's map room which mirrored its counterpart on Coruscant. The Council of Reassignment also met in the tower, overseeing the duties of the Jedi Service Corps"}, {"tag": "p", "text": "Accessible from the second story, two hangars were located in the rear of the Temple, both with open air ceilings that allowed starships to dock directly at the Temple. Additional craft, including the Temple's speeder pool, were located on the Temple's front promenade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}