{"url": "Jedi_Temple_(Ilum)", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Ilum locations", "Category:Jedi temples", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Jedi Temple  (Ilum)"}, {"tag": "p", "text": "The Jedi Temple on Ilum and the Crystal Caves beneath it was a complex erected by the Jedi Order, one of its earliest endeavors to construct temples across the galaxy. A common pilgrimage site for the members of the Order, the Temple hosted a trial known as the Gathering, wherein students of the Jedi academy retrieved the kyber crystal which would power their personal lightsaber. In the year 34 ABY, Resistance pilot Poe Dameron destroyed Starkiller Base, a superweapon built into Ilum's surface, destroying the planet and sealing the temple's fate."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Erected over the largest mouth of a vast cave system in the mountains of Ilum, the Temple was meant to fortify and protect the entrance to the caves and give visiting Jedi a place to rest and recover from the harsh environment outside. The mouth of the cave was located at the base of a towering cliff face, and the Temple itself was constructed around that site from natural stone. The exterior of the Temple was marked by reliefs and sculptures denoting legendary figures and moments in history of great import to the Order. Tall, narrow windows of multi-colored glass punctuated the upper levels of the Temple's rounded walls to let in natural light."}, {"tag": "p", "text": "The great doors of the Temple were constructed of the light-absorbing stone mined form the caves and accented by a silvery alloy. Because of the Temple's infrequent use, the doors often became obscured by debris, fallen ice, or banks of snow. Instead of maintaining it, the Order came to view the obstruction as a portion of the Gathering rite, requiring visiting Padawans to work their way into the Temple with the sacrifice of their physical strength."}, {"tag": "p", "text": "The Temple's doors opened on to the facility's main chamber, a towering rotunda carved up into the mountain itself. The center of the room was dominated by two hooded statues of lightsaber-wielding Jedi, ringed by carved obelisks that sprouted from the rounded floor. The exterior wall of the chamber contained access to passages and several smaller rooms that went up several levels; a storage level existed below the Temple proper. The wall opposite of the Great Doors contained the entrance to the cave systems that penetrated deep into the mountain's heart. A natural flow of water poured slowly from the upper heights of the Temple's ceiling, creating a dense wall of ice over the Temple mouth. To melt the ice, the Jedi constructed a complex mechanical cradle to hold up a huge kyber crystal near the Temple's domed ceiling. When focused on the ice fall, the sunlight would melt the ice and reveal the entrance to the caves, if only until sunset when the falls would freeze over once more. The mechanism only worked every seventeenth day, when the sun rose over the Temple."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Temple was constructed at the behest of the Jedi Order, and became home to the ritual known as the Gathering. During the Clone Wars, Grand Master Yoda brought with him a group of Jedi students intent on locating their own kyber crystals to use in their lightsabers."}, {"tag": "p", "text": "When the Galactic Empire emerged victorious from the war, the new Galactic Emperor made it one of his first orders of business to establish a garrison at the Temple. The newly christened stormtroopers killed all Jedi that hoped to escape to Ilum, securing the building promptly. While the Temple remained structurally sound, the Imperial Army erected a five meter thick, reinforced plasteel containment vessel over the entrance to ensure the complex was inaccessable to any who wished to enter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}