{"url": "Jedi_Temple_Obstacle_Course", "categories": ["Category:Legends articles", "Category:Articles needing verification", "Category:Cleanup", "Category:Coruscant rooms", "Category:Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Jedi Temple Obstacle Course"}, {"tag": "p", "text": "The Obstacle Course of the Coruscant Jedi Temple was a specialized training chamber for use by Padawans and Jedi Knights to practice with the Force technique known as the Art of Movement. Near the end of the Old Republic, Jedi Master Fy-Tor-Ana taught the Art and was the administrator of the chamber."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Built within the Temple Ziggurat, the obstacle course was ruined at the end of the violent Clone Wars when the 501st Legion of the Grand Army of the Republic, led by Darth Vader, stormed the Temple and executed its occupants, damaging the Temple in the process. The Temple's obstacle course was laid waste with the walls and floor pocked with blaster bolts."}, {"tag": "p", "text": "The Temple would stand in silence for several more decades, slowly crumbling from disuse and lack of care. When Sith Lords Darth Sidious and Vader were slain, the Galactic Empire lost balance and was eventually driven from Coruscant by the New Republic. During the Yuuzhan Vong War Coruscant was devastated by terraforming, causing the Temple to crumble and reveal parts of the foundation. When the Galactic Alliance reclaimed the world, Chief of State Cal Omas, ordered the Reconstruction Authority to rebuild the ancient edifice as a gift for the great sacrifices made by the reformed Order against the Yuuzhan Vong. While the structure was rebuilt using blueprints of the old building, it is unknown if the obstacle course was reconstructed or replaced."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Like most of the Temple, the marble floors were smooth, while pillars supported the high ceilings. The chamber's obstacles were set at different intervals, while lights strategically hidden within the walls, ceiling, and floor shot beams of light in a random pattern. Students would need to avoid the light as well as the obstacles, in order to grow proficient in the Art of Movement."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}