{"url": "Jedi_Temple_Situation_Room", "categories": ["Category:Legends articles", "Category:Articles needing verification", "Category:Cleanup", "Category:Coruscant rooms", "Category:Jedi Temple locations", "Category:New Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Jedi Temple Situation Room"}, {"tag": "p", "text": "The Jedi Temple Situation Rooms, or the Headquarters of the Jedi Council, were located in each of the four Council Spires of the Jedi Temple on Coruscant."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Situation Rooms of the Jedi Temple were located in each of the four Jedi Council towers and served as the Headquarters of the four Jedi Councils. Built circa 1000 BBY, each was constantly connected to the HoloNet and made use of the massive communications receiver suspended above the chamber to keep the Order in touch with every planet in the Republic, as well as Jedi serving in the field. Datafeeds ran to the Jedi Archives and the communication center to allow the members of the Council to pull of datasheets and records at an instant's notice."}, {"tag": "p", "text": "In 32 BBY some members of the Jedi High Council met in the Situation Room to review the history of Sharad Hett, a revered Jedi Master who may be connected to a Tusken uprising on Tatooine. After analyzing footage sent from the backwater world, Grand Master Yoda and Master Eeth Koth send newly appointed Council member Ki-Adi-Mundi to discover the truth behind these startling accusations."}, {"tag": "p", "text": "Several years later, during the Clone Wars, Master Mace Windu held a war council in this chamber. Meeting with the holopresences of Masters Yoda and Mundi, as well as Jedi General Aayla Secura, Windu discussed the possibility that Supreme Chancellor Palpatine may indeed be under the influence of Dark Lord of the Sith Darth Sidious. The three masters decided that, if after Master Obi-Wan Kenobi had killed General Grievous of the Confederacy of Independent Systems he still refused to retire, they would forcibly remove him from office by arresting him. When the Chosen One, Anakin Skywalker, revealed that the Supreme Chancellor and Darth Sidious were one and the same, Windu contacted Master Yoda and decided that the Sith had to be destroyed. Agreeing that Skywalker should not go with Windu, the Jedi Master left the Situation Room of the High Council Tower and headed for the hangar of the Tower of First Knowledge."}, {"tag": "p", "text": "Soon after the failed arrest of the Sith Lord and Jedi Skywalker's fall to the dark side, the Grand Army of the Republic was ordered to execute Operation: Knightfall under Executive Order 66. Led by Skywalker, now Darth Vader, the 501st Legion marched into the Temple and began the slaughter of its occupants. During the mayhem, the Situation Room's inevitably sustained damage and were left in ruin as the Temple burned. Abandoned throughout the rise of the Galactic Empire and the Great Jedi Purge, the Temple stood for several decades until it was retaken by the New Republic. Briefly reoccupied by the New Jedi Order, the few Jedi under the tutelage of Luke Skywalker searched the Temple for any information they could find on the Jedi of old. The Towers of the Temple would collapse during the catastrophe with the Lusankya and were cleared away, their places filled with a new enclave that served as a diplomatic way-point and a training ground for new Jedi away from the Jedi Praxeum on Yavin 4."}, {"tag": "p", "text": "While the Temple itself was destroyed during the Yuuzhan Vong War, the victorious Galactic Alliance donated a new Temple through the Reconstruction Authority. While the Temple's spires were rebuilt as they had stood for over a millennia, they were concealed within a large duracrete and transparisteel pyramid. The Situation Rooms were updated with new technology and served in much the same capacity as they had for the larger half of the Temple's history."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Located in the four Council spires of the Jedi Temple, the Situation Rooms were large circular chambers that filled an entire level of the Tower. Along the outer walls, large transparisteel windows granted a panoramic view of the cityscape outside. Accessed by turbolift and a set of ancient stairs, the lift car was the designated lift for the Council Chambers at the top of the spire and for the offices of the Council members."}, {"tag": "p", "text": "The center of holocomm transmissions to Jedi Command, the chamber was located behind a set of blast doors. Equipped with state of the art tactical displays and HoloNet feeds, the Situation Rooms were said to rival the comm stations of most flagships. The center of the chamber was comprised of a sunken dais upon which a large holotable rested, surrounded by several comm stations and holocharts. With a direct hook up to the Jedi Archives and the communication center, the Jedi Council was always apprised of new information constantly pouring into the Temple."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}