{"url": "Jedi_Temple_Technical_Center", "categories": ["Category:Legends articles", "Category:Articles needing verification", "Category:Cleanup", "Category:Coruscant rooms", "Category:Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Jedi Temple Technical Center"}, {"tag": "p", "text": "The Technical Center of the Jedi Temple was a chamber deep in the Coruscanti structure. Staffed by members of the Jedi Order's Technical division, the machinery in this chamber controlled electrical, water, and air circulation throughout the Temple. Smaller, satellite facilities such as repair centers and switch rooms were located throughout the Temple, specifically concentrated in the south west quadrant of the complex."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Established within the Jedi Temple during the renovations pre-1000 BBY, the Technical Center of the complex serviced the entire Temple's electrical, water, and atmospheric controls. The chamber granted access to a number of service tunnels and the main power generators for the complex."}, {"tag": "p", "text": "During a series of robberies and vandalism in 44 BBY, specialist Miro Daroon operated the Tech Center, and was therefore responsible for making sure all of the bugs installed by the Dark Jedi Xanatos were undone. Unable to purge them using conventional methods, Daroon was forced to shut down all of the Temple's systems for twelve minutes in order to right all of the problems. However, Xanatos had rigged the Temple to explode when the systems restarted, thus completely ruining the Order. Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi manage to prevent this by retrieving the power source of the planned explosion, the stolen Healing Crystals of Fire, from the fusion furnace and ended the crisis."}, {"tag": "p", "text": "Over a decade later, Padawans Anakin Skywalker and Tru Veld met each other when they were scavenging for a part in the Coruscant underworld that the Tech Center was short on. While Veld had been looking for the part to assist Master Ali-Alann in repairing his new nursery droid, Skywalker had been looking to use it for himself. Feeling guilty, Skywalker gave Veld the device and they both made their way back to the Temple."}, {"tag": "p", "text": "At the end of the three year-long conflict known as the Clone Wars Dark Lord of the Sith, Darth Sidious, in his alter ego Supreme Chancellor Palpatine, ordered the seizure of the Jedi Temple and the slaughter of its occupants. Over-run by the Grand Army of the Republic, the Temple sustained massive amounts of damage due to a large fire that spread throughout its halls. When the fire finally died down, the Temple was abandoned, aside from a small occupying force of stormtroopers."}, {"tag": "p", "text": "Not long after its abandonment ex-Jedi Ferus Olin and the street boy Trever Flume infiltrated the Temple to discover and destroy the rumored Jedi Prison. Making their way in through the damaged Tower of Reconciliation, the pair found their way into the Droid Repair Center, a satellite chamber of the Tech Center. Combing through the rubble in search of the old service tunnel entrance, the two intruders were detected by a squad of troopers guarding the Temple. Quickly diving beneath of burnt husks of dead droids the pair remained hidden and, due to the timely scurrying of a startled meer rat, the stormtroopers dismissed the disturbance and wandered off. Olin and Flume then quickly searched the Temple, deduced that there was no prison at all, and fled in search of the elusive Jedi Master Fy-Tor-Ana."}, {"tag": "p", "text": "Later, the pair returned to the Temple with Master Ana and discovered that High Inquisitor Malorum intended to destroy the Temple by overloading the main power core. Rushing to the chamber Olin quickly diffused the bomb by turning down the power and draining the core of its energy. The Inquisitor's plot sabotaged, the Temple would survive for another two decades, throughout most of the Galactic Civil War and the withdrawal of the Galactic Empire from Coruscant. It wasn't until the costly Yuuzhan Vong War that the Temple was completely ruined beyond repair. While the Galactic Alliance did retake the planet and ordered the Temple rebuilt, it is unknown if the Tech Center was rebuilt to old specifications or completely redesigned."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A circular room, the Tech Center of the Jedi Temple contained all of the major operating systems controls for the entire complex, with smaller satellite facilities used to maintain services in certain areas. Located on the same level as the Halls of Healing, the Tech Center was attached the Temple's main service hallways and also had an access way into the main reactor."}, {"tag": "p", "text": "Along the curving walls were datascreens that constantly flashed updates reported from each of the Temple's systems. Monitored by the tech specialist on duty, the chamber was vital to the operation of the complex. The room had four doors stemming from it: the main access way, the entry to the service hall network, a heavy durasteel door which led into the central core, and the well access gate. Beyond the door marked \"Fusion Furnace\" was a small, circular chamber ringed by a catwalk. At the center of the catwalk was an opening and a ladder which descended ten stories into the Temple's infrastructure. At the bottom of the ladder, the walls were covered with compartments and switches, all labeled according to use. Also off this chamber was the white room which held the sublight generator and its control computer."}, {"tag": "p", "text": "Near the base of the Tower of Reconciliation was a small droid repair center. Here, Jedi technicians repaired and updated the many droids that operated within the complex. A durasteel shelf ran along one wall, holding parts and tools; while powered-down protocol droids lined another. A service tunnel with a gaping entrance was located here; droids were transported down the white, low-ceiling, rounded corridor to other areas throughout the Temple."}, {"tag": "p", "text": "After the Temple was abandoned, Ferus Olin explored this room, looking for the service hallway that went to the accommodation sector. The shelves and the droids had all fused from the heat of blaster fire, while the stone ceiling had been blown away, letting in rain water. Olin was able to clear the path to the service hall, narrowly escaping a patrol of stormtroopers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}