{"url": "Jedi_Temple_central_security_station/Legends", "categories": ["Category:Legends articles", "Category:Coruscant rooms", "Category:Jedi Temple locations", "Category:New Jedi Temple locations"], "nodes": [{"tag": "h1", "text": "Jedi Temple central security station"}, {"tag": "p", "text": "The central security station of the Jedi Temple was a chamber located within Jedi Command's communication center. It was in this hall that the Temple beacon was maintained, used to transmit messages to members of the Jedi Order located throughout the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Erected at the base of the High Council Tower no later then 1000 BBY, the security station was a long hall with several security stations used to monitor Temple security. The computers were also hooked into the Coruscant planetary shields, which could be activated to protect the Temple from aerial assaults in times of invasion."}, {"tag": "p", "text": "During the Clone Wars the mysterious Dark Lord of the Sith Darth Sidious hired the bounty hunter Cad Bane to infiltrate the Temple and steal a holocron from the library. As Bane entered the Temple via the rooftop ventilation shafts, Jedi Masters Obi-Wan Kenobi began the search for the foreseen intruder. From the security station, Kenobi was able to spot the glitch in the ray shields protecting the shafts. While the Jedi were able to track Bane, they mistook the Duros' target and headed off to the comm center while he went to the Holocron Vault."}, {"tag": "p", "text": "Grand Master Yoda and Master Mace Windu met with Republic Intelligence agent Dyne to learn that Intelligence had cracked the Confederacy of Independent Systems' most secure comm channel. Inserting a data chip into the comm station, Captain Dyne played a recording of General Grievous, who was in the process of making a report to Count Dooku. Within days of the discovery of the comm frequency, the Confederacy made a strike at Coruscant. While the planet was under siege, Master Yoda went to the security station to monitor the Jedi's response to the situation. Working the controls, Jedi Lari Oll tried in vain to send a transmission off world, failing due to Grievous' jamming devices. Realizing that Dooku had shared the secrets of the Temple security station, Oll was able to persevere and make contact with Master Windu through a Jedi comm channel, though the transmission was shaky due to the planetary shields. Master Saesee Tiin, leading the charge into the atmosphere, planned to use his on-board comm console to boost the transmission from the beacon. It was in this room that, while searching the Force, the Grand Master of the Order finally felt his mortal enemy, Darth Sidious, in his mind and on Coruscant."}, {"tag": "p", "text": "Only days after the battle ended, Darth Sidious was revealed to be the alter-ego of Supreme Chancellor Palpatine of the Galactic Republic. Before the public could be made aware of his deception, Palpatine sent the Grand Army of the Republic against the Temple, slaughtering its occupants under the illusion of a \"Jedi Rebellion\". Along with the rest of the polished interior, the security station was damaged, though much of the equipment was preserved in compliance with Darth Vader's order to capture the beacon room. Specialized clone troopers trained to be able to duel and kill Jedi were dispatched into the beacon room and guard the giant mechanism as Vader programmed it to transmit Emergency Code Nine Thirteen across the galaxy to all Jedi in the field, all part of a plot to lure the unsuspecting peacekeepers into a trap."}, {"tag": "p", "text": "Once all the Jedi had been sought out and killed within the Temple, an occupational force remained in the Temple to prevent access from any. Masters Yoda and Kenobi managed to break into the Temple and eventually made their way up to the central security station. Kenobi infiltrated the beacon chamber and neutralized the assassins there, and hastily re-calibrated the beacon to warn all other Jedi to go into hiding. Walking back into the security station, Kenobi accessed the Temple security holo-file TR4-121 and watched as his former apprentice, now Darth Vader, slaughtered Master Cin Drallig and a group of Padawans. Recovering from the shock, Yoda sent Kenobi to Mustafar to kill Vader, while he would travel to the Galactic Senate Rotunda to confront Sidious."}, {"tag": "p", "text": "The Temple would lay in ruin for the next several decades, surviving the Galactic Civil War and the taking of Coruscant by the New Republic. While the reformed Jedi Order established an enclave on the rooftop of the Temple Ziggurat, the entire structure would be completely ruined when the Yuuzhan Vong terraformed the world. Following the Galactic Alliance's victory during the Yuuzhan Vong War, Chief of State Cal Omas ordered the construction of a new Jedi Temple in appreciation of the Order's sacrifices on behalf of the Alliance. Within the new Temple, the central security station was rebuilt to old specifications, as was most of the Temple. While hunting the Dark Jedi Alema Rar former Colonel of the Empire of the Hand, Jagged Fel, installed a graphical interpreter and communications program within the Temple's computer in an attempt to catch the Twi'lek if she happened to try and enter the Temple Precinct."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "Located at the base of the High Council Tower, the central security station was part of the Temple's communication center. Sealed behind blast doors, the security center was equipped with at least four monitoring stations and access to the large beacon chamber. Operated by Temple Security Force, the stations were equipped with holoscreens and holotables to better monitor situations within and without the ancient structure."}, {"tag": "p", "text": "In between two of the stations was an access way to the Temple beacon. A large circular room, the chamber was filled with towering data banks that were intersected by hallways. Glowing green in the dim light, the aisles met at the center of the room like axles on a wheel, forming an open space large enough for several beings to stand."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Notes and references"}]}