{"url": "Jedi_Tower", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Jedi academies", "Category:Taris locations"], "nodes": [{"tag": "h1", "text": "Jedi Tower"}, {"tag": "p", "text": "The Jedi Tower, also referred to as the Taris Academy, was a satellite academy for Jedi training built in Highport on the Outer Rim world Taris. It was used by the Jedi Order prior to and during the Mandalorian Wars, a conflict between the Galactic Republic and the Mandalorian Neo-Crusaders. Isolated from other structures by a skybridge, the Tower was a tall, tapering building with the Council chamber at its pinnacle. Adjoining the main structure was a smaller, vertical tower that contained a turbolift to access different levels of the Tower via walkways between the two. Surrounding the base of the Tower was a landing area staffed by labor droids."}, {"tag": "p", "text": "In 3964 BBY, the Tower was operated by the First WatchCircle of the Jedi Covenant who killed their students in the Padawan Massacre of Taris. Nevertheless, one of the Padawans—a Human named Zayne Carrick—escaped the Masters' trap and was forced to flee offworld with the Snivvian Marn Hierogryph after both were framed as the culprits of the Massacre. The Masters were recalled to the Jedi Temple on Coruscant when their efforts to track Carrick down failed, with the Padawan even contacting them to say that he would track down and kill each Master until his name was cleared."}, {"tag": "p", "text": "The Mandalorians, led by Cassus Fett, later invaded the planet and took the Tower as their own. Carrick returned to Taris to assist Hierogryph and the Taris Resistance in their plans to assassinate Fett by blowing the Tower up with the Mandalorian inside. The Togrutan Raana Tey, one of the First WatchCircle and still wanting Carrick dead, provisionally cooperated with the former Padawan and Shel Jelavan in their planned role of infiltrating the Tower prior to detonation to determine if Fett was still inside. Simultaneously, however, the paranoid Tey intended to kill Carrick before he could kill her as he had warned. When the plan was enacted, Carrick discovered that the Mandalorian leader was not in the Tower, and was confronted by Tey. They dueled until Jelavan intervened, wounding Tey with her brother's lightsaber. Gadon Thek, a swoop gang leader helping the Resistance, and Hierogryph arrived to evacuate them on Thek's swoop bike, but Tey became stuck and used her lightsaber to free herself. Perceiving this as a threat, the Snivvian prematurely detonated preset explosives, and Tey was killed in the destruction of the Tower."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Jedi Tower was located in Highport on the Outer Rim world Taris. The foundation of the Tower was part of a disused atmosphere control complex that once recycled the polluted air in the deeper Tarisian streets to remove the contaminants. A ventilation shaft ran vertically down from the storage level of the Tower into the foundations, where other shafts opened out to the exterior and the Lower City. The atmosphere control complex was set away from the nearby residential buildings and other structures, necessitating the construction of a skybridge for access. The skybridge, which spanned the gap between a Highport plaza and the base of the Tower, was wide enough to later accommodate a Mandalorian artillery cannon and was adorned by a colonnade consisting of six individual columns. Those using the skybridge arrived at an entrance to the Tower that went below the landing area above."}, {"tag": "p", "text": "On the floor above the skybridge entrance was the landing area where shuttlebuses and airspeeders landed. The apron was staffed by labor droids to assist in the loading and unloading of cargo. At night, the landing area was illuminated by red, conical lights. A garden plaza was located on the same level. Several bays for keeping vessels in were arrayed below the Tower with one of these leading through to a doorway to the storage area inside the Tower base."}, {"tag": "p", "text": "The storage area was normally staffed by LB-series bulk-loading droids coordinating the supplies for the hangars below and had three open shafts leading down to the landing area. Jedi Padawans played hiding games in the room, packed with crates of varying sizes. An access hatch to the ventilation shaft from the foundations was set in the floor of the storage room and was kept locked. At the back of the room was a turbolift which ran all the way up a slim, vertical tower that was connected to the tower-proper by five walkways. A spire was installed atop the turbolift tower and shone a red beacon from its tip at night."}, {"tag": "p", "text": "There was a room used to brief students on their assignments that was equipped with a holoprojector in the main tower. A meditation room used by the seers of the First WatchCircle had access from one of the walkways off the turbolift tower."}, {"tag": "p", "text": "The very top of the main tower was occupied by the Council chamber. It was similar in layout to its counterpart on Dantooine, though it lacked windows and had only five chairs. The walls had a gray-and-red design built into it, and the chairs were adorned with a similar color scheme. The ceiling was made of transparisteel and allowed light in during the day. Lightsabers were not permitted to be worn while in the Council chambers except on special occasions such as Knighting ceremonies. A pair of racks for stowing lightsabers sat to the side of the room."}, {"tag": "p", "text": "After the Council had withdrawn from Taris, the Mandalorians were able to set up their base of operations for their takeover of the planet in the Council chamber. Tactical holograms were projected on the floor, and the Council's seats were taken up by the nomads' equipment."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Before the Mandalorian Wars, a war fought between the Galactic Republic and the Mandalorian Neo-Crusaders, the classes at the Jedi Tower varied in size. Shortly before the outbreak of the war, the Tower's Masters included Feln, a Feeorin; Q'Anilia, a Miraluka; Raana Tey, a Togrutan; Xamar, a Khil; and the head of the Academy, the Human Lucien Draay. They were also the members of the First WatchCircle, a branch of the secret Jedi Covenant, and used the Tower as their base of operations while they watched for the rise of the Sith to prevent it from unfolding. Draay's position as a teacher at the Jedi academy was used as a cover for his work in the WatchCircle. He was also the only one of the five Masters stationed at the Tower not to be a Jedi Consular like the others. It was unusual for an academy to have so many seers in one place because of the shortage in candidates, something that Masters Vandar Tokare and Vrook Lamar were suspicious of."}, {"tag": "p", "text": "In the years immediately before the Mandalorian Wars, each of the five Masters at the Tower had had their own student. Shad Jelavan was a Human apprenticed to Q'Anilia and was native to Taris; Gharn, a Nagai, was Xamar's Padawan; the Ho'Din Oojoh was the Padawan of Feln; Tey's apprentice was Kamlin, a Falleen; and Draay was Master to Zayne Carrick, a Human. Aside from the Jedi, the Tower was occupied by many loading droids to facilitate management of the logistics of the Tower."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early teaching"}, {"tag": "p", "text": "The Jedi Tower was built before the Mandalorian Wars in Highport on Taris, a then-unaffiliated planet in the Outer Rim Territories of the galaxy. Prior to the outbreak of the war, the Jedi Order bought the Tower to set up a Jedi academy, choosing the building due to its isolation from residential blocks."}, {"tag": "p", "text": "From 3964 BBY, the students aided the local law enforcement with day-to-day policing, and although there were only a few Jedi on the planet, their presence was appreciated by the Tarisian public. Successful assignments undertaken by some of the Padawans included breaking up of the Leverby smuggling ring by Oojoh and the capture of P'den Robalt by Kamlin. Seven times Carrick tried—and failed—to capture the Snivvian black marketeer, Marn Hierogryph."}, {"tag": "h3", "text": "The Padawan Massacre"}, {"tag": "p", "text": "Over a week later, Carrick was on the tail of Hierogryph again and managed to detain the criminal in the second of two attempts. The Padawan took him back to the Jedi Tower and, as Carrick was late for his Knighting ceremony, took the turbolift up to the Council chambers after locking Hierogryph to his speeder."}, {"tag": "p", "text": "In the Council chambers above, the other Padawans were arguing with the Masters over the possibility of Carrick being Knighted, not that they wouldn't have been happy for him. The Padawans found this sudden turnaround of the Masters' opinion of Carrick to be very suspicious. After failing to convince the students of their reasons, the Masters acted on a vision they received earlier and killed them. It was at this moment that Carrick entered the room, and seeing his friends dead, he turned and ran back to the turbolift with the Masters in pursuit. Carrick used his lightsaber to cut through a pair of doors in the turbolift shaft and emerged on the Tower's storage level before jumping down another chute that brought him out onto the hangar level. The fleeing Padawan started his speeder, with Hierogryph still locked to it, and retraced his route back up the turbolift shaft, smashing through a window in the walkway to the Council chambers to escape."}, {"tag": "p", "text": "Despite giving chase on airspeeders, the Masters failed to find the two fugitives and returned to the Tower where the dead Padawans' bodies were being removed from the Council chamber by coroner droids. Meanwhile, Hierogryph and Carrick made their way off-world with help from an Arkanian offshoot mechanic, Gorman Vandrayk. Despite evading an attempt by Draay to detain them on the Rogue moon, they were captured by the bounty hunter Valius Ying. Carrick agreed to turn himself in to the Jedi so that his companions could go free."}, {"tag": "p", "text": "Ying took the Padawan back down to Taris and brought him before the Council in the Jedi Tower. Master Draay retold the events leading up to the Massacre and explained that they were members of the Jedi Covenant. Draay then killed Ying to prevent the bounty hunter from retelling what he had heard and prepared to attack his former Padawan. At that moment, the whole room shook, and the power failed as the Tower was fired upon from above. Vandrayk's companion, Jarael, crashed through the skylight and absconded with Carrick through the broken skylight, landing on the top of the uppermost walkway. They climbed to the end of the walkway where they escaped aboard the waiting Last Resort."}, {"tag": "p", "text": "Three weeks later, the Dantooine Council ordered the Tower Council back to Coruscant, deeming their failure to capture Carrick as damaging public respect for the Jedi's authority. At this time, Carrick sent a message to the Masters in which he said that he had foreseen one of the Masters confessing to what they had done. He vowed that he would track down those who did not confess and that those Masters would die."}, {"tag": "h3", "text": "In Mandalorian hands"}, {"tag": "p", "text": "After the Jedi left Taris, the Republic forces protecting it were diverted to defend Vanquo against the incoming Mandalorian forces. This left Taris wide open to attack and, in 3963 BBY, Mandalorian Field Marshal Cassus Fett led the invasion of the planet. Fett took the empty Jedi Tower as his command center by setting up tactical holograms in the now-candlelit Council chambers so that he had the ability to manage the traffic flow of the invasion force. A Neo-Crusader banner was flown from the mast on top of the turbolift tower, and a Mandalorian artillery cannon was installed on the skybridge."}, {"tag": "p", "text": "Meanwhile, in the Lower City of the ecumenopolis, the Taris Resistance conspired to destroy the Jedi Tower and bring an end to the Mandalorian occupation. They launched a raid into the Tower's foundations and were able to plant demolition charges, without detonating them. While planning to strike decisively against the tower and blow it up with a MM-40 Thermal Charge, the Resistance planned to evacuate the surrounding areas and remove the possibility of civilians being killed. To make sure that Fett would still be in the Tower by the time they would be ready to destroy the structure, Resistance leader Senator Haydel Goravvus suggested that a reconnaissance team investigate the Jedi Tower beforehand. Another member of the team would also have to access a hatch within the Tower in order to allow explosives to be planted at the base of the structure. Zayne Carrick, who was aiding the Resistance, volunteered for the job, as well as Shel Jelavan, sister of the slain Padawan Shad. Accompanying them was Jedi Master Raana Tey, who was maintaining the pretense that Carrick had killed Shad and the other Padawans."}, {"tag": "p", "text": "The day following their planning, the Resistance enacted their plan. Unbeknownst to them, Fett and his command staff had already evacuated the building, and only the tactical equipment remained to be packed up. The task was assigned to the Mandalorian Gormer. Within an hour, Tey infiltrated the Tower through a ventilation shaft, and Carrick and Jelavan were able to sneak in via the skybridge disguised as a Mandalorian and a prisoner, respectively. Carrick made his way to the former Council chambers, discovering that only Gormer remained. Tey rushed in and cut down the Mandalorian. Intent on killing Carrick, Tey lunged at him, commencing a lightsaber duel. Meanwhile, the Resistance members in the foundation of the Tower received the news that Fett had attacked their base and that they were to fall back to a safe haven. Assisting Gadon Thek—the leader of a swoop gang that had joined forces with the Resistance—at the foundation, Hierogryph insisted that Jelavan and Carrick would need extraction from the Tower, and Thek reluctantly accepted, taking the Snivvian on his swoop bike."}, {"tag": "p", "text": "By the time Hierogryph and Thek arrived, Tey had been stabbed in the stomach by Jelavan, who had intervened between the Jedi Master and Carrick after realizing that the young man had not in fact killed her brother. Hierogryph and Thek recovered Carrick and Jelavan through the skylight, which had been shattered in the duel, but Tey recovered and leaped toward her opponent. As she was caught on a pane of transparisteel, Carrick offered to help her. However, as Tey drew her lightsaber in order to cut her hand free from the pane, Hierogryph misinterpreted the move as a hostile one, immediately activating the detonator and setting off the explosives laid within the Tower's foundation. Tey was killed as the Jedi Tower collapsed, and the other Resistance members escaped, largely unharmed."}, {"tag": "h3", "text": "Reclamation"}, {"tag": "p", "text": "Following the ruination of Taris after Darth Malak ordered the surface destroyed via bombardment from orbit, the ruins of the Tower were buried under the weight of the rest of the city. Located in a region known as the Sinking City, the tower's remains were located by members of the Jedi Order during reclamation efforts initiated by the Republic. The Order stationed several Jedi at the site to excavate the ruins and locate any lost relics or artifacts which could be salvaged and shipped to the Order's new home on Tython."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi Tower first appeared in Knights of the Old Republic 1, the opening issue of the Knights of the Old Republic comic book series written by John Jackson Miller. The Tower served as the location for the initiation of the main plot of the series, and the penciler for Commencement, Part 1, Brian Ching, even managed to include it in the very first panel."}, {"tag": "p", "text": "The number of walkways joining the main tower and the smaller, vertical tower varies between the appearances in the Commencement story arc penciled by Ching, and the Knights of Suffering story arc penciled by Dustin Weaver. The former clearly shows only four walkways, whereas in the latter, the Tower has five."}, {"tag": "p", "text": "While writing Commencement, Miller sent rough schematics of the Tower to Ching due to the fact that every detail of the Tower had to be situated with the action scenes in the story arc in mind. Miller took a careful approach to writing Knights of Suffering, Part 2 with regards to the destruction of the Tower, and stated on his website that \"after September 11, 2001, [he] felt the proposed destruction of a skyscraper — even a fictional one during wartime — was not something [he] should approach lightly.\" He felt that Carrick's concern for civilians in the vicinity of the Tower was an appropriate reaction for a Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}