{"url": "Jedi_Trial", "categories": ["Category:Real-world articles", "Category:Clone Wars novels"], "nodes": [{"tag": "h1", "text": "Jedi Trial"}, {"tag": "p", "text": "Jedi Trial is a novel written by David Sherman and Dan Cragg. It was published by Del Rey on October 26, 2004 in hardback. The first paperback edition was released on May 31, 2005. Jedi Trial is the story of Anakin Skywalker and Nejaa Halcyon and their fight to free a crucial communications hub from the Separatists. Jedi Trial also includes a preview of the novel Outbound Flight. Narration for the audio version was performed by Jonathan Davis. The book is part of the Clone Wars multimedia project."}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Publishers summary"}, {"tag": "p", "text": "“Within twenty-four standard hours we will sit firmly astride the communications link that connects the worlds of the Republic…. Our control will be a dagger thrust directly at Coruscant. This is the move that will win the war for us.”"}, {"tag": "p", "text": "With these ominous words, Pors Tonith, ruthless minion of Count Dooku, declares the fate of the Republic sealed. Commanding a Separatist invasion force more than one million strong, the cunning financier-turned-warrior lays siege to the planet Praesitlyn, home of the strategic intergalactic communications center that is key to the Republic's survival in the Clone Wars. Left unchallenged, this decisive strike could indeed pave the way for the toppling of more Republic worlds…and ultimate victory for the Separatists. Retaliation must be swift and certain."}, {"tag": "p", "text": "But engaging the enemy throughout the galaxy has already stretched Supreme Chancellor Palpatine's armies to the limit. There is no choice but to move against the surging waves of invading battle-droids on Praesitlyn with only a small contingent of clone soldiers. Commanding them will be Jedi Master Nejaa Halcyon — hand-picked by the Council for the do-or-die mission. And at his side, skilled young starfighter pilot Anakin Skywalker, a promising young Jedi Padawan eager to be freed of the bonds of apprenticeship — and to be awarded the title of Jedi Knight."}, {"tag": "p", "text": "Shoulder to shoulder with a rogue Republic army officer and his battle-hardened crew, a hulking Rodian mercenary with an insatiable taste for combat, and a duo of ready-for-anything soldiers, the Jedi generals take to the skies and the punishing desert terrain of occupied Praesitlyn — to gain back a vital position in the Republic. Already outnumbered and outgunned, when confronted with an enemy ultimatum that could lead to the massacre of innocents, they may also be out of options. Unless Anakin Skywalker can strike a crucial balance between the wisdom born of the Force…and the instincts of a born warrior."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The book starts off with Anakin Skywalker in the Jedi Temple receiving a call from his Master Obi-Wan Kenobi. Kenobi is on another mission, and Anakin is forced to stay in the Temple to continue his training. Anakin then meets Jedi Master Nejaa Halcyon and over the next several hours, the two become sparring partners in lightsaber dueling in the training chambers. They eventually dine together, too."}, {"tag": "p", "text": "Meanwhile, on the planet Praesitlyn, which is a major communications center for the Republic, the planet prepares itself from an invasion from Separatist forces lead by Admiral Pors Tonith. All of Praesitlyn's defense force is destroyed by Tonith's forces comprising more than one million battle droids, but two of Praesitlyn's residents survive the onslaught: Odie Subu, a female soldier in General Khamar's Praesitlyn army, and Erk H'Arman, a pilot observing the surface of the planet, meet up together and lay low from Tonith's forces. As for Tonith himself, he captures the communications center, operated by the famous Reija Momen, and holds her and her employees hostage. Tonith then forces Momen to read a manuscript that will be sent out to the Republic to threaten them to surrender Praesitlyn over to the Separatists. However, Momen disobeys at the last words and cries for the Republic to attack Tonith's forces and defeat them."}, {"tag": "p", "text": "While the Republic on Coruscant debates over Momen's message, and whether they should send clone troopers or not, a major rebellion on Praesitlyn begins against Tonith and his Separatist forces lead by General Zozridor Slayke and his many soldiers. Erk and Odie are then saved from certain death in Praesitlyn's heat by Slayke's forces, and they join the fight against Tonith. However, when Erk becomes battle mad in one attack against Tonith, it leads him and Odie into an accident that traps them in a bunker for several days."}, {"tag": "p", "text": "Meanwhile, when the Galactic Senate of the Republic finally allows for the attack on Praesitlyn to begin, Nejaa Halcyon is allowed by both the Senate and the Jedi Council to send troops in to help Slayke's forces and defeat Tonith. Halcyon agrees to go, and he takes Anakin with him, as well as a Rodian soldier named Grudo. When Anakin is introduced to Grudo, Nejaa reveals to the Jedi Padawan that Grudo used to work for Zozridor Slayke, and that around a certain time in the past, earlier in the Clone Wars, Slayke was a rebel who decided to fight the Separatists in his own way and departing himself from the Republic due to its slow and political ways. Nejaa was sent by the Republic to track him down and arrest him, and on a certain planet, Nejaa happened to be following Slayke, the Jedi first met Grudo, and the two fought while Slayke got away. Eventually, Nejaa and Grudo became friends, but after Slayke was pardoned by Supreme Chancellor Palpatine and was decreed a rightful citizen of the Republic again, Nejaa and Slayke still had their differences, but they settled their feud nevertheless."}, {"tag": "p", "text": "Eventually, Nejaa, Anakin and Grudo travel to Praesitlyn with several thousand clone troopers and a commando squad that Anakin befriends, and they arrive just in time to help Slayke and his forces just as his forces are faltering. However, before they arrive, Anakin sends a love letter to his secret wife, Padmé Amidala, and both Anakin and Nejaa reveal truths about the oaths they broke against the Jedi Code - Anakin reveals all about his relationship with Padmé, and Nejaa reveals that he has had a wife and kids for years now. Later in the rebellion's activities, Grudo and a few of Slayke's men find out that, without proper maintenance, the battle droids stationed on Praesitlyn will fail in time. After Grudo and the soldiers escape from a battle droid attack at night, Erk and Odie finally get out from beneath their bunker and Odie accidentally shoots Grudo in the head, mistaking him for an enemy. Eventually, the surviving soldiers bring Erk and Odie back to the rebellion, along with Grudo, and due to the wound he sustained, he dies from it, and Anakin is the last one Grudo talks to. Despite Anakin's deep friendship with Grudo, he forgives Odie for his murder, knowing she killed him because she didn't know Grudo was on her side."}, {"tag": "p", "text": "Several failed attacks against Tonith later, Anakin deducts a plan where Halcyon and Slayke mount a direct assault against Tonith's forces while Anakin and several other clone troopers sneak into the communications bunker to free the hostages and defeat Tonith and his crew. However, they are confronted by several battle droids which Anakin easily defeats. Unfortunately, Anakin is nearly driven to the dark side of the Force, driving him further to his destiny, after a battle droid kills Momen, whom Anakin feels a rapport with due to similarities between her and his mother. Anakin defeats several more battle droids, and eventually gets to Tonith and his crew. However, before Anakin can kill either Tonith of any of his technicians, the voice of Qui-Gon Jinn contacts him and prevents him from killing Tonith or any of his group. Tonith easily surrenders to Anakin, and Tonith and his crew are finally arrested by the Republic's forces stationed at Praesitlyn."}, {"tag": "p", "text": "But the fight for Praesitlyn is not yet over, as the Republic has learned that Commander Asajj Ventress has sent backup for Tonith through a Trade Federation ship and a considerable fleet. Anakin, Halcyon and several clone troopers board their starfighters, and confront the ship and their droid fighters. However, toward the end of the fight, Anakin decides to sacrifice himself in order to take out the Federation ship in an attempt to blow it up, and he privately tells Halcyon through a secure comm channel to tell Padmé Anakin loved her. The Federation ship explodes, and the Republic forces on Praesitlyn celebrate another victory in the Clone Wars, but Halcyon grieves over Anakin. However, Anakin returns to Praesitlyn in time for the celebration and reveals he managed to survive his suicidal run on the Trade Federation ship by going into hyperspace just before the giant starship blew up."}, {"tag": "p", "text": "After the Praesitlyn victory for the Republic, the Jedi Council decides that for Anakin's actions in the Republic's victory, they will promote him to a full-fledged Jedi Knight when he returns to Coruscant. Meanwhile, the book ends with Darth Sidious who is reflecting that, with the Praesitlyn victory, everything is proceeding as he has foreseen."}, {"tag": "h2", "text": "Excerpt"}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Jedi Trial, and consequently the decision to knight Anakin, is placed 30 months after the Battle of Geonosis (19.5 BBY) in official Clone Wars timelines, yet the The Clone Wars movie, created later and placed in 22 BBY, shows Anakin to be a knight already. The date of Jedi Trial was revised to c. 22 BBY in The Essential Reader's Companion."}, {"tag": "p", "text": "This novel describes the Sluis sector as a Republic sector. This is an error since, according to the canon of Star Wars Legends, Sluis is a Confederacy-controlled sector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": "This is a gallery of the different cover variations of Jedi Trial."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}