{"url": "Jedi_ace", "categories": ["Category:Legends articles", "Category:Jedi aces"], "nodes": [{"tag": "h1", "text": "Jedi ace"}, {"tag": "p", "text": "A Jedi ace was a specialized path that could be taken by any Jedi Knight pursuant to becoming a Jedi Guardian. Each a member of the Jedi Starfighter Corps, aces combined their connection to the Force with their piloting skills to be able to perform almost impossible and daring maneuvers to down their enemies or avoid being downed themselves."}, {"tag": "p", "text": "Those Jedi who pursued this manner of training would fly in specialized starfighters in order to master the art of space combat. While the aces flew for the Army of Light and along side the Republic Navy in the New Sith Wars, the Ruusan Reformation saw a change in the make up of the Republic's defense forces. Now reliant on sector and planetary forces to ferry the non-hyperspace capable vessels between the stars, the aces still served proudly. It wasn't until the Guardian and Ace, Jedi Master Crix Sunburris put the aces' role in the Order into text, with his authoring of a section of The Jedi Path: A Manual for Students of the Force."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Flying on instinct and trust in the Force, victory in battle was achieved through a special Force-bond known as a Force meld, a binding of two or more minds to coordinate attacks. Battle meditation was also frequently employed by those working with the aces, so that the pilots became an extension of the coordinator's battle plan. Some Jedi aces would use the Force not only to enhance their own flying but also to influence the mind of their opponents, causing them to be confused or to lose concentration. Luke Skywalker did this once while engaging in a dogfight with Imperial forces, but had serious doubts afterward whether that technique was too dark."}, {"tag": "p", "text": "Many Jedi from both the Old and New Jedi Order served proudly as an ace in the fight against the Sith and doers of evil. Before he was barely a member of the Order, future ace Anakin Skywalker received a patch from Corps member Master Shaptives following his heroism in the Battle of Naboo in 32 BBY. Later, Padawan Ahsoka Tano would detail in her edition of The Jedi Path that she had aspirations of joining this elite group, but would never do so due to the Great Jedi Purge. Following the Order's rebirth, Grand Master Skywalker, his wife Mara, their niece Jaina Solo, Kyp Durron, and Corran Horn were all considered among the finest the Jedi academy had produced."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jedi Ace is a prestige class in the Star Wars Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}