{"url": "Jedi_Vector", "categories": ["Category:Canon articles", "Category:Jedi Order starship classes", "Category:Starfighter classes", "Category:Valkeri Enterprises products"], "nodes": [{"tag": "h1", "text": "Jedi Vector"}, {"tag": "p", "text": "Jedi Vectors were a model of starfighter utilized exclusively by the Jedi Order during the High Republic Era. Designed to be a physical extension of the Jedi's connection to the Force, the Vector was a sleek and streamlined vessel that emphasized performance and maneuverability. Renowned for its speed, it was a highly-precise craft that demanded extreme concentration from its pilot. Further cementing itself as the premier ship of the Jedi Order, the Vector's weapons systems could only be activated with the use of a lightsaber as a key. This prevented non-Force-sensitives from using the ships and ensured deadly force could only be used in carefully considered situations."}, {"tag": "p", "text": "The Vector was instrumental in rescue operations during the Great Hyperspace Disaster of the Hetzal system and the catastrophes known as Emergences that followed. After the freighter Legacy Run was mysteriously destroyed in hyperspace, passenger compartments and debris from the ship began to enter realspace across the galaxy at blinding speeds, threatening billions of lives. Using a technique developed by Joss and Pikka Adren, however, Galactic Republic and Jedi forces were able to use Vectors in tandem with Republic Longbeams to slow the wreckage down, allowing them to prevent further devastation."}, {"tag": "p", "text": "The Vector was also used concurrently to defend against the Nihil, a marauder group led by Marchion Ro that orchestrated the Great Disaster. The Jedi piloted Vectors in battle with the Nihil over many locales, including Elphrona, Trymant IV, and the Kur Nebula. At the latter location, Republic and Jedi forces engaged the Nihil in the Battle of Kur, a devastating endeavor that saw heavy casualties on both sides. With the Nihil routed for a time, the Jedi continued to transport themselves aboard Vectors in the Outer Rim Territories, where the newly-christened Starlight Beacon served as their hub on the Galactic Frontier."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Design"}, {"tag": "p", "text": "Classified as starfighters, Jedi Vectors were designed by Valkeri Enterprises for the Jedi Order during the High Republic Era. They were nimble, capable of responding quickly to their Force-sensitive pilots.  Sleek and angular, the vessels were made for precision, designed with sharp edges to reduce air resistance and maximize speed. Vectors could be configured to carry either one or two occupants, allowing Jedi to fly either alone or with their Padawans. The vessel could be controlled from either seat, but the skill required to pilot the ship often mandated that a Jedi Master sit behind the controls. As its name implied, the Jedi Vector was designed to be piloted only by Jedi. It shared some design elements with the Vanguard, a land-based vehicle also developed by Valkeri."}, {"tag": "p", "text": "The Vectors were designed from a minimalist perspective. They lacked systems that would otherwise be essential to non-Force-sensitive pilots, including shielding and important computer components. The ships were designed to transmit every tactile response directly to its Jedi pilot. Although this fluid responsiveness allowed pilots to pull off complex maneuvers, it also came at the price of requiring a great deal of focus from its operator. The ship's cockpit bubble was made from transparisteel and could be retracted smoothly into the Vector's hull or even blown off the vessel, in the event that a pilot needed to escape the craft quickly. Some of the starfighter's functions were designed to be operated remotely via the Force in emergencies, and incredibly-skilled Jedi could even pilot a Vector using only the Force."}, {"tag": "h3", "text": "Weapons and other systems"}, {"tag": "p", "text": "Despite the Vector's spindly appearance, its firepower was not to be ignored. The starship's two laser cannons could only be used if a lightsaber was placed on an activation panel in the cockpit, which locked the weapon in place with a small force field. This design element was incorporated as both a security measure as well as a way to ensure that the weapons systems could only be fired after well-considered action, since Jedi only took life when there was no other choice. Further emphasizing this belief, a toggle on the Vector's control sticks allowed for pilots to choose non-lethal or stun blasts. Upon activation of the weapons systems, the ship's interior would light up in the color of the activating lightsaber's blade. In addition, control of another starship's weapons could be transferred to a Vector, allowing a Jedi to temporarily take control of an ally's weapons to engage in precise combat."}, {"tag": "p", "text": "Although the starfighter lacked many of the systems that were standard among other vessels, it was not completely barren. Besides weapons, the Vector was also equipped with a droid that could recover a pilot in the event that the cockpit was destabilized. The ship also contained a comm unit that was capable of translating certain languages into Galactic Basic Standard, as well as a small tractor beam. In the event that a Jedi chose to depart the vessel mid-flight, the ship could be engaged with an autopilot."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Vectors, as Jedi starships, were used on missions undertaken by members of the Order. Due to the Order's long association with the Galactic Republic, they were also used on joint operations with Republic personnel. Being the sole pilots of the Vectors, the Jedi developed special techniques with the craft that would have been impossible for ordinary pilots or droids. While some Jedi did lack certain finesse with their ships, the most skilled pilots were able to fly the vessel so deftly that it almost became part of the wind itself."}, {"tag": "p", "text": "The full capabilities of a Vector were determined by its Jedi pilot's connection to the Force; through this mystical energy field, the pilots could work in tandem to coordinate blindingly swift maneuvers that would have been unsurvivable for other beings. One such movement was known as a Drift of Vectors, a technique which saw multiple pilots weave their fighters into sharp formations, akin to flocks of birds or falling leaves."}, {"tag": "p", "text": "In addition to being capable combat fighters in their own right, Jedi Vectors could also act as escort craft for larger ships, ferrying them through dangerous territory. In situations where the vessels were needed for defense, Vectors could be used to blockade planetary bodies and prevent hostile ships from leaving a star system."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early usage"}, {"tag": "p", "text": "Jedi Vectors were in use by six years before the Starlight Beacon was launched in 232 BBY. Around 238 BBY, Jedi Master Sskeer and his Padawan Keeve Trennis travelled to Kirima in a Vector for her Jedi training. The Master and Padawan duo of Loden Greatstorm and Bell Zettifar always flew the same two-seated Vector during their missions; on one such occasion, they flew the vessel through an ion storm that left scoring reminiscent of starbursts along its wings. Zettifar secretly took to calling the vessel the \"Nova\" after this incident, though his master had overheard his Padawan use the name while playing with Ember, a charhound the boy had taken a liking to on Elphrona."}, {"tag": "p", "text": "Zettifar once witnessed an exhibition on the galactic capital Coruscant that involved three hundred Jedi Vectors. The fleet of ships wove in and out of the air above Senate Plaza in a Drift as a part of the Jedi Temple's outreach programs. Zettifar remembered the experience as the most beautiful thing he had ever seen."}, {"tag": "h3", "text": "The Great Disaster"}, {"tag": "h4", "text": "Initial rescue operations"}, {"tag": "p", "text": "Shortly after a conclave hosted on the Starlight Beacon to celebrate its upcoming launch, an event that would come to be known as the Great Hyperspace Disaster occurred, in which the Class A modular freight transport Legacy Run tore apart in hyperspace. Debris from the incident exited hyperspace at extreme speeds, hurtling towards the Hetzal system and threatening to cause a cataclysmic event on impact. The Jedi and Republic immediately launched a rescue effort from the nearby Beacon, with a total of fifty-three Jedi Vectors, including the Nova, carried aboard the Republic Defense Coalition Emissary-class Republic Cruiser Third Horizon. The Vectors, as well as many Republic Longbeams, were launched from the cruiser as soon as it arrived in the star system, dispersing to offer assistance."}, {"tag": "p", "text": "Greatstorm and Zettifar flew the Nova to Hetzal Prime, searching for areas of discordance on the planet. Reaching out through the Force, Zettifar detected troubling energy and guided his Master and the Vector to a compound where a growing mob was desperately attempting to break past armed guards to reach a starship. Circling one hundred meters above the crowd and unable to land, the Twi'lek Master left his Padawan in the Nova while he leapt out to deal with the situation, reaching the ground using controlled descent. Zettifar himself jumped out shortly after, leaving the Vector to fly itself in gentle circles."}, {"tag": "p", "text": "Above the Fruited Moon of Hetzal, three Vectors manned by Jedi Knights Te'Ami, Mikkel Sutmani, and Nib Assek were tasked with destroying a hyperspace anomaly heading for the moon's primary landmass. They were assisted by volunteers Joss and Pikka Adren, who relinquished the weapon controls of their Longbeam, Aurora III, to the Jedi Te'Ami. As the small squadron was about to fire, however, Assek's copilot, the Wookiee Padawan Burryaga Agaburry, alerted his companions to a troubling discovery: through the Force, he had sensed that the anomaly contained living beings. With this revelation in mind, the Adrens quickly devised a new plan; the Jedi would use their connection to the Force to slow the object down while the Longbeam used its magclamps to halt the anomaly's acceleration. With no shortage of difficulty, the group managed to pull off the makeshift plan and passed it along to other rescue teams."}, {"tag": "h4", "text": "Averting catastrophe"}, {"tag": "p", "text": "Everywhere in the system, many other Jedi worked to save lives where they could, all connected through Avar Kriss's network in the Force. Kriss could feel Vectors destroying incoming fragments near one of the system's gas giants, as well as her friend Elzar Mann, a lone-wolf Jedi Knight, who flew a single-seat Vector near the Hetzal system's trinary star. Through this network, Kriss also became aware of Agaburry's discovery and informed RDC Admiral Pevel Kronara that more Vectors and Longbeams would need to engage in the rescue maneuvers created by the Adrens. As time went on, the Disaster became more manageable, and more Jedi from elsewhere in the galaxy arrived aboard Vectors to help, including Masters Jora Malli and Sskeer, who executed precise maneuvers to destroy a fragment before it could destroy a civilian transport."}, {"tag": "p", "text": "The Disaster was not averted, however, as a lieutenant aboard the Third Horizon had discovered that one piece of debris, a container of liquid Tibanna, was rapidly approaching the system's R-class star. If the two collided, a chain reaction would occur that would wipe out the entire system. Kriss used all her power to reach out to every Jedi she could, urging them to come together and use the Force to move the object off-course. Although she acknowledged that they had a great chance to fail, not a single Vector pilot left the system; all were determined to try. The effort proved too much for some; many pilots lost control of their vessels, and a group of five Vectors collided in the middle of a Drift after devoting too much focus to the container, resulting in three deaths. Nevertheless, the collective power of the Jedi managed to push the Tibanna just out of the way of the star, saving the Hetzal system."}, {"tag": "h3", "text": "The Nihil threat"}, {"tag": "h4", "text": "The Emergences"}, {"tag": "p", "text": "Following the Hetzal incident, more pieces of the Legacy Run exited hyperspace across the galaxy in a series of events that came to be called Emergences. Unbeknownst to the Jedi or Republic, these disasters had been orchestrated by Marchion Ro, the Eye of a pirate organization known as the Nihil. Ro and the Nihil sowed havoc across the Outer Rim Territories during this time, causing chaos that the Jedi Order answered, in part, with their Vector starfighters. During an Emergence in the Trymant system, Ro led an attack on Trymant IV, taking citizens of Bralanak City aboard his Spider Cruiser. As the Nihil fled the system, they encountered a blockade set up by a Republic rescue fleet made up of several Vectors and a medical frigate. Instead of firing at the approaching fighters, Ro ordered his pilot, Zagyar, to aim their weapons at the hospital ship. On Ro's command, the Spider Cruiser unleashed a devastating blast on the frigate, destroying at least one Vector in the crossfire. The Jedi pilots were forced to turn their attention to the burning vessel, allowing the Nihil to escape."}, {"tag": "p", "text": "The Republic scientist Keven Tarr developed a method for predicting new Emergences, allowing them to know when and where to perform the Vector-Longbeam rescue developed at Hetzal, which was practiced many times over the course of the Emergences. The original creators of the maneuver, the Adrens, as well as the Jedi Te'Ami and Sutmani, used their skills to save survivors of the Legacy Run in the thirty-ninth Emergence with little difficulty. Trouble struck, however, at the fortieth Emergence, when Nihil forces led by Lourna Dee fired at hyperspace wreckage that contained the Legacy Run's flight recorder, which could have incriminated the Nihil in the Disaster. Volleys of missiles and blasterfire were exchanged, and although the Republic and Jedi forces were successful in defending the recorder, they suffered several casualties, including Master Te'Ami in her Vector."}, {"tag": "h4", "text": "Raid on Elphrona"}, {"tag": "p", "text": "At the Jedi outpost on the planet Elphrona, the Jedi Indeera Stokes planned to take a Vector to the southern hemisphere to observe a newly-discovered vein of essurtanium. Greatstorm, who was also stationed at the outpost, insisted that she take Zettifar with her, so that he may continue to learn controlled descent from the seat of the starfighter. Their plans were interrupted when they were alerted to an ongoing crisis: Nihil raiders had kidnapped the Blythes, a local family of farmers. After losing their Vanguard pursuing the criminals, Stokes returned to the outpost and manned a Vector, using the Force to remotely fly a second vessel, the Nova. She caught up to the chase and initiated a two-craft Drift will firing upon a Nihil Cloudship. Stokes' mastery of concentration greatly impressed Zettifar, who watched from the surface. She landed the Vectors so that Greatstorm and Zettifar could board the Nova, ready for flight."}, {"tag": "p", "text": "The Jedi pursued the damaged Cloudship, which could not jump to hyperspace due to complications with Elphrona's unique gravity well. Realizing that the Vectors would tear her ship apart in direct combat, the ship's Cloud, Ultident Margrona, chose to exploit the Jedi's morality and ordered for the youngest Blythe daughter, Bailen, to be thrown from the ship. With little discussion, Bell Zettifar leapt from the Nova, catching the child in mid-air and finally accomplishing a smooth, controlled landing with the Force. Stokes and Greatstorm, meanwhile, continued to chase the Nihil into space. In order to slow the marauders down, Greatstorm performed a near-impossible maneuver that placed him in front of the Cloudship, flying backwards and out of range of its laser cannons. Looking Margrona dead on, Greatstorm persuaded her with a mind touch to open the vessel's air lock. Stokes took advantage of the situation, leaping into the vacuum from her Vector and boarding the ship."}, {"tag": "p", "text": "In that moment, however, the entirety of Lourna Dee's Tempest came out of hyperspace, vastly outnumbering the two Jedi. Greatstorm pulled his Vector away from the Cloudship and attempted as best he could to weave through the cascade of blasterfire from the Nihil fleet. Only able to take one additional passenger aboard her starfighter, Stokes rescued the young Ronn Blythe from the battle, leaving his father, Ottoh, to be saved by Greatstorm. Flying the ship with his hands and firing its weapons with the Force, the Twi'lek Jedi covered Stokes' escape, destroying many of the marauders' ships. Singlehandedly, Greatstorm and his Nova managed to fend off a majority of the Nihil armada, save for Dee's flagship, the shields of which could not be pierced by the Vector. Turning back to the Cloudship, Greatstorm leapt from his craft and flew into the damaged vessel, breaking his leg in the process. Her enemy subdued, Dee destroyed the Nova and boarded the Cloudship, capturing Greatstorm and Blythe."}, {"tag": "h4", "text": "The Battle of Kur"}, {"tag": "p", "text": "Meanwhile, Dee's fellow Tempest Runner, Kassav Milliko, had been sent to the Kur Nebula by Ro, where he had been told to intercept a Republic ship carrying the damaged flight recorder. In reality, Ro had sent the Weequay and his Tempest unprepared into an engagement with RDC and Jedi forces, which included the Ataraxia, a Jedi cruiser with a full complement of Vector starfighters. The ship was commanded by Master Jora Malli, who elected to personally lead the Jedi fighters against the Nihil fleet should their presence be needed. The Republic task force, however, was well equipped to handle the unorganized Nihil in the battle that followed, tearing through their initial defenses. Milliko realized that he could not withstand a fair engagement against the Defense Coalition, much less the Jedi and their Vectors, and ordered his forces to engage in aggressive, unorthodox tactics. Recognizing that his pilots were untrained for such combat, the Republic commander, Admiral Kronara, called upon Malli and her Jedi for help."}, {"tag": "p", "text": "The Jedi of the Ataraxia, many of whom had saved lives during the Great Disaster, boarded their Vectors, connected through the Force by Master Avar Kriss. Malli led her squadron in a Drift, approaching on the Nihil forces embroiled in conflict with the RDC. Before they could reach the main battle, however, Marchion Ro unleashed a secret tactic he called the Battle Paths; using experimental hyperdrives, the Nihil ships entered and exited hyperspace over incredibly short distances in every direction, appearing in the path of the Republic craft. One vessel dropped from hyperspace directly into the Jedi Drift, killing a great number of pilots instantly, including Master Malli herself. A piece of debris struck the vessel of Malli's partner, Sskeer, severing his arm and sending him unconscious in the vacuum of space. A droid installed into his Vector, however, managed to save the Trandoshan Jedi."}, {"tag": "p", "text": "The collision with the Nihil ship sent the Drift into disarray, forcing the Vectors to separate and fight on their own. Jedi Knight Elzar Mann wove through the chaos, destroying Nihil vessels just as they exited hyperspace. Ro changed tactics once again, now purposefully targeting Republic ships, killing his own people in the process. Kronara called the pilots of his Z-28 Skywings back, leaving the more maneuverable Vectors to defend against the dwindling number of enemy vessels. As the last of the Nihil died, the battle ended, leaving the nebula a graveyard of Vectors, Longbeams, and other craft. Marchion Ro later showed holograms of the Battle of Kur to his followers, framing the Tempest's suicide tactics against the Vectors as a noble sacrifice for the Nihil."}, {"tag": "h3", "text": "Apparent peace"}, {"tag": "p", "text": "Following the Battle of Kur, Sskeer took his Padawan, Keeve Trennis, to the planet Shuraden aboard a Vector to begin her Jedi Trials, the final test in becoming a Jedi Knight. Her lesson was interrupted, however, by the arrival of ridadi, gigantic star-locusts whose migratory patterns had been thrown off by the signals emanating from the Starlight Beacon. Trennis left her trial and master behind, boarding their Vector and approaching the insects in an attempt to stop them from destroying a city of Ximpi. After connecting with the ridadi through the Force, Trennis realized why the creatures were attacking and rigged her Vector to replicate Starlight's signal."}, {"tag": "p", "text": "The star-locusts gave chase, pursuing the Vector across the landscape of Shuraden. Leading the insects away, Trennis made contact with Jedi Master Estala Maru, who was stationed aboard the Beacon, and informed him of the situation. The Kessurian Jedi promptly reprogrammed the space station to broadcast on a different frequency. The threat averted, Trennis sent the Vector flying into the atmosphere and ejected from the vessel. Although the small Ximpi Kanrii worried that her Jedi friends would be angered at the loss of the ship, Trennis reassured the alien and claimed that Vectors were easy to come by. Nevertheless, when Sskeer discovered what had happened to their ship, he shrugged his apprentice off and immediately called for a new transport."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jedi Vector was created for the Star Wars: The High Republic multimedia project, a narrative initiative to explore the Jedi centuries before the events of Star Wars: Episode I The Phantom Menace. The ship first appeared in the initial release of High Republic media, simultaneously debuting in the novel Light of the Jedi by Charles Soule as well as the young readers book The Great Jedi Rescue by Cavan Scott on January 5, 2021. The Vector was first shown off to the public ahead of the initiative's release on December 11, 2020 in a StarWars.com article that gave an overview of some of the ships and vehicles that would be introduced in the upcoming project."}, {"tag": "p", "text": "According to Pablo Hidalgo of the Lucasfilm Story Group, the creative team behind The High Republic had a specific design philosophy in mind when creating the world for their new stories; since the era was set hundreds of years before the time of corruption seen in the prequel trilogy, the technology of the High Republic had to evoke an idealized version of what was seen in those films. To that end, the Lucasfilm Ltd. art department searched through thousands of pieces of unused concept art from various Star Wars productions in order to find the right designs to fit their intentions. Eventually, a piece of art originally created by Warren Fu for the 2005 film Star Wars: Episode III Revenge of the Sith was chosen to represent the Jedi Vector."}, {"tag": "p", "text": "Originally created with the intention of being a clone starfighter for Episode III, Fu's concept was chosen for its streamlined design, with StarWars.com senior editor Dan Brooks describing it as \"almost mosquito-like, an angular and elegant design befitting this gilded age.\" Phil Szostak, the creative art director of Lucasfilm, considers the ship a favorite of his designs for the project, citing his joy at seeing Fu's creation finding a place in Star Wars canon. The original art for the fighter featured the crest of the Galactic Republic, as seen in the prequels, on its wings; for its appearances as the Jedi Vector in Marvel Comics' High Republic series, the crest was replaced by the symbol of the Jedi Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}