{"url": "Jedi_academy", "categories": ["Category:Legends articles", "Category:Articles with non-canon elements", "Category:Pages needing citation", "Category:Jedi academies"], "nodes": [{"tag": "h1", "text": "Jedi academy"}, {"tag": "p", "text": "Jedi academies were established to train Force-sensitive beings accepted into the Jedi Order in the ways of the Force."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Overseen by the Council of First Knowledge, each academy was governed by an advisory Council appointed by their superiors on Coruscant. Mainstreaming the majority of teachings at the Temple, certain practices were permitted to vary from world to world. However, at all sanctioned academies, a group of Jedi Masters would instruct Initiates to the Order in the ways of the Force. The size of the school varied from world to world: some as small as a single clan of younglings, others as large as the main academy housed within the Jedi Temple of Coruscant. Many academies had been established during the Old Sith Wars and were located in the Galactic Rim. Some were located on or near Force wellsprings or places significant to the Order like crystal caves or nexuses of dark-side energies that needed constant monitoring."}, {"tag": "p", "text": "In addition to the traditional academies established by the Order, the Exploration Corps maintained several spacefaring mobile academies such as the Chu'unthor so that roaming the galaxy and exploring new worlds could be achieved while still teaching traditional doctrine."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the fall of the Galactic Republic in 19 BBY, many of the ancient academies had been shut down for decades, with the Council of First Knowledge preferring the central teachings of the Coruscant Temple. After the dissolution of the Order during the Great Jedi Purge, all orthodox Temples and academies were routed and burned in order to prevent any more Jedi from learning the secrets of the Force. However, the Galactic Empire's choke hold on Force-education did not last and the Order was reformed following the conclusion of the Galactic Civil War. When Grand Master Luke Skywalker began to expand his Order from a single class to the size of the old Order, he opened several old academies, as well as new facilities to promote growth within the Order."}, {"tag": "p", "text": "In an era of peace approximately 200 years before the Battle of Yavin, extensive facilities were in place within the Jedi Temple academy for training. These included extensive student dorms, a cafeteria, and numerous training rooms for activities such as gym class and mock lightsaber dueling. Students trained in a wide variety of subjects under Jedi Masters such as Yoda and Mr. Garfield. Visits from parents and family were occasionally permitted, and students were allowed spring and summer breaks."}, {"tag": "h2", "text": "List of Jedi academies"}, {"tag": "h3", "text": "Pre-Great Jedi Purge"}, {"tag": "h3", "text": "Post Great Jedi Purge"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the spring of 2006, the University of Wisconsin–Milwaukee had a vote regarding a possible name change to Wisconsin State University. Among the write-ins: ten votes to change the institution's name to Jedi Academy.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}