{"url": "Jedi_Weapon_Master", "categories": ["Category:Legends articles", "Category:Jedi ranks", "Category:Jedi Weapon Masters"], "nodes": [{"tag": "h1", "text": "Jedi Weapon Master"}, {"tag": "p", "text": "A Jedi Weapon Master was a title given to those Jedi Masters who pursued the study of physical combat with the Force, especially of exotic weapons (or unusual styles) under the distinct schooling division known as the Jedi Guardian."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Some of the greatest fighters of the Jedi Order, they had existed for many centuries though were few in number. While the title had been formally distributed before, it wasn't until Guardian Jedi ace Crix Sunburris described the qualification of becoming a specialist in his contribution to the text of The Jedi Path: A Manual for Students of the Force."}, {"tag": "p", "text": "Setting aside their lightsabers, Weapon Masters would spend years of study, honing their skills in the art of their chosen weapon. Becoming highly skilled in their art, they were well respected within the Order and without. Mastering the use of either a double-bladed lightsaber, lightsaber pike, quarterstaff, San-Ni staff, whips, or flails, was all that needed to be done to be considered a Weapon Master by the Jedi High Council. Additionally, ranged weapons and the use of one's body as a weapon were sufficient to receive this recognition."}, {"tag": "p", "text": "From the Great Hyperspace War to the Great Sith War, Weapons Masters appeared more frequently, for it was a long period of conflict and violence. However, after the supposed destruction of the Sith, they became less common within the Order. None were known to have survived the Great Jedi Purge."}, {"tag": "p", "text": "Jedi Masters Thon and Vodo-Siosk Baas were both recognized Weapon Masters of the Great Sith War era. Following the Ruusan Reformation, one of the most noted Weapon Masters was the famed Raskta Lsu. Later, Master Waldan Bridger was considered especially skilled with the ancient San-Ni staff. Before the Clone Wars, Sora Bulq, Anoon Bondara and Mace Windu were among the most renowned Weapon Masters of their generation."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jedi Weapon Master first appeared as a prestige class for the Star Wars Roleplaying Game in Star Wars Gamer #9 and was featured in the Power of the Jedi Sourcebook."}, {"tag": "p", "text": "It also appeared in the video game Star Wars: Knights of the Old Republic II: The Sith Lords, where it is one of the six prestige classes open to a level 15 character, and one of the three light side choices. In the game, the class corresponds to the class Sith Marauder, as both focus on their own strength with a blade, and are more fit for heavy combat than the other prestige classes available: Sith assassin, similar to Jedi Watchman - and Sith Lord, akin to Jedi Master."}, {"tag": "p", "text": "In the Star Wars Miniatures set Champions of the Force, the Jedi Weapon Master character resembles Cin Drallig."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}