{"url": "Jedi_armor", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Armor", "Category:Jedi equipment"], "nodes": [{"tag": "h1", "text": "Jedi armor"}, {"tag": "p", "text": "During times of great conflict, Jedi would sometimes require the use of battle armor. Armor-clad Jedi were a common sight on the battlefields of the New Sith Wars, while the ancient Jedi of the era of the Old Sith Wars would often wear parts of armor to protect certain areas of their bodies, as would many Jedi of the New Sith Wars era. Shoulder guards were especially common among the ranks of the ancient Jedi."}, {"tag": "p", "text": "Jedi armor was designed to be light and comfortable, giving the wearer as much freedom of movement as possible. However, the freedoms provided by Jedi armor were very limited compared to those provided by traditional Jedi robes. In the ancient wars between the Jedi and the Sith, the battlefields were often so packed with combatants that moving about freely on the battlefield would be difficult even without armor. This would result in immobile and poorly protected combatants, which may be why the Jedi of those eras chose to prioritize armor to mobility."}, {"tag": "p", "text": "Finding particular use in the Army of Light under Lord Hoth during the New Sith Wars, Jedi armor was designed to be comfortable for the wearer, light and give the wearer the ability to use the Force as much as possible."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "At the time of the Pius Dea Crusades"}, {"tag": "p", "text": "During the Pius Dea and early Ductavis eras, Jedi Knights wore full-body metal armor with horned helmets. This type of armor was immortalized in history, as Luke Skywalker was familiar with it as a young man, more than 10,000 years later."}, {"tag": "h3", "text": "During the Great Galactic War and Cold War"}, {"tag": "p", "text": "During the Great Galactic War and the Cold War in the years following the Treaty of Coruscant, many Jedi Knights donned parts or even entire suits of heavy armor when going into battle."}, {"tag": "h3", "text": "During the Battle of Ruusan"}, {"tag": "p", "text": "Throughout the New Sith Wars, Jedi would customize and modify their armors while some preferred not to wear any armor at all."}, {"tag": "p", "text": "Around the time of the Great Galactic War (and at times in the later years), Jedi armor commonly had kamas, whereas Sith armor had capes."}, {"tag": "p", "text": "After the Ruusan Reformation, the Jedi, having disbanded their armies, also gave up the use of the armor."}, {"tag": "h3", "text": "During the Clone Wars"}, {"tag": "p", "text": "Around one thousand years later, the Clone Wars broke out. On certain occasions, Jedi, fighting side by side with clone troopers, would wear modified clone trooper armor. General Obi-Wan Kenobi wore clone trooper armor in the Battle of Muunilinst to protect himself from the lances of Durge and his army of swoop-riding assassin droids."}, {"tag": "p", "text": "During this same period, Jedi Knight Bardan Jusik was well known for wearing clone trooper armor into combat, and later on even full Beskar'gam."}, {"tag": "p", "text": "Later into the war, many Jedi wore chest plate armor that resembled modified clone armor designs. Anakin Skywalker and Obi-Wan Kenobi were examples of Jedi that wore these designs. Often, many Jedi continued to wear modified clone trooper gauntlets with chest plates."}, {"tag": "h3", "text": "Post-Clone Wars"}, {"tag": "p", "text": "After the Clone Wars, those few Jedi that survived Order 66 went into hiding so as not to fall victim to the Great Jedi Purge. Some of those ceased to wear traditional Jedi garments and would start wearing battle armor so as not to give themselves away as Jedi. Bultar Swan, for instance, started wearing battle armor, but eventually fell victim to the Jedi Purge. Other Jedi, like Drake Lo'gaan, would supplement their robes with bits and pieces of clone trooper armor. A clone of Galen Marek also came into possession of a set of Hero's Armor, as well as a set of Experimental Jedi Armors developed on Kamino."}, {"tag": "h3", "text": "New Jedi Order"}, {"tag": "p", "text": "During the Yuuzhan Vong War, some Jedi wore padded jumpsuits. Luke Skywalker and Jacen Solo wore such jumpsuits during their mission to Belkadan early in the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In an interview Dan Thorsland, editor of the Tales of the Jedi comic books argues that wearing armor is not consistent with the way of the Jedi:"}, {"tag": "p", "text": "This is in contrast with the way that the Jedi are depicted in Jedi vs. Sith—set in the New Sith Wars—where most of the Jedi are armor-clad. Obi-Wan Kenobi and Saesee Tiin are both featured in full armor in Star Wars: Clone Wars, although Tiin's armor's primary function is that of a spacesuit. The Knights of the Old Republic games on the other hand preserve consistency with the typical Jedi apparel in that, even though Force-sensitive party members (including the player) may wear battle armor, doing so blocks the use of many Force powers, such as Force speed, while others don't. This may be seen simply as a game mechanic designed to balance a Force-sensitive character's abilities, yet it is remarkably in line with Thorsland's statement about the inconsistency of armor and the way of the Jedi, though there are still armors available that don't restrict Force usage."}, {"tag": "p", "text": "The concept of Imperial Knights seems to completely disregard this notion, since Imperial Knights' standard apparel is armor, and yet it does not restrict their use of Force powers in any way."}, {"tag": "h3", "text": "Non-canon"}, {"tag": "p", "text": "In the non-canon Return of the Jedi Infinities, Darth Vader is redeemed without dying, resulting in Anakin having his armor repainted white to symbolize his return to the light."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}