{"url": "Jedi_apparel", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Incomplete lists", "Category:Fashion styles", "Category:Jedi culture", "Category:Jedi equipment", "Category:Jedi robes", "Category:Uniforms"], "nodes": [{"tag": "h1", "text": "Jedi apparel"}, {"tag": "p", "text": "Jedi apparel was the term given to the attire of members of both the old and New Jedi Orders. Traditionally, Jedi wore clothes that befitted their monastic lifestyle, but variations on the theme were common, particularly after the rebirth of the Order following the Galactic Civil War. The attire usually was made in shades of brown or sometimes black, with a utility belt for various purposes, but also as a place on which to clip a lightsaber."}, {"tag": "p", "text": "Boots, loose-fitting pants and a cloak typically accompanied the garment. As these garments were not usually elaborate, the outfit mirrored their attachment-free philosophy, as well as showing their requirement to live almost devoid of luxury and also their devotion to service. The apparel also allowed great freedom of movement. The rough material proved useful on survival missions, as it was strong enough to show some resistance to tearing and fraying, as well as putting the wearer through some discomfort to help sharpen their focus."}, {"tag": "h2", "text": "Old Jedi Order"}, {"tag": "h3", "text": "Traditional robes"}, {"tag": "p", "text": "Jedi were raised their entire lives without possessions except for a lightsaber. Since they were given what they needed and their desires were controlled, most Jedi wore traditional yet simple Jedi robes, not feeling the need for fancy and outstanding outfits. The simplicity of the Jedi apparel was in many ways symbolic of the selfless compassion that characterized the Jedi Order. Padawans wore plain robes similar to those worn by Jedi Knights."}, {"tag": "p", "text": "Jedi robes were simple and comfortable, long, flowing robes, including an overtunic, an undertunic, a cloak or outer robe with a hood, and sometimes a tabard, each of which generally varied in earth tones. At least a few Jedi, though, wore robes that were deliberately rough spun and itched against the wearer's skin. This was to learn to ignore distracting physical sensations. In effect, the wearing of such robes became an exercise in concentration. However, there were some Jedi that wore Jedi robes in other colors. Vandar Tokare and Zhar Lestin, for instance, would wear blue robes around the time of the Jedi Civil War, while their contemporary Vrook Lamar wore red robes. Robe colors sometimes spoke to the type of Jedi wearing them, such as with the gray robes associated with Gray Jedi in the time of the Old Republic. Jedi would often shed their cloaks in combat, as the additional fabric could be caught on objects or the opponent's lightsaber, and was often distracting and hindering for the wearer."}, {"tag": "p", "text": "Four thousand years later, towards the fall of the Old Republic, Anakin Skywalker wore robes ranging from dark brown to black, with the tabard made of synthetic leather. Jedi from Corellia usually wore green robes as a way to distinguish themselves and stand out from the rest of the Order. As a rule, the left side of the dress was always turned on the right part of the torso. The overtunic and tabard commonly had two symmetric pieces of cloth in the front hanging beneath and sewn at the waist, which stopped around the knees. However, as with Saesee Tiin, the overtunic was pleated. The overtunic could be shorter than knee-length or as long as ankle-length, of which the latter became common by the Rebellion era. The overtunic, undertunic, and tabard were of the same measurements."}, {"tag": "p", "text": "Jedi garments further consisted of plain loose-fitting trousers and an obi. The obi matched in color with the overtunic. Jedi garb sometimes included an undershirt, and like the undertunic it often replaced, it generally contrasted in hue with the overtunic. The Jedi also wore leather utility belts, where they carried specialized field gear—such as food and tool pouches, a breather pouch, and energy and food capsules—and leather boots. By the time of the fall of the Old Republic, there was also a special black cloak of Jedi mastership. The Ho'Din Jedi Master Plett was known to wear one."}, {"tag": "p", "text": "Diplomatic Jedi commonly wore soft boots, while active agents dressed in sturdy field boots made of nerf hide that sometimes had ridged soles. A transition between these boot types can be seen with Jedi Master Saesee Tiin from the time of the Battle of Naboo to the Clone Wars. These articles of clothing frequently came in earth tones as well. Jedi clothing was very functional as the robes were thermo-sensitive, helping protect the wearer from the elements, and allowed for great maneuverability.[source?]"}, {"tag": "p", "text": "While the exact appearance of the Jedi robes varied from individual to individual and from era to era, the basic concept of simplicity and functionality was present up to the time of the Great Jedi Purge. However, during the days of the Mandalorian Wars, the styles of Jedi robes were more varied and customized. An example of this is the Jedi Covenant and their Padawans, who wore very atypical and more elaborate robes. For instance, Q'Anilia wore a purple robe with a ruffled sleeve hem and green hems along the bottom; Lucien Draay's were white and heavily layered with gold markings; and Xamar wore a royal blue robe tied at the waist by a wide brown belt and two white tabards draping down his back."}, {"tag": "p", "text": "Another atypical Jedi outfit was worn by Dace Diath, who wore a white undershirt with a turtlenecked collar, the brown undertunic above that was a low-cut square neckline, and the tunic was similar to a standard Jedi robe. Over this he wore a green cape, and the outfit was accented by a small necklace."}, {"tag": "p", "text": "The latter part of the Old Sith Wars saw the emergence of a new type of robe, the Gray Jedi robe. The term Gray Jedi was used to describe a Force-sensitive individual who had completed Jedi training, yet operated independently and outside of the Jedi Council. It is unknown as to why a specific type of robe became associated with these Jedi, since the robes in and of themselves differed very little from traditional Jedi garb."}, {"tag": "p", "text": "Dark Padawan robes were worn by those Force-sensitive individuals who had just begun on the path of becoming a Dark Jedi. These particular types of robes saw widespread use during the time of the First Jedi Purge."}, {"tag": "p", "text": "Since a time before memory to the Order's demise, the most ethical and commendable of Jedi Masters wore Ceremonial Jedi Robes. The Ceremonial Jedi Robe was a traditional brown robe with parts of the robe made of pure white cloth that could only be worn by the most honorable Jedi Masters. The robe was only given to Jedi that gave everything to serve and protect the Galaxy, and would sometimes be rewarded after death."}, {"tag": "p", "text": "The Jedi Adventure Robe was a unique robe worn by a sect of Jedi Knights that explored the galaxy searching for, and fighting, evil and injustice. The Adventure Robe consisted of a light gray long sleeved hooded shirt with a sleeveless dark brown leather wrapping, trousers, leather calf braces, leather wrap arm bracers, a white sleeveless surcoat, and leather foot wear. In 2 BBY Galen Marek was gifted with a Jedi Adventure Robe from former Jedi General Rahm Kota. As a symbol of good faith, Kota awarded this rare outfit to Marek after he demonstrated an increasing connection to the Force.[source?]"}, {"tag": "p", "text": "During the Clone Wars, the exiled Jedi Shon-Ju and his students wore Jedi robes."}, {"tag": "h3", "text": "Specialized garments"}, {"tag": "p", "text": "As they progressed throughout their career and learned more of the heritage they left behind as children, some Jedi would customize their given garments to show a reflection of pride and gratitude of their homeworlds, while others would wear traditional costumes of their homeworlds altogether but kept in the traditional color scheme of the Jedi apparel. Aayla Secura and Tott Doneeta, like so many other Twi'lek Jedi, would wear garments approximating the traditional Twi'lek costumes, but kept in the characteristic brown or black colors of the Jedi apparel. Ahsoka Tano wore similar garments, but the young Togruta's somewhat revealing attire was frowned upon by Gilad Pellaeon. Mirialan Jedi Luminara Unduli and Barriss Offee wore traditional dark and voluminous Mirialan garments and facial tattoos. Zabrak Jedi such as Eeth Koth and Agen Kolar often wore Iridonian field boots."}, {"tag": "p", "text": "Also, many Corellian Jedi would wear green robes of Ottegan silk, a tradition that Corran Horn would later carry on in the New Jedi Order. Adi Gallia and Stass Allie both wore Tholoth headdresses from their homeworld Tholoth, Odan-Urr wore robes reminiscent of the semi-elaborate and metalwork accented clothing of the Draethos, and Ki-Adi-Mundi wore a traditional Cerean vest. Also of note concerning cultural influence was the clothing worn by A'Sharad Hett, who wore Tusken-inspired clothing, mask, and a similarly influenced lightsaber. For aesthetic and cultural purposes, Miralukan Jedi wore bands around their heads to cover their nonexistent eyes.Togruta Jedi such as Ahsoka Tano and Shaak Ti wore their Akul-tooth headdresses."}, {"tag": "p", "text": "Certain missions or certain occupations within the Jedi Order would demand very specialized garments and equipment. For instance, Jedi fighter aces would spend most of their time in a starfighter and would often wear pilot's jumpsuits, while Jedi healers, working in medical centers and on medical frigates, would wear specialized garments functionally suiting their sterile environment. Saesee Tiin owned a specialized space suit designed for combat in the vacuum of space, which he would wear when boarding enemy capital ships. Kit Fisto who was an amphibian did not have any use for diving gear while on underwater missions and would thus wear a pair of trunks only, providing him with a maximal capacity for moving under water. A Jedi investigator was also sometimes seen in a blue ankle-length tunic. There were even sects of Jedi Knights that explored the galaxy searching for, and fighting, evil and injustice that wore specialized garments known as Jedi Adventure Robes."}, {"tag": "p", "text": "Also, certain occupations within the Jedi Order were associated with specific variations on the traditional apparel. It was traditional for Jedi librarians to wear a variant of the traditional Jedi robes with elaborate embroidered Ansatan patterns on it. Both Atris and Jocasta Nu wore such attire."}, {"tag": "p", "text": "Other specialized attire came in the form of disguises, such as the one Anakin Skywalker donned when he was assigned to protect Senator Padmé Amidala."}, {"tag": "h3", "text": "Atypical Jedi outfits"}, {"tag": "p", "text": "Some Jedi of the old order did not wear the traditional Jedi robes, but preferred other types of attire for various reasons. For example, some Jedi, such as Thon, Ooroo, Noro Zak and Ikrit did not wear any form of garments at all, because they did not have the physiognomy for it."}, {"tag": "p", "text": "Others had viewpoints that were different from that of the mainstream Jedi which would be reflected in their atypical choice of garments. Examples include the Dark Woman, who wore a black bodysuit; Dorn Tavers, who chose to wear traditional civilian Corellian-style garments; Siri Tachi, who wore a leather unisuit; and the ancient Jedi Shaela Nuur who wore a black and red full-body battle suit during the Great Hunt. Shaela's contemporaries Sylvar and Oss Wilum were atypical in that they, perhaps in conjunction with their cultural backgrounds but more likely to achieve maximal comfort and freedom of movement, wore the sparsest of clothes. An extreme opposite to Sylvar and Willum was Revan who both as a Jedi and a Sith wore a black battle armor, a black cloak and a black face-concealing mask. Later, after he was redeemed and re-accepted into the ranks of the Jedi Order, he would wear a variety of clothes ranging from civilian clothes over battle suits and armors to traditional Jedi robes. His companion on the quest for the Star Forge, Bastila Shan, preferred wearing a tight and flexible full-body suit, kept in the color scheme of the traditional Jedi robes, while another companion, Jolee Bindo, wore clothes that approximated the traditional Jedi robes."}, {"tag": "p", "text": "Andur Sunrider, who was married to Nomi Sunrider and the father of Vima Sunrider, preferred wearing civilian clothes of his era. While of a very different design than the traditional Jedi robes, Andur's clothes, which typically consisted of gray shirt underneath a brown leather jacket and a pair of practical utility trousers, did nevertheless fit in with the color pattern of the Jedi dress code. Widowed, Nomi Sunrider, who was herself a Force-sensitive reluctantly took up Jedi training. Like her deceased husband, Nomi wore civilian clothes rather than Jedi robes, her preferred color appearing to be green. The reason could be that she started her Jedi training as an adult and thus already had developed preferences for apparel, or maybe she wore them to honor Andur. Given that she despised violence and refrained from using lightsabers, her wearing civilian clothes might have been her way of expressing her dislike of violence and warfare."}, {"tag": "h3", "text": "Armor"}, {"tag": "p", "text": "During times of great conflict Jedi would sometimes require the use of battle armor. Armor-clad Jedi were a common sight on the battlefields of the New Sith Wars, while the ancient Jedi of the era of the Old Sith Wars would often wear parts of armor to protect certain areas of their bodies, as would many Jedi of the New Sith Wars era. Shoulder guards were especially common among the ranks of the ancient Jedi."}, {"tag": "p", "text": "Jedi armor was designed to be light and comfortable, giving the wearer as much freedom of movement and ability to use the Force as possible. However, the freedoms provided by Jedi armor were very limited compared to those provided by traditional Jedi robes. In the ancient wars between the Jedi and the Sith, the battlefields were often so packed with combatants that moving about freely on the battlefield would have been difficult even without armor. This would result in immobile and poorly protected combatants, which may be why the Jedi of those eras chose to prioritize armor to mobility."}, {"tag": "p", "text": "Being slightly atypical Jedi, Revan and Meetra Surik integrated armor into their attire. Revan's rather elaborate cowled hooded robe was black, with embossed worn gray armor covering his torso, gauntlets protecting his upper arm and the backs of his hands and a cape over his shoulders. Meanwhile, Surik would occasionally wear armor that did not hamper her from using the Force, such as armor manufactured by the Zeison Sha, an order of Force adepts known for their survival skills and resourcefulness; and also by the Jal Shey, another Force-using order which studied the Force intellectually, forsaking the more spiritual paths taken by the Jedi and Sith. Also of some note was the armor worn by the redeemed Jedi Juhani, who wore leather chest armor and gauntlets (in the game, they are considered just regular clothes if the player equips them onto her)."}, {"tag": "p", "text": "Throughout the New Sith Wars, Jedi would customize and modify their armors, while some preferred not to wear any armor at all. After the Ruusan Reformation, the Jedi disposed of using battle armor altogether."}, {"tag": "p", "text": "Around one thousand years later, the Clone Wars broke out. On certain occasions, Jedi, fighting side by side with clone troopers, would wear modified clone trooper armor or bits and pieces of it. General Obi-Wan Kenobi wore clone trooper armor in the Battle of Muunilinst to protect himself from the lances of Durge and his army of swoop-riding assassin droids. Had it not been for the armor, Kenobi would probably have been killed by Durge, as he was hit so hard by Durge's lance that his helmet flew off. During this same period, Jedi Knight Bardan Jusik was well known for wearing clone trooper armor into combat, and later on even full Beskar'gam. Later, the use of armor worn as part of a Jedi's robes would become more common, being worn more often by the likes of Obi-Wan Kenobi and Anakin Skywalker."}, {"tag": "p", "text": "After the Clone Wars, those few Jedi that survived Order 66 went into hiding so as not to fall victim to the Great Jedi Purge. Some of those ceased to wear traditional Jedi garments and started wearing battle armor so as not to give themselves away as Jedi. Bultar Swan, for instance, started wearing battle armor, before she fell victim to the Jedi Purge. Other Jedi, like Drake Lo'gaan, would supplement their robes with bits and pieces of clone trooper armor."}, {"tag": "h3", "text": "Training suits"}, {"tag": "p", "text": "By the time of the Battle of Naboo, Jedi training suits were highly complex pieces of clothing that could protect their wearers by cushioning blows in hand-to-hand combat and absorbing light blaster fire. That type of gear, however, slightly hampered its wearer's movement, which is why it was never worn in real combat situations. Inside the belt and gauntlets, there were weights that were removed during the missions, thus giving the wearer greater physical ability than he or she was used to. In some cases, those suits were completed by a WJ-880 blinding helmet, which were used to give an \"unclouded\" vision of the Force in battle. The famous Jedi Obi-Wan Kenobi and his master Qui-Gon Jinn were known to have worn such training suits."}, {"tag": "h2", "text": "New Jedi Order"}, {"tag": "h3", "text": "Variety of the New Jedi Order"}, {"tag": "p", "text": "In Luke Skywalker's New Jedi Order, Jedi wore various clothing including simple every-day clothes, elaborate traditional clothing, military based clothing, and pilot jumpsuits. Compared to the Old Jedi Order—where Jedi departing from the normal garb was rare, the Jedi of Luke Skywalker's Jedi Order displayed much greater variety in their apparel. One reason was probably that most members of the first generation of new Jedi were already adults when they were introduced to the way of the Jedi and so had already developed tastes and preferences for clothing in terms of both aesthetics and functionality. However the new Jedi did wear traditional robes for formal occasions and Jedi gatherings, such as the Conclave on Ossus."}, {"tag": "p", "text": "While some swore to the traditional apparel of the Old Order or culturally based variations of it, many wore whatever clothes they felt more comfortable in. Luke, himself, wore a black version of the Jedi robes, with tighter-fitting sleeves and pants to allow more functionality. Ganner Rhysode, Klin-Fa Gi, and Corran Horn, for instance, wore more traditional garments, the latter often wearing the traditional green robes of past Corellian Jedi Knights to honor his Jedi ancestors. Kyle Katarn wore the same outfits as in his mercenary days, while Mara Jade preferred whatever gave her the most freedom of movement, often wearing tight-fitting black leather garments. Lowbacca preferred wearing as little garments as possible as was typical of Wookiee culture, whereas Raynar Thul wore the colors of the Alderaanian noble House of Thul. Tionne Solusar wore more elaborate robes of varying colors, mostly in white, over loose-fitting pants under this with boots to match, occasionally wearing a brown leather corset over her clothing. Kirana Ti and Tenel Ka wore traditional Dathomiri clothes and armor made of lizard-hide."}, {"tag": "p", "text": "Some Jedi of the new Order, such as Kyp Durron, sometimes wore so-called Jedi Cloaks with a New Republic emblem on them. These cloaks were seen during the Leviathan crisis and may have been water repellent, protecting the Jedi from rain and similar weather conditions. In addition to these cloaks, the Jedi were also equipped with standard glo-rods, grappling hooks and tough boots."}, {"tag": "p", "text": "On special occasions or celebrations, the Jedi would wear more brightly-colored robes, such as those worn at the wedding of Luke Skywalker and Mara Jade."}, {"tag": "h3", "text": "Jumpsuits"}, {"tag": "p", "text": "Many of the new Jedi were accomplished pilots, and many were also trained commandos: as a result, military-style jumpsuits became common among the new Jedi, flexible enough to accommodate their unique fighting styles, and highly practical in the combat scenarios in which they increasingly served. However, some Jedi pilots and commandos eschewed jumpsuits. Jaden Korr, for instance, who traveled primarily in a Z-95 Headhunter, did not wear jumpsuits on his missions, while in the early years of the Yuuzhan Vong war, Jedi of Kyp Durron's faction symbolized their loyalties by adopting Jedi robes of traditional cut, but dark in color."}, {"tag": "p", "text": "While the fighter aces of the Old Jedi Order would often wear jumpsuits on missions, the widespread use of combat jumpsuits in the new Order probably reflected the military background of Luke Skywalker and many of the other Knights. By around 22 ABY, jumpsuits also seem to have been standard issue for the young students at the Jedi Academy, and by the time of the Yuuzhan Vong War, Jedi serving in the front line wore olive-green jumpsuits, reinforced with light armor."}, {"tag": "p", "text": "Jumpsuits did continue the notion of simplicity and functionality associated with the Jedi robes of the Old order in the sense that jumpsuits were not unnecessarily elaborate, and they provided maximal mobility on ground-based missions in addition to obvious advantages for starfighter piloting. Moreover, jumpsuits were often provided with numerous pockets, making it easier for the Jedi to carry various objects and tools."}, {"tag": "h3", "text": "Imperial Knights"}, {"tag": "p", "text": "After the re-institution of the Empire, some Jedi became Imperial Knights. As such, they all wore standardized red armor and similarly regulated white lightsabers. The armor was composed of a high-collared black body glove reminiscent of Darth Vader's black attire, as well as black combat boots. The embossed armor covered the torso, mostly over the rib cage area with a single, trapezoidal panel over the abdomen. The armor included twin-layered flared shoulders—mounted on hinges for more mobility—with the upper pouldron bearing the symbol of the Galactic Empire. They also wore red gauntlets made from pure cortosis. Their belt, similar to the belts worn by the Jedi in the days of the Old Republic, was wide, with a second layer that included pouches to hold equipment and a place to clip their lightsabers. A dark red cape sprouted from their armor. This attire bore some resemblance to the Emperor's Royal Guard of the Empire under Palpatine's rule."}, {"tag": "p", "text": "Emperor Roan Fel was himself a fully trained Imperial Knight, but, because of his rank, he wore more elaborate robes. A bright magenta undershirt was worn under a layer of indigo armor, with the undershirt reaching down his back to his knees. This coatskirt was worn over a lighter-colored skirt of pale yellow, with a wide purple belt centered with a disc of metalwork. Over this he wore an indigo cloak with wide sleeves hemmed in black fabric accented with polygonal shapes in gold needlework. The shoulders were decorated in goldwork that integrated into the clasp of the cloak, which hooked around his neck."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Jedi robes production design"}, {"tag": "p", "text": "Obi-Wan Kenobi's Jedi robe was made out of heavy wool. The fabric was extremely heavy when wet, so a recreation of it was made for on Kamino. The outertunic is lined and seamed at the shoulders. It was made of two pieces and seamed at the waist. Qui-Gon Jinn's tunics were made of raw silk, but a cheaper linen has been used. The innertunic was sewn like a t-shirt, tucked in at the waist. The tabard was sewn in two pieces stitched at the waist. The pants were normal khaki-style pants, with a button, fly; however, there are pleats at the top. Obi-Wan Kenobi's boots are rumored to be East German riding boots. However, that is under dispute because the original boots have straps, not laces, traditional of tank boots. These boots are actually Australian tanker boots."}, {"tag": "h3", "text": "Armor paradox"}, {"tag": "p", "text": "In an interview Dan Thorsland, editor of the Tales of the Jedi comic books argues that wearing armor is not consistent with the way of the Jedi:"}, {"tag": "p", "text": "This is in contrast with the way that the Jedi are depicted in Jedi vs. Sith—set in the New Sith Wars—where most of the Jedi are armor clad. Obi-Wan Kenobi and Saesee Tiin are both featured in full armor in the Clone Wars animated series although Tiin's armor's primary function is that of a space suit. The Knights of the Old Republic games on the other hand preserve consistency with the typical Jedi apparel in that, even though Force-sensitive party members (including the player) may wear battle armor, doing so blocks the use of many Force powers, such as Force speed. This may be seen simply as a game mechanic designed to balance a Force-sensitive character's abilities, yet it is remarkably in line with Thorsland's statement about the inconsistency of armor and the way of the Jedi. Originally the robes were inspired by Buddhist monk robes."}, {"tag": "p", "text": "Jedi Knights in The Old Republic wear either Heavy Armor or Medium Armor, depending on their specialization. While they continue to wear cloth or leather robes, they do recognize that the open warfare of the time often requires additional protection. Jedi Consulars wear exclusively Light Armor, as speed is central to their fighting style (which uses the Niman lightsaber form combined with a heavy emphasis on telekinesis and other force abilities). It's also possible their role as diplomats has led them to forgo armor so as to not appear militaristic."}, {"tag": "p", "text": "The concept of Imperial Knights seems to completely disregard this notion, since Imperial Knights' standard apparel is armor, and yet it does not restrict their use of Force powers in any way."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}