{"url": "Jedi_assault_team", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Jedi Order organizations", "Category:Strike teams"], "nodes": [{"tag": "h1", "text": "Jedi assault team"}, {"tag": "p", "text": "The Jedi assault team, also known as the Jedi task force,[source?] consisting of 212 Jedi, was led by Jedi Master Mace Windu on Geonosis to rescue Obi-Wan Kenobi, Anakin Skywalker, and Padmé Amidala from imprisonment by the Confederacy of Independent Systems. What ensued was the First Battle of Geonosis, the first conflict of the Clone Wars between the Galactic Republic and the Separatists."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "Following Jedi Master Obi-Wan Kenobi's capture by the Separatist Council's droid forces, Supreme Chancellor Sheev Palpatine was given emergency powers by the Galactic Senate to create a Grand Army to defend the Galactic Republic. While Grand Master Yoda traveled to Kamino to gather the army, Master Mace Windu gathered a task force of 212-strong Jedi."}, {"tag": "h3", "text": "Arena battle"}, {"tag": "p", "text": "When Kenobi, his Padawan Anakin Skywalker, Senator Padmé Amidala and their reek were surrounded by droidekas, Windu and the assault team revealed themselves to Dooku, his Separatist allies and the Geonosian crowd. As Windu held Dooku, Jango Fett and the Separatist Council at lightsaber, the other Jedi revealed themselves and jumped into the arena. As the Geonosians fled, battle droids arrived and fought the Jedi. Windu was forced into the arena by several B2-series super battle droids and Fett's flamethrower."}, {"tag": "p", "text": "One of the Geonosian warriors in the arena was cut down by Sarissa Jeng. However, the battle droid legion outnumbered the Jedi, so many were cut down by the droids' blaster fire. Master Coleman Trebor attempted to kill Dooku, but was shot and killed by Fett. Fett joined the battle and fought Windu, but was ultimately beheaded by Windu. Master Kit Fisto was confronted by C-3PO, whose head had been attached to a B1-series battle droid's body. Fisto was able to disable 3PO's body, and R2-D2 reattached 3PO to his rightful body."}, {"tag": "p", "text": "The surviving Jedi were surrounded by the battle droids. When Dooku offered the Jedi the chance to surrender, Windu refused to allow himself and the other Jedi to be used as bartering tools."}, {"tag": "p", "text": "As Dooku ordered the battle droids to finish the Jedi off, the survivors were rescued by a regiment of the newly formed Grand Army aboard gunships under Yoda. Despite the high casualties, Kenobi, Skywalker, and Amidala were saved from execution. Several of the Jedi fought alongside the clone troopers and forced the Separatist Droid Army to retreat from Geonosis."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The Jedi were unable to stop Dooku from making his escape despite the battle being won by the Republic. The surviving members of the assault team became Generals in the Grand Army of the Republic until Order 66 all but destroyed the Jedi Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}