{"url": "Jedi_asteroid", "categories": ["Category:Legends articles", "Category:Asteroid stubs", "Category:Locations of the Jedi Order", "Category:Wild Space asteroids"], "nodes": [{"tag": "h1", "text": "Jedi asteroid"}, {"tag": "p", "text": "After the execution of Order 66, Ferus Olin and Trever Flume set up a secret asteroid base, known as the Jedi asteroid, in the center of an atmospheric storm near Acherin."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The asteroid was found when rebels Raina Quill and Toma, tracked by Imperial agents, were forced to hide their ship in the storm over Acherin. By landing on the asteroid, the Imperials were unwilling to traverse the dangers of the storm, such as space shears, and would be unable to track them. Raina and Toma stayed on the asteroid for days while their passengers, Ferus Olin, Obi-Wan Kenobi, and Trever Flume went to Ilum to rescue hidden Jedi, Garen Muln."}, {"tag": "p", "text": "Raina and Toma spent a few days on the asteroid with enough food and supplies to last them. When the trio returned with Garen, as well as more supplies and prefab shelters, donated by Roan Lands, Raina set up a makeshift clinic and used her medical skills to help the malnourished Garen recover. Ferus Olin thanked Raina and Toma for all of their help and offered them a chance to help him recover more Jedi survivors and use the asteroid as a safe haven. Raina and Toma gladly agreed."}, {"tag": "p", "text": "After setting up the living areas nursery and medical ward, the base was fully operational. Trever then began to bring friends and associates of Ferus back to the base to help it grow and thrive."}, {"tag": "p", "text": "In 18 BBY, the asteroid's fate was sealed when it was discovered by Darth Vader, with the help of Eve Yarrow, or \"Flame,\" and was destroyed by a superweapon, attached to the Sith Lord's Star Destroyer, killing everyone in the hidden base, except Obi-Wan, Trever and Ferus, who were on Coruscant when it was destroyed."}, {"tag": "h2", "text": "Known occupants"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}