{"url": "Jedi_chapter_house_(Rhinnal)", "categories": ["Category:TOR dates usages without act argument", "Category:Legends articles", "Category:Jedi chapter houses", "Category:Medical facilities", "Category:Rhinnal locations"], "nodes": [{"tag": "h1", "text": "Jedi chapter house  (Rhinnal)"}, {"tag": "p", "text": "The Jedi chapter house on the planet Rhinnal was an academy located near the city of Rhire. It was famed for the education of renowned Jedi healers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Jedi chapter house on the planet Rhinnal was built near the gray banks of the Frieste River when the capital city of Rhire was only a supply outpost for hyperspace explorers. The academy was a simple, spired structure that was able to accommodate almost a hundred patients."}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the Sith Empire, the enclave was destroyed by the Sith warship Red Reaper. The chapter house was eventually rebuilt, and specialized in educating its students in the art of healing through the Force. Expanded over the centuries, it was used continuously over the centuries as well as the academy on H'ratth."}, {"tag": "p", "text": "In 33 BBY, Jedi Knights Vel Ardox and Noro Zak accompanied a wounded Master Adi Gallia to Rhinnal for healing following a particularly nasty fight during her mission to Esseles. While Zak and Ardox remained at the facility, Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi stayed on Esseles to pick up the mission Gallia had failed to complete. On Rhinnal communications were knocked out by a storm, causing Jinn and Kenobi to fear the worst. Arriving on Rhinnal, they found everything to be as it should be, and informed their comrades they had discovered the key to their assignment on Esseles: Bartokk assassins had stolen hyperdrive-equipped droid starfighters to attack the Corulag Academy."}, {"tag": "p", "text": "Following the Clone Wars, Rhinnal's reputation was sufficient enough to spare the academy from being demolished by COMPNOR fanatics unlike many other Jedi chapter houses throughout the Core Worlds.\nAt the close of the Clone Wars, the academy was shut down but not destroyed. Purged of all Jedi-related material by the Galactic Empire, the academy was spared destruction because of its function as a medcenter and its use to the native populace. Darth Sidious made a note regarding the Rhinnal chapter house in his stolen copy of The Jedi Path: A Manual for Students of the Force. He remarked that the book itself revealed such locations, saving the Empire time as they hunted Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Category:Notes and references"}]}