{"url": "Jedi_chapter_house_(Aleen)/Legends", "categories": ["Category:Legends articles", "Category:Aleen locations", "Category:Jedi chapter houses"], "nodes": [{"tag": "h1", "text": "Jedi chapter house  (Aleen)"}, {"tag": "p", "text": "The Jedi chapter house was the center of Jedi activity on the planet Aleen long before the Clone Wars began."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Long before the Clone Wars, the Jedi Order established a chapter house on the planet Aleen. The chapter house was the site of the Great Seal, the artifact which separated the surface world and the Underworld; historians debated which preceded the other. Used by the Exploration Corps, the site employed local building techniques and favored a balance of above and below ground construction.For unknown reasons, the Order abandoned Aleen and their chapter house, allowing it to fall into disrepair and eventually collapse."}, {"tag": "p", "text": "During the Clone Wars, the Galactic Republic established an excavation site at the ruins of the chapter house where Republic researchers attempted to understand the groundquakes plaguing the world. When the Republic conducted a mission to give relief support and to assist the natives, C-3PO and R2-D2 were led to the site by Aleena guides and they both accidentally fell into the hole. After coming out from a water spout, R2-D2 closed the seal, restoring the balance on Aleen."}, {"tag": "p", "text": "When the Jedi Order was exterminated at the end of the war, the Galactic Empire searched out old academies and temples of the Jedi and destroyed them. Despite being in severe disuse, the Empire used orbital bombardment to level the remaining structures that still stood at the chapter house site. The Aleena rebuilt the sections of the temple surrounding the Great Seal, where they worshiped Orphne, the protector of the arbozoic trees."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}