{"url": "Jedi_high_command", "categories": ["Category:Canon articles", "Category:Jedi Order organizations"], "nodes": [{"tag": "h1", "text": "Jedi high command"}, {"tag": "p", "text": "Jedi high command, also known simply as Jedi Command, was a command organization of the Jedi Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, when giving the Grand Army of the Republic to Jedi Grand Master Yoda, Prime Minister Lama Su took great care to identify the trained adjutants who were meant to interact with Jedi Command."}, {"tag": "p", "text": "Unlike these adjutants, Clone Commander CT-411, eventually known by the nickname \"Ponds,\" had notably never been briefed on how to deal with Jedi high command, yet the clone trooper found himself to have that role. Jedi Master Mace Windu had the commander update him on troop locations during the First Battle of Geonosis, and he kept CT-411 with him for the rest of the battle. He continued to serve with Windu during the ensuing Clone Wars."}, {"tag": "p", "text": "Later during the war, Separatist General Flebek and her battle droids went to the planet of Retta to find the secret to invisibility, which was actually the Segredo Kreeda. She was hiding people from the conflict using her ability to turn invisible, so, to keep her camp safe, Jedi General Anakin Skywalker pretended that the headgear from a Kyuzo Kreeda was protecting was the \"cloaking cap.\" Skywalker made a fake transmission to high command and, as planned, was spotted by the Separatists. Master Yoda then discretely took out a B1-series battle droid, and, after Skywalker threatened her, Flebek fled the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jedi high command was first mentioned in the 2017 reference book Star Wars: On the Front Lines. The book, written by Daniel Wallace, establishes that Commander Ponds began to interact with the organization after being selected by Mace Windu during the Battle of Geonosis. However, this does not confirm if meeting Windu was the first time Ponds interacted with high command or if these interactions only happened because of his service under the Jedi Master."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}