{"url": "Jedi_hunter/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:Jedi hunters", "Category:Occupations"], "nodes": [{"tag": "h1", "text": "Jedi hunter"}, {"tag": "p", "text": "The term Jedi hunter typically referred to a being or droid who was particularly adept at killing Jedi."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "No specific background was common among Jedi hunters; they came from diverse upbringings and species."}, {"tag": "p", "text": "Numerous Jedi hunters were Force-sensitives themselves. The majority of Force-using Jedi hunters were members of dark side cults and groups that were traditional enemies of the Jedi, the most notorious of these being the Sith. Darth Maul, for instance, had been raised and trained by Darth Sidious to prey upon Jedi. Others were former Jedi driven to the dark side by unfortunate, traumatic events, and, believing their former mentors responsible, decided to pursue a homicidal grudge against the Order. Examples of such beings included Asajj Ventress, Aurra Sing, or the Sith Lord Darth Vader."}, {"tag": "p", "text": "Some Jedi hunters were ordinary beings with bodies heavily augmented by cybernetic enhancements that allowed them to compete with the Jedi on the physical level. However, if the being was naturally Force-sensitive, then the lack of flesh could prevent the use of certain Force powers, such as Force lightning. The most notable example of a cybernetic Jedi hunter was the CIS military leader General Grievous. Grievous was equipped with computers slaved to his brain that increased his reflexes and precision to superhuman levels, and a largely mechanical body that provided him with superhuman speed, strength and stamina."}, {"tag": "p", "text": "Arguably, Darth Vader could also be considered an example of a cyborg Jedi hunter, as his armored body suit provided him with limited resistance to lightsaber blows, and his prosthetic limbs and implants provided him with vastly augmented strength and stamina. Another example was the Gen'Dai bounty hunter Durge, who originally received cybernetic implants to combat the Mandalorians, but found them to be equally effective against Jedi."}, {"tag": "p", "text": "There were also whole series of droids created specifically to assassinate and hunt down the Jedi. As droids could not typically be sensed through the Force due to their inorganic nature (unless it was through the use of Mechu-deru, a rare ability among Jedi), and could have their physical attributes extraordinarily augmented, they could be extremely effective Jedi hunters. Examples of such droids included the IG-100 MagnaGuards, HK-50 series assassin droids, or the Droideka, though the latter were not originally designed with Jedi hunting in mind."}, {"tag": "p", "text": "In addition to droid, some organic creatures were specifically bred or altered to hunt Jedi, such as the voxyn and terentatek. These creatures often had their aggressive tendencies greatly enhanced by brain modification and conditioning, and their bodies were often genetically modified to allow for overwhelming physical capabilities or specialized combat abilities. Some, such as the terentatek, were genetically engineered to develop heavy armor plates that provided limited protection against lightsabers. However, many hunters were not Force-users, heavily augmented cyborgs, droids, or genetically created/altered creatures, but were instead ordinary people. These hunters often relied on skill and cunning as opposed to sheer power to bring down Jedi."}, {"tag": "h2", "text": "Equipment and tactics"}, {"tag": "p", "text": "Skilled hunters understood that confronting a Jedi with standard tactics and equipment was often doomed to failure, so many of them employed novel, unorthodox strategies and weaponry. One of the more standard Jedi killing weapons was the slugthrower, a weapon that employed chemically propelled solid projectiles instead of an energy discharge. These weapons were extremely useful when confronting an individual with a lightsaber, as the standard metal projectiles utilized in most slugthrowers could not be redirected by a lightsaber in the same manner as a blaster bolt; they simply vaporized on contact with the blade. Flamethrowers also worked well, as the jet of fire produced by one could not be blocked by a lightsaber. A skilled enough Jedi could use the Force to shield themselves from the flames, but this took considerable effort and uncommon strength in the Force."}, {"tag": "p", "text": "Sonic weapons could interfere with a Jedi's concentration, and as such could undermine their connection to the Force. Use of proper mental techniques to cloud one's intentions made ambush an option. Quality poisoned darts were silent and worked too quickly for Jedi to counter. These weapons were of limited use on a large-scale battlefield, but deadly against Jedi. The notorious Jedi hunter HK-47 believed that the best weapons for killing Jedi were either sonic based weapons or high explosives, while poison gas was effective but to a lesser degree. As only a very skilled Jedi was capable of using a lightsaber as a ranged weapon, most Jedi preferred to engage a target at close quarters, making land-mines an extremely effective weapon. Energy shields were also useful, as lightsabers had a difficult time penetrating most military issue energy shields."}, {"tag": "p", "text": "Many Jedi hunters often used weapons and armor made of lightsaber-resistant materials. For instance, the IG-100 MagnaGuard series droids utilized electostaffs made of phrik alloys that allowed the droids to engage in melee combat against Jedi, and the bounty hunter Cad Bane owned a specialized, handmade carbine that fired cortosis projectiles. Though this weapon could short-out lightsaber blades and was extraordinarily deadly, Bane rarely used it as the cortosis ammunition was expensive, and firing such ammunition put a great deal of stress on the weapon."}, {"tag": "p", "text": "During his tenure as a Sith Lord, Revan also developed techniques that enabled Force-insensitive individuals to deal with Jedi Force abilities. Targeting the allies of a Jedi, or even just random bystanders, was a favorite among such Jedi hunters as most Jedi were willing to put themselves in harms way to protect others. Sniping and using cover were also useful, as many Force abilities decrease substantially in effectiveness without a direct line of sight to the target. HK-47 also believed that it was critical not to over-plan the assassination of a Jedi, as it seemed that such planning often backfired due to Jedi precognition. In addition, it was possible for a Force-insensitive individual to learn how to \"hide their minds\" from Jedi by broadcasting strong emotions while thinking about something unrelated. This made Force-insensitive assassins in particular very difficult for Jedi to detect with the Force. Psychological warfare was also extremely effective against Jedi, as a Jedi's connection to the Force was largely based on their emotional state."}, {"tag": "p", "text": "Lightsaber collecting was also a fairly common practice among Jedi Hunters. As they were unique to each Jedi, they provided proof of kill, and could be kept as trophies. The bounty hunter Boba Fett and the Mandalorian raider Sherruk were known to collect lightsabers. Some hunters would also make personal use of their collected lightsabers, such as Grievous or Aurra Sing."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At the end of the Hundred-Year Darkness, Jedi hunters helped defeat the Dark Jedi at the Battle of Corbos. When Revan became a Sith Lord following the Mandalorian Wars, he employed both specialized Sith assassins and Force-insensitive assassins to kill Jedi. Utilizing assassination techniques the Jedi had never seen before, Revan decimated the Order nearly to the point of extinction. During the First Jedi Purge, the Sith Lord Darth Sion achieved infamy as one of the greatest Jedi hunters of all time, along with his Sith triumvirate partner, Darth Nihilus. Nihilus however, did not hunt Jedi in a traditional manner or for traditional reasons. Rather, he sought to kill Jedi as a form of sustenance, using his unique variant of Force drain to consume their life and Force energy. While he could and did strip other lifeforms of their energy, sometimes even on a planetary scale, Jedi were especially targeted by him as they provided more energy than most other beings. Sion, on the other hand, sought the extinction of the Jedi purely out of malice. In the Mandalorian Wars, Dungeon ships were developed to move and capture Jedi prisoners, and were later reused with Universal Energy Cages in the Great Jedi Purge. The assassin droid HK-47 also became a notorious Jedi hunter during this time period."}, {"tag": "p", "text": "General Grievous was among the greatest and most feared Jedi hunters, personally killing numerous Jedi in lightsaber combat during the course of the Clone Wars. He was notable as a rare example of a non-Force sensitive being who nevertheless could hold his own against the Jedi in lightsaber combat."}, {"tag": "p", "text": "Following the end of Clone Wars, the clone troopers of the 501st Legion were placed in the service of Darth Vader, a Jedi-turned-Sith and the most infamous Jedi Hunter in galactic history. During Operation: Knightfall, Vader, alongside the 501st, sacked the Jedi temple and massacred hundreds of Jedi, from venerated Masters to Youngling. Vader would later go on to kill dozens more Jedi during the Purge until Palpatine called it off, believing the remaining few Jedi to be of no threat to his plans. Due to their role in the Great Jedi Purge, the 501st became vicious Jedi hunters in their own right, earning the nickname 'Vader's Fist'."}, {"tag": "p", "text": "Following the fall of the Galactic Empire, the Jedi enjoyed a short time of peace, until the Yuuzhan Vong invaded. These extragalactic warriors swept through the galaxy taking entire worlds and waging war on the New Republic. Realizing that their biggest threat came from the Jedi themselves, and hating the fact that they controlled a mystical energy field called the Force, which the Yuuzhan Vong could not touch, and seemed to not even exist in, the invaders called for the extermination of the Jedi in exchange for an empty promise of peace. An entire faction of New Republic citizens caved, forming a group called the Peace Brigade, and began to hunt the Jedi, turning them over to the Yuuzhan Vong."}, {"tag": "p", "text": "By the end of the Sith–Imperial War, many Jedi were surviving but scattered throughout the galaxy. The One Sith organization placed bounties on Jedi and for the next seven years, new Jedi hunters began snuffing out Jedi who weren't careful enough, nearly fulfilling the Sith's goal of the Jedi's extermination. Soon, all hunters had to keep their eyes out for the last Skywalker, whom the galaxy thought had ended at Ossus. The Sith Lord Darth Krayt wanted him because of his healing power."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}