{"url": "Jedi_instructor", "categories": ["Category:Legends articles", "Category:Jedi instructors", "Category:Jedi ranks"], "nodes": [{"tag": "h1", "text": "Jedi instructor"}, {"tag": "p", "text": "Jedi instructors were Jedi Masters that taught the Initiates and Padawans of the Jedi Order. Specializing in different fields, including politics, lightsaber combat, unarmed combat, and the sciences, these Jedi drew from both the Guardian and Consular branches of the Jedi Knights. Most Jedi instructors had considerable aptitude in a variety of skills that helped to maintain the Jedi's numbers. Particularly, Jedi instructors were adept at identifying an Initiate's weak points, preventing their students from falling to the dark side, and helping young Jedi determine the role they would best fit in the Order."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Jedi instructors were stationed at every Jedi academy across the galaxy, assigned to oversee the rearing and the protection of the Initiate clans to the Jedi Order. Ranging from lightsaber instructors to political theory lecturers, these Jedi Masters were experts in their field and were looked up to as paragons of wisdom amongst the Jedi. While not all instructors were a part of it, the Educational Corps served as a way to collect vast swaths of data and share it with the Order and others out in the galaxy. Specially modified starships were converted into mobile schools in the early days of the Order so that Jedi instructors could perform their lessons nearly anywhere they traveled. It was typical for these ships to vary in size and occupancy. The smallest mobile schools were contained within a small transport designed for one Jedi instructor and up to six students. The largest of these schools, such as the Chu'unthor, were large enough for hundreds of Jedi trainees and dozens of instructors."}, {"tag": "h3", "text": "Lightsaber instructors"}, {"tag": "p", "text": "List of Battlemasters; List of lightsaber instructors"}, {"tag": "p", "text": "The art of lightsaber instruction was practiced by Guardians who had perfected their skills on the battlefield or on long journey-missions on the Outer Rim Territories, mastering all seven forms of combat. Not believing in the practice of teaching for life, instructors first had to demonstrate their knowledge of their art through various tests and missions. All instructors were Jedi Masters and were recommended for the role by the standing battlemaster; the chief instructor at the academy, and appointed by the Jedi High Council. These day-to-day instructors passed on their teachings to their students, starting from Form I to Form VI of lightsaber dueling."}, {"tag": "p", "text": "Before the New Sith Wars, there was only one Battlemaster in existence, overseeing all instruction at the Jedi Temple on Coruscant. However, once the Army of Light was called upon to defeat the Brotherhood of Darkness, many Jedi Lords and generals took up the mantle as they slaughtered the Sith scourge. When the war ended and the Jedi were victorious, many of these Jedi revoked the title and took up teaching positions, while others were appointed to satellite training facilities where they oversaw the combat instruction while reporting to the main battlemaster on Coruscant, Master Skarch Vaunk."}, {"tag": "p", "text": "While the term fell out of use following the disbanding of the Order and the death of battlemaster Cin Drallig in 19 BBY, Luke Skywalker would learn of the title and bestow it upon Jedi Master Kyle Katarn in 13 ABY, following the reorganization of the ancient Order. While the New Order had been in its infancy, Master Kam Solusar had unofficially held the role at the Jedi Praxeum on Yavin 4, but was replaced by Master Katarn so that he could oversee the training at the Academy of Ossus."}, {"tag": "h3", "text": "Specialized combat classes"}, {"tag": "p", "text": "Focusing on Force talents, there were several specialized combat classes that did not require a lightsaber at all. During the final days of the Republic, there were several instructors at the Temple who worked not only with weapons, but with the body of Initiates, turning them into living weapons. Master Ilena Xan, the overseer of the Jedi Temple Apprentice Tournament in 19 BBY, hosted a class in unarmed combat and was nicked named Iron Hand for her ability to disable an opponent with only her hands. Additional Force-based classes included the Art of Movement study, a class taught by Master Fy-Tor-Ana and held in a specialized training hall in the Temple Ziggurat."}, {"tag": "h3", "text": "Non-Force-based classes"}, {"tag": "p", "text": "While the Force was a key part of Jedi philosophy, classes at the Temple covered all subjects. Mathematics, biology, hyperspace theory and more were all classes held at the academy. During the Clone Wars Master Bear taught a Climbing and Ropework class that focused on knot tying and Master Tycho instructed Padawans in military strategy. Master Maks Leem taught hyperspace navigation before her death, with other instructors teaching astrocartography, comm installation tech, and botany."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "It is a strong possibility that Anoon Bondara was the Jedi battlemaster prior to Cin Drallig. In both of Anoon's appearances he is described as having lightsaber skills second to none, also the fact that he was the lightsaber instructor to Younglings and Padawans such as Obi-Wan Kenobi and that he died in 32 BBY, the same year Cin Drallig became battlemaster, support this possibility. However, it is unknown whether or not he was the head lightsaber instructor at the Temple and therefore the battlemaster."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}