{"url": "Jedi_holocron", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Jedi holocrons"], "nodes": [{"tag": "h1", "text": "Jedi holocron"}, {"tag": "p", "text": "Jedi holocrons were Jedi artifacts used to store information and teachings of the Jedi Order. Holocrons were constructed with a security mechanism preventing non-Force-sensitive individuals from opening them and accessing the secrets held within. The teachings contained in Jedi holocrons were typically relayed to whomever opened them as an interactive hologram, appearing as the Jedi Master who had recorded the information. Sharing the knowledge found on Jedi holocrons with those who were not members of the Jedi Order was discouraged, as the majority of holocrons contained data relating to the nature and applications of the Force. Holocrons were stored within the Holocron Vault, located within the Jedi Archives of the Jedi Temple on Coruscant. Access to the Vault was only permitted to Jedi who currently served on the Jedi High Council."}, {"tag": "p", "text": "Many holocrons could only be unlocked when paired with a memory crystal, such as the Kyber memory crystal, entrusted to the Rodian Jedi Master Bolla Ropal during the Clone Wars, which contained a list of all known Force-sensitive younglings. The bounty hunter Cad Bane, under the employ of the Sith Lord Darth Sidious, captured Ropal and acquired the Kyber crystal after previously stealing a holocron from the Jedi temple. Ropal refused to unlock the crystal's data for Bane, however Bane soon managed to force Jedi Knight Anakin Skywalker to open the holocron for him after capturing his Padawan, Ahsoka Tano."}, {"tag": "p", "text": "Later in the war, Jedi Master Depa Billaba owned a holocron which she passed onto her apprentice, Caleb Dume, after the conclusion of the Conquest of Kaller and shortly before her demise during the Great Jedi Purge after Order 66 was activated by Darth Sidious. It was used by him, Ezra Bridger, and Ahsoka Tano up until 2 BBY when it was destroyed whilst being merged with a sith holocron."}, {"tag": "p", "text": "Crime lord Grakkus the Hutt collected many Jedi artifacts after the Great Jedi Purge, including holocrons, which he stored in his palace on Nar Shaddaa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}