{"url": "Jedi_investigator/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Jedi Sentinels", "Category:Law enforcement ranks"], "nodes": [{"tag": "h1", "text": "Jedi investigator"}, {"tag": "p", "text": "A Jedi investigator was the a specialization that could be attained by those Jedi Knights studying the ways of the Jedi Sentinel."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Working as agents to the Jedi High Council, these individuals were highly certified to work with law enforcement agencies in tracking down criminals and uncovering hidden and obscure threats to the galaxy and the Galactic Republic. Appointed by the Council, Jedi investigators were charged with rooting out threats via their detective skills and Force abilities. While the presence of the Investigator within the Jedi Order had remained a relative constant, it wasn't until after the Ruusan Reformation that the role was clearly defined in The Jedi Path: A Manual for Students of the Force; the section on investigators was authored by the Jedi Seer Sabla-Mandibu."}, {"tag": "p", "text": "Often times, the work of the investigators led them to working completely independent of official agencies as they went deep undercover, infiltrating the organization under suspicion, and using guile, deception or even force in addition to detective skills to achieve their goal. Working from within, Jedi investigators were often successful in neutralizing the enemy before galactic conflict could arise. Jedi investigators would also spy on known criminal syndicates, pirate groups, assassin organizations as well as individual criminals and report their findings to the Council, which kept detailed record of most known criminals in the galaxy through their connection to the Galactic City Police's criminal archives. During the Clone Wars, Jedi Master Keelyvine Reus was a well known investigator amongst those in the Office of the Supreme Chancellor."}, {"tag": "p", "text": "As Jedi investigators grew old or stepped down from their intense assignments, many joined the ranks of the Jedi recruiters as members of the Acquisition Division, bringing Force-sensitive children to the Jedi Temple so that they could be trained in the ways of the Force, or solve criminal cases normal police forces were incapable of deciphering."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jedi investigator is a prestige class in the Star Wars Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}