{"url": "Jedi_shadow_bomb", "categories": ["Category:Legends articles", "Category:Air-to-air missiles"], "nodes": [{"tag": "h1", "text": "Jedi shadow bomb"}, {"tag": "p", "text": "A Jedi shadow bomb was essentially a proton torpedo with the guidance package and propellant fuel replaced by packed baradium, the explosive material used in thermal detonators. Instead of locking onto a target and firing the shadow bomb like a normal torpedo, the Jedi utilized the weapon with use of the Force to propel the bomb into an enemy ship. The extra explosives stored within each missile vastly increased their individual destructive power; a pair of well-placed shadow bombs could cleave a Yuuzhan Vong corvette analog in half."}, {"tag": "p", "text": "The shadow bomb was first developed during the Yuuzhan Vong War as a countermeasure to the ability of the Yuuzhan Vong to detect and intercept normal proton torpedoes. Each Vong ship had living gravity generators that could create miniature singularities to suck in laser fire and other forms of ordnance. Since proton torpedoes were primarily detected by the propellant trail they left behind, the Vong could sense them. However, they could not sense shadow bombs (for a while), making them very effective when used correctly."}, {"tag": "p", "text": "Eventually, the Yuuzhan Vong learned to detect shadow bombs, much to the Jedi's relative disappointment, leading to their eventual abandonment in the latter stages of the war. However, they would see renewed use by the Jedi in the Battle of the Murgo Choke against the Killik nest ships and again throughout the Swarm War, the Second Galactic Civil War and beyond. During the Second Galactic Civil war, it was used during the Battle of Kashyyyk by the Jedi Lowbacca against the Anakin Solo."}, {"tag": "p", "text": "While an effective weapon, its use against Force-users is rather limited, as seen when Jaina Solo was battling Ship, who used the Force to tear the bombs from her grasp to protect itself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}