{"url": "Jedi_supervisor", "categories": ["Category:Legends articles", "Category:Galactic Alliance", "Category:Jedi supervisors"], "nodes": [{"tag": "h1", "text": "Jedi supervisor"}, {"tag": "p", "text": "Jedi supervisors, also known as observers, were an appointed position created by an executive order usued by Chief of State Natasi Daala in two years after the Second Galactic Civil War. After the trial and exile of Grand Master Luke Skywalker from the Jedi Order and Coruscant, Daala determined that it was necessary for each Jedi to be shadowed by an agent of the Galactic Alliance."}, {"tag": "p", "text": "Immediately requests were sent out around the galaxy for anyone who had any past experiences with the Jedi Order or any of its members. Those who answered the call were immediately assigned either a Master/Padawan pair, or a solo Jedi Knight to shadow on their missions. While they were not permitted to stay within the Jedi Temple, the newly appointed Grand Master Kenth Hamner repurposed a small lecture hall off of the Jedi Temple Great Hall to be used as a waiting room where they could set up desks and compile data on their Jedi's whereabouts."}, {"tag": "p", "text": "The executive order also had a \"Guilty By Association\" clause attached to it which instructed that non-Jedi Force-users would also be shadowed by an observer. Former Jedi Knight and Sith apprentice Tahiri Veila was therefore concerned by this measure and an observer, Trinnolt Makken, was assigned to her. Veila took the matter to court and the Court of Justice, headed by Chief Justice Uved Pledesin, voted in her favor by a nine-to-three vote. They concluded that, just because someone had a large amount of power didn't mean they needed to be supervised. The clause was therefore rescinded."}, {"tag": "p", "text": "Shortly after the raid on the Armand Isard Correctional Facility, Twi'lek Nawara Ven initiated an action to strike many of the laws restricting the Jedi Order, and the Courts upheld his movement. One of the measures that was lifted in this ruling was the appointment of observers."}, {"tag": "h2", "text": "Known Jedi supervisors"}, {"tag": "h2", "text": "Appearances"}]}