{"url": "Jedi_training/Legends", "categories": ["Category:Legends articles", "Category:Incomplete lists", "Category:Articles needing additional sources", "Category:Jedi training"], "nodes": [{"tag": "h1", "text": "Jedi training"}, {"tag": "p", "text": "Jedi trained constantly to meet the intense requirements of the Jedi Order. Jedi could train in groups or in a Master–Apprentice relationship."}, {"tag": "h2", "text": "Training in the Old Jedi Order"}, {"tag": "p", "text": "The training of students of the Jedi Order changed and evolved over its many millennia of existence. Throughout its history though, the idea of a Master and an Apprentice was consistent; though at times more than one apprentice could be taken by a single Master. Training was harsh and difficult, consisting of nearly two decades of tutelage before an apprentice became a full-fledged Knight."}, {"tag": "p", "text": "The earliest recorded training methods come from Tython, with the archaic version of the Jedi Trials. Students were tested at their Master's discretion and only achieved Knighthood at their say. Tests such as the ancient Trial of Skill saw students forced to maintain inner peace while enduring stressful challenges, such as balancing upside-down on a post in the midst of a storm. Combat tests with Force-imbued swords and archaic versions of the lightsaber were extremely difficult and sometimes dangerous. This method of testing was eventually abandoned when it was understood that Masters sometimes pushed their students too far, with the bar set far too high for success to be possible."}, {"tag": "p", "text": "When a Master chose a student in these early days, their decision was unquestioned and undisputed. Age restriction of later centuries was not observed, with ancient Masters taking on adult apprentices and raising them to full knighthood at varying paces. As Jedi spread out from Tython to the larger galaxy many training facilities were established, often on a Master's homeworld. Taking on more than a single student at a time, these Jedi Masters ran their schools in a loose organization, meeting with other Masters at periodic conclaves. Eventually the world of Ossus became a center for Jedi teaching when Master Odan-Urr founded the Great Jedi Library in the city of Knossa. As the Jedi cities on the world expanded more and more students were admitted and completed their training in the ways of the Jedi."}, {"tag": "p", "text": "As the Order began to take form and align with the Galactic Republic, a Jedi High Council was established and a more fluid academy was formed to train students along loose guidelines. The creation of some new tests began to evolve during this time as the Order took to fighting the Dark Lords of the Sith. The Trials of Courage and of the Flesh, two of the canonized Trials of Knighthood, was once considered complete if a Padawan or apprentice struck down a Sith Lord during periods of war with these dark-siders. War-time promotions were very common during times of war, but were eventually done away with as the Council felt that killing a Sith did not always correlate to being a good Knight."}, {"tag": "p", "text": "The Pius Dea Era of the Galactic Republic saw a surge in rather cruel tests to become a Knight. Known as the Burning, this version of the Trial of the Flesh involved torturous applications of shock weapons, low-powered blaster fire, or cuts from a blade. Eventually trials like this were banned by the High Council for its violent methods."}, {"tag": "p", "text": "Following the end supposed extinction of the Sith and the passage of the Ruusan Reformation, the Jedi Order completely reformed its academy under the leadership of Grand Master Fae Coven and the Council of First Knowledge. Closing many of the ancient praxeums of the early order in favor of a more centralized academy on Coruscant, those that remained open were overseen by a Council of Masters as opposed to a single administrator. The formation of the Acquisition Division was a necessity with the newly implemented age restriction: all Initiates in the Order were restricted to infants and very young children. In order to help, the Galactic Republic passed a law requiring all member worlds to check for Force-sensitivity upon delivering each child. The Council also took the time to codify a formal battery of five tests of Knighthood, in addition to restricting apprenticeship to one Master and one apprentice."}, {"tag": "p", "text": "As the academy flourished, so did the Order. Initiates were placed in clans and learned together for over a decade along a strict, structured regimen of academics and combat. The Jedi Academy on Coruscant structured an Initiate's day and the lessons progressed in difficulty as a student moved through the academy system. Lessons were taught by Jedi Masters and unranked Jedi from the Education Corps, and designed to give the Initiates the skills they would need in the field. Mandating that Force studies take place in the morning, students were taught the ways of the Force and its three applications: Control, Sense, and Alter. Midday studies focused on traditional classroom instruction, where non-Jedi instructors taught an assortment of lessons including political strategy, galactic law, the sciences, and language. The afternoons were dedicated to physical activities, including lightsaber training. Taught Forms I through Form VI of lightsaber combat by highly qualified instructors, Initiates practiced with training lightsabers until they crafted their own in the caves of Ilum. Five mandatory mediation sessions were mixed into the day, as well as communal meals. Following passage of the graduation tests, Initiates were eligible to be selected by A Master or Knight for one-on-one training. The High Council had little to do with this process, unless a student failed their tests or a Master never chose them; these individuals were placed in the Jedi Service Corps by the Council of Reassignment."}, {"tag": "p", "text": "Training did not cease after graduation from the academy. Padawans continued to train in the ways of the Jedi with their masters on long journey-missions or on brief assignments from one of the Councils. Some pairs traveled with the Service Corps on specialized missions related to diplomacy or exploration. Praxeum ships were used as academies away from the confines of the Temple for extended study and research. As a Padawan, students set their own schedule to work around assignments and missions. Master-Padawan teams lasted for years, typically over a decade but had no set time period. When the student had learned all they could from their master, they were recommended to the High Council for the Trials of Knighthood. The Trials took place over a period of time and if they were completed successfully the Padawan was knighted."}, {"tag": "p", "text": "Again, once a Knight, training did not stop. Knights were given the option of further study as either a Guardian, Consular, or Sentinel. This study led to the specialization in fields such as the Watchmen or Seers. As this study continued, a Knight could take on a Padawan of their own and pass down their wisdom, learning from their students as much as their Padawan learned from them."}, {"tag": "h2", "text": "In the New Republic"}, {"tag": "p", "text": "The system of Jedi training was more lax in the post–Galactic Empire era in that Jedi students often did not begin training until much older than the younger age required in the Galactic Republic. They usually traveled to a Jedi academy to learn combat and Force techniques. Due to the destruction of much of the knowledge and the purge of many masters, lightsaber combat became simplified and many Force techniques were lost. ASP-19s were used for training."}, {"tag": "p", "text": "During this period, almost every Jedi was at some point trained personally by Master Luke Skywalker, with a few exceptions, such as Kyle Katarn, who would go on to teach at the Jedi academy on Yavin 4. Also, due to the lack of fully trained Jedi, it was common for masters to train multiple apprentices at the same time."}, {"tag": "h2", "text": "In the Galactic Alliance"}, {"tag": "p", "text": "Following the Yuuzhan Vong War, the system of training Jedi became more regimented and organized, more closely resembling the setup of training in the Old Republic era. Students were divided into groups based on age, each group having a predetermined set of techniques to be learned, like Force Jump, Telekinesis, Force Persuasion, and centering exercises. Age groups included Woodoos, Rontos, and Banthas. As a student progressed into a new group, the level of training became more complex, calling for greater reliance on the Force. After the students built their own lightsaber, they were simply known as apprentices. One such program was a game called Skorch, where two teams of older apprentices used acrobatics and Force powers to send balls through the air, though it is the referee of the game who was being trained, his or her job being to discover the secret goals of each team, which was shown through the patterns of their movements."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}