{"url": "Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)", "categories": ["Category:Real-world articles", "Category:Essential Guides"], "nodes": [{"tag": "h1", "text": "Jedi vs. Sith: The Essential Guide to the Force (real-life book)"}, {"tag": "p", "text": "Jedi vs. Sith: The Essential Guide to the Force is an entry in the Essential Guide series of books, covering aspects of the Force. It is written by Ryder Windham and was released on November 27, 2007. It was the first Essential Guide to contain original material (as opposed to a revised and updated version of a previous book) since the original Alien Species guide in 2001."}, {"tag": "p", "text": "As with both Alien Species guides, The New Essential Chronology and the Galactic Phrase Book & Travel Guide, this book \"exists\" also as an in-universe publication, written by Tionne Solusar."}, {"tag": "h2", "text": "Official Site summary"}, {"tag": "p", "text": "Learn the history of the Jedi and their enemies—from the most ancient battles of light versus darkness chronicled within the recesses of long-lost Holocrons to more contemporary conflagrations recounted by heroes such as Obi-Wan Kenobi and Leia Organa Solo. Discover the myriad ways to contemplate and use the Force, wield a lightsaber through different forms of combat, and for the truly brave, tread the path of the dark side and study the secrets of the Sith."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Ultimate Guide to the Absolute Power at the Heart of the Star Wars Galaxy"}, {"tag": "p", "text": "The Force, in the immortal words of Obi-Wan Kenobi, \"surrounds us, it penetrates us, it binds the galaxy together.\" The fortunate few who are able to tap into this extraordinary power have studied and cultivated the full spectrum of its potential - either embracing its virtuous qualities or succumbing to its evil temptations. The Jedi seek to bring peace and englightenment to the galaxy, while the Sith hunger only for conquest and control."}, {"tag": "p", "text": "This comprehensive one-of-a-kind overview chronicles the known history of the Force and its wielders down through the ages, from the founding tenents of Jedi and Sith teachings to the landmark events and legendary figures that have shaped the struggle between the light and dark sides. In firsthand accounts by Obi-Wan Kenobi, Yoda, Luke Skywalker, Leia Organa Solo, Darth Bane, Darth Vader, Count Dooku, Emperor Palpatine, and a host of other Jedi Masters, Sith Lords, scholars and sages, Star Wars: Jedi vs. Sith: The Essential Guide to the Force spans the breadth of available knowledge, including"}, {"tag": "p", "text": "PLUS - More than one hundred brand-new full color illustrations!"}, {"tag": "p", "text": "No Star Wars library is complete without this definitive guide to understanding the Force. Remember: The Force will be with you…always."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Contents"}, {"tag": "p", "text": "Part One: History and Holocrons"}, {"tag": "p", "text": "The Holocrons"}, {"tag": "p", "text": "Significant Battles"}, {"tag": "p", "text": "Part Two: The Jedi"}, {"tag": "p", "text": "Jedi Evolution"}, {"tag": "p", "text": "Force Sensitive Abilities"}, {"tag": "p", "text": "Jedi Spirits"}, {"tag": "p", "text": "Detecting Jedi Powers"}, {"tag": "p", "text": "The Force as a Source of Energy"}, {"tag": "p", "text": "Force Anomalies"}, {"tag": "p", "text": "Lightsabers"}, {"tag": "p", "text": "Part Three: The dark side"}, {"tag": "p", "text": "Dark Jedi"}, {"tag": "p", "text": "Dark Side Disciples"}, {"tag": "p", "text": "Under Exar Kun's Influence"}, {"tag": "p", "text": "Luke Skywalker on the Dark Side"}, {"tag": "p", "text": "Part Four: The Sith"}, {"tag": "p", "text": "The Darth Title"}, {"tag": "p", "text": "Gatekeeper of the Telos Holocron"}, {"tag": "p", "text": "The Dark Side Compendium"}, {"tag": "p", "text": "Part Five: Other Force Using Traditions"}, {"tag": "p", "text": "Part Six: The Chosen One"}, {"tag": "p", "text": "Afterword"}, {"tag": "p", "text": "Index"}, {"tag": "p", "text": "About the Author"}, {"tag": "p", "text": "About the Illustrators"}, {"tag": "h2", "text": "Quotations"}, {"tag": "p", "text": "Much of this book included direct quotations from previously published sources. These included:"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Under the section entitled The Reformation of Revan, an article written in-universe by Deesra Luur Jada, the following statement is made: \"Increasingly, I feel like nothing more than a necrologist, dispatching weekly obituaries to the archives on Ossus.\" However, the guide does not mention that the Great Jedi Library on Ossus was thought to have been destroyed during the Sith War."}, {"tag": "p", "text": "The book states incorrectly the dates for the Mandalorian Wars and The Jedi Civil War."}, {"tag": "p", "text": "The book incorrectly states that Quinlan Vos retrieved Darth Andeddu's Holocron in 23 BBY. The correct date is 21 BBY."}, {"tag": "p", "text": "The book takes place almost immediately after the funeral of Mara Jade Skywalker, after she is killed by Jacen Solo."}, {"tag": "p", "text": "The last entry made in the book, by a Jedi apprentice, incorrectly states that Darth Nihl and Darth Talon are Darth Krayt's hands. Talon becomes a Hand in 137 ABY, though the entry was allegedly written in 130 ABY."}, {"tag": "p", "text": "Vandar Tokare is misspelled as \"Vandar Dokar\"."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}