{"url": "Jedidiah", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Force-sensitives", "Category:Males", "Category:Velmoc"], "nodes": [{"tag": "h1", "text": "Jedidiah"}, {"tag": "p", "text": "Jedidiah was a male Velmoc who hailed from the planet Velmor. Early in his life, he was offered training to become a Jedi Knight, but he refused. As an advisor to the king of his homeworld during the reign of the Galactic Empire, Jedidiah predicted Imperial treachery in regards to the ruling of the planet, and he devised to stay with the ruling family instead of pursuing his dream of becoming a Jedi. Jedidiah's suspicions proved to be correct, and soon after, the Empire orchestrated a violent coup which resulted in the deaths of both the king and queen. Their oldest son, Denid, was also not a supporter of the Empire and had been marked for death before Jedidiah was able to rescue the prince and spirit him away from Velmor. The Imperial-sympathizing son of the king and queen, Anod, was kept alive, as the ruling Imperials knew that he would serve as a puppet ruler. In Jedidiah's escape from his now-hostile home planet, he and the prince crash-landed on a remote jungle world. Jedidiah pulled the prince from the burning wreckage of the ship, but when he returned to the crash site to retrieve supplies, he was hit by a large piece of debris. The accident resulted in severe brain damage, and Jedidiah was left with only the remembrance of his dream to become a Jedi."}, {"tag": "p", "text": "Twenty years later, in 3 ABY, Jedidiah and Denid were discovered by Jedi Knight Luke Skywalker and Rebel leader Leia Organa, who were hoping to reinstate Denid as the monarch of the Velm system. The Rebels, Jedidiah, and Denid, returned to Velmor just in time to stop the coronation ceremony of Anod, since tradition required twenty years to pass to declare Denid legally dead and leave Anod free to take the throne. The ruling regent, Zelor, was not pleased to see Denid alive, and he made arrangements to have the prince and his companions killed through the use of the Imperial agent, Zeta Traal. After managing to isolate the three Humans during a Mrid Hunt, Zelor attempted to kill all the parties involved in the pursuit of the throne, even his allies, hoping to claim the throne for himself. However, Jedidiah, having detected his friends' distress in the Force, raced to their aid. Just before Traal was about to hit Skywalker with a blaster shot, Jedidiah dove in front of the blast, sacrificing himself for the young Jedi. Following Jedidiah's death, Skywalker placed the Velmoc in a rocket-powered coffin and fired him into space, honoring the would-be Jedi with a final tribute."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Velmorian advisor"}, {"tag": "p", "text": "Jedidiah was one of only a few remaining Velmocs on the planet Velmor. For much of his life, he hoped to become a Jedi. However, by 17 BBY, two years after the Jedi were destroyed via Order 66 issued by Supreme Chancellor Palpatine, Jedidiah had become a trusted friend and advisor of the reigning King Lorac and his family. However, the Galactic Empire had set its sights on Velmor, planning to take advantage of its resources and untouched landscapes. As such, the Imperial Diplomatic Corps sent emissaries to the world, hoping to bring Velmor into the fold of the Empire. Jedidiah was suspicious of the Imperials and he warned King Lorac of their intentions, but he was largely ignored. Around this time, Jedidiah was discovered to be Force-sensitive, and he was asked to become a Jedi. Although Jedidiah wished to become a Jedi with all his being, he still suspected the Imperial presence of treachery, and so he turned down the offer, knowing that the royal family would need him eventually."}, {"tag": "p", "text": "Jedidiah's suspicions proved to be correct when the Imperials orchestrated what would later be known as the Great Revolt. A mob of Velmorians were bought off with Imperial funds, and a violent coup was carried out, with dissidents storming the palace. Both King Lorac and his wife, Queen Denira, were killed, but their younger son Anod, who had Imperial sympathies, was left alive. The Imperials, knowing the fanatical loyalty that the Velmorians had towards their reigning monarch, had opted to install a new king which they would be able to control, rather than eliminating the entire royal family. The king and queen's eldest son, the fifteen-year-old Denid, who was opposed to the Imperials, was also marked for death. However, Jedidiah was able to save Denid and his betrothed, the Alderaanian Loren. Pursued closely by the killer mob, the trio departed the planet in a small shuttle that contained barely a week's supplies."}, {"tag": "h3", "text": "In exile"}, {"tag": "p", "text": "Unfortunately for the fleeing party, the shuttle they had left the planet in had an inadequate hyperdrive and was low on fuel. The shuttle crashed in the nearby Tantajo system on the jungle planet Tantajoc V. Jedidiah was able to pull his charges from the wreckage, but when he returned to the downed ship to retrieve any supplies he was struck in the skull by falling debris. The accident was the cause of massive brain damage, and coupled with his feelings of isolation on the new world, the Velmoc was robbed of rational thought. The Velmoc was left only with his long-lost dream of becoming a Jedi Knight, and he took to wielding a gnarled wooden staff as a mock lightsaber. As Jedidiah was stuck with his delusions, Denid was left to fend for himself. Loren had been killed in the shuttle crash, and Denid buried the girl near the small encampment that he established close to the crash site."}, {"tag": "p", "text": "For the next twenty years, Denid and Jedidiah scraped out a living on the hostile planet. Denid became a master huntsman and tracker, despite contracting the Velmoc flu for a time. Denid even learned how to defend them from the native predators that were only able to be killed by an anti-magnetic polarization ray gun. Around 3 ABY, following the Battle of Hoth, at the age of thirty-five, Denid rescued two Rebel scouts from the native predators after one Rebel, Luke Skywalker, had failed to fend off the attacks of one such predator with his lightsaber. Skywalker and his companion, Leia Organa, had come to the distant planet in search of Denid because they hoped to place Denid back on the throne of his home planet to keep it out of the grasp of the Empire. Tradition relating to the laws of succession had dictated that twenty years needed to pass in order to declare the missing Denid legally dead, and Anod was about to take the throne. To stop the coronation, Denid, Jedidiah, and the two Rebels raced back to Velmor in Skywalker's Y-wing starfighter."}, {"tag": "h3", "text": "Back on Velmor"}, {"tag": "p", "text": "The party arrived just in time to prevent the ruling regent, Zelor, from crowning Anod king. With Organa disguised as Loren, the prince's deceased betrothed, and Skywalker disguised as the bounty hunter Korl Marcus, Denid crashed the ceremony and demanded that the proceedings be halted until his claim to being Denid could be verified. After the claim was confirmed by the royal physician, Chozz Wardle, the group was ushered to a celebratory banquet in the discovered prince's honor. On the way, Skywalker, who had become increasingly annoyed by Jedidiah, whom he perceived as a grotesque parody of his dream to become a Jedi, asked his droid C-3PO to watch over the deranged old Velmoc."}, {"tag": "p", "text": "C-3PO, hoping to find treatment for Jedidiah's condition, brought Jedidiah to the royal palace's 2-1B surgical droid. However, the droid's assessment was that repair of Jedidiah's mental processes would be nothing short of a miracle. Meanwhile, Zelor was planning to eliminate Denid and his betrothed during a Mrid Hunt. Zelor hoped to retain the throne, and he was also planning on killing Anod at the same time. As Zelor and his Imperial accomplice Zeta Traal began to carry out his plan, he was opposed by Skywalker, and a struggle ensued. Back at the palace, Jedidiah received a sense of foreboding, and, believing his friends to be in trouble, he boarded a Ycaqt, a native creature used as a mount, and left to rescue his friends."}, {"tag": "h3", "text": "Sacrifice"}, {"tag": "p", "text": "In the struggle with Zelor, Skywalker was able to defeat the regent, but in his hurry to get information from Zelor on why he had attacked them, he lost track of Traal. The Imperial agent trained her blaster on the young Jedi, but before she could get a shot off, Jedidiah arrived on the scene. After knocking aside Anod's bodyguard, Ergric Betos, the Velmoc saw what Traal was planning on doing, and he leapt from his mount to stop the Imperial. Traal was able to get one shot off before Jedidiah tackled her to the ground, and the would-be Jedi was killed. Jedidiah's sacrifice allowed Skywalker to retake control of the situation, and he quickly knocked Traal unconscious and killed Zelor when he tried once again to slay the young Rebel."}, {"tag": "p", "text": "In the aftermath of the struggle, Skywalker lamented Jedidiah's death, and he carried the dead Velmoc from the scene back to the capital city of Den Velmor. Sometime later, Skywalker and Organa decided to leave Velmor to return to the Rebellion. With Denid now in power, their mission was complete. However, before the Rebels entered hyperspace, Skywalker stopped the ship and ejected a small rocket-powered coffin containing Jedidiah into the vacuum of space. As the tribute to the fallen warrior made its way through the void, Skywalker declared Jedidiah as an actual Jedi, one who had clearly held the soul of a true Jedi Knight."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jedidiah was an honorable individual, and he showed great loyalty toward those that he served. Before his incapacitation, he had turned down an offer to become a Jedi Knight because of his ties to the royal family. Additionally, even after his accident, he was willing to rush to the aid of those that he thought to be his friends, and he willingly sacrificed himself to protect Luke Skywalker, even though the young Jedi had proved somewhat hostile to the deranged older being. Jedidiah also proved to be quite fearless, and it was his daring during the Great Revolt that saved Denid from being killed alongside his parents. Even after their crash, Jedidiah was able to rescue Denid yet again from the ship's wreckage. It was Jedidiah's pursuit of supplies to keep Denid alive which resulted in his brain becoming damaged."}, {"tag": "p", "text": "Jedidiah was seen as an obscene parody of a real Jedi Knight by Skywalker when the two initially met. He wore a tattered ensemble meant to appear as the outfit of a real Jedi, and he wielded a long wooden stick as an ersatz lightsaber. The brain damaged Velmoc appeared to Skywalker as a mockery, and the other would-be Jedi initially dismissed him. It wasn't until his death that Skywalker began to see Jedidiah as a tragic figure, and his final words to the fallen warrior expressed his admiration for the Velmoc, even going so far as to declare him the \"Last Jedi.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jedidiah was created by Mike W. Barr for use in Marvel Star Wars' Star Wars 49. The character died in the same issue, and he was not referenced again in the Marvel comics. Jedidiah was not mentioned again until over twenty years later when he was referenced several times in Wizards of the Coast's online supplement, Velmor: Royalty and Rebellion. The online article only referenced Jedidiah's actions during the comic, and it failed to expand on his story. The cover to Star Wars 49 showed Jedidiah colored as green. However, the cover also showed Denid with a green tinge. Therefore the coloring may just have been an artistic choice."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}