{"url": "Jedi%E2%80%94The_Dark_Side_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Jedi—The Dark Side"], "nodes": [{"tag": "h1", "text": "Jedi—The Dark Side 5"}, {"tag": "p", "text": "Jedi—The Dark Side 5 is the final issue in the Star Wars: Jedi—The Dark Side comic book miniseries. Set in 53 BBY, the series follows Jedi Master Qui-Gon Jinn and his Padawan Xanatos as they attempt to prevent civil war from erupting on Xanatos's homeworld of Telos IV. It was released on September 21, 2011."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Civil war has broken out on Telos IV. As the governor rallies his military, Jedi Qui-Gon Jinn struggles desperately to uncover the reason for the planet's unrest, in hope of stopping the war..."}, {"tag": "p", "text": "But Qui-Gon's troubled Padawan isn't helping: his homecoming to Telos has been anything but happy, and the recent events—including the horrific death of a family member—have fueled his growing anger. This time, though, Qui-Gon is the target!"}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "The issue starts with the Telosian governor Crion mourning the loss of his daughter, Nason, while Xanatos attempts to console him. Crion brushes aside these condolences, labeling Nason's death as an act of sacrifice. Crion goes on to sway Xanatos fully to his side, completely explaining his entire scheme to him."}, {"tag": "p", "text": "Meanwhile, Minister Hukowl An Devi is visited by Dairoki, a former Jedi and agent of Crion. Dairoki voiced his frustrations with Crion, fearing that he is losing focus in his grief, and letting slip to An Devi how he and Crion were responsible for setting the Telosian Civil War in motion. An Devi, who had been unaware of the scheme, attacks Dairoki, who fends him off and flees the planet."}, {"tag": "p", "text": "As the Civil War escalates, with Crion and Xanatos observing from their palace, Qui-Gon Jinn prepares to approach his wayward apprentice to apologize before arranging passage off-world for himself and Orykan Tamarik. Before he can do so, he is approached by An Devi. While Qui-Gon goes to confront Crion, An Devi publicly denounces Crion, revealing his scheme to pin the activities of Telosian rebels on the nearby Toprawa system, to whip the Telosian population into a nationalist frenzy."}, {"tag": "p", "text": "Qui-Gon finds Crion and his guard prepared for battle, and things quickly turn violent. While fending off the guardsman, Qui-Gon offers to take him off-world to safeguard him, an offer Crion aggressively refuses. Orykan the intervenes, despite Qui-Gon's earlier command to stay back, though she is quickly disarmed by Crion, who declares his intent to kill her then Qui-Gon. In response, Qui-Gon attacks Crion, shattering his sword. As Crion falls into the fireplace, Qui-Gon leaps at him and impales the Governor."}, {"tag": "p", "text": "Enraged, Xanatos attacks Qui-Gon, knocking the latter's lightsaber into the fireplace where it is destroyed. Xanatos begins ranting about how his actions have signified his advancement as a Jedi; he had forgiven his father for abandoning him, and cites that he is facing his primary weakness, his selfishness. Falling completely to the Dark side of the Force, Xanatos attacks Qui-Gon, who defends himself with Orykan's lightsaber before kicking his wayward apprentice aside. Continuing his rant, Xanatos takes his father's hand and uses Crion's ring, now red-hot, to sear his family crest into his cheek. Before the duel can resume, rioters break into the palace, and Xanatos vanishes into the crowd."}, {"tag": "p", "text": "Qui-Gon reports to the Jedi Council via holocomm, explains that the Civil War had ended, and that he had killed Crion. Furthermore, he reveals that An Devi is the new governor, and that he has arranged passage for Orykan back to Coruscant, while Qui-Gon left alone. While the Jedi promise to have a Kaiburr crystal prepared so Qui-Gon can construct a replacement lightsaber, they question him about his current location, and the whereabouts of Xanatos. Qui-Gon claims that Xanatos died in the fighting, and that he doesn't intend to return to the Jedi Temple for some time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}]}