{"url": "Jeedai_heresy", "categories": ["Category:Legends articles", "Category:Jeedai Heretics", "Category:New Jedi Order", "Category:Yuuzhan Vong organizations", "Category:Yuuzhan Vong religion"], "nodes": [{"tag": "h1", "text": "Jeedai heresy"}, {"tag": "p", "text": "The Jeedai heresy was a heretical movement that ultimately helped end the Yuuzhan Vong War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The heresy began on Yavin 4, shortly after the Yuuzhan Vong had conquered the moon and driven the New Jedi Order off. Anakin Solo, trying to rescue Tahiri Veila, encountered Vua Rapuung, a former Warrior whose ex-lover, Mezhan Kwaad, had made him appear to be a Shamed One. Kwaad was also the one who was holding Tahiri. Anakin and Vua agreed to help each other against their common enemy. When the two finally confronted Kwaad, she admitted her role in Rapuung's shaming, and mortally wounded him, shortly before Tahiri decapitated her. Upon learning that the Jedi had redeemed Rapuung, other Shamed Ones began to believe that the Jedi could redeem all Shamed Ones."}, {"tag": "p", "text": "Despite efforts by Warmaster Tsavong Lah to suppress both news of Vua Rapuung incident and the \"heresy\", the heresy continued to spread throughout Yuuzhan Vong space among the Shamed Ones and the lower-class workers and slaves. By the time Shimrra Jamaane, the Supreme Overlord of the Yuuzhan Vong, arrived on Yuuzhan'tar, the heretics were disorganized, and some groups had contradictory views of Rapuung's redemption. High Priest Jakan, head of the Priest caste, advocated that the heretics be hunted down and killed, but Shimrra decided that they would just try to give them a warning. Jakan, however, inadvertently defined some of their doctrine, when he said that Jaina Solo and Jacen Solo had no connection to Yun-Harla, the Trickster, and Yun-Yammka, the Slayer. Still, the groups remained contradictory."}, {"tag": "p", "text": "That all changed after the Battle of Ebaq, when Nom Anor was forced to flee Shimrra after the disaster caused the death of Warmaster Tsavong Lah. Anor, realizing that this could be the way that he could dethrone Shimrra, assumed the guise of Yu'shaa, the Prophet, and began forming their doctrine for them. Yu'shaa said that the Force was the remaining exaltations of Yun-Yuuzhan, the Creator God of the Yuuzhan Vong, who had died when he created the Universe. Anor later gained an ally in Ngaaluh, a priestess of Yun-Harla, who had heard about the heresy and believed it to be the Truth. Ngaaluh became Anor's spy in Shimrra's Citadel, bringing false accusations against Anor's rivals in the intendant caste, in the hope that it would remove Shimrra's most competent prefects."}, {"tag": "p", "text": "After a few weeks, Shimrra realized her treachery and ordered her to be interrogated, but Ngaaluh committed suicide. Deprived of his spy and with the number of converts dropping, Yu'shaa proclaimed the planet Zonama Sekot to be the home of the Jedi and a new home for the Shamed Ones. When Anor learned of Zonama Sekot and visited it, he offered to destroy it for Shimrra, if he would reward him. Anor's sabotage of Zonama Sekot failed. Despite the disappearance of Yu'shaa, the heresy had taken a life of its own. When Zonama Sekot appeared in the skies of Coruscant, the heretics believed that their redemption was at hand, and rebelled against Shimrra and the Elite. The chaos they caused was vital to the Galactic Alliance during the Battle of Yuuzhan'tar. After the battle, the Shamed Ones were renamed the Extolled, and finally gained the equality that they had sought, on Zonama Sekot."}, {"tag": "h2", "text": "Jeedai heretics"}, {"tag": "h2", "text": "Figures in the heresy's sacred tales"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}