{"url": "Jeff_Grubb", "categories": ["Category:Real-world articles", "Category:Role-playing game authors"], "nodes": [{"tag": "h1", "text": "Jeff Grubb"}, {"tag": "p", "text": "Jeff Grubb (born August 27, 1957 in Pittsburgh, Pennsylvania) is an author and game designer. He has worked on a number of computer and role-playing games and has written a number of successful novels, short stories and comics. His credits include The Finder's Stone Trilogy with his wife, Kate Novak, the Spelljammer and the Jakandor campaign settings, and, more recently, the computer games Guild Wars Nightfall."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Role-Playing Games"}, {"tag": "p", "text": "A wargaming enthusiast since high school, Jeff Grubb first learned of roleplaying games as a freshman majoring in engineering at Purdue University, when he happened upon a game of Dungeons & Dragons being played by members of the campus wargaming club. Within a year, he had attended his first Gen Con and was running his own campaign set in Toril, a world of his own creation. Jeff Grubb joined TSR, Inc. in July 1982, where he was involved as a design consultant on Gary Gygax's Monster Manual II for the Advanced Dungeons & Dragons role-playing game. The manual was first published in 1983. He was then retained at TSR as the principal architect of the Marvel Super Heroes game system, first released in 1984. Jeff Grubb continued to work on role-playing games with TSR for many years, long enough to be regarded affectionately as an \"old timer\" by Scott Haring. During this time he was involved in helping to formulate the Dragonlance campaign setting, under Tracy Hickman, and the Forgotten Realms setting with Ed Greenwood. He also was a major contributor to the first edition of Unearthed Arcana, and authored the first edition of the Manual of the Planes. He is also the designer of the Spelljammer and Jakandor campaign settings."}, {"tag": "p", "text": "Jeff Grubb moved to Wizards of the Coast after they purchased TSR, and continued to work on games, settings and source books such as Tempest Feud for the Star Wars Roleplaying Game."}, {"tag": "p", "text": "Outside of the strict TSR / Wizards of the Coast environment, Jeff Grubb has authored The Memoirs of Auberon of Faerie for R. Talsorian Games and was one of the authors of Dungeons & Dragons Warcraft: The Roleplaying Game for Sword & Sorcery Studios. He's also been involved with Sovereign Press, which was founded by Margaret Weis and Don Perrin in 2001."}, {"tag": "h3", "text": "Comics, Novels and Short Stories"}, {"tag": "p", "text": "Jeff Grubb's first novel, Azure Bonds, was coauthored with his wife, Kate Novak, and first published in 1988 as part of The Finder's Stone Trilogy. The second and third books in the trilogy, The Wyvern's Spur and Song of the Saurials, were published by TSR in 1990 and 1991. Jeff Grubb and Kate Novak continued to write novels in the Forgotten Realms setting over the years, releasing Masquerades, Finder's Bane and Tymora's Luck."}, {"tag": "p", "text": "Other settings for his novels have included Magic: The Gathering, Warcraft and Starcraft."}, {"tag": "p", "text": "His involvement in comic books started in 1988, when he wrote four issues of the Advanced Dungeons & Dragons comic for DC Comics, before writing all 25 issues of the Forgoten Realms comic book series from 1989 until 1991. He also authored the 45th issue of Superman Adventures, \"Mateless in Metropolis\", which had a cover date of July, 2000."}, {"tag": "p", "text": "He has written a number of short stories in different fictional worlds, including Dragonlance, Forgotten Realms, Ravenloft and Thieves' World. In general his short fiction has been well received, with his story \"Malediction\" being described as amongst the best of those included in Thieves' World: Enemies of Fortune, while \"Beowulf in the City of the Dark Elves\" has been regarded as the best of the original fiction in The Further Adventures of Beowulf: Champion of Middle Earth."}, {"tag": "h3", "text": "Computer Games"}, {"tag": "p", "text": "The novel Azure Bonds was developed into a computer game, Curse of the Azure Bonds, in 1989. More recently, ArenaNet hired Grubb to write the story for the third installment of their Guild Wars franchise, Guild Wars Nightfall. He has been credited as a designer under lead designer, James Phinney."}, {"tag": "p", "text": "Jeff Grubb was also involved in designing the Guild Wars: Eye of the North expansion pack, although, once again, he describes himself as an 'embedded writer' rather than a game designer, and was primarily responsible for writing the storyline."}, {"tag": "h2", "text": "Star Wars bibliography"}, {"tag": "h2", "text": "External links"}]}