{"url": "Jefi", "categories": ["Category:Canon articles", "Category:Races and species stubs", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Jefi"}, {"tag": "p", "text": "The Jefi (plural form: Jefies) were a sentient species that lived in the galaxy. The Jefies were considered to be a species of incredible loyalty, unflinchingly following anyone who presented them self as a competent leader. This led them even to submit to the rule of individuals from other species including humans. They were the indigenous inhabitants of the planet Botajef and made up 85 percent of the population."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Jefi history was characterized by long periods of passive allegiance that were punctuated by brief periods of often fiery conflict. Their history was reflected by their art which followed the same pattern: curves interrupted by stark lines or sharp angles, with a color palette mirroring the group emotional and ethical spectrum. Sculpts were low-contrast, which indicated that the Jefies recognized the shortcomings within the cultural matrix. Jefi art also had hanging tressiles with quick dampening balances, which indicated that they recognized the basic stability of their political system. The Jefies would submit to anyone who showed leadership qualities, even if they were an offworlder."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Jefies were the native population of the planet Botajef. Jefi history was characterized by cyclical patterns of long periods of passive allegiance and brief periods of fiery conflict. Despite a period of immigration over the past century, the Jefies made up 85 percent of the planetary population. By the time of the reign of the Galactic Empire, Coruscant had appointed the human Quesl as the planet's governor. Despite him not being a Jefi, the Jefies submitted to his leadership since Quesl had proved that he was an effective leader."}, {"tag": "p", "text": "During the Age of the Empire, Quesl led Botajef's secession from the Empire and managed to convince the Jefies to support his uprising. However, the uprising was a cover for Quesl's plot to steal rare pieces of Jefi art to sell offworld. His plan was to goad the Empire into destroying the governor's palace, seemingly killing Quesl and destroying his art. He planned to escape on a CR90 corvette with the artworks. However, Commodore Thrawn discovered Quesl's plan and exposed the Governor as a fraud, forcing his surrender."}, {"tag": "p", "text": "Quesl lost the respect of his Jefi subjects and was arrested by the Empire. Thrawn took care that the Jefies were enlightened and that a new leader was chosen until Coruscant could send a new governor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}