{"url": "Jek-14/Legends", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Clone troopers", "Category:Force-sensitives", "Category:Human clones", "Category:Jedi affiliated with the Alliance to Restore the Republic", "Category:Jedi Purge survivors", "Category:Pilots", "Category:Post-Ruusan Jedi", "Category:Redeemed Force-sensitives"], "nodes": [{"tag": "h1", "text": "Jek-14"}, {"tag": "p", "text": "Jek-14 was a Force-sensitive Sith clone of a basic clone trooper created by Count Dooku/Darth Tyranus on Kamino during the Clone Wars. He was originally intended to be part of a much larger \"Sith clone\" army. After dueling and evading Mace Windu and Yoda, he escaped to Geonosis, where he presented himself to Darth Sidious in the flesh. However, when Jedi Master Yoda fought Tyranus on Geonosis and offered Jek the choice to join the light side of the Force, Jek decided that he would choose no side."}, {"tag": "p", "text": "During the Clone Wars, Jek-14 was pursued by both the Separatists and the Galactic Republic. Refusing to fight, the Sith clone befriended Yoda's Padawans on Hoth and helped them to build \"beautiful things.\" Later, he was recaptured by the Separatists, who used him to make an army of Sith clones. When Dooku attacked the Jedi Temple, Jek awoke and used his Force powers to destroy Dooku's clones and to drive the Sith away. Despite winning the affection of the Jedi, Jek-14 decided to leave and find a new home."}, {"tag": "p", "text": "Later, he reconsidered his decision and helped the Jedi to defeat the Sith and their Badawans on Mustafar. As a result, Jek won the friendship and affection of the Jedi Order. Following the Great Jedi Purge, Jek helped the Jedi to recover several holocrons from Darth Sidious and Anakin Skywalker. After the Jedi hid them on Tatooine, Jek returned to his quiet life."}, {"tag": "p", "text": "During the Galactic Civil War, Jek-14 helped Luke Skywalker and his rebel companions to recover the holocrons from Vader and the Emperor again. He later helped the Rebel Alliance to move their base from Yavin-4 to the icy world of Hoth. After helping the Rebellion, Jek left to lead a quiet life. He also traveled to the planet Dagobah to find Master Yoda, who gave him a biological arm."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Sith clone"}, {"tag": "p", "text": "Jek-14 originated as a Sith-enhanced clone trooper who had been activated by the Sith Lord Count Dooku and the Separatist General Grievous. Using four kyber crystals that Grievous had stolen from Master Yoda's Padawans, Dooku and Grievous infiltrated a cloning chamber on the planet Kamino and proceeded to enhance them with the crystal. Before they could finish, Yoda and Master Mace Windu stormed the facility and destroyed the cloning machine."}, {"tag": "p", "text": "Despite deactivating the chamber, the Jedi accidentally activated one of the clone troopers. Upon activating, Dooku ordered Jek-14 to rebuild the cloning machine while he and Grievous fought off the Jedi. Acting under the orders of Dooku, Jek tortured Master Yoda with his droid arm. Using the Force, Yoda managed to grab Windu's blaster and fired at the Sith clone. However, Jek-14 deflected his blast with the Force and hurled Yoda outside, knocking Grievous over in the process. Dooku then used the stolen lightsaber crystals to reactivate the cloning machine."}, {"tag": "p", "text": "Jek-14 then prepared to kill Yoda under Dooku's orders but found himself unable to do it. This momentary hesitation allowed Yoda's Padawans and C-3PO to arrive on their modified school bus and destroy the chamber. The Padawans also destroyed Grievous's personal starfighter. Dooku and Jek-14 fled in a modified starfighter to Geonosis. There, Dooku revealed his new Sith clone to his master Darth Sidious. Jek was uncomfortable when Dooku and Sidious expressed their desire to destroy the Jedi. Shortly, they were joined by Grievous, who had arrived in a life tube. Meanwhile, Yoda vowed to hunt down and destroy Jek-14."}, {"tag": "h3", "text": "Rejecting the Sith"}, {"tag": "p", "text": "At the Petranaki arena on Geonosis, Darth Sidious and Count Dooku unveiled their new secret weapon Jek-14 to the assembled Separatist leadership. Unknown to the Sith, the Jedi Masters Yoda and Obi-Wan Kenobi had infiltrated the arena disguised as Sith. While the Trade Federation Viceroy Nute Gunray initially expressed derision at having a clone trooper as their secret weapon, Jek managed to impress the Separatist leadership by destroying several columns in the arena, incinerating Gunray's hat, and even making a sign saying \"GO SITH\" from the debris. While most were impressed, Sidious' former Sith apprentice Darth Maul was jealous."}, {"tag": "p", "text": "After Jek-14 had completed his display of his Force powers, Sidious informed the Separatist leadership that he would be creating a clone army of Jeks. Dooku then presented a new cloning machine. However, Dooku's display was a failure because it only reproduced a midget dark-side version of Jek-14. After Sidious expressed anger towards Dooku, Yoda and Kenobi revealed themselves and fought with Jek-14. Due to his enhanced Force powers, Jek-14 quickly defeated the two Jedi but rejected Dooku's orders to kill them. Deciding that he would be neither Sith nor Jedi, Jek told the assembled crowd that he just wanted to be himself before running away."}, {"tag": "p", "text": "The Separatists and Jedi pursued Jek-14 but their ships were wrecked in the asteroid belt surrounding Geonosis. Jek then fled into hyperspace and landed on the icy planet of Hoth. His arrival coincided with the Jedi Knight Anakin Skywalker leading several of Master Yoda's Padawans on a field trip. Jek befriended the Padawans and used his Force powers to create ice sculptures, telling them that he only liked to create \"beautiful things.\" He was soon discovered by Skywalker, who had been informed that the Jedi were looking for Jek. Despite the Padawans' protests, Skywalker attempted to attack Jek but was knocked to the ground by a Force field that Jek had created."}, {"tag": "p", "text": "Before Jek-14 could leave to find a \"new home,\" he was attacked by several Separatist probe droids and recaptured by General Grievous. Grievous brought the captive Jek-14 back to Dooku's Subjugator-class heavy cruiser, where he had perfected a new cloning machine. Dooku used the cloning machine to build several clones of Jek-14, who were loyal to the Sith. Though the Separatist heavy cruiser was attacked and destroyed by Anakin and the Padawans, with help from Windu and a fleet of Gunships and fighters, Dooku and Grievous managed to land with an unconscious Jek-14 and their army of Sith clones at the Jedi Temple on Coruscant."}, {"tag": "p", "text": "Before Dooku could overwhelm the Jedi with his Sith clone army, Jek-14 awoke and saved the Jedi by destroying the clones. He then hurtled Dooku and Grievous into the air. Despite winning the affection and good will of the Jedi, Jek still wanted to be left alone and begged his new allies not to contact him. Jek then departed on his modified starfighter."}, {"tag": "h3", "text": "Helping the Jedi"}, {"tag": "p", "text": "Following the events on Coruscant, Jek-14 traveled to the Forest Moon of Endor, where he befriend the local Ewoks. Using his Force powers, Jek-14 helped them rebuild a giant tree. Later, Yoda, the protocol droid C-3PO, Palpatine, Admiral Ackbar and Yoda's Padawans arrived seeking his help. While traveling to Mustafar to stop the Sith and their Badawans, the Republic fleet had collided with an asteroid field. Jek-14 was reluctant to get involved in the Clone Wars but changed his mind after Bobby politely requested his help."}, {"tag": "p", "text": "Returning to the asteroid field, Jek-14 helped to reassembled the scattered LEGO bricks from the Republic fleet and the Padawans' modified hoverbus into a large warship. However, he elected not to accompany them to Mustafar and remained on the asteroid field. He then used some LEGO bricks to build a gyrocopter-like starship and traveled to Mustafar. Jek's arrival was timely because Darth Sidious had eliminated an entire unit of clone troopers and damaged the Republic warship. Using his droid arm, Jek-14 hurled a bout of Force energy at the Sith and their Padawans, driving them into a retreat. He also destroyed the Klegger Corp Mining Facility, causing it to crash into the magma. After defeating the Sith, the Jedi hosted Jek-14 during a victory celebration at the Jedi Temple on Coruscant."}, {"tag": "h3", "text": "Recovering the Holocrons"}, {"tag": "p", "text": "Jek-14 later joined a strike team consisting of Yoda, Obi-Wan Kenobi, Yoda's Padawans, Senator Bail Organa, C-3PO, R2-D2, and the Jedi Knight Noga-ta on a mission to recover the Jedi holocrons from the Jedi Temple on Coruscant. At the end of the Clone Wars, Emperor Palpatine had transformed the Old Republic into the Galactic Empire and launched a Great Jedi Purge. While fleeing the Temple, Kenobi had forgotten to evacuate the Jedi holocrons, which had now fallen into the hands of the Empire. Yoda wanted to recover the holocrons in order to train Luke Skywalker, the son of Anakin."}, {"tag": "p", "text": "After landing in the Temple, Jek-14 and the Padawans managed to make their way to the Holocron Vaults. When a librarian droid tried to obstruct them, Jek destroyed the droid with his droid arm. Before Jek and the Padawans could evacuate the last holocron, they were accosted by Darth Vader who used the Force to wrench off Jek's arm and then Force-choked Noga-ta. While the Padawans distracted Vader with a holoprojection of Kenobi, Noga-ta managed to pass Jek's droid arm back to him. After trapping Vader in a sealed room, Jek and the Jedi fled with the holocrons."}, {"tag": "p", "text": "Jek and the Jedi then fled into space where they were pursued by Darth Vader. Before Vader could eliminate them, the Jedi were saved by C-3PO and Senator Organa who swung their starship into Vader's TIE fighters. This allowed them to flee into hyperspace. After Kenobi buried the holocrons beneath the sands of Tatooine, Jek returned back to his solitary life."}, {"tag": "h3", "text": "Joining the Rebellion"}, {"tag": "h4", "text": "Finding Luke Skywalker"}, {"tag": "p", "text": "Following the Battle of Yavin, Master Yoda and the Force ghost of Obi-Wan Kenobi contacted Jek-14. Luke Skywalker and his rebel companions Han Solo, Princess Leia, Chewbacca, C-3PO, and R2-D2 had embarked on a quest to recover the Jedi holocrons on Tatooine. However, Darth Vader had beaten the rebels to the holocrons and had fled Tatooine on a shuttle. Unable to help Luke, the Jedi Masters decided to call Jek out of hiding."}, {"tag": "p", "text": "While on Naboo, Jek-14 was contacted by Yoda and Kenobi via hologram. Jek then warned the Jedi Masters that Darth Vader had already recovered the holocrons and was using them to attack and identify worlds sympathetic to the Rebellion. He then witnessed several AT-AT and AT-ST walkers attacking several Gungans including Jar Jar Binks and Boss Rugor Nass. After destroying two AT-ST walkers with his droid arm, Jek departed on his Jedi Scout Fighter for Dagobah."}, {"tag": "p", "text": "On the way there, he hurled a bolt of lightning at Darth Vader's Imperial Star Destroyer, startling the Sith Lord. Upon landing on Dagobah, Jek's stealth fighter startled the Force ghost of Kenobi. Jek himself was briefly frightened to see Kenobi's Force ghost but quickly recognized his old friend. Yoda was surprised to see that Jek was aging prematurely due to his status as a clone. Under Yoda's instruction, Jek traveled to the city of Mos Eisley to find Luke and his fellow rebel companions. Upon approaching the town, he found Mos Eisley under attack from Imperial forces under Darth Vader."}, {"tag": "p", "text": "After landing, he helped Luke and his companions escape from Jabba the Hutt and several crazed Padawans by using the Force to collapse an arch and erect a LEGO brick wall. However, Vader's AT-AT then caught up with them and blasted Jek to the ground. Before Vader could finish them off, R2-D2 and C-3PO arrived in the Millennium Falcon and damaged Vader's walker, giving Jek and the rebels enough time to flee into hyperspace. Jek also exposed himself to Vader, who then informed the Emperor that Jek was assisting the rebels."}, {"tag": "h4", "text": "Back to Coruscant"}, {"tag": "p", "text": "With the Jedi holocrons back in the hands of the Emperor, the Rebel Alliance hatched a plan to raid the Jedi Temple Holocron Vaults and the Chancellor's Suite on Coruscant. Departing from Kashyyyk, Jek and his rebel and Wookiee allies raided Coruscant. They encountered little opposition because Vader and the Imperial fleet had traveled to the rebel base on Kashyyyk. Jek and Luke led the strike team which raided the Jedi Temple. They were confronted by several of the Emperor's Royal Guards, but Jek managed to electrocute them with his droid arm, winning Luke's admiration."}, {"tag": "p", "text": "While Jek and R2-D2 were inspecting the Holocron Vaults, they found no holocrons. Jek then dispatched another librarian droid with his droid arm. Later, Jek joined the rebels and the Wookiees at the Grand Convocation Chamber, where they demanded that the Emperor relinquish his holocrons. When the Emperor refused, Luke decided to destroy them in order to deny them to the Emperor. At Luke's signal, Jek generated a Force storm with his droid arm which hurled Palpatine and his holocrons through the ceiling. The holocrons were vaporized, effectively denying the Emperor an important weapon against the rebellion. The rebels then returned to Kashyyyk. Though Luke was despondent at having destroyed the holocrons, Jek comforted him by revealing that R2 had managed to save one holocron."}, {"tag": "h4", "text": "Mentoring Luke"}, {"tag": "p", "text": "Following the events on Coruscant, Jek-14 and the rebels relocated to a base on Mustafar. There, Jek helped Luke during a mission to fool Darth Vader into thinking that he had destroyed Luke. After Vader's TIE Advanced fighter shot down Skywalker's decoy X-wing starfighter, Jek picked up R2 in his starfighter and returned to the base. However, this ruse did not fool the Empire for long, as Vader soon received a report that Skywalker's body had not been found in the starfighter."}, {"tag": "p", "text": "Despite the victory, Luke was despondent at not being able to fight Vader and toyed with his precious holocron. However, the holocron's activation was detected by several Imperial probe droids. As a result, the Emperor and Vader sent a fleet to attack Mustafar. Jek and Leia later confronted Luke about the approaching Imperial fleet and deduced that the holocron had led them there. When Luke proposed attacking the Imperial fleet in order to facilitate the rebel fleet's evacuation to Hoth, Jek expressed skepticism until Skywalker told him about a lesson he had learned from his father in the holocron. Despite Jek counselling restraint, the young Jedi was determined to proceed with his plan."}, {"tag": "p", "text": "Jek reluctantly agreed to assist Luke. Flying their starfighters, Jek and Luke led the Emperor's shuttle and Vader's fleet on a wild pursuit through space. This gave enough time for the rebel to evacuate to Hoth. At Luke's instruction, Jek traveled on his starfighter to the rebel rendezvous point in Hoth. Skywalker and R2 then led the Imperial fleet and Vader on a pursuit through an asteroid field that inflicted much damage to the Imperial fleet. Despite his setback, the Emperor and Vader wrongly believed they had defeated Luke and held a victory celebration on their Star Destroyer."}, {"tag": "h3", "text": "Into retirement"}, {"tag": "p", "text": "Having completed his services to Luke and the Rebellion, Jek-14 decided to depart on his scout fighter for his retirement. Luke and the other rebels hosted a farewell party at Echo Base on Hoth. Following the party, Jek departed on his starfighter and bid the rebels \"May the Force be with you.\" Due to his ship's stealth mode, Jek was able to slip past the Imperial fleet into space. However, he accidentally alerted the Empire to his presence when he opened a recorded farewell card where Luke, Leia, and Han Solo hummed the tune of the Star Wars end credits."}, {"tag": "p", "text": "As a result, he was pursued by Darth Vader's TIE Advanced fighter and several TIEs. Jek managed to destroy the pursuing TIEs with his droid army and used the Force to create a giant cricket bat which he used to swat Vader's TIE fighter away. Having escaped the Empire, Jek visited his friend Yoda on Dagobah. There, he told Yoda that he wanted to lead a normal life, and the Jedi Master used the Force to transform his droid arm into a normal one. After that, Jek departed on his stealth fighter to his retirement. The transformation of Jek's arm caused Dagobah's trees and frogs to explode into fireworks."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jek-14 wore an early precursor to the Phase II clone trooper armor and had a droid arm which was capable of transmitting Force energy. While Jek-14 had originally been created by the Sith Lords Darth Sidious and Count Dooku as part of a plot to build an army of Sith-enhanced clone troopers to destroy the Jedi and the Republic, Jek-14 did not share his masters' sentiments and wanted to live alone in peace. While Jek-14 was a capable fighter due to his Force powers, he did not enjoy fighting and instead loved to build \"beautiful things\" like snow figures and structures."}, {"tag": "p", "text": "Jek found himself unable to kill unarmed opponents, a stance that put him at odds with his Sith masters. Rejecting both the Jedi and the Sith, Jek-14 wanted to just be himself and live in peace. His love for \"building things\" including intricate ice sculptures and trees won him the affection of Yoda's Jedi Padawans and later the Ewoks of Endor. Despite his neutral stance, Jek ultimately decided to aid the Jedi in their efforts to defeat the Sith and their Badawans. Jek came to admire the Jedi for standing up for justice, compassion, and righteousness."}, {"tag": "p", "text": "As a friend of the Jedi, he was called upon by Yoda and Obi-Wan Kenobi to assist them in times of need. In combat, he was loyal, courageous, and protective of his Jedi friends. Jek had a warm and protective relationship with the young Jedi Luke Skywalker. He helped Luke and the Rebellion recover the Jedi holocrons from the Emperor. Despite his initial misgivings, he helped Luke destroy the holocrons in order to deny them to the Emperor. He also counselled Luke to be more patient and less reckless at times when the younger rebel wanted to take a more confrontational approach towards the Empire."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Jek-14 was incredibly powerful in the Force. He gained enhanced Force powers when Count Dooku channeled Force energy from an extremely powerful lightsaber crystal into his cloning chamber. Jek-14 was able to fire continuous, powerful bursts of presumably Force energy from his left arm, which was transparent and seemed to be a reservoir of his power. He was agile, performing complex flips with ease and was able to erect a powerful, visible Force barrier to protect himself."}, {"tag": "p", "text": "Jek could use telekinesis effortlessly, with great precision and power, and could create complex and even artful structures with that power. He had various Force powers including firing a ball of Force energy that caused a kinetic blast / shock wave, harnessing and manipulating Force energy, generating Force lightning, and forming a giant sphere of Force energy that gave off heat. In combat, he was also capable of engaging and even defeating seasoned Jedi Masters like Yoda and Mace Windu. During a demonstration on Geonosis, Jek-14 was able to create a dent in the ground that impressed even Darth Sidious. He wielded a blue lightsaber with a white hilt of an unidentified design. On another occasion, he used his droid arm to generate a whirlwind that destroyed Palpatine's stolen Jedi holocrons. Jek could also use Convection, which allowed him to separate Han Solo from C-3PO, whose mouth had gotten stuck on the protocol droid's head after mockingly kissing him."}, {"tag": "p", "text": "In addition to his Force powers, Jek-14 was also a skilled starfighter pilot. During the Clone Wars, he piloted an experimental starfighter. During the time of the Galactic Empire, Jek-14 flew a Jedi Scout Fighter. Despite the awesome powers that his droid arm bestowed on him, Jek desired a normal life the most. As a result, Yoda transformed his left arm into a real Human one, allowing him to fulfill that wish."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jek-14 appears in The Phantom Clone, the first episode of the 2013 LEGO Star Wars: The Yoda Chronicles television special. He appears in the final two Yoda Chronicles as well. Jek-14 was voiced by Brian Dobson. In LEGO Star Wars: The Yoda Chronicles video game, he is buildable as a unit and the player must chase him in a series of missions as well. Jek-14 is released in 2 sets, Jek-14's Stealth Starfighter and the Jedi Scout Fighter. In the second set his helmet and armor are plain white as opposed to both red and white, closer to a stormtrooper instead of the original experimental clone armor. In both sets he carries a blue lightsaber with a white hilt."}, {"tag": "p", "text": "Jek returned in the 2014 LEGO Star Wars: The Yoda Chronicles, starring in Escape from the Jedi Temple and returning as an elderly man in Race for the Holocrons and Raid on Coruscant. He is a member of the Rebel Alliance in \"Clash of the Skywalkers.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}