{"url": "Jek_Tono_Porkins", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Humans", "Category:Males", "Category:Red Squadron personnel", "Category:Tierfon Yellow Aces personnel"], "nodes": [{"tag": "h1", "text": "Jek Tono Porkins"}, {"tag": "p", "text": "Jek Tono Porkins, nicknamed \"Piggy,\" was a male human trader and pilot from Bestine IV. He decided to abandon his homeworld after the Galactic Empire moved in and built a new military base there, and he ended up joining the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Originally a trader on Bestine IV, Jek Porkins began to see the brutality of the Galactic Empire when they decided to build a base upon his homeworld, which uprooted the lives of any inhabits in the path of its construction. As the Empire's authoritarian attitude grew, Porkins left his homeworld. Seeking revenge, he trained to become a pilot in the Starfighter Corps of the Alliance to Restore the Republic."}, {"tag": "h3", "text": "Life as a Rebel pilot"}, {"tag": "p", "text": "After joining the starfighter corps, Porkins was assigned to the Mid Rim planet of Tierfon where he flew many missions with the Tierfon Yellow Aces. However, the Empire eventually caught wind of their activities in the sector and tightened their grip on it, forcing the Rebel Alliance to abandon the Tierfon. After leaving the planet, Porkins was reassigned to the Alliance's main base on Yavin 4 and was placed under the command of General Antoc Merrick As a seasoned rebel pilot, Porkins was known for ritual hazing of new recruits, despite his fellow veterans being generally accomodating."}, {"tag": "h4", "text": "Taking a vacation"}, {"tag": "p", "text": "After a battle near Kashyyyk, Biggs Darklighter suggested to Porkins that they take a vacation on the planet Irff. After twelve days, they became aware that their vacation spot was reserved by an Imperial officer. After learning this information, Porkins and Darklighter went into the officer's room and pretended to have blasters. The officer became frightened and told them that she was just a parent of six. Porkins then apologized and he and Darklighter both left. After they left her room, the officer called security. Eventually, security caught Porkins and Darklighter. They were told to leave the vacation spot or the manager would be called."}, {"tag": "h4", "text": "Battle of Scarif"}, {"tag": "p", "text": "In 0 BBY, Jek Porkins flew an X-wing starfighter as a member of Red Squadron during the Battle of Scarif, going by the callsign Red Six, where he and his squadron were assigned to engage the Star Destroyers and TIE fighters. The battle ended with the theft of the technical readouts for the Death Star, a moon-sized Imperial battlestation."}, {"tag": "h4", "text": "The night before Yavin"}, {"tag": "p", "text": "Just days after returning from Scarif, Porkins dished out drinks for his fellow pilots at Base One on the night before the Battle of Yavin. He once again flew with Red Squadron, again as Red Six, alongside Nozzo Naytaan as the wingmen of Zal Dinnes. He bumped into Biggs Darklighter after the mission briefing, exchanging banter with his fellow pilot that Darklighter considered to be a ritual hazing from the cocky Bestine native."}, {"tag": "h4", "text": "Battle of Yavin"}, {"tag": "p", "text": "Shortly before the battle began, Dreis once again assigned Porkins to fly under the callsign of Red Six. During the battle, Dreis ordered the destruction of one of the Death Star's deflection towers, which Porkins and Darklighter destroyed with their starfighters' laser cannons. Porkins' craft struck debris from the tower and began to malfunction, causing him to drift over the Imperial turbolaser batteries mounted on the surface. Porkins was convinced he could still navigate his fighter, ignoring Darklighter's warnings to extract from the area. Porkins' fighter was caught in turbolaser crossfire and he was killed almost instantly. The officers and pilots around the central command table in the Massassi war room heard Porkins' last words, and Elyhek Rue vowed that he would be avenged. Despite this, another Rebel pilot didn't receive word of his death, and asked if Porkins could see Luke Skywalker's fighter a few minutes after Jek was shot down."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Over three decades later, Porkins was remembered through the Porkins Belly Run, a Resistance flight maneuver named in his honor. Whilst traveling aboard the Millennium Falcon following the Battle of Crait, BB-8 told R2-D2 about the death of the Abednedo pilot Ello Asty, who went by the callsign Red Six. R2 told him that they had lost a Red Six, too, during the Battle of Yavin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Because of his rotund physique, Porkins was playfully nicknamed \"Piggy\" and \"Belly Runner.\""}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "As a rebel pilot, Porkins flew both BTL-A4 Y-wing assault starfighter/bombers[source?] and T-65B X-wing starfighters. He wore an orange flight suit and flight helmet with orange and red markings. His astromech droid was R5-D8."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jek Tono Porkins was played by William Hootkins in the 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}