{"url": "Jekk%27Jekk_Tarr", "categories": ["Category:Legends articles", "Category:Cantinas", "Category:Nar Shaddaa locations"], "nodes": [{"tag": "h1", "text": "Jekk'Jekk Tarr"}, {"tag": "p", "text": "The Jekk'Jekk Tarr was a cantina that was located within the spaceport docks of Nar Shaddaa and circulated cyanogen fumes along with a variety of other pollutants that were lethal to Humans and Nikto, but commonplace for, and often preferred by, many other alien species. Before its establishment as a cantina, it was a ventilation system for passing nagnol gases to the docks. It was designed to be a haven for the more exotic species of the galaxy; its very atmosphere providing a buffer against less desirable company. Instead of serving drinks, the bar served \"nutrient chemicals\" to its clientèle, who paid large sums of credits for the privilege."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The Jekk'Jekk Tarr was divided into five sections, each illuminated with a different light that represented the environment it simulated. Upon entering, a customer would arrive at the infrared chamber, which was a red light. This area was favored by species that could perceive the infrared, such as the Devaronians and Trandoshans. Adjacent to the west of this chamber was the yellow, arid room, designed to simulate the harsh climate of worlds such as Ryloth and Sriluur. Because of this, this chamber was frequently inhabited by Twi'leks and Weequays alike. To the east of the infrared chamber was a green room of particularly toxic gases. A second toxin room lay to the north of this, and both areas were almost entirely used by the insectoid Gand only. It was likely that the gas in these two rooms was ammonia from their home planet Gand. The fifth chamber was non-toxic and contained no harmful fumes even to Humans. It was a private lounge used by the Quarren Exchange crime lord Visquis, and thus it was locked to anybody but Visquis and his servants. In his lounge was the entrance to his secret headquarters, which contained a dimly-illuminated maze with lethal gases and a jamming system to ensure that datapad maps were rendered useless."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Exchange crime lord Visquis would often use the bar for dealings he wanted kept secret from Goto, having discovered accidentally at some point that Goto could not monitor events that happened inside the Jekk'Jekk Tarr. This was because droids did not function properly inside of it. During her time on the moon in 3951 BBY, the Jedi Exile was lured here by Visquis in his attempt to claim the Exchange's outstanding bounty on Jedi. She survived the hostile environment using the Force, harnessing the power of breath control in order to conserve oxygen and to prevent the gases from being inhaled. When Visquis saw that the gas had no effect on her, he commanded the bounty hunters and other bar patrons within to attack her, offering a huge reward to whoever took her down. She was attacked by a Devaronian bartender and a Twi'lek majordomo, among others, before eventually reaching Visquis's private room. During the battle, she convinced the Lunar Shadow captain to go back to his crew before continuing her pursuit through the tunnels below the cantina and into Visquis's lair. Upon returning at a later time, the Exile found that the Jekk'Jekk Tarr had been closed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jekk'Jekk Tarr first appears in the video game Star Wars: Knights of the Old Republic II: The Sith Lords. The cantina and the base below it were originally intended to have been one of the lairs of the secretive bounty hunter guild known as the GenoHaradan. However, this was cut from the final game and the base became the stronghold of Visquis' faction of the Exchange."}, {"tag": "p", "text": "The player can enter the Jekk'Jekk Tarr without a spacesuit before the quest to rescue Mira activates without any consequences to the Exile's health, provided that she is equipped with a gas mask; if this is done, she can contact the Lunar Shadow captain before the bar patrons become hostile. The Exile can also recruit Odis to be the new captain for the Lunar Shadow crew before entering the cantina. Nevertheless, the former captain cannot be killed, and is the only patron to remain neutral during the skirmish."}, {"tag": "p", "text": "Knights of the Old Republic II: The Sith Lords, the only source thus far in which the Jekk'Jekk Tarr appears, misspells the cantina's name once as Jek'Jek Tarr, within the Music list accessible from the game's menu screen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}