{"url": "Jelph_Marrian", "categories": ["Category:Legends articles", "Category:Former Jedi", "Category:Humans", "Category:Jedi Knights of the Jedi Order", "Category:Jedi Shadows", "Category:Kesh residents", "Category:Males", "Category:Members of the Jedi Covenant", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Jelph Marrian"}, {"tag": "p", "text": "Jelph Marrian was a Human male Jedi Knight who served in the Jedi Covenant as a Shadow, an agent whose records of existence had been erased and was notably familiar with the planet Taris. He developed a strong aversion toward the Sith due to his childhood experiences during the Great Sith War, which devastated his homeworld of Toprawa. Due to his strong antipathy toward the Sith, Jelph joined the Jedi Covenant, a secret sect within the Jedi Order that was dedicated to preventing the return of the Sith. Following the dissolution of the Covenant in 3963 BBY, Jelph fled into Wild Space and became stranded on the planet Kesh, a remote world that was ruled by a Sith tribe."}, {"tag": "p", "text": "To avoid detection, Marrian adopted a new persona of a slave and became a horticulturalist on an isolate farm on the banks of the Marisota River. In secret, he worked on repairing his damaged Aurek-class tactical strikefighter so that he could return to the wider galaxy and alert the Jedi and the Galactic Republic to the presence of the Tribe. Through his work, Jelph developed a good reputation for producing high-quality fertilizers and eventually befriended Orielle Kitai, a Sith Saber and the aristocratic daughter of High Lord Candra Kitai. In 3960 BBY, Orielle and her mother were wrongly accused and punished for a failed assassination attempt against the ruling Grand Lord Lillia Venn. As punishment, the Kitais were reduced to the status of slaves."}, {"tag": "p", "text": "Orielle sought refuge and solace with Jelph, who provided with shelter and lodging. During this time, Orielle accidentally discovered his \"secret starfighter\" while he was out hunting for wildlife. Seeing Jelph's starfighter as an opportunity to restore her family's fortunes and status, she traveled to the Tribe's capital of Tahv where she informed her mother and the architect Gadin Badolfa, who had close ties to a few rival High Lords who were opposed to Grand Lord Venn. Upon learning that Orielle had uncovered his secret, Jelph followed her to Tahv and confronted her at the city's waterworks. Following a brief scuffle in which Jelph gained the upper hand, he admitted his Jedi background to Orielle and managed to convince her to abandon her Sith ambitions for power and domination. Marrian also expressed his feelings for Orielle which she reciprocated."}, {"tag": "p", "text": "After Orielle acknowledged that she had informed the Tribe of Marrian's secret, the two returned to Marrian's farm on an uvak, a winged reptilian beast native to Kesh. However, they were pursued by the Grand Lord Lillia Venn and her followers. They managed to reach the farm where Jelph managed to slip away while Orielle confronted the newcomers in an attempt to make them leave by claiming her secret had been four blasters, a technology unknown to the Tribe. Despite her efforts, Venn and her followers were able to locate Jelph's starfighter. However, Jelph had prepared for the event that his secret starfighter was discovered and attacked Venn's entourage with the blasters. After killing several Sith, he and Orielle managed to escape into the Marisota river. Meanwhile, Venn was killed when the starfighter exploded since Jelph had rigged it with explosives in the event it was stolen."}, {"tag": "p", "text": "Following the \"Night of the Upside-Down Meteor\", Jelph and Orielle hid in the jungle highlands of Keshtah Minor, the continent that was the Tribe's domain. The couple also severed their ties with the Jedi and Sith respectively. Jelph came to that decision after intercepting transmissions which showed that the Jedi Order had descended into a civil war. As a symbolic gesture of severing his former ties, Marrian destroyed his transmitter, the last remaining relic of his offworld origins, with the help of Orielle. They then built a home deep in the jungles of Keshtah and produced three children."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi career"}, {"tag": "p", "text": "After the end of the Great Sith War—a war fought between the Galactic Republic and the Sith—in 3996 BBY, the male Human Jelph Marrian was born on Toprawa. His mother had told him stories about the war. She later abandoned him one morning, and was found by Krynda Draay. Upon seeing the devastation the Sith had brought to his homeworld, he devoted his life to preventing the Sith from returning. He became a Knight of the Jedi Order but was dismissed after alienating the Jedi Council. In 3967 BBY, Marrian joined a splinter faction of the Order, the Jedi Covenant, which worked toward preventing the return of the Sith. For four years, Marrian worked as a Covenant Shadow and gained a particular knowledge of the planet Taris."}, {"tag": "h3", "text": "Stranded on a Sith World"}, {"tag": "p", "text": "However, in 3963 BBY, the Human learned of the dissolution of the Covenant while on an assignment in a remote region of the galaxy. Afraid that his status within the Jedi Order was in doubt, Marrian fled to the Unknown Regions in his Aurek-class tactical strikefighter. Arriving at the planet Kesh, the former Covenant Shadow's spacecraft was caught in one of the planet's heavy meteor showers and crashed in a remote jungle on the planet. Marrian would learn that Kesh was ruled by the Lost Tribe of Sith, a group of stranded Human Sith who had settled on the planet during the Great Hyperspace War in 5000 BBY. The Tribe had also subjugated the native Keshiri, a purple-skinned humanoid species who had been reduced to the status of serfs. Despite the privileged status of the Sith Tribe, the planet was also home to a significant Human slave population who consisted predominantly of outcasts from the Tribe."}, {"tag": "p", "text": "As the planet's unusual magnetic field made a distress call impossible, Marrian headed to a nearby settlement that he had spotted earlier. Marrian assumed the persona of a slave and eventually ended up working as a horticulturist on an isolated smallholding by the banks of the Marisota River, from which he took the name of \"Jelph of Marisota\". He produced fertilized soil from Kesh's black mud, mixed with uvak manure and clay from the river, and would trade it with gardeners of the native Keshiri inhabitants. Aside from the fertilizer, Marrian also cultivated dalsa flowers on hejarbo-shoot trellises behind his house. Besides working as a horticulturist during the day, Marrian also spent the night repairing his damaged Aurek starfighter. He dismantled it and had it painstakingly brought piece by piece to his homestead. Marrian hid the starfighter beneath a heap of dung in a former uvak stable. By 3960 BBY, he had succeeded in reassembling the starfighter except for its communications console. As a safety precaution against discovery, Marrian also rigged the starfighter to two proton torpedoes and thousands of kilograms of ammonium-nitrate explosives. This rudimentary anti-theft system was designed to kill the intruder and to destroy all trace of the vessel."}, {"tag": "p", "text": "Despite his historic animosity toward the Sith, Marrian would ironically develop a romantic relationship with a Sith woman named Orielle Kitai, the daughter of High Lord Candra Kitai and a Sith Saber. Orielle had discovered Marrian after stalking a Keshiri florist whom she suspected had lied about the origins of his stock. The Sith woman had been purchasing flowers for Donellan's Day, a holiday which commemorated Donellan, the son of Grand Lord Nida Korsin who never ascended to the throne since his mother had outlived him. Orielle and her mother Candra needed these flowers to decorate their booth at the arena Korsinata during the rake-riding games. The florist met with Marrian to collect some of the horticulturist's fertilizer, a transaction that Kitai oversaw and that led her to Marrian."}, {"tag": "p", "text": "Over the next eight months, the Saber visited Marrian many times to collect flowers for various occasions and, on these visits, built a rapport with the slave. Despite their social and ideological differences, Marrian developed a warm friendship with the Sith woman. On the day before Donellan's Day, Kitai paid another visit to Marrian to collect dalsa flowers. After the pair discussed the history of Donellan's Day while Marrian had been gathering the flowers, the slave presented Kitai with a gift of a yoke mated to a saddle for an uvak beast of burden. Marrian placed the saddle onto Kitai's uvak and then the flowers into the yoke. Laden with flowers, Kitai bid farewell to Marrian and departed."}, {"tag": "h3", "text": "A Comforter and Counselor"}, {"tag": "p", "text": "Jelph and Ori's lives would become intertwined after an unexpected development completely changed the course of Ori's life. During that year's Donellan's Day, Ori and Candra had sponsored a certain rake-rider by the name of Campion Dey. Rake-riding was a violent blood sport which pitted rival uvaks, which had their wing muscles severed at birth. Unknown to his sponsors, Dey had plans to assassinate the reigning Grand Lord Lillia Venn, who had recently been elected from among the seven High Lords the previous year. Ultimately, Dey's assassination attempt failed and he was captured by the Sith authorities. Due to their connections with Dey, Candra and her family were accused of staging the assassination attempt. As punishment, Grand Lord Venn ordered that the Kitai family be reduced to the status of slaves and stripped of all their possessions and titles. Consequently, Ori lost her status as a Sith Saber while her mother was forced to shove uvak manure at the capital Tahv's zoo."}, {"tag": "p", "text": "With her life in ruins, Ori turned to her best friend Jelph for comfort and support. After two days, Ori was able to share with Marrian about the events had which led to a family's downfall. Marrian was initially hesitant to give her shelter and lodging since he had to hide Ori's uvak Shyn. Since slaves and Keshiri were banned from owning the winged reptilian steeds, this was a potential source of trouble. In the end, Jelph managed to hid Shyn inside his composting barn which had previously been a stable. During this period of grief, Marrian looked after Ori by providing her with cool river water and wash rags for her ablutions. While conversing with Ori, Jelph learnt about the complexities and subtleties of the Tribe's politics. As a Jedi, Marrian was aghast at the back-stabbing nature of the Tribe's ruling elite but was careful to hide any hints of his offworld origins."}, {"tag": "p", "text": "While Ori was determined to go back and restore her family's name, Jelph advised her against it since he suspected that the Grand Lord had a role behind her own assassination attempt and was using it to frame the Kitai family. He speculated that since Ori's mother Candra was the key to selecting Venn's replacement, the Grand Lord had wanted her out of the way. Marrian argued that if the Grand Lord did not staged her own assassination attempt and really suspected her mother, she would have ordered her family's execution. Jelph reasoned that the Grand Lord had spared her family's lives so that it could make a public example of her rivals. He also advised Ori not to thwart Lillia Venn as long as she could sense that her mother was not suffering. Ori initially disbelieved Marrian's arguments but quickly realized that they made sense. She then allowed him to help her back up when she lost her footing near the riverbank."}, {"tag": "p", "text": "During Ori's time at his farm, Jelph noticed some subtle changes in her character. While he had earlier recalled that the Sith woman had been proud, arrogant and self-indulgent prior to the recent events, he noted that Ori was actually tentative and unsure. She also grieved the loss of her former privileged status. He also pondered whether Ori had showed signs of humility, an attribute unknown to the Sith. He sensed that her anger was fueled by injustice rather than a lust for violence. As Ori recovered, Marrian allowed her to walk around the farm and to look after some of his traps."}, {"tag": "h3", "text": "Secrets Uncovered"}, {"tag": "p", "text": "The following day, an unexpected twist challenged the strength of Jelph's friendship with Ori. At daybreak, the former Jedi had departed into the forest to hunt animals and collect herbs for his fertilizer business. Marrian needed to collect ingredients to make fertilizers for the autumn growing season. Unwilling to be left alone, Ori had thrown a tantrum but was unable to deter Jelph from traveling upstream into the jungle highlands in his raft. Marrian assigned Ori with the task of checking the traps for wild animals."}, {"tag": "p", "text": "That same day, Flen and Sawj Luzo, two of Ori's former Sith Saber colleagues and rivals, arrived at Jelph's farm. Through Keshiri traders, the pair had learnt that Ori was hiding with her friend Marrian in the jungle. They quickly killed Ori's uvak on the pretext that slaves were not allowed to own uvaks, a tradition which had lasted since 4975 BBY. The Luzo brothers also revealed that Candra had confessed under duress to plotting against the Grand Lord with Dernas and Pallima, the leaders of the Red and Gold Factions. These two former High Lords had been executed for their role in the plot. To torment her further, the brothers presented Ori with a spade to mark her status as a slave and also confiscated her lightsaber before departing."}, {"tag": "p", "text": "Humiliated, Ori descended into a fit of rage and used the spade to destroy several of Jelph's properties. She destroyed Marrian's dalsa trellises, hejarbo-shoot wreckage, and his wooden cart. While attempting to destroy the mound of manure in the composting barn, Ori discovered Jelph's Aurek-class strikefighter. She quickly saw the opportunity to use this discovery to regain her family's lost social standing. For millennia, the Tribe had sought to return to the stars but lacked any hyperspace-capable starships. The Omen, the ancient Sith starship which had brought the Tribe's ancestors to Kesh, no longer functioned due to a lack of spare parts and metals on Kesh. She resolved to return to Tahv and inform her mother of this discovery."}, {"tag": "p", "text": "Meanwhile, Marrian returned to his farm but was too late to stop Ori. Over the past days of turbulence and tranquility, the Jedi had sensed that something was about to happen. He sensed Ori discovering his secret spaceship. Based on the multiple footprints, Jelph knew others had visited the farm and feared that other Sith had discovered his secret. Fearing that the Tribe would pose a danger to the galaxy if they rediscovered hyperspace travel, Marrian resolved to pursue Ori and stop her before she could reveal the starship's existence to her Sith compatriots. Jelph also brought his blue lightsaber along in case he encountered any hostiles."}, {"tag": "p", "text": "Marrian traveled to Tahv, the capital of the Sith Tribe on Kesh. He reasoned that Ori had planned to reveal the existence of the starship in order to regain her lost social standing. After running for an entire day, he stopped by a bar owned by a Keshiri bartender. To cope with his stress and anxiety, Jelph ordered a mug of sweetwater . The bartender was warm and sympathetic to the tired Human slave. The Keshiri were able to interact more easily with Human slaves like him than with their Sith overlords. While having a meal, Marrian contemplated on his early Jedi career and his experiences as a Jedi Shadow. While the Aurek starship was almost ready to leave, he had yet to install the ship's communications console, a process which would have taken another week. He also speculated over the reasons why Ori had left."}, {"tag": "p", "text": "The Keshiri bartender sensed that Jelph was upset and uneasy. He specially catered to serve for the poor underclass and queried whether Marrian was unhappy about his meals. Jelph explained that it was about a woman. The bartender advised the Human man that anything could happen if he let a woman into his life. Marrian concurred and clarified that this was what he was afraid. Shortly later, Jelph left the bar to continue his journey to Tahv."}, {"tag": "h3", "text": "A Lovers' Quarrel"}, {"tag": "p", "text": "That evening, Marrian arrived at Tahv, the capital of the Tribe. He was uncomfortable with the strong presence of the dark side in that city. He overheard an elderly Sith man violently castigating his Keshiri slave. Opposite, he also eavesdropped on a Sith couple plotting the deaths of their neighbors. While reading through the minds of a passing sentry, Jelph was greatly disturbed by the man's malevolent thoughts and memories. Jelph attempted to shut out these psychic impressions with his Force powers but this was impossible since the various Sith broadcast their feelings frequently."}, {"tag": "p", "text": "Still, Jelph was determined to find Ori and to put a stop to her plans. He reasoned that she was not as dominated by the dark side as her Sith compatriots. He contended that she was proud and indignant rather than venal and hateful. After much difficulty, Marrian recalled that Ori's favorite stomping ground was the city's aqueduct system which towered over most of its buildings. He used a pillar to scale the structure and was careful to stay in the darkness to avoid being detected by pedestrians."}, {"tag": "p", "text": "Jelph proved to be correct and he quickly encountered Ori who used the Force to knock him into the canal. However, the Jedi fought back with his Force powers and lightsaber. After finding Ori in the aqueduct's flume, he acknowledged that he was the owner of the starship and that he was also a Jedi. Ori was initially angry to see him and blamed him for the misfortunes that had befallen her. She was angry with him for withholding his offworld origins from her. Marrian admitted his plans to return to the stars. By then, Ori had already informed her mother about the existence of Jelph's starship. At her mother's suggestion, Ori had also informed the architect Gadin Badolfa, who had close ties to members of the Red and Gold factions. Marrian attempted to reason with Ori by telling her that she was not power-hungry by nature unlike the other Sith. Ori angrily retorted that she had not been herself and had succumbed to defeat."}, {"tag": "p", "text": "Jelph replied that he personally liked her for her good attributes. Ori tried to deny these attributes by stressing her Sith identity and her Tribe's ambitions of returning to the stars. Jelph countered by claiming that there were no more Sith in the wider galaxy. When Ori counter-argued that Marrian's ship was a military starfighter, he acknowledged that a Sith known as Exar Kun had triggered the Great Sith War but that he and his followers had been eradicated by the Jedi. Jelph emphasized that the Tribe was the only remaining Sith community in the entire galaxy. He asked her to feel his thoughts and to sense that he was telling the truth."}, {"tag": "p", "text": "When Ori vowed that her people would fight against the Jedi, Jelph responded that the Jedi were out looking for him and that they would also eventually discover the Tribe. Marrian reasoned that as long as his former colleague Jedi Master Lucien Draay was still alive, someone in the Jedi Order would be looking for the Sith. Unable to counter Marrian's arguments, Ori asked what she could do if she could not save her family or her people. Marrian replied that Ori should decide to choose her own course. Ori also commented that the two of them would never be able to trust each other after that night."}, {"tag": "p", "text": "Ori also sensed that Jelph had feelings for her. She sensed that he felt she was beautiful, desirable and trustworthy. However, she also sensed that Marrian was scrutinizing her every word in an attempt to trap her because she was as Sith. Jelph acknowledged his feelings for her. Ori expressed her discomfort and claimed that she was not able to live up to his expectations since she did not want to be weak and live a simple life. Jelph consoled Ori by telling her that she could be strong but that she did not need to rule the galaxy. When Ori replied that it was part of the Tribe's identity, Jelph countered that the Tribe was built on a lie since everyone was fighting for power, something that only one person could have. He reasoned that this was the primary reason why Sith philosophy was flawed and was doomed to failure."}, {"tag": "p", "text": "Ori then admitted she had contacted several rival High Lords and told them that she had discovered something that would interest them. She told them to meet her at Jelph's farm but conceded that she did not reveal the existence of the starship to them. These High Lords were supposed to meet Ori at Jelph's farm the next day at sunset. Having reached an agreement that they had to hide the existence of the starship from the other Sith, Ori and Marrian lured an uvak rider into the aqueduct with Marrian's lightsaber. After overpowering the Sith rider, they flew the uvak back to Jelph's farm."}, {"tag": "h3", "text": "A Climatic Showdown"}, {"tag": "p", "text": "Marrian and Ori's uvak managed to tap into the jet stream above Kesh's atmosphere, allowing them to increase their speed. During their journey, Marrian and Ori agreed to give the High Lords a sack containing four functioning blasters instead of Marrian's starfighter. Ori would claim that she had found these blasters in a grave somewhere. Since more than a millennium had past, the Sith Tribe had exhausted all their remaining weapons that had come aboard the Omen. Since the Sith lacked access to such technology, it would give any faction an upper hand over its rivals. Jelph was concerned that the uvak was not able to travel as fast carrying two passengers. The couple was then pursued by three other uvaks who were led by a lone rider."}, {"tag": "p", "text": "However, Marrian and Ori managed to arrive at the farm before their pursuers arrived. Jelph quietly slipped off the uvak and hid out off sight before touching down on the farm. Shortly later, Ori found Marrian's bag of blasters beneath the mixing trough and brought them toward the visitors, hoping to buy her mother's redemption and to make them leave. However, these visitors turned out not to be the High Lords but consisted of the Grand Lord Lillia Venn and her entourage, which included four Sith Sabers and the two Luzo brothers. These Sith brothers had recently been promoted as High Lords to replace Dernas and Pallima, who had been executed following the failed assassination attempt against Lillia Venn."}, {"tag": "p", "text": "Ori was quickly taken prisoner by four of Lillia's bodyguards. The Luzo brothers then opened the door of the barn which revealed the excavated Jedi starship. Lord Venn revealed that Ori's mother Candra had secretly made a deal with the Grand Lord to alert her to Ori's planned meeting in exchange for improved working conditions. Candra did not believe that her daughter's discovery actually existed and did not think that the other High Lords would be interested. In fact, none of the other Grand Lords had arrived at the meeting. Venn was jubilant that she had discovered a way for the Tribe to reach the stars and create an interstellar empire."}, {"tag": "p", "text": "Unknown to the other visitors, Marrian had managed to use the Force to levitate the sack of blasters toward him. Ori witnessed this and heard Jelph's telepathic call but did not inform the others. At the right moment, she fell down to the ground and surprised her captors. This distraction gave Jelph enough time to emerge from the farmhouse and open fire on Venn's entourage. The Sith Sabers were unfamiliar with blaster technology and a few were struck down. The remainder attempted to use their lightsabers to deflect the blaster bolts. Ori took advantage of the chaos to break free and steal one of her captors' lightsabers. Meanwhile, Venn entered the Aurek starfighter's cockpit while the Luzo brothers guarded the barn's doorway."}, {"tag": "p", "text": "Jelph quickly arrived and helped Ori out of the skirmish while firing upon the Luzo brothers and the other Sith guards. Without explaining his plans, Marrian grabbed Ori and pushed her into the Marisota River. Marrian then jumped into the waters after her. Shortly later, the Aurek starfighter and the barn exploded; killing the Grand Lord, the Luzo brothers, and the remaining Sith Saber. Unknown to both Ori and the Sith visitors, Marrian had already rigged the starfighter with explosives. He had already buried thousands of kilograms of volatile ammonium-nitrate explosives beneath the starfighter as a fail-safe in the event that the Aurek starfighter was discovered. The ensuing explosion also leveled the surrounding riverbank and wiped out all evidence of the farm and its occupants. While Jelph had prevented a Sith tribe from returning to the galaxy, he also destroyed his only known means of transportation offworld."}, {"tag": "h3", "text": "New Beginnings"}, {"tag": "p", "text": "Following the destruction of the Jedi starship and the Sith visitors, Jelph and Ori escaped deep into the jungle highlands of Keshtah Minor where they started a new life. The death of Grand Lord Venn would be remembered as the \"Night of the Upside-Down Meteor\" by later generations of Sith and Keshiri. It ushered in over nine centuries of civil war and unrest known as \"the Time of the Rot.\" Prior to their departure, the couple returned to the site at night to check that all traces of the farm and its occupants were destroyed. The entire riverbank had collapsed into the Marisota River and the only evidence of Jelph's former farm was a weed-covered path terminating at the river's edge. Having confirmed that all traces of their secret were destroyed, the two Humans returned to the jungle."}, {"tag": "p", "text": "After eight weeks of traveling through the dense foliage, Marrian and Ori built a hut on a dry lump in the middle of a ticket of hejarbo shoots. Both Humans also turned their backs on their past and dedicated themselves to building a new life in the wilderness. Everyday, Jelph would awake at dawn to trap local wildlife for breakfast and to gather fruits later in the day. Due to its warm climate, the jungle provided sustenance all year round. Marrian would then spend the rest of the day building their shelter before retiring at dusk to fiddle with his transmitter, the last remaining relic of his offworld existence. Jelph had brought the transmitter with him during their journey into the wilderness in the hope that he could one day make contact with a passing starship and return to the galaxy so that he could alert them to the presence of the Tribe."}, {"tag": "p", "text": "While Marrian was unable to send out transmissions due to the shifting magnetic field around Kesh, he was still able to intercept signals from the ether and record them for later playback. Jelph decided never to return to the wider galaxy after intercepting a signal which indicated that a civil war had broken out among the Jedi. Marrian related to Ori that he had been part of a Jedi faction which had tried to prevent the re-emergence of the Sith. The signal also contained a message from a Republic admiral who warned that the Jedi could no longer be trusted. The ancient compact between the Republic and Jedi had also ended. Marrian faulted the Covenant for dividing the Jedi Order into rival sects."}, {"tag": "p", "text": "With the Jedi divided and at war with each, Marrian felt that he had lost his sense of purpose and duty. As a member of the Jedi Covenant, he had committed himself to protecting the galaxy. Sensing his plight, Ori urged Jelph to look after himself and their family for the rest of her life. She explained that in Sith philosophy, the Sith were taught to be self-centered and to believe that nothing else but themselves mattered. Since the Sith had cast her out and the Jedi had cast Marrian out, she reasoned that neither side deserved their help. After some reflecting, Marrian agreed with Ori's advice and agreed to do something he considered \"selfish\" for the first time in life: looking after himself and Ori along with their future children. In the end, Marrian agreed to destroy the transmitter in order to break his last remaining ties with the Jedi and the wider galaxy. They threw the transmitter into a nearby river where it hit a rock and shattered into pieces."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Jelph and Ori eventually produced three children and lived out the rest of their lives in the jungle highlands of Keshtah. They later presumably succumbed to old age and died. Millennia later, Jelph and Ori appeared in a Force vision to Quarra Thayn, an Alanciari Keshiri woman who was at the time guiding the High Lord Edell Vrai across the continent of Alanciar, so that he could infiltrate the Alanciari capital Sus'mintri on behalf of the Tribe. In the vision, Marrian was seen working on a small plot with a hoe while his wife conversed with Quarra. Ori encouraged Quarra to come to terms with the Sith invasion and warned her about the dangers of \"living within a dream.\" Convinced of the inevitable Sith take-over and intrigued by Ori and Jelph's peaceful life in the jungle, Quarra decided to remain loyal to her family rather than becoming the consort of Edell Vrai after the Sith have occupied Alanciar."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jelph Marrian had blonde hair and had a long ruddy scar which ran from his right cheek down to his neck. Since his childhood, Jelph Marrian had maintained a strong antipathy toward the Sith, which dated back to his wartime experiences as a child on his homeworld of Toprawa during the Great Sith War. This anti-Sith sentiment motivated Marrian to join the Jedi Order where he eventually ended up in the Jedi Covenant, a secret faction that was dedicated to preventing the return of the Sith. During his visit to the Sith Tribe's capital of Tahv, Marrian was tormented by the psychic feelings of hate and anger that were generated by the local Sith inhabitants. He also believed that adherents of the Sith Code were doomed to failure because everyone was fighting over something that only one person could have."}, {"tag": "p", "text": "During his time on the planet Kesh, Jelph Marrian was able to exude a gentle and simple demeanor which enabled him to hide his true Jedi identity. This enabled him to develop a close and warm friendship with Orielle, who became his wife and the mother of his children. Whenever he was asked about his ancestry, Marrian would not provide a straight answer but would instead feign ignorance of his ancestry. Despite his appearances to be an impoverished slave, Jelph was better educated and had more refined manners than his contemporaries. He became an informal mentor to his friend Orielle Kitai, who came to value his insight and astuteness. Due to his assumed identity as a human slave, Marrian was also comfortable mixing with the native Keshiri, who served mainly as serfs to the Sith."}, {"tag": "p", "text": "However, in spite of his antipathy toward the Sith, Marrian came to develop feelings and ultimately fell in love with the Sith Saber Orielle Kitai, who would otherwise have been his opponent under different circumstances. He was able to empathize with her grief and humility following the disenfranchisement and enslavement of her family, who had been framed for a failed assassination attempt on the reigning Grand Lord Lillia Venn. Marrian recognized that while Orielle was capable of arrogance and had a violent temper, she was not venal and hateful unlike many of her Sith compatriots. Ultimately, Jelph was able to regain her love and friendship by convincing the Sith woman that she could be strong without having to be powerful. As a husband and father, Jelph was a loving and caring family man who looked after his spouse and his three children."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a member of the Jedi Order, Jelph Marrian was Force-sensitive and was also well skilled in lightsaber combat. He was also trained to fly an Aurek-class tactical strikefighter. In addition, Marrian was also well versed in the chemistry of fertilizer, which enabled him to become a horticulturalist that specialized in selling ammonium-phosphate fertilizers to Keshiri peasants. He was also skilled at tinkering with machinery, which enabled him to dismantle and then painstakingly assemble his starfighter, which he intended to use to return to the Galactic Republic. He was also savvy enough to construct an ingenious anti-system consisting of proton torpedoes and ammonium-nitrate explosives in the event that the Sith discovered his starfighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jelph Marrian was first mentioned in the twenty-seventh issue of the Knights of the Old Republic comic book series, published in 2008 and written by John Jackson Miller. His first appearance came two years later as one of the main characters of the eBook, Lost Tribe of the Sith: Purgatory, also written by Miller. He also appeared in its sequel Lost Tribe of the Sith: Sentinel, which was released in 2011. He also made a brief cameo appearance in Lost Tribe of the Sith: Pandemonium, the last story of the Lost Tribe of the Sith series, which was included in the 2012 mass paperback Star Wars: Lost Tribe of the Sith: The Collected Stories."}, {"tag": "p", "text": "On his personal website at Faraway Press, Miller explained that he wanted to use the Jelph connection to give readers a Jedi's perspective of Sith society. In addition, the author made Marrian part of the Jedi Covenant, an organization that was obsessed with watching for the Sith to prevent a repeat of the Great Sith War. Miller also intended to use Marrian to link the Lost Tribe of the Sith series with another one of his comic franchises Knights of the Old Republic, which ran from 2005 to 2010. Miller also clarified that Purgatory occurs after the events of Star Wars: Knights of the Old Republic: Vindication. Miller also mentioned that he intended to use Marrian's expertise with the chemistry of fertilizer to send a signal to readers that he was not the farmer that he appeared to be. The author also reasoned that the Tribe had a poor knowledge of chemistry. Finally, Miller also pointed out that there is a possibility that a younger version of Jelph could be seen in a computer shot, next to Celeste Morne in Star Wars: Knights of the Old Republic 25."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}