{"url": "Jeng_Droga", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Emperor's Hands", "Category:Humans", "Category:Males", "Category:Second Imperium individuals"], "nodes": [{"tag": "h1", "text": "Jeng Droga"}, {"tag": "p", "text": "Jeng Droga was an Emperor's Hand who served Emperor Palpatine during the Galactic Civil War. A Jar'Kai practitioner, he was fanatically loyal and dedicated to his master, with whom he shared a psychic link. Droga, who captained the Emperor's Shadow, oversaw the other Emperor's Hands and accompanied Palpatine on any hazardous missions. On several occasions, he was able to save Palpatine's life—first, when Palpatine was attacked by the specters of long-dead Sith Lords on Korriban, and secondly on Kaal, when the Emperor's spirit journeyed from Endor and bonded with Droga. The Emperor's Hand carried Palpatine's essence inside him all the way to Byss, where Sate Pestage was able to extract the Emperor's spirit from Droga."}, {"tag": "p", "text": "When Palpatine struck at the New Republic in 10 ABY, his clone bodies suffered sabotage and destruction from various sources. Inhabiting his final clone body, the Emperor soon learned that the body's cell structure was deteriorating due to further sabotage, and that it would soon expire. Faced with the prospect of having no body to possess, Palpatine planned to inhabit the infant Anakin Solo, the grandson of Anakin Skywalker. Droga strongly cautioned against the plan, and he was proven right when Palpatine died his final death at the hands of Empatojayos Brand. Driven to insanity by the loss of his master, Droga's hope of a returned Palpatine was rekindled by the Second Imperium, which appeared to be headed by the Emperor. He soon realized that the Second Imperium's Palpatine was little more than a scam, and he found himself left with no cause to fight for. Droga was eventually struck down by Jedi Knight Kyle Katarn."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Emperor's Hand"}, {"tag": "p", "text": "The most loyal of Emperor Palpatine's servants, Jeng Droga was a Force-sensitive Human who served the Galactic Empire as an Emperor's Hand during the Imperial Period. He had lived an erratic life, and had poured his energies and emotions into mastering the art of the lightsaber. In particular, he was a practitioner of the Jar'Kai form, which allowed him to wield his two lightsabers, one red-hued and one yellow-hued, in each hand. He and Palpatine were bonded through a psychic link—a link that the Emperor would frequently use to his advantage. Droga was tasked with supervising his fellow Hands and with guarding Palpatine's personal yacht, the Emperor's Shadow, of which he was also captain."}, {"tag": "p", "text": "When Palpatine had clones of himself created, he had Droga accompany him to Byss, where the duplicate bodies were developed. The Emperor's Hand also traveled with his master to the Sith world of Korriban, home to the tombs of long-dead Sith Lords. In 0 ABY, Palpatine demanded knowledge of the dark side from the entombed and mummified Sith Lords, sparking their rage. They cowed the Emperor, prompting Droga to rush to Palpatine's rescue. He returned his master to Imperial Center, before journeying to Byss to retrieve one of Palpatine's clones."}, {"tag": "h3", "text": "Savior"}, {"tag": "p", "text": "In 4 ABY, Droga was sent to the Yushan sector, where he was to await his master's instructions, while Palpatine himself oversaw construction of the Death Star II at Endor. During the pivotal battle that took place there, the Emperor died his first death at the hands of his apprentice, Lord Vader. When Droga reached the Yushan sector, he felt his master's death through the Force. At that moment, aboard the Emperor's Shadow, Droga's body wrenched in pain, and he began screaming. He then fell into a state of insanity, crushing the windpipe of one of his crew members before taking his dual lightsabers to the rest of his subordinates. In his rampage, he smashed the bridge controls of the Emperor's Shadow, causing the ship to plummet into one of the oceans of Kaal. Palpatine's spirit, which had survived Endor, journeyed all the way to Kaal and entered Droga's body. Now infused with Palpatine's tremendous dark energy, Droga was driven to madness. In time, Grand Vizier Sate Pestage was able to extract Palpatine's essence from Droga's body, allowing the Emperor to inhabit one of his clone bodies. For the second time, the Emperor's Hand had been able to save his master's life."}, {"tag": "p", "text": "While others, such as Pestage, Imperial Intelligence Director Ysanne Isard, Trioculus, and Grand Admiral Thrawn, attempted to unify the Empire in the wake of Palpatine's first death, the Emperor himself lay in wait on Byss. In 10 ABY, he chose to strike, sending his united Imperial forces against the New Republic. Over the next year, he would do battle with Jedi Knight Luke Skywalker and his sister Leia Organa Solo, and would perish multiple times. Following the destruction of the dreadnought Eclipse, the remainder of Palpatine's spare clone bodies were destroyed by Nefta and Sa-Di, Dark Side Adepts who were planning to take Palpatine's place as ruler of the galaxy. The Emperor had been able to transfer his consciousness to one last clone body, but that body had been subject to sabotage in the form of genetic damage."}, {"tag": "p", "text": "In need of a new body as his current one was rapidly deteriorating, Palpatine planned to transfer his essence to the infant Anakin Solo, a direct descendant of Anakin Skywalker, the Chosen One of Jedi lore. In 11 ABY, Droga accompanied him aboard the Star Dreadnought Eclipse II and cautioned against his master's trip to Onderon, where Solo was in hiding. Droga suggested that he and the rest of Palpatine's servants journey to the planet to retrieve the child, but the Emperor paid Droga no heed. Still, a vision of his master in peril haunted Droga, and he rushed to Onderon to once again come to the aid of Palpatine. He found that he was too late, and that his master had died his final death—the Emperor's spirit had been bound to that of the dying Jedi Empatojayos Brand and subsequently dragged into the Netherworld of the Force. Droga let out a mental scream that echoed through the Force for days. Feeling personally responsible for the demise of Palpatine, Droga journeyed to Kaal, where Palpatine's spirit had possessed him. There, he waited for his master to return once more."}, {"tag": "h3", "text": "Berserker"}, {"tag": "p", "text": "In 23 ABY Droga placed a bounty on the head of fellow Emperor's Hand Sarcev Quest, who had been involved in the sabotage of Palpatine's extra clone bodies. At the same time, he dispatched darksiders to find and capture Quest. The 100,000-credit bounty went to Ailyn Vel, who was disguised as her father, Boba Fett. Droga subsequently executed Quest."}, {"tag": "p", "text": "That same year, twelve years after what was apparently Palpatine's last demise, the Emperor seemed to return from the dead yet again to head the Second Imperium. With the intent of joining his master once more, Droga participated in the Third Battle of Yavin, where he fought against Luke Skywalker's New Jedi Order. During the battle, however, he realized that his master had not returned and that the Palpatine of the Second Imperium was but a scam. With nothing left to lose, Droga entered into a berserk fury, furiously doing battle with the Jedi. Subsequently, Droga was struck down by Jedi Battlemaster Kyle Katarn. In 40 ABY, he would be written about in passing by Jedi historian Tionne Solusar."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Droga was a fanatical being, fiercely dedicated and loyal to his Emperor. He was genuinely devoted to Palpatine, as an apprentice would their master, and was generally a somber being. Droga was an introspective man as well, but his experiences amplified his emotions. He kept himself in solitude and dedicated himself to mastering the art of lightsaber combat. When harm befell Palpatine, Droga would generally react violently, falling into madness and utter insanity. When he had nothing left to lose, he became a berserker and a dangerous adversary in combat. Droga felt that it was his personal responsibility to ensure his master's safety and survival, and was devastated when Palpatine finally perished on Onderon."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Jeng Droga was adept at a number of Force powers, including battlemind, telekinesis, telepathy, affect mind, and Force rage."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jeng Droga first appeared in the introduction of the article The Kaal Connection, written by Peter M. Schweighofer and Timothy Zahn, and published in 1995's Star Wars Adventure Journal 7. The article The Emperor's Pawns, published in 2001's Star Wars Gamer 5 and written by Abel G. Peña and Juan Schwartz, greatly expanded upon the character and featured artwork of Droga by Joe Corroney. Corroney's depiction was in turn based on a previously unidentified character from Tom Veitch's Empire's End 2, which had originally been published shortly after the Star Wars Adventure Journal. The image, as well as the accompanying text, retroactively consolidated the unidentified character from Empire's End and Droga. The character was briefly used by Peña again in The Dark Forces Saga and The History of the Mandalorians, and was mentioned in Ryder Windham's Jedi vs. Sith: The Essential Guide to the Force."}, {"tag": "p", "text": "The Kaal Connection RPG adventures offers an optional adventure hook where the player characters look for (and find) Droga's remains in Kaal. As Droga's survival to his emergency landing in Kaal became canon in later sources, placing this hook out of continuity."}, {"tag": "p", "text": "Droga is completely absent from the Empire's End audio drama and his role is instead given to the Dark Side Adept T'iaz."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}