{"url": "Jenn_Devaad", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Pilots", "Category:Republic Navy captains"], "nodes": [{"tag": "h1", "text": "Jenn Devaad"}, {"tag": "p", "text": "Jenn Devaad was a young female Human who was the captain of Devil Squadron, a starfighter formation attached to the Galactic Republic's Grace Command during the Republic Dark Age. She served in the Republic Navy and was part of a group of Republic military personnel who survived a disastrous expedition to Dalaang and five years of enslavement to the Hutt crimelord Zodoh. Following their escape, Jenn and her fellow survivors came into the service of Baron Lemayne's Grace Command which ran intelligence operations for the Republic under the cover of a mercy organization."}, {"tag": "p", "text": "These operations included the top-secret Operation Deluge which involved inundating Sith-occupied worlds with the addictive spice Deluge as a means of stalling the Sith war effort. In 1032 BBY, she encountered Jedi Knight Kerra Holt on Aquilaris Minor during the Aquilaris campaign. Despite their initial friendship, Jenn's obsessive vendetta against Zodoh and involvement in Operation Deluge created friction with Kerra who was ultimately concerned with saving the lives of civilians in Sith territory. Following the Capture of Devil Squadron, Zodoh coerced her into recovering supplies of Deluge spice on the pretext that he would spare the life of her crew. However, he failed to keep his promise and Jenn retaliated by detonating his stock of Deluge spice."}, {"tag": "p", "text": "Jenn would subsequently reconcile with Kerra and the two women would combine forces to frustrate the schemes of Zodoh. During the Battle of Darkknell, the duo single-handed defeated Zodoh and destroyed his flagship, ending his efforts to flood Darkknell in an artificial flood. Jenn would subsequently atone for the damage committed under Operation Deluge by helping to fly refugees to Republic territory. She would also sabotage Operatioon Deluge by dumping the spice into hyperspace while traveling to pick up refugees in Aquilaris."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Republic career"}, {"tag": "p", "text": "Jenn Devaad was a Captain in the Republic Navy during the Republic Dark Age, commanding the starfighter squadron Devil Squadron. She and her squadron were among the survivors of an illfated Republic task force dispatched to the planet Dalaang. Devaad and her fellow squadron mates were taken captive and enslaved by the Hutt crime lord Zodoh, who had accumulated a substantial crime empire built on slave trading and the sale of the narcotic spice Deluge. Due to the breakdown of the Republic's authority in the outlying regions, Zodoh and other Hutts were able to expand their operations beyond Hutt Space, competing with the squabbling remnants of the [New Sith|[New Sith Empire]]. After five years, Devaad and her squadron managed to escape captivity, bearing a deep seated grudge against both Zodoh and civilians in Sith-occupied worlds whom she blamed for not sheltering her and her comrades in their hour of need."}, {"tag": "h3", "text": "Struggle against the Sith"}, {"tag": "p", "text": "Devaad's squadron joned Grace Command, purportedly a pro-Republic mercy organization based in Alderaan involved in humanitarian relief efforts and resisting Sith forces in Sith Space. In reality, Grace Command was a front organization created by Baron Lemayne for black operations in the war effort against the Sith Lords. Operation Deluge involved Grace Command's forces liberating Sith-occupied worlds but then inundating entire planetary populations with the addictive Deluge spice. While this drug was powerful enough to alleviate hunger pangs, it was so addictive that it rendered its users in a lethargic and apathetic state. Due to the anarchic nature of politics in the Outer Rim, control of these worlds often switched between different Sith Lords and other parties. The primary goal of Operation Deluge was to immobilize the Sith military forces indirectly without committing substantial Republic resources. By 1032 BBY, significant numbers of Sith including Daiman's forces had become addicted to Deluge, effectively undermining their war effort against the Republic."}, {"tag": "p", "text": "Devaad led Grace Command during the Aquilaris campaign, joining forces with the Jedi Knight Kerra Holt. During the Battle of Capital Cay, Devaad and other members of Devil Squadron destroyed one of Zodoh's Stormdriver vessels, large capital ships capable of harnessing atmospheric moisture into torrential storms. By that stage, the Sith Lord Daiman's forces on Aquilaris had been weakened by Zodoh's attack force. Afterwards, Devil Squadron, together with Holt mopped up the rest of Daiman's troops in Capital Cay. Unaware of Grace Command's conspiracy and frustrated by the lack of support from the locals, Kerra welcomed Captain Devaad as a newly-found ally in her crusade against the Sith. Following the battle, Devaad offered Holt a role in Devil Squadron, even lending her a Fire Lotus which she accepted. Holt and the Devils then proceeded to attack Daiman's remaining forces on Aquilaris. Having secured control of the planet, Grace Command proceeded to land shipments of food and medical supplies for the local people. These included orange cases with timed locks supposedly containing more food but in reality contained more capsules of Deluge. Holt expressed a opinion that the cases could be made into booby traps by putting a explosive device like a grenade or a torpedo warhead in a box, then rigged to detonate on opening."}, {"tag": "p", "text": "Holt then expressed a desire to permanently join up with Devil Squadron which Devaad accepted, allowing her to \"borrow\" the fighter of a member due to rotate back to the transport ship Mother Grace. Devaad outlined the squadron's plans of departing from Aquilaris the following day on a mission to escort Mother Grace to its hyperspace jump point. The squadron would then disembark to Heptooine to assault Sith Lord Malakite's garrison there.Her lieutenant Vahss expressed concern about letting Holt fly with them. However, Devaad felt that the Jedi would probably be useful and that Holt was too preoccupied to find out about the rest of their mission."}, {"tag": "h3", "text": "An Uneasy Alliance"}, {"tag": "p", "text": "On the way out of the system however, they encountered Zodoh's personal Intruder-class starfighter. During the ensuing pursuit, Devaad revealed her background to Kerra that she and her comrades in Death Squadron held a grudge against the Hutt lord since he had enslaved them years earlier. Death Squadron were the last survivors of an ill-fated Republic Navy taskforce sent into Sith territory. After five years of captivity, Captain Devaad and her comrades had managed to escape and had vowed to hunt down Zodoh. However, Kerra advised caution since this skirmish had not been part of their original plan and that Zodoh might have been trying to bait them. Devaad responded by chiding Kerra for her lack of enthusiasm. The pursuit ended in a trap with the Hutt's flagship Voracious lying in wait for Devil Squadron. Immediately, Voracious launched fighter squadrons but Holt knew that these were only a diversion. Realizing she was right, Devaad ordered the squadron to break off and jump into hyperspace."}, {"tag": "p", "text": "However before they could do so, a number of Stormdrivers exited hyperspace near Aquilaris. Over the intercom, Zodoh said that he planned to use them to totally drown the entire world. During the subsequent battle, it was revealed that the Stormdrivers's defenses were now oriented to repel fighter assaults. The Republic starfighters were unable to make significant damage and several starfighters were destroyed by enemy fire. While Jenn was determined to hurt Zodoh's forces, Kerra realized that Death Squadron was both outnumbered and outgunned. She also concurred that Zodoh had advance warning of Death Squadron's coming. Despite this, Devaad wanted to stay in the fight and try to get Zodoh, but Holt wished to evacuate the civilians still on Aquilaris. By tolerating the status quo of preserving a deadlock between the Republic and the Sith, Devaad was willing to sacrifice Aquilaris as part of the greater goal of defeating Zodoh and the Sith. Unable to reconcile their differences, Holt broke off and flew back to Aquilaris. Devaad tried to have Vahss deactivate the computer in Holt's fighter and bring her back via autopilot. However, his starfighter was shot down by Zodoh's Intruder-class starfighters before he could take action. Zodoh then had Voracious capture the remaining Devils with its tractor beam. Meanwhile, Kerra managed to escape back to Aquilaris."}, {"tag": "h3", "text": "A Devil's Bargain"}, {"tag": "p", "text": "In captivity, Zodoh offered Devaad a deal to seemingly save her men by getting him the canisters of Deluge that Grace Command sent to Aquilaris. He planned on replicating Grace Command's successful tactic by sending food tainted with Deluge throughout the sector to weaken resistance, thus making it easier to conquer. Zodoh managed to coerce Jenn into doing his bidding by threatening to torture her crew while offering to release them if she complied with his wishes.Devaad returned to Aquilaris and had the people put the containers in her shuttle. However, Holt discovered the true contents of the boxes. After Holt subdued Devaad, she explained to the Jedi that the purpose of Deluge was to undermine the Sith war effort. She shrugged off Holt's concern for the civilians by dismissing them as necessary collateral damage who would otherwise be assets for the Sith."}, {"tag": "p", "text": "Jenn then related how she she and the other survivors of the ill-fated Republic taskforce that was sent to Dalaang were betrayed by the frightened locals. Consequently, they spent five years as slaves in Zodoh's labor camps with the members of Devil Squadron being the only survivors. Devaad dismissed Holt's appeals to try to trust the people and left to take the Deluge to Zodoh. After she brought the containers of Deluge to Zodoh, she told him to free her men. However, Zodoh revealed that he had already \"freed\" them by releasing them into space through an airlock, killing them. Devaad however had prepared for this event and had a final trick up her sleeve. While on her errand, Jenn had copied Holt's idea of planted bombs in the containers. She activated the time-rigged bombs which killed several of Zodoh's entourage and wrecked the command bridge, disrupting the coordination of the Stormdrivers. Still, she failed to kill Zodoh since he was wearing thick armor and had a jetpack and the Voracious only sustained minor damage. Taking advantage of the commotion, she commandeered a twin-seater starfighter and escaped back to Aquilaris."}, {"tag": "h3", "text": "Reconciliation"}, {"tag": "p", "text": "Jenn eventually managed to locate Kerra on one of the Seacropper Submersibles that had been reactivated by Joad Kreel. They had succeeded in rescuing many refugees in Capital Cay. She told Holt that Zodoh was going after Daiman's headquarters on Darkknell next. Holt agreed to patch things up with Devaad, but insisted on doing things her way. They flew to Darkknell alongside Zodoh's forces, landing right in the middle of a battle when Daiman's forces were getting the worst of it. Devaad pointed out that when she detonated her bombs, it shut down the Stormdrivers. The plan was that Devaad would drop off Holt in the Voracious and she would look for the Stormdrivers controller. She then left to return to the battle and take out more of Zodoh's forces. Holt informed her that the device controlling the Stormdrivers was located in the dome of the flagship. Devaad returned and shot the dome, exposing it to space. She then flew inside and picked up Holt, then the two of them proceeded to shoot up the control computers, which also fatally damaged the Voracious, though the two successfully escaped in time."}, {"tag": "p", "text": "Afterward, on Aquilaris, Devaad and Holt came up with a strategy to sabotage Operation Deluge. Devaad would return to Grace Command and claim that she had gotten for distributing the Deluge on Aquilaris. This ensured that Grace Command would continue to send transport ships which Devaad would personally fly to and from Sith occupied words. En route, she would get rid of the Deluge while returning to the Republic with civilian refugees. With the hidden undersea facilities on Aquilaris, the world could even become a important hub for ferrying refugees from Sith occupied space to safety in the Republic. Devaad then allowed Holt to keep her Fire Lotus, returning to the Republic in the captured Hutt fighter."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jenn Devaad was a strong and capable leader who commanded Devil Squadron, a Republic starfighter squadron. However, she also harbored a deep-seated grudge and bitterness against both the Hutt crime lord Zodoh and civilian populations in Sith Space. Her hatred against Zodoh stemmed from the deaths of her comrades and the grueling hardship she endured during her five-year long enslavement at the hands of the Hutt. Meanwhile, Jenn's bitterness towards civilians was rooted in their unwillingness to assist her and her comrades following a disastrous Republic mission to Dalaang. This sense of betrayal led Jenn to believe that only those who helped themselves were worthy of deserving assistance in the first place."}, {"tag": "p", "text": "Both her ill-feeling towards civilians and her patriotic outlook led her to willingly participate in the Grace Command's unethical Operation Deluge which led to many sentient beings being reduced to spice addicts throughout Sith Space. Still, Jenn was also capable of being good-spirited and pleasant as shown during her friendship with Kerra Holt and her efforts to assist Aquilarian civilians. She played a leading role in the distribution of food and medical supplies to Aquilarian civilians. However, the latter stemmed from her deceptive role as a liberator providing relief assistance to Sith-occupied worlds."}, {"tag": "p", "text": "Her strong friendship with Kerra was so close that she was willing to lend her one of Devil Squadron's starfighters. Despite divergent differences in priorities and morality, this friendship was strong enough to withstand even outright confrontation. The death of her crew at the hands of Zodoh led her to reconcile with Kerra and the women combined forces to defeat the Hutt crime lord's ambitions for galactic dominance at the climatic Battle of Darkknell. Ultimately, Jenn expressed remorse for the wrongs inflicted on civilians during Operation Deluge. She would atone for her actions by sabotaging Operation Deluge and dumping their shipments of Deluge spice into space while using the same transport ship to deliver refugees to the safety of Republic-controlled space."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a starfighter pilot in the service of the Galactic Republic, Jenn Devaad was proficient in starfighter dogfighting and subsequently rose to the rank of Captain by 1032 BBY. Jenn could pilot a variety of different starfighters including the Fire Lotus-class starfighter and even an unfamiliar Hutt fighter. As a military officer, she was also proficient in using a blaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jenn Devaad was first introduced as a major supporting character to the protagonist Kerra Holt in the Deluge arc of the Star Wars: Knight Errant comic series which debuted on August 2011. John Jackson Miller developed her story background while she was drawn by Ivan Rodriguez and colored by Michael Atiyeh. She is one of the characters to debut throughout all five issues of this arc."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}