{"url": "Jenks_(Imperial)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Articles with conflicting sources", "Category:Humans", "Category:Males", "Category:Mechanics", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Jenks  (Imperial)"}, {"tag": "p", "text": "In 11 ABY, an Imperial spy infiltrated the New Republic base on the ancient Space City of Nespis VIII. Posing as a technician named Jenks, the spy reported on the New Republic's presence aboard the city to the reborn Galactic Emperor Palpatine but was later captured during an attempt to plant a homing beacon aboard the New Republic starship Millennium Falcon. Using the information provided by Jenks, Palpatine destroyed the city with the Galaxy Gun superweapon, although the New Republic had been able to evacuate beforehand."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Infiltrating the New Republic"}, {"tag": "p", "text": "During the Galactic Civil War, a Human male operated as a spy for the Galactic Empire amidst the reborn Emperor Palpatine's period of rule in his final clone body. In 10 ABY, using his newest superweapon, the Galaxy Gun, Palpatine destroyed Pinnacle Base, the New Republic headquarters located on the moon Da Soocha V. The New Republic survivors then relocated to Nespis VIII, a derelict Space City in the Auril sector, making it their new base of operations."}, {"tag": "p", "text": "In 11 ABY, the Imperial spy successfully passed a New Republic security screening and infiltrated the Nespis VIII base, posing as a technician named \"Jenks.\" During his stay there, Jenks discovered that the Ysanna tribe, which the Jedi Knights Luke Skywalker and Kam Solusar had encountered on the planet Ossus, were descended from Jedi. Jenks reported that information, along with the coordinates of Nespis VIII and its status as the New Republic base, to the Emperor."}, {"tag": "h3", "text": "Rooted out"}, {"tag": "p", "text": "Continuing with his subterfuge, Jenks attempted to plant a homing beacon on the navigation computer of the New Republic starship Millennium Falcon. Making his way aboard the vessel while it was undergoing maintenance, Jenks planted the device. However, his act of sabotage was witnessed by the droids C-3PO and R2-D2, who were passing by."}, {"tag": "p", "text": "The droids intended to report on Jenks' subversion to the ship's captain, Han Solo. His cover put at risk, Jenks pulled out his concealed blaster pistol and threatened to destroy C-3PO's droid brain to prevent the droid from revealing that sensitive information. However, Solo himself arrived to witness the scene, and C-3PO informed him of Jenks' actions. The spy fired his weapon at Solo but narrowly missed the captain. The Imperial was then attacked by Solo's Wookiee co-pilot, Chewbacca, who jumped at him from a compartment above Jenks' head and subdued him."}, {"tag": "p", "text": "Jenks was taken into custody, and his status as a spy was made known to the New Republic leaders. The homing beacon he had planted aboard the Millennium Falcon was also deactivated. However, Jenks boasted before his captors that he had already informed the Emperor about the New Republic's presence on the space city, proclaiming that the New Republic forces on Nespis VIII were doomed. Alerted to the New Republic's presence, the Emperor fired his Galaxy Gun at Nespis VIII."}, {"tag": "p", "text": "Although the weapon's first particle disintegrator warhead failed to detonate, allowing the New Republic time to evacuate, the second warhead destroyed Nespis VIII. Using Jenks' information about the Ysanna, Palpatine also dispatched Military Executor Xecr Nist to Ossus to kidnap members of the tribe, as Palpatine hoped to use their DNA to produce new clone bodies for himself, although that scheme was foiled by Skywalker and his Jedi."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jenks possessed enough skills as a spy to infiltrate the New Republic's Nespis VIII base as a mere technician, despite anti-spy security screenings in place. In reality, Jenks was devoted to Emperor Palpatine, feeding him vital information and believing in the inevitability of his victory."}, {"tag": "p", "text": "During his brief stay with the New Republic, Jenks established some contact with Han Solo, as the latter knew him by his assumed name. When confronted by C-3PO, Jenks quickly lost his temper, pulling out his blaster and threatening to damage the protocol droid, ultimately exposing his true identity as a spy. Jenks believed that his capture was irrelevant in the grand scheme of things, as the Emperor was already aware of the New Republic's presence on Nespis VIII. Jenks had light skin and close-cropped black hair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "In order to maintain his cover during the infiltration of Nespis VIII, Jenks wore a technician's uniform, complete with a cap, and he carried a concealed blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "\"Jenks\" first appeared in the first issue of the Dark Horse comic book series Star Wars: Empire's End, written by Tom Veitch and illustrated by Jim Baikie. The first issue was published on October 24, 1995."}, {"tag": "p", "text": "Jenks also featured in the comic's 1995 audio drama, although that adaptation portrayed the character as female. While Empire End 1 never established whether \"Jenks\" was the spy's real name or an adopted pseudonym, issue 65 of The Official Star Wars Fact File established that \"Jenks\" was, in fact, merely an alias used by the spy."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "Compared to the comic, the Empire's End audio drama presents several inconsistencies regarding Jenks' confrontation with Han Solo. The encounter between Jenks and Solo in the audio drama begins with Solo arriving accompanied by the cyborg Jedi Empatojayos Brand. Instead of firing a single shot, Jenks fires multiple, and she succeeds in hitting Brand, but the Jedi survives due to his prosthetic body's backup systems."}, {"tag": "p", "text": "After the attack, Solo questions Jenks as to how she managed to infiltrate the New Republic. When Jenks refuses to answer, Solo threatens to give her over to Chewbacca, insinuating that the Wookiee will resort to more violent forms of interrogation. Jenks is then locked up in the Millennium Falcon 's storage bay. In the comic, Jenks is seen tied up in the briefing room of Nespis VIII. For the purposes of this article, the events are portrayed as they were originally presented in the comic book."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}