{"url": "Jenos_Idanian", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Character stubs", "Category:Corellians", "Category:Khuiumin Survivors", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Jenos Idanian"}, {"tag": "p", "text": "Jenos Idanian was one of the many aliases that Han Solo used in his time working for Garris Shrike, and in his bid to enter the Imperial Academy in 10 BBY. It was while using this alias that Han tried to retrieve a large cache of credits from the Imperial Bank in order to finance his transformation into a legitimate data file that was \"free and clear\", and would allow him to enter the Academy. Unfortunately, due to the nature of how Han had acquired the money (by selling off treasures he and Bria Tharen had stolen from Teroenza on Ylesia), the account was tagged by Inspector Hal Horn and Han had to make a break for it before he was arrested by stormtroopers."}, {"tag": "p", "text": "Years later Corran Horn, on the advice of his grandfather Rostek Horn and not knowing of Han's connection to the dataphantom, used the pseudonym while searching for his wife Mirax. Rostek provided him with the identification and gave him Idanian's known history of ship theft, including how Hal had been very close to catching him when he disappeared. Rostek also added some new history to the identity, in which Idanian later joined the Rebellion and, after the war, went on to work as a ship broker."}, {"tag": "p", "text": "Under the Idanian guise, Horn infiltrated the Invids through the Khuiumin Survivors pirate gang based on Courkrus. He quickly rose through the pirate ranks, eventually being appointed by Admiral Tavira to take over the entire Vlarnya operation, though this was a role he would not choose to fulfill. Once he had rescued his wife, Corran abandoned the alias."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Jenos Idanian\" is an anagram of Indiana Jones, another character that Harrison Ford played."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}