{"url": "Jensaarai", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Pages needing citation", "Category:Force-based organizations", "Category:Gray Jedi", "Category:Jensaarai", "Category:Sith cults"], "nodes": [{"tag": "h1", "text": "Jensaarai"}, {"tag": "p", "text": "The Jensaarai were an order of Force-users from the Suarbi system, who arose during the Clone Wars. Their name was Sith for \"followers of the hidden truth.\" Their philosophy and methodology was a blend of Sith and Jedi teachings. Their hierarchy loosely resembled that of the Jedi Order. During its creation and early years the Jensaarai were opposed to the Jedi, due to ignorance and the loss of their founder. After the fall of the Galactic Empire, the Jensaarai made peace with the Jedi, and even sent students to learn at Luke Skywalker's Jedi Praxeum on Yavin 4."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The birth of the Jensaarai began with the fall of Anzati Jedi Knight, Nikkos Tyris."}, {"tag": "p", "text": "On a search through the archives in the Jedi Temple, Tyris uncovered an ancient Sith manuscript detailing Larad Noon's philosophical musings and telling the tales of the exile of the first dark Jedi, the birth of the Sith, the ancient Sith Wars and a great deal of Sith lore. Most of the information contained within was factually correct, save for one crucial detail—the manuscript claimed a shocking revelation: that the Jedi stole everything they knew from the Sith, before exiling them. The truth of the manuscript's contents was, naturally, questionable and biased. However, Tyris unquestioningly accepted the lies of the manuscript and turned his back on the Jedi Order."}, {"tag": "p", "text": "Tyris dubbed his followers the Jensaarai, meaning 'the hidden followers of truth' in ancient Sith. The group then headed for Susevfi in the Suarbi system, where the nascent Jensaarai established a base to train from. Tragically, Tyris did not notice how the manuscript was corrupting him, and how he was walking the path of the dark side. Tyris trained the Knights and Padawans in what he believed to be the secret teachings of the 'true' Jedi, when in fact he was really imparting Sith secrets and unknowingly converted his apprentices to the dark side."}, {"tag": "p", "text": "With the discovery that the Sith had returned to the galaxy, Count Dooku's fall to the dark side, and the ongoing Clone Wars, the Jedi Council were anxious to discover anything and everything they could about the mysterious second Sith, Darth Sidious. Many Jedi Knights and Jedi investigators were dispatched by the Jedi Council, or took it upon themselves, to follow up any leads on the Sith. The Jedi Knights Nejaa Halcyon, Ylenic It'kla, and a Jedi known only as \"Desertwind\" from the scent memory of It'kla, were three such Jedi dedicated to uncovering the Sith. The trio had tracked rumors of Sith Cultist activity to Susevfi, where they discovered Nikkos Tyris and two other former Jedi."}, {"tag": "p", "text": "Already lost to the dark side and beyond saving, the Jensaarai presented a threat to the Galactic Republic and the Jedi realized they had a duty to stop the dark siders from spreading. A furious battle ensued in which Nikkos Tyris, Nejaa Halcyon, and the other two Jensaarai were slain. A dying Halcyon flung the mortally wounded Jensaarai into their nearby training base, where the release of dark side energy from the Dark Jedi's death collapsed the building's foundations and all but destroyed the Jensaarai's makeshift base. Ylenic It'kla and \"Desertwind\" believed the Jensaarai to be vanquished, and departed Susevfi not long after."}, {"tag": "h3", "text": "Rebirth"}, {"tag": "p", "text": "Unknown to the Jedi, however, there were more Jensaarai. When the Jedi arrived at Susevfi, they only found Tyris and two other Jensaarai, and unsurprisingly concluded that these three were the 'Sith cultists' they had heard about. What the Jedi had failed to realize was that they had only slain the leader of the Jensaarai and two of its most experienced members. Within the Jensaarai's base, watching the battle with the Jedi, were the rest of the Jensaarai, hidden by using their Force abilities. When Tyris and the others were slain, and the building collapsed, the Jensaarai were trapped and unable to avenge their brethren. By the time they had extricated themselves from the rubble, the Jedi were long gone. In the aftermath of the battle, the wife of one of the slain apprentices took the title of Saarai-kaar for herself and began to train the next generation of Jensaarai. The Jensaarai were content to remain in hiding, lest the Jedi discover their existence and return to wipe them out. Thus, the Jensaarai had weathered the death of its founder and secretly grew by continuing in their training and strengthening their numbers by taking in Force-sensitives from the local population."}, {"tag": "h3", "text": "The Empire"}, {"tag": "p", "text": "With the Rise of the Empire and the almost-complete destruction of the Jedi Order, the Jensaarai believed themselves to be liberated—free to practice their arts and expand their knowledge without fear of Jedi brutality and hatred. They openly moved as custodians and guardians of the planet, and the Saarai-Kaar's son even went to personally assist Darth Vader in hunting down the remaining Jedi. Vader however, sensed only the light side within the boy and, using his lightsaber, cut him down where he stood. The Inquisitorius then dispatched Jedi hunters and the odd Inquisitor to Susevfi in an attempt to exterminate the Jensaarai. Many Jensaarai were caught and executed, as the Empire made its presence felt on the planet, and it became clear the Emperor Palpatine would tolerate no other Force-users in the galaxy unless they could be made to serve his own needs. Like the Jedi before them, the Emperor's agents made the mistake of believing they had wiped out the Jensaarai, when really they had only dealt with a small group of them. In another show of history repeating itself, the persecutors of the Jensaarai felt that their work was done and left the planet."}, {"tag": "p", "text": "Stunned by the slaughter of her son, and the apparent betrayal of the Empire, Saarai-kaar and the Jensaarai retreated into hiding once again. The Jensaarai were determined to exact justice on their persecutors though, and after a few years they periodically emerged in small groups or as individuals to conduct raids and ambushes on the Imperial garrison. Sometimes one of the Jensaarai would be killed in the fighting, or captured and executed, but by and large the Jensaarai demoralized the garrison with their continual attacks. It is not known why, but after the initial rush of Jedi hunters descended on Susevfi, they then left and never showed anything more than a token interest in crushing the rebellious, Force-using group. The answer may have been the Emperor simply realizing the Jensaarai had no intention of helping the Jedi-oriented Rebel Alliance off-planet, so they were of no danger to him, and he was busy with the Rebels."}, {"tag": "h3", "text": "Leonia Tavira"}, {"tag": "p", "text": "With the death of the Emperor and Darth Vader during the Battle of Endor, the Jensaarai knew it was only a matter of time before the Empire fell and they would be free. Hearing rumors of powerful Force-users on Susevfi, the former Moff, Leonia Tavira, now leader of the pirate Invids, arrived and executed the Imperial governor, sending a (false) message to the Jensaarai that they were now free from oppression and persecution. After making contact with the pirate leader, the Jensaarai made the mistake of believing Tavira to be their liberator. In truth, Tavira was merely using Susevfi as a base of operations, and the Jensaarai to hunt down Jedi Knight Corran Horn, who was attempting to rescue his wife Mirax from the clutches of Tavira."}, {"tag": "p", "text": "Following Tavira's orders, a group of Jensaarai departed the planet to hunt down Corran Horn, whom they found on Courkrus. Ambushing the lone Jedi, the Jensaarai were on the verge of winning the fight when Luke Skywalker appeared and together with Horn, the two defeated the Jensaarai. The Jedi captured their attackers, and upon questioning, were shocked to discover the existence of the Jensaarai and their warped philosophy (in regards to the Jedi). Since the death of Tyris, the Jensaarai had been taught a skewed history lesson—they were told that the Jedi were dark siders, and that the Sith were champions of the light. Indeed, to his dismay, Skywalker learned that the Jensaarai switched the roles of Obi-Wan Kenobi and Darth Vader, seeing the former as a monster."}, {"tag": "p", "text": "Informing the New Republic of the secret location of the Invids' base, the two Jedi set off for Susevfi, incognito, in the hope of rescuing Mirax, and confronting the Jensaarai. After locating Mirax and the Jensaarai, a skirmish erupted with the discovery of the Jedi. Thankfully, the New Republic sent a fleet to apprehend Tavira, and with the help of Corran's Force Illusions, managed to drive her away, leaving the Jedi free to conclude their duel with the Jensaarai. After a brief battle, Luke and Corran defeated the Saarai-kaar and the other Jensaarai, who bitterly expected execution at the hands of the Jedi. Luke tried to explain how the Jensaarai had gotten their facts wrong, but the Saarai-Kaar refused to believe him. It was only with the help of Corran's friend, the Caamasi, Elegos A'Kla and his memnii that the Jedi managed to defuse the situation and reach an understanding with their erstwhile opponents."}, {"tag": "h3", "text": "A certain point of view"}, {"tag": "p", "text": "Before their conflict with Corran Horn and Luke Skywalker, the Jensaarai realized their outlook on the universe had been skewed. If not through Nikkos Tyris' mistaken beliefs, the Saarai-kaar might not have allowed her despair at the loss of her husband and son to color her perception, reinforcing the belief that the Jedi had fallen to the dark side and abandoned the Jensaarai through her teachings. With the help of the new Jedi, the Jensaarai were on the path to true understanding. Though the relationship between the Jedi and the Jensaarai was fragile at first, the Saarai-kaar agreed with Luke Skywalker to send students to his academy on Yavin IV, in the hope of building a better union between the two groups. The Jedi had brought peace and friendship, while the Jensaarai gave Luke valuable knowledge on the practices of Old Republic Jedi, and eventually the Jensaarai became fast allies of the New Jedi Order."}, {"tag": "p", "text": "After this, the Jensaarai went through a series of ideological reforms, incorporating the truth of their origins and misplaced views, as revealed by Luke Skywalker. The relationship between the Jedi and the Jensaarai only grew stronger, with the latter coming to the aid of the former during the Yuuzhan Vong War. Kelbis Nu, a Jensaarai, went on to train at the Jedi Academy, and fight during the war. He died on Eriadu, persecuted by the Peace Brigade, but was able to pass on valuable information to the Jedi about the Vong's movements."}, {"tag": "p", "text": "Following the war, the Jensaarai would later come to allow Jacen Solo to learn from them, in his quest to further his knowledge of the Force. During the time after the Sith–Imperial War, the Jensaarai were one of many Force organizations that were given the ultimatum by the One Sith to join their ranks or be destroyed. This led to a number of Jensaarai to joining the Sith ranks, though the organization was not completely absorbed."}, {"tag": "p", "text": "While the New Jedi Order accepted and taught Jensaarai students, they still considered the Jensaarai tradition to be made up of Gray Jedi due to their \"proximity\" to the dark side. The Jensaarai themselves outwardly denied these claims."}, {"tag": "h2", "text": "Philosophy, abilities, and practices"}, {"tag": "p", "text": "The first Jensaarai, under the tutelage of Nikkos Tyris, were taught the lore of the Sith. Many of the former Jedi, even half-trained Padawans, found the transition from Jedi to Jensaarai difficult at the least. Tyris had somehow come to possess a 4000 year old journal written by Larad Noon, one of the final surviving members of the Brotherhood of the Sith in the Great Sith War. Noon had isolated himself on Susevfi after the war, and his journal delved into both the light and dark aspects of the Force. One of the major themes within Noon's writings was the concept of \"integrating the shadow\". To fully grasp the Sith secrets within the manuscript required a greater understanding of the Force, an understanding that the early Jensaarai simply did not possess. The group could master no more than the rudiments of what the manuscript detailed. Furthermore, advancement in the arts of the Sith required turning to the dark side. Though the Jensaarai, including Tyris, were unaware of the dark origins of their new powers, most of the group unconsciously refused to turn, including Tyris' own wife and son. Tyris and two of his brightest students, with their greater knowledge of the Force and their mastery of the Jedi arts, quickly spiraled down the dark path. The three quickly decided to turn their fellows, and were in the process of doing so, when the Jedi arrived and defeated them. The Saarai-kaar and the other Jensaarai, who were unaware of his fall, mistakenly believed the Jedi to have simply murdered him and abandoned the rest of them, further reinforcing the Sith text's lie of the Jedi as harbingers of evil."}, {"tag": "p", "text": "With the death of Nikkos Tyris and his two best students, the training and direction of the Jensaarai changed drastically. His death and the destruction of the Sith manuscript during the fight with the Jedi, the sole source of knowledge was the new Saarai-kaar. Because she had never completed her training in the arts of the Sith, the Saarai-kaar was free from the influence of the dark side, and could only teach the new Jensaarai her own, limited knowledge of the Sith, which was mostly harmless. For example, in possible emulation of ancient Sith armor smiths and the battle armor worn by Sith warriors and the Jedi Knights of old, the Jensaarai had some knowledge of Sith techniques for working cortosis, leading to the development of their specialized armor. Presumably, from the tales of Sith assassins, the Jensaarai were also able to effectively mask their presence in the Force, which may explain why the Emperor's Jedi hunters left Susevfi so early. The Jensaarai were also able to use a unique power they called ballistakinesis. This power involved hurling a collection of small, usually harmless objects, such as coins or pebbles, and using the Force to accelerate their velocity to lethal speeds."}, {"tag": "p", "text": "Jensaarai philosophy and abilities were thus syncretistic; the mixture of Jedi and Sith teachings complemented each other perfectly. From their Jedi roots they were deeply honorable, disciplined, and respected those same traits in their enemies. From the Sith they learned the power of aggression, though not to the point of the dark side. In that regard, the Jensaarai, after the death of Tyris, remained true to the light side, only with a different outlook on the universe and the Jedi Knights. One Jedi ideal the Jensaarai never abandoned was the defense of peace and justice. Shortly after the death of Nikkos Tyris, the Jensaarai took it upon themselves to act as custodians for Susevfi, and continued to act as much they had during their days in the Jedi Order."}, {"tag": "h3", "text": "Weapons and armor"}, {"tag": "p", "text": "Following their origins as Jedi, the Jensaarai fought with lightsabers, and were familiar with the lightsaber forms of combat. However, in a break with the Order, the Jensaarai did not place as much importance on the construction of lightsabers, as they did with their Sith-inspired combat armor. To the Jedi, the construction of the lightsaber was an important event in a Padawan's life, a serious step on the path to Knighthood. The Jensaarai generally constructed their lightsabers at an earlier stage in their training than the Jedi, and saw the construction of their armor as more important. To the Jedi, the lightsaber represented the outward manifestation of any given Jedi, each lightsaber was as unique as the Jedi that crafted it, and this was no less true for the Jensaarai."}, {"tag": "p", "text": "The armor worn by the Jensaarai, as mentioned, was inspired by details of Sith battle armor. It was a highly flexible suit of light armor, covered in spun cortosis fibers, capable of protecting a Jensaarai from lightsaber attacks. First a basic, generic, frame was constructed before the armor was further customized to represent an animal the wearer could relate to. Though not a rule, it was common practice for armor to be styled on animals that were not overly aggressive, but were capable of adequately protecting themselves when threatened, such as a reek or Corellian sand panther. If the wearer was so inclined, modifications to the armor included systems designed to better emulate the creature in question, such as built-in macrobinoculars or retractable claws. The construction of the armor was a deeply personal affair, and was as much of an art form as lightsaber construction, requiring just as much dedication and skill, used in the Jensaarai as the transition from apprentice to full 'knight'."}, {"tag": "h3", "text": "Ranks"}, {"tag": "p", "text": "There were three ranks amongst the Jensaarai: apprentices, defenders, and the Saarai-kaar."}, {"tag": "p", "text": "In order to become a defender, an apprentice went through a rite of passage similar to the one that Jedi Padawans took. Apprentices not only created their own lightsabers, but also their trademark armor. Apprentices trained under defenders, much like the Padawan-Master relationship of the Jedi Order."}, {"tag": "p", "text": "It was important to note that there was no 'intermediary' rank among the Jensaarai, the step between Padawan and Master—the Knight—was missing. Instead, defenders were something of a mixture between Knight and Master, training apprentices and forming the bulk of the organization. There were other divisions within the rank of defender; the Ring Defenders formed something of a starfighter corps to protect Susevfi from pirates and/or fleeing criminals. The shield defenders acted much as secretaries, assistants, and bodyguards for the Saarai-kaar."}, {"tag": "p", "text": "As for the Saarai-kaar, who served as leader of the Jensaarai, there has only been two. It was unknown as to who would succeed as the next Saarai-kaar, as one has not been nominated, and the current one has no known protégé."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}