{"url": "Jergan", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with gameplay alternatives", "Category:Con artists", "Category:Humans", "Category:Males", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Jergan"}, {"tag": "p", "text": "Jergan was a Human male con artist and a patron of the Upper City Cantina on the planet Taris during the Jedi Civil War. Inside the cantina, Jergan spent his time looking for women. Asking about their thoughts on the cantina's Bith band, he then offered the ladies a backstage visit for a fee of twenty credits, which he ran off with. In 3956 BBY, he succeeded in this scheme with at least one woman, Lana."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jergan was a Human male con artist who frequented the Upper City Cantina on the planet Taris during the Jedi Civil War, looking for women in order to trick them out of their credits. When he found a suitable target for his scheme, he approached her, asking what she thought about the cantina's Bith band. Regardless of the female's opinion, he would then offer to take her backstage to meet the band after the show, claiming that he had an agreement with a Rodian bodyguard who could arrange the meeting for a fee of twenty credits. In fact, nobody backstage knew Jergan. After receiving the money that he promised to deliver to the Rodian, Jergan ran away with it and did not return. In 3956 BBY, a woman named Lana fell for Jergan's lies and was conned out of her twenty credits. Lana subsequently began searching for Jergan in order to reclaim her money with interest. Jergan was aware of that fact, though he continued with his business in the cantina."}, {"tag": "p", "text": "A week after he conned Lana, Jergan met the Galactic Republic soldier Revan in the cantina. When Revan tried to strike up a conversation, however, Jergan replied that he did not have the time to talk at the moment, stating that he was looking to find a female companion for the evening."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hoping to obtain a small sum of money, Jergan resorted to lies in order to trick unsuspecting women. He had black hair, gray eyes and pale skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jergan first appeared as an NPC in the 2003 video game Star Wars: Knights of the Old Republic, wherein the player, Revan, has an option to interact with him in the Upper City Cantina. In the game, Revan's gender is customizable; however, Jergan will refuse to talk to the canonical male character. Should the player take a non-canonical path and play as a female Revan, Jergan's scamming business is revealed, as he tries to approach the player, offering to take her backstage. If the player agrees and gives him twenty credits, he runs away with the money, promising to arrange the meeting. Revan then meets Lana, who reveals that Jergan is a con artist who has recently used the same scheme to rob her of twenty credits. Lana also believes that Jergan will not come back to the cantina, as he knows that she is looking for him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}