{"url": "Jerserra", "categories": ["Category:Articles to be expanded", "Category:Canon articles", "Category:Character stubs", "Category:Females", "Category:Members of the Inquisitorius", "Category:Nightsisters"], "nodes": [{"tag": "h1", "text": "Jerserra"}, {"tag": "p", "text": "Jerserra was a Dathomirian female who was taken from Dathomir and trained by a female Inquisitor of the Galactic Empire. She wielded a red double-bladed spinning lightsaber. She eventually killed her master and became a mercenary in search of more power."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jerserra was born on the planet Dathomir during the final years of the Republic Era. As a kid, she was very powerful in the Force, hungering for great power no matter the cost of those around her. She was a member of the Nardithi Nightsisters, a sect of the Nightsisters. Jerserra witnessed most of her sisters die in the Battle of Dathomir. Years later, a female Inquisitor came to the planet Dathomir in search of power but found a teenage Jerserra instead. The inquisitor took Jerserra to train her as a secret inquisitor. Before leaving, Jerserra took her clan's shard of the Nardithi Cluster."}, {"tag": "h3", "text": "Life as an inquisitor"}, {"tag": "p", "text": "Jerserra was trained by the inquisitor as an apprentice. Jerserra spent years with her master, learning many secrets of the Force. Having possession of the shard, she spent great time studying it. Becoming impatient and wanting to travel the stars, later killed her master with her own red lightsaber. She erased all signs of her existence and crafting evidence to point at other inquisitors."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Jerserra was a Force-sensitive whose dark side abilities allowed her to project terrifying visions into the mind of her opponent, forcing them to face their greatest fears."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}