{"url": "Jerus_Jannick", "categories": ["Category:Canon articles", "Category:Wookieepedia Comprehensive articles", "Category:Humans", "Category:Males", "Category:Naboo Palace Guards"], "nodes": [{"tag": "h1", "text": "Jerus Jannick"}, {"tag": "p", "text": "Jerus Jannick was a human male Palace Guard of the Royal Naboo Security Forces, which served the Royal House of the planet Naboo. Carrying an S-5 blaster pistol and a comlink, he wore a helmet with armor plating polished in a Naboo aesthetic, leather neck covering, and an adjustable chin strap. Jannick also donned a uniform armored with a top coat and designed to absorb energy blasts while giving its wearer freedom of movement. The uniform featured a utility belt with pouches for ammunition and a communicator, and Jannick wore boots with high-traction soles designed to allow for moving silently."}, {"tag": "p", "text": "In 32 BBY, the human boy Anakin Skywalker visited the chambers of Naboo Queen Padmé Amidala on the planet Coruscant, at the entrance of which Jannick was standing guard. When Skywalker arrived, Jannick used his comlink to inform the handmaiden Rabé that Skywalker was there in search of Padmé. Skywalker went in, only to be informed by Rabé that Padmé was unavailable."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jerus Jannick first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace, where he was portrayed by actor Dominic West. On October 15, 2020, the character was identified in the new Star Wars canon in an installment of This Week! in Star Wars, a weekly video series released on the official Star Wars YouTube channel. West revealed in an interview that he had wanted to meet Star Wars creator George Lucas, whom he considered a very influential figure in his childhood. When he asked for a part, he was told that he could either play a Palace Guard or a Naboo Officer, both of which he accepted."}, {"tag": "p", "text": "The name Jerus Jannick originated in the Star Wars Legends continuity, where it was used in the Star Wars Customizable Card Game's 2001 Theed Palace Limited expansion on a card of the same name. The card uses a promotional image of Dominic West in his Naboo Officer uniform, which he wore in a scene from The Phantom Menace that was ultimately deleted. In the scene, Captain Panaka contacts Jannick, who is standing by a B1-series battle droid following the Battle of Naboo. He then tips the droid over, showing Panaka that it had been disabled."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}