{"url": "Jess", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Musicians"], "nodes": [{"tag": "h1", "text": "Jess"}, {"tag": "p", "text": "Jess was a popular Human female musician. Secretly, she hoped to eventually leave Jabba's Palace by joining a band. Jess was often seen in the company of Bib Fortuna, and she witnessed Han Solo's rescue."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 4 ABY, Jess worked as a musician in Jabba's Palace, hoping to eventually leave the establishment by joining a band. Jess was often seen in the company of Bib Fortuna stroking his lekku. He reciprocated the gesture, often leading her around the throne room by hand, and letting her sit nestled to him. Though he still reminded her what she was, dragging her to the sight of the dancing girl Oola being fed to the rancor. Later, she was left to slumber alone on Jabba's dais with two other patrons as Fortuna lay in wait with his master, ready to spring the trap as Leia Organa, disguised as Boushh, released Han Solo from carbonite. Whether she went on Jabba's sailbarge with the others is unknown."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jess was a Human female who had white hair with blue highlights. During her employment at Jabba's Palace, she was attired in a solid brassiere and long blue leggings."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jess first appeared as a briefly glimpsed background character in Star Wars: Episode VI Return of the Jedi played by English dancer and actress Amanda Noar. The character of Jess is more clearly visible in 1983's \"Lapti Nek\": The Music Video from Jabba's Palace and also makes an appearance in Return of the Ewok."}, {"tag": "p", "text": "Bib Fortuna actor Michael Carter, via an interview on TheForce.net, has alluded to several cut scenes from Return of the Jedi that involved Jess and Salacious B. Crumb. Some of these scenes appear in \"Lapti Nek\" The Music Video from Jabba's Palace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}