{"url": "Jesson_Di_Blinth", "categories": ["Category:Legends articles", "Category:Males", "Category:Royalty", "Category:X'ting"], "nodes": [{"tag": "h1", "text": "Jesson Di Blinth"}, {"tag": "p", "text": "Jesson Di Blinth was a X'Ting from the volcano Di Blinths on the planet Ord Cestus. During his time as a male, he went on a mission with Obi-Wan Kenobi to retrieve two Royal X'Ting eggs in 21 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Jesson was selected by the Hive Council to accompany and guide Obi-Wan Kenobi through the perilous X'Ting underground, to find and recover two royal X'Ting eggs. This mission was especially important, as corrupt Council member Caiza Quill had been removed from the Council, and the other members feared he would betray the location of the eggs, and use them for some vile purpose."}, {"tag": "p", "text": "At first, Jesson showed little more than contempt for Kenobi, as he did not believe the tale about a Jedi coming to aid Cestus, and did not think the Jedi were anything special. He also believed that the quest was pointless, as several of his broodmates had tried to rescue the eggs beforehand, but had never returned."}, {"tag": "p", "text": "As the two set off, Jesson revealed that he did not much care for the Hive Council, nor Regent G'Mai Duris. He claimed his only allegiance was to the royals. They passed through a chamber filled with the Zeetsa. before moving on."}, {"tag": "p", "text": "When they reached the ancient Hall of Heroes, they were beset upon by vicious cannibalistic X'Ting, who were descended from those who had hidden underground to guard the eggs when Cestus Cybernetics took over. After Jesson and Kenobi beat off the attack, and fled from the room, the found themselves in a vast cavern, filled with dirt. It was empty of the cannibals, and they soon found out why."}, {"tag": "p", "text": "A type of Cestian worm had been brought into the chamber to help cultivate the ground, but the worms had become predatory, and chased the X'Ting away. After a brief but fierce engagement, Jesson and Kenobi, we forced up onto a ledge, where they saw the corpse of one of Jesson's broodmates. Jesson had been hurt, so Obi-Wan took hold of him, and attempted to swing across to a ledge leading to the egg chamber. After a failed try, they got to the ledge."}, {"tag": "p", "text": "It was now up to Jesson to get the eggs, knowing that if he failed three times, either he, or the eggs, or both, would be terminated. He slid himself into a chair by a computer console, and began."}, {"tag": "p", "text": "The first question was so deceptively easy, so Jesson was immediately suspicious. He inputted what he thought was the obvious answer, only to be denied. The second question was just as simple, but again, Jesson's knowledge of X'Ting history had failed him."}, {"tag": "p", "text": "After he had failed the second question, Jesson had become frantic, terrified, and was running around the room screaming. He could not believe that he had failed two attempts, and did not want to risk a third. The computer was commanding him to return to the seat, otherwise the eggs would be destroyed. Obi-Wan slid into the seat, but the interface would only work for the organism that had started."}, {"tag": "p", "text": "Kenobi grabbed Jesson, and calmed him down. Jesson was very unwilling to possibly doom the last hope for Cestus, but Obi-Wan convinced him to try nonetheless. He sat in the seat, and the countdown to destruction stopped. The computer told him the question, but he faltered. It was so obvious to him that the answer was \"The Spider People\", but his knowledge had failed him before, so he didn't know what to do. Obi-Wan told that that frequently, the simplest answers are the correct ones. His confidence upped, for the moment, he inputted the last answer."}, {"tag": "p", "text": "Wrong. Jesson had now doomed the eggs, his people, and very likely himself and Kenobi, who he had come to realize was truly talented. The computer displayed a hologram of the eggs being vaporized, and Jesson resumed his wailing and sobbing. Obi-Wan plunged his lightsaber into the floor, but to no avail. The eggs had been destroyed. Crying \"Kill me, KILL ME!\", Jesson released pheromones of shame, failure, and ultimate despair. A gas rose up from the floor, and both him and Obi-Wan believed themselves to be finished."}, {"tag": "p", "text": "The gas mixed with Jesson's pheromones, and then revealed that the eggs had not been destroyed. It had all been a test, to see whether or not the motives of the sentient attempting to retrieve the eggs were for the good of the hive. Overwhelmed with relief, they retrieved the eggs (frozen in a carbonite slab), and returned to the antechamber. They heard a sound, which warded off the worms. Jesson thanked Kenobi, and expressed an interest in finding out who the Jedi that had aided Cestus was. As they returned to the Hall of Heroes, he got his wish. The largest statue in the room, and the one they had carved through to enter in the first place, was of Jedi Master Yoda."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}