{"url": "Jetpack/Legends", "categories": ["Category:Legends articles", "Category:Jetpacks"], "nodes": [{"tag": "h1", "text": "Jetpack"}, {"tag": "p", "text": "The jetpack was an aerial personal transportation device used across the the galaxy. A jetpack offered a great degree of mobility in the air, though often at the personal risk of the user."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Jetpacks functioned by use of an intake that pulled surrounding atmosphere into an ignition chamber; arrays of miniature turbines then combined minute amounts of fuel to produce a burst (or \"charge\") of thrust for lift and maneuvering. The thrust produced by this single burst was then regulated by a series of internal regulators that distributed the energy over several seconds. As such, while most jetpacks had a number of set \"charges\" and a minimum \"cool down time\" that varied across given models, the internal regulator's controlled release of these charges gave the impression of continuous operations and flight."}, {"tag": "p", "text": "Stock jetpacks were typically worn on the back, and controlled through wrist and hand controls that adjusted the angle and pitch of intake and exhaust vanes. Though more advanced controls could be used through the use of a HUD. While capable transportation, jetpacks had a number of limitations, most notable being that they required atmosphere to operate; zero, low, or high atmosphere pressure caused numerous difficulties in operation. Further, even under ideal flight conditions the turbines were vulnerable to debris, dust, and other factors - should the intake mechanism become damaged or clogged, the insufficient intake pressures would cause a sudden loss of altitude."}, {"tag": "p", "text": "Jetpacks were typically slower than rocket packs, though were lighter in weight and quieter in operation as a result. Jetpacks were also typically less dangerous in combat than rocket packs, as they contained far less explosive fuel than rocket packs - though they were still subject to explosive failure. Often, repulsor packs provided a safer alternative to both jetpack and rocketpack options, though these devices had their own limitations."}, {"tag": "p", "text": "Some variants of jetpacks had attached wings for stabilization; hydraulics would swing these wings from a folded to an extended position; the clone commandos and the 2nd Airborne Company during the Clone Wars used such a variant for atmospheric insertion."}, {"tag": "h2", "text": "Notable usages"}, {"tag": "p", "text": "During the First Battle of Geonosis, a reek nearly trampled Jango Fett and had damaged his Merr-Sonn JT-12 jetpack. After Jango killed the reek, Jedi Master Mace Windu charged at Jango, who at the last second attempted to activate his jetpack, which failed to ignite. Windu quickly beheaded the legendary bounty hunter."}, {"tag": "p", "text": "Another popular model of jetpack was the Mitrinomon Transports Z-6 jetpack, used by both Jango and Boba Fett. Boba's jet pack was a combination of a rocket launcher, and a jumper pack. The latter found that his jetpack was not always reliable when it was damaged by a semi-blind Han Solo on Tatooine during the Battle of the Great Pit of Carkoon. The misfiring jetpack sent Fett spiraling into the belly of the Sarlacc, but it helped him escape the Sarlacc soon after. The Z-6 was fitted with a top-mounted missile launcher."}, {"tag": "p", "text": "Jetpacks were also worn by Wookiee Berserkers, elite jet and blaze troopers, and Clone Commander Cody during the Clone Wars. Cad Bane also used them during the war, as well as the dreaded bounty hunter Durge. Battle droids and exoskeleton Dark troopers had jetpacks built into themselves."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}