{"url": "Jev_Sunrider", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Humans", "Category:Jedi Masters of the Jedi Order", "Category:Jedi Watchmen", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jev Sunrider"}, {"tag": "p", "text": "Jev Sunrider was a Human male who served as a Jedi Master and Watchman of the Darada system in the decades leading up to the Great Sith War. Around the year 4008 BBY, Sunrider left his family's home on the planet Darada and, along with three other Jedi Masters, set out for the nearby system of Krayiss Two; this mission would ultimately end in the deaths of all four Jedi at the hands of a dark side force. His Force ghost later appeared to his grandson, Andur, in which Jev told Andur that he would play an important role in a coming war."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi Watchman"}, {"tag": "p", "text": "Jev Sunrider was a Force-sensitive Human male who served the Jedi Order around the time of the Old Sith Wars. During his career as a Jedi, Sunrider attained the rank of Jedi Master and became close friends with his fellow Jedi Master Chamma. Sunrider was also appointed as the Watchman of the Darada system and established his family's home within the system, on the planet Darada. There, Jev was present for much of the childhood of his grandson, the young Andur Sunrider. Throughout Andur's early life, Jev taught his grandson much about the history and lore of the Jedi Order, as well as the ever-constant war the Jedi were engaged in against the followers of the dark side of the Force. Due to his grandfather's teachings, Andur made the decision early on that he wanted to follow in Jev's footsteps, and walk the path of a Jedi when he grew older."}, {"tag": "p", "text": "Around the year 4008 BBY, the day before Andur's twelfth birthday, Jev and three other Jedi Masters departed from Darada and set course for the nearby star system of Krayiss Two. There, they discovered a growing dark side force, and the mission ultimately resulted in the deaths of all four Jedi. Following their departure, months passed with no word from Jev or any of his companions; this caused young Andur to fall into a deep depression, fearing that he would never see his grandfather again. Nevertheless, approximately one year after he had left for Krayiss Two, Jev's Force ghost appeared to Andur as he was working in his father's garden. At first, Andur was scared by the specter before him, but Jev's ghost told him to calm himself, and allow any fear to slip away from his mind. At that moment, Jev advised Andur that he would have an important part to play in a coming war, and that he should not resist the role which the Force had laid out for him. However, before Andur could respond to the spirit of his grandfather, Jev's ghost dissipated, leaving his grandson to ponder on his words."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Following the death of his grandfather, Andur completely devoted himself to learning the ways of the Force and was eventually invited by Jev's old friend Chamma to study under him on the planet of H'ratth. Years later, Jev's prophecy to his grandson came true when Andur was killed by criminals in the employ of Bogga the Hutt. As his grandfather had done for him, Andur reappeared as a Force ghost to his wife, Nomi, and encouraged her to pick up his lightsaber and defend herself and their child, Vima. Due to Andur reappearing as a Force ghost to his wife, Nomi was propelled down the road of Jedi knighthood and would play a leading role in helping to defeat the Sith and Krath forces during the Great Sith War."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jev Sunrider was well versed in the history of the Jedi Order and taught much of his knowledge to his young grandson, Andur. Likewise, due to his being a Jedi Watchman, Jev was knowledgeable of the constant war the Jedi were involved in against those who followed the dark side of the Force; because of this Jev continued Andur's teachings by constantly reminding the young boy of the fights between the forces of light and dark. Due to numerous teachings and influences of his grandfather, Andur made the decision as a young man to follow in his grandfather's steps and become a Jedi."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Following his death on Krayiss Two, Jev would use the Force to reappear to his grandson, Andur, as a ghost to tell him that he would play a crucial role in the coming war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Jev Sunrider was developed by author George R. Strayton for the 1996 West End Games roleplaying game source book Tales of the Jedi Companion. The only mention of Jev in the source book consisted of a few sentences incorporated into the introduction Andur Sunrider's entry; there, Jev's story helped establish the backstory for his grandson."}, {"tag": "p", "text": "Though Tales of the Jedi Companion included references to Andur Sunrider's father, who resided at the Sunrider family home on Darada, it did not explicitly confirm that Jev Sunrider was the father to this individual."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}