{"url": "Jhas_Krill", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Anoat sector moons", "Category:Hoth system", "Category:Jungle moons", "Category:Swamp moons"], "nodes": [{"tag": "h1", "text": "Jhas Krill"}, {"tag": "p", "text": "Jhas Krill was the eleventh moon of the gas giant of Jhas, located in the Anoat sector of the Outer Rim Territories. At the tail end of the Galactic Civil War, its sole inhabitants were the Nightsister Shelish and her Wookiee subordinate Owacchi."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Jhas Krill was the eleventh of the twenty-four natural satellites orbiting the gas giant Jhas, located in the Hoth system of the Anoat sector in the Outer Rim region of the galaxy. It was named after Krill, the eleventh letter in the Aurebesh alphabet."}, {"tag": "p", "text": "Because the high pressure on the surface of Jhas caused it to shrink, leading to a conversion of its gravitational energy into heat, Jhas Krill had a warm and wet climate, and was capable of sustaining life. It had a swampy jungle terrain with an abundant flora. It was difficult to establish settlements there, because the soggy soil and the aggressive plant life tended to consume man-made structures."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Toward the end of the Galactic Civil War, Jhas Krill remained largely uninhabited. Nevertheless, it was home to a Nightsister witch named Shelish, who lived in a hut with her subordinate, the former Wookiee pirate Owacchi."}, {"tag": "p", "text": "At some point during the lock down of the entire Anoat sector by the Imperial governor Ubrik Adelhard, the Force-sensitive individual known as the Smuggler visited Jhas Krill repeatedly, in an effort to seek the teachings of the Nightsister hermit and gain new powers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jhas Krill was created for Star Wars: Uprising, a canon mobile game developed by Kabam, Disney Interactive, and Lucasfilm for iOS and Android platforms, and released on September 10, 2015. The moon featured in the \"Dark Side Mission\" series of quests, which unlocked Shelish as a dark side trainer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}