{"url": "Jhor-Kai", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Humans", "Category:Jedi Purge victims", "Category:Males", "Category:Post-Ruusan Jedi"], "nodes": [{"tag": "h1", "text": "Jhor-Kai"}, {"tag": "p", "text": "Jhor-Kai was an elderly Human Jedi. He lived to an old age, surviving on the planet Altikar IV, and eventually called through the Force to a young Twi'lek girl, Sha'lia, asking her to be his apprentice. Though a slave at this time, she escaped from her owner and joined Jhor-Kai on Altikar IV. Jhor-Kai began training her in the Force until he was discovered and killed by stormtroopers; during this skirmish, Jhor-Kai sacrificed his life so that that Sha'lia might escape."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jhor-Kai was a male Human who trained as a Jedi. During the Galactic Civil War, he lived on the planet Altikar IV, and began appearing in the dreams of a Twi'lek slave dancer named Sha'lia, inviting her to join him on the planet. The girl eventually escaped from her owner with the aid of a Trandoshan named Goort, and she and Goort traveled to Altikar IV. There, Jhor-Kai opened Sha'lia to the Force, an overwhelming experience for the Twi'lek, and began to teach her about the Jedi, the light and dark sides of the Force, and how to manipulate and use the Force. He also taught Goort the basics of starship piloting, aided by his own knowledge of the Dosh language."}, {"tag": "p", "text": "One day while training Sha'lia, Imperial forces arrived on Altikar IV and attacked Jhor-Kai in his training area. Jhor-Kai held the Imperial stormtroopers at bay with his lightsaber, buying time for his pupil to escape. His parting words to Sha'lia, before being killed by the Imperials, were to seek out the Alliance to Restore the Republic where she could find other Force-sensitives."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Jhor-Kai later appeared in a vision experienced by Goort. While inside the Temple of Pain, a Sith Temple located inside an asteroid in the Tascollan Nebula, Goort entered the Room of Dreams, a place where the dark side of the Force caused all who entered it to have visions that would bring them closer to giving in to its seductive powers. The vision Goort experienced was about Jhor-Kai's death, and Goort saw the old man falling after being hit by blaster fire from some stormtroopers. In the vision, with some of his last words, Jhor-Kai told Goort to protect Sha'lia and ensure that nothing adverse happened to her. He then screamed and told Goort and Sha'lia to leave quickly."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jhor-Kai was keen to teach others, inviting Sha'lia to Altikar IV to train her in the Force. He was also proficient in piloting starships, and was comfortable teaching this skill to Goort. Jhor-Kai was selfless enough to die in order to buy time for Sha'lia and Goort to escape the Imperial presence."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Jhor-Kai was skilled enough in the Force to appear across the galaxy in a vision to his chosen apprentice Sha'lia. He was knowledgeable about the Jedi and the Force, and was skilled with a lightsaber. Despite this, in later years, Sha'lia was unsure whether Jhor-Kai was actually a Jedi, or merely claimed to be one."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jhor-Kai was created by Lee Pickler for the Child of Light saga, a series of three roleplaying adventures for the Wizards of the Coast RPGA. Jhor-Kai himself never appeared in any of the adventures but formed part of the backstory of two player-characters, Sha'lia and Goort. All the information given about Jhor-Kai is from the perspective of either Sha'lia or Goort. While there is some doubt in Sha'lia's mind as to whether Jhor-Kai was a Jedi, all other evidence points to Jhor-Kai being a Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}