{"url": "Ji-Ad_Sarain", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Ji-Ad Sarain"}, {"tag": "p", "text": "Ji-Ad Sarain was a male Human Jedi Knight serving the Jedi Order and the Galactic Republic during the final decades of the Republic Classic era."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Sent to the Coruscant Jedi Temple during infancy after being discovered to be Force-sensitive, Ji'Ad Sarain was trained in the ways of the Force at the Temple's academy. Eventually graduating and being selected as a Padawan by a Jedi Master, Sarain went onto to complete his training and was made a Jedi Knight after passing his Trials of Knighthood. Serving the Jedi High Council from the Coruscant Temple, Sarain readily accepted any mission they prepared for him."}, {"tag": "p", "text": "Circa 47 BBY, Sarain was dispatched to the Cularin system by the High Council to infiltrate Riboga the Hutt's slaving ring. Going deep undercover as a mercenary, Jedi Sarain's presence wasn't even known to the Almas Academy, the system's local Jedi academy. Having been successful in penetrating Riboga's organization, Sarain attempted to contact the Almas Academy for extraction when he had prepared a group of slaves to escape. However, during the escape attempt, Sarain was discovered and detained by the Rodian Gomalo, who froze the Jedi in carbonite. While Sarain survived the ordeal, he was loaded aboard Gomalo's transport as the slaving compound was evacuated in fear of a Jedi raid. While the Jedi intercepted Gomalo's ship in orbit, the Rodian's ship managed to escape into hyperspace, though he sustained damage during the ordeal."}, {"tag": "p", "text": "While the Jedi believed Sarain to have perished during the fighting, he had in fact been dumped in a nebula that was located close to the world of Cularin. While Gomalo was eventually arrested, he had logged coordinates to the Jedi's carbonite-protected body in a bas-relief that had been confiscated by the group that arrested the slaver. Sold at auction and passing through several hands, the sculpture was eventually turned over to a Tynnan couple. Nog Teleus and his wife, Cham, prepared the art for an exhibit commemorating the 125th anniversary of the Cularin Compact where it would be available for viewing by the general public. During the show, the art piece was stolen by the escaped Gomalo who attempted to race to the nebula and retrieve Sarain's body. However, Gomalo was arrested once more by Ezra Du'Re, a freelance agent that managed to recover Sarain in the process. Taking the carbonite-imprisoned Jedi to Almas, Sarain was thawed out at the Academy and rehabilitated on Coruscant in the Temple's Halls of Healing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}