{"url": "Jiandy", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Articles to be expanded", "Category:Males", "Category:Nautolans"], "nodes": [{"tag": "h1", "text": "Jiandy"}, {"tag": "p", "text": "Jiandy was a male Nautolan. His mother, Clariah, was an old acquaintance of Lando Calrissian. When he was young, he had a dream of building a criminal empire, which his mother disapproved of. Jiandy eventually became a member of the Rebel Alliance."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "When Jiandy was young, his mother Clariah brought him to visit her old acquaintance Lando Calrissian in Cloud City. Clariah sat down to talk with Lando, and explained that she needed his help putting a stop to Jiandy's recent behavior- he had been skipping school, spending time with suspicious people, and had expressed a desire to someday lead a criminal empire like Jabba Desilijic Tiure. While Clariah spoke with Lando, Jiandy went to join a card game elsewhere in the room. He pretended to be a novice player while cheating his way into a win, then tricked his opponents into fighting each other in order to make his getaway. Seeing this, his mother was horrified, but Lando was impressed enough that he agreed to try to convince Jiandy to see the error of his ways."}, {"tag": "p", "text": "As Lando led Jiandy out to the streets of Cloud City, Jiandy asked him why he gave up being a criminal, but was dissatisfied with Lando's answer that it was more trouble than it was worth. As they turned a corner, they came upon a man being threatened in a back alley by some gangsters. The gangsters' leader, Askroh, was wearing a brooch that caught Jiandy's eye. Ignoring Lando's warnings, Jiandy snuck up on Askroh and stole the brooch off of his coat. At first it seemed as though he had pulled off the theft successfully, but as he went back to Lando, he turned around to see the gangsters right behind him, blasters drawn."}, {"tag": "p", "text": "Jiandy, with Lando in tow, stole a speeder bike to try to get away. As Lando tried to give Jiandy directions, the Nautolan outlined his ideas for how he and Lando could team up and start a criminal empire. Jiandy had to take a quick turn to avoid a gangster driving right towards them, and wound up cornered at the end of a platform. Askroh told the two of them that he would let them go if they returned his brooch, but Jiandy insisted it was all a misunderstanding, and when the other gangsters patted him down they found nothing."}, {"tag": "p", "text": "However, as Askroh threatened to have them thrown off the platform, Lando confessed that Jiandy had hidden the brooch in a secret compartment on his belt. Jiandy protested that gangsters didn't betray members of their \"family\" like that, but Lando told him that backstabbing was just a part of life as an outlaw. As he was about to be thrown off the edge, Jiandy begged for forgiveness, and promised he wouldn't try to be a gangster anymore. Askroh agreed to let him go, as long as he kept his word. As soon as he was released, Jiandy cursed at Lando in Huttese and ran away."}, {"tag": "p", "text": "A few years later, Jiandy became a member of the Rebel Alliance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jiandy was a male Nautolan, with blue skin and large black eyes. He had bands of darker blue around the tendrils on his head, and orange circles around his eyes. He had a strong desire to be part of a family, and to have a sense of belonging."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}