{"url": "Jib_Kopatha", "categories": ["Category:Legends articles", "Category:Bothans", "Category:Information brokers", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jib Kopatha"}, {"tag": "p", "text": "Jib Kopatha was a male Bothan information broker stationed on Void Station, he was killed by Darth Vader for his failure to provide information."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Working on Void Station, Koptha began giving information to the Galactic Empire. After not receiving any information from Kopatha for months, Darth Vader lost patience with the Bothan. He went to Void Station, where he warned Kopatha that he would have to provide information regarding the Rebel Alliance in order to live."}, {"tag": "p", "text": "Kopatha complied and tried to persuade Vader to stay in the city for a few days, offering him various delicate foods and women, but was turned down. Soon, Han Solo and Chewbacca arrived on Void Station on a mission for the Alliance. They were betrayed to Kopatha by one of Han's former associates, Sheel Odala; she owed money to Kopatha. When Odala arrived back at the sabacc table, she gave Han a kiss, and then Solo and Chewbacca were surrounded by Trandoshans. She explained to the two smugglers that she had no choice."}, {"tag": "p", "text": "Kopatha had Solo tortured by a Dug to extract useful information while Odala watched, though Chewbacca escaped. Kopatha generously allowed her to leave with her ship and a souvenir, Han's DL-44 heavy blaster pistol. At the hangar, Odala met Chewbacca and planned to free Solo. They sneaked through the ventilation and killed the Dug, allowing Han to escape. Kopatha was unable to stop them and called for his guards."}, {"tag": "p", "text": "At that moment, Vader arrived once again and confronted the Bothan. He grabbed the Bothan by the throat and told Kopatha he failed to give him information. When Kopatha stuttered that he captured a Rebel, Vader released him, but was not pleased that the Rebel has escaped. Vader swung his lightsaber blade at the Bothan, killing him for his failure. Vader walked away from the body as the lights went off."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kopatha was a greedy individual who had no loyalty to any affiliation, only providing information to the Empire to save his skin. Despite his greed, he could be \"generous\" at times."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kopatha was portrayed two different ways between his comic appearances, first with a snout and without. There has been several retcons concerning the appearance of Bothans in the Expanded Universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}