{"url": "Jik%27Tal", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Jawas", "Category:Males", "Category:Mercenaries"], "nodes": [{"tag": "h1", "text": "Jik'Tal"}, {"tag": "p", "text": "Jik'Tal was a male Jawa who left Tatooine to seek a life of adventure, eventually finding work as an enforcer at Bantha Traxx on the planet Lianna. Jik'Tal grew up dreaming of the stars, and, after being banished by his clan for violating the Jawa vow of non-violence, he departed Tatooine for good, accompanied by seven of his loyal companions. He found work under Yin Vocta on Lianna and was vigorously trained by the mercenary Ne'Chak. He continued serving Vocta for many years."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jik'Tal was born into a Jawa clan on the planet Tatooine, which was situated in the Outer Rim. Jik'Tal, however, was quite different from the average Jawa who roamed the deserts. As a youth, he was extremely restless, and yearned to leave his homeworld and travel the galaxy. His craving of adventure meant he gained a strong following with other, younger Jawas, who were extremely loyal to him. Jik'Tal spent much of his childhood and adolescence sitting atop one of his clan's vast sandcrawlers, examining the stars and wondering what wonders might await him should he leave Tatooine and venture into unknown territories."}, {"tag": "p", "text": "After spending many restless and boring years on Tatooine, Jik'Tal was presented with an opportunity to leave forever. Jawas made their living by traveling around the deserts of their homeworld, scavenging damaged or abandoned droids, which they would patch up and sell on to the local moisture farmers. Their wares were rarely up to scratch, though unhappy farmers were usually unable to complain, as the Jawas departed in their sandcrawlers almost immediately after a sale."}, {"tag": "p", "text": "One such disgruntled farmer managed to find the Jawas who had sold him a faulty droid—it had exploded, damaging one of the moisture vaporators which were essential to his survival on the parched planet. Incensed, the man demanded that the Jawas compensate him, though the clan refused. Unable to hold back his fury, the moisture farmer attacked them, though before it could become a rout, Jik'Tal saved his clan by dispatching the irate man."}, {"tag": "p", "text": "Jik'Tal had saved his clan from certain death, but was punished accordingly for breaching the Jawa way of non-violence. Though he had rescued his clan, Jik'Tal was banished, sentenced to make his own way to civilization. A bitter Jik'Tal took his possessions, and along with seven of his most loyal companions, found passage offworld, vowing never to return again. His companions joined him out of admiration, though they each feared him and his violent tendencies."}, {"tag": "h3", "text": "Working for Vocta"}, {"tag": "p", "text": "Jik'Tal and his fellow Jawas boarded the first transport off Tatooine, and ended up on the planet Lianna, where they found work in the employ of Yin Vocta; an Anomid criminal and information broker masquerading as an honest businessmen. Vocta was the proprietor of Bantha Traxx, an eating establishment on Lianna, and was in need of additional security to cover when his two foremost enforcers, the Gand R'Kayza and the cyborg Haelon Tice, were away on \"business.\" Many ridiculed both Vocta and his team of Jawas for this appointment, though after receiving painstaking drilling and training by an expert Rodian mercenary named Ne'Chak, Jik'Tal and his companions were a force to be reckoned with."}, {"tag": "p", "text": "Garbed in black leather robes, the Jawas were licensed to carry nothing more than a stun pistol and a stun baton, as Vocta maintained a strict no-weapons policy in Bantha Traxx. Jik'Tal, however, carried two deadly vibroblades on his person at all times, and also kept several mini-grenades close by for any particularly rowdy customers. The Jawas proved excellent security guards; intelligent and ferocious, they could easily and swiftly maneuver through large crowds, and were able to take down larger opponents through swarming and teamwork."}, {"tag": "p", "text": "Jik'Tal continued serving Vocta for several years, often turning demeaning comments about his size into vicious full-scale melees, though his opponent always came out worse for wear. Vocta did not discourage such brawls, and often watched with interest as his seemingly outmatched Jawa security force trounced an arrogant customer."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jik'Tal was quick to anger, and any comments about his size were responded to severely. As a youth, Jik'Tal was restless and bored with his mundane existence on Tatooine, and sought adventure offworld. He was also quite violent, especially for the usually peaceful Jawas, though, at least in his youth, he attempted to only use violence when necessary."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jik'Tal was created by Star Wars author Paul Danner for Wretched Hives of Scum & Villainy, and was illustrated by Brian Schomburg. He also received a mention in the 2003 sourcebook Ultimate Alien Anthology, where \"Jik'tal\" was used as an example Jawa name. Later, Jik'Tal was given an entry in 2008's The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}