{"url": "Jilruan/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Hutt Space species"], "nodes": [{"tag": "h1", "text": "Jilruan"}, {"tag": "p", "text": "The Jilruans were a sentient species from the planet Jilrua, located in the Mid Rim portion of Hutt Space near the Oktos Nebula. Having been conquered by the Hutt species, they served Hutts, t'landa Til, and Yahk-Tosh in various roles. Many Jilruans fought in the Xim Wars, with many dying in the Second Battle of Vontor. Some Jilruans served as attendants to Lord Gar-Oth, a Yahk-Tosh warlord. Having conquered a planetoid, the warlord was attacked by Princess Lourdes, heir to the planet's monarchy. When he overpowered her, one of the Jilruan attendants requested permission to carry out the killing stroke, but was prevented by one of Lourdes' aides. Lord Gar-Oth's attendants were later crushed by the warlord's own droid, Goliath."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Jilruans were a sentient species. Towering and war-like, the Jilruans had two arms that ended in five-fingered hands. They had blue skin, yellow eyes, no discernible nose, and white teeth. While in service to Lord Gar-Oth, Jilruans wore purple robes with hoods that cast their face into shadow, although their glowing eyes to remain visible."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Jilruans evolved on the planet Jilrua, located near the Oktos Nebula. Their desert homeworld was conquered millennia prior to the Battle of Yavin by the Hutt species, becoming part of Hutt Space. They were integrated into Hutt society as gladiators, retainers, and attendants for not only their Hutt overlords but also members of the t'landa Til and Yahk-Tosh species as well. Although found offworld in that capacity, their homeworld itself was rarely visited by offworlders."}, {"tag": "p", "text": "In the year 25,100 BBY, Jilruan flecheteers and cavalry equipped with Cyborrean battlemounts contributed to the militia forces of Hutt general Kossak Inijic Ar'durv, and fought in the Second Battle of Vontor against the forces of Xim the Despot. These Jilruan units, fighting alongside Cyborrean and Weequay mercenaries, suffered massive casualties, but managed to decimate the last of Xim's organic forces, his Duinarbulon Star Lancers."}, {"tag": "p", "text": "During the Yuuzhan Vong War, which raged from 25 ABY to 29 ABY, Hutt Space initially remained officially neutral. However, when the extra-galactic Yuuzhan Vong learned that the Hutts were selling intelligence on Yuuzhan Vong military movements to the New Republic, they invaded Hutt Space. Several Jilruans engaged the Yuuzhan Vong in combat as part of a multi-species, Hutt-commanded militia."}, {"tag": "h2", "text": "Jilruans in the galaxy"}, {"tag": "p", "text": "At least one Jilruan worked as a pirate during the Kymoodon Era. This Jilruan ended up being captured by authorities on the planet Belasco, and—while in custody—divulged that the Utoradii kajidic was planning a raid on the planet Parcovey Minor. The tip allowed the Belasco Free Volunteers to rush to Parcovey Minor and foil the raid."}, {"tag": "p", "text": "In 31 BBY, a number of Jilruans served Lord Gar-Oth, a Yahk-Tosh warlord with significant droid forces. While prospecting for an easy world to conquer and add to his Empire, Gar-Oth selected a small planetoid ruled by a monarchy of elfish humanoids. Gar-Oth invaded the world, murdered its king, and, in order to gain legitimacy in the eyes of the world's residents, tried to force the king's daughter Princess Lourdes to marry him. During Gar-Oth's administration of the planetoid, his Jilruan attendants stayed close to his side, translating his commands from Yahk-Tosh into the local language."}, {"tag": "p", "text": "Lord Gar-Oth's plans were interrupted when the newly promoted Jedi Knight Yoshi Raph-Elan crash-landed on the planetoid. Evading Gar-Oth's droid forces, he met Princess Lourdes on the evening of her engagement ball and learned of the situation. Raph-Elan declared himself Lourdes' husband, prompting a violent confrontation. Learning he was a Jedi, Gar-Oth ordered his droid forces to attack Raph-Elan. In the ensuing confusion, Lourdes stole a blade from a Jilruan attendant and tried to kill Gar-Oth. The quick Yakh-Tosh evaded the strike and began to strangle the woman in rage. At that point, one of the Jilruans volunteered to kill the princess on Gar-Oth's behalf. Prevented from interfering at blaster-point by a local resident, Skeeter, the Jilruan watched as, in a sudden reversal, Lourdes stabbed and killed Gar-Oth. Meanwhile, Raph-Elan destroyed Gar-Oth's largest droid, Goliath, causing it topple and fall on the Jilruan attendants."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Jilruans first appeared in Star Wars 27, a stand-alone issue in the Star Wars: Republic series published by Dark Horse Comics. The issue, written by Doug Petrie and published in 2001, never identifies the Jilruans, who serve only as background characters. However, in 2009, the species was identified in The Essential Atlas, as confirmed by Jason Fry and Daniel Wallace in two blog entries. They later appeared in two illustrations in The Essential Guide to Warfare, published in 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}