{"url": "Jimas_Veltraa", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Republic Navy admirals"], "nodes": [{"tag": "h1", "text": "Jimas Veltraa"}, {"tag": "p", "text": "Jimas Veltraa was an admiral in the Republic Navy who served in the early days of the Mandalorian Wars. By 3964 BBY, Veltraa was in command of his own flagship, Reliance, and served on the Jebble-Vanquo-Tarnith line, meant to guard the Outer Rim world of Taris from Mandalorian marauders. That year, the Mandalorians broke out toward Taris, and the line was shattered—Veltraa reformed what was left of the Republic fleets into a patchwork force protecting the world. Although Veltraa and his forces held out to the end, Reliance was destroyed and Veltraa killed in action during the Mandalorian siege. Veltraa was honored for his valor on the Republic capital of Coruscant and later had a Republic warship named after him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male, Jimas Veltraa was an admiral in the Republic Navy in the years following the Great Sith War. Although by 3964 BBY the epic battles with the Sith had passed, the Galactic Republic, and the Navy that Veltraa served, found itself facing a new enemy when the Mandalorian warrior clans started a crusade against the Republic on the Outer Rim. As the Mandalorians began to threaten resource worlds near the ecumenopolis of Taris, the Navy formed a defensive cordon known as the Jebble-Vanquo-Tarnith line. By then, Veltraa was in command of his own flagship, Reliance. Eventually, the line collapsed, and the Mandalorians broke out toward Taris after a diversionary attack on the planet Vanquo. Forced to choose between minding the frontier and the home front, Veltraa, alongside Admiral Noma Sommos, reacted by reforming the remnants of the Outer Rim fleets into a makeshift force protecting Taris. Although Veltraa held out in the face of the invaders, Reliance was destroyed in the Mandalorian attack on Taris, with all hands, including the admiral, lost."}, {"tag": "p", "text": "Veltraa was memorialized on the Republic capital of Coruscant and honored for his heroism, with Supreme Chancellor Tol Cressa giving a speech crediting Veltraa with delaying the Mandalorian siege. Although there was talk of renaming a new class of warship recently approved for construction at Corellia after Veltraa, the Chancellor supported keeping the original name, the Interdictor-class, which Veltraa had proposed. In the wake of Veltraa's death, newly promoted Admiral Saul Karath, who was not able to attend the Coruscant ceremony, sent a message honoring the late admiral and dedicated his next campaign against the invaders to Veltraa's memory. These events were described in an edition of The Admiral's List, the official publication of the Republic Navy, dedicated to Veltraa's memory. In addition, a Republic Hammerhead-class cruiser was named after the late admiral—the Veltraa was ready for action by the next year, becoming the first command of Captain Dallan Morvis."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "After his death, Veltraa was renowned for his bravery and valor in combat, and his ability to effectively organize and command disparate forces in desperate times. Veltraa was also known for his chilly view on irregular military units, being quoted as saying \"you'd rather rent than own.\""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Admiral Veltraa was first mentioned in Knights of the Old Republic 8, a comic written by John Jackson Miller and released in 2006—not until The Admiral's List: Jimas Veltraa Memorial Edition, an in-universe news report appearing on the last page of Knights of the Old Republic 13, was his first name given as Jimas. Veltraa was also mentioned in Miller's 2011 novel, Knight Errant, along with the Knights of the Old Republic Campaign Guide and an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}