{"url": "Jinda/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Jindas", "Category:Non-native Endorian species"], "nodes": [{"tag": "h1", "text": "Jinda"}, {"tag": "p", "text": "The Jindas were a bipedal sentient species who were herbivorous and could be easily recognized by their characteristic pom-pom tufts of hair and the markings which covered their bodies. Jindas were noted for their energetic nature and desire to entertain others with their natural performing skills which included juggling, magic, dancing, music, and storytelling. However, the species suffered from a poor long-term memory and sense of direction which gave them a reputation for getting lost."}, {"tag": "p", "text": "One group of Jindas departed Eriadu around 130 years before the Battle of Yavin aboard the starship Free Enterprise, bound for Kuna's Eye in the Moddell sector. However, their ship crashed on the forest moon of Endor, and the survivors found themselves stranded. The tribe established an agricultural settlement under the protection of the powerful being known as the Rock Wizard but were exiled when the Rock Wizard mistakenly accused them of attempting to poison him. Cursed by the Rock Wizard to never be able to settle in one place, the Jindas became a nomadic tribe, taking the name \"The Travelling Jindas\" and wandering the surface of the moon, using their skills to entertain its other inhabitants. In 3 ABY, the tribe enlisted the help of the Ewoks of Bright Tree Village in making peace with the Rock Wizard and were allowed to return home. However, their fate remained unknown to the rest of the galaxy until they were discovered by Rebel traders following the Battle of Endor in 4 ABY."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Though some believed Jindas to be distant cousins of the Ewoks of Endor, they were in fact a non-Endorian species and one of many whose members became shipwrecked on the forest moon over time."}, {"tag": "p", "text": "The Jindas were a bipedal sentient species, which varied in size from slender to rotund with an average height between that of an adult Ewok and a Dulok. They could be recognized by their characteristic pom-pom tufts of hair, which could be either red or brown in color, and their red or black noses. Jindas had two eyes, which were mostly white, with a colored iris around the pupil. Iris colors included blue and green. Their feet were larger than those of Ewoks and each had three digits, while they had four digits on each hand, while Ewoks had only three. They had large mouths filled with blunt, cube-shaped teeth. The teeth marked them as a herbivorous species, and Jindas were known to be fond of eating."}, {"tag": "p", "text": "Jindas' bodies were mostly a pale brown color, but variations in shade made some darker than others. They bore markings that varied in shape and pattern covering the upper body and forming a band around the neck. Although generally red in hue, these markings could take on a variety of shades, both lighter and darker than the main body color. The necks had the ability to expand, making them appear larger than they actually were. This ability served two purposes—as a defensive mechanism when the Jinda was threatened or as a display which was used by males when attempting to impress a female. Though they were a land-dwelling species, Jindas were able to swim in water and were known to do so recreationally."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Jindas were a genial species who were said to always have a smile for strangers and displayed a high level of energy, regardless of their physical condition. They had an inborn talent for performing and enjoyed using their talents to entertain others. Though they excelled in performing, Jindas were lacking in other abilities, displaying a poor sense of direction and a limited long-term memory. This poor memory and sense of direction was notable among the Jinda tribe living on the forest moon of Endor, who were notorious for getting lost. It was said among the native Ewoks that once the Jindas left a village, they would never return."}, {"tag": "p", "text": "Jinda society was based around entertainment; they used their natural performance skills to entertain others and made no distinction between work and play. They had a variety of skills including training performing animals, magic acts, juggling, and music, with instruments including wind, string, and percussion. Dancing was another Jinda activity, and female dancers proved popular with males of other species, including Duloks and Skandits. They were very confident in their skills as entertainers and, in the absence of a willing audience, were happy to perform to even the most blasé or unintelligent lifeforms, such as the tree-dwelling choreamnos goats on Endor. Jindas were also fond of storytelling, though their poor long-term memory gave them a habit of embellishing their tales. In this, their poor memory proved advantageous as the unintended exaggerations tended to make their stories more entertaining for the listeners. However, no matter how much a Jinda might exaggerate, their stories were always based around a central truth."}, {"tag": "p", "text": "As performers, Jindas typically wore colorful stage costumes, even as casual attire. A variety of hats were common among both genders, as was footwear. Males often wore loose fitting garments on the upper body, typically secured by a belt around the waist, while baggy pants or leggings were worn over the legs. Female Jindas also tended to wear pants but wore tighter fitting garments on the upper body which often left the midriff exposed. Veils covering the face and neck beneath the eyes were also popular among females."}, {"tag": "p", "text": "The Jinda tribe on Endor was initially a farming community. They grew their own vegetables in fields plowed using large beasts of burden called awors and survived on meals made from the resulting crops. The Jinda love of food was evident in their cuisine, which the Rock Wizard considered to be the best he had ever tasted. The tribe later became nomadic, spending their time wandering the vast distances between settlements. They traveled aboard the same beasts who had once plowed their fields, with their performing equipment and dwellings fastened to the beasts' backs. When stopped, the tribe would set up a temporary camp, using tents and portable huts as accommodation while their beasts rested. The Travelling Jindas used their talents to entertain the lifeforms they encountered on their travels, moving from town to town and putting on a performance for the inhabitants. In return for the entertainment, the Jindas asked only for one night's hospitality, though they would accept tips in any form. Although their performances were generally well received, some natives of Endor considered them to be freeloaders. They were a peaceful group, having no enemies on Endor, and often acted as neutral parties, carrying messages between the moon's warring inhabitants. Though not native to Endor, the group were able to communicate with native species, including the Ewoks and Duloks."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Curse of the Jindas"}, {"tag": "p", "text": "Jindas were known to the wider galactic community as early as 130 years before the Battle of Yavin. Around 130 BBY, several hundred Jinda and Tulgah settlers departed Eriadu, bound for Kuna's Eye in the Moddell sector aboard the colony starship Free Enterprise. The vessel never reached its intended destination, crashing on Endor and stranding both groups on the unfamiliar forest moon. The Jindas adapted quickly, however, and were able to make a new home for themselves. They established a stable agricultural settlement on Endor near the fortress of the Rock Wizard, a Force-sensitive being with whom they enjoyed a mutually beneficial relationship; in exchange for the Rock Wizard's protection, the Jindas provided him with their finest cuisine, produced from vegetables grown in their fields. The Jindas were content in their new lives and never ventured far from home."}, {"tag": "p", "text": "During one of his meals, the Rock Wizard lost a tooth, causing him considerable pain and leading him to conclude that the Jindas had attempted to poison him. The Rock Wizard chased the Jindas from their home and cast a spell that would cause the rocks to rise up and attack them if they ever returned or stayed in one place for too long. Under the leadership of the Jinda Bondo, the tribe became nomadic, taking the name \"The Travelling Jindas\" and wandering across Endor, using their talents to entertain the native species and trading with those they encountered, including Gupins and Duloks. Their poor sense of direction meant that encounters with the more hostile Dulok tribes were infrequent, but also made it difficult for them to find tribes of their favorite audience, the native Ewoks. The Ewoks came to refer to this poor directional sense as \"The Curse of the Jindas\" and adopted the name \"Jinda\" as a derogatory term for nomadic members of their own species who shunned their traditional sedentary lifestyle. Ever fond of a good story, Jinda chroniclers would tell the tale of their former life and exile at the hands of the Rock Wizard."}, {"tag": "h3", "text": "Visit to Bright Tree Village"}, {"tag": "p", "text": "In 3 ABY, the Travelling Jindas came upon Bright Tree Village, an Ewok settlement on the forest moon. As they entered the village, Bondo was met by Chirpa, the Ewok chieftain, and offered to put on a show in return for the Ewoks' hospitality for the night. Though some in the village considering the Jindas to be merely freeloaders, Chirpa agreed to let them stay, and that night the Jindas put on a show for the Ewoks featuring performances by the animal trainer Chituhr, the magician Trebla, and a group of female dancers. The show was well received by the Ewoks, and Chief Chirpa thanked Bondo as the Jindas prepared to leave the following morning. One Ewok, however, was particularly inspired—the young Ewok musician Latara decided to leave with the Jinda tribe in order to learn from the tribe and sharpen her own skills. Only after leaving Bright Tree Village did the Jindas discover that Latara had stowed away in their equipment. Nevertheless, the tribe welcomed her into their number, and Bondo soon put her to work washing their performing costumes."}, {"tag": "p", "text": "The tribe continued on their way, unaware that Latara's presence had attracted pursuers—the Ewok shaman Logray had dispatched Wicket Wystri Warrick, Kneesaa a Jari Kintaka, Teebo, and Paploo to retrieve the runaway Ewok, while a pair of Duloks sought to capture her to present to their leader, King Gorneesh. The following night, the Travelling Jindas stopped in a clearing in the forest and decided to perform for a group of choreamnos. Latara was enlisted for her first performance, as the assistant in Trebla's magic act. It wasn't long before Latara realized that Jinda life was not as she had imagined and asked Bondo to take her home, but by this point the Jindas were already lost and had no idea how to find Bright Tree Village. The other Ewoks soon caught up with the Jinda tribe, but Latara was already gone—kidnapped by the Duloks when she ventured away from the Jinda camp."}, {"tag": "p", "text": "Bondo agreed to help the Ewoks rescue their friend. With the Ewoks disguised as Jindas, the Travelling Jindas headed for the swamp where King Gorneesh's tribe resided and offered to perform for the Duloks in exchange for camping in the swamp that night. During the show, Bondo spotted the captive Latara among the audience and selected her to assist Trebla. Gorneesh agreed to allow it, unaware that the Jindas were planning an illusion that would allow Latara to flee with the other Ewoks, who were waiting atop the stage. However, when Paploo fell from the stage, the Duloks realized the deception and gave chase. Bondo turned the tribe's awors on the advancing Duloks, giving the Ewoks time to escape, before he and the other Jindas packed up their equipment and made a discreet exit."}, {"tag": "h3", "text": "Return home"}, {"tag": "p", "text": "Later that year, the Travelling Jindas stopped to relax near a waterfall on the forest moon. Despite warnings from Trebla that staying too long would incur the wrath of the Rock Wizard, Bondo and the other Jindas were enjoying their relaxation and were reluctant to move on. As Trebla had feared, after several days near the waterfall, the boulders began to rise from the ground and attack the tribe. Bondo quickly had the tribe pack up their belongings, and they moved on once more, soon coming across a nearby Skandit settlement, where they offered to perform in return for hospitality. The Skandits agreed, but as the Jindas unpacked, Bondo heard the sound of a flute coming from the village; following the sound, Bondo discovered that Latara and several other Ewoks had been captured by the Skandits and were being held prisoner. That night, as the Jindas performed for the Skandit tribe, Trebla and a pair of Jinda dancers incapacitated the Skandits guarding the Ewoks and released them. Providing the Ewoks with a Jinda stage costume designed for several beings as a disguise, Trebla instructed them to flee to safety. The Ewoks, however, took a wrong turn and found themselves on the Jinda stage during the show. When the Skandits realized that the Ewoks were inside, they chased the escapees, but the Jindas quickly loaded their equipment and carried the Ewoks to safety aboard their beasts."}, {"tag": "p", "text": "The Ewoks led the Jindas back to Bright Tree Village, where Chief Chirpa thanked the tribe for returning their missing youngsters. Moments later, several floating boulders emerged from the forest and attacked the Jindas. Chirpa offered the Jindas the sanctuary of his village as thanks for their assistance, and both tribes retreated to the trees. Once safely out of reach of the menacing boulders, Bondo explained about the curse to the Ewoks, who offered to help the Jindas free themselves and return home. Logray and his assistant Teebo called upon the power of the Light Spirit to draw several forest creatures to the village. The animals tethered the boulders to the ground with long lengths of rope, allowing the Jindas to safely return to the ground. However, this only prompted the ire of the Rock Wizard, who came to confront the Jindas and the Ewoks in person. The Rock Wizard attacked both groups until he noticed that his tooth was being used as a necklace by the Ewok Kneesaa a Jari Kintaka. When she explained that they had purchased it from a trader, the Rock Wizard realized that the Jindas had not been responsible for his pain. Taking the tooth back, he called off the curse and allowed the tribe to return to their home."}, {"tag": "p", "text": "In 4 ABY, the Alliance to Restore the Republic destroyed the second Death Star, a battlestation constructed by the Galactic Empire in orbit of Endor. Following the Battle of Endor, Alliance traders discovered the Travelling Jindas, along with the flourishing Tulgah population, on the forest moon, and the galaxy finally learned the fate of the Free Enterprise."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jindas were created for \"The Travelling Jindas,\" the fifth episode of the first season of the Ewoks animated television series, written by Bob Carrau and first broadcast on October 5, 1985. Carrau later reused the species in the show's seventh episode, \"The Curse of the Jindas.\" In 2004, \"The Travelling Jindas\" was compiled with three other episodes into the feature-length DVD film Tales from the Endor Woods."}, {"tag": "p", "text": "Early sources to reference the Jindas, including the second and third editions of A Guide to the Star Wars Universe and the Star Wars Encyclopedia, described them as a tribe of Ewoks, and the nomadic Jindas that appeared in the 2003 MMORPG Star Wars Galaxies were depicted as visually similar to Ewoks. In 2001, authors Daniel Wallace and Robin Pronovost wrote an article entitled Castaways of Endor for the Star Wars Gamer magazine, which included information and roleplaying stats for several species from Star Wars: Ewoks, including a section on Jindas written by Pronovost. During the course of writing the article, Pronovost discovered that the Star Wars Encyclopedia had described the Jinda leader Bondo as an Ewok. Noting the numerous visual discrepancies between the depiction of Jindas and Ewoks in the original cartoons, the two ultimately established that the Jindas from Star Wars: Ewoks were just one tribe from a non-Endorian species which had become stranded on the planet. However, Star Wars Gamer was canceled before the article could be published, and it was not until 2008 that the article was finally released through Hyperspace. By this time, the Ewok-like Jindas had been included in Star Wars Galaxies, and the term \"Jinda\" was retconned to have been adopted by the Ewoks for nomadic members of their own species."}, {"tag": "p", "text": "The roleplaying elements of Castaways of Endor were ultimately excluded from the final article, but Wallace later made them available through his website. This material includes roleplaying stats for a \"Jinda Commoner,\" revealing an ability to speak the \"Old Jinda\" language as well as Ewokese and extending their habit of getting lost to their piloting abilities. Two adventure ideas involving the Jindas are also included—one in which the players encounter a Jinda pilot who miscalculates a hyperspace jump, leading them into danger in an uncivilized region of the galaxy, and one in which the players discover that a group of Duloks have taken Jindas, Ewoks, Gupins, and Wisties captive to be sold into slavery."}, {"tag": "p", "text": "The 1997 Star Wars: The Roleplaying Game supplement Lords of the Expanse included a Jinda system located in the Tapani sector. The Jinda system has since been listed in the appendix to 2009's The Essential Atlas. Lords of the Expanse predates the Jindas being established as a non-Endorian species in Castaways of Endor, and whether the Jinda system is intended to be their home system is unclear."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}