{"url": "Jinkins", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Bith", "Category:Males", "Category:Pirates", "Category:Resistance fighters", "Category:Technicians"], "nodes": [{"tag": "h1", "text": "Jinkins"}, {"tag": "p", "text": "Jinkins was a male Bith who served as an engineer and general aide to the pirate captain Nym, in the years surrounding the Invasion of Naboo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jinkins was originally an engineer with the Nubian Design Collective, and the lead engineer on the Scurrg H-6 bomber, a prototype model designed for the Naboo Space Fighter Corps. After the Naboo rejected the design, the Nubians scrapped the project, though Jinkins was not about to let his work go to waste. He arranged a deal with the Feeorin pirate Nym, who stole the prototype and took Jinkins along with it."}, {"tag": "p", "text": "Joining the Lok Revenants, Jinkins served as sensor and scanner operator aboard the newly christened Havoc, and Nym considered his new comrade the best engineer in the galaxy,[source?] rivaled only by the shipwrights of Charros IV. Though Jinkins worked aboard the Havoc, he often piloted his own vessel, the Freefall. After an unfortunate run-in with Vana Sage, Jinkins and his wingmate Kole were jettisoned from the space station, and Nym was handed over to the Trade Federation. Jinkins and Kole later infiltrated Nym's cell while masquerading as masters of torture. Jinkins also engaged in patrols around Nym's hideout on Lok, though he was almost killed during one such scout mission that coincided with a full-scale invasion by the Trade Federation. The Revenants fled Lok but continued to harry the Federation for the next decade."}, {"tag": "p", "text": "When the Revenants were on the run, they accepted odd jobs to survive, such as a movie on Rodia or to hunt down the infamous pirate Sol Sixxa. During the hunt for Sixxa, Jinkins was the engineer on the Sunrunner. Their hunt ended with the apparent death of Sixxa, although in reality he and Nym joined forces."}, {"tag": "p", "text": "Jinkins remained in Nym's service, helping liberate Mere Resistance fighters from the infamous Spacestation 1138, and later aided in the battle of Nod Kartha and the destruction of Cavik Toth's Hex fleet. During the Galactic Civil War, Jinkins served as Nym's chief lieutenant, after the pirate took control of Lok."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A brilliant engineer, Jinkins hated it when good technology went to waste, going so far as to abscond with his design and join the Lok Revenants. After his defection, he went on to be a loyal companion to Nym."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If you fail your mission to save Jinkins during the assault on Nym's base in Star Wars: Starfighter, Jinkins is killed during the invasion, though the game continues without him. Since the character reappears in the sequel, this part of the game must be non-canonical."}, {"tag": "p", "text": "In the first game he speaks with an American accent, while in the sequel he speaks with an English accent, voiced by Ross King."}, {"tag": "p", "text": "In Star Wars: Starfighter, Jinkins's name is misspelled \"Jenkins.\" The Complete Star Wars Encyclopedia mistakenly refers to Merick, the identity Jinkins assumes in \"Single Cell,\" as an actual character and not an alias."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}