{"url": "Jira/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Merchants", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Jira"}, {"tag": "p", "text": "Jira was a poor, old woman who ran a fruit stand in the Mos Espa marketplace on Tatooine. Among the refreshments she sold were juicy fruits called pallies. She was a very kind woman who appeared to share a mutual friendship with Anakin Skywalker."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jira depended on a cooling unit to keep her foods fresh, especially in the Tatooine heat. When she suffered from a broken cooling unit, it was Anakin Skywalker who came to rescue, by giving her the money to purchase a new one."}, {"tag": "p", "text": "She was known for telling the tale of the mysterious wandering \"Nobot\" to those with two peggats to spare."}, {"tag": "p", "text": "In 32 BBY, only a week before the Boonta Eve Classic, Jira helped Anakin and his friends Kitster and Dorn to rescue Pala and several kidnapped Ghostling children from captivity. With her own slave-smuggling knowledge and connections, she advised the brave little rescuers as to the required costs of their alruistic plans within the walls of her humble pour-stone apartment. Between their secret meetings at Jira's place, each of them gathered and gave what they could of their saved and solicited credits to meet the costs of smugglers' payment. Jira's bare abode was located down a shaded alleyway near Jira's fruit stand in the Mos Espa marketplace."}, {"tag": "p", "text": "Before departing Tatooine with Qui-Gon Jinn, Anakin gave Jira a portion of the money he made from selling his podracer. He hugged her goodbye and she called him the kindest boy in the world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jira was portrayed by Margaret Towner in The Phantom Menace."}, {"tag": "p", "text": "In the official movie Star Wars: Episode I The Phantom Menace, Anakin does not appear to be giving Jira the money, but that can be seen in DVD Release as a Deleted Scene."}, {"tag": "p", "text": "Jira was to appear in the Star Wars: Episode I The Phantom Menace video game, voiced by Heidi Shannon. However, she didn't make it into the final cut, although she is still credited in the game credits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}