{"url": "Jixtus", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Articles in need of updating", "Category:Grysk Hegemony individuals", "Category:Grysks", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jixtus"}, {"tag": "p", "text": "Jixtus was the name assumed by a male Grysk agent of the Grysk Hegemony. Jixtus was the architect of a plot to destroy the Chiss Ascendancy, whom the Grysk believed were the main obstacle to conquering the Unknown Regions."}, {"tag": "p", "text": "Jixtus sought to learn the secret means by which the Chiss navigated the Unknown Regions, wondering whether they had secret Force-sensitive navigators or possibly advanced navigation computers. He ensnared Qilori to learn that secret."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "\"Jixtus,\" as he would call himself, and the faction he was a part of wanted to take control of the Unknown Regions, but they felt they needed to defeat the Chiss Ascendancy in order to do so. Though his faction believed the Nikardun Destiny would collapse if they encountered an opponent that was too powerful and saw the Nikardun themselves as destructive simpletons, they watched the Nikardun conquests unfold until the defeat of the Destiny's leader, General Yiv the Benevolent. Jixtus heard many rumors about the fate of the general. Two months after Yiv's defeat, Jixtus sought to learn the truth from one of the Benevolent's former servants, the Pathfinder Qilori."}, {"tag": "p", "text": "To trap Qilori during one of his navigation jobs, their starship's flight and navigational systems were shut down, thus leaving the navigator powerless in the middle of empty space, and the bridge was emptied so Jixtus could speak to him in private. Talking through the bridge speaker, Jixtus refused to give his name and asked about Yiv's fate. Though Qilori was initially unwilling to explain, as the Chiss Senior Captain Mitth'raw'nuruodo had threated to have him removed from the Pathfinders and have the Pathfinders removed from the Navigators' Guild, Jixtus reminded him of their position in space, convincing the Pathfinder to explain that Thrawn had captured the general. After Jixtus asked, Qilori further explained that the Nikardun Destiny had collapsed and that their road to conquest had likely been taken by the Ascendancy."}, {"tag": "p", "text": "After informing Qilori that his faction had not been Yiv's masters and that they would be adopting subtler tactics against the Ascendancy, Jixtus was pleased when the navigator agreed to join them. Power was then restored to their ship, and Jixtus promised that they would talk again. When Qilori asked what to call his new benefactor if not by his name, he was told to use the name \"Jixtus.\" Jixtus then promised he would destroy the Chiss Ascendancy."}, {"tag": "p", "text": "Jixtus hired Haplif of the Agbui to conduct a plot to destroy the Chiss Ascendancy, and hired the Watith freighter captain Fsir to distract Senior Captain Thrawn from the plot."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jixtus was the assumed name of a male Grysk enemy of the Chiss Ascendancy. He and his allies saw the Chiss as the primary obstacle to control over the Unknown Regions. He spoke in a cultured voice. While speaking with Qilori, he threatened the Pathfinder. He was seemingly darkly amused by Qilori asking if he had been General Yiv's master before claiming to have no relation to the defeated general. He was also pleased that Qilori promised to join his effort against the Chiss."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Jixtus had control over at least one starship, which was also the craft he spoke to Qilori on. Jixtus typically wore a hooded robe that obscured his features, leading Haplif to speculate that he could belong to any bipedal species, or even a demon from Agbui mythology."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}