{"url": "Jobal_Naberrie/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:House Naberrie", "Category:Humans", "Category:Naboo"], "nodes": [{"tag": "h1", "text": "Jobal Naberrie"}, {"tag": "p", "text": "Jobal Naberrie (neé Thule) was a Human female from Naboo. She was the daughter of Ryoo Thule, the wife of Ruwee Naberrie, and the mother of Sola Naberrie and Padmé Amidala. She was also the maternal grandmother of Ryoo and Pooja Naberrie, as well as twins Luke Skywalker and Leia Organa Solo."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female, Jobal Naberrie was born in 76 BBY on the green planet of Naboo in the Mid Rim Territories. Her mother went by the name of Ryoo, after a flower that grew in the vicinity of the city of Keren, but her father's identity was forgotten in the passage of time. On her bountiful homeworld, the young Jobal began with a secure and happy childhood."}, {"tag": "p", "text": "When she became a young adult, Jobal met Ruwee Naberrie, a teenaged member of the Refugee Relief Movement, a non-profit resettlement agency. Impressed by Naberrie's social acumen, Jobal fell in love with him shortly after they met. Unbeknownst to the young woman, her mother and Ruwee Naberrie's mother Winama knew each other well and had been plotting for an arranged marriage between their offsprings. The two mothers were genuinely surprised when they learned that Jobal and Ruwee had actually fallen in love."}, {"tag": "p", "text": "After their marriage in 51 BBY, Ruwee and Jobal Naberrie played an instrumental role in the founding of a new village in the mountains close to Theed, the capital of Naboo. While Jobal Naberrie and her husband intended to spend the rest of their lives among that new community, they took a new turn when she got pregnant. In 50 BBY, Naberrie gave life to a first daughter whom she named Sola, and then four years later to another girl named Padmé. With two other mouths to feed, Jobal Naberrie and her husband started reconsidering their future."}, {"tag": "p", "text": "After Padmé received impressive scores to an aptitude test, Jobal and Ruwee moved to Theed in order to offer their children a chance at a higher education and richer life. Jobal was a very hospitable housewife and offered all her guests lavish meals. In Theed, she voluntarily worked in a variety of social service roles helping the underprivileged. Her way of life instilled very strong compassion and selflessness into their children, which was obvious from Padmé's career."}, {"tag": "p", "text": "In 33 BBY, Jobal, along with her husband who was the President of the Refugee Relief Movement at the time, had the surprising visit of Senator Palpatine at the RRM's Coruscant headquarters. Palpatine had come to try and convince the Naberries to have Padmé run for the throne. Ruwee and Jobal were pretty hesitant at first, not wanting their just-turned-thirteen-year-old daughter to go through all of this and lose."}, {"tag": "p", "text": "After being Princess of Theed for two years, Padmé was elected Queen of Naboo with a landslide victory. During the Trade Federation's invasion of Naboo, Ruwee and Jobal were arrested and sent to jail. Eight years later, Padmé ended her second term as Queen and, at the request of her successor, Queen Jamillia, became the new Senatorial representative of the Chommell sector."}, {"tag": "p", "text": "In 22 BBY, several assassination attempts were made on Padmé. Jobal was deeply worried about her daughter's safety and kept reminding her that it was maybe time to think of herself and have a life of her own. In the same period, she had the occasion to meet her future son-in-law, Anakin Skywalker."}, {"tag": "p", "text": "Three years later, Jobal, along with the rest of her family and thousands of other mourners, attended Padmé's funeral shortly after the Clone Wars had ended."}, {"tag": "p", "text": "In 18 BBY, six months after Padmé's funeral, Jobal's mother Ryoo was killed by Inquisitor Malorum after the latter interrogated her about Padmé and her mysterious pregnancy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jobal Naberrie was portrayed by Trisha Noble in deleted scenes of Star Wars: Episode II Attack of the Clones, as well as in a brief scene of Star Wars: Episode III Revenge of the Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}