{"url": "Jobril", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Males", "Category:Pilots", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Jobril"}, {"tag": "p", "text": "Jobril was a male Twi'lek, and Nirama's master of properties on Cularin."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jobril had been working for Nirama's Organization for years, and the Twi'lek wanted his chief to know that he was reliable. Jobril asked Nirama for a special loyalty microchip to be inserted in his brain stem through surgery. Nirama accepted; and he could trust Jobril, not only because of the chip, but also because of the kind of natural loyalty that would lead Jobril to ask for such a thing."}, {"tag": "p", "text": "Since then, Nirama trusted Jobril implicitly, as he believed Jobril was \"no longer capable of betraying\" him. Jobril remained severe and adamant when Nirama asked him to perform a task."}, {"tag": "p", "text": "In 31 BBY, Nirama had Jobril transport a handful of freelancers from Cularin to the Cularin system asteroid belt. The passengers included some proclaimed heroes for whom Nirama had a special assignment, and a small-time thug by the name of Jasper to make the travel look like a common recruitment run."}, {"tag": "p", "text": "During the trip, Jobril's transport was attacked by a trio of pirates in G-59 Cannibalizers, in spite of the transport having Nirama's markings. With the help of the recruits (except for Jasper), Jobril was able to fight off the attackers and complete his delivery."}, {"tag": "p", "text": "One month later, Nirama sent Jobril to recruit these same people again, not because he needed their services, but because he believed they were in the target of anti-Nirama organization the Cell, and Nirama wanted to watch them out."}, {"tag": "p", "text": "Soon afterward, Jobril's microchip was removed, apparently by a faction of the Cell controlled by Ari Melast, one of Nirama's trusted lieutenants. The Cell deceived Jobril, making him believe that Nirama's former protocol droid N3-A2 was still a trusted individual, when it was really a tool of the Cell in a plot to discredit and weaken Nirama. Jobril was sent to recruit again some independent agents for a supposed secret mission for Nirama, and take them to the Organization's main weapon-storage facility, Rothe Gate. Jobril was informed only of what he needed to know."}, {"tag": "p", "text": "Erroneously believing that Nirama was informed, Jobril took (stole) one of Nirama's personal ships and took the agents to Rothe Gate, where they would rendezvous with N3-A2. Jobril looked after his own business, loading his ship with contraband weapons."}, {"tag": "p", "text": "Meanwhile, as Jobril had stopped reporting, Nirama believed that his master of properties had been killed. However, the Oblee was informed that Jobril had taken one of his ships to Rothe Gate with new personnel. Nirama stood up and only hours after knowing it, he had already arrived to Rothe Gate to get some answers. He captured some Cell sympathizers and questioned them explicitly about Jobril, although they gave him no useful information."}, {"tag": "p", "text": "The following year, rumor expert Old Ezil said that Jobril was not \"around any more,\" suggesting that the Twi'lek could have died, or be believed dead."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jobril felt an absolute loyalty towards his chief, crime lord Nirama, both with and without the microchip in his organism. When the microchip was removed, Jobril had to be misled to act against Nirama's interests—although some believed it was done through the power of the Force."}, {"tag": "p", "text": "Nirama rewarded this loyalty by trusting Jobril and by taking pains for his employee: When Jobril disappeared, Nirama believed he had been killed, having no reason to think he could have betrayed him. As soon as the crime lord discovered a clue on Jobril, Nirama followed it and took important measures. He got some prisoners and questioned them first about Jobril's fate, even if there were other, more pressing matters."}, {"tag": "p", "text": "Jobril was known as unsmiling and grumpy, which seemed to be a side effect of his loyalty microchip: As soon as it was removed, he became a jovial person who showed his rows of pointed teeth in frequent smiles. This, however, did little to affect his efficiency."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the initial overview of UnderWorld, Jobril's name is misspelled Jobrill."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}