{"url": "Jocasta_Nu", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Archivists", "Category:Coruscanti", "Category:Females", "Category:Humans", "Category:Jedi High Council members", "Category:Jedi Purge victims", "Category:Jedi Researchers", "Category:Librarians", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Jocasta Nu"}, {"tag": "p", "text": "Jocasta Nu, a Force-sensitive human female, was Jedi Master of the Jedi Order who served as the Chief Librarian of the Jedi Archives during the last years of the Galactic Republic. In this role, Nu was the primary caretaker of the extensive Archives, helping her fellow Jedi find the information they needed while controlling access to several restricted vaults and artifacts."}, {"tag": "p", "text": "Although she was the Chief Librarian of the Archives, Nu was not removed from other Jedi affairs and, at some point, was a member of the Jedi High Council. As Chief Librarian, she worked alongside other Jedi such as Masters Tera Sinube and Eno Cordova. During the Clone Wars, Nu became involved in a plot by bounty hunter Cad Bane to steal a Jedi holocron, though she and her fellow Jedi failed to stop him from escaping the Jedi Temple with the artifact. She later helped Padawan Ahsoka Tano find the thief who stole her lightsaber, aided the Jedi Council in their investigation of Jedi Master Sifo-Dyas' death, and continued to watch over the Archives."}, {"tag": "p", "text": "At the war's end, most Jedi were wiped out during the Great Jedi Purge and the rise of the Galactic Empire. Nu was among the survivors of the purge, and with her assistant Gar, attempted to preserve what knowledge she had and prepared a covert school to train future Jedi. Nu decided to return to the former Jedi Temple on Coruscant, knowing that hidden in the Archives was a holocron containing a list of force-sensitive children. Nu managed to sneak into the Temple and retrieve the holocron. Determined to put a permanent end to the Jedi, the newly crowned Emperor, Darth Sidious, dispatched his agents, Darth Vader and the Grand Inquisitor, to hunt down the former Chief Librarian. Knowing she wouldn't be able to escape Coruscant, Nu attempted suicide but was foiled by Vader. Vader killed Nu afterward, though he later destroyed the holocron after Nu warned him of what Sidious would do with it. Years after the deaths of both Nu and Gar, the information she kept hidden was found by Jedi Master Luke Skywalker, who used it to try and rebuild the fallen Jedi Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jocasta Nu was born on Coruscant prior to the Clone Wars. She was found to be Force-sensitive and brought to the Jedi Temple for training. She soon became part of the Jedi High Council and a librarian in the Jedi Archives. She studied to become a Consular Jedi, and did become one shortly after. As a Jedi, she focused her interests and life's work on the Temple's massive Jedi Archives and soon became their Chief Librarian, which did not prevent her from attaining the rank of Jedi Master and training several Padawans. She would hold this title for several decades by the time of the Imperial Era. She had complete confidence in the accuracy and integrity of the records she maintained, suggesting that an item that did not appear in her library did not exist. She would collect several things as an archivist, such as the Mask of Lord Momin. In 68 BBY, when Qui-Gon Jinn first became Dooku's Padawan, Nu was the newly appointed Chief Librarian, and the Coruscanti Jedi noticed that Dooku and Nu were normally very friendly."}, {"tag": "h3", "text": "Mission to Ontotho"}, {"tag": "p", "text": "Jocasta Nu was present on the Council when the outcome of the Mission to Nameel was unveiled to the Council. Cere Junda was provoked during the mission and attacked Trandoshans, believing that they, instead of the Dupei Monks were at fault. The Council decided to send both Junda and her master, Eno Cordova, to Ontotho to help in the excavation of an Ontothan temple."}, {"tag": "h3", "text": "The Separatist Crisis"}, {"tag": "p", "text": "During the Separatist Crisis in 22 BBY, Nu tended to Obi-Wan Kenobi when he came to the archives in search of the planet Kamino, based on information from his friend Dexter Jettster. Jocasta found him staring at a bust of Dooku and provided him a brief history about him and that he left and a while later, he came back as a Sith Lord and that he had once trained his master, Qui-Gon Jinn. When Kenobi said that he doesn't understand why he left, Nu said that it was because he was frustrated with the Council and its ways. She told told him that she wasn't here to give him a history lesson and asked if he had a problem. Kenobi finally told her that he was in search of a bounty hunter and the supposed mastermind behind a plot to assassinate the senator Padmé Amidala. Nu was not familiar with Kamino, and noted that since it was not in the Archives, it must not exist. Nu became irritated when Kenobi suggested her records could be incomplete. She left him to his investigations, instead seeing to the young Zett Jukassa."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Following the First Battle of Felucia in 21 BBY, Nu was assigned Anakin Skywalker's Padawan, Ahsoka Tano, to serve as the Jedi Archives new security officer after the young Togruta was assigned to Temple duty for disobeying orders. She took Tano on a tour of the archives, and showed her the entrance to the Holocron Vault, explaining that only members of the Jedi Council were allowed access due to the sensitive information contained inside and that she herself had not been inside it for years. When Master Ord Enisence bullied Tano while she was trying to help him, Nu was organizing books as she watched the scene unfold and looked suspicious of the Jedi. When the Jedi Temple was put on high alert due to Cad Bane's efforts to break into the Temple, Nu informed Master Enisence of this after noticing him in the archives working at a terminal seemingly unconcerned. However, she was then knocked out by Enisence, who was actually the Clawdite bounty hunter Cato Parasitti disguised, and also working as Bane's accomplice in the heist. Nu was then dragged away and relieved of her lightsaber by Parasitti, who shapeshifted to impersonate the Master Librarian. Tano subdued the bounty hunter after determining that she was an imposter. After Nu recovered, she and Tano took Parasitti away and brought in more security, but were unable to prevent Bane from escaping with a holocron."}, {"tag": "p", "text": "Following that incident, Nu assisted Tano when she came to the library to examine criminal records to locate the thief who stole her lightsaber. Nu suggested that Tano admit to Skywalker that she had lost her lightsaber, but the Padawan refused due to how often her master told her to never lose her weapon. Nu admitted that finding thieves was not her area of expertise, and recommended that Tano seek the help of Jedi Master Tera Sinube, an expert on the Coruscant Underworld, to find the thief. She led Tano to the elderly Cosian, who was sleeping at a table in the archives. They woke the sleeping Master, and Nu left the two to begin their search."}, {"tag": "p", "text": "After Master Plo Koon discovered the wreckage of a vessel on the desert moon of Oba Diah that was identified as the ship of former Jedi Council member Sifo-Dyas and which still contained his lightsaber in 19 BBY, Nu was asked to brief the Jedi Council on the events surrounding the Jedi Master's demise. She informed them that Sifo-Dyas' last assignment was to Felucia, where he was killed attempting to negotiate a peace treaty between two tribes. Plo Koon inquired about the status of Sifo-Dyas' body, and Nu informed him that she did not know as further records on the mission had been ordered sealed. Master Mace Windu asked who had sealed them, and Nu revealed that the Office of the Supreme Chancellor was responsible. Windu thanked Nu for her briefing and she took her leave to allow the Jedi Council to discuss the situation."}, {"tag": "p", "text": "During the war, Master Eno Cordova arrived on Coruscant. While exploring an ancient Zeffo temple, Cordova received a vision of the fall of the Jedi Order and rushed to warn the Jedi Council however, none of the Council were concerned and disregarded his vision. The only member of the Order who believed him was Nu, his trusted confidante during his time at the Temple. Nu entered the archive and created a copy of the holocron listing all potential Force-sensitive children across the galaxy and gave it to Cordova to protect. This holocron was hidden in a Zeffo Vault on Bogano, where it remained until the vault was opened by Padawan Cal Kestis."}, {"tag": "p", "text": "Near the end of the Clone Wars, Nu explained to Caleb Dume, Sammo Quid, and Tai Uzuma, three Jedi Initiates who had passed their Initiate Trials, how Jedi Knights chose Padawans. Dume questioned how and why the Jedi settled on that method to choose their Padawans and if anyone had ever questioned it. Nu noted that Dume was questioning it now, but he protested that he simply wanted to know how that method had been developed."}, {"tag": "p", "text": "She separated the Jedi in her mind: the ones worthy for education and the rest of them. As such, she didn't allow the Grand Inquisitor into the higher archives and always hovered over him when she did let him read a datafile or two. This ultimately caused him to turn to the dark side of the Force."}, {"tag": "h3", "text": "Preserving the Order"}, {"tag": "p", "text": "Nu survived the destruction of the Jedi and during the early stages of the Jedi Purge she attempted to gather and preserve whatever she could of the Order's legacy. Nu went into hiding and started recording holocrons and collecting information with her assistant Gar, in an attempt to start a school for new Jedi. Nu was included in a list of possible survivors, which Darth Sidious gave to the Grand Inquisitor. He was shocked that Nu survived, as he had not seen her fight once in her life. He also told Vader how much he hated Nu. The Inquisitorius was instructed to find Nu, though Sidious requested Darth Vader to bring Nu to him alive even though he sensed his eagerness. Sidious believed that Nu had a way to access key information for the future of the Empire which was hidden away in the Jedi Archives. He told him that Jocasta had served the Archives for decades and that every relic the Jedi have, they give it to her. He told him that the Jedi were abusing their power and that Jocasta would most likely try to escape their custody. She realized that the Jedi Archives contained a holocron with a list of every Force-sensitive child catalogued prior to Order 66, and decided to return to Coruscant to rescue it. Gar caught her glancing at her lightsaber, and told her that she didn't need it anymore and that they were done building the archive. However, Nu told him that he misunderstood and that she had to build a school. As Nu was about to leave, she bid him farewell and when Gar, in a last attempt to convince her to stay, asked what could be worth the risk, she told him that since this was a school, it will need students. Soon, Imperial shock troopers told Nu to identify herself, but with a mind trick, she convinced them that she was no one and that they saw nothing, in order to enter the Temple. Shocked at the devastation within, she spotted the Grand Inquisitor poring over the knowledge she once kept, but forced herself to focus on her mission. Entering a secret vault within the Archives, Nu reunited with Cator and retrieved the holocron, saying that the Jedi will rebuild and leaving the droid on guard once more, but upon sighting the Inquisitor again, Nu accosted him with her lightsaber, offended that he dared to read her books only to toss them aside."}, {"tag": "p", "text": "He revealed to her that he was once a Jedi, shocking Nu. Nu told him that he was a traitor and that he had less right in the Archives than she imagined and to meet a traitor's end. He then whipped out his lightsaber, and started a duel. Nu asked why he betrayed his order, but he said the Jedi were nothing and had only shown him the light side of the Force, and that now he knew the whole view of the Force, he can accomplish anything using hatred, and he had lots of hatred. Then he accused her of what she done to him, but she told him that the Archives were very diverse and that if she refused him access, then it meant that she believed he wasn't ready and that it was her goal as Chief Librarian and that since it was once her duty, it will stay her duty. But he said that now she had no duty and tossed her to the floor and said that killing her felt better than he had imagined."}, {"tag": "p", "text": "After a brief lightsaber duel against the Grand Inquisitor however, she was bested and as he prepared to deliver the final blow, he was interrupted by Vader's blocking saber. Jocasta closed her eyes and began praying until she discovered what had happened. Vader demanded her alive but the other said that it was a Jedi and that he didn't trust Vader; in the confusion Nu telekinetically hurled several books at the two and fled. She later retreated to a computer access room in the Library and subsequently initiated deletion of the archive files. As Vader continued his pursuit, Nu assembled a weapon capable of fighting Vader for the next round. After failing to kill him with the weapon and ruining her lightsaber in the process, Nu attempted to kill Vader by self-destructing it but he managed to redirect it so that it blew a hole in the Temple's outer wall. Grabbing a green-bladed lightsaber from a shelf, Nu took the opportunity to escape out the gap, but was forced to fight off several Coruscant Guard shock troopers led by Commander Fox, who also fired on Vader by mistake due to Fox neglecting to provide a description of the Sith Lord, something which Nu found greatly amusing. Snapping the commander's neck as punishment for this error in judgement, Vader ordered the troopers to take Nu alive, stopping her with the Force after she attempted to commit suicide in order to deny them the information she held. Restrained and confined aboard a patrol transport, Nu was forced to watch as Vader accessed the coveted information: the Kyber memory crystal, containing a list of all known Force-sensitive children in the galaxy. Though regarded with contempt by the troopers restraining her for being a Jedi, Nu revealed that they were taking orders from one themselves. Vader was in fact fallen Jedi Knight Anakin Skywalker, which Nu had learned from Cator as the droid held off Vader beforehand. Vader then proceeded to blast all of the shock troopers out of the gunship, killing them in order to keep his secret. When Nu inquired as to what her fate would be, Vader ignited his lightsaber but met no resistance from Nu, who accepted her death."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Vader reported back to his master that Nu tried an escape attempt and that she was so careless that she had perished in the process. The Emperor expressed regret at this and told him to come back to him so that he could know more of Jocasta's death and asked if he learned anything from her before she died, while Vader replied that he had learned nothing. The list of names was then destroyed by Vader, to ensure that his master could not use it to find and train other Sith apprentices. Later on, Sidious told Vader that even though he wouldn't called Vader's encounter with Nu a victory, he couldn't call it a defeat, as the relics she held were fascinating, Jedi and Sith artifacts alike."}, {"tag": "p", "text": "Shortly after the Battle of Fortress Vader, Vader entered a portal constructed by Darth Momin to resurrect his wife Padmé Amidala. While walking through visions, he encountered Nu along with many Jedi with their lightsabers ready to battle him. However, Vader killed all the illusions, impaling Nu through the chest as the words \"Let the past die\" resounded in his mind."}, {"tag": "p", "text": "In 0 ABY,[source?] one of her holocrons managed to make it into the grasp of Grakkus the Hutt, who collected it into his collection of Jedi artifacts in the criminal world of Nar Shaddaa. Vader's son Luke Skywalker, was forced to open all of the holocrons in the collection by Grakkus. As he opened the holocrons one by one, he noticed Madame Jocasta's message and many others."}, {"tag": "p", "text": "Though Nu perished on her failed mission to locate prospective Jedi students, her sacrifice was ultimately not in vain. Her secret vault of Jedi artifacts and knowledge was tended to faithfully by Gar for many years until he grew too old to continue protecting it and sealed it by commiting suicide. The vault, and the information inside it, was then uncovered many years after her death by Luke Skywalker, who was attempting to rebuild the Order."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jocasta Nu had white hair, blue eyes, and light skin. She had a blue scar going down her cheek. She was thin and frail by the time of the Separatist Crisis and often wore her hair in a tidy bun. She was helpful, as she recommended Ahsoka Tano find Tera Sinube when she lost her lightsaber and when she toured the Holocron Vault with Tano. She can be suspicious when something peculiar is happening at the Archives, including when \"Ord Enisense\" hassled Tano. She was also not good at solving crimes, as shown when she couldn't find out who stole Ahsoka Tano's lightsaber. Due to her position as Chief Librarian of the Jedi Archives, Nu was sometimes too confident that her library had the answers for all the questions and that it cannot be altered, to the point that she could easily became irritated by the suggestion that her records could be incomplete, for example when Kenobi asked her why the Archives didn't have any information about Kamino. She separated the Jedi in her mind, the ones worthy for education and the rest of them. When she felt that they weren't ready, she refused them access to the higher archives and hovered over them when she did let them read a datafile or two. However, Nu ran the Archives as a tool rather than a service, expecting the Jedi to do their own research. She took this as her goal as Chief Librarian and that it was her duty."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Despite being far from the strongest Force user or lightsaber combatant, Nu was still capable in both regards and possessed basic skills as a Jedi. She was therefore able to use telekinesis, which she could use as a tool or as a weapon, from activating and assembling a holocron to summoning the books in the Jedi library to throw them at Vader and the Grand Inquisitor. Additionally, Jocasta demonstrated skill with the mind trick, which she used on shock troopers to get them to ignore her. Despite her wealth of knowledge however, she was described by Darth Sidious as being \"middling in the Force\" and \"barely competent with a lightsaber\"."}, {"tag": "p", "text": "While she was well past her physical prime, Nu also demonstrated feats of physical prowess, such as jumping down several stories from a crater made in the wall of the Jedi Temple. As a lightsaber duelist, she was skilled enough to briefly hold her own against the Grand Inquisitor, until she was overwhelmed by his own skill and strength. She could also deflect several blaster bolts fired at her by multiple shock troopers."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Jocasta Nu had a blue lightsaber and was known to have skills in lightsaber combat, despite rarely using the weapon. She also wore brownish robes on the outside with several symbols on it and wore black clothing on the inside. At the time of her death, she wore a black cloak."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jocasta Nu was played by actress and comedian Alethea McGrath in the 2002 film Star Wars: Episode II Attack of the Clones, the second installment of the Star Wars prequel trilogy. She was voiced by Flo DiRe in the Star Wars: The Clone Wars TV series."}, {"tag": "p", "text": "Her fate differs from Star Wars Legends, in which Skywalker kills her during Order 66 as a result of refusing him access to the Archives."}, {"tag": "p", "text": "In an interview featured in Star Wars Insider 75, McGrath indicated that a lot of Nu's backstory and scenes from Attack of the Clones were cut before filming and during editing, including the revelation that Nu and Count Dooku used to be in love during Dooku's days in the Jedi Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}