{"url": "Jocasta_Nu/Legends", "categories": ["Category:Legends articles", "Category:Archaeologists", "Category:ExplorCorps members", "Category:Females", "Category:Humans", "Category:Jedi Purge victims", "Category:Jedi Researchers", "Category:Lore Keepers", "Category:Post-Ruusan Jedi High Council members", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Jocasta Nu"}, {"tag": "p", "text": "Jocasta Nu was a female Human who served as the Chief Librarian of the Jedi Archives during the final days of the Galactic Republic, and who tended to show overconfidence in the completeness of her Archives. Her patterned robes bore the symbols of the Ansata, representing her devotion to knowledge and learning."}, {"tag": "p", "text": "During her career, Nu served as a member of the Jedi High Council and trained many Padawans, including the future Emperor's Hand, Jerec; Olee Starstone, whom she tutored in the years prior to the Clone Wars; and Jin-Lo Rayce, founder of the Agents of Ossus. Jocasta Nu died when the 501st Legion ransacked the Jedi Temple at the end of the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Brought into the Jedi Order during the final decades of the Galactic Republic, it is likely Jocasta Nu was discovered by a recruiter of the Acquisition Division to be Force-sensitive around infancy before being brought to the Coruscant Jedi Temple for training. Raised in a youngling clan, she passed the trials of the Jedi academy and was eventually selected by a Master for one-on-one training. Passing the Jedi Trials, Nu pursued the path of the Consular and became a researcher specializing in the field of archaeology. Attaching herself to the Exploration Corps after consulting the Council of Reassignment, Nu traveled the galaxy gathering information for the Jedi Archives. During her journeys, Nu discovered the Force-sensitive Miraluka, Jerec, and delivered him to the Temple for entrance into the academy there. Eventually Nu returned to the Temple and selected Jerec as her Padawan, passing along her own desires to learn all there was to know in the galaxy, which eventually drove him to Knighthood himself. After her padawan completed his training, Nu was made a Jedi Master and began to perform the duties of an archivist in the Archives. Eventually, Nu was appointed Chief Librarian of the Archives and Library and made a member of the Librarian's Assembly. Part of her responsibility as Chief Librarian was oversight of the Educational Corps; she reported directly to the Reassignment Council on all matters concerning this branch of the Jedi Service Corps."}, {"tag": "p", "text": "During her tenure as Chief Librarian, Nu was appointed to the Jedi High Council in 62 BBY, serving on the august body before stepping down in ten years later. Foregoing the traditional brown robes of the Order, Nu began wearing a tunic and dress imprinted with ancient Ansata patterns, a type of dress worn by some of the most famed Jedi historians including the ancient Master Atris. Over the years, Nu came to know most of the Jedi in the Temple, becoming especially fond of Master Dooku; she personally mourned the loss of his great idealism when he left the Order shortly following the Invasion of Naboo. Using the extensive knowledge gained in the field with the ExplorCorps, Nu continued to gather a very precise and extensive knowledge of the galaxy. Working in cooperation with the Jedi Councils, Nu was always advised of upcoming missions so that she could help prep a report for all Jedi about to depart the Temple."}, {"tag": "p", "text": "In 52 BBY, Nu undertook a diplomatic mission to the world of Serenno with Jedi Masters Dooku, Qui-Gon Jinn and Sifo-Dyas. At the meeting, the Jedi team met Damask Holdings Magister Hego Damask, in reality the Sith Lord Darth Plagueis. Nu took on her last Padawan, Jin-Lo Rayce sometime after the Stark Hyperspace War around 44 BBY, teaching him all of the secret passage ways in and out of the Temple. In 39 BBY, Jedi Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi were sent on a mission to Vorzyd IV. Nu provided the two Jedi with the information needed for them to complete their assignment."}, {"tag": "p", "text": "Over the course of her time as director of the Archives her confidence in the data stored in the stacks was whole; claiming that if something was not in the Archives, then it did not exist. This statement was belied when Jedi Knight Obi-Wan Kenobi was unable to find the aquatic world Kamino in the Archives and suggested that the Archives were incomplete; somewhat miffed, Madame Nu reiterated her belief that if an item was not in the Archives, it did not exist, and strode away to assist a young Padawan who had just arrived."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "With the Clone Wars underway in 22 BBY, the High Council became increasingly concerned with protecting the Archives as more and more Jedi were called away from Coruscant to fight on the front lines. As reprimand for failing to follow orders during the First Battle of Felucia, the High Council assigned Padawan Ahsoka Tano to guard duty within the Archives. Meeting Tano in the Archives' Rotunda, Nu familiarized the Togruta with security protocols in the Archives and around the Holocron Vaults. Putting Tano to the test, bounty hunter Cad Bane had sent Cato Parasitti into the Temple to assist in his infiltration mission. As a Clawdite, Parasitti was able to slip pass both Tano and Nu under the guise of the recently deceased Master Ord Enisence. Suspicious of Enisence's oddly curt behavior, Nu offered the Skrilling a gentle hand, only to be struck by the bounty hunter and rendered unconscious. Stealing Nu's identity, as well as her blue-bladed lightsaber, Parasitti broke through Temple security and allowed Bane to enter the Temple without much trouble. While distracting the Jedi monitoring Temple security, Parasitti was discovered by Tano to be an impostor. After a brief scuffle, Parasitti was defeated and placed under arrest, yet Bane had already successfully completed his mission to infiltrate the Vaults and escape unnoticed. Nu recovered shortly after and returned immediately to her work."}, {"tag": "h3", "text": "Order 66 and death"}, {"tag": "p", "text": "Nu remained at the Temple throughout the conflict with the Confederacy of Independent Systems, one of the highest ranking Masters to remain constantly on Coruscant. At the end of the war, she was diligently at work in the Archives when Operation: Knightfall was initiated in 19 BBY. Shortly prior, she finally expressed doubt to Knight Sha Koon in the completeness of her Archives. As fighting erupted in the Temple's lower levels, Nu summoned her Padawan, Rayce, to the Archives and handed him several datachips with information from the Stacks uploaded to them. Ordering him to flee, she watched as Rayce departed the Temple through the secret passageways she had detailed to him over his apprenticeship."}, {"tag": "p", "text": "Remaining behind, Nu waited in the Archives until Dark Lord of the Sith Darth Vader marched through the great wooden doors flanked by several clone assassins. Vader demanded that Nu unlock the secured Temple beacon by saying that the Supreme Chancellor had given such order, a demand Nu firmly denied by igniting her blue lightsaber, stating that access to the Jedi Temple's signal beacon wasn't within Chancellor Palpatine's power but within the Jedi Council's. Casually, Vader lifted the esteemed Jedi with the Force and impaled her through the chest with his own saber, killing Nu instantly before Vader carelessly flung her body amongst the Stacks. Ironically, during her conversation with Koon earlier that day, Nu had praised Skywalker as a hero."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Immediately after Jocasta Nu's death, Nu's loyal librarians attempted to stop Skywalker and destroy all of the knowledge stored there so that it would not fall into the hands of their mortal enemies, but they were all killed and the Sith continued to ransack the Archives. After the fighting died down, Nu's lifeless body was discovered by Grand Master Yoda and Master Kenobi as they infiltrated the occupied temple. Her body would eventually be gathered up and her name checked off against Archives records of all active Jedi. The bodies of Jedi were gathered by the clones and burned on a pyre on the Temple entrance."}, {"tag": "p", "text": "When the Galactic Empire emerged from the ashes of the Republic, Sate Pestage compiled a statement that was to be issued to the citizens of the Empire as proof of the Jedi's crimes. In his fabricated report, Pestage stated that Jocasta Nu was executed for harboring information that threatened the Empire and its citizens."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By the time of the Clone Wars, Nu was thin, frail-looking woman with long silver hair that she wore in a tight bun. She had blue eyes and a pronounced scar running along the right side of her face. Despite her wispy appearance, Nu actually was a known firebrand among her peers, noted for her immense determination and strength. Despite this, younger Jedi students still attempted to push her around, trying to get the librarian to do the bulk of their research for them.However, Nu considered the Jedi Archives a tool rather than a service, and she expected all Jedi to do their research by themselves, which led her to being particularly strict toward those students."}, {"tag": "p", "text": "If Jocasta Nu had allowed herself to have an attachment it would have been to her library. She had a trait for being a little overconfident about the amount of information in the Archives and often got affronted if someone suggested that the Stacks were incomplete. This trait was shown when Jedi Knight Obi-Wan Kenobi noted the supposed disappearance of the planet Kamino. To this she indignantly replied that if something didn't appear in her records it didn't exist.However, by the end of the Clone Wars, Jocasta Nu came to accept the fact that her Archives did not contain everything. Although a little too proud of the Archives, Nu was friendly and helpful, but most people knew better than to get on the wrong side of her."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Achieving all of the basic Force skills at the academy during her younger years, Nu had pursued the studies of the Consular, perfecting her researching skills through her studies as an archaeologist of the ExplorCorps. While retired from combat missions in her later years, she still wore her lightsaber proudly as a reminder of her active years, during which she had received a thin vertical scar along her cheek. When ignited her saber would emit a shimmering blue blade, which was somewhat unusual as Jedi Consulars typically carried green-bladed lightsabers, used sparingly but with skill."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the course of her career, Jocasta Nu wielded at least two different lightsabers, one of which had a green blade, and another with a blue blade. In her late years, she wore robes inscribed with a traditional Ansata pattern, which symbolized her love of knowledge and learning."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Jocasta Nu was created for Star Wars: Episode II Attack of the Clones, where she was played by Alethea McGrath, an actress who also voiced her in the Revenge of the Sith video game, in which she is killed in a cut-scene by Darth Vader."}, {"tag": "p", "text": "Jocasta Nu is voiced by Flo DiRe in Star Wars: The Clone Wars TV series. Among Flo Di Re's other roles was the voice of the Elder in Fallout 2's opening CGI sequence."}, {"tag": "p", "text": "While the original Databank hosted on StarWars.com gave her height as 1.67 meters, the forty-first issue of The Official Star Wars Fact File stated that she was 1.60 meters tall."}, {"tag": "p", "text": "In an interview, her actress Alethea McGrath indicated that a lot of Nu's scenes and backstory were cut before filming and during editing, including that she and Count Dooku used to be in love."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}