{"url": "Joe_Johnston", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Concept artists", "Category:Directors", "Category:Non-fiction authors", "Category:Producers", "Category:Star Wars: Episode IV A New Hope actors", "Category:TV screenwriters", "Category:Young Reader authors", "Category:Reference work artists"], "nodes": [{"tag": "h1", "text": "Joe Johnston"}, {"tag": "p", "text": "Joseph Eggleston \"Joe\" Johnston III (born May 13, 1950 in Austin, Texas) is an American film director, artist and author best known for his work on the Star Wars original trilogy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Johnston was educated at California State University, Long Beach, as well as the Art Center College of Design. Johnston responded to an ad looking for a storyboard artist at college, which turned out to be for George Lucas's Lucasfilm Ltd. company. Johnston began working at the company, eventually promoted to a head storyboard position that frequently teamed him with Lucas in the editing room. Johnston later referred to working for Lucas as the best film school he could ever have when he watched Lucas do the editing for the original trilogy. Eventually, Johnston became disillusioned with his job and decided to leave Lucasfilm with his earnings to travel the world. But Lucas had other ideas when Johnston came to leave his notice. Lucas advised Johnston that he move him to the front line of applicants of his alma mater University of Southern California's Film School with Lucas paying for his tuition and keeping him on at half salary. Johnston said he didn't think twice when accepting Lucas' proposal, which he did in 1984."}, {"tag": "p", "text": "During pre-production for Star Wars: Episode V The Empire Strikes Back, Johnston was responsible for the design of Boba Fett's distinctive armor and equipment. He worked alongside artist Ralph McQuarrie to develop the unique look for the bounty hunter, which was in fact derived from the early concepts of Darth Vader."}, {"tag": "p", "text": "Johnston played an Imperial gunner and a backpacked spacetrooper in Star Wars: Episode IV A New Hope, and in that costume he was made into a Hasbro action figure in 2009."}, {"tag": "p", "text": "In July 2011, Johnston stated that he was \"trying to get George [Lucas] to make a feature based on Boba Fett.[source?]"}, {"tag": "h2", "text": "Star Wars works"}, {"tag": "h3", "text": "Film and TV"}, {"tag": "h3", "text": "Publications"}, {"tag": "h3", "text": "Other Lucasfilm projects"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}