{"url": "John_Berkey", "categories": ["Category:Real-world articles", "Category:Cover artists", "Category:Poster artists"], "nodes": [{"tag": "h1", "text": "John Berkey"}, {"tag": "p", "text": "John Conrad Berkey (August 13, 1932—April 29, 2008) was an artist who made his name illustrating cover art for science fiction books. He illustrated at least eleven pieces of Star Wars art, including cover art for the Star Wars Episode IV: A New Hope novelization and Star Wars: Return of the Jedi: Death Star Battle video game."}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Berkey was born in North Dakota in 1932. Until the age of six, Berkey and his family lived in Aberdeen, South Dakota, whereupon they moved to St. Joseph, Montana and later Excelsior, Minnesota. In 1950, after graduating from high school, Berkey attended the Minneapolis School of Art."}, {"tag": "h3", "text": "Career"}, {"tag": "p", "text": "John Berkey worked for three studios over a six-year period, including Artists Inc., before being hired by Brown & Bigelow for eight years. Since then, he continued to illustrate for various projects, such as cover art for a Science Fiction Book Club cover."}, {"tag": "p", "text": "In the 1960s, Berkey was commissioned by NASA to produce artworks depicting the Apollo space program and other missions, as part of the NASA Art Program. He continued to paint space exploration subjects, including Skylab and the Space Shuttle Challenger disaster."}, {"tag": "p", "text": "Among other commissions, Berkey regularly produced artwork for magazines such as Popular Mechanics, Omni, Science Fiction Age, Discover, National Geographic, TV Guide and The Plain Truth."}, {"tag": "p", "text": "His paintings were used as cover art for a large number of science fiction books, including Ballantine Books' 1972 reprint of the STAR Science Fiction series, and works by Isaac Asimov, Ben Bova, Philip K. Dick, Robert Heinlein, Glen Cook and many more. For the 1972 edition of Asimov's novel, The Caves of Steel, Berkey's cover art featured a self-portrait with his arm showing exposed cybernetic mechanics."}, {"tag": "p", "text": "Berkey began to work in film, designing the artwork for the theatrical release posters for several blockbuster movies including The Towering Inferno (1974), the 1976 remake of King Kong, Orca the Killer Whale (1977), Meteor (1979), Black Stallion (1979), Superman III (1983), and Dune (European release, 1984). He declined an invitation from Stanley Kubrick to work on the 1968 film 2001: A Space Odyssey."}, {"tag": "h4", "text": "Star Wars"}, {"tag": "p", "text": "In 1975, the young filmmaker George Lucas purchased several pieces of Berkey's science fiction artwork. The paintings served as visual reference material while Lucas was trying to pitch his ideas to film studios for a new space fantasy film, The Star Wars. Among the paintings was one of a rocket-plane diving down through space towards a gigantic mechanical planet (the image had been used as cover art for the 1972 reprint of the short story anthology Star Science Fiction Stories No.4). It is thought that this painting in particular had a strong influence on the production design of Star Wars and served to inspire the film's leading concept artist, Ralph McQuarrie, and the model maker Colin Cantwell, whose early designs for the Death Star battle station bore a strong similarity to Berkey's painting. A number of other Star Wars spacecraft, such as Star Destroyers, may also have been influenced by Berkey's designs of naval-style ships with smooth hulls and conning towers bristling with antennae."}, {"tag": "p", "text": "Berkey was commissioned by Lucasfilm and 20th Century Fox in 1976 to provide some of the first poster art for Star Wars. Among this work was a painting which depicted the character Luke Skywalker brandishing a lightsaber, flanked by the robots C-3PO and R2-D2, and a number of Imperial stormtroopers; in the background is a large figure of Darth Vader looming behind them, a similar composition to the theatrical poster artwork for Star Wars by Tom Jung and the Brothers Hildebrandt. When the novelization of the film was published, Star Wars: From the Adventures of Luke Skywalker, the United Kingdom edition published by Sphere Books featured cover art by Berkey (Ballantine Books' US edition originally featured a cover by Ralph McQuarrie)."}, {"tag": "p", "text": "Another of Berkey's original paintings for Star Wars was a poster depicting the final battle over the Death Star from the final scenes of the film. Berkey reportedly never saw Star Wars, and this is evidenced in the fact that he illustrated multiple Millennium Falcon spaceships (in the film there is only one). Berkey said of the poster in an interview, \"It was the first time that I was asked to paint fictional space crafts not of my own design\". The painting was issued as a souvenir poster that was included in the first release of the Star Wars Original Motion Picture Soundtrack by 20th Century Records."}, {"tag": "p", "text": "Berkey's involvement in Star Wars was brought to an end after a conflict of interest with his work for rival film studio Universal on the 1978 TV series Battlestar Galactica."}, {"tag": "p", "text": "Berkey revisted the Star Wars universe in 1983 when he was commissioned to provide the cover artwork for the Atari video game, Star Wars: Return of the Jedi: Death Star Battle."}, {"tag": "h2", "text": "Works"}, {"tag": "h2", "text": "Honors and Awards"}, {"tag": "p", "text": "In 1999, John Berkey received the Spectrum Award for Grand Master."}, {"tag": "p", "text": "John Berkey was inducted into the Society of Illustrators Hall of Fame in 2004."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}