{"url": "John_Boyega", "categories": ["Category:Pages needing citation", "Category:Cite web date argument usages with incorrect date formats", "Category:Real-world articles", "Category:People stubs", "Category:Disney Infinity 3.0 voice actors", "Category:LEGO Star Wars: The Force Awakens voice actors", "Category:Star Wars Battlefront II voice actors", "Category:Star Wars sequel trilogy actors", "Category:Star Wars: Forces of Destiny voice actors"], "nodes": [{"tag": "h1", "text": "John Boyega"}, {"tag": "p", "text": "John Boyega (born March 17, 1992) is a British actor who stars as Finn in the Star Wars sequel trilogy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "His involvement in the sequel trilogy was first announced on April 29, 2014. He has also been involved in Star Wars: Forces of Destiny as well as several Star Wars video games; After making a Twitter post criticizing Star Wars Battlefront's lack of a story campaign, Boyega hosted a trailer for Star Wars Battlefront II."}, {"tag": "p", "text": "In 2019, after moving apartments, Boyega accidentally left a script for Star Wars: Episode IX The Rise of Skywalker under his bed, which was found a few weeks later by a cleaner, who not realizing what they had, posted the script on eBay for $84. The script was purchased by a quick-thinking Disney staffer, preventing a massive leak, but Boyega nevertheless found the experience \"scary.\""}, {"tag": "p", "text": "In response to the death of George Floyd, John Boyega spoke at a Black Lives Matter rally in Hyde Park, London. Boyega's speech was praised by other celebrities including fellow Star Wars star Mark Hamill, director J.J. Abrams, and Lucasfilm."}, {"tag": "p", "text": "Boyega has been openly critical of his involvement in the sequel trilogy. In a 2020 interview with GQ, he said “You get yourself involved in projects and you're not necessarily going to like everything. [But] what I would say to Disney is do not bring out a black character, market them to be much more important in the franchise than they are and then have them pushed to the side. It's not good. I'll say it straight up.”"}, {"tag": "h2", "text": "Star Wars works"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}