{"url": "John_Ostrander", "categories": ["Category:Real-world articles", "Category:Pages needing citation", "Category:Comic authors"], "nodes": [{"tag": "h1", "text": "John Ostrander"}, {"tag": "p", "text": "John Ostrander is a prolific comic book author who has written several titles set in the Star Wars universe, often with Jan Duursema as his artist."}, {"tag": "p", "text": "Ostrander has been the writer of many popular Dark Horse Comics, including Star Wars: Legacy, Star Wars: Dawn of the Jedi and has also contributed greatly to Star Wars: Republic, along with many other series. Many of his story arcs, such as \"Twilight\", \"Darkness\", and \"The Clone Wars\" stories, are available in trade paperbacks. He also worked on Star Wars: Vector. He was even considered as a writer for Star Wars: The Clone Wars, but not hired because the producer wanted writers with experience in TV animation. Ostrander would have written an episode involving Quinlan Vos."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Originally an actor in a Chicago theatre company, he moved into writing comics in 1983. His first published works were stories about \"Sargon, Mistress of War\" published in the First Comics series \"Warp\", based on a series of plays by that same Chicago theatre company. He is co-creator of the character GrimJack with Timothy Truman, published originally as a back up story in the First Comics title, Starslayer, before going on to appear in a comic of the same name, again published by First Comics in the mid 1980s. First Comics ceased publication in 1991, and Ostrander went on to work at other comics companies."}, {"tag": "p", "text": "Prior to his career in comic books, Ostrander studied theology with the intent of becoming a Catholic priest. His in-depth explorations of morality were later used in his work writing The Spectre, a DC Comics series about the manifestation of the wrath of God. His focus is on the character's human aspect, a dead cop named Jim Corrigan, and his exploration of moral and theological themes brought new life to a character often thought of as impossible to write. He has also worked on Firestorm, Justice League, Martian Manhunter, Manhunter, Suicide Squad, and Wasteland for DC."}, {"tag": "p", "text": "Ostrander frequently co-wrote with his wife Kim Yale from the mid-1980s until her death from breast cancer in 1997. It was while working with her that he made what is probably his most lasting contribution to the DC Universe: the recasting of Barbara Gordon, the former Batgirl, into the information and computer specialist Oracle."}, {"tag": "p", "text": "At Marvel comics, Ostrander has also worked on X-Men, Bishop, Quicksilver, Heroes for Hire and the Punisher."}, {"tag": "p", "text": "Ostrander has also written for other comics companies: Hotspur for Eclipse Comics; Lady Death for Chaos! Comics; Magnus, Robot Fighter, Rai and the Future Force, and Eternal Warrior for Valiant Comics."}, {"tag": "p", "text": "Ostrander has also written a Doctor Who audio drama for Big Finish Productions. Titled Dead Man's Hand, the story was originally announced for release in 2004; it was delayed twice, before ultimately going unreleased. As announced, the story was to feature the Seventh Doctor, Ace and Hex in the American wild west."}, {"tag": "p", "text": "His work has won him a good deal of recognition in the comics field, including nominations for the Comic Buyer's Guide Award for Favorite Writer in 1997, 1998, 1999, and 2000."}, {"tag": "h2", "text": "Cameo"}, {"tag": "p", "text": "Ostrander actually made a cameo in the Daring New Adventures of Supergirl 1, when the heroine, Linda Danvers, meets her new neighbor."}, {"tag": "p", "text": "John Ostrander himself described the curiosity as follows:"}, {"tag": "p", "text": "It's true. Paul Kupperberg, who was writing Supergirl at the time, lived across the street from me. We're friends. So he popped me into the cast without telling me. This was just before or just as I was starting my own comics' writing career. I don't remember what happened to my alter-ego. Maybe I should have killed him off in Suicide Squad. Might've been appropriate."}, {"tag": "h2", "text": "Star Wars bibliography"}, {"tag": "h3", "text": "Star Wars: Agent of the Empire"}, {"tag": "h3", "text": "Star Wars: Boba Fett"}, {"tag": "h3", "text": "Star Wars: Dawn of the Jedi"}, {"tag": "h3", "text": "Tales"}, {"tag": "h3", "text": "Star Wars: The Clone Wars"}, {"tag": "h3", "text": "Republic"}, {"tag": "h3", "text": "Jedi"}, {"tag": "h3", "text": "Legacy"}, {"tag": "h4", "text": "Legacy—War"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}