{"url": "Joker_Squad", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Darth Krayt's Galactic Empire military units", "Category:Fel Empire military units", "Category:Imperial Army squads"], "nodes": [{"tag": "h1", "text": "Joker Squad"}, {"tag": "p", "text": "Joker Squad was a stormtrooper squad in the Imperial Army of both the Fel Empire and, years later, Darth Krayt's Galactic Empire. It was part of Company C, Battalion 9 of the 407th Stormtrooper Division and its members were called \"Jokers\"."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During 127 ABY, the first year of the Sith–Imperial War, Joker Squad formed part of the Imperial offensive in the Battle of Botajef, fighting against the Mandalorians led by Mandalore Chernan Ordo. At the time, the squad included Sergeant Ran Harkas, Corporal Kniffler, Armang, and Vax Potorr. Hondo Karr, the sole surviving Mandalorian left on the planet after the end of the battle, was conscripted into the unit after he disguised himself as a wounded stormtrooper."}, {"tag": "p", "text": "Following the coup led by Dark Lord of the Sith Darth Krayt in 130 ABY, Joker Squad, like the rest of the 407th Stormtrooper Division, remained loyal to the Empire despite the new regime."}, {"tag": "p", "text": "By 137 ABY, Joker Squad was based on Yinchorr, and its members at the time included Sergeant Harkas - dubbed \"Hardcase\" by his troopers -, Jes Gistang, Hondo Karr - whose Mandalorian background was a rumor among his new comrades -, the still surviving Vax Potorr, and \"noob\" Trooper Anson Trask. Joker Squad participated in the Battle of Borosk against the 908th Stormtrooper Division, which had defected to the side of deposed Emperor Roan Fel. During the battle, both Gistang and Potorr were killed, while Harkas was wounded, and Karr deserted after witnessing the cruelty of Darth Maleval, the Sith Lord overseeing the elimination of the \"treacherous\" 908th. This left only Harkas, Trask, and a replacement who arrived after the battle as members of the Jokers."}, {"tag": "p", "text": "Later, Sgt. Harkas, Anson Trask and Private Orland went searching for Jedi on Ossus. They were mind tricked by Shado Vao."}, {"tag": "p", "text": "Joker Squad was also present following the bombing of Napdu. They were tasked with shooting anyone they found to make sure none survived the orbital bombing of the planet."}, {"tag": "p", "text": "By 138 ABY, Joker Squad was present on Taivas, participating in the assault on the Hidden Temple of the Jedi Order. During the battle, Harkas was killed, leaving Trask to rally the rest of the Jokers under his leadership."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An action figure 6-pack of Joker Squad was created by Entertainment Earth and unveiled at Comic Con International 2008. It was released in late February 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}