{"url": "Jonash_e_Solo", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Admirals and generals", "Category:Corellians", "Category:Individuals of unspecified species", "Category:Males", "Category:Nobility"], "nodes": [{"tag": "h1", "text": "Jonash e Solo"}, {"tag": "p", "text": "Jonash e Solo was the Prince-Admiral of the planet Corellia during the Seventeenth Alsakan Conflict between Coruscant and Alsakan in 3017 BBY. Despite Corellia's neutrality in earlier clashes, the Galactic Republic declared war on the planet in retaliation for a Corellian privateer attack on Coruscant. In the ensuing strife, Corellian forces swiftly defeated the Republic Navy, and the Prince-Admiral personally imposed the terms of peace at swordpoint before the Galactic Senate, ending the war."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jonash e Solo was a male individual who, as Prince-Admiral of the planet Corellia, served as a leader of the Corellian military during the Seventeenth Alsakan Conflict, the last in a series of wars fought between two rival factions of the Galactic Republic. Socioeconomic tensions had led to civil war between Coruscant and Alsakan, two influential Republic worlds with sizable military forces, but Corellia—also a member of the Republic—opted not to get involved in the conflicts and declared neutrality. When the Seventeenth Conflict broke out in 3017 BBY, the Corellian military was prepared to intervene and end the civil war once and for all."}, {"tag": "p", "text": "As the Republic Navy faced off against the fleets of Alsakan-dominated worlds along the Perlemian Trade Route, Corellia built up a force of advanced, long-range frigates whose state-of-the-art technological innovations made them superior to the battleships fielded by Coruscant and Alsakan, as demonstrated when Corellian privateers launched attacks on both planets. In response, the Republic, under Supreme Chancellor Vedij, declared war on Corellia, a move that proved disastrous, as the Corellian military repeatedly bested Republic forces. The Prince-Admiral traveled to the Senate Building on Coruscant to personally establish the terms of peace, negotiating them at swordpoint before the Galactic Senate. In doing so, he brought about a permanent end to the Alsakan Conflicts, making Corellia the ultimate victor."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A leader of the Corellian military, Jonash e Solo oversaw Corellia's victory in the Seventeenth Alsakan Conflict when he dictated the terms of a peace treaty to the Republic Senate on Coruscant. His actions ensured that no future Alsakan Conflict would occur."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jonash e Solo was created for The Essential Guide to Warfare, a 2012 reference book written by Jason Fry and Paul R. Urquhart, in which he was established as a major figure in the Seventeenth Alsakan Conflict. Despite their shared surname, Jonash's relationship to later Corellian leader Berethron e Solo and other members of the House of Solo, if any, has yet to be explored."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}