{"url": "Anna_Graves", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Cleanup", "Category:Disney Infinity 3.0 voice actors", "Category:Star Wars Rebels voice actors", "Category:Star Wars: The Clone Wars voice actors", "Category:Star Wars: The Old Republic voice actors", "Category:Notable fans"], "nodes": [{"tag": "h1", "text": "Anna Graves"}, {"tag": "p", "text": "Anna Graves (born Anna Desiree Godwin on May 12, 1978 in Memphis, Tennessee) is a voice actress who has worked on several commercials and video games, including X-Men Origins: Wolverine as Mystique/Raven Darkholme, Carol Frost and Staff Fight #1, James Cameron's Avatar: The Game as RDA, and as an additional voice actress in Call of Duty 4: Modern Warfare,\nCall of Duty: Modern Warfare 2, Call of Duty: Modern Warfare 3 and Lightning Returns: Final Fantasy XIII."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 2010, Graves began voicing in The Clone Wars TV series Satine Kryze, the Duchess of Mandalore and former love interest of Jedi Master Obi-Wan Kenobi who is played by voice actor James Arnold Taylor."}, {"tag": "p", "text": "She is a life-long Star Wars fan. To portray Satine, she drew wisdom, strength and regality from Cate Blanchett's portrayal of Queen Elizabeth. And because of Satine's relationship to Obi-Wan, she decided to emulate Carrie Fisher's portrayal of Leia Organa. She would also voice this character in Disney Infinity 3.0."}, {"tag": "p", "text": "Graves also played two female bounty hunters, Sugi and Rumi Paramita, in the episode \"Bounty Hunters,\" and Senator Meena Tills of Mon Cala in the fourth season's first story arc. She returned as Satine for two episodes of Season 3, \"Corruption\" and \"The Academy,\" and reprised the role of Sugi for the season finale episode \"Wookiee Hunt.\" She voiced Satine again in Season 4's episode \"A Friend in Need\" and in Season 5's \"Shades of Reason\" and \"The Lawless,\" as well as Sugi in \"Eminence.\""}, {"tag": "h2", "text": "Star Wars voice work"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}