{"url": "Jonathan_W._Rinzler", "categories": ["Category:Real-world articles", "Category:Comic authors", "Category:Editors", "Category:Non-fiction authors", "Category:TV screenwriters"], "nodes": [{"tag": "h1", "text": "Jonathan W. Rinzler"}, {"tag": "p", "text": "Jonathan W. Rinzler is a former author and editor for Lucas Licensing's book division."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 2005, Jonathan W. Rinzler was hired to write three Star Wars guide books which were published all the same day, entitled respectively Star Wars: Visionaries (although he only wrote the introduction of this one), The Art of Star Wars Episode III: Revenge of the Sith and The Making of Star Wars Revenge of the Sith. He went on to write The Art of Revenge of the Sith that same year. In 2007, he wrote and published The Making of Star Wars: The Definitive Story Behind the Original Film on April 24."}, {"tag": "p", "text": "In the 2010s, Rinzler wrote more Star Wars reference books, starting with The Sounds of Star Wars, Star Wars: Visionaries (only its introduction) and The Making of The Empire Strikes Back, published between September and October of 2010. Between 2011 and 2013, Rinzler went to write and publish Star Wars: The Blueprints, The Star Wars and The Making of Return of the Jedi. Rinzler lobbied to be a writer for both Star Wars: The Clone Wars and Star Wars: Underworld, and ended up being credited as writer of the sixth season episodes \"The Disappeared, Part I\" and \"The Disappeared, Part II.\" Following the announcement of the Star Wars canon reboot in anticipation of a sequel trilogy and creating the Star Wars Legends brand in April of 2014, a new edition of The Star Wars by Rinzler was published on May 7."}, {"tag": "p", "text": "On December 2, 2017, in answering a fan question about whether he would publish new reference or guide books to cover the entire production of the sequel trilogy or the Star Wars Anthology Series films, Rinzler stated that it was better to ask Del Rey, J.J. Abrams or The Walt Disney Company about the matter, as he no longer works at Lucasfilm Ltd."}, {"tag": "h2", "text": "Star Wars works"}, {"tag": "h3", "text": "Writer"}, {"tag": "h3", "text": "Editor"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}