{"url": "Jonoin", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Republic Navy admirals"], "nodes": [{"tag": "h1", "text": "Jonoin"}, {"tag": "p", "text": "Jonoin was an individual who served as an admiral in the Republic Navy during the Clone Wars. During the latter stages of the conflict, Jonoin lead a Republic attack on a Confederate base that was located on the planet Garia. Jonoin's forces carried out an orbital bombardment of the base, but their strike was unsuccessful, so the Admiral ordered a ground assault against the facility."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jonoin was an individual who served the Galactic Republic as an admiral in the Republic Navy during the Clone Wars, an intergalactic conflict that was fought between the Republic and the Confederacy of Independent Systems. Sometime near the end of the war, Jonoin commanded Republic forces during an attack on a Confederate base that was located on the planet Garia, in the Brak sector. Jonoin's forces carried out an orbital bombardment of the base, but the strike was unsuccessful because the base was protected by energy shields. The Admiral was therefore forced to alter the battle plan. Jonoin contacted all of the Republic units participating in the attack and ordered a ground assault on the base's control center to destroy the droids stationed there and shut down the shield."}, {"tag": "p", "text": "Republic ground forces landed on Garia, and a number of AT-TE walkers began to approach the command center. However, Confederacy fire inflicted heavy damage onto the walkers, so Jonoin ordered a group of Republic commanders to assist the lead AT-TE, which had been rendered immobile near the base."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jonoin was mentioned in Point Blank, a roleplaying scenario that was written by Sterling Hershey and released in 2010 on the website Wizards.com. Jonoin's gender and species are not revealed in the scenario."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}