{"url": "Joodiel_Amgris", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Businesspeople", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Joodiel Amgris"}, {"tag": "p", "text": "Joodiel Amgris was an individual who lived on the planet Varonat, in the settlement of Tropis-on-Varonat. Around 7 ABY, Amgris opened Great Jungle Outfitters, a store that catered to the Morodin-hunting safaris organized by the Krish Gamgalon, as the influx of people boosted the settlement's economy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Joodiel Amgris was a native of the planet Varonat, located on the Ison Corridor in the Anoat sector of the Outer Rim Territories. Amgris lived in Tropis-on-Varonat, and around 7 ABY, a Krish named Gamgalon arrived on the planet and began organizing safaris hunting the Morodin, a species of giant herbivores, out of the settlement that boosted the local economy. In response, Amgris opened Great Jungle Outfitters, a store that sold hunting gear exclusively to the individuals who participated in Gamgalon's hunting expeditions. Conveniently located by Tropis-on-Varonat's landing field next to a hotel, Amgris's equipment was always brand new and looked to be fresh-out-of-the-box when worn by the customers."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Amgris was an enterprising individual who was able to astutely establish a new business that served a large money-making enterprise such as Gamgalon's safaris."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Joodiel Amgris was mentioned in the supplementary RPG material that accompanied Timothy Zahn's First Contact, which was published in 1994's Star Wars Adventure Journal 1 by West End Games. The extra background material was written by Peter M. Schweighofer. Because Amgris only appeared in the supplementary information, the character was not mentioned when the story was reprinted in Tales from the Empire or on Hyperspace, as neither reproduced the RPG material that accompanied the original story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}