{"url": "Jook-jook_H%27broozin", "categories": ["Category:Legends articles", "Category:Individuals of unspecified species", "Category:Jedi Masters of the Jedi Order", "Category:Legions of Lettow", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jook-jook H'broozin"}, {"tag": "p", "text": "Jook-jook H'broozin was a male Jedi Master serving the Jedi Order on Ossus during the Order's early years. Joining several other Jedi, H'broozin became a Jedi Renunciate and a Legionnaire of Lettow, one of the many followers of Xendor during the First Great Schism."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive, Jook-jook H'broozin lived on Ossus, the home of the Jedi Order during its early years. Ascending to the rank of Jedi Master, H'broozin took Danzigorro Potts as his Padawan and began training him in the Force. At this time, H'broozin became enamored by the enigmatic teachings of Xendor, who preached that the Jedi High Council was too restrictive in their teachings and wished to limit understanding of the Force. When Xendor parted with the Order to found an academy on Lettow, H'broozin abandoned his teachings and his student to learn from Xendor. Calling themselves the Legions of Lettow, the Jedi Renunciates grew strong in the Force as they studied the Bogan through many different Force-traditions."}, {"tag": "p", "text": "When the High Council declared war on the Legions of Lettow, H'broozin was joined by fellow Legionnaires Blendri and Cuthallox and took up swords to protect their rights to study the Force. Meeting the Order in a full-blown conflict called the Great Schism by the Order, the former Jedi Master jumped from world to world to fight off the Jedi. At the battle of Corulag H'broozin's former Padawan, Danzigorro Potts met him on the battle field and crossed swords. When H'broozin's guard was down, Potts ran his former master through with his sword, killing him."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}