{"url": "Jora_Astane", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Alderaanians", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Jora Astane"}, {"tag": "p", "text": "Jora Astane was a human female who held the title of Preserver in an enclave of Alderaanians on the planet Sullust. She led her collective and attempted to stay hidden after the destruction of Alderaan, when the Galactic Empire hunted surviving Alderaanians across the galaxy. Princess Leia Organa of Alderaan arrived on Sullust to rescue the Alderaanians there, but Astane and her people initially mistook Organa for a traitor. After Organa helped Astane and her people repel invading Imperial forces, Astane pledged her allegiance to the princess."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mistrust on Sullust"}, {"tag": "p", "text": "Jora Astane was a female human who was born on the planet Alderaan, but left her homeworld with a large group of other Alderaanians to live on the world of Sullust. There, the immigrants from Alderaan pooled their wealth, which they accumulated through smuggling, and purchased a large subterranean area of land from the native Sullustan species, which they transformed into the Alderaan Enclave. While they claimed to be providing cultural services to the locals, including food, art and education, these activities were actually a cover for selling Alderaan's art and cultural heritage to outsiders. This all changed when Alderaan was destroyed by the Galactic Empire. Astane, who led the enclave, took the title \"Preserver of Alderaan\" and cut off all communication with the outside world, setting up a large surveillance network to monitor for any Imperial activity on Sullust or its moon."}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Princess Leia Organa, another surviving Alderaanian, arrived on Sullust as part of a mission to rescue as many of the Alderaanians as she could from Imperial persecution. Astane was made aware of Organa's arrival when the Princess and her companions; the pilot Evaan Verlaine, the astromech droid R2-D2 and the local Sullustan guide Tivvy breached the boundary of the enclave by entering through auxiliary hatch three. Initially Astane considered the groups appearance to be a possible diversion to distract her from a larger attack, but upon recognizing Organa's face she sent out a rifle squad to intercept the visitors. Organa, Verlaine and R2 managed to disarm the squad and, leaving Tivvy behind, entered the compound to meet Astane. The Preserver was highly suspicious of the visiting royalty, and suspected that she might have come to turn over the enclave's inhabitants to the Empire. When Organa explained her mission, Astane was still dubious and ordered that her subordinate Covis take R2 and collect as much data from him and Organa's orbiting starship Lord Junn as possible to make sure they were not being tricked."}, {"tag": "p", "text": "While Covis worked, Astane showed Organa and Verlaine the Eyewell, from which the enclave's surveillance was carried out. Verlaine then began criticising Astane for her treatment of Alderaanian culture and the Princess, but the argument was interrupted by Covis, who broadcast a transmission he had discovered from the Lord Junn to the Eyewell. The message was from Tace, an Alderaanian that Organa had recused from the planet Naboo, and had been sent three hours earlier to her sister Tula, who unknown to Tace was serving on board an Imperial Star Destroyer. As the transmission ended, the Star Destroyer arrived in the Sullust system, and taking the transmission as evidence that Organa was working with the Empire, Astane ordered her men to execute Verlaine and Organa; however, the pair managed to flee down into the Eyewell where the enclave's residence could not shoot in case they damaged the surveillance equipment. Astane sent a squad to catch the fleeing visitors at the bottom of the well, but the pair managed to escape through a hatch opened for them by R2."}, {"tag": "p", "text": "Astane meanwhile rushed to Covis, who informed her that a Sentinel-class landing craft full of stormtroopers was heading for the enclave. The Preserver gave orders for all troops bar those chasing Organa to prepare for a battle, and moved to lead the men herself in the fight. The enclave's troops were caught off guard when the stormtroopers dropped down from above instead of coming through one of the entrance hatches, and the Alderaanians sustained high casualties in the ensuing battle. The tide was turned when the Princess returned from the tunnels below the enclave with a herd of rockrenders, native animals that fed on minerals and so attacked the Imperials in order to eat their armor. With the battle won, Astane mourned her dead, including the young man Bornae, and then knelt before Organa, apologising and pledging the enclave to her cause."}, {"tag": "h3", "text": "Prejudice on Espirion"}, {"tag": "p", "text": "Verlaine was able to contact Nien Nunb, a Sullustan smuggler she was friends with, and have him smuggle the Alderaanians off Sullust in his starship Mellcrawler. Once onboard the Lord Juun, Astane and Covis spent a week seeking out Tace and restraining her to bring before their Princess. Organa demanded that the restraints be removed and that the prisoner be left alone with her, much to Astane's annoyance. Organa listened to Tace's story and came to believe she had truly be unaware of her sister's allegiance. Making the traitorous Tula her top priority, Organa elected to send Astane and Uwa Pareece in her place to the planet Espirion, where she had learned that another group of Alderaanian survivors lived."}, {"tag": "p", "text": "On Espirion, Astane and Pareece met with the native Espirion Consul Rill, who organized a meeting between them and Chief Beon Beonel, leader of the local Alderaanian population. Upon meeting Beonel, Astane was disgusted to discover he was an Alder-Espirion hybrid, a disgust which Beonel immediately recognized in her expression. Having expected such bigotry, Beonel immediately rejected joining with Organa and left, despite Pareece's promise that Astane did not represent the views of the other survivors. The two Alderaanians then tried to convince Rill to call Beonel for another meeting, with Astane telling him to send her deepest apologies in order to get the Chief to return and Pareece claiming Organa would meet with the Alder-Esperion in person. Rill refused to lie to Beonel, and so Astane gave up on the venture, telling Pareece they should simply return to the ship. Angry at Astane, Pareece made one last attempt to convince Beonel the next morning when they ran into him at the local spaceport as he boarded a ship. Beonel again refused to join their cause, forcing a defeated Pareece to return with Astane to the Lord Juun."}, {"tag": "p", "text": "Upon traveling to their orbiting vessel, Astane and Pareece discovered that a large fleet of Alderaanian vessels had traveled to Espirion, having heard of Organa's exploits and hoping to join her. Organa herself also soon returned to the Lord Juun from the planet Skaradosh, where she had rescued Tula from Imperial hands. She brought with her grave news though, as the Imperial Star Destroyer that had troubled them on Sullust was now headed for Espirion to attack them. The Princess asked that Pareece contact the Alder-Espirions and ask for assistance, forcing Astane to admit her failure in convincing Beonel to join their cause. Organa held her temper and dismissed Astane, who then took up position on one of the Lord Juun's turrets in order to defend against the Star Destroyer. Before the battle begun, Organa sent out a transmission to all the Alderaanians present, including Astane, inspiring them to fight but reminding them of them of the peaceful Alderaanian way of life."}, {"tag": "p", "text": "Unbeknownst to Organa, the transmission was sent to Espirion as well by R2, where it was seen by Beonel. Swayed by the Princess's word, the Chief sent the starship Espirion Multi to aid in the battle against the Imperials and together with the fleet the vessel destroyed the Star Destroyer. Following the battle, Astane and the other Alderaanians rejoiced as Beonel and his people joined Organa's cause. The Princess herself then left the survivors to return to the Alliance to Restore the Republic, telling Verlaine to see to it that a new leader was fairly elected in her place, but also telling the pilot to ensure it was not Astane."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jora Astane was a human Alderaanian woman with white hair, green eyes, and dark skin. She wore a white tunic with matching trousers and a gray cloak. Astane was the leader of a reclusive Alderaanian enclave on Sullust whose paranoia led them to maintain an advance listening station known as the Eyewell. While Astane claimed to be offering cultural and educational services to the local Sullustan population, these activities were a cover for selling Alderaanian cultural artifacts and arts to outsiders. As a survivor, Astane was willing to do anything to survive and had little regard for the arts and culture."}, {"tag": "p", "text": "Jora initially distrusted Organa and Verlaine's plan to gather the Alderaanian refugees, believing that she and her followers were save beneath Sullust's surface. The interception of Imperial signals from Organa's ship Lord Junn led Astane and her followers to wrongly assume that Organa was an Imperial spy and traitor to Alderaan. However, Astane changed her view of Organa when she saved the Alderaan Enclave from being exterminated by stormtroopers. Astane expressed regret for her distrust of Organa and pledged her and her people's allegiance to her."}, {"tag": "p", "text": "Due to her preoccupation with security and the loss of lives at the Sullustan enclave, Astane sought retribution against Tace, whom she wrongfully believed to be an Imperial spy. Organa's insistence on not condemning Tace without proving her guilt strained her relationship with Astane. Astane also harbored xenophobic sentiments, regarding the hybrid Alder-Espirions as a dilution of Alderaanian identity. Her xenophobic views damaged Organa's initial attempts to build relations with Espirion, leading Organa to oppose her nomination as Princess."}, {"tag": "p", "text": "Despite her stormy relationship with Organa, Astane was still a loyal subject and manned a gun turret when the Alderaan flotilla was threatened by an Imperial Star Destroyer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jora Astane was created by writer Mark Waid and illustrator Terry Dodson for the comic book mini-series Star Wars: Princess Leia, which was published in 2015. She first appeared in the third issue of the series, and went on to play an important role in the two remaining issues."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}