{"url": "Jord_Dusat", "categories": ["Category:Legends articles", "Category:Athletes", "Category:Humans", "Category:Males", "Category:Mechanics"], "nodes": [{"tag": "h1", "text": "Jord Dusat"}, {"tag": "p", "text": "Jord Dusat was a speeder racer in the early years of the Galactic Empire who, along with his friend and rival Thall Joben, came into the possession of the droids C-3PO and R2-D2 while they were separated from Raymus Antilles. Jord was something of a rebel and a troublemaker, though he was generally good tempered, often cracking jokes."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Dusat learned to race on the arid salt flats of his homeworld, Ingo, developing a friendship with fellow racer Joben and eventually setting up a business repairing speeders together. Joben and Dusat began constructing White Witch, a speeder which they intended to enter in the Boonta Speeder Race. While racing through the desert on Ingo, Joben and Dusat came across R2-D2 and C-3PO. who had been dumped by their previous master shortly before he was arrested for smuggling. White Witch required an astromech droid to assist the driver, and R2-D2 was ideal for the role, so Joben and Dusat became the droids' new masters."}, {"tag": "p", "text": "While returning home with the droids, the racers passed close to a secret base where the Fromm Gang was developing a weapons satellite, Trigon One, which they planned to use to overthrow the other gangs. Fearing that the intruders would reveal the base's location, Tig Fromm dispatched sentry droids to attack them. The two racers escaped with the assistance of Kea Moll, who was on a mission to locate and destroy Trigon One."}, {"tag": "p", "text": "Agreeing to assist Kea in her mission, they were able to break into the secret base and steal Trigon One. Joben hid the weapons satellite in a forest on Ingo but when Sise Fromm kidnapped Dusat and Kea's mother he agreed to reveal the location in exchange for their release. Tig Fromm went to retrieve Trigon One, but Joben and R2-D2 had sabotaged the guidance system causing the ship to collide with and destroy Sise Fromm's base on Annoo."}, {"tag": "p", "text": "The group traveled to the Boonta Speeder Race, but a Fromm attack on their ship damaged White Witch and injured Dusat, forcing Joben to take over as driver for the race. Joben won the race, despite the efforts of Boba Fett, who Sise Fromm had hired to kill the young racers."}, {"tag": "p", "text": "After the race, Joben and Dusat were approached by Zebulon Dak, owner of Zebulon Dak Speeder Corporation, who offered them jobs designing and engineering speeders. Company policy would necessitate a memory wipe for R2-D2 and C-3PO, so they decided to decline. Unwilling to stand in the way of their masters' dreams, R2-D2 and C-3PO left in an escape pod shortly before their ship went to hyperspace, freeing Joben and Dusat up to take the jobs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jord was voiced by two different actors, first Peter MacNeill, then Dan Hennessey."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}