{"url": "Jori_Daragon", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Females", "Category:Force-sensitives", "Category:Humans", "Category:Space explorers", "Category:Tetans"], "nodes": [{"tag": "h1", "text": "Jori Daragon"}, {"tag": "p", "text": "Jori Daragon was a Human female native of Koros Major and a hyperspace explorer who lived circa 5000 BBY. Although she and her brother, Gav Daragon, were somewhat Force-sensitive, they chose not to join the Jedi Order and remained untrained in the use of the Force. Following the death of her parents, she and Gav became indebted to Aarrba the Hutt. Running out of credits, the two took their ship, the Starbreaker 12, on one last expedition from the city of Cinnagar in hopes of repairing their finances by earning a commission from the Brotherhood of Navigators for finding new hyperlanes. The Daragons accidentally discovered a trail that took them to the Sith world of Korriban. They were imprisoned by the Sith and taken to the planet Ziost for interrogation."}, {"tag": "p", "text": "Eventually, they were sentenced to death by the Sith, but Sith Lord Naga Sadow sprang them from prison and took them to his own fortress. Sadow hoped to convince the other Sith that the Daragons were the precursor for a Republic invasion, as that would give him the support of the other Sith Lords for his plan to invade Republic space. When Sadow's rival, Ludo Kressh, attacked Sadow's fortress, Jori took the Starbreaker 12 and escaped back to Republic space, knowing that she was the only means of warning the Republic of a Sith invasion. Little did she know that Sadow had placed a homing device on her ship and was planning on following the Starbreaker 12's course."}, {"tag": "p", "text": "She returned to the Koros system and, after overcoming arrest and incarceration for various crimes, managed to get an audience with Empress Teta, leader of the Koros system, and several prominent Jedi Masters, including Memit Nadill and Odan-Urr. Jori's warning came in time for a successful last-ditch defense to be mounted against the oncoming Sith armada. However, Gav was aiding the Sith fleet and when Jori encountered him on Cinnagar, she chased her brother, trying to stop him. Although Gav eventually turned on the Sith, Sadow had him killed over Primus Goluud. However, Jori survived the war, and since one of its casualties had been Aarrba, she took over ownership of the Hutt's repair dock."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Jori Daragon was born some time prior to 5000 BBY and grew up on the world of Koros Major. As children, Jori and her brother Gav tested high enough in Force potential to be accepted for Jedi training, but they refused, seeking the wealth that could be found in a spacer's lifestyle. They worked with their parents, Hok and Timar Daragon, in the city of Cinnagar. The elder Daragons typically flew their ship, Shadow Runner, while the younger Daragons piloted the Starbreaker 12. The two often begged their parents to let them go on runs with them, but Hok and Timar usually forced them to remain on Koros Major. When Hok and Timar were killed by rebels while delivering supplies to Empress Teta's soldiers in the Battle of Kirrek during the Unification Wars, their financier, Aarrba the Hutt, extended their credit, claiming that their parents' ship had been paid for with their blood. Though they were grief-stricken at the loss of their parents, Jori and Gav took the Starbreaker 12 and began a life mapping out new hyperspace routes."}, {"tag": "p", "text": "The siblings, running low on funds and already forced to sell their dwelling as collateral to repay Aarrba, damaged the Starbreaker 12 while flying through the Starswarm Cluster in an attempt to find a new route. The Hyperspace Navigator's Guild approved their route, the Goluud Corridor, but marked it as risky. However, Jori and Gav soon found themselves with a price on their heads, put on by merchant lord Ssk Kahorr after one of his drone ships crashed into the giant star Primus Goluud while using the Goluud Corridor. Kahorr had been hoping to reap large profits from use of the route, but was furious at the loss of his ship. In response, Kahorr sent a pair of assassins to kill them, and the Daragons came under attack one night while sleeping on the streets of Cinnagar. While Jori and Gav attempted to fend them off, they were unarmed save for rocks and a stick, while both assassins were armed with polearm weapons. The Daragons ran away, but were soon cornered, lamenting the turns of events that had brought them to their current position. However, at that point, two Jedi Knights, Odan-Urr and Memit Nadill, appeared and confronted the assassins. After the Jedi defeated the hired attackers, Nadill advised Jori and her brother to leave Koros Major, which they did. Later, Jori and Gav stole back the impounded Starbreaker 12 and, pursued by Cinnagar security forces, punched in random coordinates, sending them on a blind jump into hyperspace. Neither of them were aware of it, but it was their unconscious use of the Force that enabled their statistically impossible jump."}, {"tag": "h3", "text": "Discovering the Sith Empire"}, {"tag": "p", "text": "When the two explorers emerged from hyperspace, they realized they had journeyed far beyond charted territory. Spotting a nearby planetary system, they set down on the world of Korriban, not knowing that it was the homeworld of the Sith, an ancient species of sentient, Force-worshiping humanoids. As they descended, they noted the wealth visible from the cockpit and hoped that their new route would lead to the establishment of a viable and profitable trade route. Gav happily exclaimed that their problems were solved, but upon disembarking, Jori and Gav found themselves surrounded by armed Sith warriors, who took them prisoner."}, {"tag": "p", "text": "The two siblings were placed in a prison on the Sith world of Ziost while the ruling Sith Lords decided their fates. Lord Naga Sadow, who hoped to succeed the recently-deceased Marka Ragnos as the Dark Lord of the Sith, saw the two as an opportunity, a pathway for a Sith conquest of the Republic, while his rival, Ludo Kressh, feared that the arrival of the Daragons meant an impending Republic attack on the Sith. Kressh's arguments eventually prevailed, and Sith Lord Simus journeyed to the prison level and informed the Daragons that they were to be executed. Upon hearing that news, the siblings despaired and wished they had made different choices in the past. However, in the first step of his elaborate plan to become Dark Lord, Naga Sadow and his loyal group of Massassi warriors attacked the Ziost prison, freeing Gav and Jori, and making it look like an attack that was orchestrated and carried out by the Republic by using weapons confiscated from the Starbreaker 12. Gav and Jori were sent to Sadow's private fortress on Khar Shian, grateful to be alive, as Sadow continued with the next phase of his plan. He used the prison break, which had cost the lives of numerous Sith warriors as well as Simus, a well respected member of the Sith Council, as instigation to have himself crowned the reigning Dark Lord of the Sith and begin preparations for an attack on the Republic."}, {"tag": "p", "text": "Shortly afterward, Jori was separated from her brother, being sent to Khar Shian's icy host planet of Khar Delba, where Sadow had a decoy fortress, a duplicate of his stronghold on Khar Shian. Sadow assured her that she was not being kept as a prisoner, despite her isolation and meager living quarters. She asked the Sith about the fate of her brother, but Sadow told her that the still active execution order meant that the Daragons could not be released yet. In response, she told him that she and Gav would need the Starbreaker 12, in order to get back to Republic space. After many days, she was finally able to get through to Gav, as Sadow presented her with an amulet that allowed Gav, whom Sadow had been training in the Force, to contact her in an audio and visual format projected from the amulet, linking the brother and sister. Sadow also presented her with the Starbreaker 12, which his Massassi warriors had seized from Kressh's forces in a commando raid. However, Kressh learned of Sadow's involvement in the raid, as Sadow had wished, and launched an attack on the decoy fortress, where Sadow and Jori were."}, {"tag": "p", "text": "Sadow told Jori that he had promised her safe return to the Republic and bade her enter the Starbreaker 12 and escape. She was reluctant to leave without Gav, but the Sith told her she had no choice if either of them were to survive. Powering up the engines, she found the navigation computer coordinates back to Republic space intact. Weaving through the attacking ships, she managed to slip through their fleet and jump to hyperspace back to the Republic, promising herself that she would return with help to free Gav. However, she was unaware that Sadow had purposefully allowed her to return to the Republic and planted a homing device on her ship so he could follow her with an armada with which to attack the Republic."}, {"tag": "h3", "text": "Return to the Republic"}, {"tag": "p", "text": "Upon the Starbreaker 12's reversion from hyperspace over Cinnagar, Jori nearly collided with a ship leaving orbit. She averted collision and hailed Cinnagar's authorities, claiming she had an important message. However, they took a dim view of her return in light of the circumstances of her departure and launched interceptors to escort the Starbreaker 12 down to the surface, and she followed their instructions. After landing, Jori disembarked and attempted to relay her story, only to be immediately arrested for several crimes, including stealing the Starbreaker 12. All attempts to warn the guards were in vain and she was conducted to a detention center. Her old patron, Aarrba, was disappointed with her, saying he had had enough of her lies, and her ship was seized by Ssk Kahorr as compensation for the loss of his merchant ship. Her trial followed shortly afterward, with the guards informing her that the evidence was clear-cut against her. Disheartened, Jori wondered how she was going to help Gav and how she was going to convince her captors of her sincerity."}, {"tag": "p", "text": "Her trial proceeded with her being charged with multiple crimes, including grand theft, firing on Cinnagar security ships, destruction of property, reckless mayhem, resisting arrest, and unauthorized departure through restricted shipping lanes. She admitted her guilt and tried to warn her captors of the Sith, but was again ignored. As a result of her confession, she was sentenced to hard labor on the colony world of Ronika. Working at mining by hand, she felt she had to escape and therefore stole a Drone Ore Shuttle . She was pursued into orbit by fighters, but her ship was sturdy enough to shrug off their weapons blasts. Returning to Cinnagar, a much larger group of fighters was waiting for her and her ship suffered severe damage, breaking up in the middle of the atmosphere. Jori grabbed a repulsorlift chute and flew out of the doomed ore shuttle toward the palace of Empress Teta. Climbing up the walls of the palace, Jori managed to reach the throne room and was immediately set upon by the guards, who figured her to be an assassin, as did the Empress herself. Holding out a Sith amulet she had brought with her, Jori managed to convince Teta and her Jedi advisors, Odan-Urr and Memit Nadill, of the veracity of her claim. Odan-Urr had previously experienced visions of the return of the Sith, and Jori's return convinced him that war was imminent. He remained on Cinnagar while Nadill returned to Coruscant, the galactic capital, to warn the rest of the Jedi and the Republic."}, {"tag": "h3", "text": "Great Hyperspace War"}, {"tag": "p", "text": "As Empress Teta prepared for war, rallying her troops and fleet, Jori was eager to find a ship or at least a weapon to aid in the defense of Koros Major. Odan-Urr gave her a lightsaber and she left the Empress's palace to find a ship at Aarrba's Repair Dock. As she journeyed there, Sith ships attacked Cinnagar, deploying land troops. The Sith amulet she still held in her possession began to tingle and she suspected that Gav was nearby. Arriving at Aarrba's Repair Dock, she found Gav and his Massassi bodyguards standing over Aarrba's corpse. Jori assumed that Gav had slain Aarrba, and she attacked him and his bodyguards, but he managed to flee, using a Sith craft to return to a Sith battleship. Jori seized a ship of her own and followed him, but Gav's battleship jumped to hyperspace, bound for Primus Goluud, where Naga Sadow had his flagship, a Sith Meditation Sphere, stationed. From his sphere, Sadow used Sith sorcery to generate illusions of additional Sith forces on worlds across the galaxy, as well as use battle meditation to influence battles."}, {"tag": "p", "text": "Gav confronted Sadow and turned on him, attacking the meditation sphere and damaging it, but Sadow convinced Gav to meet him face-to-face. Gav acquiesced and when he arrived on the meditation sphere, he found it deserted. When Jori, accompanied by a portion of Teta's fleet, arrived over Primus Goluud, they found that the last remnants of Sadow's fleet had returned there as well from various engagements. The two fleets engaged one another, and Gav informed them that the Sith Empire was vulnerable; Sadow had brought his entire fleet to attack the Republic. However, he was trapped on the meditation sphere when Sadow triggered a supernova in the giant star. Knowing that he couldn't escape in time, he told Jori and the Empress's forces to escape before the star exploded, saying he was sorry for having aided the Sith in their invasion. Tearfully, Jori bade farewell to her brother as Teta's fleet jumped to hyperspace just before Primus Goluud exploded."}, {"tag": "p", "text": "Teta's fleet arrived in the Sith Empire at the coordinates provided by Gav, striking against a Sith battle fleet already weakened by the failed assault on the Republic and further infighting between Naga Sadow and Ludo Kressh. The Sith were defeated and Sadow escaped with only a single ship in the face of Teta's onslaught. Jori was glad to see the Sith defeated, but was still saddened over the loss of her brother. Upon their return to Cinnagar, she was summoned to the presence of the Empress, who recognized the losses she had taken in the war and asked her if there was anything she wanted. In response, Jori asked for and was granted ownership of Aarrba's Repair Dock, which had been a dream for her and her brother for years."}, {"tag": "p", "text": "Odan-Urr had several interviews with Jori, owing to the Jedi's interest in the Great Hyperspace War. With her help, the whole backstory of the War could be included in the Tedryn Holocron to reserve all information for the Jedi Order."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Years after her lifetime, Jori Daragon was remembered for her role in starting the Great Hyperspace War, including in a compilation of Jedi history and lore created by Jedi Tionne Solusar in 40 ABY. In the years after the Daragons, some historians pointed out that the Great Hyperspace War might have been avoided had Jedi Odan-Urr not saved the Daragons from Kahorr's assassins, but Solusar believed that the Daragons could not be held responsible for the start of the war. Their role was long remembered throughout history for blazing what was considered one of the most remarkable hyperlanes of the Old Republic era. The hyperlane, named the Daragon Trail, provided a passage directly from the Deep Core to Sith space. Information about the Daragons was also included on the Omen, a ship bearing a group of people who would eventually found the Lost Tribe of Sith on Kesh."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jori Daragon was impulsive and impetuous, and willing to take great risks without concern for her own safety or future consequences. She was willing to commit a large number of crimes in an attempt by her and her brother to break out of their destitute circumstances. She was also easily upset, weeping openly on numerous occasions. Her brother, and to a lesser extent, her ship, the Starbreaker 12, were the two main things she prioritized after the death of her parents. She often lamented the injustice of her and Gav's situation, being less optimistic than her brother. She was also naïve, believing that people, including the Sith Lord Naga Sadow, were as sincere as she was. She was determined to do what she felt was the right thing, even risking her life for an audience with Empress Teta to deliver a warning about the Sith threat. This, too, was partially motivated out of her care for Gav, who was still a prisoner of the Sith. When she found Gav allied with the Sith, she was horrified and felt betrayed, but held out hope for him. The loss of her brother affected her emotionally, and for her the victory in the Great Hyperspace War was bittersweet and caused her to be more contrite. She was gladdened to take ownership of Aarrba's Repair Dock, though, feeling that it was what Gav and even Aarrba would have wanted."}, {"tag": "p", "text": "Jori, like her brother Gav, was Force-sensitive, but was never trained as a Jedi out of a desire to make money as a hyperspace explorer. However, in combat, she was capable of wielding a lightsaber, though she had never done so, and cut down several Massassi warriors in Cinnagar. She was also a skilled pilot, eluding spaceport authorities and Sith patrols on several occasions, as well as helping map new hyperspace routes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Jori Daragon was conceived and written by Kevin J. Anderson and first appeared in Star Wars: Tales of the Jedi — The Golden Age of the Sith, which was Anderson's second solo story arc following the conclusion of Star Wars: Tales of the Jedi - Dark Lords of the Sith. For the first five issues of The Golden Age of the Sith series, she was sketched by penciller Dario Carrasco, Jr., and black and white drawings of the character were included in the back of the first issue of The Golden Age of the Sith. The character was originally named \"Jori Pathfinder\" when the series was still in the concept art stages."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}