{"url": "Jorin_Sol", "categories": ["Category:Legends articles", "Category:Self-contradictory articles", "Category:Agents of the Galactic Empire", "Category:Alliance to Restore the Republic members", "Category:Humans", "Category:Males", "Category:Mathematicians"], "nodes": [{"tag": "h1", "text": "Jorin Sol"}, {"tag": "p", "text": "Jorin Sol was a young Human male mathematician who served the Rebellion during the early part of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 0 ABY, Sol accompanied Leia Organa and Luke Skywalker on a diplomatic mission to the planet Jabiim. After the team was thrust into the middle of a Battle between the Galactic Empire and the local resistance, Sol was separated from the team and captured by Imperials with the help of the traitor Tal Hesz."}, {"tag": "p", "text": "After this, Sol was taken to the planet Kalist VI, where he was interrogated and tortured by Lieutenant Zuud as to the whereabouts of the Rebel fleet and Skywalker. During a daring covert operation, a Rebel team was able to rescue Sol and the enslaved population of Jabiim. Unknown to the Rebellion, Jorin Sol had been reprogrammed as an Imperial spy, and was now in the midst of the Rebel fleet with a special mission: \"Destroy the Rebellion from the inside.\" He began to suffer from periods of spontaneity in which he would carry out the Empire's plans while being still fully conscious about what he was doing, which caused an unending internal conflict."}, {"tag": "h3", "text": "Ambush"}, {"tag": "p", "text": "After being cleared to return to duty, Sol walked onto his ship's bridge and shot everyone, including Leia Organa. He collapsed in horror and told Luke Skywalker that the Empire was on its way. While Janek Sunber dealt with Luke, Jorin pleaded with Tungo Li to have the Rebel fleet retreat. He then saved him from near death. When Wedge Antilles called the command ship to jump, Jorin jumped down to get to the command console and successfully made a jump to hyperspace, albeit on fire, before losing his life in the process in an explosion seconds later."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}