{"url": "Joruba_Consortium", "categories": ["Category:Legends articles", "Category:Companies", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Joruba Consortium"}, {"tag": "p", "text": "The Joruba Consortium was a company that operated in the Mid Rim."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Joruba Consortium was a wholesale distributor that sold a wide variety of different goods, including airspeeders, foodstuffs, holoprojectors and many other items. The Consortium would buy up goods, then transport them throughout the galaxy using a fleet of starships. While it was relatively unknown to the general public, the Consortium was able to develop a good reputation among the business community and was well respected. However, the Consortium's respectable, legitimate operations were just a front for various criminal activities that it engaged in. Using its fleet, it shipped almost every type of illegal cargo, including slaves."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sector Rangers Malbo and Tyri had some criminal dealings with the Consortium, and tried to cover their tracks by sending some agents to a Joruba Consortium compound on the planet Nyriaan, to recover some data that linked the Rangers to the Consortium. To persuade the agents to go on the assignment, the Rangers claimed that they were on a deep cover operation to investigate the Consortium's criminal activities and that they required the data as evidence, to seal their case against the company."}, {"tag": "p", "text": "Malbo and Tyri gave the agents some Joruba Consortium uniforms and sent them to board the Consortium CR90 corvette Windswept, which was en route to Nyriaan. The agents were to then steal some code cylinders from some Consortium troubleshooters who were aboard the starship, then use them to enter the Joruba Consortium branch office on Nyriaan, where they would slice into the computer system and recover the data. The agents agreed and using their Consortium uniforms, boarded the Windswept, to begin their mission."}, {"tag": "h2", "text": "Sources"}]}