{"url": "Joruus_C%27baoth", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Dark Jedi", "Category:Human clones", "Category:Males", "Category:Thrawn's fleet personnel"], "nodes": [{"tag": "h1", "text": "Joruus C'baoth"}, {"tag": "p", "text": "Joruus C'baoth (pronounced /dʒo'ɹus sə'beoθ/) was an insane Dark Jedi who played a pivotal role in the Thrawn campaign. A clone of the Jedi Master Jorus C'baoth, he was created by Palpatine, and became the Guardian of the Imperial storehouse at Mount Tantiss on Wayland."}, {"tag": "p", "text": "In 9 ABY, Grand Admiral Thrawn discovered the existence of the storehouse and traveled to Wayland. He succeeded in recruiting the Dark Jedi to join him in his campaign to destroy the New Republic, making good use of his battle meditation powers. C'baoth also attempted to lure Luke Skywalker and Leia Organa Solo to the dark side of the Force as part of a plan to seize the Empire for himself."}, {"tag": "p", "text": "However, as his plan entered its final stages, Thrawn had C'baoth imprisoned in Mount Tantiss, having finally realized the threat the insane Jedi posed to the Empire. After taking control of the Imperials left to guard him on Wayland, he was confronted by New Republic forces including Skywalker and the Force-sensitive smuggler Mara Jade. The two dueled with C'baoth, and Jade managed to kill the mad clone."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "It was believed that a tissue sample was procured from the Jedi Master Jorus C'baoth shortly before he departed aboard Outbound Flight in 27 BBY. Supreme Chancellor Palpatine requested, through his representative Kinman Doriana, that all personnel aboard the expedition—including Jedi—submit to the extraction of analysis-grade blood and tissue samples as part of their medical examinations. Doriana cited the possibility of hive viruses or potential epidemics as justification. A short time after this, C'baoth departed onboard Outbound Flight; however, the vessel was destroyed in the Unknown Regions by the Chiss Thrawn, an officer in the Chiss Expansionary Defense Force. During the Clone Wars, Palpatine, again through Doriana, took possession of several thousand Spaarti cloning cylinders from Cartao. These were used to create a clone made from C'baoth's tissue sample. This method, used to grow clones quickly, often produced clones that were extremely mentally unstable; the Joruus C'baoth clone was no exception."}, {"tag": "p", "text": "At some point, Palpatine placed a Guardian on the planet of Wayland to guard his hidden storehouses on Mount Tantiss, which contained treasures such as stolen art, a cloning facility, and the prototype of a cloaking device. After the Battle of Endor and the Emperor's death, the Guardian was left alone and grew bored over the next five years. In 9 ABY, he ventured out of the mountain to meld the Human, Myneyrsh and Psadan populations native to Wayland into one settlement under his authoritarian rule. Afterward, Joruus C'baoth arrived on the planet and challenged the Guardian to a duel. C'baoth killed the Guardian and took his place, using the Force to keep his subjects within his power."}, {"tag": "p", "text": "At some point before or after his duel with the Guardian, C'baoth received orders from the reborn Emperor Palpatine, the same orders given to all Palpatine's Dark Jedi. C'baoth was ordered to keep a low profile and await the Emperor's return. However, he violated or forgot these orders due to clone madness, and, much like Thrawn, he would serve as a distraction to shield the Emperor's growing strength."}, {"tag": "h3", "text": "Service to Thrawn"}, {"tag": "p", "text": "Later in 9 ABY, Grand Admiral Thrawn finally tracked down the location of the Emperor's private storehouse on Wayland, intending to use the cloaking shield and the Spaarti cylinders there to pursue his war against the New Republic. However, he also believed that Palpatine had a Dark Jedi Guardian there, and was aware that such a being would be useful to his campaign; he knew that a powerful Force-sensitive could use battle meditation to increase the efficiency of his forces. Once the Imperials were in orbit of the planet, Thrawn; his second-in-command, Gilad Pellaeon; and the Admiral's Noghri bodyguard, Rukh, arrived on the surface and made their way to a village near Mount Tantiss. They were met by an old man—actually Joruus C'baoth—who informed the Imperials that he had killed the Guardian of the mountain years ago, and had taken control of the planet. He led them to a crypt where he claimed the body of the previous Guardian lay, and then unleashed a deadly blast of Force lightning in an attempt to kill them. Only the Grand Admiral's precautionary use of ysalamiri—creatures capable of creating bubbles that could \"push back\" the Force— saved him from death. C'baoth, stunned that he had failed to kill them, revealed his identity to them. Thrawn managed to enlist the insane Dark Jedi into an uneasy alliance with him by promising C'baoth the Jedi Knight Luke Skywalker and his sister, Leia Organa Solo, as well as her yet-unborn twins, to be his to mold however he desired. C'baoth planned to create an army of Dark Jedi, which he would use to conquer the galaxy. Skywalker, his sister, and the Solo children would be the first of his Jedi. Pellaeon was uneasy about this arrangement, but Thrawn regarded C'baoth as little threat due to his insanity hindering his long-term control."}, {"tag": "p", "text": "C'baoth served Thrawn in several battles, increasing the efficiency of the Imperial forces by 40%. He also achieved one of his main goals, the capture of Luke Skywalker, when the Jedi came to him on Jomark. At the First Battle of Nomad City earlier in the campaign, C'baoth had felt Skywalker's presence, and sent a message to the Jedi: Skywalker would come to him. At the same time, Imperial forces began spreading the rumor that a Jedi was on Jomark. C'baoth headed there and took up residence in High Castle, immediately establishing his dominance over the people there. Though Skywalker was skeptical that a Jedi had not only survived the Great Jedi Purge, but not aided the Rebel Alliance, or even revealed himself after Palpatine's death, he eventually went to Jomark. There, he met C'baoth, who proclaimed himself to be a Jedi Master. He began training Skywalker, teaching him many things contrary to what Yoda, Skywalker's former teacher, had taught the young Jedi. C'baoth taught Skywalker that Jedi were superior to others, and should use their power to govern inferiors. He also taught him that Jedi should use force and pain as teachers to keep non Force-sensitives under control. All this went against what the Jedi had taught for millennia prior to the fall of the Jedi Order. Skywalker recognized that C'baoth was insane and also a practitioner of the dark side of the Force, and attempted to cure him and turn him back to the light. However, he found that C'baoth's madness was too great a hurdle to overcome."}, {"tag": "p", "text": "After a time, C'baoth revealed to Skywalker that he had sensed another being skilled in the Force, someone whom Skywalker had met: the smuggler and former Emperor's Hand, Mara Jade. C'baoth believed that she, like Skywalker, would become his apprentice—he had foreseen her kneeling before him in a vision. Several days later, Jade landed on Jomark, begging for Skywalker's help to free her boss Talon Karrde, who had been imprisoned by the Empire. C'baoth attempted to kill her by hurling boulders at her starship through the Force, but she managed to land nonetheless. The Jedi Master confronted her, but through the use of a ysalamir, as well as help from R2-D2, Skywalker's astromech droid, saved Jade's life. C'baoth was wounded when R2, in Skywalker's X-wing, fired on him, though the droid did not kill him on orders from Skywalker. Sensing the dark side in C'baoth, Skywalker departed with Jade."}, {"tag": "p", "text": "C'baoth later left Jomark in a fury, taking control of the minds of those aboard a Lancer-class frigate and ordering them to take him to the Imperial II-class Star Destroyer Chimaera, Thrawn's flagship. Once there, he confronted Thrawn, asking why he had not yet been given \"his\" Jedi. Thrawn retorted by asking why Skywalker had been allowed to leave. The Dark Jedi began to believe himself to be head of the Empire, a belief Thrawn knew had to be changed soon. Thrawn then promised the Jedi Master that he would soon have Leia Organa Solo and her newborn children, Jacen and Jaina, as he was already assembling a team to infiltrate the Imperial Palace and kidnap them. C'baoth relented, but was still unhappy. Later, he used his Force powers to control the mind of Gilad Pellaeon, and had him place an order for a special clone, then ordered him to forget the incident."}, {"tag": "p", "text": "Though Thrawn was losing his patience for C'baoth's antics, he still relied on him, knowing his battle meditation ability was indispensable. The Dark Jedi was later used at the assault on Ukio, one of the most important battles of the Thrawn campaign. Several Imperial cruisers, invisible thanks to a cloaking device, sneaked under the planetary shield, and then prepared to fire, while a group of Star Destroyers waited outside the shield. Aboard one of them was C'baoth. When Thrawn gave the order, C'baoth sent a mental command to the other ships under the shield, at which point they fired down on the planet. As the people on the surface could not see the ships that were actually firing, they believed Thrawn had developed a weapon fitted on a Star Destroyer that could penetrate planetary shields. Rumor of this swept throughout the galaxy, striking fear into the hearts of many loyal to the New Republic."}, {"tag": "p", "text": "C'baoth later learned that Thrawn's team had failed to capture Organa Solo and her children. Tired of what he perceived as empty promises from Thrawn, took control of the minds of everyone aboard the Chimaera save for those in the ysalamir Force-bubble, and threatened to make them take the ship to Coruscant. However, powerful as he was, controlling the minds of thousands of individuals for several days was beyond him, and he was forced to drop his control. Unknown to any of the Imperials, however, was the fact that Mara Jade, upon learning of Thrawn's clone soldiers, revealed that he was likely using the facility on Wayland. She agreed to lead Skywalker, Han Solo, Lando Calrissian, and Chewbacca there. Around this time, C'baoth's madness became even more evident, as he frequently exploded in anger at Thrawn, often about \"his\" Jedi, but he would quickly calm down."}, {"tag": "h3", "text": "Showdown on Wayland"}, {"tag": "p", "text": "Unknown to any of the five heading to Wayland, C'baoth was in Mount Tantiss, imprisoned in the royal chambers by Thrawn due to his realization that the clone was too powerful, power-hungry, and unstable to be safely used any longer. However, C'baoth had outsmarted Thrawn. He had realized that if he could take over the minds of the soldiers and crew members used as cloning templates, he could mentally command every clone created from them. This would allow him to personally command a huge section of the Imperial forces. As there were only approximately twenty templates, he believed he could easily shape their minds, and in turn, their clones."}, {"tag": "p", "text": "He had first tried this mind control technique on the way to Wayland, where he was in a shuttle along with the Imperial General Freja Covell. C'baoth took control of his mind, altering it. Covell became completely loyal to C'baoth, forgetting his earlier orders from Thrawn. However, when the shuttle entered the Force-free zone caused by the thousands of ysalamiri in the mountain, Covell was shaken by the loss of C'baoth's presence, and his mind was severely damaged. Without the Force, the Dark Jedi was unable to maintain control of Covell, and the General suffered, his brain critically damaged. Covell was changed, although C'baoth had not finished \"shaping\" his mind."}, {"tag": "p", "text": "Having realized how to shape other's minds now, C'baoth ordered Covell to, in turn, order his troops to place explosives on the thousands of ysalamir in the fortress, and then incite the beings on Wayland to attack the base outside. Covell died a short while later, after having C'baoth placed in charge of the facility. Grand Admiral Thrawn later found out about this by contacting C'baoth."}, {"tag": "p", "text": "When Jade and Skywalker arrived in the throne room searching for a self-destruct switch, C'baoth revealed himself to them. He attempted to turn them to the dark side, but when they refused, he activated the remote switch that triggered the explosives. When they were detonated, the ysalamiri were killed, restoring the presence of the Force to the mountain. He then showed them his secret weapon—the clone he had ordered Pellaeon to have made weeks ago. It was a clone of Luke Skywalker, created from tissue from Skywalker's right hand, which had been cut off by Darth Vader during the Duel on Cloud City, and later recovered by Imperial forces. The clone, Luuke Skywalker, was armed with Skywalker's old lightsaber, which had also been recovered on Cloud City. Skywalker and Jade dueled the clone, with Mara Jade eventually killing him."}, {"tag": "p", "text": "At this time, Leia Organa Solo, Han Solo, and Talon Karrde entered the throne room. C'baoth unleashed a Force scream, stunning everyone in the room. In a rage, he began to bring the ceiling down on Mara Jade. However, Jade used Organa Solo's lightsaber to cut holes in the floor so that the rocks fell through, leaving her a clear path to C'baoth. C'baoth demanded Jade follow him to the cloning room, where he would make a clone of her."}, {"tag": "p", "text": "Mara Jade defiantly refused and charged towards C'baoth, guided mentally by Organa Solo, and aided with a distraction by Luke sending Karrde's pet Vornskr's to attack him. When she reached the insane Jedi, she stabbed him with the lightsaber. He exploded in a blast of dark side energy. In the cloning chambers, Lando Calrissian and Chewbacca set detonators to destroy the mountain after the victorious Rebels fled."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "After freeing Wayland from C'baoth's control, the New Republic began to investigate the history of Wayland. Conversing with the Myneyrsh and Psadan populations, the researchers heard tales of C'baoth's overtaking the original Guardian. These accounts could not be independently verified and were doubted by the historical community to the point of being considered myths, however. An alternate theory held that C'baoth and the Guardian were actually the same man."}, {"tag": "p", "text": "Ten years after C'baoth's death, his memory still induced fear in those who had witnessed his madness. During the Caamas Document Crisis, while debating whether the \"Grand Admiral Thrawn\" who had confronted Lando Calrissian aboard the Star Destroyer Relentless might have been a clone of the original Thrawn, Shada D'ukal darkly suggested to Talon Karrde that if the Imperial Remnant had managed to grow one clone of Thrawn, it could just as easily have grown fifty, or even a hundred clones of C'baoth."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Joruus C'baoth had many traits of the original Jorus C'baoth. Like the Jedi Master, the clone was very arrogant, believing that being a Jedi automatically granted one superiority over others. He thought that his Force-sensitivity gave him the right to rule others and judge them, and that non-Force sensitives were weak and incapable of independent thought. C'baoth was also overconfident, believing he was capable of performing almost any task through the power of the Force. However, he was also insane, caused by the unstable process of cloning using Spaarti cylinders. His madness showed towards the end of the Thrawn campaign, when he shifted personalities quickly, going from being furious at Thrawn to quiet and apologetic. He was very stubborn, but Thrawn was able to convince him of many things through reasoning and promises that soon things would go C'baoth's way. C'baoth had a very firm belief that Thrawn was mistaken in his definition of power, believing that power was not ruling worlds, but rather individual people, and knowing those people, knowing you had control over them."}, {"tag": "p", "text": "C'baoth's strong personality led him to ignore Thrawn's orders, something Gilad Pellaeon feared when they first met him on Wayland. Thrawn was confident he could control C'baoth with the ysalamiri and carefully calculated orders until he no longer needed him. However, Thrawn underestimated C'baoth, who later rebelled against him, attempting to take control for himself."}, {"tag": "p", "text": "Given that the Great Jedi Purge had destroyed most records relating to the Jedi and the planet Wayland itself was a carefully hidden secret, few knew that Joruus C'baoth was a clone. In fact, Thrawn was only aware of this fact because he had been present at the destruction of Outbound Flight and the death of the real Jorus C'baoth. The irony of this concealed fact is that through years of isolation and deteriorating sanity, even Joruus C'baoth forgot his true origins and believed himself to be the original Master C'baoth."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Like Jorus C'baoth, the clone was very strong in the Force, capable of using many Force powers; he was, in Luke Skywalker's opinion, just as dangerous as Darth Vader. He was skilled in the art of battle meditation and used it to command Thrawn's forces and coordinate attacks. He could also send mental messages across great distances, such as he did at the Battle of Nkllon. He was able to use Force lightning, and frequently utilized it to punish those whom he felt had disobeyed him, such as the people he ruled on Jomark and Wayland."}, {"tag": "p", "text": "However, the C'baoth clone's preferred ability was that of controlling the minds of others. He also had the power to take control of other's minds, and literally reshape them in his own image, an extremely difficult feat. He once took over the minds of the thousands of beings serving on the Chimaera. Later, he used his abilities to control the Imperials left at Mount Tantiss to guard him. He also had the ability to use Force scream, a sonic attack that could destroy buildings, as well as the capacity to induce fatigue and weariness."}, {"tag": "p", "text": "C'baoth had some considerably powerful Force barriers at his disposal. When he had been shot from behind by Luke Skywalker's X-wing, he managed to survive without any singes on his person, a feat that impressed Mara Jade. He even conjured up a shield for protection from the debris he had caused to fall only moments earlier."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Joruus C'baoth was created for Heir to the Empire. the first book in the Thrawn Trilogy. According to author Timothy Zahn, Joruus C'baoth was originally supposed to be a mad clone of Obi-Wan Kenobi that survived the Clone Wars, but Zahn was forced to change the character's origin when Lucasfilm objected. He then created a new character—Jorus C'baoth—and his clone. Jorus C'baoth's background, along with that of the Outbound Flight project, was later expanded on in Survivor's Quest and Outbound Flight by Timothy Zahn."}, {"tag": "p", "text": "In sources expanding upon Wayland's history, doubt was cast in-universe on whether or not Joruus C'baoth actually killed any Guardian. The alternative theory posited by those sources was that the two were one and the same. This ambiguity persisted in materials released long after the original novels, appearing in C'baoth's Databank entry. It was not until 2008 and the release of The Complete Star Wars Encyclopedia that it was objectively established that the Mount Tantiss settlement had been controlled by two, separate regimes. Because of this long-maintained uncertainty, it was not unreasonable to believe C'baoth when he told Thrawn that he had ruled Wayland for some time, but The Thrawn Trilogy Sourcebook (1996) established that it took five years without Imperial contact for the original Guardian—written as C'baoth being the same man—to leave Mount Tantiss. This placed that event in the same year, 9 ABY, as the Thrawn campaign documented by the Thrawn Trilogy, meaning that C'baoth's term as leader after killing the original was actually quite short."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}