{"url": "Josef_Grunger", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with cut elements", "Category:Grand Admirals of the Galactic Empire", "Category:Humans", "Category:Imperial warlords", "Category:Males"], "nodes": [{"tag": "h1", "text": "Josef Grunger"}, {"tag": "p", "text": "Josef Grunger was a Human male serving in the Navy of the Galactic Empire. A Grand Admiral, Grunger was one of the twelve original beings elevated to the rank by Emperor Palpatine two years before the Battle of Yavin. Neither subtle nor loyal by nature, Grunger nonetheless remained devoted to Palpatine until 4 ABY, when the Emperor was killed at the Battle of Endor. The Grand Admiral, having been busy patrolling space near the planet Gargon, seized the world when he received the news of the defeat at Endor. Almost immediately, he set himself up as a warlord and declared that he was the new Emperor. By 5 ABY, Grunger had amassed a sizable armada of Star Destroyers and smaller cruisers, using the Super Star Destroyer Aggressor as his command ship."}, {"tag": "p", "text": "News of Grunger's claim to the vacant throne came to the Central Committee of Grand Moffs on Kessel. Their leader, the mutant Slavelord Trioculus, vowed to deal with Grunger after receiving the dark blessing of the Supreme Prophet of the Dark Side Kadann, which the slavelord required to be named Emperor. Grunger doubted Trioculus' claims but nonetheless vowed to follow the mutant if he received Kadann's approval. Trioculus died not long after obtaining the blessing, however, and Grunger—having retained full control of his armada—became a warlord once more. Plotting a strike at the Imperial capital of Imperial Center, the Grand Admiral moved his forces into the Corellian sector. Above the planet Tralus in the Corellian system, Grunger's fleet was confronted by Grand Admiral Danetta Pitta, who took command of a Torpedo Sphere and used it to annihilate his opponent's armada. Faced with defeat, Grunger rammed the Aggressor into the Torpedo Sphere, obliterating both warships and killing both Grand Admirals."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Grand Admiral"}, {"tag": "p", "text": "Josef Grunger was a Human male who served as an admiral in the navy of the Galactic Empire. Over the course of his career, he became a highly-regarded strategist. In 2 BBY, during a New Year's Fete Week celebration on Coruscant, he was one of twelve naval officers elevated to the rank of Grand Admiral by Emperor Palpatine. In 4 ABY, while fellow Grand Admiral Miltin Takel traveled to the second Death Star to witness what was supposed to be the destruction of the Rebel Alliance, Grunger was assisting Takel's second-in-command in patrolling the Mandalore sector—specifically space near the spice-producing planet Gargon—due to reports of \"albino-skinned marauders.\" When word reached Grunger of the Imperial defeat at Endor and the Emperor's death, the Grand Admiral had his ship open fire on the vessel of Takel's lieutenant, disabling it. Grunger seized Gargon and quickly set himself up as one of the first Imperial warlords. Before long, he announced that he was the new Emperor."}, {"tag": "h3", "text": "Imperial warlord"}, {"tag": "p", "text": "The Grand Admiral, using his rank to bully Imperial officers in the Outer Rim into submission, quickly amassed a large armada of warships. By 5 ABY, Grunger was in possession of thirty Imperial-class and Victory-class Star Destroyers, one hundred Carrack-class cruisers, and sixty Strike-class cruisers, among other craft. Grunger led this fleet from the Executor-class Star Dreadnought Aggressor, his flagship."}, {"tag": "p", "text": "Having been ousted from his homeworld of Gargon, Grand Admiral Takel eventually allied himself with the Central Committee of Grand Moffs, hoping that they would be able to deal with Grunger. Meanwhile, a member of the Imperial Royal Guard, having been to Gargon, brought news of Grunger's claim to the throne to the Central Committee on Kessel. During an assembly in Kessendra Stadium in which Grand Moff Bertroff Hissa announced the mutant Slavelord Trioculus to be Palpatine's son and heir, the Royal Guard questioned the validity of Trioculus' claim over Grunger's, noting that the Grand Admiral had amassed a sizable force of Star Destroyers. The slavelord declared that he would deal with Grunger in time. In a committee meeting that followed, Trioculus demanded that the glove of Darth Vader be found, which would entitle him to the dark blessing of Supreme Prophet of the Dark Side Kadann—something he needed in order to secure the vacant throne. Takel feared that Grunger would retrieve the glove first and therefore make good on his claim to the throne, but Takel was quickly executed by Hissa for questioning Trioculus' plans. Hissa later brought news to Trioculus that Grunger, doubting the mutant's claim of being Palpatine's son, would only be willing to support Trioculus after he received the dark blessing from Kadann, who was in truth an imposter posing as the true Supreme Prophet. At that point, Grunger promised to turn over command of his fleet to Trioculus."}, {"tag": "p", "text": "Though Trioculus did receive the dark blessing from the false Supreme Prophet, his reign as Emperor was short-lived; he died not long after taking the title. Grunger, meanwhile, had avoided any permanent ties with the Central Committee and retained control of his armada. In 5 ABY, following the New Republic's execution of Grand Admiral Osvald Teshik a year earlier, Grunger prepared to strike at Imperial Center. To do so, Grunger moved his armada into the Corellian sector. However, Grand Admiral Danetta Pitta had bribed the Corellian leader into relinquishing control of the sector, and Pitta quickly assumed command. When Grunger's fleet, led by the Aggressor, emerged from hyperspace in the Corellian system near the planet Tralus, Pitta took control of a Torpedo Sphere and began to annihilate his rival's forces. Faced with defeat and the loss of his pride, Grunger had his command ship ram the Torpedo Sphere. The resulting collision destroyed both vessels, and both Grunger and his opponent perished."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Grunger was neither a loyal nor a subtle man, turning warlord almost immediately after receiving news of the Emperor's death at the Battle of Endor. Swiftly seizing Gargon, Grunger sought to amass a large armada, and the Grand Admiral effectively employed deception and outright attacks on fellow Imperials to accomplish this goal. Before long, he had obtained a sizable fleet of Star Destroyers and declared himself the new Emperor."}, {"tag": "p", "text": "Despite his claim to the throne, Grunger declared that he would fully support the Slavelord Trioculus, backed by the Central Committee of Grand Moffs, if the mutant obtained both the glove of Darth Vader and the dark blessing of the Supreme Prophet Kadann. Trioculus received both, but Grunger avoided any permanent alliance with the Central Committee and retained command of his fleet following the mutant's death. Ultimately, Grunger's pride led to his death; when faced with defeat at the Battle of Tralus, he opted to ram Pitta's Torpedo Sphere—a move that killed them both—rather than lose to his opponent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Grand Admiral Josef Grunger was first mentioned in the 1992 young adult novel The Glove of Darth Vader, written by Paul and Hollace Davids. The Grand Admiral would again be mentioned in the first of the book's sequels, The Lost City of the Jedi. In 2003's Star Wars Insider 66, more details on Grunger were revealed in the article Who's Who: Imperial Grand Admirals, written by Daniel Wallace and Abel G. Peña. Grunger has also been mentioned in reference books like The Essential Chronology and its updated edition, The Complete Star Wars Encyclopedia, and the article The Forgotten War: The Nagai and the Tofs on StarWars.com's Hyperspace."}, {"tag": "p", "text": "Who's Who: Imperial Grand Admirals was originally intended for inclusion in Star Wars Gamer magazine, before it was canceled, under the title \"Dirty Dozen: The Imperial Grand Admirals.\" When the article was reused in Star Wars Insider, several details on the Grand Admirals were excluded. Grunger's section of the article remained relatively intact, though a few details were omitted."}, {"tag": "h3", "text": "Cut content"}, {"tag": "p", "text": "Before the Galactic Republic transitioned into the Galactic Empire, Josef Grunger served as a Republic marine and weapons specialist. As such, he was proficient with many types of hand-held weapons, ranging from blaster rifles to vibroblades. He wielded a riot gun and possessed a code cylinder and a comlink. Following the Battle of Endor, and before Captain Gilad Pellaeon had finished transmitting the news of the Emperor's death, Grunger had ordered his weapons officer to disable the ship of Grand Admiral Takel's subordinate using ion cannons. Grunger quickly amassed a large armada, at first utilizing the communications disruption in the Outer Rim to dupe Imperial commanders into turning over their vessels to him. After establishing his reputation as a warlord, Grunger no longer required such deceptive moves to seize ships, merely taking whatever he wanted."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}