{"url": "Jot", "categories": ["Category:Canon articles", "Category:Jawas", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jot"}, {"tag": "p", "text": "Jot was a male Jawa. He was  much shorter than most Jawas and enjoyed stories. He was originally responsible for collecting scrap, then later had himself demoted to wiping the memories of droids the Jawas obtained after he found a holoprojector he decided to call Storyteller. Jot was supposed to wipe R2-D2's memory, but when he saw R2's memory, he couldn't carry out his job and put R2's memory back in R2. He left Tatooine on a ship from Mos Eisley or Anchorhead."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Many years before Jot was born, a massive Krayt dragon died on the spot Jot’s house would be built. As a child, he loved to tinker with whatever he could find. This was encouraged, but he was never able to satisfy his curiosity. Eventually, Jot began to wish to leave Tatooine."}, {"tag": "p", "text": "Jot eventually worked at a Jawa Mountain Fortress and later at a sandcrawler. During his work there, he found a gap in the wall that he used as his personal room. He stashed his belongings there and became so attached to it that his work began to suffer. Several weeks after discovering the gap in the wall, his sandcrawler stumbled upon a freighter that had been revealed by the wind. Based off of the armor  of the pilot and their  Datapad for wanted criminals, the crew assumed they had found a bounty hunter. Outside the wreck, Jot found a astromech droid in poor condition.  However, the holoprojector and the memory core were in working condition. Jot used the holoprojector to play the memory core clips and cried when he saw it. He switched jobs to gain access to memory cores of droids the sandcrawler was going to sell.  This new job delighted him, even though he had to delete every memory after viewing it."}, {"tag": "p", "text": "Eventually Jot was put in charge of the memory core of a R-2 unit. As he watched the memory core on the projector, Jot was astounded at the clips. He saw armies of droids, robed people using magic, and massive battles rage. Unable to delete the memory cores, he left them and decided that he was not going to be a spectator in the world anymore."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}