{"url": "Journey_to_Dagobah", "categories": ["Category:Real-world articles", "Category:Star Wars Galaxy of Adventures episodes"], "nodes": [{"tag": "h1", "text": "Journey to Dagobah"}, {"tag": "p", "text": "\"Journey to Dagobah\" is the forty-eighth episode of Star Wars Galaxy of Adventures. It premiered on the Star Wars Kids YouTube channel on May 28, 2020. It was later compiled into an omnibus YouTube video called \"The Empire Strikes Back 40th Anniversary\", that was released on June 19, 2020."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The narrator introduces us to Luke Skywalker who is traveling to Dagobah in the ways of the Jedi. Luke and R2-D2 land their X-wing in the murky swamps of Dagobah."}, {"tag": "p", "text": "Later, Luke carries his Master Yoda in a bagpack, who explains that his ally is the Force and that it is a powerful ally. He tells Luke that the Force is a powerful energy field that surrounds them, illuminates them. Yoda urges Skywalker to fell the Force around him in order to be free. The two pass a swamp slug before walking past a gnarltree."}, {"tag": "p", "text": "Later, Skywalker says that he will try to lift his X-wing out of the swamp. Yoda counters that there is no try but only \"do or do not.\" Skywalker tries to raise his X-wing from the rear but is unable to stop the ship from sinking into the swamp. Luke thinks that Yoda is asking the impossible and walks away. Yoda however uses the Force to raise the X-wing out of the swamp to the amaze of Skywalker and R2-D2."}, {"tag": "p", "text": "While Luke is levitating R2-D2 and rocks, Yoda tells Luke that through the Force he can see many things and places including the future, the past, and old friends long gone. Luke experiences a Force vision of Han Solo, Leia Organa, Chewbacca, and C-3PO in the hands of Darth Vader in a city in the clouds, causing him to lose his concentration and drop R2-D2 and the rocks."}, {"tag": "p", "text": "Yoda implores Luke to complete his Jedi training but Skywalker is unable to keep the vision out of his head. Luke refuses to abandon his friends Han and Leia, believing that they will die if he does not rescue them. As Luke climbs into his X-wing, Yoda warns of the danger posed by Vader and tells Luke to remember what he has taught him. Luke promises to remember his lessons and to return before departing Dagobah."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}