{"url": "Jowdrrl", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Engineers", "Category:Females", "Category:Kashyyyk residents", "Category:Mechanics", "Category:Members of the First Wookiee Expeditionary Force", "Category:Resistance fighters", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Jowdrrl"}, {"tag": "p", "text": "Jowdrrl was a female Wookiee mechanic and ship systems engineer from the planet Kashyyyk. She grew up on the Wookiee homeworld with her extended family, which included her cousins Chewbacca, Kallabow, and Shoran, as well as with her friend Mallatobuck. Jowdrrl helped Chewbacca and Mallatobuck develop a romantic relationship, and at one point before 100 BBY aided Chewbacca and his cousin Dryanta in rescuing Mallatobuck from Trandoshan slavers. Over a century later, the Galactic Empire turned Kashyyyk into a slave world, and Jowdrrl joined a resistance movement that opposed the Empire's occupation of the planet. During Jowdrrl's time with the group, Chewbacca and Mallatobuck wed. Kashyyyk was liberated from the Empire several years later."}, {"tag": "p", "text": "In 16 ABY, Jowdrrl and Dryanta were entrusted with the care of the Millennium Falcon—a famous starship belonging to Chewbacca's friend, Han Solo—while Chewbacca guided his son Lumpawarrump through a coming-of-age hrrtayyk ceremony. They took up residence within the freighter, and Jowdrrl analyzed and discovered several flaws with the Millennium Falcon's systems. She and Dryanta then modified the vessel so as to eliminate several blind spots that the ship's pilot suffered while in flight. When Chewbacca learned that Solo had been kidnapped by the Yevethan Duskhan League and thus prepared to hastily depart the planet, he reluctantly allowed Jowdrrl, Dryanta, Shoran, and Lumpawarrump to accompany him on a rescue mission."}, {"tag": "p", "text": "The strike team took the Millennium Falcon to a smuggler's sanctuary on Tholatin to gather information about their enemy, and Jowdrrl used their time to modify the freighter's quad laser cannons. When they arrived in the Yevetha's Koornacht Cluster, Jowdrrl served in the quad turrets as they assaulted the Yevethan Star Destroyer Pride of Yevetha. She then guarded the Millennium Falcon's hatch while the others entered the Destroyer, and she briefly flew the freighter when the time came to retrieve Solo and make an escape. Nine years later, Jowdrrl attended Chewbacca's funeral after he was killed by the extra-galactic Yuuzhan Vong, and after another four years, she was part of a large group that returned to the site of the funeral to celebrate the end of the Yuuzhan Vong War."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Romance and rebellion"}, {"tag": "p", "text": "Jowdrrl was a female Wookiee from the planet Kashyyyk. Born before 100 BBY, she was part of a large family that included her cousins Chewbacca, Kallabow, and Shoran. The younglings grew up together on the Wookiee homeworld. Jowdrrl's mother once advised her young daughter that dropping a Wroshyr louse on any male Wookiee she desired and then offering to groom his fur would betroth him to her forever. In her youth, Jowdrrl was close friends with Mallatobuck, a female who pined after Chewbacca and hoped to one day marry him. Mallatobuck was frustrated that Chewbacca was seemingly more interested in mechanics than in her, and was additionally too shy to express her true feelings to her love interest. Nevertheless, Jowdrrl helped the two nurture a relationship."}, {"tag": "p", "text": "On one occasion prior to 100 BBY, Jowdrrl and Mallatobuck were walking through Kashyyyk's treetop levels when Mallatobuck spotted Chewbacca and his cousin Dryanta tinkering with a starfighter. As the two females collected lice from a Wroshyr tree, Jowdrrl passed her mother's advice on to her friend. Mallatobuck's dropped louse landed on Dryanta's head, however; after the giggling girls rushed deeper into the forest, Mallatobuck found herself ensnared by a net. As Trandoshan slavers emerged from the forest depths, Jowdrrl quickly ran back the way she had come on Mallatobuck's advice. Jowdrrl's dropped basket of lice caused one of the pursuing slavers to slip and fall, and she was able to alert Chewbacca and Dryanta to Mallatobuck's peril. The two male Wookiees killed the Trandoshans and rescued Jowdrrl's friend."}, {"tag": "p", "text": "Decades later, Kashyyyk became a slave world of the Galactic Empire, which forced Wookiees into labor on Imperial construction projects. In 2 BBY, the planet was occupied by Imperial forces, and an underground movement led by the Wookiee Katarra actively resisted them. Jowdrrl worked with Katarra to undermine the Imperial presence on her homeworld. Chewbacca had meanwhile sworn a life debt to the Human smuggler Han Solo and was traveling the galaxy with him, but in that year, the two came to Kashyyyk with explosive bowcaster quarrels to sell to the resistance movement. Jowdrrl, Katarra, Dryanta, Kallabow, and other resistance fighters made their way to a cave outside the city of Rwookrrorro to greet Chewbacca and Solo, who arrived in Solo's YT-1300 light freighter, the Millennium Falcon."}, {"tag": "p", "text": "Chewbacca introduced Jowdrrl and the others to Solo and Jarik, a street urchin from the Hutt moon Nar Shaddaa who posed as Solo's long-lost relative. The Wookiees then bundled the Humans into quulaar sacks and, carrying them, climbed across Wroshyr trees to Rwookrrorro, where they were met by Chewbacca's father Attichitcuk and several other Wookiees. Chewbacca and his companions remained in Rwookrrorro for several days, during which time he and Mallatobuck wed. Chewbacca soon left the planet in service of his life debt, and he and Solo went on to join the Rebel Alliance and fight the Empire. In the wake of Galactic Emperor Palpatine's death in 4 ABY, Kashyyyk's Imperial Moff Hindane Darcc was overthrown, and the Empire's Wookiee slave trade was brought to an end."}, {"tag": "h3", "text": "Caretaker of the Falcon"}, {"tag": "p", "text": "By 16 ABY, Jowdrrl was an apt mechanic and ship systems engineer. Chewbacca borrowed the Millennium Falcon from Solo in that year and visited Kashyyyk to oversee the coming-of-age hrrtayyk ceremony of his and Mallatobuck's son, Lumpawarrump, and he left the freighter in the care of Jowdrrl and Dryanta after landing it on Rwookrrorro's Landing Platform Thyss. The ship and its adventures were famous throughout the galaxy, and Jowdrrl and Dryanta were both honored to leave their homes and live aboard it for the duration of Chewbacca's stay. Streams of tourists from across the planet came to see the Millennium Falcon and have holograms of themselves taken beside it, but Chewbacca's two cousins kept the freighter sealed and arranged for the landing platform to be watched around the chronometer. In the morning and afternoon, when visitors were permitted, either Jowdrrl or Dryanta stood watch to ensure that the tourists remained more than an arm's length away from the ship's hull. During the several weeks that the Millennium Falcon was in their care, Jowdrrl studied the freighter closely and discovered what she believed to be several weaknesses. Dryanta, a pilot, helped her devise improvements, and the two made several modifications to the ship's systems."}, {"tag": "p", "text": "As the cockpits of YT-1300 freighters were offset to starboard and allowed very little visibility to aft and to port, Jowdrrl covered the viewports of the Millennium Falcon's loading hatches and quad laser cannon turrets with custom-fitted optical transducer panels. The nearly transparent sensors routed their output to flatscreen displays in the cockpit, which eliminated most of the ship's blind spots. One day before the final test of Lumpawarrump's hrrtayyk, Jowdrrl and Dryanta worked through the night to finish their modifications, and they had less than an hour of work left to do the next day when Mallatobuck informed them that Chewbacca was returning to the Millennium Falcon for a rush departure from the planet. He had just learned that Solo had been taken prisoner in the Koornacht Cluster by the Duskhan League—the Yevethan government that had recently come into conflict with the New Republic, the Rebel Alliance's successor state—and he had cut his son's hrrtayyk short to honor his life debt and mount a rescue attempt."}, {"tag": "p", "text": "Jowdrrl and Dryanta worked to complete their task and render the ship spaceworthy, but Chewbacca arrived sooner than they anticipated. He was furious that the ship was not ready for flight, but Jowdrrl and Mallatobuck were able to calm him down. As Chewbacca's wife and son left to prepare his things, Jowdrrl showed her cousin the modifications she had made, and he grudgingly approved of them. She wished to join him as a partner on his rescue mission, but he refused and initiated the ship's preflight procedure. However, Dryanta and Shoran were standing on the landing platform and wearing hunting bandoleers, and when Chewbacca left the ship and demanded to know what was going on, Jowdrrl continued the Millennium Falcon's preflight procedure. Mallatobuck presented to Chewbacca the rest of his crew, and when Shoran and Dryanta assured him that all three of his cousins were willing to risk their lives to help him, Chewbacca relented. After Jowdrrl was joined by Dryanta and Shoran inside the Millennium Falcon, Lumpawarrump arrived and also wanted to come along, in hopes that he could prove his worth to Chewbacca and pass his hrrtayyk at his father's side. Chewbacca accepted him, and with his strike team assembled, took the Millennium Falcon away from Kashyyyk."}, {"tag": "h3", "text": "Into the Koornacht Cluster"}, {"tag": "p", "text": "The strike team needed specialized supplies and information on the reclusive Duskhan League, and their first stop was accordingly Esau's Ridge, a private smuggler's sanctuary on the planet Tholatin open only to elite veterans of the trade. The information broker Formayj required several days to gather information on the Koornacht Cluster, and while the Wookiees waited, they tested and installed a firecracker mine launcher and a hull-cutting ring in place of the Millennium Falcon's escape pods. Jowdrrl also installed auto-tracking fire controllers for the quad turrets in the ship's cockpit and helped Lumpawarrump practice his fighting skills. After they had been at the ridge for a week, Formayj acquired and sold to Chewbacca a navigational map of the Koornacht Cluster, a recording of an address made to the New Republic Senate by the Yevethan Viceroy Nil Spaar, and several other intelligence documents that provided data on the Yevetha. The information had come from the clandestine New Republic Intelligence agency Alpha Blue, who had become aware of the Wookiees' mission and were covertly working to support it. Inside the Millennium Falcon, Jowdrrl and the others watched a forty-hour-old recording of Spaar addressing members of the New Republic on the HoloNet's Channel 81. The planet N'zoth was visible in the recording's background, and it became the Wookiees' destination as they lifted off from Tholatin."}, {"tag": "p", "text": "Jowdrrl sat in the Millennium Falcon's upper quad turret, with Lumpawarrump below her in the lower turret, as the freighter reached the outskirts of the N'zoth system. Chewbacca soon called everyone into the cockpit to study new data that had just been sent to him by Formayj: a New Republic Fleet Intelligence assault plan for an Executor-class Star Dreadnought that included marked locations of cell blocks and points on the hull that could effectively be breached. The Executor-class Star Dreadnought Pride of Yevetha, which Chewbacca recognized from the earlier recording, was one of many ships orbiting N'zoth, and he calculated the orbital data required to micro-jump to within one thousand meters of the Star Destroyer. Jowdrrl then returned to the quad batteries, now with Dryanta at her side, and Shoran launched a string of firecracker mines as the Millennium Falcon executed its micro-jump. It emerged from hyperspace off the Star Destroyer's starboard bow, and the cronau radiation produced by its jump was masked by light and radiation from the exploding mines. The sensors of the Yevethan defense grid were overwhelmed by the explosions, which allowed Chewbacca to pilot the Millennium Falcon inside the Pride of Yevetha's shields and launch more mines. Yevethan starfighters pursued them, but Jowdrrl and Dryanta opened fire from the quad batteries. At least one fighter was destroyed."}, {"tag": "p", "text": "After Chewbacca landed the freighter on the Star Destroyer's hull, Jowdrrl was surprised to see the Yevethan fighters stop firing on them. Chewbacca instructed her to cease firing herself and, after the hull-cutting ring burned through the side of the Star Destroyer, he charged inside the Pride of Yevetha with Shoran at his side. Lumpawarrump relieved Jowdrrl in the quad turret, and she took up guard position of the Millennium Falcon's hatch. She was bewildered when nine Yevethan guards walked by her location and did not notice her, and when she contacted Lumpawarrump and Dryanta on her comlink, they reported that dozens of Yevethan starfighters had similarly ignored the Millennium Falcon. The Wookiees were ignorant of the fact that their presence had been disguised in the Force by Enara, a Fallanassi adept of the White Current who was one of Solo's fellow prisoners. Shoran was soon killed by Yevethan guards, and Chewbacca contacted Dryanta for assistance. Lumpawarrump raced out of the ship first, however, and insisted on accompanying Dryanta. Jowdrrl saw the determination in his eyes and did not argue; Dryanta and Lumpawarrump then left her alone with the Millennium Falcon."}, {"tag": "p", "text": "Jowdrrl received no further trouble. Dryanta returned with Shoran's corpse, and Jowdrrl was contacted by Chewbacca soon after with instructions to prepare the Millennium Falcon for a retrieval at a flight deck that was directly forward of her current position. She sealed the hatch and, after receiving confirmation from Chewbacca, piloted the ship to the flight deck and retrieved Chewbacca, Lumpawarrump, and a rescued Solo. The Millennium Falcon then blasted off under the cover of more firecracker mines, and Chewbacca piloted it toward the nearby New Republic Fifth Battle Group. They were permitted to board the starship Intrepid after Chewbacca's Shyriiwook hails were recognized by Luke Skywalker, a Human friend of Solo's who was aboard the fleet carrier. Solo was taken to a bacta tank and Shoran to the ship's morgue; Skywalker and the surviving Wookiees visited Solo in the medical ward as he rested in between bacta sessions. Their presence there drew considerable attention. Chewbacca later prepared the Millennium Falcon for use in an upcoming New Republic strike against N'zoth, but Lumpawarrump—now called Lumpawaroo after completing his hrrtayyk aboard the Pride of Yevetha and earning a new name—joined Solo on a medical frigate, leaving the Millennium Falcon short one crewmember. The Duskhan League was defeated in the battle, and their threat to the New Republic was ended."}, {"tag": "h3", "text": "A cousin's fall"}, {"tag": "p", "text": "In 25 ABY, Chewbacca was killed on the planet Sernpidal when its moon Dobido was drawn toward the planet as part of a military tactic employed by an extra-galactic species of religious zealots known as the Yuuzhan Vong. Six months later, a memorial service was held for the fallen warrior outside Rwookrrorro, and Jowdrrl was among the several dozen friends and family members who came to mourn. The Wookiee Ralrracheen eulogized as the group stood around a circular wooden table. After the services were completed, the table was covered with foodstuffs, and the guests ate, drank, and recalled memories of Chewbacca. Jowdrrl and several other members of her family approached Solo, who sat alone and devastated, and the Human was presented with gifts by Mallatobuck and Lumpawaroo. Lumpawaroo and his cousin Lowbacca had been selected to assume Chewbacca's life debt, and Jowdrrl and Dryanta intended to arrange a farewell feast for them before Solo and his family left Kashyyyk. Jowdrrl wondered when Solo would depart, but the Human refused Lumpawaroo's and Lowbacca's offer—he was not yet ready to replace Chewbacca, who had been his closest friend. Mallatobuck and Attichitcuk allowed him additional time to grieve, and Solo and his family departed Kashyyyk to continue aiding the New Republic in its war against the Yuuzhan Vong, who had invaded and were attempting to conquer the galaxy."}, {"tag": "p", "text": "Throughout four years of devastating warfare, the invaders laid siege to much of the galaxy and even captured the galactic capital of Coruscant. Kashyyyk remained relatively untouched, however. The Wookiee world was used as a New Republic base three years into the war in order to defend the surrounding Mid Rim of space, but when the Yuuzhan Vong were defeated in 29 ABY, Kashyyyk was still lush and gleaming. Seven weeks after the end of the war, Solo and his family returned to Rwookrrorro, and they were joined by Jowdrrl and a group of Chewbacca's friends and family when they visited the site of Chewbacca's funeral. After Solo plunged the lightsaber of his son Anakin, who had died two years into the war, into a fallen tree branch at the site, Jowdrrl and the other Wookiees covered the area with leaves and vines. Everyone then returned to Rwookrrorro and enjoyed a celebratory feast; there, Lumpawaroo and Lowbacca informed Solo that they would now be assuming Chewbacca's life debt. Although the Human tried to protest, he eventually began to laugh, and Jowdrrl and the other Wookiees added their voices to the expanding chorus of good cheer."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jowdrrl was a chestnut-furred Wookiee and a skilled starship engineer. She was very perceptive when she analyzed starship components, and she was able to devise improvements to systems that were lacking. When deciding how a vessel could best operate, Jowdrrl sometimes compared its performance to a Wookiee stalking prey in the forests of Kashyyyk. Despite her skill, she was not above recognizing the good work that others had done on ship systems. When given the opportunity to look after the Millennium Falcon, Jowdrrl was delighted to be able to live aboard the legendary starship, and while serving aboard it during the mission to the Koornacht Cluster, she showed prowess as a gunner."}, {"tag": "p", "text": "Jowdrrl was close to her family and friends. When her friend Mallatobuck was smitten with her cousin Chewbacca, Jowdrrl worked to nurture a relationship between the two. As a young Wookiee, Jowdrrl was a giggly girl and was herself somewhat attracted to Chewbacca's cousin Dryanta. Jowdrrl had a close relationship with Chewbacca, whom she also physically resembled; the improvements she made to the Millennium Falcon were meant as a gift to Han Solo as thanks for rescuing Chewbacca from slavery. Like Chewbacca, Jowdrrl stubbornly followed her conscience and her own code of honor. She insisted on accompanying her cousin to the Koornacht Cluster to rescue Solo from the Duskhan League, and she asserted that everyone in Chewbacca's family was responsible for his life debt to Solo. When Chewbacca refused, she ignored him and continued the preflight procedure he had begun when he left the Millennium Falcon to confront his other cousins. When the Galactic Empire occupied Kashyyyk, Jowdrrl worked with the Wookiee underground resistance movement to subvert their activities."}, {"tag": "p", "text": "When translated into Basic, Jowdrrl's name had several possible meanings. The prefix \"Jow\" meant \"space, star, sun,\" or \"vast,\" and the suffix \"drrl\" could be translated as \"safety, sky,\" or \"treetop.\" In addition to being able to speak Shyriiwook, Jowdrrl was fluent in the language's Thykarann dialect, which was very rich in technical vocabulary and useful for describing the workings of a starship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jowdrrl was created by author Michael P. Kube-McDowell and was introduced in his 1997 novel Tyrant's Test. Jowdrrl plays a sizable role in the book, first being entrusted to take care of the Millennium Falcon and then joining Chewbacca on a mission to rescue Han Solo from the clutches of the Duskhan League. In McDowell's initial outline for the novel, Chewbacca returned to Kashyyyk to find a mate and later set out to rescue Solo in a Millennium Falcon crewed by him and his several wives. When he was told by Lucasfilm Ltd. that Chewbacca already had a family in Star Wars canon, McDowell altered the plotline to center around Chewbacca returning home to participate in his son's coming-of-age ceremony, and to feature Chewbacca's cousins rather than his wives crewing the Millennium Falcon. Jowdrll has since made cameo appearances in several additional Star Wars novels, and she received her first and thus far only visual depiction in the 2000 comic book issue Chewbacca 1. She is also discussed in several sourcebooks and encyclopedias."}, {"tag": "p", "text": "Tyrant's Test establishes that Jowdrrl, Dryanta, and Shoran are all cousins of Chewbacca, but it does not indicate what their relationships to each other are. The 2000 novel The New Jedi Order: Agents of Chaos I: Hero's Trial identifies Shoran as the cousin of both Jowdrrl and Dryanta, but, to date, no source has elaborated on Jowdrrl and Dryanta's familial connection. Star Wars: Chewbacca 1 does show Jowdrrl indicating that she is attracted to Dryanta, however."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}