{"url": "Joy_Iya", "categories": ["Category:Canon articles", "Category:Females", "Category:Individuals of unspecified species", "Category:LGBTQ+ individuals"], "nodes": [{"tag": "h1", "text": "Joy Iya"}, {"tag": "p", "text": "Joy Iya was a female resident of Cloud City on Bespin in 3 ABY. A service worker who was concerned with workers' rights, she began organizing a citywide work stoppage to get the attention of Baron Administrator Lando Calrissian and other beings in charge of the city during the Galactic Empire's occupation. Having met Isabalia and developed a mutual romantic interest in each other, Iya hoped Isabalia would join her and her movement, as she believed in Isabalia's potential. However, Isabalia was focused on becoming a bounty hunter and declined Iya's invitation in favor of meeting Boba Fett. When the time of the meeting and the strike came, Isabalia defended Iya against a stormtrooper, then joined Iya."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Joy Iya was a female who lived in Cloud City on Bespin in the year 3 ABY. While working as a server at the Yarith casino, she met another young woman of her age named Isabalia, and they developed a mutual romantic interest. Although they did not interact for some months, Iya paid attention to Isabalia's searches for work and thought things could be better for her, and for other workers on Cloud City. Iya felt the workers were overlooked by Baron Administrator Lando Calrissian and other beings in charge, and began organizing for a citywide work strike. At that time, the Galactic Empire had arrived and occupied Cloud City."}, {"tag": "p", "text": "Hoping to invite Isabalia to join her, she was pleased when they encountered each other again while she worked dealing cards at Azure Den, an underground gambling den. She asked to deal Isabalia in to make her table look busy and keep the den's Duros owner, Elad Zhalto, from reassigning her to the bar. Isabalia got distracted talking to Iya and missed an opportunity to meet the bounty hunter Boba Fett. When Isabalia was leaving on a job for Zhalto, Iya handed her a card to invite her to the meeting she had organized for that evening in Sector Four. Isabalia attended, but was skeptical of Iya's plans. Iya expressed her belief in Isabalia and tried to convince her, but stormed off in disappointment after Isabalia said she first had to meet Fett."}, {"tag": "p", "text": "Iya and various beings, such as Isabalia's friend and landlord Recnelo Cott, were meeting up at the same carbon-freezing facility where Isabalia was scheduled to meet Fett. A stormtrooper spotted the group and began arguing with Iya. When the stormtrooper pointed his blaster at Iya and Cott, Isabalia made her choice; she attacked him and asked to join Iya's group. Iya held her hand as they left for the work stoppage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}