{"url": "Juahir_Madras", "categories": ["Category:Canon articles", "Category:Combat instructors and training officers", "Category:Females", "Category:Humans", "Category:Martial artists", "Category:Waiters"], "nodes": [{"tag": "h1", "text": "Juahir Madras"}, {"tag": "p", "text": "Juahir Madras was a human female who lived on Coruscant during the reign of the Galactic Empire. During her time on the galactic capital, Madras befriended Driller MarDapp, the leader of Higher Skies Advocacy Group, and Arihnda Pryce of Lothal. She worked as a waitress before becoming a martial arts instructor at the Yinchom Dojo; a facility where students trained to become bodyguards for members of the Imperial Senate. The dojo was owned by H'sishi and located in the Federal District of Galactic City."}, {"tag": "p", "text": "In secret, Madras and MarDapp were part of a spy ring that spied on the Empire for the insurgent leader Nightswan. Madras used her position at the Yimchom Dojo to convince bodyguards to spy on their government clients until the ring was exposed by Pryce, who alerted Colonel Wullf Yularen of the Imperial Security Bureau. In return for a confession, Madras was spared the death sentence and sent to prison at the Oovo Four detention center."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Juahir lived on the planet Coruscant during the Imperial Era. While at school, Juahir practiced with hand-to-hand combat. As an adult, Juahir put that aside and worked as a waiter."}, {"tag": "h3", "text": "Meeting Arihnda Pryce"}, {"tag": "p", "text": "In the years leading up to the Battle of Yavin, Juahir and her friend Driller MarDapp befriended the Lothalite Arihnda Pryce, who worked as an aide for Lothal's corrupt Senator Domus Renking. Arihnda managed to help Juahir find an apartment in her own building. In return, Juahir repaid her friend by treating her to dinner at a fancy restaurant in Coruscant. During the Ascension Week celebrations on Coruscant, Arihnda helped Juahir and Driller gain access to the exclusive Core Square in Coruscant's Federal District. As a favor, Juahir's friend MarDrapp allowed the women to stay at his luxury apartment in Sestra Towers."}, {"tag": "p", "text": "While attending a party at the Alisandre Hotel's ballroom, Madras and her friends mixed with several Imperial governors, moffs, and senators. During the function, Juahir and Driller noticed the blue-skinned Chiss Senior Lieutenant Thrawn, a rising star in the Imperial Navy. When Driller asked whether Thrawn was a Pantoran with an \"eye condition,\" Juahir chided him for his rudeness. When Madras suggested speaking with Thrawn, she abandoned that idea."}, {"tag": "p", "text": "After Pryce chatted with the Imperials, she departed to deliver a data card to Moff Ghadi, leaving Juahir and Driller to socialize over drinks. Meanwhile, Ghadi blackmailed Pryce into returning data card to Senator Renking, causing him to lose funding for his citizen assistance offices and to sack Pryce. Pryce kept this incident secret from Juahir and claimed that she was not feeling well. After Pryce lost her job and was evicted from her apartment, Juahir offered to let her friend stay with her. Pryce declined the offer and instead opted with Driller for the rest of Ascension Week until she found a new job at the Proam Avenue Citizen Assistance."}, {"tag": "h3", "text": "Becoming a rebel"}, {"tag": "p", "text": "As a result of seeing her friend Pryce being mistreated by Senator Renking, Juahir came to regard the Galactic Empire as corrupt and accepted Driller's offer to join his spy ring, which gathered intelligence on Imperial mining operations for the shadowy insurgent leader known as Nightswan. Juahir resumed her martial arts training and went to work at the Togorian dojo H'sishi's Yinchom Dojo in Bartanish Four Sector, which trained and supplied bodyguards to Imperial officials and senators. Juahir used her job as a martial arts instructor to recruit and blackmail bodyguards into spying for Driller's Higher Skies Advocacy Group."}, {"tag": "p", "text": "Working in tandem, Juahir and Driller invited Pryce to the luxurious Pinnacle restaurant in Coruscant. There, Driller managed to recruit Pryce into Higher Skies, believing that her expertise with mines, mining, and refining would help their undercover work. They also hoped to recruit her to their rebel cause in the long run. Seeking to move up from a dead-end job, Pryce accepted the offer and agreed to move into Juahir's apartment near the Senate Building. Due to her physically exhausting work as a martial arts instructor, Juahir was looking for someone to cook for her. Pryce, who was competent at cooking, accepted Juahir's offer. The three friends then had dessert together."}, {"tag": "p", "text": "After Pryce had settled into her new job, Juahir once came to Pryce's aid after the turbolift that Pryce was traveling in malfunctioned and descended into Coruscant's dangerous Level 4120. Pryce was accosted by a gang of six youths but Juahir arrived in time with one of her students Ottlis Dos. Juahir bested two of the thugs in unarmed combat, prompting the rest of the gang to flee. As a result of the incident, Juahir gained Arihnda's trust and allowed Ottlis to give Pryce martial arts lessons. In return, Pryce treated Juahir and Ottlis for dinner that night."}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "Later, Colonel Yularen along with Captain Thrawn and Ensign Vanto visited to Yinchom Dojo to investigate Yularen's theory that Nightswan was recruiting bodyguards as spies. On that day, Juahir was overseeing a sparring session while Pryce was doing a work out. Despite the presence of the Imperial visitors, Juahir did not issue an order for the students to cease sparring until H'sishi arrived and ordered her to do so."}, {"tag": "p", "text": "Due to her involvement in insurgent activities, Juahir was visibly uneasy in the presence of Thrawn. After Yularen had explained the reason for his group's visit, Thrawn asked for permission to spare with H'sishi using sticks, claiming that the Empire was interested in trainers for a possible new urban combat unit. Juahir reacted with discomfort when Pryce told Thrawn that she worked for the Higher Spies Advocacy Group."}, {"tag": "p", "text": "Following the visit, Thrawn and Yularen discussed their visit to the Yinchom Dojo including Juahir's suspicious behavior. Thrawn realized that Juahir had stalled their meeting so that she could prepare herself. As an ISB agent, Yularen suspected that Madras had something to hide. Thrawn deduced that this was connected with Higher Skies."}, {"tag": "p", "text": "Unknown to Juahir, her student Ottlis Dos was working as a double agent for his employer Moff Ghadi. Due to Higher Skies' activities, smugglers had uncovered some of Ghadi's confidential information while raiders had attacked one of Ghadi's mines. After learning of Higher Skies' involvement, Ghadi demanded that Pryce spy on Higher Skies. In desperation, Pryce sought out Thrawn, who convinced her to spy on both Higher Skies and Ghadi in order to gain Colonel Yularen's favor and protection."}, {"tag": "h3", "text": "Downfall and arrest"}, {"tag": "p", "text": "After Pryce managed to bait Ghadi by offering to provide her with Higher Skies' files on his rival Grand Moff Wilhuff Tarkin, Driller managed to secure Pryce an audience with the Grand Moff himself. During the meeting, Pryce betrayed Juahir and Driller by exposing their espionage activities as well as Ghadi's opportunism. Pryce had copied Higher Skies' files using a double-thief program. In return for this information, Pryce managed to convince Tarkin to appoint her as Governor of Lothal and to give Thrawn's friend Vanto a long overdue promotion."}, {"tag": "p", "text": "The morning after the meeting, one of Juahir's students Kaniki attempted to assassinate Senator Evidorn, having been convinced by Juahir of the \"evils\" of the Empire. In response, Colonel Yularen decided to arrest her personally. Accompanied by Juahir's friend Pryce, Yularen and his ISB agents pounced on the unsuspecting martial arts instructor after she had finished training two of Senator Xurfel's newest bodyguards. Meanwhile, other ISB agents arrested Driller and other Higher Skies employees."}, {"tag": "p", "text": "When Pryce and Yularen confronted her about Kaniki's assassination attempt, Juahir protested that she had instructed the bodyguards to get information and not to kill their targets. Pryce then revealed that she had exposed Driller and Higher Skies' espionage work to the Imperial authorities. Before the ISB took Juahir into custody, Pryce demanded to know if Juahir had been her friend or if she was a tool."}, {"tag": "p", "text": "A broken Juahir told Pryce that she was her friend and reiterated that the incident with Senator Renking had showed her how corrupt the system was. Pryce refused to buy Juahir's explanation and accused Juahir of manipulating her. As the ISB agents led her through the door, Juahir begged Pryce to help her. Pryce told Juahir to cooperate fully with Colonel Yularen in order to avoid execution."}, {"tag": "h3", "text": "Imprisonment"}, {"tag": "p", "text": "Listening to Pryce's advice, Juahir cooperated with Colonel Yularen and told him everything she knew about Higher Skies' espionage including their dealings with Nightswan. Honoring Pryce's promise, the Empire spared Juahir execution and imprisoned her at the detention center on Oovo 4. For over a year, Juahir wrote about twenty letters pleading with the now Governor Pryce to help her. Unable to forgive Juahir for her \"betrayal,\" Pryce ignored the letters."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Juahir Madras was a human woman with fair skin, brown hair, and dark eyes. Juahir was a friend of Driller and the Lothalian expatriate Arihnda Pryce. She was a friendly and kind woman who was willing to help friends like Pryce in their time of need."}, {"tag": "p", "text": "She came to regard the Galactic Empire as corrupt after learning about her Pryce's unfair dismissal at the hands of the corrupt Senator Renking. This led her to join Driller's spy network, which was centered around his advocacy group Higher Skies. Still, Juahir and Driller believed in making the Empire a better place for everyone."}, {"tag": "p", "text": "Juahir hope to win Pryce over to her cause. However, Pryce was merely concerned with advancing her own political career and seeking revenge against Senator Renking and Governor Ryder Azadi. Pryce regarded the Empire as a ladder to achieving these goals. When Juahir and Driller got in her way, Pryce was willing to cast them aside."}, {"tag": "p", "text": "While Juahir thought that Pryce was a genuine friend, Pryce believed that Juahir and Driller had been using her in order to subvert the Empire. Juahir withholding her rebel sympathies led Pryce to believe that Juahir had betrayed her. This led her to cast Juahir aside despite of her numerous petitions."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Juahir was a skilled martial artist who first honed her skills while at school. After becoming involved in Driller's spy network, Juahir became a professional martial arts instructor at the Yinchom Dojo. She used her position to \"educate\" and coerce bodyguards into spying on their Imperial employers including senators and government officials. Juahir was also able to take on several thugs in unarmed combat, beating two and scattering the others."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Juahir Madras first appeared in Timothy Zahn's 2017 novel Thrawn, a rebooted canonical origins story of the eponymous character. Most of her lines are told from the point of view of Thrawn and Arihnda Pryce, a character from Star Wars Rebels."}, {"tag": "p", "text": "She was first illustrated in the Marvel Comics Thrawn 3, a comic adaptation of the novel which debuted on April 11, 2018. She was drawn by Luke Ross and colored by Nolan Woodard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}