{"url": "Jubnuk/Legends", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Desilijic servants", "Category:Gamorreans", "Category:Guards", "Category:Males", "Category:Tatooinians"], "nodes": [{"tag": "h1", "text": "Jubnuk"}, {"tag": "p", "text": "Jubnuk was one of Jabba Desilijic Tiure's nine Gamorrean guards."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Jubnuk had a wife and children, who lived with him at Jabba's Palace. However, he hated the living quarters he and his family lived in, due to it being too bright, and hoped for the opportunity to move to better living quarters. He also held some respect for Jabba's majordomo, Bib Fortuna."}, {"tag": "p", "text": "During the Rebels' mission to Jabba's Palace, to retrieve Han Solo from carbonite, Jabba assigned Jubnuk to retrieve a lucky talisman, a Tusken battle talisman, that Jabba had misplaced somewhere in the palace. Jubnuk was eager to prove his loyalty to Jabba in the hopes of moving his family to better living quarters. However, he realizes he doesn't even know what the talisman looked like, but he did know that he would end up punished if he did not find out. He proceeded to check the Max Rebo Band's equipment, but quickly realizes it wasn't there. He then tried to check the palace kitchen's garbage, although he wasn't able to find it and was later driven off by chef Porcellus. Jubnuk then searched the dump and inquired several Jawas hoarding some unused scrap, but learned they haven't found a talisman. He eventually asked Bib Fortuna for any communication on Jabba's talisman, although Fortuna informed him he has no knowledge on where it is. Jubnuk then tried to ask the chief droid inspector at the droid workshop, EV-9D9, whether she saw the talisman, but the droid was busy relaying its orders to Jabba's newly delivered droids, R2-D2 and C-3PO. Undeterred, he rummaged through the droid parts, but the loud noises proved too distracting, and he resorted to asking one of the B'omarr monks at Jabba's palace. The robotic monks denied finding any talismans, but they did offer Jubnuk the opportunity to join them and ponder the universe by removing his brain. Jubnuk considered the idea, feeling it might make him smarter, but ultimately declined due to it being too complicated for him to understand. Jubnuk intended to deliver the bad news about his fruitless search, but Luke Skywalker's arrival prevented him from doing so."}, {"tag": "p", "text": "When Luke Force-pulled a blaster from Nizuc Bek's holster, Jubnuk ran at Luke to protect Jabba from Luke's imminent attack. At the same moment, Jabba opened the trapdoor beneath Skywalker, causing both the Jedi and the Gamorrean to fall into the rancor's pit below. Jubnuk then realized he hadn't checked the rancor's pit for the talisman, although he wasn't given the opportunity to rummage through the pit when the door containing the rancor was opening for it to eat."}, {"tag": "p", "text": "Upon realizing his predicament, Jubnuk squealed in terror and attempted to climb back up the trapdoor's steep slide to no avail. The rancor approached Jubnuk first, and as his fellow Gamorreans watched and laughed from above, Jubnuk was eaten by the rancor."}, {"tag": "p", "text": "One of his hands was stuck in between the rancor's teeth when the rancor's trainers mourned for him. In addition, Jabba, believing him to have been killed by the rancor, later had Porcellus arrested and sentenced to death, as Jubnuk had eaten Porcellus's food, which, alongside Oola being fed earlier and her eating Porcellus's food, led Jabba to believe that Porcellus had cast a hex on the food."}, {"tag": "p", "text": "Jubnuk was later cut out of the deceased rancor's body when one of the beast trainers, Malakili overheard Jubnuk's sounds from his stomach. His armor had softened the blows from the rancor's teeth, with the talisman also helping him survive. However, Jubnuk was unable to deliver the talisman back to Jabba, as Jabba had left alongside most of his fellow Gamorrean guards to oversee Luke's execution at the sarlacc pit as revenge for the rancor's death. He also heard rumors of explosions at the pit, although he enthusiastically awaited Jabba's return to give it back to him, unaware that Jabba was killed in those explosions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jubnuk was portrayed by puppeteer Simon Williamson in Star Wars: Episode VI Return of the Jedi, who also portrayed Max Rebo, but his role was uncredited."}, {"tag": "p", "text": "Although the rancor clearly bites into Jubnuk before swallowing him, Jabba's Palace Pop-up Book claims that he was later cut out of the stomach of the beast, still alive due to the discovery of a lucky talisman he found inside the stomach. Leland Chee, the gatekeeper for the Holocron continuity database, admitted on June 3, 2013 that he had not been aware of Jubnuk being revealed to have survived until being notified by a Wookieepedia user. Chee also left his fate ambiguous, reasoning that while his being bitten into makes his survival impossible and later stating on his Twitter account that he'd prefer to ignore that ending, he did cite that Gardulla Besadii the Elder and Boba Fett's survival after being eaten by a krayt dragon and the sarlacc, respectively, did not completely rule out the possibility of Jubnuk surviving, either."}, {"tag": "p", "text": "In the game Star Wars Trilogy: Apprentice of the Force, Jubnuk's encounter with the rancor was depicted slightly differently: Upon Jubnuk and Skywalker falling into the rancor pit (the animation implying they fell directly into the chamber rather than going down a slide), Jubnuk immediately runs towards the rancor gate, which swiftly opens. Jubnuk briefly grunts in confusion, and then is killed by an arm swipe by the rancor before the latter roars at Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}