{"url": "Judicial_Department", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Galactic Republic law enforcement", "Category:Galactic Republic military units"], "nodes": [{"tag": "h1", "text": "Judicial Department"}, {"tag": "p", "text": "The Judicial Department, at times referred to as the Department of Justice, was the primary law enforcement agency of the Galactic Republic before the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "The Department"}, {"tag": "p", "text": "The Judicial Department was the primary law enforcement organization of the Galactic Republic. The Judicial Department was subordinate only to the Office of the Supreme Chancellor, and oversaw countless offices that were tasked with investigating, convicting, and sentencing criminals. Due to the collaboration between offices, many perceived the Department as corrupt and having many conflicts of interest. The rank of captain was used, and the department itself was led by a small team of provost marshals."}, {"tag": "h3", "text": "The courts"}, {"tag": "p", "text": "The Republic courts were part of the Judicial Department's system, although the majority of legal issues were solved at the local and planetary level with the planet or regional law systems. Issues that regarded Republic law such as concerns between planets, taxation and trade between star systems, and crimes committed in space were taken up by the Republic court system. The majority of cases in the court system involved large corporations, regional governments, or pirates and other criminals that wreaked havoc across multiple sectors. Cases that regarded the rights of sentients were also in the court system, and could sometimes reach the Republic Supreme Court. Staffing the court system were prosecutors, barristers, researchers, bureaucrats, and experts on specific topics."}, {"tag": "h3", "text": "ROCI"}, {"tag": "p", "text": "The Republic Office of Criminal Investigations, abbreviated ROCI, was an organization in the Judicial Department which managed subordinate law enforcement agencies and the Republic Enforcement DataCore, which tracked Republic bounties. ROCI was led by the Director of Investigation. Sector coordinators of the ROCI oversaw regional judicial forces and coordinated with local law enforcement to avoid conflicts with jurisdictions. ROCI also coordinated with the Jedi Order when Jedi were part of Republic investigations."}, {"tag": "p", "text": "Under the ROCI umbrella was the Republic Security Force, whose agents were more commonly known as Judicials and were recognizable due to their distinct blue or red tunics. The Judicial Forces were the primary officers of the ROCI, and at large, the Judicial Department. As such, the Judicials were the Republic's \"military\" forces, which had ground and space units for military peacekeeping operations, and would be supervised by a Jedi at times. The Judicials attended the Judicial Academy to learn military tactics. Judicials investigated corporate and government organizations, and at times fought organized crime and pirates. The Republic Security Force maintained a large fleet to support local patrols, anti-piracy operations, and special crimes. The Judicials also at times served alongside the Senate Guard on special missions."}, {"tag": "p", "text": "Due to Judicials frequently working with Jedi, some members resented the Order's privileged status while most appreciated their extra insight. Judicials were typically concerned with gaining evidence to use in their case for the Republic courts, while Jedi had no such regard. As such, friction between Judicials and Jedi was not uncommon, although regardless of personal sentiments, most Judicials treated Jedi with respect. When weapons, spice, or slavess were recovered by the Republic Security Force, they were given to the separate government office of Bureau of Sig, Spice and Slavery for examination, to trace their history to create an extensive map and timeline."}, {"tag": "p", "text": "Sector Rangers were special police officers of the Republic Security Force who were assigned to specific sectors of space, and were responsible for pursuing criminals that were too dangerous for local law enforcement. Members of the Sector Rangers were considered part of one of the oldest institutions, and as such, were dependable trackers and warriors. Sector Rangers typically operated alone or in small groups to hunt the notorious criminals of the galaxy. Sector Rangers had the legal right to deputize any local law enforcement officer to aid with the pursuit of dangerous criminals."}, {"tag": "p", "text": "Special Enforcement Officers, abbreviated SEOs, were the elite of the Sector Rangers. Whereas Sector Rangers were restricted to their assigned sectors, SEOs had no such boundaries and could use their jurisdictional freedom to pursue criminals across borders. SEOs constantly worked alongside Jedi to bring the most dangerous criminals to trial, whether that was in a local courthouse or a Republic courtroom."}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "The Judicial Department was equipped with a variety of equipment and vehicles. The Department utilized Consular-class space cruisers with different refits. Consulars used primarily for diplomatic missions were painted in striking red markings to denote their diplomatic status, with one such ship being the Radiant VII."}, {"tag": "p", "text": "Additionally, the Judicial Department deployed armed Consulars that were painted gray. Blue transports that were designated as Republic landers were used. The CR90 corvette in red livery was deployed by the Judicial Department. Judicials wore a variety of standard blue clothed uniform and could be armed with a blaster rifle."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "After the Jedi-Sith War led to the transformation of what was known as the \"Old Republic\" into the modern Galactic Republic, an era of peace was ushered into the galaxy. Despite the new time of peace, sporadic and local conflicts still took place. The Judicial Department was formed by this moment, and in the decades leading up to the Clone Wars, the Judicial Department launched a major public awareness campaign that was based on the threat the Hutt Clan's criminal activities posed."}, {"tag": "p", "text": "Eventually, conflict arose on Ontotho between Daa Corporation and the Ontothon government against the Fylar Freedom Fighters when Ontotho joined the Republic. Ultimately, the Jedi Eno Cordova and Cere Junda were dispatched, but the conflict erupted into a battle for Ontotho. Republic and Jedi reinforcements were eventually dispatched, which consisted of at least three armed Consular-class space cruisers and several Republic landers. The Republic forces fired upon the Fylari's anti-ship emplacements and ended the conflict, albeit with the collapse of the surface of the region and the death of several others."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "Sometime afterwards, Wilhuff Tarkin was a rising star in the Judicial Department and was poised to become the provost marshal before he resigned his commission and turned to politics, becoming the Governor of Eriadu. On the onset of the Invasion of Naboo by the Trade Federation against the planet Naboo, the Radiant VII, a Judicial Department Consular-class space cruiser crewed by Captain Maoi Madakor and Antidar Williams, transported Jedi ambassadors Qui-Gon Jinn and Obi-Wan Kenobi to the Saak'ak. In a ploy by Darth Sidious, the Trade Federation destroyed the Radiant VII and attempted to kill the Jedi, but failed."}, {"tag": "p", "text": "After the Battle of Naboo, Viceroy of the Trade Federation Nute Gunray was tried several times in the Republic courts of the Department, but many saw the trials as unfair, with many Republic citizens believing that holding multiple trials was excessive. This sentiment led to many joining the early sentiments surrounding the Separatist Crisis."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Around the time of the outbreak of the Clone Wars, Foga Brill was the Director of Investigation of the Republic Office of Criminal Investigations. With the start of the Clone Wars, the Republic formed the Grand Army of the Republic and the Republic Navy, which took over the military functions performed by the Judicial Department. Many admirals, generals, and other commanders were drawn from the ranks of the Judicials. One engineer, Lira Hardin, served as a Judicial before transferring to the 9th Engineering Battalion within the Grand Army of the Republic."}, {"tag": "p", "text": "However, despite most transferring to the Republic Military, not all Judicials made the transition. Even at the peak of the Clone Wars, peace officers were still in need to establish law and order on loyal Republic worlds. They enforced Republic laws on members worlds and hyperlanes and, owing to their training, were more than capable of taking care of themselves if a suspect became violent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Judicial Department first appeared in the 1999 Star Wars saga film Star Wars: Episode I The Phantom Menace, and was first identified in the 2015 canon novel Tarkin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}