{"url": "Juggernaut_510_Combat_Power_Armor", "categories": ["Category:Legends articles", "Category:Cozzell Corporation products", "Category:Powersuits"], "nodes": [{"tag": "h1", "text": "Juggernaut 510 Combat Power Armor"}, {"tag": "p", "text": "The Juggernaut 510 Combat Power Armor was a rare assault powersuit manufactured by Cozzell Corporation."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "The powersuit provided full body protection against kinetic and energy attacks and came with a climate-controlled body glove. It also enhanced the wearer's strength and provided a 180 degree macrobinocular vision sensor system which included a Multi-Frequency Targeting and Acquisition System. A handheld medium repeating blaster came with the armor, and a grenade launcher was mounted on the left shoulder. Moreover, a retractable set of claws was installed in the left gauntlet. However, the suit was bulky and slow, and it had a set of insufficiently armored power transfer routing conduits on the back, which, when targeted by blaster fire, could knock out power to the medium blaster and the grenade launcher."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Juggernaut armors were developed for use with mercenary and militia forces for heavy firepower infantry support. While effective, the Juggernaut armor was also very expensive to produce, and Cozell Corporation eventually canceled the project. It remains unknown whether a fully operational prototype was ever made, but rumors had it that the Galactic Empire had access to a prototype and were subjecting it to various tests. The Rebel Alliance even dispatched a group of agents to sabotage the project, but it is unknown whether they succeeded or not."}, {"tag": "p", "text": "Later, one of Cozzell's lead designers for the project, Sarvel Tal-Oldra, decided to continue work on the armor despite Cozzell's cancellation. He went to Doc's former outlaw tech base in the Corporate Sector, where he began custom manufacturing Juggernaut suits."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}