{"url": "Juggernaut_war_droid", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Battle droid models", "Category:Duwani Mechanical Products products"], "nodes": [{"tag": "h1", "text": "Juggernaut war droid"}, {"tag": "p", "text": "The Juggernaut war droid was a battle droid constructed by Duwani Mechanical Products and designed specifically for use by the Republic rocket-jumper corps."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The juggernaut operated in a bipedal configuration, and had two alternate methods of propulsion. It could use twin outrigger jets to propel itself into the air for bursts up to one minute, or the jets could convert into intake propellers for underwater use. Unfortunately, the droids propellers would often jam, sinking the droid. The juggernaut was armed with a wide-beam sonic stunner and a high powered shatter beam, but its primary weapon was the pulse-wave rifle."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "They were first commissioned in 4800 BBY by Supreme Chancellor Vocatara, and they quickly saw service in the Gank Massacres. During the Great Sith War, Juggernaut war droids provided soldiers of the Galactic Republic with much-needed supplies, since thanks to the versatility of their jet packs they were able to reach Republic personnel well behind enemy lines. During the Great Droid Revolution, however, they were used by HK-01, shredding the Republic rocket-jumpers in an air battle over Monument Plaza. Most of the droids were quickly decommissioned after HK-01 was deactivated."}, {"tag": "p", "text": "Ilum, an Iron Knight, and some of her twelve children lived inside the bodies of Juggernaut war droids. Arden Lyn's cybernetic arm came from Juggernaut droids."}, {"tag": "p", "text": "The Mandalorians later used the JU-9 Juggernaut War Droid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The design of the Juggernaut war droid was originally intended to be used for the B2 super battle droid."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}