{"url": "Juhani", "categories": ["Category:Legends articles", "Category:Articles needing illustration", "Category:Pages needing citation", "Category:Cathar", "Category:Females", "Category:Jedi Guardians", "Category:Jedi Knights of the Jedi Order", "Category:LGBTQ+ individuals", "Category:Redeemed Jedi", "Category:Slaves", "Category:Tarisians"], "nodes": [{"tag": "h1", "text": "Juhani"}, {"tag": "p", "text": "Juhani was a Cathar female and a Knight in the Jedi Order during the Jedi Civil War. Juhani grew up on the planet Taris after her family escaped the assault on their homeworld during the Mandalorian Wars. In addition experiencing great hardship and xenophobic discrimination, Juhani was sold into slavery after the death of her parents in order to pay off their debts. Juhani was eventually discovered to be Force-sensitive by the Jedi Knight Revan, and freed from her servitude. She then made her way to the Jedi Enclave on Dantooine and was accepted for Jedi training by Jedi Master Quatra."}, {"tag": "p", "text": "Near the close of the Jedi Civil War, Juhani briefly fell to the dark side after she mistakenly believed she had struck down her master in a heated moment. While hiding from the Jedi Council, Juhani again encountered Revan who had lost his memories after he was betrayed by Darth Malak. Revan defeated Juhani in a duel and convinced her to repent and seek forgiveness for her actions. She returned to the Order and was accepted by them. She later requested to accompany Revan, and joined him and fellow Jedi Bastila Shan in their quest to locate and destroy the Star Forge superweapon."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "In the early days of the Mandalorian aggression that would culminate in the Mandalorian Wars, Juhani narrowly escaped the genocide of her people by the forces of Mandalore the Ultimate's lead strategist, Cassus Fett, in the Battle of Cathar. When Cathar capitulated, her parents fled the planet among the very last remnants of their race, taking their child with them; they fled as far as they were able, and eventually settled on Taris. It was there that Juhani, only a few months old, was raised; throughout her life, she called Taris her homeworld. Like many non-Humans on Taris, at that point in its history, Juhani's family had a rough life. The native Humans disliked them merely for being \"aliens,\" looked at them in disgust, persecuted them, and charged them more for food than their own species. Juhani had mixed feelings for the planet she had to live on; she hated it, called it a \"rat-hole\" and a \"warren,\" but still felt that it was her home and that her life could have been far, far worse."}, {"tag": "p", "text": "In 3963 BBY, the Mandalorians finally entered Republic space, and Taris fell under siege. Xor, a Twi'lek who had fought with the Mandalorians on Cathar, provoked Juhani's father into a fight and killed him. Her mother escaped with Juhani, but with the death of her mate something began to slowly die within her as well. She worked as hard as she could, but still didn't earn enough money to support both herself and her daughter. So she started borrowing money from the Exchange, doing everything possible to save funds, and giving Juhani most of their food. She began to waste away, until one day she collapsed in the cantina she worked in and never recovered, as they simply did not have enough money to pay a doctor."}, {"tag": "p", "text": "The Exchange was the major supplier of slaves on Taris, and when her mother died they charged Juhani with her mother's debts and enslaved her, as she had no way to repay them. This was the worst period in her life. She was bound like a beast and treated like livestock, until she was released by a Jedi before she could be sold to her father's murderer, who was going to purchase her at auction. Juhani never gave up hope for a better life, however. She had heard tales about the Jedi, and had somewhat idealized their image as \"champions of truth, defenders of justice, heroes of the Republic.\" When she was freed from the slavers by Revan, who came to fight the Mandalorians with his group of Jedi, he and those Jedi lived up to everything her imagination had created them to be. Encouraged to join the Order by a human woman who followed Revan, Juhani vowed to become a Jedi. Because she was Force-sensitive, she had the potential."}, {"tag": "h3", "text": "Jedi training"}, {"tag": "p", "text": "As soon as she collected enough money, she boarded the first freighter to Dantooine, where she was taken for training by Jedi Master Quatra. Juhani progressed, but she was ever struggling with how her Cathar blood gave her a difficult time mastering her emotions. Sometimes she doubted her place among the Jedi."}, {"tag": "p", "text": "Dak Vesser had joined the Order at the same time as Juhani and become her friend. She expressed her doubts about the Order to him, and his were even stronger; he thought the Order was too controlling and limiting. When he decided to leave the Order, he asked Juhani to come with him and futher surprised her by confessing romantic feelings for her. She only thought of him as a friend and would not follow him. Dak grew angry at her refusal and left the Jedi Enclave, eventually joining the Sith on Korriban."}, {"tag": "p", "text": "Juhani and Belaya, a Human female and fellow Padawan, grew especially close to each other. Belaya also struggled with controlling her emotions, something she was often reminded she must learn how to do by her master, Zhar Lestin. For many years, the pair were dear companions to each other, and they spent many nights alone together under the stars. Their attachment did not escape the notice of the Jedi Council."}, {"tag": "h4", "text": "Falling into darkness"}, {"tag": "p", "text": "Juhani remained with the Jedi and progressed through her training, until Quatra decided it was time for her to face the Jedi Trials. Quatra had nothing left to teach her, but Juhani had yet to learn to accept her own limits, so it was her choice to test Juhani in an unusual way. Quatra allowed Juhani to give in to her rage and strike her down in the middle of a fierce confrontation, leaving Quatra greatly injured and feigning death."}, {"tag": "p", "text": "Believing that she had harnessed the power of the dark side and killed her Master, Juhani left the Enclave and hid in the Ancient Grove where Jedi used to meditate. The grove soon became tainted, and the local kath hounds became more aggressive, resulting in attacks upon the settlers. The Jedi Council would not permit Belaya to attempt to restore Juhani, believing their personal attachment to each other and strong emotions were too much of a risk."}, {"tag": "h4", "text": "Redemption"}, {"tag": "p", "text": "Three years earlier, much to Juhani's later incredulity, her hero Revan had come back as a Dark Lord of the Sith. Later on, Bastila Shan was key figure in the capture of Darth Revan, and Revan was said to have died. In truth, the greatly injured Revan had been brought to the Council, where the Jedi created a new identity for him through the Force. It was believed that Shan could draw on his subconscious memories to lead them to the Star Forge, the seat of power of the former Dark Lord. His new identity as a Republic soldier did not yet know the ways of the Force; thus, after the Sith set an ambush for Shan over Taris and eventually destroyed the planet in their attempt to prevent her escape, Shan brought the amnesiac soldier to Dantooine to begin his own Jedi trials. His last test before becoming a Padawan was given to him by Belaya's master, Zhar Lestin, who told the student that he must confront the source of the darkness tainting the grove and stop the threat there without assistance from other Jedi at the academy."}, {"tag": "p", "text": "As Revan approached the grove, Juhani sensed his power but did not believe he could match her own, and she engaged him in battle. She was defeated and distraught over her actions, but Revan spared her life and persuaded her to ask the Jedi Council for mercy."}, {"tag": "p", "text": "Juhani returned to the Enclave and learned the truth about Quatra, who had already left to train other students, confident that Juhani would pass the trial. She felt foolish to have thought she could harm a Master such as Quatra. Though she still bore the scars of her slip to the dark side, she trusted her Master's wisdom and now truly understood what she was meant to learn: humility. Quatra's lesson was that even one who was true to the teachings of the Jedi may just as easily fall to the dark side through their inability to understand or accept their own limitations. With this final trial passed, Juhani was promoted to the rank of Jedi Knight."}, {"tag": "p", "text": "When Revan and Shan uncovered the Star Map in the Rakatan Ruins of Dantooine and were appointed the quest to find the Star Forge, Juhani asked the Council for permission to accompany the Padawan. Though Juhani was unaware of Revan's true identity, as she had never seen the face behind the mask, the Council felt she may serve as a reminder of the dangers of falling to the dark side. The Council granted Juhani's request to join the crew of the Ebon Hawk."}, {"tag": "h3", "text": "The Jedi Civil War"}, {"tag": "p", "text": "During their travels, Juhani opened up to Revan about her past. When she revealed her homeworld had been Taris, she lashed out at him in anger and blamed him for its destruction, but then calmed herself with the Jedi Code. She realized that nothing could have been done to prevent Taris' destruction. She confessed to her friend that she had been inspired by the Jedi hero who became Darth Revan, neither knowing that she was speaking to the one who had once been that man."}, {"tag": "p", "text": "When the crew was captured by Saul Karath on his flagship, the Leviathan , Revan learned the real reason for his visions and lost memories as Malak dueled him and taunted him with the revelation. Malak's words were confirmed by Bastila Shan before the Sith Lord captured her. Afterward, Revan revealed the shocking truth of his identity to Juhani and the crew. Juhani expressed her strong opinion that Revan, the man who had rescued her from slavery, could never have fully turned to the dark side. She vowed that now—from his example of redemption—that she would never fall again. Little did she know that her vow would be put to the test."}, {"tag": "p", "text": "While traveling in search of the Star Maps, Juhani encountered Xor, the Twi'lek slaver who had tried to purchase her on Taris during the Mandalorian Wars. The slaver tried once again by making an offer to Revan. Revan stood by her, saying she was her own person; Juhani lashed out at Xor as he spoke of how he wiped out her people on Cathar and killed her father on Taris, but she did not give in to her anger. The thought of him still running free made her Cathar blood seethe, but she let him go. Xor promised he would be back."}, {"tag": "h3", "text": "Confronting the dark side"}, {"tag": "p", "text": "The second time Revan and Juhani encountered Xor, he brought two of his enforcers with him. After Revan and Juhani beat Xor and his thugs, Xor used his last moments attempting to feed her hatred, seeking the satisfaction of showing Juhani she was no better than him by provoking her into killing a defenseless opponent. He related the burning of the people of Cathar in their homes by his hand and the pleasure he took from it. With Revan's support, Juhani was able to leave Xor to his inevitable fate. Juhani regretted that he did not die by her hand, but it was more important that she resisted the dark side."}, {"tag": "p", "text": "When Revan had collected the five Star Maps he needed to locate the Star Forge, the Ebon Hawk approached the space station, but the station's disruptor field damaged their hyperdrive. The ship barely made it to the nearby planet Lehon without joining the wreckage that covered the surface. Juhani suggested they search the other downed ships for the parts the Ebon Hawk needed to take off, though the disruptor field still needed to be deactivated. The possible whereabouts of its generator was found by the droid T3-M4, which detected energy readings on the ship's sensors that seemed to be coming from the Temple of the Ancients. The Elders granted Revan access to the temple, but tradition had it he should go alone; however, when both Juhani and Jolee Bindo received a premonition warning them of great danger laying inside, they insisted on accompanying Revan and struggled to persuade the Rakata to allow them to. It turned out to be the right decision, as the temple was infested with numerous Dark Jedi, Sith Masters, and acolytes."}, {"tag": "p", "text": "Atop the Rakatan temple, the Jedi trio was confronted by Bastila, who had been tortured and turned to the dark side by Darth Malak. When she found herself at a disadvantage, the fallen Jedi attempted to lure Revan into reclaiming his usurped title of Dark Lord of the Sith. Though Bastila mocked Juhani for running like a \"cowering animal\" when she first touched the dark side, Juhani had grown stronger through her friendship with the man who had once saved her on Taris; his inspiration helped keep her from falling to the dark side again. Juhani and Jolee helped Revan resist Bastila, and they were possibly critical in Revan's choice to turn away from his dark side persona for good."}, {"tag": "p", "text": "After the death of Malak, the redemption of Bastila, and the destruction of the Star Forge, Juhani was honored at the celebration of the Republic's victory on Lehon along with Revan and his other comrades. A holostatue of Juhani was erected in the Leisure Garden section of the Axial Park in the Coronet City on Corellia, along with the statues of Revan and his other companions in memory of their deeds."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Juhani was determined to become the ideal Jedi, and her fierce devotion to her goal didn't allow her to accept failure in herself or her peers, yet she always found herself struggling against her Cathar instincts and fierce temper. Juhani's Master, Quatra, feared that her unchecked perfectionist views would eventually end in frustration and lead Juhani to the dark side. Quatra's final test forced Juhani to re-examine herself and how her pride had nearly made her fall to the dark side, the act would leave a positive impression that served as an example when she needed to reflect on her choices. Juhani claimed that Cathar were solitary and slow to trust by nature, so even when she eventually joined the Jedi she mostly kept to herself, keeping only a small circle of friends, including fellow Padawans Belaya and Dak Vesser. Even with Revan and the crew of the Ebon Hawk she kept herself at a distance, though she valued their companionship. Juhani was often a zealous advocate of the light side and the ways of the Jedi."}, {"tag": "p", "text": "Juhani understandably held a grudge against the Mandalorians for Cassus Fett's unprovoked genocide on her birth planet of Cathar, and even though she recognized her Mandalorian ally Canderous Ordo as a person of merit, she could never fully trust him. In addition, she still harbored some animosity towards Humans for the prejudice and persecution she and her parents suffered while living on Taris. While she admitted that some of the best people she had ever known were human, she found it difficult to let go of her bitterness, and at times would even lash out emotionally at Revan for it. She also, at one point, blamed Revan and Bastila for the destruction of Taris, though she did apologize later."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Juhani's heritage and segregated upbringing had a unique effect on the way her Force powers developed. As a member of a Cathar subspecies, she had less prominent claws than other Cathar and the ability to quickly alter the pigments in her fur, a natural camouflage that was enhanced when she instinctively learned how to conceal herself with the power of Force camouflage. As a Jedi Guardian, she preferred lightsaber combat, although she would also use several Force powers while in battle. She supplemented her lightsaber dueling skills with a wide array of battle oriented Force powers, including Force speed, Force Stun, Force push, and Saber Throw."}, {"tag": "p", "text": "During her brief stint as a Dark Jedi, she also began to learn dark side powers such as Force Slow, Force Shock, and Force Choke, though she would later abandon the use of the latter. She could also employ the Jedi Mind Trick, though she often saw it as a misuse of the Force."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Juhani first appeared in the 2003 video game Star Wars: Knights of the Old Republic and was voiced by Courtenay Taylor. The character's name was originally going to be \"Bastila Shan,\" with early concept art depicting Juhani wearing the color scheme that Bastila wears in the final game."}, {"tag": "p", "text": "Juhani was the first character in the Star Wars universe to be explicitly portrayed as LGBTQ+, one of the earliest positive representations of LGBTQ+ characters in video games, and the first gay character of any gender in a video game developed by BioWare. Knights of the Old Republic co-designer David Gaider was surprised when his fellow developers, most of whom were straight men, proposed taking the risk. A gay man himself, he had never suggested a same-gender romance option because he believed fellow developers and audiences would not accept the idea. Juhani's storyline as a lesbian character helped him realize he could include LGBTQ+ characters in his own work, such as when he later helmed the Dragon Age franchise."}, {"tag": "p", "text": "Because Juhani would be the first LGBTQ+ character in Star Wars, Knights of the Old Republic co-writer Drew Karpyshyn said the team had to \"tread pretty carefully.\" The resulting subtlety left some players unaware that Juhani was written to be lesbian. The writing team did not seek anyone's permission to include Juhani's storyline, and they were never told they could not or instructed to do otherwise. However, because the team's assumptions about the player base led them to censor themselves, Juhani never came out and said it. At the first GaymerX convention, Gaider said, \"We kind of hid it. She never says, 'She was my lover.' She just says, 'We are very close.'\""}, {"tag": "h3", "text": "Alternate storylines"}, {"tag": "h4", "text": "Romance"}, {"tag": "p", "text": "On their journey together to stop the Sith, Revan earned Juhani's trust and respect, becoming close friends with the normally solitary and reserved Cathar. However, their story can only take a more intimate turn if Revan is played as female; Juhani and the male Revan do not express one-sided or reciprocated romantic affections."}, {"tag": "p", "text": "In the grove, Juhani has additional lines for the female Revan. If told she is a \"beautiful and talented young woman,\" she says Revan seems to know how to affect her. Discussing her belief that she killed Master Quatra, she says, \"I think, in my own way, I truly loved her.\" While thanking Revan for her redemption, Juhani wishes she had a way to make it up to her. Multiple conversations afterward include additional lines from Juhani only when Revan is female. For instance, after the reveal of Revan's identity, Juhani hesitates to share how she feels and calls Revan the woman she has \"come to care for\" if the player has maintained the subplot; otherwise, Revan is the woman Juhani has come to \"admire\" and whose heart she wishes she had."}, {"tag": "p", "text": "The culmination of the romance with the female Revan depends upon prior choices and occurs when she initiates a conversation with Juhani after refusing to follow Bastila to the dark side in their duel on the Rakatan temple. If the female Revan failed to support Juhani in the past, Juhani will only hint at her unrequited feelings by saying she is glad to have been of value to Revan, even though it was not as much as she would have liked. If Revan continued to ask Juhani about her history and consistently supported her, Juhani will confess her feelings for the other woman. Revan can share that she feels the same way, and Juhani will be pleased, but say they must confront Malak before they can sort out what to do about their mutual emotions for each other."}, {"tag": "p", "text": "Unlike the optional romance subplots between the female Revan and Carth Onasi or the male Revan and Bastila Shan, Juhani and female Revan do not share an offscreen kiss. Despite Juhani being one of two romantic options for the female Revan, if the player character in the sequel sets Revan to a light-side female, it will be assumed that Revan had a romantic relationship with Carth Onasi. However, both the Juhani and Carth Onasi romance subplots are non-canon, as Revan was canonically male and married Bastila Shan after the events at the Star Forge."}, {"tag": "h4", "text": "Other gameplay alternatives"}, {"tag": "p", "text": "Players have the opportunity to kill Juhani twice. First, after encountering her in the grove, they can choose to end her life instead of redeeming her, thus losing a potential party member. Second, if the player saved Juhani but later chooses to follow Bastila to the dark side, Juhani and Jolee Bindo leave the party and become hostile, resulting in killing them both."}, {"tag": "p", "text": "After defeating Xor, the player can persuade Juhani to give in to her emotions and take revenge on him instead of suppressing her anger. If the player does so, Juhani loses control and strikes Xor down with her hatred. Afterwards, Juhani regrets that she gave in to the dark side again, even though she felt he deserved his fate."}, {"tag": "p", "text": "If the player chooses killing Juhani instead of redeeming her in the grove, the strength of Belaya's emotions for Juhani causes her to fall to the dark side as well. Upon returning to the enclave, Belaya initiates a confrontation, expressing her anger towards the player and the Jedi Council for their roles in Juhani's death. She believes a more experienced Jedi or one who believed in Juhani could have spared and saved her, but the Council would not let Belaya try. Thanks to the player, she will never again spend nights under the stars with her dear companion as they did so many times before. Inconsolable, Belaya leaves the Jedi Order and falls to the dark side. When Revan arrives at the Sith Academy to search for the Star Map, Belaya is there as a student. She again blames Revan for Juhani's death, saying it placed a \"bitter blackness in my heart,\" and swears vengeance for Juhani. She attacks and is killed by the former Sith Lord."}, {"tag": "h3", "text": "Bugged and cut content"}, {"tag": "p", "text": "Although Juhani's romance subplot is intended for only female player characters, some players of the initial release reported that the romance subplot was available to their male player characters. One of Juhani's primary writers, Peter Thomas, confirmed in January 2004 on the BioWare forums that the romance variable was meant to be set to \"true\" only for female player characters, which would occur during the first conversation with Juhani after she joined the party, and that male player characters later receiving a specific romantic line was a bug that had not been caught in time. Her Databank entry on StarWars.com also contained errors, such as stating that she was a romance option for player characters regardless of gender and that she had killed Quatra. Juhani's bugged subplot and the rumors surrounding it led some players to mistakenly believe that she was intended to be bisexual rather than lesbian, among other speculation."}, {"tag": "p", "text": "The player base was aware from an early date that Juhani's personal quest was bugged and difficult to trigger, but by January 2005, it was rumored that her entire character had been cut during development and added back shortly before the game release. Some players claimed her romance subplot was only intended for the male Revan and its availability to female Revan was the actual bug; similarly, some interpretations of her dialogue with the female Revan framed her as having only platonic admiration or familial affection. More persistent rumors speculated that BioWare or Lucasfilm had objected to Juhani having a female romance and ordered it to be eliminated or toned down. Online rumors about Juhani's story sometimes used homophobic language, including on the official BioWare forums, the IGN Boards, the Jedi Council Forums, and the talk page for Juhani's Wookieepedia article."}, {"tag": "p", "text": "Juhani was going to have some lines on the Leviathan in which she voiced her apprehension and the player could reassure her. Some of them, however, would have been limited to their romance plot, with Juhani speaking her wish to have more time to see what the future held for the two of them. There was also a conversation option that allowed her to voice suspicion and dislike for Canderous Ordo; this is retained in the Android and iOS versions of the game.[source?] Another cut dialogue tree would have allowed her to voice her knowledge regarding the various planets visited by the party. Overall, only about half of the dialogue voiced and written for the character made it into the game.[source?]"}, {"tag": "h3", "text": "Other appearances"}, {"tag": "p", "text": "On August 19, 2008, Wizards of the Coast published the Knights of the Old Republic Campaign Guide, a supplement to the Star Wars Roleplaying Game. It includes artwork that depicts Juhani in a lightsaber duel with Malak's Shadow Hand Darth Bandon. However, the specific moment does not occur in the video game Knights of the Old Republic. The Star Wars Miniatures game collection for Knights of the Old Republic was released by Wizards of the Coast on the same day as the campaign guide. A miniature of Juhani, marked as being \"very rare\" and part of the \"Fringe\" set on the checklist poster, is depicted wearing the brown and yellow coloring seen in her concept art rather than her in-game tan and teal attire. The miniature wields a blue-bladed lightsaber."}, {"tag": "p", "text": "BioWare's PC video game Star Wars: The Old Republic has a non-repeatable bonus mission on Corellia called \"Restore the Statues\" in which players restore holostatues that were deactivated by Mandalorians and depict Revan's companions. The hologram representing Juhani portrays her with a generic Cathar model and without her unique attire. Four armor pieces that replicate her Knights of the Old Republic outfit can be purchased in the Cartel Market."}, {"tag": "p", "text": "Juhani and other Legends characters are featured in Star Wars: Galaxy of Heroes, a mobile game released by Electronic Arts on November 24, 2015. The game allows players to collect characters from multiple eras of Star Wars storytelling and put those characters into battle on a holotable. Due to the game's sandbox nature, it does not canonize Juhani in the current canon continuity. She was added to the game in the \"Legends of the Old Republic VIII: Juhani\" event on November 30, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}