{"url": "Julen_Rakab", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Dok-Ondar's Den of Antiquities employees", "Category:Farmers", "Category:Humans", "Category:Males", "Category:Ohnaka Transport Solutions employees", "Category:Pilots", "Category:Rakab family"], "nodes": [{"tag": "h1", "text": "Julen Rakab"}, {"tag": "p", "text": "Julen Rakab, also known as Jules, was a human male who lived on the Outer Rim planet Batuu. During his childhood, he was best friends with a girl named Izal Garsea, until one day when he was six years old, Izzy and her family left Batuu abruptly."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Julen Rakab was born into a farming community around 15 ABY. He had a sister Belen Rakab. His parents were both farmers and both very happy, but once his father died his mother became bitter and was never happy again. Jules had been robbed and beat up twice when he used to be skinny. The first time he was in a salvage yard and found a helmet from the Clone Wars and two older kids took it from him. The second time was after a night of drinking with his friends and three thugs robbed him of his Batuuan Spira. After these events he vowed never to be humiliated again and learned everything he could about the outpost. He once wanted to join the New Republic Academy, but never left off world. He occasionally worked for Dok-Ondar at his shop."}, {"tag": "h3", "text": "First-Order Resistance war"}, {"tag": "p", "text": "Thirteen years later, while working at Dok Ondar's Jules once again met Izal Garsea when she was delivering a package to Dok. Izzy and Jules went to Cookie's restaurant. Izzy ran out when she saw Ana Tolla crew. She returned to him and said that she needed to get off world. Jules was upset by this. Izzy asked if he wanted to go off world with her, but he denied. Izzy then told him about how Damar had abandoned her."}, {"tag": "p", "text": "Jules then drove her back to Dok's on his speeder. She departed on her ship the Meridian, walking away he regretted the decision heavily and headed back to home. While driving back he helped a boy named Nate Grattonius from being mugged. The boy thanked him and Jules continued on his way to Ohnaka Transport Solutions."}, {"tag": "h4", "text": "Delivering the parcel"}, {"tag": "p", "text": "While at the docks, Izzy returned to him because she had swapped her crate that she was supposed to deliver to Dok Ondar. Jules asked the Karkarodon, Lee Skillen, if he could go in the office and return it. Lee, being Hondo Ohnaka's main lieutenant denied saying that no one was allowed in. Jules picked her access card and Izzy went in anyways. While in the room, Izzy stunned Delta, to get her package back."}, {"tag": "p", "text": "Jules and Izzy tried to go back to Dok's, but a protest against the First Order blocked their path and they had to go down Smuggler's Alley. There they were confronted by a man saying that Oga Garra wanted to speak to them. Oga talked through Jules in Huttese to Izzy. Oga said how she knew her mother and that she was one of her best bounty hunters. Oga said how Izzy knew nothing about her mother which infuriated Jules. Oga then dismissed Jules from her office and talked privately with Izzy about her mother's death."}, {"tag": "p", "text": "Finally on their way back to Dok's the two walked through the marketplace and Jules bought them some nuna jerky. Jules stopped at the Creature Stall to meet his friend Volt Vescuso. While leaving Izzy was spotted and grabbed by Delta. Jules caused a distraction by letting out the animals in the shop, angering Volt. They ran around the corner and Tap let them in."}, {"tag": "p", "text": "With Dok still missing, the trio decided to search his personal quarters and found him locked in the safe. Dok told how a First Order sympathizer thought he was contributing to the corruption of Batuu and tried to shoot him, but lost his nerve and shoved him in the safe. Dok sent them out to a rocky area in the middle of nowhere. Once Izzy stepped outside she met with Damar. Jules denied Damar's greeting and gave him his birth name instead of his nickname. Damar invited both of them to join the crew. Both of them flatly denied him and when he said that Jules should take her somewhere special for her birthday she shot the ground near his feet and Damar ran."}, {"tag": "p", "text": "Jules and Izzy returned to the Cantina where his speeder was parked. They sped out to the countryside and stopped at the abandoned settlement where both of them used to live. Izzy went into the house where she used to live and reflects on her past. Izzy told him how she dropped out of the academy when her professor hired her to smuggle in some haneli flower. She dropped the cargo and ran off. While talking about Ana Tolla a loralora bird that had formed a strong bond with her came and sat in her lap. Before she could protest the stowaway, Jules named it Lucky."}, {"tag": "p", "text": "They then drove to Kat Saka's farm. Jules introduced Garsea to Shari, Ksana, and Belen. Izzy told them stories about her adventures and awed the farm kids. After her story she talked to Jac Lodain about rumors of the Resistance on Batuu. While the two were discussing the war, Jules entertained the kids. Izzy then told Jules that Oga had offered her an audition and she took it. Izzy then kissed him. She told him about her conversation with Belen and how she promised that is she left, she would never return."}, {"tag": "p", "text": "Finally they arrived at the drop off location with rock formations. They met an older woman and a Mon Calamari named Lejo. Jules realized they were Resistance operatives. Izzy asked what was in the package and the older woman asked if they wanted to do some good, they could always sign up and they left. Both of them walked to the cenotes and swam in it until Damar arrived and put Izzy's blaster to his head. He handed him over to Delta and Damar got Izzy."}, {"tag": "h4", "text": "Skirmish at Kat Saka's farm"}, {"tag": "p", "text": "Delta took off with Izzy and Damar went with Jules. Jules kept trying to break his bindings, but failed. Julen's speeder then failed and he told Delta to keep going. Eventually Damar got it started again and he started swerving towards Kat's farm. Jules briefly overpowered him and took back the blaster, but Damar revealed that they were holding his sister hostage. Jules had to keep silent all the way."}, {"tag": "p", "text": "When they arrived at the farm, Ana Tolla's crew realized that Delta was not going to come. They released him from his cuffs and forced him to help plant sodium mines around the farm. He threw one of them at Safwan and stunned Lita with his blaster. Just then his ship arrived that had been stolen by his friends. Izzy sent Lucky after Oskan and knocked him off the water tower. While the fight continued Jules ran to the grain silo where Belen was being held hostage. Instead he found Lita and the crew members knocked an avalanche of grain on him. He ran back to his ship and was punched by Damar. A scream rang out in the night and Jules saw his chance and shot him. He met with Delta who told to meet with his sister and Tap. During this time, speeders arrived as reinforcements. Oskan betrayed his captain by grabbing the detonator."}, {"tag": "p", "text": "Celebrations began as Oga's thugs dragged off Ana Tolla's crew. Jules talked with Velta and thanked her for saving his ship. Volt told him that Izzy had already taken off and he went to celebrate with his family and friends gloomily."}, {"tag": "p", "text": "Later he went to Oga's Cantina where he had become very popular. Bartenders gave him free drinks and Cookie offered his congratulations. He was even offered a Fuzzy Tauntaun, one of the most expensive drinks. Even though he enjoyed the gifts, Jules did not ever want to be under the spotlight. Izzy arrived after finding her mother's message. They talked about the ship upgrades and then kissed."}, {"tag": "p", "text": "Some time later Jules and Izzy would race above the skies of Batuu and called the planet home. While walking in the outpost the discussed joining Hondo's company as pilots. They were interrupted as the battle between the First Order and Resistance began in the sky. Jules and Izzy vowed to help in the battle."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jules was a human male with brown skin and brown eyes. His dark brown hair was in curls. He was very muscular and broad shouldered from years of hard work on the farm. Jules also knew several languages including Huttese, Ithorian, and Galactic Basic Standard. Jules was very protective of his friends and on a few occasions could get angry to defend them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Julen Rakab is a character developed for the 2019 young adult novel A Crash of Fate, written by Zoraida Córdova."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}