{"url": "Julian_Glover", "categories": ["Category:Real-world articles", "Category:Lego Star Wars: The Empire Strikes Out voice actors", "Category:Star Wars: Episode V The Empire Strikes Back actors"], "nodes": [{"tag": "h1", "text": "Julian Glover"}, {"tag": "p", "text": "Julian Glover CBE (born March 27, 1935) is an English actor who played General Maximilian Veers in The Empire Strikes Back. Subsequent roles also had him in the character of a villain: he continued his work with George Lucas as Walter Donovan in Indiana Jones an the Last Crusade, played the central villain in the James Bond film For Your Eyes Only, and was the voice of the spider Aragog in Harry Potter and the Chamber of Secrets."}, {"tag": "p", "text": "In 1973, he had a role in Hitler: The Last Ten Days, which also starred Alec Guinness and Kenneth Colley. Additionally he also had a role in Indiana Jones and the Last Crusade, in which Michael Sheard played Adolf Hitler and also starred Harrison Ford."}, {"tag": "p", "text": "He's also known to sci-fi fans for appearing twice in the longest running science fiction series Doctor Who, where in 1965 he played Richard the Lionheart in the story The Crusade (of which only episodes 1 and 3 are intact in video form, with the other two only surviving in audio) and in 1979 as the alien Scaroth in the story City of Death. The latter is the highest rated story in the show's history, although that was due to a strike blacking out ITV, the BBC's only rival network at the time. He also provided commentary for the remaining episodes of The Crusade for the Lost in Time Trilogy DVD box set and the City of Death DVD."}, {"tag": "p", "text": "Most recently he played Grand Maester Pycelle in the HBO series Game of Thrones."}, {"tag": "p", "text": "He had a role in Richard Marquand's final film, 1987's Hearts of Fire."}, {"tag": "p", "text": "His son, Jamie Glover, provided the voice of Veers in Star Wars: Battlefront II and Star Wars: Empire at War. Jamie also voiced the Sith Lord Darth Malgus in the Deceived trailer for Star Wars: The Old Republic."}, {"tag": "h2", "text": "Awards"}, {"tag": "p", "text": "Glover was appointed Commander of the Order of the British Empire (CBE) in the 2013 Queen's Birthday Honours for services to drama."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}