{"url": "Julevia", "categories": ["Category:Legends articles", "Category:Dalonbian sector", "Category:Outer Rim Territories stars"], "nodes": [{"tag": "h1", "text": "Julevia"}, {"tag": "p", "text": "Julevia was the star at the center of the Julevian system. Located in the Dalonbian sector of the Outer Rim Territories, it was orbited by five planets and an asteroid belt."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 25 ABY, the extra-galactic Yuuzhan Vong invaded the galaxy through Vector Prime, a hyperspace insertion point into the galaxy located in the remote Dalonbian sector. The Praetorite Vong, the first wave of this invasion, targeted Sernpidal as one of their first conquests, and used a gravity-shifting creature known as a dovin basal to pull one of its moons onto its surface, destroying the planet and destabilizing the Julevian system."}, {"tag": "p", "text": "Not content with the world's destruction, however, the Yuuzhan Vong made plans for Sernpidal's sorry remains. To replenish their fleet of worldships, they used the broken shell of the planet to grow a new one. Shortly after Sernpidal's destruction, New Republic pilot Gavin Darklighter led a reconnaissance mission to the Julevian system to spy on the Yuuzhan Vong. Flying into the glare of Julevia, he was able to gather that the Yuuzhan Vong were using the ruins of Sernpidal to carry out this task, although the New Republic had little idea what the activity was actually intended to accomplish. While the Yuuzhan Vong were building the vessel, a linear accelerator assembly consisting of many dovin basals was used to mine matter from Julevia; this technique was in use as of 27 ABY. Jedi Kyp Durron, desperate to hit back at the invaders for their crimes against the galaxy and the New Republic, purported that this was a new gravitic superweapon, and the worldship was destroyed in a New Republic attack. The dovin basals linking the worldship to Julevia were displaced when the vessel was killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Julevian system first appears in the opening novel of the New Jedi Order series, The New Jedi Order: Vector Prime, by R. A. Salvatore, but its sun is not named. Julevia first appears or, rather, is mentioned briefly in the New Jedi Order novel The New Jedi Order: Dark Tide II: Ruin by Michael A. Stackpole, in which it appears in one sequence and is not named. The sun features more prominently in a later novel in the same series, The New Jedi Order: Edge of Victory II: Rebirth, in which it is slyly used as part of the justification for Kyp Durron's desire, by him, to destroy the Yuuzhan Vong worldship being grown there. Still not referred to by name, Julevia was finally given its designation in The Essential Atlas, published in 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}