{"url": "Julias_Narn", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Force-sensitives", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Julias Narn"}, {"tag": "p", "text": "Captain Julias Narn was a Force-sensitive Imperial Star Destroyer captain who was in command of the Trebodar system."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Julian Narn was raised in a relatively wealthy family, and attended several schools before rebelling against his parents' wishes and joining the Empire. It was here that he really found his calling, as his excellent organizational skills and his ability to command respect from his troops allowed him to quickly raise through the ranks until he was captain of the Star Destroyer Magellan. He was constantly scared that Imperials would discover his secret, that three of his relatives were Jedi Knights who served in the Clone Wars, and had to painstakingly keep this hidden from everyone."}, {"tag": "p", "text": "He was a married man, and his marriage had resulted in him having one daughter. Definitely a family man, he kept them close to him whenever possible, as was evidenced when he moved them to the planet Danton VI when he was stationed there. In contrast to many Imperials, he enjoyed mixing his business with pleasure, and threw many parties and celebrations for any visiting dignitaries or commanders. With excellent social skills, he made many political friends which is possibly one of the reasons he rose through the ranks so quickly. However, knowing so many higher-ups only heightened his fears of being discovered to be descended from Jedi Knights, which he believed could either result in him being looked over for promotions or, worse, being handed over to powerful political figures who would want to do away with the Jedi for good."}, {"tag": "p", "text": "Unfortunately for him, this data was discovered by Rebel agents who were working to rid the Galderian pirates from the Trebodar system. During one of his parties on the political outpost known as the Lunar Station orbiting the planet Danton VI, the Rebels contacted him, with the intent of blackmailing him and his Star Destroyer into helping them so that they could get into the pirate base and recover a stolen antidote shipment that was headed towards Danton VI. As soon as they mentioned that they know of his Jedi heritage, he excused himself to meet with them. Although he knew that the Galderian pirates existed before this time, he had no idea that they were causing trouble to the inhabitants of Danton VI, and so he reluctantly accepted helping the Rebels to rid the system of the pirates, as long as it in no way helped the Rebel Alliance. What the Rebels did not know was that Narn had been looking for a reason to rid the sector of the Galderians anyway. Narn and the Rebels concocted a plan which involved him leading the Magellan into direct combat with the Galderian's ship, the Space ARC, and lead it away from the base while the Rebels sneaked on board the Galderian base to recover the supplies that were stolen, as well as freeing any captives which they found while doing so.\nNothing is known about his future after helping the rebels, although it was known that they never again bribed him with the information of his Jedi heritage."}, {"tag": "h2", "text": "Physical appearance"}, {"tag": "p", "text": "Julias Narn was of average height, with green eyes and hair that was once black, but then began graying."}, {"tag": "h2", "text": "Sources"}]}