{"url": "Jun_Seros_(Jedi)", "categories": ["Category:Legends articles", "Category:Humans", "Category:Jedi Battlemasters", "Category:Jedi Masters of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jun Seros  (Jedi)"}, {"tag": "p", "text": "Jun Seros was a male Human Jedi Master who served the Jedi Order and the Galactic Republic as the Order's battlemaster during the Great Galactic War and the ensuing Cold War. Famed for both his skills with a lightsaber and his unending loyalty to the Jedi and the Republic, he was one of the Jedi Order's leading lights and Masters during the War and the Cold War that followed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Human, Jun Seros was trained in the ways of the Force by the Jedi Order, serving as a Jedi Knight for over a decade. Mastering the arts of warfare along with lightsaber combat without ever striking a blow with an intent to harm. When the reconstituted Sith Empire returned from the Unknown Regions and waged a war across the entire galaxy, Seros was appointed Jedi Master and recognizing the threat, he took his weapon in earnest for the first time in his life. Unlike some of his peers, Seros did not shy away from the war and acted as a general in the Republic Military's armed forces. The Jedi High Council appointed Seros the Order's battlemaster, allowing Seros to train hundreds of Jedi in the field. His strategic genius and bold interventions left him undefeated on every front that he had led."}, {"tag": "p", "text": "The war ultimately ended during the Sacking of Coruscant by the Sith. Forced to sign the Treaty of Coruscant, the Republic's decision was seen as foolishness by Seros, who vocally opposed to honor the document."}, {"tag": "p", "text": "During the time of the Cold War, he continued to war against trusting the Sith to honor the terms of the treaty in the following years. In this era, he served as a vital aide to Supreme Chancellor Dorian Janarus, coming to form a good friendship which he later used to persecute a rising bounty hunter known as the Grand Champion of the Great Hunt."}, {"tag": "p", "text": "Another old friend of Seros's was Jedi Master Kellian Jarro, a famed warrior who personally slew one hundred Mandalorians during the Sacking of Coruscant. Jarro's actions during the sacking earned him the hatred of the Mandalorians, who placed a price on his head. Jarro was later made the final target of the Great Hunt, and the bounty was finally claimed by the competition's champion. Seros, however, began a witch-hunt for the murderer of his old friend."}, {"tag": "p", "text": "Seros first attempted a trap on Quesh, luring the Hunter with a false endorsement from Adascorp. The Hunter, ever the mercenary, arrived, only to learn of the trap and was surrounded by SIS agents. Seros was observing via hologram as the Hunter slaughtered the entire strike team. Seros cryptically promised that he's not done, but the Hunter did not take him seriously and terminates the communication."}, {"tag": "p", "text": "Seros later sent another team led by Adeline Marr to Nar Shaddaa in search of the Hunter. The team confronted the other Grand Champions, Bloodworthy, Jewl'a Nightbringer and Defenestrator, who were planning on hosting a party to celebrate the Hunter's successful Blacklist bounties, but the Champions refused to give up their comrade's whereabouts. The trio were slaughtered, just as the Hunter arrived. Seros, again, was monitoring via hologram and offered the Hunter a last chance to surrender. His terms were refused and the Hunter killed the entire team before swearing to track Seros down and kill him. Seros was unintimidated and vowed that he would make the Hunter regret defying him."}, {"tag": "p", "text": "Following this, Seros framed the Hunter for a mile-long list of false crimes, making the Hunter the Republic's Most Wanted, in an effort to expose the Sith's true colors. Every bounty hunter in the galaxy began gunning for the million credit bounty on the Hunter's head while the Empire severed all ties with the Hunter. But soon afterwards, the Hunter was hired by Darth Tormen, who offered the chance for revenge against Seros and Janarus, who publicly condemned the Hunter."}, {"tag": "p", "text": "The Hunter aided Tormen in subjugating Corellia by capturing rebel leaders and forcing them to sign a treaty dictating Corellia's secession from the Republic. Master Seros knew the treaty was a sham to draw the Supreme Chancellor from Coruscant to ratify it and convinced Janarus that he could rally the Green Jedi against the Sith invasion of the planet. He later encountered his quarry on the same planet. Instead of calling on his fellow Jedi to assist him in arresting the mercenary, he sent them away. He and the Hunter exchanged words before engaging in battle. Despite his skill in the Force, Seros was defeated. As he lay dying, Seros boasted that while he may have failed to arrest the Hunter, he'd at least distracted the Hunter while his compatriots rescued Darth Tormen's captives and tear up his sham treaty. However, he was mistaken, as Tormen slaughtered the entire team of Green Jedi. However, the Hunter refused to let him have the last laugh, revealing that all this was not just to kill him, but to get to the Supreme Chancellor and they both walked into a trap. Realizing what he had done, Seros attempted to rise to his feet, only for the Hunter to kill him."}, {"tag": "p", "text": "Chancellor Janarus would later condemn Seros' actions against the Hunter, stating that he had no right to abuse power and deceive the public for his own personal vendetta."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jun Seros was a deeply committed Jedi Master, who believed in justice and the defiance of the Sith. These showed most heavily during the Cold War, as he refused to believe the Sith would follow the Treaty of Coruscant. This also showed in his dogged pursuit of Corellia's freedom, as he convinced Supreme Chancellor Janarus to allow one last push by the Jedi in order to reclaim the planet. He believed in the power of the Jedi and the overarching power of the light. He also refused to be aided by his fellow Jedi during his final duel, sending them elsewhere to their fates while he faced his nemesis."}, {"tag": "p", "text": "Despite being a Jedi Master, Jun Seros also showed a darker side while pursuing the Grand Champion of the Great Hunt. Consistently believing his nemesis would surrender easily, he murdered others and sent teams of both SIS and Jedi to apprehend her/him. He firmly believed that no criminal should be allowed to get away with murder and should face the repercussions of their actions, although he appeared to have no problem with murdering people who he saw as criminals (namely the other Great Hunt champions). What initially began with devotion to justice became a complete obsession that bordered on falling to the dark side as he constantly hounded his quarry."}, {"tag": "p", "text": "However, in the end, he was a Jedi to the bone, as he believed in sacrificing himself for the sake of Corellia. Among his last words he stated that while he may have failed to kill the Champion, he was successful in undoing everything the hunter had done until then, and would now return peacefully to the Force. He also may have regretted his darker actions, since when the Hunter revealed that Janarus was their next target, Seros realized his pride blinded him and died regretting that he'd led his friend to his doom."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As could be expected of a Battlemaster of a war-time Jedi Order, he was exceptionally skilled in several forms of combat. In his final duel alone, he showed great awareness, being able to freeze a missile shot at point blank range and destroy it. He was able to shield himself from a close-range flamethrower using only the force, after having previously fended off a hail of blaster shots with little effort."}, {"tag": "p", "text": "Following this little flurry, he then ignited a second lightsaber—initiating his skill in Jar'Kai—and brutally assaulted the Grand Champion of the Great Hunt, showing immense connection to the Force as he was able to charge each of his attacks with great power. While this may not have been enough to strike down the Bounty Hunter, he held his own for considerable time against a figure that had slaughtered countless Jedi Knights and Masters on his way into the Green Jedi Enclave."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "After wounding Seros, the player can choose the following dialogue before his death. The player choose to kill him without another word (dark side dialogue). But choosing the two other neutral dialogues leads to other ones. Selecting the neutral dialogue result in Seros boasting that his comrades are heading to the Grand Assembly to free Tormen's captives and tear up his sham treaty. The light side dialogue involves the Hunter pointing out Seros' hypocrisy of the Jedi way of non-attachment resulting in his vendetta. Seros retorts that the Hunter should not get away with murder and should face the consequences of their actions. The dark side dialogue has the Hunter gloat that Chancellor Janarus is next, having used Seros to lure him out. Seros attempts to rise to his feet but the Hunter kills him, mockingly thanking him for his contribution."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}