{"url": "Junior_Academy_of_Applied_Sciences", "categories": ["Category:Canon articles", "Category:Academies", "Category:Capital City locations"], "nodes": [{"tag": "h1", "text": "Junior Academy of Applied Sciences"}, {"tag": "p", "text": "The Junior Academy of Applied Sciences, commonly referred to as AppSci, was an academy in Lothal's Capital City. Zare Leonis, Merei Spanjaf, and Beck Ollet attended the school during the reign of the Galactic Empire several years before the Battle of Yavin. The school was renown for its grav-ball, chin-bret, and track and field events. In addition, Junior AppSci was used by the Academy for Young Imperials to recruit prospective Imperial cadets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "About forty years before Zare Leonis and his family migrated to Lothal, Janus Fhurek played at Junior AppSci's grav-ball team and held the AppSci record for completed passes until an Alien broke it a few years ago. Due to his prowess on the grav-ball grid, Janus earned the nickname \"Fury Fhurek.\" At some unknown point, Fhurek became the school's athletic director. By the Age of the Empire, Junior AppSci was renown in Capital City for its grav-ball, chin-bret, and track and field programs. In addition, the school was used to instill the values of the Empire's New Order among young Lothalian teenagers. The school also served as a recruiting ground for agricultural specialists and Imperial cadets at the Academy for Young Imperials."}, {"tag": "p", "text": "A year before Zare settled on Lothal, Merei Spanjaf moved from Corulag to study at Junior AppSci and subsequently joined the school's grav-ball team, the AppSci SaberCats. That spring, Beck Ollet, a third-generation Lothalian, joined Junior AppSci after his family relocated from the Westhills to settle in Capital City. He joined the AppSci SaberCats and became the team's fullback player. As center striker, Zare led the AppSci SaberCats to victory during a series of matches in the fall and winter seasons. Relations between Leonis and the school's athletic director Fhurek were strained after Fhurek transferred the team's two alien players, Frid Kelio and Hench Sina, to the Technical Institute for Agricultural Research in order to prevent them from competing in the final grav-ball tournament. After Zare sabotage Fhurek's bet that the AppSci SaberCats would win in the final tournament by a margin of eight points, Fhurek excluded him from any spring sports events."}, {"tag": "p", "text": "After graduating in spring, Zare joined the Academy for Young Imperials in an attempt to find his missing sister Dhara Leonis. Meanwhile, Beck Ollet joined a resistance cell but was arrested by Imperial authorities after attempting to blow up a mine. The following year, another former AppSci alumni Merei enrolled at the Vocational School for Institutional Security in order to follow her parents' footstephs as a data-security expert. After witnessing a pair of Junior AppSci girls selling raffle tickets to raise funds for a camping trip, Merei decided to pose as a schoolgirl doing fundraising work in order to infiltrate the Transportation Ministry's headquarters on Lothal as part of her efforts to find Dhara."}, {"tag": "h2", "text": "Curriculum and sports"}, {"tag": "p", "text": "Junior AppSci offered several classes including Current Events, a compulsory course taught by Mister Tralls and multiple agricultural science classes such as Crop Management and nerf-herding. The Academy also had a grav-ball team called the SaberCats, that was coached by the Duros coach Ramset, who was known for his conservative methods. Grav-ball was usually played during the Autumn and Winter seasons. Several known members of the SaberCats included Zare Leonis, Merei Spanjaf, Beck Ollet, Frid Kelio, and Hench Sina. The school also had chin-bret and track and field programs, which were played during the Spring season. Janus Fhurek was the athletic director and wielded more power that the school's headmaster. Fhurek had close connections with the local Imperial Academy in Capital City and helped to identify prospective cadets."}, {"tag": "h2", "text": "Campus"}, {"tag": "p", "text": "The Junior Academy of Applied Sciences was based in Lothal's Capital City. Besides classrooms, it hosted facilities for grav-ball practices and other sports like chin-bret and track and field programs."}, {"tag": "h2", "text": "Faculty and alumni"}, {"tag": "h2", "text": "Students"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}