{"url": "Junior_Jedi_Knights:_Vader%27s_Fortress", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Junior Jedi Knights"], "nodes": [{"tag": "h1", "text": "Junior Jedi Knights: Vader's Fortress"}, {"tag": "p", "text": "Junior Jedi Knights: Vader's Fortress is a Star Wars Legends junior novel written by Rebecca Moesta. It is the fifth, penultimate installment of the series Star Wars: Junior Jedi Knights, and it was first published on July 1, 1997 by Berkley Boulevard."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Anakin Solo is now eleven—and headed for the Jedi academy! The Force is very strong with him—he can feel it. And his uncle Luke thinks it is time for him to start his training…"}, {"tag": "p", "text": "Anakin and his friends just heard an incredible secret! Darth Vader may have retrieved Obi-Wan Kenobi's lightsaber from the original Death Star. The lost weapon may be hidden in Vader's abandoned fortress on the planet Vjun, and Luke Skywalker agrees that it must be recovered."}, {"tag": "p", "text": "Now Anakin and his friends—along with Tionne and the Jedi Master Ikrit—are heading off to Vjun to find the legendary fortress. Untold dangers await them, for no one knows what secrets still lie within those ancient walls. Even abandoned, it is a stronghold of dark power."}, {"tag": "p", "text": "But the biggest danger may not have shown its face. For if they know about Obi-Wan's saber…who else does?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin, Tahiri Veila, and Uldir Lochett are waiting at the landing field at Yavin 4 for Tionne to return from her recent trip. Tionne returns in her new ship, the Lore Seeker, with news that a Hutt information broker on Borgo Prime told her that Obi-Wan Kenobi's lightsaber was in Darth Vader's Bast Castle on Vjun. Anakin's uncle Luke had to return to Coruscant for a special meeting with the Chief of State, Leia Organa Solo. So, he allows Anakin, Tahiri, Uldir, and R2-D2 (Artoo) to go with Jedi Masters Tionne and Ikrit in his stead."}, {"tag": "p", "text": "On the flight to Vjun, Tionne taught the children about lightsabers. They learn that a Jedi Master waits until a student is mature enough and has enough skill in the Force before beginning lightsaber training. Jedi also spend weeks hunting down the right parts to construct their own sabers. Ikrit revealed that he does not carry a lightsaber anymore because 500 years ago, he nearly killed a friend with his lightsaber over a petty disagreement. It was only thanks to Master Yoda's intervention that no one got hurt."}, {"tag": "p", "text": "Tionne piloted the Lore Seeker down to the base of the rocky spire which Bast Castle sat atop of while Ikrit used the Force to keep the ship steady against the violent storms on the planet. After they landed, Tahiri spotted an old cargo shuttle hidden nearby. The group climbed an old stairway around the rocky spire, facing strong winds and rain, until they eventually reached the rear entrance to Bast Castle."}, {"tag": "p", "text": "Recklessly, Uldir marched into the grand entrance hall which set off a series of automated Laser turrets. Artoo managed to reflect the laser blasts back so that the children could get to the controls. Tionne entered the fray too, blocking lasers with her lightsaber. Artoo was hit by a couple of laser blasts as he joined the children at the controls and managed to shut off the lasers."}, {"tag": "p", "text": "The group began to explore Bast Castle, eventually splitting up to cover more ground. Tahiri and Uldir stumbled across multiple holographic traps. As everyone regrouped near the traps, Anakin used his Jedi senses to detect a hidden door built into the wall. He put his hand against and spoke his name, asking the door to open. Inside of the small room was Obi-Wan's lightsaber. Suddenly, the Mighty Orloc, Mage of Exis Station, appeared and snatched the lightsaber away. He activated a trap on the wall, causing Tionne and Ikrit to slide down a chute hidden beneath a trapdoor. Orloc then disappeared in a flash of light and white smoke."}, {"tag": "p", "text": "The children and Artoo chase after Orloc deeper into the Castle, eventually splitting up. Anakin and Tahiri climb higher in the castle and found Vader's private chambers which held a hologram of a younger Luke Skywalker. Meanwhile, Uldir leaves Artoo behind because he feels like the droid is moving too slowly. Uldir finds Orloc in the hangar bay. Orloc realizes that Uldir is not a Jedi and tempts the young man to join him. Orloc says that he will teach Uldir how to become more powerful than a Jedi through an easy method that requires little effort. Finally, Orloc reveals that he is truly at Bast Castle because he is after the Holocron in Vader's private chambers. Uldir wavers in indecision as to whether or not to join Orloc. Orloc pushes him for an answer, saying that he will kill Uldir if he refuses."}, {"tag": "p", "text": "Anakin and Tahiri end up on a walkway above Uldir and Orloc. Anakin distracted Orloc while Tahiri slid down a pole to reach the hangar bay below. She tried to use the Force to pull Obi-Wan's lightsaber from Orloc's grasp but fails to do so. Soon after, Tionne, Artoo, and Ikrit all arrive in the hangar. Orloc was ready to attack Tionne with the lightsaber when Anakin told Artoo to use a high-frequency blast to distract Orloc. As Orloc turned to look for the noise, the lightsaber was yanked out of his grasp. Orloc swiftly disappeared in a puff of smoke."}, {"tag": "p", "text": "Anakin and Tahiri led the group back up to Vader's private chambers. Anakin uses a voice command to unlock a small storage safe and retrieves the Holocron hidden there. The group tests it out, but it is quickly hidden by gray smoke. Orloc stole it and quickly ran away. The group gives chase, dodging trap doors that Orloc opens to slow them down. Artoo managed to swing a pair of doors shut in front of Orloc, causing Orloc to fall down into a large pit he had just opened up. The Holocron flew out of his hands and Uldir managed to safely catch it."}, {"tag": "p", "text": "The group returned to the hangar bay and Ikrit piloted them down to the Lore Seeker in an old ship. Anakin told Ikrit to keep Vader's old ship and to fly it back to Yavin 4 with them. Ikrit decides to name the ship the Sunrider after Nomi Sunrider, another Jedi who was very reluctant to use a lightsaber. Split up between the Lore Seeker and the Sunrider, everyone flew back to Yavin 4 with Obi-Wan's lightsaber and the Holocron safely retrieved."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}