{"url": "Junior_Jedi_Knights:_The_Golden_Globe", "categories": ["Category:Real-world articles", "Category:Star Wars: Junior Jedi Knights"], "nodes": [{"tag": "h1", "text": "Junior Jedi Knights: The Golden Globe"}, {"tag": "p", "text": "The Golden Globe is the first book in the Star Wars: Junior Jedi Knights series."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Publisher's summary"}, {"tag": "p", "text": "Anakin Solo is now eleven—and headed for the Jedi academy! The Force is very strong with him—he can feel it. And his uncle Luke thinks it is time for him to start his training…"}, {"tag": "p", "text": "On his first day at the Jedi academy, Anakin makes a new friend named Tahiri. The Force is with her too. Soon they find out that together they can accomplish feats that surprise even their teachers."}, {"tag": "p", "text": "But the teachers don't know what else Anakin and Tahiri do together. Every night, they both have the same dream of going down the river by the Academy on a raft. In the dream, they are drawn by the Force…but for all they know, it could be the dark side!"}, {"tag": "p", "text": "There is only one way to find out for sure. They have to go down the river all by themselves—for real!"}, {"tag": "h3", "text": "Plot summary"}, {"tag": "p", "text": "Anakin Solo arrives on Yavin 4 on the eve of classes starting at the Jedi Praxeum. Luke Skywalker welcomes him, and he meets another student named Tahiri."}, {"tag": "p", "text": "That night Tahiri has a nightmare about traveling in a raft down a river on Yavin 4, but then falling out of the raft and starting to drown. It is a recurring dream for her and she now recognizes the location as the jungle moon she is on. A new part of the dream is the appearance of Anakin."}, {"tag": "p", "text": "In the morning Tahiri tells Anakin about her dream, and his presence in it. Tahiri suggests the two off them sneak off and raft down the nearest river, but Anakin declines. They then go to classes which covers levitation of objects. That night, Tahiri rests peacefully, while Anakin is now plagued by the nightmare that Tahiri had been having (but from his perspective, watching Tahiri start to drown)."}, {"tag": "p", "text": "Come morning, Anakin has changed his mind and agrees to raft down the river with Tahiri, but they need to plan a way to sneak out of classes to do so. They then attend classes, but begin planning for the next day."}, {"tag": "p", "text": "Anakin starts to hear a voice telling him where to find a raft, and how to sneak out of the temple. He feels the voice is coming from an old Jedi Master. He falls asleep and has the nightmare once more, but this time Artoo is there as well. The next day, he and Tahiri attract Artoo's attention, then sneak out of the Praxeum with the droid, doing as the voice Anakin hears instructs them."}, {"tag": "p", "text": "However, once they are all on the raft, a storm suddenly appears, and Tahiri is tossed from the vessel. Unable to swim and caught in the rolling waves, Tahiri starts drowning. Fortunately, Anakin is able to save her with Artoo's help. They jump to the shoreline and levitate Artoo to them."}, {"tag": "p", "text": "Trying to find shelter in the storm, they stumble upon the Woolamander Temple. Tahiri goes exploring and finds a stairwell leading down. Anakin warns her not to go down there, but she ignores him. Feeling the need to stay with her, Anakin follows, leaving Artoo behind."}, {"tag": "p", "text": "They eventually stumble onto a chamber with Massassi writing and a large golden globe in it. Anakin and Tahiri feel pain and agony of trapped people coming from within it. They then see a small creature at the base of the globe. They wake it up, and it starts saying 'Ikrit' again and again."}, {"tag": "p", "text": "They can't get close to the globe though, and when Anakin checks the time and realizes that he and Tahiri have been gone for far too long, they leave the globe behind and head back up the stairs with Ikrit, and then back to the Praxeum since the storm is over."}, {"tag": "p", "text": "Luke is waiting for them and they get into some trouble, and are sent to the dormitories. That night Ikrit comes to Anakin's room and explains that he is a Jedi Knight and arrived on Yavin 4 four hundred years previously. He couldn't do anything about the golden globe, so went to sleep until someone who could help would arrive."}, {"tag": "p", "text": "He tells Anakin that the problem with the golden globe can only be solved by a child, so he and Tahiri must not tell Tionne or Luke about it. Anakin agrees to help, and to keep it a secret."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}