{"url": "Junior_Jedi_Knights:_Anakin%27s_Quest", "categories": ["Category:Real-world articles", "Category:Star Wars: Junior Jedi Knights"], "nodes": [{"tag": "h1", "text": "Junior Jedi Knights: Anakin's Quest"}, {"tag": "p", "text": "Anakin's Quest is the fourth book in the Star Wars: Junior Jedi Knights series. It contains a nine page preview of the next book in the series, Vader's Fortress."}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Anakin Solo is now eleven—and headed for the Jedi academy! The Force is very strong with him—he can feel it. And his uncle Luke thinks it is time for him to start his training…"}, {"tag": "p", "text": "Anakin has been having terrible dreams of a secret cave on Dagobah. He asks his uncle Luke if he can go there, to see if it's real. Luke says yes—but only if Tahiri, R2-D2 and the Jedi Master Ikrit go along."}, {"tag": "p", "text": "Anakin and his friends find more danger than they bargained for in the swamps of Dagobah. But they do find the cave. What is inside? And will Anakin be strong enough in the Force to face it?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin Solo has nightmares of Darth Vader and Emperor Palpatine trying to lure him over to the dark side. Anakin is filled with self-doubt about whether or not he will make good choices and questions if he will fall to the dark side like his grandfather. He goes to his uncle Luke for advice and he tells Anakin about his encounter with the dark side in the Dark Side Cave on Dagobah. Anakin decides that he wants to go to this cave too to confront his fears."}, {"tag": "p", "text": "When Anakin and Tahiri Veila are helping Peckhum unload supplies from his ship, the Lightning Rod, they discover that a teenage boy named Uldir Lochett had stowed away on the ship. He ran away from home, not wanting to be a cargo pilot like his parents, so he could go to the Jedi academy and become a Jedi. Luke tests Uldir but finds that the Force is not strong in him and that he does not have the potential to become a Jedi. Uldir is insistent and Luke reluctantly allows him to stay at the academy after he gets permission from his worried parents."}, {"tag": "p", "text": "Jedi Master Ikrit convinces Luke that he will take Anakin and Tahiri to Dagobah to visit the Dark Side Cave. The three of them leave with R2-D2 and Peckhum. Uldir, despite being told that he cannot go, stowed away in the hold of the Lightning Rod. When they land on Dagobah, Uldir tried to sneakily slip off the ship but he tripped and got caught in the muck of the swamp. Everyone comes and saves him. Ikrit decides to allow Uldir to join them on their quest. However, Uldir does not initially believe that Ikrit is a Jedi Master because he does not fit his imagined image of what a Jedi should be. Reluctantly, he joins the group."}, {"tag": "p", "text": "After a trek through the swamp and a brief lesson, Ikrit has the three children take turns guiding them back to the Lightning Rod. Tahiri leads the group first, followed by Anakin. Uldir believes that they are going too slow and decides to arrogantly lead them through the last third of the trip back. He nearly leads them into the sharp web of a Butcherbug, which would have killed them. It was only through a warning in the Force that Anakin, Tahiri, and Ikrit managed to stop him in time."}, {"tag": "p", "text": "The quartet resupply at the Lightning Rod and then set off for the Dark Side Cave. On the trip, they encounter a Spotlight sloth. Though Anakin and Tahiri sense danger ahead, Uldir mocks them as the Spotlight sloth does not appear to be dangerous. Suddenly, a Knobby white spider appears and poisons the Spotlight sloth before eating it. The quartet flee from the creature and continue on their journey to the cave."}, {"tag": "p", "text": "When they reach the cave, Uldir is unimpressed with it. He insists on entering the cave first. He finds nothing inside but still feels very unnerved. He quickly leaves the cave and chastises Tahiri and Anakin for still wanting to go in. Tahiri enter the cave next. She sees visions of her parents on Tatooine, and then a scene of her grandfather who she discovers was a Jedi Knight. Tahiri then suddenly found herself outside of the cave."}, {"tag": "p", "text": "Anakin enters the cave last. Inside, he finds it divided in half: a light side and a dark side. Two figures appear: a Light Jedi and a shadowy figure who begins shooting blue lightning from his fingertips at the Light Jedi. Anakin throws himself in between the two figures and commands them to stop. As he looks at both of them, Anakin realizes that both figures have his face."}, {"tag": "p", "text": "Back at the camp, the three children contemplate their experiences. Ikrit offers the advice to all of them that it is your choices that determine who you are, not who raised you or who your family is. Before they can leave the planet, Ikrit reveals that he has a quest of his own on Dagobah that he must complete. The quartet set off for Yoda's Hut where Ikrit reveals that it was Yoda who first found him and trained him as a Jedi. Ikrit takes the opportunity to mourn his old master."}, {"tag": "p", "text": "Back on Yavin 4, each of the children have private meetings with Luke and Tionne Solusar to discuss their experiences. Later, Uldir asks Anakin and Tahiri if they think he will ever become a Jedi. They tell him that they do not know but they will help him out on his quest regardless. Uldir stubbornly believes that he can become a Jedi. He thinks that as long as he has the right equipment, training, and the same opportunities as Anakin and Tahiri that he can become a Jedi. As long as he looks and acts that part, he believes he will succeed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}