{"url": "Anno_Wen-Chii", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Males", "Category:Post-Ruusan Jedi Masters", "Category:Pyn'gani"], "nodes": [{"tag": "h1", "text": "Anno Wen-Chii"}, {"tag": "p", "text": "Anno Wen-Chii was a reclusive Pyn'gani Jedi Master who lived near the end of the New Sith Wars. In 995 BBY, he and his Padawan, Nalia Adollu, went to his homeworld, Polus, to study life-forms; they were not seen on Coruscant for the next five years. Wen-Chii was a good friend of the Jedi librarian Barra-Rona-Ban, with whom they had studied together."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Anno Wen-Chii was a Force-sensitive male Pyn'gani from the Outer Rim planet Polus who lived around the end of the New Sith Wars. Wen-Chii was discovered and trained by the Jedi Order, eventually reaching the rank of a Jedi Master before 1000 BBY. Sometime during his life as a Jedi, he studied with his friend, the Jedi librarian Barra-Rona-Ban and they visited Polus together. After the Battle of Ruusan, Wen-Chii took the Human female Nalia Adollu as his Padawan and chose to eke out a simple life on his homeworld. Having returned to Polus in 995 BBY, Wen-Chii studied the native species, hoping to find out how life had evolved in the galaxy and how it continued to evolve through thousands of years. The at least five-year absence of him and his Padawan from the Jedi Temple on Coruscant allowed the Sith Lord Darth Zannah to use the name of Adollu to infiltrate the Temple in order to research some information for her master, Darth Bane. Zannah was able to fool Barra-Rona-Ban, who had become keeper of the Jedi Archives, and find the information."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Wen-Chii was a reclusive Jedi who chose to live on his homeworld for scientific studies. He was also friends with fellow Jedi Knight Barra-Rona-Ban."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Wen-Chii possessed the knowledge and the skills required to become a Jedi Master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Anno Wen-Chii was first mentioned in the 2007 novel Darth Bane: Rule of Two, written by Drew Karpyshyn. He later received an entry in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}