{"url": "Junker_(YT-2400_light_freighter)", "categories": ["Category:Legends articles", "Category:Captured starships", "Category:Smuggler and fringer starships", "Category:YT-2400 light freighters"], "nodes": [{"tag": "h1", "text": "Junker (YT-2400 light freighter)"}, {"tag": "p", "text": "The Junker, originally known as Blackstar, was a modified YT-2400 light freighter with a Starhawk shuttle instead of an escape pod and a power crystal that could burrow through deflector shields, although the starship was armed with no other weapons. It also featured two military grade universal docking rings and a short range tractor beam array on its rear. The ship was owned by Reegas Vance, but was taken by Khedryn Faal and Marr Idi-Shael, who used it for salvaging operations. In 41.5 ABY, Jedi Knight Jaden Korr enlisted the aid of Junker's crew to resolve a Force vision he had received. This led them to take on a Sith dreadnought from 5000 BBY, the Harbinger, and track down a group of dangerous Force-sensitive clones to an ancient Rakatan space station."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Junker was a YT-2400 light freighter heavily modified by the criminal Reegas Vance. He armed it with plasma cannons, and replaced the escape pod port with a Starhawk shuttle, the Flotsam, located on the starboard side. Under Khedryn Faal, Junker no longer had plasma cannons, and was equipped with an amplified sensor array and remote start. On the stern of the ship a short-range tractor beam array and military-grade universal docking ring were installed. While Junker was not equipped with any weapons, it had a power crystal attached on the beam projector, however it used a lot of power. The interior of the ship was lined with safety rails, wall-mounted emergency equipment cases, and contained a passenger berth which was converted into a rudimentary medbay. Deflector shields were also equipped, but were not strong enough to last more than a single hit in a dogfight."}, {"tag": "p", "text": "The galley, located in the center of the ship, contained a custom viewport in the ceiling, a metal table with benches, and a bar with built in cabinets on one of the walls. In a room located near the galley where racks where crew members and passengers could sleep. The cockpit utilized metal shields which were able to slide down over the viewports. The hold of the ship held a Searing swoop bike, a speeder bike, two landspeeders, and several containers of electronics and assorted scrap until it was all destroyed on the Harbinger, an ancient Sith dreadnought from 5000 BBY. After Massassi warriors had boarded Junker in the Harbinger's hangar bay, a cooling rod had to be used to prop open the cockpit door. Faal disliked droids, and did not allow them on his ship. However, he made an exception for Arsix, the astromech droid of Jedi Knight Jaden Korr. A subspace transceiver was also installed in an auxiliary communications room to communicate across light-years, and an external loudspeaker allowed the crew to communicate with beings outside the ship from within the cockpit."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Encounter in space"}, {"tag": "p", "text": "While Khedryn Faal and Marr Idi-Shael were salvaging a derelict ship in the Unknown Regions, the criminal Reegas Vance and his crew emerged from hyperspace in the Blackstar to take the wreck from them. The Blackstar fired on Faal and Idi-Shael's ship, the Seeker, before hailing the two to tell them that he was taking the derelict, as well as their ship. After disabling the engines, rigging the deflectors to prevent a scan for their life signs, and donning hardsuits, Faal and Idi-Shael launched an escape pod and climbed out onto the hull of the Seeker. The Blackstar destroyed the empty escape pod, and its Starhawk shuttle left with Vance and three armed members of his crew to take the Seeker."}, {"tag": "p", "text": "While Vance and his crew boarded the Seeker, Faal and Idi-Shael used their hardsuits to push off the hull of the Seeker. Once Vance noticed the two hardsuits were missing from the Seeker, he ordered a crewman remaining on the Blackstar, Marden, to disable the derelict's engines to prevent Faal and Idi-Shael from escaping. However, the two had headed to an external airlock on the Blackstar's hull, and used a hatch cracker to board it. After killing one of the Blackstar's crew members, Verra, in the airlock, Faal grabbed his comlink as they went to the cockpit. Faal hailed Vance, and told him to get his crew out of the Starhawk, before Idi-Shael fired the Blackstar's cannons and destroyed the shuttle. With Vance and his remaining crew stranded on the Seeker with no engines, Faal declared that the Blackstar was his. Before leaving the system through hyperspace, Faal turned to Idi-Shael and suggested they call their new ship Junker."}, {"tag": "h3", "text": "Fateful sabacc game at The Black Hole"}, {"tag": "p", "text": "While on the planet Fhost in 41.5 ABY, Faal was fine tuning Junker's systems when Idi-Shael reminded him of a sabacc game, which included Reegas Vance, in progress at The Black Hole cantina. Faal got on his Searing swoop and made his way into the settlement of Farpoint to join the sabacc game. In the cantina, a bearded Human male blocked Faal's path in an attempt to talk, but Faal told him to wait until after the game had finished. The bearded man turned out to be the Jedi Knight Jaden Korr, who was looking to hire Junker's crew. After a dispute with Vance over the outcome of the game, in which Korr used the Force to affect the hand while Vance or one of his men were using an electronic cheater, Korr helped Faal and Idi-Shael escape the cantina."}, {"tag": "p", "text": "As they neared Junker's hangar, Faal ordered Idi-Shael to remotely prepare the ship to launch. Faal offered to drop Korr off at his Z-95 Headhunter and rendezvous in orbit, but Korr preferred to stay with Faal and Idi-Shael. The Jedi Knight also offered the services of his astromech droid, Arsix, but Faal responded that he does not like droids, and never allows them on his ship, so Korr gave the droid orders to orbit Fhost's largest moon and contact Grand Master Skywalker if the droid hadn't heard from Korr in two weeks. At the hangar, Faal told Idi-Shael to head to the cockpit to continue preparing the engines while he and Korr would load the speeders into Junker's packed hold. Once the speeders were secured, Faal and Korr went to the cockpit where Idi-Shael was at the controls, ready to take-off. Faal commed Farpoint Tower to announce they were leaving Fhost, and flew Junker through the atmosphere before hearing a response."}, {"tag": "h3", "text": "New job"}, {"tag": "p", "text": "Once in space, Faal, Idi-Shael, and Korr headed to the galley, and after making cups of caf, discussed their destination, and the reason why Korr wanted to hire them. Korr told the pair that he wanted the coordinates that they received in a transmission. Faal had also used a data crystal with the coordinates as collateral in the sabacc game with Reegas Vance. They had received the coordinates after having to travel out of their way while returning to Fhost from a situation that had gone wrong, and picked up an encrypted signal in a remote system. After Korr asked if the system had a frozen moon orbiting a blue, ringed gas giant, the pair described that it did."}, {"tag": "p", "text": "Korr offered to pay two thousand credits before leaving for the frozen moon, and seven thousand after he confirmed it was indeed the moon from his vision. Faal and Idi-Shael said that amount was not even enough to cover operating costs, and said Korr's quest sounded like a grand Jedi scheme. The Jedi Knight believed that he had seen the frozen moon in a vision given to him by the Force back in his apartment on Coruscant, and that it might have consequences for the Jedi Order, but he had not told anyone else what he had seen. After discussing Korr's reasons for the coordinates, Faal presumptuously accepted Korr's offer to pay five thousand credits up front, which Korr later agreed to. While prepping for the jump to hyperspace, Faal chewed a piece of chewstim, a ritual of his, Idi-shael did all the calculations for the jump, and a weary Korr headed to the racks behind the galley to grab some sleep during the three jumps it would take to get to the moon."}, {"tag": "h3", "text": "Arrival at the moon"}, {"tag": "p", "text": "Idi-shael woke Korr up before they emerged from hyperspace and went to the cockpit. Upon leaving hyperspace, the three saw a blue gas giant surrounded by a large ring of ice and rock around the equator. The sensors revealed no other ships in the system, but they would have to hurry as they had no idea how long it would take Reegas Vance to get to the system. As the frozen moon came into view around the side of the gas giant, Faal said they would have to take Flotsam down to the planet instead of landing Junker on the planet. As Idi-shael was about to prepare envirosuits, the proximity alarm started beeping; an unknown ship was coming in from out of the system very fast."}, {"tag": "p", "text": "The ship was giving off an odd signature but was large, big enough to be a cruiser, and was completely unknown to either Faal, Idi-shael, or Korr. The arrival of this new ship made Korr feel nauseous, appear visibly sick, and caused him to have to sit down, where he started sweating, and Force lightning started to discharge on his fingertips. Idi-shael was also affected by the arrival of the ship, however not as much, and he simply squinted as if he was looking into a bright light. The ship did not attempt to hail Junker, although it was heavily damaged, but sensors read that there was still a lot of living crew members onboard. It was then that Korr determined why he was feeling sick—the dark side, and a ship full of Sith."}, {"tag": "h3", "text": "Meeting Relin"}, {"tag": "p", "text": "After the revelation of a cruiser full of dark side using Sith, something had attached itself to Junker's port docking port; someone had boarded the ship. Korr immediately activated his lightsaber's green blade, and sprinted back to the docking port with Faal. Over Faal's comlink Idi-shael informed them that the cruiser had stopped, but had still not scanned Junker. Arriving at the docking port, Korr saw through a viewport an unknown small sphere, what he thought could be an escape pod, attached to the ship. An explosion rocked the ship, and from the breach an armored Human male came through, wielding a green lightsaber attached to a power pack on his waist by a cable."}, {"tag": "p", "text": "The intruder was not wearing armor, but rather a black flexsuit cut off below the left elbow, along with his arm. Faal fired his blaster at him, but he used his lightsaber to deflect the shots into the surrounding bulkheads. Korr warned Faal to stay back, and engaged the intruder in a lightsaber duel. After using a Force augmented kick against the intruder, cutting a groove into one of Junker's bulkheads, and continued lightsaber combat, Korr could not place the intruder's fighting style. Faal thought he had a clear shot, and tried to fire at the intruder, but the intruder lifted his stump and used the Force to disarm Faal, who then smashed upon an emergency tool bin and retrieved an ax and hand sledge."}, {"tag": "p", "text": "For a time, Korr and the intruder stared each other down, each using the Force to get a sense of the other. Throughout the duel Korr had not felt the presence of the dark side pressing on his mind, which he expected to dueling a Sith, and now he knew why; the intruder was not a Sith, but a light side user. The man removed his helmet, and Korr realized the intruder was a Jedi. Further questioning revealed that the intruder was named Relin Druur, a Jedi Master. Master Skywalker had not sent Druur on his mission, however, and had never even heard of him. He was sent on a mission by Master Nadill, and had to get back aboard Harbinger to prevent it from delivering its shipment. Druur was, in actuality, a Jedi Master from five thousand years before, and the Harbinger was supposed to deliver its Lignan ore to Naga Sadow's forces at the Battle of Kirrek."}, {"tag": "h3", "text": "Attack of the Sith"}, {"tag": "p", "text": "By the time Druur, Faal, and Korr reached Idi-Shael in Junker's bridge, Harbinger had unleashed sixteen Blade-class starfighters. Faal told Idi-Shael to plot a jump to leave the system, and the Sith starfighters, but both Jedi said no; Korr had to investigate the frozen moon, and the source of the distress call, while Druur had to stop Harbinger. Faal pointed out that the Harbinger had already failed in bring its cargo to Kirrek, and that the moon would still be there for them to come back to. Korr suggested hiding in the rings of the gas giant, as Harbinger's sensors would not be able to detect them, and no starfighter would follow them. However, Harbinger and the fighters were under the command of Druur's former Padawan, the Kaleesh Sith Saes Rrogon, and he would not simply let Druur escape him. While Junker had no ship-to-ship weapons, Druur decided to head to the rear, to use the tractor beam mounted there, and Korr would pilot the freighter using the Force for additional guidance."}, {"tag": "p", "text": "Typically, the tractor beam was only used for towing derelicts, but Druur planned to use it as a makeshift weapon, while alerting Korr so he could compensate for the drag. As Junker entered the ring, Faal had Idi-Shael disengage Druur's escape pod to make it easier for Korr to traverse the ring. While the Blades were essentially floating laser cannons, with minimal shields, Junker was a salvage ship, with nothing in the way of deflectors strong enough to defend against the Blades, and with the risk of the floating rocks and ice, Faal had Idi-Shael increase the power to the forward deflector. Junker was pelted with small rocks and ice against the deflector, which caused no damage, but the Blades followed behind, firing green lines of energy from their laser cannons."}, {"tag": "p", "text": "Shortly after entering the ring, one of the Blades hit a chunk of rock, which caused it to wildly spin out of control until it crashed into another rock and exploded. As they went deeper into the ring, the chunks of ice and rocks grew larger, and a second Blade crashed into one and exploded. Korr wasn't seeing the ice and rocks outside the viewport, but rather feeling them through the Force, which had allowed him to act without thinking. When he flew Junker out of the rings for a moment before turning back in, the internal compensators were not able to adjust quickly enough and caused Faal some uneasiness. Druur then alerted Korr that he would next use the tractor beam to starboard, which allowed Korr to adjust for it, and pulled on a large planetoid for a few seconds. This pulled the planetoid from its orbit in the ring, and started a chain of collisions with two more chunks of rock, and resulted in the two lead Blades being destroyed."}, {"tag": "p", "text": "After a large rock exploded near the back of Junker, and caused particles to hit the ship, Druur used the tractor beam on one of the Blades. While the drag this produced slowed Junker down, and crashed it into a rock, and destroyed another Blade in the process. Junker's lights flickered as laserfire hit its port side, and Faal formed a plan, but Korr had to first leave the sightline of the pursuing Blades. Faal planned to space the contents in Junker's hold, which he hoped would then crash into the chunks of rock and ice and explode, and make the Blades pilots believe Junker was destroyed. Druur handed Faal two mag-grenades to attach to the speeders in the hold."}, {"tag": "p", "text": "Korr accelerated, twisted, and turned Junker hard enough to make the ship's chassis creak because of the strain. After attaching the mag-grenades to two speeders in the hold, Faal uncoupled the speeders, and opened a container with loose electronics as the hold was about to vent. Once the Blades were lost, Idi-Shael vented the cargo hold, and the two speeders slid out and exploded on a part of the ring. Faal's plan had worked, with the Blades no longer following them, so he had Korr land Junker on a big enough chunk of the ring."}, {"tag": "h3", "text": "Run or fight"}, {"tag": "p", "text": "On an asteroid in the ring, Faal checked the cargo hold; both his Searing swoop and Idi-Shael's speeder bike were fine. Druur and Faal met in the galley, where Faal noticed the Jedi was suffering from radiation poisoning, as well as injured ribs and arm. Once all four onboard Junker were in the galley, Faal informed them Junker was his ship, and he was no longer going to risk it on a salvage job. Faal discussed with the other three, and Korr and Druur both implored that everything that had happened could not have been merely chance. Druur reasoned that even though he hadn't stopped to receive medical aid, or even pain relief, he would not until he accomplished what had to be done."}, {"tag": "p", "text": "To further prove his point that events were not controlled by chance, Korr informed Idi-Shael that he was Force-sensitive. Idi-Shael had plotted Junker's hyperspace route without the navigation computer, and had unknowingly been influenced by the Force. Korr told Druur that he would accompany him to the Harbinger, as its cargo of dark side enhancing Lignan ore was more important, but Druur told him that since Korr was not able to conceal his presence in the Force, it would not work. It was decided that Idi-Shael would go with Druur to the Sith dreadnought. Meanwhile, Faal and Korr would go down to the frozen moon in the Flotsam to investigate the distress signal, for an additional five thousand credits on top of what Korr and the Jedi Order were set to pay for the job."}, {"tag": "p", "text": "Druur planned for Idi-Shael to fly him onboard the Harbinger in Junker. Since Rrogon had not used the Harbinger's weapons to destroy Junker with Druur onboard, and had instead deployed the Blade starfighters, Druur reasoned that the dreadnought's weapons must have been disabled. Harbinger still had shields, however, so Idi-Shael said they could use Junker's power crystal to rupture a hole in the dreadnought's shield, and enable Junker to land inside. Idi-Shael was not going to stay onboard Harbinger long, and was to leave the ship and jump away, with Druur stating he would use an escape pod again. Druur and Korr talked after the others had left, and Korr wanted Druur to promise to get both Idi-Shael and himself off Harbinger, but all he said was that he would ensure that Idi-Shael would survive."}, {"tag": "h3", "text": "Assault on the Harbinger"}, {"tag": "p", "text": "Before the crew split up to complete their missions, Faal ordered the others to meet in the galley, where he made a toast to their success. Faal and Korr then disengaged the Starhawk shuttle from Junker, and started to fly to the frozen moon. Idi-Shael, after calculating the time it would take for Faal and Korr to reach the frozen moon, set a countdown timer for one standard hour, seventeen minutes, and thirty-sic seconds. The Cerean and ancient Jedi then prepared to fly slowly through the ring, and come out of the ring close to the Harbinger. When they reached the edge of the ring, Idi-Shael did the calculations and realized that it would take them one minute to fly through the space between the ring and the Harbinger, too much time to be safe, especially when taking into account the Blades. To bridge the gap in less time, Idi-Shael decided to attempt something unheard of to either him or Druur – make a very short jump to hyperspace between the gravity well of the gas giant and the frozen moon."}, {"tag": "p", "text": "As the countdown timer finished, Idi-Shael finished the calculations for the short jump, and prepared to engage the hyperdrive. In an instant Junker went from the edge of the ring to the Harbinger. Idi-Shael powered down all of Junker's systems, which made the ship dark and lowered the temperature, and turned on the power crystal array. A red beam of light shot from Junker, towards the Sith dreadnought and connected with its shields in a pattern of red spiraling lines. With a portion of the Harbinger's deflector shield down, Junker coasted toward the illuminated landing bay."}, {"tag": "p", "text": "Once inside the dreadnought, Idi-Shael powered Junker back up, and turned on the repulsors. He flew the ship towards the landing bay as Druur formulated his plan of attack. Druur instructed Idi-Shael to land the freighter blocking one of the corridors into the landing bay. In order to successfully block the corridor, however, they had to land on the freighter's belly and without landing gear, so that the Sith would not be able to simply walk underneath."}, {"tag": "p", "text": "After landing, Idi-Shael lowered metal shielding over Junker's viewports to protect the freighter from small arms fire. He and Druur then headed to Junker's port cargo bay. As the bay doors lowered, Druur told him that Idi-Shael to leave if he was not back in five minutes. A blaster shot came through the doors as they lowered and impacted on the inside of Junker's cargo bay walls. More shots followed them, but were deflected by Druur using his lightsaber, before he ran out of the freighter and onto the Harbinger. Idi-Shael watched Druur fight the Sith's Massassi security, until Druur told him to seal Junker. Instead, Idi-Shael hopped on Faal's Searing swoop, and left Junker's cargo bay to aid Druur."}, {"tag": "p", "text": "Idi-Shael returned to Junker after Druur told him to, and the Jedi revealed that he did not plan to leave Harbinger. As he headed towards the freighter's cockpit, Idi-Shael saw that the caf pot in the galley had fallen over in the rough landing. The caf would not have been dripping for too long though, so Idi-Shael realized that someone had boarded the ship, which was confirmed when he heard someone moving onboard the ship. He his in one of the crew quarters to collect his thoughts before he left to retrieve an oxygen kit and vac suit from a storage locker. The two Massassi that had boarded Junker found him, however, and he fired at them before he closed a door behind him and ran to the cockpit. As he was entering the cockpit small metal disks flew into his back."}, {"tag": "p", "text": "After he had closed the cockpit door, the five Massassi in the hall continued to fire at it, and growl in their language. Idi-Shael knew he had to leave the Harbinger, but did not want to risk raising the security shielding from the viewports and had to fly blind, using only Junker's instruments. Once the ship completed its pre-launch setup and Idi-Shael had donned the oxygen kit and vac suit, he turned on the repulsorlifts and started to leave. An explosion outside Junker shook the freighter, and scrambled the sensors. Without sensors, he had no way to pilot Junker out of the landing bay, and away from Harbinger, until he tried to visualize the dreadnought's schematics in his mind, and allowed the Force to flow through him. After another explosion shook the ship, the Massassi outside continued even harder to try and break their way into Junker's cockpit."}, {"tag": "p", "text": "Using only the Force, Idi-Shael began piloting Junker out of the landing bay. From the landing bay deck, blasterfire struck the freighter, but Idi-Shael kept it moving towards the mouth of the bay. Once Idi-Shael felt he was far enough away from the deck crew, he raised the security shields on the viewports, and saw that he was about to exit the landing bay, and enter the black of space. However, Idi-Shael heard a metallic squeak from behind him, as the Massassi had managed to start prying open the cockpit door. He engaged Junker's ion engines to accelerate away from the Harbinger, and at that moment one of the Massassi pointed the barrel of a blaster into the cockpit."}, {"tag": "h3", "text": "Surprise cargo"}, {"tag": "p", "text": "Idi-Shael pulled back on Junker's controls, which caused the freighter to go vertical. Due to this, the Cerean was forced back into his seat, and almost lost consciousness due to his injuries and the force of the maneuver. The Massassi were sent away from the door to the cockpit as well, and once Idi-Shael regained his composure, he activated an emergency system to depressurize Junker. He hoped the depressurize and lack of oxygen would eliminate the threat the Massassi posed, and the console showed the freighter was being depleted of oxygen. When he turned in his seat, however, he was face-to-face with one of the Massassi."}, {"tag": "p", "text": "The cockpit door was open, and the Massassi had made its way into the cockpit. It was affected by the oxygen deprivation, however, and swayed on its feet in the cockpit with broken capillaries forming a black mesh across its yellow eyes. The Massassi fell on top of Idi-Shael, and tried to pull him out if his seat, but it the straps helped. Idi-Shael reached for a blaster, but there was not a blaster in his holster, and the Massassi managed to hit the emergency button on the seat, and the two fell on the cockpit floor. The Cerean and Massassi fought on the floor, and while the big red warrior was stronger, the effects of the depressurization had weakened it, with black blood coming from its ears, eyes, and nose. As the Massassi picked Idi-Shael up by his neck and squeezed, until it collapsed on top of Idi-Shael, dead."}, {"tag": "p", "text": "After the fight, Idi-Shael had difficulty making focusing on the instrument panel. It turned out that the Massassi's claws had cut a gash in his vacsuit, and he was leaking air. The Cerean hit random buttons on Junker's controls, but to no avail. He was able to enable autopilot, and once he focused, he determined that the screen was displaying the coordinates to the distress beacon on the frozen moon. Idi-Shael thought that the Blades might shoot him down in the attempt, but realized that he might die from blood loss or oxygen deprivation first and transferred the coordinates to the autopilot. As the autopilot navigated toward the frozen moon, Idi-Shael thought about Druur on the Harbinger, and Faal and Korr on the frozen moon."}, {"tag": "h3", "text": "Moving forward"}, {"tag": "p", "text": "When Idi-Shael awoke, he saw that Druur had been successful onboard the Harbinger; the Sith dreadnought was crashing into the frozen moon. Junker's autopilot, however, was flying toward the doomed ship however, and would be caught in the aftermath of its explosion. Idi-Shael needed medical assistance as he had stopped feeling pain from his wounds, but was beginning to feel cold all over his body. The Cerean had to reach Faal and Korr for aid, but did not trust his diminishing body. He tried to reach the freighter's distress beacon, but fell into unconsciousness once again. After the Harbinger exploded within the frozen moon's atmosphere, Korr saw Junker falling towards the moon's surface, and sensed that Idi-Shael was near death."}, {"tag": "p", "text": "One of Junker's passenger berths was made into a med bay for Idi-Shael, and Korr found the corpses of the dead Massassi. Once the Cerean awoke, the three briefly discussed what had happened, and decided they would elaborate more with a few rounds of keela. Faal offered the Jedi Knight that he could fly with him and Idi-Shael, but Korr declined because he had to inform Master Skywalker about the Lignan, and about a group of Force-sensitive clones of Jedi and Sith from the frozen moon. Surprisingly, Faal then offered to help Korr track down and deal with the clones, even though it would be dangerous. The three men then had a cup of caf, each spiked with pulkay."}, {"tag": "h3", "text": "Attack on Farpoint Medical Center"}, {"tag": "p", "text": "After hours of repairs to Junker, and after Korr talked with Master Skywalker, Korr, Idi-shael, and Faal decided to travel in Junker back to Fhost. On the way, and having received Skywalker's approval, Korr started training Idi-Shael in the ways of the Force in Junker's cargo bay. Upon reaching Fhost, Faal suggested they bring Ar-Six aboard, as he was bored when Idi-Shael and Korr were training, and decided that if Korr was fond of the droid, it was probably better than other droids. The three also discussed buying weapons for Junker, since it was only equipped with a tractor beam."}, {"tag": "p", "text": "Junker's crew discovered that the clones were there as well, as they were attacking the Farpoint Medical Center for medical supplies to synthesize a medicine for a sickness they shared. Since the clones were moving upwards through the building, Korr had Idi-Shael land Junker on the roof, and the two would make their way down the opposite stairwells to face the clones, while Faal would stay behind on Junker to make sure the clones did not escape. Korr was knocked unconscious shortly after a fight where he saw that one of the clones looked like him, and in an attempt to keep the clones from taking a medical supply ship on the roof Faal boarded it to warn its pilots. He evacuated the two pilots, but was knocked unconscious, and the clones took off with him aboard."}, {"tag": "p", "text": "After Idi-Shael had awoken Korr with Quickwake pellets and helped him to the roof, they boarded Junker and prepared to follow the clones. Before entering the medcenter, Korr had put a tracking beacon on the hull of the supply ship, which they planned in order to use to track it. Korr had Arsix land his Z-95 Headhunter at a landing field so they could pick the droid up. Several policemen had gathered around Junker as they prepared to take off, so Korr used the ship's external loudspeaker to inform him that he was a Jedi Knight, and he was in pursuit in the criminals that had attacked the medcenter. The policemen stood down, Korr took the controls as the pilot with Idi-Shael continuing as copilot, and the two picked up Arsix at the landing field. As Idi-Shael was trying to find the location of the tracing beacon and plot a course through hyperspace, Korr described the clones that he had encountered in the medcenter, including the clone with his own face."}, {"tag": "h3", "text": "Faal's rescue"}, {"tag": "p", "text": "Junker emerged from hyperspace in a system occupied by a red dwarf star, in its outer reaches. As Idi-Shael scanned the system he detected an asteroid belt, and two gas giants. The supply ship was located on the opposite side of the asteroid belt, so when Korr engaged Junker's ion engines, he used the majority of the asteroids as cover. An open hail came in on the ship–to–ship communications. It was coming from the supply ship, so Korr and Idi-Shael hoped that Faal had freed himself and hailed them."}, {"tag": "p", "text": "It turned out to be an Umbaran named Nyss Nenn, who was secretly working for the One Sith, and had taken control of the supply ship. The Umbaran told the two that he had killed or captured the clones, and that if they wanted Faal back, Korr would have to hand himself over. Korr decided to do it, as he would prove to be more of a problem than the Umbaran could handle. Nenn told him that he would have to put on a hardsuit and go to the supply ship, at which time Nenn would release Faal in an escape pod. Korr agreed, and as he and Idi-Shael ran through the corridors to get a hardsuit, Korr told Idi-Shael to make sure Faal was released, and that he would improvise the rest of his plan on the way. Once Korr was securely in the hardsuit, Idi-Shael gave him a piece of chewstim."}, {"tag": "p", "text": "Korr went to Junker's airlock, and opened the outer doors to space. He stepped out of the airlock and used the hardsuits thrusters to propel him towards the supply ship. He stopped partway between the two ships so he could be sure that Faal was released. As Korr was about to turn back to Junker, and prepare to board the supply ship, two escape pods launched from it. Faal commed Korr and Idi-Shael, and after confirming that his pod was the one that had launched first, he made his way to Korr and Junker. Another ship dropped out of hyperspace near the other pod, with weapons activated."}, {"tag": "p", "text": "After picking up the second pod, occupied by the Umbaran, the scout flyer turned towards Junker. It was piloted by Nenn's sister, Syll, and the two Umbarans only needed Korr alive. They fired, but Junker's deflector shields were not active, and the freighter took the red beams of plasma to its port side. Flame, smoke, and debris flew out of Junker, but Idi-Shael and Ar-Six worked to seal off the damaged areas, and activated the deflectors. They were also able to keep the engines functional during the attack."}, {"tag": "p", "text": "The Umbarans then turned toward Faal's escape pod. Korr told him to quickly turn the pod, and at the same time fired the hardsuit's thrusters toward the pod. The unexpected turn saved Faal, and took the Umabaran siblings additional time to aim at him. Korr used the Force to pull the pod toward him, which saved it, although it did lurch hard from the proximity of the shot. Korr made it to the pod, and when the Umabarans fired again, he deflected the shot with his lightsaber. The deflection hit the cockpit of the scout flyer, the blast killing its pilot."}, {"tag": "p", "text": "Faal and Korr then made their way to Junker, and Idi-Shael used the tractor beam to reel them in. An alarm in Korr's hardsuit started going off, however, because it had started to leak oxygen into space. With two holes near the ankle section of the suit leaking, Korr only had thirty seconds of oxygen left. In addition to the tractor beam pulling the pod in, Idi-Shael maneuvered Junker closer to the pod. Korr began losing his vision, but saw that Idi-Shael had donned a hardsuit himself, while Ar-Six flew the freighter. As Idi-Shael propelled himself towards Korr, and brought him back aboard Junker, Korr was losing consciousness and remarked that the image of Junker with an open airlock looked \"hungry\"."}, {"tag": "p", "text": "Korr awoke in the corridor outside the airlock. Idi-Shael was able to get him inside Junker quickly, and Korr only went a few seconds without air. They saw that the supply ship was moving away from them and was about to jump to hyperspace, while the scout flyer moved deeper into the system. Faal then told Korr about the Umbaran, and how he had been able to block the clones' Force use and dampened their lightsabers, as well as the fact that one of the clones was of Korr. Even though there were only three clones left, they were still dangerous, and Korr stated Junker's crew had to go after the clones."}, {"tag": "p", "text": "After discussing what had happened on the supply ship, and that they had to go after the clones, Marr saw on the scanners that the Umbaran's scout flyer was leaving the system, and Faal hoped they would not show up again. Arsix brought Faal medical supplies, which he accepted with a smile, as he had changed his views on the droid. The supply ship then jumped to hyperspace, and Junker's crew would have to follow it using the tracking beacon Korr had placed on the ship on while at the Farpoint medical center on Fhost. While Faal had begun to accept Arsix, he told the droid that he would have to earn his keep on the ship, and would have to bring him caf as Junker ran on caf."}, {"tag": "p", "text": "The tracking beacon tracked the supply ship to a remote system that only had two planets and an asteroid belt. The system also contained high amounts of radiation, but Junker's deflectors would be able to protect them from it. Faal, Korr, and Idi-Shael discussed whether the clones had made a misjump, or randomly dropped out of hyperspace, but Korr was certain they had traveled there for a reason. Before leaving, Faal said he needed a chewstim, but he, Korr and Idi-Shael were out. Arsix had one ready for him from a cylinder in his body, and they jumped to the system."}, {"tag": "h3", "text": "Mystery of history"}, {"tag": "p", "text": "When Junker dropped out of hyperspace in the system, Idi-Shael adjusted the deflector shields to protect the crew from radiation from a pulsar in the system. Korr and Idi-Shael also felt something in the Force upon entering system, a feeling of the dark side. Faal asked if it was the clones, but Korr responded it was something else, despite the fact that there was nothing in the system aside from an asteroid belt and two barren planets. After engaging the ion engines to head towards the other side of the planets, a scan of the asteroid belt in the system revealed it was composed of parts of a structure, a very large structure. The three discussed that the technology to create such a large structure was impossible, and Korr theorized that it could have been of Celestial or Rakatan origin. Korr told Arsix to send the information to Master Skywalker so that it could be reported, which the droid used Junker to do. As Junker moved to the opposite side of the two planets however they saw something, a greenish black, organic, viewportless cylinder as large as a star cruiser, which was emanating with the dark side."}, {"tag": "p", "text": "As they discussed the station, they saw that the clones' ship had attached to the station with a docking port attacked to the bottom of the ship. Korr told Faal to keep Junker at a safe distance so that he and Idi-Shael could take the Flotsam to the station. Faal reminded Korr that Junker was still his ship, and what had happened when they had left him behind on Fhost, but Korr said Faal would not be enough to handle the powerful Force users on a station built using the dark side. The Jedi also wanted Faal to stay behind so that if something went wrong on the station with the clones, he and Idi-Shael would need a quick exit. The spacer suggested that Ar-Six could pilot Junker, but Korr said it would be better for a living pilot to do so. After Idi-Shael agreed with Korr, Faal relented, acknowledging that things had changed on the ship as he had been willing to let a droid pilot it alone, and stayed behind with him while the Jedi headed to Flotsam to go to the station."}, {"tag": "p", "text": "After Korr and Idi-Shael had departed in Flotsam, Faal flew Junker into the asteroid belt. This way, in case any enemies like the Umbarans tracked them to the system Junker would not be left waiting in open space. The spacer also wished them good luck, and for the Force to be with them before letting them know he and Ar-Six would stay on the comms frequency if they would be needed. Nyss Nenn had tracked them to the system, however, and after locating Junker in the asteroid belt and determining that Jaden Korr was not onboard, Nenn concluded that he was free to destroy the freighter."}, {"tag": "h3", "text": "Encounter with the Umbaran"}, {"tag": "p", "text": "Nenn fired upon Junker, which took Faal and Ar-Six by surprise. The explosion moved Junker towards an asteroid before Faal activated reverse thrusters. Another explosion caused a different asteroid to break into smaller pieces and hit against Junker's hull. The attack caused a fire to erupt in the engine room, which Faal sent Ar-Six to extinguish. Junker's instrument panels also lost power for a few moments after a shot grazed across the top of the freighter. Faal flew deeper into the asteroid belt where he determined that their attacker was the Umbaran scout ship. Its arrival into the system had gone unnoticed, which made Faal believe the ship had a cloaking device of some sort, not unlike its pilot's ability to dampen a Force-sensitive's abilities. Regardless, Junker had no weapons, so Faal had to bring it away from the firefight."}, {"tag": "p", "text": "As Faal flew Junker deeper into the asteroid belt, his cup of caf fell to the floor and spilled onto Junker's deck. Similar to when Korr had flown Junker during an earlier encounter with Harbinger, Faal piloted the freighter in a highly erratic matter, climbing, diving, slowing down, speeding up, and spinning, but without the aid of the Force that Korr had tapped into. Another asteroid exploded next to Junker, and the blast wave caused the freighter to crash into a different asteroid, causing the side of Junker's hull to screech along the asteroid. Although Ar-Six was able to remotely extinguish the fire in the engine room, Faal cursed that he had a droid serving on his ship but did not have any weapons installed."}, {"tag": "p", "text": "After bumping into a few more asteroids and taking a couple more laser hits, Faal told Ar-Six to contact Korr and Idi-Shael to let them know that the Umbaran had tracked them down, and was pursuing Junker. The droid could not contact them, however, as the ship's transceiver had been knocked out during the fight with the Umbaran; in order to contact the Jedi, Junker had to be in close range for everyone's personal comlinks to communicate. Junker almost crashed into another large asteroid, but Faal was able to bring the freighter up over the top of the asteroid, and only skimmed the bottom before he accelerated the ship to full speed. Faal was a good pilot, however, and without Flotsam attached to the side of Junker, he was able to prevent Nenn from acquiring a target lock. Nenn's compatriot, a One Sith clone of Jaden Korr known as Iteration, found Flotsam near the mysterious station. The Umbaran recognized it to be Rakatan technology, and decided to ignore Junker in order to go after Korr who was on the station."}, {"tag": "p", "text": "Faal did not know this, however, and continued to evasively fly Junker through the asteroid belt, and rushed between two asteroids about to collide. It wasn't until Ar-Six questioningly beeped about the laser fire that Faal thought the Umbaran had given up his pursuit, although he continued to fly evasively in case the asteroid belt was blocking the sensor readings of the scout ship. The spacer decided to risk a trip out of the asteroid belt in order to determine if the Umbaran had given up. At first Ar-Six could not detect the Umbaran's ship, but later realized that it had moved towards the Rakatan station. After he told Ar-Six to repair Junker's transceiver, Faal decided that he would board the station as well, and provide backup for the Jedi."}, {"tag": "p", "text": "When Junker was close enough to the station docking tube came out from it connect with Junker. After grabbing two blasters from Junker's cockpit weapons locker, Faal made his way towards the Rakatan station, and told Ar-Six to keep the engines hot to be safe. He also told the droid to lock the ship, and to contact him when the transceiver was fixed."}, {"tag": "h3", "text": "End of the journey"}, {"tag": "p", "text": "After Faal, Idi-Shael, and Korr made it back onto Junker, the clones' supply ship had been set to self-destruct, in order to destroy the Rakatan station and the threats within. Faal had Ar-Six fly Junker away while it was still attached to the station, and after filaments from the station tried to wrap around the freighter to stop it from leaving, Ar-Six brought the engines to full. When the supply ship exploded it disconnected the tether holding the station above the planet, and Junker was almost dragged down with it. Once Ar-Six diverted all power to the engines, except for life support and artificial gravity, the ship broke away from the filaments. The crew was slammed into the walls as the acceleration was too much for the artificial gravity to maintain."}, {"tag": "p", "text": "With the station's remains on the planet, Ar-Six. Faal, Idi-Shael, and Korr determined that Junker was mostly intact. Idi-Shael plotted a hyperspace course for to return to Fhost, and Korr reported to the Jedi what had transpired, after which he stated he would make caf in the galley, spiked with pulkay. He later cleaned himself up from the events on the station in one of Junker's lavatories, and shaved with an old razor Faal left in the mirror for passengers."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "h3", "text": "Blackstar crew"}, {"tag": "p", "text": "The Blackstar was under the command of Reegas Vance. Vance was the leader of a group of criminals on the planet Fhost, and heavily modified the ship to aid in his criminal activities. His crew consisted of five criminals, including Marden and Verra. After following Khedryn Faal and Marr Idi-Shael to the site of a derelict ship and giving them an ultimatum, Vance was lured off his ship by the pair. They disabled the engines of their ship, the Seeker, and used hardsuits and a hatch cracker to board the Blackstar. Verra was waiting for them to dock, and was shot in the chest by Idi-Shael. Faal and Idi-Shael then claimed the ship, with Faal as captain, and renamed the ship Junker."}, {"tag": "h3", "text": "Junker crew"}, {"tag": "p", "text": "Faal served as captain of Junker, and had a habit of chewing chewstim before lifting off or landing in Junker, before jumping to hyperspace, or even because he thinks a situation may become risky. While walking through Junker's corridors, Faal would stop and look at joints on a bulkhead or viewport, and tap the bulkheads with his mug to ascertain the ship's condition. Idi-Shael used his Cerean brain, and unknowingly the Force, to perform complex mathematical equations to plot hyperspace routes. When working for Jaden Korr, Junker engaged an ancient Sith dreadnought, the Harbinger. In order to evade the dreadnought, Korr took the controls of the ship and flew through an asteroid field guided by the Force. While Korr was piloting the ship through the asteroids, Relin Druur was at the back of the ship, using the tractor beam array to pull asteroids into the paths of pursuing Blade starfighters. Despite his dislike of droids, Faal allowed Korr's R6-series astromech droid, Arsix, onboard, and even let the droid control the ship when he was on the Rakatan space station known as Mother. Arsix had also followed some of the customs of Junker's crew, and had a chewstim ready for Faal before a hyperspace jump."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Junker's first appearance was in Crosscurrent, which was written by Paul S. Kemp and released on January 26, 2010, as well as its sequel, Riptide, which was released on October 26, 2011. It also appeared in the short story \"A Fair Trade\", which was written by Paul S. Kemp and Brian Rood and published in Star Wars Insider 129 on October 25, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}