{"url": "Juno_Eclipse", "categories": ["Category:Legends articles", "Category:Semi-protected articles", "Category:Alliance Fleet captains", "Category:Black Squadron members", "Category:Corulag residents", "Category:Females", "Category:Humans", "Category:Imperial defectors", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Mechanics"], "nodes": [{"tag": "h1", "text": "Juno Eclipse"}, {"tag": "p", "text": "Juno Eclipse was a Human female officer in the Alliance to Restore the Republic during the Galactic Civil War, having defected from the Galactic Empire after she was accused of treason. Born on the Core World Corulag around the end of the Clone Wars, she was the daughter of a civilian engineer and a teacher. Eclipse enlisted in the Imperial Military after her mother's death, hoping to earn the respect of her father who was a staunch supporter of Emperor Palpatine and the New Order. She was first enrolled as the youngest cadet at the Corulag Academy before leaving her homeworld to embark on a career in the Imperial Navy. Rising to the rank of Captain, her skills in the cockpit attracted the attention of the Sith Lord Darth Vader, who promoted Eclipse to lead his Black Eight Squadron. Though an exceptional TIE pilot, she openly questioned Vader's methods, which resulted in the massacre of Callos and Eclipse's subsequent reassignment."}, {"tag": "p", "text": "Now assigned to pilot the Rogue Shadow, Captain Eclipse came to work alongside Darth Vader's secret apprentice, a Sith assassin codenamed Starkiller. They hunted the few remaining members of the Jedi Order that survived the initial purge of Order 66, including General Rahm Kota and Jedi Master Shaak Ti, until the apprentice was betrayed by his master, while Eclipse was stripped of her rank and arrested as a traitor due to her affiliation with Starkiller. Unwilling to abandon Eclipse, Starkiller chose to rescue the disgraced Imperial officer, who supported the apprentice's efforts to raise a rebellion against the Empire."}, {"tag": "p", "text": "Eclipse remained loyal to Starkiller, even after learning that his true allegiance still belonged with the Sith Lord who betrayed him, and over time their rapport evolved into an emotional attachment. After the apprentice was betrayed by Vader once more, Eclipse transported Starkiller to the Death Star where the Alliance's founders of the were taken. The Rebellion was ultimately saved due to their actions, although Starkiller was killed in battle against the Lords of the Sith. Following the apprentice's sacrifice, Eclipse became the commanding officer of the Alliance Fleet's flagship, the Salvation."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Juno Eclipse was born on Corulag as the daughter of a teacher and civil engineer. As a child, she developed a fascination with alien cultures and diversity, a trait which her mother encouraged. Early in her life, however, Eclipse was dealt a personal tragedy when her mother died, reportedly caught in the crossfire of an insurrection on Corulag. The loss of her mother left the young Juno in the care of her father, who increasingly became cold and distant after the death of his wife. Nevertheless, Eclipse desperately desired to win the approval of her only remaining parent. As a result, she developed into a loyal supporter of the Galactic Empire, mainly due to the fact that her father was an uncompromising Imperialist who was enamored with those that enlisted into Imperial Military service."}, {"tag": "p", "text": "In addition to being indoctrinated into Emperor Palpatine's New Order, Juno Eclipse's father attempted to impart his Anti-Jedi sentiments to his daughter. A fierce supporter of the Emperor, Eclipse's father loathed the fallen Jedi Order and wholeheartedly believed the Emperor's false account of the Jedi's attempt to seize control of the Galactic Republic by assassinating then-Chancellor Palpatine. Despite her's father obvious contempt towards the Order, Eclipse never developed any personal resentment against the Jedi, mainly due to the fact that she possessed very little knowledge of the Jedi or the Force."}, {"tag": "p", "text": "In a last attempt to win her father's approval once and for all, Juno Eclipse dedicated her young life to entering Imperial service. It was Eclipse's hope that her father would be elated by her career choice, mainly so that she could finally earn the same admiration that he felt for the Empire's enlisted personnel. Despite her youth, Eclipse was accepted into the Imperial Academy on Corulag at the age of fourteen, thus making her the youngest cadet ever to be welcomed into the Empire's military training institution."}, {"tag": "h3", "text": "Imperial pilot"}, {"tag": "p", "text": "Despite graduating at the top of her class with high honors, Juno Eclipse was heartbroken when her father did not attend her graduation ceremony. Grieved by him for the final time, Eclipse disowned her father and homeworld in order to move on from an unhappy childhood. Having severed her ties to the past, Eclipse decided that her only family from that point on would be the Imperial Navy."}, {"tag": "p", "text": "Early on in her career, Eclipse flew many successful combat missions throughout the Outer Rim as an Imperial pilot, awarding her the admiration of her peers and commanding officers. Through quick promotions that led to the rank of captain, she eventually gained command of Black Eight Squadron, Darth Vader's elite unit of eight TIE Fighter pilots. Owing to this, she also was one of several Imperial TIE pilots to act as a test pilot for the then-in-development TIE Advanced x1 prototype next-generation starfighter. Though she originally considered serving under the second most powerful man in the Empire as the highlight of her career, Eclipse's quick discovery of the Dark Lord's brutal tactics would weigh heavily on her conscience. It was during the Bombing of Callos when she demonstrated her loyalty to Vader when, despite obvious misgivings about obeying her orders, she continued her assault on the already beaten and defenseless planet, leading to the mass genocide and complete sterilization of all life on the planet."}, {"tag": "p", "text": "In addition to her loyalty, Vader also realized that Captain Eclipse lacked the ruthlessness he found vital to commanding the Black Eight Squadron. Thus, Eclipse was reassigned to a top-secret mission in which she would pilot the Rogue Shadow, a state-of-the-art starship, as well as the transport of Starkiller, Darth Vader's secret apprentice and personal assassin. In addition to Eclipse and Starkiller, the third member of the vessel's crew was PROXY, Starkiller's droid companion. Although mistakenly believing that the young man was one of Vader's spies, she soon discovered that Starkiller was actually tasked with the responsibility of exterminating the last of the Jedi Order. Eclipse assisted Starkiller by flying him to Nar Shaddaa, Raxus Prime, and Felucia all the while trying to get to know and understand Darth Vader's enigmatic enforcer. Aside from hunting Jedi, Eclipse transported Starkiller to the Jedi Temple on Coruscant multiple times, in order for the apprentice to undergo metaphysical training at the behest of Darth Vader. During his second trial inside the Temple, Starkiller fought an apparition of the long-dead Darth Phobos. During the test, Phobos disguised herself in the form of Juno Eclipse, knowing that the young woman's death was among the fears of the aspiring Sith. Starkiller eventually prevailed in the trial by overcoming his fear and returned to the Rogue Shadow with Eclipse none the wiser about his feelings."}, {"tag": "p", "text": "It was during their time together that Eclipse inadvertently discovered the plot to overthrow and kill Emperor Palpatine while spying on the apprentice and his Master. Although torn between her duty to her immediate superior, Darth Vader, and her duty to the Emperor, Juno continued to serve as Starkiller's pilot while feigning ignorance in regards to their secret agenda. After defeating Jedi Master Shaak Ti on Felucia, Starkiller returned to his Master, only to discover that the Emperor had learned of his existence. Starkiller was betrayed, and seemingly killed, by Lord Vader at the behest of the Emperor. Afterward, Eclipse was arrested and declared a traitor to the Empire by Vader. For the next six months, she was kept as a prisoner aboard the Sith Lord's science vessel, the Empirical."}, {"tag": "h3", "text": "Forging an alliance"}, {"tag": "p", "text": "Unknown to Juno Eclipse, however, Starkiller's supposed \"death\" was staged by Darth Vader, who managed to save his apprentice's life by using the Empirical's medical facility to heal and improve the Sith assassin's wounded body. Upon being awoken from a six-month coma, Starkiller received new orders from his Master; build an alliance of rebels and dissidents to distract the Emperor in order to create a window of opportunity to finally kill him. In addition to his new assignment, Starkiller was required to sever all connections to his past, with the exception of PROXY. But the apprentice was unable to force himself to leave Juno Eclipse to die on the science vessel and opted to save her instead, but not before rationalizing his actions by claiming that he still required a pilot for the Rogue Shadow."}, {"tag": "p", "text": "When Starkiller revealed his plan to incite a full-scale rebellion against Emperor Palpatine, Eclipse was the first to join his cause, essentially because of the fact that she was a \"traitor\" who had nowhere else to go. Starkiller purposely neglected to mention, however, that he remained as the apprentice of Darth Vader, and that the rebellion was actually the Dark Lord's idea. Ironically, their new mission to recruit others to the Rebel cause led them right back to their first target, the disillusioned General Rahm Kota. After searching Nar Shaddaa, the site of the fateful battle where Kota lost his sight, the crew of the Rogue Shadow were able to track the missing Jedi to Bespin. There, they discovered that the general had abandoned his cause in favor of heavy drinking in the Vapor Room, a bar in Cloud City."}, {"tag": "p", "text": "After battling their way through the city with the blind and inebriated Jedi in tow, Eclipse brought Starkiller for a final time to the Jedi Temple, where the Sith assassin inadvertently began to rediscover his Jedi heritage. Upon completing his inspections of the Temple's ruins, the Rogue Shadow's crew journeyed to Kashyyyk, where Starkiller rescued Princess Leia Organa, the adopted daughter of Imperial Senator Bail Prestor Organa. After saving the Princess and destroying the Skyhook that was used to transport Wookiee slaves from the surface, the Rogue Shadow set a new course for Felucia to rescue Bail Organa."}, {"tag": "p", "text": "Soon after being rescued from the fallen Jedi Padawan Maris Brood, Organa was willing to join Starkiller's rebellion, though he was convinced that the Empire would have to be seen as vulnerable in order to entice the countless dissidents across the galaxy to take up arms against Emperor Palpatine. Starkiller, passing as a Jedi Knight, agreed to meditate on the subject. In the apparent privacy of his ship, however, he contacted Darth Vader and received instructions to attack a Star Destroyer shipyard above Raxus Prime. During the conversation, Eclipse discovered eavesdropped on Starkiller and was genuinely shocked to discover the apprentice's true allegiance. Though she angrily confronted Starkiller over his deceptions and continued existence as Vader's slave, Starkiller remained firmly attached to his Master's cause, albeit with a sense of regret at having emotionally hurt Eclipse. Although she chose to stay with him, Eclipse implored Starkiller to consider the fact that the rebellion's fate would ultimately be decided by him, rather than Darth Vader. Eclipse also asked him to not force her to leave behind another life, having already lost the only life she ever had while serving in the Imperial Navy."}, {"tag": "p", "text": "On Raxus Prime, Starkiller succeeded in destroying the shipyard, as well as in pulling down a Star Destroyer through the power of the Force. But what truly impressed Eclipse was how Starkiller went to great lengths to save PROXY from the Core, a planet-wide computer mainframe that infected the apprentice's droid ally. His efforts in saving his oldest friend, even though it was only a droid, made Eclipse realize that Starkiller had feelings that made him more than just another Sith and merciless assassin."}, {"tag": "p", "text": "With the Galactic Empire's weaknesses exposed, the first meeting of the Alliance to Restore the Republic was held on Corellia. Present were Starkiller, Bail Organa, Mon Mothma, Garm Bel Iblis, Princess Leia, Rahm Kota and Juno Eclipse; Princess Leia was also present via transmission through PROXY. Just before the Alliance could be formalized, however, Darth Vader arrived with the Imperial Military at his back and had the Alliance leaders completely surrounded. After ordering his soldiers to take the Rebels' alive so that the Emperor could personally kill them, Vader revealed that the rebellion and his plot to murder the Emperor had all been a ruse, just to get the Empire's major enemies in one place in order to wipe them out. While Vader and Starkiller confronted each other, PROXY led Eclipse away from the ambush, stating that Starkiller would need her later."}, {"tag": "p", "text": "While Eclipse returned to the safety of the Rogue Shadow, PROXY distracted Vader long enough for Starkiller to escape, but was nearly destroyed in the process. The Dark Lord then left Corellia with the Alliance founders as his prisoners, not realizing that Eclipse had survived and was waiting for the opportunity to retrieve Starkiller. On-board the vessel once more, Starkiller bitterly lamented to Eclipse about how he had been deceived since waking up on the Empirical; how he had been used as an instrument of the Dark Lord's will throughout his entire life before ultimately being discarded. Eclipse helped to console the former apprentice by reminding him that the fate of the Alliance still rested in Starkiller's hands. It was at that moment that Starkiller renounced his past ties to his former Master, deciding to rescue the Alliance leaders and truly oppose the Sith Lords. Before leaving Corellia, he revealed to Eclipse that his birth name was Galen Marek, thus dropping his identity as Starkiller, the codename that his former Master had bestowed upon him."}, {"tag": "h3", "text": "Battle on Death Star I"}, {"tag": "p", "text": "After discerning the location of the would-be Rebels, Juno Eclipse and Galen Marek traveled to Despayre, the planet in close proximity to where the Empire's secret battle station, the Death Star was still under construction. Using the Rogue Shadow's advanced cloaking system, Juno was able to guide the ship through the station's defenses and enter the thin atmosphere around the Death Star. As Marek prepared to infiltrate the Death Star, Juno inquired as to whether or not she would ever see him again. Given how much the odds were stacked against him, Marek was forced to express how he was not likely to survive the mission. Before Marek could leave, however, Juno kissed him."}, {"tag": "p", "text": "While Marek fought his way to Emperor Palpatine's Observation Dome, Juno took the ship to safety and waited to be notified when the Rebels required an extraction from the battle station. As the former Sith apprentice drew closer to the Rebels' location, Juno and Marek continued to communicate through a Comm unit. She also analyzed the Death Star's main cannon and became instantly awed by the magnitude of its power, but also fearful of what Palpatine would do with such a destructive weapon at his disposal."}, {"tag": "p", "text": "When the time came to extract the Alliance leaders from the Death Star, Juno positioned the Rogue Shadow just outside of Palpatine's Observation Dome. As the former Imperial Senators boarded the ship, the dome was rocked by a massive explosion, thus forcing Juno to leave without Marek. Although General Kota and the Senators were safely aboard the vessel, Juno was heartbroken to learn that Marek sacrificed his life in order to cover their escape."}, {"tag": "h3", "text": "Retrieving PROXY"}, {"tag": "p", "text": "Shortly before formalizing the Alliance, the leaders decided to keep a recording of the formation of the Alliance; remembering that PROXY was last seen there, she traveled with Bail Organa to Corellia on the Rogue Shadow. They found the damaged droid half-buried in snow and managed to repair the droid on board the ship. Upon his re-activation, the droid immediately asked where Starkiller was, to which Juno revealed that he was dead. After some initial disbelief, PROXY stated that his former Master anticipated his own death and left the droid with a contingency order to serve Juno Eclipse."}, {"tag": "p", "text": "Bail Organa wished to record the Alliance's history, and thus sought to learn more information about the man who helped bring about its creation. PROXY narrated all that he had recorded about Marek's origins and his service to Darth Vader, as well as their many missions together. When he finished, Juno explained to PROXY about the events that occurred after his deactivation, including Marek's sacrifice at the Battle on Death Star I."}, {"tag": "h3", "text": "Remembering the apprentice"}, {"tag": "p", "text": "Following Marek's death and the official formation of the Rebel Alliance, Kota assured Eclipse that Marek was one with the Force, having rejected the dark side of the Force by dying in the light. Eclipse commented to herself that death was infinitely preferable to a life without hope. She also realized that Kota knew all along that Marek was the same Sith assassin who blinded him on the TIE fighter factory above Nar Shaddaa. Kota admitted that he had his suspicions; Eclipse inquired the reason behind Kota's decision to help Marek, despite his allegiance to Vader. The Jedi General simply expressed his belief in Marek's capacity for redemption, and also revealed to Eclipse that she was the ultimate catalyst for the secret apprentice's conversion to the light side of the Force."}, {"tag": "p", "text": "When Eclipse asked if Marek would be remembered, Kota brought her inside the hut where the Senators declared the official formation of the Rebel Alliance. In memory of the Secret Apprentice's sacrifice, the Alliance adopted the Marek family crest as the symbol that would unite countless beings in a movement to overthrow Emperor Palpatine's oppressive tyranny and restore the Galactic Republic back to its former glory. At that moment, Eclipse swore to never forget Galen Marek or the example he had set for her and all others who chose to fight the Emperor."}, {"tag": "h3", "text": "Joining the Rebels"}, {"tag": "p", "text": "Inspired by Galen Marek's sacrifice, Juno Eclipse stayed with the newly formed Rebel Alliance. To ensure that Marek's death would not be in vain, Eclipse dedicated her life to serving in the Alliance's Rebel Fleet, becoming an officer in its ranks and retaining the rank of captain that she previously earned in the Imperial Navy. Shortly afterward, Captain Eclipse received a commission as the commanding officer of the Salvation, an EF76 Nebulon-B escort frigate and the flagship of the fledgling Rebellion."}, {"tag": "p", "text": "At the inauguration of the Salvation prior to its first launch, former Senator Mon Mothma personally presented the prized warship to its captain and crew, officially naming it the Salvation to emphasize what the Rebellion desperately needed in its struggle against the Galactic Empire. Captain Eclipse then stepped in, thanking Mothma, and gave an impassioned speech to her crew. While she admitted that the Salvation did not provide them with the largest ship, the most powerful weapons or the most starfighters, she assured the crew-members that their greatest asset was faith—in themselves, in each other and especially in the righteousness of the Alliance's just cause. Captain Eclipse also took responsibility for her infamous reputation, admitting to her past service under Darth Vader and how her actions led to the destruction of Callos. Despite her Imperial past, the crew of the Salvation served under Captain Eclipse, determined to avenge the atrocities committed in the name of Emperor Palpatine."}, {"tag": "p", "text": "As captain of the Salvation, Eclipse retained PROXY at her side and often worked with Rahm Kota, leaving the Rogue Shadow to the aging general. While Eclipse agreed with Kota's opinion that the Rebellion would never accomplish anything significant if it didn't achieve a major or symbolic victory against the Empire, and often urged the Alliance leadership to consider attacking a valuable target, she was considerably far more patient with her superiors than Kota was. Not wanting to see Kota break off from the Alliance if he ever lost his patience with its leadership, Eclipse often aided the Jedi General and his squad on certain missions that were not sanctioned by their superiors. Eclipse eventually received orders to take the Salvation to an Imperial-controlled planet called Cato Neimoidia, both to check out the planet's defenses and to test her own crew's ability in combat. Given the Alliance's limited resources, however, Eclipse was under strict orders not to endanger her ship under any circumstances."}, {"tag": "h3", "text": "Cato Neimoidia"}, {"tag": "p", "text": "Holding little regard for the Alliance leaders' slow and cautious approach to fighting the Empire, Kota used Eclipse's mission to his advantage and secretly followed the Salvation with his squad inside the Rogue Shadow. Once more, Eclipse decided to discreetly aid the general in his goal to both disrupt the planet's slave operation and to assassinate its brutal despot, Baron Merillion Tarko. After arriving at their intended destination, Eclipse began testing Cato Neimoidia's defenses by dispatching a squadron of BTL Y-wing starfighters to engage the Empire's TIE/LN starfighters. While Kota initiated his ground assault, Eclipse covered up the general's actions by dismissing them as a local insurrection to her crew, who were oblivious to the Jedi's involvements and his objectives."}, {"tag": "p", "text": "However, it soon became apparent that Alliance Intelligence underestimated the planet's Imperial defenses as additional TIE fighters began to swarm her squadron. Since her orders were to not risk the integrity of her ship, Eclipse was pressured into withdrawing from the battle, but not before warning Kota to break off his attack. Kota dismissed her concerns and pressed on his attack. Before Eclipse could further persuade the general to retreat, a major explosion near Tarko-se caused the Rogue Shadow to vanish from the Salvation's sensors. Believing that Galen Marek's starship had been destroyed, along with Kota and his squad, Eclipse ordered her own ship to flee from Cato Neimoidia via hyperspace. After rendezvousing with the Alliance Fleet, she reported the details of her mission—including her belief that Kota was killed in the failed raid—to three of the Alliance's leaders: Mon Mothma, Garm Bel Iblis, and Leia Organa."}, {"tag": "p", "text": "During her report, she witnessed first hand how the Alliance leadership was deadlocked in division and indecision. While Senator Iblis favored Kota's direct approach, Senator Mothma argued for caution and patience; Senator Organa preferred to consult with her adoptive father before voicing her opinion. Eclipse tried to convince her superiors that the Alliance needed a suitable replacement for Kota, someone who balanced the line between action and caution. Her choice fell on Gial Ackbar, a Mon Calamarian redeemed by the Alliance from slavery in the Eriadu system. She believed that with Ackbar serving Alliance, as well as a major victory over the Empire, would galvanize the Mon Calamari's resistance and lead them into joining the Alliance to accomplish their mutual goal—the downfall of the Galactic Empire. Although the addition of Mon Calamari's resources to the Alliance was an enticing thought, Senator Mothma once again voiced her hesitation, fearing that a catastrophic defeat against the Empire would further discourage the Mon Calamari and leave the Alliance in a far worse situation than it was already in."}, {"tag": "p", "text": "Beginning to feel the same frustration and resentment that Kota held for the Alliance leaders, Eclipse threatened to resign her commission and break off her allegiance to the Alliance, despite the fact that it pained her to abandon Galen Marek's legacy. Before she could make any final decision, she was threatened by her superior officer, Commodore Yat-De Viedas with the possibility of a court martial for her unsanctioned assistance to General Kota. Exhausted and feeling defeated, Eclipse resigned herself to the situation and awaited their decision."}, {"tag": "h3", "text": "Recruiting Ackbar"}, {"tag": "p", "text": "After receiving a temporary demotion, Eclipse decided to follow Kota's example and ignore Mon Mothma's overly cautious position. She remained committed to her plan to recruit Ackbar and the military resources of his world into the Alliance's fold. However, she was initially unsure on how to proceed, acknowledging the fact that she was not a lone agent who operated outside of an organizational hierarchy as Starkiller did. On the contrary, she thrived on knowing her place and performing her duty to the letter, not thinking outside of the box. To that end, she welcomed the discreet assistance of Bail Organa upon her arrival on Dac's moon. With PROXY and Organa at her side, she met with Ackbar and his Quarren allies, attempting to convince them to join the Alliance, and to rally both the Mon Calamari and the Quarren race to add their strength to the Rebellion."}, {"tag": "p", "text": "Through Ackbar's strategic brilliance, Eclipse accompanied the small group with a goal to achieve a symbolic victory that would galvanize the Dac resistance movement and motivate it to throw its weight behind the Alliance. Thus, they staged a false attack on Heurkea by planting explosions throughout the city in order to trick the Imperials into thinking that the city was under an unauthorized attack by their own TIE fighter squadron, the 181st Imperial Fighter Wing. The Imperials were easily fooled and retreated from the city. Knowing that the Empire would quickly discover the deception, Eclipse knew that her mission was a success. By humiliating the Empire, the oppressed world of Dac would bolster its defiance against the Empire. After congratulating each other, Ackbar assured Eclipse and Organa that the Alliance could count on Dac's allegiance to the Alliance, as well as his own personal commitment to the Rebel cause."}, {"tag": "h3", "text": "Regrouping with the Alliance"}, {"tag": "p", "text": "Before returning to the Alliance leaders, Organa inquired into Eclipse's personal views on how the Alliance should conduct its strategy. Eclipse ultimately favored Kota's aggressive tactics as opposed to Mothma's complacency, but not to the extent of supporting Kota's recklessness. She advocated decisive and smart actions, making a difference through achieving well-planned victories on a major scale, or at the very least—symbolic ones as well. During this time, she encountered Berkelium Shyre, a mechanic from Malastare and a loyal supporter of the Rebellion. During their conversation, Shyre revealed his feelings for Eclipse and tried to convince her to stay with him. For her part, Eclipse was somewhat attracted to Shyre, and also partially felt as though it was time to move on from the memory of Starkiller. But Eclipse ultimately declined Shyre's offer, feeling that she would never truly come to terms with her grief over Starkiller's death."}, {"tag": "p", "text": "When Eclipse reported the events at Heurkea to the Alliance leaders, Mon Mothma responded with disapproval and suspicion that Bail and Leia Organa assisted the Rebel captain behind her back. Although Eclipse succeeded in her own endeavor to help the Alliance, Mothma continued to display her fear of risks, stating that if things at Heurkea had ended badly, the Alliance would have lost both Eclipse and Organa, as well as the chance of winning Dac's support. Fed up with Mothma's constant preaching of caution, Bel Iblis pointed out that no war was without risks. He also scolded the fugitive senator for constantly trying to force the Alliance not to fight, even when it clearly wanted to, and likened her actions to tyranny—in its own way. Realizing that the majority of the Alliance was clearly against her, Mon Mothma conceded the point and the Alliance leadership began considering Eclipse's suggestion of prioritizing a symbolic win for the Alliance."}, {"tag": "p", "text": "Although Eclipse was pleased that some amount of progress had finally been made, she feared that the Alliance leaders still lacked the quick and decisive quality she yearned to see in them. She believed that the leadership would take at least weeks to debate over choosing an appropriate target, thus maintaining the Alliance's appearance of looking like it's taking action when it's actually doing nothing. When Commodore Viedas commented that she was starting to sound like a cynic, Eclipse agreed with him, stating that politics naturally brought pessimism out of most people. After the briefing with the Alliance leadership was concluded, Eclipse was transferred back to the Salvation and restored to her commission as its commanding officer."}, {"tag": "h3", "text": "Attack on the Salvation"}, {"tag": "p", "text": "Not long after her return to the Salvation, the Rogue Shadow exited hyperspace and was heading towards her ship's position. Eclipse was utterly surprised to see the stealth ship, believing it had been destroyed on Cato Neimoidia. Although it became apparent that the Rogue Shadow was not a figment of her imagination, she was not convinced that Kota had survived. Instead, she believed that the Imperials had captured the vessel and were using it as a means of infiltrating the Rebel fleet. Before she could order the Salvation to open fire, however, Kota requested permission through the comm to board the Salvation. Realizing that Kota actually survived his ordeal as a prisoner in Tarko-se, Eclipse felt guilt for giving Kota up for dead."}, {"tag": "p", "text": "While still waiting for the Rogue Shadow to dock with the Salvation, Kota transferred valuable information to Eclipse's datapad on a cloning operation. The intel included everything the Alliance needed to know in order to launch a successful attack, including floor plans, security systems, and troop deployments. Even more important was the fact that this cloning facility was located too far off in the Outer Rim for Imperial reinforcements to intercept an attack in time. When she inquired about the source of such invaluable data, Kota urged her to wait and see for herself once he arrived on the bridge with the \"source\" of the data."}, {"tag": "p", "text": "Around the same time, an Imperial surprise attack commenced mainly on the Salvation. The ambush was a complete success, and Imperial troops stormed the ship in a relatively short amount of time. When the bridge came under attack, Eclipse and her crew attempted to defend their position, but it was ultimately a futile effort. After seeing PROXY shot in the torso and the rest of her bridge crew fall dead, Eclipse was shot in the shoulder. Although she managed to kill the trooper who wounded her, she was unable to prevent a green-armored figure from stunning her with his blaster, thus causing her to lose consciousness."}, {"tag": "p", "text": "When she awoke, Eclipse realized that she was still on her ship, but restrained by a pair of stormtroopers and the armored figure who captured her, unaware of his identity as the notorious bounty hunter Boba Fett. Although she attempted to probe him for information regarding his purpose for abducting her, Fett only offered her cryptic answers. After deducing that her captor was a bounty hunter, she tried to bribe him by suggesting that the Alliance would double how ever much the Empire was paying him. Fett was slightly amused and declined, stating that he only worked for those who were likely to do business with him again."}, {"tag": "p", "text": "As she was forced to accompany Fett to his ship, Eclipse caught a glimpse of a person who looked exactly like the man she never thought she would see again. In her confusion, she convinced herself that Starkiller had somehow returned from the dead, although she had no way of explaining it to herself. Despite the pain it caused her shoulder, Eclipse struggled once more against the bounty hunter, but to no avail. Fett took her aboard Slave I and made a hasty withdrawal to Kamino where Darth Vader awaited their arrival in Timira City."}, {"tag": "h3", "text": "Held hostage on Kamino"}, {"tag": "p", "text": "On the way to Kamino, Juno Eclipse tried to intimidate Boba Fett by warning him that Starkiller would kill Fett for taking her. The bounty hunter shrugged off Eclipse's veiled threat, stating that he had some experience dealing with Jedi in the past. Eclipse was quick to point out that Starkiller was not a Jedi and that he did not possess their patience or restraint. She slyly implied how a mere mercenary was no match against a Force-wielder who was strong enough to rip Star Destroyers out of the sky. Fett retorted against Eclipse's statements by revealing the truth about Starkiller. The apprentice that Eclipse knew, the original Starkiller, was dead and the \"Starkiller\" that she saw on the Salvation was a clone created by Darth Vader. Eclipse became filled with doubt as Fett described the clone as nothing more than a \"half-mad copy who only thought he was in love with her.\" Although she did not yet believe that Fett was telling her the truth, she tried to reason with him on a more personal level. In desperation, she assumed that even someone like Fett must have loved someone in the past, and thus she implored him to not allow Vader to use her just to hurt Starkiller. Though somewhat affected by her pleading, Fett nevertheless continued to head for Kamino to complete his assignment."}, {"tag": "p", "text": "When Boba Fett reached Kamino, he landed Slave I in Timira City, where Vader was waiting for him and his prisoner. Upon seeing the Sith Lord for the first time since he branded her as a traitor to the Empire, Eclipse felt her body tense out of fear, fully aware of who the bounty hunter's employer had been. After handing Eclipse over to Vader, a pair of stormtroopers forced her to accompany Vader deep inside Timira City's cloning facility. Believing that Vader did not go through so much trouble just to kill her right away, she took her chances and taunted Vader—reminding him of how he was defeated by his former apprentice. She continued mocking Vader, voicing her opinion of him as nothing more than the Emperor's slave with nothing but a minuscule piece of the Empire to maintain his obedience. Eclipse accused Vader of being a coward who was acting out of desperation by kidnapping her. She also told Vader that she did not believe he was responsible for Starkiller's \"return,\" implying her belief that Starkiller somehow managed that accomplishment on his own. Although Vader ignored her remarks the entire time, he eventually paused to signal one of the troopers to gag Eclipse with a sealant patch in order to keep her quiet."}, {"tag": "p", "text": "As they made their way towards the top of the cloning facility, Eclipse noticed multiple cloning tubes containing specimens that all possessed a distinctly familiar face. Then the realization dawned on her—each of the figures contained in a separate cloning tank had Starkiller's face. They were all clones of Galen Marek. Shocked and dumbfounded, her hope that Starkiller was truly alive again was virtually shattered by the discovery that Boba Fett had told her the truth after all. She quickly began putting the pieces together and realized that Vader was indeed responsible for Starkiller's miraculous return, only it wasn't technically \"Starkiller\" whom she saw on the Salvation—just a copy of the original Starkiller who died on the Death Star. As much as Eclipse didn't want to, she was forced to admit that it was the most logical explanation, one that made far more sense than her hope that Starkiller was able to stave off death itself."}, {"tag": "p", "text": "Her mind drifted back to the clone she had seen on the Salvation, causing her to think about the inherent dangers and unreliability of cloning. Considering the fact that many clones went insane in the past due to identity crises, she feared that the first clone she had seen might not be any different. Eclipse was also repulsed by the thought of how the clones were obviously created from the real Starkiller, or more specifically, his corpse's cells. Despite all of her doubt and uncertainty, Eclipse decided to believe that the clone she saw on the Salvation would turn out to be the same hero that the first Starkiller had been. After persuading herself to not judge the clone's feelings as counterfeit, she desperately hoped that Darth Vader would fail in his efforts to mold the clone into a monster, just as he failed to do so with Marek."}, {"tag": "h3", "text": "Clone of Starkiller"}, {"tag": "p", "text": "While held captive by Vader in a tower at the top of the cloning facility, Eclipse took notice of the Salvation, broken into two large fragments, falling out of Kamino's orbit and set on a collision course with Timira City. While the stormtroopers around her were becoming just as nervous as she was, Eclipse noticed how Vader showed no signs of fear at all, crediting his confidence to his strength in the Force. When the first half of the ship smashed into the facility, Eclipse felt that she would not survive, nor was she lost on the irony of a captain being killed by her own ship. Before reaching its destination, however, Starkiller destroyed the last solid fragment of the Salvation to avoid causing damage that could have either harmed or killed Eclipse. When Darth Vader left to confront the clone, Eclipse was left in the tower while her stormtrooper guards established a defensive perimeter around her."}, {"tag": "p", "text": "When Vader returned, the clone arrived shortly after as well. When he refused to serve the Sith Lord ever again, Vader commanded the stormtroopers to execute Eclipse. But a powerful force blast saved Eclipse from their blaster fire and effectively caused the stormtroopers to disappear. Despite this, Vader would not relinquish his best means of controlling his former apprentice. Thus, Eclipse felt an invisible force gripping her throat and lifting her off of the ground. Vader threatened to strangle Eclipse to death with the Force unless Starkiller returned to the Sith Lord's side and submitted completely to the dark side. Despite being on the verge of suffocating to death, Eclipse tried to warn the clone not to give in to Vader's demands. But it was no use since Starkiller couldn't hear her, and Eclipse knew that even if he could have, he wouldn't have done as she said. While she didn't want to be responsible for his return to the dark side, she understood his decision, believing that she would also have done anything to save Starkiller just to be with him. Starkiller, unable to bear the thought of Eclipse's death, dropped his sabers and fell to his knees in submission."}, {"tag": "p", "text": "When Vader released her from his grip, Eclipse noticed that one of the clone's lightsabers rolled near her position. Refusing to be the catalyst for Starkiller's fall to the dark side once more, Eclipse picked up the saber and activated it, attempting to assassinate the Sith Lord while his back was facing her. But at last second, Vader's senses warned him and he just barely dodged the attack, only for Eclipse to damage his chest panel. In retaliation, Vader pushed her in the same exact way Starkiller pushed the stormtroopers. Vader's counterattack was so fast and powerful, Eclipse was barely able to register in her mind what had happened. She could not tell how far he had pushed her, but only knew that she was \"forced\" out of the tower and that the impact of her fall would hurt. When she landed on a platform, the last thing Eclipse felt was rain falling into her open eyes. Before losing consciousness once again, the last thing Eclipse saw was Vader defending himself against an enraged Starkiller."}, {"tag": "p", "text": "When Eclipse regained consciousness, she saw Starkiller cradling her body. Without saying any words, she kissed him. In the aftermath of the battle, she and Kota delivered a report about the Alliance's victory on Kamino to Leia Organa, who was communicating with them through PROXY. They also related their additional success in capturing Vader and preparing to transfer him to Dantooine for trial and interrogation. They did not, however, disclose the details regarding the original Starkiller's clone, who was still unsure of his place in the Alliance. With Vader heavily secured aboard the Rogue Shadow, Eclipse resumed her position as the stealth ship's pilot once more, telling Starkiller to prepare for lightspeed. However, she was unaware that her former captor, Boba Fett, had been hiding Slave I in the debris of an Imperial-class Star Destroyer. When the Rogue Shadow entered hyperspace, the bounty hunter wasted no time in following the starship."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "By 6 ABY, two years after Emperor Palpatine and Darth Vader died at the Battle of Endor, the Rebel Alliance declared the formation of the New Republic in accordance with its primary objective to restore the democracy that had been supplanted by the New Order. However, due to the fact that the Galactic Civil War remained an active conflict, some individuals within the new government believed that recruiting former Imperials was a security risk to the Republic. Another concern was whether or not defection constituted as a pardon for Imperial defectors, particularly war criminals."}, {"tag": "p", "text": "Although Admiral Ackbar acknowledged that the New Republic would have to ascertain if a new recruit's loyalty was genuine or the result of intelligence training, he reminded his niece, Jesmin Ackbar, who was suspicious of ex-Imperials, that the Alliance was composed largely of men and women who were responsible for mass murder during their service under the Empire. When faced with the question of whether or not they could be trusted, Ackbar thought of Juno Eclipse's history. Ackbar admitted that Eclipse, by following Darth Vader's orders during the Bombing of Callos, was responsible for the destruction of an entire planet and all of its inhabitants. On the other hand, Eclipse also risked her life on many occasions for the Alliance, from retrieving the Rebel leaders from the Death Star, to personally recruiting Ackbar into the Rebellion."}, {"tag": "p", "text": "Hence, Ackbar credited her for not only ensuring the Rebel Alliance's survival, but also for contributing to its growth as well. With Juno Eclipse as an example of how even an Imperial war criminal can become a hero of the Rebellion, Ackbar cautioned his niece to be wary of denying essentially anyone the chance at repentance, especially those who would make powerful allies in the New Republic's fight against the Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Outwardly, Juno Eclipse was an exceptional member of the Imperial Navy. But her moral sense of right and wrong conflicted with the ruthless attitude that defined the Empire and its Sith masters. Her conscience would ultimately play a large part in the formation of the Rebel Alliance and the fate of the Galaxy. In addition to her strong moral guidelines she was also a gifted student, skilled pilot, talented mechanic and model officer."}, {"tag": "p", "text": "Being among the first generation born under the Galactic Empire, Juno Eclipse was virtually a product of the Imperial propaganda that sought to bind the citizens of the former Republic to the New Order. As a child, Juno was exposed to her father's anti-Jedi sentiment and fierce loyalty to the Empire. But despite such influences, Juno never developed a strong sense of hatred for the Jedi or fanatical loyalty to the Empire; her only desire was to obtain her father's approval. But even with all of her achievements at a young age, as well as graduating as one of the youngest students ever accepted into the Imperial Academy, she failed to impress her father. Believing that her dedication and perseverance had been invested in an unobtainable goal, and convinced that her father had turned his back on his own daughter, Juno likewise turned her back on him and looked to the Imperial Navy as her \"family.\""}, {"tag": "p", "text": "While serving as the commanding officer of Darth Vader's Black Eight Squadron, Captain Eclipse was well aware of how her meteoric rise through the Imperial hierarchy culminated to a position directly under the second most powerful man in the Empire, and thus she was filled with a great sense of pride. But despite her loyalty to the Empire, Juno also carried a strong sense of morality, even to the point where she questioned Vader's ruthless tactics during the Battle of Callos. Although she followed her orders to the letter, Juno was shocked and horrified at the extent the Empire had gone to make an example of traitors. Her role in the planet's destruction burdened Juno with guilt, but did not prevent her from continuing her service to the Empire. Even then, however, she came to wonder if the Empire wasn't what she initially believed it to be."}, {"tag": "p", "text": "When she was secretly reassigned to ferry Darth Vader's secret apprentice throughout the galaxy, Juno was somewhat curious about the young man, known to her only by his callsign \"Starkiller.\" Although uncomfortable around each other at first, Juno gradually developed a rapport with Starkiller. Her relationship with the apprentice would grow as they embarked to form the Rebel Alliance to fight the tyranny of the Empire. Eventually, she fell in love with Galen Marek (Starkiller's birth name), a feeling which he reciprocated, thus causing Juno to be the most responsible factor behind the apprentice's redemption from the Sith. When Marek died saving the Alliance leadership from certain death, Juno mourned Marek's death, causing her to commit her life to the Alliance in the hopes of ensuring that Marek's sacrifice was not in vain."}, {"tag": "p", "text": "Regarding PROXY, Juno was not particularly fond of the holodroid. She found it strange that Marek considered the droid as a friend, despite the fact that PROXY was programmed to kill his Master. Her initial discomfort with PROXY faded after Marek's death. After repairing the holodroid and learning that Marek had left it to her in the event of his death, Juno kept PROXY at her side when she became the commanding officer of the Salvation. In effect, she apparently perceived the droid as the only thing she had left of Marek."}, {"tag": "p", "text": "As with PROXY, Juno Eclipse did not care much for General Rahm Kota. During her time with the Empire, Kota was just another fugitive and enemy of the Empire as far as Juno was concerned. Working with Marek, she aided the apprentice during his mission to hunt down and execute the Jedi General. When they discovered that Kota survived, Juno hesitated with Marek's plan to enlist the Jedi's help, fearing that he would discover who they truly were. She tried to remain as distant from Kota as possible and was evasive with his questions. After Marek's death, Juno took solace in the knowledge that Marek was one with the Force and that she was the most responsible for his conversion to the light side of the Force, as revealed by Kota. When the two went on to serve in the Rebel Alliance, Juno viewed the general as a close friend and indispensable ally. She even went to extreme lengths to cover up his unsanctioned missions, if only to ensure that Kota's disagreements with the Alliance leadership did not lead the general to turn his back on the Alliance altogether."}, {"tag": "p", "text": "Upon discovering a renegade clone of Galen Marek, she was both stunned and elated, believing at first that the secret apprentice had somehow overcome death itself. She was shocked when Boba Fett revealed that the man she saw was just a clone whose artificial feelings belonged to the dead man that loved her. Juno refused to believe that the clone was anyone else other than the real Marek, mainly out of desperation and desire to believe that Galen was alive again. She stubbornly clung to her delusion until Darth Vader revealed a batch of failed clones that were based on Marek's genetic code. The revelation caused Juno to feel all of the sadness and remorse she felt over Galen's death once more. Nevertheless, she forced herself to believe that the clone who sought her out would turn out to be the same hero as the original Starkiller. But even as she redoubled her faith in the clone, she was saddened by the fact that her original theory—Galen Marek's survival against all odds—was proven to be false and that a clone had essentially taken his place."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Juno Eclipse was created for Star Wars: The Force Unleashed and, in the game, the player character shares a love interest with Eclipse. Juno Eclipse is portrayed by British actress and former model Nathalie Cox."}, {"tag": "p", "text": "In casting the role of Juno Eclipse, LucasArts decided that they wanted an actress with a British accent. Darragh O'Farrell and the voice team traveled to London, England and gave information and concept art of the character to casting director Kate Saxson. From there, LucasArts interviewed many different actresses and were close to casting the part several times. Though many of the early contenders had energy and looked the part, they lacked the attitude and personality that LucasArts was looking for. As time was running out to cast the role, LucasArts began making concessions and changes to their idea of Eclipse to match the candidates, which they realized after meeting Cox and recognizing that she had the integrity and poise needed of the character, along with the ability to show her emotional connection to Starkiller without words."}, {"tag": "p", "text": "A leaked Hasbro computer database was the first source to reveal Juno's name. Her name was later confirmed by the March issue of Game Informer. The name Juno Eclipse is a reference to the Roman Goddess Juno, who was essentially the queen of the gods in the Roman Pantheon. The name was also originally considered to be the name of Asajj Ventress, but was rejected as \"not villainous enough.\""}, {"tag": "p", "text": "The cheat code \"ECLIPSE\" enables the player to take on the form of Juno Eclipse in the Wii, PSP and PS2 versions of the first game."}, {"tag": "p", "text": "Due to conflicting information between the video games and their novelizations, there is a discrepancy regarding the squadron that Juno Eclipse served with just before her reassignment to the Rogue Shadow. The first game and its sequel both describe Eclipse as the former commander of the \"Black Five Squadron.\" However, the first and second novelizations state that she commanded the Black Eight Squadron instead, which is further supported by the The Essential Guide to Warfare."}, {"tag": "h3", "text": "The Force Unleashed: Alternate Dark Side Ending"}, {"tag": "p", "text": "Instead of saving Rahm Kota and the Rebel Alliance leaders, Galen Marek chose to give into his hatred by taking his revenge on Darth Vader for the years of abuse he had experienced at the hands of the Sith Lord. After an intense battle, Vader was slain, in typical Sith fashion, by his former apprentice. Afterward, Marek returned to Emperor Palpatine's side where the Sith Master proclaimed Marek as his new apprentice. When Marek was ordered to kill Kota, as a final test to become a true Sith apprentice, he turned to strike the Emperor down with his lightsaber. Darth Sidious easily disarmed him, killed the former Imperial Senators, and subsequently grasped the Rogue Shadow, which was orbiting the Death Star, with the Force. Sidious pulled it through the window of the throne room and onto Marek, severely injuring him and, presumably, killing Juno in the process."}, {"tag": "h3", "text": "The Force Unleashed II: Alternate Dark Side Ending"}, {"tag": "p", "text": "During the Assault on Kamino, a rogue clone of the original Starkiller defeated Darth Vader in combat shortly after the Sith Lord attacked Juno Eclipse. Despite General Rahm Kota's advice that Vader be taken as a prisoner of the Rebel Alliance, the clone chose to exact vengeance on his Master by striking him down in anger. But just as he raised his lightsaber to deliver the final blow, the clone was stabbed through the chest by Vader's Dark Apprentice, the only perfect clone of Starkiller who was ordered to remain hidden until his interference was absolutely required. In the last moments of his life, the imperfect clone looked at Juno for the last time and saw as she died, and then succumbed to his fatal wound. Before Vader's new apprentice left to embark on his mission to exterminate the last of the Rebels, Marek's dark clone looked at Juno's dead body. Although he was initially affected by his template's memories for her, the apprentice succeeded in purging himself of the emotional imprints—including Marek's feelings for Eclipse."}, {"tag": "h3", "text": "Non-Canon Appearance"}, {"tag": "p", "text": "Sometime before the death of Shaak Ti, a nebula in the Cowl Crucible drew the attention of Darth Vader. The Cowl seemed to be a portal to a world filled with power. While Lord Vader was communicating through the Force with his apprentice, telling him of the power inside the Cowl, the crew of the Rogue Shadow became trapped in a storm near the nebula. Juno called for Starkiller's assistance as only his powers would be enough to avoid a catastrophe. Unfortunately, the Sith Acolyte could not assist as he was experiencing visions of his own. Ultimately, the ship crashed and while Juno attempted to make the necessary repairs, Starkiller took off, following his visions. Vader eventually found Captain Eclipse and asked her where his apprentice had gone. She told him he had left, obviously agitated and that he'd left no indication as to why. Vader's only comment was that he wouldn't have, as she was blind to the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}