{"url": "Annoo_resistance", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Resistance groups"], "nodes": [{"tag": "h1", "text": "Annoo resistance"}, {"tag": "p", "text": "The Annoo resistance was a resistance movement against the Galactic Empire, led by Demma Moll on Annoo during the early years of the New Order which also opposed the rise in power of criminal organizations, most notably the Fromm Gang."}, {"tag": "p", "text": "When the resistance discovered that the Fromm Gang were constructing a powerful weapons satellite, Trigon One, which they intended to use to take over the other gangs, Demma charged her daughter, Kea, with finding and destroying Trigon One. With the assistance of the speeder racers, Thall Joben and Jord Dusat, along with their droids, R2-D2 and C-3PO, Kea succeeded in breaking into Tig Fromm's secret base on Ingo and stealing Trigon One."}, {"tag": "p", "text": "While Joben hid the weapons satellite in a forest on Ingo, the Fromm Gang kidnapped Demma and Dusat from Demma Moll's farm on Annoo. Joben agreed to reveal the location in exchange for their release. Tig Fromm went to retrieve Trigon One, but Joben and R2-D2 had sabotaged the guidance system, causing the ship to collide with and destroy Sise Fromm's base on Annoo."}, {"tag": "p", "text": "The loss of Trigon One caused financial ruin for the Fromm's and caused the fall of the Fromm Gang, a major victory for the fledgling resistance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Star Wars Droids episode, \"Escape Into Terror\", when R2-D2 and C-3PO discover that Kea and Demma Moll are part of the resistance, C-3PO says \"Mistress Kea never told us she was part of the Rebel Alliance.\" However, it has since been established that the Rebel Alliance didn't exist until the signing of the Corellian Treaty several years after the events in Droids making this impossible. Therefore, the name of the resistance movement at this time remains conjectural."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}