{"url": "Jurga", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Crime lords", "Category:Hutts", "Category:Males"], "nodes": [{"tag": "h1", "text": "Jurga"}, {"tag": "p", "text": "Jurga was a Hutt crime lord living in the galaxy. In defiance of laws prohibiting the possession of Tenloss disruptors, Jurga openly wore one of the weapons to symbolize his power. However, an irate employee later used the weapon to kill the Hutt."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Hutt, Jurga was a crime lord operating in the galaxy. He was known to openly wear a Tenloss disruptor weapon to symbolize his power in defiance of laws that were in place on many planets which made the ownership of disruptor weapons to be a capital offense. Jurga was later disintegrated by an outraged employee who used the weapon to end Jurga's life."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jurga blatantly disregarded laws establishing the possession of a Tenloss disruptor as a capital offense merely to wear the weapon as a symbol of power."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "The crime lord Jurga the Hutt owned a Tenloss disruptor weapon that he wore on a sash."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jurga the Hutt was first mentioned in an entry for Tenloss disruptor weapons in the 2002 Wizards of the Coast Star Wars Roleplaying Game sourcebook Arms & Equipment Guide, which was written by Jeff Grubb and Owen K.C. Stephens. While the book did not establish the era when Jurga was alive, the Tenloss disruptor weapons featured in the source were available from the Rise of the Empire era to the New Jedi Order era. From this information, it can be determined that Jurga would have lived at some point during the last years of the Galactic Republic, during the time of the Galactic Empire, or during the reign of the New Republic."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}