{"url": "Jurgan_Kalta%27s_assault_rifle", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Blaster rifles", "Category:Ion rifles", "Category:Personal weapons"], "nodes": [{"tag": "h1", "text": "Jurgan Kalta's assault rifle"}, {"tag": "p", "text": "Jurgan Kalta's assault rifle was the favorite weapon of the Zabrak mercenary Jurgan Kalta, who was active before the Great Sith War. The weapon was capable of dealing both ion damage and the standard damage dealt by a blaster. Sometime after Kalta's death, this accurate, high-powered assault rifle came into the possession of the Twi'lek businessman Crattis Yurkal."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Jurgan Kalta's assault rifle was much more accurate than the standard blaster rifle. It had increased effectiveness against droids since it dealt ion damage, as well as the standard energy damage caused by a blaster. Due to its size, firing the weapon effectively required two hands. The weapon had a silver-blue finish and had an effective range of twenty-eight meters, which was comparable to other blaster rifle designs in use during the Jedi Civil War. The rifle was able to receive upgrades to its energy cell, firing chamber, scope, and trigger."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Zabrak mercenary Jurgan Kalta, who was active before the Great Sith War and known for his adaptability, owned this assault rifle prior to his death from a gaxxan brain-slug, which occurred by the year 3956 BBY. Even though Kalta owned a powerful carbine, the assault rifle was his favorite firearm, as the weapon's adaptability complemented his own. By 3956 BBY, the weapon was owned by the Twi'lek businessman Crattis Yurkal. He had the weapon for sale at his store, Aratech Mercantile, in the Jedi Enclave on the planet Dantooine, for 8,000 credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jurgan Kalta's assault rifle appeared in Star Wars: Knights of the Old Republic, a 2003 video game produced by BioWare. In the game, it was a unique, upgradeable weapon that the player could purchase from Crattis Yurkal at his shop inside the Jedi Enclave on the planet Dantooine. Compared to the standard blaster rifle, the weapon's statistics had a large increase to the attack bonus, as well as a large ion damage bonus against droids. While the game does not state when the assault rifle was constructed, 2008's The Complete Star Wars Encyclopedia established that Jurgan Kalta was active before the Great Sith War, which occurred in 3996 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}