{"url": "Annora_Calandra", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Hunters", "Category:Mining Guild employees"], "nodes": [{"tag": "h1", "text": "Annora Calandra"}, {"tag": "p", "text": "Annora Calandra was a Mining Guild regional Inspector Auditor during the Galactic Civil War who operated in the Tapani sector."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "She spent most of her time traveling to members of the Mining guild to collect their membership fee. Prior to the Battle of Hoth Annora was a short slight women in her mid-thirties. Although she looked frail she was more than capable of holding her own in a brawl, being adept at a number of self-defense martial arts."}, {"tag": "p", "text": "Annora was involved in a plot to blow up an Imperial Torpedo Sphere docked at the Tallaani Shipyards for maintenance. Her co-conspirators in this endeavor were Lord Vaskel Savill of House Melantha and Doctor Arkeld of the Justice Action Network. The Expanse Mining companies were forced to pay crippling tariffs to transport their ore through the Freeworlds Territory. Annora, frustrated by her superiors who did not want to be implicated in a scheme to bring the Empire into the Tapani sector, hoped that destroying the Torpedo sphere would hasten the Imperial subjugation of the Freeworlds and lead to the lifting of the tariffs. Her primary purpose in this conspiracy was to assemble a coalition of Mining Guild members who would be willing to deal with House Melantha when the Empire took control of the Freeworlds. Her second task was to contact the Nok Cartel and arrange for them to attack shipping convoys in Cadriaan Province so to draw Imperial ordnance away from Tallaan."}, {"tag": "p", "text": "Annora was a participant in the annual Vor-cal prior to the events of the Battle of Hoth. Derel Volk was originally scheduled to represent the Mining Guild at this event but Annora and her fellow plotters arranged for Derel to be sent elsewhere. It was at this event that the three main conspirators met to finalize the operation to destroy the Torpedo sphere. Unknown to Annora, it was Lord Savill's intention to kill the mining guild official once she had served her purpose."}, {"tag": "h2", "text": "Sources"}]}