{"url": "Justicars%27_Brigade", "categories": ["Category:Legends articles", "Category:Military units"], "nodes": [{"tag": "h1", "text": "Justicars' Brigade"}, {"tag": "p", "text": "The Justicars' Brigade, also simply known as the Justicars, was a militia in Coruscant's Underworld during the Cold War. In the aftermath of the Sacking of Coruscant, Coruscant's government pulled Coruscant Security Forces due to limited resources leaving the area vulnerable to armed gangs. Ex-Republic soldiers, angered by the violence the gangs brought, formed a militia calling themselves the Justicars and set about brutally restoring order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the aftermath of the Sacking of Coruscant, crime syndicates, such as Black Sun, took advantage of the upheaval on Coruscant and began seizing control of the planet's lower levels. With sparse resources, the Republic was unable to counter the takeover and the Coruscant Security Force (CSF) was withdrawn to protect more vital areas. In response, a group of ex-soldiers formed the Justicars' Brigade, a militia later simply known as the Justicars. Their intent was to defend not only their homes, but to retake their neighborhoods. As the backlash from Black Sun began, the Justicars took harsher steps to retake control, declaring curfews and eventually martial law. The area they seized was soon called the Justicars' Sector and an old CSF facility was renamed the Justicars' Tower and set up as their headquarters. Armed security patrols were authorized to use lethal force against those who did not possess the proper clearances as defined by the Justicars."}, {"tag": "p", "text": "Justicar forces continued the fight to retake various areas of Coruscant, as well as acting as a self proclaimed security force. With some citizens within their territory, the Justicars became unpopular. Many saw them as genuine cops and soldiers, but could see little difference between them and the gangs in how they treated people. Former Republic trooper Larin Moxla, a denizen of the lower levels, did not approve of their methods, seeing them as as bloodthirsty and lawless. Though at first happy with the formation of the militia and eager to work with them, CSF soon found itself pushed out of the territory along with the gangs. The government of Coruscant declared the Justicars a threat and the Justicars subsequently cut off all communication with outsiders. The entrance to their territory was heavily guarded and few were allowed in except for with proper clearances. Justicar security officers would often conduct checks and arrest persons at the taxi speeder station just outside the gate with no interference from a token few CSF police officers assigned to the area."}, {"tag": "p", "text": "Not all members of the Justicars joined by choice. Ordinary citizens, if caught breaking a law, such as curfew in their territory, would sometimes be pressed into indentured service into the Justicar fighting forces. The Justicars either did not have the means, or simply did not care, to check if a citizen was actually a legal adult when forcing one into service, only that they appeared to be physically old enough."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Justicars were created for Star Wars: The Old Republic, a massively multiplayer online roleplaying game developed by BioWare and released on December 20, 2011. They first appeared in The Old Republic: Fatal Alliance, a novel by Sean Williams, published on July 20, 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}