{"url": "Justice_(Harrower-class)", "categories": ["Category:Legends articles", "Category:Flagships", "Category:Harrower-class dreadnoughts", "Category:Starships of the resurgent Sith Empire"], "nodes": [{"tag": "h1", "text": "Justice (Harrower-class)"}, {"tag": "p", "text": "The Justice was a Harrower-class dreadnought in the service of the reconstituted Sith Empire during the Cold War."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Justice was the flagship of Commander Harron Tavus, a former officer of the Republic Army's Special Forces Division and commander of Havoc Squad. The ship was given to him by the Empire after he and hundreds of other SpecFor officers and troopers defected in 3643 BBY, in response to their increasing disillusionment with the Galactic Republic. The ship was named by Tavus himself, possibly an allusion to his motivations for defecting. As the Harrower-class dreadnoughts were the backbone of the Imperial Armada, the fact that such a vessel had been placed into the hands of a Republic defector suggested that the Empire held great faith in Tavus."}, {"tag": "p", "text": "After the Lieutenant who had taken command of a reformed Havoc Squad began hunting down and eliminating the defectors and their resources on Taris, Nar Shaddaa, Tatooine and Alderaan, Tavus recalled his remaining allies to the Justice, but his transmissions were all intercepted by Special Forces. General Elin Garza, commander of the Special Forces Division, dispatched Havoc Squad to the Justice under the guise of answering Tavus' call. Their mission was to first disable the ship's hyperdrive, then proceed to the bridge and neutralize Tavus."}, {"tag": "p", "text": "After disabling the hyperdrive and defeating Wraith, the last of the Havoc traitors under Tavus' command, Havoc Squad proceeded to the bridge and defeated Tavus. General Garza then boarded with her guard troopers to take possession of the ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}