{"url": "Jutka", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Admirals and generals", "Category:Males", "Category:Tuhgri"], "nodes": [{"tag": "h1", "text": "Jutka"}, {"tag": "p", "text": "Jutka was a male Tuhgri from the moon Dayark in the Kathol Outback. In 8 ABY, he was commander of a small starship. On route to the planet Danoor in the Nah'Malis system, Jutka's ship was forced to make an emergency maneuver when an Aing-Tii Sanhedrim ship dropped out of hyperspace in front of them. Skimming through an energy tendril from the nearby Kathol Rift—a dense gas cloud fraught with lightstorms—the ship's controls were completely ionized, forcing the eight-being crew to abandon ship in a single escape pod."}, {"tag": "p", "text": "Drifting in an escape pod, Jutka detected a faint energy reading in the Duhrib Belt, an asteroid field orbiting between the system's fourth and fifth planets. Tracking the signal, the Tuhgri discovered a damaged mining drone that Jutka hoped could be used to signal their homeworld, or attract rescuers to their plight. During their repair operations, the Tuhgri met representatives from the crew of the FarStar, a New Republic vessel, who were engaged in recovering the drone for the government of Danoor. Working together, they salvaged the drone, and Jutka and his crew escaped the asteroid."}, {"tag": "p", "text": "Eleven years later, in 19 ABY, Jutka served the Kathol Republic as a general and commander of its armed forces. Following a skirmish between Talon Karrde's Wild Karrde and Corsair-class assault starfighters belonging to the Rodian pirate Rei'Kas in the Episol system, Jutka met with Karrde. He warned the smuggler that the Kathol Republic wanted no part in the war between Rei'Kas and Crev Bombaasa—under whose protection Karrde was flying—and that the Rodian would not stop hunting Karrde while he was in his territory."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Incident at Danoor"}, {"tag": "p", "text": "A native of Dayark within the region of space known as the Kathol Outback, the Tuhgri male Jutka commanded a starship crewed by seven of his fellow Tuhgri. In 8 ABY, the ship was heading for the planet Danoor in the Nah'Malis system on the edge of the Kathol Rift, a violent and turbulent area consisting of dense gas clouds, energy streamers and lightstorms. As the vessel skirted the edge of the Rift, an Aing-Tii Sanhedrim ship emerged from hyperspace directly in their path. Forced to make an evasive maneuver, the vessel came in contact with one of the Rift's tendrils. The energy discharge ionized the ship's primary and secondary systems, rendering the vessel inoperable. As the ship drifted closer to the Rift, Jutka gave the order to abandon ship, and all eight crew members used the vessel's escape pod."}, {"tag": "p", "text": "The escape pod made it as far as the Duhrib Belt, an asteroid field orbiting between the system's fourth and fifth planets. Jutka detected an energy signature emanating from a mining drone used by the citizens of Danoor to mine the asteroids for raw materials and ores. Tracking the signal through the asteroids, the Tuhgri eventually lost the signal and had to scan for durasteel rather than energy readings. The readings led them to a massive asteroid at the heart of the belt, and they discovered that the drone was stuck in a crevasse. Descending into the crevasse, the Tuhgri found the drone, and Jutka hoped that they could use it to send a message back to their people, or—at the very least—attract the attention of rescuers who could get them to the nearest inhabited planet. However, the drone's repulsor power modulator was damaged, and they lacked the tools they needed to repair it, forcing them to cannibalize their escape pod to create makeshift tools. Donning vacuum suits, Jutka and the Tuhgri began to repair the drone."}, {"tag": "h3", "text": "Encounter with the FarStar"}, {"tag": "p", "text": "As the Tuhgri worked on the drone, Jutka became aware of tremors running through the asteroid, and theorized that they were caused by smaller asteroids impacting upon the one they were inside. During the repair process, Jutka and the Tuhgri left the mining drone to return to their escape pod. When they returned to the drone, they found a small group of strangers attempting to retrieve the drone. Initially, the Tuhgri charged at the group, brandishing their makeshift tools as weapons. However, when the new arrivals showed no intent of hostile action against them, Jutka ordered his crew to stand down and approached them."}, {"tag": "p", "text": "The new arrivals explained their presence—they were members of the crew of the New Republic CR90 corvette FarStar, and were helping the government of Danoor in retrieving their drone in exchange for information on locating a navigator who could pilot their vessel through the Kathol Rift. In turn, Jutka explained the predicament that he and his crew found themselves in. Agreeing to work together, the Tuhgri and the FarStar party repaired the drone. As they finished the work, the asteroid tremors became more violent, beginning to crack the rock walls of the crevasse and sending debris raining down onto the two groups. The Tuhgri raced for the safety of the vessel that had ferried the FarStar's crew down into the crevasse—an Aegis-class combat shuttle—along with their new allies. The shuttle lifted off, heading back to the surface of the asteroid to rendezvous with the corvette FarStar. On the way out, the shuttle pilot had to avoid falling slabs of rock, and use the blaster cannons to clear debris from the crevasse's entrance. Jutka and his Tuhgri were then taken back to Danoor."}, {"tag": "h3", "text": "Encounter with Talon Karrde"}, {"tag": "p", "text": "Eleven years later, Jutka had joined the Kathol Republic, holding the rank of general and serving as commander of its armed forces. Based on Dayark in the Episol system, Jutka kept a close eye on both Corellian crime lord Crev Bombaasa's cartel, and the organization of the Rodian pirate Rei'Kas. He felt that both posed a threat to the stability of the Republic, as they were involved in a gang war. Following a skirmish involving the Action VI transport Wild Karrde and four of Rei'Kas's Corsair-class assault starfighters in the system, Jutka requested to meet with the smuggler Talon Karrde, owner of the transport."}, {"tag": "p", "text": "Jutka arranged to meet Karrde and his associate, the former Mistryl Shadow Guard Shada D'ukal, in a tapcafe near the spaceport in the capital city of Rytal Prime. For the meeting, Jutka dressed in civilian clothing, although he was not comfortable being out of uniform, and disliked the presence of the protocol droid C-3PO at the meeting. He told the smuggler that the Kathol Republic wanted no part in the conflict that was occurring between Bombaasa's cartel and Rei'Kas's pirates. As Karrde's ship was equipped with a unique ID overlay that identified it as under Bombaasa's protection—Bombaasa had given it to him as payback for an incident several years earlier when two of his associates had saved Bombaasa's life—Rei'Kas had attacked the ship. Karrde was surprised to learn that Jutka knew the identity of Rei'Kas, as Bombaasa did not, despite the fact that it was his organization that was under attack. Jutka was worried that their conflict threatened to spill over into Kathol Republic territory, and warned Karrde that the Rodian would continue to pursue him all the time he was in Rei'Kas's territory."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Jutka was a capable commander, able to make snap decisions to save the lives of his crew and then devise a plan to have them rescued when they found themselves stranded in the Nah'Malis system. Although initially wary of the FarStar crew, Jutka was able to be diplomatic when he realized that they meant him and his crew no harm, and was able to convince the New Republic representatives to work with the Tuhgri towards a common goal."}, {"tag": "p", "text": "As a military officer, he was uncomfortable when out of uniform; on the occasion he met Talon Karrde in a tapcafe, he was wearing a Crosh-hide jacket that was the height of fashion on Dayark and showed visible signs of discomfort. An intimidating and menacing individual when the situation warranted it, Jutka was genuinely concerned for the safety of the Kathol Republic, and worked hard to ensure that they were not caught in the gang war between Bombaasa's cartel and Rei'Kas's pirates. He also harbored a dislike for droids, ordering C-3PO—who was accompanying Karrde—to shut up or be forcibly shut down."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Jutka was introduced in the RPG adventure Galaxy's Edge, written by George R. Strayton, which appeared in The Kathol Outback, the second supplement for The DarkStryder Campaign. A character named Jutka later appeared in Vision of the Future by Timothy Zahn, although this Jutka was presented as a heavyset Human, rather than a Tuhgri. Both characters were, however, present in stories set in the Kathol Outback. In 2008, The Complete Star Wars Encyclopedia finally established that both characters were actually the same individual, and that he was a Tuhgri despite his description as a Human in Vision of the Future."}, {"tag": "p", "text": "In the adventure Galaxy's Edge, it is possible for the crew of the FarStar to engage the Tuhgri in battle upon their first meeting. As the Tuhgri charge the crew with makeshift tools upon seeing them, the players have the option of taking aggressive action in response. If this option is taken, a fight immediately occurs. However, the adventure continues with the assumption that the FarStar crew and the Tuhgri are working together to salvage and repair the drone."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}