{"url": "Jysella_Horn", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Coruscanti", "Category:Females", "Category:Galactic Alliance individuals", "Category:Humans", "Category:Jedi Knights of the New Jedi Order", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Jysella Horn"}, {"tag": "p", "text": "Jysella Horn, nicknamed Sella, was a female Human Jedi Knight in the New Jedi Order. As of 43.5 ABY, Jysella carried a blue-bladed lightsaber. She was the daughter of Corellian parents, Corran Horn and Mirax Terrik Horn, and the younger sister of Valin Horn. In 43.5 ABY, she was one of the first Jedi to succumb to a mysterious illness."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (16 ABY–40 ABY)"}, {"tag": "p", "text": "Jysella was born around 16 ABY. By 25 ABY, she was a student at the Jedi Praxeum on Yavin 4, and she had spent more of her young life being trained there than she had living with her parents.[source?]"}, {"tag": "p", "text": "After the Yuuzhan Vong attack on Yavin, Jysella spent a number of months aboard her grandfather Booster Terrik's ship Errant Venture with her family, before being moved to the Shelter base in the Maw with the other Jedi children. At the end of the Yuuzhan Vong War, she was still grouped among the younglings, but she was one of the many Jedi who gathered in the Jedi conclave on Zonama Sekot.[source?]"}, {"tag": "p", "text": "By 40 ABY, Jysella was a Jedi Knight on active duty. As tensions between Corellia and the Galactic Alliance developed into an interstellar crisis, Luke Skywalker tactfully assigned her to a mission far away from her homeworld, to avoid a conflict of loyalties when the Jedi were called on to serve as Alliance commandos and starfighter pilots in Operation Roundabout and subsequent missions."}, {"tag": "h3", "text": "Psychosis (43 ABY)"}, {"tag": "p", "text": "In 43.5 ABY, Jysella was the third known Jedi to become ill with the mysterious Force psychosis that afflicted both her older brother Valin and Jedi Knight Seff Hellin. During an attempt to seek information on the illness with Master Cilghal, Jysella snapped and immediately saw the Master as an impostor. Unlike her brother, who experienced intense anger, she was motivated by fear. Jysella attempted to escape from the temple and then when evaluating the situation unintentionally flow walked into the future and saw her path of escape. This knowledge allowed her to know exactly where the secret security droids were hidden at the Temple's entrance, and she quickly disabled them."}, {"tag": "p", "text": "Jysella continued to flee the Temple, Force hurling pedestrians out of the way and screaming in terror that those whom she knew best were not themselves. Two of her best friends, Bazel Warv and Yaqeel Saav'etu, who had also been Valin's best friends, were on the scene and quickly attempted to stop her once they realized she was afflicted. The two Jedi were unsuccessful and Jysella was apprehended by GA security. The entire scene was recorded by journalist Javis Tyrr. Chief of Staff Natasi Daala arrived soon after and addressed the crowd; explaining that Jysella was now under GA jurisdiction and would be frozen in carbonite alongside her older brother.[source?]"}, {"tag": "p", "text": "When a group of Jedi executed a court-approved document to visit the carbonite-frozen Horn children, the group, along with the press, discovered the two Jedi displayed over an aquarium in the main office lobby of the Galactic Justice Center. While the Horns were still frozen, Daala continued to clamp down on the Jedi. Bazeel and Yaqeel became psychotic and were apprehended by the Solos and Jagged Fel. But before GAS could apprehend them, Jagged Fell and the Solos managed to whisk them away. Later three more sheltered knights Sothias Saar, Kunar Baan, and Turi Altamik became sick. And when Acting Grand master refused to hand over Sothias and Turi (Kunar was apprehended in the temple so Daala didn't know about him.) into Alliance custody, Daala sent a battalion of Mandalorian soldiers and vehicles to lock down the temple. A day later when the psychotic knights had recovered from the illness, thanks to indirect efforts of Luke Skywalker, Ben Skywalker, and a fleet of Sith, Daala publicly agreed to call off the siege, but refused to release Valin and Jysella until she was satisfied that the Jedi would hide nothing from her."}, {"tag": "h3", "text": "Release"}, {"tag": "p", "text": "Acting Grand master Kenth Hamner tried to keep the Jedi order from taking any action to release the kids because it would void his secret unsanctioned deal with Admiral Nek Bwua'tu. The entire Council was upset at Kenth, especially Corran Horn, the father of Valin and Jysella, at the Grand Master allowing his children to remain at Daala's mercy, accusing him of stalling. Later Daala hired a company of Mandalorians to 'put down' a crowd of pacifist Octusi servants on Blaudu Sextus, resulting in a merciless slaughter."}, {"tag": "p", "text": "After waiting impatiently for the chance to launch their StealthXs due to Grand Master Kenth Hamner attempting to buy time for Admiral Bwua'tu to wake up, they told him that they must launch now, before it was too late, he still rebuked them. Finally Han Solo forced him to reveal his deal with Bwaatu and the entire Council stripped him of his title and confined him to his quarters. Luke had Ben secretly ask the Temple for backup on the Moon of Pydyr to deal with Abeloth and the Lost Tribe. To that end the Jedi came up with a plan to both reinforce the Skywalkers, and rescue Jysella and Valin."}, {"tag": "p", "text": "Their grandfather Booster Terrick brought the Errant Venture into Coruscant's orbit to host a sabacc tournament,with dozens of political and social elites, including Chief of Staff Wynn Dorvan joining the fifty-million credit prize sabacc tournament, Booster began opening fire on the Coruscant's climate control system and diverted the Galactic Alliance Fleet's attention long enough to give the Jedi a chance to launch their StealthX strike team without a shot being fired. In the chaos Jaina, Leia, and Han Solo led another strike team consisting of Zekk, Terran Zel, and many of the recently recovered knights to break into the GA detention center and recover Horn siblings' carbonite pods. With the Jedi StealthX fleet gone, the Horns lost, and Imperial head of state Head of State Fel withdrawing from negotiations with the Galactic Alliance, GA Chief of State Daala had lost all of her leverage against the Jedi order and was publicly humiliated. Soon Corran and Mirax were present when Cilghal unfroze the kids from carbonite.[source?]"}, {"tag": "p", "text": "Unknown to the Jedi at that time, the Horn siblings were still affected by the Force illness they had suffered from before they were frozen. When the Jedi were distracted storming the Senate and capturing the Chief of State Daala, Jysella and Valin Horn asked for the help of journalist Kandra Nilitz in getting them to Nam Chorios and destroying their trackers in exchange for an exclusive news story."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In an online chat (and thus not part of the canon), Michael A. Stackpole revealed that Jysella Horn is named after her maternal grandmother, Jysella Terrik. This was later confirmed and added to canon in the Scum and Villainy sourcebook published by Wizards of the Coast where her maternal grandmother is named."}, {"tag": "p", "text": "Jysella's age is nowhere closely defined in canon, though the fact that she is not mentioned in Specter of the Past, Vision of the Future or Star Wars: Union suggests that she was born no earlier than 19 ABY. In fan fiction, she is often depicted as being closer in age to her brother Valin than seems possible from canon, which has led to many fans believing her character to be older than she is. However, some fans have also underestimated the range of her possible age, placing her birth closer to 25 ABY than seems implied at her introduction in The New Jedi Order: Dark Tide I: Onslaught."}, {"tag": "p", "text": "The preview at the back of the novel Fate of the Jedi: Outcast includes an excerpt from the forthcoming novel Fate of the Jedi: Omen, which features Jysella as a prominent character. The preview, written from Jysella's point of view, states that Jysella is ten years younger than Valin, making her birth year around 23 ABY. However, when Fate of the Jedi: Omen was released, this information was changed to 3 standard years, putting Jysella's birth year around 16 ABY."}, {"tag": "p", "text": "On page 362 of the hardcover edition of Fate of the Jedi: Vortex, her name is misspelled as \"Jysell Horn\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}