{"url": "K%27Kruhk", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Cleanup", "Category:Articles in need of updating", "Category:Jedi Council members of the New Jedi Order", "Category:Jedi Generals", "Category:Jedi Purge survivors", "Category:Males", "Category:Post-Ruusan Jedi Masters", "Category:Whiphids"], "nodes": [{"tag": "h1", "text": "K'Kruhk"}, {"tag": "p", "text": "K'Kruhk was a male Whiphid Jedi Master who lived from around the end of the Galactic Republic to the time of the One Sith and the Second Imperial Civil War as a member of the New Jedi Order. An apprentice of Lilit Twoseas, K'Kruhk survived his Master's death during the Yinchorri Uprising and went on to serve with distinction in the Clone Wars. A disastrous loss of life at Teyr led K'Kruhk to question his cause, and he joined a dissident movement on Ruul. Betrayal by one of his own, however, caused him to reaffirm his absolute loyalty to the Republic and the Jedi High Council, and he would go on to serve on Saleucami in the final weeks of the Outer Rim Sieges."}, {"tag": "p", "text": "Despite countless brushes with death, K'Kruhk survived both the Clone Wars and the Great Jedi Purge, living to see the demise of the Galactic Empire and the return of the Jedi, albeit while in hiding from the agents of Darth Vader. Only when Luke Skywalker's New Jedi Order was well-established and the last elements of Palpatine's Empire destroyed did the Whiphid finally emerge from hiding."}, {"tag": "p", "text": "Some period between the events of the Galactic Civil War and the Yuuzhan Vong War, K'Kruhk joined the New Jedi Order and was still active even past the rise of Darth Krayt, serving as a member of the Jedi High Council, and taking a leading role in the Jedi resistance to the ascendant Sith. K'Kruhk's efforts were integral in forging an alliance between the Jedi, the Galactic Alliance Remnant, and the Fel Empire. With the death of T'ra Saa at Taivas, K'Kruhk became the oldest and most experienced of the surviving Jedi and participated in the alliance's final assault on the Sith-held Coruscant."}, {"tag": "p", "text": "Following the deaths of Darth Krayt and Roan Fel, K'Kruhk became one of the three Triumvirs of the restored Galactic Alliance. During his tenure, K'Kruhk had to contend with both Empress Fel's ambitious G51 communications array project and the threat posed by an underground One Sith Order, whose members had infiltrated key government positions across the galaxy. K'Krukh was also concerned by the emergence of the rogue Sith Darth Wredd, who wanted to destroy the One Sith and reinstate the Rule of Two. He was one of the first high-ranking Triumvirate officials to realize that Darth Wredd was pursuing his own independent agenda."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born over five decades before the Battle of Yavin, K'Kruhk enjoyed a conventional upbringing as a Jedi, raised from an early age in the Order after being identified as force sensitive when he was an infant. He was raised in the Jedi Temple on Coruscant, with his actual homeworld of Toola only a distant memory."}, {"tag": "h4", "text": "Yinchorri Uprising"}, {"tag": "p", "text": "Before the age of thirteen, K'Kruhk was selected by Lilit Twoseas as a Padawan. Based on Twoseas's apparent youth, K'Kruhk was likely her first Padawan. As her apprentice, he fought alongside Micah Giiett, Plo Koon, and Qui-Gon Jinn during the Yinchorri Uprising. The Uprising was typical of the many isolated skirmishes of the decades before the Clone Wars—a minor, petty squabble inflamed by dark puppeteers behind the scenes. As the Jedi attempted to hold the crumbling Republic together, the Sith secretly worked to undermine them."}, {"tag": "p", "text": "Along with Jinn, Koon, Giiett, and Jinn's apprentice Obi-Wan Kenobi, the diplomatic group comprised such notables as Mace Windu, Tsui Choi, Adi Gallia, Eeth Koth, and Saesee Tiin. The Jedi Council, believing the Yinchorri to be cowardly bullies at heart, believed an appropriate show of force would defuse the situation without the need for military action. Unfortunately, the Yinchorri were already being goaded to war by agents of Darth Sidious, and reacted to the Jedi mission with an unusual amount of hostility and attacked the Jedi as soon as their consular ships entered the Yinchorri home system."}, {"tag": "p", "text": "Giiett performed a simple trick involving simple misdirection with cups and balls to K'Kruhk and Obi-Wan Kenobi. This seemingly innocuous piece of entertainments was intended to teach the Padawans an important lesson: do not always rely on the Force, as there are far more mundane ways to confound and mislead one's enemies. K'Kruhk remembered this and used the concept to help the Jedi evade pursuing Yinchorri starfighters, by jettisoning a few empty escape pods, which the easily-fooled Yinchorri immediately chased, thinking their prey had abandoned ship. The Jedi were able to then crash-land on the planet, the Yinchorri believing their ship to be empty."}, {"tag": "p", "text": "Once the Jedi arrived at their rendezvous locations, the situation escalated. Koth, Gallia, and Choi were ambushed by Yinchorri on Yitheeth while Windu, Jinn, and Tiin found no sign of the Yinchorri High Command on Yinchorr. K'Kruhk, a member of the group led by Koon and Giiett found himself fighting for his life on Yibikkoror, after their crash site was ambushed by Yinchorri warriors who had finally seen through K'Kruhk's ruse. In a brief moment of levity during the blaster-fire, K'Kruhk asked Masters Giiett and Koon why they claimed to be friends even though they bickered constantly. Koon gave a typically long-winded and philosophical response, whereas Giiett simply made another sarcastic remark. K'Kruhk and the others were eventually rescued by Adi Gallia's team, who arrived just in the nick of time, helping the stranded Jedi on to their still-functional ship. After their escape, K'Kruhk and the Jedi Masters at Yibikkoror reunited with Koth's team and set out to rescue Windu's squad, trapped by a large group of Yinchorri on Yinchorr."}, {"tag": "p", "text": "It was in this rescue mission that his Master was killed, battling for her life on Yinchorr. As they attempted to escort Windu's strike team back to the ship, they were ambushed by hordes of Yinchorri. K'Kruhk was threatened by the weapon of a Yinchorri warrior; Twoseas leaped in to save her Padawan. Positioning herself between K'Kruhk and his assailant, she took the full force of the blow, dying at the hands of multiple Yinchorri in front of her stunned Padawan. Maddened by the loss, K'Kruhk went into a battle frenzy, not halting his slaughter of Yinchorri until he was able to recover his master's body. Although he would complete his training under another Jedi, the loss of his first mentor would haunt him for the remainder of his life."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Certainties and doubts"}, {"tag": "p", "text": "In the following decade, K'Kruhk matured into a dedicated and capable Jedi Knight. In 22 BBY he joined the task force sent to Geonosis to rescue Obi-Wan Kenobi, Anakin Skywalker, and Senator Padmé Amidala."}, {"tag": "p", "text": "When the call for Jedi to serve as commanders came after the First Battle of Geonosis, K'Kruhk obeyed without question. In the early months of the Clone Wars, Jedi General K'Kruhk led the 416th Star Corps into the Battle of Teyr on the planet Teyr. It was a terribly costly battle. Many clones died under his command, despite K'Kruhk's best efforts, and the Whiphid considered calling off the attack to save the lives of the others. The troops under his command, however, persuaded him otherwise. They could still achieve the objectives and their lives were unimportant in the greater scheme of things. In essence, they were born to die for the Republic."}, {"tag": "p", "text": "Against his better judgment, he pressed ahead with the attack. Whether the Republic was ultimately victorious is unknown, but the high death toll deeply wounded K'Kruhk, and he was so distraught he dropped out of the war entirely, leading many to believe he was dead. It was soon discovered he had gathered with other Jedi unsure of the war on Ruul, led by Master Sora Bulq. When their refusal to serve in the war became known, Mace Windu came to negotiate with them. Unlike other dissidents, such as Sian Jeisel and Rhad Tarn, K'Kruhk never doubted that Windu's appeals were made in good faith, but he sorely misjudged the motives of Bulq."}, {"tag": "p", "text": "In truth, the whole event was a set-up, organized by the Sith to either kill Windu or, failing that, kill other Jedi and blame it on the Jedi Councilor. The acolyte of Count Dooku, Asajj Ventress, arrived at Ruul, ready to carry out the plan and engaged the Jedi in several lightsaber duels. After the deaths of Tarn and Mira, it became apparent Bulq was part of the conspiracy. The Weequay had gone to the dark side and allied with Dooku. His duel with Ventress had been a sham to conceal their alliance."}, {"tag": "p", "text": "Chastened, K'Kruhk rejoined the war effort, declaring simply that \"Evil must be opposed\"."}, {"tag": "h4", "text": "Hypori and later"}, {"tag": "p", "text": "Soon after, K'Kruhk was chosen to be part of a strike team on Hypori, led by Jedi Masters Ki-Adi-Mundi and Shaak Ti. The mission was a disaster from the start and turned into a Separatist trap. Orbital mines destroyed most of their fleet and the surviving troops and Jedi, including K'Kruhk, were marooned on the surface of Hypori, forced to make a desperate last stand against the droid armies."}, {"tag": "p", "text": "It was here that K'Kruhk became one of the first Jedi to face General Grievous and live to tell the tale. Halting the advance of his legions of droid troops, Grievous took on the surviving Jedi alone, displaying dazzling ability with dual lightsabers. Tarr Seirr, Daakman Barrek, and Sha'a Gi were killed. When K'Kruhk charged Grievous and engaged him single-handedly, he managed to briefly disarm one of Grievous's lightsabers, but left himself open and was quickly struck down by a slash across the waist and a near-fatal overhand strike."}, {"tag": "p", "text": "Critically wounded and thought dead, he was left behind by the rescue team that recovered Ki-Adi-Mundi, Shaak Ti, and Aayla Secura. In reality, K'Kruhk had entered a state of hibernation, allowing himself to heal his wounds while feigning death."}, {"tag": "p", "text": "After the departure of Grievous, K'Kruhk awoke, and was able to escape Hypori to once more assume the role of General in the Grand Army of the Republic. However, Grievous did steal K'Kruhk's green lightsaber. The weapon became one of Grievous' favorites, the cyborg keeping it handy and using it up until and including his final battle with Obi-Wan Kenobi on Utapau."}, {"tag": "p", "text": "Recuperating, K'Kruhk was reassigned to Coruscant, and charged with the protection of Senator Viento. He silently observed his ward as the Senator went about his business in the Senate and at political functions. At one such soiree, Viento was deep in discussion with the Supreme Chancellor when K'Kruhk noticed a mysterious Kiffar taking unusual interest in the pair of politicians. The Kiffar was a disguised Quinlan Vos, and he managed to leave the premises before the Whiphid could discover his plans. Later that evening, Vos bypassed K'Kruhk as the Whiphid guarded a sleeping Viento, and broke into the Senator's apartment, preparing to dispatch Viento there and then. The sound and smell of the ignited lightsaber alerted K'Kruhk to the crime, and the Whiphid was forced to battle the rogue Jedi to protect the Senator."}, {"tag": "p", "text": "K'Kruhk, unfortunately, failed in his mission. Vos murdered Viento and K'Kruhk burst in just as it happened. Attacking Vos, K'Kruhk suffered severe injuries in the ensuing battle after falling from an airspeeder. The physical injuries were great, but perhaps less so than the enormous emotional trauma. Vos had been a childhood friend of K'Kruhk and Vos's apparent betrayal of the Jedi wounded the Whiphid deeply. In anger, K'Kruhk declared Vos no better than Sora Bulq, Dooku, and the countless other traitors to the order."}, {"tag": "h4", "text": "Siege of Saleucami"}, {"tag": "p", "text": "After extensive bacta treatment and months of recovery, K'Kruhk returned to the front line during the Siege of Saleucami. Ironically, he would serve alongside Quinlan Vos, recently returned to the fold after the Rendili crisis."}, {"tag": "p", "text": "To the surprise of other Jedi like Jeisel, K'Kruhk had apparently forgiven Vos, accepting that the Kiffar's actions had all been done with the sole intent of maintaining his cover and that no malice had been intended. By this stage, K'Kruhk's many injuries and brushes with death had given the Whiphid a developed sense of gallows humor, and he joked that he had learned to carry basic medical supplies with him at all times. He had witnessed many deaths within, and more was to come: in the early days of the siege, the Jedi Ausar Auset was vaporized before the stunned eyes of both K'Kruhk and A'Sharad Hett."}, {"tag": "p", "text": "K'Kruhk trusted totally in the leadership of Oppo Rancisis and believed that with the Jedi Councilor's fine grasp of tactics and battle meditation, the battle would swing the Republic's way. Understandably, K'Kruhk was devastated when Rancisis was murdered by Sora Bulq and, though he believed Quinlan Vos to have good intentions, was horrified by the fellow Jedi's plan to \"read\" Rancisis's battle plan from the head of the Thisspiasian's corpse."}, {"tag": "p", "text": "The next morning, K'Kruhk attended Rancisis's funeral presided over by A'Sharad Hett. There, the assembled Jedi remembered those who had already fallen on the fields of Saleucami. Hett began with the memory of Auset, a comrade-in-arms of A'Sharad's late father. Then, the others followed: Xiaan Amersu recalled Xeltek, Jeisel recalled Durnar, Aayla spoke the name of Master Tholme, and K'Kruhk himself honored the memory of T'Bolton. After the ceremony was complete, K'Kruhk and his compatriots prepared for the final battle against the Separatists."}, {"tag": "p", "text": "Tholme, in fact, was not dead but had merely hidden his presence, hoping that his absence would help Quinlan Vos come to terms with his true beliefs. While the Jedi Master remained in the shadows, still presumed to be dead, the remaining Jedi launched their attack. Vos and Aayla Secura infiltrated the Separatist base and K'Kruhk and Jeisel led the ground assault, while A'Sharad Hett coordinated actions from the air. With help from Tholme, the Jedi were victorious, and Saleucami fell to the Republic. In the ensuing melee, the Separatist leaders were all defeated: Aayla Secura slew the Morgukai Bok, and Quinlan Vos finally ended the lives of Sora Bulq and his lackey Tol Skorr. Their task over, the Jedi were able to leave Saleucami. K'Kruhk prepared for departure and redeployment, but did so reluctantly. He believed it was shameful for Jedi to leave war-ravaged worlds so devastated when in the past, Jedi had assisted with reconstruction. Vos's assurances that it was merely the \"way of war\" did not assuage the Whiphid's doubts."}, {"tag": "h4", "text": "End of the war"}, {"tag": "p", "text": "After the end of the siege, K'Kruhk and Jeisel were scheduled to depart to Mygeeto to assist Ki-Adi-Mundi, but as they and their escort passed one of the moons of Saleucami, they were ambushed by a Separatist cruiser. Thinking quickly, K'Kruhk ordered the envoy to rush the cruiser, then jump to hyperspace at the last second. Remarking on their narrow escape, the Whiphid discovered to his dismay the ship had been damaged, and would be unable to reach Mygeeto. K'Kruhk told the crew to instead plot a course for the Bogden system, where they could make repairs at the Jedi chapter house there."}, {"tag": "p", "text": "Upon reaching Bogden 3, K'Kruhk and Jeisel were greeted by Master Du Mahn and the Soaring Hawkbat Clan. The new arrivals, still unsure whether or not the transport there was to take them to Coruscant, were surrounded by the excited younglings, who pressed the clones with all sorts of questions. Telling the younglings to leave the soldiers alone, Du Mahn asked the students to go help Padawan Chase Piru prepare the welcome meal for their guests. In the meantime, the repairs to the ship were begun by the soldiers."}, {"tag": "p", "text": "Mahn informed K'Kruhk and Jeisel that the Jedi there, including the younglings, were supposed to have been brought back to Coruscant several days ago, but the attack on Coruscant had Yoda decide to keep them at the facility for their own safety."}, {"tag": "p", "text": "During the meal, K'Kruhk discussed the war and its final days with one of his troopers. Their opinions diverged quite remarkably - while the trooper wanted to get back to the front lines as soon as possible, and not to miss the end, K'Kruhk was less enthusiastic. As he watched Master Mahn teach the younglings, K'Kruhk thought about how he would like nothing better than to never have to raise his saber again, and how he had forgotten that, despite all the suffering and carnage seen in the war, tender scenes like Master Mahn and the younglings still took place. K'Kruhk believed that helping and teaching young ones was the true duty, not war. The clone seemed to agree, but was still eager to \"get back to work\"."}, {"tag": "p", "text": "Then, with no warning, on Coruscant, the soon-to-be new Emperor issued Order 66."}, {"tag": "h3", "text": "Survival"}, {"tag": "p", "text": "K'Kruhk leaped forward, and bisected the same clone he had just been talking to from shoulder to hip, while Piru and Jeisel protected a group of younglings. Master Mahn singlehandedly incapacitated four troopers, without a casualty in the group of younglings behind her. As she ushered them towards the door, a trooper picked up his gun, and shot her in the back, as she fell forward, she told the children to run. The trooper then butchered several of the younglings. Taking a massive Force Jump, K'Kruhk stabbed the trooper, bellowing as he went into a battle fury, dispatching two more troopers."}, {"tag": "p", "text": "K'Kruhk instructed the surviving younglings to head for the door, guarded by Jeisel and Piru. Jeisel told K'Kruhk to take Piru, intending to hold the clones off and buy the other Jedi time to escape with the younglings. K'Kruhk tried to protest, but Jeisel told him that he was the better pilot, and ordered him to save the younglings. Jeisel made a valiant last stand against the troopers, and, knowing that they would soon overwhelm her, activated a thermal detonator that a trooper was holding. The detonator killed her and all the troops, gutting the entire structure."}, {"tag": "p", "text": "Piru waited at the foot of the loading ramp for her, but K'Kruhk told Piru that Jeisel wasn't coming. Piru asked him why the troops had attacked them, whether they'd follow them, and where would the Jedi go. K'Kruhk could only answer that he didn't know."}, {"tag": "h4", "text": "Dark times"}, {"tag": "p", "text": "Shortly after Jeisel's sacrifice and his harrowing escape, K'Kruhk's ship crash landed on a wild, unspoiled moon. Initially, K'Kruhk simply wished to be alone or to strike back at the enemy, but eventually he began to slowly ease back into a teaching role. With Chase Piru, Kennan Taanzer, Seddwia, and the other younglings safe on a planet full of resources, and with intercepted transmissions to inform him of recent events, K'Kruhk felt it better to embrace what they had rather than regret an unchangeable past."}, {"tag": "p", "text": "Sometime later, the pirate Lumbra crashed on the planet after stealing a false crate from his boss Haka Hai and the crew of the Uhumele, which was actually a bomb. K'Kruhk saw his ship fall and raced back to the younglings, but he was too late. Lumbra had salvaged their ship and had discovered the younglings identities as Jedi. The Jedi Master healed Piru, who was shot and left for dead while the younglings had been taken away as prisoners, and learned that the rumors of the bounties on Jedi were true. To save the others, they split up."}, {"tag": "p", "text": "Finding the pirate's camp, K'Kruhk issued a loud roar followed by a warning to release the younglings. The pirates laughed at the warning, and K'Kruhk began picking them off with a bow and large arrows, until Lumbra extinguished the camp's fire. Piru then used the Force from a closer vantage point to guide K'Kruhk's arrows to their targets. Once the pirates had been decimated, K'Kruhk moved in with his lightsaber ignited to dispatch the remainder. Lumbra took Piru hostage and threatened to kill her and the younglings, but K'Kruhk quickly disarmed him, then brutally slashed him to pieces."}, {"tag": "p", "text": "He later apologized to Piru for giving in to un-Jedi-like behavior, and told her that after they repaired the ship of the pirates he was going to drop them off somewhere safe, not wishing for the younglings to have to remember him as they saw him that night. He said he would check in from time to time, but would never stay."}, {"tag": "p", "text": "Sometime later, the group flew to the planet Arkinnea, where they began to descend into a crash landing. The local militia threatened to open fire, but K'Kruhk remained adamant that they needed to land first. As K'Kruhk prepared to land, he ordered Piru to have the younglings strap in, as the landing would be rough. The militia attempted to fire on the ship, but instead missed, hitting a nearby command tower. The ship then crashed, and the militia ordered its passengers to exit with their hands up. K'Kruhk and the younglings complied, though K'Kruhk briefly slipped and referred to the younglings as such, before covering his tracks and calling them orphans instead. The leader of the militia group, Captain Relik, assumed that K'Kruhk's group were refugees, and briefly threatened them before he was interrupted by Commander Teron, who ordered Relik to carry on and bring them to the holding center."}, {"tag": "p", "text": "Upon arriving to the refugee camp, K'Kruhk and the younglings were assigned to a family tent. The group entered, and K'Kruhk briefly told an excited Genel to settle down, before removing a lightsaber disguised as Piru's splint. Soon after, a skirmish broke out between two of the other refugees, and K'Kruhk rushed to break it up. Scolding the two men for not thinking about their families, K'Kruhk let them go and threatened to report them should another fight occur. When asked by Piru if his actions were wise, K'Kruhk commented that it likely was not, but he had intervened for the sake of protecting the younglings. He then reminded Piru that protecting the younglings was their main priority, and that they would not stay for long. Afterwards, he left to search for food."}, {"tag": "p", "text": "For a moment while out, K'Kruhk stumbled upon a propaganda recording of Darth Vader, and decided that it would be best to avoid the Empire if possible. He then returned to his unit, pondering that it was likely a mistake to come to Arkinnea. Upon entering the tent, however, K'Kruhk saw a cloaked figure inside. K'Kruhk ready to attack, the individual calmed him down, and uncloaked to reveal their identity as Master Zao, an old friend of K'Kruhk. When K'Kruhk asked Zao why he was there, he simply responded that the Force led them to one another. After a brief discussion, K'Kruhk was asked by Kennan if Zao could instruct them. Despite K'Kruhk admonishing Kennan, Zao obliged, stating that K'Kruhk would do well to relearn the lesson as well. Zao informed the group that it would do them well to observe, but not assume, and he notedly stated that he wished the lesson was not lost on K'Kruhk. When K'Kruhk asked what he meant, Zao responded that there was a threat present, and that they needed to escape."}, {"tag": "p", "text": "They escaped the camp, looking for a safer place to stay and found out later that the militia slaughtered the refugees. After they were detected K'Kruhk managed to stop the militia by destroying their main vessel and neutralizing their ground forces. In the aftermath the Jedi master encountered Commander Teron, an imperial officer with whom he fought together on Seleucami. Teron told K'Kruhk that he and other officers haven't forgotten the good the Jedi did and promised him to give him supplies and everything he and the padawans need to start a new life on the planet. K'Kruhk accepted the offer, later he and Zao established a \"Hidden Temple\" on the planet."}, {"tag": "p", "text": "While numerous other survivors of the initial purge were eventually hunted down, K'Kruhk survived the fall of the Empire and eventually joined the New Jedi Order created by Luke Skywalker, most likely sometime between the events of the Galactic Civil War and the Yuuzhan Vong War. He would continue to be a part of Luke's Jedi Order for the next century."}, {"tag": "h3", "text": "New Jedi Order"}, {"tag": "h4", "text": "Second Imperial Civil War"}, {"tag": "p", "text": "K'Kruhk assumed a position of authority in the Jedi Academy on Ossus, even having a hand in Cade Skywalker's early training. He was again presumed dead at the Massacre at Ossus, but once more survived, hiding on Toola until 137 ABY. At that time, he felt a call through the Force to return to Ossus."}, {"tag": "p", "text": "There in the ruins of the Jedi Academy, K'Kruhk encountered Cade Skywalker, who was high on death sticks. Cade exclaimed that he thought the Whiphid had died there seven years ago, but K'Kruhk replied that he had died a number of times, and that it was Cade's death that concerned him; they were called deathsticks for a reason. Using the Force, the veteran Jedi began healing the mental and spiritual injuries to Skywalker had suffered over the past few years. Skywalker chuckled at the fact that his own hallucination was healing him, but then realized that it was not a hallucination. Wolf Sazen and Shado Vao then appeared, them too sensing Cade's whereabouts in the Force."}, {"tag": "p", "text": "After some convincing, Cade agreed to complete his training to give him a better foothold to stand against the Sith. Within the complex's underground ruins, K'Kruhk and Sazen would oversee the completion. K'Kruhk was cautious about completing Cade's training, however; commenting that—much like Anakin Skywalker—Cade's future was clouded, and the dark side pulled strongly at him. Remembering the last time the Jedi fell, K'Kruhk wondered at the possibility that if they trained Cade, they might be training the next Vader. Later, the Force ghost of Luke Skywalker appeared to Cade, asking him to retrieve Hosk Trey'lis, whom Cade had sold out to the Sith. As Cade prepared to leave for Coruscant, K'Kruhk gave him R2-D2, an antique droid who was once under the custody of Anakin and later Luke Skywalker, to serve onboard his ship."}, {"tag": "p", "text": "The three Jedi remained on Ossus. During Cade's infiltration of the Temple of the Sith, K'Kruhk, Sazen, and Vao all had a vision of Cade turning to the dark side while meditating in the Praxeum's meditation garden."}, {"tag": "h4", "text": "The Hidden Temple"}, {"tag": "p", "text": "Meanwhile, an Imperial Pellaeon-class Star Destroyer arrived in orbit around Ossus, commanded by Darth Stryfe, head of the Imperial military. Rumors had spread that surviving Jedi were hiding in the Academy, and the Sith were determined to eradicate all Jedi. Stryfe sent Joker Squad of the 407th Stormtrooper Division to conduct a search of the surface. The Jokers looked around Ossus keenly, but found nothing; the Jedi and Yuuzhan Vong there had gone into hiding. One of the Vong, Liaan Lah, suggested simply killing the stormtroopers, but K'Kruhk urged him to be patient, as they would leave soon and attacking would only confirm their presence. As the Imperials were about to call off the search, Stryfe commanded them to continue, as he could sense a whisper in the Force that suggested the presence of Jedi."}, {"tag": "p", "text": "Ordered to continue looking for the Jedi, Sergeant Ran Harkas, Anson Trask, and Private Orland, as well as one more stormtrooper, continued the search amongst the remains of the Jedi Academy. Trask and a fellow stormtrooper reported that the Temple was empty after the Shado used the Force to persuade them. The other of Nei Rin's Vong bodyguards, Choka Skell again advocated for simply dispatching them, but K'Kruhk continued to urge for patience. However, K'Kruhk's strategy did not work out exactly how he foresaw it. Stryfe nevertheless ordered Imperial Navy Captain Meeshal to destroy the Temple, as he still felt the presence of the Jedi hiding on the planet. The Imperials proceeded to fire on the Academy, leveling it. The Jedi and Vong managed to survive the bombardment, and although the elderly Whiphid was severely injured, K'Kruhk was able to lead Sazen, Vao, Rin, Lah, and Skell to the lower levels. There he revealed the existence and location of a Hidden Temple, which had been ordered into creation by the Jedi High Council at the start of the Sith-Imperial War. Sazen and Vao took him there, where he was healed and took a seat in the Jedi Council assembled in the Temple, alongside Masters T'ra Saa and Tili Qua."}, {"tag": "p", "text": "K'Kruhk had served alongside Master Saa during the Clone Wars, well over a century beforehand. The Council listened to the delegation representing deposed Emperor Roan Fel, which advocated an alliance between the Emperor and the Jedi Order. Additionally, Masters K'Kruhk and Saa learned that their former friend and fellow Jedi, A'Sharad Hett, had turned to the dark side and become the Dark Lord of the Sith, Darth Krayt, who had instigated the destruction of the Jedi. The Council became disturbed at Cade Skywalker's request for aid in assassinating Krayt, as they viewed it as an act of the dark side; as such, the Council decided against taking such an action. They saw the worst case scenario: a new Sith might take Krayt's place or the Sith would splinter into dark nexuses of power. They decided to take the more passive course of letting the Force weaken the Sith while the Jedi grew stronger. Nonetheless, Cade decided to go forth with his plan without the Council's help."}, {"tag": "p", "text": "Cade's plan ended with Darth Krayt's death, though it was his most trusted advisor Darth Wyyrlok III who ultimately murdered and replaced him as the new Dark Lord. Subsequently, Cade asked Shado Vao, who was returning to the Temple, to inform the Council that Krayt was dead."}, {"tag": "h4", "text": "Battles with the Sith"}, {"tag": "p", "text": "Later, K'Kruhk was accompanied by the Jedi Masters Rasi Tuum and Hira, and Shado Vao to Agamar for peace talks with Roan Fel and his Imperial Knights from the Empire-in-exile. On the night before they met with Fel, K'Kruhk had a discussion with his three companions about Fel and his Empire, with K'Kruhk insisting that the alliance was necessary for the moment."}, {"tag": "p", "text": "The next day, Rasi Tuum, Hira, and Vao were present for the successful negotiations between K'Kruhk and Fel for an alliance between the two organizations. Shortly thereafter, Moff Nyna Calixte, who served in Krayt's Empire, betrayed the organization by arriving and warning the Jedi and Fel's Imperial Knight bodyguards that the Sith knew of the meeting and were coming with a task force to capture or eliminate the Emperor."}, {"tag": "p", "text": "K'Kruhk, his fellow Jedi, and the Imperial Knights prepared for battle as the Sith revealed themselves. The Whiphid Jedi Master instructed the other Jedi to defend the Emperor, believing that the galaxy's fate depended on Fel's survival. During the battle, K'Kruhk assisted Imperial Knight Treis Sinde in clearing a path to the Imperial delegation's shuttle, Defender One. K'Kruhk, Shado, the Emperor, and most of his Imperial Knights managed to board the shuttle, but an explosion from a TIE Predator attack run incapacitated Rasi Tuum, Azlyn Rae, and Marasiah Fel, the Emperor's daughter. However, as Roan Fel's safety was the top priority, the shuttle was forced to leave without them, allowing the Sith to capture Princess Fel."}, {"tag": "p", "text": "The shuttle returned to Bastion. K'Kruhk eventually made his way back to the Hidden Temple, and remained there until news of a massive Sith attack there was imminent. K'Kruhk agreed, along with the rest of the Jedi Council, to allow the reborn Darth Krayt's forces to attack the Hidden Temple in order to allow Admiral Gar Stazi's fleet and Fel's fleet to ambush the Sith-Imperial fleet and deal a devastating blow to the Sith Empire. When Krayt's new fleet of dragon ships and Annihilator-class starfighters began ravaging the allied fleets, K'Kruhk and Master Qua evacuated a section of the Hidden Temple in a vessel holding the Jedi younglings. As he took off, he wished good luck to his old friend, T'ra Saa, who had remained behind to perform battle meditation, and eventually sacrificed herself to create an escape route through the Sith fleet for the Jedi and their allies to escape."}, {"tag": "p", "text": "With no where else to go, the allied fleets returned to Bastion, K'Kruhk included. There it was decided to launch an attack on the now vulnerable Coruscant in hope of killing Krayt. It was decided that a small strike team infiltrate the capital and disable the planet's orbital defenses. K'Kruhk decided to remain on Bastion as Cade Skywalker took a small strike team including Wolf Sazen, Shado Vao, Rasi Tuum, Morrigan Corde, and several Imperial Knights to Coruscant's defense systems and disable the computers there. They succeeded just as the Allied fleet emerged from hyperspace. The remaining Force-users then decided to head for the Temple of the Sith, where Cade would face Darth Krayt."}, {"tag": "p", "text": "K'Kruhk accompanied the Allied fleet and served as commander onboard one of the capital ships, leading battle meditation with a group of senior Jedi. When Cade succeeded in killing Darth Krayt, K'Kruhk noted the change in behavior of Krayt's specially-bred Sith troopers and warned all ships in the fleet of possible suicide runs. With Krayt dead, the Sith forces flew into disarray, and Coruscant was reclaimed, albeit the loss of Emperor Roan Fel, who was killed by his own Imperial Knights for attempting to purge the planet of all life during the battle."}, {"tag": "h3", "text": "Triumvirate"}, {"tag": "p", "text": "K'Kruhk later attended the funeral of Roan Fel. With the fall of Darth Krayt's Galactic Empire, Master K'Kruhk became one of the three new Triumvirs of the Galactic Federation Triumvirate alongside Admiral Gar Stazi and Marasiah Fel. In 138 ABY, the young Empress Fel embarked on an ambitious project to construct a galactic-wide G51 communications array that would link the Outer Rim Territories with the rest of the galaxy. Empress Fel assigned several Imperial Knights including Master Yalta Val to supervise the construction of local communication array stations throughout the galaxy. While traveling to the remote Carreras system near the Surd Nebula, K'Kruhk along with Admiral Stazi and Empress Fel conversed with Master Val and wished him well for his mission. However, Master Val was ambushed and kidnapped by a rogue Sith named Darth Wredd, who impersonated the Imperial Knight and managed to take control of the Carreras G51 communications array."}, {"tag": "p", "text": "Later, Master K'Kruhk went with Empress Fel and Admiral Stazi on a walk. During their walk, Empress Fel defended the G51 communications array by pointing out that she was investing in the future of the Galactic Triumvirate. However, Admiral Stazi regarded the entire project as \"window dressing\" rather than \"solid statecraft.\" Fel responded that Stazi was a brilliant tactician but naive when it came to governing an empire. Fel's slip of the tongue led K'Kruhk to remind his Empress that the Galactic Triumvirate was not an Empire. After apologizing for her slip, Empress Fel reiterated that they could not hold the Empire together through brute froce and that the communications array project would help unite the galaxy by improving communications between the different regions. She then asked Master K'Kruhk whether he supported her project. After Empress Fel left to join her lover Master Draco, who had become the head of the Imperial Knights, K'Kruhk chatted with Stazi. When the former asked the latter whether he agreed with the Empress' project, Stazi replied that he believed that Fel had her heart in the right place but that he preferred to put his trust in a strong fleet than perceived strength and promises."}, {"tag": "p", "text": "Later, Darth Wredd used the Carreras array to broadcast his manifesto to the galaxy, where he mocked the Galactic Triumvirate and described the Jedi as a former shadow of their strength. Wredd then attempted to execute Master Val before a live galactic audience but was stopped by the junk dealer Ania Solo, who managed to rescue Val before the Carreras array collided with the floating world of Mala. Following the \"Carreras Incident\", K'Kruhk was present at a Triumvirate meeting when he received word that a young woman named Ania Solo had been involved in the destruction of the Carreras communications array. At a later meeting, the Triumvirate discussed the new threat posed by the rogue Sith Darth Wredd, who had embarked on a campaign to hunt down and kill One Sith infiltrators throughout the galaxy. Prior to the meeting, K'Kruhk ordered his stormtrooper bodyguards to wait outside. During the meeting, K'Kruhk reported that Wredd had already murdered a Snivvian Sith on Cadomai Prime and deduced that this was the same man behind the Carreras Incident."}, {"tag": "p", "text": "Empress Marasiah Fel added that Darth Wredd had also killed the Sith infiltrator at the Triumvirate's legation on Ceitia Five. When Fel asked for advice on how to deal with this new threat, Master K'Kruhk commented that it was a troubling revelation that the Sith were systematically infiltrating governments across the galaxy. Antares Draco, the head of the Imperial Knights, argued that the authorities could not afford to lose focus on Wredd since he had publicly threatened them, destroyed the Carreras array, and tried to kill Master Val. K'Kruhk reasoned the rogue Sith had his own agenda. In the end, Admiral Gar Stazi successfully proposed that the Triumvirate leave Wredd alone and let him do the job of killing the Sith. Despite Draco's objections, Empress Fel concurred with Stazi's recommendation."}, {"tag": "p", "text": "Later, Ania Solo and the young Imperial Knight Jao Assam left on a quest to hunt down Darth Wredd after receiving a Force vision that the rogue Sith intended to kill Empress Fel. Their quest led them to the lawless Calamari system where they discovered that another rogue Sith, Darth Luft, was enslaving Mon Calamari and Quarren refugees and forcing them to building a pirate fleet. Jao sent a distress signal to Master Val. Master Val received Jao's message and interrupted a Triumvirate meeting to bring news of the Sith presence in the Calamari system and the plight of the Mon Cal and Quarren slaves. During the meeting, Empress Fel opposed intervention on the grounds that Jao was an unreliable source and the Triumvirate was preoccupied with other more pressing issues. K'Kruhk likened the threat of the Sith to a hydra flower, which was capable of regenerating its heads. Despite the Empress' objections, Admiral Stazi and Master Val led a successful mission to liberate the Mon Calamari Shipyards which improved the credibility of the fledgling Trumvirate government."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Unlike many of his kind, K'Kruhk was a gentle and thoughtful individual. Eschewing the Whiphid reputation for ferocity, he fully embraced the pacifistic creed of the Jedi. This, coupled with his deep respect for life, led to anxiety and soul searching during the Clone Wars, feelings that culminated with K'Kruhk's abandonment of his military duties to join Sora Bulq's dissidents."}, {"tag": "p", "text": "It was his dedication to justice and his desire to right wrongs that would lead to K'Kruhk rejoining the Order. These experiences would forge in K'Kruhk a deep and abiding antipathy for those Jedi who abandoned the narrow path—such as Bulq, Quinlan Vos, and, presumably, Anakin Skywalker. However, at the same time he had a very forgiving nature and argued strongly in favor of giving Vos the benefit of the doubt upon his return to the Jedi Order."}, {"tag": "p", "text": "The onset of the Great Jedi Purge robbed K'Kruhk of his opportunity to train Jedi himself in the Old Jedi Order, but, decades later, he would become one of the great teachers of the New Jedi Order, training Padawans such as Cade Skywalker on Ossus. K'Kruhk was often seen sporting a conical straw hat, especially after the onset of the Clone Wars. It may have been a simple quirk or idiosyncrasy rather than holding any true significance. Regardless, the Whiphid was rarely seen without it."}, {"tag": "p", "text": "Following the defeat of the One Sith, K'Kruhk was appointed as the Jedi representative on the Galactic Federation Triumvirate due to his status within the Order. He regarded the Triumvirate as a free association between the Jedi, the Fel Empire, and the Galactic Alliance and was opposed to any suggestion that the Jedi would be bound to the Empire. K'Kruhk was also troubled by revelations that the defeated One Sith were systematically infiltrating governments across the galaxy in order to restore their \"golden age.\" K'Kruhk likened the threat of the Sith to a hydra flower. He was also one of the first senior Triumvirate policy-makers to recognize that the rogue Sith Darth Wredd had his own separate, independent agenda from the One Sith."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Despite his gentle soul, K'Kruhk was a powerful warrior, his large Whiphid frame giving him an advantage against smaller opponents and his Jedi talents granting him a speed and agility few of his species could match. K'Kruhk's fighting prowess allowed him to hold his own against Asajj Ventress and General Grievous. Despite being unable to actually defeat them, he was one of the few Jedi who managed to survive an encounter with them. He was also able to hold his own against Quinlan Vos."}, {"tag": "p", "text": "K'Kruhk was skilled at using the Force to heal wounds, not just his own, but also the injuries of others, as proven when he healed Chase Piru. He also attempted to use this ability to save Oppo Rancisis, but failed. In addition, K'Kruhk possessed an incredibly powerful Force Sense, as he was the only known Jedi besides Yoda who was able to sense the intention of the clone troopers during Order 66. Further evidence of his exceptional Force Sense was his ability to detect Quinlan Vos, who was skilled at hiding his presence even from other Force users."}, {"tag": "p", "text": "K'Kruhk's most remarkable talent was that of survival. Thanks to both the natural fortitude and inborn \"healing trance\" of his kind, he was able to survive injuries that in any other Jedi might prove fatal. Left for dead on battlefields as diverse as Teyr, Hypori, and Ossus, K'Kruhk was remarkable for his ability to live to see another day. Even a fall from the heights of Coruscant was unable to end the mighty Whiphid's life, nor could the complete destruction of the Ossus temple by the new Sith Order."}, {"tag": "p", "text": "Even as the Jedi Order and the Republic fell, K'Kruhk survived. The Empire rose, was defeated, and was replaced with the New Republic, and still K'Kruhk lived. Even the Yuuzhan Vong or the Sith of Darth Krayt could not kill him. By 137 ABY, K'Kruhk was over one and a half centuries in age—making him, after fellow Master T'ra Saa, the oldest known Jedi to be still living by the end of the Imperial-Sith War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character origin"}, {"tag": "p", "text": "K'Kruhk was created by author Randy Stradley and debuted in the comic series Jedi Council: Acts of War. Still, it was not until a popular appearance in Jedi: Mace Windu that the Whiphid became a recurring character."}, {"tag": "p", "text": "In Star Wars: Clone Wars, K'Kruhk was voiced by Kevin Michael Richardson. Along with Aayla Secura, he was one of only two original Expanded Universe characters (outside those introduced in the series itself) to appear in the animated series. Unlike Aayla, however, K'Kruhk had not previously appeared in the films."}, {"tag": "h3", "text": "Lightsaber design"}, {"tag": "p", "text": "Strangely enough, the design for K'Kruhk's lightsaber was actually developed by a fan, who, failing to find a clear official depiction of the saber in a comic, invented an original design to display on his own website. By chance, artist Jan Duursema used the website as a source when illustrating Jedi: Mace Windu, thinking the design was based on a canon source, and, in the process, inadvertently canonized the depiction herself."}, {"tag": "h3", "text": "Cult following"}, {"tag": "p", "text": "K'Kruhk has developed a cult following among fans, especially on such online forums as TheForce.Net's Jedi Council Forums. This is, at least in part, due to having survived several near-death experiences."}, {"tag": "p", "text": "This incredible ability to evade certain death was apparently winked at in The Siege of Saleucami arc, where K'Kruhk comments that he's learned to carry basic medical supplies with him."}, {"tag": "h4", "text": "K'Kruhk's hat"}, {"tag": "p", "text": "One aspect of K'Kruhk's following is a running joke about a conical straw hat he wears in several of his comic appearances."}, {"tag": "p", "text": "In one forum thread on the Jedi Council Forums, his hat is credited with amazing powers, including being responsible for K'Kruhk surviving his multiple brushes with death, and is repeatedly described as \"freakin' sweet\"—a description, like the joke itself, which originates from a forum user's signature that many fans see as a self-fulfilling prophecy that has contributed to the character's popularity and resulting long-term survival."}, {"tag": "p", "text": "The hat's later appearances have apparently been a tribute to the fandom; it is even listed as part of K'Kruhk's equipment in the Saga Edition of the RPG. Randy Stradley acknowledged the \"myth\" of the \"The Hat\" in Star Wars: Panel to Panel Volume 2: Expanding the Universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}