{"url": "K%27kayeh_dragon", "categories": ["Category:Legends articles", "Category:Creatures of Almas", "Category:Creatures of unspecified biology", "Category:Creatures of unspecified diet", "Category:Sithspawn", "Category:Species of undefined sentience", "Category:Subterranean creatures"], "nodes": [{"tag": "h1", "text": "K'kayeh dragon"}, {"tag": "p", "text": "The k'kayeh dragon was a gigantic, serpentine beast that was created by the Sith Lord Darth Rivan to defend his fortress on the planet Almas. The dragon was 200 meters in length and was covered by thick skin as strong as armor that was the exact color of the sands of the Almas Wasteland that surrounded Rivan's fortress. The creature preferred a subterranean lifestyle and rarely strayed to the planetary surface, instead choosing to spend most of its time roaming the deep underground caverns and swimming along subterrestrial rivers."}, {"tag": "p", "text": "After Rivan was driven from Almas during the New Sith Wars, in his absence the k'kayeh continued to reside on Almas for over a thousand years, coming to be regarded by the population of Almas as a creature of legend. Circa 17 BBY, the gatekeeper of an ancient holocron that Rivan had created summoned the dragon to attack the Imperial Inquisitor Valin Draco and a group of Alderaanian Resistance agents inside a cavern beneath a ruined Jedi academy. The agents withstood the creature's attack, and after Draco was sent tumbling off a ledge and into a deep chasm below, the k'kayeh ceased its assault and retreated."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The k'kayeh dragon was a gargantuan, Force-using Sithspawn monster that the Sith Lord Darth Rivan created using the dark arts of Sith alchemy. The dragon had a serpentine body and was over 200 meters in length, making it one of the largest guardian beasts ever to be developed by the Sith. The creature's outer dermal layer was as thick as armor plating and was the color of sand, of the precise shade of the sands of the Almas Wasteland—an arid, desert region of the planet Almas on which the creature resided, providing the k'kayeh with camouflage and making it indistinguishable from the region's sand dunes when viewed from above. The dragon was also amphibious and could breath underwater just as easily as it could breath air."}, {"tag": "p", "text": "For defense, the k'kayeh dragon had razor-sharp claws, and inside its mouth it had dozens of small, sharp teeth, as well as larger teeth taller than a Wookiee—a type of sentient being from the planet Kashyyyk— that could cut through metal just as easily as a lightsaber could. Due the nature of its creation by Rivan, and also because of its long exposure to the dark side presence that permeated the environment surrounding Rivan's Almas Sith fortress, the k'kayeh was sensitive to the Force; it could use the powers Battlemind, Force sense, and Force strike to a limited extent and could also fire bolts of Force lightning from each of its two nostrils. The creature was immune to detection by sense-based Force abilities, and something about the dragon's nature also rendered it invisible to sensors designed to spot life forms. The dragon had an extremely long lifespan and was capable of living over a thousand years old."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "Though not fully sentient, the k'kayeh dragon possessed a limited degree of self-awareness and went to great lengths to avoid drawing the attention of the inhabitants of Almas. Driven by the dark side, the k'kayeh was malevolent and attacked all beings that it encountered."}, {"tag": "p", "text": "The k'kayeh was primarily a subterranean creature and rarely came to the surface of Almas, instead choosing to spend most of its life underground, roaming the deep recesses of the planet's caverns and swimming along frozen subterranean rivers. Its main home was an enormous underground lake formed by the convergence of several subterrestrial rivers, and the dragon would often sleep for weeks on end before waking and returning to the planetary surface in search of food. The beast could eat anything, even starships, and frequently preyed on travelers who ventured into the Almas Wasteland. However, the dragon required more food to sustain itself than it could safely obtain on the surface without altering the population of Almas to its presence. As a result, it mainly subsisted on a diet of aquatic creatures such as the coboko fish, which inhabited Almas' underground rivers. The k'kayeh had a taste for forfra moss, a pungent plant that grew on the ceilings of many of Almas' tunnels; the moss was poisonous if consumed at the wrong stage in its life cycle, and the dragon took care to feed upon the plant only when the moss' scent was just right. It was also rumored by some among the inhabitants of Almas that the k'kayeh fed off the kaluthin, a plant that Rivan bred to modify Almas' poisonous atmosphere."}, {"tag": "p", "text": "When in combat, the k'kayeh used its jaws as its primary weapon to swallow its target, though when irked by small-sized creatures and objects, the creature would respond by smashing the annoyance with its large claws. When simultaneously faced with a large number of threats, the dragon would rise up almost vertically and then crash down onto its attackers in an attempt to crush them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The k'kayeh dragon was created by Darth Rivan at some point between 1417 BBY and 1167 BBY, amidst the turmoil of the New Sith Wars. The creature was designed to defend Rivan's fortress on Almas against entire armies of Jedi—Force-wielding opponents of the Sith—that might hope to besiege the citadel. Rivan was ultimately driven from Almas, and the creature considered to reside on the world in the absence of its master for the next millennium."}, {"tag": "p", "text": "In 177 BBY, a Jedi academy was established on Almas, and a small population of colonists gradually settled on the world. The k'kayeh dragon came to be regarded by the Almas populace as a creature of legend, and speculation about the possible existence of the creature was rampant, though stories of the beast were largely used only to scare misbehaving children. Visitors to Almas often commented upon having seen the dunes of the Almas Wasteland to be moving, as if a large serpentine creature was traversing across the sands, but no sign of the k'kayeh's presence was ever found from the investigation of such claims. Around 31 BBY, expeditions into the Almas Wasteland recovered several k'kayeh teeth, though despite the discovery of such evidence, the Almas people continued to regard the stories of the k'kayeh dragon as mere legend."}, {"tag": "p", "text": "The Jedi academy on Almas was later destroyed, and in the absence of the facility's strong light side presence, a Sith holocron that Rivan had created activated in the caves beneath the Academy. Strengthened by the dark side of the Force, the holocron's gatekeeper came to believe that it was the spirit of Rivan. Around 17 BBY, the Imperial Inquisitor Valin Draco ventured to the ruined academy and began to study the holocron. Under the influence of the gatekeeper, Draco left various traps throughout the academy to ensnare anyone who sought to disturb him, including a k'kayeh dreambeast, an illusory version of the real k'kayeh dragon that was about one quarter of its size and was linked to the real k'kayeh via the Force."}, {"tag": "p", "text": "During Draco's occupation of the academy, several Alderaanian Resistance agents traveled to the ruins in search of the holocron of the Jedi Master Qornah. The agents defeated the k'kayeh dreambeast and then confronted Draco in the caverns beneath the academy, and as the Inquisitor made his final stand against the operatives, the holocron gatekeeper summoned the real k'kayeh to attack them. Using dark side skills that he had learned from Rivan's holocron, Draco was able to control the dragon to a limited extent, preventing it from devouring him, and the creature fired several Force lightning bolts at the agents while Draco defended himself against them. However, the agents ultimately defeated Draco and sent him tumbling off a ledge into a large cavern below, and as Draco fell, the k'kayeh retreated back into the abyss from which it had come."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The k'kayeh dragon was created by Morrie Mullins and was first described in Dragon of the Desert, an article published on the website Wizards.com in 2002 as a supplement to the Living Force roleplaying campaign. The dragon later received a brief mention in the Wizards.com article Dark on Dark, also by Mullins, and in 2008, the dragon made an appearance in Echoes of the Jedi, the fourth installment of the Dawn of Defiance roleplaying campaign, by Abel G. Peña and Jean-François Boivin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}