{"url": "K%27hondo", "categories": ["Category:Legends articles", "Category:Guards", "Category:Males", "Category:Sedrians"], "nodes": [{"tag": "h1", "text": "K'hondo"}, {"tag": "p", "text": "K'hondo was a male Sedrian from the planet Sedri alive during the Galactic Civil War. During the Sedri civil war he chose to side with the bishop of war Karak and his renegades in which he served as karak's bodyguard. K'hondo accompanied Karak and five other renegades in an assault on the Sun caves in the city of Fitsay during the Siege of the Fitsay Sun Caves in an attempt to claim the power of the Golden Sun. Karak and his men were chased by a group of Rebels and Sedrian priest Pek into the caves whom K'hondo, along with the rest of the group bar Karak waited to ambush within the cave. Once the Rebels came upon him, K'hondo fired at them with a sun gun but was killed in the ensuing battle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "K'hondo was a male Sedrian from the planet Sedri, a water world in the Sedri system secluded from most of the galaxy. During K'hondo's lifetime a civil war broke out on his homeworld between the religious sect known as the Priests of the Sun, whom ruled the Sedri from the city of Fitsay, and a group of renegades, lead by the former bishop of war Karak, who opposed their control. K'hondo chose to side with the renegades in this war, despite his pacifistic nature. The renegades opposed the priests of the Sun due to their control of the Golden Sun, a huge group of individuals of a polyb species known as Golden Sun coral. The coral formed a group minded sentient being with considerable connection to the force including a large number of healing powers. The priests however kept it hidden within a structure known as the Great Shell Dome in the center of Fitsay and strictly controlled those who could access it. The renegades followed Karak in the belief that all Sedrians should have access to the Golden Sun, although in truth Karak simply wanted the corals power for himself."}, {"tag": "p", "text": "During the War an Imperial scout ship accidentally discovered Sedri and after it's location was reported, a small Imperial garrison was set up on the world lead by commander Aban. The Imperial's in turn drew the attention of the Alliance to Restore the Republic and a Rebel dignitary named Mors Odrion and his companion Rekara also travelled to the world. The rebels however soon encountered the renegades whom captured the pair for interrogation, not use to any off-worlders. While the renegades decided to use Odrin as a potential bartering tool for use with the new Imperial presence, Rekara managed to escape and steal a small piece of Golden coral which the renegades had taken from Fitsay."}, {"tag": "p", "text": "Karak then took Odrion to the Imperial garrison and made a deal with Aban to form an alliance between the renegades and the Empire in order to attack Fitsay and claim the power of the Golden Sun splitting it between the two factions equally. The former priest of war kept the deal a secret from the majority of renegades, many of whom were suspicious of the Imperials. This was exploited by a group of six rebels who had travelled to Sedri with Rekara, whom had managed to reach the rebel Delta Base on New Kisge looking for help. The group used Karak's betrayal of their trust to persuade many renegades to side with them and the priests of the Sun in the upcoming battle, including Karak's daughter, Fala."}, {"tag": "p", "text": "Those renegades left, which included K'hondo, and the Empire then staged their siege on the Sun Caves with the use of a Aquatic Terrain Armored Transport. The Imperial troops, mainly consisting of Aquatic assault stormtroopers, met the forces of Fistay and the Rebels outside of the city. Karak however took six of his most trusted and powerful renegades, Dragob, Glish, K'hondo, Porm, Spodan and Burborok as well as his pet razort Tooch and their prisoner Odrion, to the Sun caves in attempt to claim the coral for himself and defeat the Imperials and priests."}, {"tag": "p", "text": "At the cave the group was confronted by the High priest Cardo, however one of them slash him across the chest, causing a near fatal wound. They then moved into the cave, with Karak and Odrion heading straight for the main chamber while the others spread out through the cave so to slow down any pursuers. K'hondo waited within a hall in the cave, armed with only a sun gun and hidden behind a pile of rubble and coral. The group of six rebels, Rekara and Cardo's son Pek soon entered the cave in search of Karak and came upon K'hondo. The Sedrian opened fire at the group, but was killed in the fight that followed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "K'hondo was pacifistic in nature and refused to use any weapon in combat bar a non-lethal sun gun. Despite this he sided with the more violent renegade group against the Priests of the Sun due to their control of the Golden Sun coral."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Dragob first appeared in the West End Games adventure booklet Battle for the Golden Sun, written by Douglas Kaufman and published in 1988 as part of the Star Wars: The Roleplaying Game. He is an enemy which the player characters encounter during the final chapter of the adventure and are forced to kill to reach Karak and complete the adventure."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}