{"url": "K-2SO", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Alliance Intelligence members", "Category:Alliance to Restore the Republic droids", "Category:Extraction Team Bravo personnel", "Category:Imperial defectors", "Category:KX-series security droids", "Category:Rogue One personnel"], "nodes": [{"tag": "h1", "text": "K-2SO"}, {"tag": "p", "text": "K-2SO (Kay-Too-Ess-Oh), abbreviated K-2 (Kay-Tu or Kaytoo) or Kay, was a KX-series security droid originally created for use in the Galactic Empire's armed forces."}, {"tag": "p", "text": "At some point, the droid encountered Captain Cassian Andor, a member of the resistance movement—known as the Rebel Alliance—that sought to overthrow the Empire and restore democracy to the galaxy. Andor was able to reprogram K-2SO to serve the Alliance on the planet Wecacoe. In 0 BBY, K-2SO participated in the Battle of Scarif, where he sacrificed himself so that Andor and Jyn Erso could steal the plans to the Empire's moon-sized battle station, the Death Star."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "K-2SO was one of the KX-series security droids assigned to the Imperial stormtrooper detachment on the planet Wecacoe. K-2SO heard a noise near a decommissioned Imperial cruiser. There he encountered Rebel agent Cassian Andor and arrested him. K-2SO and Andor then fought each other until Kertas and Rismor found his kill switch. Cassian then attempted to wipe K-2SO's memory clean."}, {"tag": "p", "text": "However, only 29.73% of K-2SO's memory had been erased, and he then strangled Cassian. Kertas and Rismor were able to turn him off again. Cassian gave K-2 new orders to lead him, Kertas, and Rismor back to their ship. K-2 stated he would \"take out\" anyone who interfered with them. He escorted Cassian and the twins as his prisoners, but came under attack by several stormtroopers. He, the twins, and Cassian attacked the troopers."}, {"tag": "p", "text": "As the K-2SO's group got to their vehicle, stormtroopers surrounded it, and K-2 attempted to arrest Andor again. As Rismor drew the troops away, Kertas told Cassian to take K-2SO because he had the intel they needed. After Cassian's ship was destroyed, K-2 still had 8.3% of his memory and tried to decide to either terminate or arrest Cassian. Cassian removed the base layer of his programming and shut him down. K-2 turned on and took out the stormtroopers. K-2 and Andor then found a ship. Together, they made their escape."}, {"tag": "h3", "text": "Serving the Rebellion"}, {"tag": "p", "text": "K-2SO and Andor were sent to the F'tzner system to undertake a raid on an Imperial freighter. Andor used gas to trick the Empire into thinking that smugglers stole the cargo, as smugglers were known to use gas to raid transports. When they got to the cargo room, they found three Wookiees named D'Koetaa, D'Lylaa, and Wyhyatt, and took them instead of the cargo. Andor then took them to the monastery moon of Charissia in the Bartahn sector. There, he left K-2SO to look after the three Wookiees while Andor undertook a raid."}, {"tag": "p", "text": "At some point K-2SO and Athex were sent to an Imperial base near Fortress Vader on Mustafar. There, they assisted a team of rebels posing as stormtroopers in recovering for the Rebel Alliance. After the rebels stole the Proto-saber, K-2SO picked up the rebels before Darth Vader could stop them from making their escape."}, {"tag": "p", "text": "At some point whilst stationed at the rebel base on Yavin 4, K-2SO had a run-in with R2-D2 and C-3PO, droids belonging to the pilot of Senator Bail Organa."}, {"tag": "p", "text": "K-2SO accompanied Extraction Team Bravo, which in 0 BBY helped Jyn Erso escape from the Wobani Labor Camp. As Erso ran outside to escape, K-2SO seized Erso, threw her to the ground, and told her not to resist as she was being rescued. Bravo Team's U-wing transport, Bravo One, encountered a minor technical setback and was unable to jump to hyperspace. The team took refuge in an asteroid field in Wobani's star system, and K-2SO sent a priority transmission to all available Rebel vessels. An X-wing starfighter squadron called Red Flight answered their call and saved them from incoming Imperial forces."}, {"tag": "p", "text": "Later, K-2SO accompanied his master Cassian Andor and Jyn on a mission to rescue Jyn's father, Galen Erso, so that they could gather information about the the Empire's superweapon, the Death Star. In secret, Cassian had received orders to kill Galen in order to prevent the weapon from being built. The Alliance had learned about the Death Star from the Imperial defector Bodhi Rook, who had been taken by the maverick leader Saw Gerrera. K-2SO was uncomfortable that Jyn had been given a blaster since she disliked him."}, {"tag": "h3", "text": "Search for Galen Erso"}, {"tag": "p", "text": "K-2SO and his companions traveled to the moon Jedha in order to find Saw Gerrera and acquire Bodhi's message so that they could locate Galen. Under orders from Cassian, Kaytoo stayed aboard their U-wing while his human companions infiltrated the Holy City of Jedha. Despite his instructions, K-2SO ventured into the Holy City during a battle between Imperial forces and Saw's Partisans. K-2SO narrowly avoided being shot by Jyn, who instead shot another KX-series security droid. Kaytoo also intercepted a stormtrooper's grenade in midair and threw it at a group of advancing stormtroopers. K-2SO slipped away following the fighting and returned to their U-wing transport. Meanwhile, his companions were captured by Saw's Partisans, who brought them to the rebel leader's base in the Catacombs of Cadera."}, {"tag": "p", "text": "After the Death Star destroyed Jedha City during a test firing, K-2SO picked up Cassian, Jyn, Bodhi, and their new companions Chirrut Îmwe and Baze Malbus in his U-wing before Saw's base was caught up in the Death Star's blast. Due to the mission, the rebels learned that Galen had incorporated a design flaw into the Death Star. Having learned from Saw that Galen was on the storm-stricken planet of Eadu, Kaytoo helped Cassian fly the U-wing there. Despite a powerful storm, the rebels managed to crash their ship near the Imperial Flight Station where Galen and the other scientists were being housed."}, {"tag": "p", "text": "K-2SO and the others stayed aboard the wrecked U-wing while Cassian ventured outside to find Galen. During that time, Kaytoo disclosed to Jyn that Cassian was going to assassinate her father. Jyn left to find her father before Cassian could kill him, only to be caught up in a rebel attack on the station. During that attack, Galen was killed by a stray Y-wing proton torpedo. Amidst the fighting, K-2SO, Rook, and the others managed to steal an Imperial cargo shuttle and rescue Jyn and Cassian. The rebels then returned to Yavin 4."}, {"tag": "h3", "text": "Last stand on Scarif"}, {"tag": "p", "text": "After the Rebel Alliance was unable to reach a consensus on the Death Star, K-2SO accompanied Jyn, Cassian, and their companions on an unsanctioned mission to steal the Death Star plans from the planet Scarif. This rebel strike team became known as Rogue One. Kaytoo and Rook piloted the stolen cargo shuttle they had obtained on Eadu. When the air traffic controller claimed that there was no such group with the designation Rogue One, K-2SO replied \"there is now\" before taking off. After exiting hyperspace, Kaytoo and the rest of his team managed to travel through the Shield Gate and land at the planetary Imperial security complex."}, {"tag": "p", "text": "While the rest of the Rogue One unit staged a diversionary attack on the base, Kaytoo accompanied a disguised Jyn and Cassian inside the security complex. During the course of the mission, K-2SO accosted another KX unit and accessed its databanks to retrieve a map of the complex. The three rebels then made their way to the data vault, where the Death Star plans were stored. After incapacitating the technician, Kaytoo assumed control of the computer and opened the door into the vault. At that point, K-2SO received news that the rebel fleet had arrived over Scarif and that the Empire had locked the Shield Gate."}, {"tag": "p", "text": "Since they were trapped, Kaytoo suggested transmitting the plans but told them that the size of the data files meant that the shield would have to be taken down in order to transmit them to the orbiting rebel fleet. Since the two had gained each other's respect during their adventures, Jyn gave K-2SO a blaster pistol to defend himself. Kaytoo expressed surprise at her change in behavior. While Jyn and Cassian were combing through the files for the plans, several stormtroopers approached K-2SO, who immediately closed the vault door to stop them looking inside. Kaytoo tried to divert the Imperials away, but his cover was blown when Cassian spoke through the intercom asking why he had shut the door."}, {"tag": "p", "text": "K-2SO engaged the stormtroopers in a gun battle while relaying the location of a data-tape titled \"stardust,\" which was the codename for the Death Star plans. Before Cassian could retrieve the file, the door control was hit and the device's power was knocked out. K-2SO implored his comrades to climb through the vault before succumbing to stormtrooper fire. K-2SO gave his final farewell to the pair, and at the cost of his life, he destroyed the door control panel so the stormtroopers could not open it again. In his last second before shutting down permanently, K-2SO created a simulation in which Cassian escaped alive. He knew it was impossible, but it gave him joy."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Despite K-2SO's disintegration, Jyn and Cassian managed to retrieve the Death Star plans and transmit them to the orbiting rebel fleet. The rest of Rogue One were killed when Grand Moff Wilhuff Tarkin used the Death Star's superlaser to destroy the Imperial security complex in a desperate effort to prevent the plans from escaping Scarif. This set the stage for the Battle of Yavin."}, {"tag": "p", "text": "K-2SO was remembered long after the Galactic Civil War and was mentioned alongside Erso and Orson Callan Krennic by a member of the Whills as someone to be remembered in galactic history."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "While most KX-series droids were effectively emotionless drones, minor errors and glitches in K-2SO's reprogramming led to the development of a fully self-aware personality; he was cynical, prone to sarcasm, and stoic, often mentioning that he had calculated the poor odds of success in any given situation (which Andor would then refuse to hear). His sarcasm extended to the point where he would disobey minor orders and prove his ability in given missions, as seen on Jedha. He was fairly independent and frequently disobeyed orders he felt were counterproductive, scolding his organic compatriots for ignoring his advice. He genuinely regarded Andor as a friend, however, and felt no hesitation in sacrificing himself in order to protect him and Jyn Erso during their mission to steal the plans to the Death Star."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "K-2SO is voiced and portrayed in motion capture by Alan Tudyk in the Star Wars standalone film Rogue One: A Star Wars Story. His name was revealed in a preview of Rogue One: A Star Wars Story: The Official Visual Story Guide, though the source listed him as both \"K-2SO\" and, incorrectly, \"K-250.\" The magazine in question was later cancelled before its release."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}