{"url": "K-OB7", "categories": ["Category:Legends articles", "Category:Droids of unspecified degree"], "nodes": [{"tag": "h1", "text": "K-OB7"}, {"tag": "p", "text": "K-OB7, also called Kayo, was a droid who entered into the service of the Bimm Sith adept Toki Tollivar shortly after the end of the Great Sith War. Kayo \"helped\" Tollivar by hiding the dead bodies of his strangle victims. Kayo and Tollivar eventually found themselves stranded aboard the luxury yacht Chancellor Fillorean until Zayne Carrick and the crew of the Hot Prospect recovered the lost vessel."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Construction and early life"}, {"tag": "p", "text": "K-OB7 was manufactured in a Kellenech plant on Rendili sometime before, during, or shortly after the Great Sith War. This was the very same plant in which the LB-series bulk-loading droid T1-LB was manufactured. Not long after the Great Sith War, Kayo entered into the service of Toki Tollivar, a Sith adept. Kayo always found Tollivar to be pleasant and kind, until one night when he found one of Tollivar's associates dead. Kayo found his master horrified and helped him by hiding the body. The next year more and more bodies kept appearing anywhere Kayo and his master went. Kayo was baffled as to how such a small being as Tollivar could strangle so many people."}, {"tag": "h3", "text": "Stranded aboard the Chancellor Fillorean"}, {"tag": "p", "text": "Eventually the Corellian authorities came after Tollivar under his latest alias, Kelven Garnatrope. Tollivar then booked passage onto the Chancellor Fillorean, a vessel catering to the ultra-rich. However, the killings started to happen again, and soon all of the passengers and crew aboard the Fillorean were dead save for K-OB7 and his master. Tollivar had no idea how to fly a ship like the Fillorean and so both Kayo and his master were stranded aboard the ship. Eventually the Hot Prospect and her crew—Zayne Carrick, Rohlan Dyre, Jarael and Slyssk, found the ship adrift. As the crew were investigating, Kayo attacked Zayne in an effort to protect his master. Kayo was no match for Zayne and Rohlan, and an innocent-looking Tollivar pleaded for them not to hurt Kayo. Tollivar told Zayne his version of what happened aboard the Fillorean, and everyone went off the investigate. Kayo found T1-LB in the Hot Prospect's hold and began talking to him. He was able to get Elbee to talk again and even help out with the dead bodies aboard the Fillorean."}, {"tag": "p", "text": "Rohlan Dyre soon figured out that the passengers and crew of the Fillorean did not die of asphyxiation, but were instead strangled. Rohlan implicated K-OB7 in the deaths of the passengers and crew of the Fillorean. After finding Slyssk nearly strangled to death, Zayne also suspected Kayo of being involved in the deaths and cut off Kayo's arms with his lightsaber. Elbee attempted to defend Kayo against Zayne and Rohlan, stating that Kayo was only programmed for \"helping.\" Kayo then revealed his and Tollivar's past to Zayne and Rohlan, raising enough of their suspicions to go after Tollivar. Tollivar revealed himself to be behind all the killings and attempted to strangle Jarael. Zayne and Tollivar dueled until Kayo stepped in. Kayo attempted to incapacitate his master by holding him from behind, and held him fast even as the Sith attempted to free himself with Force Lightning. Rohlan took the opportunity to shoot Kayo and Tollivar with his blaster, killing Tollivar and destroying Kayo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "John Jackson Miller commented that his inspiration for K-OB7's bug-eyed appearance was the Death Star droid whose action figure he stated was \"the creepiest looking thing in the whole Kenner line.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}