{"url": "K-Series_spaceport_control_droid", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Imperial droids", "Category:Industrial Automaton products", "Category:Third-degree droid models"], "nodes": [{"tag": "h1", "text": "K-Series spaceport control droid"}, {"tag": "p", "text": "The K-Series spaceport control droid was a model of spaceport control droid manufactured by Industrial Automaton."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Tall and awkward-looking, with a dome-shaped head and a slightly-protruding mid-section, the third-degree K-Series spaceport control droid was a typical droid of its class. Standing 2 meters in height, it had a human body, with two arms, both tipped with a hand appendage, and two legs. Painted bright red, K-Series droids stood out in crowds. They were equipped with a pair of visual and auditory sensor recorder, as well as a vocabulator speech/sound system. Possessing a basic processor, K-Series droids were equipped with a comlink and datapad."}, {"tag": "p", "text": "An administrative droid, the K-Series handled space traffic control and other logistical details of a spaceport, and was the first line of communication between pilots and spaceport control. It sent automated messages to approaching and departing starships and handled most of the menial, low-level tasks of spaceport control. K-Series droids were skilled and meticulous, and they took their duties very seriously. They were capable of speaking multiple languages, including Basic, Binary, Bocce, High Galactic, and Huttese."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Manufactured by Industrial Automaton, the availability of K-Series spaceport control droid was licensed, and they costed 5,500 credits new or 1,500 credits used. They were rarely seen, but often heard, in spaceports throughout the galaxy's Outer Rim Territories."}, {"tag": "p", "text": "A modified K-Series spaceport control droid, K-M2 was the result of a Rebel experiment in using droids to penetrate the Galactic Empire at vital points. He rose to take over spaceport control on Travnin, in the Minos Cluster."}, {"tag": "p", "text": "M-3PO, known as Emtrey, was a 3PO-series protocol droid that served as quartermaster for Rogue Squadron from around 6 ABY. Emtrey was refitted by an Alliance to Restore the Republic lieutenant named Losca prior to the Battle of Hoth and was fitted with a head from a spaceport control droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}