{"url": "K2-B4/Legends", "categories": ["Category:Legends articles", "Category:Feminine programming", "Category:T-series tactical droids"], "nodes": [{"tag": "h1", "text": "K2-B4"}, {"tag": "p", "text": "K2-B4 was a T-series tactical droid who served Warden Osi Sobeck at the Citadel during the Clone Wars. During the Clone Wars, K2-B4 assisted Commander Osi Sobeck in guarding Jedi Master Even Piell, Captain Wilhuff Tarkin and their officers while they were being tortured for information on the Nexus Route. K2-B4 then scanned a supply shuttle's cargo. However, K2-B4 then informed Sobeck that the supply shuttle never arrived. K2-B4 then informed Sobeck that Count Dooku was waiting to speak with him via hologram. K2-B4 then discovered the missing supply shuttle and had R2-D2's battle droids taken to the interrogation center."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This feminine tactical droid was stationed inside Citadel Command, alongside Osi Sobeck and a few security droids. Around 21 BBY, Jedi Master Even Piell was captured and detained in the Citadel, prompting an elite team of Jedi and clones to rescue him. When they entered the atmosphere of the planet, Lola Sayu, the planet holding the Citadel, K2-B4 contacted them and asked about their cargo. She then told them to stay on course while she scanned the ship for life forms using the scanners. However, because the Jedi and clones had encased themselves in carbonite, the scanners did not detect them and K2-B4 allowed them to enter Lola Sayu."}, {"tag": "p", "text": "Later on, K2-B4 informed Sobeck that Confederacy Head of State, Count Dooku wanted to contact him because of the Jedi's success of freeing Master Piell and his men. After reassuring the Count that everything was under control, Sobeck grabbed K2-B4 and warned her never to surprise him like that again. K2-B4 later met with R2-D2's shuttle after getting suspicious that it was long overdue. R2 was being escorted by three battle droids, including OOM-10 who unknown to K2-B4 had been reprogrammed to serve the Republic. They managed to fool K2-B4 into thinking that R2 was their prisoner and were taking him for interrogation. However, when R2 and the captured Jedi and his team never reached the interrogation room, K2-B4 realized OOM-10 and the battle droids' reprogramming and alerted all Citadel guards to capture them."}, {"tag": "p", "text": "She was later transferred aboard a Lucrehulk-class Droid Control Ship orbiting Lola Sayu and was ordered by Sobeck not to let anyone past their defenses. However, when a rescue fleet under the command of four Jedi Masters arrived, K2-B4 failed to prevent them from entering the planet, and the Jedi successfully extracted the remaining members of the team and escaped back to Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "K2-B4 was voiced by Ashley Eckstein, who also provided the voice of Ahsoka Tano in the series. She is the first tactical droid whose designation does not begin with a 'T'."}, {"tag": "p", "text": "K2-B4's name is a reference to basketball player Kobe Bryant, who wore the jersey number 24 during the latter part of his career. Her color scheme of purple and gold matches that of the Los Angeles Lakers, who Bryant played his entire career for. These references were included by Lakers fans on the crew of The Clone Wars, as the Lakers won the NBA championship during production of \"The Citadel\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}