{"url": "KC-78", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Astromech droids", "Category:Droids of the Jedi Order", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "KC-78"}, {"tag": "p", "text": "KC-78 was an astromech droid with masculine programming that served Jedi Master Estala Maru during the High Republic Era. The droid assisted Maru in his duties as the Jedi in charge of operations aboard the Starlight Beacon space station in the time following the Great Hyperspace Disaster."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the time of the High Republic Era, KC-78 served Jedi Master Estala Maru, the Jedi head of operations aboard the Starlight Beacon, a space station co-managed by both the Jedi Order and the Galactic Republic. Maru himself worked with Controller Rodor Keen, the Jedi Master's Republic counterpart. In the time following the Great Hyperspace Disaster and nine hours prior to the dedication of the Starlight Beacon, KC-78 was present near Maru in the station's operations center. The droid stood behind Jedi Master Avar Kriss, who spoke with Maru and was appointed shortly afterward as the new marshal of Starlight by Grand Masters Pra-Tre Veter and Yoda."}, {"tag": "p", "text": "KC-78 was later present beside Maru and Keen in the station's medcenter, where victims of the Great Disaster and its subsequent Emergences were being treated. Shortly after Maru and Keen were greeted by Administrator Velko Jahen, the latter's new aide, KC-78 beeped with alarm, reminding the two that they had other duties. Though Keen turned to depart, Maru insisted that he could monitor operations from where he was in the medcenter. KC-78 nudged the Jedi, who begrudgingly followed Keen out."}, {"tag": "p", "text": "Later, after an assassination attempt against the Skembo Ambassador Ceeril in the medcenter, KC again accompanied Maru when he, Marshal Kriss, Keen, Jahen, Master Nib Assek and Padawan Burryaga Agaburry went to look at the scene of the crime. KC-78 played back the security recordings on his holoprojector, showing that the would-be assassin had tampered with them to hide their identity. After Ceeril accused two Hassarians also being treated in the medcenter of being the assassins, as his species and theirs were long-time rivals, most of the Jedi and Keen went to investigate. However, Maru stayed behind, and urged Jahen, who had been ordered to write up a report on the incident, to go to evidence room three in the security tower to examine the remains of Ceeril's bodyguard droid for evidence, as KC would be able to get her access."}, {"tag": "p", "text": "Examining the remains of the droid, Jahen discovered something odd about the remains of its head and had KC scan it with his microanalyzer, leading her to realize who the assassin was. Further examination of the bodyguard droid uncovered traces of detonite, as well as a hidden compartment inside its chest containing Hassarian DNA. All this confirmed Jahen's suspicions that Ceeril had staged the assassination attempt himself. KC accompanied Jahen back to the medcenter when she confronted the duplicitous Ambassador, displaying a hologram of the bodyguard droid which highlighted the hidden compartment as Jahen explained what she had discovered. Ceeril was subsequently taken to the detention center on Marshal Kriss' orders."}, {"tag": "p", "text": "Following the dedication, KC-78 accompanied Maru, the Jedi Knight Vernestra Rwoh and the Padawan Imri Cantaros as they performed an autopsy, under Kriss' request, on a dead Hutt trader whose body was found on a starship that had been attacked by Nihil marauders in the Kazlin system."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A squat astromech droid with masculine programming, KC-78 had white plating on his body and legs with an orange coloration on a square pattern around the circumference of his flat-topped head, as well as around its base. When attempting to get Maru to leave Starlight's medcenter and attend to his duties, the droid gave him an unsubtle nudge. KC eagerly assisted Velko Jahen in uncovering the truth behind the assassination attempt on Ambassador Ceeril, as well as in helping her expose the deception afterwards. He had access to secure rooms onboard the Starlight Beacon."}, {"tag": "p", "text": "KC-78 was equipped with a holoprojector which he could use to play back security recordings, and a microanalyzer which was useful in gathering evidence."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Created for the Star Wars: The High Republic publishing initative, KC-78 was first revealed in an uncolored preview from the first issue of the comic series of the same name, written by Cavan Scott and penciled by Ario Anindito, in The High Republic Free Digital Sampler on December 12, 2020. The droid first appeared when The High Republic 1 was published by Marvel Comics on January 6, 2021. KC-78's name was identified in the short story \"Starlight: First Duty,\" also written by Scott and published in Star Wars Insider 201 on March 17, 2021."}, {"tag": "p", "text": "The design of KC-78 was based on an astromech droid that was pictured on the cardboard background of the Cantina Adventure Set produced by Kenner in 1978. Having had a fondness for the droid, Scott wished to include it somewhere in the comic, though with a new appearance as opposed to the rusty droid pictured in the set."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}