{"url": "KE-8_Enforcer_Ship", "categories": ["Category:Canon articles", "Category:Air vehicles", "Category:Kaminoan vehicles"], "nodes": [{"tag": "h1", "text": "KE-8 Enforcer Ship"}, {"tag": "p", "text": "The KE-8 Enforcer Ship was a floating patrol vehicle utilized by the Kaminoan cloners of Tipoca City to identify and isolate aberrant clone troopers during the development and training of the Grand Army of the Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "A hovering, single-occupant pod, the KE-8 Enforcer Ship was a small and sleek vessel that saw use as a patrol vehicle. It was fitted with powerful manipulator arms and electroshock stun devices, located beneath the pilot. Two jets on either side of the cockpit propelled the Enforcer Ship through the air."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "KE-8 Enforcer Ships were deployed in the interior of the clone military education complex in Tipoca City, operating alongside larger Observation Ships and autonomous enforcer drones, to ensure quality control in the Kaminoan cloning process. Enforcer Ships patrolled the complex to identify and isolate aberrant clones, while those who displayed exceptional abilities were sent to receive specialized military education elsewhere. The KE-8s docked on the rings of deployment and recharge stations, accessed via an ingress/egress hatch, which were overseen by senior Kaminoan security officials from a command bridge. The vessels' activity and communications with Observation Ships were tracked via computer terminals and monitoring stations."}, {"tag": "p", "text": "Similar vessels, lacking the KE-8's manipulator arms and electroshock devices, were used as repair and maintenance droids on the military complex's maintenance floor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "KE-8 Enforcer Ships were in use as of Jedi Knight Obi-Wan Kenobi's visit to Tipoca City in 22 BBY. The vehicles carried out their patrols while Prime Minister Lama Su and her aide Taun We led Kenobi on a tour of the Tipoca City Military Complex."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}