{"url": "KE-UW33", "categories": ["Category:Canon articles", "Category:Aquatic vehicles", "Category:Galactic Republic vehicles", "Category:Submarines"], "nodes": [{"tag": "h1", "text": "KE-UW33"}, {"tag": "p", "text": "The KE-UW33, also known as Kamino submarine or simply Kamino sub, was a type of submersible vehicle manufactured by Kamino Engineering for use on the water planet Kamino."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The KE-UW33 \"Kamino submarine\" was a model of submarine developed for use on the aquatic planet Kamino. The Kamino sub was comprised of a spherical cockpit sandwiched between two air filtering nacelles, both 7.3 meters in length. A pair of headlights and taillights were mounted into the nacelles. In the event of an emergency, the cockpit could separate from the rest of the craft and operate as a life pod. The KE-UW33 submarine was capable of reaching speeds up to 140 kph. Because Kamino's oceans did not have any hostile creatures, the Kamino submarine was not equipped with any weapons. The KE-UW33 could only carry a single pilot."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The KE-UW33 was a submersible vehicle that allowed the user to travel through bodies of water. Designed for the depths of Kamino, the KE-UW33 was able to withstand the pressures of the aquatic planet's deepest oceans. Its headlights were bright enough to penetrate the dark sea."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The KE-UW33 submarine was manufactured by Kamino Engineering."}, {"tag": "p", "text": "In 21 BBY during the Battle of Kamino, Jedi General Obi-Wan Kenobi used a KE-UW33 to explore the Kamino sea. Kenobi was investigating the depths after he became suspicious of falling debris from destroyed Separatist ships. Underwater, Kenobi discovered Separatist aqua droids assembling the \"debris\" into Trident-class assault ships. The aqua droids assaulted Kenobi in his KE-UW33, and the Jedi was forced to eject from the submarine. He was ultimately saved by a passing Aiwha."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The KE-UW33 made it's first appearance in the 2010 Star Wars: The Clone Wars episode \"ARC Troopers\" as the \"Kamino submarine\". The Kamino sub was designed by concept artist Thang Le who worked under the guidance of supervising director Dave Filoni. The 2018 reference book Star Wars Encyclopedia of Starfighters and Other Vehicles identified the Kamino submarine as the \"KE-UW33\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}