{"url": "KS-23_Hammer", "categories": ["Category:Legends articles", "Category:Slugthrowers"], "nodes": [{"tag": "h1", "text": "KS-23 Hammer"}, {"tag": "p", "text": "The KS-23, unofficially known as the Hammer, was a model of slugthrower produced by Czerka Arms during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. The weapons fired explosive pellets over a short range and were primarily used by big-game hunters."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A model of slugthrower, the ruggedly constructed KS-23 fired high-power, small-sized, explosive pellets which scattered from the barrel when fired to cover a wide area and do the most damage possible over short and medium ranges. The guns were about the size of a blaster carbine, with a sturdy action, and composite furniture. They used tubular, five-round magazines that ran underneath the large-caliber smoothbore barrel and had a self-loading firing mechanism which used the weapons powerful recoil for power. The weapons proved to be incredibly loud and unsubtle but were made from high quality, resilient, materials were relatively easy to repair."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The KS-23 made by Czerka Arms and was popular but rare during the Galactic Civil War between the Alliance to Restore the Republic and the Galactic Empire. The weapons cost 1500 and was initially produced for use by big-game hunters in taking down large creatures like rancors and krayt dragons but gained a wide following in the Outer Rim Territories, with bounty hunters, explorers, smugglers and pirates often using them as well."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The KS-23 Hammer was first mentioned in Enter the Unknown, a sourcebook written by Sterling Hershey and released in 2013 for Fantasy Flight Games' Star Wars: Edge of the Empire roleplaying game."}, {"tag": "p", "text": "It shares the model name with the Soviet KS-23, a large-bore riot shotgun."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}