{"url": "KT-10", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Astromech droids", "Category:Feminine programming"], "nodes": [{"tag": "h1", "text": "KT-10"}, {"tag": "p", "text": "KT-10 was an astromech droid with a programmed female personality. She was captured by the giant droid known as the Great Heep on Biitu, and she and fellow astromech R2-D2 became romantically interested in each other while the two were being held captive in the Heep's droid harem. KT-10 was eventually fed to the Heep, had her power drained, and was deactivated. R2-D2 and the Heep's other astromech droid prisoners rescued her from the junkyard where she had been deposited and gave their power up to reactivate her."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "KT-10, an astromech droid with feminine programming, found herself on the Outer Rim planet Biitu in 15 BBY when she was captured by the Great Heep, a giant droid dispatched by the Galactic Empire to drain the agriworld of its resources. KT-10 was placed in the droid harem, a location in the Heep's base where he kept the astromech droids upon whose power he would regularly feed. There, like the other droids in the harem, she was pampered with oil baths and cushions to keep her unaware of her eventual fate. KT-10 attracted the attention of many of the other masculine-programmed droids there. While watching her, they found themselves distracted and prone to accidents."}, {"tag": "p", "text": "When the astromech droid R2-D2 was captured by the Great Heep, he was also deposited into the Heep's harem. KT-10, ignoring the attentions of the other droids, playfully cavorted at the edge of the oil bath that R2 was in. Attracted to her, the other droid approached her and connected his computer interface arm to hers. Despite this earning the jealousy of other droids in the harem, the two moved into the oil bath to play and spray oil at each other."}, {"tag": "p", "text": "Over the course of the next day, the two became very friendly, playing and nuzzling each other in the pools of oil. This happiness was not to last, however. The Great Heep needed more power, and wanted another R2 unit. R2-D2's counterpart, the protocol droid C-3PO, had meanwhile found his way into the harem to rescue R2-D2. When R2-D2 left the oil bath to speak to him, KT-10 was captured. She was taken to the Heep and fed to him, with the two other droids only able to hear her scream. KT-10's shell was deposited in a junkyard."}, {"tag": "p", "text": "In his attempt to escape, R2-D2 found his way to the same junkyard, where he found the remains of KT-10. He attempted to use his own power to reactivate her, but did not have enough power, and was also soon taken captive by the Great Heep."}, {"tag": "p", "text": "When the Great Heep was finally defeated and his droids set free, they and R2-D2 crowded around the empty shell of KT-10. R2-D2 again connected his power supply to her, only this time all the other droids linked up to him, so he could use their power as well. This was enough, and soon KT-10 was reactivated. She and R2-D2 reunited at last. Their relationship would not last, though. R2-D2 enjoyed adventure too much to settle down, and the two droids parted ways."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Considered to be an offshoot of the KT-series model of astromech droid, KT-10 was an ovoid astromech droid decorated in pink and red. Her sensors were blue, and the treads on the bottom of her legs resembled women's footwear. KT-10, despite being considered attractive by other astromech droids, was somewhat coy in her flirtations with R2-D2. Nonetheless, she allowed their relationship to advance very quickly, to the extent that R2-D2 was willing to sacrifice himself to save her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "KT-10 first appeared in The Great Heep, a 1986 TV special based on the Star Wars: Droids animated series. In The Great Heep, KT-10 is brought to the Heep when he demands \"another R2 unit;\" she is also described as an R2 unit in the second and third editions of A Guide to the Star Wars Universe, the Star Wars Encyclopedia, and The Complete Star Wars Encyclopedia. However, KT-10 looks nothing like an R2 unit, nor does her designation match that of the R2 series. Although unnamed in the episode, the droid was given a name in 1992's George Lucas: The Creative Impulse."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}