{"url": "Kaara", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Humans", "Category:Sith Sabers"], "nodes": [{"tag": "h1", "text": "Kaara"}, {"tag": "p", "text": "Kaara was a Human female Sith Saber in the Lost Tribe of Sith and the sister of fellow Saber Vran. In 44 ABY, Kaara and Vran were part of the crew of the frigate Starstalker when it was on a mission to capture the Force-entity Abeloth. During a stop at the planet Klatooine, the ship's captain, Vyn Holpur, sent several Sith—including Kaara—to the surface of the planet to obtain wintrium samples from a natural formation called the Fountain of Ancients. The local forces guarding the Fountain fought back against the Sith, and Kaara was killed in the ensuing skirmish."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kaara was a Force-sensitive Human female who was born on the remote planet Kesh sometime before the Second Galactic Civil War. Like her brother, Vran, she was a member of the Lost Tribe of Sith and eventually reached the rank of Sith Saber. In 44 ABY, Kaara and Vran were among those selected to join the crew of the ChaseMaster frigate Starstalker, which would be part of a fleet sent to ally with Jedi Grand Master Luke Skywalker for a mission to the Maw—an unstable and mostly unnavigable cluster of black holes—to neutralize the dark side being Abeloth. After meeting with Skywalker, the Sith fleet ventured to the planet Klatooine and waited there for the arrival of one of Skywalker's friends, Lando Calrissian, who would supply them with a ship that could help them navigate the Maw more easily."}, {"tag": "p", "text": "While in orbit over Klatooine, Vyn Holpur, the captain of the Starstalker, received orders from the Sith fleet's leader, High Lord Sarasu Taalon. The Sith Lord wanted to obtain some wintrium samples from a natural formation known as the Fountain of Ancients that was located on the planet. Kaara, her brother, and fellow Sith Sabers Turg, Marjaak, and Anyul then took a skiff and landed it next to the Fountain to begin the process of taking the samples. However, the group was quickly attacked by native Klatooinians defending the Fountain. As modern technology was forbidden within a one-kilometer distance of the Fountain, the guards only carried archaic weapons and were not perceived as a threat by Kaara and her companions. That changed when Kaara was hit by an acid missile that began to tear through her armor and skin. Despite the immense pain she suffered, Kaara succumbed to her wounds without uttering a word of pain."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "While attempting to obtain wintrium samples from the Fountain of Ancients on Klatooine, Kaara found Turg's comments regarding the native defenders' archaic weapons to be very amusing. Although that did not affect the accuracy of her blasterfire, she was nevertheless taken by surprise when struck by an acid missile. Despite the significant pain she suffered, Kaara died without saying anything, behavior befitting of a Sith Saber. Like her brother, Vran, Kaara had black hair and blue eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During the skirmish at at the Fountain, Kaara wore a full armorweave for protection and used a blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kaara appeared in Allies, the fifth novel of the Fate of the Jedi series. The novel was written by Christie Golden and published in 2010."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}