{"url": "Kabal/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Galactic Republic planets", "Category:Kabal locations", "Category:Mayagil sector planets", "Category:New Republic planets", "Category:Shadowports", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Kabal"}, {"tag": "p", "text": "Kabal was an Outer Rim planet in Mayagil sector, on the Sharlissian Trade Corridor."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Kabal suffered food shortage riots following the Trade Federation's abandonment of the Trade Corridor supposedly in protest of heavy Galactic Republic taxation, but actually a calculated move to encourage the planet to secede from the Republic. Count Dooku then sent Separatist ships to the planet to air-drop food, thus making himself seem a hero. A riot ensued, killing four Jedi as well as Premiere Jan Dovu. The grateful (if duped) populace seceded shortly before the Clone Wars."}, {"tag": "p", "text": "The planet remained neutral during the Galactic Civil War and hosted the Conference of Uncommitted Worlds just after the destruction of the first Death Star, which resulted in an Imperial assault on Shoribus (sparing the rest of the planet). Leia Organa attended the conference, meeting with Silver Fyre there before becoming trapped by the bombardment. She rendezvoused with Luke Skywalker, but both had to be rescued by Han Solo and the Millennium Falcon. The Imperial attack did little to change the planet's neutrality."}, {"tag": "p", "text": "The quiet coastal fishing town of Palisade, on the planet's largest equatorial island (half a hemisphere away from Shoribus), was the location of the estate of eccentric Krish business magnate Tyro Viveca, and where he liked to engage in his passion for hunting. One of its few public attractions was a bazaar. Palisade's sudden cloudbursts often surprised visitors, betraying their presence to the natives, who seldom reacted to the unexpected storms. Most of the locals survived off native saltfish. Viveca's estate was terraformed to include grasslands, stagnant peat bog swamps home to furry gray water-spiders, rocky scrublands with arthropod borers, and hilly, stranglethorn patches, bambooi jungle thickets, and deciduous arboray tree forests where cordgrass grew. Viveca died in an explosion a year after the bombing of Shoribus, an event investigated by order of Palisade's mayor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}