{"url": "Kabieroun_(species)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Kabierouns", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Kabieroun  (species)"}, {"tag": "p", "text": "The Kabierouns were a sentient species indigenous to the planet Kabieroun in the Outer Rim Territories. Their physiology was roughly humanoid, with a long, wrinkled snout that featured two dark eyes and a triangular mouth. The Kabieroun face hung from a lengthy, muscular neck that swooped forward from a bulky torso. With a large frame, Kabierouns towered over most Humans. At least some members of the species integrated into the greater galaxy, attending schools and finding employment. However, after the rise of the New Order, the Galactic Empire enslaved Kabierouns on their homeworld, and those members of the species abroad faced speciesism. Detien Kaileel, a green-skinned member of the species, served for decades as a security agent but turned to running blasters to the Rebel Alliance after the enslavement of his people."}, {"tag": "h2", "text": "Appearance and biology"}, {"tag": "p", "text": "Although the Kabieroun body was roughly humanoid—with two arms, two legs, and a head—the frame was much bulkier and the torso much thicker than that of the typical Human. This overlarge frame made the Kabierouns an imposing sight to smaller species, giving the sentients an intimidating appearance that was bolstered by the great strength provided by rippling muscles visible in the chest, arms, and neck. While the upper arm was thin, the lower arm was bulky, with a bulge of flesh toward its underside. Scales covered the shoulders and arms, and the skin of at least some Kabierouns was green, its color darkening while blushing. Each hand featured five long, suction-cup-tipped fingers—two of them thumbs—and each foot featured at least two digits. A bulge grew from the small of the back, and a thin layer of white hair covered the Kabieroun body. Kabierouns had two sexes, male and female."}, {"tag": "p", "text": "The Kabieroun neck was long and arched, swooping up, forward, then down before jutting forward horizontally from its midpoint. Although the back of the neck was rounded, the underside was flat until the the midpoint, when it was rounded and wrinkled. The enormous head was characterized by a cleft skull that extended downward as a cylinder; this was flanked by two large, flat, pointed ears. The Kabieroun face hung downward from the lowest point of the head, surrounded by waves of wrinkles. The visage itself consisted of two large, black eyes, a thin, fingerlike proboscis with two nostrils, and a triangular mouth with a red tongue, which remained hidden behind the rest of the snout when seen from the front. Kabieroun lips were pliable enough to allow the species to smile and make other expressions."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Kabierouns could manipulate galactic-standard technology and even sit in chairs designed for beings with different physiologies. They could speak Basic, although some members spoke that language with a strong accent. One Kabieroun who had integrated into the galactic community, Detien Kaileel, wore a form-fitting, sleeveless jumpsuit and sported an earring in his left ear."}, {"tag": "p", "text": "Kabierouns expressed emotions in ways similar to Humans; Detien Kaileel, for instance, pulled on his earring when embarrassed, smiled when content, shook his head when incredulous, and trembled when nervous. Kaileel also expressed emotions of annoyance, gentleness, suspicion, and discontent."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Kabieroun homeworld was the planet Kabieroun. It was located in the Nijune sector, part of the New Territories of the Outer Rim. After the rise of the New Order, the Kabieroun homeworld was seized by the Galactic Empire, and much of the planet's populace was enslaved. Years later, during the Thrawn campaign, the planet fell within neutral territory, neither part of the Imperial Remnant nor the New Republic. From 10 to 11 ABY, the Kabierouns' home planet fell within Imperial Remnant territory."}, {"tag": "h2", "text": "Kabierouns in the galaxy"}, {"tag": "p", "text": "Those Kabierouns who left their homeworld for the greater galaxy during the reign of Emperor Palpatine faced discrimination. Detien Kaileel was among those members of his species to emigrate before the institution of the Empire and before the enslavement of his people. He entered the Balaidas Academy to study police science, one of the last non-Humans to do so before the institution closed admissions to non-Humans under the rule of the New Order. After graduating with honors, Kaileel served as a member of the Mid-Rim Sentinel Agency for over 20 years, leaving the organization after being wounded while pursuing a crime lord. The Kabieroun then took what he considered to be a safer position as head of security on the luxury liner Kuari Princess. Kaileel grew increasingly concerned about what he perceived to be the misdeeds of the Galactic Empire. The security officer eventually began to use his security clearance to smuggle guns to Rebel Alliance operatives on the planet Mantooine, part of the Kuari Princess's route. At some point in the years leading up to the Battle of Endor, his efforts came to the attention of the Imperial Security Bureau, and the Human agent Adion Lang was dispatched to the Princess to arrest the Kabieroun. Despite the intervention of Kaileel's friends, Celia Durasha and Dap Nechel, a firefight broke out between Kaileel and Lang, and the Kabieroun was shot and killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The cover of Riders of the Maelstrom, an adventure for Star Wars: The Roleplaying Game published by West End Games in 1989, depicts a large, green-skinned alien seated at a hologame table with a Human woman as a smaller alien looks on. Although this image, painted by Daniel Horne, appears on the book's cover, the adventure itself contains no information about the game players. Years later, Peter M. Schweighofer, editor of the Star Wars Adventure Journal, wanted to use the image in his publication. He challenged author Charlene Newcomb to write a short story based on the painting, and the result was \"A Certain Point of View,\" published in Star Wars Adventure Journal 8 in November 1995. Newcomb identified the green alien—Detien Kaileel—as well as his companions in the image. She also named his species as the Kabierouns and provided some background on the species' enslavement by the Empire. The game statistics used for Kaileel indicate that the Kabierouns enjoy no game bonuses over Humans and other species."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}