{"url": "Anora_Fair", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:Journalists", "Category:Resistance fighters"], "nodes": [{"tag": "h1", "text": "Anora Fair"}, {"tag": "p", "text": "Anora Fair was a human female who worked as a journalist shortly after the rise of the Galactic Empire. Anora was a close friend of the Zygerrian film maker Hask Taff. In 18 BBY, the two helped expose the Antar Atrocity, a violent Imperial purge that indiscriminately slaughtered numerous civilians on Antar 4 including Republic loyalists. Their relentless coverage and criticism of the Empire made them targets of the Imperial Security Bureau."}, {"tag": "p", "text": "The former Republic Intelligence officer Berch Teller spirited Anora and Hask into hiding. The two subsequently joined Teller's rebel cell, which sought vengeance against Moff Wilhuff Tarkin for his role in engineering the Antar Atrocity. After stealing Tarkin's personal starship Carrion Spike, the insurgents launched a brief insurgency against the Empire. Following the Battle near the Gulf of Tatooine, Anora and most of Teller's followers were captured, interrogated, and executed by the Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Antar Atrocity and Berch Teller"}, {"tag": "p", "text": "Anora Fair was a Core Worlds–based journalist who lived during the Clone Wars and the Imperial Era. A vocal critic of the Galactic Empire, Fair was known for her probing interviews with Imperial officials and her editorials criticizing Imperial policies and the Emperor Palpatine. During the Antar Atrocity of 18 BBY, Fair reported extensively on Imperial atrocities. Her reports were supplemented by holographic reenactments of arrests and executions, produced and directed by her Zygerrian colleague Hask Taff. Their primary source was Berch Teller, a disaffected Republic Intelligence officer who was outraged by the indiscriminate slaughter of Gotal and Koorivar loyalists he had trained during the Antar Atrocity."}, {"tag": "p", "text": "Due to their coverage of the Antar Atrocity, the Imperial Security Bureau targeted Anora and Hask for assassination. However, the two managed to escape into hiding with the help of Teller, who formed a rebel cell dedicated to resisting the Empire. Teller's rebel cell consisted of many survivors and witnesses of the Antar Atrocity who bore a special hatred for Moff Wilhuff Tarkin, the architect of the Antar Atrocity. Teller's cell was secretly aided by the Imperial Vice Admiral Dodd Rancit, a rival of Tarkin and Director of the Naval Intelligence Agency. Rancit used his high-level intelligence and underworld connections to supply the dissidents with Clone Wars-era weapons, starships, communications equipment, and intelligence."}, {"tag": "h3", "text": "Theft of the Carrion Spike"}, {"tag": "p", "text": "In 14 BBY, following the failed attack on Sentinel Base, Anora along with Hask, Teller, the Gotal pilot Salikk, the Koorivar operations specialist Cala, and the Mon Calamari engineer Dr. Artoz took part in a mission to steal Moff Tarkin's stealth corvette Carrion Spike. Teller intended to use Tarkin's starship to stage attacks on Imperial targets across the galaxy. To inspire rebellion, Anora and Task were tasked with producing holovids of the attacks that would be broadcast on HoloNet, mimicking the Separatist Shadowfeed broadcasts of the Clone Wars."}, {"tag": "p", "text": "The insurgents were aided by Rancit, who planted a communications cache on the planet Murkhana. While Tarkin and Darth Vader visited the planet to investigate, the insurgents stormed and stole the Carrion Spike. Despite luring Sergeant Crest and most of the guards away, the insurgents still had to fight and kill the ship's captain, comms officer, and two stormtroopers. During the skirmish, Anora collided with Hask, causing her friend to shoot her blaster, damaging the airlock."}, {"tag": "p", "text": "After stealing the Carrion Spike, the insurgents fled into space. While traveling through the Murkhana system, Anora asked Artoz which of the controls emptied the toilets. She and Hask then argued over who was to blame for the damaged airlock until Teller intervened. When Anora asked if all of the Emperor's Moffs had advanced starships, Teller responded that Tarkin was the only known Moff to be afforded such a privilege. Hask also corroborated Teller's account that Tarkin had been designing ships for his homeworld of Eriadu's Outland Regions Security Force when he was nineteen years old"}, {"tag": "p", "text": "Anora also asked Teller why Tarkin named his ship the Carrion Spike but the former intelligence officer admitted his ignorance on the matter. When Hask referred to Darth Vader by his adoptive name, Anora dismissed Vader as a machine and a terrorist. She also told Teller that he took a real risk by having Vader and Tarkin walk right into a \"sliding door ambush.\" Teller said they had to make the scenario ring true and that the Imperials getting themselves blown up would not have affected their plans in any way."}, {"tag": "p", "text": "The rebels were soon pursued by the Parsec Predator, the personal starship of the Sugi crime lord Faazah. Hask and Anora quickly deduced that they were being pursued by Tarkin and Lord Vader, who had commandeered the Parsec Predator. Under Teller's direction, the rebels took a hyperspace jump to the Fial system. However, Vader was able to track them down using meditation sphere aboard the Carrion Spike. The rebels then made a second jump to the Galidraan system."}, {"tag": "h3", "text": "Raids on Galidraan and Lucazec"}, {"tag": "p", "text": "Teller's insurgents then raided the Imperial station in the Galidraan system. Using the Carrion Spike's cloaking systems, the insurgents attacked the station, inflicting considerable damage and casualties. Since the corvette was cloaked, the defending V-wing and ARC-170 starfighters were unable to hit the Carrion Spike. Tarkin and Vader soon resurfaced aboard the Parsec Predator and managed to inflict some damage on the rogue corvette before being disabled."}, {"tag": "p", "text": "Despite their successful raid, the Carrion Spike sustained damage. When Anora reported that the airlock controls for the escape pods were fried, Teller responded that they would not need the escape pods. Before fleeing into hyperspace, the rebels ejected Vader's meditation chamber and destroyed Galidraan's hyperspace buoy. The insurgents then traveled to Lucazec where they raided the TaggeCo mining facilities on that planet. Anora and Hask also produced holovids that were broadcast on the Imperial HoloNet. These holovids drew the attention of the Emperor and his Imperial Ruling Council."}, {"tag": "h3", "text": "Ordeal at Phindar"}, {"tag": "p", "text": "With the Carrion Spike needing to refuel, the insurgents traveled to the planet Phindar in the Mandalore sector. Their source Teller had confirmed that the Imperials had deployed ships to Gromas in the Perkell sector, the other source of the special fuel cells that the Carrion Spike needed. Anora and her comrades watched as Teller donned an Imperial's officer uniform so that he could impersonate Commander Abel LaSal in order to purchase fuel cells from an orbital tanker above Phindar. Teller also praised Anora's work on the Lucazec holovid."}, {"tag": "p", "text": "When Hask confronted Teller about indiscriminately targeting civilians in their attacks, Teller questioned Hask's devotion to their cause. Anora managed to calm the situation by saying that Hask was sometimes forgetful. After Teller's rant, she quipped that he was like a holodrama actor. Teller responded that if the Emperor had his way, artists would the first targeted for eradication. Before the trade, Teller also asked Anora about how he looked in a red wig."}, {"tag": "p", "text": "Despite Teller's precautions, the Phindian administrator was suspicious about \"Commander LaSal\" and alerted Tarkin and Lord Vader. Before the Carrion Spike had finished refueling, Tarkin and Lord Vader arrived with the Imperial escort carrier Goliath and the V-wing Yellow Squadron. While waiting for the hyperdrive to load, the Carrion Spike ran circles around the tanker to make it harder for the Imperials to target their ship. During a brief dogfight, the Carrion Spike also managed to shoot down several of Vader's V-wings. Before jumping into hyperspace, the insurgents also blew up the Phindar tanker with a concealed explosive in an attempt to take out Vader and the Emperor."}, {"tag": "p", "text": "Anora sustained some injuries to her forehead, necessitating the clipping away of some of her curls to accommodate two squares of bacta patch. When Teller remarked that close calls made captivating holovids, Anora pointed out that the Empire had suspended HoloNet service to most of the Mandalore sector. She doubted that their transmission reached more than six systems. Teller reassured her that they only need to reach one for the holovid to spread to other sectors. Anora and the others listened as Teller recounted Tarkin's ruthless rise to power on Eriadu and their struggle against the Emperor's plan to winnow the galaxy into submission. When Hask observed that Tarkin also indiscriminately targeted the people, Hask reminded her friend that they were the \"good guys.\""}, {"tag": "h3", "text": "Covering their trail"}, {"tag": "p", "text": "Anora was present Cala found a paralight tracker inside one of the new fuel cells from the Phindar tanker. She suggested calling quits but Teller countered they had not done near enough to defeat the Empire. Teller decided to mislead the Imperials by transmitting coordinates and sending a decoy ship in their place. Knotts aided the insurgents by hiring a crew to travel on the freighter Reticent to the Obroa-skai system."}, {"tag": "p", "text": "Acting on this disinformation, Tarkin and Lord Vader deployed substantial forces including three Imperial interdictor vessels to intercept the Carrion Spike. However, one of the interdictors, an Immobilizer 418 cruiser, malfunctioned, causing a massive hyperspace accident that claimed 1,100 lives. Despite the diversion, Tarkin and Vader managed to interrogate the crew of the Reticent and learned about Knott's involvement. Tarkin subsequently discovered information on the HoloNet incriminating Teller and his followers including Anora. Tarkin realized that the insurgents were seeking revenge for the Antar Atrocity."}, {"tag": "p", "text": "While resting in the Carrion Spike's cockpit, Anora and Teller discussed their plans after their next raid on the Imperial facility in the Nouane system. She also thanked Teller for giving Cala the privilege of destroying the paralight tracker. When Anora asked when they would leave, Teller replied they would leave in a couple of hours. Anora then asked Teller if he trusted his mysterious source, Vice-Admiral Rancit. Teller conceded that he only trusted Rancit to a point but was convinced of his usefulness."}, {"tag": "p", "text": "When Anora confronted Teller about the fate of their decoys at Obroa-skai, he replied that they knew the risks. Anora confided that she did not envisage living the life of a revolutionary. Teller disagreed and pointed out that she was fighting the good fight with words when he found her. Anora responded that writing was different from firing laser cannons at other beings or letting others take the fall for them. When Teller pointed out that she had been enthusiastic to join, Anora admitted that she was motivated by fame and fortune. However, she acknowledged that she had underestimated the Commission for the Preservation of the New Order and the Emperor."}, {"tag": "p", "text": "Anora added that she underestimated the Emperor's reach, power, and barbarity. When Teller reassured her that she was not the only one to underestimate the Emperor, Anora confided that she felt bad for dragging Hask into this adventure. Teller indicated he was allright with dropping her off but added that Hask was most likely to say no. Anora admitted Teller was right and asked about their chances of winning. He responded by pointing out they were winning."}, {"tag": "h3", "text": "Attack on Nouane"}, {"tag": "p", "text": "Under Rancit's guidance, Teller's insurgents attacked the Imperial facility in the Nouane system. Despite exiting hyperspace at the edge of the system to avoid Imperial capital ships, the Carrion Spike was repelled by the strong Imperial defenses. Though the rebels were able to escape, the Carrion Spike sustained considerable damage to its armaments, shields, hyperdrive motivator, stealth systems, and sublight drives."}, {"tag": "p", "text": "Following their escape, Anora criticized Teller for trusting his mysterious ally to hold up his end of the bargain. Teller countered that he trusted his source to a point but not entirely. Though Teller was convinced that Rancit had deployed reinforcements to hide his collusion with the rebels, Anora pointed out that they had been betrayed. Teller conceded but reassured her that Rancit's betrayal would not matter."}, {"tag": "p", "text": "Though Rancit had given them safe passage to attack the Imperial Academy on Carida, the rebels realized that Rancit was trying to betray them. They decided to evacuate the Carrion Spike but sent the ship on auto-pilot mode. As expected, Rancit had planned to destroy the Carrion Spike and her rebel crew. However, Lord Vader had discovered his treason and stopped the Vice-Admiral from destroying the ship and evidence of his collusion with the insurgents. Vader then executed Rancit by forcing him to enter an escape pod and issue the order to destroy it."}, {"tag": "h3", "text": "Last stand near the Gulf of Tatooine"}, {"tag": "p", "text": "After evacuating the Carrion Spike, Anora and her comrades rejoined the rest of Teller's cell aboard Berch Teller's warship, a modified Providence-class carrier in a star system near the Gulf of Tatooine. With much of the Imperial fleet dispersed across the galaxy in response to the Carrion Spike's raids, the insurgents planned to ambush an Imperial convoy ferrying supplies for the secret Death Star project on Geonosis. Anora and Hask were tasked with producing a \"galactic-class holovid\" of the ambush."}, {"tag": "p", "text": "For the battle, Teller marshaled his rebel cell's modified Providence carrier, a Nebulon-B frigate, numerous droid fighters, and several Z-95 Headhunter and Tikiar starfighters. When the convoy emerged from hyperspace, the insurgents jammed their HoloNet and communications transmitters. Though the convoy's escort gunboats and frigates formed a defensive circle around the cargo ships and transports, the insurgents' lasers managed to chip away at the perimeters, allowing droid fighters to dart through the openings and harry the larger vessels."}, {"tag": "p", "text": "However, the tide of the battle turned with the arrival of Moff Tarkin aboard the Imperial Star Destroyer Executrix. Tarkin deployed V-wings to counter the rebel starfighters. After destroying the Nebulon-B frigate, Tarkin unleashed the Executrix's firepower on the rebel's Providence carrier, crippling the ship. Since Anora and Hask had produced a holovid showing Teller escaping to fight another day, Anora and Salikk convinced a reluctant Teller to flee into hyperspace while they stayed behind as martyrs."}, {"tag": "h3", "text": "Capture and execution"}, {"tag": "p", "text": "Anora along with Hask Taff, Knotts, and Dr Artoz were among the rebels taken prisoner by Tarkin's stormtroopers, who boarded the wrecked Providence carrier. Tarkin greeted his captives, remarking that Anora had restyled her hair. When Tarkin taunted the captives for their defiant silence, Anora told the Moff that he would fall from his perch soon and that it would not be a soft landing. When Tarkin quipped about expecting an apology for the damage to his starship, Anora contorted her shackled hands into an obscene gesture. This prompted a stormtrooper to hit her with his blaster rifle. Tarkin mocked Anora for her \"venomous mouth\" before taunting his prisoners that the Empire would find ways of loosening their tongues."}, {"tag": "p", "text": "Over the next three weeks, Anora and her rebel comrades and collaborators were interrogated by Tarkin, Lord Vader, and the Imperial Security Bureau. Though the ISB advocated public executions, the Emperor ordered that they be executed in private to deny the dissidents martyrdom."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Anora Fair was a fit and slender human woman with dark skin the color of tropical hardwood. She had naturally black curly hair but had it dyed to a mishmash of brown and blond. Anora was a close friend and colleague of Hask Taff though the two sometimes argued. As a journalist, Anora was familiar with key facts in Wilhuff Tarkin's biography including designing ships for Eriadu's Outland Regions Security Force. She also despised Darth Vader and refused to address him by his name, regarding him as a terrorist and machine."}, {"tag": "p", "text": "Unlike Hask, Anora was more willing to embrace Teller's idea of targeting anyone who supported the Empire including civilian miners and refuel station personnel. When Teller chastised Hask for questioning their cause, Anora spoke up for her friend by suggesting that she was forgetful. While recognizing that they and their opponent Tarkin engaged in indiscriminate killings, Anora and Teller accepted the reasoning that their actions were justified because they were the \"good guys.\""}, {"tag": "p", "text": "Anora's motivation for joining Teller's rebellion was fame and fortune. Though she was a staunch critic of the Empire, she did not envisage living the life of a revolutionary. Anora also privately regretted drawing her friend Hask into the Rebellion. Despite her inner doubts, Hask shared Teller and his other followers' desire to oppose the Empire and Tarkin. Anora and her comrades' respect for their leader Teller led them to risk their lives by staying behind so that Teller could escape Imperial pursuit. Even in captivity, Anora remained defiant towards her Imperial captors and openly defied Tarkin."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Anora Fair was a journalist and a skilled film-maker. She and Hask co-produced several holovids depicting Teller's raids against the Empire."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Anora wore a white utility suit and ankle-length ship-tread boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Anora Fair first appeared in James Luceno's 2014 Canon novel Tarkin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}