{"url": "Kad_Ha%27rangir", "categories": ["Category:Legends articles", "Category:Mandalorian deities"], "nodes": [{"tag": "h1", "text": "Kad Ha'rangir"}, {"tag": "p", "text": "Kad Ha'rangir was a deity in the ancient Mandalorian religion. Known as the destroyer god, the vigorous Kad Ha'rangir was viewed by the Mandalorians as the bringer of change and growth upon the universe. Kad Ha'rangir opposed the sloth-god Arasuum—the personification of idleness and stagnation—in a war that spanned eternity."}, {"tag": "p", "text": "The ancient Mandalorians waged ritual warfare as a means of worship to Kad Ha'rangir, seeking his favor as they defied the temptations of idle consumption offered by Arasuum. These warriors became known as Mandalorian Crusaders, a reflection of the holiness embodied by the conflict they engaged in, and viewed their clans as Kad Ha'rangir's chosen people."}, {"tag": "p", "text": "Over time, worship of Kad Ha'rangir and the belief in Arasuum fell out of favor in the Mandalorian culture. Upon witnessing a spiritual vision on the planet Shogun, the Mandalorian leader known as Mandalore the Indomitable preached that the act of war itself would be the center of Mandalorian worship, and that to wage war was to be divine, though the worship of war, too, would decline as the centuries passed. However, Kad Ha'rangir and the Mandalorian gods were not completely forgotten: millennia later, in 19 BBY, the Mandalorian soldier Kal Skirata knew of their former place in Mandalorian mythology, and the historian Vilnau Teupt recounted their importance to the early Mandalorians during his keynote speech at the four hundred twelfth Proceedings of Galactic Anthropology and History at the Brentaal Academy in 24 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kad Ha'rangir first appeared in Star Wars Legends in the article titled The Mandalorians: People and Culture. Authored by Karen Traviss, the article was published February 2006 as part of the eighty-sixth issue of the Star Wars Insider magazine. Kad Ha'rangir was also mentioned in the later reference book The Essential Guide to Warfare, written by Jason Fry and Paul R. Urquhart, and published April 3, 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}