{"url": "Kaddo_Moll", "categories": ["Category:Legends articles", "Category:Females", "Category:Ithorians", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Kaddo Moll"}, {"tag": "p", "text": "Kaddo Mall was a female Ithorian Jedi Knight who fought during the Clone Wars, in the last days of the Jedi Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A female Ithorian, Kaddo Moll was trained in the ways of the Force by the Jedi Order, eventually attaining the rank of Jedi Knight. During the Clone Wars, Moll took up the rank of general within the Grand Army of the Galactic Republic. Near the end of the war, Moll was assigned to lead the invasion of the Cato Neimoidian city of Jorra alongside fellow Knights Suljo Warde and Jiv Durael. After a successful invasion of the city, Moll and her colleagues remained behind to fortify the Republic's position. As the Jedi and Republic forces occupied the city, many of the Neimoidian residents resented the Jedi, something that began to eat away at Jedi Warde."}, {"tag": "p", "text": "As her colleague began to grow more and more anxious, Moll watched with caution and concern as Jedi Warde began arresting civilians on the grounds that they would aid the Confederacy war effort in the future; something he knew due to his precognitive skills. Trying her best to intervene on behalf of the public good and their mandate from the High Council on Coruscant, Moll could not prevent butting heads with Warde, and he eventually grew to distrust the Ithorian. The tipping point for Warde came when a delegation of Trade federation officers and CIS diplomats arrived in Jorra to negotiate a ceasefire. Moll accompanied Warde and Durael to Sankar Palace where the talks were to be held, but was discouraged when Warde warned of a vision in which the ceasefire was a ploy to end the Republic occupation. Fearing the repercussions of acting prematurely to one of Warde's visions, Moll and Durael insisted that the negotiations proceed uninterrupted. As the negotiations began, Warde unleashed his rage on the assembled delegates and slew the Neimoidians where they stood. Appalled, Moll and Durael drew their lightsabers and declared their intention to arrest their wayward brother. Dueling through the halls of the Palace, Warde slew Durael, convincing Moll that he no longer needed to be taken alive. Slipping past Warde's defenses, Moll landed a grievous strike to the fallen Jedi, but was too slow to defend against his upswing, which cut deep into her chest. As she lay dying, Moll was able to send word to the High Council and recount the events that had led to her death. While Warde fled, Moll died alone in the Palace. Moll and Durael's bodies were never recovered by the Order, as the Jedi were all but destroyed with the rise of the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}