{"url": "Kadikla", "categories": ["Category:Legends articles", "Category:Mandalorian culture", "Category:Mandalorian organizations"], "nodes": [{"tag": "h1", "text": "Kadikla"}, {"tag": "p", "text": "Kadikla was a Mandalorian nationalist ideological movement that arose in the years after the Yuuzhan Vong War, and the aftermath of the Yuuzhan Vong's assault on the Mandalorian's cultural homeworld of Mandalore. Headed by the Mandalorian soldier Venku Skirata—often known under the nickname and alias of Kad'ika—kadikla was described by those familiar with the concept as a \"Mandalore-first\" movement. Kadikla advocated the need for Mandalorians to band together and put the greater good of the planet Mandalore and its people over the desires of the individual, establishing Mandalorian space as a strong, independent state in which every Mandalorian could flourish. Several Mandalorians supported the kadikla movement, including Goran Beviin, Graad, members of Clan Skirata, and numerous others. Mand'alor Boba Fett was swayed into a tepid support following a meeting of the Mandalorian clans at MandalMotors Hall in 40 ABY, during and after which he issued several edicts that aligned with kadikla ideals in pursuit of bettering Mandalore."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Kadikla was an ideological movement that advocated a more nationalist stance for the Mandalorian warrior clans. While the clans had a history of banding together in times of need, the Mandalorians had largely been against the organized government and bureaucracy present in states such as the Galactic Alliance, due to their independent and often nomadic culture. Known colloquially as a \"Mandalore-first\" movement, proponents of kadikla preached that while their nomadic traditions had served the Mandalorians well in the past, a strong, central, Mandalorian nation would be to the benefit of all, providing the nomadic Mandalorians a powerful citadel upon which they could rely and fall back upon, and one the aggressive factions of the galactic community would be remiss to attack."}, {"tag": "p", "text": "The goal of kadikla was to provide the members of the warrior clans—often employed by foreign powers as bounty hunters and mercenaries—with greater opportunities for success and self-determination. Instead of hiring out their services to outside agencies that cared little for the lives of the soldiers in their employ, often out of a desperate need for credits to provide for oneself and family, kadikla promoted the idea that a Mandalorian should never be forced to fight in order to make ends meet, establishing domestic opportunities for income. According to kadikla, a Mandalorian soldier need only ever fight to protect oneself, their family, and homeworld; mercenary work was still considered an acceptable means of acquiring income, so long as it was the choice and preference of the individual, rather than a necessity of last resort."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Named for the movement's founder, Kad'ika—the life-long nickname and alias of the soldier Venku Skirata—kadikla found its roots in the ideas passed along to Skirata from his paternal grandfather, Kal Skirata. A veteran mercenary who had worked in the employ of a number of criminals and corporations, the elder Skirata developed strong views on Mandalorian self-sufficiency that he passed on to his grandson."}, {"tag": "p", "text": "During the invasion of the galaxy by the extra-galactic Yuuzhan Vong species, the alien invaders launched an assault on the Mandalorian's cultural homeworld of Mandalore in 29 ABY. Though the Mandalorians were able to repel the Yuuzhan Vong attack successfully, the planet and its people had suffered significantly, to the point that Mandalore continued to bear the scars of the battle more than a decade later. It was in the aftermath of this devastation that kadikla began to take root. Influenced by his grandfather's philosophy, Venku Skirata began speaking before groups of Mandalorians, spreading the ideals of kadikla across Mandalore and making a name for himself, as the movement gained notable traction in a community ravaged by the Yuuzhan Vong. Skirata was supported by the members of his clan, and came to sway a large number of other Mandalorians, winning over the likes of the Mandalorian supercommando Goran Beviin, and other influential members of the culture such as Neth Bralor and Graad. Graad, himself, became a vocal supporter of kadikla, known amongst his peers for breaking into lengthy discussions on the movement's merits."}, {"tag": "p", "text": "In the year 40 ABY, a meeting was held at MandalMotors Hall in Mandalore's capital city, Keldabe, wherein a multitude of clan chieftains, local business owners, and other prominent Mandalorians met with Boba Fett, the reigning Mand'alor—traditional leader of the Mandalorian clans. Discussing the state of Mandalore and Mandalorian affairs, kadikla principles were offered both by Neth Bralor and Graad, though the movement was derided by Baltan Carid and a number of their fellows at the meeting. Despite the dissenting opinions of Carid and a few others, Fett took an interest in the ideals of kadikla that Graad put forward, and subsequently made several decrees in line with the movement, including recalling two million Mandalorians from around the galaxy to replenish Mandalore's diminished population. Venku Skirata praised Fett's decision when the two soldiers met some weeks later, though Skirata continued to speak before gatherings of clan leaders on the ideals of kadikla in the hope that the movement might gain greater acceptance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kadikla was first introduced to Star Wars canon via an indirect mention in the second entry in the Star Wars: Legacy of the Force novel series. Entitled Legacy of the Force: Bloodlines, the novel was authored by Karen Traviss and published August 29, 2006. The movement was later named in Traviss' subsequent entry in the Legacy of the Force series, Legacy of the Force: Sacrifice, published a year later on May 29, 2007, before appearing again in the penultimate novel in the series, Legacy of the Force: Revelation published February 26, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}