{"url": "Kadir_(Moff)", "categories": ["Category:Legends articles", "Category:Coruscant Security Force officers", "Category:Humans", "Category:Males", "Category:Moffs of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Kadir  (Moff)"}, {"tag": "p", "text": "Kadir was a male Human Imperial Moff who served as commander of the Coruscant Security Force. He became one of the conspirators in Grand Moff Trachta's plot to overthrow the Order of the Sith Lords and take control of the Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 1 BBY, Kadir was accompanied by Darth Vader and Grand Moff Trachta in Imperial Center. Kadir and Trachta witnessed as Vader tested the blaster accuracy of the stormtroopers. Impressed by their skill with the E-11 blaster rifles, Vader ordered an entire stormtrooper battalion to escort Grand Moff Wilhuff Tarkin to the Death Star. However, Kadir rejected the Dark Lord's orders, because the stormtroopers were supposed to be assigned to Coruscant Security Force. Vader reminded him that Kadir's father and predecessor in the CSF was executed for demanding more soldiers than he was given. Vader recommended Kadir not to express his views unless he wanted to share the fate of his predecessor. Kadir was angered by Vader's arrogant attitude, but he had to, albeit reluctantly, transfer the stormtroopers to Tarkin's ship."}, {"tag": "p", "text": "The incident sparked the beginning of Kadir's hostile stance on the Sith, and he contemned the fact that Emperor Palpatine and Darth Vader were the most powerful men of the Empire. He and Trachta discussed the subject, and Kadir explained his distrust of the secretive nature of the Sith. Sensing Kadir's hatred of the Sith, Trachta soon recruited Kadir to his conspiracy to eliminate both Emperor Palpatine and Darth Vader. General Skosef introduced Kadir during the meeting of the conspirators, but the Near-Human assassin Gauer, one of Trachta's associates, accused Skosef of exposing the conspiracy to an outsider. However, Trachta silenced Gauer, explaining that Kadir was the newest member in the conspiracy."}, {"tag": "p", "text": "For over a decade, Trachta had secretly masterminded a sophisticated plot to destroy the Sith and seize control of the Empire. The plan involved cloned stormtroopers that were \"programmed\" and trained loyal, not to the Emperor, but to Trachta and his affiliates. However, the rivalry between Trachta and his fellow Grand Moff Bartam, one of the key members in the conspiracy, compromised the stability of the plot. Kadir was personally requested by Trachta to observe the corpulent Grand Moff's loyalty to the conspirators. Both Trachta and Bartam were determined to assassinate each other, and Kadir remained on the background during the discord between the scheming Grand Moffs. As a result, Trachta was assassinated by Gauer, while Skosef executed Bartam, only to be killed by a stormtrooper guard. Without Trachta and Bartam, as well as Skosef, the only living members of the conspiracy were Kadir, Gauer, and Second Officer Dezsetes aboard the Imperial-class Star Destroyer Mathayus. Kadir became the leader of the remaining conspirators, determined to accomplish the final stage of the plot by eliminating the Emperor and taking control of the Imperial state."}, {"tag": "p", "text": "Kadir and Gauer, supported by Trachta's clone stormtroopers, marched to the Imperial Palace. Inside the building, two officers blocked the corridor, as the stormtroopers were not allowed enter the Emperor's throne room, but both of them were killed by a clone stormtrooper and Gauer. Kadir and the stormtroopers stepped in the Emperor's throne room, preparing to kill Palpatine. However, the assassins were ambushed by the Royal Guardsmen, slaughtering numerous stormtroopers. Meanwhile, Gauer abandoned his ally and fled from the Palace. The remaining stormtroopers were wiped out by the Emperor's powerful Force lightning. However, Kadir was knocked out by one of the Royal Guards earlier during the assassination attempt, which saved him from being electrocuted by the lightning bolts. When Kadir regained his consciousness, the stormtroopers were dead and the Moff took his last chance to take out the Emperor. Desperate, he hoped to kill Palpatine with a blaster pistol, but the blaster bolt harmlessly missed the Sith Master. The Emperor hurled Kadir across the room with Force lightning while praising him for exterminating the enemies of the Empire."}, {"tag": "p", "text": "Palpatine was going to kill the treacherous Moff, but Kadir tried to save his life by convincing him that the conspirators had eliminated Vader. He offered himself as Palpatine's Sith apprentice, but the Emperor declined the offer, knowing that Kadir lacked Force-sensitivity. The Emperor activated a holocam on the throne, showing Vader confronting Dezsetes and the clone stormtroopers aboard the Mathayus. Kadir witnessed as Vader killed the stormtroopers and interrogated Dezsetes, who confessed that Trachta was the mastermind behind the conspiracy. Dezsetes was then killed by Vader, and in the Emperor's throne room Palpatine swiftly electrocuted the unlucky Moff with a deadly torrent of Force lightning. The deaths of Kadir and Dezsetes ended the anti-Sith conspiracy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kadir is sometimes assumed to be Moff of Imperial sector, including the planet Coruscant and a number of other star systems. In fact, there is no evidence that he is anything more than the head of Coruscant Security Force, which would, by implication, be constituted as a sector in its own right, just as Imperial Sector is part of Imperial Center Oversector."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}