{"url": "Kadrian_Sey", "categories": ["Category:Legends articles", "Category:Dark Acolytes", "Category:Fallen Jedi", "Category:Females", "Category:Post-Ruusan Jedi Knights", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Kadrian Sey"}, {"tag": "p", "text": "Kadrian Sey was a female Zabrak Jedi Knight who recently served the Jedi Order before she fell to the dark side and joined the Confederacy of Independent Systems, becoming one of Count Dooku's Dark Acolytes during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Discovered to be Force-sensitive at an early age, Kadrian Sey was trained in the Coruscant Jedi Temple's academy to become strong in the Force. Constructing a lightsaber for herself and adopting the traditional facial tattoos of her species, Sey was selected by a Jedi Master for further training. After completing her apprenticeship as a Padawan, Sey was elevated to the rank of Jedi Knight and assigned long-term missions in the Outer Rim Territories by the Jedi High Council. As a result, she was abroad during much of the Separatist Crisis which engulfed the Republic in the years leading up to the first battle of Geonosis and the beginning of the Clone Wars."}, {"tag": "p", "text": "When the High Council recalled all Jedi and ordered them to take up military positions in the Grand Army of the Republic, Sey defied their summons, never returning to Coruscant. Abandoning her Jedi heritage, the Sith Lord Darth Tyranus corrupted Sey to the dark side and invited her to join him as a Dark Acolyte. Part of Tyranus' personal guard, Sey crafted for herself a red-bladed lightsaber, which she wielded well beside fellow acolyte Tol Skorr."}, {"tag": "p", "text": "Tyranus, under his alter ego Count Dooku, leader of the Confederacy, led Sey, Skorr, Quinlan Vos, and Sora Bulq on a diplomatic mission to liberate Tibrin. Marching into the royal palace, the group confronted the planetary ruler, Suribran Tu, who quickly offered to betray the Republic and join Dooku's cause. The elderly Sith Lord asked his compatriots what their course of action should be: Sey arguing in favor of accepting the offer, reasoning that it would provide for continuity of government and allow for a smoother transition to the Confederacy. Fellow acolyte Vos immediately countered by stating that since Tu was a hated butcher, leaving him in power would only convince people that the Confederacy was no better than the Republic. Dooku opted for Vos' argument and beheaded Tu without further discussion."}, {"tag": "p", "text": "Sey also accompanied Dooku to Kiffu, where the Count was meeting with Sheyf Tinté Vos, along with Tol Skorr and Quinlan Vos. When the negotiations turned sour, Dooku ordered the acolytes present to assassinate the Sheyf and kill her guard. At this moment, Vos revealed his identity as a Republic agent, engaging Sey with his lightsaber and bisecting her at the waist in order to protect the legitimate leader of the world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}