{"url": "Kahiyuk/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Cities on Kashyyyk"], "nodes": [{"tag": "h1", "text": "Kahiyuk"}, {"tag": "p", "text": "Kahiyuk was a city in the Wawaatt Archipelago on the planet Kashyyyk. In the final year of the Clone Wars, the Wookiee Tarkov and his son, Jaccoba, were hunting near Kahiyuk when they inadvertently came across a Separatist invasion army hidden in the forest. Retreating to Kahiyuk, the pair notified the nearby cities of Warralokk, Grunnrurr, and Rowrakruk of the Separatist presence. However, this did not prevent Kahiyuk from falling to the Separatist invaders."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kahiyuk was a city and township located in the Wawaatt Archipelago on the Mid Rim planet Kashyyyk, the homeworld of the Wookiee species. A large forest was located near Kahiyuk, as were the cities of Warralokk, Grunnrurr, and Rowrakruk."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 19 BBY, the last year of the Clone Wars between the Republic and Separatists, the Wookiee father-and-son pair Tarkov and Jaccoba were hunting in the forest near Kahiyuk. During their hunt, the Wookiees accidentally stumbled across a Separatist invasion force hiding within the forest. The pair immediately rushed to Kahiyuk—the closest city to their position—to warn the residents of the advancing Separatist army. The warning was soon spread to Warralokk, Grunnrurr, and Rowrakruk, but this did not stop the Separatists from conquering Kahiyuk and a number of other Wookiee cities before the natives could muster a defense. The fall of these outposts caused the Wookiees to raise an army and notify the Republic of the Separatist presence on Kashyyyk in an attempt to beat back the invaders."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kahiyuk was first briefly mentioned in Tarkov's Databank entry on StarWars.com and was later mentioned in Tarkov's and Jaccoba's entries in The Complete Star Wars Encyclopedia, released in 2008."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}