{"url": "Kaink", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Ewoks", "Category:Females", "Category:Religious workers"], "nodes": [{"tag": "h1", "text": "Kaink"}, {"tag": "p", "text": "Kaink was the Ewok priestess. She served as the guardian of the Soul Trees, and the village legend-keeper. She lived several miles away from the village where the Warrick family lived, leading a life of solitude and oneness with nature. Kaink carried a magical staff with a crystal on top. Kaink used her staff to emit a beam of mystical force when necessary, or at other times, to hypnotize animals. She accompanied the Ewok warriors on their mission to save Mace and Cindel Towani's parents. As village legend keeper, Kaink was deferred to by the formal title \"Mistress Kaink.\" She was one of the few Ewoks who still remembered the heroism of the Ewok hero Erpham Warrick and the instrumental role of his great Ewok battle wagon. She told the legend to his grandson, Wicket Wystri Warrick, who later rebuilt the famous machine."}, {"tag": "p", "text": "It's unknown whether Kaink assisted Wicket and the other Ewoks in helping the Rebellion to defeat the Galactic Empire in the Battle of Endor."}, {"tag": "p", "text": "Shortly after the Battle of Endor in 4 ABY, the Star Tours travel agency began offering tours of the forest moon. Kaink boarded a StarSpeeder 3000 at one point and was featured in a safety video."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kaink was played by Margarita Fernández in Caravan of Courage."}, {"tag": "p", "text": "Kaink was featured in the \"safety video\" and boarding party in Disney's \"Star Tours\" ride. The Ewok costume used was missing her signature leather dress, but it was later revealed to be Kaink. An action figure of Kaink, minus her dress and staff, was released in the Star Tours \"Boarding Party\" set of figures. It was a Disney Parks exclusive. Two Disney exclusive pins have also been released featuring Kaink."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}