{"url": "Kairos%27s_homeworld", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Planet stubs", "Category:Galactic Empire planets", "Category:Jungle planets", "Category:Unidentified planets"], "nodes": [{"tag": "h1", "text": "Kairos's homeworld"}, {"tag": "p", "text": "A jungle planet situated far from the Core Worlds was the homeworld of a species that saw anything not of their world as being unpure. In order to prevent contamination, the native population would cover themselves in wrapped garments and masks. During the Imperial Era, the Galactic Empire established a presence on the world, constructing an outpost and stationing a satellite system in its orbit. As an emissary between their world and the outside, Kairos—though not known by that name at the time—went to the outpost intending to mediate, but was instead captured and imprisoned in an Imperial holding facility. Kairos eventually managed to escape the prison, but did not return to her homeworld, as her people would no longer view her as being pure."}, {"tag": "p", "text": "In the time after the Imperial defeat at the Battle of Endor, the outpost on the planet was abandoned. Around a year after the battle, Kairos, at that point a New Republic pilot of Alphabet Squadron, crashed her U-wing on her homeworld alongside her comrade Chass na Chadic and Yrica Quell, their prisoner and former squadron leader, having managed to navigate to the world after their starship's navicomputer ceased to function. While there, the three briefly resided in the abandoned outpost, recovering equipment to repair the U-wing. Believing the Empire had returned, Kairos's people slowly converged on the outpost, intending to drive them out. Kairos, Chadic, and Quell departed the outpost and destroyed the structure before returning to the U-wing, repairing the vessel and escaping the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}