{"url": "Kaiya_Adrimetrum", "categories": ["Category:Legends articles", "Category:FarStar crewmembers and personnel", "Category:Females", "Category:Humans", "Category:Katarn Commandos personnel", "Category:New Republic Defense Fleet officers", "Category:Resistance fighters"], "nodes": [{"tag": "h1", "text": "Kaiya Adrimetrum"}, {"tag": "p", "text": "Kaiya Adrimetrum was a female Human resistance fighter, a Rebel unit commander who became a member of Page's Commandos and commanded the New Republic CR90 corvette FarStar."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life and resistance fighter"}, {"tag": "p", "text": "Adrimetrum was born on Siluria III, and was married with at least two daughters. They lived in a mansion home on the edge of Koved City, called Dovecote. When an Imperial occupation force invaded her homeworld, her husband was killed by Imperial troops. Organizing her friends and family in a resistance cell, she led an attack on the mansion of Imperial Governor Quannith. The attack was successful, and Rebel Alliance operative Corwin Shelvay convinced Adrimetrum to leave Siluria III and take the war to the Empire to safeguard her friends and family."}, {"tag": "h3", "text": "Rebel Alliance / New Republic service"}, {"tag": "p", "text": "Adrimetrum completed the basic eight week officer training course, and became a Rebel unit commander. She served in several units and befriended the Wookiee Lofryyhn. Sometime during the early years of the New Republic, Adrimetrum's actions earned her a posting to Page's Commandos under Lieutenant Judder Page. Prior to the liberation of Kal'Shebbol, she learned that her friend, Lofryyhn, had been sold to Moff Kentor Sarne as a slave, and volunteered to be part of the advance commando force. She fought in the subsequent Battle of Kal'Shebbol, and led the team that freed prisoners from Sarne's detention cells. Following the battle, Lieutenant Page assigned her to the FarStar mission as first officer under Captain Keleman Ciro."}, {"tag": "h3", "text": "Commanding the FarStar"}, {"tag": "p", "text": "Adrimetrum's time as first officer was short. During the Battle of Kolatill, Captain Ciro was captured by Imperial forces from the Kathol Protector. She took command of the FarStar, and commanded the ship during the hunt for Moff Sarne."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Temperament"}, {"tag": "p", "text": "Extremely serious, Adrimetrum never told a joke and never got them, either. She instilled a fierce loyalty in the troops that served under her, and was very aware of her responsibilities as a unit commander. Outwardly, Adrimetrum presented a calm facade, but inside she was deeply troubled by carrying the burden of responsibility for the lives under her command. She felt normal and average, but realized that the personnel under her command could never see that side of her. Despite this, she formed strong bonds with commandos in her unit. While teamwork and efficiency were improved, it also made each death harder for Adrimetrum to bear."}, {"tag": "h3", "text": "Appearance"}, {"tag": "p", "text": "Adrimetrum was of a slim, athletic build. She had jet-black hair, brown eyes and aristocratic features. She usually dressed simply and practically."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "An alternate spelling of her name is used in Star Wars: Rebellion: Kaiya Andrimetrum."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}