{"url": "Kaja_Or%27Zee", "categories": ["Category:Legends articles", "Category:Bureaucrats of the Galactic Empire", "Category:Clerical workers and assistants", "Category:Females", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Kaja Or'Zee"}, {"tag": "p", "text": "Kaja Or'Zee was the Chamberlain for Emperor Palpatine, who saw to it that all of Palpatine's needs were met, in the Emperor's Retreat on the planet Naboo during the Galactic Civil War. She became disheartened by reports that the Rebel Alliance had destroyed Alderaan and so felt that the New Order would restore peace in the galaxy."}, {"tag": "p", "text": "She once tasked an Imperial spacer with escorting the Moff, Governor Grayeg Wintozzen to meet with other officials in the Emperor's Retreat, informing them that no harm was to come to him. Soon after this, she received information from the Imperial Sector police that an individual had been hired to assassinate Moff Wintozzen. She then paid the same individual to track down the person who paid for the contract and retrieve evidence, authorizing them to use force if necessary. The spacer was forced to kill the Rebel sympathizer and, upon returning to Kaja, she informed them that it was a shame that the Rebel wouldn't reason with them, though it was probably for the best that the most \"evil\" Rebels be taken care of accordingly."}, {"tag": "p", "text": "It was some time after this that she was once again contacted by the Sector police, this time being informed that they had found the assassin but were not equipped to deal with someone of his calibre; Kaja once again called on the help of the spacer, informing the Sector police that she had sent a specialist to assist them with the capture. It was not to be, however, as the assassin did not give himself up, instead the spacer was forced to kill him and once again return to Kaja, who had expected this to be the case but was sure that the Inquisitors would be upset to hear that he had not come peacefully anyway."}, {"tag": "p", "text": "Thanks to all of these efforts, the Empire managed to track down where the death threats to the Moff had been coming from, tracking them down to a group of Rebel terrorists. Once again calling on the spacer for help, she informed them where they could find a droid programmer, along with their Rebel cohorts, instructing them simply to kill the individual. Though the droid programmer had managed to infect most of the Moff's personal droids, it was discovered that one of them had in fact managed to escape the tampering although it had been badly damaged. As a final mission for the spacer, she asked him to retrieve the droid as it may hold information which could be used by the Empire."}, {"tag": "p", "text": "After returning the RA-7 servant droid, Kaja informed the spacer that she would write them a note of recommendation and advised that they talk to Loam Redge, an Inquisitor who had heard of their great work."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kaja Or'Zee appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online-role playing game developed by Sony and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}