{"url": "Kal_Braggan", "categories": ["Category:Legends articles", "Category:Corellian Security Force officers", "Category:Criminals", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kal Braggan"}, {"tag": "p", "text": "Kal Braggan was a male member of CorSec, later turned criminal, who lived on Corellia during the Galactic Civil War"}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kal Braggan was CorSec officer several years before the Battle of Yavin. At some point, he was framed by his fellow officer, Wilfred Quelsh, of taking money from smugglers in return for looking the other way as they brought illegal goods to Corellia. As a result, Quelsh received the Corellian Medal of Honor and Braggan was convicted, discharged and sent to prison for a number of years. When Braggan came out of prison, he formed the criminal organization, Braggan's Fist."}, {"tag": "p", "text": "Circa 1 ABY, Kal Braggan had gathered evidence of his innocence and confronted Lieutenant Colonel Wilfred Quelsh. However, Quelsh panicked killed Braggan and lost his Corellian Medal of Honor near the body. CorSec Major Walden later tasked a spacer to recover the missing medal. The spacer discovered the location of the Braggan's Fist Camp and he found the medal next to Braggan's body. He also found Braggan's datapad, which had on it proof that Braggan had been framed. Major Walden eventually arrested Wilfred Quelsh for his crimes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kal Braggan appeared as a corpse in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Kal Braggan was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}