{"url": "Kalai", "categories": ["Category:Legends articles", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Kalai"}, {"tag": "p", "text": "The Kalai were a species who, during the Galactic Civil War, suddenly appeared at Zirtran's Anchor aboard the starship Destiny."}, {"tag": "p", "text": "Among the galaxy's most mysterious inhabitants, little was known of them outside of speculation, rumors, fear and very few facts."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Kalai's biology and appearance was a mystery to many if not all residents and visitors to the space station, for they rarely, if ever, left the Destiny."}, {"tag": "p", "text": "Though the process was largely a mystery, Kalai were capable of breeding with Humans, even if the latter parent was unaware of their progeny. A hybrid of the two species was known as Lethagoe. The half-breeds' appearance led some to speculate that the Kalai themselves were avian-like in physical makeup."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "To many outsiders, the Kalai appeared as shy, almost unintelligible beings who were reluctant to stray into the general population at the Hub or other open sections of Zirtran's Anchor. This was reinforced by the fact that it was the Lethagoe who interacted in behalf of their mysterious parents and, even then, their hybrid offspring did not normally discuss their life aboard the Destiny, the Kalai and their system of origin, or even their parents."}, {"tag": "p", "text": "However, when asked about the Kalai's intentions, a Lethagoe would only reply that the Kalai were observers, content to watch the ever-continuing struggle between Humans and aliens, Empire and Rebellion."}, {"tag": "p", "text": "They were also known for avoiding dealing with the cunning Geelan unless they had no other choice, and for the disregard they held towards the actions of the Imperial commanders and other Anchor residents. Many agreed that, despite their secretiveness, the Kalai were reasonably harmless."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Kalai's introduction to the known galaxy occurred during the Imperial Period, when they attached the vessel Destiny and became a part of the population at Zirtran's Anchor. There were no records of Kalai who had established contact with the wider galaxy prior to this event, and their history and origins were unknown to everyone but them."}, {"tag": "p", "text": "Since then, the Kalai's interactions on board the Anchor consisted of business transactions with traders and freighter pilots for the procurement and delivery of goods, and the employment of several independent mercenaries and scouts for missions beyond Imperial Space. Several times, Imperial Customs inspectors who seized and searched the vessels of free-traders and others hired by the Kalai found nothing incriminating."}, {"tag": "p", "text": "During the Galactic Civil War, they refused to join sides, preferring to merely act as \"observers\" of the ongoing struggle between the factions, having openly interfered in the as-of-then war in very rare occasions, despite their possession of small ships with agility greater to that of Imperial and Rebel starfighters."}, {"tag": "h2", "text": "Sources"}]}