{"url": "Kalandis_IV", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Pallis sector planets", "Category:Terrestrial planets", "Category:Trailing Sectors planets"], "nodes": [{"tag": "h1", "text": "Kalandis IV"}, {"tag": "p", "text": "Kalandis IV was an Inner Rim planet located in the Pallis sector. Once situated on the Itani Run hyperlane, during the Galactic Civil War the planet was the base of operations for Prefect Ursellis of the Galactic Empire. She cooperated with the bounty hunter Tyionsis Cex, who would receive Imperial Legal Authorization for Advanced Confinement Documents from Sub-Prefect Matagorn and deliver individuals captured on the basis of those documents back to Kalandis IV. When Matagorn once made a joke at Cex's expense during one such encounter, the bounty hunter was offended, and several days later, the sub-prefect disappeared and his body parts began surfacing across Kalandis IV."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kalandis IV was a terrestrial planet located in the Kalandis system, a part of the Pallis sector in the Trailing Sectors portion of the Inner Rim. The planet occupied the fourth orbital position in its system."}, {"tag": "p", "text": "Kalandis IV was once situated on the Itani Run, a hyperlane charted by the explorer Freia Kallea between 3703 BBY and 3702 BBY. The hyperspace route connected the Kalandis system to the Chardaan and Itani systems. Eventually, the set of hyperlanes scouted by Kallea were integrated into the super-hyperroute known as the Hydian Way, which did not pass through the Kalandis system, and the Itani Run became obsolete."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Cooperation on Kalandis IV"}, {"tag": "p", "text": "During the Galactic Civil War, Prefect Ursellis of the Galactic Empire, along with her subordinates, Sub-Prefects Matagorn and Helkson Vall, were based on Kalandis IV. At some point, Ursellis became one among Imperial officials who began issuing Legal Authorization for Advanced Confinement Documents—or LAACDocs for short—which were documents allowing the Empire to apprehend, detain, and confine individuals wanted for questioning."}, {"tag": "p", "text": "Subsequently, the Srrors'tok bounty hunter Tyionsis Cex was regularly employed by Ursellis for the capture of the individuals for whom the LAACDocs were issued. Cex would arrive on Kalandis IV with the captured individuals, deliver them to the Imperial authorities, and then receive a new batch of LAACDocs from Sub-Prefect Matagorn in person."}, {"tag": "h3", "text": "Disappearance of Sub-Prefect Matagorn"}, {"tag": "p", "text": "The adoption of the LAACDoc system led Matagorn to complain about the amount of work involved and to repeatedly request a vacation. One day, months after the introduction of the new system, the sub-prefect encountered Cex, who had come for the latest set of LAACDocs. Matagorn, exhausted from compiling the documents, handed the bounty hunter the list and then made a joke by referring to Cex as the \"personal LAACkey\" of High Inquisitor Antinnis Tremayne, who had initiated the LAACDoc system. In response, Cex, who was insulted by the joke's implication that he was someone's lackey, warned Matagorn that he had made a grave mistake and then left."}, {"tag": "p", "text": "On the following day, Matagorn received notice about his vacation request finally being granted. Two days later, however, the sub-prefect disappeared, and his body parts began surfacing across Kalandis IV, including in Gevis City and Verdson, over the subsequent days. In the following month, at some point between 0 ABY and 4 ABY, Sub-Prefect Vall, who had witnessed Matagorn's last interaction with Cex, narrated the encounter during a confidential meeting with Intel Agent 438432."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kalandis IV was introduced in \"What's In A Name,\" a short companion narrative included in the 1994 sourcebook Galaxy Guide 10: Bounty Hunters. The book was authored by Rick D. Stuart and published by West End Games for use with Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas placed the Kalandis system, and therefore Kalandis IV, in grid square N-14."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}