{"url": "Kalandis_Seven", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Kalandis Seven locations", "Category:Pallis sector planets", "Category:Sith Empire planets"], "nodes": [{"tag": "h1", "text": "Kalandis Seven"}, {"tag": "p", "text": "Kalandis Seven was a desolate planet in the Kalandis system, located in the Pallis sector within the Inner Rim. In 3640 BBY, Kalandis Seven was invaded and occupied by the reconstituted Sith Empire sometime after the Battle of Corellia. The Galactic Republic's military forces on the surface struggled to keep a foothold while the Republic and Imperial Navies fought above the planet. During the battle, a Republic squad on the planet's surface, including Sergeant Shanra Immel and Colonel Jace Malcom, was chosen to destroy the local spaceport. The squad's mission was ultimately successful."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Kalandis Seven was an alien world located in the Kalandis system, within the Pallis sector of the Inner Rim. Kalandis Seven was a harsh world that did not have any surface water of its own. Its terrain was made up of canyons, cliffs, and cracked plains. The planet featured an atmosphere that was breathable by Humans, waterless fog, and low gravity."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 3640 BBY, during the Galactic War, the renewed conflict between the Galactic Republic and the reconstituted Sith Empire, Kalandis Seven was invaded and occupied by the Sith Empire. Sometime after the Imperials withdrew from Corellia, the Republic's military forces on the planet's surface struggled to keep a foothold as the Republic Navy engaged the Imperial armada for control of the planet. Republic Sergeant Shanra Immel's squad was given a mission to destroy the local spaceport, with Republic Special Forces Division Colonel Jace Malcom assigned as an advisor to her squad. During the mission, a Sith planetary command ship landed, and Malcom amended the mission to include the ship's capture. He alone went to capture the command ship, while Immel's squad went to destroy the spaceport. In the end, the command ship self-destructed, and the mission to destroy the spaceport was successful."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Kalandis Seven was host to a few Republic and Imperial military bases and housed its own local spaceport."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Kalandis Seven was first mentioned as a desolate alien world within The Essential Reader's Companion, a reference book released on October 2, 2012. Kalandis Seven first appeared and was first identified by name within the pages of Alexander Freed's short story, The Last Battle of Colonel Jace Malcom, which was released on October 23, 2012 as part of Star Wars Insider 137."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}