{"url": "Kalani/Legends", "categories": ["Category:Legends articles", "Category:Masculine programming", "Category:Separatist admirals and generals", "Category:Separatist droid officers", "Category:Super tactical droids"], "nodes": [{"tag": "h1", "text": "Kalani"}, {"tag": "p", "text": "Kalani was a super tactical droid general in operation during the Clone Wars. Around 20 BBY, he was sent by Count Dooku to aid King Sanjay Rash of the planet Onderon in order to crush those who resisted the CIS occupation. However, after continued resistance, Kalani and Dooku came to the conclusion that the fighting on Onderon was getting nowhere, and as such Dooku ordered the Confederacy to abandon the planet. With the retreat in motion, Kalani turned on and executed Rash."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kalani was a super tactical droid with the rank of general during the Clone Wars. A droid member of the Confederacy of Independent Systems, Kalani was eventually sent to the planet Onderon to take over the Confederate military operations there that were constantly under threat of local resistance. The Confederate leader Count Dooku sent Kalani to the planet while under the impression that the world's king, Sanjay Rash, needed a stronger tactician to deal with the planet's rebel forces."}, {"tag": "p", "text": "Kalani demanded that he be informed of all available facts. When Tandin, Rash's native general, failed to show evidence of the Onderon rebel leaders, Steela and Saw Gerrera, Kalani argued that he was being provided with insufficient information. Though Tandin pleaded with Rash to allow the military to handle the rebels, Kalani refused, stating that they may have sympathizers among the military ranks."}, {"tag": "p", "text": "After Saw Gerrera was captured while trying to rescue the former king, Ramsis Dendup, Kalani and Tandin oversaw his torture and interrogation. When Tandin showed compassion for Gerrera's pain, Kalani was intrigued but unimpressed."}, {"tag": "p", "text": "Kalani was later present when Rash attempted to have Dendup publicly executed. The super tactical droid correctly calculated that the rebels would attack and was able to capture them using an ambush by B2 super battle droids. Tandin, however, turned against Rash, and with the help of Jedi Padawan Ahsoka Tano was able to escape Kalani's ambush."}, {"tag": "p", "text": "The resistance soon began to step up their efforts. Dendup announced to all of Iziz via holograms of Rash's tyrannical rule and urged that they support the rebels. The common Onderonian people then initiated riots across the city. Rash then began to worry that the droid army will be spread too thin to combat both the rebels and the riots. Kalani initiated his solution and orchestrated an attack on the rebel hideout with newly designed droid gunships. After the attack failed due to the interference of the Jedi and the pirate Hondo Ohnaka, Kalani was present when King Rash once again appealed to Dooku for more assistance. Dooku listened to Kalani's report on the situation before agreeing that Onderon was a lost cause and ordering a withdrawal of the Separatist forces there to Agamar. Kalani unceremoniously raised a blaster and executed the king as he sat on his throne."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kalani was created for the Star Wars: The Clone Wars television series, and made his series debut in the episode Front Runners, which focused on the battle of Onderon. Kalani appeared in two more episodes dealing with the story arc, The Soft War and Tipping Points. Kalani later appeared in the mobile video game Star Wars: Force Collection, as a rare five-star rated card."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}