{"url": "Kale_Longo", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kale Longo"}, {"tag": "p", "text": "Kale Longo, known in the Imperial criminal system as Inmate ICN 544450, was a prisoner onboard the Imperial prison barge Purge alongside his brother, Trig Longo. The barge broke down during its mission to transport a shipment of prisoners to a detention moon. Kale and his brother were two of six survivors on the Purge after a recon team contracted and spread a deadly disease from a nearby derelict Star Destroyer."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Purge"}, {"tag": "p", "text": "Kale was captured along with his brother, Trig, and father, Von, during a routine sweep made by an Imperial patrol. Accused of smuggling, the three were placed aboard the Purge, which would transport them and 500 other inmates to an outlying penal moon. During the voyage, Von managed to establish an uneasy relationship with the leader of the Delphanian Face Gang, Sixtus Cleft. The gang agreed to leave Von and his family alone, provided Von would be able to supply the group with stolen weapons and equipment. After Von's death, Kale attempted to continue dealings. Upon meeting with the gang, Kale learned that Sixtus had been killed, with his right-hand man, Aur Myss, taking his place. The Delphanian betrayed them and ordered his men to kill the brothers. Kale grabbed and forcibly removed several piercings in Myss' face, wounding him and supplying them with enough time to escape to the upper levels of the Purge. In retaliation, Myss placed a ten thousand credit bounty for the death of Trig and Kale. Myss also bribed a guard and was transferred to a cell adjacent to Kale and Trig's."}, {"tag": "p", "text": "When the plague eventually reached the Purge, the brothers were unaffected. Hearing screams and smelling the dead bodies in the cells around them as other inmates and the barge's guards fell victim to the virus. During this time, Kale wrote an unfinished and unsigned letter to his father and hid it under his mattress, though Trig found the letter and added content to it without his brother's knowledge."}, {"tag": "p", "text": "Upon being released by Wembly, a guard familiar with the Longo brothers, Kale and Trig were almost immediately attacked by Aur Myss. Kale thrust a knife through Myss's skull, killing him instantly. The two brothers made their way to an escape pod, but encountered Jareth Sartoris. The prison guard left in the pod, leaving Kale and Trig behind. They made their way to the escape pod on the other side of the Purge, but were unable to expedite its use without the relevant launch codes. The brothers journeyed to the barge's command center, fleeing the dead who had arisen due to the plague. While attempting to escape the barge, Kale was injured by the reanimated body of his father. He escaped and they boarded the Vector, along with Zahara Cody, Han Solo, and Chewbacca."}, {"tag": "h3", "text": "Vector"}, {"tag": "p", "text": "Kale was unable to walk due to the bite and so stayed behind with Cody while Han, Chewbacca, and Trig went to the command center to disable the tractor beam to effect an escape. The bite from his dead father was affecting Kale, and soon a large chunk of flesh was gone from his leg. It began spreading up his body, but Cody cut into his abdomen and removed the fluid that was killing him. However, the zombies, now carrying blasters, made their way to Cody and Kale and began firing at them. Kale told her to leave him, but she refused. Kale was killed by a bolt that struck him in the head, Zahara realized that he took the bolt because it was going to hit her. The entire right side of his face was gone forcing Cody to leave him."}, {"tag": "h3", "text": "Death and zombies"}, {"tag": "p", "text": "Kale's body was re-infected with the plague, and it arose from the dead. Trig came across Kale, and only seeing half his face, did not yet realize his older brother was dead. Trig followed Kale into a room full of dead bodies piled on top of one another nearly to the ceiling, but couldn't find Kale anywhere. Horrified at the sight, Trig was unable to make a sound until finally letting out a combination of \"help\" and \"Kale.\" As if on cue, Kale burrowed out of the pile and started towards Trig; however, due to the fact that he was wearing a stormtrooper helmet, Trig only saw him as another of the infected. Trig climbed up the pile of bodies and escaped through a ventilation shaft, but was followed. Eventually, the creature caught up to Trig, and the helmet fell off, revealing to a shocked Trig that the thing following him was his brother. Kale dropped on top of Trig and tried to bite him. Realizing his brother was dead and there was nothing to change the fact, Trig pushed Kale out of the vent, his body plunging hundreds of meters down into the abyss surrounding the engine turbine."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}