{"url": "Kalee/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Jungle planets", "Category:Kalee locations", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Kalee"}, {"tag": "p", "text": "Kalee was the home planet of the Kaleesh, including General Grievous. It was located on the border of the Kadok Regions."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kalee was covered in tropical-looking foliage and beaches. Moss-covered canyons and cliffs filled the landscapes. It was apparently a harsh world, and wanting for resources. The Kaleesh housing and buildings were very temple-like. The Kaleesh were highly intelligent bipedal hunter-warriors, hunting predators such as mumuu and karabbacs to make ceremonial cloaks and war masks."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Kalee was discovered during the Old Republic era. By the time of the Galactic War, Kaleesh recently arrived to the civilized galaxy. They were quickly recognized as proud, honorable and deadly warriors by both the Galactic Republic and the Sith Empire. Most Kaleesh were opposed to the xenophobic Sith Empire, but the species fought on both sides during the conflict, as well as for Darth Malgus' New Empire, or served as bodyguards for the Hutt Cartel. In the year 3664 BBY, Xivhkalrainik was born on Kalee."}, {"tag": "p", "text": "The Kaleesh had had a long history of warfare, which led to their poverty. Circa 100 BBY, the Republic persuaded them that the neighboring Bitthævrians were threatening their border so that they could unseat a regime considered unfriendly to Coruscant. The Kaleesh fought alongside the Jedi against the Bitthævrians in the ensuing Kaleesh–Bitthævrian War."}, {"tag": "p", "text": "The Republic later sided with the Huks against the Kaleesh in the Huk War, defeating the Kaleesh. During the wars, the Kaleesh, led by General Grievous, nearly defeated their enemy until he was incapacitated in a shuttle crash arranged by the InterGalactic Banking Clan. San Hill paid for a cybernetic suit to be built by the Geonosians for Grievous, who became leader of the Separatist military forces. In return for Grievous's services, the InterGalactic Banking Clan financed the economic recovery of Kalee. After Grievous departed Kalee, his former warriors, now under the command of Bentilais san Sk'ar, slaughtered the Huk on the Kalee colony world of Oben. They then moved their people to this resource-rich world."}, {"tag": "p", "text": "Following the rise of the New Order, a conflict erupted between Kaleesh and Imperial forces. Bentilais san Sk'ar and his warriors resisted Imperial rule for over ten years. The conflict ended when Captain Thrawn bombarded the planet Oben. Sk'ar then left Kalee space to join the Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}