{"url": "Kaleesh%E2%80%93Bitth%C3%A6vrian_War", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Pages needing citation", "Category:Conflicts of Wild Space"], "nodes": [{"tag": "h1", "text": "Kaleesh–Bitthævrian War"}, {"tag": "p", "text": "Nearly a century before the Battle of Yavin, the Galactic Republic began to increase their activity in the Kadok Regions. In response, the Bitthævrians began a war of protest, enraged by what they saw as an intrusion into their territory. They had never been granted entry into the Republic, and so they believed the Republic had no right to be there. After a few years of failed negotiations, the Republic backed a Bitthævrian soldier in an attempted coup. The coup failed, however, and caused hostilities to increase."}, {"tag": "p", "text": "Immediately, the Republic played up the threat posed by the Bitthævrians, in order to gain allies. Kalee, being on the border of Bitthævrian space, was situated close to the conflict. Though the Kalee apparently had nothing to fear from the Bitthævrians, the Republic convinced them that they did. Being a warrior culture, the Kaleesh needed little convincing. The Republic wished the keep the conflict quiet, however, and sent no forces of their own to battle the Bitthævrian threat. Rather, a group of military instructors were sent to Kalee, along with equipment. Several Kaleesh tribes were trained and armed, leading to the introduction of such weapons as Czerka Outland rifle. Soon, the Kaleesh entered the war alongside a small group of Jedi Knights. Though the largest of the Bitthævrian armies, the m'Yalfor'ac Order, killed several of the Jedi, they were ultimately defeated and nearly wiped out."}, {"tag": "p", "text": "The grandmother of Qymaen jai Sheelal, who would later ferociously hunt Jedi, fought alongside them in this war."}, {"tag": "p", "text": "The war would lead the Bitthævrians to hate all Force users, especially the Jedi, and the Republic as well."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}