{"url": "Anselmi", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Anselmi", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Anselmi"}, {"tag": "p", "text": "The Anselmi were a species of blue-skinned humanoids. They were one of the two sentient species that called the ocean planet Glee Anselm their home. Long before the Clone Wars, the Anselmi were the dominant species on Glee Anselm. They had a vast empire above the ocean, and dams surrounding their land pushed back the ocean. However, their empire eventually fell, and the Anselmi populace became scarce. At some point afterward, the Anselmi lost their capability to breathe underwater. By the time of the Clone Wars, the Anselmi were primitive and resented their aquatic cousins, whom they referred to as \"gill heads.\" Given the scarcity of land on Glee Anselm, the Anselmi strove to survive."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Anselmi of Glee Anselm were a sentient species of humanoids with blue skin. They looked not unlike the Nautolans, who evolved on the same planet. There were, however, marked differences between the two species. The Anselmi were squatter than their cousins, had only four fingers per hand and three toes per foot, and lacked the Nautolans' head tentacles. Moreover, the Anselmi sported thin tails and two antenna-like growths jutting from the top of their skulls. Most importantly, the Anselmi could not breathe underwater, while the Nautolans were amphibious."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Anselmi were a greedy and manipulative culture. When their population was still substantial, the Anselmi strived to dominate both ocean and land from their Nautolan neighbors. They built a great empire on a large island outside of the ocean, and had dams surrounding the area."}, {"tag": "p", "text": "Since Glee Anselm was an oceanic planet without major landmasses, and by the time of the Clone Wars the Anselmi could only live above water, they were at a disadvantage compared to the Nautolans. Because of that, they resented their aquatic cousins, whom they referred to as \"gill heads,\" and sought to dominate them."}, {"tag": "p", "text": "The Anselmi were unsophisticated and superstitious. The Nautolan Jedi Master Kit Fisto described them as \"little more than savages.\" They hunted with primitive bows and arrows, as well as bladed polearms and blowpipes firing paralyzing thorns. They practiced ancestor worship, hoping the spirits of their forefathers would help them triumph over the \"gill heads\" in exchange for sacrifices."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Anselmi hailed from Glee Anselm, an oceanic world located in the Jalor system of the galaxy's Mid Rim region.\nAccording to legend, the planet used to have a vast continent bursting with life until it sank to the seabed thousands of years before the fall of the Galactic Republic. Both species on Glee Anselm lived in peace for thousands of years, until the Anselmi people became greedy, thinking of themselves with greater importance compared to the Nautolans. The Anselmi built a vast empire on a large island above the ocean, and had dams created to push back the ocean; creating more land on the ocean floor for the Anselmi to use. However, the ocean spirit of Glee Anselm grew angry at the imbalance of power, and tore down the Anselmi empire with tidal waves and storms. The Anselmi empire crumbled and the population of Anselmi became sparse. The Anselmi were still a numerical minority by the end of the Republic, and kept a bellicose attitude toward the Nautolans which had been put in place long ago."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Anselmi were reintroduced into Star Wars canon in Choose Your Destiny: An Obi-Wan & Anakin Adventure, a 2019 adventure book written by Cavan Scott and illustrated by Elsa Charretier. However, as they only appear in one of the book's optional paths, the full canonocity of their scenes is not known. Within the book, the Jedi Master Obi-Wan Kenobi and his Padawan Anakin Skywalker traveled to Glee Anselm in search for Grand Master Yoda, who had been kidnapped and taken there by mysterious battle droids. When the Jedi went to investigate an island covered in dense forest, they fell into a pit trap built by a band of Anselmi hunters. The natives expressed their intention to sacrifice the Jedi to please their ancestors, but Skywalker decided to use their superstition to his advantage. Using the Force, the Padawan rose from the pit to hover above the Anselmi, who dropped to their knees in terror. Although the natives did not immediately obey the Padawan when he ordered them to flee, they ended up scampering away after Skywalker caused a few nearby trees to shake."}, {"tag": "p", "text": "The Anselmi design is based on the original design for Darsana, an Anselmi senator who was cut from Star Wars: Episode II Attack of the Clones."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}