{"url": "Kalgrath", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Males", "Category:Massassi", "Category:Members of the Sith Brotherhood", "Category:Mutants", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Kalgrath"}, {"tag": "p", "text": "Kalgrath was a Massassi warrior put into hibernation within an isolation chamber beneath the Great Temple by the Dark Lord Exar Kun, to guard Yavin 4 against intruders prior to the Republic/Jedi assault on the moon."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kalgrath would remain in hibernation for millennia after all his people were exterminated. With his people eliminated, he would be transformed into a large, green, monster. Thus, he became the Night Beast. In 0 ABY, he was awakened from his millennia-long sleep by a crashed TIE/sa bomber during an Imperial raid. He then went to look for his people believing they were still alive."}, {"tag": "p", "text": "Instead, Kalgrath discovered the Rebel base in the ancient temple. Thinking they were his ancient enemies, he attacked them. However, he was stopped by Luke Skywalker and R2-D2."}, {"tag": "p", "text": "Skywalker managed to communicate with Kalgrath through the Force. Kalgrath was able to calm himself down, allowing his insanity to fade. Luke agreed to help him to find his people. Kalgrath was put aboard a GR-75 medium transport on auto-pilot to Ziost. The ancient warrior was upset upon his arrival, for he found only a frozen wasteland. It is possible now that he discovered that his people were already killed."}, {"tag": "p", "text": "After Luke founded his Jedi academy, Tionne did some research into Kalgrath's fate. She was informed by researchers on Ziost that they had seen a dark shadow creeping around their camp. Despite this, Kalgrath's fate is unknown."}, {"tag": "p", "text": "Later, on the planet Seidhkona, the Mind-witch S'ybll conjured up an illusion of Kalgrath from Luke Skywalker's memory. Skywalker fled from the illusion and into some ruins which collapsed on him, leaving him incapacitated."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "The Night Beast could shield himself with the Force by instinct, making him invulnerable to blaster fire of all types and even lightsaber attacks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}