{"url": "Kalifa", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Corellians", "Category:Females", "Category:Humans", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Kalifa"}, {"tag": "p", "text": "Kalifa was a female human Jedi youngling of the Jedi Order during the final years of the Galactic Republic."}, {"tag": "p", "text": "She was captured and taken to Garnac's hunting guild on the moon Wasskah. After being released on Island Four on Wasskah, she led a small team with two other youngling captives, O-Mer and Jinx, managing to survive by staying hidden and out of combat with the members of Garnac's hunting guild."}, {"tag": "p", "text": "After her capture by Lo-Taren and subsequent transfer to Island Four, Ahsoka Tano was determined to change the indifference Kalifa, O-Mer, and Jinx showed toward the other prisoners as they are hunted. After Ahsoka ambushed a lone Trandoshan, Kalifa levitated him with a Force choke and attempted to kill him, but was stopped by Ahsoka, convincing her not to kill the hunter out of hatred. The captive Trandoshan was then able to call for help and the Jedi were forced to retreat. After the successful ambush, Kalifa began to hope that Ahsoka, as a more advanced Force user, could help them escape."}, {"tag": "p", "text": "The next morning the hunting resumed, forcing the group to split up. Kalifa accompanied Ahsoka and was shot off a briar branch landing, winded and injured, on the ground, with Dar in hot pursuit. Before he could shoot her, Ahsoka ambushed Dar and engaged in hand-to-hand combat, which ended with him falling on a stalagmite, killing him. Enraged, Garnac, who was Dar's father, opened fire on the two young Jedi, fatally injuring Kalifa. In her final moments, she made Ahsoka promise to look after the others, dying as Ahsoka stayed by her side until the end."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}