{"url": "Kaliida_Shoals_Medical_Center", "categories": ["Category:Canon articles", "Category:Haven-class medical stations", "Category:Outer Rim Territories space stations", "Category:Ryndellia system"], "nodes": [{"tag": "h1", "text": "Kaliida Shoals Medical Center"}, {"tag": "p", "text": "Kaliida Shoals Medical Center was a secret Galactic Republic Haven-class medical station during the Clone Wars, located in the Outer Rim Territories. The station housed a large number of bacta tanks to heal wounded Republic soldiers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Although the medical station's location was originally a secret, the Sith Lord Darth Sidious—using his sources as the Supreme Chancellor of the Republic, Palpatine—gave the coordinates of the medical station to his Sith apprentice, Count Dooku, to use in favor of the Separatist Alliance."}, {"tag": "p", "text": "Dooku gave the details of the medical station to the cyborg Separatist General Grievous, and commanded that Grievous attack the medical station using their prized heavy cruiser Malevolence. Dooku hoped Grievous would destroy the station and the sixty-thousand recovering clone troopers aboard, severely wounding the Republic's medical effort during the war."}, {"tag": "p", "text": "After the Republic was notified of the Separatist's impending attack, Admiral Wullf Yularen warned the station's Kaminoan chief Nala Se to evacuate her passengers, meanwhile Jedi General Obi-Wan Kenobi contacted the nearby Naboo for help in the process. The Naboo, from the nearby Naboo star system, sent medical transports to aid in the evacuation."}, {"tag": "p", "text": "Grievous arrived soon after, having traveled from the nearby Ryndellia system, and proceeded with the attack on the medical station using Malevolence's ion cannon to disable the medical transports before opening fire on them. However, Jedi General Anakin Skywalker and his Shadow Squadron had taken a shortcut through the nearby Kaliida Nebula, intercepting Grievous before he could destroy the medical station. During the ensuing battle, Skywalker lost several of the BTL-B Y-wing starfighter/bombers under his command, but Shadow Squadron was still able to hit the Malevolence and damage its hyperdrive, forcing Grievous to flee and securing the safety of the medical station."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}