{"url": "Kalimahr", "categories": ["Category:Legends articles", "Category:Articles with an excess of redlinks", "Category:Articles to be expanded", "Category:Kalimahr locations", "Category:Tython system planets"], "nodes": [{"tag": "h1", "text": "Kalimahr"}, {"tag": "p", "text": "Kalimahr was a cosmopolitan planet with three moons that was located within the Tython system of the galaxy's Deep Core region. More than thirty-six thousand years before the Battle of Yavin, it was the first planet the non–Force-sensitive settlers of the planet Tython colonized. By 25,793 BBY, Kalimahr had become a business and religious center of the system, boasting a high-density, well-integrated population and cities built out of white metal, along with tall spires. Kalimahr was referred to as the \"jewel of the Tython system\" by that time."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kalimahr was a planet with three moons that was located within the Tython system of the galaxy's Deep Core region, at grid coordinates L-10. The planet occupied the sixth orbital position around its sun, Tythos. From space, Kalimahr appeared to be green in color. The planet featured an atmosphere with white-colored clouds, and it also had at least one mountainous region on its surface. Several cities that were considered to beautiful were built on Kalimahr out of white metal, with tall spires gracing the cities. At least four such spires stood on a green-colored foothill of the mountains of Kalimahr's surface."}, {"tag": "p", "text": "It contained at least one body of water, known as the Southern Ocean. The city of Rhol Yan and the Khar Peninsula lay on opposite sides of this body of water. It also contained the island of Hang Layden.\nThe Kalimahr Militia were responsible for keeping order. They were posted in Kalimahr Militia Posts commanded by Captains. A lower rank was Constable--Captain Lorus would remark that he had been a constable and \"still in training\" during an incident with Je'daii Ranger Vulk.\nRhol Yan was a city and a major tourist attraction built on an archipelago in the Southern Ocean. It was governed by a Council and policed by the Kalimahr Militia. It required all of its visitors from space to pass through Welcome Hall.\nWhile generally considered a very civilized planet, Rhol Yan contained The Pits--a brutal gladiatorial arena. The Council of Rhol Yan tolerated such establishments as they channeled aggression. However Tre Sana and Lanoree Brock would be disgusted by them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "More than a millennium after the year 36,453 BBY, when the non–Force-sensitive settlers of Tython— the fifth planet of the Tython system— traveled to Tython's neighboring worlds, Kalimahr was the first planet they colonized. By 25,793 BBY, it had become a cosmopolitan world, serving as the business and religious hub of the system. Kalimahr was one of the most densely populated of the colonized planets in the Tython system, and its population was very integrated. By that time, Kalimahr had come to be known as the \"jewel of the Tython system\" and the most diverse planet in that system, containing many different religions including the Dai Bendu and Cathar belief systems."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kalimahr was first pictured in the entry for Tython in The Holonet feature of the official website for Star Wars: The Old Republic—a 2011 massively multiplayer online roleplaying game developed by BioWare. The planet was depicted in a schematic of the Tython system. Since its establishment in 2008, The Old Republic's website has gone through a number of changes, resulting in the removal of some of the features and images that were originally located there, including the aforementioned schematic. Kalimahr's name and additional information on it were provided in Star Wars: Dawn of the Jedi 0, a preview issue of the Star Wars: Dawn of the Jedi series of comic books. The issue was published on February 1, 2012, and was written by John Ostrander and penciled by Jan Duursema. The world was also mentioned in the first issue of the series, which was published on February 15 of the same year. Kalimahr briefly appeared in Dawn of the Jedi: The Prisoner of Bogan 3 and more importantly in Dawn of the Jedi: Into the Void."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}