{"url": "Ansibella_Dellu", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Artists", "Category:Females", "Category:Individuals of unspecified species", "Category:Propagandists", "Category:Separatist senators"], "nodes": [{"tag": "h1", "text": "Ansibella Dellu"}, {"tag": "p", "text": "Ansibella Dellu was a female artist from Raxus Secundus. Dellu served as a student government official at Reena University, where she worked on a poster advertising a lecture series at the school by former Jedi Master Count Dooku, a harsh critic of the Galactic Republic. Dooku went on to form the Confederacy of Independent Systems and fought against the Republic in the Clone Wars, prompting Dellu to become a member of the Separatist Parliament and oversee Separatist shadowfeeds in Republic space. Dellu eventually surrendered to the Republic, which at war's end became the Galactic Empire, and she was considered an enemy of the state."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ansibella Dellu was a female artist from the world Raxus Secundus who was critical of the Core Worlds' politics. Between the years 42 BBY and 22 BBY, Dellu was a student government official at Reena University, where she worked on a poster titled Count Dooku: Words of Truth. It advertised a series of lectures at the university's Panos Lecture Hall by the leader of the Independent Movement for Self-Determination and former Jedi Master, Count Dooku. As stated on the poster, Dooku stood as a \"voice of reason\" amid the Galactic Republic's \"corruption and bureaucracy.\""}, {"tag": "p", "text": "As tensions heightened from the Separatist Crisis, during which Dooku encouraged thousands of star systems to secede from the Republic, the count and other like-minded individuals formed the Confederacy of Independent Systems and took up arms against the Republic, thus starting the Clone Wars in 22 BBY. Dellu became a member of the Separatist Parliament and was responsible for supervising the Separatist shadowfeeds in Republic space. These propaganda broadcasts relied upon the HoloNet to report on the Confederacy's victories in battle and alleged Republic war crimes."}, {"tag": "p", "text": "Before the Clone Wars came to an end, Dellu surrendered to the Republic, which transformed into the Galactic Empire in 19 BBY as the Separatists were defeated. Dellu was deemed an enemy of the state under the new galactic government, although a rare specimen of the former senator's work-in-progress poster, Count Dooku: Words of Truth, managed to survive the Imperial Security Bureau's loyalty purges. Circa 34 ABY, shortly after the Hosnian Cataclysm, that piece of Dellu's work was included in A History of Persuasive Art in the Galaxy, a book that collected many different articles of propaganda from the time of the Republic to the Resistance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ansibella Dellu was mentioned in the 2016 reference book Star Wars Propaganda: A History of Persuasive Art in the Galaxy, written by Pablo Hidalgo. In an early preview for the book, Dellu's surname was spelled as \"Delu,\" although this was changed for the final release."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}