{"url": "Kaller", "categories": ["Category:Canon articles", "Category:Articles with conflicting sources", "Category:Planet stubs", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Kaller locations", "Category:Outer Rim Territories planets", "Category:Rocky planets"], "nodes": [{"tag": "h1", "text": "Kaller"}, {"tag": "p", "text": "Kaller was a terrestrial planet located in the Kaller system within the galaxy's Outer Rim Territories. It was the homeworld of the Kallerans."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Although Kaller was a cold planet, the world, situated in a binary star system, had complex seasonal variation that saw mild weather shift into extreme conditions within days, allowing Kaller to be a temperate world. It was also situated at the intersection of three different hyperspace routes. Most Kallerans lived along fresh water rivers, building stone buildings in smaller towns and duracrete structures in cities."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Age of the Republic"}, {"tag": "p", "text": "During the time of the Galactic Republic, Kaller remained an insulated world due largely to the native Kallerans' culture valuing individualism, rather than collective achievement. While the Kallerans formed local governments and economies, the world's lack of an organized planetary government opened it up for colonization and exploitation by galactic corporations and extraplanetary groups, like the Mandalorians and Pykes. Occupying regional colonies, these groups mined the mineral resources of the world, driving many of the Kallerans into the resource-poor regions where they were permitted to live in peace under their own leaders."}, {"tag": "p", "text": "While Kaller hosted many different groups and species, no offworlders ever held absolute sway over the majority of the planet. Local Kalleran leaders worked behind the scenes to create rivalries between the offworlders that would better serve Kalleran politics. During the Clone Wars, the planet was targeted by the Confederacy of Independent Systems, with Count Dooku himself ordering General Kleeve to lead the conquest. After the general left the world of Kardoa, he oversaw the Separatist occupation of Kaller out of the compound of village leader Gamut Key."}, {"tag": "h3", "text": "End of the Clone Wars"}, {"tag": "p", "text": "In 19 BBY, Jedi Master Depa Billaba and her Padawan Caleb Dume led their battalion of clone troopers against Kleeve's occupation of Kaller. Although Kleeve was forced into a retreat, the Kallerans were resistant to the campaign, seeing little difference between a Republic and Separatist occupation of the planet. After the Battle of Coruscant, Kaller was again a battleground, with Billaba, Dume, and their clones fighting battle droids alongside the elite Clone Force 99."}, {"tag": "p", "text": "The execution of Order 66 would see the betrayal of Clone Captain CC-10/994 \"Grey\" and Billaba's other clones. After she yelled for her Padawan to run, Billaba was killed by her own troops, and Dume was chased into the woods by Clone Sergeant \"Hunter\" and sniper CT-9904 \"Crosshair\" of Clone Force 99. Being the only member of his squad impacted by Order 66, Crosshair tried but failed to kill the Padawan, who escaped into the woods. Nevertheless, his report of the mission revealed that Dume had survived the order, ensuring Grey's troops searched for him in Plateau City."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "While Order 66 occurs during the day and involves Clone Force 99 in \"Aftermath,\" its depiction is different in Kanan 2. During the night after Kleeve's retreat, Grey and Captain \"Styles\" lead the clone battalion against Dume and Billaba. After the death of the Jedi General, Grey orders Rostu Squad and all other troops to search for Dume."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}