{"url": "Kallic", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Imperial Navy captains of the Galactic Empire", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Kallic"}, {"tag": "p", "text": "Captain Kallic of the Imperial Navy briefly served as the temporary commander of the Super Star Destroyer Executor, the personal flagship of the Dark Lord Darth Vader, in the aftermath of the Battle of Hoth during the Galactic Civil War. Substituting for Admiral Firmus Piett, Kallic oversaw the Executor's return to Coruscant so that Vader could report his encounter with Luke Skywalker on Bespin's Cloud City to Emperor Palpatine."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kallic was an Imperial Navy officer during the Galactic Civil War who served aboard the Super Star Destroyer Executor, the personal flagship of the Dark Lord of the Sith Darth Vader. After Vader executed his flagship's former commander, Admiral Kendal Ozzel, for incompetence during the Battle of Hoth in 3 ABY, the Dark Lord promoted Captain Firmus Piett to admiral. In turn, the Executor's captaincy soon passed to Lieutenant Venka, whom Kallic eventually succeeded as captain of the Executor."}, {"tag": "p", "text": "Shortly after the Hoth campaign, Kallic was given temporary command of the Executor at Vader's request while the Dark Lord returned to the Imperial capital planet of Coruscant. Emperor Palpatine had personally recalled Vader to make his report concerning his failed conversion of the Jedi Luke Skywalker to the dark side of the Force on Bespin's Cloud City. With Kallic escorting Vader to Coruscant, Admiral Piett remained with the Imperial Death Squadron, Vader's Star Destroyer fleet, to continue the Empire's hunt for the Rebel Alliance. Once Vader's business on Coruscant concluded, Kallic was scheduled to relinquish command of the Executor back to Piett."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Captain Kallic was created by author Peter Schweighofer for the short narrative Temporary Reassignment, published in the June 1996 Shadows of the Empire Sourcebook. The narrative provides an explanation for why Admiral Piett, who commands the Executor both before and after the events of Star Wars: Shadows of the Empire, does not appear as the Executor's commander in the Shadows of the Empire novel."}, {"tag": "h3", "text": "Kallic–Venka inconsistency"}, {"tag": "p", "text": "Following the release of Shadows of the Empire Sourcebook, sources varied regarding Kallic's place in the Executor's captaincy lineage. The July 1996 second edition of Galaxy Guide 3: The Empire Strikes Back explained that the Executor's captaincy passed to Lieutenant Venka following Firmus Piett's promotion to admiral. However, the 2002 The New Essential Guide to Characters and the 2008 The Complete Star Wars Encyclopedia both stated that Kallic was Piett's immediate successor to captain, with Venka's involvement not taken into account. Ultimately, The Official Star Wars Fact File 89, released in 2003, and the now-defunct StarWars.com Databank clarified that the Executor's captaincy passed to Kallic after Venka."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}