{"url": "Kallig%27s_powerbase", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Members of the Sphere of Ancient Knowledge"], "nodes": [{"tag": "h1", "text": "Kallig's powerbase"}, {"tag": "p", "text": "Kallig's powerbase was the successor of Zash's powerbase, lead by Darth Zash's former apprentice Lord Kallig, the future Darth Nox."}, {"tag": "p", "text": "It comprised of Sith, members of the Imperial Military and Reclamation Service, and served the reconstituted Sith Empire during the Cold War and Galactic War under the dominion of the Sphere of Ancient Knowledge and its Dark Council member."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Lord Kallig's powerbase was founded while Kallig was apprentice to Darth Zash, and the young apprentice usurped control of the Cult of the Screaming Blade from its leader, the renegade Sith Lord Paladius."}, {"tag": "p", "text": "After the demise of Darth Zash, as her apprentice Lord Kallig took possession of her assets and followers in a powerbase under the domain of the Sphere of Ancient Knowledge."}, {"tag": "p", "text": "Shortly after the establishment of this powerbase, Lord Kallig's superior Darth Thanaton order it to be purged, due to its alignment with Darth Zash. Ultimately the powerbase survived the purge and an exasperated Darth Thanaton, by then a Dark Council member, declared a Kaggath against his Sphere's subordinate powerbase, and its leader Lord Kallig. By this time Kallig had expanded the powerbase significantly, not only gaining powerful allies in the Imperial Military, notably Moff Valion Pyron, but completing the Silencer project, a superweapon brainchild of the long dead Darth Mekhis."}, {"tag": "p", "text": "Lord Kallig defeated Thanaton in most major confrontations in the Kaggath, and the two finally dueled publicly on Corellia in front of Sith and Imperials. When it became apparent that Kallig had attained the advantage, Darth Thanaton fled to Korriban to seek the aid of the Dark Council. Kallig followed Thanaton to Korriban and fought their way to the Dark Council chamber where Thanaton was making his pleas to unreceptive Dark Lords. The two once more fought, and Kallig defeated Thanaton decisively. The latter was executed by Darth Mortis, who immediately offered Kallig Thanaton's Dark Council seat."}, {"tag": "p", "text": "Kallig was raised to the position of Darth, and given the title Darth Nox. With the accession of Nox to the Dark Council, the powerbase disestablished and fully assimilated into the Sphere of Ancient Knowledge."}, {"tag": "h2", "text": "Appearances"}]}