{"url": "Kaloor_Cofi", "categories": ["Category:Legends articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Post-Ruusan Jedi"], "nodes": [{"tag": "h1", "text": "Kaloor Cofi"}, {"tag": "p", "text": "Kaloor Cofi was a Jedi who served the Jedi Order during the final years of the Galactic Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kaloor Cofi was a Force-sensitive, trained in the ways of the Force by the Jedi Order, and later made a Jedi Knight by the Jedi High Council. Active during the Separatist Crisis, a growing division between the Galactic Republic and the Confederacy of Independent Systems, Cofi accepted missions on behalf of the High Council which took the Jedi across the galaxy. One such mission began when the High Council was contacted by the Gotal representative, Emissary Nathanjo Nirrelz of Antar 4. Reporting to Coruscant that the terrorist group known as the Roshu Sune had taken hostages during a battle on the planet, Nirrelz begged the Jedi to intervene."}, {"tag": "p", "text": "Cofi was dispatched as part of a six-member Jedi task force to the Gotal colony world Atzerri, under the leadership of fellow Jedi Knight, Sarrissa Jeng. Once there, Kofi and the team of diplomats were to negotiate the release of Nirrelz. During the negotiations, a group of unaffiliated vigilantes opened fire on the Roshu Shone guerrillas. This attack panicked the Gotal separatists, who opened fire on their captives. Leaping to defend the unarmed hostages, the Jedi managed to subdue the guerrillas on their commuter hopper, but not before Cofi and Antyard-Wo Shissan lost their lives. Survived by his colleagues, including Jeng and Kerrshnek, Cofi's body was transported to the Order's chapter house on Aleen Minor for the cremating. Meanwhile, across the HoloNet News network, the Jedi were heavily criticized by Gotal Foreign Affairs Commune leader Shagrad Loset for what he saw as meddling in an internal affair. Rebuffing this assault on the Order, Jedi Master and High Council member Shaak Ti commended the Jedi effort on Atzerri."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}