{"url": "Kaltor_Naklian", "categories": ["Category:Legends articles", "Category:Duelists", "Category:Educators", "Category:Ka'hren", "Category:Males", "Category:Religious workers", "Category:Zulirian Swordmasters members"], "nodes": [{"tag": "h1", "text": "Kaltor Naklian"}, {"tag": "p", "text": "Kaltor Naklian was a Ka'hren scholar, swordmaster, scalp hunter and founder and priest of the Ni'Shaw-Dak Ministry."}, {"tag": "p", "text": "Naklian always showed an interest in famous ancient warrior cultures of his native V'shar, particularly in the southern continents. His interest led him to became a teacher of Ka'hren ancient history at the University of Timb, and he was obsessed with his research."}, {"tag": "p", "text": "Naklian studied the long-forgotten Unfyr warriors (although he was not an Unfyr or a descendant of them). He discovered the forgotten art of building the traditional sword of the Unfyrs, the rantok, and later, instruction texts discussing its use; soon, he became a swordmaster."}, {"tag": "p", "text": "During an archaeological exploration, Kaltor discovered a well-preserved rantok, plus the writings of the two first prophets of Ni'Shaw, a god of war and wisdom worshiped by the Unfyrs. Naklian believed that Ni'Shaw was forgotten because he only had two prophets, instead of three as the Jydan religion suggested. He decided that it was a sign saying that Ni'Shaw wanted Naklian to become his Third Prophet."}, {"tag": "p", "text": "Firstly, Naklian resigned from his teacher job and he became scalp hunter, showing a great skill with the rantok. He was rumored to never had lost a duel, and he became a legend among the Ka'hren, considered the best rantok-wielder ever. He then joined the Zulirian Swordmasters as one of the founding members, and became a great friend of Ther-das, the leader of the Swordmasters."}, {"tag": "p", "text": "He also founded the Ni'Shaw-Dak Ministry, derived from the Jydan religion, but adding beliefs and practices of ancient Ka'hren tribes. Due to Naklian's personal fame as a scalp hunter and Zulirian Swordmaster, the Ni'Shaw-Dak became the fastest-growing cult in V'shar, obtaining a great representation in the demo-teocracy. Naklian obtained a great amount of money as the Third Priest, but he destined all of that money to the sect, giving the Swordmasters all of his incomes as a scalp hunter."}, {"tag": "p", "text": "Naklian kept a friendly rivalry with Swordmaster Cene Gilvent, because none of them had ever lost a duel."}, {"tag": "p", "text": "Naklian was one of the Zulirian Swordmasters who found a team of Rebels on Teloc Ol-sen. Naklian, noticing that one of the Rebels was fond of using his vibroblade, challenged him to a duel. The Rebel refused, and then Naklian simply killed him with his rantok. The other Rebels began a fight with the Swordmasters, but were utterly defeated and massacred. The Zulirian Swordmasters have been since considered a threat to the Rebel Alliance."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}