{"url": "Kamino/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cleanup", "Category:Articles in need of updating", "Category:Galactic Republic planets", "Category:Kamino locations", "Category:Type I atmosphere planets", "Category:Waterworlds", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Kamino"}, {"tag": "p", "text": "Kamino (pronounced /kə'minoʊ/), called Big Stormy by some clone troopers, also known as the Planet of Storms, was a waterworld where the Clone Army of the Galactic Republic was created, as well as the Kamino Home Fleet. It was inhabited by a race of tall, elegant beings called the Kaminoans, who kept to themselves and were known for their cloning technology. Kamino was located just south of the Rishi Maze, and was governed by the Ruling Council, headed by the Prime Minister."}, {"tag": "h2", "text": "Astronomy and geography"}, {"tag": "p", "text": "Kamino was the fifth world in a system of 13 planets orbiting an aging star south of the Rishi Maze, a dwarf satellite galaxy in a decaying orbit in a loose sector of an unnamed grouping of stars between the Rishi Maze and the main galaxy. The stormy water world of Kamino was located in the Wild Space region beyond the Outer Rim. The planet had three moons orbiting the planet itself, including Korasa. The planet was composed of a molten core with a rocky mantle and silicate rock crust. Climatic change had long ago submerged the planet's continents, drowning the planet under a global ocean that covered almost all of the surface, with a few islands left that were once mountain tops. These mountain-tops, though, were rained on almost incessantly. However, the surface of Kamino was not always subject to constant rain, as such was in a Separatist attack to gain a DNA sample of Jango Fett. Its savage storms and powerful lightning bursts could be seen vaguely through its relatively thick atmosphere. Although technically part of Wild Space region in the galaxy, it is sometimes referred to as an extra-galactic planet due to its system being located between the main galaxy and the Rishi Maze dwarf galaxy."}, {"tag": "h2", "text": "Sentient life"}, {"tag": "p", "text": "Being somewhat secluded from the rest of the galaxy, little is known about the origin of the Kaminoans. There were many peculiarities about the particulars of Kaminoan physiology: their digitigrade stance, once adapted for firm seabeds, eventually only saw use in the hallways of their science facilities, while only male Kaminoans exhibited fin ridges along the rear of their small, bulbous skulls. The almond-shaped eyes were able to see color only in the ultraviolet spectrum. Therefore, what appeared as white dwellings were actually colored with shades that Humans and other humanoid species couldn't see."}, {"tag": "p", "text": "Kaminoans rode flying cetaceans called aiwhas. Indigenous to the planet Naboo, these aiwhas were probably created using cloning technology."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Around 19,000 BBY, dramatic climate shifts began to melt the extensive glaciers of Kamino. As a result of resourceful adaptation, the Kaminoans survived the Great Flood of their planet's continents. The Kaminoans used cloning to keep themselves sustained."}, {"tag": "h3", "text": "Jedi Order"}, {"tag": "p", "text": "Throughout its history, the location and very existence of Kamino was known to only a handful of beings, becoming known to members of the Galactic Republic as late as 4500 BBY. In 3996 BBY, following the devastation of Ossus, a number of artifacts saved from Ossus were hidden in the ruins of Derem City by Jedi Master Qalsneek the Bull. After the Jedi Civil War, Kaminoan kyber darts were being used in the galaxy, but most beings were ignorant of their source. Kamino was able to survive through the worst ages in the galaxy before the Clone Wars."}, {"tag": "h3", "text": "New technology"}, {"tag": "p", "text": "In later years, the Kaminoans created saberdarts, similar to the older kyber dart. These deadly weapons were favored by bounty hunter Jango Fett. The Kaminoans created clone miners to toil on Subterrel. While prospecting on Subterrel, Dexter Jettster became familiar with the Kaminoan cloners, and even found a saberdart."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 32 BBY, Sifo-Dyas placed an order with the Kaminoans for a Clone Army without the knowledge or approval of the Jedi Council. Darth Tyranus, at the bidding of Darth Sidious, murdered Sifo-Dyas to keep the creation of this army secret from the Jedi and the Republic. Tyranus then recruited Jango Fett to serve as Prime clone. Fett agreed on the condition that the Kaminoans create him an unaltered clone, his son Boba Fett. Jango raised Boba on Kamino for the next ten years."}, {"tag": "p", "text": "Obi-Wan Kenobi was directed there in 22 BBY to follow a lead on the whereabouts of Senator Padmé Amidala's would-be assassin through a single saberdart. The saberdart had been used by Jango Fett to murder Zam Wesell before she could be interrogated by Kenobi. Kenobi had the dart identified by Dexter Jettster. Jettster directed him to Kamino, and Obi-Wan and Yoda were disturbed that Kamino had apparently been erased from the Jedi Archives. During Obi-Wan's stay on Kamino at Tipoca City, he discovered the source of the Clone Army's genome, Jango Fett, and his \"son,\" Boba Fett. Once he was discovered, Jango and Boba narrowly escaped the planet with Obi-Wan close behind."}, {"tag": "h4", "text": "The battles begin"}, {"tag": "p", "text": "Grand Master Yoda then went to the planet to receive a desperately needed contingent of clone troopers to assist in the rescue of Obi-Wan Kenobi, Anakin Skywalker, Padmé Amidala, and the Jedi Knights in the Battle of Geonosis, which began the infamous Clone Wars. When the Separatists discovered the source of the clones, Commander Merai launched an attack on Kamino at the bidding of Passel Argente, but the First Battle of Kamino, 22 BBY, was won by the Republic. In the Second Battle of Kamino there was an attempt by Mandalore the Resurrector and his Mandalorians to destroy a cloning facility, but it was foiled by the clone trooper garrison. A further attempt was made by the Confederacy at some time after the second Battle of Kamino to capture and destroy the cloning facilities, but this plan was prevented due to the actions of clone troopers at a nearby monitoring station. After the Battle of the Rishi moon, Separatist leaders, General Grievous and Commander Asajj Ventress, launched an attack on Kamino to capture a sample of Jango Fett's DNA. The attack force was turned back by elements of the Open Circle Fleet and clone troopers garrisoned there."}, {"tag": "h3", "text": "Fighting the Empire"}, {"tag": "p", "text": "The end of the Clone Wars resulted not only in the near destruction of the Jedi Order as well as the defeat of the Separatists, but also the rise of the Galactic Empire in the place of the fallen Republic. Seeking to secure the vital cloning facilities that were responsible for providing the Empire with the clones that helped to secure Emperor Palpatine's rise to ultimate power, Imperial control was firmly established upon Kamino through force of arms. Although Kamino would continue to grow more stormtroopers for the Empire, a small group of Kaminoans grew resentful of the Empire's treatment of Kamino as a virtual military police state. In response to the Imperial presence on their world, the Kaminoans launched a covert rebellion against the Empire by discreetly breeding a new army of clones, all based on the genetic template of Jango Fett. Unlike the first Clone army that had been bred for the Republic, the newest generation of clones were engineered with absolute loyalty to Kamino."}, {"tag": "p", "text": "Over the next decade after the conclusion of the Clone Wars, the Anti-Imperial Clone troopers were grown and trained to eventually liberate Kamino from Imperial rule. Garbed in Phase I armor and composed entirely of Jet troopers, the Anti-Imperial clones were augmented with a series of ARC troopers, as well as a few LAAT gunships. Approximately twenty years after creating the first generation of clones based on the Fett template, the Anti-troopers were fully grown, armed and evidently prepared to fight against their Imperial brothers."}, {"tag": "p", "text": "Around the same time, however, the Empire discovered Kamino's clandestine operation and responded by sending an elite detachment of the 501st Legion to Kamino in order to destroy the Kaminoan rebellion and restore Imperial rule to its cloning centers. The 501st's main target was Kamino's capital, the Tipoca City Cloning Facility, by then occupied by the Kaminoan rebels and their Anti-troopers. Boba Fett, also a clone of the long-dead Jango Fett, was hired to serve as the 501st's mission commander during the re-taking of Kamino, due to his extensive knowledge of the inner layout and workings of Tipoca City. To prevent any chances of encouraging other insurrections throughout the galaxy, the mission to Kamino was completely off the record."}, {"tag": "p", "text": "The entire battle was virtually lost to the Anti-troopers from the start. Despite their advanced training, the younger Fett clones were outmatched by their older and more experienced Imperial brothers, none of whom held any reservations about gunning down their fellow clones. Aside from possessing many veteran troopers from the Clone Wars and superior firepower, the 501st Legion was greatly assisted by Boba Fett: the bounty hunter commanded his forces on site and led the stormtroopers into Tipoca City, killing the Anti-troopers where ever they encountered them."}, {"tag": "p", "text": "Unwilling to risk losing what remained of Jango Fett's blood, the main source for producing the Fett clones, one of the 501st's primary objectives was to capture a container that held a sample of Fett's DNA. After storming Tipoca City and retrieving the container, the 501st brought their progenitor's blood sample to a landing platform an Imperial shuttle awaited them. From there, the shuttle took Fett's DNA off planet to safety while the 501st fought on against their rebel brethren. After gaining further ground from outside the city, the 501st went on to fulfill its next primary objective—destroying the Kaminoan life support systems in order to kill all of the rebel clones that had not yet been decanted, thus preventing the Kaminoans from raising more Anti-troopers against the Empire in the future. Despite being protected by a numerous elite ARC troopers, the rebel clones failed to prevent the 501st from killing the undeveloped clones within the facility."}, {"tag": "p", "text": "After securing most of Tipoca City from the inside, Boba Fett and the 501st Legion proceeded to crowd the remaining Anti-troopers and ARC troopers onto the platforms where they were brutally wiped out. As the fighting dragged on, the Kaminoan rebel leaders saw the hopelessness of their situation and attempted to retreat by utilizing their LAAT gunships. Their efforts were in vain, however, as the 501st managed to destroy both gunships, along with the Kaminoan traitors as well. When the battle came to an end, none of the rebel clones were left alive. With his assignment completed, Boba Fett left the 501st Legion to mop up on Kamino while he returned to deal with his own personal affairs as a bounty hunter."}, {"tag": "p", "text": "Although the stormtroopers of the 501st Legion proved their loyalty to the Galactic Empire once again, the circumstances surrounding the battle convinced Emperor Palpatine that a clone army, composed entirely of clones based on one genetic source, was too susceptible to corruption. From that point on, it was decided that new clone stormtroopers would be created from various templates; the Empire even resorted to enlisting regular Humans into the Stormtrooper Corps. Though the 501st Legion remained composed purely of Jango Fett's progeny for the time being, the rest of the Imperial Army became increasingly diverse through an ever-growing pool of enlisted troopers and alternative source clones."}, {"tag": "p", "text": "Thus, the \"Clone Revolt\" on Kamino was indirectly responsible for turning the clones of Jango Fett into a minority within the army that they once filled as a whole, an irony that the Fett clones neither appreciated nor ever grew accustomed to. Roughly a decade after the incident on Kamino, Commander Cody was bitterly resentful of the Imperial Army's pitiful decline in operational effectiveness. In addition to that, Cody absolutely hated enlisted stormtroopers, dismissing them as incompetent idiots that were utterly expendable."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "h4", "text": "Secret cloning project"}, {"tag": "p", "text": "In the year 1 BBY, shortly after the start of the Galactic Civil War, the Sith Lord Darth Vader secretly brought the deceased body of his fallen apprentice, Galen Marek, to Kamino. With Marek's corpse preserved as a source of genetic material, Vader utilized an experimental version of Kaminoan cloning technology, known as the Accelerated Cloning Process, in an attempt to create a far more powerful version of his former disciple. Deep within the Timira City Cloning Facility, Vader personally oversaw the secret project, determined to possess once more an assassin of Marek's caliber."}, {"tag": "p", "text": "But due to the inherent flaws in creating clones of Force-sensitive subjects, the first series of Marek's clones were grotesquely deformed and highly unstable. After months of painstakingly correcting the imperfections in the procedure, each clone after another was somewhat more stable than the last, thus forcing Vader to train many clones in a \"trial and error\" process until finally achieving the creation of a single perfect clone to replace the original apprentice. Although one clone managed to escape from Kamino after failing to purge himself of the imprinted emotions that he gained from Marek, Vader recalled Boba Fett to Kamino and tasked the bounty hunter with luring the rogue clone back to his homeworld."}, {"tag": "p", "text": "Despite losing the clone that was very nearly the first success of the entire project, Darth Vader's efforts were finally rewarded in the form of a unique clone who did not fail to meet any of the Sith Lord's expectations. Just like the rest of the clones that came before him, however, the latest clone was also haunted by the imprinted memories and emotions of his dead progenitor. But unlike his precursors, the clone was absolutely determined to prove his worthiness by becoming free of his former self's feelings through a combination of strong will and constant training on Kamino. As the clone all but completed his trials, he emerged as his own person with a deep sense of resentment over his former self's weaknesses and failures. With the perfect clone of the original Starkiller at his service, Vader ended the cloning project on Kamino in victory."}, {"tag": "p", "text": "Meanwhile, Boba Fett succeeded in bringing Starkiller, the renegade clone who had been dubbed by his progenitor's former codename, back to Kamino by taking Captain Juno Eclipse as a hostage. As Starkiller unleashed an onslaught of destruction on Kamino and throughout Timira City, the clone's Rebel allies engaged Kamino's Imperial garrison in a brutal fight in space and on the planet. Although both Boba Fett and the Dark Apprentice remained in reserve to intervene on Vader's behalf only if absolutely necessary, the Empire was defeated in the Battle of Kamino, which also resulted in the capture of Darth Vader after being spared by a most reluctant Starkiller. Although the Rebels' had neither the resources or the manpower to liberate and hold onto the planet, the victory on Kamino marked the Rebellion as a legitimate threat to the Galactic Empire. After destroying Timira City by causing a tsunami wave to obliterate the cloning facility, the Rebels departed to the secret rebel base on Dantooine, unaware that Fett was pursuing the Rebels and their valuable hostage in his ship."}, {"tag": "h4", "text": "Stolen Sith artifact"}, {"tag": "p", "text": "In that same year, Urai Fen, concerned with the Zann Consortium's survival after they stole Jabba the Hutt's artifact, moved the Consortium's base of operations to Kamino for a time before settling on Ryloth."}, {"tag": "h3", "text": "The era of the New Republic"}, {"tag": "p", "text": "After the Battle of Endor, the collapse of the Empire triggered an economic collapse of Kamino and the production of clones eventually ended. The planet continued to survive on smaller contracts, often for warlords and criminal organizations."}, {"tag": "p", "text": "Years later, Kaminoan Taun We would seek revenge against the Mandalorians who attacked them during the Clone Wars by hiring Boba Fett to kill Fenn Shysa, the last remaining Mandalorian veteran of the Second Battle of Kamino."}, {"tag": "p", "text": "In 40 ABY, Boba Fett traveled here to consult his doctor and was told that he was dying. The only being who could heal him was Ko Sai, a scientist who had invented the accelerated aging process. She had disappeared after the First Battle of Kamino. He decided to hunt down Taun We, who had defected more recently. The current Prime Minister of Kamino, Koa Ne, offered to pay him to return Taun We's data to them. Boba Fett refused after Koa Ne would not pay his exorbitant price, stating that he would sell the data to the highest bidder."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kamino first appeared in the 2002 film Star Wars: Episode II Attack of the Clones. The buildings of Kamino served as inspiration for University of Texas designs for a Marine Research Facility."}, {"tag": "p", "text": "Originally, George Lucas promised Star Wars fans to explain the mystery behind the erasure of Kamino from the Jedi Archives in 2005's Star Wars: Episode III Revenge of the Sith. Unfortunately, after refocusing the story on Anakin Skywalker, Lucas opted to sacrifice certain extraneous plot points related to Attack of the Clones, including Kamino's mystery. As such, Lucas allowed James Luceno to explain the mystery behind Kamino and its Clone Army in his novel Labyrinth of Evil."}, {"tag": "p", "text": "According to the map in The New Essential Chronology, Kamino is located exactly where Obi-Wan Kenobi said that it was. In the film however, he points toward the Unknown Regions, where no known systems are located. The Essential Atlas, Kamino is shown with some land, instead of being covered totally by water. This is only marsh, however, and not solid ground. Star Wars: Battlefront also shows some land masses on Kamino."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}