{"url": "Kaminoan", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Amphibian sentient species", "Category:Extragalactic species", "Category:Kaminoans"], "nodes": [{"tag": "h1", "text": "Kaminoan"}, {"tag": "p", "text": "The Kaminoans were a tall, thin amphibian sentient species  with pale skin native to the isolated extragalactic aquatic planet of Kamino, located south of the Rishi Maze satellite galaxy and beyond the larger galactic disc."}, {"tag": "p", "text": "Living in large stilted domed cities that rose high above the ocean surface, Kaminoan scientists were known to specialized in cloning technology and genetic engineering."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Kaminoans were slender, towering, pale-skinned humanoids whose oblong heads sat atop elongated neck bones that allowed them limited flexibility. They had two large, almond-shaped black eyes with white pupils that enabled them to see into the ultraviolet spectrum. Male Kaminoans had fin-like crests atop their heads, while females were completely bald and wore unique head crescents. Their long and frail limbs gave them a graceful, gliding walk and featured small feet adapted to their extragalactic homeworld's firm seabeds and later hard flooring. Kaminoans reached adulthood at 11 years old."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Kaminoans generally displayed few signs of outward exuberance or personality. They considered the clone troopers to be their finest achievement. Kaminoans were also isolationists, only concerning themselves with offworlders if it was profitable. This traced back to the great flood that changed their homeworld of Kamino, as they decided it was less risky to adapt their genetic code and planet than to ask for aid from the Galactic Republic. While the Kaminoans were able to thrive, they were left with a residual distrust when they received offers of offworld help. However, Kaminoans did not necessarily think they were superior to other species, and they instead simply saw other planets as a distraction. Many Kaminoans even thought that everything they needed was already on Kamino."}, {"tag": "p", "text": "The Kaminoans were generally scientifically rational. However, they did often make pilgrimages to the sunken ruins of their ancient cities. Both ancient and modern Kaminoan cities were characterized by domed cities."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early development"}, {"tag": "p", "text": "Hailing from the extragalactic planet Kamino, the Kaminoans lived in a land-based culture, although they still maintained a strong connection to the ocean and water, but their homeworld was at the end of a long ice age. Kamino's landforms and mountains were unable to hold back the water from the melting ice, and this great flood forced the Kaminoans to adapt their lifestyle. The species initially moved to higher ground, but they eventually needed to build high cities to avoid the ocean. They constructed large spires and towers, which were connected to the ground that became the seafloor. These towering structures replaced older wattle-and-daub structures."}, {"tag": "p", "text": "To move between the cities, Kaminoans flew on the backs of aiwhas. While they could have reached out to the Galactic Republic for help, the Kaminoans performed calculations and came to believe it was less risky to work on their own, as they could have been colonized, lost resources, and undergone a change in culture. The Kaminoans also preserved the land-based species and adapted themselves, their flora, and their fauna to survive on the changed planet. Their new cities were fully enclosed, which allowed the Kaminoans to survive strong winds and rainstorms, and became home to the land-bound plants and animals they were able to save."}, {"tag": "h3", "text": "Isolation"}, {"tag": "p", "text": "While Kamino remained unknown to most, the Kaminoan's skill in engineering and genetic engineering was whispered of in some parts of the underworld. They also maintained a cloning facility on the world of Bora Vio for a time, although the Kaminoans eventually abandoned it, leaving the clones created there behind. Jedi Master Sifo-Dyas learned of the species and went to Kamino to order the creation of a Grand Army of the Republic. While they had created clone armies before, Sifo-Dyas' proposal was a bold one, but the species ultimately adapted to it and fulfilled the request. However, the Sith took control of the project when Darth Tyranus paid the Pyke Syndicate to shoot down Sifo-Dyas' T-6 shuttle, killing the Jedi Master. Tyranus also hired bounty hunter Jango Fett to serve as the genetic template for the army. While it took ten years for the troops to mature, the army of clone troopers was finally ready to be introduced to the Republic."}, {"tag": "p", "text": "Jedi Knight Obi-Wan Kenobi arrived on Kamino while tracking Fett, due to the bounty hunter's role in the plot to assassinate Padmé Amidala, and met with the Kaminoan Prime Minister, Lama Su, as the Kaminoans believed Kenobi had arrived to finally check on the Grand Army. Not long after the Republic learned of the army, the Galactic Senate gave Supreme Chancellor Sheev Palpatine, who was secretly the Dark Lord of the Sith Darth Sidious, the emergency powers needed to use the Kamino's clone army, under the guise of this power being needed to combat the Confederacy of Independent Systems. The clone troopers saw their first deployment under their Jedi Generals in the First Battle of Geonosis, the first battle of the Clone Wars."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Creating the clone army put the Kaminoans into galactic history, and they also gained representation in the Republic when Halle Burtoni bartered her efforts in clone production into a seat in the Galactic Senate. However, as the sole producers of the clone army, Kamino became a prime target for Confederate attack."}, {"tag": "p", "text": "In 21 BBY, the Confederacy did launch an assault on the world, but the Battle of Kamino ended in a Republic victory. After the battle, Clone Captain CT-7567 \"Rex\" believed the Separatists would not attack the planet any time soon, and CT-1409 \"Echo\" and CT-5555 \"Fives\" were promoted to ARC troopers. When these clones received their promotions in one of Tipoca City's hangars, several Kaminoans were close by. Later in the war, Fives returned to Kamino after CT-5385 \"Tup\" mysteriously killed Jedi General Tiplar during the Battle of Ringo Vinda. This was because Tup's behavioral modification biochip, a secret device implanted in clones believed to only be a defense against rogue Jedi, malfunctioned and caused a premature execution of Order 66."}, {"tag": "p", "text": "Kaminoan Nala Se tried to hide the chips from the Jedi Order, but Fives was able to reveal it to Jedi Master Shaak Ti. However, Fives was eventually killed and failed to warn the Jedi about the true nature of the chips: they were to be used by Chancellor Palpatine to force all clones to kill their Jedi officers. Palpatine gave physical evidence of his plans, the extracted chips of Fives and Tup, to Nala Se. They were sent to Tyranus, and the Sith were now able to destroy all traces of the truth."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Palpatine ultimately issued Order 66 and eradicated the Jedi Order, allowing him to transform the Republic into the First Galactic Empire. Although the Kaminoans sought to continue their relationship with the Republic's successor, Admiral Wilhuff Tarkin informed Lama Su that Emperor Palpatine no longer supported their cloning production as he had during the Clone Wars. After learning of the Empire's training program for enlisted soldiers, Lama Su became concerned that his clones were in danger of becoming obsolete. Therefore, he believed that the future of Kaminoans hinged on providing the Empire with a new type of clone that was superior to the original Jango Fett genotype, which continued to degrade in the aftermath of the war."}, {"tag": "p", "text": "After the rise of the Empire, the cloning facilities on Kamino were shut down, and the pirate Hondo Ohnaka noted that he saw fewer Kaminoans in the galaxy."}, {"tag": "h2", "text": "Kaminoans in the galaxy"}, {"tag": "p", "text": "One of the clones kept in the abandoned cloning facility on Bora Vio was a Kaminoan."}, {"tag": "p", "text": "The Kaminoan Kan Be was a crime lord during the Cold War between the First Order and New Republic. He joined forces with First Order Security Bureau agent Terex during the mission to Megalox Beta."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The design of the Kaminoans was inspired by the aliens from Steven Spielberg's film Close Encounters of the Third Kind."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}