{"url": "Kamlin", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Falleen", "Category:Females", "Category:Jedi trainees of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Kamlin"}, {"tag": "p", "text": "Kamlin was a female Falleen Padawan training at the Jedi Temple on Taris in the years following the Great Sith War. Trained initially on Dantooine at the Jedi Enclave, Kamlin was sent to Taris to study under Jedi Master Raana Tey, who was also a member of the Jedi Covenant and First WatchCircle, a group of Jedi who sought to prevent the rise of the Sith at any cost. Kamlin excelled and showed great promise during her time on Taris and was credited with capturing the criminal P'den Robalt. During her final trial as a Padawan, she successfully navigated the \"Rogue Moon,\" a planetoid in the Taris system which orbited in contraflow through an asteroid field. She survived the perpetual bombardment after being dropped onto the surface and, with no ability to see, was able to reach her master who waited in meditation at a high place."}, {"tag": "p", "text": "During their meditation, however, the Jedi Masters had a vision about their deaths which they supposed was due to the rise of a Dark Lord of the Sith. Through discussion, the masters connected their apprentices to the figure in the vision and decided to act. Aiming to prevent the rise of the Sith at any cost, they agreed to murder the Padawans and schemed to do so at their knighting ceremony. Kamlin had earned the privilege to be knighted and attended the banquet in honor of the graduates. Following the abrupt and destructive entry of fellow Padawan Zayne Carrick, she pitched in to help cover the damages to a large window and tables. She then showed up at the ceremony on time and began discourse with her masters. Initially, she was excited that her friend, Carrick, was to be knighted as well. She, however, sensed something amiss due to the masters' strong disapproval of Carrick. Pressed, the Jedi Masters hastened their plans and struck down the Padawans, pinning it on the late-arriving Carrick. Eventually, Carrick was cleared of Kamlin's murder."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Jedi training"}, {"tag": "p", "text": "Kamlin was a female Falleen who lived during the time of the Old Republic following the Great Sith War. Being found a Force-sensitive, Kamlin was trained as part of a group of younglings at the Jedi Enclave on Dantooine. Other members of the group included Zayne Carrick, a Human; Gharn, a Nagai; Shad Jelavan, a Human; and Oojoh, a Ho'Din. These five trainees, having been accepted to study the ways of the Force, grew up together as they were sent to a small training facility on the planet Taris. There, each was assigned one of five Jedi Masters to continue their training. Kamlin was placed under the tutelage of Jedi Master Raana Tey, a member of the Jedi Covenant, which sought to stop the return of the Sith at any cost."}, {"tag": "p", "text": "Through her training, Kamlin became one of the most promising students of her class. For one training exercise, Kamlin captured the noted criminal P'den Robalt, an accomplishment that was recognized by the Taris HoloNet feed. In 3964 BBY, Kamlin and the other four members of the next graduating class were taken to the place called the \"Rogue Moon,\" a planetoid in the Taris system that featured frequent and dangerous bombardment from asteroids. Dropped onto the surface in red environmental suits, the Padawans were given the task to reach a high place where their masters meditated. Kamlin, along with the other Padawans, had no shield to protect her from the asteroid impacts, and the blast shield within the visor covered their eyes. Instead, the trainees were expected to rely entirely on the Force to reach their masters safely. While in meditation, the Jedi Masters, who as Consulars specialized in precognition, shared a vision through the Force of their death along with the fall of the Jedi Order by someone wearing red. Together, the Jedi Masters surmised that it was someone wearing a red environmental suit, such as those worn by their apprentices. Thus, the five believed it would be one of the Padawans who would fall to the dark side and bring the threat of the Sith back to the galaxy. In response, the masters agreed that the issue needed to be dealt with."}, {"tag": "p", "text": "Although she was not the first to finish the ascent, when Kamlin had reached her master, the Falleen waited inside the magnetic shield for Zayne Carrick, the last of the Padawans, to arrive. Returning to Taris, however, the masters sequestered themselves inside the temple for days. When they once again revealed themselves to their Padawans, it had been decided to arrange a banquet and ceremony for the knighting of the five trainees. Even at the party for Kamlin and the other Padawans, the masters hastened the proceedings of the evening with the sudden and tardy arrival of Carrick. Having chased the criminal Marn Hierogryph through the Tarisian skylanes, Carrick crashed through a window and into a table. He was instructed by his disapproving master, Lucien Draay, to pay for the meal and the damages that had been incurred. Because of the expense, Kamlin and his other friends helped provide some of the credits needed."}, {"tag": "p", "text": "Lucien Draay set one hour after his departure from the banquet to begin the knighting ceremony and instructed the Padawans to not be late. Kamlin arrived on time, along with Gharn and Oojoh, but Shad Jelavan and Zayne Carrick did not. Jelavan arrived thereafter and expressed surprise that Carrick was to be knighted with the others. While Jelavan was a friend to the other Human trainee, he sensed something was amiss, for he understood that Master Draay held Carrick in low regard and never took him seriously. Kamlin, too, then chimed in, expressing disbelief and questioning if everything was in order. Having been pressed, the masters hastily executed their plans. Raana Tey, along with the other Jedi Masters, ignited her lightsaber and executed the Padawans, with Tey slicing Kamlin across the torso and right arm."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Zayne Carrick arrived late to the knighting ceremony only to see his friends dead at the hands of their masters. He fled the scene and was framed for their murder. Carrick was then pursued by the Jedi and Republic officials for the crime. While being pursued, he prophesied that he would finally have his name cleared for the crimes which the masters committed. Shortly thereafter, the five Jedi Masters known as the First WatchCircle were reassigned to different positions apart from each other. Nevertheless, Raana Tey traveled back to Taris. While in transit, she had a nightmare in which she saw the Jedi Tower under siege. Running into the tower, she stumbled upon a knighting ceremony, as Zayne Carrick had. In the vision, however, she saw Kamlin standing in her place with a lightsaber drawn. Each of the other murdered apprentices were in the positions their masters had occupied during the massacre."}, {"tag": "p", "text": "Later, in 3963 BBY, the truth behind the covenant and the Padawan Massacre came to light when Master Xamar testified before the Jedi Council. Xamar confessed to the plot and revealed the details about the Covenant, exonerating Carrick. The Jedi never released the truth to the public, but Kamlin's parents were privately notified about the circumstances of their daughter's death. In the aftermath of the Vindication insurrection, Carrick brought together the family members of the murdered Padawans, including Kamlin's sister. Her sister became involved in the Rogue Moon Project, an organization created by Carrick and Shel Jelavan to help clear other wrongfully accused individuals. Carrick further honored Kamlin with the usage of her name as part of his alias when infiltrating the slave-trading organization known as \"the Crucible.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kamlin was a promising student of the Force who had been assigned to apprentice under Master Raana Tey. She achieved a noted level in her training, having captured the criminal P'den Robalt, which earned mention in the Taris Holofeed. Likewise, she successfully navigated the Rogue Moon to reach her masters, even though she was not the first to arrive and was expected to be knighted shortly thereafter. Kamlin was willing to act with generosity, as shown by her donation to Zayne Carrick to help pay for the damages he incurred at the banquet, and was genuinely pleased that Carrick was also \"expected\" to be knighted at the ceremony. Nevertheless, Kamlin knew of the masters's views on Carrick and spoke up to question why he was to be knighted. She was unable, however, to escape the surprise ambush by the Jedi Masters and was murdered by Raana Tey. During her final days on Taris, Kamlin wore a blue robe topped with a purple vest and orange trim."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kamlin was created by John Jackson Miller in the Dark Horse comic series Star Wars: Knights of the Old Republic. Her first appearance was in the comic's 2006 debut, Knights of the Old Republic 1. Kamlin later appeared in all of the other issues of the Commencement story arc except for issue 5. She was first identified by name, however, in the in-universe news bulletin The Taris Holofeed: Prime Edition, which appeared in the back of Knights of the Old Republic 0. Kamlin also made an appearance in this issue, along with subsequent appearances in a hologram in issue 9 and in a Force vision in issue 16. The first canon confirmation of Kamlin as Tey's Padawan, however, occurred in the Star Wars: Knights of the Old Republic Handbook. Additionally, Kamlin appears on the cover of the first issue of the Knights of the Old Republic comic, being held by Zayne Carrick after her murder. This scene, however, never happens in the comic itself. She is also directly mentioned in the 48th issue, where it is revealed Kamlin had a sister who was working for Carrick's newly-created Rogue Moon Project."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}