{"url": "Kammia", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire planets", "Category:Terrestrial planets", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Kammia"}, {"tag": "p", "text": "Kammia was a planet in the extremely remote Drynn system, among the sparsely populated Shiritoku Spur of Wild Space. Kammia was a Human colony world of the Galactic Empire, notable for its rich soil. In the years following the Battle of Yavin, Emperor Palpatine ceded a number of colony worlds, including Kammia, to the Ssi-ruuvi Imperium in exchange for the aliens' species-enslaving entechment technology. The Empire released a news report claiming that a mysterious virus had wiped out the Kammia colony to hide the truth."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kammia was a particularly remote planet located in the Drynn system of the Shiritoku Spur, an area of space that lay on the edge of the Outer Rim Territories in the galactic region known as Wild Space. Kammia had excellent soil, rich for agricultural purposes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Sacrificed to the Ssi-ruuk"}, {"tag": "p", "text": "One of the Galactic Empire's frontier Human colonies on the periphery of known space, Kammia was settled during the early years of the Empire and was dedicated to producing agricultural foodstuffs due to the planet's rich soil. The Imperial Human colonists introduced Chandrilan grain to the planet's soil in their agricultural efforts."}, {"tag": "p", "text": "Following the Battle of Yavin, the Ssi-ruuvi Imperium, representing a species of alien invaders from the Unknown Regions, began to attack Imperial colony worlds along the edge of the Outer Rim in an effort to assimilate the Human colonists inhabiting them. Through a process known as \"entechment,\" the alien invaders harnessed their captive Humans' life forces as a source of energy for their war machines."}, {"tag": "p", "text": "News of the invasions soon reached Emperor Palpatine. Craving the aliens' entechment technology for his own purposes, the Emperor agreed to cede Imperial citizens to the aliens in return for access to their technology. One of the first colony worlds sacrificed to the aliens was Kammia, which fell following a raid on the outpost."}, {"tag": "h3", "text": "Imperial cover-up"}, {"tag": "p", "text": "As had been done with the aliens' first invasions, the Empire easily hid the truth of the Kammia colony's fate through the control of media outlets. The Empire created and distributed false cover stories for each of the lost colony worlds, ranging from industrial accident to Rebel Alliance attack."}, {"tag": "p", "text": "On 37:4:21, in the year 2 ABY, the Imperial HoloVision released a news report explaining that a mysterious disease had wiped out the Kammia colony with no survivors, and that the planet was placed under strict quarantine. According to the Imperial Colonization Board, the release explained, belief was that the colonists' Chandrilan grains had interacted with components in the planet's soil to produce a non-indigenous plant that led to the evolution of a contagious \"mystery virus,\" which quickly spread to the colony. The ICB expressed its condolences to the families of those lost colonists, and the Emperor pledged that the Imperial Survey Corps would refine its soil-screening process to avoid further tragedies."}, {"tag": "p", "text": "In the years following, rumors spread through the region of aliens attacking starships in the Shiritoku, and cantina tales suggested that the destruction of colonies such as Kammia were related. Those rumors proved true when the aliens invaded the Imperial planet Bakura in 4 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The colony world Kammia was first introduced into Star Wars canon in the February 1996 The Truce at Bakura Sourcebook, written by Kathy Tyers and Eric S. Trautmann, which identified Kammia as one of the first Imperial planets to succumb to Ssi'ruuvi attack. The 2004 sourcebook Geonosis and the Outer Rim Worlds later mentioned Kammia briefly in its description of the planet Bakura, establishing both planets to be in the Shiritoku Spur region of Wild Space."}, {"tag": "p", "text": "The Star Wars: The Essential Atlas Online Companion, a supplement to the 2009 publication The Essential Atlas, includes in its database a \"Kammia system,\" located in Wild Space; there is no listing for the Drynn system, Kammia's star system, as originally established by The Truce at Bakura Sourcebook. However, according to The Essential Atlas co-author Jason Fry, the Online Companion's database listed star systems according to names of well-known celestial objects rather than proper system names, and that the database's listing is not intended to create new system names or override previously established continuity. Given Fry's declaration, this article treats the \"Kammia system\" as conjecturally synonymous to the Drynn system."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}