{"url": "Kanan_11", "categories": ["Category:Real-world articles", "Category:Star Wars: Kanan"], "nodes": [{"tag": "h1", "text": "Kanan 11"}, {"tag": "p", "text": "Kanan 11 is the eleventh, penultimate issue of the canon comic book series Star Wars: Kanan. The issue was written by Greg Weisman, illustrated by Pepe Larraz, and published on February 24, 2016 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The conclusion of Caleb Dume's first foray into the Clone Wars! The inevitable conflict with General Grievous! Star Wars adventure from the Republic to the Rebellion!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The present"}, {"tag": "p", "text": "On Kaller, stormtroopers have captured the Spectres members Ezra Bridger, Garazeb Orrelios, Hera Syndulla, Sabine Wren, and Chopper. The lead stormtrooper asks his commander via comlink whether to detain the prisoners or to execute them summarily. Kanan Jarrus remains in a coma while still experiencing flashbacks of his time on Mygeeto as Caleb Dume."}, {"tag": "h3", "text": "War on Mygeeto"}, {"tag": "p", "text": "While Caleb Dume mourns over the dead Clone trooper \"Stance\", the Kage Warrior remarks that the life of a clone barely qualifies as a kill. Caleb experiences the dark side in the form of a dark haze of anger and fear invading his mind. Caleb lunges at the Kage Warrior with his lightsaber but the enemy is armed with a flamethrower."}, {"tag": "p", "text": "Meanwhile, Master Depa Billaba parries with General Grievous, who taunts the Jedi Master about wanting to end her once and for all. Billaba kicks the Kaleesh cyborg down a shaft but he rises again and continues the attack. Master Billaba manages to cut off two of his mechanical hands. Clone Commander Grey calls for reinforcements at Mesa camp six but Clone Captain Styles says they have to help the Jedi General. The two blast B1-series battle droids with Grey vowing not to fail Billaba again."}, {"tag": "p", "text": "Giving into the dark side, Caleb parries with the Kage Warrior, dodging his fiery blast. However, Caleb decides not to let the dark side consume him and instead dives under the Kage Warrior, slicing off the cable connecting his flamethrower unit. Caleb offers the Kage mercy. The Kage Warrior identifies himself as Colonel Coburn Sear of Quarzite. Refusing to accept the mercy of \"tyrants\", he instead ignites himself with a torch. The burning Coburn hurls himself at Caleb, who is forced to cut him down in self defense."}, {"tag": "p", "text": "As the flames consume Colonel Sear's remains, Caleb reflects solemnly on his foes death, telling himself there is no glory in triumph. Caleb comes to grips with the first person that he killed and tells himself that he will be happy if this is the last life he took. Caleb is soon joined by Commander Grey and Captain Styles, who ask if he has seen Jedi General Billaba."}, {"tag": "p", "text": "They stumble upon Master Billaba fighting General Grievous, who is gaining the upper hand over her. The Clone officers manage to drive Grievous away with their blasters while Kanan attends to his wounded master. As they bury the dead, Master Billaba reassures Caleb and Styles that she has learned a long time ago to live with regret. As Caleb reflects on the loss of his first friend and the first life he took, he comes to grips with the harsh realities of war. Shortly later, they receive orders to head for Kaller."}, {"tag": "h3", "text": "Back to the present"}, {"tag": "p", "text": "As Kanan emerges from his coma, he hears the lead stormtrooper consulting with his superiors over whether to interrogate or execute the prisoners. Kanan uses the Force to shatter the glass of his bacta tank. Grabbing his lightsaber, Kanan strikes down the stormtroopers guarding his comrades. Zeb grumbles that Kanan took too long while Hera says she is glad that he is better. As Kanan helps Chopper to his feet, Kanan jokingly ask what they would do without him."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}