{"url": "Kanan_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Kanan"], "nodes": [{"tag": "h1", "text": "Kanan 3"}, {"tag": "p", "text": "Kanan 3 is the third issue of the canon comic book series Star Wars: Kanan. The issue was written by Greg Weisman, illustrated by Pepe Larraz, and published on June 10, 2015 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The Jedi Order is disbanded or dead! The Republic has fallen! Caleb Dume enters the dark times of the Galactic Empire!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Return to Kaller"}, {"tag": "p", "text": "Having flown straight into an ambush in the Coruscant system, Caleb Dume is forced to engage the Imperial Aggressive ReConnaissance-170 starfighters in a dogfight. Despite the Kasmiri taking heavy fire, Caleb destroys several of the Imperial fighters before escaping back into hyperspace."}, {"tag": "p", "text": "In hyperspace, a lost Caleb decides to plot a course back to Kaller and returns to Janus Kasmir's hangar bay. Caleb decides to face Kasmir, the man who helped him but whose ship he stole. Kasmir is furious and grabs Caleb around the neck. Caleb reassures him that he brought back his ship and pleads with the Kalleran not to call him \"kid.\" Kasmir responds that Caleb only returned because he had nowhere else to go."}, {"tag": "p", "text": "Kasmir wants Caleb to scurry out of his life but relents and offers to become his master. Caleb despises Kasmir as a criminal, causing Kasmir to lose his patience. He points a blaster pistol at the boy and orders him to scurry. Caleb runs away but realizes that Kasmir was right that he had nowhere else to go."}, {"tag": "h3", "text": "Mending bridges with Kasmir"}, {"tag": "p", "text": "After several cycles of living rough on the streets of Plateau City, Caleb crosses paths with Kasmir again. A local crime boss named Tápusk and his Rodian and human henchmen accost Kasmir with blasters. However, Caleb comes to Kasmir's rescue and cuts down one of the humans with his lightsaber, giving Kasmir enough time to knock the other human and Rodian henchmen unconscious. With the tables turned, Tápusk is forced to retreat."}, {"tag": "p", "text": "Kasmir brings Caleb back to the Kasmir and demands to know why Caleb saved him. Brushing off the incident with Tápusk, Kasmir claims that he was negotiating with the crime boss and says he could have doubled his fees. Having lost his potential crew, Kasmir enlists Caleb as his new crew member."}, {"tag": "p", "text": "At Kasmir's advice, Caleb cuts his Jedi braid and hides his lightsaber and holocron inside a chest. After Caleb dons his new clothes and a blaster, Kasmir tells him to drop his name since he is a fugitive. Since Caleb has not figured out a pseudonym, Kasmir refers to him as kid."}, {"tag": "h3", "text": "A botched heist"}, {"tag": "p", "text": "Later, Caleb and Kasmir sneak into a warehouse in another settlement to steal a shipment of IG-RM bodyguard and enforcer droids to sell on the black market. Caleb struggles with his new life as a thief. Before they can remove all of the droids, they are captured by several armed Kallerans led by Gamut Key. To save his own skin, Kasmir offers to strike a bargain with the corrupt Key by identifying his accomplice as the fugitive Padawan Caleb."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}