{"url": "Kanan_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Kanan"], "nodes": [{"tag": "h1", "text": "Kanan 2"}, {"tag": "p", "text": "Kanan 2 is the second issue of the canon comic book series Star Wars: Kanan. The issue was written by Greg Weisman, illustrated by Pepe Larraz, and published on May 6, 2015 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "His master betrayed and killed, young Caleb Dume is alone. When being a Jedi makes him a target, what can a Padawan do? Continuing the story of the birth of Star Wars Rebels' Kanan Jarrus!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Jedi Purge"}, {"tag": "p", "text": "On the Outer Rim world of Kaller, Caleb Dume is fiddling with his new holocron while Jedi Master Depa Billaba meditates. Caleb's Clone trooper \"friends\" Captain Styles and Commander Grey prepare to execute Order 66. Dume is touched by the meditating Billaba, who senses Jedi being killed throughout the galaxy by Clone troopers."}, {"tag": "p", "text": "Caleb and Depa rise just as the Clone troopers point their blasters at them. She tells Caleb to \"run\", a word that will haunt him for years to come. Caleb is too paralyzed by fear and shock to run. Grey responds that good soldiers follow orders while Style reiterates the order to execute Order 66. The clone troopers open fire but Billaba deflects them with her green lightsaber."}, {"tag": "p", "text": "A petrified Dume watches as his Clone \"friends\" \"Kaylon\" and \"Remo\" are struck down by deflected blaster bolts and Mixx is decapitated by Billaba's lightsaber. Billaba orders Caleb to run or fight but not to just stand. Heeding his master's instruction, Dume joins the fight and kills the Clone troopers \"Soot\" and \"Big-Mouth\" with his lightsaber. Dume is haunted by the fact that he shared a meiloorun fruit with the two men two days ago."}, {"tag": "p", "text": "Commander Grey order Captain Styles to widen the perimeter. When Styles asks about the crossfire, Grey asks whether he is more afraid of the Jedi or crossfire. Outnumbered and outgunned, Billaba tells Caleb to flee and adds that she will be right behind him. Reflecting on these memories, Caleb says that this is the first time his master lied. Styles orders his men to kill Caleb."}, {"tag": "p", "text": "A distracted Billaba tries to stop him but is gunned down. Caleb watches as Billaba falls to the ground. The Clone troopers then shoot several blaster bolts into her to make sure she is dead. Captain Styles then leads Rostu Squad in pursuit of the \"kid\". Caleb realizes that his master died to save him and flees into the forest. Caleb manages to evade Styles and Commander Grey dispatches the entire battalion after him. A bruised Caleb manages to hide under several leaves."}, {"tag": "h3", "text": "A fugitive"}, {"tag": "p", "text": "Later, Caleb travels to Plateau City. While boarding a speeder, he overhears a Kalleran and a Rodian talking about the Jedi \"betrayal\" and resulting purge. A Kalleran smells the unwashed Caleb but does not recognize him, instead asking if humans ever bathe. Caleb spends several days evading Clone trooper patrols and eking out a miserable existence on the city's streets with little food."}, {"tag": "p", "text": "An exhausted and despondent Caleb realizes that he has never been alone. Since the time he had been taken from his homeworld to the Jedi Temple, Caleb recalls that he only learned how to think, meditate and fight but not to survive. Caleb soon encounters a Kalleran criminal named Janus Kasmir, who recognizes him as the Padawan fugitive. Taking pity on the \"kid\", he gives Caleb a meiloorun fruit, which the boy gobbles up."}, {"tag": "p", "text": "When Caleb asks for a safe place to sleep, Kasmir allows him to rest in his ship, the Kasmiri. After washing, Kasmir allows Caleb to sleep on his spare bunk and gives him new clothes. Kasmir tells Caleb that to survive in the \"actual galaxy\", he needs to lie, cheat, and steal in order to survive. Just then, Caleb receives a signal from the Jedi emergency signal summoning him back to Coruscant."}, {"tag": "p", "text": "Believing that the Masters are rallying after the Clone's \"betrayal\", Caleb implores Kasmir to fly him back to the Jedi Temple. Kasmir refuses because he doesn't travel to the Core Worlds and dismisses Caleb as a liability. He tells him to finish eating and to leave. Frustrated with his place in an uncertain world, Caleb hurls the Meiloorun fruit against a crate while he grapples with Kasmir's \"advice.\""}, {"tag": "h3", "text": "Jumping into danger"}, {"tag": "p", "text": "When a Clone patrol led by Captain Styles searches the hangar, Kasmir claims that he is no friend of the Jedi and reminds the Clone Captain that he reprimanded him for being disrespectful to General Billaba, whose name he cannot remember. Before the Clones can search his ship, Caleb steals the Kasmiri and takes a hyperspace jump to Coruscant."}, {"tag": "p", "text": "During the tail end of the journey, he receives a hologram from Master Obi-Wan Kenobi warning that the Jedi Order and Republic have fallen to the Galactic Empire. He tells the surviving Jedi to trust in the Force and warns them not to return to the Jedi Temple and to avoid Coruscant. He tells them to be strong and that they will all be challenged. Kenobi urges the other Jedi to persevere and to believe that \"a new hope\" will emerge."}, {"tag": "p", "text": "Just as the message ends, the Kasmiri exits hyperspace above Coruscant. Caleb realizes that he has reached the exact place Master Kenobi warned him not to go. Due to a HoloNet alert reporting the theft of the Kasmiri, Caleb finds himself surrounded by a squadron of Aggressive ReConnaissance-170 starfighters who are in search of the stolen ship and Caleb. They order him to surrender or be destroyed."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Obi-Wan Kenobi's hologram message in the comic first appeared in Star Wars Rebels: Spark of Rebellion, the first episode of Star Wars Rebels Season One, which premiered on October 3, 2014."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}