{"url": "Kanan_4", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Kanan"], "nodes": [{"tag": "h1", "text": "Kanan 4"}, {"tag": "p", "text": "Kanan 4 is the fourth issue of the canon comic book series Star Wars: Kanan. The issue was written by Greg Weisman, illustrated by Pepe Larraz, and published on July 22, 2015 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "When being a Jedi makes him a target, what can a Padawan do? Betrayed by those he once called friends, young Caleb Dume learns to survive as a smuggler! Continuing the story of the secret origins of Star Wars Rebels' Kanan Jarrus!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The betrayal"}, {"tag": "p", "text": "To Caleb Dume's horror, Janus Kasmir betrays him to the now Governor Gamut Key. While Key initially doesn't recognize Dume, Tápusk recognizes him as the lightsaber–wielding youth who attacked him. Kasmir is still angry at Tápusk for exposing his operation. Since the Imperial bounty on a Jedi is worth five times the value of the stolen IG-RM bodyguard and enforcer droids, Key allows Kasmir to keep the \"liberated\" droids. He promises to divide the bounty and credit for capturing the \"traitor\"."}, {"tag": "p", "text": "Dume is held in a holding cell opposite a Wookiee and an Ortolan. Key contacts Commander Grey and Captain Styles via hologram. The two Clone commanding officers, who are at the Imperial garrison at Plateau City recognize Dume and respond that they will come within an hour to execute Dume for treason. Styles tells Dume that he is \"dead meat.\""}, {"tag": "h3", "text": "A change of heart and partnership"}, {"tag": "p", "text": "Key leaves a despondent Dume to make peace with his coming death. While Dume ponders on making peace with the Force and failing his late Master Depa Billaba, Kasmir breaks Dume out of his cell with one of his IG-RM droids. Dume follows his liberator and the two escape Governor Key's prison guards."}, {"tag": "p", "text": "Aboard the Kasmiri, Dume asks Kasmir if he did not betray him. Kasmir responds that he changed his mind because he was unwilling to let his rival Tápusk claim the reward. Kasmir suggests pulling this con on other Outer Rim worlds but Dume declines the idea. Despite his misgivings about Kasmir, he escapes Kalleran offworld with Kaller."}, {"tag": "p", "text": "The two head off into the Outer Rim. They sell the stolen droids and use the capital to finance Kasmir's next scheme. Dume forms a partnership with Kasmir, learning the tricks of being a thief and smuggler. For a time, he puts aside his Jedi training and any memory of his late Master. Caleb also becomes skilled with the blaster and the two get into fights with various underworld elements including several Gamorreans."}, {"tag": "p", "text": "Caleb and Kasmir's activities eventually draw the attention of Commander Grey and Captain Styles, who brutally interrogate a Gamorrean. The Gamorrean does not know where the two fugitives went but promises the Imperials that he will contact them if he does. Commander Grey is dismissive of the Gamorrean's promises and vows to remember his duty to the Empire. The two Clones track Caleb and Kasmir's movements, always a step behind."}, {"tag": "p", "text": "Kasmir eventually grows wary of having the Clone officers on their trail and toys with the idea of abandoning Caleb. Caleb counters that it works to Kasmir's advantage to always stay on the move given his choice of profession as a smuggler and thief. Kasmir laughs and remarks that the \"kid\" is learning. Caleb realizes that this is the moment that his so-called \"friend\" has become his friend."}, {"tag": "h3", "text": "Trade on Lahn"}, {"tag": "p", "text": "Caleb and Kasmir travel to the jungle and ocean world of Lahn to barter for stolen goods with another criminal named \"Mr Jondo.\" Since they have not stolen anything yet, Kasmir sends Caleb to confirm that their \"trading partner\" has what they came for. Dume soon discovers that Mr Jondo is the Devaronian Separatist General Kleeve, whom Caleb and his late master fought against during the Conquest of Kaller."}, {"tag": "p", "text": "Caleb is initially frightened and points his blaster at his old enemy. Kleeve recognizes Caleb and asks him how he likes his \"Republic\" now. Kleeve says that as a Separatist he fought for freedom but put his trust in a corrupt leadership. Caleb responds that Kleeve was that \"leadership.\" Kleeve asks Caleb to consider whether his Jedi Generals truly comprehended the cause that they were serving. He convinces Caleb to holster his weapon since they are no longer enemies."}, {"tag": "h3", "text": "Imperial entanglements"}, {"tag": "p", "text": "Caleb asks Kleeve if Kasmir knew who he was dealing with. Kleeve responds that he doubts that Kasmir knows who he is dealing with before telling Caleb that he has Kasmir's ship and asking if Kasmir has his spice. Caleb responds that Kasmir is getting it but realizes something is not right. Meanwhile, Commander Grey ambushes Kasmir at gunpoint, demanding to know where the Padawan is. Kasmir claims that he ditched Caleb on Kalleran but Grey does not believe him."}, {"tag": "p", "text": "Caleb watches this from below a rockface. Outgunned, Caleb decides to dive into the sea in order to save Kasmir; reasoning that if he does not show up, the Clones would have to believe Kalleran's story. However, Caleb also thinks that he is being cowardly by abandoning his friend. Caleb remembers that Kasmir had a second ship in case they ran into trouble. He heads to their pre-arranged rendezvous, reasoning this was why Kasmir was dealing with Kleeve."}, {"tag": "p", "text": "Caleb tells Kleeve he can still bring him Kasmir's spice. Kleeve doubts that Caleb can deliver on his promise because Kasmir has been imprisoned by the Empire. Caleb thinks that the Imperials will release Kasmir if he does not show up but Kleeve counters that they would still imprison Kasmir for theft and smuggling. Kleeve still refuses to give Caleb Kasmir's second ship given their past animosity. However, Caleb counters that the Clones want them both and says that the \"enemy of my enemy is my friend.\""}, {"tag": "p", "text": "Kleeve reluctantly takes Caleb to Kasmir's second ship, which is housed on Bay Seventeen of a maritime spaceport. Kleeve explains that the second ship is a shuttle originally called Farbrooke's Hope but that Kasmir was planning to rename her Kasmiri Two. Caleb says that he would just call the ship Escape. Caleb falls in love with the ship."}, {"tag": "p", "text": "He suddenly senses danger. While fumbling for the lightsaber he no longer holsters, Caleb is pistol-whipped in the head by Captain Styles, who tells him that they will now finish what they started. Kleeve is also taken captive by two more Clone troopers."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}