{"url": "Kanan_Jarrus%27_holocron", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Jedi holocrons"], "nodes": [{"tag": "h1", "text": "Kanan Jarrus' holocron"}, {"tag": "p", "text": "Kanan Jarrus's holocron is a holocron owned by the Jedi Kanan Jarrus. It originally belonged to Jedi Council member Master Depa Billaba, who later gave it to her apprentice, Caleb Dume, shortly after the Conquest of Kaller."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "After the battle of Kaller, nineteen years before the Battle of Yavin and during the last day of the Clone Wars, fourteen-year-old Padawan Caleb Dume received a Jedi holocron from his Jedi Master, Depa Billaba. He was to use it to \"study the role of questions\" and \"peaceful dissent\" in the Jedi Order."}, {"tag": "h3", "text": "Age of the Empire"}, {"tag": "p", "text": "After the fall of the Order, Dume, who survived Order 66, was forced to hide his Force-sensitivity but managed to retain both his holocron and lightsaber. He took the name \"Kanan Jarrus\" and downloaded into his holocron the final holographic recording of Master Obi-Wan Kenobi that he received through his Jedi comlink. The message, which Kenobi recorded when he recalibrated the Jedi recall signal at the Jedi Temple on Coruscant, served as a warning to all surviving Jedi, telling them about the rise of the Galactic Empire and the destruction of the Jedi Order. It also contained instructions not to return to the Jedi temple on Coruscant and to trust in the Force in those uncertain times. It also had a map to all the Jedi Temples across the galaxy and a holographic recording of a lightsaber training lesson by Anakin Skywalker."}, {"tag": "p", "text": "Fourteen years after the Order's fall, the holocron was discovered aboard the rebel ship Ghost by Ezra Bridger. The Lothal orphan sensed the holocron with the Force and stole it, which Jarrus knew; he and Hera Syndulla, the owner and pilot of the Ghost, wanted to see if Bridger could open it, as that required the powers of the Force. When he was captured by the Imperials, Bridger was able to open it with the Force and discovered the message from Kenobi. Later, once Jarrus realized Bridger's potential, the former Jedi offered Bridger the chance to become his apprentice, which Bridger accepted."}, {"tag": "p", "text": "After Bridger unknowingly tapped into the dark side of the Force to escape from the Grand Inquisitor on Fort Anaxes, Jarrus needed to know whether his Padawan was meant to become a Jedi. He thus consulted the galactic map inside the holocron for a Jedi Temple that Bridger could be tested at, discovering the most likely candidate right on Lothal. After the Spectres joined the rebellion, Jarrus stored a record labeled Holo Record 26714 in his holocron, which narrated the events they went through since Bridger came aboard their crew."}, {"tag": "p", "text": "In 3 BBY, following Jarrus' and Bridger's duel with the Inquisitors on Oosalon, Bridger and Ahsoka Tano then watched a recording of Tano's former master, Anakin Skywalker, demonstrating his adjustments on Form IV techniques. Following former Sith Lord Maul's capture of the Ghost's rebel crew, Bridger and Jarrus ordered by Maul to give him the Sith holocron as well as Jarrus' holocron. When Maul forced Captain Hera Syndulla to give a tour of the Ghost, he discovered the holocron in Jarrus' cabin. Maul then attempted to open it, but since he was not a Jedi, the holocron refused to yield to him."}, {"tag": "p", "text": "When Jarrus and Bridger met Maul at Vizsla Keep 09, Bridger was then taken to the command center. There, Maul gave Bridger Jarrus' holocron and Bridger gave Maul the Sith holocron. Ezra then opened Jarrus' holocron and then combined it with the Sith holocron. Maul and Bridger the looked into the holocrons and saw twin suns. There was then brief explosion that knocked everyone out and Maul left the station with knowledge that \"he\" still lives, the holocron however was damaged in the explosion."}, {"tag": "p", "text": "Though the two holocrons were damaged, fragments of their visions remained in the minds of Ezra and Maul. Seeking to discover Kenobi's location, Maul brought Ezra to Dathomir. There, Maul summoned the spirits of fallen Nightsisters and the two took part in a ritual to merge their minds. As a result of this ritual, both Maul and Ezra discovered that Kenobi was indeed alive and hiding on a planet with twin suns."}, {"tag": "p", "text": "Later, Maul used a fragment of the Malachor Sith holocron to activate Kanan's Jedi holocron, causing it to play back a recording of Kenobi's message to the Jedi during the Jedi Purge. Maul then projected a visage of himself onto the Sith holocron. This caused Ezra to believe that Kenobi was in danger from Maul. Using the two holocrons, Ezra and Chopper traveled to Tatooine where they managed to find Kenobi after an encounter with Tusken Raiders and enduring trials in the desert. Ultimately, Kenobi defeated and killed Maul. Ezra and Chopper then returned to Chopper Base."}, {"tag": "p", "text": "In 0 BBY, following the death of Jarrus, Hera placed a fragment of the holocron onto her family's kalikori to honor his memory."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}