{"url": "Kanan_Jarrus%27_lightsaber", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Kanan Jarrus' lightsaber"}, {"tag": "p", "text": "Kanan Jarrus' lightsaber was the personal two-piece lightsaber of Kanan Jarrus, a Padawan who survived the destruction of the Jedi Order and eventually served in the Rebellion against the Galactic Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The lightsaber built by Kanan Jarrus, then known as Caleb Dume, had a blade length adjustment control. After constructing the weapon, his Jedi Master, Depa Billaba, and droid Professor Huyang were curious about the characteristics of the saber, but contented themselves with accepting the Force's advice. During the reign of the Galactic Empire, Jarrus kept this lightsaber hidden. Rather than hang it on his belt by the belt ring, which would easily identify him as a Jedi, Jarrus stored it directly on his belt as two separate pieces, with the main body and grip of the hilt at the small of his back and the emitter shroud on his left side. Jarrus merely needed to insert the emitter section into the main body and twist to lock them together. The lightsaber also had a low-power setting to avoid injuring sparring partners during practice. In this setting, the blade had a different shade of blue, and the weapon vibrated at a slightly higher pitch."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When he was a Padawan, studying under the guidance of Jedi Master Depa Billaba, Jarrus—then known as Caleb Dume—built his own lightsaber. After the destruction of the Jedi Order, Dume escaped the death that befell most Jedi and went into hiding. At first, he hid it in a compartment aboard Janus Kasmir's ship, the Kasmiri. Dume then went under the assumed name of Kanan Jarrus. He kept his lightsaber hidden so he would not be identified as a Jedi and killed. He secretly carried it with him everywhere he went, including on the planet Gorse and its moon, Cynda, during the Gorse conflict."}, {"tag": "p", "text": "Fourteen years after the fall of the Jedi, the lightsaber was discovered hidden on the Ghost by Ezra Bridger, an orphan thief from Lothal who was taken in by Jarrus and the crew of the Ghost. During the crew's mission to rescue Wookiee slaves from the spice mines of Kessel, pinned down by a squad of stormtroopers Jarrus used his lightsaber and revealed himself as a Jedi to Agent Kallus of the Imperial Security Bureau. This surprised the Imperial who ordered his men to concentrate their fire on him, which Jarrus deflected, giving the crew and the Wookiees a chance to escape Kessel. This action drew the attention of the Jedi hunter known as the Grand Inquisitor."}, {"tag": "p", "text": "Jarrus later used his lightsaber to duel against the Inquisitor at the Spire on Stygeon Prime, using Form III."}, {"tag": "p", "text": "During their second confrontation on Fort Anaxes Jarrus was rendered unconscious, and despite Bridger's attempt to use it he was easily disarmed by the Inquisitor who used it in conjunction with his own to fend off a large Fyrnock summoned by the Padawan. Jarrus recovered it while escaping. After his capture Jarrus's lightsaber was confiscated by the Inquisitor."}, {"tag": "p", "text": "During what would prove to be their final clash the Inquisitor displayed Jarrus's weapon clipped to his belt as a trophy, forcing the Jedi to use his apprentice's, as the two fought Bridger used the Force to pull Jarrus's lightsaber to his hands and used it to fight against the Inquisitor. When Bridger was knocked away and was thought to be dead, Jarrus took back his lightsaber and was able to defeat the Inquisitor and escape with Bridger on the Jedi hunter's TIE Advanced v1."}, {"tag": "p", "text": "Jarrus continued to wield his lightsaber as part of the early rebellion, crossing blades with many opponents including Darth Vader, the Seventh Sister, the Fifth Brother, the Eighth Brother, former Sith Lord Maul and even his own apprentice when he was temporarily possessed by a Nightsister spirit until shortly before his death when it was knocked from his grasp by Rukh. The lightsaber was recovered shortly afterwards by Governor Arihnda Pryce, who presented it to Grand Admiral Thrawn as proof of the Jedi's death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}