{"url": "Kanan_9", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Kanan"], "nodes": [{"tag": "h1", "text": "Kanan 9"}, {"tag": "p", "text": "Kanan 9 is the ninth issue of the canon comic book series Star Wars: Kanan. The issue was written by Greg Weisman, illustrated by Pepe Larraz, and published on December 16, 2015 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Caleb Dume enters the Clone Wars for the first time! He and his new Master Billaba [sic] take command of a Clone troop…And face one of the most deadly Separatist generals...GRIEVOUS!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The present"}, {"tag": "p", "text": "On Kaller, Imperial stormtroopers surround the Plateau City medcenter where the Spectres are waiting with a wounded Kanan Jarrus. The Kalleran informant Tápusk advocates killing the rebels but the Stormtrooper Commander advises him to leave the safety of the Empire to professionals. Hera Syndulla and Ezra Bridger realize that they are trapped. Kanan remains unconscious in the bacta tank where he experiences flashbacks of his life as Caleb Dume."}, {"tag": "h3", "text": "Kanan's flashbacks"}, {"tag": "p", "text": "On Kardoa, a younger Caleb trains with Jedi Master Depa Billaba. Kardoa is Dume's first mission as Padawan to Master Billaba while this is Billaba's first mission since her coma. Later that night, Master Billaba and Caleb meets with Clone Commander Grey, Clone Captain Styles, Clone Sergeant Soot, and Clone Corporal Big-Mouth, the survivors of Billaba's last command. Greys tells Billaba not to blame herself for the failure of their last mission."}, {"tag": "p", "text": "Grey says that he has recruited three veterans in the form of Clone Lieutenant Remo and Corporals Mixx and Kaylon but that the rest of the unit are green recruits. Caleb shares a meiloorun fruit with Corporal Big-Mouth. When asked, Master Billaba tells the Clones that they are on a recon mission to investigate a Separatist presence on Kardoa. Unknown to them, they are being watched by a Separatist probe droid."}, {"tag": "p", "text": "The Separatist commander General Kleeve monitors the Clone troopers from afar. Colonel Coburn Sear responds that the Jedi Master must die. Kleeve warns Sear that his obsession with the Jedi Order is a distraction but Sear thinks that the Jedi are wrong. Kleeve does not think that Billaba is a serious threat since she is a failed commander. Kleeve recalls that Colonel Sear decimated Billaba's forces on Haruun Kal and almost killed her. Kleeve is unwilling to commit forces to battle on Kardoa since he is preoccupied with preparations for the conquest of Kaller. Colonel Sear convinces Kleeve to let him deal with the Jedi threat on Jardoa."}, {"tag": "p", "text": "At dawn, Dume is excited for his first combat operation. They are greeted by CT-1157, whom Billaba convinces to take off his helmet in order to build a rapport. CT-1157 informs Billaba and Dume that the battalion is ready for combat. The battalion is split into five squads led by Master Billaba, Grey, Styles, Remo, and Soot. The squads scan the canyon. Caleb accompanies Master Billaba and jokes with CT-1157 about Billaba keeping him on a short leash. He convinces CT-1157 to stop calling him a \"kid.\""}, {"tag": "p", "text": "Shortly later, the unit is ambushed by several B1-series battle droids, who block their escape path with debris. Master Billaba tells CT-1157 to call for reinforcements. Dume is exhilarated by combat and cuts down several battle droids, leading Billaba to describe him as reckless. With their communications jammed, Billaba tells Corporal Big Mouth and Caleb to keep the droids occupied while she seeks reinforcements."}, {"tag": "p", "text": "Colonel Sear observes the battle from afar. Unsure whether Billaba is retreating, he orders his battle droids to continue the assault on the Clones and Padawan while he departs on a speeder bike to deal with Billaba. CT-1157 warns Caleb that he is too far out front and tells him to pull back. Caleb ignores his warning but is shot down by a hail of blaster bolts. Before the droids can finish him off, CT-1157 guns them down and rescued Caleb."}, {"tag": "p", "text": "With the battle lost, Colonel Sear escapes aboard a Neimoidian shuttle. Master Billaba allows him to escape in order to convince the Separatists to abandon Kardoa. While Caleb recovers inside a bacta tank, CT-1157 is awarded a commendation for valor and given the name \"Stance.\" Billaba's battalion is reassigned to Mygeeto. On Mygeeto, Colonel Sear informs General Grievous that the Jedi survived. The cyborg general vows to deal with Billaba again."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}