{"url": "Kanina_Nico", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cadets of the Galactic Empire", "Category:Females", "Category:Humans", "Category:Imperial defectors", "Category:Imperial Navy pilots of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Kanina Nico"}, {"tag": "p", "text": "Kanina Nico, designated cadet 803-308, was a human female who served as a cadet for the Galactic Empire at Carida Academy, the Imperial Naval Academy on the planet Carida, alongside Han Solo. Nico had a severe personality and disliked most of her fellow cadets, one example being cadet 404-913."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Nico came from a planet in the Huru system. There, she had a friend, Weegee who worked in mining Farium. Nico attended the Imperial Academy on Carida as one of its cadets. She took part in training along side fellow cadets Han Solo, Lyttan Dree, his brother Tamu, and Beilert Valance under their training officer, Sergeant Triosa Broog. Despite her dislike of Solo, she defended him against Valance."}, {"tag": "p", "text": "Nico became one of the best cadets at the Academy. She also wondered how long Solo could keep himself alive. During one of their exercises, Nico noticed Solo removed his TIE's alternator just as she did. She also noticed a pair of dice painted on Solo's TIE and wished him luck. During the exercise, Nico saved Solo from crashing after he saved Tamu. Despite working together, Nico and her fellow cadets were suspended."}, {"tag": "p", "text": "Nico and her fellow cadets were punished and forced to make soup. Despite this punishment, they were given the task of transporting Valance and several other pilots aboard the Imperial Cruiser 07200823. Nico elected herself as captain. After dropping Valance and the other pilots in deep space, Nico had cruiser return to Carida. However, Solo was able to increase the engine's efficiency in order be back at the academy a day early. Solo also gave Nico and the other cadets day passes and told them that there was a Pantolomin cruiser nearby. Despite her reservations, Nico allowed themeselves to board the pleasure cruiser. There, she played a game of Sabacc with Solo. During the game, Solo told Nico how he planned all this by doing extra duty at the academy at night. She also know Solo was there to speak with the cruiser's bartender, Pjolan about Qi'ra ."}, {"tag": "p", "text": "When Pjolan tried to kill Solo, Nico threw a glass at him and the two met up with the other cadets. However, Solo alerted the cruiser's security, who worked for Black Sun about Pjolan's plan to collect Proxima's bounty on Solo and Pjolan was arrested. Nico and the cadets returned to the cruiser. During the cruiser's voyage, Nico wrote a incident report. Despite her report, Nico and the other cadets were reinstated to full flight status. and sent to Qhulosk. There, they were stationed at the Imperial Navy Mobile Base outside of Howlan. Nico thought Solo was planning to take a TIE to find Qi'ra on Corellia. However, she was wrong and just wanted more of Solo's luck. Nico and the rest of the squadron then flew their TIEs to attack Howlan. Together, they took out the cannons defending the city. Unfortunately, Valance was shot down by the Qhuloskians' fighters and the squadron was forced to fall back to the base. Despite Instructor Yurib Nakan's orders to stay at the base, Nico and the squad decided to help Solo in rescuing Valance by using speeders."}, {"tag": "p", "text": "Together, they went into Howlan. As they rode into the city, Kanina saved Solo from debris from the Empire's bombers' attacks. After they hid their bikes, Nico and the squadron found Valance and loaded him onto a speeder. Unfortunately, they ran into more of the Qhuloskians' forces. Solo attempted to reason with the Qhuloskians. However, they came under attack by Ghulars under Rito. Upon hearing of the Empire taking farium from Qhulosk, Nico realized that the Empire would do the same to her planet. Despite her loyalty to her squadron, Nico was convinced by Solo to desert the Empire, return home and find Weegee. After Solo shot her helmet, he asked Nico to find Qi'ra if she made her way to Corellia. The squad then agreed to fake her death. Nico then left aboard a escape pod before the Empire resumed their attack on Howlan. Nico eventually found her way home and Weegee."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kanina Nico first appeared in the 2018 Marvel comic Han Solo - Imperial Cadet 1 by Robbie Thompson."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}