{"url": "Kanna_Deltic", "categories": ["Category:Canon articles", "Category:Wookieepedia Featured articles", "Category:Females", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Scientists"], "nodes": [{"tag": "h1", "text": "Kanna Deltic"}, {"tag": "p", "text": "Kanna Deltic, nicknamed Lieutenant Strangechild by her crewmate Commander Nibiru Chamas, was a human lieutenant in the Imperial Navy and the planetary science specialist of the Imperial Star Destroyer Ultimatum during its mission to the Gorse system in 11 BBY. She provided a report for the industrialist Count Denetrius Vidian and Captain Rae Sloane on the possibility of destroying the moon Cynda using explosives, causing Vidian to set in motion such a plan to more efficiently harvest the mineral thorilide."}, {"tag": "p", "text": "Deltic later accompanied Sloane and the Ultimatum to Calcoraan Depot to help collect the explosive Baradium-357 for use in destroying Cynda. However, a group of rebels led by Kanan Jarrus and Hera Syndulla ultimately foiled Vidian's plan to destroy the moon, and the count was revealed to be a traitor to the Empire. Nevertheless, Deltic greatly enjoyed working on the failed plan to destroy Cynda, joining a betting pool as to how much damage it would cause to the surface of the planet Gorse."}, {"tag": "p", "text": "Years later, Deltic and Sloane traveled together on a multi-week inspection tour of new shuttle technology, but in 3 ABY were called back to the Ultimatum to take part in the search for the Millennium Falcon, a rebel vessel hiding in the Hoth asteroid belt. The pair traveled in the Lambda-class T-4a shuttle Bastinade, but became lost in the asteroid field while trying to locate the Star Destroyer."}, {"tag": "p", "text": "After eventually learning that the Ultimatum had been destroyed in an asteroid collision, Sloane spotted a cluster of mynock corpses, which the pair then began collecting. They eventually managed to reach the Executor-class Star Dreadnought Executor, where Sloane and Deltic explained to the Sith Lord Darth Vader and Admiral Firmus Piett that the dead mynocks showed that there were exogorths present in the asteroid belt, and used a mynock killed by a blaster to show that the Falcon was likely taking refuge inside an exogorth."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Predicting destruction"}, {"tag": "p", "text": "The human female Lieutenant Kanna Deltic served in the Imperial Navy as the planetary science specialist aboard the Imperial-class Star Destroyer Ultimatum during its mission to the Gorse system in 11 BBY. Commanded by Captain Rae Sloane, the ship and its crew were tasked with aiding industrialist Count Denetrius Vidian, who had been sent to the system to improve the efficiency of thorilide mining on Cynda, a moon of the planet Gorse. After demolitionist Skelly gave Vidian a report outlining the dangers of using explosives to mine on Cynda, Vidian had Deltic run projections based on Skelly's claims that too much explosive mining would destroy the moon."}, {"tag": "p", "text": "Deltic found that Skelly had been partially correct, as Cynda could be destroyed by explosives, but such a blast would need a higher quality and greater quantity of explosives than Gorse had in all its supplies combined. She confirmed for the count that after the moon's fragmentation, large quantities of thorilide would remain in the system and so could be harvested, although she warned that some of the mineral would be ejected from the system entirely and some would end up on the surface of Gorse. Vidian was uninterested in the fate of those on Gorse's surface, but Sloane demanded to know what Deltic's findings predicted would happen. The lieutenant explained that parts of the moon would fall as meteors, with the amount depending on where Cynda was at in its lunar cycle when destroyed."}, {"tag": "p", "text": "She then speculated that the meteors would cause catastrophic seismic activity on the planet and potentially cause it to start spinning again, since it was held stationary by Cynda's presence in its orbit. Deltic suggested that the destruction of Cynda might make no changes to Gorse at all or possibly destroy the planet's entire biome in the next ten years. Deltic also warned of the possibility that Cynda's destruction would cause the breakdown of large amounts of the thorilide located there, which would prevent them from harvesting it, and suggested that a test should be carried out to make sure the moon was not being destroyed for nothing."}, {"tag": "h3", "text": "Cynda saved"}, {"tag": "p", "text": "Vidian elected to destroy Cynda based on Deltic's report. After a test proved that the thorilide would not break down following the moon's destruction, he ordered a fleet of mining vessels be sent from Gorse to his space station, Calcoraan Depot, where they were to collect the explosive isotope Baradium-357, which was strong enough to destroy Cynda in the quantities Vidian possessed. Aboard the Ultimatum, Deltic joined several other members of the Planetary Sciences department in a betting ring concerning how much damage the destruction of Cynda would cause on Gorse. She made a wager that the World Window Plaza building would be destroyed by debris within a year of Cynda's fragmentation. When the Ultimatum also traveled to the Calcoraan system, where the depot was located, Sloane brought Deltic with her to the station to explain the process Vidian was carrying out, starting with how the vessel Forager functioned, as the count planned on using it to harvest the thorilide left in the Gorse system."}, {"tag": "p", "text": "Vidian managed to get the explosives back to the Gorse system, but his plan to destroy Cynda was ultimately foiled by a group of rebels consisting of Skelly, the novice Jedi Kanan Jarrus, the pilot Hera Syndulla, and the Sullustan Zaluna Myder. Sloane and her crew ended up turning on Vidian when they discovered that he had planned to betray the Empire. For her role in Vidian's downfall, Sloane was honored at a ceremony on Gorse and awarded a permanent posting as captain of the Ultimatum. Deltic and other members of the Star Destroyer's crew attended the ceremony but were then sent back to the ship while Sloane attended a celebratory party."}, {"tag": "h3", "text": "Adventures with Sloane"}, {"tag": "p", "text": "Deltic and Sloane participated in an industrial support mission to an asteroid field near Taris, where they encountered an exogorth and learned that when the creature opened its maw, mynocks that lived inside its gullet were expelled and died due to the lack of atmosphere in space. She later accompanied Sloane, now a commodore, as her only companion on a weeks long inspection tour of new shuttle technology, leaving the Ultimatum while still owing credits to Ensign Cauley, one of her crewmates. Several weeks into the tour in 3 ABY, Sloane was at the Fondor Shipyards discussing upgrades to her Lambda-class T-4a shuttle Bastinade when the commodore received a message from Admiral Firmus Piett, ordering her to return to command aboard the Ultimatum, which was hunting the Millennium Falcon, a rebel vessel that had hidden  amongst the Hoth asteroid belt following the Battle of Hoth."}, {"tag": "p", "text": "Sloane and Deltic flew aboard the Bastinade on their return journey, but were unable to locate the Star Destroyer amongst the asteroids. The shuttle's transmitter became damaged by the debris, preventing them from sending out a clear transmission and the scanners also became fouled up. Several hours after the Bastinade had entered the asteroid field, Deltic returned to the shuttle's cockpit after attempting to reroute the power feed to fix the transmitter with a hydrospanner, despite the fact that Sloane had already previously attempted a reroute. After Sloane reported that the transmitter was still not functioning, the lieutenant clambered under the starboard console, but soon began complaining about the onboard computer system. Sloane cut the lieutenant off and commanded her to switch off the computer system so that she could fly the ship in manual. Deltic initially argued against the dangerous plan, but Sloane had her switch on the near-range scanner so she could detect rocks and then began to fly."}, {"tag": "h3", "text": "Lost amongst the asteroids"}, {"tag": "p", "text": "Hours later, the pair had still failed to locate the Ultimatum, but spotted a group of TIE/sa bombers bombarding an asteroid. Sloane had Deltic try to signal them, but an asteroid struck the Bastinade's sublight engines and halved its traveling speed. With the transmitter still not working, Deltic and Sloane were only able to listen into the bomber's transmissions, and learned that the Ultimatum had been destroyed in an asteroid collision. After several moments of silence, Deltic made a quip about not needing to pay back credits she owed to Ensign Cauley, but Sloane silenced her and pointed out a cluster of unusual objects on the near range scanner."}, {"tag": "p", "text": "Deltic examined the monitor and assumed the system was malfunctioning when it identified them as organic, but upon approach in the ship they discovered the objects to be a trail of mynock corpses. Recognizing what they were seeing from their encounter with the exogorth near Taris, Sloane realized that the presence of an exogorth meant that some of the Hoth asteroid belt's asteroids would contain tunnels that were too deep for scanners to penetrate, explaining why the Empire had been unable to find the Falcon."}, {"tag": "p", "text": "Using the forward cargo collector mounted under the Bastinade's cockpit, the pair brought one of the corpses onboard, but were then struck by another asteroid. Sloane executed an emergency separation of the cockpit from the rest of the shuttle and began piloting it so that they could reach the squadron and inform them of their discovery. Moving at only a crawl, Deltic and Sloane collected and froze further mynocks and indexed the nearest asteroids to find which ones contained exogorths, hoping to identify where the mynocks had come from. Amongst the mynocks they collected, Sloane noticed one that she suspected had been killed by a blaster."}, {"tag": "h3", "text": "Saving Sloane"}, {"tag": "p", "text": "Deltic and Sloane eventually reached the Imperial fleet, landing aboard the Executor-class Star Dreadnought Executor rather than the wreck of the Ultimatum. Sloane was taken captive and brought to the chambers of the Sith Lord Darth Vader to explain her slow return to him and Piett. While Sloane was interviewed, Deltic searched through the mynocks they had collected and found the one killed by the blaster, which she nicknamed Smiley. Deltic then used the Executor's forensic analysis tools to confirm that the mynock had indeed been killed by a medium-weight blaster pistol."}, {"tag": "p", "text": "After hearing Sloane speak about the mynocks in her interview, Vader sent an order to his guards to unseal his chamber door and send for Deltic. Covering Smiley's corpse with a tarp, the lieutenant brought it into the Sith Lord's chambers on top of a hovercart moments later. Piett, who was unaware Deltic had been summoned, questioned how she had entered the sealed door, but after explaining that Vader had sent for her she revealed the mynock, which she and Sloane then tipped onto the floor. After the pair explained their discovery, Sloane nodded to Deltic in thanks, then dismissed her; however, before leaving, Deltic asked about Darth Vader's meditation chamber, but left after being promptly dismissed again by both Sloane and Piett. Vader, who had been inside the meditation chamber, then ordered Sloane to report to Kuat Drive Yards to take command of the Star Destroyer Vigilance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Deltic was a fairly callous individual, caring little for the damage and suffering that Denetrius Vidian's plans for Cynda would cause among the population of Gorse. She was greatly excited by the report she put together for Vidian on the destruction of Cynda and grinned as she delivered it to him and Captain Rae Sloane, chuckling when revealing the damage that would be done to Gorse. When speculating on the amount of damage on the planet, Deltic postulated that it might be worth destroying the moon just to see what would happen, as she was unsure of the exact effects. She later suggested tests should be made to ensure that the thorilide would be harvestable after Cynda's destruction, otherwise Vidian's plan would lead to a \"waste of a good moon.\""}, {"tag": "p", "text": "Deltic took part in a betting ring concerning the damage that Cynda's destruction would wreak on Gorse, planning to spend her winnings on shore leave to the planet Alderaan if she won. When Sloane brought Deltic to Calcoraan Depot, the lieutenant was deeply impressed by the starship Forager and explained how it worked to Sloane in great detail, though she used informal terms in an unprofessional manner, such as \"goodies\" when referring to thorilide particles. Deltic deeply annoyed Sloane, who wanted to dismiss the lieutenant out of an airlock after she revealed her part in the betting ring. Sloane was glad Deltic was sent home after her award ceremony, as she was worried that Deltic might cause her embarrassment. Commander Nibiru Chamas, who also served on the Ultimatum, referred to Deltic as \"Lieutenant Strangechild.\""}, {"tag": "p", "text": "By 3 ABY, Sloane considered Deltic to be the most able scientist aboard the Ultimatum, but also her least favourite person. Seeing her as peculiar and precocious, the commodore believed that the lieutenant had always been overly familiar and Deltic often made jokes when speaking with her superior. These included comparing the Hoth asteroid belt to the \"Alderaan Welcome Center\" and complaining that Vidian had been reincarnated as the problematic computer system of the Bastinade, despite the fact that she did not believe in reincarnation. After learning that the Ultimatum had been destroyed, Deltic sat in silence for several moments, her eyes wide and her mouth moving as though she were calculating something, before eventually guessing that she would not have to repay Cauley as she assumed he was dead."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kanna Deltic first appeared in the novel A New Dawn, which was written by John Jackson Miller and released in 2014. Miller noted that Deltic's line, \"It's almost worth doing just to see what would happen,\" was a close runner-up for his favorite line of dialogue in the entire novel. The character's first name was revealed in Miller's short story \"Lord Vader Will See You Now\", which was published in 2020 as part of the From a Certain Point of View: The Empire Strikes Back anthology."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}