{"url": "Kanz_sector", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems sectors", "Category:Galactic Empire sectors", "Category:Galactic Republic sectors", "Category:Kanz sector", "Category:Outer Rim Territories sectors"], "nodes": [{"tag": "h1", "text": "Kanz sector"}, {"tag": "p", "text": "The Kanz sector, also known as the Argazdan Redoubt, was a sector located in the Outer Rim Territories region of the galaxy. It was home to both the Lorrdian and Argazdan species from Lorrd and Argazda respectively."}, {"tag": "p", "text": "During the Mandalorian Wars in 3970 BBY, the Argazdan Myrialites under Provisional Governor Myrial of Argazda seceeded from the Republic and established the Argazdan Redoubt as an independent state. Myrialite forces invaded planets that resisted her reign over the Kanz sector including Lorrd during the \"Kanz Disorders\". Due to their support for the Amaltannan resistance, Myrial had the Lorrdians enslaved."}, {"tag": "p", "text": "For three centuries, the Myrialites ruled the Kanz sector. Any attempt by the Republic and the Jedi Order to intervene was cut short by the various conflicts of the Old Sith Wars and the resurgent threat of the Sith Empire during the Great Galactic War. The Lorrdian captives, forbidden by their masters from speaking aloud, developed a form of nonverbal communication that remained in use afterwards."}, {"tag": "p", "text": "In 3670 BBY, a Jedi and Republic task force under Jedi Master Mari-Elan Nora intervened and defeated the Argazdan slave lords after dogged fighting. However, by then, more than 5 billion had been killed including 500 million Lorrdians. During the Clone Wars, the Kanz sector was represented in the Galactic Senate by Nee Alavar.By the time of the Galactic Civil War, most contemporary Lorrdians and Argazdans got on well since most Argazdans regarded the actions of the Myrialites as shameful."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Human inhabitants of the planet Argazda sought to join the Galactic Republic around the year 4200 BBY to protect themselves from the Ereesi species' slavers. and the area was admitted by the Galactic Senate as the Kanz sector, partly due to the population's origins from a lost colonization attempt of the Core Worlds."}, {"tag": "p", "text": "The Republic repulsed the Ereesi until Argazda was ready for self-defense, but the conservative Argazdan population found Republic culture immoral and offensive. Circa 3970 BBY, Provisional Governor Myrial declared the Kanz sector independent, renaming it the Argazdan Redoubt. Those loyal to the Republic were killed in mass executions, while an Argazdan battle fleet annihilated all life on Ereesus. The revolution did not trigger a Republic response due to it being preoccupied with the Mandalorian Wars, which allowed the Myrialites to retain power for three centuries, bombing worlds and slaying entire populations. Until the toppling of the regime by the reformed Jedi Order in 3670 BBY, the loss of lives exceeded five billion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}