{"url": "Kaox_Krul", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Dark Lords of the Sith of the New Sith Wars", "Category:Humans", "Category:Males", "Category:Members of the Brotherhood of Darkness", "Category:Sith Masters"], "nodes": [{"tag": "h1", "text": "Kaox Krul"}, {"tag": "p", "text": "Kaox Krul, also known as The Marauder, The Dark Killer, and The Madman, was a Sith Lord and warlord of the New Sith Empire. He was a formidable warrior within the Brotherhood of Darkness and targeted as a threat by the Jedi near the end of the New Sith Wars. Krul was an avid supporter of Lord Kaan and had developed a mental link with the leader of the Brotherhood of Darkness, so that he could be summoned at great distances."}, {"tag": "p", "text": "As Krul fought with the Brotherhood, he became known for his brutality, hating the Jedi with a dark side-fueled passion. As the war pushed on, he was targeted for assassination by the Jedi Council, and the Jedi Crian Maru was assigned to hunt him down. In 1000 BBY, he was responsible for the destruction of the Duros colony on Harpori. Later that year, just before the Ruusan campaign, he was finally tracked down by Crian Maru and was subsequently killed during a Duel on Balowa."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Kaox Krul was a devoted disciple of Lord Kaan, but his days before joining the Brotherhood of Darkness are largely unknown. Krul resented the Jedi for their devotion to peace and tranquility and believed them to be liars to their own true nature. Eventually, due to his talent in the Force, Krul was recruited by the Brotherhood to fight in the New Sith Wars."}, {"tag": "p", "text": "As a member of the lower echelons of the Brotherhood army, Krul fought in numerous conflicts, using his abilities in the Force and whatever weapons he could get his hands on. A mammoth of a man, Krul was an imposing figure on the battlefield, both very tall and heavily built. He was very formidable, and frightening to behold when angered, which aided him in exploiting his enemies' fears to obtain victory. Eventually, Krul found himself in personal combat with an unknown Jedi. Krul's talent in the dark side allowed him to kill the Jedi, and he ripped the Jedi's lightsaber from his still-warm fingers, claiming it for his own. Krul replaced the weapon's lightsaber crystal with a synth-crystal that created a red blade."}, {"tag": "h3", "text": "The Marauder"}, {"tag": "p", "text": "Equipped with his lightsaber, Krul began to make a name for himself on the battlefield. To remove what he called the Jedi taint of his acquired weapon, Krul began to slaughter members of the Army of Light with an unbridled ferocity. Krul's dark side fury during battle eventually caused him to be dubbed The Marauder. In campaigns during the New Sith War, Krul racked up more than a hundred kills with his lightsaber, causing the Jedi army to take special note of his formidable power."}, {"tag": "p", "text": "Elevating himself from a simple Sith warrior to a Sith Lord, Krul created a specialized suit of Sith armor. Protective padding and composite plates adorned with Sith symbols made up the armor, and they were arranged in a specific pattern of Krul's design. As a final addition to the suit's power, Krul used Sith alchemy to imbue the armor with dark side energy, providing \"some protection from the abilities of the Jedi.\""}, {"tag": "p", "text": "Krul found a worthy foe in the Jedi Karist Dem, and he grew to despise the Jedi over the course of the war. However, Krul's faith in the dark side proved successful, and he eventually overcame his rival on the battlefield. Krul slaughtered the Jedi warrior, as he was not known for his ability to turn opponents to the dark side. In fact, he had never been successful in turning one of his Jedi opponents away from the light side all the way up to his final battle."}, {"tag": "p", "text": "Krul's legend continued to grow when he personally killed the Wookiee diplomat Rojarra and led a team in slaughtering an innocent encampment of Duros on the planet Harpori, incidents about which he would later brag to himself."}, {"tag": "h3", "text": "The hunt"}, {"tag": "p", "text": "Krul's reputation as a fearsome Sith warrior eventually led to the Army of Light assigning a Jedi to personally track him down and neutralize him. For this important task, a prestigious teacher at the Jedi Temple, Crian Maru, was assigned with bringing the violent warrior to justice. Along with her Padawan, Dree Vandap, Maru tracked the darksider in her ship, the Golden Song. For over a month Krul continued to wage campaigns of terror on Galactic Republic worlds, staying one step ahead of the Jedi Knight."}, {"tag": "p", "text": "Krul could sense Maru tracking him, however, and planned an ambush in the Balowa system. At the time of Krul's planned ambush, Kaan was summoning the Brotherhood to Ruusan to prepare for their final conflict with the Army of Light; an order Krul ignored for the time being in order to eliminate his prey. As the Jedi freighter entered the system, Krul sneaked up behind the much slower ship in his sleek Sith fighter and prepared to open fire. Using the dark side to ensure that his aim was correct, Krul prepared to destroy his perpetual stalker. Unfortunately for Krul's planned attack, the Jedi sensed the maneuver and dodged the laser fire. However, some of Krul's lasers crippled the ship, and it began to spiral towards an uncharted jungle world. Yet Krul had planned to fly through the debris of the ship, and with the ship still somewhat intact, Krul's fighter collided with the large Jedi freighter, smashing the nose of his ship and disabling his own sensor array."}, {"tag": "p", "text": "Krul steered his damaged craft to the planet's floor as he watched the Jedi freighter crash into the jungle forest. Climbing out of his ship, Krul made his way to the crash point to eliminate the Jedi. From a tree above the crashed freighter, Krul watched as Dree Vandap climbed from the damaged ship. Jumping from the tree, Krul prepared to add another kill to his tally, but he was surprised when Dree countered his attacks. Before he could further duel the young Padawan, however, her master sped to the rescue on a speeder bike, knocking Krul to the ground and rescuing her apprentice."}, {"tag": "p", "text": "As the two Jedi sped away from the Sith Lord, Krul became infuriated and took up an unrelenting chase of the speeder bike. Using the Force to increase his speed Krul came within meters of the fleeing Jedi. Fearing he would be unable to keep up the pace, Krul swung his lightsaber at the speeder, cutting its main power cable. Unfortunately, the swing threw the Sith off-balance, and at his high speed, Krul tumbled to the jungle floor knocking himself unconscious. The severed power cable ensured that the speeder bike would eventually shut down, but the injury allowed the Jedi to move a great distance from their pursuer."}, {"tag": "h3", "text": "Duel"}, {"tag": "p", "text": "Krul regained consciousness to find the Jedi long gone; however, he resolved to hunt down and kill the Jedi pair. Tracking the group for two days, Krul eventually came upon the Jedi's disabled speeder and continued to track the Jedi through the jungle. Opening himself to the dark side, Krul sensed the Jedi hiding in a small cave and he made his way to the revealed location. When the Sith Lord arrived he saw that Crian was waiting for him near the lip of a deep jungle pool. The Marauder rushed to attack the waiting Jedi, and after a brief exchange of words, brought his lightsaber to bear against hers."}, {"tag": "p", "text": "As Krul and Maru dueled, Maru's Padawan appeared from the cave to make the fight two on one. Summoning the deeper reserves of his strength, he could block the strikes of his two opponents, but was unable to launch a meaningful attack at either. As the duel continued, Krul momentarily switched to a one-handed grip and Force pushed Maru into the lake before jumping behind her Rodian Padawan. Just barely keeping her off balance, Krul stabbed the Jedi from behind, killing her instantly. As Maru rose from the pool, she sensed the death of her Padawan, throwing her into a murderous rage."}, {"tag": "p", "text": "The duel continued for hours with neither opponent being able to get the upper hand. As both duelists tapped into the power of the dark side, the intensity of the battle burned the landscape around the jungle clearing. Krul's armor began to fall apart under the ferocity of Maru's attacks, and in an effort to gain a brief pause from the battle, Krul began to levitate himself over the jungle pool. Maru would not let Krul pause the fight and she jumped at her opponent. The two continued to fight as they levitated themselves above the water. In a last ditch effort to stop the furious Jedi, Krul asked her to join the Brotherhood, but the Jedi would not stop her assault. Krul managed to bring his lightsaber into Maru's chest just as the Jedi buried her blade in Krul's belly. Dying simultaneously, the two opponents plunged into the water."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Following the deaths of the three warriors, the Jedi Knight Salen Toth arrived on the planet to answer the distress signal of the Golden Song. Arriving at the jungle pool, he found the dead body of Dree Vandap but was unable to locate Krul or Maru's bodies. Gathering the dead Padawan's remains he left the area, sensing the darkness of the pool. Due to the dark side induced deaths of Maru and Krul, the pool became a Dark side nexus."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kaox Krul was a man driven by hatred. He was devoted to the dark side of the Force, and despised his opponents in the Army of Light with a rage fueled by the dark side. Although he followed the will of the dark side, he was equally devoted to his Dark Lord, Kaan. However, he had a mindset concentrated on murder and mayhem and the feelings were enough to override requests from his master."}, {"tag": "p", "text": "During his hunt for Maru and her Padawan, Krul demonstrated his proficiency in performing difficult Force techniques. His single-minded aggression allowed him to increase his speed tenfold and even levitate. Krul's mind was concerned with battle and warfare, and he found little time to dwell on much else. He was also not a complicated man, and unlike other darksiders, he did not delight in lording his abilities over beaten adversaries. One of Krul's regrets over his career was his seeming inability to turn his opponents in the Army of Light away from the light side and towards service of the dark. Krul finally succeeded in turning his opponent during his final battle with Crian Maru, but ironically, he died as a result."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kaox Krul was created by Bill Slavicsek for use in the short story, Darkness Shared, in Star Wars Gamer 5. The story gave small glimpses on his background, but his story ended when he was killed at the end of the story. Krul had one further mention in 2005's The New Essential Chronology. The book stated that Krul was a Sith Lord in the Brotherhood of Darkness during the New Sith Wars, but did not give any further explanation of his history."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}