{"url": "Kapp_Dendo", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Alliance Army personnel", "Category:Devaronians", "Category:Males", "Category:New Republic Army generals", "Category:New Republic Intelligence personnel"], "nodes": [{"tag": "h1", "text": "Kapp Dendo"}, {"tag": "p", "text": "Kapp Dendo was a male Devaronian who served as one of the Alliance to Restore the Republic's most respected intelligence agents during the Galactic Civil War. Dendo was often teamed with another agent, named Winter, whose holographic memory and analytical skills complemented Dendo's ability to blend into the underworld."}, {"tag": "p", "text": "The two worked together alongside Rogue Squadron on Tatooine after the Battle of Endor, securing an Imperial weapons cache from a criminal named Firith Olan. After that mission, Dendo was given control of his own elite squad, Commando Team One. The team was placed undercover on Brentaal IV in the months that followed, and alongside several members of Rogue Squadron, Dendo was able to sabotage an Imperial defense platform in the wake of a New Republic invasion."}, {"tag": "p", "text": "Later, he worked in conjunction with the Rogues on Ciutric IV, retrieving former Imperial Grand Vizier Sate Pestage from Empress Ysanne Isard's soldiers. The mission went awry, however, after Admiral Delak Krennel and an Interdictor Cruiser were sent to Ciutric by the Imperial Ruling Council, preventing the New Republic operatives from escaping. Dendo and the Rogues lost several personnel, while Pestage was killed by Krennel after refusing to leave the planet with Commando Team One. Dendo later became a colonel, and continued to serve through the Thrawn campaign, when Grand Admiral Thrawn launched a major offensive on New Republic territory. After Thrawn's demise, he participated in the campaign against Imperial warlord Delak Krennel, fighting in the battles of Liinade III and Ciutric IV. He was later appointed a general, serving in the Yuuzhan Vong War at the Battle of Ithor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Intelligence agent"}, {"tag": "p", "text": "A Devaronian male from Devaron, Kapp Dendo joined the Alliance to Restore the Republic sometime during the Galactic Civil War, becoming an Intelligence agent alongside Winter, Leia Organa's personal assistant. The two worked in conjunction on many missions after the Battle of Endor, and Dendo's tactical prowess and intelligence proved him a capable operative. Dendo had a particular talent for recruiting up-and-coming soldiers in the Rebellion to Intelligence, using his wit and charisma to persuade them to join him. He became one of the Alliance's most famous operatives, though he preferred anonymity, blending in with the underground to strike from the shadows. When the Rebel Alliance became the New Republic, Dendo was still one of its foremost agents."}, {"tag": "h3", "text": "Tatooine"}, {"tag": "p", "text": "Six months after the Battle of Endor, Dendo and Winter were dispatched to Tatooine to steal a data disk belonging to a local businessman named Huff Darklighter. The data disk, located in Darklighter's massive home, contained information on an Imperial weapons cache on Tatooine, which the New Republic hoped to retrieve. Winter was to infiltrate one of Darklighter's elaborate parties and steal the disk, while Dendo was to hire local thugs to provide a distraction. He paid a group of thugs in Mos Eisley to raid Darklighter's party, though matters were complicated when a group of spacers—actually members of Rogue Squadron—got into a fight with the thugs, and left them in no condition to fly swoops by that evening. Desperate, Dendo offered the spacers a considerable amount of money to take the thugs' places, and after some bartering, they agreed."}, {"tag": "p", "text": "Dendo and Rogues Dllr Nep, Plourr Ilo, Wes Janson, and Hobbie Klivian drove out in their swoop bikes towards Darklighter's estate, though they soon realized that someone else had raided it—and done significantly more damage than Dendo intended to. The Devaronian called off the raid, offering the spacers half their money if they went back to Mos Eisley with him. The Rogues, however, had noticed Dendo's high-grade blaster and had deduced that he was not the petty gambler he claimed to be. They attacked him, wrestling the agent to the ground, though Dendo put up quite a fight; it took all four of the pilots to eventually pin him down. Eventually, a right hook from Plourr Ilo knocked him unconscious."}, {"tag": "p", "text": "Dendo stayed on Tatooine with the Rogues when Winter eventually revealed his identity to them, while the Alderaanian woman traveled briefly to Ryloth. Winter kept in contact with the Devaronian for several days, instructing him to expect a shock when she returned. The agent arrived back on Tatooine with a squad of Imperial commandos, led by Sixtus Quin, who had defected to the New Republic—the Rogues, though, were instantly suspicious, and Dendo had to intervene to stop the two groups from attacking one another. Winter had little time to explain the situation, as she had discovered the location of the Imperial Eidolon base, which Captain Marl Semtin and criminal Firith Olan were vying for control of. The Rogues engaged Semtin's forces in the air, while Quin and his squad stormed the Eidolon. Winter and Dendo stayed back, ready to provide assistance to either party should it be required. When Plourr Ilo was shot down and crashed several hundred meters from Dendo, the Devaronian rushed to her aid, pulling her out of the flaming fighter moments before it exploded. Dendo was romantically interested in Ilo, and made several advances, though any chance of a relationship between the two was nulled by Ilo's ascension to the throne on her native Eiattu and the husband that came with it. The two did, however, remain close friends."}, {"tag": "h3", "text": "Brentaal IV"}, {"tag": "p", "text": "Dendo was eventually given command of his own elite squad of agents, known as Commando Team One. Several months after the events on Tatooine, Dendo and his team were sent to Brentaal IV in the wake of a pivotal New Republic invasion attempt. Disguised as stormtroopers, Commando Team One set up a base close to where Admiral Lon Isoto—the man in charge of Brentaal's defenses—had erected a huge, heavily armed fortress to safeguard the capital city of Vuultin. Dendo was tasked with destroying the defense complex and kidnapping—or, if necessary, assassinating—Lon Isoto."}, {"tag": "p", "text": "They continued to act undercover for two weeks, as New Republic Admiral Ackbar's cruiser Independence, supplemented by Rogue Squadron, fought several preliminary battles with the Imperial forces over Brentaal. They were able to contribute little to the New Republic's operation for the first fourteen days, though they managed to identify Baron Soontir Fel of the 181st Imperial Fighter Wing in Vuultin and contacted the New Republic with the information. The whole operation was steeped in such secrecy that Dendo and his men were allowed very little contact to the outside, so he was unaware if there were any additional teams undercover on Brentaal. Dendo was performing a damage assessment of the latest skirmish between the New Republic Starfighter Corps and the 181st when his men recovered two downed Rogue Squadron pilots, Wes Janson and Ibtisam; unable to give away their cover, the commandos took the Rogues prisoner, though when Dendo returned he had them released. The Devaronian could not afford to assign any of his agents to take the pilots back to their squadron, but instead temporarily recruited them into his squad for the raid on the defense platform, as both were skilled marksmen."}, {"tag": "p", "text": "Dendo and his team stormed the complex while the New Republic launched a major attack on Isoto's forces several days later, sneaking in on an over-manned skiff. The Imperials quickly realized the deception and a massive firefight broke out, though Dendo and Ibtisam were able to provide cover fire for Janson, the demolitions expert, while he placed charges on strategic points of the construction. With mere moments left on the explosives' timer, the team escaped; the complex was destroyed, and Commando Team One's mission was a success. Dendo eventually returned to the New Republic base to return Ibtisam and Janson to Rogue Squadron. Impressed with her talents with a blaster rifle, Dendo offered Ibtisam a place in Commando Team One, though she declined, and Dendo left the Rogues to begin another assignment."}, {"tag": "h3", "text": "Ciutric"}, {"tag": "p", "text": "Dendo was working with the Rogues again several months later, planning for a mission to the Ciutric Hegemony. Sate Pestage, the heir to Palpatine's dying Empire, had agreed to defect to the New Republic, but had been kidnapped by ex-Moff Leonia Tavira on Ciutric IV. Along with Winter, Rogues Wedge Antilles and Tycho Celchu, and New Republic General Horton Salm, Dendo helped plan the attack on the world, though they all knew that they would be hopelessly outnumbered and that the mission would be extremely dangerous. The Imperial Ruling Council sent additional forces, led by Admiral Delak Krennel, to retrieve Pestage, while Pestage's former advisor Ysanne Isard had sent a commando team of her own to kidnap the former Grand Vizier. Eventually, it was decided that Dendo and Commando Team One would land on the surface in shuttles and retrieve Pestage, while Rogue Squadron and Salm's Aggressor Wing would occupy the Imperials' starfighter complement on the planet."}, {"tag": "p", "text": "The journey down to Ciutric's surface was rough, and the area was swarming with Imperial commandos. Eventually, Dendo's shuttle landed and he and his men approached where Pestage was being held by several of Isard's personal commandos. Leading from the front, the Devaronian helped his team plow through the enemy forces to Pestage's location, executing Pestage's guards and taking the former Grand Vizier back to the shuttle."}, {"tag": "p", "text": "Things quickly went sour when an Imperial Star Destroyer and an Interdictor arrived, barring the Rogues and commandos from exiting the system. Aggressor Wing managed to escape, and promised to go to the New Republic and get backup for the Rogues. Trapped on Ciutric, the pilots and commandos set up camp in the desert, though Dendo, Winter, Antilles, and a select few commandos ventured out to the nearest Imperial outpost to hijack a communications post and signal the New Republic for help. They used a stealthy approach, incapacitating several guards as they made their way to the Imperial communication unit, which Winter used to send a message to the New Republic Provisional Council. When they returned to the other Rogues, however, they learned that Ibtisam, Rogue Two, had been shot down and killed by a squadron of Krennel's pilots during their absence. Although this caused some conflict within the group, it further resolved their determination to escape their situation and complete their mission."}, {"tag": "p", "text": "Dendo stayed on the ground as the Rogues fought several skirmishes with Krennel's forces; Aggressor Wing, who had in truth been waiting on the edge of the system, returned and helped them procure the use of a proper hangar for their ships, along with the help of Mirax Terrik, a smuggler friend of Antilles. The Rogues eventually hatched a plan to take out the Interdictor, though Dendo and his people were forced into a hasty retreat when Krennel's AT-ATs began to approach his position. Pestage, however, defected back to the Empire and, despite Dendo's efforts, left Commando Team One to rendezvous with the incoming Imperial forces. With the AT-ATs bearing down on him, Dendo decided to let Pestage run, knowing that any pursuit would result in death for his people. The shuttles lifted off and Dendo and his men escaped. The whole mission turned out to be in vain, as Pestage was murdered by Delak Krennel and Isard engineered the downfall of the Ruling Council to take their place at the head of the Empire."}, {"tag": "h3", "text": "Later service"}, {"tag": "p", "text": "Dendo continued to work for the New Republic, becoming a colonel, and over the next several years he often worked in conjunction with Judder Page's Katarn Commandos; by the time of Thrawn's return to prominence, Dendo's squad was among the most revered commando teams in the galaxy. After the conclusion of the Thrawn campaign, Commando Team One and the Katarns were selected to assist Rogue Squadron on a mission to the planet Commenor. The New Republic had procured intelligence that a group of Ysanne Isard's Lusankya prisoners—former Alliance members and other enemies of the Empire who had been kept on Isard's Super Star Destroyer under Coruscant's surface—were being held in a barn on the planet, including several former members of the Rebel Alliance. Dendo was able to easily force his way into the building and neutralize its security complement. The prisoners they found were not among the most prominent of Isard's captives, though they did what they could to assist them while waiting for medical staff. Eventually, the prisoners were sent to a medical facility to recuperate."}, {"tag": "p", "text": "Dendo's team was again selected to work alongside Rogue Squadron several weeks later in the campaign against Imperial warlord Delak Krennel. Krennel had taken over the Ciutric Hegemony in the time since Pestage's murder; the New Republic, wanting to send a message to the remaining warlords throughout the galaxy, chose to make an example of him. Liinade III was chosen as the first of Krennel's worlds to be targeted, and the Provisional Council decided to send in the Rogues and three Star Destroyers to eliminate the planet's defenses. Commando Team One was part of a task force on Commander Sair Yonka's Star Destroyer Freedom, which assisted two other Star Destroyers in neutralizing Liinade III's meager defenses. Dendo was placed on the ground and he and the other New Republic troops began to capture Liinade III's main spaceport. Their efforts were boosted by Rogue Squadron, who destroyed several AT-ATs defending the spaceport. The Rogues requested Dendo's help not long after; one of their pilots, Rogue Nine, had been shot down near another area, and Wedge Antilles asked Dendo to retrieve him. Although rescue and retrieval were not priorities of the New Republic at the time, Dendo took several of his men to search for Corran Horn, the downed Rogue. They reached the area where he had been shot down, though Horn had left his fighter and ventured toward a nearby mountain. By following his trail, Dendo's team located an Imperial research facility, laden with plans to build a new Imperial superweapon. Dendo's men closed off the facility and Liinade III was under New Republic control by nightfall."}, {"tag": "p", "text": "Around a week later, Rogue Squadron disappeared, presumed to have been killed by Krennel's pilots at Distna. They had survived, however, and contacted the New Republic with a plan of attack for Krennel's fortress world and capital, Ciutric IV. The resurgent Ysanne Isard had agreed to assist the New Republic in their efforts to taken down Krennel and her rogue clone, who had allied herself with the warlord. Isard also provided the Provisional Council with the whereabouts of the remaining Lusankya prisoners, including famous Rebel Alliance General Jan Dodonna. Dendo led a team of Noghri—a warrior species who had defected from the Empire during the Thrawn crisis—into the prison complex where Dodonna was being kept, to assist Rogues Horn, Ooryl Qrygg, and Nrin Vakil. The pilots had managed to free the prisoners but were trapped by hordes of Krennel's stormtroopers. Attacking the Imperials from behind, Dendo and his team of Noghri slew many of the stormtroopers, allowing the Rogues and the prisoners an escape route. Ciutric itself was captured not long later, and Krennel, Isard, and Isard's clone were all killed by the New Republic."}, {"tag": "h3", "text": "Battle of Ithor"}, {"tag": "p", "text": "After the success at Ciutric IV, Dendo continued to serve the New Republic for over a dozen years, becoming a general by 25 ABY. In that year, the extra-galactic Yuuzhan Vong launched their invasion attempt of the galaxy, beginning the Yuuzhan Vong War. After stalemates with the New Republic on Dantooine and Dubrillion, the Yuuzhan Vong moved for the planet Ithor, knowing that the pollen of the native Bafforr trees was able to neutralize the Yuuzhan Vong Vonduun Skerr Kyrric armor; the New Republic and their Imperial Remnant allies attempted to fortify and evacuate the planet before the arrival of Shedao Shai's forces. Dendo was placed in charge of all ground operations (as \"Range Lead\"); he and his commandos devised a scheme to lure the Yuuzhan Vong—who despised and wished to eradicate all machinery and droids—into a building filled with explosives."}, {"tag": "p", "text": "New Republic commandos under Dendo's control erected a crude building at the center of a clearing in Ithor's forest, setting up hordes of explosives at its foundations. They placed a multitude of old droid parts and computers inside the building, and left it guarded by simple security droids, which they hoped would rile the Yuuzhan Vong. Dendo and his troops took up a position near the building as the Yuuzhan Vong transports arrived on the surface and deployed their troops; the Yuuzhan Vong soldiers took the bait and, infuriated that the New Republic were using machines to do their fighting, lost all discipline and attacked the building, determined to destroy the droids. When enough of the Yuuzhan Vong had entered the building, Dendo's men detonated the explosives, killing many of the attackers and leaving their forces extremely disorganized."}, {"tag": "p", "text": "Dendo led a commando team to the right of the clearing to mop up the rest of the Yuuzhan Vong while a team of Noghri commandos attacked from the left. Dendo was tasked with allowing a group of Jedi led by Jedi Knight Corran Horn enough time to reach a Yuuzhan Vong communications center and contact the Vong leader, Shedao Shai. Dendo's commandos were successful, though he was injured during the battle, and leadership of the ground troops was ceded to Corran Horn. Dendo survived, though much of Ithor did not; the Yuuzhan Vong unleashed a biological virus that destroyed the entirety of the world's flora and fauna, dishonoring an agreement Horn had made with Shedao Shai."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kapp Dendo was extremely dedicated and loyal to the Rebel Alliance and later the New Republic, and served them both to the best of his ability. Although he preferred to operate in the shadows and keep a low profile, Dendo was more than happy to lead from the front when the time came, and throughout his career he risked his life a great many times, incurring several serious injuries. Dendo was a fierce fighter, and he cared greatly about those under his command. He often put himself in harm's way to rescue any New Republic soldiers; on Tatooine, he almost killed himself trying to save Plourr Ilo from her flaming fighter, and he personally helped evacuate his fallen and injured comrades on Ciutric. He also looked up to older, more experienced leaders, such as Wedge Antilles and Jan Dodonna, and treated them with the utmost respect."}, {"tag": "p", "text": "Dendo had no qualms about lying, breaking the law, or hiring thugs during his time as an undercover agent, as long as the end justified the means and he accomplished his mission. During his mission to Tatooine in 5 ABY, Dendo refused to tell the Rogues the truth, preferring to lie to and trick them into believing he was a simple conman. However, while Dendo was serious when he needed to be, he had a distinct and rather grim sense of humor, and was quite flirtatious with many females—particularly Rogue Squadron members—he worked with. Dendo used humor as a way to alleviate tension during dangerous or perilous missions; while evacuating Sate Pestage on Ciutric IV, he told a commando that he would not die on the planet because he had a \"date with a princess.\" Although he knew not to flirt with Winter, Dendo attempted to begin a relationship with Plourr Ilo; he actually found success, and the two became close, though Ilo eventually married a prince on her homeworld. Later, on Brentaal IV, he flirted briefly with Ibtisam, offering her a place in his team."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Kapp Dendo was first introduced in Michael A. Stackpole and Jan Strnad's Star Wars: X-Wing Rogue Squadron: Battleground: Tatooine, where he initially serves as an antagonist, whose origins and motives are unknown. Later on in the story arc, it is revealed that Dendo is actually a New Republic agent, and, thus, a protagonist. Dendo later featured in a more prominent role in Stackpole's later story arcs, In the Empire's Service and Mandatory Retirement, as well as two of Stackpole's novels, X-Wing: Isard's Revenge and The New Jedi Order: Dark Tide II: Ruin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}