{"url": "Antan_Azzameen", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Agents of the Galactic Empire", "Category:Azzameen family", "Category:Business owners and executives", "Category:Humans", "Category:Males", "Category:Twin Suns Transport Services personnel"], "nodes": [{"tag": "h1", "text": "Antan Azzameen"}, {"tag": "p", "text": "Antan Azzameen was a Human male who was the brother of Tomaas Azzameen and co-founder of the shipping business Twin Suns Transport Services during the Galactic Civil War. He disapproved his brother's, niece's and nephews' involvement with the Rebellion, and decided to join the Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Earlier in his life, Antan was rumored to have dueled a prince from Jar'Kai and won, claiming a pair of swords, which became very precious to him. He never fathered any children, in contrast to his brother, who had four. He had always said that Ace was a good boy."}, {"tag": "p", "text": "When Tomaas and Galin in the Otana arrived at Twin Sun Station for repairs after a run-in with Imperials at Hoth, Antan refused, knowing that they could reach home themselves. A lot of customers had been waiting in line for repairs, and Antan was not willing to give priority to his own family, especially since they weren't sure if the Imperials had identified the Otana or not."}, {"tag": "p", "text": "When Antan learned about Ace's discovery of spice in a cargo storage area left behind by the Enkidu, a Viraxo ship, he formulated a plan to make the Viraxo's plan backfire by delivering it to Viraxo 54, then provoking an Imperial response to investigate and discover the spice. Things didn't go as planned, and the Selu was lost."}, {"tag": "p", "text": "After Tomaas and Galin were lost when delivering bacta to the Rebels, he, along with Emon Azzameen, went to gather what they could from their storage facilities. However, while doing so he got captured by the Viraxo, although Emon managed to escape."}, {"tag": "p", "text": "After Ace joined the Rebellion, Emon learned that Antan was being held on an XQ5 Platform called Viraxo Industries. Emon and Ace rescued Antan from the platform, and Antan gave Ace his prized Jar'Kai dueling sabers as a reward."}, {"tag": "p", "text": "He was also part of the plot to kill K'Armyn Viraxo in the Highroller but accidentally placed Ace and Emon into a trap, which the two managed to escape."}, {"tag": "p", "text": "Antan then e-mailed Ace and asked to inform him about the Rebellion's movements in order to \"avoid any Rebel and Imperial encounters in his travels.\" This request made the siblings suspicious."}, {"tag": "p", "text": "Suspicions began to flare when the Rebels attacked the Azzameen home base, which had been sold to a mercenary group that was harassing the Bothans. Antan's ship, the Big Score, was seen operating in the area by the Azzameens on a mission to retake the station."}, {"tag": "p", "text": "The whereabouts of Antan Azzameen during the intervening time was unclear, but Antan contacted Ace and Aeron and promised to explain to them why he was there. He also asked them to help him rescue their captured family members Tomaas and Galin, claiming that it was he who was the leader of the mercenary group trying to split the Alliance apart in exchange for the lives of Tomaas and Galin."}, {"tag": "p", "text": "After Andrasta and Otana followed Big Score to a Golan III platform near Kessel called Kessel Station, Antan betrayed Ace, Aeron, and Emon to the Empire, apparently in exchange for a pardon from whatever crimes he had been charged with, showing a complete lack of family allegiance. The Azzameen siblings were able to protect themselves from the incoming TIE fighters until family friend Dunari unexpectedly showed up and helped them escape the ambush."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Unlike all of the other members of the Azzameen family, Antan had little, if any, Rebel sympathies. He was very uncomfortable with his family doing business with the Rebel Alliance or becoming members of the Alliance. He was willing to refuse help to his family members or disagree with their ideas to support the Rebels."}, {"tag": "p", "text": "Antan did, however, hold a grudge against the Viraxo. He viewed Tomaas's efforts to work out a deal with them with disdain, and it was only when a Rebel mission involved stealing warheads from the Viraxo due to be delivered to the Empire that he agreed to lend aid to the Rebels."}, {"tag": "p", "text": "Antan was able to make shrewd plans, but they occasionally went wrong, such as the attack on Viraxo 54, which involved losing the Selu, and the attack on the Highroller when somehow K'Armyn Viraxo had gotten wind of Antan's plan and attempted to counter it, which placed Ace and Emon in jeopardy."}, {"tag": "p", "text": "He was not above making deals with the Empire to save his own skin, even at the risk of the last remnants of his family."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}