{"url": "Karakan", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Undefined social groups"], "nodes": [{"tag": "h1", "text": "Karakan"}, {"tag": "p", "text": "The Karakan were a group known for their isolationist policy during the early years of the Galactic Republic. They produced Karakan gauntlets, sophisticated medical devices that monitored and adjusted biological indicators such as nervous impulses, blood pressure, and tension. The gauntlets were compatible with a number of different species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the early period of the Galactic Republic, circa 3956–3951 BBY, the Karakan were an isolationist group. However, one of their medical products, Karakan gauntlets, could be acquired in parts of the galaxy at this time. The heavy gauntlets monitored the nervous impulses, blood pressure, and tension of the wearer through contact with their hands. The gauntlets were then able to adjust these life signs and produce an overall increase in stability and system integrity. This comprehensive package made the gauntlets virtually a complete medical computer in themselves, producing many benefits to the user. They were compatible with the physiologies of Cathar, Humans, Twi'leks, Wookiees, Miraluka, and Zabraks."}, {"tag": "p", "text": "The Paaerduag merchant Mic'tunan'jus Orgu sold a pair of the gauntlets from his kiosk on Tatooine which were colored yellow with green stripes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Karakan were created for Star Wars: Knights of the Old Republic, a computer roleplaying game produced by BioWare in 2003. They never appear in the game but are mentioned in the description of the Karakan Gauntlets, which are also available in the sequel, Star Wars: Knights of the Old Republic II: The Sith Lords, produced in 2004. The item description is also included in the two Prima Games strategy guides and The Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "It is not clear whether the Karakan are a species, a culture, or an organization. Most gauntlets in the game are named after species—for instance, the Bothan precision gloves, Gamorrean gauntlets, Kubaz scoundrel gloves, Nagai combat gloves, and Nikto soldier gloves. Others, however, are named after planets such as the Taris survival gloves and Eriadu Accuracy gloves. Until canon clarification, this article treats them as a generic organization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}