{"url": "Karak%27s_renegades", "categories": ["Category:Legends articles", "Category:Political factions"], "nodes": [{"tag": "h1", "text": "Karak's renegades"}, {"tag": "p", "text": "Karak's renegades were a group of Sedrians who opposed the Priests of the Sun's control over Sedri with the use of the Force-sensitive coral communal intelligence known as the Golden Sun, and decided to take control of the Golden Sun, believing that all Sedrians should have access to it. Their leader was the power hungry Bishop of war, Karak, who in truth simply wanted the coral's power for himself."}, {"tag": "p", "text": "During the Sedri civil war, Karak received help from the Galactic Empire, who had established a garrison on the planet after accidentally discovering it. Karak planed to share the Golden Sun's power with the Imperials and also offered them Mors Odrion, a Rebel Alliance diplomat who had been previously captured by the renegades. The former priest of war kept the deal a secret from the majority of renegades, many of whom were suspicious of the Imperials. Unbeknownst to the renegades, Odrion's companion, Rekara had managed to flee the planet and traveled to the Rebel base on New Kisge to seek help in retrieving Odrion. Rekara then returned to the planet with a group of six rebels and devised a plan to attract some of Karak's renegades to their side by showing them a recording between Karak and the Imperials. The plan worked, and many of the renegades lost trust in Karak, siding with the Rebel troops."}, {"tag": "p", "text": "When the assault on the Fitsay Sun caves began, Karak took six of his most trusted and powerful renegades, Dragob, Glish, K'hondo, Porm, Spodan and Burborok as well as his pet razort Tooch and their prisoner, Odrion, to the Sun Caves in an attempt to claim the coral's for himself and defeat both the Priests and the Imperials. At the cave the group was confronted by the High Priest of the Golden Sun Cardo, however one of the renegades attacked him, slashing him across the chest and causing a near fatal wound. The group then moved into the cave, with Karak and Odrion heading straight for the main chamber while the renegades spread out through the cave to slow down any pursuers. Most of the renegades were killed in the ensuing fight, and Karak himself was later apprehended and and imprisoned for his betrayal."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}