{"url": "Antar_4/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems moons", "Category:Galactic Republic moons", "Category:Moons of Antar", "Category:Terrestrial moons"], "nodes": [{"tag": "h1", "text": "Antar 4"}, {"tag": "p", "text": "Antar 4 was the fourth of six moons orbiting the Inner Rim gas giant of Antar and homeworld of the sentient Gotal species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Antar 4, along with its sister moon Antar 5, joined the Galactic Republic early in its history, sometime between 25,000 BBY and 22,000 BBY."}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the reconstituted Sith Empire, an individual sent a companion to deliver artwork stolen from the Museum of Abstract Ingenuity to an art collector on Antar 4."}, {"tag": "p", "text": "Antar 4's people developed a security force to assist the Jedi Order known as the Antarian Rangers in 620 BBY. Several centuries later the Jedi Order assisted their Antarian cousins by sending a peacekeeper, known as Jedi Master Jorus C'baoth, to mediate a Duinuogwuin–Gotal conflict."}, {"tag": "p", "text": "In 38 BBY, Tayvor Mandirly, a Human agricultural expert and the uncle of Bail Organa, traveled to Antar 4 to investigate a dispute on the Colfillini plantations there. However, after he made a stand against the practice of working people to death, he was murdered by Raxis and Nolid, members of a local criminal organization. His body was burned and nailed to a stake and the first people to discover it were the Jedi Knights, Qui-Gon Jinn and Obi-Wan Kenobi. Kenobi found this very disturbing and suffered nightmares of it for a long time afterwards. Mandirly's sister, Bail's mother, also found his death hard to take and her grief eventually killed her. However, Raxis and Nolid were only fined by the local government for the murder."}, {"tag": "p", "text": "Following the settling of that conflict, the Separatist Crisis began to erupt across the Republic, causing a growing sense of urgency amongst the Senate and the Jedi High Council. In 23 BBY, during Fete Week, the Roshu Sune terrorists attacked a chapter house of the Rangers and issued the Articles of Secession to the Senate. Refusing to recognize the authority of mere terrorists, the High Council launched a Jedi/Ranger co-op mission to retake the world. Led by Masters Saesee Tiin and Coleman Trebor, the mission was considered a victory by the Republic, but left the native Gotals disgruntled. Many natives were prompted by the violence to immigrate to the colony world Atzerri."}, {"tag": "p", "text": "As the Separatist movement gained momentum and the Confederacy of Independent Systems was formed, the Clone Wars ignited on Geonosis, causing a firestorm across the galaxy. Seven months after the First Battle of Geonosis, Antar 4 was conquered by the Separatist Droid Army, with the leader of the Separatist group, Count Dooku, setting up a command headquarters within one of the moon's industrial palaces. As the world's populace lived in poverty amongst the ruins of their home, rogue Jedi Knight Quinlan Vos infiltrated Dooku's camp, walking right into his command center to feign defection that even members of the Jedi High Council believed to be true. Defeating the Dark Jedi Tol Skorr and Kadrian Sey before entering the Count's inner sanctum, Vos met with the former Jedi after being escorted inside by former Master Sora Bulq. Facing Vos in a duel, the Count was pleased with Vos' skills, though the older man was able to best him easily. Accepting Vos into his cadre, the Count and his followers left for Tibrin to \"free\" its populace from the Republic."}, {"tag": "p", "text": "The moon was conquered during the Yuuzhan Vong War."}, {"tag": "p", "text": "Native Senator Ta'laam Ranth of the Galactic Alliance Senate was appointed to the Alliance High Council."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "A terrestrial moon, the seasons varied wildly from each other, with extreme tides caused by Antar's nearly parallel rotational axis and orbital plane. A unique series of eclipses would plummet the world in darkness on occasion as the gas giant Antar 4 orbited cut off light from its star. Due to the rotation period of the world, the moon was devoid of polar caps and was made up mostly of water-covered surfaces. With a crust rich in silicon, nickel, iron, and the magnetism of magnetite in conjunction with the electromagnetic field of the stars, the moon's inhabitants were forced to develop a unique sensory ability to negate the magnetic effects of their world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}