{"url": "Antar_Atrocity", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles in need of updating", "Category:Battles in the Prindaar system", "Category:Early Imperial campaigns", "Category:Genocides and massacres"], "nodes": [{"tag": "h1", "text": "Antar Atrocity"}, {"tag": "p", "text": "The Antar Atrocity was the name given by the media to an operation undertaken by the Galactic Empire in which Imperial forces, led by Wilhuff Tarkin, carried out arrests, executions, and massacres on Antar 4, as punishment for Antar 4's allegiance to the Confederacy of Independent Systems during the Clone Wars."}, {"tag": "h2", "text": "Origins"}, {"tag": "p", "text": "The origins of the Antar Atrocity were found in the Separatist Crisis in which thousands of star systems left the Galactic Republic and pledged loyalty to Count Dooku, the leader of the Confederacy of Independent Systems. One world to leave the Republic was Antar 4, which had been a member of the Republic since its inception. The secession began with a schism among the inhabitants of Antar 4, in which Separatist-allied terrorist groups began to gain power. Republic loyalists from the Gotal species were able to retain their power until after the First Battle of Geonosis, but Antar 4 fell to the Separatists. Millions of Gotal fled to Atzerri, a colony world, and were replaced by species loyal to the Separatists, such as Koorivar, Gossams, and other species. Some Gotal and Koorivar loyalists formed a resistance group, but Antar 4 remained in the hands of the Separatists."}, {"tag": "h2", "text": "The Atrocity"}, {"tag": "p", "text": "The end of the Clone Wars saw the death of Count Dooku and the Separatist Council, with the Republic claiming victory over the Separatists. With the war at an end, Supreme Chancellor Sheev Palpatine declared himself Emperor and transformed the Republic into the Galactic Empire, promising a new era of peace, prosperity, and security for all of the galaxy. In the early days of the Empire, Imperial forces targeted former Separatist worlds in order to pacify any remnants of Separatist rebellion. Antar 4 was one of those worlds, and Moff Wilhuff Tarkin was assigned to make an example of the formerly rebellious world. The Empire invaded Antar 4, and Moff Tarkin made no attempt to sort the Separatists from Imperial loyalists when he carried out mass arrests, executions, and massacres."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Although the Commission for the Preservation of the New Order attempted to hide the fact that many loyalists had been killed, the news media learned of what happened and dubbed it the Antar Atrocity. The event attracted controversy and attention from members of the Core Worlds, with many citizens clamoring for answers as to what had transpired. To distance him from the controversial events, the Emperor removed Moff Tarkin, his ally and friend, from Antar 4 and assigned him to pacification operations in the Western Reaches, before ultimately assigning him to the Outer Rim Territories to oversee the construction of the Death Star, the Emperor's Deep Space Orbital Battle Station. The creation of the battle station would make invasions like the Antar Atrocity obsolete. The fear of the station alone would bring entire star systems to their knees."}, {"tag": "p", "text": "One of the most vocal reporters of the Antar Atrocity was Anora Fair, who worked alongside Hask Taff to document the arrests and massacres that were taking place. They were assisted by Berch Teller, a disaffected former Republic intelligence operative who provided them with the information they needed to report on the Atrocity. COMPNOR realized this and targeted them for assassination, but Teller was able to bring himself and the others to safety before the Empire could eliminate them."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "Four years later, Teller led a small cell of resistance fighters against the Empire, a cell that included Fair and Taff. They stole the Carrion Spike, Moff Tarkin's personal vessel, and used it to cause damage and sow chaos in different corners of the galaxy. The Empire eventually captured Teller's compatriots and quietly executed them, while Teller himself escaped and later tracked Tarkin to the Moff's homeworld of Eriadu, where Teller attempted to assassinate the now promoted Grand Moff Tarkin but was thwarted by Tarkin and his uncle Jova. Teller was left in the wilderness to survive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}