{"url": "Karina_the_Great", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems individuals", "Category:Geonosians", "Category:Queens"], "nodes": [{"tag": "h1", "text": "Karina the Great"}, {"tag": "p", "text": "Karina the Great was the Geonosian queen of Geonosis and an ally of the Confederacy of Independent Systems during the Clone Wars. She served as the queen of the Stalgasin hive and Geonosis during the war. She died when she was buried alive due to the collapse of the Progate Temple."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Karina ruled over Geonosis and her hive from beneath the Progate Temple with Archduke Poggle the Lesser acting as Geonosis' public leader. Karina laid many eggs and learned how to bring dead Geonosians back to life. She decided that she also wanted to control Jedi."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 21 BBY, during the Second Battle of Geonosis, Karina was able to have her undead soldiers capture Jedi Master Luminara Unduli when Poggle the Lesser allowed her to follow him into the Progate Temple's catacombs. Obi-Wan Kenobi and Anakin Skywalker came to rescue her. Karina accused the Galactic Republic of attacking Geonosis and asked why they came before her."}, {"tag": "p", "text": "When Kenobi told that she must surrender to the Republic, Karina refused to do so saying that he cannot dictate her and that her empire will last forever. Kenobi then told her that she was incorrect and that she will submit to the Republic."}, {"tag": "p", "text": "Karina then grew angry and ordered her guards to execute them. Kenobi said that if she did that, then the Republic will grow harsher towards her. She still ordered them to execute them by telling Kenobi about her plans to use her children to control Unduli and the other Jedi. She then ordered her guards to get the brain worms and put it in Luminara. However, then Kenobi ordered his clones to attack. Karina was blinded by Commander Cody's troopers, who shined their flashlights in her face. As the Jedi made their escape and took Poggle prisoner, Karina was buried alive when the Progate Temple collapsed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Karina the Great had red and black eyes and tan skin. As the leader of her people, she stayed safely underground while Poggle publicly led them. Since she lived underground, she was not used to bright lights and was disoriented when the clones shone their flashlights on her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Karina was voiced by Dee Bradley Baker, who also voices all of the clone troopers in the Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}