{"url": "Karis", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Cleanup", "Category:Pages needing citation", "Category:Females", "Category:Force-sensitives", "Category:Nightsisters"], "nodes": [{"tag": "h1", "text": "Karis"}, {"tag": "p", "text": "Karis was a Dathomirian female member of the Nightsisters during the Clone Wars. She and her sister Naa'leth were both regarded as the strongest warriors of the clan. The sisters were sent by Mother Talzin to aid Asajj Ventress in her attempt to assassinate Count Dooku in his palace on Serenno. The trio navigated through the forest and entered the building through a hole cut by a lightsaber. Ventress shot Dooku with a poison dart, before Dooku immediately woke up and engaged them in a duel. The Nightsisters were victorious with Ventress knocking him to the ground and Force pushing away his lightsaber. Dooku unexpectedly shot them all with a blast of Force lightning and launched them through the window. Karis was later killed during General Grievous's subsequent attack on Dathomir."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A member of Mother Talzin's clan of Nightsisters on Dathomir, Karis, alongside her sister Naa'leth, being proficient with energy bows, were among the Hunters, who were regarded as the clan's greatest warriors."}, {"tag": "h3", "text": "Mission to Serenno"}, {"tag": "p", "text": "The sisters, Karis and Naa'leth were sent by Talzin, alongside Asajj Ventress, to attempt to assassinate Ventress' former Dark side master, the leader of the Confederacy of Independent Systems Count Dooku. The trio traveled to the planet Serenno in order to exact their mission, using magick to render themselves invisible, with Ventress shooting a poison dart at the sleeping Count, which caused Dooku to awake and engage the three of them in a duel. Karis wielded a green lightsaber in the battle."}, {"tag": "p", "text": "In the scuffle, Ventress knocked Dooku to the ground, and separated the Count from his lightsaber. However, the attempt to kill Dooku was ultimately unsuccessful, as Karis, Naa'leth and Ventress were flung out a window by a blast of Dooku's Force lightning. Karis remarked that Dooku was stronger than Shen had imagined, to which Ventress replied that she tried to warn her of the Counts power. Despite their failure, Talzin saw an opportunity in the defeat, as Dooku would now be eager to protect himself, by getting himself a new apprentice."}, {"tag": "h4", "text": "The rise of Opress"}, {"tag": "p", "text": "Talzin's assumption proved correct, as Dooku was all to eager to obtain a new assassin to protect him and train. After a tough contest, Ventress returned with a Nightbrother named Savage Opress. Karis participated in a ritual to give Opress great power to stand a chance as Dooku's new apprentice. The process made Opress stronger both physically and mentally. Karis watched as Opress took his first steps with his newfound strength, and witnessed Savage's final test, where Savage murdered his brother Feral."}, {"tag": "h3", "text": "Battle of Dathomir"}, {"tag": "p", "text": "Having been betrayed and plotted against continually by the Nightsisters, Dooku sent General Grievous and the Droid Army to put an end to the witches once and for all. As the Nightsisters prepared for battle, Karis, who was outside with Ventress and Talzin, witnessed as droid fighters flew overhead, bombing the fortress prior to the main assault. However, the bombs caused a pillar to fall, breaking apart into debris which crushed Karis before she could get out of the way. Ventress ran to her sister, and used the force to move the part of the pillar that had fallen on her, but it was too late for Karis. She begged for Ventress to lead the Nightsisters to victory before dying, the first casualty of the battle to come."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Karis first appeared in the Star Wars: The Clone Wars episode \"Nightsisters.\" She was portrayed by actress Catherine Taber, who notably portrays Padmé Amidala throughout the series.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}