{"url": "Karnak_Tetsu", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Force-sensitives", "Category:Males", "Category:Sith species", "Category:Sorcerers of Tund"], "nodes": [{"tag": "h1", "text": "Karnak Tetsu"}, {"tag": "p", "text": "Karnak Tetsu, also known as Karnak the Maleficent, was a Force-sensitive male Sith Offshoot who lived during the years following the Great Sith War. He became the leader of the Sorcerers of Tund, a Tund-based Force sect."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Karnak Tetsu, also known as Karnak the Maleficent, was a male Sith Offshoot who became the leader of the Sorcerers of Tund, a secretive group of Force users who were based on the planet Tund, in the years following the Great Sith War. Tetsu acquired the use of many Force powers and ruled the Sorcerers via the means of terror, which prompted the Jedi Order to declare the Sorcerers' beliefs as unqualified heresies. Millennia later, Tetsu and his cult were mocked by the Sith Lord Darth Plagueis in a conversation with his apprentice, Darth Sidious."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tetsu was an enigmatic individual. He wore Tundan robes and was equipped with a blaster pistol and a Sith talisman."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Force-sensitive, Tetsu had the ability to use the Force. He was skilled in the use of the dark side powers of Force rage, scream, and lightning to inflict harm upon his opponents. He was also able to use energy and Force resistance, as well as Force Stun and deflection to defend himself. In addition, Tetsu was also capable of severing an opponent's Force connection and using the Force to disable droids. Furthermore, he knew how to perform mind tricks and telekinesis, and how to use farsight. Tetsu was multilingual: he could speak Basic, High Galactic, Huttese, Sith, and Tundan."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Karnak Tetsu was created by Abel G. Peña and featured in the Wizards.com article KOTOR Campaign Guide Web Enhancement 5: Karnak Tetsu, Sorcerer of Tund. The article was the fifth installment of a series of web enhancements presenting material that was created for the 2008 sourcebook Knights of the Old Republic Campaign Guide, but which wasn't included in the published version of the book due to spatial reasons. Tetsu was later mentioned in the 2012 novel Darth Plagueis, by James Luceno, along with the third part of the StarWars.com blog series The Imperial Warlords: Despoilers of an Empire in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}