{"url": "Karr_Nuq_Sin", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Collectors", "Category:Force-sensitives", "Category:Humans", "Category:Males", "Category:Pilots", "Category:Tailors"], "nodes": [{"tag": "h1", "text": "Karr Nuq Sin"}, {"tag": "p", "text": "Karr Nuq Sin was a Force-sensitive human male from the planet Merokia who sought to discover his connection to the Force around 30 ABY. He was the grandson of J'Hara and the great-grandson of former Jedi Padawan Naq Med. At age thirteen, Nuq Sin began experiencing severe headaches and seizures accompanies by visions of the past when he touched certain objects. His grandmother believed this was a sign he had Force powers and tutored him in the Force and the ways of the Jedi. After his grandmother's death Nuq Sin was deeply dissatisfied with his life on his home planet. After meeting Maize Raynshi, another student who was similarly unhappy, Nuq Sin and Raynshi stole her father's First Order yacht Avadora and the pair embarked on a journey across the galaxy to find Jedi artifacts and learn more about the defunct Order and Nuq Sin's place in the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "The human Karr Nuq Sin was born to Tomar and Looway Nuq Sin between 12 and 14 ABY on Merokia, a remote desert planet near the Unknown Regions. The Nuq Sin family were middle-class tailors who hoped their son would follow in their footsteps and learn the craft. Unbeknownst to Karr, he also had Jedi heritage in the form of his great-grandfather Naq Med, a former Jedi Padawan. As a child, Nuq Sin was very close to his paternal grandmother J'Hara. He attended a school on Merokia but was a loner struggled to make friends with his fellow students."}, {"tag": "p", "text": "His life changed drastically when he was thirteen and began experiencing severe headaches and seizures when he touched certain objects. These seizures were accompanied by distored visions of the past. Nuq Sin's mother and father feared their son was suffering from a brain tumor or another serious ailment and took him to see several doctors, including the foremost expert in the sector. None of these professionals could find anything wrong with the boy. Unlike his parents, Nuq Sin's grandmother J'Hara, familiar with the Jedi Order and the Force from her father, believed his episodes were not a sign of an illness but instead were a sign he was Force-sensitive and possessed the ability to learn of an object's past by touching it. While Tomar and Looway pursued medical treatment for their son, J'Hara attempted to help him by tutoring him in the ways of the Jedi and the Force. She believed that through these studies, Nuq Sin could gain greater control of his abilities and find relief from his headaches. J'Hara suggested that if he found Jedi objects and used his power to see their history, he could learn how to use his ability properly and how to become a Jedi. As a short term remedy, she also made a pair of leather gloves for him to avoid episodes from accidentally touching an object that induced visions."}, {"tag": "p", "text": "After his powers manifested Nuq Sin built a droid RZ-7 by combining the circuitry of a protocol droid, the hard drive of an astromech and the outer casing of a medical droid. Though nominally a medical unit meant to aid him with his seizures, in practice the droid was more of a protocol droid and could also perform other tasks such as driving a speeder. Nuq Sin's true purpose for building \"Arzee-Seven\" was for him to be his friend. During this period, Karr continued to struggle with his school life and barely had any friends aside from his droid. He was also the target of bullying, including an incident where a Zabrak boy broke his model B-class X-wing and the Besalisk Royke and his cronies, who taunted him for his health issues and belief in the Force. He was deeply unhappy at school and considered it his least favorite place in the universe."}, {"tag": "h3", "text": "Meeting Maize"}, {"tag": "p", "text": "After attempting to Force choke Royke, Karr was taken to the headmaster's office and made to wait outside while the bully was taken directly to see the headmaster. While waiting on a wooden bench, Karr chose to add his own name to the many other carvings the bench had received from other students. He had barely added the first letter to his name when Kragnotto, the Ankura Gungan teacher in charge of the science program, dragged a highly resistant student into the room and forced her to sit down. She had been rifling through his things, and he planned to have her punished, leaving the room and the two alone on the bench. The girl, Maize Raynshi noticed and then mocked Karr for his rebellious act of trying to carve his name into the bench. They formally introduced themselves to each other and over the course of their following conversation, Maize stated her belief that the Jedi were not real and also didn't believe in his ability to see visions from certain objects that he touched. When he insisted that he was telling the truth, she challenged him to see something on one of her father's tools which she kept in her bag, but after holding it and having a vision, Karr passed out."}, {"tag": "p", "text": "When he came to, he was surrounded by Maize, the Ovissian headmaster, Royke, and others. After some momentary confusion, Karr was helped to his feet and convinced the headmaster to let him contact his medical droid, RZ-7, and to go home early. Maize offered to go outside and wait for the droid with him, and the two left to wait outside of the school, though Royke complained bitterly about Karr not getting detention. While they were waiting, a Togruta student teased Karr and said that people were saying he was dead, though the student ran off with Maize shouting something rude in Huttese about his father and mother after him. Maize then revealed that her father, who worked for the First Order, had had some dealings with the Hutts and that she considered their language to be perfect for swearing. When RZ-7 arrived, Karr became embarrassed as Maize had to sit on his lap due to the family speeder only being a two-seater. While riding back to Karr's house, Karr revealed to her the truth about RZ-7. Then, after a brief disagreement about the Jedi that continued their conversation from the bench, Maize expressed interest in meeting Karr's grandmother. He was forced to shout over the speeder's engine that she was dead."}, {"tag": "p", "text": "When they reached Karr's house, he and Maize headed inside though they were briefly stopped by his older brother, Trag. After Karr labeled Maize as a friend, Trag shrugged and allowed the two to continue on their way to Karr's room. Once there, Maize expressed surprise at Karr's collection of objects, and he explained several of his pieces to her, including a broken staff with a silver top which he claimed to have received a vision from. Maize and Karr continued to argue about the Jedi before Karr brought the discussion to an end by asking if she wanted to learn what he'd seen in the vision gleaned from her father's tool. She sat down, ready to hear his vision. He explained that he had felt the tool had been part of something big, and that many stars and so much darkness that it was like death was also what he sensed. Maize retorted that he was reaching and sounded like he was claiming it came from the Death Star, which he denied and stated that everything was cold, covered in ice and snow. He plowed on, moving on to Maize's father and describing how the man had blue eyes, looked younger than people thought he was, had on a grey suit, and that he was human. Karr used that information to confirm that Maize was only half Mirialan. Maize appeared stunned and admitted that it was either impressive or a very good performance."}, {"tag": "h3", "text": "Running away"}, {"tag": "p", "text": "The next day at school, Karr was called to the headmaster's office during his second-period calculus class, not knowing what it was about as his Givin teacher's mumbled statement was cut off by the door closing. When he reached the office, he found his parents Tomar and Looway waiting for him along with the headmaster. They proceeded to explain to him that they had received test results back from a Chandrilan specialist who had examined him a month earlier. These results revealed that Karr apparently had a weak constitution and that all of the stress he was experiencing at his current school wasn't healthy for him. So, his parents and the headmaster arranged to have him transferred to a trade school in Taeltor Province located across the planet where his uncle would look after him. Karr protested and grew angry that none of them believed that he was Force-sensitive, but also because he perceived them as thinking he was weak and that because he was special, he was being treated differently. Despite his parents' protests against this assessment, he ultimately insisted on being allowed to return to class so that he could keep learning in the few weeks he had left before the term ended and he was transferred."}, {"tag": "p", "text": "After he left the office, he realized that he didn't want to return to class, and instead determined that he had to get kicked out of school in order to prevent his transfer. But as he was in the hallway pondering how to do something serious enough to accomplish this, he heard the sound of breaking glass in the science lab. When he investigated, he found Maize upset, having smashed a number of beakers and other similar glass pieces of science equipment. She initially refused to communicate the problem to him, but she finally revealed that her father had suddenly needed to leave for his work despite her belief that he would be around more and that she had been unable to even say goodbye to him. Karr then told her that he was going to be sent away, and she wondered if she could go with him, with his reply being uncertainty due to his special situation. At that moment, Namala Moffat (a teacher and the same one who had taken him to the headmaster's office the previous day) entered the room, and then left after stating that she was getting the headmaster. The two teenagers suddenly decided to leave the planet, as Maize explained that she knew how to pilot her father's shuttle thanks to him teaching her the basics. The two then locked the lab door and jumping out the room's window, escaping out onto the school grounds."}, {"tag": "h3", "text": "Journey to and time on Utapau"}, {"tag": "p", "text": "Karr and Maize made their way to her house so that she could pick up some things for the journey. On the way, she explained why her father had his own ship. Her father was a diplomat who specialized in technological systems, and in particular, interrogating captured spies and plugging holes they had exploited in First Order security. RZ-7 joined them at Maize's house with the Nuq Sin family landspeeder and they proceeded to the local spaceport where the yacht was kept. The ship took off without problems, and as they exited the planet's atmosphere, Karr lied to Maize when she asked him if he had ever been to space before, stating that he had been a few times in the past. Karr was then put on the spot when Maize asked where they were going, as she wanted to follow up on Karr's exploration of the Jedi as potential excitement for herself to participate in. Karr ultimately decided on Utapau, as it was the site of one of the last conflicts of the Clone Wars. He expressed concern about Maize's father catching them, though she stated that that was unlikely, and the conversation instead turned to Karr's family. Upon learning that his family were tailors, and that he was good at the skill, she expressed interest in someday wearing clothing he'd make, as he was a friend and his clothing was not something she could buy in a store."}, {"tag": "h3", "text": "Meeting his great-grandfather"}, {"tag": "p", "text": "Later in their journey, Sin, Maize, and RZ-7 arrived on the world of Pam'ba. There, Sin finally met the former Jedi who was his great-grandfather, Med, who had fled to the abandoned planet to keep his family safe from the Empire. After sharing stories with Sin, Med died at peace, having now learned his family was safe, the Jedi purge was over, and the Empire had fallen. Sin then took his great-grandfather's Jedi robes and lightsaber. Sin was now inspired to become a Force collector, meaning he would collect items and share the stories of the Jedi Order. Sin and his friends also burned his great-grandfather's home to leave no trace of the structure."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Sensitive to the Force, Karr Nuq Sin was skilled in the Force ability of Psychometry. The ability first manifested when he was thirteen and caused severe headaches and seizures accompanied by distorted visions of the past when he touched certain objects. He was unable to sense which objects would induce such visions, but through tutelage from his grandmother J'Hara and his own exploration into the Force, Nuq Sin learned to sense what objects had a past connected to the Jedi. His visions also grew more clear and he was able to see into a great expanse of the past without suffering pain so great that he lost consciousness. One of the objects Karr has a Force vision from was a Death Star medal. Maz Kanata gave the medal to Karr to test his ability, thinking she knew the medal's history. Karr reveals to Maz that the medal belonged to Luke Skywalker. Maz tells Karr that Han Solo gave it to her to settle a bar tab and claimed that it was his medal."}, {"tag": "p", "text": "Nuq Sin showed talent as a tailor, his family's profession, and eventually resolved to attend trade school and learn more of the craft. He also possessed the skill to build droids and combined parts of protocol, medical and astromech droids to build RZ-7, who served as both his friend and pseudo-medical droid. Though not a trained pilot, he learned how to adequately operate the First Order yacht Avadora from Maize Raynshi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Karr Nuq Sin first appeared in the young-adult novel Force Collector, which was written by Kevin Shinick and released in 2019 as part of the Journey to Star Wars: The Rise of Skywalker publishing line. The character went through several different names before Shinick finally settled on the name Karr Nuq Sin."}, {"tag": "p", "text": "Force Collector was released around the same time as the video game Star Wars Jedi: Fallen Order, a story that starred another young Force user with the power of psychometry, the Jedi Cal Kestis. According to Shinick, he wrote the first draft of the novel without knowing about Kestis' powers in the other developing project and only learned of it around a year before the book's release, in the same call that he was told certain aspects of the novel needed to be changed to avoid treading the same ground as Star Wars: Episode IX The Rise of Skywalker. What Shinick had already written was close enough to Star Wars Jedi: Fallen Order that only minor details of the rules and effects of the power needed tweaks to bring the two stories in line, such as the blinding white light Nuq Sin saw when touching an object to match what happens in the game when the player makes Kestis use his \"Sense Echo\" power."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}