{"url": "Antarian_pea", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Fruits and vegetables", "Category:Plants of undefined sentience"], "nodes": [{"tag": "h1", "text": "Antarian pea"}, {"tag": "p", "text": "Antarian peas were a species of shelled pea that could be eaten. The peas were grown in the gardens of the Jedi Temple on the planet Coruscant, and they were used in various recipes including Endorian chicken pot pie, which was served in the restaurant Dex's Diner on Coruscant."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Antarian peas were a species of pea, itself a variety of vegetable. They grew with shells that were removed prior to consumption. The peas could be eaten by members of the Besalisk species."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "On the planet Coruscant, Antarian peas were grown in the gardens of the Jedi Temple for use in cooking. At some point prior to her death in 19 BBY the Jedi Knight Jang Li-Li wondered if using the Force to shell the peas was an abuse of power while collecting vegetables on dinner duty with the Gran Jedi Master Maks Leem at the Jedi Temple. Before the destruction of Dex's Diner during Galactic Empire's first two years, Dexter Jettster, the Besalisk chef who owned the Coruscant restaurant, combined Antarian peas, celonslay, space carrots, and Endorian chicken meat inside a flaky Pom seed flour crust in his recipe for Endorian chicken pot pie."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Antarian peas were first mentioned in the 2004 novel Yoda: Dark Rendezvous, which was written by Sean Stewart. They were later mentioned in the StarWars.com Hyperspace exclusive article \"Dining at Dex's,\" which was released in 2009 and written by Gregory Walker in the style of an in-universe menu. The peas shared their name with the gas giant Antar, its moons Antar 4 and Antar 5, as well as the group known as the Antarian Rangers. Neither source that mentioned the peas made any connection between them and these other entities."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}