{"url": "Kashyyyk_clarion", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Wind musical instruments", "Category:Wookiee culture"], "nodes": [{"tag": "h1", "text": "Kashyyyk clarion"}, {"tag": "p", "text": "The Kashyyykk clarion was a type of musical wind instrument created by the Wookiee species of the planet Kashyyyk from the horn of a bantha. The clarions were used to summon Wookiees to gatherings but were also considered a piece of cultural art. During the Clone Wars, a clarion was sounded to summon Wookiees to defend the city of Kachirho against the droid armies of the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Kashyyyk clarion was a type of musical instrument created from a bantha horn. It was jacketed with patterns of hand-hammered bronzium plating and an orange lacquer finish, with cerulean gemstones set into the body. Immense lung capacity was required to sound a call from the clarion, which could then be heard as far as twenty kilometers (twelve miles) away."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Kashyyyk clarions were created by the Wookiee species of the planet Kashyyyk. The instrument was considered a piece of cultural art but also had an important function, as its bellow was used to summon Wookiees to gatherings. In the year 19 BBY, a clarion was sounded to summon Wookiees to defend the city of Kachirho on Kashyyyk from the Separatist Droid Army as part of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Wookiees young and old from all areas of the planet answered the call. At some point, an artist who was compiling a journal of sketches and stories drew a sketch of a Kashyyyk clarion. The sketch and a caption were included when the journal was restored, expanded, and displayed by the Graf Archive at some point after 34 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kashyyyk clarion was created as a prop for the 2005 prequel trilogy film, Star Wars: Episode III Revenge of the Sith, although it is not visible in the final cut of the film. The instrument first appeared in the new Star Wars canon in the 2016 reference book Star Wars: The Visual Encyclopedia. In the Star Wars Legends continuity, the instrument first appeared in the 2005 reference book Star Wars: Revenge of the Sith: The Visual Dictionary, which was written by James Luceno."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}