{"url": "Katana_fleet", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Galactic Republic fleets", "Category:Katana fleet"], "nodes": [{"tag": "h1", "text": "Katana fleet"}, {"tag": "p", "text": "The Katana fleet was a task force of two hundred Dreadnaught-class heavy cruisers launched by the Galactic Republic during its final decades of existence, as part of an attempt to restore the Republic Navy to its long-gone glory. The fleet, however, was lost on its maiden voyage when a hive virus drove its crews insane and the task force's captain jumped the ships blindly into hyperspace."}, {"tag": "p", "text": "Five years after the Battle of Endor, Grand Admiral Thrawn of the Galactic Empire convinced smuggler Captain Hoffner into providing the location of the long-lost task force. Having learned of Thrawn's target, the New Republic entered the race for the lost fleet as well. However, the Empire managed to escape with 178 of the prized ships before the Republic arrived."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "In its waning decades, the Senate of the Galactic Republic threw money at many grandiose projects. One of them, which was completed in 46 BBY, was the Katana fleet, a task force of two hundred Dreadnaught-class heavy cruisers, all carrying experimental AT-PT walkers. It was named after its flagship, the Katana. To counter the high-staffing requirements of such vessels, the fleet was extensively modified with full-rig slave circuitry, reducing the requirements to only about 2,200 per ship (instead of upwards of 16,000). To further distinguish the Katana fleet, Rendili StarDrive redesigned the entire Dreadnaught interior for the occasion, from the equipment and interior decor right down to the dark gray hull surfacing. The fleet earned the unofficial moniker \"the Dark Force,\" partly because of the hull color, and partly because of the reduced need for interior lighting allowed by the smaller crew complements. With its advanced slave-rig technology, the Katana fleet was positioned to herald a new era for military warships."}, {"tag": "h3", "text": "Disappearance"}, {"tag": "p", "text": "However, what should have been a demonstration of efficiency turned into a complete fiasco. One or more of the ships' crewmen picked up a hive virus at one of the ports of call on the fleet's maiden voyage. Said virus, which had the particularity of driving its victims insane just before it killed them, was spread throughout all two hundred Dreadnaughts while in dormant state. When it suddenly flared up, the virus took down nearly everybody at once. The infected crewers, instead of calling for help, slaved their ships together. Because of that, the Katana command crew also descended into insanity and jumped blindly into hyperspace, taking the entire fleet with them."}, {"tag": "p", "text": "Following that debacle, the Katana project became an embarrassment to the military echelons that had commissioned the fleet, and although that incident did not actually start the movement toward decentralization in automated ship functions, it certainly sealed its outcome."}, {"tag": "p", "text": "The incident made headlines for a time, with some journalists making sarcastic word-plays on the \"Dark Force\" name. For a few years, many enthusiastic salvage teams hunted after it, but to no avail, as trying to find a ship that had misjumped to some random location in the galaxy was practically impossible, and even two hundred ships could easily be lost within the vastness of space. By the time of the Clone Wars, the Republic's Senate Bureau of Intelligence surmised that the mastermind behind the hive virus had been Zeta Magnus, a genetic terrorist affiliated with the Confederacy of Independent Systems, who was himself the result of a freak experiment by the techno-lords of the Arkanian Dominion. The fleet eventually became a legend, to the point that some people believed it had never existed in the first place."}, {"tag": "h3", "text": "Rediscovery"}, {"tag": "p", "text": "The Dark Force remained undiscovered until smuggler Captain Hoffner and his ship stumbled upon it in 6 BBY. Hoffner and his navigator/sensor officer, Talon Karrde were the only ones aboard aware of the find, but neither realized the other person knew the secret. They each concealed the fleet's location until the right time to make use of it. Hoffner later arranged to sell individual Katana Dreadnaughts to Garm Bel Iblis, who eventually accumulated a strike force of six of the ships, including his command ship, Peregrine."}, {"tag": "p", "text": "By 6 ABY, the balance of power between the New Republic, Imperial Remnant, and warlord forces was so precarious that, despite their age, it was believed that any faction that recovered the fleet would immediately become the dominant force in the galaxy. The enormous potential value of the Katana fleet was used to draw the Imperial II-class Star Destroyer Eviscerator away as a prelude to the Second Battle of Borleias."}, {"tag": "p", "text": "In 9 ABY, nearly fifty-five years after the fleet's disappearance, Grand Admiral Thrawn became interested in obtaining the fleet. However, the Grand Admiral's actions turned Mara Jade against the Galactic Empire and she, along with Luke Skywalker, rescued Karrde from Thrawn's forces and brought the smuggler to the New Republic. Thrawn was nonetheless able to acquire the information from Hoffner, and though both sides secured some of the fleet during the Battle for the Katana fleet, Thrawn had acquired all but twenty-two of the Dreadnaughts before the New Republic forces arrived. These remaining vessels, except for the one Dreadnaught destroyed during the battle, became part of the New Republic fleet, along with the AT-PT walkers later used in the campaign against Thrawn. Initially, the New Republic believed Thrawn would not be able to take advantage of his new vessels, since he would require over three hundred thousand crewers for the Katana fleet—2,000 for each of the 178 ships. However, Thrawn proved to be more resourceful, using clones produced in days (instead of the years) from Spaarti cloning cylinders in the Emperor's storehouse on Wayland to crew his ships. Luke Skywalker and Talon Karrde estimated that Thrawn's clones were 'grown' to maturity in fifteen to twenty days instead of the typical year to three years. Clones grown this quickly were generally known to be mentally unstable, but due to the use of Ysalamiri and their Force-neutralizing abilities, Thrawn's clones could be grown to perfection in a fraction of the typical time without this side effect."}, {"tag": "p", "text": "Thrawn's acquisition of the Katana Dreadnaughts augmented his fleet's ability to the point that it was able to immediately attack more than twenty New Republic systems. In the later campaigns of Thrawn's fleet, it was a common vision to see a single Star Destroyer with several Dreadnoughts around, probably all from the Katana Fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Talon Karrde stated that the fleet was lost in 32 BBY (at the time of The Phantom Menace), but Captain Gilad Pellaeon set it at fifty-five years prior to the date of the story (which is set in 9 ABY.) The New Essential Chronology sets the fleet's launch following the Stark Hyperspace War, but does not implicitly state it was lost the same year, although the implication is that it was lost before 44 BBY. It is more likely that a high-ranking Imperial officer has the correct date than a smuggling chief, especially because Karrde said it was \"about ten years before the Clone Wars.\""}, {"tag": "p", "text": "However, Jorus C'baoth was listed as having been killed on board the Outbound Flight in the computer archives of the flagship, Katana. Since the novel, Outbound Flight, lists the deployment of the Outbound Flight as being in between The Phantom Menace and Attack of the Clones in 27 BBY, this means the Katana fleet either was lost after the Outbound Flight, or that the information in the Katana's computer about C'baoth was automatically updated after the Katana fleet was lost."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}