{"url": "Katarn/Legends", "categories": ["Category:Legends articles", "Category:Arboreal creatures", "Category:Creatures of Kashyyyk", "Category:Domesticated creatures", "Category:Predatory creatures", "Category:Reptomammals", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Katarn"}, {"tag": "p", "text": "A katarn was a predatory quadruped reptomammal native to the planet Kashyyyk."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "Katarns had slender bodies with rodent-like tails, and narrow faces leading back to a cartilaginous ridge protecting their neck and shoulders. Their paws had opposable digits, and their lower limbs were covered with sharp spurs, both of which allowed them to climb and hang from the branches of the giant wroshyr trees and feed on tree-burrowers."}, {"tag": "p", "text": "Katarns were creatures of great importance in the Wookiees' culture. The Wookiees, who called the katarn the \"Old Prince\", hunted them in their hrrtayyk ceremony. Wookiees said the katarns were born by a wound to Kashyyyk that fell from the sky ages ago and made a home for the katarn. The katarns then hunted the Wookiees, thus unlocking the Wookiees' \"inner fire\". To thank the katarn, the Wookiees hunted them. They believed that someday it would be the katarn's turn to hunt the Wookiees again."}, {"tag": "p", "text": "Katarns were ferocious and merciless predators which would track their prey for long periods before choosing an opportune moment to strike. They had been described as \"silent, shadowy, and deadly,\" qualities which made them the mascot of Judder Page's Katarn Commandos."}, {"tag": "p", "text": "Some katarns were domesticated as the war-mounts of Wookiee dragon troopers. On another note, there was a small subspecies of katarn that populated the Shadowlands. These katarns had no climbing abilities, as evidenced by their four large trunk-like legs. They also had two small dangling manipulator arms. They had more rounded out edges than the main katarn species and two large tusks. The reformed Revan battled several of these in his second trip to find the Kashyyyk star map."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}