{"url": "Katarn-class_commando_armor", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Clone trooper armor variants"], "nodes": [{"tag": "h1", "text": "Katarn-class commando armor"}, {"tag": "p", "text": "Katarn-class commando armor was armor used by clone commandos during the Clone Wars. It was named after the predatory animal from Kashyyyk. It weighed 20 kilograms and could cost up to 100,000 credits on the black market."}, {"tag": "p", "text": "This armor was more expensive and provided better protection than standard clone armor, due to the special composition and novel chemical properties of its armor plates, along with the inclusion of deflector shields. It was also designed for easy bacta injection via handheld dispensers. Katarn armor was often highly customized by the clone commandos who wore it."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Mark II Katarn armor, issued circa four months after the Battle of Geonosis, was reinforced against Verpine shatter guns and EMP weaponry, following recommendations made by Omega Squad after their tour on Qiilura."}, {"tag": "p", "text": "Mark III Katarn armor, issued circa ten months after the Battle of Geonosis, featured further enhancements, being blaster resistant against ordnance up to laser cannon rounds and light grenades. Night Ops armor first became available at this time."}, {"tag": "p", "text": "Several variations of this armor existed for different mission profiles. The ADSD Katarn armor was designed for deep-space and aquatic infiltration, featuring a fully-pressurized suit with a greater oxygen supply. Night Ops Armor featured a special stealth alloy that shielded the armor against sensors and made the wearer almost invisible to the naked eye."}, {"tag": "p", "text": "Later, during the Galactic Civil War, another version of Katarn armor was produced, although this resembled Phase II clone trooper armor and the name \"Katarn\" was probably just invoked as a reference to the vastly superior Clone Wars variant."}, {"tag": "h2", "text": "Specifications"}, {"tag": "p", "text": "While there were several variations of this armor, certain features remained constant."}, {"tag": "p", "text": "Helmet - The helmet of the Katarn-class armor had a HUD or heads up display that consistently displayed tactical data such as the location and distance to the target, the health of the wearer and the strength of the suit's shielding. The helmet could system link to others through the use of an internal communications antennae allowing each member of a squad to keep track of their comrade's health and location. Specialized internal sensors could detect the make, model, and relative accuracy of every weapon that a commando used, and could adjust the format of the targeting reticule for differing weapons. The Helmet had a built-in filtration system which could extract oxygen from toxic environments. The visor was designed to incorporate electrobinocular and night-vision modes.It also controlled the environmental features of the suit and had a tactical spot lamp."}, {"tag": "p", "text": "Body - The body of the armor boasted reinforced duraplast plating for defense against blaster fire and other anti-infantry weapons. Its design included resistance to extreme heat and cold. The suit could be fully sealed allowing a commando to survive in vacuum for up to 20 minutes. The knuckle plate of the armor featured a retractable vibroblade used for close quarter combat and covert encounters.It also contained multiple sensors, including touch induced sensors and environmental sensors as well. Additionally, it had a chronometer featured on the forearm plate."}, {"tag": "p", "text": "Backpack - The backpack featured specialized ammunition cartridges that held various types of ammo, and was reconfigurable for many different missions, such as an extra oxygen tank for aquatic and space-borne environments, a large bacta dispenser for augmented healing, or even an external communications array for long distance communications (i.e. subspace transmissions). The backpack usually carried: Explosives, ammo,medical gear,stealth gear, and either rations or gadgets used to survive in different operations. The backpack had a display on it that showed the last two digits of the individual commando's ID number."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}