{"url": "Katarn_armor", "categories": ["Category:Legends articles", "Category:Armor"], "nodes": [{"tag": "h1", "text": "Katarn armor"}, {"tag": "p", "text": "Katarn armor was a type of battle armor worn by clone commandos of the Grand Army of the Republic during the Kashyyyk campaign. It resembled Phase II clone trooper armor, and shared a similar name to the Katarn-class commando armor. It likewise shared its namesake, the predatory animal of Kashyyyk known as the katarn. Katarn armor included three variants, including patterns II, III IV and VII. Despite being a relic of the Clone Wars, Katarn armor saw some use during the time of the Galactic Civil War. The Galactic Empire, Alliance to Restore the Republic, and other non-aligned spacers made use of this armor. Around that time, a clone commando by the name of Mort gifted at least one of his suits of Katarn armor to an individual who enacted vengeance against one of his adversaries, a former commanding officer named Morkov."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Despite having a similar name to Katarn-class commando armor and its namesake predator, Katarn armor more closely resembled Phase II clone trooper armor. However, instead of a clean white appearance, the armor was patterned in different colors, depending on its type. For instance, the II patterned armor was mostly white, with blue markings on various pieces of the armor. The IV version was similar, except it had red markings and a black colored utility belt. Respectively, these two versions of armor somewhat resembled those worn by 501st Legion clone troopers and the special forces clone shock troopers. The VII variety differed the most, in that the armor was mostly black with greenish-yellow trim. This version somewhat resembled the armor worn by clone shadow troopers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the time of the Galactic Civil War, only the VII pattern of Katarn armor saw some use by the Galactic Empire. On the other hand, the IV models found their way into the hands of the Alliance to Restore the Republic, while the II variety was mostly used by neutral civilians and mercenaries."}, {"tag": "p", "text": "An ex-clone commando named Mort awarded at least one of his suits of Katarn armor to an individual who enacted vengeance against one of his adversaries, a former commanding officer named Morkov."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Katarn armor features in the MMORPG Star Wars Galaxies and was added to the game with the expansion pack Rage Of The Wookiees. It is a quest reward for completing the quest Avenging Mort, which is part of the Clone Relics quest series. The type of Katarn armor that a player receives for completing the quest depends upon which faction they are allied to, with Rebel-aligned players getting Mark IV, Imperial-aligned players getting Mark VII and neutral players getting Mark II."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}