{"url": "Kathol_(species)", "categories": ["Category:Legends articles", "Category:Races and species stubs", "Category:Kathol sector species"], "nodes": [{"tag": "h1", "text": "Kathol  (species)"}, {"tag": "p", "text": "The Kathol, also known as the Precursors or Cthol, were an ancient race who lived on the planet Kathol. It was believed that they were descendants of the Old Ones, who were the original inhabitants of the Kathol sector. They possessed organic technology and were a highly advanced civilization, proven when they created the Codex. Thousands of years before the Battle of Yavin, several Dark Jedi attempted to conquer the Kathol. They were defeated, but the Kathol were almost wiped out. Most of the Kathol were able to store themselves in the Lifewell, guarded by DarkStryder. Unfortunately, DarkStryder refused to release the Kathol after the danger had passed, and the Kathol were trapped in a form of limbo. Their life force became the mystical Ta-Ree energy."}, {"tag": "p", "text": "Only after DarkStryder was destroyed by the crew of the FarStar were the Kathol freed. However, they were unable to reclaim corporeal form, and instead chose to dissipate themselves. A few hundred decided to live, but were constantly at odds with each other."}, {"tag": "p", "text": "As mentioned, the Kathol possessed advanced technology and were capable of growing advanced biological machines. They crafted several servant species to serve them which included the:"}, {"tag": "p", "text": "The Darkstryder in turn crafted for itself a few servants which included the:"}, {"tag": "p", "text": "The name \"Cthol\" was considered a mispronunciation of \"Kathol\", but still continued to appear in common usage up to 4 ABY due to being written so in erroneous documents."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rough outline of the Kathol species is familiar to many HP Lovecraft and Dungeons & Dragons fans. Not only were the Kathol created for a type of source literature that is typically used for Dungeons & Dragons style roleplaying adventures, the Kathol themselves bear more than a passing resemblance to the story of Cthulhu, a fictional creation of Lovecraft. Indeed, the Kathol's name is even referenced in a manner similar to Cthulhu, written simply as Cthol. The Kathol species descend from the Old Ones, while Cthulhu is a member of the Great Old Ones. Both the Kathol and Cthulhu are imprisoned against their will in a remote region, one in space, and one on Earth. In addition, both the Kathol and Cthulhu have a form of cult-worship following; the Aing-Tii for the Kathol, and the Cult of Cthulhu for Cthulhu itself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}