{"url": "Kathol_sector", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Empire sectors", "Category:Kathol sector", "Category:Outer Rim Territories sectors"], "nodes": [{"tag": "h1", "text": "Kathol sector"}, {"tag": "p", "text": "The Kathol sector was a sector located in the Outer Rim Territories."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Home to the Pimbrellan League, Kathol Republic, and the Qektoth Confederation, the Kathol sector was located at the edge of the galaxy. The sector capital Kal'Shebbol was at its northern-most fringe. The sector was divided between the Kathol Outback, Kathol Rift and Marcol Void subsectors. The main routes that ran through it were the Trition Trade Route, the Galtea Run, and the Sebiris Run. Spatial phenomena included the Kathol Rift, the Blue Swirl, and the Marcol Void."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The sector was first settled nearly six hundred years prior to the Battle of Kal'Shebbol, when Galactic Republic colonists settled the planet Gandle Ott. Moff Kentor Sarne took control of the sector in 2 BBY, and ruled with an iron fist. In 4 ABY, following the death of Emperor Palpatine at the Battle of Endor, Sarne quietly withdrew the sector from the Galactic Empire and ruled it as his own holdings. New Republic forces began to liberate the sector in 8 ABY, beginning with the freeing of Kal'Shebbol."}, {"tag": "p", "text": "Han Olbeg represented the sector in the Imperial Senate. During Imperial rule, the sector was governed by Moff Kentor Sarne."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kathol sector serves as the setting for The DarkStryder Campaign, a four-books roleplaying campaign by West End Games. A first map (or astrogation chart) is included in The DarkStryder Campaign, depicting the upper part of the sector, it's capital, Kal'Shebbol, the Trition Trade Route, and the worlds around. The second book, The Kathol Outback hold three more maps, one for the Marcol Void and the Pimbrellan League, one for worlds between Marcol Void and Qektoth Confederation, and the last one for the Kathol Republic territory and the entrance to the Kathol Rift. Finally, the fifth map can be found in The Kathol Rift, and display a map of said spatial phenomena."}, {"tag": "p", "text": "All five maps were designed by Stephen Crane, and overlap each other. They use a common grind system, with letters N, E, S, W in Aurebesh indicating cardinal directions. Kal'Shebbol is located at coordinates 0,0, and the farther world, Demonsgate, is located between grids 57-58 South and 2-3 East. Put together, the maps goes from 3 North to 59 South, and from 16 West to 6 East."}, {"tag": "p", "text": "While the primary mission of the players, interpreting members of the FarStar crew, is to find Moff Sarne, one of their secondary objective is to explore the sector. They are provided by character Gorak Khzam with a limited chart, including a few planets close to Kal'Shebbol, and only a safe route up to Kolatill. Along the duration of the game, the players are to find new planet coordinates and hyperspace routes, updating their own chart as they progress."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}