{"url": "Katie_Purvis", "categories": ["Category:Real-world articles", "Category:Star Wars: Episode VI Return of the Jedi actors"], "nodes": [{"tag": "h1", "text": "Katie Purvis"}, {"tag": "p", "text": "Katie Purvis is an actress who played the \"Maternal Ewok\" in Star Wars: Episode VI Return of the Jedi. She is also the daughter of Star Wars actor Jack Purvis, and is good friends with Maureen Charlton."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Katie Purvis was born in England in 1966 with dwarfism. Katie inherited this condition from her father, Jack Purvis. She was 3 feet, 11 inches as an adult."}, {"tag": "p", "text": "Her first appearance in a mainstream movie was Terry Gilliam's extravaganza Time Bandits (1981), where she doubled for short actor Tiny Ross in a stunt in the movie. Other Star Wars actors featured in this project, including Katie's own father, Jack, as well as Kenny Baker (R2-D2), Mike Edmonds (Logray), Marcus Powell (Rycar Ryjerd), Declan Mulholland (Opun Mcgrrrr) and Malcolm Dixon (Ewok warrior)."}, {"tag": "p", "text": "Katie became a part of the Star Wars saga with her small but iconic role in Star Wars: Episode VI Return of the Jedi, where she portrayed the Maternal Ewok who held a wokling in her arms. Her father and many other actors of short stature were featured in that scene."}, {"tag": "p", "text": "Experienced in \"small creature\" roles, Katie was called again to act as a goblin in both Ridley Scott's Legend and Jim Henson's Labyrinth; as usual, acting as \"one of the small creatures,\" she met again with other actors from previous works."}, {"tag": "p", "text": "Katie was also one of the Nelwyns (alongside her father) in acclaimed film Willow (1988), and she appeared as a widget in Look-and-Read TV children's drama series Through the Dragon's Eyes in 1989."}, {"tag": "p", "text": "Katie Purvis also worked as a stand-in within Tim Burton's Sleepy Hollow (1999), where she stood in for Sean Stephens as Thomas Killian during the Headless Horseman's (Ray Park) attack on the Killian family house."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}