{"url": "Katooni", "categories": ["Category:Canon articles", "Category:Cleanup", "Category:Articles to be expanded", "Category:Females", "Category:Jedi trainees of the Jedi Order", "Category:Tholothians"], "nodes": [{"tag": "h1", "text": "Katooni"}, {"tag": "p", "text": "Katooni was a female Tholothian Jedi youngling who served the Jedi Order during the Clone Wars. Like all Tholothians, Katooni had a scaled scalp, with a half dozen pale fleshy tendrils hanging down the back of her head. She was very patient, as shown when she waited to complete her lightsaber. She was trusting, believing in Hondo Ohnaka when he told her he would help rescue Ahsoka Tano. She appeared to have a fear of heights, as she was reluctant to climb the cliff in the Crystal Cave on Ilum. While very kind, Katooni was not afraid to call out Petro on numerous occasions."}, {"tag": "p", "text": "At some point during the Clone Wars, Katooni participated in the Gathering. While on the training mission, Katooni and the other younglings, Petro, Zatt, Ganodi, Gungi, and Byph, had many adventures including a rescue mission to Florrum and a battle against Grievous and his droid army. After the younglings were reunited with the Republic, Ohnaka and Katooni shared a silent farewell. Ohnaka later owned a ship that had the same name as her."}, {"tag": "p", "text": "At the end of the war, Katooni was still at the Jedi Temple and was believed to have been killed when Darth Vader attacked the Temple."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Gathering"}, {"tag": "p", "text": "Katooni was a Tholothian Jedi youngling during the Clone Wars. She was in a Jedi Initiate Clan alongside Petro, Gungi, Ganodi, Byph and Zatt. At some point during the war, she and her class were chosen to participate in the Gathering, traveling to the planet Ilum under the supervision of Padawan Ahsoka Tano and astromech droid R2-D2 to collect kyber crystals for their own lightsabers."}, {"tag": "p", "text": "After entering the Ilum Jedi Temple together, the younglings were greeted by Grand Master Yoda, who opened the Crystal Cave for them. Inside the cave, the younglings split up, with Katooni and Zatt choosing the same doorway to search through. Katooni saw her kyber crystal at the top of a tall cliff, and had to overcome her fears to climb the cliff and claim the crystal. On her way out of the caves, however, she was trapped when the floor collapsed beneath her. Petro, who had been having a hard time finding his crystal, saw Katooni, but initially passed her by in his rush to find his crystal before the cave froze shut again. Only  he changed his mind and turned back to help Katooni break the ice that was trapping her did he find his crystal, telling Katooni to hurry and get out of the cave. Katooni was the penultimate youngling to finish the test."}, {"tag": "h3", "text": "Pirate attack and rescue"}, {"tag": "p", "text": "After returning to the Crucible, the younglings were instructed on lightsaber construction by the ancient architect droid Huyang. However, the Ohnaka Gang attacked the Jedi ship, taking Tano prisoner. After disobeying a direct order from Obi-Wan Kenobi, the younglings launched a successful rescue mission, traveling to Ohnaka's stronghold with a circus group and freeing Ahsoka. Soon after, Grievous attacked the planet and destroyed all of the Ohnaka Gang's fleet, leaving the younglings, Huyang, and Tano stranded."}, {"tag": "p", "text": "Katooni and the others launched an attack on the pirate stronghold, rescuing Hondo Ohnaka and his men. They then fled to the hangar, which housed Hondo's secret fleet. Hondo intended to leave Ahsoka and the others, who had engaged Grievous, though Katooni convinced him to return to rescue them."}, {"tag": "p", "text": "Later in the war, the Jedi Temple was bombed. Katooni and her friends, practicing lightsaber training with Master Tera Sinube, were present when Anakin Skywalker and Barriss Offee dueled after Skywalker discovered that Offee had masterminded the bombing and framed Tano for the crime."}, {"tag": "h3", "text": "Yoda's vision"}, {"tag": "p", "text": "In the final year of the Clone Wars, Yoda traveled to the Wellspring of Life in order to learn how to become a Force ghost, the Force Priestesses tested him with a journey through the Valley of Extinction. Inside, after encountering an illusion of the Jedi Temple attacked, with dead bodies including that of Petro, as well as a dying Tano, Yoda encountered an illusory Katooni who invited him into a version of the Jedi Temple where the war had never happened. The illusory youngling asked Yoda if the Temple was not beautiful. However, Yoda realized it was an illusion and rejected it."}, {"tag": "h3", "text": "End of the war"}, {"tag": "p", "text": "At the end of the war, Katooni was still at the Jedi Temple. When Skywalker, now the Sith Lord Darth Vader, attacked the Temple, Katooni was believed to have been killed alongside many others during the attack."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Long after the end of the Clone Wars, the Great Jedi Purge, and the rise and fall of the Galactic Empire, Hondo Ohnaka, by that time living in Black Spire Outpost on Batuu, owned a starship named Katooni."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Katooni was a female Tholothian, with blue eyes and dark brown skin with purple patches on her face. Her head was crowned with the bony crest characteristic of her species, with six tendrils handing down from it. She was 1.3 meters tall."}, {"tag": "p", "text": "Personality-wise, Katooni was cautious by nature. The Crystal Cave of Ilum presented her with a test where she had to overcome her fears by climbing a tall cliff to claim her kyber crystal, and when she and her friends wound up in danger, she attempted to be the voice of reason. She also occasionally doubted herself and her abilities, which led her to take longer to finish constructing her lightsaber than her friends. However, when the younglings were forced to team up with Hondo Ohnaka and his pirates, she ended up forming a strange friendship with the pirate captain, persuading him to help Tano and the others instead of abandoning them to General Grievous."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Katooni, as one of the top of her class, had reasonably advanced Force skills for her age. She was able to telekinetically break a thick sheet of ice while working with Petro, and was skilled enough at Force-assisted acrobatics to successfully pose as a circus performer. Katooni also held her own defending herself with her lightsaber during combat against battle droids and pirates."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Katooni wore brown and tan Jedi robes, and a traditional Tholothian headdress made of brown material lined with gold around her head. She wielded a blue-bladed lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Katooni was created and developed for the Star Wars: The Clone Wars animated television series. She was voiced by Olivia Hack."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}