{"url": "Katuunko/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Galactic Republic bureaucrats", "Category:Kings", "Category:Males", "Category:Planetary leaders", "Category:Toydarians"], "nodes": [{"tag": "h1", "text": "Katuunko"}, {"tag": "p", "text": "Katuunko was a male Toydarian who ruled as the king of the planet Toydaria prior to the rise of the Galactic Empire. During the Clone Wars, Katuunko was approached by Senator Bail Prestor Organa and Representative Jar Jar Binks of the Galactic Republic during their mission to deliver relief supplies to the contested world of Ryloth. Although Katuunko wished to help the planet's starving Twi'lek population, he was unable to formally support a Republic intervention force due to his planet's reliance on the Trade Federation, a corporation with ties to the Confederacy of Independent Systems. In an effort to both aid the Twi'leks and maintain the facade of neutrality, Katuunko allowed for relief supplies to be covertly shuttled to Ryloth via Toydaria. As Federation officials had no evidence of the king's complicity in the operation, Toydaria was allowed to remain neutral, but Katuunko decided that it was time for his people to ally themselves with one of the warring factions, so that his planet might be safe from other threats. He was soon contacted by the Republic's Supreme Chancellor Palpatine, who requested that the Grand Army of the Republic be permitted to use Toydaria as a supply base and staging ground in their war against the Confederacy. Katuunko proposed that negotiations between himself and a Republic envoy take place on Rugosa, a neutral moon near Toydaria."}, {"tag": "p", "text": "On Rugosa, Katuunko and the Toydarian royal delegation were greeted not by a Republic representative, but instead by Dark Acolyte Asajj Ventress of the Confederacy. While Ventress proposed an alliance between the king and the Confederacy, the Jedi Order's Grand Master Yoda and several clone troopers arrived at Rugosa but were forced to land on the moon in an escape pod after their ship was attacked by Confederate frigates. Although Ventress claimed the attack was proof of the Confederacy's superiority, Katuunko still wished to meet with Yoda, and so agreed to a challenge set forth by Ventress. If her troops were able to capture Yoda before he could reach the king, Toydaria would join the Confederacy; however, if Yoda managed to evade Ventress and her droids, the king would pledge his alliance to the Republic. While Yoda and his small force of clone troopers trekked across the coral moon of Rugosa, Katuunko became increasingly disturbed with Ventress's tactics and dishonesty, and eventually rejected the Confederacy's offer. Yoda and the troopers arrived just in time to prevent the Dark Acolyte from assassinating the king, which led the grateful Katuunko to promised his unwavering service to the Republic. Confederate Head of State Count Dooku held Katuunko in contempt for his decision to support the Jedi, and so dispatched his new apprentice, Savage Opress, to Toydaria to capture the king alive shortly after the Battle of Sullust. However, Opress disobeyed his Master and instead killed Katuunko by crushing his throat when the Toydarian king attempted to escape. When Dooku discovered this, he was extremely furious with Opress."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A question of allegiance"}, {"tag": "p", "text": "Katuunko was a male Toydarian who served as king of the planet Toydaria during the Clone Wars, the galaxy-wide conflict between the Galactic Republic and the Confederacy of Independent Systems. In 22 BBY, the Republic was able to broker a treaty with the Hutt crime lord Jabba Desilijic Tiure, which would permit Republic forces to travel freely through Hutt Space, a region that incorporated Toydaria. Although he was officially subservient to Hutt interests, Katuunko preferred to keep an independent mind in matters he could control. As such, he remained skeptical of the Republic's intentions in Hutt Space, as Toydaria was a strategically valuable world to both the Grand Army of the Republic and the Confederacy's Droid Army due to the fact that the world rested along major space lanes. However, this placement also put Toydaria under constant danger from pirate attacks from which the King sought protection, and Katuunko conceded that he would need to ally with one of the two warring factions. His plan was impeded by the Trade Federation, a pan-galactic megacorporation that Toydaria relied upon for commerce services. Although the Federation was a well-known affiliate of the Confederacy, the corporation's officials continued to claim that their goods were being utilized by the Separatist movement without authorization, and that they, like the Toydarian government, were a neutral institution in the conflict."}, {"tag": "h4", "text": "Torn between neutrality and morality"}, {"tag": "p", "text": "Later that year, Toydaria was visited by two members of the Republic's Galactic Senate—Senator Bail Organa of Alderaan and Associate Planetary Representative Jar Jar Binks of Naboo. Both worlds had a long history of charitable endeavors and humanitarian causes, and the two politicians were now focusing their efforts on aiding the Twi'lek population of Outer Rim planet Ryloth, which was suffering from severe starvation and a lack of medical supplies due to a Confederate blockade in orbit of the world. They had been encouraged by the High Council of the Jedi Order to seek aid from the government of Toydaria, as Katuunko's world was not far from Ryloth. The king welcomed the two visitors to his palace in a formal gathering of his ministry council, but chided Organa and Binks for requesting assistance from Toydaria, as the world was not part of the Republic. However, as they explained the urgency of the situation to him, Katuunko and his ministers became open to the idea of providing aid to the Twi'lek people."}, {"tag": "p", "text": "Organa and Binks's progress was derailed by the sudden arrival of Lott Dod, the senatorial representative of the Trade Federation and a secret backer of the Confederate cause. Dod had received word that Republic representatives would make an attempt to persuade Katuunko to provide relief to Ryloth, and so traveled to the Toydarian homeworld to intimidate the king. Upon his arrival, Katuunko granted him an audience alongside Organa and Binks and proceeded to hear his argument that Toydaria's interference with a Confederate blockade would force the Federation to cease business with the world. As Organa had as of yet neglected to mention the blockade, Katuunko was forced to rescind his earlier offer of assistance and convene his ministers to hear a formal debate between Dod and Organa over the matter."}, {"tag": "p", "text": "Once the senators had prepared their arguments, Katuunko called the debate to order and allowed Organa to make his case. The Alderaanian explained that the mission to Ryloth was purely humanitarian and that the Republic had no interest in bringing Toydaria into conflict with the Confederacy. He supplemented his claims by presenting to the ministry council a transmission from the Senator of Ryloth, Orn Free Taa, who explained the ruin that had befallen his home planet and the crisis now faced by his people. While one of the king's ministers was convinced of the need to help Ryloth, another cautioned that their compassion must not be allowed to draw Toydaria into the war. Katuunko then allowed Dod to present his argument, which the senator did by accusing Organa of deceit and providing images of the battle on Ryloth's surface between the Republic's clones and the droids of the Confederacy. Furthermore, Dod argued that the Separatist Senate would see it as an overt violation of Toydaria's supposed neutrality, which would lead Trade Federation vessels working with Toydaria to become targets for Separatist attacks."}, {"tag": "p", "text": "Although Organa attempted to make one final argument on behalf of the Twi'leks, it was ultimately in vain. Katuunko was forced to reject the senator's request for aid in the interest of protecting his people, but found himself regretting the decision due to his people's noble values. After announcing his choice before his ministers and the senators, Katuunko left his hearing chamber to catch Senator Organa before he and Binks left Toydaria. The king conceded that he could not, in good conscience, leave the Twi'leks to suffer, and so informed them that he would allow for the Republic to use Toydaria to make a covert transfer of the supplies Organa had brought with him. Although the Alderaanian was disappointed that Katuunko would not allow for more relief supplies to be brought in, he accepted the offer and promised that he would prevent the Federation from learning of Katuunko's complicity in the mercy mission. To that end, Organa arranged for a state dinner to take place so that Senator Dod would be distracted from the Republic Pelta-class blockade runners departing from Katuunko's palace. While the Alderaanian led the effort to load the supplies onto the ships, Representative Binks remained with Katuunko and Dod and created a conceptual art piece to keep the dinner's attendees attention. The gambit was successful, and although Dod accused Katuunko of having helped the Republic after hearing the Twi'leks had received supplies from Republic ships, he had no evidence to support the claim. Because of his favorable experience in working with Organa and Binks, Katuunko informed the two that he would be open to allegiance negotiations with the Republic."}, {"tag": "p", "text": "Sometime after the Ryloth matter, Katuunko was contacted by Supreme Chancellor Palpatine of the Galactic Republic while traveling in his personal star yacht, the Thief's Eye. The Chancellor informed Katuunko that the Republic had need of Toydaria, and wished to use the planet as a staging ground for the war effort. Although he preferred not to join the Confederacy, the king, a potentially important Republic ally in the war, was still unwilling to throw support blindly to the Republic, and so proposed a diplomatic rendezvous for negotiations to the Chancellor, under the condition that Toydaria would not be strong-armed into an agreement under threat of force. The Chancellor agreed; however, Katuunko had one additional request: the Republic emissary was to be a member of the Jedi Order, as the king had always been interested in meeting a Jedi. Palpatine did not want to dispatch a Jedi to Toydaria, as the world was close to Confederate space. Katuunko used a chance cube to select Rugosa, a moon near Toydaria, as the site of the negotiations. Palpatine agreed to the king's conditions, and Grand Master Yoda of the Jedi Order was dispatched to serve as the Republic's ambassador."}, {"tag": "p", "text": "Unbeknownst to both Katuunko and Palpatine, their communication had been intercepted by the Confederacy's newly constructed Skytop Station, a listening outpost in the Hoth's Brand system. Count Dooku, the Confederacy's Head of State, hoped to make Toydaria an ally of the Confederacy, and so dispatched his apprentice, the Dark Acolyte Asajj Ventress, to initiate negotiations on his behalf."}, {"tag": "h4", "text": "Negotiations on Rugosa"}, {"tag": "p", "text": "As the Thief's Eye arrived on Rugosa, Katuunko and two of his guards were greeted by Asajj Ventress and a pair of B1-Series battle droids. Ventress presented the Toydarian royal delegation with a communication from Count Dooku himself, who claimed the Jedi were incapable of protecting themselves and therefore would be unable to protect Toydaria. To reinforce his point, the Count laid a trap for the Republic diplomatic cruiser, which had arrived in orbit moments before. The cruiser, which carried Jedi Master Yoda and a small contingent of clone troopers for security, came under heavy fire from two Confederate frigates. The Republic vessel was forced to retreat; however, Master Yoda refused to abandon his mission, and boarded an escape pod along with the clone troopers Thire, Jek, and Rys. The pod was launched to the moon's surface shortly before the cruiser made its escape."}, {"tag": "p", "text": "On Rugosa's surface, Katuunko debated with the Count over the abilities of the Jedi and the droid army. After Dooku ceased his communication, the king witnessed the Republic cruiser retreat into hyperspace, and it was assumed the Jedi had abandoned the negotiations. Ventress hoped the retreat would seal Toydaria's fate as a Confederate world; however, she was interrupted by a communication from Master Yoda, whose escape pod had just landed not far from the king, in the coral forests that covered most of Rugosa. As King Katuunko informed Yoda of Dooku's proposal, Asajj Ventress suggested that Toydaria's alliance be decided by a challenge of Yoda's skill. She proposed that she would send her best droid troops to capture the Jedi Master; if Yoda managed to escape, Toydaria would join the Republic. However, if Yoda was defeated, Katuunko would consider an alliance with the Confederacy. The king protested the contest, as he did not request the Jedi's presence for him to fight; however, the Grand Master agreed to the terms before ending his communication. The king insisted on a term of his own to Ventress— Yoda was to be given a fair fight. Ventress agreed, however she had no intention of keeping her word, as a C-9979 troop ship soon landed and began deploying a full battalion of battle droids and Armored Assault Tanks tasked with hunting down the Jedi Master."}, {"tag": "p", "text": "King Katuunko remained alongside Ventress and monitored the Jedi's progress through his rangefinder as the droids chased Yoda and the clones through the coral forests. Ventress received regular updates on the mission from her droid commander, 224, while Master Yoda would periodically contact the king. Katuunko repeatedly debated with Ventress on the likelihood of Yoda's success, angering her until she eventually destroyed his communicator with her bare hand. During their trek to the rendezvous point, Yoda and his clones seemingly became trapped after entering a canyon while followed by a column of droids and tanks. Yoda revealed himself to the droids, who surrounded the Jedi and contacted Ventress for orders on how to proceed. Instead of capturing the surrendered Jedi Master, Ventress ordered that he be fired upon. Katuunko witnessed the ensuing skirmish from afar, commenting that Master Yoda's surrender was generating an unusual amount of smoke. After Ventress learned of 224's destruction at Yoda's hand, the king claimed that all rumors about the power of the Jedi were true, provoking the Dark Acolyte to break the terms of the competition and order droidekas to enter the battle."}, {"tag": "h5", "text": "Assassination attempt"}, {"tag": "p", "text": "Despite Ventress's efforts, Yoda and the clones were able to destroy all of the droids and continue their journey. King Katuunko, fully convinced that the contest was over, contacted Count Dooku to inform him that his allegiance would be given to the Republic. Although Dooku urged the king to reconsider, Katuunko was adamant in his support of the Republic, and claimed he would not deal with those who broke their word, as Ventress had when she broke the terms of the competition by attempting to overwhelm Yoda with the droidekas. Dooku decided that negotiations with Katuunko's successor would be more productive, and ordered his apprentice to kill the Toydarian. Both royal guards moved to defend their king, but Ventress deflected their blasterfire and Force-pushed them away before moving to kill the king with her paired lightsabers; Katuunko closed his eyes as she swung, then opened them to see why he wasn't dead : Ventress had been stopped mid-strike by Master Yoda, who had arrived just in time to telekinetically halt her attack with the Force. After Ventress was disarmed and her droid escorts were destroyed by Yoda's clone troopers, Yoda encouraged her to surrender. However, Dooku's minion had no intention of being captured by the Republic, and detonated explosives she had planted on a hill beside Katuunko, causing a landslide and also damaging his star yacht. While Master Yoda used the Force to halt the falling rocks and save the lives of his clones and the king, Ventress escaped Rugosa on her solar sailer."}, {"tag": "p", "text": "With the Confederacy no longer on Rugosa, Master Yoda hoped to begin negotiations with King Katuunko. However, Katuunko claimed negotiations were unnecessary, as Master Yoda had proven himself and the Republic worthy of Toydaria's faith. The king unsheathed a ceremonial Toydarian sword and presented it to Yoda, entrusting the protection of his planet to the Jedi and proclaiming the Toydarian people to be at the service of the Republic. Shortly after, Katuunko was ferried up to a Republic Venator-class Star Destroyer in an LAAT/i gunship alongside Yoda, the clones, and the Toydarian guards. Katuunko would later have the Thief's Eye recovered and repaired afterwards."}, {"tag": "h3", "text": "The price of loyalty"}, {"tag": "p", "text": "As a Republic member world around 21 BBY, Toydaria was granted representation in the Galactic Senate. Katuunko was part of the Toydarian senatorial delegation when Senator Halle Burtoni of Kamino proposed that the Senate approve legislation that would increase the production of clone troops. Although Burtoni's proposal was widely supported, an opposition faction organized by Senators Onaconda Farr and Padmé Amidala introduced a bill to the Senate that would decrease military spending within the Republic and halt the production of clone troopers. Senator Amidala herself took to the Senate floor twice, once to attack Burtoni's bill and once more to appeal to her colleagues for more votes in support of her and Farr's. Katuunko was present in the Senate's Grand Convocation Chamber as Amidala made her addresses, which were both met with much praise. In the following days, the Senate was wracked by intrigue with the deaths of Senator Farr and Umbaran Senator Mee Deechi. Despite the strange turn of events, the vote on the bill proceeded, and Amidala's and Farr's resolution was turned down."}, {"tag": "p", "text": "The king was once again holding court within his palace on Toydaria shortly after the Battle of Sullust. Around this time, Asajj Ventress was betrayed by Dooku and replaced with a new apprentice, the Zabrak Nightbrother Savage Opress. The Count still held a grudge with Katuunko for the Toydarian's refusal of allegiance during the Rugosa negotiations, and so planned to have his apprentice travel to Toydaria and kidnap the king in an attempt to force Toydaria to align with the Confederacy. Opress arrived on the planet and was confronted by a number of Toydarian guardsmen, but the Zabrak slew them all as he cut a path towards Katuunko's throne room. The king was informed by one of his protectors of Opress's approach, and ordered two guards to stop the intruder. As they moved towards the door, it was blasted inwards and killed them. As Katuunko watched in shocked horror, a demonic figure with a red double-bladed lightsaber emerged through the smoke and, although his royal guards attempted to kill the intruder, the Nightbrother slew them all before attempting to moving against Katuunko himself. Though displaying evident fear towards this assassin, the king refused to be intimidated by such brute force and drew his ceremonial Toydarian sword against his assailant. He managed to dodge one of Opress' strikes but his sword was easily destroyed by Opress's double-bladed lightsaber when he attempted to fight back. Knowing he could not stand against the Zabrak, Katuunko attempted to fly away, but his leg was seized by Opress and he was thrown against a wall. With the Toydarian rendered unconscious, Opress slung him over his shoulder and attempted to make his way out, but was intercepted by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker, who had been hunting for the apprentice. Savage engaged the two Jedi with the king still unconscious on his back, but was overwhelmed by the Jedi during their short but fierce duel. While Dooku's assassin was distracted, Katuunko awoke and attempted to flee, but was caught by Opress in a telekinetic Force choke-hold. Although Kenobi and Skywalker attempted to pin down the Zabrak and take him into custody, Opress held onto Katuunko, eventually crushing his throat and killing him."}, {"tag": "p", "text": "Katuunko's body fell to the floor of his throne room before it was grabbed by Opress and dragged out of the palace during his escape from the Jedi. Savage ferried the king's body up to Count Dooku's Confederate destroyer in orbit, where he presented the deceased monarch to his Master. Dooku, who had hoped to force Katuunko to change his allegiance to the Confederacy, was furious with his apprentice, as a dead Toydarian king was useless to him. Katuunko's assassination ultimately resulted in a three-way duel between Dooku, Opress, and an avenging Asajj Ventress."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although his position as Toydarian king placed him as a servant of the Hutts, Katuunko did what he could to remain independent. He was also strongly compassionate and cared deeply for his world; he was willing to side with the Separatists if it meant keeping his people safe from the carnage of the Clone Wars, but preferred neutrality above other options. He was shrewd enough to understand the lucrative position his world held for the Republic and Confederacy. The king also understood that this position put Toydaria under constant threat, and he would need an alliance with one of the major galactic powers in order to protect his people. Although Katuunko was preferential to the Republic and supported its humanitarian causes, he was skeptical of its intentions in Hutt Space and so was unwilling to blindly enter into a Republic treaty."}, {"tag": "p", "text": "Katuunko instead allowed for negotiations to take place; however, he insisted that military power was not to be used to force an agreement, and he refused to take part in negotiations at blaster point or with warships orbiting overhead. While the king was surprised with being greeted by Dooku and Ventress on Rugosa, he did not send them away, as he wished the best for his people and wanted to join whichever faction could offer Toydaria the best protection, whether it was the Confederacy or the Republic. Although Katuunko was displeased with the contest on Rugosa, he permitted it to take place, as he wished to see a show of force from both the Confederacy and Republic."}, {"tag": "p", "text": "The Toydarian monarch exhibited a strong sense of humor, even in a serious situation such as the Mission on Rugosa. After seeing the carnage immediately following 224's report of Yoda's surrender, Katuunko commented, \"That's a lot of smoke for a surrender.\" His curiosity and fascination with the Jedi allowed the Republic's mission to succeed, but his dedication to honesty and honor almost resulted in his death. After informing Count Dooku of his aversion to the Confederacy's tactics of deception and intimidation, he was nearly assassinated by Asajj Ventress. However, even with two lightsaber blades inches from his head, Katuunko remained undaunted. It was his bravery and dedication to honest competition on Rugosa that ultimately cost him his life—Count Dooku held a grudge against the monarch for his decision to side with the Jedi, and so sent his apprentice to capture him alive."}, {"tag": "p", "text": "When Opress arrived at Toydaria and began to cut a swath through the king's defenders, Katuunko chose not to flee immediately; instead, he remained on his throne up until the Zabrak moved against him personally and even informed the lightsaber-wielding assassin that he would not be intimidated by displays of brute force. The king drew his ceremonial Toydarian sword to defend himself, but ultimately to no avail. Katuunko was killed when he finally decided that escape was his only remaining option."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Katuunko first appeared in the online comic Prelude, which served as a preview for the first episode of the Star Wars: The Clone Wars television series on Cartoon Network, \"Ambush.\" The Toydarian monarch later returned to the series in the season two episode \"Senate Murders,\" although he had no speaking parts, and once again in the third season episode, \"Supply Lines.\" Katuunko played a major role in \"Supply Lines,\" which served as a prelude to season one's \"Ambush.\" The king was again seen briefly in the episode \"Pursuit of Peace,\" which served as a prelude for \"Senate Murders.\" The Toydarian monarch was killed in \"Witches of the Mist,\" the third and final chapter of Season Three's \"Nightsister trilogy.\""}, {"tag": "p", "text": "In the episodes, Katuunko is voiced by Brian George, who would return throughout the series to portray a number of other characters, including Pantoran Chairman Chi Cho in the episode \"Trespass.\" Katuunko was designed to be clearly different visually than any other Toydarian in the Star Wars saga, particularly Watto from Star Wars: Episode I The Phantom Menace. The intentional variations included his large stomach, his unusual beard, and his rangefinder inspired by the Flash Gordon series. Katuunko also appears as a non-playable character in the 2011 video game LEGO Star Wars III: The Clone Wars, which portrays the plot of \"Ambush\" in a comical and non-canon manner."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}