{"url": "Katuunko", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Kings", "Category:Males", "Category:Toydarians"], "nodes": [{"tag": "h1", "text": "Katuunko"}, {"tag": "p", "text": "Katuunko was the King of the planet Toydaria and the Toydarian species during the Clone Wars. With honesty and his people's safety as his greatest concerns, he initially kept his homeworld neutral in the conflict, but after agreeing to aid the suffering Twi'leks of the planet Ryloth when asked by the Galactic Republic he decided it was time to make a choice. After meeting with Senator Bail Organa of Alderaan and Junior Representative Jar Jar Binks, he agreed to let the Republic use Toydaria as a staging area to support supply missions to Ryloth, despite the Trade Federation's Lott Dod opposing such action."}, {"tag": "p", "text": "Katuunko arranged for a secret meeting between the Toydarian Royal Delegation and Jedi Grand Master Yoda on the neutral moon of Rugosa, but the arrangement was discovered by the Confederacy of Independent Systems and Sith apprentice Asajj Ventress was sent to disrupt it. Yoda successfully defeated Ventress's forces and earned the Toydarian allegiance, after which Katuunko began representing the Toydarians in the Galactic Senate."}, {"tag": "p", "text": "Count Dooku eventually arranged for Ventress's replacement, Savage Opress, to capture Katuunko alive but the apprentice killed the King instead by force choking him, and throwing his corpse to the ground in the Toydarian Throne Room. When Dooku found out about this, he became infuriated with Savage."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Katuunko had to be convinced to join the Republic's cause, but remained primarily focused on the governing of Toydaria. Despite this deal with the Republic, he tried to let the Republic and the Separatists both have a chance to win his allegiance. Katuunko was able to wield a sword to some degree, but was no match for Savage Opress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Katuunko first appeared in \"Ambush,\" the first episode of the animated television series Star Wars: The Clone Wars' first season, which originally aired on October 3, 2008. He was voiced by Brian George."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}