{"url": "Kazz", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Imperial Navy admirals of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kazz"}, {"tag": "p", "text": "Kazz was an admiral in the Galactic Empire. A Human male, he was in command of an Imperial-class Star Destroyer in 3 ABY that took the Argazdan known as Doctor Raygar to the Forest Moon of Endor, where the scientist hoped to find the Sunstar, a gem with magical powers, for Emperor Palpatine. Despite Kazz's incredulity about the Sunstar's supposed powers or even existence, the venture was successful in that Raygar stole the Sunstar from its guardians, a group of Ewoks. Nevertheless, Raygar refused to show the gem to anyone but the Emperor, who was already on his way to the Endor system. When Raygar's droid servant, PD-28, arrived on the destroyer in an escape pod, Kazz dismissed the droid's claim that he had escaped capture by the Ewoks. Kazz ordered the droid to be recycled, not knowing that PD-28 had smuggled a group of Ewoks onto the starship to recover their lost gem."}, {"tag": "p", "text": "As Kazz manned the Star Destroyer's command bridge, Raygar attempted to use the Sunstar's power to kill Palpatine aboard the Emperor's shuttle and take control of the Empire. However, the plot was thwarted by the Ewoks, who took the Sunstar and escaped from the destroyer back to Endor. Raygar's betrayal now revealed, Kazz had the academic arrested for high treason against the Empire. The admiral, who had not seen the Ewoks or the Sunstar, believed that Raygar had fabricated the story of the magical artifact as part of his treachery; accordingly, the admiral handed the Argazdan over to the Emperor's custody for punishment."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Admiral in the Empire"}, {"tag": "p", "text": "Kazz was a Human male who held the rank of admiral in the Navy of the Galactic Empire. In 3 ABY, Doctor Raygar, an Argazdan scientist affiliated with the Empire, sought to launch an expedition to the Forest Moon of Endor, where the Sunstar, a gem with supernatural powers, was rumored to be located. After the academic's planned mission gained the approval of Galactic Emperor Palpatine, Kazz, in command of an Imperial-class Star Destroyer, was assigned to escort Raygar to Endor. Highly skeptical about the very existence of the Sunstar and its supposed guardians, known as Ewoks, Kazz believed that Raygar's plan was just another foolish idea from the scholar, whom Kazz openly despised. Nonetheless, the admiral received Raygar aboard the Star Destroyer and brought him to the Endor system in the Outer Rim Territories."}, {"tag": "h3", "text": "Mission to Endor"}, {"tag": "p", "text": "Kazz maintained his suspicion of Raygar and his mission up to the very moment the Argazdan scientist departed the Star Destroyer for the forest moon in his freighter with a team of large droids and a smaller droid servant, PD-28. Nevertheless, Raygar eventually returned to the Star Destroyer and claimed that his mission had proven a success, and refused to show the Sunstar to anyone but Palpatine himself. Kazz revealed the Emperor was already on his way to the Endor system to examine the artifact."}, {"tag": "p", "text": "Kazz next dealt with an Imperial escape pod that approached the destroyer from the moon. Its pilot identified himself as Raygar's droid, PD-28, who claimed that he was returning to serve his master. In truth, the droid had defected from the Empire and was now helping the Ewoks retrieve their stolen Sunstar. Unaware that the pod contained four Ewoks, Kazz allowed the pod to land in the destroyer's hangar. The small droid told Kazz that he had been captured by Ewoks and managed to escape with the pod—a falsehood. The admiral scolded the small droid for incompetence for being captured in the first place, and he ordered a larger droid to take PD-28 to be recycled."}, {"tag": "h3", "text": "The Emperor's arrival"}, {"tag": "p", "text": "Meanwhile, Doctor Raygar decided to assassinate Palpatine with the Sunstar's unlimited energy and take his place as the new Emperor. With the gem, he swiftly constructed a cannon that used the Sunstar as its power source. However, one of the Ewoks attacked Raygar, and during the scuffle, the Argazdan accidentally launched the cannon. The blast grazed Emperor Palpatine's shuttle, which was just landing in the destroyer. Kazz was appalled by the attack and ordered three stormtroopers to find and arrest the unknown assailant."}, {"tag": "p", "text": "The Ewoks were able to reclaim the Sunstar from Raygar and left the Star Destroyer in the same escape pod in which they had arrived. Raygar tried to give chase, but he was halted and arrested by the troopers Kazz had sent and was taken to the admiral, who waited in the hangar. Kazz charged the scholar with high treason against the Galactic Empire for his attempted assassination of the Emperor. Raygar's protests failed to sway the admiral, as Kazz had not witnessed the Ewoks aboard the ship, nor even seen the Sunstar; Kazz concluded that the Sunstar had never existed, and that it had been nothing more than a part of Raygar's treacherous plot to kill the Emperor. As Palpatine's damaged shuttle landed in the hangar, Kazz turned his captive over to face the consequences of his treason."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As an admiral in the Imperial Navy, Kazz was loyal to Emperor Palpatine. He was shocked upon the discovery that Raygar was plotting to eliminate the Emperor, and he had the scientist arrested immediately. He took pleasure in informing Raygar about his impending punishment, and he ignored the academic's pleas for mercy. Kazz looked down upon those whose usefulness to the Empire he doubted. Kazz dismissed Doctor Raygar's mission for the Sunstar as fanciful, and he scolded the Argazdan about the frivolity of the plan. Similarly, when PD-28 claimed he had been captured by Ewoks, Kazz believed that a proper Imperial droid would never have suffered such an fate; accordingly, he called the droid useless and ordered him to be recycled into something more worthwhile. Kazz also questioned Endor's importance to the Empire, erroneously referring to the forest moon as a planet."}, {"tag": "p", "text": "Kazz was not a superstitious man. He believed the magical Sunstar was just a foolish idea of Raygar's imagination, even though the Emperor had approved the scientist's search for the gem. Kazz made his opinions clear to Raygar, and he warned the Argazdan of the fate that would befall him if the Sunstar's powers were exaggerated. After Raygar's plot to seize power failed, Kazz concluded that the gem had indeed been a hoax."}, {"tag": "p", "text": "Kazz had brown hair and black eyes. He wore an olive-gray Imperial military uniform and cap. The suit included his rank insignia, which consisted of two code cylinders and three blue squares above three red squares, a pattern that contrasted with the standard rank insignia of the Empire's other admirals. During his time in the Endor system, Kazz was often accompanied by an escort, which consisted of either Imperial stormtroopers or one of the large droids."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Admiral Kazz's first and only appearance was in the Ewoks episode \"Battle for the Sunstar,\" which was written by Paul Dini and directed by Raymond Jafelice, and which first aired on December 6, 1986. While the spelling of the character's name was ambiguous in the episode, Leland Chee confirmed in a message on StarWars.com that the name is spelled \"Kazz.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}