{"url": "Kedpin_Shoklop", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Businesspeople", "Category:Males", "Category:Wermals"], "nodes": [{"tag": "h1", "text": "Kedpin Shoklop"}, {"tag": "p", "text": "Kedpin Shoklop was a Wermal male who spent one hundred and two years in his trade as a vaporator salesbeing at VaporTech. He won a trip to the casino city of Canto Bight after being awarded Vaporator Salesbeing of the Year. It was his first vacation in a century. Upon arriving, he ended up spending a night with the criminal Anglang Lehet."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Life"}, {"tag": "p", "text": "Shoklop was born on Werma Lesser. Later on in his life, he became an employee of VaporTech, where he sold vaporators for one hundred and two years."}, {"tag": "h3", "text": "Canto Bight"}, {"tag": "h4", "text": "Cheating the System"}, {"tag": "p", "text": "For numerous decades, Kedpin had worked incredibly hard for Vaportech to try and become \"Vaporator Salesbeing of the Year\", but never did. He had come to learn that those who won were either higher management or favored employees. In 34 AB he decided to hack into the computer which chose the winners of the competition, and rigged it so that he would be revealed the winner for that year. Everybody was surprised to know that he had won, and although management knew he had cheated, they took no action against him over the fear that other staff might realize the competition was rigged."}, {"tag": "p", "text": "Kedpin's prize was an all expenses two week vacation on Cantonica, in the casino city known as Canto Bight. He was excited over the prospect as he was finally able to do things he had always wanted to do, such as experience a zero-g massage and most importantly watch a real live fathier race, which he had only ever seen on screens."}, {"tag": "h4", "text": "Arrival on Canto Bight"}, {"tag": "p", "text": "Kedpin grew up very polite and troublesomely trusting, and upon arriving at Canto Bight, Kedpin had received a harsh time from the start because of it. Firstly he was almost detained for not having a sponsor chip, had his luggage detained for not having a luggage pass, which later turned out to be a scam and had his luggage stolen, and trusted the wrong droid who also scammed him of his money in a bathhouse. Eventually he found his way to his hotel, where he was able to relax for a few hours in his hotel room and at another spa, where he was able to finally have a zero-g massage."}, {"tag": "p", "text": "Later on the same day, he was stopped by two creatures who looked alike, who tried to tell him there was a problem with his hotel room. This was when a Caskadag named Anglang Lehet stepped in to warn him that they were about to scam him. Anglang stated that they go for a drink, which Kedpin was more than happy to oblige for helping him. Not realizing Anglang's true intentions, the two enjoyed a drink in a bar, where without him realizing, Anglang placed a detonator into Kedpin's drink and smuggled fake spice onto his back, then proceeded to contact the CBPD. Moments after Anglang stated he had to slip away for business, the CBPD stormed the bar and arrested Kedpin for spice smuggling."}, {"tag": "h4", "text": "Arrest"}, {"tag": "p", "text": "Kedpin was taken to the CBPD where he was interrogated by a brute police officer named Officer Brawg. Though Kedpin was actually innocent, Brawg beat up Kedpin and demanded he give him a name of his work partner. Realizing he had been set up, possibly by anybody he might had met during the day, he refused to give anybody up. He found himself in a cell the following day, where he realized he must have been knocked out cold. He heard the voices of Brawg and none other than Anglang, who had come to set him free."}, {"tag": "p", "text": "Upon leaving the station, Anglang explained he had tried to kill him by placing a detonator in his body; this was in order to try and kill Officer Brawg, who numerous people wanted dead. As the two entered down an alleyway, the pair were cornered by the group who had hired Anglang known as the Old City Boys who wanted to kill Anglang for not completing the job. The group allowed Kedpin to escape, but as he ran he heard all the commotion behind him. Realizing Anglang was losing and that he had saved him, even though he tried to kill him, Kedpin stormed back into the alley and tried to fight, though was only knocked back. This however served as a brief distraction, as Anglang grabbed a stun stick from one of the group and knock the rest out. Anglang then stole what money they had and gave some of it to Kedpin."}, {"tag": "h4", "text": "Enjoying the Vacation"}, {"tag": "p", "text": "After a crazy start to his vacation, Kedpin could finally take time to enjoy it. With the money he received from Anglang, the pair both went to a fathier race, where Kedpin bet his money on a fathier named Kessel Runner. It won by a small victory, and Kedpin realized he had won what amounted to a whole years salary. The two decided to celebrate in a more expensive bar where Kedpin gave half his winnings to Anglang for helping pay his bail and also came clean on how he actually won the competition. Soon after, the two then went their separate ways."}, {"tag": "p", "text": "Kedpin appeared in the casino not long after, where he played zinbiddle after being taught by Kaljach Sonmi, though did not succeed at the game."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kedpin Shoklop was first introduced simultaneously in the short stories \"Rules of the Game\" and \"The Ride\" from the Canto Bight novella collection. Star Wars veteran Warwick Davis, in addition to playing Wodibin, played Shoklop in a cameo appearance during the scenes set at Zord's Spa and Bathhouse of the 2017 film Star Wars: Episode VIII The Last Jedi, was to portray Shoklop, but these scenes were cut from the finished version of the film. They were then included in the Blu-ray and digital releases."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}