{"url": "Keeli", "categories": ["Category:Canon articles", "Category:Articles that are known by a nickname", "Category:Clone trooper captains"], "nodes": [{"tag": "h1", "text": "Keeli"}, {"tag": "p", "text": "\"Keeli\" was the nickname of a clone trooper captain who served in the Grand Army of the Republic during the Clone Wars. Under the command of Jedi General Ima-Gun Di, he led the Galactic Republic's Outer Rim garrison against the Confederacy of Independent Systems at the Battle of Ryloth in 22 BBY. As the Separatists began to overwhelm Republic forces on Ryloth, Twi'lek Resistance leader Cham Syndulla told Keeli and Di that they desperately needed reinforcements and aid. However, such aid could not be safely delivered in their current situation, as the Separatist blockade had destroyed Admiral Dao's Venator-class Star Destroyer. As Syndulla told them that his people had no choice but to retreat, Di and Keeli agreed to buy them as much time as they could against the incoming Separatists."}, {"tag": "p", "text": "Rigging an LAAT/i gunship to explode, Keeli's troops collapsed one of the two passages to the refugee encampment that the Separatists were attempting to travel through, which forced them to advance on only one front. Alongside Jedi Master Di, Keeli and the garrison were able to divert attention away from the Twi'lek refugees and freedom fighters who were attempting to evacuate. However, during the battle, the garrison was wiped out. The last remaining members, Keeli and Di were both killed while making a final stand against the Confederate invaders. The duo's sacrifices were not in vain though, as Republic supply ships reached the evacuating Twi'leks just in time."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The clone trooper who adopted the nickname \"Keeli\" was a clone of the human male bounty hunter Jango Fett, born and raised on the planet Kamino. He was created to serve in the Grand Army of the Republic during the Clone Wars, a conflict between the Galactic Republic and the Confederacy of Independent Systems. He acquired the rank of Clone Captain and was assigned to the Outer Rim garrison, under the command of Jedi General Ima-Gun Di. In 22 BBY, the Separatists launched an invasion of the planet Ryloth, the home of the Twi'lek people. The Outer Rim garrison, led by General Di and Captain Keeli, was sent to aid Cham Syndulla and his Twi'lek Resistance against the hordes of battle droids that were attacking the planet. From a refugee encampment in the center of a gorge, Twi'leks and clone troopers attempted to mount a substantial defence. After the collapse of the right flank, Keeli informed General Di that the droid army would be closing in on their position. Syndulla professed that they could not stay at the encampment any longer and attempted to organise a retreat of his fighters. Keeli protested and told him that a retreat would be impossible due to the right flank's collapse, remarking that they were stuck at the encampment together."}, {"tag": "p", "text": "Not long after, Admiral Dao's Venator-class Star Destroyer was destroyed by the Separatist blockade above the planet, leaving the ground forces on their own. Unbeknownst to them, Dao had managed to send a message to the Jedi High Council before his death and the Council had set in motion a plan to send relief aid to Ryloth. Meanwhile, on the planet's surface, Di hoped that they would be able to evacuate the Twi'lek refugees in a LAAT/i gunship but Keeli pointed out that the craft was too small to transport all of them to safety. With the hope of Syndulla and his freedom fighters dwindling, Di devised a plan to reconfigure the gunship's fuel system and transform it into a makeshift bomb that could collapse one of the gorge's passageways and funnel the Separatist droids into a single attack path. The Outer Rim garrison could then buy the Twi'lek refugees enough time to escape. Keeli complimented the general's strategy before solemnly telling him that he would break the news to his men, knowing that it would likely required them to sacrifice their lives. Nevertheless, Keeli and the garrison committed to the plan and placed the gunship in position. With the droid army approaching, Keeli ordered his men to detonate the charges as soon as they were in range."}, {"tag": "p", "text": "After the bomb was activated, the garrison prepared for battle at the central pass. With General Di leading from the front, Keeli and his men fought valiantly but the outnumbered clones were quickly overwhelmed. A lone B1-series battle droid advanced towards the garrison and threw a thermal detonator, blasting Keeli and two other clones to the ground. Believing his comrade to be dead, General Di fought against the approaching droids alone. Surrounded and outnumbered, Di was surprised when a blaster shot impacted on a B2-series super battle droid ahead of him. Looking back, he was pleased to see that Keeli was not yet dead and called out to him. Keeli stood up beside his Jedi friend and they continued to fight together. Keeli managed to shoot down a number of droids before two blaster bolts hit him in the chest, killing him. Resigned to his fate, General Di's last stand was rewarded when a voice announced over communications that the supply ships had broken through the blockade. Upon seeing the ships pass over him, Di remarked that the Twi'leks would live to fight another die and died in sacrifice."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like all clones of the human male Jango Fett, Keeli stood at 1.83 meters tall. He had tan skin and brown eyes and hair. Keeli was a valiant soldier, who accepted that he would have to make a last stand against the Separatists to aid the Twi'lek Resistance. Keeli fought with General Di to the very end at the Battle of Ryloth, eventually giving his life to provide cover for the retreating Twi'leks."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Keeli was equipped with Phase I clone trooper armor, which featured the dark brown markings of the Outer Rim garrison, and donned a pauldron on his shoulder and kama around his waist. His helmet sported an antenna equipped with a rangefinder. In combat, he wielded two DC-17 hand blasters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Keeli first appeared in \"Supply Lines,\" the third episode of the canon animated series Star Wars: The Clone Wars' third season, which first aired on September 24, 2010, in which he was voiced by Dee Bradley Baker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}