{"url": "Keelyvine_Reus", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Jedi Generals", "Category:Jedi Sentinels", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Keelyvine Reus"}, {"tag": "p", "text": "Keelyvine Reus was a Human female Jedi General during the Clone Wars. She had the tutelage of the Padawan Tyzen Xebec foisted upon her during the conflict after Xebec's former Master, Bolla Ropal, was slain by the bounty hunter Cad Bane. She was teamed with Admiral Dron and Jedi Master Kit Fisto on an expedition to the vital agriworld Ukio, which supplied the Grand Army of the Republic with food supplies. The emergence of the Confederate tactical droid \"Doctor,\" and his plot to ruin the planet's crops resulted in an engagement, with the Republic emerging victorious thanks to the actions of Xebec and Reus, among others."}, {"tag": "p", "text": "Reus's next mission with Xebec involved her being dispatched to the Valsedian asteroid belt, which was home to a key mining operation that had allegedly been sold to the Confederacy by Torpo the Hutt. As the asteroid belt was held by the Hutt Cartel, there was a diplomatic sensitivity that Supreme Chancellor Palpatine was loathe to breach. Reus and Xebec, along with Master Obi-Wan Kenobi, Jedi Knight Anakin Skywalker and his own Padawan Ahsoka Tano infiltrated the asteroid belt's mining facility, before breaking up to better determine the nature of the supposed Confederate presence there. As a result, Reus encountered Confederate agent Asajj Ventress, and fought a duel with the woman, discovering in the process that Torpo was in fact a patsy in a scheme of Jabba Desilijic Tiure's design. The Jedi were nonetheless able to liberate the Ugnaught workers at the facility."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Keelyvine Reus was a Human female Jedi Knight, who was instructed in the art of lightsaber combat by Jedi Master Dooku—a hard task-master who demanded excellence from the young woman. Reus later served as a General during the Clone Wars. In that pan-galactic conflict, during which the Confederacy of Independent Systems battled the Galactic Republic for supremacy, Reus was forced to take a Padawan learner, Tyzen Xebec, a Zabrak male. Xebec's former Jedi Master, Bolla Ropal, had been slain by the Confederate-allied bounty hunter Cad Bane in the wake of a battle at Devaron, and so Reus took Ropal's place as the Zabrak's instructor. She had also inherited Ropal's clone trooper commander, one nicknamed \"Ganch.\" Teamed with fellow Jedi Kit Fisto, as well as Admiral Dron, Reus commanded a Republic fleet consisting of a Venator-class Star Destroyer and two Consular-class frigates."}, {"tag": "p", "text": "The fleet was dispatched to Ukio, a vital agriworld that supplied the Republic troops with food. Upon being informed of their arrival by Dron, Reus instructed the Admiral to have her frigates form a sentry line, while the fleet was to be placed on yellow alert. Fisto could not detect any hint of danger, but Reus was adamant that any danger that they could not sense would prove the most potent. A clone informed Reus that they were receiving an incoming intelligence update from the Jedi Temple on Coruscant. Reus halted the briefing until Xebec was summoned to the bridge."}, {"tag": "p", "text": "Reus and Fisto were contacted by Masters Obi-Wan Kenobi and Mace Windu, and upon Xebec's arrival, the briefing commenced. The Jedi, along with Dron, conferred with Coruscant as to the background of Ukio's involvement in the war. Windu informed them that Ukio was not only vital to the Republic, but that it also supplied the entire Abrion sector and Triellus Trade Route with food. The planet had attempted to secede from the Republic just prior to the opening of the Clone Wars, but had been prevented from doing so by Grand Master Yoda. Kenobi noted that the citizenry were still divided, and that the planet was in enough political turmoil that it might attract the attention of Confederate agents such as Asajj Ventress, or even the enemy figurehead, her old saber instructor Count Dooku. Xebec was curious as to why the Confederacy would be interested in Ukio, as their droid army had no mouths to feed—Reus pointedly reminded him that their objective was likely stopping the Republic's supply rather than claiming the crops for themselves."}, {"tag": "p", "text": "Clone Intelligence had determined that Ukio was indeed possibly being targeted by the Confederacy, but aiding the Republic was the fact that the planet was protected by a powerful planetary shield. Consulting a readout, Reus noted that the shield would be strong enough to deflect a considerable enemy bombardment, and that was what puzzled Kenobi—there had been no reports of any major Confederate fleet movements anywhere near Ukio. Windu instructed the Jedi to perform reconnaissance and inspect the situation on the planet surface. He suspected that there might be Confederate sympathizers or saboteurs among the Ukians, and Reus obeyed. Conferring with Fisto after the meeting, Reus decided that the fleet should retain orbital patrol, in case the intelligence reports were erroneous, and that they should perform sensor analysis on the planetary shield to hunt for weak spots. Reus instructed her Padawan to take a team to Ukio's surface and survey the planetary defenses. As Xebec departed, Reus confided in Fisto her feelings that the Padawan was reckless and lacked focus. The Nautolan assured her that she would eventually be able to connect with him, in time, through the Force."}, {"tag": "h3", "text": "Confederate machinations"}, {"tag": "p", "text": "Dron soon alerted Reus and Fisto to an incoming signal. The Ukian satellite network had detected a lone Confederate Lucrehulk-class battleship over Ukio's horizon, and Reus was concerned by the development. The lone Confederate ship's presence was suspicious, but could not inflict any real damage on Ukio's shield. Fisto suspected that it was a lure to pull the fleet to the other side of the planet, and so Reus ordered Dron to hold their current position while she and Fisto would perform reconnaissance in their Delta-7B Aethersprite-class light interceptors. Deploying in her personal fighter, Reus was joined by Fisto as they headed toward the enemy battleship."}, {"tag": "p", "text": "Upon reaching the enemy craft, Reus observed that it was deploying modified seismic tanks, which she detected were unarmed. She was puzzled as to just what the tanks were doing, and they subsequently approached the planetary shield, deploying a cloudy black substance all over it. Fisto attempted to run a diagnostic of the substance before moving to engage the tanks. Reus soon realized that destroying the tanks would not prevent them from releasing the substance, so while Fisto transmitted his diagnostic material back to the fleet, she had her astromech droid try and reach Dron. The communication between her and Dron was fragmented, however, as the battleship was jamming most frequencies. The admiral informed her that he had forwarded Fisto's material to the other ships in the fleet, and that they had made several findings. Acknowledging Dron's message, Reus and Fisto headed back to the fleet so that they could communicate clearly."}, {"tag": "p", "text": "Back on the flagship, Reus and Fisto joined Dron in listening to a report from Captain Pharl McQuarrie. The captain had determined that the substance was soil from the Moorjan badlands—an electro-static compound that would cling to the planetary shield. Reus was curious as to whether the soil was doing any actual damage—McQuarrie assured her that it was not. However, the soil was in fact photoreactive, causing it to move across the shield in tandem with the planet's orbit; in effect, the soil would continually block out Ukio's sun, no matter how the planet rotated. Reus immediately understood the implications—by creating a perpetual eclipse, the Confederacy would stop the vital sunlight from shining on the Ukian crops, which in turn would cause them to die out."}, {"tag": "p", "text": "Breaking through the jamming signals, Reus established contact with the Ukian Liege. She informed him of the situation, and he was not at all pleased—the crops of Ukio were highly sensitive, and could not be robbed of any more sunlight. Despairing, the liege suggested that they drop the shield in order to disperse the Moorjan dirt, but Reus, as well as Ganch, who was with the liege, advised against such an action, as it was probably exactly what the Confederate forces wanted him to do. The Ukian protested, however, pointing out that the Republic would soon have nothing more to defend. Reus consulted McQuarrie to make sure that the liege's plan would work—the captain confirmed that it would indeed scatter the Moorjan soil to the Ukian winds. Reus relented and instructed the liege to drop the shields fifteen minutes from that time, in a size only as large as the cloud and as briefly as possible. Meanwhile, she ordered Dron to take the fleet to the Confederate battleship, reminding him that time was of the essence. As they neared the battleship, they would lose all communications due to the jamming, and they needed to be there when the shield was dropped to ensure that no enemy craft would make it through. The Jedi also deigned that the destruction of the battleship would be an objective."}, {"tag": "h3", "text": "Battle at Ukio"}, {"tag": "p", "text": "Reus returned to her fighter, and with Fisto accompanying her, led Blue Squadron, comprised of V-19 Torrent starfighters, into combat against the Lucrehulk-class battleship. She instructed her fellow pilots to close up their formation in order to allow her flagship an open line of fire. As they made their approach, the Liege dropped the shields on schedule, dispersing the cloud. This prompted the enemy battleship to deploy Vulture droids to engage the Republic fighters. A vicious and chaotic dogfight broke out, as Reus and her pilots fought both enemy droids and the remaining seismic tanks. As the carnage continued, a trio of Confederate Sheathipede-class transport shuttles broke through the hole in the shield and were able to land on Ukio."}, {"tag": "p", "text": "As the battle raged in space, Reus attempted to contact Xebec, but the communications were still jammed. Eventually, the Confederate battleship was destroyed, bringing an end to the signal jamming. Fisto was relieved, but the atmospheric ionization continued to prevent Reus from contacting Xebec. She decided that they would have to make their way toward the surface and see for themselves what was happening on Ukio. To that end, she resolved to meet up with her Padawan directly. Attempting to contact Ganch, she was instead put through to an Agricultural Corps worker named Sanya, who directed Reus to her Padawan and lowered the planetary shields."}, {"tag": "p", "text": "The Jedi Knight found her Padawan battling Confederate troops near a landed Sheathipede-class shuttle in an Ukian field. He had destroyed a series of devices that had prompted most beings on Ukio to go berserk and violently turn against their true nature. Although Xebec had been able to dispatch the battle droids, he had been cornered and disarmed by the Confederate mastermind, a T-series tactical droid known as \"Doctor.\" As the droid closed in on the unarmed Xebec, Reus approached, lightsabers drawn, and dispatched the enemy commander. Reus, glad that her Padawan was unharmed, explained how she had located him, and commended him for his actions. Ganch had been among those affected by the Doctor's devices, but had been successfully detained by Xebec."}, {"tag": "p", "text": "After the battle, Reus joined Fisto, Xebec, and Sanya at a landing pad for debriefing. The effects of the Doctor's devices had been localized and temporary—health checks indicated that most workers and clones had regained mental stability. Reus instructed Xebec to have Ganch round up all of the waylaid gigaun herds that had run rampant during the incursion. She also applauded Sanya's efforts, before the group were approached by the liege. The Ukian was furious and demanded that the Republic forces leave immediately. He had been stripped of his position following the tumultuous events, and as his last official act, it was his formal request that the Republic leave Ukio. As it turned out, the Ukian stock had plummeted as a result of the battle, allowing Corporate Alliance Magistrate Passel Argente to purchase the planet itself, placing it directly under Confederate control."}, {"tag": "h3", "text": "Respite on Coruscant"}, {"tag": "p", "text": "Reus, Xebec, Sanya, and Ganch returned to Coruscant aboard the Venator-class Star Destroyer, Selfless. Before debarking, Reus assured Sanya that her service on Ukio would be mentioned to the Jedi Council. Ganch reported that he had fully recovered from his earlier ordeal, before the group was approached by clone Captain Rex, bearing a priority message from the Council—Reus and Xebec were to report to the Jedi Temple immediately. With Ganch and Sanya taking leave to make use of the Republic Service Organization, the two Jedi departed for the temple. There they met Jedi Masters Yoda and Kenobi, as well as Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano. Supreme Chancellor Palpatine was also in attendance in the briefing room via hologram, in addition to the astromech droid R2-D2."}, {"tag": "p", "text": "Palpatine commenced the briefing, claiming that there were concerns around the Republic's alliance with the Hutt Cartel. One of the most influential members of the cartel, Jabba Desilijic Tiure, had aired concerns over one of his distant cousins, Torpo the Hutt, who had made a deal with the Confederacy. Reus's immediate concern was any Republic trade route that might be in jeopardy, but Palpatine assuaged her fears, as the issue was not as critical as that. The area in contention was the Valsedian asteroid belt, which was a key source of ore that was used as fuel for vehicles and weaponry. According to law, the asteroid belt would remain under Hutt control, but could not be sold to the Confederacy, which was where Torpo had apparently transgressed. The nature of the alliance with the cartel prevented a proper investigation into Jabba's intelligence, and also stopped the Republic from sending a full military force to ascertain the nature of the Confederate presence at Valsedian. A small task force of Jedi would be sent instead, comprising of Reus, Xebec, Skywalker, Kenobi, and Tano, under the cover of passing as smugglers."}, {"tag": "p", "text": "The duty of leading the investigation and any potential negotiations fell to Generals Reus and Kenobi, while Skywalker would do the piloting. Before departing, Reus contacted Ganch and informed him that he would not be required for the operation of Valsedian. Reus then made her way to the Jedi Archives and mused upon the bust of Dooku that sat there, the last of the Lost Twenty to be immortalized there. Kenobi joined her, and the pair briefly discussed the man who was now the figurehead of the enemy, before discussing the nature of the mission itself, and the political baggage it entailed—an element that Reus did not relish at all. The group took Skywalker's G9 Rigger freighter Twilight, with his Aethersprite-class interceptor kept in the hold, and departed Coruscant."}, {"tag": "h3", "text": "The Valsedian Operation"}, {"tag": "p", "text": "As the Twilight approached the asteroid belt, Skywalker boarded his interceptor and flew independently, serving as a contingency should negotiations on the prime asteroid take a turn for the worse. Xebec piloted them towards the asteroid and landed the freighter within a cave. As there was no breathable atmosphere, the Jedi were forced to don breath masks. As the narrow tunnels of the asteroid were playing havoc with their sensor readings, Kenobi instructed Tano and Zybec to investigate some of the smaller tunnels, as their smaller stature would allow them to sufficiently navigate. Reus took umbage at Kenobi instructing her Padawan without prior consultation, as in her opinion the young Zabrak required \"special consideration.\" As Kenobi and Reus entered an area featuring artificial atmosphere, they encountered a Twi'lek. Wasting no time, Reus brandished one of her lightsabers, and demanded that the Twi'lek take them to his master. The Twi'lek protested, claiming that his master, though in charge of the mining operation, was far from Valsedian. As Kenobi manacled their new captive to the wall, the Twi'lek identified himself as Bib Fortuna."}, {"tag": "p", "text": "The Jedi, believing the Twi'lek to be dim-witted, persisted with their questioning until Kenobi detected that the Padawans were in danger. As he left to investigate, Reus attempted to glean further information from the Twi'lek, asking where Torpo was located. The captive Twi'lek revealed that Torpo was present on the asteroid, confusing the Jedi Knight. At that moment, Force-sensitive Confederate agent Asajj Ventress emerged, brandishing her lightsabers. Reus, igniting her own weapons, engaged Ventress in a duel, attacking the Confederate with aggression that surprised her opponent. The pair bandied words as they fought, Reus recognizing her opponent's paired lightsabers as a mark of Dooku's tutelage. Although Ventress claimed to fear nothing when challenged, Reus recalled her own experiences as Dooku's pupil, and could recognize that her opponent feared him as she did in her youth."}, {"tag": "p", "text": "As the duel progressed, Ventress cut the Twi'lek captive free, urging him to depart. The combatants progressed towards an area with artificial walls—reaching a deadlock in the contest, Ventress slashed at the walls with her weapon, revealing the captive Torpo. The Hutt, in a state of panic, urged Reus to evacuate him and remove the Confederate forces from Valsedian. As the Jedi Knight and Hutt conversed, Ventress moved around behind the captive, thrusting her weapons through Torpo's back, killing him instantly. Reus was puzzled by the development, allowing Ventress to hurl her into a wall with the Force. Ventress then flung Torpo's corpse into the Jedi Knight, holding her captive until the Confederate agent could make her escape."}, {"tag": "p", "text": "Reus eventually prised herself free, making her way to one of the asteroid's docking bays to find that Kenobi, Xebec and Tano had liberated the Ugnaught workers being held captive by Ventress's thugs, and Skywalker had destroyed the enemy's Vulture droid contingent. As Reus revealed Torpo's fate, one of the Ugnaughts noted that Torpo was not the true master of the mining operation—rather, Torpo never acted without direction from Bib Fortuna. Skywalker was familiar with Fortuna, and identified him as one of Jabba Desilijic Tiure's henchmen. Reus revealed that Fortuna had escaped during her duel with Ventress—Skywalker was outraged that they had been played for fools by Jabba, who had perpetrated the sale of Valsedian to the Confederacy and arranged to have the Jedi tie up the \"loose ends.\" Upon returning to Coruscant, Reus and Xebec were reunited with Ganch and Sanya, who had spent their leave time hunting a saboteur who had plotted to kill clone troopers at the RSO."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Keelyvine Reus was a stern and succinct Jedi, and she shared her own philosophy openly with Master Kit Fisto. He mistook it for a saying of Master Yoda's, but she humorlessly informed him otherwise. Reus was not amused by Fisto's more flippant attitude, nor did she appreciate the same trait held by Obi-Wan Kenobi. Reus bemoaned the attitudes of both Kenobi and Skywalker, particularly their constant banter. She also took several opportunities to criticize Skywalker in particular, both for his relationship with Palpatine and his complaining that he had predicted the Valsedian scenario, where Jabba Desilijic Tiure's hand was revealed—the Jedi Knight chose to make a disparaging comment about Skywalker's status as the \"Chosen One.\" Reus continually chose not to humor her fellow Jedi when they wanted to make light of a given situation."}, {"tag": "p", "text": "Reus's relationship with her Padawan, Tyzen Xebec, was strained, and she had little tolerance for his tardiness, feeling that he was unfocused and reckless by nature. She confided her misgivings to Fisto, but he assured her that there was no single way to train a Padawan and that she would find her own path. Later, Reus bristled when Kenobi issued instructions to her Padawan—it was her belief that Xebec required special instruction, and that independence was not always an asset at this stage in his development. Kenobi claimed that independence in a Padawan was vital, but Reus disagreed, again citing the example of how Skywalker had matured as a sufficient counterexample."}, {"tag": "p", "text": "When faced with a threatening situation, such as the arrival of a Confederate craft at Ukio, Reus acted decisively, deciding to perform reconnaissance tasks personally. She was of a singular focus, borne from learning lightsaber combat from Dooku, a master who loathed apathy and demanded perfection from his students. Her apprenticeship to Dooku caused her to fear failing her instructor, a trait that she recognized in Asajj Ventress when encountering her on Valsedian. Focus and dedication to the task at hand was a common theme for Reus: When Fisto began to believe that Reus was starting to care about her Padawan, she brushed it off as being concern for the mission objectives. On the Valsedian operation, Reus was disinterested in any method of subterfuge of clandestine behavior, and did not hesitate to brandish her weapon at Bib Fortuna upon first encountering him. When battling Ventress, she exhibited an unusual level of aggression for a Jedi—her opponent was also surprised by Reus's reluctance to talk during the engagement. Later in the Ukio operation, however, Reus did show she did care for Xebec's well-being, and was relieved to find him safe. She also praised his efforts during the battle, as he had been able to almost single-handedly defeat the Confederate incursion. Additionally, the Jedi was highly impressed with the conduct of the AgriCorps worker Sanya during the battle."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "During the opening stages of the battle at Ukio, Keelyvine Reus demonstrated her combat ability by destroying several of the orbiting seismic tanks. In addition, she was a skilled lightsaber combatant, particularly in Jar'Kai as she wielded two lightsabers. Having been trained by Dooku in the art of lightsaber combat, she was able to match another of Dooku's students, Asajj Ventress in a duel. Reus was also able to dispatch the Confederate leader \"Doctor\" with her sabers."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Keelyvine Reus wielded twin lightsabers, and also owned a Delta-7B Aethersprite-class light interceptor, which she piloted ably."}, {"tag": "h2", "text": "Appearance and attire"}, {"tag": "p", "text": "Keelyvine Reus wore green, non-traditional garments as opposed to standard Jedi robes, over which she would sometimes wear a cloak. She also wore green lipstick, which matched her green eyes. Her hair was brown, which she pinned in a bun behind her head, with two hair sticks."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Keelyvine Reus was first introduced in Part Five of the webcomic The Clone Wars: Act on Instinct, published in 2009. The character was designed by Thomas Hodges and named by Pablo Hidalgo, who illustrated and wrote the comic, respectively. In Part Five of Act on Instict, she is mistakenly called \"General Geus\" by a clone naval officer in a single frame. The character later appears in the 2010 sequel to Act on Instinct, The Clone Wars: The Valsedian Operation, which was developed at a story level by Hodges, and scripted by Hidalgo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}