{"url": "Keenah", "categories": ["Category:Legends articles", "Category:Non-canon Legends articles", "Category:Individuals of unspecified species", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Keenah"}, {"tag": "p", "text": "Keenah was a male captain in military service to the Galactic Empire in 3 ABY. He was dispatched by the Galactic Empire to assist Starkiller during a mission to search for Luke Skywalker, who had been leading the Rebel Alliance for some time. During the Battle of Hoth he was assigned as the liaison of Starkiller. During the battle, Starkiller executed Captain Keenah for failing to plan an adequate infiltration route."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Keenah served as a captain in the Galactic Empire's military. During the Battle of Hoth in 3 ABY, Keenah was chosen to act as liaison between Starkiller and the Empire's attack group. Shortly after introducing himself, he notified Starkiller of instabilities in the ice cavern that the Sith Lord was using to infiltrate Echo Base. Keenah then admitted to having overlooked the fact that the footsteps from his AT-AT assault group would cause the cavern to collapse around Starkiller. Although Starkiller was unharmed, he executed Keenah for his mistake by using the Force. Captain Keenah was replaced by Lieutenant Marsen as liaison to the battle group; Marsen was far more assured and competent, and successfully helped Starkiller to locate Rebellion commander Luke Skywalker."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Keenah was an eager if somewhat timid individual; he was audibly afraid of Starkiller, and spoke with a pronounced stammer when addressing him. Despite his enthusiastic initial promise of unerring competence to the Sith Lord, Keenah made a potentially disastrous error in judgment when planning Starkiller's infiltration into Echo Base, endangering Starkiller's life and ultimately ending his own when he admitted the error."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Captain Keenah made his first appearance in the non-canon Hoth mission level of Star Wars: The Force Unleashed: Ultimate Sith Edition."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}