{"url": "Keetael", "categories": ["Category:Legends articles", "Category:Force-based organizations"], "nodes": [{"tag": "h1", "text": "Keetael"}, {"tag": "p", "text": "Keetael was a Draethos Force tradition, which used the Force to increase fighting and hunting skills of those who studied it. Keetael was a mysterious, but not secret tradition, and there were no more than a few hundred adepts at any given time."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Keetael recognized the differences between the light and dark side of the Force, but did not follow either of them exclusively. Instead, they utilized aspects of each to improve their combat, hunting, and fighting abilities. Following exclusively the light side could cost a victory in battle, while following solely the dark side could lead warriors to become vengeful and selfish beings who put their own importance over those they defended. Keetael who were more aligned with the light side of the Force were unwelcome in Draethos warrior society because of their pacifistic views and usually joined the Jedi Order. Keetael who had fallen to the dark side occasionally banded together to become a potent mercenary or criminal group, but were often destroyed by their fellow warriors, who recognized them as a true threat to their existence."}, {"tag": "p", "text": "The Keetael operated as a loose fellowship, focusing on the training of new members. They did not act or live in large numbers. Rather than carrying lightsabers, the Keetael used the same weapons as the rest of Draethos society, because they regarded themselves as regular members of their families and clans, only with unusual abilities. Some Keetael Masters lived among a single community, but most traveled the lands, seeking new initiates and leading Ube-tel, especially in regions where no established masters operated openly. Because the Draethos lived for hundreds of years, one Keetael master could teach thousands of initiates over a lifetime."}, {"tag": "h2", "text": "Training"}, {"tag": "p", "text": "When a Force-user was identified by a member of the Keetael, they received intense training to hone and control their abilities. Instead of training in isolation, they participated in extended training hunts, called Ube-tel. Initiates were also taught the customs and history of the Keetael. Upon the completion of training, each initiate received a small silver disc, one side of which was inscribed with an elaborate series of circles (the symbol of the order), and the other side carried the symbols and signatures of the Keetael masters and initiates involved in the individual's training. The disc was a symbol of membership in the order, but the members were not required to display it or even carry it. Many practitioners of Keetael even concealed their abilities and membership to maintain a significant advantage over their opponents in battle."}, {"tag": "p", "text": "At some point, Acaadi studied Keetael. When he later became a Sith, the Keetael sent Darok-Tho to track him down and try and stop him from using their knowledge to corrupt others."}, {"tag": "p", "text": "The Force-based aspects of Keetael training focused on Force tracking. They learned to efficiently and secretively manipulate the Force without gestures, and in ways that were difficult for other Force-users to sense. They could use the Force to direct their ranged weapons to their targets and enhance the momentum of their strikes. They were very adept at perceiving visions of the past and of their distant targets' surroundings."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}