{"url": "Keeramak_Revolt", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of the Ssi-ruuvi invasion", "Category:Rebellions and uprisings", "Category:Ssi-ruuvi Imperium"], "nodes": [{"tag": "h1", "text": "Keeramak Revolt"}, {"tag": "p", "text": "The Keeramak Revolt (22 ABY–23 ABY) was a local conflict within the remote Ssi-ruuk Star Cluster between the ruling Ssi-ruuvi government and a pro-Keeramak Ssi-ruuvi faction which used the P'w'eck Emancipation Movement to create a faux P'w'eck slave uprising. Officially, it was a successful popular uprising by the lowly P'w'eck and the outcast brown-scaled Ssi-ruuk mix-breeds that toppled the Ssi-ruuvi Imperium. In reality, the revolt was manipulated by several disguised Yuuzhan Vong operatives as a ploy to weaken the Imperium in anticipation of a Vong invasion in coordination with their attacks on the greater Galaxy."}, {"tag": "p", "text": "The Keeramak's faction, which included the Ssi-ruuvi military, clergy and several P'w'eck slaves, attempted to invade Bakura in 28 ABY. However, the revolt was thwarted by a genuine P'w'eck uprising and a Galactic Alliance/Bakuran counter-attack which defeated the Keeramak's faction. During the fighting, the Keeramak himself was slain by P'w'eck leader Lwothin. Shortly after, the Yuuzhan Vong invaded Ssi-ruuvi space itself."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "In 4 ABY, the Ssi-ruuvi launched expeditionary forces against several Outer Rim worlds and the neighboring Chiss Ascendancy around the time of the Battle of Endor. However, neither expedition was very successful: the Ssi-ruuvi only narrowly succeeded in conquering the Human world of Cattamascar, and were utterly defeated at Bakura, when it became known that Palpatine, having just been killed, would no longer be able to fulfill his promise. Likewise, although several minor Chiss worlds were taken, the Chiss retaliation was massive and unexpected. In retaliation for attacks on several Chiss worlds which had seen several of their citizens enteched, the Chiss had launched a blistering campaign in Ssi-ruuvi territory, devastating the Imperium capital of Lwhekk and fragmenting of the Ssi-ruuvi socio-economic caste system."}, {"tag": "p", "text": "Voren Na'al of New Republic Intelligence later referred to the battle as the \"Bakura Incident\", and believed that it would be best if the New Republic attempted to prevent widespread public knowledge about the Ssi-Ruuk, advice that was taken controversially at best. To prevent a second Ssi-ruuvi attack on the worlds on the edge of Wild Space, the Rebel Alliance's successor state—the New Republic—organized an invasion force for an expedition into the Ssi-ruuvi Imperium's territory. This task force consisted of the captured Shriwirr (which had been renamed Sibwarra), 12 Nebulon-B escort frigates and several escort warships."}, {"tag": "p", "text": "However when the New Republic fleet emerged in Ssi-ruuvi space, they discovered an already weakened foe. Above Lwhekk, the New Republic fleet clashed with the remnants of the Ssi-ruuvi fleet under Ivpikkis. Having reached a stalemate, the New Republic attempted to negotiate unsuccessfully with the Ssi-ruuk. With the Ssi-ruuk unable to mount another campaign for an unforeseen period and with the growing conflict with the fragmented Imperial warlords looming in the horizon, Chief of State Mon Mothma ordered the withdrawal of the New Republic fleet from Ssi-ruuvi space for an attack on Imperial-held Clak'dor VII."}, {"tag": "h2", "text": "Details"}, {"tag": "p", "text": "So great was the devastation of the Chiss attack that it was not until many years later that the Ssi-ruuvi contemplated renewing their expansion. Two major developments occurred during that time which would have repercussions in the latter years. One was the birth of the Keeramak, an event of major significance in the Ssi-ruuvi religion. The Keeramak itself was a hermaphroditic mutant multi-colored Ssi-ruu, was a master strategist and politician."}, {"tag": "p", "text": "The Keeramak was the offspring of an “illegitimate” relationship between two Ssi-ruuk from separate castes. In Ssi-ruuvi culture, the brown-scaled offspring of mixed parents were ostracized by society and treated like outcasts. However, the fact that the Keeramak had all the colors of the various Ssi-ruuk castes made it an enigma. Since it fulfilled a religious prophecy, its birth was warmly received by the Ssi-ruuk."}, {"tag": "p", "text": "According to that prophecy, the Keeramak would lead the oppressed P'w'eck slaves and the brown-scaled outcasts in an uprising against their class oppressors. Hoping that the Keeramak could be used as a moral booster, the Imperium leadership ensured that it was raised well and trained to lead the Imperium in the future. The Keeramak became respected among the Ssi-ruuk and P'w'ecks as a wise and firm leader who challenged the Conclave and Elder's Council."}, {"tag": "p", "text": "The other development was the secret takeover of the Imperium by the extragalactic Yuuzhan Vong, who secretly placed made one of their own, E'thinaa, a ranking general. In the fields of technology, the Ssi-ruuvi made advances in entechment by developing a means of sustaining enteched souls; allowing them to last longer. By 14 ABY, the Ssi-ruuk scientists had succeeded in developing analogs from reverse-engineered captured Imperial starship technology including shield generators and sensor array systems."}, {"tag": "p", "text": "Seeing the Keeramak's potential in future developments, the Vong infiltrator E'thinaa's faction backed the Keeramak against the ruling Shreeftut. In 22 ABY, E'thinaa's Imperium faction organized a faux P'w'eck slave uprising by the P'w'eck Emancipation Movement led by the Keeramak and the P'w'eck leader Lwothin. By 23 ABY, the Keeramak's faction had managed to capture the capital Lwhekk and the Keeramak was installed as the new Shreeftut."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Sometime between 23 ABY to 28 ABY, the Keeramak then made a secret deal with the Prime Minister of Bakura, Molierre Cundertol. In exchange for gaining “immortality” by being enteched into the body of a Human replica droid constructed by the company Onadax Droid Technologies, Cundertol would betray his people to the saurian Ssi-ruuk as entechment stock. As the nearest planet in the known Galaxy to the Imperium, Bakura would prove an ideal beachhead for a Ssi-ruuvi invasion."}, {"tag": "p", "text": "As part of their strategy, the faux P'w'eck rebels would make overtures of peace to the Bakurans and the New Republic's successor government—the Galactic Alliance. Lwothin would also claim that the Keeramak had led a popular uprising of the lower classes which toppled the Imperium and introduced reforms including the abolition of forced entechment and slavery."}, {"tag": "p", "text": "To distract attention from the P'w'ecks, Cundertol arranged himself to be kidnapped by members of the anti-New Republic insurgent group Freedom. When a Galactic Alliance delegation including three members of the Solo family and starfighter pilot Jagged Fel arrived in Bakura in 28 ABY, Lwothin was able to lull them into a sense of false security. Following a Consecration Ceremony at a podium in the capital Salis D'aar, Bakura was soon attacked by the Keeramak's escort fleet which quickly overwhelmed the Bakuran and Alliance defenders."}, {"tag": "p", "text": "However, the tide of the battle changed when the Keeramak itself was assassinated by Lwothin. This was the signal for a genuine P'w'eck revolt which quickly turned the tables on the Ssi-ruuk. With the group forces routed and the two orbiting Sh'ner-class planetary assault carriers captured by Alliance fighters and P'w'eck mutineers, the remaining Ssi-ruuk capitulated."}, {"tag": "p", "text": "Later, Bakura signed a treaty of alliance with the P'w'eck Emancipation Movement for a joint effort against the Imperium. Meanwhile, the Yuuzhan Vong launched an invasion of the Ssi-ruuk Star Cluster and massacred many Ssi-ruuk. Cundertol escaped back to Ssi-ruuvi space only to meet his end at the hands of E'thinaa who revealed his true identity as a Yuuzhan Vong infiltrator."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}