{"url": "Keets_Freely", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Galactic Republic individuals", "Category:Humans", "Category:Journalists", "Category:Males", "Category:Resistance fighters"], "nodes": [{"tag": "h1", "text": "Keets Freely"}, {"tag": "p", "text": "Keets Freely was a Human male writer who worked for The Coruscant Holo Net during the Clone Wars. He was one of the first to wonder why Palpatine was \"grabbing all the power while still smiling at us.\""}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Separatist Crisis, journalist Keets Freely discovered a plot involving the InterGalactic Banking Clan and the by-then Supreme Chancellor Palpatine. Palpatine had spent billions of taxpayer's money to create secret accounts for corporations affiliated with the IGBC, in exchange of the IGBC's support in the Galactic Senate. Freely attempted to publish his discovery, but the editor would not allow that. Freely then resigned."}, {"tag": "p", "text": "When Palpatine became the Galactic Emperor, the newly-formed Galactic Empire sentenced Freely to death. Freely escaped the authorities, becoming a fugitive."}, {"tag": "p", "text": "Freely became a member of the Erased after Palpatine established his New Order and issued the Enemy Eradication Order. He was badly wounded when stormtroopers attacked the Erased."}, {"tag": "p", "text": "After Trever Flume and Oryon blew up the catwalk in Solace's base, he was found by the two, who had thought him dead. He traveled with them to Dexter Jettster, and later to Naboo, where they rid the world temporarily of Imperial presence."}, {"tag": "p", "text": "Keets and Curran Caladian later got information for Solace from Senator Sano Sauro's computer when they were helping Ferus Olin on Samaria. However, they were caught and put in a holding cell but rescued by WA-7, Dex's old waitress droid, who gave them a blaster in their food."}, {"tag": "p", "text": "Later Keets and Curran Caladian met with Solace and Clive Flax along with Astri Oddo and her son Lune Oddo Divinian in Dex's hide-out in thugger's ally. Keets and Curran Caladian dug up some information about an individual with \"special powers\" popping up here and there. They both got a job from Dexter Jettster to watch after Lune Oddo Divinian. They had stopped at a playground to watch him play with a group of children, but when Lune Oddo Divinian gets spotted by a group of stormtroopers doing their routine. Soon they got lost in a crowd but when they made many twist and turns storm troopers came out of the sky from an airspeeder, Keets was holding Lune tightly but got overpowered by stormtroopers and Lune Oddo Divinian got wrenched away. Only later did they figure out where Lune Oddo Divinian was, Keets promised to Astri Oddo that he would die getting her son back."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}