{"url": "20th_Century_Fox_Fanfare", "categories": ["Category:Real-world articles", "Category:Articles needing illustration", "Category:Musical pieces"], "nodes": [{"tag": "h1", "text": "20th Century Fox Fanfare"}, {"tag": "p", "text": "The 20th Century Fox Fanfare is a musical piece played to accompany the 20th Century Fox logo when it was displayed during the opening of the movie studio's feature films. The fanfare has been played before the first six Star Wars films, appearing in each episode of the original and prequel trilogies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The 20th Century Fox fanfare was composed in 1933 by Alfred Newman, a longtime head of Fox's music department from 1940 to 1960. In 1953, an extended version was created for CinemaScope films, and debuted on the film River of No Return."}, {"tag": "p", "text": "In the mid-to-late 1970s, the 20th Century Fox logo had all but been phased out. However, Lucas enjoyed the logo and Alfred Newman music so much that he insisted it be used for his Star Wars films. The fanfare and logo have, since then, enjoyed a rebirth in usage."}, {"tag": "p", "text": "When John Williams signed onto the Star Wars project, one of his first moves was to compose the Main Title to Star Wars: Episode IV A New Hope in the same key as the 20th Century Fox fanfare. He has said before that it was truly meant as another extension of the fanfare, and it has since then been adopted by Star Wars film score buffs as part and parcel of the scores to Star Wars."}, {"tag": "p", "text": "When Sony released the original trilogy Special Edition scores, and the Ultimate Edition score to Episode I, each set included on it a recording of the 20th Century Fox fanfare."}, {"tag": "p", "text": "When the films were released digitally in April 2015 by The Walt Disney Company, the Fox opening, as well as the fanfare, were absent, prompting a disappointed reaction in some fans."}, {"tag": "h2", "text": "Usage in Star Wars"}, {"tag": "p", "text": "Star Wars: Episode IV A New Hope utilizes the original 1954 CinemaScope Extension recording by Alfred Newman from River of No Return. Star Wars: Episode V The Empire Strikes Back utilizes a new recording by John Williams for the film. This version was used in all of the later Star Wars films as well. Star Wars: Episode I The Phantom Menace Ultimate Edition soundtrack includes a newly recorded fanfare, also used on the original version of Return of the Jedi."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}