{"url": "Keldabe_kiss", "categories": ["Category:Legends articles", "Category:Mandalorian culture", "Category:Martial arts"], "nodes": [{"tag": "h1", "text": "Keldabe kiss"}, {"tag": "p", "text": "\"Keldabe kiss\" was a slang term for a kov'nyn, a Mandalorian headbutt. Performed with a helmet, a kov'nyn could either be employed to cause injury to an opponent in unarmed combat, or in a gentler capacity between two Mandalorians as an armored greeting, contributing to the \"Keldabe kiss\" nickname."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kov'nyn was the Mandalorian term for a headbutt, performed while wearing a helmet. The term came from the Mandalorian language of Mando'a, where it was derived from the words kovid and nynir, meaning \"head\" and \"strike\", respectively. A kov'nyn was a Mandalorian unarmed combat technique, utilizing the protection their armor afforded them in an offensive manner."}, {"tag": "p", "text": "Over time, a gentle headbutt consisting of a tapping of helmets together at the forehead, came to be a stand-in gesture for a kiss among Mandalorians adorned in full armor. The practice led to the development of the slang term \"Keldabe kiss,\" derived from the name of Mandalore's capital city."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the final decades of the Galactic Republic, the term \"Keldabe kiss\" had become a recognized slang term for a Mandalorian headbutt. Because a gentle headbutt was used by Mandalorian couples in lieu of a typical kiss when they were wearing full armor and a helmet, a number of non-Mandalorians who had seen the gesture and yet were unfamiliar with its origin came to believe that an armored headbutt was a typical Mandalorian greeting."}, {"tag": "p", "text": "In the year 44 BBY, the Mandalorian soldier and reigning Mand'alor Jango Fett performed a violent kov'nyn on a Jedi on the planet Galidraan, during a devastating battle between a Jedi taskforce and the True Mandalorians. Twenty years later, in 22 BBY, Fett performed another armored headbutt on the Jedi Knight Obi-Wan Kenobi, during their fight on the watery world of Kamino."}, {"tag": "p", "text": "Near the end of the Clone Wars—a galaxy-spanning conflict between the Galactic Republic and the Confederacy of Independent Systems—in 19 BBY, the former clone commando-turned-Mandalorian Fi Skirata, was waiting in the marketplace of the Mandalore town Enceri for the arrival of his girlfriend, Parja Bralor. When Bralor arrived, she fondly greeted Skirata with a true \"Keldabe kiss,\" affectionately tapping the forehead of her helmet to his by way of hello."}, {"tag": "p", "text": "During the tumultuous build up to the Second Galactic Civil War in 40 ABY, Corellian President Thrackan Sal-Solo put out a bounty on the family of his hated cousin, Han Solo. Seeking to protect his family, Solo traveled to Corellia where he allied himself with his former foe Boba Fett—on world at Sal-Solo's request for Mandalorian military aid—who outfitted Solo with a suit of all-concealing Mandalorian armor and had the smuggler masquerade as a Mandalorian subordinate of his. Once Solo was close to his cousin, he attacked and headbutted him with the borrowed Mandalorian helmet, before Fett's granddaughter Mirta Gev finally shot and killed Sal-Solo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The terms \"Keldabe kiss\" and \"kov'nyn\" were first introduced to Star Wars continuity in the Republic Commando novel Order 66, written by author Karen Traviss and published September 16, 2008. The action of a Mandalorian headbutt first appeared in the second Star Wars prequel film, Star Wars: Episode II Attack of the Clones, retroactively making the 2002 film the first appearance of the act, itself."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}