{"url": "Keldabe_warehouse_store", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Businesses", "Category:Mandalore locations", "Category:Warehouses"], "nodes": [{"tag": "h1", "text": "Keldabe warehouse store"}, {"tag": "p", "text": "A warehouse store was located in the city of Keldabe, capital city of the planet Mandalore. Owned by a Mandalorian woman, and housed within a large warehouse facility, the Keldabe retailer stocked and sold a variety of used droid parts and specialty equipment. The store was staffed by the Mandalorian business owner, along with a protocol droid who manned a desk in the storefront lobby and greeted potential customers. The business's expansive inventory was kept inside the building's large warehouse facility, stocked on shelving racks and in hanging nets that rose up several floors in height. Four powered staircases, one for each of the warehouse's walls, provided access to the collection of mechanical equipment. Armaments and specialty equipment were kept primarily on the easternmost wall, and within a secure room located close by."}, {"tag": "p", "text": "Around 18 BBY, the store and its owner sold a selection of equipment to the Galactic Empire. Shortly thereafter, a Sullustan by the name of Den Dhur came to the Keldabe retailer for parts to upgrade his droid companion, I-5YQ. Upon learning of the business's recent transactions with the Empire, Dhur—an ally of the anti-Imperial organization known as Whiplash—offered to reward the proprietor with additional credits for a manifest of what goods the Empire had purchased."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The nameless warehouse store in Keldabe first introduced to the Star Wars universe via an appearance in the novel The Last Jedi, co-written by authors Michael Reaves and Maya Kaathryn Bohnhoff, and published February 26, 2013."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}