{"url": "Keldabe_handshake", "categories": ["Category:Legends articles", "Category:Mandalorian culture", "Category:Martial arts"], "nodes": [{"tag": "h1", "text": "Keldabe handshake"}, {"tag": "p", "text": "A \"Keldabe handshake\" was a euphemistic slang term for a Mandalorian unarmed combat technique that consisted of violently gripping a Humanoid opponent's groin. Debilitatingly painful for the victim, the technique was noted for its ability to neutralize a Human foe with one hand. The term derived its name from Keldabe, the capital city of the planet Mandalore, and a play on the handshake, a common gesture of greeting across the galaxy."}, {"tag": "p", "text": "In 22 BBY, during the takeover of the Galactic City Spaceport by a group of Korunnai terrorists, the Mandalorian sergeant Kal Skirata used a \"Keldabe handshake\" on the Republic senate's Head of Public Affairs, Mar Rugeyan, when the bureaucrat disparagingly referred to the clone commando Fi—whom Skirata had personally trained on Kamino—as a grunt, after the commando had rescued several officers of the Coruscant Security Force from a grenade. Though Skirata did not inflict enough pain to be debilitating, Rugeyan hastily removed himself from the scene when he was released."}, {"tag": "p", "text": "Nearly three years later, in 19 BBY, Skirata's Mandalorian contemporary and fellow member of the Cuy'val Dar, Walon Vau, was hired by the Galactic Republic to cross-train standard clone troopers with commando skills. During a sparring match with one trooper at Arca Company Barracks, Vau utilized a \"Keldabe handshake\" that left the veteran clone soldier incapacitated for several moments after."}, {"tag": "p", "text": "In 25 ABY, early in the war against the extra-galactic race of invaders known as the Yuuzhan Vong, a group of Mandalorians attempted to subdue a pilot on the planet Birgis in order to relay covertly gathered intelligence on the Yuuzhan Vong to the New Republic. The pilot, a female Human who struggled heavily due to the belief that the Mandalorians were hostile, was finally brought to heel after the Mandalorian soldier Dinua Jeban used a \"Keldabe handshake\" on her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The violent grip applied to a being's groin by a Mandalorian was first shown in the Republic Commando short story, Omega Squad: Targets, written by Karen Traviss and published March 2005 in the eighty-first issue of Star Wars Insider. A similar situation was again featured in Traviss' 2006 e-novella, Boba Fett: A Practical Man. However, it was only with the release of Traviss' 2008 novel Order 66, that the act was identified as the \"Keldabe handshake\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}