{"url": "Keldo", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Males", "Category:Scyre clan members"], "nodes": [{"tag": "h1", "text": "Keldo"}, {"tag": "p", "text": "Keldo was a male human who was the brother of Phasma. The two ran the Scyre together, and while she was a warrior that came up with battle strategy, he was more inclined to be peaceful. His leg was injured as a child, so he could not walk, resulting in him taking on different responsibilities from his sister in the clan. He ran peace negotiations, while she trained warriors to fight other clans. When the Claws attacked their settlement on Parnassos, Keldo protected the child that was the target of the Claws, young Frey. Phasma and her warriors fought off Balder and his men. During the fight, Phasma used the fungi that lay upon the rocks, realizing it could inflammate the Claws. Upon hearing this, Keldo got mad and betrayed Phasma, conducting a peace treaty with the Claws which angered Phasma, something she would never forget. After the arrival of General Brendol Hux and his stormtroopers on the planet Parnassos, Phasma and her warriors agreed to aid them into reaching their fallen starship.  When they consulted to Keldo about this in the Nautilus, he was enraged about the fact that Phasma had broken the biggest peace treaty in their history and caused an unnecessary war. Phasma ignored him, stole supplies and left at night with 4 of her best warriors, Brendol Hux and the 3 Stormtroopers accompanying him, leaving the Scyre to defend themselves. Keldo later led his people in a pursuit of his sister. The two groups met at the fallen starship, where they fought each other. Due to him being unable to walk, he rode on a sled alongside his daughter, Frey. Phasma managed to reach her brother during the skirmish, at which point Keldo pleaded with her, but she remained unmoved and shot him in cold blood."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In an interview with StarWars.com, Phasma author Delilah S. Dawson stated that Keldo is, in many ways, the keystone of Phasma's evolution. Keldo begins as the brain to her brawn in a balanced team, but the lessons he teaches to her go way beyond a typical sibling relationship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}