{"url": "Keldon", "categories": ["Category:Legends articles", "Category:Alliance Military members", "Category:Healers and doctors", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Keldon"}, {"tag": "p", "text": "Keldon was a male who served as a medic at the Rebel base on the second moon of Tiragga during the Galactic Civil War. When the base's personnel contracted the Direllian Plague, Keldon was one of the last to be incapacitated. Along with Commander Astred, he set up a continuous broadcast message in an effort to enlist help from returning supply crews by directing them to the planet Kirtania to procure Shiarha Root to treat the plague."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Keldon was a male medic serving with the Alliance to Restore the Republic during the Galactic Civil War and was assigned to the small outpost on the second moon of the planet Tiragga. Sometime during the war, the outpost's personnel contracted the Direllian Plague, a fatal respiratory disease that could kill in days. Twelve hours after the plague struck, Keldon was the only medic capable of duty, and the base's medical droids had taken over caring for forty patient's in the sic bay, while another hundred or so were confined to quarters in an effort to stem the spread of the plague. Although suffering from the disease, Keldon's performed tests that confirmed the presence of the Direllian Plague, and informed the base commander, Astred, of his findings. He recommended sending someone to the nearby planet of Kirtania to acquire Shiarha Root, and the aid of Doctor T'Jaleq Kith'Araquia, the noted Araquia scientist who first discovered the cure for the malady. Commander Astred agreed that someone needed to be sent, but refused to send any base personnel for fear that they would become too ill during the course of the mission to complete it. Instead, Astred and Keldon set up a droid to broadcast a continuous message and hope that one of the base's supply ships returned early enough to help them."}, {"tag": "p", "text": "Keldon was saved when a transport crew returning to the outpost picked up the message and immediately diverted to Kirtania, where they acquired the necessary Shiarha Root to manufacture a cure."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An experienced medic, Keldon did not let the effects of the Direllian Plague interfere with his efforts to analyze and formulate a plan to deal with the crisis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Keldon appeared in The Quality of Mercy, an RPG adventure written by Nicky Rea published in Star Wars Adventure Journal 1 by West End Games in 1995. Keldon can die during the adventure if the player characters take too long during their adventure on Kirtania. This article assumes that the player characters successfully completed the task as recommended."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}