{"url": "Kelita_valley", "categories": ["Category:Legends articles", "Category:Mandalore locations", "Category:Valleys"], "nodes": [{"tag": "h1", "text": "Kelita valley"}, {"tag": "p", "text": "The Kelita valley was a verdant river valley on the Outer Rim world of Mandalore. Located in Mandalore's northern hemisphere, the Kelita valley was broad and shallow, with dense woodlands and spreads of cultivated farmland, punctuated by circular, fortified Mandalorian homesteads. Across the Kelita valley, numerous tributaries streamed into and fed the larger Kelita River that flowed on toward Mandalore's capital city of Keldabe. On one side of the Kelita valley, at the top of a slope, sat the small Keldabe suburb of Bralsin."}, {"tag": "p", "text": "When the extra-galactic Yuuzhan Vong attacked Mandalore during their invasion of the galaxy, in retribution for the Mandalorians' actions against them, the Kelita valley suffered significant damage: more than a decade after the battle, swaths of the valley's land lay dead, poisoned by the Yuuzhan Vong."}, {"tag": "p", "text": "In 41 ABY, while staying on Mandalore to learn how to stop her Sith Lord brother, Darth Caedus, Jedi Knight Jaina Solo met with the former Jedi-turned-Mandalorian Gotab near Bralsin, on a granite hill overlooking the Kelita valley. There, Solo sought spiritual advice on how best to deal with her fallen brother from the elderly man who had been both a member of the Old Jedi Order and the Mandalorian warrior clans. While talking, the two enjoyed the scenic view of the valley, and watched groups of flying avians that made the valley their home."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kelita valley first introduced to the Star Wars universe in the ninth entry into the Star Wars: Legacy of the Force novel series, Revelation, written by author Karen Traviss and published February 26, 2008. The valley later received a mention in the series' final novel, Invincible, written by Troy Denning and released several months later on May 13, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}