{"url": "Kelita_River", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Mandalore locations", "Category:Rivers and waterfalls"], "nodes": [{"tag": "h1", "text": "Kelita River"}, {"tag": "p", "text": "The Kelita River was a river on the Outer Rim world of Mandalore. Named simply for the Mando'a word for moat, kelita, the Kelita River was located in Mandalore's northern hemisphere, forty-five degrees north of the planetary equator. The Kelita stretched for kilometers through trees and over grassland in a winding path. In a single bend of the sprawling river, at the crest of a flat-topped granite hill the Kelita had carved away at over time, sat Mandalore's capital city, Keldabe. Nearly surrounding Keldabe entirely, the Kelita formed something of a natural moat around the city, a state which gave the river it's name. A durable stone balustrade was erected as a barrier between the city's outer edge and the sheer drop from the hill top into the Kelita, whose fast-moving current was fed by several tributaries from across the Kelita valley. A sluice gate had once been erected for the Kelita, but over time it was removed and the narrow pathway leading to it from Keldabe was railed off. Patches of frond-grass grew in abundance in areas of Keldabe wet by the spray of the fast-moving Kelita River. A number of bridges were constructed to pass over the Kelita, allowing travelers to enter the city on foot."}, {"tag": "p", "text": "As a young child in the year 19 BBY, the Mandalorian Venku Skirata found the rush of the Kelita River's current amusing, and during a trip into Keldabe with his grandfather and uncle, Kal and Fi Skirata, the two paused to allow the boy to watch the river from the Keldabe balustrade. Several weeks later, Mij Gilamar—a friend of the Skirata family—had a run in with his former Cuy'val Dar associate Dred Priest while visiting Keldabe. Upon learning that Priest had joined with the resurgent Death Watch splinter group, Gilamar stabbed and killed Priest, and disposed of his body by throwing it into the Kelita River."}, {"tag": "p", "text": "The Kelita River's woodland surroundings were severely altered during the attack on Mandalore by the extra-galactic Yuuzhan Vong. Large expanses of forested terrain around Keldabe were flattened, and portions of the surrounding area's land had been poisoned by the Vong. However, the Kelita's fast-paced current was a boon to the damaged land, helping to wash away the toxins and purify the ground over time. For this reason, Mandalorians chose a watery meadow near the Kelita as the site of a mass burial ground; mass graves were common in Mandalorian culture, as the Mandalorians believed they would all end up together in the collective afterlife."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kelita River first introduced to the Star Wars universe in the 2006 e-novella, Boba Fett: A Practical Man by author Karen Traviss, becoming one of Mandalore's most prominently reoccurring natural features. The Kelita later appeared in Traviss' fourth and fifth installments to the Republic and Imperial Commando series, entitled Order 66 and Imperial Commando: 501st. She also included the Kelita in two of her entries in the multi-author novel series, Star Wars: Legacy of the Force, namely Sacrifice and Revelation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}