{"url": "Kella_Rand,_Reporting...", "categories": ["Category:Real-world articles", "Category:Star Wars Adventure Journal fiction"], "nodes": [{"tag": "h1", "text": "Kella Rand, Reporting..."}, {"tag": "p", "text": "Kella Rand, Reporting... is a short story written by Laurie Burns, originally published in the Star Wars Adventure Journal 6, in May 1995 by West End Games. It was republished in the online Fiction section of Hyperspace on December 2, 2005. The online Hyperspace version is illustrated by Robert Duchlinski."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Kella Rand, a reporter for the Galactic News Network, is covering a vote over an alliance between the Indu San system and the New Republic. Just before the vote on Indu San, Chief Councilor Shek Barayel is killed in an explosion. Kella, hoping for a big story, notices a Council Authority Officer following the Ambassadorial Aide to Dictio L'varren, Tev Aden, into a corridor. Rand decides to follow, but is stopped by another Authority Officer. When a blaster goes off in the hallway beyond, she and the guard investigate. There, they find Aden dead, shot by Officer Kaleb Darme. Rand glimpses Darme retrieving a detonator from Aden's body."}, {"tag": "p", "text": "Back at the Indu GNN bureau, Rand goes through several of her past interviews, and in the process, she notices a shot of Darme planting the bomb that killed Barayel. She shows the other reporters—Crislyn, Juloff, and her boss, Robbe Nostler—then goes to share the evidence with Ambassador L'varren. On the way, a sniper takes several pot-shots at her, but she manages to escape danger temporarily. Finally arriving at L'varren's hotel, she notices Juloff and Darme standing together and realizes that Juloff—still loyal to the Galactic Empire—tipped off Darme. She races to Suite 44-1 and sends her hovercam ahead with the evidence. However, Darme manages to catch Rand before she can reach L'varren's suite. He pulls her into the turbolift, threatens her with a vibroknife, takes her datacards, and shoots her with a stun bolt. In his escape from the turbolift, L'varren's people, having seen the evidence, catch Darme and rescue Rand. Rand, not wanting to miss the deadline, quickly rushes off to get her new story."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}