{"url": "Keller%27s_unit", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Grand Army of the Republic units"], "nodes": [{"tag": "h1", "text": "Keller's unit"}, {"tag": "p", "text": "Clone trooper commander \"Keller\" led a unit of clone troopers and Galactic Marines on the snow-covered planet of Toola during the Clone Wars, which was fought between the Galactic Republic and the Confederacy of Independent Systems."}, {"tag": "p", "text": "In 19 BBY, near the end of the war, the unit took part in an assault on the Confederacy's main generators on Toola, under the command of Jedi Generals Simms , Kai Hudorra and Jedi Commander Noirah Na. During the assault; however, the Great Jedi Purge commenced when Supreme Chancellor Palpatine, the Sith Lord Darth Sidious, declared that Order 66 was in effect, turning the clones against their Jedi officers. The unit killed Jedi Master Simms, and hunted down the two remaining Jedi to no avail."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At the onset of the Outer Rim Sieges, Keller's unit was sent to the frigid planet of Toola to combat CIS forces stationed there. After weeks of stalemate against the separatist forces, Jedi General Kai Hudorra, Jedi General Simms, and Kai's padawan launched an assault on the battle droids' main generators with a small portion of the unit, while the rest of the clones staged a diversionary attack."}, {"tag": "p", "text": "Their ploy was successful, but shortly after, Commander Keller received orders to execute Order 66, and the clones started firing upon their Jedi leaders. The clones were successful in killing Jedi Master Simms, but Kai Hudorra and his padawan fled on Single Trooper Aerial Platforms."}, {"tag": "p", "text": "Shortly after, Keller and his unit tracked down the two Jedi to Ithaqua Station, a small civilian port on the planet. Once they reached the station, Keller and his men started searching for the two missing Jedi, raiding as many places as they could and asking people for their identification papers. After reaching a small bar where Hudorra was drinking, Keller and two of his men started searching for the Jedi. To their dismay, the patrons of the bar started attacking them, as Kai had managed to convince them to turn on the clones."}, {"tag": "p", "text": "Keller's unit kept searching Ithaqua Station, but never found the two Jedi as they managed to get away on a transport to Coruscant."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Troopers in Keller's unit utilized white Galactic Marine armor and standard phase II clone trooper armor. Some troopers in the unit also had yellow markings on their shoulders. They were also equipped with DC-15A blaster rifles and DC-15S blaster carbines. During their time on Toola, some members of the unit rode Mastmots equipped with two laser turrets mounted on their sides."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}