{"url": "Anti-Riot_Tangle_Gun_7", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Merr-Sonn Munitions, Inc. products", "Category:Pistols", "Category:Tangle guns"], "nodes": [{"tag": "h1", "text": "Anti-Riot Tangle Gun 7"}, {"tag": "p", "text": "The Anti-Riot Tangle Gun 7, also known as the tangle pistol, was a crowd-control defense weapon manufactured by Merr-Sonn Munitions for the Galactic Empire, though it eventually became available on the black market in the Ringali Shell region of the Core Worlds. The tangle gun fired a pellet that, when exposed to air, explosively expanded into a multi–meter–wide webbed net that enveloped its victim and then shrank, thus immobilizing the target. The webbing sometimes contracted too tightly, causing the victim to suffocate and die. General Airen Cracken included an entry for the weapon in his field guide for the Rebel Alliance."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Anti-Riot Tangle Gun 7, sometimes referred to simply as the tangle pistol, was a crowd-control defense weapon that shot a naorstrachem pellet mixed with a shrinking agent. When exposed to air, the pellet explosively expanded into a webbed net several meters in width. The net automatically contracted as soon as it came into contact with a warm surface, such as a living body. It then wrapped around the target and tightened, trapping the target almost instantly. However, a problem with tangle guns like the Tangle Gun 7 was that the webbing often contracted too much, resulting in the target being suffocated—and sometimes killed—by the intense pressure of the webbing."}, {"tag": "p", "text": "The tangle gun carried a load of fifteen pellets and had a short range of three-to-ten meters, a medium range of eleven-to-nineteen meters, and a long range of twenty-to-twenty-five meters. The size of a blaster carbine and lightweight, the tangle gun had a light polycarbonate furniture and a short, wide-mouthed barrel. The tangle gun was also composed of an additional polymer material, non-ferrous metal, and Codoan Copper. The reload cartridge of the tangle gun was located at the top rear just above the handle. Regularly priced at 300–to–500 credits, the weapon was considered a specialized item that was not available everywhere and was even considered to be illegal on most planets."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The tangle gun was produced by Merr-Sonn Munitions, Inc. for use by the Galactic Empire, though schematics of the weapon were also available to independent weaponsmiths and munitions traders. Manufactured to meet the Empire's need for a more humane crowd-control weapon than a blaster, the Anti-Riot Tangle Gun 7 was often used when non-lethal force was needed. However, once Imperial policy adopted a more brutal approach, the Empire ceased using the weapon."}, {"tag": "p", "text": "During the Galactic Civil War, General Airen Cracken included the tangle gun in Cracken's Rebel Field Guide, a report he authored for the Rebel Alliance documenting various Imperial munitions. The field guide's section on the tangle gun featured an illustration of the weapon, along with a depiction of a Duros caught in the gun's webbing. The tangle gun was also listed in the fiftieth-anniversary issue of Galladinium's Galactic Datalog of Fantastic Technology, which purveyed fine merchandise to an upscale clientele during the war. The datalog listed the tangle gun at a price of 300 credits."}, {"tag": "p", "text": "In the year 0 ABY, during the missions of the privateer starship Far Orbit in the Ringali Shell area of the Core Worlds, the tangle gun was available on that region's black market. It started off at a price of 300 credits but jumped to 6,000 credits once the Empire became aware of the Far Orbit's activities. The privateer vessel retreated from the Ringali Shell following a defeat against Imperial forces; upon the ship's return sometime later, the tangle gun's black-market value had risen to 9,000 credits."}, {"tag": "p", "text": "Some time during the Galactic Civil War, an Anti-Riot Tangle Gun 7 was concealed in a hidden compartment in a chair at the Farrimmer Cafe, an eatery on the Mynock 7 Space Station. The Filvian owner, H'nib Statermast, was unaware of the compartment and the pistol, which were discovered by a group of individuals as they searched the restaurant for one of several bombs that had been suspected of being placed throughout the space station. Statermast was not concerned with whether or not the individuals kept the pistol and any other items they discovered during their search."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Anti-Riot Tangle Gun 7 was introduced in Cracken's Rebel Field Guide, a 1991 sourcebook written by Christopher Kubasik for West End Games' Star Wars: The Roleplaying Game. The weapon first appeared in \"The Farrimmer Cafe,\" a set of roleplaying game adventures published in the 1996 Star Wars Adventure Journal 11 and written by Jean Rabe and J. Allan Fawcett. In one of the adventures, the tangle gun can be discovered by the player-characters if they agree to search the Farrimmer Cafe on H'nib Statermast's behalf and then successfully perform a roll of a \"Heroic\" difficulty while inspecting the establishment's tables. The weapon appeared in the 2003 LucasArts–Sony Online Entertainment MMORPG Star Wars Galaxies: An Empire Divided, prior to its closure in 2011. In the game, the weapon was simply identified as a \"tangle pistol,\" and it could be crafted by weaponsmiths and later by munitions traders using a number of different components and resources, including Codoan Copper, non-ferrous metal, and polymer."}, {"tag": "p", "text": "Various Star Wars Galaxies reference guides provide differing statistics for the tangle gun. Star Wars Galaxies: An Empire Divided: Prima's Official Strategy Guide (2003), Star Wars Galaxies: Jump to Lightspeed: Prima Official Game Guide (2004), and Star Wars Galaxies: An Empire Divided Quick Reference Guide (2004) identify the tangle gun as a stun weapon with a maximum range of forty-eight meters, while Star Wars Galaxies: The Total Experience: Prima Official Game Guide and Star Wars Galaxies: The Complete Guide: Prima Official Game Guide (2005) identify it as a kinetic weapon with a range of thirty-five meters. Given the ambiguity of these statistics, this article uses the twenty-five-meter figure provided in Cracken's Rebel Field Guide. In another inconsistency, the Fantasy Flight Games Star Wars: Edge of the Empire sourcebook Far Horizons, which was released in 2014, refers to the tangle gun as a rifle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}