{"url": "20th_Century_Studios", "categories": ["Category:Pages needing citation", "Category:Real-world articles", "Category:Motion picture studios", "Category:Walt Disney companies"], "nodes": [{"tag": "h1", "text": "20th Century Studios"}, {"tag": "p", "text": "20th Century Studios, alternatively Twentieth Century Studios and formerly named 20th Century Fox, is an American film production company that is located in southern California. The studio was involved in the development of the original Star Wars trilogy and subsequently distributed the prequel trilogy. Located in the Century City area of Los Angeles, just west of Beverly Hills, the studio is currently a subsidiary of The Walt Disney Company. In January 2020, it was reported that Disney would be renaming the company 20th Century Studios to avoid confusion with Fox Corporation, which owns 21st Century Fox's former news and sports assets."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Relationship with Lucasfilm, 1977–2019"}, {"tag": "p", "text": "20th Century Fox was actually not George Lucas's first choice for a distributor of the film, having been preceded at least by Universal Studios, who turned his offer down. Lucas convinced Fox, or more specifically Alan Ladd, Jr., to finance Star Wars, due primarily to Ralph McQuarrie's artwork. In 1977, the company's risky investment paid off when Star Wars became an enormous hit.[source?]"}, {"tag": "p", "text": "Lucas' original deal with Fox gave the latter some merchandising rights and copyrights. Star Wars: Episode IV A New Hope's copyright was originally owned by Fox and the merchandising rights were split 60/40 between Fox and Lucas. Fox's Star Wars IP and licensing rights, except A New Hope's copyright, reverted to Lucasfilm on September 1, 1981. Lucasfilm eventually gained A New Hope's copyright on January 18, 1997."}, {"tag": "p", "text": "As distributor of the first six installments of the Star Wars saga, the openings of the films of the original and prequel trilogies feature Alfred Newman's 20th Century Fox Fanfare accompanying the Fox logo, their usage having been insisted upon by George Lucas, which has contributed to the duo's resurge of usage in the film studio's productions.[source?]"}, {"tag": "p", "text": "Despite the The Walt Disney Company's 2012 purchase of Lucasfilm Ltd. and the release rights to all future Star Wars films, Fox was to retain original distribution rights to A New Hope in perpetuity in all media worldwide. Fox was also to retain theatrical, nontheatrical, and home video rights worldwide for the franchise's five subsequent films, which Lucasfilm produced and financed independently, through May 2020, at which time ownership was to transfer to Disney. This complex relationship between Disney and Fox, particularly in regards to Fox's perpetual rights to Episode IV, was to create an obstacle for any future boxed set comprising all nine films."}, {"tag": "h3", "text": "Disney acquisition, 2019–present"}, {"tag": "p", "text": "In December 2017, The Walt Disney Company entered into negotiations with 21st Century Fox to acquire its film and television assets including 20th Century Fox. Though Disney had initially intended to purchase Fox for US$52.4 billion, Comcast posted a competing bid in June 2018, prompting Disney to raise their bid to US$71.3 billion. Following protracted bidding, negotiations, and clearances from regulatory bodies, Disney purchased 21st Century Fox's film and television assets including 20th Century Fox on 20 March 2019. As part of the acquisition, Disney also acquired the rights to the Original trilogy and the Prequel trilogy. In addition, Disney also acquired the The Simpsons, X-Men, Fantastic Four, and Avatar, and Planet of the Apes franchises. Fox's news and sports assets were spun into a separate company called the Fox Corporation."}, {"tag": "p", "text": "On January 17, 2020, it was reported that Disney would be renaming the company 20th Century Studios to avoid confusion with the Fox Corporation."}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}