{"url": "Anti-Sith_bill", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with conjectural titles", "Category:Galactic Republic laws and acts", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Anti-Sith bill"}, {"tag": "p", "text": "In the latter stages of the Old Sith Wars, the Galactic Senate of the Republic approved a bill that banned the Sith religion. The bill was proposed in response to the carnage inflicted by the Sith upon the galaxy during the Jedi Civil War of 3959–3956 BBY. The legislation was approved, and banned not only the religion, but all affiliated organizations and governments, as well as the teachings of the Sith philosophy. It remained in effect from the end of the Jedi Civil War until the New Sith Wars, during which it was used as justification for the Republic's battle against the New Sith Empire and its successor organization, the Brotherhood of Darkness. It was apparently nullified sometime during the Great Peace of the Republic, as by the time of the Clone Wars, the Galactic Constitution held provisions that specifically outlawed persecution based on religious affiliation."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The bill was crafted to outlaw the Sith Order, a religious organization of Force-sensitives devoted to the dark side and committed to dominating the galaxy. The approval of the legislation resulted in the Galactic Republic's banning of the Sith religion, its teachings, and all affiliated organizations from the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After their discovery by the Republic in 5000 BBY, the Sith dedicated themselves to the goal of destroying the Galactic Republic and its guardians, the Jedi. Their mission to do so began with the Great Hyperspace War, and despite the failure of that endeavor, Sith devotees continued to reinvigorate the religion and build organizations based around the philosophy of the dark side. Time and time again, the Sith rose up to challenge the Republic throughout the period that became known as the Old Sith Wars. Despite the repeated victories of the Jedi Order and Republic, the Sith and the societies they established were able to inflict heavy damage upon both groups in every conflict."}, {"tag": "p", "text": "In 3959 BBY, the Sith returned yet again to challenge the Republic in a conflict known to history as the Jedi Civil War. Led by Darth Revan and Darth Malak, a newly formed Sith Empire devastated the Jedi Order and crippled the Republic. The seemingly inevitable victory of the Sith was stopped only by Revan himself, who turned away from the dark side and defeated his former comrade, Malak. Despite surviving yet another vicious battle with the Sith, the Republic and Jedi were almost irreparably damaged, and remained in a state of crisis for a further five years. In response to the brutal predations of Revan, Malak, and their followers, the Galactic Senate of the Republic drafted a bill that was intended to outlaw the practice of Sith philosophy. The bill was approved and put into effect, making it illegal from that point onward to establish or be a member of a Sith organization or to partake in the advancement of Sith teachings."}, {"tag": "p", "text": "The bill remained in effect for the next three thousand years, with the Senate maintaining its legal stance against the Sith throughout the Great Galactic War, the Cold War, and the New Sith Wars, all of which were fought against various Sith organizations. Near the close of the New Sith Wars, in a conflict called the Light and Darkness War, the Republic Military was in need of new recruits to continue the fight against the Sith, who were at the time organized into the Brotherhood of Darkness. Republic recruiters used the anti-Sith legislation of three thousand years prior to justify their fight against the Brotherhood, as well as to explain the stance of the Jedi in the conflict."}, {"tag": "p", "text": "The New Sith Wars and the Light and Darkness War ended in 1000 BBY with the supposed extinction of the Sith at the Seventh Battle of Ruusan. During the new-found Great Peace of the Republic, most of the galaxy was convinced that the Sith would never return. At some point prior to the end of the Clone Wars, the anti-Sith bill was somehow nullified, and the Galactic Constitution which shaped the Republic was made to include a provision that specifically prohibited persecution based on religious or philosophical backgrounds—which included the practices of the Sith."}, {"tag": "h2", "text": "Controversy"}, {"tag": "p", "text": "Although the bill was in effect for at least three thousand years, its mandate against creating Sith organizations was repeatedly disregarded by those devoted to the Sith philosophy, which led to several galaxy-spanning conflicts between the Republic and the illegally established fraternities. Despite being cited by Republic personnel as a motivation behind their struggles against the Sith, not everyone in the galaxy was convinced that the legislation justified the violence. On the Outer Rim Territories world of Apatros, Republic recruiters used both the illegality of the Brotherhood of Darkness and the supposed moral high-ground of the Republic while attempting to validate their crusades against the Sith in the New Sith Wars. As explained by the Outer Rim Oreworks Company miner Dessel, much of the Outer Rim agreed with the Sith belief that the strong should rule the weak, as life on the Rim was far harsher that it was in the Core Worlds of the Republic. Dessel also stipulated that if the Sith were in charge of the galaxy, they would have a legal stance against the Jedi similar to that of the Republic's against the Sith."}, {"tag": "p", "text": "During the Great Peace of the Republic, the bill was in some way nullified, with Republic law ultimately indicating that any kind of religious persecution was legally inexcusable. In 22 BBY, Coruscant Security Force detective Dherik Rule noted that there was no crime to be pursued when a woman claimed to have discovered a Sith emblem in a dollop of pastebread. Despite this, the Jedi Order maintained their own stance against the Sith, which Supreme Chancellor Palpatine—the alter ego of the Sith Lord Darth Sidious—used to vilify the Jedi during his rise to the position of Galactic Emperor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The anti-Sith bill was first mentioned in the 2006 novel Darth Bane: Path of Destruction. Path of Destruction, written by Drew Karpyshyn, has been the only mention of the bill to date."}, {"tag": "p", "text": "In the 2005 novelization of Star Wars: Episode III Revenge of the Sith, Chancellor Palpatine states that the Republic has strict laws against the kind of persecution outlined by the anti-Sith bill. This indicates that the bill was removed from Republic law prior to 19 BBY, the year in which the book takes place."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}