{"url": "Anti-Sith_conspiracy", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles with conjectural titles", "Category:Conflicts of the Inner Rim", "Category:Events of the Galactic Civil War", "Category:Imperial organizations"], "nodes": [{"tag": "h1", "text": "Anti-Sith conspiracy"}, {"tag": "p", "text": "The anti-Sith conspiracy was a plot carried out by several high-ranking members of the Galactic Empire in 1 BBY. Led by Grand Moff Trachta, the conspiracy attempted to overthrow the Sith leaders of the Empire—Emperor Palpatine and Darth Vader."}, {"tag": "p", "text": "The attempt hinged on a special detachment of cloned stormtroopers, programmed to obey not Palpatine but Trachta. After splitting up Vader and Palpatine, the conspirators would have their stormtroopers, planted within the ranks of the two men's forces, turn on the Sith and kill them."}, {"tag": "p", "text": "The plot did not go as planned. The members first turned on each other, resulting in the assassination of most of the participants. The surviving members were no more successful, as Vader's and Palpatine's mastery of the Force allowed them to easily defeat the stormtroopers and dispose of the remaining leaders. In the end, all members of the conspiracy but the Imperial assassin Gauer were killed in the attempt."}, {"tag": "h2", "text": "The plot"}, {"tag": "h3", "text": "Earlier coup"}, {"tag": "p", "text": "In 19 BBY, as the Galactic Empire rose to power, Emperor Palpatine was the victim of an attempted military coup by the Imperial Academy headmaster, Gentis. Trachta, a veteran of the recent Clone Wars and a Moff, aided Palpatine, Darth Vader, and Lieutenant Laurita Tohm in quelling the coup. In the wake of the incident, Trachta was promoted to Grand Moff, and took over Gentis's former position of headmaster."}, {"tag": "h3", "text": "Inception"}, {"tag": "p", "text": "Trachta, who had known Galactic Emperor Palpatine since approximately 31 BBY, first conceived the plan to topple him some time before the year 11 BBY. Officially, the reason was that he despised the theocratic rule of the Sith and wanted secular leadership for the Empire; truthfully, he sought power for himself."}, {"tag": "p", "text": "In 11 BBY, Trachta first set his plan into motion by arranging for the creation of a special detachment of clone stormtroopers, one hundred soldiers with absolute loyalty to Trachta and none to Palpatine. Over the next ten years, he brought several other Imperials into his plan, including Grand Moff Bartam, General Skosef, and the assassin Gauer."}, {"tag": "h3", "text": "The plan begins"}, {"tag": "p", "text": "By 1 BBY, the army was complete. Carsan, the Imperial responsible for training the clones, took Trachta to see them and hand them over. To test their loyalty and remove a witness, Trachta ordered them to seize and execute Carsan. They demonstrated their complete loyalty by doing so. Having heard that Palpatine planned to disband the Imperial Senate, the conspirators decided that they would cause an even greater shift in power. By removing the Sith, whom they saw as a cult, they intended to give non-Force-sensitives—namely themselves—a chance at holding power."}, {"tag": "p", "text": "Around that time, Trachta recruited two other members, Moff Kadir of the Coruscant Security Force and Second Officer Dezsetes. Kadir was upset at the loss of a new batch of stormtroopers, originally intended to augment his forces, to Grand Moff Wilhuff Tarkin, and was approached by Trachta. The Grand Moff felt him out for his willingness to find a \"solution,\" as Trachta put it. The young man proved trustworthy, and he was invited to attend a meeting of the conspirators. Dezsetes, meanwhile, was planted aboard the Imperial-class Star Destroyer Mathayus, one of the most powerful Star Destroyers in the Imperial Navy. Hearing from him that Vader was to travel to the planet Dargulli on Mathayus to deal with a renegade Jedi, Trachta decided that with the Sith Lords split up, the time had come to make their move. In the twelve days or fewer that Vader was to be gone, Trachta intended to have both him and Palpatine eliminated."}, {"tag": "h3", "text": "The first attacks"}, {"tag": "p", "text": "Some of Trachta's troopers were sent with Vader, to be commanded by Dezsetes and intended to kill the Sith. Dezsetes planned to wait until Dargulli to make his move, where the soldiers would be assigned to escort Vader. However, circumstances arose that gave the conspirator a chance to carry out his mission sooner than expected."}, {"tag": "p", "text": "En route to Dargulli, Mathayus intercepted a Rebel transmission about a rendezvous at Yorn Skot. Arriving in orbit above the world, they detected a Rebel vessel emitting a distress signal. There, the conspiracy had a stroke of luck: due to the fact that the original communication had been on an open channel, Dezsetes recognized that it was a trap, but let Vader walk into it anyway. Mathayus pulled the Rebel ship into a hangar and sent a boarding party to force its way in as Vader watched from an observation area on the hangar's side. The ship was empty, and Vader inquired as to how the original transmission had been received. When he was told, he quickly ordered the tractor beam to be released. It was almost too late, as the ship detonated in a massive explosion that shattered the windows of Vader's observation area, sending the Sith Lord flying into the rapidly decompressing hangar. Nevertheless, he recovered and made his way back to the bridge. Vader blamed himself for not noticing the trap, and Dezsetes's role was never detected."}, {"tag": "p", "text": "As that was taking place, the first strike on Palpatine was being carried out on the planet Coruscant. The Emperor planned to visit the Death Star, which was nearing completion. Before he left, a small number of Trachta's stormtroopers under the command of Skosef were sent on board his shuttle carrying an unsuspicious crate of bottles, and secretly, a bomb. Palpatine, however, sensed a danger through the Force and called a halt to his procession, which included Trachta. Moments later, the bomb detonated, killing many of Palpatine's stormtroopers and half his Royal Guard."}, {"tag": "p", "text": "That had all been intended by Trachta, however. Knowing that Palpatine would never walk into a trap, he had arranged for a two-part plan. The first part, though not harming Palpatine, had removed many of his protectors. To fill the gap, Trachta offered his own stormtroopers to augment the Imperial Palace guard, putting them in position to carry out the final part of the plot when the time came. With Palpatine's men and Vader out of the picture, he expected the Emperor to easily fall to his own troops."}, {"tag": "h3", "text": "Power struggles"}, {"tag": "p", "text": "Even before they began to carry out their plan, the conspirators had already begun an internal struggle for power. Kadir had spoken with both Grand Moffs about the need for trust and unity, but both also had their own plans for retaining power. Bartam met with Gauer, suggesting to the assassin that Trachta could meet with an \"accident.\" Trachta, becoming paranoid about Bartam taking over, mentioned to Kadir the possibility that Bartam might not live to see the end of the plot."}, {"tag": "p", "text": "After the bombing, Trachta informed Skosef that he had been implicated, and recruited him to carry out his own plan. The General infiltrated the apartment of Bartam and executed the Grand Moff at point-blank range. Bartam's stormtrooper guard, who had been distracted, shot Skosef, killing him and inadvertently cleaning up any trace of Trachta's role in the assassination."}, {"tag": "p", "text": "As it turned out, Trachta had misidentified the true threat to him. Moff Kadir had his own ambitions, and under his orders, Gauer then went to Trachta's apartment. Trachta was wary, though, and when the muzzle of a blaster poked through the crack in his apartment door, Trachta shot the unseen assailant. As he went into the hallway to investigate, however, he learned that it had only been an assassin droid, a decoy. Gauer ambushed the Grand Moff, shooting him and ending his life."}, {"tag": "h3", "text": "The final stages"}, {"tag": "p", "text": "While the conspirators on Coruscant had been busy killing each other, Dezsetes had been setting up the attack on Vader. After murdering Admiral Coy for being too loyal to the Dark Lord, he attempted to send a group of the specially altered stormtroopers with Vader to the surface of Dargulli. Vader, however, wanted to go alone, and Dezsetes had no choice but to let him."}, {"tag": "p", "text": "Now in charge of the operation, Kadir and Gauer brought their cadre of stormtroopers to the Emperor's throne room. Claiming control of Palace security, Kadir ordered the deaths of the Imperial officers who attempted to block them, and the party marched into the Throne Room. Palpatine was waiting to greet them, and simply stated \"At last.\" Several Royal Guards then leaped out of the drapes and began killing Kadir's men. Gauer, waiting outside, heard the commotion, turned, and ran. Palpatine let the guards attack the stormtroopers for some time, then finally let loose a torrent of Force lightning, laying waste to the soldiers left standing."}, {"tag": "p", "text": "Kadir was still alive, and made one last attempt to shoot Palpatine with a blaster. The Sith Lord, however, blocked it and blasted more lightning into the prone Moff. Though Palpatine did not approve of Kadir's arrogance in believing he could defeat the Emperor, he was impressed by the Moff's ability and supposed masterminding of the plot, and commended him for weeding out the traitors in the Empire. Kadir seized upon this, telling Palpatine that Vader had been killed, and offering himself as an apprentice. As Kadir had no Force-sensitivity, Palpatine declined, and then activated a holocam that showed Vader alive and well."}, {"tag": "p", "text": "Vader, in fact, had completed his mission to Dargulli and was back on Mathayus, surrounded by the altered stormtroopers and Dezsetes. He quickly eliminated the soldiers with his lightsaber, then turned on Dezsetes. The officer told Vader that the Emperor was dead, and that Trachta had been behind the conspiracy. Upon hearing this, Palpatine promptly electrocuted Kadir while Vader stabbed Dezsetes. The conspiracy had been brought to an end."}, {"tag": "h2", "text": "Principal conspirators"}, {"tag": "h3", "text": "Grand Moff Trachta"}, {"tag": "p", "text": "A man encased in life-support equipment due to a thermal detonator explosion, Trachta was the original architect of the plot against the Sith. Despite an association with Palpatine of almost thirty years, Trachta saw the Sith as \"arrogant fools,\" believing that the rule of the Sith kept all others from power. He intended to institute a secular organization, with himself as the head. Trachta's co-conspirators grew suspicious of his motives as the plot drew to a close, and the Grand Moff began using terms like \"I\" rather than \"we\" when speaking of his ambitions. It would not be their suspicions that killed him, however, but the ambition of his own recruit, the young Moff Kadir. Trachta was considered dangerous enough that this was not anticipated to be an easy feat, but the Grand Moff was assassinated nonetheless."}, {"tag": "h3", "text": "Grand Moff Bartam"}, {"tag": "p", "text": "Along with Trachta, the corpulent Bartam was one of the highest-ranking Imperials to have a part in the conspiracy. In the final stages of the plot, Bartam recruited Gauer to his side, and the two men met multiple times, at one point discussing the idea of removing Trachta. Nonetheless, though he disliked the other Grand Moff, Bartam had no actual intention of killing him. Trachta's suspicions of the possibility, however, led him to make the first move and have his fellow Grand Moff eliminated."}, {"tag": "h3", "text": "Gauer"}, {"tag": "p", "text": "Gauer, the only member of the conspiracy to escape it alive, was an assassin in the employ of the Empire, and was even considered by Lord Vader to be capable of taking on a lightsaber-user in combat. Allying himself with Bartam and Kadir, Gauer eventually eliminated both men's rival in Trachta, and joined with Kadir for the final attack on the Emperor. As his allies and soldiers fell to Palpatine's guards and the Dark Lord himself, Gauer fled the scene."}, {"tag": "h3", "text": "Moff Kadir"}, {"tag": "p", "text": "Kadir, though a late addition to the conspiracy, eventually turned on its own architect and assumed control of it. Kadir was initially reprimanded by Trachta for his supposed innocence in matters of politics, as the younger man advocated that all the conspirators trust each other. He later spoke with Bartam, stating a similar idea. However, Kadir would prove to be less innocent than he appeared, as the ambitious Moff later joined forces with Gauer to have Trachta removed and take power on his own. After his men were killed, he even requested as high a position as the protégé of Palpatine himself; the Sith Lord, though impressed with his ingenuity, nonetheless forced him to watch his plot unravel, then killed him."}, {"tag": "h3", "text": "General Skosef"}, {"tag": "p", "text": "Skosef appeared to be an executor of the conspirators' will, assigned to tasks from planting bombs to carrying out assassinations. When the members of the cabal turned on each other, Skosef aligned himself with Trachta, and ultimately died carrying out the Grand Moff's assassination order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The anti-Sith conspiracy first appeared in Star Wars: Empire: Betrayal. Abel G. Peña, in writing the \"Imperial Betrayal\" article of The Official Star Wars Fact File, made mention of Atha Prime, a character originally created for a canceled line of toys by Kenner and intended to be a \"genetics master.\" It suggested that Prime and Trachta had been working together, and was intended to fuel speculation on the idea, first canonized in Betrayal, that stormtroopers were clones. This reference, however, was cut from the final draft."}, {"tag": "p", "text": "As explained by writer Scott Allie, in the original drafts of Star Wars: Empire: Betrayal the other conspirators were not intended to be as ambitious as Trachta, and Kadir and Gauer did not usurp his role in the conspiracy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}