{"url": "Kenkirk", "categories": ["Category:Legends articles", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kenkirk"}, {"tag": "p", "text": "Kenkirk was a commander and officer in the Imperial Navy who lived at the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kenkirk entered the Imperial Navy and rose to the rank of Lieutenant. As of 1.5 ABY he served aboard the Imperial Star Destroyer Blackguard under the command of Captain Andal Sait. When Sait decided to go rogue and sell his ship to the criminal Black Sun crime syndicate, Kenkirk too became a traitor to the Empire and remained loyal to Sait. He helped test other officers' allegiance and persuaded several of his fellow crew members to follow the traitorous Captain."}, {"tag": "p", "text": "Kenkirk was on duty on the Blackguard's bridge when chief engineer Olum started all the ship's TIE Fighters to use them to transmit a message to the Empire, warning them about Sait's treachery. As Olum had disabled the ship's tractor beams, most of the fighters were shot down. After this incident, Sait promoted Kenkirk to the rank of Commander."}, {"tag": "p", "text": "Eventually the news about Sait's treachery got out and a crew of heavily armed spacers was sent to the Blackguard. The spacers boarded the ship and managed to fight their way through the ship towards the Star Destroyer's bridge. Kenkirk awaited them not far from the bridge and attacked the adventurers with heavy weapons, but was killed in the fight. Soon after, Sait was killed too and the spacers gained control of the Blackguard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Cmdr. Kenkirk was a non-player character (NPC) in Sony Online Entertainment's MMORPG Star Wars Galaxies. He was added as part of the Lost Star Destroyer Heroic Encounter, a high-level instance, in Chapter 8: The Nova Orion Crisis in January 2008."}, {"tag": "p", "text": "Kenkirk was the penultimate boss for the player groups who tried to beat the rogue Imperials and regain control of the Star Destroyer Blackguard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}