{"url": "Kenek_Weeyo", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Historians", "Category:Males", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Kenek Weeyo"}, {"tag": "p", "text": "Kenek Weeyo was a Rodian male bounty hunter who served the Bounty Hunters' Guild during the reign of the Galactic Empire. Weeyo took a keen interest in the history of the Guild and he eventually attained the position of Chief Custodian of the Bounty Hunters Guild Museum and Library. At some point, Weeyo wrote a passage on the Guild's history that was included within the Bounty Hunters Guild Handbook, a manual that was issued to new Guild members."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Rodian male Kenek Weeyo was a bounty hunter who joined the Bounty Hunters' Guild and was made Chief Custodian of the Bounty Hunters Guild Museum and Library. Throughout his time in charge of the library and museum, the Rodian encountered many younger bounty hunters who showed no interest in the history of the Guild, or the experiences recorded by their predecessors. Each of these hunters went on to die in the field, and Weeyo added all of their names to the Guild's list of the dead. At some point following the fall of the Jedi Order, when Weeyo had held Chief Custodian for many years, the Rodian was asked to contribute a chapter to The Bounty Hunter Code, a handbook given to each member of the guild including lessons and advice on being a part of the organization. The Rodian's chapter was titled \"Our History\", and focused on the history of the Bounty Hunters' Guild, including sections on the many bounty hunting groups that came before the guild, the Guild's previous cooperation with the Jedi Order, the founding of the guild in its current form, and the Ixtlar incident which killed every member of a Human-only splinter faction of the Guild."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Weeyo strongly believed that studying the past was a vital part of learning to be a good hunter, and encouraged all Guild members to read over the records in the Guild library so that they might improve themselves by studying the triumphs and mistakes of past bounty hunters. Any hunter who showed no interest in the past and spent no time reading about the Bounty Hunters' Guild's history was seen by the Rodian as a fool and simple muscle-for-hire, and he believed that any who lived this way would, regrettably, not live long at all. He wrote his chapter in The Bounty Hunter Code in the belief it was an important section for new members to read, although close to the start he stated that those not interest in history were more than welcome to skip the section at their own peril. The Trandoshan bounty hunter Bossk considered Weeyo a blowhard."}, {"tag": "p", "text": "Weeyo believed that the Jedi had always planned to take over the Republic as the Empire claimed they attempted to do at the end of the Clone Wars, and believed it was important that the Guild correct the belief that the Guild served the Jedi due to past cooperation. The Rodian also saw honor and dignity as incredibly important characteristics of a bounty hunter, speaking poorly of the bounty hunters who offered themselves as mercenaries during the Mandalorian Wars and pleading with readers to act with honor when working for the guild, no matter how monstrous those actions might be. He saw the legacy of the ruthless bounty hunter Calo Nord as a problem for the Guild, as many believed all bounty hunters acted as brutally as Nord had. He saw the Guild as a truly egalitarian group, allowing all to join including droids, and held the belief that the Ixtlar incident save the organization. Weeyo had green skin and black eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kenek Weeyo was first created as one of the fictional authors of The Bounty Hunter Code: From the Files of Boba Fett, a reference book released in 2014 and written by Jason Fry, Daniel Wallace and Ryder Windham."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}