{"url": "Kenobi_(novel)", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Articles to be expanded", "Category:Legends novels"], "nodes": [{"tag": "h1", "text": "Kenobi (novel)"}, {"tag": "p", "text": "Kenobi is a Star Wars Legends novel that tells the story of Obi-Wan Kenobi's first days of self-exile on the desert planet Tatooine following the events of Star Wars: Episode III Revenge of the Sith. It was written by John Jackson Miller and first published by Del Rey in hardcover on August 27, 2013. The first paperback edition was released on July 29, 2014 and includes the short tie-in story \"Incognito\" by Miller."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h3", "text": "Hardcover"}, {"tag": "p", "text": "Back cover"}, {"tag": "p", "text": "The Republic has fallen. Sith Lords rule the Galaxy. Obi-Wan Kenobi has lost everything. Everything but hope."}, {"tag": "p", "text": "Internal flap"}, {"tag": "p", "text": "Tatooine—a harsh desert world where farmers toil in the heat of two suns while trying to protect themselves and their loved ones from the marauding Tusken Raiders. A backwater planet on the edge of civilized space. And an unlikely place to find a Jedi Master in hiding, or an orphaned infant boy on whose tiny shoulders rests the future of a galaxy."}, {"tag": "p", "text": "Known to locals only as “Ben,” the bearded and robed offworlder is an enigmatic stranger who keeps to himself, shares nothing of his past, and goes to great pains to remain an outsider. But as tensions escalate between the farmers and a tribe of Sand People led by a ruthless war chief, Ben finds himself drawn into the fight, endangering the very mission that brought him to Tatooine."}, {"tag": "p", "text": "Ben—Jedi Master Obi-Wan Kenobi, hero of the Clone Wars, traitor to the Empire, and protector of the galaxy's last hope—can no more turn his back on evil than he can reject his Jedi training. And when blood is unjustly spilled, innocent lives threatened, and a ruthless opponent unmasked, Ben has no choice but to call on the wisdom of the Jedi—and the formidable power of the Force—in his never-ending fight for justice."}, {"tag": "h2", "text": "Opening"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Obi-Wan Kenobi is a new arrival on the planet of Tatooine. Now going under the guise of Ben, he has left the infant child of Anakin Skywalker, Luke Skywalker, in the care of Owen Lars and Beru Whitesun Lars. Kenobi sets up a house in the outskirts of the desert with his pet eopie, Rooh."}, {"tag": "p", "text": "Nearby, the settlers and moisture farmers of Dannar's Claim rally together under Orrin Gault against the threat of the Tusken Raiders, who are gradually losing morale and people against Gault's alliance of settlers."}, {"tag": "p", "text": "Following another of the settlers' victorious battle against the Tusken Raiders, Kallie Calwell, the teenaged daughter of the owner of Dannar's Claim, Anilleen, accidentally rides an animal toward a field of Sarlaccs. Annileen tries to save her daughter, but both women are saved by Kenobi, riding on Rooh."}, {"tag": "p", "text": "After saving the Calwell women, Kenobi begins to visit Dannar's Claim on an irregular basis to the point where he soon sees what the united settlers are doing to the Tusken Raiders. Kenobi communicates with the Tusken's leader, A'Yark, who agrees that what the settlers are doing to the Tuskens is morally wrong. At the same time, Annileen starts to develop a fond attraction to Kenobi."}, {"tag": "p", "text": "Kenobi decides to investigate Orrin Gault, who wants to marry Annileen. The former Jedi discovers that Gault is deeply in debt to Jabba Desilijic Tiure, and is rallying the settlers for his own financial benefit; as well, Orrin's desire to marry Annileen was also to plunder more money from her ownership of Dannar's Claim to give to Jabba. After stopping one of Gault's scams to get more settlers into his sham alliance, Kenobi becomes a pariah whom Gault wants dead. Thus, Kenobi teams up with the Tusken Raiders to take Gault down."}, {"tag": "p", "text": "Kenobi comes up with a plan to gather the Tusken clan who has been attacked by Orrin's group. While Ben is preparing the Tuskens, Annileen calls Jabba's cronies to come and settle the large debt that has been accumulated. Orrin still tries to make Kenobi the scapegoat and get the other settlers to rally against the man, but in the end Annileen tells the settlers that Kenobi is a good person. This confirms the suspicions the settlers harbor of Orrin's goals. When being pursued by Orrin, a canyon krayt dragon attacks Kenobi. This is where he reveals himself as a Jedi to Orrin Gault as he battles the beast. After destroying the krayt dragon, Orrin schemes to reveal Kenobi to the Empire; this being his last card to play because of his desperate situation with the settlers, the Tuskens, and his debt to Jabba. Eventually Orrin tries to escape, making use of a damaged land speeder. In a face off with Annileen, Kenobi, and A'Yark, Orrin accelerates quickly towards the Tusken leader which sends Orrin speeding off a cliff into the Tusken badlands. This is the last time Orrin is seen by Kenobi, Anilieen or the children."}, {"tag": "p", "text": "In the end, Orrin survives the speeder crash but is paralyzed from the waist down and badly burned. He wakes to find he has been taken in by the Tuskens and, due to his injuries, must wear one of their breathing masks. A'Yark reveals to Orrin that he is now a slave serving the Tusken camp and will be put to use repairing moisture vaporators."}, {"tag": "p", "text": "Annileen and her children meet Kenobi at his house in the Jundland wastes. Kenobi reveals to Annileen that he has arranged for her to travel to Bestine and leave Tatooine for good. He also gives her news that he submitted her university application, that she had been holding onto for so many years. She will study exobiology and travel to multiple systems and planets to study different species as part of the program. She is overjoyed with the news. But Kenobi reveals that he will not be joining with her and her family. He explains that he has responsibilities on the planet that require his care. He also explains how he has been withholding information from her about his past. This upsets her greatly and causes her to feel sorry for Kenobi. She is saddened to lose her new savior, but finds a way to deal with her grief."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Kenobi is a sweeping story that is all Star Wars, part epic western, part romance, and part high-stakes drama. Author John Jackson Miller worked on the concept of this book since 2006."}, {"tag": "p", "text": "The book was originally scheduled to be released on July 27, 2013."}, {"tag": "p", "text": "According to artist Chris McGrath, he created two versions of the cover artwork for his commission. His preferred piece was used for the Brazilian version, while the other became the cover art for the original release."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}