{"url": "Kensaric", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Endor strike team personnel", "Category:Humans", "Category:Males", "Category:Scouts", "Category:Soldiers"], "nodes": [{"tag": "h1", "text": "Kensaric"}, {"tag": "p", "text": "Kensaric was a Human male soldier in the Alliance to Restore the Republic's Special Forces. In 3 ABY, he served as a scout and field tracker at the Alliance's Echo Base under the command of Major Bren Derlin during the Battle of Hoth. One year later, Kensaric, by then a corporal, participated in the Battle of Endor. He was a member of a strike team sent to the Forest Moon of Endor to destroy the SLD-26 planetary shield generator protecting the Galactic Empire's second Death Star battlestation in orbit of the moon. During the battle, Kensaric was a scout responsible for covering the strike team's tracks. The strike team was able to successfully destroy the shield generator, allowing the Alliance Fleet to destroy the unprotected Death Star."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Battle of Hoth"}, {"tag": "p", "text": "The Human male Kensaric served as a soldier in the Special Forces of the Alliance to Restore the Republic during the Galactic Civil War. In the year 3 ABY, Kensaric was stationed in Echo Base, the Alliance High Command's headquarters on the planet Hoth, where he served as a scout and a field tracker under the command of Major Bren Derlin. That year, Kensaric participated in the Battle of Hoth, during which the Galactic Empire discovered and initiated a ground assault on the Rebel base, ultimately forcing the Alliance to abandon the planet. Kensaric was able to survive the Alliance's staggering defeat."}, {"tag": "h3", "text": "Service on Endor"}, {"tag": "p", "text": "Following the evacuation, Kensaric was stationed with the Alliance Fleet until 4 ABY. By that time, he had become a corporal. That year, the Alliance discovered that the Empire was constructing a second Death Star battlestation in orbit over the Forest Moon of Endor. A strike team led by General Han Solo was organized to infiltrate the moon and destroy the SLD-26 planetary shield generator protecting the Death Star. The strike team, made up of volunteers, was chosen from men who had previously served at Hoth. Solo contacted Derlin, and the strike team was shortly afterward assembled. Kensaric was a member of the strike team, serving as a scout responsible for covering the team's tracks."}, {"tag": "p", "text": "Kensaric and the rest of the strike team traveled to the Endor system aboard the stolen Imperial Lambda-class T-4a shuttle Tydirium, flown by Solo and his co-pilot, the Wookiee Chewbacca. Although they were queried by the Executor-class Star Dreadnought Executor, the use of a stolen Imperial clearance code gave the shuttle clearance to land at their destination. Upon landing on Endor, the strike team began scouting the area. They eventually spotted a scout trooper patrol consisting of Corporal Avarik and Sergeant Elsek, and Solo's failed attempt to stealthily ambush the pair caused a skirmish that alerted more scout troopers to the strike team's presence."}, {"tag": "p", "text": "Their position compromised, two other members of the strike team's command crew, Luke Skywalker and Leia Organa, mounted Avarik's 74-Z speeder bike and gave chase to the remaining scouts. The strike team waited until only Skywalker returned. Upon realizing that Organa was missing, having been separated from Skywalker during the speeder bike chase, Solo led the rest of the command crew to search for her, giving the strike team orders to continue on their path until a rendezvous at the deflector shield generator at 0300 hours."}, {"tag": "p", "text": "Led by Derlin, Kensaric and the rest of the squad made its way toward the shield generator. Although the squad managed to hide from several encounters with Imperial patrols, Corporal Delevar, the team's medic, almost compromised their position by preparing to take a potshot at a speeder bike, to which Derlin subsequently reprimanded him."}, {"tag": "p", "text": "Kensaric and the squad set up camp in a camouflaged shallow ravine at nightfall, posting two sentries and setting up a blanket grid with their scanning equipment. Shortly after their first sleeping shift, the scanners picked up an All Terrain Scout Transport walker coming towards their location. When it became clear that the walker would not pass them by, Corporal Dansra Beezer jammed its transmissions. Lieutenant Greeve destroyed both spotlights with his A280 blaster rifle, and the squad circled the walker to keep it off balance. When the AT-ST began firing randomly into the trees and foliage, Delevar fired a smoke canister into its cockpit. The resulting explosion forced the walker pilots to abandon the vehicle and surrender to the strike team. The squad captured the pilots and, holding them at blasterpoint, forced them to make a comm check-in. As the squad continued on to the rendezvous point, they forced the pilot to make several more check-ins on the way to explain the walker's absence."}, {"tag": "p", "text": "By the time of the reunion, Solo and his companions had befriended the moon's Ewok tribe of Bright Tree Village. The Ewoks showed the strike team a route to the Endor shield generator bunker's backdoor. Four scout troopers guarded the entrance; however, one of the Ewok scouts, Paploo, stole one of the scouts' speeder bikes, prompting three of them to give chase. Solo lured the remaining scout to the waiting strike team, who took him captive and made their way into the bunker, intending to destroy it with 7-PrG proton grenades. However, they were soon ambushed by Tempest Force, the Imperial Army legion stationed on Endor, and led outside the bunker."}, {"tag": "p", "text": "The strike team's capture was short-lived, as the Ewoks launched a counterattack on the Imperial troops, turning the tide of the battle in favor of the Alliance. Eventually, Chewbacca hijacked one of the AT-ST walkers, Tempest Scout 2. Solo decided to mount the walker, and, donning an AT-ST driver's helmet, used the walker's communication system to give a fake Imperial victory message to the bunker, once more getting the doors opened. Regaining access to the bunker, the strike team managed to successfully destroy the shield generator with their proton grenades, allowing the Alliance Fleet's starfighters to enter the unprotected Death Star and destroy its reactor core."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kensaric was fair-skinned with brown hair. He was chosen for Han Solo's strike team after serving at Echo Base, where Solo witnessed his loyalty, dedication, resourcefulness, and ability to devise creative situations. The defeat at Hoth turned Kensaric into a hardened veteran, eager for revenge against the Empire. When Solo explained the risks involved with serving on the strike team, Kensaric willingly and eagerly accepted them. Kensaric was a master at small-squad tactics, sabotage and night-time combat."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Kensaric and the rest of the Endor strike team were equipped with basic commando gear, which included a standard comlink, a low-feedback scanner, a sensor scrambler, a heavily muffled blaster, and full-forest-camouflage fatigues."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kensaric appeared in promotional photos for 1983's Star Wars: Episode VI Return of the Jedi, although he did not appear in the final film. The photos, which appear in 1998's Star Wars: Behind the Magic CD-ROM, show Kensaric standing in the second Death Star's corridors alongside Luke Skywalker and Dark Lord of the Sith Darth Vader. Although not credited, he was portrayed by Paul Weston. Kensaric was first identified by name and given a brief backstory on a card for the June 1999 Endor Limited expansion set of the Decipher, Inc. Star Wars Customizable Card Game. According to a Star Wars CCG fan site, Kensaric was named as an anagram of Decipher employee John Sarnecki."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}