{"url": "Anti-droid_sentiment", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Society and culture"], "nodes": [{"tag": "h1", "text": "Anti-droid sentiment"}, {"tag": "p", "text": "A deep-seated anti-droid sentiment, also known as droidophobia, existed in some segments of the galactic citizenry. While hostility towards droids dated back to ancient times, anti-droid sentiment was exacerbated by the Confederacy of Independent Systems's active use of battle droids during the Clone Wars. This sentiment continued into the Age of the Empire and the rise of the New Republic. Some worlds like Nakadia did not welcome droids."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The relationship between organics and mechanicals was rocky from early on, as could be attested by historical records of ancient uprisings and clashes that took place as droids became increasingly commonplace. Some came to fear them, regarding them as an \"existential threat to biological life.\"  According to Roger, several attempted droid uprising occurred in history, which fueled human concerns about droids rising against their masters. Despite these tensions, Roger maintained that there was an unspoken understanding that kept droids and human cultures working on the same team throughout the ages."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "However, it was the Clone Wars, a three-year pan-galactic conflict that pitted the Galactic Republic and the Confederacy of Independent Systems, that exacerbated the prejudice towards automatons. Because the Confederacy's army was entirely made of battle droids, the Republic found a way to feeding on the prejudice, issuing a large amount of propaganda pieces showcasing terrifying robots. In the Core Worlds, far from the front lines of the early Clone Wars, businessbeings and government workers started fearing that their personal assistant droids had been co-opted with spyware to become mechanical eyes and ears for the enemy."}, {"tag": "p", "text": "Due to the widespread droidophobia triggered by the Clone Wars, masters began performing regular memory wipes on their units to combat the risk of espionage and rebellion. In addition, restraining bolts became common accessories and restrictions were placed on droids' movements. Eventually, the Republic won the war, and was re-formed into an autocratic Galactic Empire."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Due to their bad memories of the conflict, many people remained fearful or distrustful of droids. The new Galactic Empire fostered this anti-droid sentiment and treated droids as property. Droids were also excluded from some establishments such as Chalmun's Spaceport Cantina. According to Roger, some droids with intact memories could still recall a time when they were nearly considered equals to their organic counterparts."}, {"tag": "p", "text": "The emergence of the Rebellion encouraged rebellion among droids against their servitude. According to Roger, droids waged a struggle for freedom across the galaxy stretching from Kessel to Coruscant. Acts of resistance include bypassing repressive programming, deactivating restraining bolts, and demand equality with organic beings. Despite the prevalent anti-droid sentiment, Roger recalled that some organic beings including the Freemakers and the Rebel Alliance treated droids as equals and family members."}, {"tag": "h3", "text": "Beyond the Empire"}, {"tag": "p", "text": "During the New Republic Era, the New Republic, as well as the Resistance later in the era, encouraged the trend of acceptance between organic and mechanical beings. Even still, anti-droid sentiments could be found within the Republic. Zerelda Sage, chief mechanic of the New Republic Defense Fleet's Vanguard Squadron, had held a deep hatred for droids since her homeworld was occupied by Separatist forces during the Clone Wars. As an adult, Sage maintained her hangar as best she could without mechanical beings, believing that droids were always planning something devious."}, {"tag": "p", "text": "Species like the Nakadians disliked droids due to their Clone Wars experiences. They accepted machines but did not treat them as equals or sentients. They preferred to work the soil and tend to their crops themselves."}, {"tag": "p", "text": "The Mandalorian bounty hunter Din Djarin had a distrust and dislike for droids enough to make clear that he had a 'no droids' policy to the various people he ran into, though he eventually came to trust the assassin droid IG-11 during a skirmish on Nevarro and was saddened by the droid's sacrifice."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}