{"url": "Kento_Marek%27s_Jedi_Master", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Individuals of unspecified species", "Category:Jedi Purge victims", "Category:Post-Ruusan Jedi Masters", "Category:Unidentified Jedi of the Jedi Order", "Category:Unidentified males"], "nodes": [{"tag": "h1", "text": "Kento Marek's Jedi Master"}, {"tag": "p", "text": "This Jedi was a Jedi Master who served the Jedi Order during its final years. His apprentice, Kento Marek, outlived him by several years following the Jedi's death during the Great Jedi Purge."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "This individual began training in the Jedi Order during infancy as with all Jedi of the era. Studying at the Jedi Temple on Coruscant, this Jedi eventually passed the Jedi Trials and was knighted by the Jedi High Council. Further pursuits of knowledge of the Force and lightsaber skill earned this individual the rank of Master. It was at this point in life that this individual spotted initiate Kento Marek and took him as a Padawan."}, {"tag": "p", "text": "Training Marek to Knighthood, this Jedi Master joined the Grand Army of the Republic as a general fighting the Separatist Droid Army during the Clone Wars. In 19 BBY, following the execution of Order 66 and the fall of the Galactic Republic, this Jedi Master was hunted down and slain by the Dark Lord of the Sith, Darth Vader."}, {"tag": "p", "text": "Learning of his former master's death, Marek and his Jedi wife, Mallie, fled to Kashyyyk and went into hiding with their child, Galen. Remaining true to their teachings, the couple attempted to assist the local Wookiees repel the Imperial onslaught following the Galactic Empire's initial enslavement runs on the planet. It wasn't long before Mallie Marek fell in battle, and eventually in 18 BBY Kento Marek shared the same fate as his master."}, {"tag": "p", "text": "When Vader hunted down Kento Marek, he sensed a presence far more powerful then Kento nearby. Assuming it was Marek's master, Vader demanded his whereabouts. Marek replied that the dark side blinded him from realizing he had already slain his master years before. Vader replied that Marek would share his fate."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}