{"url": "Kentra", "categories": ["Category:Legends articles", "Category:Avian and airborne sentient species", "Category:Feline sentient species", "Category:Kentra", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Kentra"}, {"tag": "p", "text": "The Kentra were a winged feline sentient species indigenous to Orellon II. They were simple and friendly with a sense of humor and honesty. Even though they were supple in terms of truth, they placed much emphasis and value on honor, which was more than just a simple social grace. Honor was the primary social measure among Kentra. A dishonorable Kentra would be banished from society forever."}, {"tag": "h2", "text": "Culture and society"}, {"tag": "p", "text": "The Kentra lived in villages among the branches of the colossal buntra trees consisting primarily of wooden houses. However, some larger cities, like Kariish were built into mountain ridges."}, {"tag": "p", "text": "The Kentra had a social structure which was based on nests, family and village folk. Nests were organized into regional clans and racial flocks. Major cities had lords who were placed in a notional council that aided the king of the Kentra in ruling the planet."}, {"tag": "h3", "text": "Flocks"}, {"tag": "p", "text": "The Kentra had distinctive racial markings and were divided into the following radial and ethnic flocks:"}, {"tag": "h2", "text": "Kentra soldiers"}, {"tag": "p", "text": "The Kentra were a warrior people. Soldiers were selected and trained at an early age. They were taught to be honorable and to use their skills to the benefit of the nest and not for the individual. Soldiers who violated the code of honor were dismissed and banished. Kentra soldiers would typically carry primitive melee weapons such as knives and swords, but were also proficient in bow and arrows."}, {"tag": "h2", "text": "Bas'c and the Prophet Tandra"}, {"tag": "p", "text": "The Kedra spoke a variant of Basic that they called \"bas'c\". Their religion was the Holy Order of the Je'ulajists and they worshiped the prophet Tandre."}, {"tag": "p", "text": "Tandre was in reality a Jedi Knight who crash-landed on Orellon II in the Alpha Kentrum centuries before the Galactic Civil War and became the spiritual leader of the Kentra, teaching them the ways of the Jedi. After his death, he left computer programs to guide the Kentra."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}