{"url": "Kento_Marek", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Force ghosts", "Category:Humans", "Category:Jedi Purge victims", "Category:Kashyyyk residents", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Kento Marek"}, {"tag": "p", "text": "Kento Marek was a Human male who lived as a Knight of the Jedi Order. Upon the outbreak of the Clone Wars, he fought on the side of the Galactic Republic alongside his fellow Jedi. Commissioned as a Jedi officer like the rest of the Order's members, Marek eagerly led clone troopers into battle on many fronts. As common with the younger generations of the Jedi Order, Marek craved excitement, adventure and the opportunity to perform many heroic acts as a warrior. Hence, he saw the conflict between the Republic and the Separatists as the opportunity to demonstrate his skills as a Jedi and a leader."}, {"tag": "p", "text": "During the Clone Wars, Kento Marek became acquainted with a fellow Jedi named Mallie. Unlike Kento, Mallie had no interest in seeking fame and glory as a warrior. Her sympathy for those who suffered throughout the conflict caused Marek to rethink his personal views. Despite their differences, the two developed a close relationship with each other, which eventually culminated into love—an emotional attachment that was expressly forbidden by the long-standing tenets of the Jedi Order. In the midst of the galaxy-wide fighting, Kento and Mallie renounced their allegiance to the Order and married in secret. Due to their self-imposed exile, the two former Jedi Knights abandoned the war and went into hiding in order to start a new life together."}, {"tag": "p", "text": "Their desertion saved their own lives when, upon the decree of Order 66, the clone troopers betrayed and murdered their Jedi officers on thousands of fronts all over the galaxy. The systematic genocide extended to ex-Jedi as well, thus turning Kento and Mallie into fugitives. As the Galactic Empire ascended to replace the former Republic, the Mareks had settled on the planet Kashyyyk where they were hidden and protected by the native Wookiee population."}, {"tag": "p", "text": "For ten years, Kento hid on Kashyyyk, avoiding detection from the Empire. At some point after their arrival, Mallie became pregnant and gave birth to a son, Galen Marek. Shortly afterward, she was killed while trying to defend a group of Wookiees from Trandoshan slavers. Forced to raise their only child by himself, Kento and his son were still living on Kashyyyk when the Sith Lord Darth Vader launched a massive invasion on Kashyyyk. With the secrecy of his hidden location compromised, Kento Marek resumed his former role as a Jedi Knight and aided the Wookiees in defending their homeworld. When the battle was all but lost, Kento Marek made his last stand against Vader in front of his hut. After a brief duel, Kento was easily defeated by the more powerful Sith Lord. Upon his death, Vader took it upon himself to raise the Jedi's young son as his secret apprentice."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "In accordance with the strict recruiting policy of the Jedi Order, Kento Marek's connection to the Force was detected by the Order when he was a young child. Raised and trained within the Jedi Temple on Coruscant, Marek eventually passed his final trials as a Padawan learner and ascended to the rank of Jedi Knight. Like many other young Jedi, Marek was extremely confident in his status as a Jedi, but also proud and arrogant to a fault."}, {"tag": "p", "text": "When the Clone Wars began in the year 22 BBY, Marek was eager to pursue the opportunity to prove his skills and abilities in battle. He served as a Jedi officer in the Grand Army of the Republic, along with the rest of the Order's members. Commanding armies of clone troopers, Marek fought on various battlefields. As a thrill-seeker, he reveled in the fighting and took pride in his accomplishments as a general."}, {"tag": "h3", "text": "Battle of Talus"}, {"tag": "p", "text": "Kento Marek's responsibilities as a Jedi General eventually brought him to a Core world of Talus. During that time, he became acquainted with Mallie, a fellow Jedi and self-styled freedom fighter. Unlike Marek's eagerness for battlefield glory, Mallie felt neither excitement or desire to fight in the Clone Wars. She strongly sympathized with anyone who suffered in one capacity or another due to the effects of the galactic-spanning conflict. Although they possessed different point of views at the time, the two Jedi were able to develop a rapport with each other."}, {"tag": "p", "text": "Marek's exposure to Mallie's personal views created a change within him that reshaped his original way of thinking. In losing his youthful desire for fame and recognition over his achievements, Marek came to share Mallie's sympathy towards others. As their relationship grew, Marek fell in love with Mallie, despite the Jedi Order's restrictions against love and other emotional attachments. Mallie also violated the Jedi Code by returning Marek's feelings."}, {"tag": "h3", "text": "Self-imposed exile on Kashyyyk"}, {"tag": "p", "text": "Before the conclusion of the Clone Wars, Kento and Mallie married each other in secret. In doing so, they renounced their allegiance to the Jedi Order and became exiles in order to start a new life together. Ironically, their actions ultimately saved their lives. When Chancellor Palpatine, the public persona of the Sith Lord Darth Sidious, issued Order 66 to the Grand Army, thousands of Jedi officers were murdered by their own clone soldiers throughout the galaxy."}, {"tag": "p", "text": "With the Jedi Order all but eliminated, Palpatine dissolved the Republic and declared himself emperor of the first Galactic Empire. Although wracked with guilt for deserting his former comrades, Kento was forced to go into hiding with his wife in order to escape from the systematic extermination aimed at all surviving members of the Order—including ex-Jedi. While the two former Jedi escaped into hiding, Kento's Jedi Master was slain by the Emperor's apprentice, Darth Vader."}, {"tag": "p", "text": "After settling on Kashyyyk, Kento Marek would live amongst the Wookiees for ten years. During that time, Mallie gave birth to their only child, Galen Marek. The child of two Jedi Knights, Galen was born with an exceptionally powerful connection to the Force. His ability to wield the Force was far greater than his parents and his potential was equal to that of Emperor Palpatine as well. The family's happiness would be cut short with a tragedy when Mallie died while defending Wookiees from a group of Trandoshan slavers. The loss of his wife left Kento in the position to raise their son alone."}, {"tag": "h3", "text": "The Invasion of Kashyyyk"}, {"tag": "p", "text": "Years later, at some point after Mallie Marek's death, Darth Vader discovered that a Jedi was being kept hidden by the Wookiees on Kashyyyk. Acting on the information, the Sith Lord amassed a fleet of Star Destroyers and invaded the planet once again. Kento organized the Wookiees and led them against the Galactic Empire. However, the Imperials underestimated the resolve and defenses of the Wookiees, thus resulting in many casualties during the initial wave. Yet Vader was unconcerned with the battle itself; his only concern was hunting down and eliminating the Jedi who had escaped the Great Jedi Purge for years. Thus, he pardoned the Imperial Commander's incompetence after nearly choking him to death."}, {"tag": "p", "text": "Vader, accompanied by the stormtroopers of Triton Squad, proceeded on foot to infiltrate the Wookiee village. Slaughtering many of its defenders along the way, Vader finally arrived at the front entrance of Kento Marek's hut, which was adorned with the emblem of his household. After Marek, although disguised as a reclusive hermit, failed to deceive Vader, he was forced to make his last stand in front of his home. Using the Force to eliminate Vader's stormtrooper escort, the Jedi and the Sith engaged in a lightsaber duel."}, {"tag": "p", "text": "As the two enemies fought one another, Marek displayed average skill in Shii-Cho, but had almost no comprehension of the more advanced Makashi style. His abilities, both with a lightsaber and in the Force, were severely outmatched by the more powerful Sith Lord. Despite his efforts, Marek was disarmed of his weapon and rendered helpless in a telekinetic grasp. Vader then slammed Kento into a nearby tree, then into a Wookiee sniper nest, then back down to the ground. After having pummeled Kento, Vader utilized a powerful Force Push to send the Jedi crashing through the front entrance of his own hut, causing the Jedi Knight's lightsaber to shatter from the impact."}, {"tag": "p", "text": "Defeated and far too injured to continue the fight, Marek was unable to defend himself as Vader lifted him in the air while slowly choking him to death. However, the Sith Lord was restrained from striking his opponent down when he sensed an incredibly powerful presence in the Force that was somewhere nearby. Due to the fact that the mysterious Force-sensitive was much stronger than the Jedi in his grasp, Vader assumed that the source of the power was Marek's master. When Marek revealed that his mentor had been killed years prior to this moment, Vader reached the end of his patience and raised his lightsaber to cut the Jedi down."}, {"tag": "p", "text": "However, just as Vader moved to kill Marek, his saber was telekinetically ripped from his hand. He turned around to see where his weapon had landed, and was utterly shocked and astonished to see that a young child had used the Force through pure instinct to take his weapon. He quickly realized that the boy was the son of the Jedi that he was about to kill, Galen Marek. When Kento tried to warn Galen to run, the Sith Lord, while keeping his focus centered on the boy, closed his fist. The unmistakeable crack of bone filled the hut, and Kento Marek's form crumpled to the ground. He was dead, his throat crushed. As Galen watched in horror as his father's lifeless body fell to the floor, Vader cautiously tried to approach him in an non-threatening way, but Galen backed away, obviously frightened by the intimidating Sith Lord. At that moment, the Imperial Commander and a squad of stormtroopers entered the hut. Believing that Galen was trying to kill Vader with the Sith Lord's own weapon, he ordered his troops to execute the boy."}, {"tag": "p", "text": "However, Vader had already decided against killing Galen. After sensing the boy's potential, Vader realized that he had just discovered a prodigy of the Force—much like he once was during his life as the Jedi Anakin Skywalker. Hence, he had no intention of allowing such power to be wasted and was not about to allow the boy to be killed. Using the Force to reclaim his lightsaber, Vader blocked the blaster shots that were aimed at Galen before cutting down the commander and his stormtroopers. After eliminating the witnesses who saw Galen, Vader approached the frightened orphan and told him that they had to leave together before more Imperials arrived. Galen, traumatized by what he had just seen, complied with the man who had murdered his father and saved his life. As the Imperial forces went on to claim victory, the son of the late Kento Marek was taken away from Kashyyyk by his new guardian, Darth Vader. As he was escorted away by Vader, the young Galen turned to look for the last time at his family home and the body of his father, the hand outstreched as though reaching for something."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "For roughly a decade since the death of Kento Marek, Galen learned the ways of the Sith under the tutelage of Darth Vader. The Dark Lord's training methods were brutal and bordered on torture; learn or die was the creed he passed on to his student. At first, Galen was controlled by Vader through fear, but then learned to channel the dark side by embracing his anger and hatred. Yet despite Vader's harsh treatment of the boy, there was never any malicious cruelty behind his teachings. Once he made it clear to his protégé that the key to staying alive was obedience and success, it was up to Galen to prove himself worthy and strong enough to stand at Vader's side."}, {"tag": "p", "text": "As Galen grew to become a young adult over the years he spent as Vader's disciple, the memories of his parents and childhood were repressed until he forgot everything about his life before serving the Dark Lord of the Sith, including his birth name. Under the codename \"Starkiller,\" the boy was sent on various missions as Darth Vader's personal assassin; his targets included the Empire's many enemies, but never any Jedi. On the verge of completing his training in 3 BBY, Starkiller finally realized his lifelong dream to hunt and kill Jedi targets."}, {"tag": "p", "text": "Dispatched to a TIE Fighter Construction Facility above Nar Shaddaa, Starkiller was under orders to kill General Rahm Kota. During their fight, the apprentice experienced a disturbing vision where he saw the face of his father, whom he no longer remembered. After being sent to the ruins of the Jedi Temple to further his training through the ancient Jedi Trials, Starkiller heard the voice of Kento Marek, who was attempting to guide his fallen son as the apprentice fought a training program of an ancient Sith Lord called Darth Desolous."}, {"tag": "p", "text": "Up until his final trial in the Temple, Starkiller was completely unaware that the mysterious Jedi in his visions was actually his long dead father. When he reached the top of the Temple's highly-damaged central tower, Starkiller came across a simulacrum that displayed Darth Vader and Kento Marek fighting one another. As Kento stood victorious over Vader, Starkiller moved to defend his master without hesitation. Through the simulacrum, Kento tried to reason with his son, only for his attempts to be utterly ignored as the apprentice immersed himself further into the dark side of the Force. Before the simulacrum was deactivated, Kento apologized to Starkiller for failing to protect him from the life of a Sith and referred to him as \"son.\" The revelation shocked Starkiller to the core, causing him to explore the Temple even further until he found a Holocron that contained a message from his father. Kento acknowledged that, although Starkiller had fallen deep within the embrace of the dark side, there was still time to be saved since Vader had not yet fully corrupted him."}, {"tag": "p", "text": "Starkiller later returned to his homeworld of Kashyyyk, by then heavily occupied by an Imperial military garrison. After discovering the ruins of his childhood home, he was caught in an overwhelming Force vision. Starkiller, in the ominous guise of the Sith Lord that he could become, fought his father in a duel once again. As before in the Jedi Temple, he easily demonstrated his superiority by defeating Kento Marek. As Kento left, Starkiller called out to his father and begged for him to stop, but to no avail."}, {"tag": "p", "text": "Ultimately, Starkiller later chose to accept redemption by embracing his Jedi heritage. Although he defeated his former master in combat, Galen Marek sacrificed his life to save the founders of the newly-formed Rebel Alliance from Darth Sidious. Though the last scion of the Marek family was dead, his heroic sacrifice inspired the countless rebels and dissidents to wage a full-scale war against Sidious' Empire. Furthermore, the Alliance chose to honor Galen's memory by adopting his family's symbol as its official emblem. Hence, the son of Kento Marek left behind a legacy that changed the fate of the galaxy forever as the growing forces of the Alliance became emboldened to challenge the tyrannical rule of the Galactic Empire."}, {"tag": "p", "text": "Kento Marek's bloodline, although technically ended by Galen Marek's death, was preserved, ironically by Darth Vader himself. Just before Galen's untimely demise, Vader had learned of his expendable status when Sidious—preferring a younger and far more powerful apprentice—attempted to replace him with Marek. Though Marek chose redemption through death over life as a Sith Lord, his end had nevertheless robbed Vader of his greatest chance to overthrow Darth Sidious. But even death was not enough to dissuade him from undertaking a task that had been considered impossible throughout history. Thus, he brought Galen's body to the planet Kamino and preserved it within a secret freezing chamber of the Timira City Cloning Facility. Extracting cells from Galen's corpse, the Dark Lord began a long and painstaking six-month project to create a far more powerful and loyal version of his dead apprentice."}, {"tag": "p", "text": "But due to the dangerous and unreliable science of cloning, combined with the extreme complexities of cloning Force-sensitive subjects, Vader's first attempts to clone Galen's genetic code produced a series of aberrant monstrosities. Although Galen's genetic code remained intact within them, the imperfections in the cloning process resulted in clones that were physical deformed and psychologically unstable. Due to the memory imprints that were downloaded into the clones, they all suffered from an identity crisis and, due to their mentally deranged state of mind, were driven completely mad. Thus, the only way to perfect the process was by constantly creating new clones of Galen Marek, each one more improved than the last. Through a new and experimental style of cloning, Vader engineered \"accelerated\" clones—genetic duplicates that grew to reach young adulthood in a few short weeks."}, {"tag": "p", "text": "Over six months of one failure after another, Darth Vader witnessed much improvement in his clandestine project. After eliminating the causes behind the physical defects, new clones were individually trained by the Dark Lord. His ultimate goal was to pick the best and most stable clone, but each clone ultimately succumbed to insanity because of the memories that were downloaded into them from their genetic donor, as well as the emotional imprints that Vader failed to erase. Many clones progressed far in their training, but ultimately came to disappoint Vader. Some were far too distracted by thoughts of the child that Galen once was while others were undermined by memories of Kento Marek. Every clone was \"born\" with different fixations on certain individuals from Galen Marek's past, and it was Vader's goal to eliminate the final destabilizing factor in his experiment."}, {"tag": "p", "text": "Although a renegade clone succeeded in escaping from Kamino, Darth Vader's project finally ended in total success. The latest and most advanced subject to be activated ultimately proved himself to be the only perfect and fully stable clone of the original Starkiller. Like every other clone that preceded him, the dark clone was distracted by the memories of his progenitor and was particularly fixated on thoughts of Captain Juno Eclipse, the woman whom Galen fell in love with before his death. But unlike his \"brethren,\" the clone forcefully purged himself of Galen's emotions and gradually compartmentalized all of the downloaded memories, thus enabling him to distinguish his own experiences from the ones that belonged to Marek. As his training drew closer to an end, the clone had risen to become Darth Vader's new apprentice."}, {"tag": "p", "text": "Much like his superior brother, the clone who escaped and unofficially became known as \"Starkiller\" had been purged of most of Marek's emotions. With the exception of his extreme fixation on Juno Eclipse, the clone spared no feelings for his genetic template's parents or the boy he once was. He was neither distracted by thoughts of striking down PROXY or destroying the Rebel Alliance. Were it not for his inherent infatuation with Eclipse, Vader would have considered him to be the first successful clone. By the end of the Assault on Kamino, the legacy of Kento Marek was divided between the two surviving clones of Galen—Starkiller and the Dark Apprentice."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In his youth, Kento Marek yearned to test his Jedi abilities in battle. He reveled in the fighting that occurred throughout the Clone Wars, relishing the opportunity to fight on the frontlines with the clone troopers at his command. Though arrogant and overconfident, Marek was proud to serve the Galactic Republic as a Jedi Knight and exhibited the necessary courage to risk his life in war."}, {"tag": "p", "text": "His personal views were drastically altered by Mallie, a fellow member of the Jedi Order who also served in the Clone Wars. Through Mallie, Marek developed a greater degree of compassion for the many beings that suffered due to the conflict between the Republic and the Separatists. After falling in love with Mallie, Marek abandoned an entire lifetime of Jedi teachings and philosophy in order to marry her. He was willing to live in exile with his new wife and, although wracked with guilt when the Galactic Empire exterminated most of the Jedi Order, was determined to protect her by avoiding the detection of Jedi hunters throughout the galaxy."}, {"tag": "p", "text": "When Galen Marek was born, Kento became entirely devoted to ensuring the survival of his family in a galaxy that was almost completely hostile to any Jedi, including ex-Jedi. He deeply loved his wife and son, and when Mallie perished on Kashyyyk, Kento devoted the rest of his life to raising their only son on his own. When Darth Vader led an Imperial attack on Kashyyyk, Kento bravely stood alongside his Wookiee allies, despite how severely disadvantaged their position was against the superior forces of the Imperial Military."}, {"tag": "p", "text": "In spite of facing certain defeat, Kento Marek fought to the death to defend Kashyyyk. He was willingly to stand his ground against Darth Vader and, although outmatched and overpowered in every way, only submitted after being severely injured by the Sith Lord. In a final display of compassion, he used the last moments of his life to warn his son to run before being strangled to death by Vader."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "During the Clone Wars, Kento Marek was a capable Jedi General who served in the Clone Wars. His leadership skills and combat abilities were sufficient enough to keep him alive in a conflict that saw the deaths of many Jedi prior to Order 66 and the rise of the Galactic Empire. Against Darth Vader, however, he displayed a rudimentary command of the Force, though enough to hold his own for a short while against Vader."}, {"tag": "p", "text": "While he was able to incapacitate a pair of stormtroopers with a single Force push, his powers were still drastically inferior to Vader's. As typical for a Force-wielder, Marek was skilled in telekinesis, which he employed in his duel with Vader by grabbing several TIE fighters through the Force and hurling them at the Sith Lord. Marek's capabilities as a duelist amounted to an average skill in the Shii-Cho and a very rudimentary understanding of the Makashi combat style."}, {"tag": "p", "text": "His style of attack focused on an offensive barrage of saber strikes against his opponent, thus mirroring the Ataru, yet was also lacking in the more defensive Soresu technique. But despite his combined abilities as a combatant and Force-wielder, Marek's abilities ultimately paled in comparison to not only Darth Vader, but his own son, Galen. A rare prodigy of the Force, the boy who became Vader's secret apprentice was remarkably far more powerful than Kento Marek ever was."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During the planning stages of The Force Unleashed, the creators of the game gave the name \"Jacob Nion\" to the character that would become Starkiller. As the planning continued, the creators opted for the name of \"Galen Marek\" instead. Despite this change, Kento's name in The Force Unleashed video game still appears as \"Kento Nion\" when viewed in the Databank on the Rogue Shadow."}, {"tag": "p", "text": "Apparently, his clothes were left untouched when he died; his costume can be found in the damaged hut by Galen Marek in The Force Unleashed video game."}, {"tag": "p", "text": "In the Wii/PSP/PS2 versions of the game, the scene where Starkiller faces a vision of his father is not on Kashyyyk; instead, it is at the end of Starkiller's third mission to the Jedi Temple on Coruscant, after a lightsaber duel."}, {"tag": "p", "text": "The face and voice of Kento Marek was provided by Tom Kane, who also plays Ozzik Sturn, and Lobot in the Star Wars: The Force Unleashed video game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}