{"url": "Kep-She", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Jedi Masters of the Jedi Order"], "nodes": [{"tag": "h1", "text": "Kep-She"}, {"tag": "p", "text": "Kep-She was a Force-sensitive individual who served the Jedi Order as a Jedi Master prior to the Clone Wars. During the Battle of Malastare Narrows, Kep-She led a Galactic Republic task force to defeat the Harch Admiral Trench's corporate blockade around the planet Malastare. The engagement resulted in the destruction of Trench's flagship and his presumed death. However, Trench resurfaced and joined the Separatist navy during the Clone Wars. Republic Admiral Wullf Yularen, a veteran of the Battle of Malastare Narrows, discovered Trench's survival during the Battle of Christophsis in 22 BBY and consequently briefed Jedi General Anakin Skywalker on the actions of Kep-She's task force at Malastare."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kep-She was a Force-sensitive individual who was inducted into the Jedi Order and had acquired the rank of Jedi Master prior to the Clone Wars. When a corporate fleet blockaded the planet Malastare by 22 BBY, the Galactic Republic engaged them in what came to be known as the Battle of Malastare Narrows. The fleet was commanded by the Harch Admiral Trench, who inflicted heavy casualties on the Republic forces. Despite their losses, a number of Republic personnel survived and escaped the battle, including officer Wullf Yularen. Eventually, Kep-She led a task force to defeat the blockade. Kep-She's task force seemingly achieved success, as Trench's flagship was destroyed and the admiral was presumed to have perished along with it."}, {"tag": "p", "text": "The actions of Kep-She's task force at the Battle of Malastare Narrows were not forgotten. During the Clone Wars, Yularen recognized the crest of the supposedly deceased Admiral Trench while attempting to destroy the Separatist blockade over Christophsis in 22 BBY. Having acquired the rank of admiral himself after the war began, Yularen correctly deduced that the blockade was under the command of Trench, who had somehow survived the battle at Malastare. Yularen relayed his findings to Jedi General Anakin Skywalker, recounting his own experience and the actions of Kep-She's task force during the battle. Yularen then proceeded to assist Skywalker in his subsequent defeat of Trench's blockade, although Trench again survived his apparent demise."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Kep-She was able to lead a task force to destroy Trench's flagship at the Battle of Malastare Narrows, despite the latter's reputation as an accomplished strategist."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kep-She was first indirectly mentioned in \"Cat and Mouse,\" the sixteenth episode of the animated series Star Wars: The Clone Wars' second season, which originally aired on March 26, 2010. In the episode's script, Kep-She was supposed to be directly mentioned as the Jedi who led the Republic task force during the Battle of Malastare Narrows. However, the name was ultimately cut from the episode and Kep-She was instead identified in the corresponding episode guide on StarWars.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}