{"url": "Kep-She/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Kep-She"}, {"tag": "p", "text": "Kep-She was a Jedi Master who served the Jedi Order during the final decades of the Republic. When a corporate fleet under the command of Admiral Trench blockaded the planet Malastare in 34 BBY, Master Kep-She was first assigned to Malastare to \"observe\" the situation and later given command of a Republic task force to break the blockade. Kep-She's task force eventually destroyed Trench's flagship, defeating the corporate fleet at the cost of heavy casualties."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kep-She was a Force-sensitive individual who lived during the waning years of the Galactic Republic. Kep-She was trained by the Jedi Order and eventually reached the rank of Jedi Master. In 34 BBY, a corporate fleet under the command of the Harch Admiral Trench blockaded the Republic planet Malastare. Kep-She was dispatched to the planet as a military \"observer,\" along with several officers like the capable Wullf Yularen. Later, after Trench had repelled a Republic fleet under the command of Yularen, Master Kep-She was assigned to lead a Republic task force to end the blockade."}, {"tag": "p", "text": "The Battle of Malastare Narrows claimed many Republic lives and ships, but Kep-She's task force managed to destroy Trench's flagship, breaking the corporate blockade and supposedly killing the Harch Admiral. Admiral Trench escaped and survived, and joined the Separatists during the Clone Wars."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Kep-She possessed the knowledge and the skills required to become a Jedi Master and managed to defeat the skilled Admiral Trench at Malastare. Before the conflict at Malastare ended violently, Kep-She was sent to \"observe\" the situation on the planet, albeit this was a ruse in truth."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Originally, Master Kep-She was to be mentioned as the Jedi who broke the blockade during the Battle of Malastare Narrows in \"Cat and Mouse,\" an episode in the second season of the Star Wars: The Clone Wars television series which aired in the UK on March 20, 2010 and later aired in the US on March 26. Master Kep-She's name was cut out of the episode, but was still mentioned in the trivia section of episode's official guide on StarWars.com. Further information about Kep-She and the battle was revealed in The Essential Guide to Warfare, which was published in 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}