{"url": "Kephess", "categories": ["Category:Legends articles", "Category:Dread Host members", "Category:Males", "Category:Mercenaries", "Category:Trandoshans", "Category:Warlords", "Category:Warstalkers"], "nodes": [{"tag": "h1", "text": "Kephess"}, {"tag": "p", "text": "Kephess was a Trandoshan male mercenary leader and\nwarlord at the time of the Cold War. He was the commander of the infamous mercenary unit, the Warstalkers. The Galactic Republic military hired them due to manpower shortages with the intention of securing the planet Denova for its strategic supply of Baradium and to hold the invasion force of the similarly interested Sith Empire at bay. During a battle with the Imperial forces, however, he was fatally injured but was miraculously saved by the Dread Masters, at this time rogues on the run from the Empire, who imbued Kephess with some of their considerable power. This led to Kephess' full recovery and he became capable of performing feats beyond that of typical Trandoshans.  The Dread Masters' selected Kephess to be their “chosen one,” their instrument to spread terror and violence across the Galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Denova"}, {"tag": "p", "text": "The Warstalkers followed Kephess, went rogue and turned against the Galactic Republic. In addition, they allied themselves with the Imperial forces already on Denova, who were also corrupted by the Dread Masters. Then Kephess, the self-proclaimed ruler of Denova, went on to declare war both on the Republic and the Sith Empire. Denova became a battleground for a three-way conflict between Republic, Imperial loyalists and the Dread Masters' corrupted forces. Both galactic superpowers sent strike teams to bring the renegade warlord down, who after defeating many of Kephess' subordinates and minions (like Zorn, Toth and Colonel Vorgath), finally succeeded in ending the Trandoshan's reign of terror. Kephess commandeered a prototype Imperial battlewalker but was nevertheless slain in his own compound. The renegade Trandoshan, however, was once again saved by the Dread Masters, and having rejoined them in exile, vowed to take revenge on the those who ended his rule on Denova."}, {"tag": "h3", "text": "Asation"}, {"tag": "p", "text": "Despite his defeat on Denova, Kephess returned later on the planet of Asation. The Dread Masters, with intent to summon the ancient Gree threat, the Terror From Beyond, revitalized Kephess, deeming him the Undying. His size and strength was increased, high-tech armor grafted onto him, and more knowledge of the Dread Masters' Force powers was revealed to him. Kephess then led the Dread Masters' forces to Asation, where he operated on the hypergate meant to summon the Terror From Beyond. Heroes from the Sith Empire and Galactic Republic, however, sent strike teams of eight or sixteen to quell the threat. Three battles in, these heroes faced Kephess the Undying. He is once again defeated, presumably by the same team that saved Denova. However, Kephess was mysteriously sucked into the hypergate by a tentacle of the Terror From Beyond."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kephess is one of the primary antagonists, last and main enemy that the players must defeat in the Operation mission Explosive Conflict and Terror From Beyond in the 2011 video game Star Wars: The Old Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}