{"url": "Keren/Legends", "categories": ["Category:Legends articles", "Category:Cities on Naboo", "Category:Keren locations"], "nodes": [{"tag": "h1", "text": "Keren"}, {"tag": "p", "text": "Keren was an important trading city located on the planet Naboo."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Keren was the most important trading city on Naboo. The city was a bustling hive of mercantile activity. Planetary as well as interstellar traders could be found here, amid a wide assortment of goods and products. Keren was home to one of the planet's starports, named Kwilaan Starport, which was located in its own section in the western part of the city. Keren was also a major hub for the criminal element in the sector. Smugglers, mercenaries, and bounty hunters were common in the city."}, {"tag": "p", "text": "Keren was also renowned as a stunning example of architecture and nature complimenting each other. The streets and buildings were organized in accordance with the local channels and waterfalls. Lake Varum lay on the edge of the city. There was also a canal that curved its way through the middle of Keren, ending at the Keren Grand Arch that overlooked the cityscape."}, {"tag": "p", "text": "The city was also the site of the Keren Street Race."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 32 BBY, Keren was the largest city on Naboo as well as the center of the planet's small underworld, notably Shep Contopault's and Hesh Verbon's operations. Due to several disappearances in the city, it has also been rumored that there was slave trafficking in and around the Kwilaan Starport."}, {"tag": "p", "text": "During the Invasion of Naboo, several Naboo guards were stationed in Keren, such as Hexler Pend. They hid in an armory in the city, but were found and forced to surrender as a Multi-Troop Transport knocked the armory's duracrete walls down."}, {"tag": "p", "text": "After the Battle of Yavin, a group of Trandoshan slavers of the Blackscale Clan led by slavemaster Trussk was based in Keren. Around 1 ABY, a group of spacers attacked Trussk's fortress on Naboo, killing most slavers during the raid. These adventurers were investigating the disappearance of a smuggler known as Cal Handro and suspected the Blackscale Clan to have captured him."}, {"tag": "p", "text": "The same year, a Mauler warlord known as the Mauler Usurper attempted to attack the city of Keren. However, his plan was foiled by the Royal Security Police Force and the warlord was killed in the nearby Mauler Stronghold."}, {"tag": "p", "text": "Keren later became a hotspot of skirmishes between Imperial and Rebel forces as the Galactic Civil War intensified. One of the Rebel Alliance's leaders, Leia Organa, sent a transmission to all Alliance Fleet commanders to tell them to rally ships and available ground forces to three cities in the galaxy: Keren, Bestine on Tatooine and Dearic on Talus. Organa thought that, with its high level of commerce and financial influence throughout the Naboo system, Keren was a critical strategic point. Furthermore, as Naboo was Emperor Palpatine's homeworld, she hoped the Alliance would get access to crucial intelligence."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The following individuals were residents or visitors of the city in the time after the Battle of Yavin: Demitri Firewatcher, Bardo Klinj, Brennis Doore, Gavyn Sykes, Kritus Morven, Lergo Brazee, Vana Sage, Gregar Typho and Ogden."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}