{"url": "Kern_(Dark_Acolyte)", "categories": ["Category:Legends articles", "Category:Character stubs", "Category:Confederacy of Independent Systems individuals", "Category:Dark Acolytes", "Category:Males", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Kern  (Dark Acolyte)"}, {"tag": "p", "text": "Kern was a male Zabrak who served the Confederacy of Independent Systems as a Dark Acolyte during the Clone Wars. He wielded a red double-bladed lightsaber similar to that of Darth Maul."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Attack on Kashyyyk"}, {"tag": "p", "text": "Kern, along with his fellow Dark Acolyte Ror, lead the Attack on Kashyyyk with the help of Trandoshans during the first year of the Clone Wars. With the main objective of destroying the Jedi Outpost on the world and the capture of Jedi Master Mavra Zane and her Padawans. Following the capture of Master Zane, the two pursued the Star Runner in Star Couriers as it tried to break through the Separatist blockade. Alas, they failed in fully completing their secondary objective. They soon moved the combined Trandoshan and Confederate fleet to Felucia."}, {"tag": "h3", "text": "Duel on Felucia"}, {"tag": "p", "text": "During the Rebellion on Felucia, Marva Zane along with her Padawans were recaptured and sentenced to death at the Ancient Abyss with Kern and Ror in attendance along with the Presidente of the Commerce Guild Shu Mai. The Jedi freed themselves along with the help of Yoda and the Star Runner. Shu Mai fled leaving Kern and Ror to deal with Marva and her Padawans. Unfortunately, the two Dark Acolytes were slain in combat."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Their deaths bought time for Shu Mai to escape along with her fleet and lead an Invasion of Coruscant. The two Acolytes would not be Count Dooku's last Zabrak disciples as a year later Count Dooku would travel to the world of Dathomir and request a new apprentice to replace Asajj Ventress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kern appears in the Jedi Destiny portion of the 2012 Kinect exclusive video game Kinect Star Wars. He is also one of the lightsaber duelists. In the Credits of the game, he is listed as Darth Kern. However, given he is not referred by the Darth title in-game, along with their being already two Sith Lords in the current time period, this would have to be an error in the credits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}