{"url": "Kesh", "categories": ["Category:Legends articles", "Category:Kesh locations", "Category:Sith planets", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Kesh"}, {"tag": "p", "text": "Kesh was a remote planet located in Wild Space. It was the homeworld of the Near-Human Keshiri species and an offworld immigrant community of Human Sith known as the Lost Tribe of Sith. Kesh was a terrestrial world with a wide range of different climates and environments including mountains, plains, forests, ocean, and tundra. It had at least three continents in its southern hemisphere: Keshtah, the dominion of the Sith Tribe, Alanciar, and Eshkrene, which was at the South Pole. Kesh was isolated from the rest of the galaxy due to a strange magnetic field that limited hyperspace travel and offworld signals communications."}, {"tag": "p", "text": "The Keshiri remained isolated from the wider galaxy until two opposing groups of Jedi and Dark Jedi landed on the planet following the Hundred-Year Darkness. The conflict between these offworlders devastated much of Kesh and triggered the Great Cataclysm which separated the two continents of Keshtah and Alanciar. Eventually, the two rival Force-wielding factions made peace and exiled themselves to the southern polar continent of Eshkrene, where they became known as the Doomed, a Force-sensitive community that was dedicated to finding true neutrality in the Force. The former Dark Jedi also imprisoned their leader Sith Lord Remulus Dreypa within an oubliette, where he would remain for the next four millennia. The Great Calamity by later generations of Keshiri living on both continents as a \"Great Battle\" between the Protectors and Destructors."}, {"tag": "p", "text": "In 5000 BBY, the Keshiri living on Keshtah Minor submitted to Sith rule after stranded Sith survivors from the Sith starship Omen convinced them that they were the Skyborn, gods in Keshiri religion. These Human Sith evolved into the Sith Tribe and became the dominant state in Kesh for the next five millennia. The Omen's captain, Yaru Korsin, became the first Grand Lord of the Tribe and was responsible for establishing its basic political and social institutions, which would shape and influence Keshiri society for the next five thousand years. In 3960 BBY, Keshtah Minor descended into a millennium of chaos and anarchy following the death of the reigning Grand Lord Lillia Venn during the Night of the Upside-Down Meteor. In 3000 BBY, the Caretaker Varner Hilts managed to reunite the Tribe after discovering maps which confirmed the existence of a second continent, Keshtah Major, which was known as Alanciar to its inhabitants, the Alanciari."}, {"tag": "p", "text": "Under the leadership of Grand Lord Hilts, the Tribe annexed Alanciar in 2975 BBY, which was home to another Keshiri civilization, who called themselves the Alanciari. Using Alanciar's abundant resources and industrial base, the Sith were able to build a fleet of wooden sailing vessels which enabled them to explore and conquer the other landmasses and seas of Kesh particularly in the unexplored northern hemisphere. By 2974 BBY, the Sith discovered the southern polar continent of Eshkrene and the Doomed. That same year, the ancient Sith Lord Remulus Dreypa was also killed in an brief outbreak of violence. In 41 ABY, the Lost Tribe rediscovered interstellar travel when an ancient Sith Meditation Sphere known as Ship landed on the planet and allied itself with the Tribe. The Tribe then assembled a Sith armada and sought to expand into the galaxy. This put them into contact and conflict with both the New Jedi Order and a powerful entity known as Abeloth."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Geography and Climate"}, {"tag": "p", "text": "Kesh was a remote planet located in Wild Space. It was a terrestrial world with a wide range of different climates and environments including mountains, plains, lakes, rivers, forests, ocean, and tundra. One Galactic Standard Day was one-second shorter than a normal day on Kesh due to differences in the length of days and years on that planet. Thus by 3000 BBY, it was estimated that the Keshiri calendar according to the local Sandpipes was eight days shorter than the Galactic Standard Calendar. Interstellar travel and offworld communications in Kesh were hampered by a strong magnetic field and a lack of natural metal beneath the planet's surface. Kesh was known to orbit a star and had at least two moons. Kesh's atmosphere was known to be harmful to the Massassi, a Sith subspecies."}, {"tag": "p", "text": "Kesh was also known to have three continents in its southern hemisphere: Keshtah, Alanciar, and Eshkrene. Keshtah was separated from Alanciar by two bodies of water: a large ocean known as the Endless Sea to the west and a smaller sea known as the Sea of Flames to the east. Keshtah was also separated from Eshkrene by the Southern Ocean. As of 2975 BBY, Kesh's northern hemisphere still remained unexplored though uvak flights and boats had been sent on successful missions."}, {"tag": "h3", "text": "Keshtah"}, {"tag": "p", "text": "Keshtah was a small mountainous continent which was home to several mountain ranges including Takara Mountains—originally called the Cetajan Mountains. This mountain range was very steep and also covered a peninsula which bordered the Sea of Flames. At the tip of this peninsula lay a a Sith Temple, which had been built by the Lost Tribe of Sith over the crash site of the starship Omen, which had crashed on the mountains during the Great Hyperspace War. Due to its remote location, the Temple was accessible only by air or a hazardous climb up the slopes."}, {"tag": "p", "text": "In addition, Keshtah was also home to several settlements including its largest city and capital Tahv. Prior to 5000 BBY, Tahv was a small Keshiri village which had been built to keep the Keshiri safe from dangerous creatures. By 4975 BBY, it had become the capital of the Sith Tribe on Kesh and would remain so for several millennia. After the Lost Tribe of Sith helped the Keshiri either drive away or domesticate Kesh's native beasts, Tahv became a decorative city, focusing mainly on workings of art, often created by Sith artists using the Force. Some buildings in Tahv included the capitol building, which was built on top of a large plaza known as the Circle Eternal, the Korsinata stadium, and the zoo. The city also had a large aqueduct system."}, {"tag": "p", "text": "Other prominent natural features included the volcano Sessal Spire, the Marisota River and floodplain, and the Ragnos Lakes. Sessal Spire was located on a peninsula at the southeastern coast of Keshtah and overlooked the Sea of Flames. The Ragnos Lakes was home to several Keshiri settlements including Tetsubal until 4985 BBY when thousands of Keshiri were killed during a mass poisoning outbreak of cyanogen silicate."}, {"tag": "h3", "text": "Alanciar"}, {"tag": "p", "text": "Kesh's second known continent was Alanciar, which was also known as Keshtah Major. According to Quarra Thayn, Alanciar resembled the hind leg of a muntok, a reptilian beast of burden. It had six peninsulas on its southwestern coast which were known as the Six Claws and faced the Endless Sea, which was also known as the Western Sea. These Six Claws were known to have six forts which were used to warn the Alanciari of any invasion attempt by the Sith until 2975 BBY. The Shank was the southern region of Alanciar and was home to many canals and farms. Alanciar was home to several mountain ranges including the Eskellon Mountains. Alanciar had a plateau in the center of its northern region. Eastern Alanciar was also home to several forests and settlements. The Northern Slope also contained several industrial cities. Known settlements on Alanciar included the capital Sus'mintri and the towns of Kerebba and Uhrar."}, {"tag": "h3", "text": "Eshkrene"}, {"tag": "p", "text": "Kesh's third known continent was Eshkrene, which was located at the planet's south pole. It had an arctic climate and environment and was covered entirely in snow. However, it was known to have some forests and hills on its northern reaches. This continent was first settled by the Doomed, the descendants of stranded offworld Jedi and Dark Jedi who had instigated the Great Cataclysm following the Hundred-Year Darkness. The Doomed resided in a settlement known as the City of the Doomed which was held together solely by their will in the Force. Following the deaths of the Doomed during Dreypa's rebellion in 2974 BBY, the City of the Doomed succumbed to the elements and little trace of it remained."}, {"tag": "h2", "text": "Flora and Fauna"}, {"tag": "p", "text": "Kesh was home to many species of flora and fauna. Some notable plant species that were native to Kesh included dalsa flowers, fluorescent algae, hejarbo shoots, and vosso trees. The Marisota Floodplain was covered in grass and tussock.Keshtah did not have any native trees whose wood could be used as timber for long-distance oceanic travel. By contrast, the continent of Alanciar was home to various tree species which could be used for constructing ocean-going vessels. Even the frozen continent of Eshkrene was known to have forests. The Western Sea was also known to have reefs."}, {"tag": "p", "text": "Kesh was home to several species of animals. One of its most well known animal species was the uvak, a species of winged dragon-like reptiles, which were used as beasts of burden and were capable of traveling for long distances. Uvaks were also known for their intelligence and many developed close relationships with their owners. Uvaks were known to inhabit the continents of Keshtah and Alanciar, two of Kesh's most populous continents. Alanciar was also home to two other domesticated species: the reptilian muntoks and the strong shumshur, which were both used as beasts of burden. While Keshtah was home to many fearsome predator species, many of them had been killed off in Sith bloodsports."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "h3", "text": "The Keshiri"}, {"tag": "p", "text": "The planet Kesh was the homeworld of the Keshiri, a purple-skinned near-Human species. By 5000 BBY, the Keshiri living on the southern hemisphere continent of Keshtah Minor had developed an aristocratic elite known as the Neshtovar, who rode on uvaks, domestic winged reptiles that were also indigenous to Kesh. The Neshtovar used their uvak steeds to develop an aerial circuit system which connected Keshtah's settlements. The Neshtovar regarded themselves as the \"Sons of the Skyborn\", a race of powerful gods who were believed to have created Kesh during a \"Great Battle\" with the malevolent Otherside. Until the Sith-takeover, the Neshtovar ruled their communities as a priestly elite and persecuted dissenters like the geologist Adari Vaal who disagreed with their creation account. The Sith took over Keshtah Minor by claiming to be the Skyborn."}, {"tag": "p", "text": "Another Keshiri civilization developed on the continent of Alanciar. It was home to several large cities and had evolved into a highly militaristic civilization by 2975 BBY. The Alanciari regarded Adari Vaal as the founder of their civilization and were dedicated to resisting any invasion by the Sith from Keshtah Minor. As a result, they developed a highly complex defense system which consisted of semaphore signal stations, thoughtcriers, ballista, an air force of uvak-riders, seagoing vessels, and a large military. In 2975 BBY, the Sith annexed Alanciar with minimal resistance and gained control of its vast resources and strong industrial base. They were helped by the Alanciari man Jogan Halder, who convinced his people that the Sith did not pose a threat to them."}, {"tag": "h3", "text": "The Sith Tribe"}, {"tag": "p", "text": "By 44 ABY, Kesh was ruled by a purely Human Sith Tribe which ruled over the Keshiri. The head of state was the Grand Lord who was supported by a Circle of Lords, which consisted of seven High Lords and thirteen Sith Lords. Other known ranks, from bottom to top, included Sith Tyros, Sith apprentices, Sith Sabers, Sith Master, and the Grand Consort, the spouse of the Grand Lord. The Tribe was the most important social and political organization in Kesh and had been established by Yaru Korsin, the Founder of the Tribe. It was the most important institution for social mobility and was open to both Force-sensitive Humans and Keshiri by 3000 BBY due to the reforms of Grand Lord Varner Hilts."}, {"tag": "p", "text": "By 3960 BBY, Sith society on Keshtah Minor was divided into four main social groups: the Tribe, non-Force-sensitive Humans, disenfranchised Human slaves, and a large Keshiri serf class. Human members of the Tribe who fell out with the authorities were often condemned to generational slavery. Many of these slaves resided in the port town of Eorm where they were forced to serve as unskilled tailors, weavers, and laborers. Slavery continued even after the Hilts Restoration and at least one slave uprising was known to have occurred in 2974 BBY. It was also possible for slaves to regain their place in the Tribe if they cooperated with the authorities or did heroic acts, as in the cases of Candra Kitai and Parlan Spinner."}, {"tag": "h3", "text": "Alien Offworlders"}, {"tag": "p", "text": "Besides the Keshiri and Human Sith, Kesh was also known to have been home to several alien species. The Doomed, a small Force-sensitive community descended from stranded Jedi and Dark Jedi who had settled following the Hundred-Year Darkness, had individuals from a wide variety of species including S'kytri, Wookiees, Chagrians, Rodians, Ithorians, Twi'leks, and Weequays. They exiled themselves to the southern polar continent of Eshkrene as penance for their role in triggering the Great Calamity. The Doomed committed themselves to finding a balance between the light and dark sides of the Force and watched over the Keshiri and Sith Tribe. This community perished during Dreypa's rebellion in 2974 BBY. In addition, the Sith Tribe which came to Kesh during the Great Hyperspace War included 57 Red Sith and the Houk Gloyd. All of these had died out by 4975 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Great Calamity"}, {"tag": "p", "text": "Kesh was the homeworld of the purple-skinned near-Human Keshiri species. Two Keshiri civilizations were known to have developed on the continents of Keshtah Minor and Alanciar. Due to its remote location and strange magnetic field which inhibited hyperspace travel and offworld communications, Kesh remain isolated from the rest of the galaxy for much of galactic history. Kesh's first known encounter with offworlders occurred during the aftermath of the Hundred-Year Darkness when two rival groups of Force-users, a Dark Jedi faction led by the Sith Lord Remulus Dreypa and their Jedi pursuers, became stranded on Kesh. Dreypa had been part of a group of Dark Jedi who had been exiled to the Stygian Caldera following the Battle of Corbos. He sought to return to the galaxy and get revenge against the Jedi and the Galactic Republic."}, {"tag": "p", "text": "After they left the Stygian Caldera, they were pursued by a Jedi force which had devoted itself to protecting the Republic from the Exiles should they return. After a chase across the galaxy, the two forces crash landed on Kesh, where the Jedi and their former brethren and their legions clashed. These Force-wielders triggered the Great Calamity which traumatized the native Keshiri, who later remembered the event as a titanic battle between two rival groups of gods—the Protectors and the malevolent Destructors. The Keshiri geologist Adari Vaal later speculated that this \"Great Cataclysm\" triggered the separation of Keshtah and Alanciar. Ultimately, the Jedi and Sith grew disillusioned with their rivalries and declared a truce. The Dark Jedi imprisoned their fanatical leader Dreypa within an oubliette while the Jedi hid their last remaining hyperspace-capable starship beneath the Keshiri village of Tahv's Circle Eternal plaza."}, {"tag": "p", "text": "The former Jedi and Dark Jedi then migrated to the southern polar continent of Eshkrene where they founded a Force-sensitive community known as the Doomed. They dedicated themselves to finding a true balance within the Force and also maintained a constant vigil over the imprisoned Dreypa. They also watched over the Keshiri and the Sith Tribe. The Doomed also built a city which was held together by their Force will. Over the four millennia successive millennia, certain species within the community became extinct as their members died out."}, {"tag": "h3", "text": "Return of the \"Skyborn\""}, {"tag": "p", "text": "Following the Great Calamity, the Keshiri on Keshtah Minor developed an aristocratic elite known as the Neshtovar, an all-male body who served as the political leadership, religious priesthood, and a police force. They used their uvak steeds to develop an aerial circuit system which connected Keshtah's settlements. Under the Neshtovar, the legends of the Protectors and Destructors evolved into legends of a \"Great Battle\" between the Skyborn and the Otherside, malevolent entities which were associated with death, disease, and rebellion. The Neshtovar regarded themselves as the \"Sons of the Skyborn\", and ruled their communities with an iron grip. They also had a penchant for harassing and persecuting religious dissenters like the geologist Adari Vaal, who was taunted by her community and even publicly tried at the Circle Eternal in Tahv."}, {"tag": "p", "text": "Neshtovar rule on Keshtah came to an end in 5000 BBY with the arrival of a group of stranded Sith from the Sith Empire. These Sith came aboard the starship Omen, which had been carrying Lignan crystals during the Great Hyperspace War. The Omen crashed on a mountainside at the northern tip of the Cetajan Mountains. While the ship had a predominantly Human crew and mining contingent, the Omen's passengers included 57 Red Sith, several Massassi soldiers, and the Houk Gloyd. The Massassi quickly succumbed to an unknown pathogen in Kesh's atmosphere while the Red Sith were killed ten years later during the Red Sith Purge. Gloyd was killed during an internal power struggle among the Sith."}, {"tag": "p", "text": "With the aid of Adari Vaal who had discovered the offworlders, the Sith under the leadership of their ship Captain Yaru Korsin were able to displace the Neshtovar by claiming to be the Skyborn. Unable to travel offworld, the Sith build a temple over their wrecked starship. They later moved to Tahv where they became the new ruling elite. Though they were not technologically advanced, the survivors of the crash established a community known as the Lost Tribe of Sith, and over millennia they grew into an order of substantial number. Under the Sith, the legends of the Skyborn and Otherside were phased out in favor of the old legends about the Protectors and Destructors. In 4985 BBY, tensions between the Human and Red Sith culminated in the Red Sith Purge. In an attempt to force the Sith to leave Kesh, the Red Sith leader Ravilan Wroth poisoned the town of Tetsubal's water supply with cyanogen silicate, leading to the deaths of 18,000 Keshiri. In response, Korsin's wife Seelah Korsin framed the Red Sith for a similar outbreak of poisoning within the Ragnos Lakes, killing thousands more. This led to the extermination of the Sith species on Kesh."}, {"tag": "p", "text": "By 4975 BBY, Yaru had become the first Grand Lord of the Sith Tribe, which had become a purely Human institution due to Seelah's eugenics policies. Grand Lord Korsin then faced two different challenges to his rule. His wife Seelah had discovered that Yaru had murdered her first husband Devore Korsin and had planned to overthrow her husband and install her son Jariad Korsin as the new Grand Lord. Meanwhile, an underground Keshiri resistance under the leadership of Yaru's former ally Adari Vaal sought to overthrow and force the Sith offworld. These Keshiri resented the Sith enslavement of their species and the Sith's role in the mass poisoning at Ragnos Lake. These two uprisings coincided but were thwarted by Nida Korsin, Yaru's younger daughter. Nida's Skyborn Rangers, the Tribe's \"air force\", crushed Seelah and her rebels. She also turned Adari's son Tona Vaal into a double agent and he exposed the Keshiri resistance's planned uprising."}, {"tag": "h3", "text": "Sith Domination"}, {"tag": "p", "text": "Following the defeat of Seelah, she was exiled to the Sith Temple which was sealed off permanently. Prior to his death, Yaru also delivered a testament which designated his daughter Nida Korsin as the new Grand Lord and outlined the structure of the Sith Tribe. She ruled for 79 years and her reign was associated with relative peace and stability. Nida also outlived her son Donellan, whose memory was commemorated on Donellan's Day or the \"Day of the Dispossessed.\" Prior to the death, the heirless Nida stipulated that the Grand Lordship should be a meritocratic position. Thus, successive Grand Lords were elected from among the seven High Lords of the Circle of Lords."}, {"tag": "p", "text": "Meanwhile, Adari Vaal and three-hundred fellow rebels managed to travel across the Sea of Flames to the continent of Alanciar. There, they succeeded in warning the Alanciari about the threat of the Sith. Over the following millennia, the Alanciari evolved into a militaristic society and Vaal's legacy was preserved in a popular history book called the \"Keshtah Chronicles\", her private memoirs, and patriotic passion plays which were played every ten years on Observance Day. For millennia, there was no contact between Keshtah and Alanciar due to the long oceanic distance between the two continents. This was also reinforced by the turbulent atmospheric conditions above the Sea of Flames and the Western Sea. While the Alanciari were able to develop large sailing ships due to their abundance of lumber, Keshtah lacked the sufficient timbers and expertise to build sea-going vessels."}, {"tag": "p", "text": "In 3963 BBY, Kesh was visited by a third offworlder: the former Jedi Shadow Jelph Marrian. Marrian had been a member of the Jedi Covenant, a secret anti-Sith sect within the Jedi Order whose primary mission was to prevent a repeat of the Great Sith War. After the Covenant's existence was exposed, Marrian fled into Wild Space and stumbled on Kesh. His Aurek-class tactical strikefighter was damage during descent by a meteor storm. He disguised himself as a Human slave and agriculturalist who produced fertilizer to sell to Keshiri farmers within the Marisota Floodplain. By day, he sold fertilizer while by night he slowly repaired his damaged starship. Due to the strange magnetic field around Kesh, Marrian was unable to communicate with the wider galaxy even though his transmitter could still receive offworld signals."}, {"tag": "h3", "text": "Time of the Rot"}, {"tag": "p", "text": "In 3961 BBY, the Sith woman Lillia Venn ascended to the Grand Lordship after much debate and argument among the Circle of Lords. By then, two major Sith factions had emerged within the Tribe: the Red Faction led by High Lord Dernas and the Gold Faction led by High Lord Pallima. She was elected as a compromise candidate since she was seen as an old and frail candidate. Following Venn's ascension to the Grand Lordship, the Sith aristocrat lady Candra Kitai was appointed as the seventh High Lord. Since she was not aligned with either the Red or Gold Factions, High Lord Kitai was seen as an independent tiebreaker who could select the leader's successor. This made her the second most important person in the Tribe. Her daughter, Orielle Kitai, was a leading Sith Saber and befriended Marrian."}, {"tag": "p", "text": "In 3960 BBY, an assassination attempt was made on Grand Lord Lillia Venn during a rake-riding game on Donellan's Day. To flex her political muscles, Venn ordered the immediate executions of High Lords Dernas and Pallima. High Lord Candra was accused of instigating the assassination and was stripped of all her ranks, titles, lands, and property. As punishment, she and her daughter Orielle were reduced to the status of slaves. During that time, Orielle sought refuge with her friend Jelph Marrian. While staying at Marrian's farm, she discovered Jelph's starfighter. Seeing this as an opportunity to restore her family fortunes, Orielle informed her mother. Unknown to her daughter, Candra then informed the Grand Lord of her daughter's discovery in return for \"improved working conditions.\""}, {"tag": "p", "text": "Later, Orielle reconciled with Jelph and returned to his farm in an attempt to hide the Jedi starship. However, Lillia Venn pursued them to the farm and managed to discover the starfighter. However, she was killed during an explosion which destroyed the starship, the farm, and killed her entourage. The so-called Night of the Upside-Down Meteor created a power struggle which allowed the Red and Gold factions to seize power and kill Lillia's supporters. They then fought among themselves and broke up into twenty rival factions. For 960 years, Keshtah Minor remained deadlocked in a civil war known as the Time of the Rot. This conflict devastated much of the continent and caused its cities and infrastructure to fall into ruins. In 3000 BBY, the discovery of the Tribe's slave roots triggered a series of violent riots known as the Great Crisis which ended with many of Keshtah's cities being razed to the ground."}, {"tag": "h3", "text": "The Hilts Restoration"}, {"tag": "p", "text": "In 3000 BBY, the historian and Caretaker Varner Hilts ascended to the office of Grand Lord and ushered in a new era known as the Hilts Restoration. He managed to united the Tribe after he discovered a map at the Kesh Sith Temple which confirmed the existence of another continent: Alanciar, also known as \"Keshtah Major\". He managed to convince the various Sith factions to commit their resources and energy to reaching Keshtah Major. Hilts appointed Edell Vrai, a member of the Golden Destiny and a mathematician, as his chief engineer and promoted him to the office of High Lord. Hilts also married Iliana Hilts, the former leader of the Sisters of Seelah, and she became his military commander. She produced a daughter named Takara Hilts."}, {"tag": "p", "text": "Besides rebuilding Keshtah Minor's cities and infrastructure, Hilts allowed Force-sensitive Keshiri to join the Tribe as Sith Tyros and Sabers. He also wrote a new testament to replace the outdated Testament of Yaru Korsin. However, Hilts' most important legacy was the conquest of Alanciar. For twenty-five years, High Lord Vrai experimented with uvak reconnaissance flights and building sea-going ships. However, Alanciar proved to far for uvak flights and Keshtah's hejarbo and vosso woods were unsuitable for ship-building. In 2975 BBY, Vrai developed succeeded in developing airships which were powered by hydrogen gasbags. These airships were also propelled by uvaks. That year, High Lord Edell led a reconnaissance mission across the Western Sea to Alanciar."}, {"tag": "p", "text": "However, his airships were shot down by the Alanciari ballista defense and uvak-riders. Despite this setback, Vrai and several survivors managed to regroup and capture two Alanciari prisoners: Quarra Thayn, the chief military administrator of Uhrar, and her secret lover Jogan Halder, a signals officer at Point Defiance. The Sith survivors also managed to capture an Alanciari fishing trawler, the Mischance, which they used to sail back to Keshtah by the Southern Passage and the Sea of Flames. These Sith brought back Halder, who became the Tribe's \"Ambassador\" to the Alanciari and the first Alanciari to visit Keshtah Minor. Meanwhile, Edell managed to recruit Quarra as a guide for a ground reconnaissance mission of Alanciar."}, {"tag": "p", "text": "Despite the loss of Vrai's airships and the Tribe's poor intelligence on the Alanciari military capabilities, the High Lord Korsin Bentado managed to obtain permission to lead a large invasion force of airships known as the Ebon Fleet. Despite receiving intelligence on the military capabilities of the Alanciari, Grand Lord Hilts did not call back the Ebon Fleet since he wanted to eliminate a political rival and to give the Alanciari a fight they could win. The Alanciari repelled Bentado's invasion at the Western Shield and destroyed the Ebon Fleet. However, Bentado and several of his followers survived and regrouped. These succeeded in infiltrating the Alanciari capital of Sus'mintri where they captured Vaal Hall and slew the War Cabinet, effectively decapitating Alanciar's centralized military government."}, {"tag": "p", "text": "Bentado then attempted to seize power from Grand Lord Hilts by downing his airship Good Omen. He also planned to create a \"Second Tribe\" on Alanciar but was thwarted and killed by Edell Vrai, Quarra Thayn, and his own Keshiri aide Squab, who was secretly loyal to Hilts. Hilts and his \"ambassador\" Jogan Halder them arrived and managed to convince the Alanciari population that the Sith did not pose a threat to them but were actually the Protectors. Halder claimed that Hilts' people had purged the Destructors from among their ranks one day after Vaal had fled to Alanciar. This mean that it had not been necessary for the Alanciari to militarize their society. Hilts also pretended to be the \"Kesh-born minion\" of the Bright Tuash, an avian Keshiri deity, and claimed that Adari Vaal had been his servant but had been misguided about the presence of the Destructors among the Sith Tribe."}, {"tag": "p", "text": "Hilts claimed that the Tribe was mostly benign. He also depicted Korsin and the Ebon Fleet as \"servants\" of the Destructors who had recently risen among the ranks of the Tribe but had been expelled. He also assured them that Edell Vrai and his airships had been sent to pursue the \"Destructors\" and had no intentions of conquering Alanciar. Due to Halder and Hilts' diplomacy, the Alanciari submitted to Sith rule. Halder's message was transmitted by semaphore signals across the continent. Due to his services to the Sith, he became an esteemed friend of the Tribe and served as a traveling hermit who repeated his story to large crowds. Edell Vrai became the new governor of Alanciar and oversaw the disarmament of Alanciari society. The Alanciari ballista were gradually destroyed and Alanciar's industry and military were pressed into the Tribe's service."}, {"tag": "h3", "text": "Dreypa's uprising"}, {"tag": "p", "text": "Following the \"unification\" of Keshtah and Alanciar, the Tribe gained access to a wealthy and developed continent that was rich in lumber. Grand Lord Hilts used this lumber to build a large fleet of exploratory vessels for exploring the other continents and seas of Kesh. He also theorized that the Sith Tribe had not been the first offworlders to discover Kesh based on the Keshiri legends of the Protectors and Destructors, and the fact that the Keshiri had easily welcomed the Tribe. To test this theory, Hilts sent an Alanciari ship, the Southern Star, led by the Alanciari captain Chegg to explore Eshkrene, the planet's south pole. This crew included Parlan Spinner, a Sith outcast who had attempted to assassinate Hilts, and Hilts' own daughter Takara Hilts."}, {"tag": "p", "text": "Hilts' theory proved correct and the Tribe encountered the Doomed, who had maintained a constant vigil for the past millennia. While they had planned to intervene during the Time of the Rot, they decided not to after Hilts came to power and succeeded in restoring peace and stability to Keshtah. Seeking to settle scores with the Tribe, Spinner stole the Doomed's \"Great Weapon\" and freed Remulus Dreypa from his oubliette. He and the Keshiri crew managed to escape their Doomed captors and sailed to the Keshtah port of Eorm. There, Dreypa instigated a slave revolt with the intention of marching on Tahv and returning to the stars. Spinner and Dreypa also brought Takara and the Doomed's leader Kaliska along as captives. However, the pair managed to escape with Eorm's entire herd of uvaks and returned to Eshkrene, where they rallied the Doomed for an assault on Dreypa."}, {"tag": "p", "text": "Dreypa's army marched on Tahv but suffered heavy casualties during the Battle of the Marisota Floodplain at the hands of the Tribe's military forces, which were led by Grand Consort Iliana Hilts. Dreypa and Spinner then retreated to the volcano Sessal Spire where Dreypa unleashed several hibernating Leviathans, reptilian Sithspawn capable of draining the life energies of sentient beings, on both his Sith pursuers and former allies. The Doomed attacked Dreypa and his Leviathans but were no match for his mastery of the dark side. In the end, Spinner and Takara joined forces to rescue the latter's mother Iliana and they managed to escape the battlefield with Kaliska. Kaliska also revealed the existence of a Jedi starship that was hidden within Tahv's burial cairns. She urged them to destroy the starship in order to deny Dreypa a chance of returning to the galaxy."}, {"tag": "p", "text": "Spinner managed to return to Tahv with Iliana but Kaliska was killed and Takara was captured by Lord Dreypa, who intended to use her as a bargaining chip with the Tribe. Spinner managed to find the Jedi starship but instead of destroying it, he took it on a joyride above Kesh. However, he returned after Dreypa threatened the life of Takara, whom he had developed a crush for. Spinner returned to Tahv where he destroyed Dreypa's leviathans and rescued Takara. In the end, Dreypa was killed when the Jedi Starship crashed into Sessal Spire. However, Spinner and Takara managed to bail out into the Southern Ocean. Following the defeat of Dreypa, Tahv was rebuilt and Spinner was admitted into the Tribe as a Grand Lord's Hand, making him a personal enforcer of the Grand Lord. As a result, the Lost Tribe of Sith was able to consolidate its influence over the rest of Kesh."}, {"tag": "h3", "text": "The Legacy period"}, {"tag": "p", "text": "In 41.5 ABY, Kesh's galactic isolation came to an end when a Sith Meditation Sphere known as Ship arrived on Kesh. Ship made contact with the Sith Tyro Vestara Khai and offered to instruct her in the ways of the dark side of the Force. Later, Vestara revealed Ship's existence to the Circle of Lords, telling them that they also shared their thoughts. The Lords then decided that they would use Ship to learn more about the Sith, and to travel offworld. Vestara was then made a Sith apprentice to Lady Rhea and was designated to be trained by Ship. Ship also revealed to the Lost Tribe that the Sith did not rule the galaxy and were actually very few in number. This revelation completely shattered the Lost Tribe's long-held belief that the Sith had ruled the galaxy for thousands of years."}, {"tag": "p", "text": "The tribe spent the next two years capturing ships and creating a Sith armada. As the Sith built up their armada, a spaceport was constructed in open land just outside of Tahv. Within two years, the fleet contained several dozen ships, including the rebuilt Omen. After sensing the presence of exiled Jedi Grand Master Luke Skywalker through the force, a strike team was put together to hunt down and kill Skywalker. It was also at this time that Ship left Kesh. In response, the Circle of Lords decided to track down and recapture Ship and put aside their plans to hunt Skywalker. This brought the Lost Tribe into contact with both the Force entity known as Abeloth and the Jedi Master Skywalker and his son Ben Skywalker. Eventually, the Lost Tribe formed an alliance with the Skywalkers to stop Abeloth, who was responsible for causing a Force psychosis that was plaguing Jedi in the Galactic Alliance, one of the successor states to the former Galactic Republic which came to an end following the Clone Wars."}, {"tag": "p", "text": "In 44 ABY, this temporary alliance came to an end when Abeloth approached the Sith Saber Gavar Khai with an offer to form an alliance with the Lost Tribe in return for killing Skywalker and his allies. While the Circle of Lords were divided over this issue, Grand Lord Darish Vol decided to side with Abeloth since he thought that she would benefit the Tribe's interests. Vol then contacted Gavar Khai, who was returning with his fleet, Abeloth, and Ship to Kesh, and told him to delay Abeloth's arrival on the planet. The Grand Lord had planned to prepare a celebration in Tahv for Abeloth, since she was regarded as a valuable asset in defeating the Lost Tribe's enemies. While Abeloth distrusted Vol's motives, she accepted his offer and told Khai to instruct everyone in his fleet to return to Kesh with their friends and family members."}, {"tag": "p", "text": "When Abeloth arrived in the Sith capital of Tahv, she was officially welcomed by a parade organized by the Sith authorities. The Grand Lord also closely observed Abeloth to understand her motives. Following the festivities, Abeloth visited Vol in his dreams. However, the Grand Lord was able to lure Abeloth into a mental trap which he used to attack the entity. However, Abeloth sent a Force shock-wave equivalent to that of a tsunami that destroyed much of Tahv, killing millions of its citizens including Sith and Keshiri. Khai's wife Lahka Khai perished during this attack. Following the Destruction of Tahv, Ship departed with Abeloth and several Sith who were still loyal to the Force entity. These included Gavar Khai, who was still grieving over the loss of his wife, and his forces who had been influenced by Abeloth. Grand Lord Vol was able to escape as well in his personal shuttle. Abeloth then \"absorbed\" the populist Senator Rokari Kem, and assumed her identity. Led by the new Chief of State \"Kem\", the Lost Tribe then infiltrated the Galactic Alliance Senate and took over the galactic capital of Coruscant. However, the Lost Tribe and Abeloth were defeated by the New Jedi Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Kesh features prominently in John Jackson Miller's Lost Tribe of the Sith eBook series, which ran from May 28, 2009 to July 24, 2012. These nine e-novellas were later collected and published as a collected volume known as Star Wars: Lost Tribe of the Sith: The Collected Stories. Kesh was first named in Christie Golden's Fate of the Jedi: Omen, the second novel in the nine-part Fate of the Jedi series, which was first released on June 23, 2009. The planet also appeared in Golden's Fate of the Jedi: Ascension, the eight novel in the Fate of the Jedi series, which debuted on August 9, 2011. The planet also features prominently in Miller's stand-alone comic series Star Wars: Lost Tribe of the Sith—Spiral, which ran from August 8 to December 12, 2012. For the comic series, Kesh was drawn by Andrea Mutti, inked by Pierluigi Baldassini, and colored by Michael Atiyeh."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}