{"url": "Kesh_Sith_Temple", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles with conjectural titles", "Category:Kesh locations", "Category:Sith temples", "Category:Unidentified locations"], "nodes": [{"tag": "h1", "text": "Kesh Sith Temple"}, {"tag": "p", "text": "This Sith Temple was the Temple of the Lost Tribe of Sith on the planet Kesh. It was a multi-level complex that was situated on the summit of a mountain in the Takara Mountains. The Sith Temple also had several observation towers and several staircases. The Sith Temple also had a large quadrangle courtyard which was lined by a colonnade and flanked by several buildings including the watchtower, guardhouse, royal palace, and the temple dome. In addition, the temple had statues of several Sith on its balcony. The Temple was first built in 5000 BBY by a group of stranded Human Sith whom later became known as the Lost Tribe of Sith. After the survivors of the crash made contact with the planet's native sentient species, the Keshiri, they convinced them that they were their gods, the Skyborn, who had returned to them. The Keshiri then helped the Sith to build a Temple over the crash-site of the Omen, the Sith starship which had brought the Tribe to Kesh."}, {"tag": "p", "text": "In 4985 BBY, the Sith Temple became the site of the Red Sith Purge, where all of the Red Sith were purged from the Tribe. In 4975 BBY, the Sith Temple became a battleground which pitted the Grand Lord Yaru Korsin against his estranged wife Seelah Korsin and her son Jariad Korsin. In addition, members of the Keshiri resistance also stole the temple's uvak, reptilian beasts of burden, during a failed anti-Sith uprising. These two rebellions were crushed by Korsin's daughter Nida Korsin, who succeeded him as Grand Lord following his death. One of her first as Grand Lord was to seal the Temple and to move the Tribe to Tahv, the main settlement on the continent of Keshtah Minor."}, {"tag": "p", "text": "In 3000 BBY, the Sith mathematician and engineer Edell Vrai attempted to destroy the Omen by collapsing the temple's main spire on its protective chamber. However, he was stopped by the Caretaker Varner Hilts who had discovered a secret map room in the temple which confirmed the existence of a second continent on Kesh known as Alanciar. Hilts was able to use this discovery to reunite the Tribe and end the Time of the Rot, a millennium of chaos. Later, the Sith Temple was the site of the wedding of the new Grand Lord Hilts and his Grand Consort Iliana Merko. In 41 ABY, Ship, a Sith Meditation Sphere, landed in the courtyard. The Tribe's Circle of Lords quickly went to their meeting place in the city of Tahv to discuss the importance of Ship."}, {"tag": "h2", "text": "Design and layout"}, {"tag": "p", "text": "The Kesh Sith Temple was situated on top of a mountain at the northern tip of the Takara Mountains, which straddled a long peninsula that ran parallel to the mainland of Keshtah Minor. Its lower terrace was home to the temple's service personnel and the uvak stables. A series of steps led to the middle terrace which housed a training academy, dormitories, storehouses, wardroom and a medcenter. A second series of stairs led to an outdoor colonnade where the Tribe's founder and first Grand Lord Yaru Korsin had held his public court. The Temple also had a large quadrangle plaza which was formed by the royal residence to the west, a giant watchtower watchtower and guardhouse to the east, and the Temple's dome to the north. Part of the upper plaza was also built on top of a large chamber which held the Omen, the ancient Sith dreadnaught which had brought the Tribe's ancestors to Kesh."}, {"tag": "p", "text": "A narrow path, which had been carved through the mountain, led to the mountainside temple. In 4975 BBY, the second Grand Lord Nida Korsin barricaded the mountain pass with The Blocks, a series of massive granite barriers, to prevent anyone from accessing the temple. Each of these cubes were ten meters tall and gave the impression of a staircase for the gods, which was intended to highlight the Tribe's purportedly divine origins. By 3000 BBY, these blocks had become overgrown with strong vines. Due to its remote location, uvak, winged reptilian beasts of burden native to Kesh, were regular forms of transportation that were used to access the temple. The temple also bordered a cliff which was the site of several deaths including those of Devore Korsin in 5000 BBY; several Red Sith during the Red Sith Purge; and Jariad Korsin following a failed coup against his father Yaru."}, {"tag": "p", "text": "The mountainside temple also had a cupola which offered a clear view of the main quadrangle. Behind this cupola lay an anteroom which led to a planetarium, whose walls were studded with Lignan crystals to depict a map of Kesh's stars during the summer season. This planetarium was a smaller rotunda which contained the Grand Lord's throne, his former command chair from the Omen, and a brazier which was used for lighting up the planetarium. This planetarium was intended to misled any visitors into the Temple into thinking that Yaru Korsin had always aspired to return to the stars. The chamber containing the Omen was leveled ground which had been shored up with stonework. An open passage at the twenty-third step on the middle terrace's staircase led to the main temple building."}, {"tag": "p", "text": "A sealed door was located adjacent to the seventh step of the middle terrace which led to another chamber which had been built into the base of the Omen's support structure. This chamber was a map room which contained a stone-carved map of Keshtah Minor and six stone panels which depicted the Endless Sea and the continent of Alanciar. Until 3000 BBY, these six panels were covered by large blank slates. These maps were studded with Lignan crystals that were used to depict cities on Alanciar. The map room's walls were also inscribed with a message by Yaru Korsin to his daughter Nida detailing his secret: Alanciar. These writings were in the Tapani language and had been etched onto the wall with a diamond stylus."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The Kesh Sith Temple was built shortly after the native Keshiri on the continent of Keshtah Minor accepted the Lost Tribe of Sith as their gods, the Skyborn. The temple first originated as a series of structures in 5000 BBY which were erected to stabilize the Sith dreadnaught Omen, which had crash-landed on a mountain slope. To add stability, the ground around it was shored up with stonework. A path was also hewed out of large chunks of strata by a combined force of Sith miners, who used their lightsabers, and several Keshiri helpers. Under the leadership of the Omen's captain Yaru Korsin, this site became the abode of the predominantly Human Sith offworlders which also included fifty-seven Red Sith and one Houk. While the Sith had intended to return to the stars, a lack of metal minerals and spare-parts had prevented them from attaining this goal."}, {"tag": "p", "text": "By 4985 BBY, the Sith Temple housed several hundred Sith and their Keshiri servants, many of whom had come from the Neshtovar, the former priestly elite which had ruled Keshtah until the Tribe's arrival. To cater for this community, several buildings were erected within the temple complex including the royal residence, watch tower, guardhouse, the Temple's dome, a medcenter, a wardroom, and a creche. These facilities ringed a massive quadrangle courtyard. The mountainside temple also had at least one improvised refresher station at the royal residence which was frequented by Seelah Korsin, the wife of the ship captain Yaru Korsin. This shower unit was connected to a marble slot that was situated high on the wall of the royal residence which channeled warm water downwards. This water was transported by Keshiri uvak-fliers in massive kegs and was regularly heated by Keshiri attendants to cleanse it of mildew and other pollutants."}, {"tag": "h3", "text": "Adobe of the Sith"}, {"tag": "p", "text": "While the Sith offworlders lived in luxury and had their every needs tended to by their loyal Keshiri servants, tensions eventually developed between the Human and Red Sith. The Human Sith were descended from Tapani space travelers from House Nidantha who had traveled into the Stygian Caldera and had been enslaved by the Sith Empire. Due to their experiences as slaves, many of the Human Sith particularly Seelah bore ill will towards the Red Sith. Seelah used her position in the creche to secretly murder all of the Red Sith newborns. By 4985 BBY, the failure of his people to reproduce had led the Red Sith leader Ravilan Wroth to lobby for the Tribe to return to the stars. He also secretly poisoned the Keshiri city of Tetsubal with cyanogen silicate, in an attempt to scare the Tribe's leadership into supporting his plans. However, his plot backfired when Seelah discovered his plans and used her own stocks of cyanogen silicate to poison several other Keshiri cities in the Ragnos Lakes region, leading to the deaths of thousands."}, {"tag": "p", "text": "Seelah succeeded in framing the entire Red Sith community for these crimes, which resulted in the Red Sith Purge. During the fighting, the heads of the deceased Red Sith were staked onto the colonnade in the main courtyard. The remaining Red Sith were thrown down a cliff on the edge of the Sith Temple. The only surviving non-Human was the Houk Gloyd, who was a close friend of Yaru Korsin. Ravilan and Seelah's actions sowed the seeds for the emergence of an underground Keshiri resistance movement that was dedicated to overthrowing and expelling the Tribe from Keshtah. This resistance movement was led by Adari Vaal, a geologist who had made first contact with the Tribe and had developed a friendship with Yaru Korsin. She turned against her former benefactors after her eldest son Finn Vaal was killed during a construction accident and Korsin was unable to revive him, confirming her suspicions that they were not gods. Prior to her first meeting with the Sith offworlders, she also witnessed Yaru murder his half-brother Devore Korsin, who was the first husband of Seelah Korsin. Seelah later learnt that Yaru was behind her first husband's death and vowed to avenge him. She also groomed her eldest son Jariad Korsin as his successor to lead the Tribe."}, {"tag": "p", "text": "In 4975 BBY, the self-appointed Grand Lord Yaru Korsin announced that the Tribe would relocate from the Sith Temple to Tahv, the main settlement on Keshtah. By this stage, the Lost Tribe had given up any hope of returning to the stars due to Kesh's remote location and the lack of spare-parts to repair the Omen. As part of the Tribe's relocation to Tahv, a skeleton team of Sith and Keshiri wrapped up affairs on the mountain. Unknown to the rest of his people, Korsin had managed to retrieve data from one of the Omen's cameras which depicted a gigantic sea and an unknown continent dubbed \"Keshtah Major\". Korsin and his Keshiri servants managed to replicate this data onto a large wall map which was kept inside a secret map room at the base of the Omen's support structure. Yaru only revealed this information to his younger daughter Nida Korsin, whom he trusted with keeping this secret to provide a cause to reunite the Tribe in the event of a disaster."}, {"tag": "p", "text": "That same year, Seelah and Jariad launched their coup against Grand Lord Korsin. This coincided with Adari Vaal's planned uprising against the Tribe, which involved the Keshiri rebels stealing the Tribe's uvak. However, the two rebel factions were defeated by Korsin's daughter Nida Korsin. First, Nida sabotaged the Keshiri rebels' plans with the help of Adari's younger son Tona Vaal by safeguarding Kesh's uvak herd. The defeated Keshiri rebels then fled into exile and the survivors led by Adari eventually landed on Alanciar. Secondly, Nida and her Skyborn Rangers attacked Seelah and Jariad's rebels, killing Jariad. Seelah was also crippled during the fighting when her legs were crushed by falling debris caused by Yaru's ally Gloyd detonating his proton torpedo during a final stand against Seelah's aides. As punishment for her rebellion, Seelah was permanently exiled to the Temple till her death."}, {"tag": "h3", "text": "Isolation"}, {"tag": "p", "text": "Following Yaru's final testament, Grand Lord Nida Korsin ordered that all Sith remove themselves from the mountainside temple to honor the memory of the Tribe's founder. While she lived, no Sith or Keshiri were permitted to return to the temple. Under her orders, several massive barriers known as the Blocks were used to block the narrow pass leading to the temple. Until Seelah's death, regular uvak flights delivered food to the crippled Seelah, who died within her old sick ward. For the next two millennia, the Kesh Sith Temple was designated as a forbidden place within the Tribe. The former Sith Temple was protected from intruders by regular aerial sentries of uvak-riders. Over the successive centuries, the descendants of the Tribe forgot how the Omen work and any study of the ancient Sith starship was limited to scholars who no longer had access to the vessel. Nida's ban was upheld by successive generations of Grand Lords including Lillia Venn, who ascended to the Grand Lordship in 3961 BBY. While the Keshiri had helped built the temple in the first place, they were forbidden to enter it because it their presence was seen as sacrilegious."}, {"tag": "p", "text": "In 3960 BBY, the assassination of Grand Lord Venn during the Night of the Upside-Down Meteor triggered a millennium of chaos and anarchy known as the Time of the Rot. This was remembered by later generations as a \"dark age\" in Keshtah's history and saw Kesh's cities fall into ruins. By 3000 BBY, the Lost Tribe of the Sith had splintered into twenty factions including the Golden Destiny, which argued that the Tribe needed to stop fighting, reopen the Sith Temple, and return to the stars. They were opposed by the Korsinite League, who argued that the Tribe should adhere to the political structure outlined in Korsin's testament. Due to Seelah's efforts to distort the Tribe's history and a loss of knowledge due to the passage of time, many of the Sith came to believe that their ancestors were descended from a race of powerful people and gods who were destined to reign over the native Keshiri. These popular myths were shattered by revelations during that year's Pantheon's Peace that the Tribe's ancestors had actually been slaves to the Sith Lord Naga Sadow."}, {"tag": "p", "text": "These revelations about the Tribe's \"inglorious past\" triggered the Great Crisis, which led to the deaths of many Sith and the razing of Keshtah's cities. After recalling that Korsin's testament had mentioned that the \"true power was behind the throne\" and that the Tribe should remember that in the event of a disaster, the Tribe's Caretaker and historian Varner Hilts and his Keshiri aide Jaye Vuhld decided to unseal the temple and explore the Omen to find this secret, which they hoped would be able to save the Tribe from its self-inflicted spiral of destruction. After several days of traveling through the difficult Takara Mountains, Hilts and Jaye finally reached the mountainside temple. They also had to climb over a series of granite barriers which had been placed there under the orders of Nida Korsin. Meanwhile, Iliana Merko fled on an uvak to the temple from the other Sith factions. Several Sith leaders including Korsin Bentado, Neera, and Edell Vrai followed her there intent of settling scores against the faction leader for the numerous injuries and disfigurements she had inflicted on them."}, {"tag": "h3", "text": "Restoration"}, {"tag": "p", "text": "The Kesh Sith Temple would help reinvigorate the Lost Tribe of Sith after a millennium of chaos and infighting. Upon arriving inside the temple complex, Varner Hilts and Jaye Vuhld encountered Iliana Merko, who had just discovered the remains of her fallen idol Seelah Korsin, and convinced her to join their quest to find Yaru Korsin's \"secrets behind the throne.\" They then entered the chamber containing the Omen but found that Korsin's command chair, the Grand Lord's throne, had been removed from the vessel's bridge. However, Hilts and Jaye found that the ship's chrono still worked: the technology which had been the prototype for the Tribe's Sandpipes, a device used for keeping time. Hilts' party also noted the presence of several newcomers including Korsin Bentado, Edell Vrai and Neeera. Believing that the Tribe was truly doomed, these other Sith wanted to destroy the Omen in order to purge the last remaining relic of the Tribe's \"inglorious\" history. While these Sith had been bitter rivals prior to the Great Crisis, they were still willing to work together on something they could agree upon."}, {"tag": "p", "text": "Due to his expertise in mathematics and engineering, Edell was made the chief project officer of this demolition project which included thirty Sith warriors from various factions and several uvak, winged reptilian beasts of burden. The Sith participants came from various factions including the Golden Destiny, the Korsinite League, Force 57 and the Sisters of Seelah. For this demolition project, Edell planned to topple the temple's giant watchtower onto the chamber containing the Omen, crushing the ship. Edell got the Sith warriors to loop long leather cables around the supports of the watchtower. Several teams of Sith on the ground and uvaks in the air then worked simultaneously to lower the building. While the chamber below was well constructed, Hilts noted that the resulting impact would cause the chamber to crack like an \"uvak egg\" under a hammer. While the resulting impact of the tower may not have blown up the ship, it would have buried it completely."}, {"tag": "p", "text": "Meanwhile, Jaye managed to find a latch which led into the temple's planetarium. This chamber contained Korsin's command chair and a brazier. However, they quickly discovered that the dome only depicted Kesh's stars in the summer sky. These stars were Lignan crystals which had been etched into the ceiling. However, Hilts found an ancient Tapani cant within the upholstery of the seat, which turned out to be a letter from Yaru Korsin's mother Takara Korsin to her son. The elder Korsin predicted that their descendants would one day rule a \"great people\" free from the Red Sith. She also prophesied that if Yaru guided his people well, they would always have a mission. However, Hilts realized that this was not Yaru's secret since he had mentioned that the \"true power was behind the throne\" and not inside the throne. Based on their knowledge of the Tribe's history, Hilts' party reasoned that Korsin could not have made his final recording within the temple's planetarium since he would have been unable to climb the stairs with a gaping chest wound which led to his death."}, {"tag": "p", "text": "Jaye then recalled that there had been a chamber beneath the Omen's support structure. He reasoned that the starship had landed on a slope and also recalled that they had earlier passed a sealed door on the seventh step of the middle terrace. Jaye's theory was ultimately vindicated and Hilts' party discovered a map room. Most of the room was covered by black slates. While searching for glowrods, Jaye was murdered by Korsin Bentado but not before alerting the other Sith to the presence of Hilts' party and the room. While the Sith were intent on killing Iliana, Hilts managed to defuse the situation by using the Force to yank the black slates off the walls; revealing a large map which confirmed the existence of a second continent on Kesh known as \"Keshtah Major\", or Alanciar to the native Alanciari. After reading Takara's letter and a message on the wall from Yaru to his daughter Nida, Hilts succeeded in convincing the other faction leaders to end their conflict and to work towards this new goal of reaching and conquering Keshtah Major."}, {"tag": "p", "text": "The other Sith quickly submitted to Varner Hilts and elected him as their new Grand Lord. Hilts then asked Iliana Merko to be his wife in order to forge a marriage alliance and to protect her from Bentado and his companions, who were still vengeful towards her. Edell and the other Sith also abandoned their plan to destroy the Omen and traveled throughout the mainland to spread news of Hilts' ascendancy to the Grand Lordship and the discovery of Keshtah Major. Varner Hilts and Iliana Merko also married at the Temple's colonnade. The wedding was also attended by large numbers of both Sith and Keshiri who welcomed Hilts' ascendancy as an end to the Time of the Rot. To honor Jaye's contribution to saving the Tribe, Hilts planned to allow Keshiri to join the Tribe itself, which had previously been a purely Human institution."}, {"tag": "h3", "text": "Return to the Stars"}, {"tag": "p", "text": "The Kesh Sith Temple was also the site of the Tribe's emergence and return to the wider galaxy. By 41 ABY, the Sith Temple had become an important center for Sith training. The Sith apprentice Vestara Khai commenced her training as a Sith at the temple under the tutelage of Sith Lady Olaris Rhea. That same year, Ship, a Sith Meditation Sphere, landed in the courtyard of the Sith Temple. The Tribe's Circle of Lords quickly went to their meeting place in the capital Tahv to discuss the importance of Ship, whom they regarded as a discover of \"Kesh-shaking\" importance. The Sith Tribe then decided to use Ship in the rebuilding of a brand new Sith armada to serve the Tribe in an invasion of the galaxy."}, {"tag": "p", "text": "Ship carried a Sith party, which included Vestara Khai, that ambushed a Damorian s18 light freighter and salvaged its parts for repairs. They also ambushed a freighter, slaughtered the crew, and brought the vessel's parts back to Kesh. The Tribe continued its attacks on various vessels, leaving none of their victims alive, until the Omen was successfully repaired, at which point they turned their efforts toward the capture of intact ships. The Sith also built a spaceport for their fleet at Tahv, and by 43.5 ABY, the armada numbered greater than two dozen vessels. After sensing the presence of exiled Jedi Grand Master Luke Skywalker through the force, a strike team was put together to hunt down and kill Skywalker. It was also at this time that Ship left Kesh. In response, the Circle of Lords decided to track down and recapture Ship and put aside their plans to hunt Skywalker."}, {"tag": "p", "text": "This brought the Lost Tribe into contact with both the Force entity known as Abeloth and the Jedi Master Skywalker and his son Ben Skywalker. Eventually, the Lost Tribe formed an alliance with the Skywalkers to stop Abeloth, who was responsible for causing a Force psychosis that was plaguing Jedi in the Galactic Alliance, one of the successor states to the former Galactic Republic which came to an end following the Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}