{"url": "Keshiri", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Enslaved species", "Category:Human and Near-Human species", "Category:Keshiri", "Category:Wild Space species"], "nodes": [{"tag": "h1", "text": "Keshiri"}, {"tag": "p", "text": "The Keshiri were a near-Human sentient species native to the planet Kesh. Powerfully built, they had purple skin and black, red, or violet eyes. They were typically found to be very attractive by Human standard, although the two species were different enough to be biologically incapable of reproduction. The Keshiri had long traditions of crafting and the arts, with glassblowing being a particular specialty and pantomime a favorite art form. They were a very religious species, worshiping gods known as the Skyborn, whom they believed had formed all of the land on Kesh, from which the Keshiri were born. They acknowledged the Skyborn as the Protectors who kept another group, the Destructors, at bay. After a group of Jedi crash-landed on Kesh and fought a ruinous Great Battle against a band of Dark Jedi and Sith, the events took on the status of legend, remembered as the Great Cataclysm."}, {"tag": "p", "text": "In 5000 BBY, a group of Sith crashed onto the continent of Keshtah in their starship, the Omen, after being knocked off-course during a hyperspace jump. The Keshiri there believed the newcomers to be the Skyborn and gave themselves over to lives of service to the Sith. The Keshiri religion and government of Keshtah were led by the Neshtovar, who believed in the importance of tradition and religion above science and technological progress. Nevertheless, one Keshiri, a female named Adari Vaal, realized the dangers the Sith presented and led a resistance movement. She was eventually forced to flee Keshtah for Alanciar, a larger continent with its own Keshiri population. There, she became revered as the Herald for warning the Alanciari to prepare for an inevitable invasion by the Sith. The people heeded her warnings and rebuilt their civilization along martial lines. When the invasion finally occurred millennia later, the Sith High Lord Varner Hilts duped the Alanciari into joining their Keshtah kin in service to the Sith. Nevertheless, he had a newfound respect for the Keshiri species and thought them potentially worthy to join the Sith Tribe."}, {"tag": "p", "text": "The Keshiri eventually found that the Sith were not their gods, but they continued serving them for thousands of years. By 41 ABY, the Keshiri had come to be seen almost as equals to the Sith, and several were accepted into the Sith Tribe, with at least one serving on the Circle of Lords, the Tribe's ruling council. Around the time of the Second Galactic Civil War, members of the Keshiri species were able to travel off-world for the first time in the newly formed Sith armada. Several Keshiri served as leaders in the fleet, such as High Lord Sarasu Taalon. However, the Tribe's attempted invasion of the galaxy resulted in the elimination of numerous Sith, including many Keshiri, on the planet Coruscant by the Jedi."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Keshiri were a species of sentient near-Humans from the remote Wild Space world of Kesh. Although some specimens were rather portly, Keshiri typically were powerfully built, with a humanoid body of two arms, two legs, a torso, and a head. Each hand sported five fingers capped by nails. Their skin was typically a shade of purple—whether pale, burgundy, or mauve—although it could fluctuate from darker to lighter hues and even into tones of blue as their emotions shifted."}, {"tag": "p", "text": "The Keshiri face was characterized by two eyes, a central nose, and a mouth. The eyes were proportionally large and came in the colors red, violet, and black. Eyebrows grew above each eye, and the eyelids featured lashes. Their hair, waxy in some, ranged in color from brown through violet to silver and white. Regardless of its original color, the hair whitened with age and thinned or receded in some male members of the species. The mouth, lined by lips of a shade darker than the rest of the skin, contained a dark-purple tongue and rows of white dentition; some Keshiri exhibited noticeable gaps between teeth. Their throat was sometimes subject to buildups of fluid that required clearing. Separate populations of Keshiri exhibited slight phenotypic differences. For instance, the Keshiri of the continent Keshtah had lower foreheads, narrower faces, and smaller and more narrowly set eyes in comparison to the Keshiri of the Alanciar landmass."}, {"tag": "p", "text": "The Keshiri had two sexes, male and female. Physical characteristics distinguished the two sexes, such as facial hair on men. Because they were extremely similar to Humans in their appearance, they were found by members of the Human species to be particularly attractive. As such, they often intermarried with the Human population on Kesh, despite the fact that the two species were fundamentally different enough on a biological level to preclude reproduction. Keshiri were still considered young at age fifteen, and their lifespan exceeded sixty years. Keshiri required sleep each night, a period during which they sometimes experienced vivid dreams. They had the capacity to use the Force; indeed, many Force-sensitive Keshiri hailed from the continent Alanciar."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Before contact with outsiders from beyond Kesh, the Keshiri had a simple society, which included small settlements of circular homes with tall, conical, thatched roofs. These early Keshiri dressed in simple tunics, trousers, and fur-lined boots. They carried personal effects in pouches attached to belts."}, {"tag": "p", "text": "Keshiri life was centered around their religion. They worshiped a group of gods called the Skyborn, also known as the Protectors, a sandy-blooded race who were believed to have lived in the stars. According to Keshiri legend, the Skyborn's enemies were the Otherside—beings of fire, rebellion, sickness, and death, about whom very little was known other than that they had \"come from below.\" The Keshiri believed that the Skyborn, riding gigantic crystal uvak—membranous-winged reptilian creatures native to Kesh—fought with the Otherside among the stars in what the Keshiri religious leaders called the Great Battle. According to the legend, the battle lasted for eons, until the Otherside were finally defeated. The Skyborn, however, had been injured, and their blood fell into the oceans, forming the land that gave birth to the Keshiri. As such, it was commonly believed that the land of Kesh was a part of the Skyborn and that the Skyborn had the power to control such phenomena as groundquakes, volcanic eruptions, and storms."}, {"tag": "p", "text": "Another important point of Keshiri religion was the Destructors, a mysterious group who were said to return to the galaxy every few eons to destroy all civilization, returning all beings to their primitive origins. The Destructors' enemies, the Skyborn, were said to be destined to defend Kesh from the Destructors. According to Keshiri legend, the Skyborn had already defended Kesh from the Destructors in the distant past, a conflict that resulted in a Great Calamity that altered the very geography of the world. Research conducted in the time leading up to 41 ABY seemed to indicate that a catastrophe much like that which the Destructors were believed to cause had indeed occurred on Kesh at least once previously. Another Keshiri divinity was the Bright Tuash, a creature with avian characteristics. In addition to their religious nature, the Keshiri were a scientific people; they had determined that their world was round well before the first outsiders arrived from beyond its atmosphere. They ventilated their structures with passages through the roof, creating de facto crawlspaces through which a Keshiri could move about."}, {"tag": "p", "text": "Keshiri kissed when sexually attracted to one another. They mated for life, and practiced marriage, although extramarital affairs were not unknown. They raised their children until adulthood. They found Humans strange for their wide variety of skin tones, but they did not find the species unattractive."}, {"tag": "h3", "text": "Keshtah"}, {"tag": "p", "text": "Keshiri civilization developed independently on at least two of Kesh's landmasses, Keshtah and Alanciar. On the former, the leaders of Keshiri government and religion were a group of males known as the Neshtovar, the self-proclaimed \"Sons of the Skyborn.\" They were known for breeding and riding uvak, which they kept in liveries. Traditionally, when a member of the Neshtovar died, the rest of his family was killed by the Keshiri community; however, this practice was discontinued by 5000 BBY. The Neshtovar were expected to be experts at riding uvak—to fall off one of the creatures was equivalent to being \"claimed by the Otherside.\" The Neshtovar governed the Keshiri from the Circle Eternal, a plaza located in their capital city of Tahv, where its position above the Keshiri Burial Cairns made it their holiest shrine."}, {"tag": "p", "text": "Although they had very little tolerance for beings who went against their religion, the Keshiri of Keshtah were typically a peaceful civilization. More interested in tradition and religion than learning, they were less developed technologically than much of the outside galaxy and did not even have a number high enough to count their entire population. However, they created a complex aqueduct system for Tahv. Rather isolated from the rest of the galaxy, the Keshiri made their first contact with other beings in 5000 BBY, when a group of Sith crash-landed on the planet in their starship, the Omen. After witnessing the newcomers' powers, Keshtah's Keshiri came to believe that the newcomers were their Protectors, the Skyborn, and committed themselves to lives of servitude to the Sith. In this capacity, some Keshiri took to performing menial tasks for their Sith masters, such as carrying them about on palanquins. Other Keshiri became constables, patrolling the streets of cities such as Tahv wearing red body armor and armed with glass-bladed swords and halberds."}, {"tag": "p", "text": "After the Sith arrival, the Neshtovar of Keshtah were replaced by the Tribe's ruling council, the Circle of Lords, as the governing body of Kesh. The Sith instituted several other changes to the Keshiri way of life on the continent, and even more than a thousand years after their arrival, the Keshiri lived as servants to the Sith. They were forbidden to ride the uvaks that were native to the world, and the Sith Saber Orielle Kitai did not approve of a Keshiri calling her by her first name. They instituted a new annual holiday that commemorated the arrival and founding of their new civilization with the Sith with a parade, which featured costumed jesters. During the tenure of the Sith, the Keshiri became respected for their exceptional glassmaking and sculpting skills. They and the Sith decorated Tahv with myriad ornate sculptures and buildings. The Keshiri embraced all forms of art and were familiar with the palimpsest concept—in which one artwork was created on top of another. They had a lively tradition of pantomime, with troupes performing for Sith patrons."}, {"tag": "p", "text": "Keshiri clothing on the continent included simple, sleeveless tunics, wrist bands, and trousers for men; long dresses were for women. Males kept their hair relatively short, often binding a tuft into a short ponytail. Meanwhile, females kept their hair longer. Some men grew and sculpted their facial hair into mustaches, goatees, and other formations. They carried belongings in simple satchels and pouches that hung from their bodies."}, {"tag": "h3", "text": "Alanciar"}, {"tag": "p", "text": "In contrast, life for the Keshiri of Alanciar—also known as the Alanciari—was vastly different. They traced their civilization back to the arrival of the Rock of Kesh, Adari Vaal, on uvak circa 4975 BBY. Upon her insistence, they militarized society, with every aspect of life geared toward detecting and repelling an invasion by the Sith—whom they considered the Destructors of legend. The Keshtah Chronicles, a book recorded by Vaal, detailed the culture, war strategies, and dark-side Force use of the enemy; the book was required reading for children on Alanciar. Years after her death, a tapestry of Vaal adorned a wall of Vaal Hall, the capital building."}, {"tag": "p", "text": "The Alanciari practiced conscription, whereby Keshiri were called into military service as need demanded. Members of Alanciar's military had the opportunity to progress through ranks, such as supply clerk, materials supervisor, wardmaster, chief military administrator, and mayor. The Training Directorate taught crafts, such as glassblowing, to veterans, a practice that allowed even these older Keshiri to contribute to the defense of Alanciar. Meanwhile, an air force of uvak riders defended the skies. Although Alanciari knowledge of the Force was imperfect, their Force-sensitive citizens served as thoughtcriers, tasked with sending important messages and warnings through the Force. The Induction Board was a body that endeavored to identify such Force-sensitives to train them. Alanciari wore clothing conducive to their militarized lifestyle. For instance, front-line soldiers wore hard, leather armor. Meanwhile, a female officer might wear a waistcoat and keep her hair in a tight bun. Raised insignia signified the wearer's rank, and soldiers stayed in barracks when serving on active duty. Nevertheless, when under attack, the entire population participated in the war effort; for instance, civilians boiled water to run steam-driven sirens that warned of war."}, {"tag": "p", "text": "The Alanciari sculpted their landmass to maximize their ability to defend it, cutting terraces into hillsides and planting forests alongside raised-stone roadways to allow hidden watchers to see anyone traveling by, and separating highways from woodlands with deep trenches. Way stations dotted the road network, where guards could see far down the roads in all directions. Only a few mountain passes escaped such surveillance. Inland canals permitted riverine traffic of small boats and barges pulled by teams of muntoks, six-limbed creatures used for transport and carrying loads."}, {"tag": "p", "text": "The Alanciari considered their home continent to resemble the leg of the muntok. The bulk of the population inhabited the uplands of the muntok's \"hip\" to the east, where most of their industrial centers were located, such as factories that produced glass projectiles. Keshiri workers fabricated battle armor in factories along the continent's northern slopes. Next came the Shank, which rose to mountainous isthmuses known as the Six Claws in the west. Due to that region's proximity to Keshtah, it had a reputation as highly regimented, as the Alanciari military kept the area heavily fortified and sequestered. Each of the Six Claws sported a signal station, where Keshiri members of the Signal Corps kept watch for invaders and sent messages in semaphore via bright, colorful lights generated by grids of fireglobes. Teams of uvak-riders who were equipped with diamond-flak ballista were used to patrol the skies above Alanciar. Meanwhile, a coast guard known as the Shore Guard, whom were equipped with armed sailing ships, added an extra layer of security by patrolling far out to sea. Alanciari guards used whistles to stop strangers. Their land was divided into districts, with the capital at Sus'mintri, a city that also served as a headquarters for their War Cabinet and housed Vaal's personal library, repurposed as a top-secret archives."}, {"tag": "p", "text": "The Alanciari had a tradition of seafaring using large, wooden sailing vessels with tall, triangular sails. The harvester fleet of fishers was permitted to roam the Western Sea in ships and rowboats gathering crustaceans; there, they relied on detailed maps and immense kedges made of stone to keep from being swept away in the fast currents. In the chilly waters south of the continent, sailors wore heavy vests, fur-lined gloves, and boots. Alanciari sailors often sported earrings."}, {"tag": "p", "text": "Alanciari construction was done in materials such as wood, alabaster, brick, and concrete, sometimes coated with paint. Their architecture featured courtyards, balconies, and stairs. They installed warning sirens in virtually every settlement; the sirens worked by funneling steam through enormous pipes made of glass. They used wood, leather, duffel, and glass to construct tools and goods. Some implements included hay carts, coatracks, desks, folders, personal bags, books, earshells for the deaf, pots, and spoons. Stew was an Alanciari dish. They also drank alcoholic beverages. The Alanciari developed weapons not found on Keshtah. One of these was the hand-ballista, a handheld device that allowed a ballisteer to fire projectiles such as glass rods—which shattered into splinters upon impact—and fragmenting bolts made of silver. When well trained, ballisteers fired in tandem following signals given via signal towers. A repeating version of the hand-ballista was issued to all front-line Alanciari soldiers. Other weapons, used by uvak-borne riders, fired diamonds."}, {"tag": "p", "text": "For much of their history, the Alanciar Keshiri were a patriotic civilization, singing songs that honored their nation. Especially important was Observance Day, a masquerade during which certain Keshiri painted their faces pale in a manner found frightening and dressed as Sith. As these costumers roamed the streets, other Keshiri danced around them and mocked them. The holiday festivities culminated in a theatrical recreation of Adari Vaal's first visit to Alanciar on uvak-back and her warnings about the Sith to the west. Observance Day was celebrated once per decade, a timeframe that honored the length of Vaal's resistance movement against the Sith."}, {"tag": "h3", "text": "Keshiri united"}, {"tag": "p", "text": "After the Keshtah and Alanciar Keshiri came into regular contact in 2975 BBY, the Alanciari nominally accepted the Sith as the Protectors and, thus, their gods. Nevertheless, their enmity toward the Sith did not disappear immediately; rather, some Alanciari refused to see the Sith as anything but equals. The Sith began a program of importing the most useful aspects of Alanciari technology to Keshtah, such as the construction of sailing ships; the Keshiri spinners and weavers of the town of Eorm were forced to construct vast quantities of sailcloth as the Sith embarked on further maritime explorations of their planet."}, {"tag": "p", "text": "Over time, the Keshiri more broadly came to realize that the Sith were not their gods. Nevertheless, many aspects of the Keshiri religion were not lost, as, even thousands of years after their initial meeting, the Tribe of Sith that formed from the survivors of the crash believed in the race of Destructors, and also believed that they were the Protectors destined to save the galaxy. Over time the social status differential between the Sith and the Keshiri narrowed significantly, although the Keshiri were still considered to be inferior to the Humans. By 37 ABY, however, several Force-sensitive Keshiri were training with the Sith, and a way for them to gain admission to the Tribe took place in a festival known as Presentation."}, {"tag": "p", "text": "The Keshiri spoke the same language as the Sith who landed on their world. For the Alanciari, this was because Adari Vaal thought it imperative that the Alanciari be able to understand the speech of their enemies, the better to identify them. Over time, distinctive Keshtah and Alanciar accents developed, although the two versions of the language remained mutually intelligible. Keshiri were able to learn to read and write, using implements such as chalk to do so. The semaphore used by the Alanciari was a sophisticated communication system that required four people: the spotters, the signalers, and the transcriptionist. Non-verbal communication included winking at someone to indicate a joke or a lie, chuckling to indicate amusement, a sign for exasperation, and smiling to indicate contentment. Shaking hands was a Keshiri greeting."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins and Skyborn"}, {"tag": "p", "text": "The Keshiri evolved on the planet Kesh thousands of years before the Battle of Yavin. By 6900 BBY, the Keshiri had developed sentience and lived in settlements of thatched dwellings. In the galaxy beyond Kesh that year, the Jedi routed a contingent of Dark Jedi in the Battle of Corbos. One group of Dark Jedi fled to Korriban, where they helped found the Sith Order. Meanwhile, a group of Jedi tracked the dark siders to the Stygian Caldera, where a chase ensued. Both the Jedi and dark sider vessels crash landed on Kesh, where they found the planet's magnetic field prevented them from communicating with the outside galaxy."}, {"tag": "p", "text": "The two sides warred with one another, wreaking untold havoc to the Keshiri and their world. However, both the faction of Jedi and the faction of Dark Jedi and Sith realized they would destroy the planet and themselves, so they agreed to a détente. The two sides hid away their weapons: the light-siders buried their last operational starship, the Last Hope, under the Keshiri's Circle Eternal, and the dark siders imprisoned the unrepentant Sith Lord Remulus Dreypa in an oubliette. The former enemies retreated to the arctic lands of Kesh's south pole, Eshkrene, where they formed a single society neutral to the light and dark sides of the Force, and where they atoned for their actions as guardians against the extinction of the Keshiri species. Coming to see their Force-sensitivity as a curse, they called themselves the Doomed. The world-shattering events did not escape the Keshiri's notice; for millennia to come, their legends spoke of a Great Calamity brought about by a conflict between god-like entities known as the Protectors and the Destructors."}, {"tag": "p", "text": "By 5,000 BBY, the Keshiri had built several towns and cities on the Keshtah continent, although they remained technologically inferior to much of the galaxy. That year, as much of the galaxy was immersed in the Great Hyperspace War between the Galactic Republic and the ancient Sith Empire, a Keshiri geologist, Adari Vaal, found evidence that the land on Kesh had been created by volcanoes rather than the Skyborn, as was commonly believed. Vaal, the wife of the deceased Neshtovar member Zhari Vaal, was branded a heretic for her teachings, especially by High Councilor of the Neshtovar, Izri Dazh, and forced to flee from Tahv. Meanwhile, the Omen, a Sith warship under the command of Captain Yaru Korsin and tasked with delivering a shipment of Lignan crystals to the Sith's Dark Lord Naga Sadow, was ambushed and knocked off-course while attempting to flee into hyperspace, causing it to crash-land on Kesh."}, {"tag": "p", "text": "The survivors of the accident first made contact with Vaal, who had fled to the Takara Mountains, where the Omen had crashed. At the request of the Sith, Vaal lured the Neshtovar to the crash-site of the Omen, where they were shocked by the appearance of the newcomers. After witnessing the Sith's great powers, Dazh and the Neshtovar decided that the newcomers were actually their gods, the Skyborn, and that they had come down from the stars to visit their home. As such, the Keshiri of Keshtah willingly decided to submit themselves to lives of service to the Sith. They helped the newcomers to build a new Temple at the crash site of the Omen and assisted in the further construction and expansion of Tahv. Despite the fact that the Keshiri held no simple mathematical concepts at the time of the Omen's crash, they soon learned the skill from the Sith and excelled in it."}, {"tag": "h3", "text": "Service and resistance"}, {"tag": "p", "text": "Fifteen years after the arrival of the Sith on the planet, the Sith Tribe began to accept that they might remain permanently stranded on Kesh. Around this time, however, Ravilan, one of the few members of the Sith species among the Omen survivors, discovered the deadly effects of cyanogen silicate. He used the silicate to poison and kill the Keshiri who lived in the city of Tetsubal, hoping to convince the Sith that it was a sign from the dark side of the Force that they should leave the world. Korsin's wife, Seelah, discovered his ploy and turned it against him, using the silicate to poison many of the other Keshiri villages—leaving hundreds of thousands of Keshiri dead—and blaming it on Ravilan and the other \"Fifty-seven\" surviving members of the Sith species. This initiated a purge of the \"Red Sith,\" as the race was known, causing the deaths of all of the members of the Sith species on Kesh. This move was met with secret joy by Vaal and several other members of the Keshiri, who wished to remove the Sith from their world."}, {"tag": "p", "text": "Ten years later, Vaal's resistance movement prepared to strike at the Sith in an attempt to weaken their hold of power over Kesh, but their plans were discovered by Yaru Korsin's daughter, Nida, and foiled. Vaal and her surviving followers were forced to flee out over the oceans and into exile. Their flight lived on in tales told by the Keshiri—although the servants told it with the moral that it was not their own decision to choose their destiny. Under Nida Korsin's reign, the position of Caretaker of Sith lore was created, and several Keshiri clerks served the Caretaker."}, {"tag": "h3", "text": "The Herald arrives"}, {"tag": "p", "text": "Vaal did not perish in exile as the Tribe assumed. In 4975 BBY, she arrived on a new continent, called Alanciar, which had its own Keshiri population. There she warned the people of the Sith lying across the sea. She noted the superior natural resources of Alanciar and urged the Keshiri there to prepare for an invasion from the west. She taught them the Sith's language to allow them to know their enemy. Although not Force-sensitive herself, Vaal told the Alanciari of the Force and explained what she had seen the Sith do with it. As a result, the Alanciari thoughtcrier tradition emerged, its members largely self-taught by what Vaal had revealed. Vaal recorded her memories of the Sith in book form. One volume came to be called the Keshtah Chronicles, a tome full of warnings about the Sith. Another was a memoir about her relationship to Yaru Korsin; in it, she described her strange attraction to the Human but ultimately dismissed him as an animal. The Alanciari kept the volumes hidden in a library hidden within Vaal Hall. Also stashed within the library was a lightsaber that Vaal had stolen from a Sith on Keshtah. Vaal entered the annals of Alanciari lore as the Rock of Kesh, the Herald, Savior and Lost Daughter. She became associated with the avian deity Bright Tuash. The decennial anniversary of Vaal's arrival became the holiday, Observance Day."}, {"tag": "p", "text": "The Keshiri of Alanciar heeded Vaal's warnings and began a program to militarize their society. They established a standing army and initiated a military draft. Their existing network of signal stations were retooled as an early-warning system in case of invasion. They formed a War Cabinet to govern the Alanciari, at first meeting in the interior plateau then moving to Vaal Hall in the capital, Sus'mintri, after its construction. Even their homeland itself became a weapon of war as the Alanciari cut terraces into the landscape, built a highly defensible road network, and placed fortresses in the west and industry in the east, farther from the enemy."}, {"tag": "h3", "text": "Invasion"}, {"tag": "p", "text": "More than a millennium after the Sith's arrival on Kesh, the Keshiri of Keshtah remained indentured, and they were forbidden even to fly uvaks. By this time, several Keshiri served as bartenders in local taverns, and they often developed more open relationships with the Human slaves of the Sith than with the Sith themselves. Some Sith lived on large estates where they were assisted by several Keshiri slaves—the Sith Saber Orielle Kitai and her mother, High Lord Candra Kitai, lived on one such estate just outside Tahv. After the Kitais were framed for an assassination attempt against the Tribe's Grand Lord, Orielle came to believe that the Keshiri who had fled into exile were among the greatest Keshiri who ever lived for defying those who had attempted to decide their destiny. Later, during the Testament Day holiday in 3000 BBY, it was rediscovered by the Tribe that the Human Sith had once answered to Naga Sadow, who was not Human. Although the revelation was kept hidden from the Keshiri, it led to riots amongst the Human Sith, as they realized that they were not necessarily the dominant species in the galaxy."}, {"tag": "p", "text": "Caretaker Varner Hilts, with the help of his Keshiri aide, Jaye Vuhld, discovered ancient messages from Yaru Korsin and his mother, Takara, in the ruins of the Sith Temple that revealed that the Human Sith were not destined to be slaves. Hilts also found a map of Kesh formed from data gathered during the Omen's crash that revealed that their continent, Keshtah, was actually Keshtah Minor, as a much larger continent existed halfway around the world. Although many Keshiri had grown distrustful of the Sith because of their unexplained rioting, Hilts, as Grand Lord, ushered in a new age, the Hilts Restoration, in which the Sith and Keshiri worked to travel to the newly-discovered continent. One role played by the Keshiri was to send their pantomime troupes about the continent to restore civil order—along with news that the Tribe's destiny lay across the sea in new lands."}, {"tag": "p", "text": "Hilts and his underlings investigated the possibilities of invading the new continent and conquering any people who lived there. Faced with a lack of resources to build adequate oceangoing vessels and with the limits of an uvak's endurance to fly long distances, the Human High Lord Edell Vrai developed airships held aloft by gas bags full of hydrogen and pulled by a team of uvaks. Keshiri artisans constructed an invasion force—the Ebon Fleet. In 2975 BBY, the fleet had reached more than sixty vessels. Vrai commanded three exploration airships with the goal to confirm the existence of the new continent, reconnoiter the area, and potentially make contact with the natives through Keshiri missionaries."}, {"tag": "p", "text": "The Keshiri native to the target continent, who called themselves the Alanciari and their homeland Alanciar, detected Vrai's force from a base at Garrow's Neck and a tower at Point Defiance. They attacked with hand-ballistae and warned the rest of the continent via the Force and semaphore. The defenders punctured the airships' gas bags and ignited the hydrogen within; thus downed, most of the crews were killed. Vrai survived with a few crewmembers; they captured a Keshiri woman and man—the Alanciari wardnaster Quarra Thayn and Signal Corps member Jogan Halder. The Sith overwhelmed the crew of the Mischance, a Keshiri sailing vessel, and captured it before sailing it to a small cove. There, Vrai used Thayn's obvious attachment to the injured Halder to convince her to guide him inland on foot to continue his mission. Nevertheless, he lied to her: rather than keeping the man safe, Vrai had his crew sail with Halder back to Keshtah. Over the next day and a half, Thayn sneaked Vrai past the alerted patrols by claiming that Vrai was a Keshiri disguised as a Sith for the Observance Day masquerade. Thayn brought Vrai to Kerebba, where he witnessed Observance Day firsthand; her plan to show the Sith how united her people were against his bore fruit in that the Sith began to question his people's prospects for a successful conquest."}, {"tag": "p", "text": "Nonetheless, before he could call off the invasion, his rival, the Sith Korsin Bentado, arrived with the Ebon Fleet, having decided to seize the glory of conquest for himself rather than await Vrai's return to Keshtah. With no knowledge of the Alanciari's defenses or the hydrogen-based crafts' weaknesses, Bentado's fleet fell quickly to the alerted Alanciari. The surviving Sith forces gathered on the ground and fought their way to Sus'mintri over the next three and a half days. There they sneaked into Vaal Hall and overwhelmed its defenses, killing the Alanciari leadership. With control of the semaphore system's central hub, they ordered Alanciari forces to bring Sith prisoners to Vaal Hall—a ruse to gather reinforcements. Meanwhile, Bentado plotted to set himself up as an independent warlord on Alanciar, a base from which he could send a counter-invasion to conquer the One Tribe. Quarra Thayn responded to the sham message with the intent of turning Edell Vrai over to the authorities. However, in the capital, the two uncovered Bentado's ruse. Vrai attempted to convince his rival to remain loyal to Hilts, but Bentado's forces attacked and the pair escaped to Adari Vaal's secret library. Bentado sent out an all-clear signal from the semaphore station to call off the Alanciari defenses and thus allow his own forces to wipe out any arriving Sith airships, which would be under command of Varner Hilts. Bentado's servant, a Keshiri named Squab, reacted to the betrayal of Hilts, to whom he remained loyal, and killed his master."}, {"tag": "h3", "text": "Reunited"}, {"tag": "p", "text": "Hilts landed peacefully on Alanciar in the ship Good Omen, greeted by the Alanciari army. Along with the newly arrived Sith—who styled himself the ally of a deity called the Bright Tuash—was Jogan Halder. The Alanciari man had been sent to the continent to witness a carefully orchestrated demonstration of Sith benevolence while the Sith studied his copy of the Keshtah Chronicles for clues to the mentality of the Alanciari. Repatriated, Halder extolled the wonders of Keshtah and the happiness of its people, who were free from the constant vigilance and fear required in the martial society of Alanciar. He claimed that the evil Sith against whom Adari Vaal had warned had been destroyed long ago—save Bentado and his crew. Indeed, Vrai had been an agent of the good SIth, sent to warn the Alanciari of Bentado's invasion. As word spread of the friendly arrivals, the Alanciari accepted Halder's tale and welcomed him as their new Herald—and Hilts as the man who would unite them with their kin on Keshtah. Vrai became the de facto governor of the continent. He embarked on a program of bringing Keshtah up to the same technological standards as Alanciar and set his sights on further exploration of the planet. He also disarmed the Alanciari Keshiri as a sign of friendship to their new Sith \"allies.\" Thayn, after abandoning her fruitless attempts to convince the Alanciari that the Sith were duping them, remained close to Vrai, serving as a confidant so as to ensure that the integration of Alanciari and Sith cultures was done equitably—and to learn the Sith's secrets. Meanwhile, Hilts considered bringing the Keshiri into the Lost Tribe as equals rather than slaves now that the Sith knew that the Keshiri species had Force-users among it."}, {"tag": "p", "text": "Over the next year, Hilts embarked on a project to make use of the raw materials and technologies developed by the Alanciari for the Sith of Keshtah. Key among his desires was the use of Alanciari sailing vessels and crews to explore the rest of the planet. Over the next year, the Sith built a fleet of sailing ships and staffed them largely with Alanciari sailors. Hilts suspected another force of offworlders might have encountered the Keshiri before his Tribe arrived. Accordingly, circa 2974 BBY, he sent a ship, commanded by the Keshiri Captain Chegg, on a mission to survey the planet's south pole. Among the crew were the Humans Parlan Spinner and Takara Hilts, a criminal and Varner Hilts's daughter, respectively. After making landfall, the Humans attempted to mutiny and sail the ship to Alanciar, which had become fabled as a land of opportunity in the minds of Keshtah's Human population. In the chaos, a disparate group of the polar region's inhabitants killed Chegg and his men and captured the Humans."}, {"tag": "p", "text": "At their settlement, the group's spokesperson, a S'kytri named Kaliska, revealed that her group were the Doomed, the descendants of Jedi, Dark Jedi, and Sith who had crash landed on Kesh millennia ago, and that they still considered themselves the guardians of the Keshiri and the keepers of a dark side weapon hidden at the time of the Great Calamity. Spinner escaped Doomed custody and located the weapon: an oubliette containing the Human Sith Lord Remulus Dreypa, whose imprisonment thousands of years before had allowed the catastrophic war to end. With Spinner's aid, the Sith Lord escaped his imprisonment and fled to Keshtah by sailboat. Using dark side power, he enthralled the Sith's slaves at the clothworker town of Eorm to revolt as he attempted a full conquest of the continent."}, {"tag": "p", "text": "As the Sith leadership at Tahv rallied their Human and Keshiri subjects to prepare to defend the capital, Takara Hilts and the Doomed followed Dreypa on uvaks—Doomed knowledge of wind currents allowed them to travel much farther on the beasts than the Sith could—and confronted Dreypa at a volcano called the Sessal Spire. There they faced not just Dreypa but the resuscitated Leviathan larvae he had long ago hidden there. During the battle, Hilts convinced Spinner to break his alliance to the rampaging Sith Lord. When Kaliska revealed that the Doomed's ancient starship, the Last Hope, lay under the Keshiri's burial cairns, Spinner took an uvak to Tahv, stole into the holy site, and activated the vessel. To the Keshiri who witnessed it, the starship was a metallic monster with a person in its eye, headed for the stars. Meanwhile, Keshiri and Humans alike defended Tahv against Dreypa's Leviathans until Spinner returned to defeat the creatures—and their master—using the ship's advanced technologies."}, {"tag": "h3", "text": "Into the galaxy"}, {"tag": "p", "text": "The Keshiri lived alongside the Sith for thousands of years, and over time they realized that the Sith were not truly their gods. Still, several Keshiri remained as servants or slaves of the Sith, and the race as a whole was generally seen as inferior to the Humans. By the time of the Second Galactic Civil War, however, the social status differential had narrowed somewhat between the two societies. Although interbreeding was impossible, many of the Human Sith took Keshiri as lovers, considering them to be very attractive. The two cultures intermingled and several Keshiri eventually rose to positions of power within the Tribe; by 37 ABY, several Keshiri had been allowed into the Sith Tribe, and by 41 ABY, at least one Keshiri was serving on the Circle of Lords, the ruling council of the Tribe and governing body of the planet. In that year, Ship, a Sith Meditation Sphere, arrived on Kesh to help train the Tribe's apprentices and form a Sith armada. Ship helped the Tribe capture starships, and after five thousand years of being stranded on the planet, the Sith and Keshiri finally had the means to travel offworld. The Sith began to plan out an invasion of the galaxy."}, {"tag": "p", "text": "Two years later, several Keshiri Sith were chosen to be on the select Sith strike team sent to kill Jedi Grand Master Luke Skywalker. Shortly thereafter, Sarasu Taalon, a Keshiri High Lord on the Circle of Lords, led a fleet of eleven ChaseMaster frigates to the planet Dathomir, where the Keshiri Sith Lord Viun Gaalan led a group of shuttles to the surface to retrieve Vestara Khai—the sole survivor of the Sith strike team—along with a group of Nightsisters whom Khai helped to capture. In orbit over Dathomir, Taalon confronted Skywalker with his fleet of ChaseMasters, proposing and forming a false alliance with the Jedi Master to eliminate Abeloth, a powerful dark side being residing in the Maw. Several Keshiri in the fleet then took part in the ensuing mission. The Sith intended to betray the Jedi and force Abeloth to serve them, but they failed, and Skywalker defeated Abeloth. However, they soon discovered that the entity had not died. When Taalon later immersed himself in a dark side nexus known as the Pool of Knowledge, he began to slowly turn into the same kind of being as Abeloth. Taalon was later killed by Khai, in order to prevent him from becoming another Abeloth. Meanwhile, the rest of the Sith fleet prepared to strike at the galaxy."}, {"tag": "p", "text": "In 44 ABY, several Keshiri participated in Operation Shieldfall, a mission to the planet Nam Chorios, to where Vestara Khai and the Skywalkers had tracked Abeloth. The Keshiri Sith Saber Tola Annax led the assault planetside against the Jedi and Abeloth while other Keshiri took part in the battle in orbit against the Jedi. However, the Sith were forced to retreat. Later, several Keshiri defected from the Tribe to join Abeloth after she destroyed the city of Tahv. Other Keshiri loyal to the Sith assisted the Tribe in infiltrating the galactic capital planet Coruscant, but the Sith there were soon thereafter eliminated by the Jedi, ending the Tribe's war efforts. Abeloth was finally destroyed when her last three bodily manifestations were each simultaneously killed. The Jedi came to believe that Abeloth had been the Destructor of Keshiri religion, and they learned that she had been the last surviving member of the Ones, a family of extremely powerful Force-users. In the past, she had been kept in check by the family's Daughter and Son, but they had been killed during the Clone Wars."}, {"tag": "h2", "text": "Keshiri in the galaxy"}, {"tag": "p", "text": "The Keshiri were technologically inferior to much of the galaxy, and thus never left Kesh of their own accord. Also, as Kesh was a remote planet, the species remained undiscovered by the outside galaxy until the arrival of the Sith in 5000 BBY. Because the Sith's starship was damaged in the crash, however, the Keshiri remained stranded on Kesh until Ship, a Sith Meditation Sphere, arrived in 41 ABY and began to help the Sith form an armada. Members of the Keshiri species were finally able to travel offworld aboard starships in the armada, and a few Keshiri Sith, such as Baad Walusari and Ahri Raas, later traveled into the Maw aboard the warship Eternal Crusader as a part of the Sith strike team sent to track Ship and kill Skywalker. However, none of the Keshiri on the strike team survived the mission."}, {"tag": "p", "text": "Soon thereafter, the Keshiri High Lord Sarasu Taalon led a fleet of ships to Dathomir, where Sith Lord Gaalan took a convoy to the planet surface to retrieve the sole survivor of the strike team from Dathomir. During the mission, Gaalan led the capture of several Nightsisters and also survived a duel with Luke Skywalker himself. Shortly after, Taalon convinced Skywalker to join the Sith in an attempt to defeat the mysterious dark side being Abeloth, although the Sith actually intended to force Abeloth to serve them. During the ensuing mission, a Keshiri member of the fleet, Captain Leeha Faal, was killed while beyond shadows, and the Sith failed in their endeavor, as Skywalker killed one of Abeloth's bodies. Taalon then elected to stay on Abeloth's homeworld with the Skywalkers, Khai, and Khai's father, Gavar, to discover more about Abeloth. After discovering that Abeloth had not died, Taalon swam in the Pool of Knowledge, resulting into his slow transformation into a member of the Ones. The Sith then followed the Skywalkers, who tracked Abeloth to Pydyr. There, Vestara Khai called in reinforcements under the command of Keshiri Sith Master Jestat Vhool. However, Taalon was killed by Vestara Khai to prevent him from becoming another being like Abeloth."}, {"tag": "p", "text": "Sith Saber Tola Annax led Operation Shieldfall's planetside division against the Jedi and served as second-in-command to Gavar Khai, first in the Sith armada, and then in Abeloth's fleet. Meanwhile, several Keshiri who remained loyal to the Tribe penetrated Coruscant; however, due to their distinctively colored features, they had to remain hidden. They thus were given the task of exploring the Jedi Temple, which had recently been deserted at the orders of Luke Skywalker. When Abeloth took control of the Sith forces on Coruscant, she employed the female Keshiri High Lord Korelei as a torturer on former Triumvir Wynn Dorvan. Abeloth later consumed Korelei; Abeloth in Korelei's form was killed by Vestara Khai and Ben Skywalker on Abeloth's planet. Meanwhile, the Sith forces that had infiltrated Coruscant, including such Keshiri as Jestat Vhool, were eliminated by the Jedi and Galactic Alliance forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Keshiri first appeared briefly in John Jackson Miller's Lost Tribe of the Sith: Precipice, the first eBook in the Lost Tribe of the Sith series, which was published in May 2009 as a tie-in to the Fate of the Jedi novel series from Del Rey. The species has since been featured in each of Miller's successive Lost Tribe of the Sith eBooks, including Skyborn, Paragon, Savior, Purgatory, and Sentinel, as well as the final installment, Pandemonium, published in July 2012 to cap off the series' paperback compilation. The species was first identified as the Keshiri in the second novel of the Fate of the Jedi series, Fate of the Jedi: Omen, written by Christie Golden and published in May 2010. Members of the Keshiri have since appeared in each successive Fate of the Jedi novel, including Fate of the Jedi: Abyss, Fate of the Jedi: Backlash, Fate of the Jedi: Allies, Fate of the Jedi: Vortex, Fate of the Jedi: Conviction, Fate of the Jedi: Ascension, and Fate of the Jedi: Apocalypse. Miller included the Keshiri in each issue of the comic book series Star Wars: Lost Tribe of the Sith—Spiral from Dark Horse Comics. Artist Andrea Mutti offered the first visual depiction of the species in the comic's inaugural issue, published in August 2012."}, {"tag": "p", "text": "Miller has been the author to most fully explore the Keshiri, their culture, and their society; he has noted that he enjoys writing stories from the alien point of view since such stories present the temptation to overemphasize the aliens' differences from Humans rather than to make them sympathetic to readers. Miller decided to make the Keshiri a stone-age society for the first short story to detail their culture, Skyborn, wherein he was able to weave bits of the species' mythology. The story tells of the Keshiri meeting the crash-landed offworlders who would later become the Lost Tribe of the Sith, a dramatic hook that Jackson modeled after various first-encounter narratives in literature and history. For instance, he wanted to make the situation analogous to the arrival of the Mayflower Pilgrims in North America, neither friendly nor hostile to the area's inhabitants, yet desperate for help from them. Thus, the Keshiri woman Adari Vaal serves as his central character to bring the two sides together. Later stories in the Lost Tribe of the Sith series allowed Miller to flesh out Keshiri culture, especially after they entered servitude to the Sith. For instance, the stories show that the Keshiri bear their Sith masters about on palanquins due to a lack of terrestrial beasts of burden, and their access to high-quality lenses is due to their skilled glassblowers."}, {"tag": "p", "text": "While writing the earlier stories in the Lost Tribe series, Miller maintained the idea that other Keshiri existed beyond the continent of Keshtah, isolated from their kin due to quirks of their homeworld's geography and weather. With the novella Pandemonium, Miller used this idea to present a more speculative first-contact narrative: one in which the indigenous people—in this case, the Alanciari—were aware of, hostile toward, and prepared for outsiders. The idea that the Keshiri of Alanciar had lived for two millennia under the belief that they could be invaded at any time prompted Miller to make the Alanciari a martial people, while also setting a stark backdrop within which to stage a love affair between Pandemonium's two primary Keshiri characters, Quarra Thayn and Jogan Halder. The contact narrative structure also allowed the author to set up Thayn as a mirror to Adari Vaal, a more wary collaborator to the invading Sith. Miller took the idea of the Alanciari's semaphore system from a society he envisioned for an ultimately canceled Star Trek e-book project, tentatively titled Starfleet Corps of Engineers. He chose to have the Alanciari speak Basic to avoid a retread of the linguistic problems described in Skyborn."}, {"tag": "p", "text": "Miller's Spiral comic book series allowed the author to delve deeper into Keshiri mythology, to an encounter with outsiders that predated even the Lost Tribe's arrival on Kesh. By introducing the light siders and dark siders who would become the Doomed, Miller elaborated on the origins of the Keshiri's myths about the Protectors and the Destructors, thus explaining their credulity in their later dealings with the Lost Tribe. In an August 2013 interview, Miller explained that the Keshiri were unable to mate with their Human Sith overlords since the latter lacked access to Sith alchemy. While the Dark Jedi who were exiled to the planet Korriban were able to use Sith alchemy to reduce the genetic differences between Humans and the original Sith species, the first Keshiri Sith were low-level miners who were not powerful enough within the Sith Empire to have access to that technology."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}