{"url": "Keshiri_uprising_in_Keshtah", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Kesh"], "nodes": [{"tag": "h1", "text": "Keshiri uprising in Keshtah"}, {"tag": "p", "text": "In 4975 BBY, a Keshiri uprising occurred in Keshtah Minor, which had become the domain of the Lost Tribe of Sith, a group of predominantly Human Sith who had become stranded on the planet Kesh during the Great Hyperspace War. This uprising was led by Adari Vaal, a geologist and the \"Daughter of the Skyborn\", who had turned against the Sith following the death of her elder son Finn Vaal. She also realized that the Sith were not the Skyborn, ancient gods in Keshiri religion which had fought the malevolent Destructors in a \"great battle.\" Adari and several other like-minded Keshiri formed an underground resistance movement which aimed to overthrow the Sith and expel them from Kesh."}, {"tag": "p", "text": "Their plot involved stealing the Tribe's uvak, winged reptilian beasts of burden, while the principal Sith were meeting at their mountainside temple. However, Adari's younger son Tona Vaal, a traveling stable master, betrayed the resistance by revealing their plot to Nida Korsin, the younger daughter of Grand Lord Yaru Korsin. While the rebels succeeded in stealing uvak from the mountainside temple, Nida and her Skyborn Rangers were able to prevent the Keshiri rebels from stealing more uvak from the Sith capital of Tahv. Adari and a thousand Keshiri rebels then fled into exile across the Endless Sea. She and three hundred of these survivors eventually managed to reach Alanciar, a second continent in the planet's southern hemisphere which was home to another Keshiri civilization. Adari succeeded in warning the Alanciari about the threat posed by the Sith and they developed into a highly militarized and advanced civilization."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "In 5000 BBY, the Sith Empire starship Omen crash-landed on the remote Wild Space planet of Kesh following an ill-fated mission to deliver lignan ores to the Sith Lord Naga Sadow's forces on Kirrek during the Great Hyperspace War. Under the leadership of Captain Yaru Korsin, these predominantly Human Sith crew, miners, and soldiers convinced the native Keshiri, a purple-skinned near-Human species, that they were the Skyborn, powerful gods in Keshiri religion. The Sith were helped by the Keshiri geologist Adari Vaal, who had been persecuted by the ruling religious aristocracy, the Neshtovar, for proposing that Kesh's landmasses were shaped by tectonic plates and were not created by the Skyborn. Korsin persuaded Vaal to help them escape their predicament and she managed to convince the Neshtovar that the offworlders were the Skyborn who had returned to Kesh. The Sith then occupied the former residences of the Neshtovar in Tahv and installed themselves as the new ruling elite on the continent of Keshtah Minor. Due to her role in making contact with the Tribe, Quarra Thayn gained an esteemed place in this new society as the \"Daughter of the Skyborn.\""}, {"tag": "p", "text": "While the Tribe had planned to repair their damaged starship and return to the stars, they were unable to do so due to the lack of metal on Kesh and the breakdown of their offworld technology. By 4985 BBY, many of the Sith had resigned to the fact that they were unable to return to the stars and make Kesh their new home. They resided in a mountainside temple that was near their starship. While the Keshiri had initially welcomed the Sith as the returning Skyborn, animosity and resentment towards the offworlders emerged fifteen years after the \"Skyborn's\" arrival. Tensions between the Human Sith and the Red Sith led to the mass Cyanogen silicate poisoning outbreak which killed around a hundred thousand Keshiri in the Ragnos Lakes region. In an attempt to force the Tribe's leadership to leave Kesh and return to the stars, the Red Sith leader Ravilan Wroth had poisoned Tetsubal's water supply, killing 18,000 Keshiri villagers. However, Korsin's wife Seelah Korsin learnt about Wroth's plot and framed the Red Sith by poisoning four other Keshiri cities including Rabolow. This provided a pretext for a purge of all the Red Sith, ensuring that the Tribe would remain purely Human for the next five millennia."}, {"tag": "p", "text": "While the Sith officially attributed the mass deaths at the lake towns to their residents' lack of faith in the Tribe's divinity, Keshiri insiders who were close to the Tribe including Adari Vaal and the scholar Tilden Kaah knew otherwise. The Ragnos Lakes mass deaths led to the formation of an underground Keshiri resistance movement which was led by Adari Vaal, the Daughter of the Skyborn who had realized that the Sith were not actually the Skyborn. Other grievances against the Sith included the deaths of many Keshiri laborers during construction projects and a new edict issued by the Tribe which banned Keshiri from owning uvak, winged reptilian beasts of burden which were regarded as a status symbol in Keshiri society. In the past, uvak had been used by Keshiri riders to transmit news. Following the Ragnos Lakes mass deaths, the Sith now sought to control the transmission of news throughout Keshtah Minor. This loss of status led several Neshtovar including the descendants of Izri Dazh, who had been Vaal's tormentor, to join the Keshiri resistance."}, {"tag": "p", "text": "For Adari Vaal, her grievances against the Sith stemmed from the death of her eldest son Finn Vaal, who had volunteered to join a Keshiri work crew on a Sith construction project. The youth had fallen from a poorly-erected scaffolding and sustained injuries which led to his death. In attempt to save his life, Adari had flown her son to the Tribe's mountainside temple. However, Yaru Korsin was unable to save Finn's life and the youth died. This incident confirmed her lingering suspicions that the Sith were not gods and that their doctors were more interested in investigating whether the Keshiri's diseases affected Humans. Despite her privileged status in Keshiri society and her close connections to Yaru Korsin, Vaal was fully aware that the Sith had manipulated the Keshiri religion in order to subjugate the Keshiri. She empathized with plight of her countrymen and blamed herself for bringing this \"plague\" on her people. For the next ten years, Vaal devised a plan to expel the Sith from Kesh for good."}, {"tag": "h3", "text": "The Plot"}, {"tag": "p", "text": "In 4975 BBY, the self-appointed Grand Lord Yaru Korsin commissioned the construction of a series of new buildings on the capital city Tahv's Circle Eternal plaza to commemorate the twenty-fifth anniversary of the Tribe's arrival on Kesh. By this stage, the Tribe had abandoned all plans of returning to the galaxy and had made preparations to move from their mountainside retreat to Tahv, which was now regarded as the \"jewel of Kesh.\" By this stage, the Tribe numbered six hundred individuals. Since they were outnumbered by the Keshiri, they relied on the Neshtovar to help them administrate the vast continent. Feigning loyalty to her benefactor Korsin, Adari Vaal attended the celebrations. Other guests included Korsin's wife Seelah Korsin, her elder son High Lord Jariad Korsin, and their daughter Nida Korsin. Unknown to Adari or Yaru, Seelah and Jariad were also plotting to assassinate and overthrow Grand Lord Korsin. After reading Vaal's mind, Seelah deduced that Yaru had murdered her husband Devore Korsin shortly after the Omen's landing on Kesh. She intended to install her son Jariad as the new Grand Lord."}, {"tag": "p", "text": "Following the ceremony, Jariad Korsin and his Sith Sabers, a ceremonial honor detail that specialized in lightsaber combat, left for the Northern Reaches officially for training purposes. In reality, they were travelling to the Kesh Sith Temple where they had planned to ambush and assassinate Yaru. Meanwhile, Adari and her surviving son Tona Vaal visited the Grand Lord's new residence, the capitol building, on the pretext that the latter, who was a traveling stable master, was servicing Nida Korsin's uvak. Nida was the leader of a club of uvak-riding enthusiasts known as the Skyborn Rangers. Like his mother, Tona was also a member of the Keshiri resistance and had developed a close rapport with Korsin's younger daughter Nida. After exchanging pleasantries with Yaru, Adari and Tona departed on the pretext of having to attend to official business in Tahv. In reality, they were meeting with fellow members of the resistance for the first stage of their plan."}, {"tag": "p", "text": "The Keshiri resistance met at the residence of the late Izri Dazh, an inquisitor for the Neshtovar, who had tormented Adari in the past. His sons and grandsons were also members of the resistance. Many Neshtovar resented the loss of their former status and influence under Sith rule, particularly being deprived of their uvak steeds. Adari knew that the Sith relied on the uvak circuit-flights to administrate the Keshtah, relay information, and transport personnel and goods across the various regions of Keshtah. However, Kesh's sprawling landmass worked against them, and would completely cripple the Sith should the uvak be eliminated.She also had obtained intelligence that the principal Sith leaders, Yaru and Seelah, were going to the mountainside temple the following day. On that day, Adari and her co-conspirators planned to steal all of the Tribe's uvak and then fly them far beyond the \"great eastern sea\"."}, {"tag": "p", "text": "Many affiliated with the resistance worked as stable hands or laborers, giving them access to uvak—when the day came, instead of tending to the uvak, they would steal them. Led by Vaal on the back of her uvak Nink, they would then sacrifice themselves by flying into the jet stream near the volcano Sessal Spire, which would send them all to a watery grave in the ocean below. The Sith, bereft of their transportation, would then be vulnerable. The resistance planned to seize this opportunity, attacking the Lost Tribe and their Keshiri sympathizers with shikkar blades in the night. They believed that the Sith would likely engage in open warfare, but the Keshiri would have a massive advantage in both terrain and numbers, and hopefully would reclaim control of Kesh. While Adari speculated that many Keshiri would die in the ensuing uprising, she felt that it was necessary in order to defeat the Sith."}, {"tag": "p", "text": "Adari Vaal argued that this plan would work due to their knowledge of uvak behavior and because they had already made preparations for a spontaneous uprising. The Neshtovar members of the resistance reluctantly accepted Vaal plans with one commenting that it had better work since they had already given up a lot. Following the meeting, Tona entered the room and expressed his unhappiness that his mother had kept him from listening to the meeting. As the son of a Neshtovar, he believed that he had a right to be there. Adari assured her son that this was not a snub but rather the resistance was making sure that only a few people knew the details. When Tona expressed his desire to ride with his mother the following day, Adari reminded the young man that he already had his own \"job\" to do. She assured him that he would see her again when they had succeeded. She then reminded him not to be away from Nida and her Skyborn Rangers for too long before telling him to have a good rest since the following day would be a busy one."}, {"tag": "h3", "text": "A High Stakes Gambit"}, {"tag": "p", "text": "The following day, Grand Lord Yaru Korsin arrived at the mountainside temple. There, he was greeted by his wife Seelah who gave a mental signal for her son Jariad and his Sith Sabers to attack Korsin and his entourage. Before they could carry out their coup d'état, the Keshiri stable hands, domestic servants, and laborers at the temple stole all of the Tribe's uvak, which were housed in the temple. All of these had been agents of the resistance who had been carefully positioned there for this very day. This commotion enabled Yaru and his entourage to launch a counter-attack against Seelah and Jariad's forces. The theft of the uvak place the two Korsin factions on equal footing and enabled the Grand Lord to hold out long enough for his younger daughter Nida and her Skyborn Rangers to arrive and kill Jariad and his followers. In total, the Keshiri resistance succeeded in stealing one hundred uvak from the mountain temple."}, {"tag": "p", "text": "Vaal's flock was joined by another flock which had flow far from the east of Keshtah. Throughout the continent, members of the Keshiri resistance stole the Tribe's uvak from their stables. While there were not enough riders, wild uvak would be attracted to the booming bleats of elder males, which were tended to be owned by Neshtovar, many of whom had joined the resistance. The resistance had also crafted their routes to funnel every free uvak down towards Sessal Spire. When all the uvak flocks had assembled, Adari had planned to order her uvak Nink to give the nesting cry that would provide the signal for all the uvak to fly into the jet stream above Sessal Spire and disappear into the oceans. However, the uvak flock from the Sith capital of Tahv never arrived."}, {"tag": "p", "text": "By nightfall, more than a thousand Keshiri had arrived at the foot of the Spire, followed by five thousand riderless uvak. While many uvak had joined her group, Adari was disappointed that this was not the huge wave of beasts she had expected to see. At midnight, a lone rider from Tahv arrived, bringing the bad news that her younger son Tona had revealed the resistance's plans to Nida Korsin the night before the operation was to take place. Using this information, Nida was able to circumvent the Keshiri resistance by making sure that they did not steal Tahv's uvak flocks. After securing Tahv's uvak, Nida and her Rangers then traveled to the mountainside temple where they crushed Seelah's coup d'état. Thus, with one stroke, Nida has defeated two threats to the Tribe: one external and one internal. While her father Yaru eventually succumbed to his injuries, he designated Nida as his successor and delivered a testament that would become the Tribe's founding document."}, {"tag": "p", "text": "After sharing this news with her supporters, Adari flew Nink into the jet stream above the Spire. She was quickly followed by her entire entourage, who were unwilling to live under Sith rule. They did not want to melt back into Keshiri society since they feared retribution from the Tribe. Due to the turbulent atmospheric conditions, many of the Keshiri rebels and their uvak perished during this journey. However, Vaal and three hundred rivers managed to reach a barren island in the \"great eastern ocean\". Her beloved uvak Nink also perished during this journey. Meanwhile, Nida's forces found no sign of the Keshiri rebels and assumed that the rebels had plunged themselves into the volcano crater. Thus, the new Grand Lord concluded that the Keshiri resistance no longer posed a threat to the Tribe's survival."}, {"tag": "h2", "text": "Legacy"}, {"tag": "h3", "text": "Keshtah"}, {"tag": "p", "text": "The failed Keshiri uprising on Keshtah marked the last resistance by the Keshiri on that continent to Sith rule. Over the following centuries, the Tribe consolidated their domination over Keshtah, which remained the only known part of the planet to them. By this time, the uprising was remembered among the Keshiri population as a cautionary tale that the choice of destiny was only a luxury reserved for the Protectors, and not their Keshiri servants. The cost of arrogance for a servant was isolation. However, some Sith like Orielle Kitai disagreed with his viewpoint and regarded Adari Vaal as the greatest Keshiri of all time for defying their predestined fates. Following the events of 4975 BBY, Nida Korsin reigned as Grand Lord for seventy-nine years and her reign was remembered as a \"golden age\" in the histories of the Tribe. Prior to her death, she instituted a meritocratic system of succession where future Grand Lords were elected from among the seven High Lords of the Circle of Lords."}, {"tag": "p", "text": "By 3960 BBY, the Keshiri living on Keshtah had become a large underclass of serfs with many working as laborers, farmers, domestic servants, and even bar owners. By then, Sith society on the continent was divided into four main social groups: the Tribe, non-Force-sensitive Humans, disenfranchised Human slaves, and a large Keshiri serf class. Human members of the Tribe who fell out with the authorities were often condemned to generational slavery. Keshiri living on Kesh were still barred from owning uvak and were not allowed to join the Tribe. Following the death of Grand Lord Lillia Venn during the Night of the Upside-Down Meteor, the Sith Tribe descended into almost a millennium of civil war and anarchy known as the Time of the Rot, which saw many of Keshtah's cities fall into ruins. Many Keshiri were forcibly impressed into the armies of the various Sith factions."}, {"tag": "p", "text": "In 3000 BBY, the reformist Varner Hilts ascended to the Grand Lordship and managed to re-unite the Tribe by discovering a map at the mountainside temple which revealed the existence of a second continent. To honor the memory of his loyal Keshiri aide Jaye Vuhld, Hilts also allowed Keshiri to join the Tribe as Sith Tyros and Sith Sabers. This enabled Hilts to build a large following of Keshiri supporters, who remain devoted to the Tribe."}, {"tag": "h3", "text": "Alanciar"}, {"tag": "p", "text": "Meanwhile, Adari Vaal and the surviving Keshiri exiles were rescued by Keshiri sailors from the continent of Alanciar, who called themselves the Alanciari. Vaal became an important and well-respected figure in Alanciari society, and acquired the status of a national hero. She warned the Alanciari about the threat posed by the Sith in Keshtah Minor. As a result, the Alanciari militarized their society, with every aspect of life being geared toward detecting and repelling an invasion by the Sith—whom they considered the Destructors of legend. The Alanciari developed a well-equipped and well-trained defense force which was supported by a large industrial base and a network of semaphore signal stations and thoughtcriers. In exile, Vaal wrote a book called the Keshtah Chronicles, which detailed the culture, war strategies, and dark side Force use of the enemy. This book became required reading for all children and adults on Alanciar. A festival known as Observance Day was held every ten years to commemorate the ten-year timeframe of Vaal's secret resistance against the Tribe. Most importantly, this holiday involved a theatrical recreation of Adari Vaal's first visit to Alanciar on uvak-back which served to constantly remind the Alanciari of the threat posed by the Sith."}, {"tag": "p", "text": "In 2975 BBY, the Tribe finally invaded Alanciar. Firstly, the Sith High Lord Edell Vrai led a reconnaissance mission to scout Alanciar. However, his airships were intercepted and shot down by Alanciari ballista and uvak-riders. Despite this setback, Vrai and five other Sith survivors managed to capture two Alanciari soldiers—the signal officer Jogan Halder and his lover Wardmaster Quarra Thayn—and also managed to commandeer the Alanciari harvester Mischance. The Sith were able to recruit both of them with Halder being tricked into becoming the Tribe's \"ambassador\" to the Alanciari and Thayn becoming Vrai's guide for a reconnaissance mission into Alanciar's interior. Despite the poor intelligence available on the Alanciari, another High Lord Korsin Bentado led an invasion of the continent. However, the Alanciari shot down his airships and wiped out the Ebon Fleet. Undeterred, Korsin's forces regrouped and infiltrated the Alanciari capital of Sus'mintri where they assassinated the entire War Cabinet, the military leadership of the Alanciari. Thus, the Sith had gained control of the highly-centralized Alanciari government and military with the Alanciari population remaining unaware of this development."}, {"tag": "p", "text": "However, Korsin then mutinied against his liege Grand Lord Varner Hilts and attempted to create his own \"Tribe\" on Alanciar. He also attempted to order the Alanciari ballista and uvak-riders to attack Hilts' airship Good Omen, which was travelling to Alanciar. In the end, Korsin's mutiny was defeated through the combined efforts of Vrai, Thayn, and his own Keshiri aide Squab, who was secretly serving Hilts. As a result, Hilts and his airship were able to land safely in Alanciar. Jogan Halder then convinced the Alanciari that the Sith did not actually pose a threat to them but were in fact the Protectors. While acknowledging that \"servants\" of the Destructors were present among the Tribe, he claimed that these malcontents had been defeated one day after Adari Vaal's departure to Alanciar. Halder also claimed that Bentado and his Ebon Fleet had actually been servants of the Destructors, who had been banished by the \"good\" Sith. Edell Vrai was meanwhile portrayed as an agent of the Protectors who had been sent to apprehend these criminals while Quarra Thayn was portrayed as his well-trained Alanciari companion who had helped defeat Bentado."}, {"tag": "p", "text": "Finally, Hilts completed this charade by disguising himself as the \"Kesh-born\" minion of the Bright Tuash, an avian Keshiri deity. Hilts claimed that Adari Vaal had been his daughter, who was a good but misguided herald. He expressed remorse that the Sith had not been able to save the War Cabinet and sent relief workers from Keshtah to promote good will and reconciliation with the Alanciari. As a result, the Alanciari peacefully submitted to Sith rule. With the \"unification\" of the two continents, the last known Keshiri resistance to Sith domination over Kesh collapsed. Despite her efforts to drive the Sith from Kesh, Vaal would be remembered by Keshiri on Alanciar as a misguided herald who had led Alanciar into two thousand years of collective madness. Following the invasion, only a few Alanciari like Quarra, who knew about the true nature of the Sith, still revered Quarra. With the conquest of Alanciar, the Sith gained access to a continent rich in lumber and wooden sailing ships, which enabled them to explore and dominate the rest of the planet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Keshiri uprising in Keshtah first appeared in John Jackson Miller's e-book Lost Tribe of the Sith: Savior, which was first released on April 27, 2010. It was used as a sideshow to the main narrative which focused on the power struggle between Grand Lord Yaru Korsin and his estranged wife Seelah Korsin. Most of the events relating to his uprising was told from the point-of-view of Adari Vaal, the main Keshiri point-of-view character, who first surfaced in the second novella Lost Tribe of the Sith: Skyborn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}