{"url": "Keshtah_Minor", "categories": ["Category:Legends articles", "Category:Continents", "Category:Kesh locations"], "nodes": [{"tag": "h1", "text": "Keshtah Minor"}, {"tag": "p", "text": "Keshtah Minor, known for millennia amongst the Keshiri and Lost Tribe of Sith as simply Keshtah, was a small continent on the southern hemisphere of the planet Kesh. The Keshiri remain isolated from the wider galaxy until two opposing groups of Jedi and Dark Jedi landed on the planet following the Hundred-Year Darkness. The conflict between these offworlders devastated much of Kesh and triggered the Great Cataclysm which separated Keshtah from Alanciar. Eventually, the two rival Force-wielding factions made peace and exiled themselves to the southern polar continent of Eshkrene, where they became known as the Doomed, a Force-sensitive community that was dedicated to finding true neutrality in the Force. The Great Calamity would be remembered by the Keshiri a \"Great Battle\" between the Protectors and Destructors."}, {"tag": "p", "text": "In 5000 BBY, Keshtah was conquered by a group of stranded Human Sith, who became known as the Lost Tribe of Sith. They managed to convince the Keshiri living on Keshtah to submit to their rule by claiming to be the Skyborn, gods in Keshiri religion. Its largest settlement and capital city was Tahv, which was the headquarters of the Grand Lord and the Circle of Lords. In 3960 BBY, the continent descended into a millennium of chaos known as the Time of the Rot after the death of the reigning Grand Lord Lillia Venn triggered a power struggle. As a result, much of the continent's cities and infrastructure crumbled into ruins. Further destruction came during the Great Crisis when the Tribe learnt that their ancestors had actually been slaves to the Sith Lord Naga Sadow. As a result, many of Keshtah's cities were razed to the ground."}, {"tag": "p", "text": "In 3000 BBY, the Sith caretaker Varner Hilts managed to reunite the Tribe after he discovered hidden maps that revealed that the continent of Keshtah was not the sole landmass on Kesh. In reality, there was a much larger continent, Alanciar, on the opposite side of the planet. The Sith also discovered that Keshtah Minor was separated from Alanciar by a large ocean to the east and smaller western sea known as the Sea of Flames. During the Hilts Restoration, Keshtah Minor was rebuilt. Following the Unification, Keshtah developed close maritime trading ties with Alanciar. Following the Tribe's rediscovery of interstellar travel in 41.5 ABY, a spaceport was built in Tahv. In 44 ABY, Keshtah's main city Tahv was destroyed by the dark side entity Abeloth."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "As early as the end of the Hundred-Year Darkness, Keshtah Minor was home to a large population of Keshiri, a purple-skinned near-Human species native to the planet Kesh. At some point after 6900 BBY, the planet Kesh was visited by two opposing groups of Force-users: the Sith Lord Remulus Dreypa and his Dark Jedi allies and their Jedi opponents. Following the Battle of Corbos, the surviving Dark Jedi including Dreypa had been exiled to the Stygian Caldera. There, these Dark Jedi subjugated the Sith species on Korriban and Ziost and established the Sith Order and the first Sith Empire. At some point, Dreypa and several like-minded Dark Jedi attempted to return to the wider galaxy. They assembled a starship and attempted to leave the Stygian Caldera. However, they were quickly attacked by a Jedi patrol who pursued them across the galaxy. Many of these Jedi were veterans from the Battle of Corbos."}, {"tag": "p", "text": "Eventually, these Dark Jedi and their Jedi opponents crash-landed on Kesh. Both sides were stranded on Kesh and the planet's strange magnetic fields prevented the Jedi from calling for help. According to the Keshiri geologist Adari Vaal, their arrival triggered the \"Great Cataclysm\" which severed access between Keshtah Minor and the neighboring continent of Alanciar. The Dark Jedi and Jedi fought on Kesh and unleashed leviathans, \"great weapons\", which devastated the planet's surfaced and terrorized the Keshiri. Eventually, the Dark Jedi realized the error of their ways and made peace with their Jedi opponents. To seal this peace agreement, the Dark Jedi sealed their fanatical leader Dreypa within an oubliette while the Jedi hid their last remaining starship within the Keshiri catacombs beneath the Circle Eternal, a plaza in the town of Tahv."}, {"tag": "p", "text": "The Jedi and Dark Jedi traveled to Kesh's south pole Eshkrene where they established a new community known as the Doomed, which was dedicated to finding true neutrality in the Force. The arrival of these offworlders would be remembered by later generations of Keshiri on both Keshtah and Alanciar as the \"Great Calamity\" or Great Battle. The Jedi would be remembered as the Protectors while the Dark Jedi would be remembered as the Destructors. By 5000 BBY, the Neshtovar, an elite political and religious class, had united Keshtah Minor under their rule. They used their uvak steeds, winged reptilian beasts of burden, to link the various regions of Keshtah. The Neshtovar regarded themselves as the \"Sons of the Skyborn\" who had brought the knowledge of the Great Battle and Keshiri's creation to oceanside mountains of the continent Keshtah. They phased out the earlier legends of the Protectors and Destructors in favor of a new story revolving around the Skyborn and the Otherside."}, {"tag": "p", "text": "The Skyborn were said to be giant humanoid beings who rode colossal uvak beasts which battled against the Otherside, malevolent entities which were associated with rebellion, sickness, and death. The blood spilled by the Skyborn during this Great Battle was said to have created Kesh's landmass. As of 5000 BBY, the Keshiri living on Keshtah believed that their continent was the only known world. Using their status as the \"Sons of the Skyborn\", the Neshtovar were able to dominate society on Keshtah. Dissidents like Adari Vaal, who disagreed with their creation account and argued that Keshtah's landmass was created by magma flow, were routinely harassed and persecuted. Geological events such as groundquakes and volcanic eruptions were also attributed to be the remnant of the Skyborn acting according to their wishes that the Keshiri honor them and hate the Otherside. Natural disasters were also regarded as a punishment from the Skyborn for an individual's lack of faith."}, {"tag": "h3", "text": "Return of the \"Skyborn\""}, {"tag": "p", "text": "In 5000 BBY, the Sith dreadnaught Omen crash-landed on a mountain slope in Cetajan Mountains, a rocky peninsula on the north-western coast of Keshtah Minor. This starship had been delivering Lignan crystals from the Phaegon system when it was attacked by a Jedi starfighter. The Omen had fled into hyperspace and crashed on Keshtah. the Omen had a large number of Human Sith crew and miners but also carried a significant number of Red Sith personnel and Massassi warriors, and one Houk named Gloyd. The Massassi quickly succumbed to an unknown pathogen in Kesh's atmosphere. Meanwhile, the surviving Sith crew and passengers under the leadership of the ship's captain, Yaru Korsin, made camp below the mountain. Following the landing, he murdered his half-brother Devore Korsin and threw his body below the cliff near where the ship had landed."}, {"tag": "p", "text": "The Omen's arrival triggered a massive explosion which was felt as far away as Tahv. At that time, Adari Vaal was being tried by the Neshtovar for \"heresy\". The explosion was interpreted as a sign of the Skyborn's anger at her alleged blasphemy. Vaal was forced to flee for her life and she flew her uvak Nink to the site of the explosion. Shortly later, she encountered the Sith who took her captive. After a few days, Adari learned to communicate with the offworlders, who told her about their predicament. After learning about the Skyborn from Adari, the Sith leader Yaru Korsin devised a plan to win over the Keshiri by claiming to be their \"gods\" who had returned to them. Using their Force powers, the Sith were able to usurp the Neshtovar as the new ruling elite on Keshtah. The Sith intended to repair their starship and to return to the stars. To support these efforts, they built a temple on the site of the Omen."}, {"tag": "p", "text": "Due to a lack of natural metals on Keshtah, the Sith offworlders were unable to repair the Omen and return to the galaxy. They also exhausted their remaining explosives trying to find metals. By 4985 BBY, tensions had developed between the Human and Red Sith. Some identifiable grievances included the failure of Sith efforts to return to the stars and the inability of the Red Sith's infants to survive for more than a day on their new world. These tensions led the Red Sith leader Ravilan Wroth to contaminate the Keshiri city of Tetsubal's water supply with cyanogen silicate in an attempt to force the Sith to return to the stars. However, Yaru's wife Seelah Korsin discovered his plot and framed the entire Red Sith community for a spate of mass poisoning deaths throughout the Ragnos Lakes region, which lead to the deaths of a hundred thousand Keshiri. The Ragnos Lakes affair culminated in a violent purge of all the Red Sith on Keshtah."}, {"tag": "p", "text": "As a result, the Sith offworlders evolved into a purely Human Tribe over the next five millennia. Seelah also spearheaded efforts to destroy and distort all information relating to the \"Other Fifty-Seven\" non-Human Sith. The sole remaining non-Human Sith Gloyd survived due to his close friendship with Yaru Korsin. The Sith claimed that the mass deaths during the Ragnos Lakes affair was a result of their Keshiri inhabitants' lack of faith in the Sith. The Ragnos Lakes affair also triggered the emergence of an underground Keshiri resistance movement, led by Adari Vaal, which was dedicated to overthrowing the Sith."}, {"tag": "h3", "text": "Two Rebellions"}, {"tag": "p", "text": "By 4975 BBY, the Sith Tribe had finally accepted that Kesh was their new homeworld and abandoned all efforts to return to the stars. They also made evacuated the Kesh Sith Temple and relocated to Tahv, Keshtah's largest settlement. Korsin also forged the Human Sith into a hierarchical Tribe that was led by a Grand Lord and a Circle of Lords. During that period, Korsin and his allies foiled an attempt led by the Omen's former navigator Ermon Parrah to steal the ship and return to the stars. As punishment, Parrah and his associates were condemned to generational slavery. Meanwhile, Seelah Korsin also began plotting to overthrow her husband Yaru Korsin. She sought revenge against him for the murder of her late husband Devore Korsin and planned to install her elder son Jariad Korsin as the new Grand Lord."}, {"tag": "p", "text": "Thus, Yaru Korsin faced two main threats to the Tribe's domination of Keshtah: the Keshiri resistance and Seelah's faction. While Vaal had acquired a respectable status under Sith rule, she came to realize that they were not gods and hated the Sith for causing the deaths of thousands of her fellow Keshiri through the Ragnos Lakes affair and various construction projects. Her elder son Tona Vaal had also died during a construction accident and the \"Skyborn\" had failed to heal him. Several Neshtovar members including the descendants of the late High Councilor Izri Dazh also joined the resistance. Their grievances included their reduced political and religious influence, and a new law which barred all Keshiri from riding uvak. The Tribe had introduced this new law in order to control the circulation of information throughout the continent."}, {"tag": "p", "text": "The Keshiri rebels planned to steal the Tribe's uvak and fly them into the jet stream above the volcano Sessal Spire, which would send them to a watery grave in the oceans around Keshtah. Other elements of the resistance would then take advantage of the chaos by killing Sith with shikkar blades. Meanwhile, Seelah and Jariad raised a force of armed supporters known as the Sith Sabers, who purported to be a hobby club which specialized in lightsaber combat. The two anti-Korsin conspiracies eventually converged at the Kesh Sith Temple. However, the Grand Lord and his daughter Nida Korsin outmaneuvered and defeated both conspiracies. Due to a tip-off from Vaal's younger son Tona Vaal, Nida's Skyborn Rangers, the Tribe's aerial force, learnt of the planned Keshiri uprising and were able to prevent the rebels from stealing the Tribe's uvak herd in Tahv."}, {"tag": "p", "text": "Later, Nida and her Skyborn Rangers flew to the Sith Temple where they rescued Korsin and defeated Seelah and Jariad's rebels. Jariad was thrown down the mountain cliff to his death while his mother Seelah was banished to the Temple where she spent the last years of her life. Seelah had also lost her legs during a suicide bombing made by Gloyd during his final stand against the anti-Korsin rebels. While Korsin later succumbed to injuries inflicted during the battle, he was still able to deliver a testament which designated Nida as his successor and outlined the basic political structures of the Tribe. Meanwhile, Vaal and the surviving rebels fled across the Western Sea and ended up in Alanciar. Over the following centuries, the failed Keshiri uprising was regarded by many Sith and Keshiri as a cautionary tale that only the Sith had the power to shape their own destiny."}, {"tag": "h3", "text": "Sith Consolidation"}, {"tag": "p", "text": "Nida Korsin reigned as Grand Lord over Keshtah for seventy-nine years. Her reign was regarded as a robust, golden age in the Tribe's history. She outlived her son Donellan, who had waited too long to succeed his power. This ended the Korsin dynastic system. Nida's legacy was commemorated in a holiday called the Festival of Nida's Rise which was held every seventy-nine years. Meanwhile, Donellan's legacy was commemorated in a holiday called Donellan's Day, which served to warn the Sith not to hesitate to make their move towards power. In response, Nida instituted a succession system based on meritocracy. By 3960 BBY, four main social classes had developed on Keshtah: the high-born Force-sensitive Sith, a yeoman class of non-Force sensitive Human Sith, enslaved Sith outcasts and dissidents who had been condemned to generational slavery, and the native Keshiri, who formed a large serf underclass. By this stage, the Sith Sabers had developed into the Tribe's equivalent of the Jedi Knights and were task with enforcing law and order on Keshtah. Two major political factions had also developed within the Tribe: the Red Faction, led by High Lord Dernas, and the Gold Faction, led by High Lord Pallima. These two factions competed for control of the Circle of Lords and the Grand Lordship."}, {"tag": "p", "text": "In 3961 BBY, the elderly Sith High Lord Lillia Venn ascended to the Grand Lordship. She had been elected as a compromise candidate to appease the Red and Gold Factions. Due to her old age, Venn was not expected to live long and was widely regarded as a weak candidate among the Sith ruling elite. However, Lillia was determined to hold on to the \"pinnacle of power\". Thus, in 3960 BBY, she staged her own assassination attempt to discredit her political rivals. Her agents manipulated the uvak wrangler Campion Dey into staging an assassination attempt during the rake-riding games on Donellan's Day. Campion was sponsored by the High Lord Candra Kitai, who had recently ascended to the High Lordship the previous year to fill Lillia's former seat. As an independent, Candra held the strategic position of tiebreaker who would select Lillia's successor in the event that the Grand Lord died. Consequently, Lillia viewed Candra as a potential threat to her reign."}, {"tag": "p", "text": "Lillia's plot succeeded and this enabled her to target Candra along with Dernas and Pallima. After outliving his usefulness, Campion Dey was executed by her bodyguards: the Sith Sabers Flen and Sawj Luzo. In order to make an example of her enemies, Lillia ordered the immediate execution of Dernas and Pallima, who were accused of conspiring with Candra to assassinate the Grand Lord. As punishment, Candra and her daughter Orielle Kitai, a prominent Sith Saber, were enslaved by Lillia and had their lands, titles, and belongings expropriated or destroyed by the state. After \"confessing\" to her role in the conspiracy, Candra pledged her \"eternal loyalty\" to Lillia and was forced to shovel uvak manure at an uvak-exhibition facility in Tahv known as the zoo. Following the staged assassination attempt, Lillia appointed three of her own supporters as High Lords and promoted Flen and Sawj to the positions of Sith Lords; thus consolidating her support base in the Sith state."}, {"tag": "p", "text": "A dejected Orielle sought refuge with her friend Jelph of Marisota, who owned a farm on the banks of the Marisota River. During her time there, Orielle discovered that Jelph was actually a Jedi Shadow from the Galactic Republic and that he owned a starship, a technology which the Tribe did not have access to for centuries. Over the passage of time, the Tribe's descendants had largely forgotten how starships worked and no longer had access to other common galactic technologies like blasters. Still, the Tribe aspired to return to the stars and rule the galaxy and thus regarded the discovery of any offworld technology as one of \"Kesh-shaking\" importance. Orielle saw this as an opportunity to restore her family fortunes and to reunite the Tribe with the galaxy. Jelph pursued her in an attempt to protect the galaxy and his secret from the Tribe."}, {"tag": "p", "text": "After arriving in Tahv, Orielle informed her mother about the discovery. Candra told her daughter to contact the four remaining Red and Gold High Lords through the architect Gadin Badolfa, and also gave her the passcode to indicate a discovery of \"Kesh-shaking importance.\" However, Candra did not believe her daughter's story and informed the Grand Lord Lillia in return for \"improved working conditions.\" Meanwhile, Orielle reconciled with Jelph and the two returned to Jelph's farm in an attempt to prevent the Sith from discovering his secret starship. However, Lillia and her supporters had already arrived at the farm and discovered Jelph's starship. However, Jelph had one trick up his sleeve; he had already rigged the starship with explosives. The ensuing explosion destroyed the starship along with Lillia and her entourage. This night was remembered in Keshiri history as the \"Night of the Upside-Down Meteor\" and triggered a millennium of chaos known as \"the Time of the Rot.\" Meanwhile, Jelph and Ori survived the explosion and created a new home in the remote jungle highlands of the continent."}, {"tag": "h3", "text": "The Time of the Rot"}, {"tag": "p", "text": "The death of Lillia Venn triggered a millennial power struggle in Keshtah within the Lost Tribe of Sith. The Red and Gold Factions attacked and killed her supporters and then fought among themselves. Over the next millennium, various Sith factions fought for control of the capital city Tahv and the Grand Lordship. These factions recruited many disenfranchised Sith slaves and Keshiri into their forces. Over the centuries, the Sith factions united long enough to conquer Tahv and overthrow the ruling Grand Lord only to begin immediately fighting among themselves. By 3000 BBY, the Tribe had split into twenty warring factions including the Sisters of Seelah, the Korsinite League, Force 57, and the Golden Destiny, which emulated different figures and aspects of the Tribe's history. As a result of the Time of the Rot, Keshtah's cities and infrastructure crumbled into ruins and disrepair. Southern Keshtah was also devastated by a series of powerful explosion from the volcano Sessal Spire and its sister volcanoes, which caused extensive damage to cities and infrastructure including Tahv's Korsinata arena. By then, the Tribe had been reduced to a few thousand individuals since they were unable to intermarry with the Keshiri."}, {"tag": "p", "text": "The only time that the various Sith elements met together peaceably was Testament Day, a holiday held every twenty-five years where the Testament of Yaru Korsin was read to the Tribe's leadership. Due to his status as the Tribe's founder, Yaru was revered as a respected historical figure in the Tribe's history. Several factions particularly the Korsinite League, which emulated Yaru and his daughter Nida, regarded Yaru Korsin's Testament as a \"sacred scripture\" and believed that the Tribe needed to adhere to the political structure and practices outlined by the first Grand Lord. The \"Pantheon's Peace\" was convened at the Kesh capitol building, which was regarded by the various Sith factions as a neutral meeting ground and a sacred place due to its association with the Grand Lordship. The capitol building also housed the Office of the Caretaker, who was responsible for safeguarding the Tribe's history and time-keeping. As of 3000 BBY, the Caretaker was one of the few institutions that had not been affected by the power struggle and the current office-holder was Varner Hilts, a mild-mannered and wise scholar."}, {"tag": "p", "text": "That year, the Sisters of Seelah, a faction which emulated the memory of Seelah Korsin, occupied the capitol building. Their leader, Iliana Merko, attempted to produce a fake testament that favored Seelah and her supporters. However, Hilts revealed that her plan would not suffice because the testament was read by a holographic recording of Yaru Korsin himself, which was stored in a holocron, an ancient Jedi and Sith technology used for storing knowledge and communications. The Sisters' presence attracted the attention of the other Sith factions, which had camped on the grounds of the Circle Eternal. Following a brief skirmish between the Sisters and two other factions, the Korsinite League and Force 57, Hilts was able to mediate a truce by offering to read the Testament of Yaru Korsin. To obtain legal sanction for convening the \"Pantheon's Peace\" eight days earlier than scheduled, Hilts' Keshiri assistant Jaye Vuhld presented his findings that the Keshiri calendar was actually eight days behind the Galactic Standard Calendar."}, {"tag": "p", "text": "The reading of Yaru Korsin's Testament managed to temporarily quell the tensions between the Sith factions. However, it did nothing to mend their divisions and instead aggravated the long-standing rivalries among the Sith. The Sisters of Seelah and Force 57 objected to the exclusion of Seelah Korsin and the \"Different Ones\", the Red Sith, from the Tribe's official history. Meanwhile, the Golden Destiny contested the Korsinite League's literalist adherence to the Testament of Yaru Korsin and argued that the Tribe needed to stop fighting, unseal the Temple and return to the stars. While attempting to deactivate the holocron, Varner Hilts discovered that the testament had been recorded over an older recording; which turned out to be orders from the Sith Lord Naga Sadow to his slave Captain Yaru Korsin. The assembled Sith leadership quickly learnt that Tribe's ancestors had not been \"divine conquerors\" but had rather been slaves to the Red Sith. This revelation sparked a series of violent riots and killings known as the Great Crisis which threatened the Tribe's very existence."}, {"tag": "p", "text": "As a result of the fighting, many of Kesh's cities were razed to the ground and many Sith were killed. Despite this bleak situation, Varner Hilts and Jaye were able to save the Tribe from its downward spiral of destruction by discovering a large map within a secret chamber in the Kesh Sith Temple. This map confirmed the existence of a second continent on the planet Kesh known as \"Keshtah Major\". This discovery confirmed that Keshtah was not the only known land on Kesh and that several other lands and seas lay unexplored. Hilts was able to use this discovery to reunite the Tribe and to prevent the other Sith from destroying the Omen by crashing the Temple's main tower onto its protective chamber. As a result, the various Sith factions elected Hilts as their new Grand Lord and vowed to rebuild the old system and conquer \"Keshtah Major.\" Hilts also married Iliana Merko, who became his Grand Consort. As a result, the Time of the Rot came to an end."}, {"tag": "h3", "text": "The Hilts Restoration"}, {"tag": "p", "text": "Under the leadership of Grand Lord Hilts, Keshtah Minor's cities and infrastructure were rebuilt. The capitol building, the residence of the Grand Lord, was restored to its former glory. Hilts named this new period the \"Hilts Restoration\" to signify the end of the Time of the Rot and the Tribe's commitment towards rediscovering its past. As Grand Lord, Hilts would leave a lasting legacy on the Tribe's history. Firstly, he allowed Force-sensitive Keshiri individuals to join the Tribe, thus providing them with an avenue for social mobility. This policy was intended to commemorate the sacrifices of Jaye, who had helped find the map of \"Keshtah Major\", but did not live to see the day. Secondly, he restored Korsin's traditional power structure as outlined in the Founder's Testament. Under this system, ambition was restrained and advancement into the Tribe was through merit rather than violence. As a symbolic gesture of meritocracy, Hilts elected not to appoint his daughter Takara Hilts as successor. She instead became the Prefect of Police of the Tahv Constabulary."}, {"tag": "p", "text": "Thirdly, Grand Lord Hilts commissioned a new Testament to replace Korsin's Testament since he believed that the ancient text was no longer appropriate for contemporary times. Instead, he and a team of scribes wrote a new Testament which would serve as a part-manifesto and a part-legal document. Unlike its predecessor, Hilts' Testament acknowledged the Tapani origins of the Tribe and their enslavement to the Red Sith. However, it then stressed that the Tribe's ancestors overthrew their Sith overlords and subjugated the Keshiri people. While Hilts' Testament was read every Testament Day, the Keshiri were only allowed to read a redacted version which hid the Tribe's experience as Sith slaves."}, {"tag": "p", "text": "Despite the progressive nature of Grand Lord Hilts' rule, slavery still existed. Generational slavery was still prescribed as a punishment for Human Sith who violated the political order. The Tribe also continued to use the port town of Eorm as a dumping ground for disenfranchised Human Sith, who were forced as slave laborers. Many of these Human Sith were the descendants of Ermon Parrah, who had led an unsuccessful attempt to steal the crippled vessel Omen and return to the stars eons ago. Some Sith Lords like Lord Galathos were also not above terrorizing slaves that failed to meet their work quota. Despite these injustices, the peaceful and stable nature of Hilts' rule convinced the Doomed, the descendants of stranded Jedi and Dark Jedi from the Hundred-Year Darkness, not to intervene on Keshtah. The Doomed respected Hilts as a wise man who had protected the native Keshiri."}, {"tag": "p", "text": "Finally, Hilts' most important legacy was the conquest of Alanciar. During the Hilts Restoration, the Tribe's energies and resources were directed towards finding a way to conquer \"Keshtah Major\". This project involved finding a technology that would allow the Tribe to make multiple trips to and from that continent. Edell Vrai, a young forward-thinking member of the Golden Destiny, was designated as the \"chief engineer\". After a series of failed experiments with long-distance uvak flights and sailing ships, Edell settled for airships, which were held aloft by hydrogen gasbags and powered by uvak. By 2975 BBY, the Tribe had amassed a sizeable fleet of reconnaissance and military airships. The High Lord Edell was also designated as the leader of the reconnaissance mission to the new continent while his fellow High Lord Korsin Bentado was designated as the leader of the invasion force, the Ebon Fleet."}, {"tag": "p", "text": "While Edell's expedition managed to cross the Endless Sea and reach \"Keshtah Major\", they quickly discovered that the Keshiri there, who called themselves the Alanciari and their homeland Alanciar, had developed into a highly militaristic and industrialized society. Two millennia ago, Adari Vaal had fled to Alanciar and warned the Keshiri there about the threat posed by the Sith. The Alanciari decimated Edell's scouting fleet and Bentado's invasion force. However, the Tribe ultimately succeeded in conquering Alanciar despite these challenges. Edell's expedition managed to capture two Alanciari, the soldier Jogan Halder and the Wardmaster Quarra Thayn, who were roped into serving the Tribe. Firstly, Hilts successfully convinced Jogan that the Tribe did not actually pose a threat to them but were in fact the benevolent Protectors. Secondly, Hilts took the opportunity to use the Alanciari invasion to eliminate his rival Bentado Korsin, who was also the leader of the Korsinite League, and had ambitions of becoming Grand Lord. Edell and Quarra thwarted an attempt by Bentado to create a \"Second Tribe\" on Alanciar and kill Grand Lord Hilts. Thus by conquering \"Keshtah Major\", the Tribe realized its goal in breaking free from the continent, which was the first step towards its ultimate goal of galactic conquest."}, {"tag": "p", "text": "Following the \"unification\" of Keshtah Minor and Alanciar, maritime trade between the two continents developed. Ports like Eorm and the one lying to the west of Berav became important transoceanic trading centers. The Tribe's economy however still remained a command economy. Despite the relative peace, stability, and prosperity of the Hilts era, there was still discontent among the slave class which manifested into rebellion against the Tribe's ruling elite. One threat to the Tribe was the brigand Parlan Spinner, a descendant of Ermon Parrah, who attempted to assassinate Grand Lord Hilts. Following his failed assassination attempt, he was sentenced to servitude on the Alanciari sailing ship Southern Star. Under the leadership of the Alanciari captain Chegg, the Southern Star discovered the frozen continent of Eshkrene in the South Pole."}, {"tag": "p", "text": "There, Spinner encountered the Doomed and freed the ancient Sith Lord Dreypa. Dreypa laid waste to Eorm and Tahv during a brief but violent insurgency. However, the ancient Sith Lord was destroyed through the efforts of Spinner and Takara, the daughter of Varner and Iliana Hilts. As a reward for his services, Spinner was admitted into the Tribe and became a Grand Lord's Hand, making him a secret agent of Hilts. During his final stand against Dreypa, Spinner also destroyed the Doomed's ancient Jedi starship; thus delaying the Tribe's return to the galaxy for another three millennia. During this period, the Tribe used the Alanciari sailing ship technology to explore and circumnavigate the rest of Kesh including its unexplored northern hemisphere."}, {"tag": "h3", "text": "Return to the Stars"}, {"tag": "p", "text": "In 41.5 ABY, Kesh's galactic isolation came to an end when a Sith Meditation Sphere known as Ship landed at the Kesh Sith Temple on Keshtah. Ship made contact with the Sith Tyro Vestara Khai and offered to instruct her in the ways of the dark side of the Force. Later, Vestara revealed Ship's existence to the Circle of Lords, telling them that they also shared their thoughts. The Lords then decided that they would use Ship to learn more about the Sith, and to travel offworld. Vestara was then made a Sith apprentice to Lady Rhea and was designated to be trained by Ship. Ship also revealed to the Lost Tribe that the Sith did not rule the galaxy and were actually very few in number. This revelation completely shattered the Lost Tribe's long-held belief that the Sith had ruled the galaxy for thousands of years."}, {"tag": "p", "text": "The tribe spent the next two years capturing ships and creating a Sith armada. As the Sith built up their armada, a spaceport was constructed in open land just outside of Tahv. Within two years, the fleet contained several dozen ships, including the rebuilt Omen. After sensing the presence of exiled Jedi Grand Master Luke Skywalker through the force, a strike team was put together to hunt down and kill Skywalker. It was also at this time that Ship left Kesh. In response, the Circle of Lords decided to track down and recapture Ship and put aside their plans to hunt Skywalker. This brought the Lost Tribe into contact with both the Force entity known as Abeloth and the Jedi Master Skywalker and his son Ben Skywalker. Eventually, the Lost Tribe formed an alliance with the Skywalkers to stop Abeloth, who was responsible for causing a Force psychosis that was plaguing Jedi in the Galactic Alliance, one of the successor states to the former Galactic Republic which came to an end following the Clone Wars."}, {"tag": "p", "text": "In 44 ABY, this temporary alliance came to an end when Abeloth approached the Sith Saber Gavar Khai with an offer to form an alliance with the Lost Tribe in return for killing Skywalker and his allies. While the Circle of Lords were divided over this issue, Grand Lord Darish Vol decided to side with Abeloth since he thought that she would benefit the Tribe's interests. Vol then contacted Gavar Khai, who was returning with his fleet, Abeloth, and Ship to Kesh, and told him to delay Abeloth's arrival on the planet. The Grand Lord had planned to prepare a celebration in Tahv for Abeloth, since she was regarded as a valuable asset in defeating the Lost Tribe's enemies. While Abeloth distrusted Vol's motives, she accepted his offer and told Khai to instruct everyone in his fleet to return to Kesh with their friends and family members."}, {"tag": "p", "text": "When Abeloth arrived in the Sith capital of Tahv, she was officially welcomed by a parade organized by the Sith authorities. The Grand Lord also closely observed Abeloth to understand her motives. Following the festivities, Abeloth visited Vol in his dreams. However, the Grand Lord was able to lure Abeloth into a mental trap which he used to attack the entity. However, Abeloth sent a Force shock-wave equivalent to that of a tsunami that destroyed much of Tahv, killing thousands of its citizens including Sith and Keshiri. Khai's wife Lahka Khai perished during this attack. Following the Destruction of Tahv, Ship departed with Abeloth and several Sith who were still loyal to the Force entity. These included Gavar Khai, who was still grieving over the loss of his wife, and his forces who had been influenced by Abeloth. Abeloth then \"absorbed\" the populist Senator Rokari Kem, and assumed her identity. Led by the new Chief of State \"Kem\", the Lost Tribe then infiltrated the Galactic Alliance Senate and took over the galactic capital of Coruscant. However, the Lost Tribe and Abeloth were defeated by the New Jedi Order."}, {"tag": "h2", "text": "Geography"}, {"tag": "p", "text": "Keshtah was a small continent in the southern hemisphere of the planet Kesh. It was characterized by long ridged peninsulas forming from plateaus which created rocky coastlines and fjords. Keshtah was also known to have several mountain ranges including Takara Mountains—formerly called the Cetajan Mountains. This mountain range was very steep and also covered a peninsula which bordered the Sea of Flames. At the tip of this peninsula lay a a Sith Temple, which had been built by the Lost Tribe of Sith over the crash site of the starship Omen, which had crashed on the mountains during the Great Hyperspace War. Due to its remote location, the Temple was accessible only by air or a hazardous climb up the slopes. By 41 ABY, it had become a historically-important site on Kesh and was used to train Sith apprentices."}, {"tag": "p", "text": "In addition, Keshtah was also home to several settlements including its largest city and capital Tahv. Prior to 5000 BBY, Tahv was a small Keshiri village which had been built to keep the Keshiri safe from dangerous creatures. By 4975 BBY, it had become the capital of the Sith Tribe on Kesh and would remain so for several millennia. After the Lost Tribe of Sith helped the Keshiri either drive away or domesticate Kesh's native beasts, Tahv became Keshtah's main settlement and capital city. As the \"Jewel of Kesh\", Tahv was a decorative city, focusing mainly on workings of art, often created by Sith artists using the Force. Some buildings in Tahv included the capitol building, which was built on top of a large plaza known as the Circle Eternal, the Korsinata stadium, and the zoo. The city also had a large aqueduct system, which towered over the cities' streets and buildings."}, {"tag": "p", "text": "Other known settlements included Eorm, Berav, Sharv, Zandi, Glorim, Orreg, Rees, Ryav, Elvarnos, Roston, Cham, Kithar, and Telmath. Eorm was a port city in south-western which was home to enslaved Humans, who had been cast out of the Tribe for various crimes including rebellion. Following the \"Unification\" of Keshtah and Alanciar, Eorm became a production center for sails used to build wooden sailing ships. Orreg was a city in northern Keshtah that contained the Tribal Intelligence Depository. By 2974 BBY, a port had also been built near Berav, overlooking the Sea of Flames, to cater for ships coming from Alanciar. The north-eastern corner of Keshtah, overlooking the Western Sea, was covered in purple dunes."}, {"tag": "p", "text": "Other prominent natural features included the volcano Sessal Spire, the Marisota River and floodplain, and the Ragnos Lakes. Sessal Spire was located on a peninsula on the southwestern coast of Keshtah and overlooked the Sea of Flames. The Marisota River was a large river which flowed from the jungle highlands and mountains of the central interior into the Ragnos Lakes. The Marisota floodplain was a flat grassland which was home to farms and was also the site of several battles. The Ragnos Lakes was home to several Keshiri settlements including Tetsubal until 4985 BBY when thousands of Keshiri were killed during a mass poisoning outbreak of cyanogen silicate. As a result, the Ragnos Lakes region was abandoned and was only filled with ghost towns by 3960 BBY. Other known rivers on Keshtah including the Tapani River and the Eathcote River."}, {"tag": "h2", "text": "Flora and Fauna"}, {"tag": "p", "text": "Keshtah Minor was home to many species of flora and fauna. Some notable plant species that were found in Keshtah included dalsa flowers, hejarbo shoots, and vosso trees. The Marisota Floodplain was covered in grass and tussock. Keshtah did not have any native trees whose wood could be used as timber for long-distance oceanic travel. The hejarbo shoots were often used for building houses but proved vulnerable to rainstorms. Vosso trees were too dense to float. Keshtah also had several jungles in its central highland region. This jungle region was home to various types plants which were ideal for making fertilizer."}, {"tag": "p", "text": "Keshtah was also home to several species of animals including the uvak, a species of winged dragon-like reptiles which was capable of traveling for long distances. Uvak were the only domesticated animal of burden that was native to this continent. Uvaks were also known for their intelligence and many developed close relationships with their owners. While Keshtah was home to several predator species including an unidentified six-legged mammal, most of these had become extinct by 3960 BBY due to the Sith Tribe's enthusiasm for blood sports. The Ragnos Lakes was also home to several species of fluorescent algae."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Prior to Sith rule, the Keshiri on Keshtah Minor were ruled by the Neshtovar, an elite political and religious aristocracy who rode uvak, domesticated beasts of burden. The Neshtovar used their uvak to develop an aerial circuit system which connected Keshtah's settlements. The Neshtovar regarded themselves as the \"Sons of the Skyborn\", a race of powerful gods who were believed to have created Kesh during a \"Great Battle\" with the malevolent Otherside. Until the Sith-takeover, the Neshtovar dominated every aspect of life in their settlements and persecuted dissenters like the geologist Adari Vaal who disagreed with their creation account. The Sith took over Keshtah Minor by claiming to be the Skyborn."}, {"tag": "p", "text": "For most of its history, Keshtah was dominated by the Lost Tribe of Sith who were responsible for shaping its society and culture. By 3960 BBY, Sith society on Keshtah Minor was divided into four main social groups: the Tribe, non-Force-sensitive Humans, disenfranchised Human slaves, and a large Keshiri serf class. Human members of the Tribe who fell out with the authorities were often condemned to generational slavery. Many of these slaves resided in the port town of Eorm where they were forced to serve as unskilled tailors, weavers, and laborers. Slavery continued even after the Hilts Restoration and at least one slave uprising was known to have occurred in 2974 BBY. It was also possible for slaves to regain their place in the Tribe if they cooperated with the authorities or did heroic acts, as in the cases of Candra Kitai and Parlan Spinner."}, {"tag": "p", "text": "The most important social and political institution on Keshtah was the Sith Tribe. It was led by a Grand Lord who was supported by a Circle of Lords, which consisted of seven High Lords and thirteen Sith Lords. Other known ranks, from bottom to top, included Sith Tyros, Sith apprentices, Sith Sabers, Sith Masters, and the Grand Consort, the spouse of the Grand Lord. It was the most important institution for social mobility and was open to both Force-sensitive Humans and Keshiri by 3000 BBY due to the reforms of Grand Lord Varner Hilts. By 41 ABY, several Force-sensitive Keshiri served within prominent positions within the Tribe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}