{"url": "Kesin_Ommis/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Coruscanti", "Category:Gunners", "Category:Humans", "Category:Males", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Kesin Ommis"}, {"tag": "p", "text": "Kesin Ommis was a Human male member of the Alliance to Restore the Republic during the Galactic Civil War. A native of the galactic capital planet of Coruscant, Ommis joined the Rebellion about a year after the Battle of Yavin, serving as a skilled gunner on capital ships and starfighters. His longest tenure came aboard the EF76 Nebulon-B escort frigate Tharen before he was assigned to the Alliance High Command's Echo Base on the remote ice planet Hoth. Ommis fought in the Battle of Hoth in 3 ABY as the T-47 airspeeder tailgunner for Rogue Group pilot Derek \"Hobbie\" Klivian. Ommis was wounded in the battle but survived."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kesin Ommis was born on Coruscant, the longstanding capital planet of the Old Republic and the seat of power of the Galactic Empire during the Galactic Civil War. Ommis joined the revolutionary Alliance to Restore the Republic around 1 ABY, about a year after the Rebellion's monumental victory in destroying the Empire's first Death Star battlestation at the Battle of Yavin. He served as a skilled gunner aboard several Alliance corvettes, frigates, and starfighters, including his last and longest assignment as a gunner mate aboard the EF76 Nebulon-B escort frigate Tharen, before being sent to the Alliance High Command headquarters at the secret Echo Base on Hoth, a remote ice planet in the Outer Rim Territories, by 3 ABY."}, {"tag": "p", "text": "Shortly before the onset of the Battle of Hoth, in which the Dark Lord Darth Vader's Imperial forces launched a full-scale planetary assault to destroy the Hoth Rebel base, Ommis was reassigned from starfighter duty, one of several personnel pulled from their regular assignments to serve as a gunner in the aft seat of the Rebels' T-47 airspeeders, dubbed \"snowspeeders.\" The move paired him with Rogue Group pilot Derek \"Hobbie\" Klivian, also pulled from starfighter duty, under the call sign Rogue Four. The responsibility fell to Rogue Group to defend the base against the Empire's invading All Terrain Armored Transport walkers."}, {"tag": "p", "text": "The Rebels' defensive strategy called for Rogue Group's snowspeeders to delay the overwhelming Imperial invasion force as long as possible to buy enough time for Echo Base's evacuation transports to escape the planet. Once they received the withdrawal signal themselves, the Rogues were to assemble on Hoth's South Slope, just beyond the base, where they would then fly starfighter escort for the remaining evacuation transports. Ommis was wounded in the ensuing battle, a staggering Rebel defeat. Klivian's snowspeeder ultimately went down after being hit by AT-AT blasterfire and then crashing headfirst into the cockpit of Blizzard 1, Imperial General Maximilian Veers' lead walker. Nevertheless, both Ommis and Klivian survived the ordeal."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kesin Ommis's combat abilities laid in his considerable gunnery skills, serving aboard Rebel capital ships, starfighters, and other craft. He was also highly trained in weapons operations. When the Rebellion needed to augment Rogue Group's snowspeeders with aft gunners during the Battle of Hoth, Ommis joined the elite squadron."}, {"tag": "p", "text": "Ommis, a Human, had brown facial hair, brown eyes, and light skin. He also sported a mustache."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ommis's equipment included a standard Rebel pilot uniform and a DH-17 blaster pistol sidearm."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "The character of Kesin Ommis was first mentioned on the \"Rogue Gunner\" card from the November 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game. The card, which established the character's original backstory and role with Rogue Group, identified Ommis as one of the Echo Base Rebel pilots appearing in the 1980 film Star Wars: Episode V The Empire Strikes Back during Princess Leia Organa's pre–Battle of Hoth briefing. However, the Rogues Gallery department from Star Wars Insider 146, released in December 2013, later changed the pilot's characterization from Ommis to Dak Ralter, Luke Skywalker's ill-fated snowspeeder gunner in the film. Research conducted by Lucasfilm's Pablo Hidalgo revealed that the actor in question was, in fact, John Morton—who played Ralter in the film—as confirmed by Morton's daughter, thus necessitating the character change."}, {"tag": "p", "text": "Ommis's background was greatly expanded upon, including establishing him as the gunner of Rogue Group pilot Derek \"Hobbie\" Klivian during the Battle of Hoth, in author Josh Radke's Who's Who in Echo Base article from Star Wars Insider 74, released in February 2004. Given Ommis's pairing with Klivian, The Empire Strikes Back novelization, which describes a scene—deleted from The Empire Strikes Back film—in which Klivian suicidally crashes his snowspeeder into General Veers' AT-AT walker during the Hoth battle, is therefore considered Ommis's first in-universe appearance, albeit indirectly, in Star Wars canon. The Essential Guide to Warfare, released in April 2012, later established that Ommis survived the battle despite Klivian's snowspeeder being shot down."}, {"tag": "p", "text": "Author Ryder Windham's junior novelization of The Empire Strikes Back, published in October 2004, confirms that two snowspeeders appearing in a Battle of Hoth film scene immediately following Luke Skywalker's line \"Hobbie, you still with me?\" are piloted by Skywalker and Derek Klivian, with Klivian flying as Skywalker's wingman. In this film scene, the trailing snowspeeder's tailgunner, which corresponds to Ommis's character, is visible within the speeder's cockpit, making The Empire Strikes Back film the character's first visual canon depiction. However, a live extra for Ommis was filmed during the making of The Empire Strikes Back, for inclusion in the aforementioned scene of Klivian crashing into Blizzard 1. The partially finished scene was officially released as part of the 2011 Star Wars: The Complete Saga Blu-ray set."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "As a result of Star Wars Insider 146's Kesin Ommis–Dak Ralter character change, several previously published sources now misidentify Ralter as Ommis in the Rogue Group briefing scene from The Empire Strikes Back. In addition to the Hoth Limited SWCCG \"Rogue Gunner\" card (1996), these sources include Star Wars: Behind the Magic (1998), Who's Who in Echo Base (2004), Hasbro's Star Wars: The Legacy Collection toy line (2008), The Official Star Wars Fact File Part 5 (2013), and 2013 Topps Star Wars Galactic Files Series 2 (2013)."}, {"tag": "p", "text": "Star Wars: The Legacy Collection featured Ommis in a three-figure set as part of its 2008 Rebel Pilot Legacy Series II release. The set, which also included Star Wars characters Keyan Farlander and Cesi \"Doc\" Eirriss, described Ommis as participating in the Battle of Hoth \"as a snowspeeder pilot in defense of Echo Base,\" which contradicts the character's role in the battle as Derek Klivian's gunner, as first established in Who's Who in Echo Base. Although the set's packaging features a likeness of what is now Ommis's incorrect appearance from The Empire Strikes Back, the action figure itself depicts Ommis with a mustache, a unique departure from any previous representation of the character. This article therefore treats the action figure as a valid canonical depiction of Ommis."}, {"tag": "p", "text": "The first draft of the Star Wars Insider 146 Rogues Gallery article originally listed Ommis as one of the pilots in The Empire Strikes Back before changing the character to Dak Ralter. However, an editorial oversight in the article's final version left intact certain information that pertains to Ommis, including mistakenly identifying Ralter as Rogue 4 and hailing from Coruscant."}, {"tag": "p", "text": "Original artwork created by Randy Martinez for the \"Rogue Leader Down!\" card from the 2015 Topps 2015 Topps Star Wars Illustrated: The Empire Strikes Back trading card set mistakenly identifies Kesin Ommis and Derek Klivian's Battle of Hoth call sign as Rogue 5. According to The Essential Guide to Warfare, Ommis and Klivian flew as Rogue Four during the battle, while pilots Tycho Celchu and Tarn Mison flew as Rogue Five."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}