{"url": "Kessel/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Galactic Empire planets", "Category:Kessel locations", "Category:Kessel sector planets", "Category:New Republic planets", "Category:Prison worlds", "Category:Sith planets", "Category:Slavery worlds", "Category:Spice producing worlds", "Category:Type III atmosphere planets", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Kessel"}, {"tag": "p", "text": "Kessel, originally known as Xo's Eye while under Xim's empire, was a planet located in the Kessel sector, in the Outer Rim Territories, near Hutt Space and the dangerous celestial bodies of the Maw. It was a prison world, and was home to the galaxy's largest glitterstim spice mining operation. Under Imperial rule, slave labor was in extensive use."}, {"tag": "p", "text": "The planet was close to Little Kessel and had a single moon, which was destroyed by Tol Sivron using the Death Star prototype."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The misshapen planet known as Kessel had a barren, rocky landscape. The atmosphere was very thin, with most of the air being provided by factories on the surface. Ancient tombs and ruins, possibly of Sith origin, dotted the landscape, haunted by skeletal avians. The prison had been established in these inhospitable settings. There was a single large settlement on the planet, Kessendra."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the time of Xim's empire, it was known as Xo's Eye. Kessel was the only source of glitterstim spice, a valuable drug used both therapeutically and recreationally. During the Galactic Republic's time, the prison was administered by the Colicoids."}, {"tag": "p", "text": "Sometime during the Galactic Civil War, Hawk Carrow and Nagraoao were prisoners in the Spice Mines of Kessel. Roark Garnet took his ship, the Dorion Discus, to the Kessel system to rescue his friends, but was stopped by a Star Destroyer for inspection. Garnet bribed the Navy officer to let him go."}, {"tag": "p", "text": "Later, the prison was controlled by Imperial Warden Commander Dewt Kluskine. Several prisoners rose to positions of power under him as trustees. The most powerful of these was Moruth Doole, who gained effective control of the spice trade by manipulating the Warden's accounts. Doole engineered the assassination of Kluskine by a Wookiee prisoner named Gyylghrard, and eventually seized control of the mines himself."}, {"tag": "p", "text": "The Galactic Republic administered programs to educate inmates on how to re-enter society upon release. Prior to the Clone Wars, Kassar Forge was one such teacher in this program. Even after the inmates took control of the planet, he voluntarily remained on the moon, eventually marrying Myda, one of the former inmates, and having multiple sons and daughters, including future Rogue Squadron pilots Lujayne and Inyri."}, {"tag": "h3", "text": "Imperial period"}, {"tag": "p", "text": "Shortly after the execution of Order 66, a small Jedi conclave was called in one of the abandoned mines of Kessel by Shadday Potkin in a futile attempt to lure Darth Vader into a deathtrap. The plan ultimately failed, and all the Jedi who attended were killed."}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Prior to the Battle of Yavin, the Rebel Alliance staged a bold raid there to rescue POWs from the spice mines."}, {"tag": "p", "text": "Tyber Zann was another prisoner here, but he escaped during a prison revolt he caused, thanks to his lieutenant Urai Fen."}, {"tag": "p", "text": "In 0 BBY, the Imperials kept several massive communication satellites in orbit to maintain control over the prisons, to permit passage through the system, and to coordinate ship landings. One of these satellites was guarded with a Victory-class Star Destroyer, two Acclamator-class assault ships, two Tartan-class patrol cruisers, and multiple squadrons of TIE fighters, TIE interceptors, and TIE/sa bombers, and a single squadron of elite TIE defenders."}, {"tag": "p", "text": "The Zann Consortium had an opportunity to corrupt this spice world by destroying a communications satellite with IG-88, two Crusader-class corvettes, two Vengeance-class frigates, and four full squadrons of StarViper-class starfighters."}, {"tag": "p", "text": "Admiral Ackbar almost became a new inmate at the prisons on Kessel after he was captured by Boba Fett and turned over to the Imperials. Over Kessel, however, the Star Destroyer that Ackbar was being held upon was intercepted by the elite Renegade Squadron, commanded by Han Solo and Col Serra. The squadron fought their way through TIE fighters and numerous stormtroopers aboard the Star Destroyer to rescue Ackbar, which they did successfully."}, {"tag": "p", "text": "During the Galactic Civil War, Wedge Antilles became a prisoner and slave at one of the Empire's Spice mines, after being captured near the Imperial Enclave on Kile II. He was scheduled for termination, and was being transported by train to a death camp, but the timely intervention of Luke Skywalker and Rogue Squadron allowed him to make a last-minute escape. The Rogues then joined with Rebel General Crix Madine and a task force of commandos, who used Antilles's knowledge of the prison camps to quickly rescue a large percentage of the slaves working for the Imperials."}, {"tag": "p", "text": "After the Empire lost the Battle of Endor, the Imperials on Kessel decided to abandon the planetoid. The atmosphere factories were shut off, although the prisoners at Detention Center A, Detention Center B, and Detention Center C were forced to keep working in the thinning air. Shortly after a liberation of the planet Kashyyyk, Han Solo, Chewbacca, Lando Calrissian and other Wookiee soldiers arrived on the planet and successfully re-powered three atmosphere factories, and in the process, freed many of the slaves."}, {"tag": "p", "text": "Kessendra was administered by Grand Moff Bertroff Hissa, and was known for its grandiose coliseum. After the Battle of Endor, Hissa set up the mutant Trioculus as the new Emperor, in opposition to Ysanne Isard on Coruscant. He was defeated by the unintentionally combined efforts of Isard and SPIN."}, {"tag": "p", "text": "Some time after the death of Trioculus, the staff of the Imperial Correctional Facility led by the prison's administrator, Moruth Doole, revolted against the Imperial garrison, overthrowing the guards and taking control of the planet, installing Arb Skynxnex as his number two. After the revolt, Doole discovered a dead rancor in the prison which obviously hadn't been fed. He regretted the death of the rancor as he planned to feed the Imperials to it. Instead, he sent them to the mines but tortured the former head of the prison and froze him in carbonite, displaying it in his office."}, {"tag": "p", "text": "The commissioner and his guards kept more than half of the planet under their control until 11 ABY. During this period, the planet was defended by squadrons of TIE fighters, X-wings, Y-wings, Lancer-class frigates, Carrack-class cruisers and various other craft. It was during this period that Han Solo, Chewbacca, and Kyp Durron escaped from the planet into the Maw. Eventually, Doole was was killed and the planet fell to the Smugglers' Alliance, led by Mara Jade, who later sold it to Lando Calrissian."}, {"tag": "h3", "text": "New Republic era"}, {"tag": "p", "text": "Under the New Republic, the planet had no slaves. A legitimate spice mining business was run by Nien Nunb, who was installed as administrator around 13 ABY by Calrissian. Mara Jade was also involved with running Calrissian's business, at least for a time. Calrissian made a substantial initial investment of new equipment and extensively revamped the facilities. Nunb also employed species that, like his own Sullustan race, preferred to be underground, such as craniopods, blind, sentient insectoids who thrived in the underground tunnels and had developed a community in abandoned glitterstim tunnels. The initial investment and Numb's deft administration resulted in happy workers, who proudly made the spice mines a profitable and productive industrial facility."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the planet was conquered by the invaders."}, {"tag": "p", "text": "Kessel was also rumored to be a chunk of rock from the Maw Installation before the Maw was created. No proof has been given to this connection."}, {"tag": "p", "text": "On recent expeditions of uncharted tunnels (due to quakes tearing the rock apart), Han and Leia had discovered a vast cavern the size of a city filled with fungi stalks, one- to two-meter-long centipedes, crimson-colored spiders that ate fungi and small avian creatures much like miniature Hawk-bats. This cavern also had gigantic blocks of manufactured equipment, and Leia later discovered the Bogeys would transfer data from these blocks to an unknown destination. Han and Leia believed that the machinery inside Kessel was created by the Celestials."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first appearance of Kessel in the draft scripts for A New Hope was as \"Kissel\" in George Lucas's notes accompanying the Journal of the Whills, Part I as a potential name for a planet. The \"Kessil system\" contained Utapau in the rough draft, which also mentioned a character named Grande Mouff Tarkin, who led the Kesselian Dragoons. Kessel was mentioned in Star Wars: Episode IV A New Hope. Protocol droid C-3PO feared for himself and his droid counterpart, astromech droid R2-D2, \"We'll be sent to space mines of Kessel.\" In the revised fourth draft of A New Hope, Han Solo first made a reference to the Kessel Run."}, {"tag": "p", "text": "Kessel, as depicted in The Second Kessel Run, was a lush, idyllic world containing the Giant Fungi Forest. According to The Essential Atlas, and confirmed by Jason Fry on the Jedi Council Forums, this depiction has been retconned into being Little Kessel, a world not far off the Kessel Run."}, {"tag": "p", "text": "In Star Wars Galaxies: Jump to Lightspeed and \"Star Wars Battlefront: Renegade Squadron\" Kessel is portrayed as a spherical planet, whereas other official sources portray it as a potato-shaped planet. In The New Essential Chronology, Kessel is mistakenly portrayed as a greenish-blue, lush-looking spherical planet."}, {"tag": "p", "text": "In-universe, Kessel is often likened to Hell (for example, the use of \"Kesseled\" as equivalent to \"damned\")."}, {"tag": "p", "text": "In the Fate of the Jedi novel Outcast, the Garrison Moon is mentioned as actually being present and used as a base of operations, despite being destroyed by the Death Star prototype years earlier."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}