{"url": "Anti-orbital_cannon", "categories": ["Category:Legends articles", "Category:Ground emplacements"], "nodes": [{"tag": "h1", "text": "Anti-orbital cannon"}, {"tag": "p", "text": "The Anti-orbital cannon was a weapon emplacement constructed by the Confederacy of Independent Systems that was used against orbiting starships, particularly capital ships. They saw use on the planet Geonosis at the beginning of the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Anti-orbital cannon was specifically designed in mind to target capital ships, as evidenced by their large size. They were constructed on a fixed platform and received its source of power from a network of four to six power generators. The generators, including the cannon itself, were not shielded. In the event the generators are destroyed, the cannon will explode."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At least three Anti-orbital cannons formed part of the line of defense prior to the Battle of Geonosis. Before republic forces could touch down into the geonosian arena, a Jedi strike team consisting of masters Mace Windu and Luminara Undili embarked on the surface, making use of fighter tanks to search for and destroy these emplacements."}, {"tag": "p", "text": "Upon the destruction of the cannons, the duo proceeded to secure a landing pad allowing clone forces to deploy a convoy of Republic Troop Transports carrying additional Jedi to the arena. After fighting their way through numerous patrols consisting of STAPs, tanks, hailfire droids, and spider droids, they eventually came across and eliminated a confederacy outpost situated behind the arena. The convoy then debarked a compliment of Jedi, in which they proceeded to infiltrate the perimeter in preparation for the imminent rescue of Obi-Wan Kenobi, Anakin Skywalker, and Padmé Amidala."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}