{"url": "Kessel_Run/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Outer Rim Territories hyperlanes"], "nodes": [{"tag": "h1", "text": "Kessel Run"}, {"tag": "p", "text": "The Kessel Run was a 20-parsec route used by smugglers to move glitterstim spice from Kessel to an area south of the Si'Klaata Cluster without getting caught by the Imperial ships that were guarding the movement of spice from Kessel's mines."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "It took travelers in realspace around The Maw leading them to an uninhabitable—but far easier to navigate—area of space called The Pit, which was an asteroid cluster encased in a nebula arm, making sensors as well as pilots go virtually blind. Thus there was a high chance that pilots, weary from the long flight through real space, would crash into an asteroid."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Kessel Run was one of the most heavily used smuggling routes in the Galactic Empire. Han Solo claimed that his Millennium Falcon \"made the Kessel Run in less than twelve parsecs\". A parsec is a unit of distance, not time. Solo was not referring directly to his ship's speed when he made this claim. Instead, he was referring to the shorter route he was able to travel by skirting the nearby Maw black hole cluster, thus making the run in under the standard distance. By moving closer to the black holes, Solo managed to cut the distance down to about 11.5 parsecs.[source?] The smuggler BoShek actually beat Solo's record in his ship, Infinity, but without cargo to weigh him down. A few months later, Han Solo beat both his own and BoShek's records in a run he made with Luke Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In A. C. Crispin's The Han Solo Trilogy, the Maw cluster of black holes distorts space and time, so the distance of the run is shortened by flying close to it. Han and Chewie make the time (and distance) while escaping from an Imperial customs ship."}, {"tag": "h3", "text": "Development"}, {"tag": "p", "text": "In the revised fourth draft of A New Hope in 1976, the description for \"Kessel Run\" is put as follows:"}, {"tag": "p", "text": "So it implies that the puzzling speech of Han Solo is \"misinformation\" and not truth, and it has nothing to do with the nature of the Kessel Run in any respect. Han means nothing other than impressing Obi-Wan and Luke with pure boasting. Indeed, even in the final version of the script, the parentheses attached to Han's line state that he is \"obviously lying.\""}, {"tag": "p", "text": "In the A New Hope novelization, Han says \"standard time units\" rather than \"parsecs.\""}, {"tag": "p", "text": "In the commentary for Star Wars: Episode IV A New Hope DVD, George Lucas mentions that the parsecs are due to the Millennium Falcon's advanced navigational computer rather than its engines, so the navicomputer would calculate much faster routes than other ships could. Similar info can be found in the notes Lucas recorded together with Carol Titelman in July/August 1977 to start a knowledge database for the planned sequels:"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}