{"url": "Kessurian", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Kessurians", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Kessurian"}, {"tag": "p", "text": "Kessurians were a sentient species. They had elongated ears and montrals, which increased their senses. Wilsa Teshlo was a Kessurian thilas, second in line to the throne, but refused to be trapped in the life of royalty, and fled to join the Veiled Sorority pirate gang. A dance troupe attended the Aki-Aki Festival of the Ancestors in 35 ABY."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Kessurians were a humanoid sentient species. They had typically red skin, elongated and pointed ears, and hornlike montrals above their ears. Their hair was typically brown. They also had rounded nubs above their eyes and below their montrals. The skin on their ears, montrals, cheeks and foreheads was mottled with lighter spots than the rest of their skin. Kessurians had four limbs, two arms and two legs, and five-fingered hands. The species had at least two sexes: male and female. Male Kessurians could grow facial hair. Some members of the species possessed Force sensitivity."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Kessurian species possessed a monarchy, with the second in line to the throne given the title of thilas."}, {"tag": "h2", "text": "Kessurians in the galaxy"}, {"tag": "p", "text": "Kessurian Jedi Master Estala Maru was a member of the Jedi Order during the High Republic Era, stationed on the space station Starlight Beacon."}, {"tag": "p", "text": "According to legend, a Force-sensitive Kessurian girl named Gee'far was kidnapped from an orphanage on Gaaten during the Imperial Era by the Grand Inquisitor."}, {"tag": "p", "text": "Sometime after the reign of the Galactic Empire, the thilas Wilsa Teshlo, feeling trapped by the life of royalty, ran away and became a member of the Veiled Sorority pirate gang. A Kessurian dance troupe was also present at the Aki-Aki Festival of the Ancestors on Pasaana in 35 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kessurians first appeared in the 2019 saga film Star Wars: Episode IX The Rise of Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}