{"url": "Keto", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Keto family", "Category:Males", "Category:Rulers of the Empress Teta system", "Category:Tetans"], "nodes": [{"tag": "h1", "text": "Keto"}, {"tag": "p", "text": "Lord Keto was a Human male, who was the ruler of the Empress Teta system with his sister Magda Keto in the years leading up to the Great Sith War. Keto had a son named Satal who, along with Magda's daughter Aleema, was the heir to the throne of the system. Keto shared his dominion over the system with the commercial interests that operated carbonite mines within the Empress Teta system, and he cut many back-room deals with the mining executives. Keto's indifference toward his heirs, however, drove them to form a darksider cult called the Krath. In 3997 BBY, Satal and Aleema decided to use dark side Sith magic to overthrow Lord Keto and his sister. The Krath struck while Keto and his sister were on an inspection tour on one of the orbiting Tetan carbonite smelters over the planet Empress Teta. While Keto ordered his Royal Protectors into action, they were decimated by Satal and Aleema's magic. With no one left to defend him, Keto was captured by the insurgent heirs and was frozen in carbonite along with his sister Magda, killing him. His carbon-frozen body was put on display as a decoration on the walls of the Iron Citadel, his old palace–turned–headquarters of Satal and Aleema in Empress Teta's capital city of Cinnagar."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male, Lord Keto, along with his sister Magda Keto, ruled the Empress Teta system in the years prior to the Great Sith War. The Ketos were the descendants of Empress Teta, the female warrior who unified the seven worlds of the then–Koros system nearly a thousand years prior. At some point, Keto had a son named Satal. Along with Magda Keto's daughter Aleema, Satal was the successor to the Tetan throne. By 3997 BBY, the Ketos were forced to share their power with the commercial interests that ran carbonite mining operations within the system, and they cut many back-room deals with the mining executives. That year, Lord Keto and his sister visited a Tetan carbonite smelter over the planet Empress Teta to make their annual inspection tour of the station. The two were greeted by Bearus, chairman of the system's Carbonite Guild. While the Ketos and Bearus exchanged pleasantries, they received word that a royal ship containing Satal and Aleema Keto, their tutor Korus, and four others had docked at the smelting plant. Keto and the others were very displeased with the arrival of Korus and the students, unaware of their intent for coming to the smelter. Satal and Aleema had become adepts in dark side Sith magic and, driven by Lord Keto's indifference toward them, formed a darksider organization called the Krath determined to take control of the Empress Teta system."}, {"tag": "p", "text": "Lord Keto and Bearus continued on with the inspection, and the Emperor was pleased with what he saw. During the inspection, Korus and his students, including Satal and Aleema, arrived at their location. Keto scolded Korus for bringing the students during a royal inspection, calling it an unforgivable breach of protocol, but Korus did not respond. Satal asked his father not to pick on Korus and instructed the tutor to open his mouth and reveal what Aleema had done to his tongue. Korus did so, showing that Aleema had used the dark side to turn his tongue into an Adegan eel. The Ketos were horrified, and Bearus moved to call for security. Aleema then turned the communications console into a womp rat. Lord Keto called for his Royal Protectors to arrest the young Tetan heirs, but Aleema responded by turning the guards' swords into snake-like monsters that strangled them. A terrified Lord Keto tried to calm the guards by telling them that the snakes were not real but to no avail. Now without any protection, Keto ordered his son to stand down, but Satal refused. Satal and Aleema informed the angered Keto that they had already legally taken control of the Empress Teta system. The heirs led the now–former rulers of the Tetan worlds to a vat of molten carbonite, and dipped both Lord Keto and Magda Keto in the container, freezing them in carbonite and killing them. Their coup successful, Satal and Aleema hung both Lord Keto and Magda Keto on the walls of their palace, the Iron Citadel, where the former rulers remained as decorations."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lord Keto was a man described as \"pompous and cold\" by his son Satal and referred to as a \"windbag\" by his niece Aleema. Keto held a measure of resentment toward his son and niece in return, thinking of them as spoiled. He was not above using ruthless tactics during his family's reign over the Empress Teta system, employing torture droids to keep control of the populace and forging back-room deals with the carbonite smelting companies that worked in the system. Keto was more concerned with his duties as ruler of the system than his duties as a father to his son Satal, which fostered anger and hatred within his child. He had the ability to act harshly when angered quickly, berating Korus for interrupting his royal inspection of the carbonite smelting plant. His anger devolved into fear when the Krath started using the dark side to attack his Royal Protectors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lord Keto first appeared in Star Wars: Tales of the Jedi - Dark Lords of the Sith, a story arc of the Star Wars: Tales of the Jedi comic book series written by Kevin J. Anderson and Tom Veitch that was released late 1994–early 1995. Keto made his first and only appearance in the arc's first issue, where he was killed; he was later mentioned in Dark Lords of the Sith's second and third issues. In his sole appearance in the arc he was illustrated by Christian Gossett. Keto also appeared in the Dark Lords of the Sith audio adaptation."}, {"tag": "p", "text": "In the Dark Lords of the Sith audio adaptation, Lord Keto's sister Magda is absent; therefore, Keto is presented as being the only member of the Tetan Monarchy at the inspection of the carbonite smelter, and Magda's lines in the comic are attributed to him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}