{"url": "Ketu", "categories": ["Category:Legends articles", "Category:Humans", "Category:Je'daii Temple Masters", "Category:Males", "Category:Tythans"], "nodes": [{"tag": "h1", "text": "Ketu"}, {"tag": "p", "text": "Ketu was a Human male Je'daii Temple Master who served the Je'daii Order on Tython at the height of the Infinite Empire's reign. He was considered to be one of the Order's most powerful and wise masters of the era, and served as the leader of the Je'daii Council. Residing at Akar Kesh, the Temple of Balance, Ketu was looked to in times of crisis, war, and peace, to lead the Je'daii through and keep the planet Tython in Balance with the Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The approaching storm"}, {"tag": "p", "text": "A Force-sensitive Human, Ketu was trained in the ways of the Force by the Je'daii Order on the planet Tython, one of nine planets in the Tython system which made up the Settled Worlds. Trained directly under Je'daii Master Rajivari, Ketu was appointed as a Je'daii Temple Master, the highest ranking members of the Order, in 25,805 BBY following the death of Master Telaat. Governing the Great Temple of Balance, Akar Kesh, Ketu carried no weapon and along with the other Temple Masters formed the Masters' Council, meeting via holocommunication within the massive Tho Yor at Akar Kesh. A teacher and adviser to Je'daii of all ages, Ketu resided within a chamber carved into the body of the great monolithic pillar which contained the Temple of Akar Kesh."}, {"tag": "p", "text": "When the Devourer, a starship of Rakatan design, crash landed on Tython in 25,793 BBY Master Ketu met with Je'daii Ranger Rori Fenn within his chambers to discuss the Force storm which gripped the planet. Unsettled by the wave of dark side energy which had tipped the scales of the Balance in the Force, and fearing that the ship might be but the first of an entire fleet, Ketu dispatched Fenn to the site near the Rift to determine the nature of the crash and search out survivors. Traveling up into the Tho Yor above Akar Kesh to meet via holocommunication with members of the Masters' Council, Ketu listened to a report from Temple Master Kora Ryo who believed the Force storm that had set over Tython was the worst since the arrival of the Tho Yor nearly ten thousand years prior. After listening to a report given remotely by Temple Master Quan-Jang, Ketu ordered the members of the Council to gather what Je'daii they could and enter into group meditation in order to dissipate the storm and return the Force to balance. Successfully ending the storm through their combined meditation, Ketu traveled to Mahara Kesh to meet with the Je'daii who had investigate the crash site and to meet their prisoner, the sole survivor of the vessel. Known as Xesh, the Human was steeped in the dark side of the Force and was far from balanced. Having conferred with the Council, Ketu banished Xesh to the moon of Bogan to meditate and reflect on the dark side until he found Balance. Despite the pleas of Je'daii Journeyers Tasha Ryo, Shae Koda, and Sek'nos Rath, Ketu's decision was made and Xesh was taken offworld."}, {"tag": "p", "text": "Seeking answers, Ketu journeyed out beyond the waterfalls of Akar Kesh in search of his former master, Rajivari. Finding him deep in meditation at the feet of an ancient and weathered statue, Ketu recounted the crash of the ship and the pleas of the Journeyers who claimed to have had a vision regarding Xesh's arrival. Rajivari rebuked his former student for dismissing their vision and exiling Xesh, claiming that the Council had made the same mistake seven years prior by exiling Daegen Lok and ignoring his own vision. Disagreeing with Rajivari, Ketu left on the paddle boat he had arrived on with more questions then answers. Following Xesh's disappearance from Bogan with fellow exile Daegen Lok, Ketu received Journeyer Tasha Ryo and Masters Rajivari and Ters Sendon in his private quarters. Ryo revealed to him an ancient holocron created by the Kwa race which had once maintained a colony on Tython in the distant past. According to the holocron's gatekeeper called A'nang, the Infinite Empire of the Rakata posed a terrible threat to any world that they encountered because they were vicious and warlike. Realizing that the vision of war Je'daii Lok had been exiled for years prior was coming true, Ketu demanded that Lok and Xesh be captured in anticipation of an invasion by the Rakata. If Xesh, the only survivor of the Rakatan ship which had crashed on Tython, knew anything, Ketu was determined to hear of it. Following the successful capture of both Xesh and Lok, Ketu began to oversee the Order's preparation for war. Asking Ranger Hawk Ryo to his chambers, Ketu inquired after further details of Lok's vision seven years prior. Ryo had been present for the vision and had in fact shared in it, but had lied about it and convinced himself that he had been hallucinating. In Lok's vision, the Je'daii saw himself leading an army to fight against the Rakatan invasion; but Ryo claimed Lok was wrong: Xesh was leading the Je'daii."}, {"tag": "h3", "text": "The Force Wars"}, {"tag": "p", "text": "When the Infinite Empire revealed itself, it launched a massive assault on the Tython system which saw the fall of many worlds. As they made their slow approach toward Tython, Master Ketu remained on Tython while Master Rajivari commanded Je'daii forces from Shikaakwa. Following the conclusion of the year-long conflict, Ketu met with the victorious Je'daii general Daegen Lok at the ruins of Anil Kesh, the site of the final victory against the Rakata. Ketu believed it was time to do away with the mysterious weapon known as the Forcesaber, but Lok disagreed and found that it would be useful in the coming years as things changed on Tython."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}