{"url": "Keyan_Farlander%27s_R2_unit", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:R2-series astromech droids", "Category:Red Squadron personnel", "Category:Unidentified astromech droids", "Category:Unidentified Rebel Alliance personnel"], "nodes": [{"tag": "h1", "text": "Keyan Farlander's R2 unit"}, {"tag": "p", "text": "Keyan Farlander's R2 unit was an astromech droid that worked with the Rebel pilot during his time serving on the Mon Calamari Star Cruiser Independence."}, {"tag": "p", "text": "The droid accompanied Farlander on his first mission after training, during which Rebel fighter pilots assisted in the capture of the Imperial corvette Talon. Rebel commandos who boarded the ship radioed the pilots for a spare R2 unit to access the corvette's computers. Farlander flew his X-wing starfighter into the Talon's airlock and was led through the ship by the droid, who actually saved Farlander by rendering an attacking Stormtrooper unconscious with an electrical shock. Once the pair reached the bridge, the R2 shut down any operating laser cannons and downloaded data from the ship's computer. After Farlander shot and killed an Imperial officer trying to destroy data disks, he and the R2 returned to their fighter and left the area with the rest of the Rebels."}, {"tag": "p", "text": "The droid continuted to fly with Farlander throughout his many starfighter missions. The droid would often meet the pilot in the hangar bay after the pilot returned from a mission flying a ship not requiring an astromech, such as an A-wing fighter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The unnamed droid could be seen during cutscenes before and after missions in Star Wars: X-Wing, and when a player changed to a rear-facing view while flying missions and occasionally can be heard at key points during the mission. The droid's role was expanded in the story of Farlander's first mission in The Farlander Papers, reprinted and slightly expanded in X-Wing: The Official Strategy Guide. The game allowed players to take part in the mission as part of a historical simulation which did not include the adventure inside the Talon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}