{"url": "Anti-trooper", "categories": ["Category:Legends articles", "Category:Clone trooper variants"], "nodes": [{"tag": "h1", "text": "Anti-trooper"}, {"tag": "p", "text": "Anti-troopers were clone troopers from the last production line based solely on the genetic template of Jango Fett. Their armor and weapons dated back to the time of the Grand Army of the Republic. As such, they were equipped with Phase I clone trooper armor and the standard-issue DC-15A blaster rifle. Trained as clone jet troopers, anti-troopers utilized jetpacks—granting them the advantage of height and speed in combat—in conjunction with their clone trooper armor."}, {"tag": "p", "text": "This new generation of Fett clones was brought online by a group of rebellious Clone Masters, who sought to liberate their home planet of Kamino from the rule of the Galactic Empire. As a result, none of the anti-troopers were loyal to Emperor Palpatine or his New Order—they answered only to their Kaminoan creators. Having discovered the rogue clone army's existence by 12 BBY, the Empire deployed a division of stormtroopers from the 501st Legion with orders to destroy the anti-troopers and regain control of Kamino."}, {"tag": "p", "text": "Composed of clone soldiers who once fought for the Galactic Republic, the 501st invaded Tipoca City where they were confronted by anti-troopers and a supplementary force of Rail-class Advanced Recon Commandos. Serving as the legion's mission commander was Boba Fett, a bounty hunter and unaltered clone whom the Empire hired to lead the attack on Kamino due to his past history with the planet and its capital city. Ultimately, the facility was lost to Imperial forces as the Clone War veterans annihilated the anti-troopers and ARC troopers, as well as their masters who attempted to retreat during the fall of Tipoca City."}, {"tag": "p", "text": "The creation of anti-Imperial clone troopers resulted in the reformation of the Imperial Military. Although the Empire continued to rely on Fett clones several years after Palpatine's accession, the Emperor concluded that a clone army based on a single template was too susceptible to tampering. Therefore, new clone stormtroopers were grown from different genetic templates. In time the Stormtrooper Corps opened its ranks to birth-born Humans who enlisted as recruits or conscripts. Whereas the military became increasingly diverse, only the 501st—the personal legion of the Sith Lord Darth Vader—was permitted to keep its ranks filled solely by Fett clones."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origin"}, {"tag": "p", "text": "In the final year of the Clone Wars, Prime Minister Lama Su of Kamino and Supreme Chancellor Palpatine of the Galactic Republic had a falling out; Kamino had been the prime source of the Republic army's clone troopers until the Chancellor commissioned new cloning facilities on Coruscant and Centax-2. Utilizing Spaarti technology, new generations of Fett would be fully developed within one year as opposed to ten years. Rather than use Kaminoan scientists to oversee the new cloning centers, the Chancellor entrusted the Spaarti-grown clones to Arkanian Microtechnologies. Unknown to Chancellor Palpatine, however, Lama Su did not hand over all of the clone troopers to the Republic."}, {"tag": "p", "text": "When the Clone Wars ended in 19 BBY, the Republic had been transformed into the Galactic Empire, the Jedi Order was betrayed and almost completely exterminated, and Chancellor Palpatine declared himself emperor of the galaxy. The Republic clone troopers, programmed with absolute loyalty to the Chancellor, were re-designated as Imperial stormtroopers. Soon afterward, Kamino found itself under the Empire's military occupation; the Kaminoans own creations had commandeered the cloning facilities to ensure that they continued to produce more clone stormtroopers for the Empire. Disillusioned with Palpatine and resentful of the Imperial presence on their world, a splinter faction of Kaminoan Clone Masters initiated a clandestine operation to build a new clone army—one loyal to Kamino instead of the Empire."}, {"tag": "p", "text": "Both intellectually advanced and speedily grown within the Tipoca City Cloning Facility, the Anti-Imperial clone troopers—otherwise known as Anti-troopers—were engineered over the span of nearly a decade through Kamino's state of the art cloning technology. Like the original clone troopers that served in the Clone Wars, the entire army of Anti-troopers were based on the genetic template of the late bounty hunter Jango Fett. The Kaminoan Clone Masters also secretly commissioned a special forces unit of Rail-class ARC troopers to compliment the Anti-troopers and add to the strength of Kamino's growing army of rebel Fett clones."}, {"tag": "p", "text": "To ensure that the Anti-troopers were superior to their older clone brothers, they were all trained as jet troopers and were provided with limited flight jetpacks in addition to their Phase I clone trooper armor. They were also trained to be both expert snipers and infantry soldiers, and were thus equipped with DC-15x sniper rifles and DC-15A blaster rifles, both of which were used by the original clone troopers during the Clone Wars."}, {"tag": "p", "text": "After nearly ten years of Imperial occupation, Kamino's new clone army had reached the completion of its development and were ready to launch their \"Clone Rebellion\" in order to liberate Kamino from the Galactic Empire. Their full allegiance belonged to their Kaminoan creators, and thus they were perfectly willing to fight the Empire and kill their Imperial brethren. When the Empire discovered the Kaminoans' plot in 12 BBY, the 501st Legion was ordered to bring Kamino back into the Imperial fold by annihilating its rebel clone army. Leading the 501st was the bounty hunter Boba Fett, the only unique clone of Jango Fett."}, {"tag": "h3", "text": "The Battle of Kamino"}, {"tag": "p", "text": "The Kamino uprising commenced with Boba Fett leading the stormtroopers of the 501st Legion in an effort to infiltrate Tipoca City. Their first objective was to secure a canister that contained Jango Fett's genetic material, mainly to ensure that it was not damaged or lost during the battle. The Anti-troopers immediately engaged their Imperial brothers in combat, and though they were willing to fight to the death, they ultimately failed to prevent Fett and the 501st from getting inside of the cloning facility."}, {"tag": "p", "text": "With Jango Fett's DNA secured, Boba Fett immediately returned to a secured platform where an Imperial shuttle transported the canister off-planet, thus ensuring that the Empire would have the resource required to engineer more Fett clones in the future. Meanwhile, the Anti-troopers continued to engage the 501st Legion on the city's numerous platforms. But, unable to gain an advantage or turn the tide of battle, they steadily lost more and more ground to the relentless push of the 501st stormtroopers."}, {"tag": "p", "text": "After securing more ground on the platforms, the 501st proceeded to infiltrate the inner workings of the cloning facility with the objective of destroying the life-support system consoles that kept undeveloped rebel clones alive, thus preventing the Kaminoan rebels from cloning more Anti-troopers. Along the way, however, the Rail-class ARC troopers emerged and began attacking the 501st. But despite their best efforts, the 501st was still able to enter the city and destroy the life-support systems and abort the developing rebel clones."}, {"tag": "p", "text": "With the battle lost and their homeworld on the verge of falling completely under the Empire's control, the Kaminoan Clone Masters attempted to retreat by utilizing a pair of LAAT gunships to evacuate Tipoca City. The last of the Rail-class ARC troopers joined with the remaining Anti-troopers outside of the city. Together, they made their last stand on Tipoca City's platforms in a fight to death in order to buy their creators enough time to escape. Their sacrifice was ultimately in vain, however, and the 501st was able to destroy the gunships before they took off, and thus they killed the Kaminoans who created the rebel clone army. The end of the Clone Rebellion saw every last Anti-trooper and Rail-class ARC trooper massacred down to the last clone. Tipoca City, every other Kaminoan cloning facility, and all of Kamino and its people became fully subjugated to the Galactic Empire."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "The failure of the Anti-troopers had severe consequences not only for Kamino, but also ironically the Imperial clones of Jango Fett as well. With Kamino under full Imperial rule, the Kaminoan race was forced to continue its service to the Empire by engineering countless clone stormtroopers. In addition to the Kaminoan scientists, Imperial Human scientists were brought in to oversee the growth of Imperial clone soldiers as well."}, {"tag": "p", "text": "Although the 501st Legion proved its loyalty to the Empire once more by killing their rebel clone brothers in order to put down the Kaminoan rebellion, Emperor Palpatine ultimately decided that the ranks of the Stormtrooper Corps could no longer be the exclusive province of Jango Fett's progeny. Even though enlisted personnel had long since become part of the overall Imperial Military, including the Army and Navy, the Fett clones took pride in the fact that they alone served as the Emperor's stormtroopers, just as they had done so for the Republic as clone troopers. The thought of serving alongside clones that were based on different templates, or even enlisted stormtroopers, was appalling to the proud clones of Jango Fett."}, {"tag": "p", "text": "Nevertheless, their programmed loyalty to the Emperor prevented them from displaying their dismay in any way, thus forcing them to watch as the Stormtrooper Corps became increasingly diverse. Ultimately, Fett's clones were reduced to the status of a small minority and became lost in a sea of non-Fett clones and enlisted soldiers. While the 501st Legion remained pure of outsiders for a time, none of Jango Fett's clones ever became used to the idea of fighting alongside the soldiers they mockingly dubbed as \"the new guys.\""}, {"tag": "p", "text": "Roughly a decade later, the resentment only grew worse, especially for the few remaining veterans of the Clone Wars. By the year 2 BBY, Commander Cody was in charge of the Imperial garrison of Kamino, most of which was composed of enlisted troopers. Having watched the obvious decline in the Imperial Army's operational effectiveness ever since the Empire increased its pool of stormtrooper recruits, Cody developed an intense hatred for all stormtroopers that were not clones of Jango Fett. He regarded them as expendable idiots with no sense of themselves or their surroundings, and would have happily traded them all for just one real clone trooper."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the Anti troopers wear Phase I clone trooper armor in Star Wars: Battlefront II, two troopers seated in the turrets of the LAAT gunships on the \"Kamino Uprising\" level are wearing Phase II clone trooper armor. After the battle's conclusion, the retired clone trooper stated that Boba Fett left Kamino, mentioning that he was going to Tatooine to track down a smuggler, obviously referring to Han Solo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}