{"url": "Khaat_Qiyn/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Humans", "Category:Jedi Consulars", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Khaat Qiyn"}, {"tag": "p", "text": "Khaat Qiyn was a female Human Jedi Knight serving the Jedi Order and the Galactic Republic during the waning years of the Republic Classic era."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Like most Jedi of the era, Khaat Qiyn was identified near birth as Force-sensitive and sent to the Coruscant Jedi Temple for induction within the Jedi Order. Trained at the academy there, Qiyn went on to be selected as a Padawan by a Jedi Master. Trained in the fifth form of lightsaber combat, Qiyn was one of many students to master the form. After years of study and crafting a blue-bladed lightsaber, Qiyn passed her Trials of Knighthood and was made a Jedi Knight by the Jedi High Council. Continuing her studies independently, Qiyn selected to walk the path of the Jedi Consular, excelling as a Diplomat for the Council of Reconciliation."}, {"tag": "p", "text": "While traveling the galaxy on behalf of the Order Qiyn selected the Human Bairdon Jace as her Padawan. During the height of the Separatist Crisis, Jedi Qiyn and Padawan Jace were stationed outside the Galactic Senate Rotunda on the evening of the vote on the Military Creation Act. After an affirmative vote, both Qiyn and Jace joined Master of the Order Mace Windu's massive strike team in flying to the world of Geonosis to rescue capture Jedi Obi-Wan Kenobi, Anakin Skywalker, and Senator Padmé Amidala. Storming the Petranaki arena, Qiyn and Jace fought valiantly against the droid army of the Confederacy of Independent Systems; Qiyn employed her mastery of Form V to decimate her opponents."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Khaat Qiyn was a renowned practitioner of the fifth form of lightsaber combat, wielding it skillfully against the battle droids of the Techno Union during the Battle of Geonosis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Khaat Qiyn was portrayed by Zuraya Hamilton, who also portrayed Senator Onaconda Farr.[source?]"}, {"tag": "p", "text": "Although her death in the Battle of Geonosis was never officially confirmed, Holocron Keeper Leland Chee, in a 2005 Star Wars: Blogs post, listed her among Jedi who fought in the battle whose fates were unknown but who likely died."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}