{"url": "Khai_family", "categories": ["Category:Legends articles", "Category:Families", "Category:Force-sensitive bloodlines"], "nodes": [{"tag": "h1", "text": "Khai family"}, {"tag": "p", "text": "The Khai family were Human members of the Lost Tribe of Sith on the planet of Kesh, and descendants of the survivors of the crash-landing of Omen on the planet around 5000 BBY. The wealthy family included at least three generations of Sith, including Thallis Khai, his son, Gavar Khai, and Gavar's daughter, Vestara Khai. However, Gavar's wife, Lahka Khai, was not Force-sensitive."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The male Human Thallis Khai was a member of the Lost Tribe of Sith on the planet Kesh. He, along with the rest of the Tribe, was descended from the survivors of the crash of the Sith starship Omen on the planet in 5000 BBY."}, {"tag": "p", "text": "Thallis had at least one son, a Sith Saber named Gavar Khai. Gavar married a non-Force-sensitive woman, Lahka Khai, with whom he had one daughter in 27.5 ABY. Their daughter, Vestara Khai, became the apprentice of Lady Olaris Rhea, after being the first being on Kesh to whom Ship, a Sith Meditation Sphere, spoke. She went on to serve in the Tribe's Sith armada, and was the sole survivor of the strike team that was sent to ambush Jedi Grand Master Luke Skywalker in 43 ABY. In 44 ABY, both Gavar and Vestara Khai took part in a tenuous alliance that the Tribe formed with the Skywalkers for a mission to defeat the dark side entity Abeloth."}, {"tag": "p", "text": "The mission was unsuccessful, as Abeloth escaped. Vestara Khai continued to travel with the Skywalkers as they hunted Abeloth down, and her father eventually rose to a higher ranking in the Sith armada, commanding his own flagship. Abeloth soon formed an alliance with Gavar and the Sith on Kesh, only to betray them and destroy their capital city, Tahv. Lahka Khai was among the casualties, but Gavar had fallen under Abeloth's influence, and he joined her forces. Abeloth sent Gavar and several other Sith Sabers to ambush the Skywalkers, and they confronted the Jedi on the planet Dromund Kaas. Vestara remained aligned with the Jedi for the duel, and she engaged her father in lightsaber combat. She ultimately defeated and killed him, resulting in her decision to become a Jedi and began a relation with the Jedi Knight Ben Skywalker."}, {"tag": "h2", "text": "Family tree"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}