{"url": "Khamdek", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Crime lords", "Category:Humans", "Category:Males", "Category:Mourner's Wail Syndicate"], "nodes": [{"tag": "h1", "text": "Khamdek"}, {"tag": "p", "text": "Lord Khamdek was a human male crime lord who led the Mourner's Wail Syndicate during the Imperial Era. He was the father of Khamus, the heir to the syndicate, who was killed by the Nautolan bounty hunter Nakano Lash during a mission. Around the year 3 ABY, another bounty hunter named T'onga infiltrated the Mourner's Wail's fortress in order to find information on Lash, who resurfaced under mysterious circumstances. Khamdek caught T'onga, believing she was an assassin, but the bounty hunter explained her situation, asking for all of the syndicate's reported sightings of Lash and pledging to kill the Nautolan for him."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Khamus's murder"}, {"tag": "p", "text": "Lord Khamdek led the Mourner's Wail Syndicate during the Imperial Era. The syndicate, which was based at the Fortress of the Mourner's Wail on the terrestrial world Dotharian, had been at war for a century with a rival group named the Unbroken Clan. Sometime prior to the year 3 ABY, Khamus, Khamdek's son and the only heir to the syndicate, hired a five bounty hunters to attack the Unbroken Clan, which at that time had a truce with the Mourner's Wail Syndicate, at their sanctuary on the planet Corellia. However, one of the bounty hunters, the Nautolan Nakano Lash, betrayed and killed Khamus, compromising the mission."}, {"tag": "p", "text": "Lash, who now had a bounty on her, went into hiding and the Unbroken Clan went to war with the Mourner's Wail Syndicate after. Khamdek felt that Khamus's loss was more damaging than the syndicate's century long war with the Unbroken Clan and suspected the rival organization of working with Lash. Sometime around 3 ABY, Lash was sighted near the planet Kessel, which prompted many bounty hunters to go searching for her. Khamdek's spies then informed him that Lash had made contact with the Unbroken Clan, increasing his suspicions that the two parties had conspired to kill Khamus."}, {"tag": "h3", "text": "T'onga's pledge"}, {"tag": "p", "text": "Around a week after Lash's sighting, the bounty hunter T'onga infiltrated the Fortress of the Mourner's Wail, killing a number of guards and distracting others. Khamdek, though, confronted her, backed by more guards. Impressed that she had made it deep into the fortress, he allowed her a few moments to live, asking whether she was an assassin there to kill him. T'onga claimed she was there about Lash, pledging to kill the Nautolan for Khamdek. Khamdek expressed his disgust of hearing Lash's name and voiced the damage she had done to him by killing Khamus."}, {"tag": "p", "text": "Khamdek asked T'onga why she was any different to the many bounty hunters hunting for Lash. T'onga told him she wanted information on Lash to find out why the Nautolan had resurfaced. Khamdek brought up Lash's contact with the Unbroken Clan, suggesting that they were working together to T'onga. She then requested his files of reported sightings of Lash, promising to find Lash and avenge Khamus and her brother T'ongor, who she believed Lash had killed too."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Khamdek was a human male with blonde hair and light skin. After Nakano Lash killed his son Khamus, he felt the loss more than the damage done by the Unbroken Clan in a century long war. Lash's name came to disgust Khamdek upon being said, and he further suspected that she had conspired with the Unbroken Clan, further believing this when learning that the two parties had made contact."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Khamdek wore golden colored armor with black under clothing and a purple cape."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Khamdek was first mentioned in Bounty Hunters 1, a comic written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on March 11, 2020. Khamdek first appeared and, was subsequently identified, in the following issue, Bounty Hunters 2, which was published on March 25, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}