{"url": "Khar_Delba", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Darth Krayt's Galactic Empire planets", "Category:Ice planets", "Category:Khar Delba locations", "Category:Sith Empire planets", "Category:Sith Worlds"], "nodes": [{"tag": "h1", "text": "Khar Delba"}, {"tag": "p", "text": "Khar Delba was an icy, snowy planet in the Sith Worlds, which was part of the Sith Empire as of 5000 BBY. Khar Delba had one moon, Khar Shian, and was located at the edge of Sith Space. It was the home to the Sith war behemoth. Naga Sadow placed a citadel there, but unbeknownst to the rest of the Sith at large, Sadow's Khar Delba citadel was a mere decoy; his real base was on Khar Shian. In 5000 BBY, with Naga Sadow in the midst of a power struggle with his rival, Ludo Kressh, Khar Delba was attacked from orbit by forces loyal to Kressh. Although the citadel was badly damaged in Kressh's orbital bombardment of the planet, Sadow emerged victorious after calling in his secret fleet from the far side of Khar Shian to counterattack Kressh. In the following months, Khar Delba was rebuilt and was established as the center of Naga Sadow's power as he gathered a force to invade the Galactic Republic, in a conflict that became known as the Great Hyperspace War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Khar Delba was located in the region of the Outer Rim Territories known as the Sith Worlds. The planet was located on the outer edge of Sith Space, which was encircled by a large nebula called the Stygian Caldera which helped to conceal the area from outsiders. Khar Delba, along with Ziost, Rhelg, Krayiss Two, and Korriban, was one of the five sacred Sith planets linked by the looping Nache Bhelfia hyperlane. In addition to this, Khar Delba was located at the endpoint of the Kamat Aegit hyperlane, which stretched to Begeren in the interior of Sith Space."}, {"tag": "p", "text": "Khar Delba resembled an asteroid from space and had a very rocky surface, with many mountains and craters. The planet was perpetually covered in snow and ice. Khar Delba had one moon, Khar Shian. One of the native species of Khar Delba was the fearsome Sith war behemoth, which were originally peaceful herd creatures that were transformed into vicious war beasts through Sith alchemy. The planet was also the homeworld of the Sith warbird, a species of large, flightless bird that was used by the Sith as an artillery mount, and the creatures originated within Khar Delba's frigid mountains."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet Khar Delba was originally part of the pre-Republic Sith Empire ruled by King Adas. The planet, along with the rest of Sith Space, fell under the sway of 12 powerful Dark Jedi—notably including XoXaan and Sorzus Syn—who had tracked down rumors of the Sith Empire after fleeing the Galactic Republic after their defeat in the Hundred-Year Darkness in 6900 BBY. By 5000 BBY, Khar Delba came into the possession of Dark Lord of the Sith claimant Naga Sadow, who used the planet as a base and established a large decoy fortress there, with his real citadel located on Khar Shian."}, {"tag": "p", "text": "In 5000 BBY, two hyperspace explorers from the Republic, Gav and Jori Daragon, arrived in Sith Space, sending the Sith Empire into a frenzy. The two were imprisoned on Ziost, and seeing a opportunity to take the title of Dark Lord of the Sith, Sadow launched an attack on their cell at the Sith Citadel and kidnapped them. Sadow brought them to his fortress on Khar Delba while he returned to Ziost, where he proclaimed himself Dark Lord. Sadow then split the siblings up, keeping Jori at Khar Delba while sending Gav to his secret fortress on Khar Shian."}, {"tag": "p", "text": "Soon, however, Sadow's rival Ludo Kressh, along with two of his Sith Lord allies, Horak-mul and Dor Gal-ram, gathered a fleet with the intention of attacking Sadow's decoy fortress on Khar Delba. Kressh's force commenced an orbital bombardment of Sadow's fortress, but Sadow had a plan. Sadow ordered his Massassi warriors to man the defense turrets of his fortress. While Kressh was distracted with the fortress, Sadow called his secret fleet in from the far side of Khar Shian, which struck at Kressh's flank. In addition, Sadow commanded the subordinates of Horak-mul and Dor Gal-ram, who were actually double agents, to betray and murder their masters. This tactic worked to perfection, and the two Sith Lords were killed; Kressh found himself with no backup and fled. The Battle of Khar Delba had been won by Sadow. In the midst of the battle, Sadow allowed Jori Daragon to slip away in her ship, the Starbreaker 12, and return to Republic space. However, Sadow placed a tracking device on the ship's hull, which later led Sadow to the Republic to fulfill his expansionist ambitions. On Khar Delba, Sadow slowly rebuilt his fortress, while using the planet as a base to gather his invasion fleet."}, {"tag": "p", "text": "In the ensuing months, Sadow put together a fleet with which he planned to invade and conquer the Galactic Republic. At a meeting on Khar Delba, where he finally announced that his forces were ready to move out, Sadow received unexpected news; Ludo Kressh had returned to Khar Delba. Kressh's lone flagship had arrived in the planet's atmosphere, and after Kressh transmitted a message denouncing Sadow, Sadow ordered Gav Daragon, now his Sith apprentice, to activate the controls to block the transmission. Unbeknownst to Daragon, however, Sadow tricked him into pressing a button that destroyed the ship, seemingly killing Kressh. Although Daragon was enraged by this deception, Sadow convinced him it was necessary. The Sith fleet was soon completed and ready for battle, and Sadow set out to conquer the Republic. However, Sadow's Sith were eventually defeated in the ensuing Great Hyperspace War, and Sadow was forced to fake his death and flee to the faraway moon of Yavin 4. After the end of the war, Khar Delba was largely stripped of its Sith treasures by Republic scouts."}, {"tag": "p", "text": "Following the defeat of the Sith Empire, the Sith all but disappeared from Sith Space and the galaxy as a whole. Sith Space was conquered by the Mandalorian Neo-Crusaders in the Mandalorian Wars, and later by Dark Lord of the Sith and former Jedi Knight Revan in the Jedi Civil War. Around 3638 BBY, the Sith Lord Darth Marr of the reconstituted Sith Empire departed the planet Makeb in order to rendevzous with a fleet above Khar Delba, as the Empire was engaged in the Galactic War with the Republic. The region around Khar Delba eventually fell into the control of the Brotherhood of Darkness, a Sith group that launched a campaign to control the galaxy, during the New Sith Wars. It was left largely untouched by the rise of the Galactic Empire and the Galactic Civil War, but the area containing Sith Space came to fall into the hands of Warlord Zsinj by around 7 ABY. More than a hundred years later, the area around Khar Delba fell under the control of Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Khar Delba was solely inhabited by Naga Sadow and his servants, many of whom were members of the Sith's Massassi warrior class. Sadow ostensibly resided on Khar Delba exclusively, but secretly held his other fortress on Khar Shian. Jori Daragon also resided on the planet for a short time, living in the guest area of the fortress. The building also contained a large amount of Massassi warriors. Although the planet and Sith Space as a whole were originally inhabited by the Sith, they all but disappeared from the area after the events of 5000 BBY."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "A barren, unremarkable planet, Khar Delba contained Naga Sadow's citadel, which served as a decoy for the Sith Lord, to draw attention while Sadow ran his operations from Khar Delba's moon, Khar Shian. The citadel was badly damaged due to Ludo Kressh's bombardment of the planet in the Battle of Khar Delba; but Sadow rebuilt it and, from there, put together a fleet that went on to attack the Republic in the Great Hyperspace War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Khar Delba first appeared in Star Wars: Tales of the Jedi — The Golden Age of the Sith, a story arc of the Tales of the Jedi comic book series, written by Kevin J. Anderson and released in 1996. The planet is featured in the arc's third, fourth, and fifth issues. Khar Delba also appears in the follow-up arc, Star Wars: Tales of the Jedi — The Fall of the Sith Empire, in the arc's first issue, Desperate Measures. In these appearances, the planet was drawn by Dario Carrasco, Jr. In addition, Khar Delba is mentioned in several reference books, including Jedi vs. Sith: The Essential Guide to the Force in 2007 and The Essential Atlas in 2009."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}