{"url": "Khar_Shian", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Esstran sector moons", "Category:Ice moons", "Category:Rocky moons"], "nodes": [{"tag": "h1", "text": "Khar Shian"}, {"tag": "p", "text": "Khar Shian was the only moon of Khar Delba, a planet located in the Sith Worlds area of the Outer Rim Territories. An icy, barren moon, Khar Shian was the site of Dark Lord of the Sith Naga Sadow's center of power as well as his palace, while his decoy stronghold was located on Khar Delba. Sadow hid his fortress on the far side of the moon; as the moon never saw sunlight, it was an ideal place for the fortress to be concealed. Sadow also hid his massive war fleet in orbit around the far side."}, {"tag": "p", "text": "In 5000 BBY, Khar Delba was attacked by Sadow's rival, Ludo Kressh, and Sadow's citadel on Khar Delba was bombarded from orbit. Sadow had a plan, however; he called his Khar Shian fleet into action, striking at Kressh's flank. This maneuver, along with several other deceptions enacted by Sadow, resulted in a victory for the Dark Lord in the battle of Khar Delba. Afterward, Khar Shian and Khar Delba became the centers of Sith militarization in preparation for an invasion of the Galactic Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Khar Shian was the sole moon of the planet Khar Delba, which was located in the Sith Worlds area of the Outer Rim Territories. Khar Shian was tidally locked to Khar Delba, as the far side of the moon never received sunlight. The moon was pockmarked with craters and was perpetually covered in snow and ice."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "As of 5000 BBY, Khar Delba was the purported headquarters of the Dark Lord of the Sith Naga Sadow and also served as the location Naga Sadow's Khar Delba citadel. Yet, unbeknownst to the rest of the Sith Empire, that fortress was a mere decoy, with Sadow's actual base and defenses on the far side of Khar Shian. That same year, Naga Sadow, who by that time was viceroy of Khar Shian, used the moon as a staging point for an attack on the planet Ziost that was intended to free hyperspace explorers Gav and Jori Daragon, who had recently stumbled upon the Empire while fleeing creditors on Koros Major. The attack, which was meant to appear as a Galactic Republic assault, was a success. The Daragons were then promptly split up, with Gav Daragon being taken to Khar Shian."}, {"tag": "p", "text": "Gav Daragon was kept in a Sadow's secret fortress on Khar Shian from then on, and Naga Sadow mentored and taught him to realize his latent Force-sensitivity. Sadow showed Daragon techniques of the dark side of the Force, and Daragon eventually became Sadow's Sith apprentice. One day, Sadow received word that his rival, Sith Lord Ludo Kressh, had gone to Ziost to protect the Daragons' starship, Starbreaker 12. Sadow ordered his Massassi underlings to go to Ziost and attack Kressh's defenders, while Sadow took leave from Khar Shian shortly thereafter. The attack was soon carried out, and Sadow's Massassi warriors stole the Starbreaker 12 and brought it to the decoy fortress on Ziost. However, Kressh discovered that Sadow was behind the attack and gathered his allies to attack his rival. In the ensuing battle, Kressh's newfound force bombarded Naga Sadow's citadel on Khar Delba from orbit. Little did Kressh know, however, that Sadow's real fleet was at Khar Shian."}, {"tag": "p", "text": "Sadow put up little resistance from Khar Delba, drawing Kressh into a false sense of security and tricking him into believing that victory was inevitable. Then, Sadow sprung his trap. He called in his secret fleet from Khar Shian, which struck at Kressh's flank. This move, coupled with Sadow's replacing of Kressh's crews with double agents that subsequently killed Kressh's allies, ensured Kressh's defeat. Finding himself with no hope for victory, Kressh fled. With nothing standing in his way, Naga Sadow began preparations for an invasion of the Galactic Republic, gathering the remainder of his fleet from all corners of the Sith Empire. Sadow based his increasing militarization around Khar Delba and Khar Shian. Eventually, Sadow's fleet was completed, and his invasion force gathered at the staging point near Khar Shian. From there, Sadow launched the galaxy-spanning Great Hyperspace War. However, Sadow and the Sith were eventually defeated by the forces of the Republic. After the end of the war, Khar Shian was largely stripped of its Sith treasures by Republic scouts."}, {"tag": "p", "text": "By 4 ABY, Khar Shian had become the site of a major Galactic Empire shipyard, in the midst of the Galactic Civil War with the Alliance to Restore the Republic."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Khar Shian was solely inhabited by Naga Sadow and his Sith subordinates, many of whom were Massassi warriors. However, Gav Daragon was kept on the moon for a time."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "A barren, unremarkable moon, Khar Shian's only feature was Naga Sadow's palace and citadel, hidden from the public on the dark, far side of Khar Shian. Naga Sadow used his Khar Shian fortress as his true center of power, all the while maintaining the facade of another citadel on Khar Delba. Higher up above the moon, Sadow's war fleet stayed in orbit around the far side of the Khar Shian."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Khar Shian first appears in Star Wars: Tales of the Jedi — The Golden Age of the Sith, a story arc of the Star Wars: Tales of the Jedi comic book series, written by Kevin J. Anderson and released in 1996. The moon appears in the arc's third, fourth, and fifth issues. It also appears in Tales of the Jedi: The Fall of the Sith Empire, the follow-up arc to The Golden Age of the Sith, in which it is featured in the first issue, Desperate Measures, and the second issue, Forces in Collision. In these appearances, the moon was illustrated by Dario Carrasco, Jr. In 2007, Khar Shian was mentioned in Ryder Windham's reference book Jedi vs. Sith: The Essential Guide to the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}