{"url": "Kharys%27_fortress", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Fortresses", "Category:S'kytri culture", "Category:Skye locations"], "nodes": [{"tag": "h1", "text": "Kharys' fortress"}, {"tag": "p", "text": "A fortress was built by the genetics terrorist Zeta Magnus atop the Canaitith Mountain, the highest peak on the planet Skye. Although Magnus was defeated by Obi-Wan Kenobi and his pupils Anakin Skywalker and Halagad Ventor in 22 BBY, his fortress was later reused by Kharys when she became the Majestrix of Skye with the Galactic Empire's blessing."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 22 BBY, the first year of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, a clone of the genetic abomination known as Zeta Magnus took control of the planet Skye. Using a mutagen, he transformed a third of Skye's natives, the S'kytri, and made them his zombie-like servants. Magnus subsequently ordered them to build him fortress-keep atop Canaitith Mountain, the highest peak on the planet, where he would rule as the self-styled Magister of Skye. However, the Republic dispatched Obi-Wan Kenobi, Anakin Skywalker and Halagad Ventor, three members of the Jedi Order, to intervene. The Jedi manged to infiltrate the fortress, and the clone of Magnus was eventually killed by Ventor."}, {"tag": "p", "text": "After the end of the Clone Wars, the Republic was replaced by an authoritarian Galactic Empire. At some point during the Imperial period, Anakin Skywalker, now a malevolent Dark Lord of the Sith known as Darth Vader, came back to Skye. He taught the ways of the dark side to Kharys, a female S'kytri who had once helped him during the conflict with Magnus. By 0 ABY, the Empire bestowed the title of Majestrix to Kharys, who had claimed ownership of Magnus' old fortress. The Majestrix, however, was killed in an aerial duel with Luke Skywalker that took place above that citadel."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The fortress-keep of Zeta Magnus stood atop Canaitith Mountain, and its foundation blended into the rock of the mountain itself. Built entirely from living bloodstone, the fortress was a mishmash of architectural styles. Its rectangular main section was buttressed by two towers built in the style of the Serennese aristocracy. A third tower, half again as tall as the others, rose from the primary section. Each tower was crowned by an organic-looking minaret similar to the hive spires of Geonosis. Together, the three towers seemed to emulate an irreverent finger gesture of Korunnai origin. Every side of the structure featured gaudy and impractical windows in the modern Onderonian style. The greatest of those windows ornamented the front and back of the middle section, giving it the shape of a double-ended dagger."}, {"tag": "p", "text": "In contrast to its outer appearance, the inside of the fortress was very austere, with most rooms and halls coated in reflective yet cold ultrachrome. Nonetheless, the citadel housed a laboratory built to look like a dungeon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}