{"url": "Kharrus/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Galactic Republic senators", "Category:Gran", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kharrus"}, {"tag": "p", "text": "Kharrus was a respected Gran male senator during the Clone Wars, representing his homeworld of Kinyen in the Senate of the Galactic Republic. A loyal supporter of Supreme Chancellor Palpatine, Kharrus became a highly skilled diplomat and embarked on a number of missions on the Republic's behalf, often operating under perilous circumstances. At one point, he spent three weeks in captivity while on a ransom mission."}, {"tag": "p", "text": "In 22 BBY, Kharrus was tasked with delivering one million credits' worth of spice to Florrum, where the Ohnaka Gang of Weequay pirates was holding the Confederate Head of State Count Dooku hostage. Accompanied by a clone trooper detail led by Clone Commander CC-5869 of the Diplomatic Escort Group, Kharrus was to deliver the spice ransom and bring Dooku back to the Republic capital of Coruscant for incarceration. On their approach to Florrum, Kharrus's shuttle was shot down by the pirate lieutenant Turk Falso's breakaway faction of the Ohnaka Gang, which sought to pilfer the payment of spice. Kharrus died in the resulting crash, leaving his team under the command of its junior representative, Jar Jar Binks. Binks saw to it that the esteemed senator was buried and laid to rest near their crash site in the Doshar fields. Kharrus's death sparked a political crisis that isolated Kinyen from the Republic and eventually led it to become a Separatist staging area."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Senator of Kinyen"}, {"tag": "p", "text": "The Gran male Kharrus lived during the final decades of the Galactic Republic, hailing from Kinyen, his species' homeworld. He embarked into the realm of politics and eventually entered the Galactic Senate, which was based on the galactic capital of Coruscant. As the senator of Kinyen, Kharrus was beloved by his people. He became loyal to Supreme Chancellor Palpatine and, throughout his career, undertook numerous assignments as a Republic diplomat. While on a ransom mission, he was captured and imprisoned in a dungeon for three weeks, a debacle that he never forgot."}, {"tag": "p", "text": "By the time of the Clone Wars, in which the Republic was locked in pan-galactic conflict with the Confederacy of Independent Systems, Kharrus earned veteran status for his diplomatic service in frequently dangerous conditions, being recognized for his lengthy senatorial career. In 22 BBY, the war's first year, Kharrus was on Coruscant when the Republic mounted an operation to save Rotta, the son of the Hutt crime lord Jabba Desilijic Tiure. By doing so, Palpatine hoped to gain favor with Jabba to negotiate for Grand Army of the Republic access to the strategic hyperlanes running through Hutt Space, which the Confederacy also coveted. Kharrus and Senator Onaconda Farr of Rodia were meeting with Palpatine in his office in the Republic Executive Building when the Supreme Chancellor received a transmission from Jabba. Establishing holographic communication, Palpatine assured Jabba that members of the Jedi Order were actively searching for Rotta, though Jabba reminded him that there would be no treaty if his son was not returned. The Jedi later rescued Rotta, ensuring the passage of the Republic's treaty with Jabba and the Hutts."}, {"tag": "h3", "text": "Ransom delivery on Florrum"}, {"tag": "p", "text": "Later that year, the Republic Grand Army initiated a campaign to capture Confederate Head of State Count Dooku and thus ensure a quicker end to the war. Despite the Republic's efforts, the elusive Dark Lord of the Sith instead ended up being taken prisoner by the Ohnaka Gang, a group of Weequay pirates based on the planet Florrum in the Outer Rim. Captain Hondo Ohnaka, the leader of the pirates, directly contacted the Office of the Supreme Chancellor and offered to consign the Sith Lord to Republic custody for a ransom of one million credits, to be delivered in the form of spice. After Jedi Generals Obi-Wan Kenobi and Anakin Skywalker went to verify that the pirates were indeed holding Dooku, Kharrus was present with Palpatine, Jedi Master Mace Windu of the Jedi High Council, and Naboo's Representative Jar Jar Binks in the Supreme Chancellor's office when Kenobi and Skywalker holographically reported back from Florrum. With the Jedi's confirmation that Dooku was being securely held, Palpatine personally dispatched Kharrus and Binks to Florrum to deliver the ransom of spice. Once the Jedi had gained custody of Dooku, Kharrus and his team would help them escort the Sith Lord back to Coruscant."}, {"tag": "p", "text": "A squad of four clone troopers from the Coruscant Guard's Diplomatic Escort Group—under the command of Clone Commander CC-5869, nicknamed \"Stone\"—was assigned to Kharrus, who, as the senior senatorial representative, was made the diplomatic envoy in charge of the delivery mission to Florrum. The assignment itself promised to be the most important of his lengthy career. Mack and another clone pilot flew the diplomatic team to Florrum aboard a Nu-class attack shuttle with the heavy crates of spice. Once they arrived in the Florrum system, Kharrus contacted Palpatine, who was in his office on Coruscant with Senator Padmé Amidala and several Jedi Council members, and informed him that they were due to land shortly. Kharrus stated that their signal would be strong enough to establish proper communications with Kenobi and Skywalker once they were on the surface. As they entered Florrum's atmosphere, Mack told Kharrus, Binks, and their clone troopers to secure themselves for the landing, which they did, though Binks encountered trouble with operating the safety guard on his chair."}, {"tag": "p", "text": "Unbeknownst to Kharrus and the others, a breakaway faction of the Ohnaka Gang—overseen by Ohnaka's duplicitous lieutenant, Turk Falso—intended to intercept the spice ransom before it reached Ohnaka's stronghold. Falso's associate Barb Mentir, flying a Flarestar-class attack shuttle, assailed the Republic shuttle from behind and opened fire on it, leading Kharrus to realize that they had been betrayed. A pair of torpedoes from Mentir's craft compromised the Republic shuttle's engines, sending the vessel straight for the surface. During their uncontrolled descent, Kharrus released the safety restraint on his chair long enough to help Binks into his own, mere seconds before their craft crash-landed in Florrum's Doshar fields. The impact disabled Kharrus's chair guard and ripped apart the shuttle, and the senator was killed in the resulting crash. Both of the clone trooper pilots also perished, leaving only Binks, Stone, and the three other troopers with the spice shipment. In Kharrus's absence, Binks, being the ranking member of the Senate, was entrusted with command of the mission. Assisted by the squad's sergeant, Binks buried Kharrus's body under a pile of rocks close to the crash site, leaving behind the senator's staff as a mark for his grave."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Kharrus's death sparked political tensions between his homeworld of Kinyen and the Gran colony world of Malastare. Rival Gran from Malastare blocked the appointment of a replacement senator from Kinyen, alleging that Kinyen was affiliated with the Confederacy due to its relations with the Trade Federation. Without Senate representation, Kinyen became isolated from the Republic and was thus pressured to join the Confederacy. As a result, Kharrus's homeworld eventually became an orbital staging area for Separatist operations along the nearby Corellian Trade Spine."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Standing 1.78 meters tall, Kharrus had pink skin and three green eyes, which offered him superior vision. He garnered enough political acumen to serve as a senator in the Republic Senate, over a career that became noted for its length. Like most Gran, Kharrus was deeply loyal and was willing to do anything for the greater good of the Republic. He became respected as a seasoned diplomat and would barely blink an eye when asked to undertake perilous assignments for the Republic, coming to specialize in negotiations under extreme circumstances with the galaxy's more dangerous elements. A steadfast supporter of Chancellor Palpatine, Kharrus was a trusted ally of the Supreme Chancellor and was honored when tasked with delivering the spice ransom to Florrum, as capturing Count Dooku and potentially ending the Clone Wars made the mission the most important one of the senator's career."}, {"tag": "p", "text": "During official events, Kharrus wore a formal set of white-and-blue robes that were equally dignified and flexible for any possible situations that could arise while he was in the field. He also carried with him an ancient staff, which Jar Jar Binks used to mark his burial site on Florrum. Colleagues such as Binks were saddened by his death and believed that the Gran would be sorely missed. Binks did his best to honor the late senator's memory, negotiating with the pirates on Florrum on account of believing that it was what Kharrus would have done."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Senator Kharrus was created for the Star Wars: The Clone Wars television series. He first appeared in the feature film that debuted the series on August 15, 2008, though his appearance there was not verified until October 2009, with the publication of The Official Episode Guide: Season 1. He was more prominently featured in the first season episodes \"Dooku Captured\" and \"The Gungan General,\" which aired respectively on January 2 and January 9, 2009. He was given a speaking role in the latter episode, with vocal performance provided by actor Corey Burton, the series' voice for Count Dooku. His staff was an Easter egg based on the headpiece of the Staff of Ra, an artifact from the film Raiders of the Lost Ark, produced by George Lucas. Besides being referenced in such material as The Official Episode Guide: Season 1, Visual Guide Ultimate Battles, and The Clone Wars Character Encyclopedia, Kharrus also received an entry in the December 2008 The Complete Star Wars Encyclopedia, which was the first publication to identify him by name following his unattributed appearance in The Clone Wars film."}, {"tag": "p", "text": "Kharrus appears as a playable character in the 2011 non-canon video game LEGO Star Wars III: The Clone Wars. He is not featured in the \"Story Mode\" campaign of the level adapting \"The Gungan General\" but is instead made available for in-game purchase following completion of the level for use in the game's \"Free Play\" mode. His character animation model has been reused in subsequent episodes of the television series, specifically for background characters in scenes featuring the Galactic Senate. A canonical connection between Kharrus and the as-yet unnamed characters has not been established."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}