{"url": "Kheedar_Ring/Legends", "categories": ["Category:Legends articles", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Kheedar Ring"}, {"tag": "p", "text": "The Kheedar Ring was a criminal organization based on the Outer Rim world of Kheedar. The Ring was led by the crime lord, Horch, until a bounty hunter named Noval Garaint took advantage of the confusion caused by an Imperial attack, and took control of the organization for himself."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Under Horch's Control"}, {"tag": "p", "text": "While the Kheedar Ring was under the control of Horch of Kheedar, it was involved in slaving, gun-running, loan-sharking, and various other criminal activities. On a galactic scale, the Kheedar Ring was a minor player."}, {"tag": "p", "text": "However, Kheedar was home to a number of hydrocarbon processing facilities which would be easy targets for Rebel forces to attack. After the destruction of several similar facilities throughout the Outer Rim, the Empire decided to take action to ensure that the facilities on Kheedar would be safe."}, {"tag": "p", "text": "As a result, the Victory-class Star Destroyer Pestage was sent to announce martial law. However, the pro-Imperial ruler of the planet, King Gordan, was somewhat senile, and in confusion defied the Imperials. In retribution, the Pestage bombarded some prominent targets on the planet's surface, prompting a quick surrender. Horch's large, armed fortress was one of the targets of this bombardment."}, {"tag": "h3", "text": "Under Garaint's Control"}, {"tag": "p", "text": "As the Imperial assault on Kheedar commenced, Noval Garaint was bringing several prisoners to Horch's fortress in order to turn them over to the crime lord. Seeing the destruction around him, and witnessing the assaults on some of the other targets on holovid displays, Garaint took advantage of the situation."}, {"tag": "p", "text": "Garaint forced his way to Horch's throne room, arriving before a contingent of stormtroopers from the Pestage. When the stormtroopers did arrive, they found little resistance. Garaint produced his bounty hunter license, and declared to the Imperial troops that the situation was under control, prompting the stormtroopers to move on to their next target."}, {"tag": "p", "text": "Garaint then proceeded to gather the remnants of the Kheedar Ring under his control, while actively recruiting other bounty hunters and mercenaries into the organization. Garaint found it expedient to retain Horch as the nominal leader of the syndicate, while maintaining the fiction that Garaint himself was little more than Horch's bodyguard. In fact, Garaint now entirely controlled Horch, who had become addicted to a form of spice liquor."}, {"tag": "p", "text": "The Kheedar Ring became significantly more efficient under Garaint's leadership, while expanding into several areas in which Noval Garaint had experience. Amongst these new areas of operation were enforcement, syndicate work, and military operations. Since Garaint put a premium on hiring licensed bounty hunters, and since he ensured that the organizations activities were conducted in a discrete manner, Imperial interference in the Ring's activities was reduced."}, {"tag": "h2", "text": "Sources"}]}