{"url": "Khedryn_Faal", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Character stubs", "Category:Galactic Alliance individuals", "Category:Humans", "Category:Males", "Category:Pilots", "Category:Scavengers"], "nodes": [{"tag": "h1", "text": "Khedryn Faal"}, {"tag": "p", "text": "Khedryn Faal was a male Human captain of the ship Junker. His most striking features were his lazy eye, which presented all of the aspects of life to him, his bad luck at sabacc, which never stopped him from playing, and his profound antipathy toward droids."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Khedryn was born on the remains of the Outbound Flight Project in the Redoubt and lost his parents at an early age. He grew into adolescence on the crashed spaceship until he and the other survivors were rescued by Luke Skywalker and Mara Jade Skywalker in 22 ABY. He never shared the other survivors' hatred towards Jedi and held Luke and Mara in high regard. In the following years he traveled and served on many spaceships from the Empire of the Hand to the Outer Rim Territories and the Core Worlds. At some point in time he even lived on Corellia and Coruscant, but he never called a place other than the Redoubt home until he had set foot on Fhost."}, {"tag": "h3", "text": "Salvage and friendship"}, {"tag": "p", "text": "On his travels Khedryn teamed up with the Force-sensitive Cerean math savant Marr Idi-Shael and made him his first mate on the Junker, a YT-2400 light freighter. Marr proved himself as good friend and exceptional navigator capable of calculating hyperspace jumps on par with a navicomputer. After one of their more illicit enterprises went bad, they were forced to take a detour on there way back to Fhost, during which they picked up an encoded automated distress beacon. It originated from the frozen moon of a gas giant. Upon deciding to salvage whatever was down there later, they returned to Fhost."}, {"tag": "p", "text": "Khedryn later lost the data crystal with the coordinates of the beacon in a rigged sabacc game against Reegas Vance, and with the help of Jaden Korr, they managed to win them back and escape the Black Hole Cantina. Jaden Korr asked them to bring him to the moon which he had seen in a Force vision and Khedryn agreed. Only moments after they arrived in the system they witnessed the arrival of Harbinger, a Sith ship that was carried five thousand years through time by an erroneous hyperspace jump. They also encountered Jedi Master Relin Druur who had caused that time-traveling jump."}, {"tag": "p", "text": "After resisting at first, Khedryn and Marr agreed to help Jaden reach the surface of the moon and bring Relin to the Harbinger to destroy it and its dangerous cargo of Lignan crystal. While Relin and Marr flew Junker into Harbinger's landing bay, Khedryn and Jaden landed on the moon with the Junker's Starhawk shuttle shuttle. There, they discovered an old Imperial research station created by Grand Admiral Thrawn. While exploring the station they learned that the scientists had combined DNA from Jedi and Sith, using DNA from Kam Solusar, Mara Jade Skywalker, Lumiya, Palpatine and others. But the experiment had gotten out of control and the clones had slaughtered the researchers. As Jaden declared that he felt he had to help the clones if any had survived, Khedryn called him obsessed and left for the shuttle. On the way back he realized that he couldn't leave Jaden who had become a friend and decided to return when ran into Kell Douro who had secretly hunted Jaden since Fhost. Kell broke Khedryn's right wrist and his nose before he left him unconscious and unarmed and continued towards Jaden. After regaining consciousness, Khedryn armed himself with the only E-11b blaster rifle left in the station's armory and arrived just in time to kill Kell before he could feed on Jaden, who was exhausted after fighting Kam Solusar's clone."}, {"tag": "p", "text": "Leaving the station they saw the remaining clones escape in Kell's ship. After seeing Harbinger being destroyed and rejoining with Marr, they left the system. When Jaden Korr proclaimed that he would have to hunt the remaining clones, Khedryn and Marr offered to help and were accepted."}, {"tag": "h3", "text": "Hunting the clones"}, {"tag": "p", "text": "After agreeing to help Jaden hunt the clones, Marr was soon offered Jedi training by Jaden. Khedryn was somewhat uncomfortable with the idea at first, and offered for Marr to leave his position as Junker's first mate. Marr refused, much to Khedryn's relief, and they proceeded back to Fhost, to recover before they began their hunt for the clones. However, they caught word of a medical facility being attacked, and moved to the facility, assuming that the clones were the attackers. They were correct, and Khedryn was ordered to stay behind as the last line of defense to prevent the clones from stealing Junker. When the clones made it past Jaden, Khedryn was warned that they would likely hijack a medical supply ship carrying the medication that they needed for their strange illness. Khedryn helped to get the supply ship's captain and copilot out before the clones arrived, but he soon encountered them face to face. After trying and failing to gun the clones down, Khedryn was knocked unconscious by one of the clones, Runner. Khedryn's life was saved by Soldier, a clone of Jaden Korr, who said that they might learn how Jaden located them. Khedryn was captured and taken aboard the supply ship."}, {"tag": "p", "text": "Awaking aboard the supply ship, Khedryn was extremely surprised to see that Soldier was a clone of Jaden. He was asked how Jaden had located them, and Khedryn answered truthfully, telling them that it was by happenstance. With no useful information to give them, Khedryn's execution was ordered by Seer, another clone. While Runner led Khedryn through the ship's corridors to throw him out the airlock, as Khedryn had requested, Runner was attacked by the Umbaran assassin Nyss Nenn. Nenn killed Runner and inadvertently saved Khedryn's life. As Khedryn fled, he was captured by Nenn and was tied up in one of the corridors. Nenn then contacted Jaden, trying to use Khedryn as a bargaining chip and ordering Korr to give himself up. Khedryn was soon discovered by Grace, the child of two of the clones. Grace helped free Khedryn, and he made his way up to the bridge, determined to take control of the ship and to protect Grace from Nyss. He found Soldier tied up in the cockpit, and freed him, allowing Soldier to attack Nenn. Khedryn then used an escape pod to leave the supply ship, and was soon afterward picked up by Junker. They proceeded to pick Jaden up out of space, as the Jedi had prepared to enter the supply ship, as instructed by Nenn."}, {"tag": "p", "text": "The crew of Junker then tracked the clones to a system far in the Unknown Regions, and found that the clones had docked in a strange Rakatan space station. Khedryn then dropped Jaden and Marr off on the station, by was attacked by Nenn. After fleeing into an asteroid belt to escape Nyss, he saw that the Umbaran had docked with the station. Khedryn then docked, hoping to warn Jaden and Marr of Nyss's presence or to stop the Umbaran himself. Khedryn was far behind the others, and attempted to use the station's lift system to descend to the sub-surface part of the station. However, the systems went offline during the journey down, and Khedryn became stuck in the lift. Unknown to him, the station's difficulties came from the fact that Mother, the entity inhabiting the station had just transferred her consciousness into Seer's body. He managed to free enough space to fall the rest of the distance to the end of the lift, which was not far. But he was knocked unconscious when he hit the ground hard. Khedryn later awoke, and was able to contact Jaden, who warned him that Mother was approaching. He then ascended back up to the station, and encountered several animated corpses, powered by the station. Khedryn shot them down and then set the supply ship's engines to explode, which would destroy the station. He soon regrouped with Jaden, Marr, Soldier, and Grace, and they parted ways with the clones, who grabbed Grace's medicine before the supply ship exploded and escaped in Nyss's ship. Khedryn, Jaden, and Marr escaped in Junker, and the station exploded soon afterward, killing Mother."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Khedryn Faal had a lazy eye which he thought gave him a different perspective of the world from others. Before he met Jaden, Khedryn held little loyalty toward anyone or anything other than himself. Faal had a lifestyle of moving from planet to planet, always running to keep responsibility from taking root. He eventually settled on Fhost, as he found its lack of authority inviting. He made a few exceptions to this, the most obvious one being his friendship with Marr Idi Shael. Khedryn was fiercely loyal to his friend and first mate, and was very protective of him. After meeting Jaden, Khedryn's priorities began to change. He found himself unable to abandon Jaden in the Imperial facility on the frozen moon, a decision which led him to save Korr's life. Khedryn later risked his life to get the pilot and copilot of the medical supply ship out of harm's way before the clones hijacked it. Khedryn also became very protective of Grace, especially after she freed him on the supply ship. He believed that Jaden's Jedi principles were beginning to rub off on him. Khedryn was a skilled shot with a blaster, and carried an IR-5 blaster pistol."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}