{"url": "Khem_Val", "categories": ["Category:Legends articles", "Category:Cyborgs", "Category:Darth Nox's crew", "Category:Dashade", "Category:LGBTQ+ individuals", "Category:Males", "Category:Members of the Sphere of Ancient Knowledge", "Category:Shadow Killers"], "nodes": [{"tag": "h1", "text": "Khem Val"}, {"tag": "p", "text": "Khem Val, also known as Shadow Killer or Devourer, was a male Dashade servant and warrior of the Sith Lord Tulak Hord and centuries later the heir of Aloysius Kallig, the future Darth Nox."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Khem Val was the greatest shadow assassin on Urkupp when Tulak Hord challenged him to an honorable combat and claimed victory. In Tulak Hord's service, fighting alongside his master's apprentice Ortan Cela and his Dashade companion Veshikk Urk, Khem Val devoured over a thousand Jedi at Yn and the Battle of Chabosh. The more his master conquered, the more he feasted and an unusual bond formed between the Sith Lord and the Shadow Killer. However, centuries passed and the story of Khem Val became a mere legend. Tulak Hord had suspended Khem within a stasis field inside the tomb of Naga Sadow on Korriban guarded by a field of electrical energy for safekeeping, where even the most powerful Sith Lords would not try to free him. Khem had remained in this state for thousands of years."}, {"tag": "p", "text": "He was eventually freed by a promising Sith Acolyte at the time. This was ordered by Zash. When freed, he was enraged to learn that Hord was dead, and set to kill the acolyte. But in his weakened state he was defeated and had no choice but to serve the acolyte who would later be known as Darth Nox, the heir of Aloysius Kallig. Khem claimed he would regain his strength eventually."}, {"tag": "p", "text": "As the power of his master grew, Darth Zash recalled her apprentice. Khem went with his master to what they both knew was a trap. Zash revealed that she was dying and intended to take her apprentice's body. As the fight continued, Zash was able to complete the ritual to transfer herself, but Khem Val attacked her in order to save his master, interrupting the process. By doing this, he became the recipient of Zash's existence and was forced to share his body with the Sith Lord. The ghost of Aloysius Kallig, the ancestor of Lord Kallig, stated this as betrayal from Tulak Hord, whether Khem Val liked it or not. Lord Kallig promised that he would one day expel Zash from Khem's body."}, {"tag": "p", "text": "Zash soon blackmailed Khem into retrieving the bones of Tulak Hord, sending him nightmares of a thief stashing them in a storehouse on Hoth. Because the bones possessed the same energy that restrained Khem in Naga Sadow's tomb, this weakened his influence over his body, giving Zash enough time to find a way to expunge Khem from his body. Khem, with the help of Kallig, was able to learn of Zash's plans: she attempted to replicate the ritual by using a Rakata Mind prison found on Taris. As the box began to separate their spirits from the body, Khem proved to be too powerful for Zash to maintain control and as a result she was pulled into the box, finally freeing Khem. The Dashade then declared his master the rightful heir of Tulak Hord and promised to guard their legacy forever."}, {"tag": "p", "text": "By the time of the Eternal Empire's conquest, Khem had earned the respect of Ak'ghal Usar, the Last Lord of Urkupp, for his servitude to Tulak Hord."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "At first, Khem Val viewed Kallig as unworthy of continuing Tulak Hord's legacy, and vowed to devour him when his powers returned. As time went on, Khem began to respect his new master and later admitted that his opinion of them was wrong. He went from unwilling servant to devoted enforcer of Kallig's power base."}, {"tag": "p", "text": "As a Dashade, Khem Val was honor bound and willingly served his masters. This had formed a unique bond that was impossible to sever, forcing Zash to serve Kallig when she entered Khem's body. Khem often boasts about Tulak Hord's legacy and was honored to announce Kallig's ascension to becoming a Sith Lord and a Darth."}, {"tag": "p", "text": "Khem Val was trained to be an elite assassin, a near-perfect killing machine stated to be the \"very embodiment of death and destruction.\" He enjoys killing Force users, and is quite powerful, cunning and ruthless to murder even the strongest ones. Khem also tends to boast about his victories over Yn and the Battle of Chabosh, where he killed thousands of Jedi."}, {"tag": "p", "text": "In spite of his penchant for brutality, Khem Val possessed a strong sense of honor, believing in keeping one's word no matter the cost. In his travels with Lord Kallig, he would often express approval when his master entered into an honorable agreement, and distaste if the Sith broke a trust."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Due to his superb Force resistance, Khem Val was very durable and could withstand up to many attacks before succumbing. Armed with a vibrosword, his melee attacks were also very brutal. Khem Val lived up to his nicknames by consuming the essences of his slain enemies, rejuvenating his health."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Khem Val is the first companion character to join the Sith Inquisitor class players in Star Wars: The Old Republic. Before the game's release, he received an entry in the \"Biographies\" section of the website's \"Holonet\" feature. On his entry, there are several phrases in Aurebesh, which when translated read \"Vessel for the master\", \"Bitter rivalry\" and \"Unwilling servant\". Vessel refers to sharing his body with Darth Zash, the Bitter rivalry alluding to the betrayal of Aloysius Kallig at the hands of Hord, and Unwilling servant refers to him being bonded to Lord Kallig."}, {"tag": "p", "text": "After Zash becomes trapped in Khem Val's body, the player can choose dialog options to support her or Khem. It should be noted that Zash doesn't have her own approval rating, so supporting her usually results in disapproval from Khem."}, {"tag": "p", "text": "In the final companion quest \"The Escape\", when Khem and Zash fight against the Rakata Mind prison's pull for control of Khem's body, the player has three options: they can lend their power to either Zash or Khem, or refuse to assist either and let the strongest win. If Zash wins, she will thank the player and swear fealty to her former student; if Khem wins, he will thank his master and reaffirm his loyalty. Khem will win if Kallig refuses to take sides."}, {"tag": "p", "text": "During the flashpoint \"The Nathema Conspiracy\", if the Outlander is a Sith Inquisitor who made the choice to support Zash and banish Khem's spirit, he will spend years clawing his way out of the prison and will eventually reclaim his old body. Khem will then seek revenge on his former master and join the Order of Zildrog led by Vinn Atrius, only to be sacrificed as fuel to awaken Zildrog by GEMINI 16 on Nathema. If the player made the choice to support Khem or allow him to prevail over Zash, she will take his place instead, having acquired a new body, while the other classes face antagonists from their own class stories."}, {"tag": "p", "text": "If Khem was not a participant in the conspiracy, the Outlander Sith Inquisitor will find Khem on Ossus hunting and consuming Jedi. Khem can then be recruited and becomes a romance option if Khem considers the player's decisions honorable, telling the Sith Inquisitor that the Force no longer satisfied his hunger and that he longed to be bonded."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}