{"url": "Khil", "categories": ["Category:Legends articles", "Category:Colonies species", "Category:Endothermic species", "Category:Khil", "Category:Spacefaring species"], "nodes": [{"tag": "h1", "text": "Khil"}, {"tag": "p", "text": "The Khil were a sentient species native to the planet Belnar. They were among the earliest member species of the Galactic Republic, and had spread to countless worlds throughout the galaxy by the time the Galactic Empire came to power. They were enthusiastic supporters of the Republic and the peaceful order it represented. Khil were involved at all levels of the galaxy's society, acting as soldiers, scientists, musicians, entrepreneurs, and politicians. Most Khil considered themselves \"citizens of the galaxy.\""}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Physically, Khil were warm-blooded, hairless humanoids with grayish skin and a wide variation in height. Their mouths were their most distinctive features: instead of jaws, Khil had many fleshy tendrils hanging from their lower face and neck. Khil breathed through these organs, called hullepi in Khilese. Khil communicated by breathing through hullepi of different lengths, thus producing various musical tones. This made them natural musicians."}, {"tag": "p", "text": "Organic debris and moisture absorbed through the hullepi, along with vegetable and fruit juices, made up the Khil diet. Khil communities usually had low population densities, allowing large wetland parks to thrive. In addition to their utilitarian purposes, these green spaces were kept for their aesthetic value. The many non-Khil residents and visitors on Khil colony worlds also appreciated these parks."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "In general, Khil were dedicated and ambitious people, with little tolerance for laziness or time-wasting. From infancy, they were taught to work hard and strive for leadership positions. They were often slightly arrogant, convinced that nothing was beyond their abilities if they only applied enough effort. Though their tenacity usually served them well, they were sometimes prone to severe mood swings, and even nervous breakdowns, when faced with high stress or a lack of progress. Their intensely driven, sometimes arrogant nature was tempered by a strong loyalty to family and an usually polite and friendly demeanor."}, {"tag": "p", "text": "The Khil were technologically advanced and easily integrated non-Khil neighbors into their culture. Their cosmopolitan cities attested to their willingness to live in harmony with other peaceful species. While they greatly preferred a political solution when possible, in the days of interstellar warfare they had no desire to see their hard work destroyed, especially by a war-loving enemy, and thus Khil deviousness and vindictiveness became especially apparent when they defend their homeworld and colonies."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Khil had been part of the Galactic Republic for millennia, adopting the Republic's technological, cultural, and architectural standards. Khil scholars were responsible for many of the Republic's scientific achievements, and Khil traders and corporations were active Galaxy-wide. The Jedi Master Xamar, who was active circa 3964 BBY, was one of the most prominent Khil in early Galactic history."}, {"tag": "p", "text": "Many Khil initially supported the Empire, only to find themselves shut out of the highest levels of government under the Humanocentric New Order's policies. Khil worlds were assigned Imperial governors, though many Khil continued to look to their own leaders for guidance. Most Khil opposed Imperial oppression in subtle, indirect ways. One notable exception occurred on Merakai, where a group of Khil protested the construction of a TIE fighter hangar. After Imperial forces massacred the protesters, many Khil joined the Alliance to Restore the Republic."}, {"tag": "p", "text": "During the Galactic Civil War, many Rebels were hidden in Khil safehouses, supplied by Khil traders, or protected by Khil misinformation fed to the Empire. The Empire suspected many Khil of treasonous activities, but most of their actions were subtle enough that the species could not be universally condemned for treason. Greldo Farnor, who began a violent struggle against the Empire after his wife died in the destruction of Alderaan, was one of the unusual Khil who acted directly and openly. Once the Empire fell, the Khil became one of the first species to join the New Republic, continuing to support it well into the struggle against the Yuuzhan Vong."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}