{"url": "Khetanna/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Sail barges"], "nodes": [{"tag": "h1", "text": "Khetanna"}, {"tag": "p", "text": "The Khetanna (commonly referred to as simply Jabba's sail barge) was a Ubrikkian Industries Luxury sail barge, owned by the crime lord Jabba Desilijic Tiure. He used it to travel over the Dune Sea of Tatooine, and for pleasurable expeditions to the Great Pit of Carkoon. It was generally accompanied by two skiffs, which carried the Hutt's guards."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Khetanna was a modified luxury sail barge which had three decks with the upper one being covered by two large orange sails. The sails were primarily decorative, but they also protected passengers from the glaring light of Tatooine's twin suns and could propel the vessel at a moderate 30 km/h. The usual method of propulsion was a triple-chambered repulsorlift engine. The upper deck also had a small private lounge, which was used by Jabba's favorite henchmen and guests."}, {"tag": "p", "text": "As the vehicle was designed to transport sentient passengers for extended trips, the Khetanna's middle deck served as the passenger deck. This deck was highly ornate, decorated with sculptures, tapestries, and other symbols of wealth in order to impress Jabba's guests. Despite this, the Khetanna was actually somewhat under-furnished compared to other sail barges, the main luxury being its extensive galley to cater to Jabba's large appetite. A large portion of this deck was occupied by a large banquet room which could double as a throne room for Jabba and his entourage. Jabba used this deck when he ordered Luke Skywalker thrown into the Great Pit of Carkoon, and it was here that he died by strangulation at the hands of his newest slave girl, Leia. The mid-deck also held guest rooms, a lobby, Jabba's private quarters, a fully stocked and expanded kitchen, and the cockpit of the vehicle."}, {"tag": "p", "text": "The barge's lower deck was composed of navigation sensor array, engines, redundant steering systems, a series of prison cells, a droid storage chamber, armory, a repair shop, and several live food tanks containing living animals which the crime lord would feast on at his pleasure."}, {"tag": "p", "text": "When the crime lord acquired the vessel, he installed a custom-mounted blaster cannon on the upper deck which could disable most vehicles and had the handrails drilled to hold portable antipersonnel heavy blasters. An advanced sensor suite allowed the crime lord to escape detection from his foes. Also on the barge were several decorations such as masks and decorative bas-reliefs."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When Jabba the Hutt acquired the Khetanna, he used it for business trips, lavish parties, and tours across the deserts of Tatooine. He often conducted raids on his rivals, often with assistance from a pair of escorting Bantha-II cargo skiffs. Despite requiring a crew of 26 for proper and safe operation, Jabba was infamous for voyaging with 15 or fewer crewmen, most of whom were kitchen assistants. Jabba would enter and exit the barge by a large boarding hatch at the observation-deck level on the starboard side of the vessel. Due to the reputation of the infamous Jabba, the vessel earned a feared reputation among her master's enemies."}, {"tag": "p", "text": "Jabba used the barge to take Luke Skywalker, Han Solo, and Chewbacca to the Great Pit of Carkoon, where they were to be fed to the sarlacc. The sail barge was destroyed during the fight that ensued over the pit after Luke Skywalker retrieved his lightsaber. After defeating several of Jabba's guards, Skywalker ordered Leia to point the deck cannon directly at the deck. Just before escaping, Skywalker kicked the firing lever, causing the sail barge to be torn apart by the laser fire."}, {"tag": "p", "text": "Although largely stripped of valuables by scavenging Jawas, the remnants of the Khetanna near the sarlacc pit were part of Mos Eisley's Skywalker Tour. Parts of the Khetanna were eventually used to line the interior of the Doe See'ybark Bootana restaurant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}