{"url": "Khorm/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Galactic Republic planets", "Category:Halori sector planets", "Category:Ice planets", "Category:Khorm locations", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Khorm"}, {"tag": "p", "text": "Khorm was a frozen planet located in the Mid Rim, home to the Khormai species. It was one of the few planets that contained an extremely rare ore called Agrocite that could be used to enhance the power of turbolasers. During The Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Khormai warlord Unger Gout betrayed his people and enslaved them to mine Agrocite for Dooku. This resulted in a major Republic offensive led by Plo Koon, Kit Fisto, and Tauht at the Battle of Khorm. During the battle, both Gout and Tauht were killed, but in the end the Republic won with the help of native Khormai and air support from Republic Admiral Wieler, who, along with Fisto and Captain \"Sharp\", destroyed Gout's powerful Agrocite cannons."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A land of frozen wastelands and blizzards, Khorm's entire surface was covered in ice and snow, and, in spite of the extremely cold temperatures and harsh winds, a walrus-like species, the Khormai, managed to thrive there. It had a Type I atmosphere. One of its most rare and valuable resources was an ore called Agrocite that, when converted to plasma, could greatly enhance the destructive power of turbolasers. This enticed the Confederacy and Unger Gout, a Khormai warlord, to ally with each other to collect as much of the resource as possible. Because of the extensive mining done on the planet, there was a massive unnatural network of caves beneath the ice. It was located in the Khorm system, in the Mid Rim."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Years before the Clone Wars, the native Khormai, who had developed the proper technology, discovered the enhancing effect of agrocite on turbolasers. Khorm was then peppered with mining facilities by the Khormai, and more were built as time went on, with the sole purpose of unearthing the rare ore. During this period, Unger Gout was born, and quickly rose to prominence in the government. He eventually took over and sold Khorm and its agrocite to Dooku."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "Around 21 BBY, the Galactic Senate, hoping to stop the mining of Agrocite for the Separatist cause, sent an attack force led by three Jedi Masters: Plo Koon, Tauht and Kit Fisto to Khorm, where they obtained the aid of the Khormai resistance and one of its heads, Adaroo. However, Gout had predicted their arrival and constructed a weather-control station to create a planet-wide storm, powerful enough to prevent any air-support but still enabling the fleet to send ground troops. Soon, the Republic forces had begun to get the upper hand, which forced Gout to request reinforcements in the form of Dark Acolyte Asajj Ventress. The Republic continued to advance toward the main mine, despite Tauht being slain after capturing a processing plant. Gout and Ventress then initiated a counter-attack, and kidnapped Major Kendal Ozzel, Commander CC-3636, and several other clone troopers."}, {"tag": "p", "text": "Meanwhile, Koon and Fisto had destroyed the weather-control station, and Gout and Ventress retreated to the mine, where they kept the prisoners and slaves. While the Republic prisoners escaped, the two Jedi arrived with their forces at the mine. The Dark Acolyte then had the mine rigged with explosives with the intention of killing the Khormai if the Republic conquered the mine. Finding the explosives, Koon and Fisto had Ozzel halt his advance as they infiltrated the mine and escorted the slaves to safety. Before they could exit the mine, Ozzel began his assault, and Gout revealed his agrocite cannon by destroying a Venator-class Star Destroyer. \"Sharp\" and Fisto succeeded in destroying them before Ventress could destroy the mine, but she escaped. After the battle, it became host of a Republic Command Post for the rest of the war."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Khorm was created for the 2009 In Service of the Republic storyline of the Star Wars: The Clone Wars comic series. The three issues of the storyline were written by Henry Gilroy and Steven Melching and were illustrated by Scott Hepburn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}