{"url": "Khoonda_Militia", "categories": ["Category:Legends articles", "Category:Khoonda Militiamen", "Category:Law enforcement", "Category:Military units"], "nodes": [{"tag": "h1", "text": "Khoonda Militia"}, {"tag": "p", "text": "The Khoonda Militia was an ad hoc militia led by Militia Captain Zherron and his lieutenant, Berun Modrul. Stationed on the planet Dantooine, they served as that world's police as well as its defense force, helping to thin the wild animal population, protecting settlers and salvagers and patrolling Khoonda outpost and the outlying areas. Without direct support from the Republic in the wake of the Jedi Civil War, however, the militia and the outpost, as well as the surrounding community, began to fall on hard times."}, {"tag": "p", "text": "Many of the militia held a low regard for the Jedi, blaming them for the destruction visited upon the world by the Sith in the wake of the bombardment of the Jedi Enclave by Darth Malak. In the subsequent occupation, many of Dantooine's more prominent citizens were \"removed\", leaving precious little behind for the remaining settlers when the Sith finally abandoned the planet some time after the Battle of Rakata Prime."}, {"tag": "p", "text": "Five years later, the militia fought against mercenary forces led by the ex-Sith trooper Azkul to protect the settlement of Khoonda during the First Battle of Dantooine. With the aid and encouragement of the Jedi Exile, the outnumbered militia rallied and defeated the mercenaries and saved Khoonda and its many settlers, farmers and salvagers from further harm. Eventually the Republic once again renewed support for the remote yet strategic star system, resulting in the supplementation of the militia with Republic-trained soldiers."}, {"tag": "p", "text": "Afterwards, when the Sith planned an attack on Telos' Citadel Station, Zherron and several other members of the militia aided the TSF and the Jedi Exile in liberating the station from Sith forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Many of the militia's identifiable members were recruited by the Jedi Exile through dialogue options during her visit to Dantooine; among them were Akkere, Dillan, Jorran and Suulru."}, {"tag": "p", "text": "If the player chooses the Dark Side path, then the Khoonda militia, along with the outpost itself, is sabotaged and eventually defeated by Azkul's mercenaries. If this happens, then Azkul will feature on Citadel Station during the Battle of Telos IV, fighting with a group of his mercenaries."}, {"tag": "p", "text": "If a member of the Militia died during the Battle of Dantooine, it is possible for them to remain in the game. They will be stagnant where they were in life but the Exile can walk through them and cannot communicate with them."}, {"tag": "p", "text": "It is possible to recruit militia members after the attack and it will make the quest remain active for the rest of the game."}, {"tag": "p", "text": "During the Battle of Telos IV, the Jedi Exile fights alongside some of the militia, as they try to force off a squad of Sith troops. Here, all indistinguishable members may die if the enemy fires on them for too long. Also, each of these members are incorrectly labeled as \"Koonda Militia\"."}, {"tag": "h2", "text": "Appearances"}]}