{"url": "Khormai/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Khormai", "Category:Mammalian sentient species", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Khormai"}, {"tag": "p", "text": "The Khormai, the native sentient species of the frozen planet Khorm, were humanoids characterized by their stout physiques, blubbery skin, bushy mustaches, and prominent tusks. Khormai often wore robust environment suits that sported large smoke stacks, which emitted plumes of gray gas. Members of the species traveled between their disparate settlements via transports known as rail jets, or from within the gullets of large, furry worms known as aelids, whom Khormai could summon with a special instrument. A wide degree of dispositions marked the species, with some supporting war and enslavement, yet others peace. The species and their homeworld held great strategic value in the galaxy due to the mining of agrocite, an ore with important military uses."}, {"tag": "p", "text": "During the Clone Wars, an ambitious Khormai warlord named Unger Gout capitalized on Khorm's agrocite deposits to broker a deal with the leader of the Confederacy of Independent Systems, Count Dooku: in exchange for control of the planet, Gout enslaved his own people to mine agrocite for the Separatists. Gout employed a weather-control station to create massive storms in the planet's atmosphere and thus control when starships could make landfall. Meanwhile, a rival Khormai, Adaroo, took control of a resistance movement. A force of Jedi Knights and clone troopers from the Galactic Republic managed to land on the world, where they teamed up with Adaroo to lead an assault on Gout's location. Although bumbling by the Republic Major Kendal Ozzel nearly lost them the mission, Adaroo and the Republic forces defeated Gout and his reinforcements, battle droids led by the Dathomirian assassin Asajj Ventress. The planet returned to Republic hands."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "With both male and female members, the Khormai were sentient, rotund humanoids. Their bodies were covered in thick skin that ranged in color from dull to rich brown, the hide riddled with wrinkles and pockmarks. The Khormai's stocky legs stood them roughly 1.8 meters tall on average, and their flipper-like hands boasted either three or four fingers each. The species's girth enabled them to wield large weapons."}, {"tag": "p", "text": "The species' characteristic dome-shaped head attached to the fat, broad neck in blubbery folds. Wide-set eyes, white with no discernible irises, flanked a small nose shaped like an inverted triangle; the nasal opening was either pink or black in coloration. Although the mouth sported a full set of white teeth, it was dominated by two stubby, white tusks that jutted out from the upper jaw, itself covered by a white mustache. The chin and neck also sported a thin coating of white stubble. Tiny ear flaps extended from the sides of the head."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Khormai inhabited villages on the icy world of Khorm. While a system of conveyances known as rail jets connected distant settlements, the Khormai employed local creatures known as aelids for transport through difficult, mountainous terrain. Such travel required the Khormai riders to first call the worms with a thin horn. They then attached control straps to direct the beasts. However, rather than riding atop the creatures, the Khormai allowed themselves to be swallowed up to direct the creatures from within the worms' gullets as the creatures burrowed through the soil; aelids rarely digested live prey."}, {"tag": "p", "text": "The species had access to climate-control technology that was capable of creating vast storms. Khormai tended to wear bulky environment suits both in the wilds of their homeworld and aboard starships. The suits were characterized by exhaust pipes in the back that constantly belched black smoke. Other Khormai sported accoutrements such as capes."}, {"tag": "p", "text": "The ravages of the Clone Wars foregrounded fissures in Khormai society. While some purported to value peace over war, ascribing the latter as the purview of tyrants, others practiced warlordism and enslavement of Khormai detractors and aliens to their homeworld. Both factions had access to heavy weaponry with which to fight. The species buried its dead in graves dug out from the ice."}, {"tag": "p", "text": "At least some Khormai demonstrated fluency in Galactic Basic Standard, although they peppered their use of the language with idiosyncratic sounds, such as tchk-tchk. Khormai naming conventions allowed both single- and double-part names; examples included Adaroo and Unger Gout."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Khormites evolved on the planet Khorm, a chilly world covered in snow and ice. The planet became integrated into the greater galaxy at some point between 5000 and 4000 BBY, when it fell within the Halori sector, located within the Trans-Hydian reaches of the Mid Rim. As the Jedi Civil War raged from 3959 to 3956 BBY, Khormai fell within Darth Revan's Sith Empire. It later lay beyond the territory of the Galactic Republic during the New Sith Wars as well, from 1004 to 1000 BBY."}, {"tag": "p", "text": "With the outbreak of the Clone Wars, a galaxy-spanning conflict that pitted the Republic against the breakaway Confederacy of Independent Systems, Khorm came to the attention of both sides due to its possession of a rare ore known as agrocite, which could be used to enhance the power of beam weapons and starfighters. The warlord Unger Gout received support from the Separatist leader Count Dooku to install himself as the planet's leader. In return, Gout oversaw an agrocite processing facility in the Kafiri Mountain Range, a forbidding region only accessible via a tortuous overland journey. There he drove a workforce of enslaved Khormai miners, whom he forced to collect ore for the Separatist war effort. The Separatists established a base on the world, composed of BX-series droid commando and B2 super battle droids under Gout's command and defended by J-1 semi-autonomous proton cannons, to protect the warlord and his operation. As an added security measure, Gout employed a climate-control station that allowed him to generate massive storms that roiled in Khorm's atmosphere and prevented Republic air strikes."}, {"tag": "h3", "text": "Battle of Khorm"}, {"tag": "p", "text": "Gout's actions also fostered the formation of a resistance movement, a group of Republic sympathizers led by a Khormai named Adaroo. Circa 22 BBY, the resistance leader had identified a vulnerability in the droid defenses of Gout's fortress. Meanwhile, the Republic Jedi General Plo Koon made contact with Adaroo and revealed that a force of clone troopers had come to the world under the leadership of himself and the Jedi Masters Kit Fisto and Tauht. The Khormai resistance leader remained incredulous of the Republic's motives for intervening in the conflict; he believed that the offworlders sought only access to Khorm's agrocite mining and processing sectors and cared little for the plight of the enslaved Khormai. Nevertheless, he accepted the offworlders' help in the hopes of freeing Gout's captives, and led Koon's command to a soft spot in the Separatists' defenses."}, {"tag": "p", "text": "Gout witnessed his enemies' approach and ordered fire on nearby ice crystals, which thundered down among the Khormai and Republic troops in an avalanche. At the same time, the Republic Major Kendal Ozzel, in command of Republic ground forces on the world, ordered the All Terrain Recon Transports and All Terrain Tactical Enforcers under his command to open fire on the agrocite processing plant where Gout was based. When Ozzel ordered his clone troopers to disembark from their vehicles and attack, the Jedi entered the fray to protect them. As Adaroo, Fisto, and Koon stormed the trenches surrounding the factory and Tauht destroyed the cannons, Ozzel ordered his walkers to open fire on Gout's base—despite the presence of the Jedi. The warlord saw his droid forces greatly reduced; he fled to a separate base within an agrocite mine in his personal rail jet. In his absence, the Republic established its base of operations in the structure."}, {"tag": "p", "text": "To bolster the Separatist forces on Khorm, the Confederacy's leader, Dooku, sent his apprentice, Asajj Ventress, to support Gout, despite the warlord's protests. When the Republic Admiral Wieler notified them that a Separatist starship had somehow entered the atmosphere, the Republic forces surmised that Gout and the Separatists had access to some sort of weather-control technology. A small contingent of troops under the leadership of Adaroo, Fisto, and Koon set out on CK-6 swoop bikes to destroy the nearby climate-control center, a move that would allow a Republic airstrike to cover the ground troops during a liberation of the mines. Nevertheless, under Ventress's command, Separatist forces led a counter-assault on the agrocite plant. Ozzel and Tauht led the Republic's defense, but the Jedi was killed in the battle. Ozzel ignored his fallen general's orders to defend the center and instead ordered a charge on Ventress's position. Ventress and Gout recognized the Human's folly and activated their awaiting forces of DSD1 dwarf spider droids, hidden under the snow. They also called up a giant storm, which wiped out entire Khormai villages. Ventress and Gout retook the plant and captured Ozzel; when interrogated, he revealed the whereabouts of Fisto, Plo, Adaroo, and their forces."}, {"tag": "p", "text": "Adaroo and the Republic forces reached a decimated village, where the resistance leader insisted upon burying the dead before carrying on. The difficult terrain forced the party to dismount from their swoops and instead travel on foot."}, {"tag": "p", "text": "Despite Ventress's proximity to Adaroo and the Jedi, Gout contacted his underling, the Aqualish Villpu Nagg, who was in charge of the weather-control station. Gout ordered Nagg to generate a storm with enough power to kill the Republic demolition party. Nevertheless, Ventress managed to overtake Adaroo and his companions and laid an ambush for them. During the skirmish, Ventress created an avalanche that buried Republic and Separatist forces alike. The Jedi used the Force to shield their troops and Adaroo from injury. Ventress eventually gave up her search for survivors and departed. The Republic strike team then re-emerged from the snow and destroyed the remaining Separatist droids. With several casualties and injuries, continuing on foot seemed impossible. Instead, Adaroo blew a horn to summon large, furry creatures known as ice worms, in whose gullets the party could continue their trek. Upon arrival, a clone trooper sliced into the station's junction box and refocused the center's storm upon the station itself, a plan Fisto had proposed. The ploy worked: the station was destroyed and the storm dissipated."}, {"tag": "p", "text": "Despite the fact that Ozzel and a few other troopers had escaped Gout's prison, the major was ready to surrender once again when the storm dispersed and Republic air forces arrived to turn the tide of the battle. Gout responded by herding the Khormai captives deep into the mines, surrounding himself with sentient shields who could double as hostages."}, {"tag": "p", "text": "Meanwhile, Adaroo, Fisto, Koon, and their forces returned to the agrocite factory and noticed it was scarcely defended. Nevertheless, Adaroo cautioned that his intelligence had suggested that the interior of the mine was heavily guarded. They proceeded with caution."}, {"tag": "p", "text": "Ventress, too, soon penetrated the mine and arrived at Gout's location. There, she had a droid line the mine with thermal charges. Adaroo and the Jedi arrived as that ploy was in progress, and they realized that she intended to demolish the mine—and kill all the Khormai trapped there—should the Separatists be forced to abandon the agrocite deposits. Unable to contact Ozzel due to jamming of their communications, the liberators were forced to try to rescue the Khormai before Ventress could detonate her charges."}, {"tag": "p", "text": "As Ozzel and the Republic craft attacked the warlord's position, Gout replied with his agrocite cannons, which turned the tide of battle against the Republic. In the mines, Adaroo joined Koon and his clone troopers in an attempt to subdue Ventress and free the captives while Fisto and the clone trooper Sharp assaulted Gout's cannons. As Koon confronted Ventress in a lightsaber duel, Adaroo and the troops reached the enslaved Khormai only to discover they were heavily guarded. Meanwhile, Fisto and Sharp reached Gout's cannons. Panicked, Gout ordered all droid troops to his position, which left Adaroo and his troops with little resistance back in the mines. Fisto and Sharp neutralized the cannons, and the resulting explosion killed the Khormai warlord. The Separatist cause lost, Ventress fled, leaving the world in Republic hands. With the captives freed, Adaroo agreed to supply agrocite for the Republic. The Republic established a base on the world near the agrocite processing plant."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "Khorm remained in Republic space during the Outer Rim Sieges of 20 to 19 BBY. Years later, in 7 and 8 ABY, the Khormai home planet was within a region largely dominated by vassals or allies of Warlord Zsinj, a Human who attempted to rebuild the Galactic Empire with him at its head. The species' homeworld was part of the Borderland Region during the Thrawn campaign of 9 ABY, and it was within the territory of Darth Krayt's Sith Empire by 137 ABY."}, {"tag": "h2", "text": "Khormai in the galaxy"}, {"tag": "p", "text": "At least some Khormai left their homeworld; for instance, circa 22 BBY, two Khormai were patrons of a casino within a base hidden within an asteroid near Cavamina Minor. There, the Khormai witnessed the destruction of Republic and Separatist flotillas that had been lured into the mined asteroid field by the base's owner, Attuma Duum. When a Human named Shon-Ju infiltrated Duum's base and disabled its deflector shields, the station itself came under threat of the mined asteroids and was destroyed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Khormai first appeared in the Dark Horse comic book The Clone Wars 7, the first issue of a three-part story arc that was first published in July 2009. The story was written by Henry Gilroy and Steven Melching, and the artwork was provided by Scott Hepburn and Michael E. Wiggam. Penciller Brian Koschak later included two Khormai extras in the comic book The Clone Wars: Deadly Hands of Shon-Ju, published by Dark Horse in December 2010."}, {"tag": "p", "text": "A purple-furred alien with features that largely match those of the Khormai appears in The Last Command 5, a comic book illustrated by Edvin Biukovic and first published in April 1998. However, because the Balti, another species of blubbery, tusked aliens, appear in the short comic story \"A Hot Time in the Cold Town Tonite!,\" originally published in Star Wars Tales 6 in December 2000, no definitive species identification may be given to the tusked, purple-furred character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}