{"url": "Khuiumin_Survivors", "categories": ["Category:Legends articles", "Category:Khuiumin Survivors", "Category:Pirate organizations"], "nodes": [{"tag": "h1", "text": "Khuiumin Survivors"}, {"tag": "p", "text": "The Khuiumin Survivors were a pirate band associated with Leonia Tavira's Invids."}, {"tag": "h2", "text": "Origin"}, {"tag": "p", "text": "The Survivors were all that remained of the Eyttyrmin Batiiv pirates. Once eight thousand individuals strong, the Eyttyrmin Batiiv pirates were utterly wiped out by the Galactic Empire at the Battle of Khuiumin. Less than three hundred pirates, and one CR90 corvette (the Backstab) under the command of Captain Jacob Nive, survived the Imperial assault. Swearing vengeance against the Empire, the remnants of the band began calling themselves the Khuiumin Survivors and Nive became the new leader by default."}, {"tag": "h2", "text": "During the Emperor's Reign"}, {"tag": "p", "text": "During the height of the Empire, the Survivors became mercenaries, only taking jobs where they could kill Imperials. After Palpatine's death, the Survivors once again returned to their pirating ways."}, {"tag": "p", "text": "In 1 ABY, they participated in the destruction of the Imperial-class Star Destroyer Brazen."}, {"tag": "h2", "text": "With the Invids"}, {"tag": "p", "text": "When Leonia Tavira and her Invidious began pirating, a number of pirate organizations joined her. One such organization was the Survivors. As Invids, the Survivors provided Tavira with some of her best Tri-fighter pilots, and were well respected within the organization as its most disciplined division. The Survivors returned to the old Eyttyrmin Batiiv based on Courkrus, and the other Invid groups followed suit. The Survivors tended to gather in a cantina called the Crash, which was decorated with debris from starfighters shot down by Survivor pilots, and from starfighter crashes which Survivor pilots had escaped."}, {"tag": "p", "text": "During their time with the Invids, the Survivors were joined by Jenos Idanian, who was actually the undercover Corran Horn. Idanian quickly rose through the ranks of the group to become leader of the elite Bolt and Nive's second in command. Eventually, Corran revealed himself to Nive as a Jedi, though he used another of his aliases, Keiran Halcyon. He and Luke Skywalker convinced Nive to turn against Tavira and the Invids, and the Survivors struck out on their own. The Survivors led Booster Terrik and the Errant Venture to Tavira's base at Susevfi, and Corran suspected that they would begin operating from that planet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Despite Nive's growing dissatisfaction with the Survivors' acts of thievery and murder, the group apparently returned once again to piracy. The Survivors were eventually completely wiped out by the pirate hunting starship, Naritus. They were a well-organized and exceptionally skilled pirate band, but ultimately they could not survive in New Republic society."}, {"tag": "h2", "text": "Known Fighter Squadrons"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}