{"url": "Khurgee", "categories": ["Category:Legends articles", "Category:Death Star residents", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Khurgee"}, {"tag": "p", "text": "Khurgee was a Human male captain in the Imperial Military who served aboard the first Death Star."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 0 BBY, Khurgee was apparently a qualified pilot, but he spent an important part of his career as a docking-bay security officer. He served first aboard the Star Destroyer Thunderflare, where he was honored for bravery after rescuing five officers from a shuttle crash. He was later assigned to the first Death Star."}, {"tag": "p", "text": "While the battle station lingered in the rubble of the Alderaan system, Khurgee was the security officer in charge of searching the Millennium Falcon in Docking Bay 327. He led the initial inspection in person, and reported to Darth Vader, before summoning a scanner team to perform a more thorough search. Not too long after, the Death Star saw its destruction in the subsequent Battle of Yavin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Khurgee's biography derives largely from his card in the Star Wars Customizable Card Game; the reference to his piloting qualification is based on the more recent Wizards of the Coast card game, which uses an image of him, coupled with Chief Bast's line \"Should I have your ship standing by?\", to depict a Helmsman."}, {"tag": "p", "text": "Among Star Wars fans, there is a relatively widespread belief that Khurgee held the rank of Line Captain in the Imperial Navy. However, there is no canon support for this statement, which seems to derive from the Star Wars Technical Commentaries website's interpretation of his rank insignia."}, {"tag": "p", "text": "Although he is not credited in the film, Khurgee was played by actor Christopher Muncke. His voiced was dubbed by Harry Shearer."}, {"tag": "p", "text": "The novel Death Star incorrectly identifies Khurgee as a lieutenant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}