{"url": "Ki-Adi-Mundi%27s_squad", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles in need of updating", "Category:Grand Army of the Republic squads"], "nodes": [{"tag": "h1", "text": "Ki-Adi-Mundi's squad"}, {"tag": "p", "text": "A squad of 21st Nova Corps served under Jedi General Ki-Adi-Mundi and Marshal Commander CC-1138 \"Bacara\" during the Fourth Battle of Mygeeto. However, during their attack, Supreme Chancellor Sheev Palpatine issued Order 66 to the Grand Army of the Republic. Commander Bacara, despite briefly hesitating, followed the command and ordered the clone troopers to fire on their Jedi commanding officer. While Mundi was briefly able to defend himself, the squad was able to overwhelm and kill him."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By the end of the Clone Wars, the Galactic Republic managed to push the Confederacy of Independent Systems back to the Outer Rim Territories. During this campaign, known as the Outer Rim Sieges, the Republic continued the three year long Mygeeto Campaign under Jedi General Ki-Adi-Mundi and Clone Commander CC-1138 \"Bacara.\" By the time they were fighting on one of Mygeeto's bridges, Mundi led a squad of the 21st Nova Corps, including Commander Bacara. During their push to take the Separatist controlled bridge, Mundi called that they needed to take it and tried to lead them forward, but Bacara received Order 66 from Supreme Chancellor Sheev Palpatine through the comlink in his helmet. While Bacara hesitated with a moment's disbelief, he and all other clone troopers were forced to follow the order due to the behavioral modification biochips implanted in them."}, {"tag": "p", "text": "Bacara ordered for the troops to fire on Mundi, but the Jedi turned around in time, so he saw the squad stopped in their tracks with their blasters raised. The squad opened fire, and, while Mundi was able to deflect several of their blaster bolts back, there was little chance for him to survive the close-quarters attack. A blast struck Mundi in the chest, and he was quickly killed by the clone's blaster fire. After reflecting on his actions, Bacara was quite satisfied in following the order. Bacara even believed he would gladly do the same to anyone else who was a \"threat\" to the Galactic Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "This squad was an infantry group made up of Galactic Marines, who were some of the most highly trained clone troopers in the Grand Army of the Republic. The clones of the squad were equipped with the DC-15A blaster carbine or the DC-15A blaster rifle. Like other marines, they also wore synthmesh visors, which filtered out pollutants, such as poisonous gases, and other hazards. Their armor, which was made to withstand the harshest conditions, also had a blast-resistant kama, heavy-duty heater battery pack, and limited leg armor to provide maneuverability."}, {"tag": "p", "text": "The squad wad led by Jedi General and Council member Ki-Adi-Mundi, who used his lightsaber in combat. Clone Marshal Commander Bacara also served in the group. During the assault on Mygeeto, Bacara used a DC-15A blaster carbine. While Mundi and Bacara were constantly at odds with one another, Mundi was able to form a close professional bond with the Clone Commander. However, due to the control chip implanted in him, Bacara was forced to obey Order 66 when it was issued to the Grand Army."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This squad first appeared in the 2005 saga film, Star Wars: Episode III Revenge of the Sith, during the Order 66 sequence. It was later identified to be a squad in the 2018 canon reference book, Star Wars: The Complete Visual Dictionary, New Edition. However, The Complete Visual Dictionary incorrectly says that Mundi ignited his lightsaber when the squad opened fire, while Revenge of the Sith shows that Mundi had ignited the blade before his clones turned on him."}, {"tag": "p", "text": "In the comic book Kanan 2, while being faced with Order 66 on the planet Kaller, Jedi Padawan Caleb Dume experienced a vision of the clones turning on their Jedi. Among the deaths he witnessed was Mundi being shot by his squad. However, the comic depicted Order 66 occurring after the Conquest of Kaller, while Aftermath, the premiere episode of the Star Wars: The Bad Batch animated series, would later depict Order 66 occurring on Kaller concurrent to the battle."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}