{"url": "Kian%27thar", "categories": ["Category:Legends articles", "Category:Kian'thar", "Category:Outer Rim Territories species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Kian'thar"}, {"tag": "p", "text": "Kian'thar were humanoid nomadic people from Shaum Hii, most notable for their ability to sense emotions. Though they evolved from land-dwelling reptiles, their culture was based around the seas and oceans of Shaum Hii. They only became part of the galactic community in about 300 BBY, due to the difficulty of travel in the Tragan Cluster and the Bakisian Drift. They were finally discovered by the Shistavanen scouts who charted the cluster."}, {"tag": "h2", "text": "Biology and Appearance"}, {"tag": "p", "text": "Kian'thar were humanoids, standing 1.8 to 2.1 meters tall. They had purplish-pink heads, keratin plates protecting their necks, and large, deep-set eyes. One of their most distinctive features was the two dangling, tentacle-like olfactory organs on their faces."}, {"tag": "p", "text": "The Kian'thar emotion sense was their most notable feature. They used this ability to avoid conflicts with others, though unscrupulous Kian'thar used it to manipulate people and start conflicts. This ability even worked well on non-Kian'thar. Though this put Kian'thar in demand on other planets, many non-Kian'thar were wary of the Kian'thar's empathic ability."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In around 300 BBY, the Kian'thar were discovered by Shistavanen scouts. Many of them embraced their new found connection with the wider galaxy, hoping to become famous and wealthy. From 278 BBY to 211 BBY they unsuccessfully attempted to colonize the world of Bestine IV, but were thwarted by the harsh environment. By the Imperial era, nearly two million Kian'thar had left their planet to seek their fortunes, often using their empathic skills as mediators or counselors. These Kian'thar were noted for their wanderlust and appetite for hard work. Kian'thar emigrants included Rebel operative Kkral'Nas, MadisCorp mediator Ttul'Thar, and criminal Lleag'Mak."}, {"tag": "h2", "text": "Society and Culture"}, {"tag": "p", "text": "Kian'thar usually lived in small villages near marshes and shorelines. Their main economic activity was the ranching of derlacs, large grazing beasts that roamed Shaum Hii's oceans. These herds roamed freely, with each Kian'thar family branding the derlacs of their individual herd to avoid confusion when it came time to take them to market. Derlac herders traveled on bentails, large flying beasts. Kian'thar ranchers frequently developed close bonds with their mounts."}, {"tag": "p", "text": "Their technology was fairly primitive, even after contact with the Shistavanen. Aquatic speeders were rare on their homeworld, and most Kian'thar claimed to have no use for other sophisticated devices like droids. Not all of the Kian'thar were isolationists, however—they were divided between the Iith'lon, or Preservers, and Lllun, or Progressives. While the Iith'lon wanted to keep their traditional way of life, the Lllun desired greater integration with the galactic community. The disagreements between these two factions rarely went beyond arguments over cups of oceanroot, however."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}