{"url": "Kidd_Kareen", "categories": ["Category:Legends articles", "Category:Males", "Category:Podracers", "Category:Rutian Twi'leks"], "nodes": [{"tag": "h1", "text": "Kidd Kareen"}, {"tag": "p", "text": "Kidd Kareen was a male Rutian Twi'lek podracer who lived during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Inspired by Anakin Skywalker, who had won the Boonta Eve Classic at the age of nine, Kidd Kareen's parents began training their son as a podracer before he could even walk. He traveled with the podracing circuit around the galaxy, and formed an unbeatable racing team with San Maxus. In 22 BBY, he met Ahsoka Tano who was undercover at the time as a fellow podracer, while trying to find a Separatist agent who had possessed a top secret Republic data file. After one of his races he met with her and the two realized they had a mutual attraction to each other. Lending her a podracer for the big race, he kissed Ahsoka on the cheek for luck before leaving to go to his team."}, {"tag": "p", "text": "Maxus, after consulting with Dooku, revealed himself to be a Separatist agent and showed Kareen who Ahsoka really was: a Jedi. During the final race on Mon Gazza, Kareen was forced to decide whether to help Ahsoka or remain loyal to Maxus, who was intent on killing her. He chose to assist Ahsoka when Maxus destroyed her podracer, and together they caught up to Maxus. Upon arriving, Ahsoka and Kareen found themselves facing Asajj Ventress, who had come to meet Maxus in order to retrieve the Republic data file he had stolen. However, before Maxus could hand off the Republic datafile, Anakin destroyed the file by Force crushing it."}, {"tag": "p", "text": "Afterwards, Kareen and Ahsoka parted ways. Kareen offered Ahsoka a chance to be on his team, but she had to turn him down due to her obligations to the Jedi Order. After Ahsoka said her master's last name, Kareen realized who Anakin was, and challenged him to a friendly race someday when the war was over. Anakin went back into the Twilight, and before Ahsoka left he kissed her hand."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}