{"url": "Kidnapped", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Kidnapped"}, {"tag": "p", "text": "\"Kidnapped\" is the eleventh episode of the Star Wars: The Clone Wars television series' fourth season. This is the first episode in a three-part storyline about the slavers of Zygerria and the missing people of Kiros. It aired on November 25, 2011."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "\"Zygerrian slavers are behind the sudden disappearance of an entire colony of people on the planet Kiros. As Anakin and Ahsoka rush to defuse a series of bombs planted by the slavers, Obi-Wan must fight with their imposing leader.\""}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In the face of an imminent Separatist invasion, the Togrutan governor of Kiros decides to negotiate with Count Dooku for the welfare of his people, knowing that the assistance Yoda promises him will come too late. Upon landing, Dooku offers to transfer the Togruta into what he calls “a temporary safe haven” while his forces battle the Republic army on the planet."}, {"tag": "p", "text": "Consequently, when the Republic forces under the command of Anakin Skywalker, Obi-Wan Kenobi and Ahsoka Tano land on the surface of Kiros and explore the colony, they encounter none of the colonists. Instead, they are met by a unit of droid commandos, whom they defeat easily, and eventually penetrate the colony up to the governor's tower, which serves as the headquarters of the Separatist occupation force's commander, the Zygerrian Darts D'Nar. D'Nar asks for Kenobi to join him in order to discuss surrender negotiations, an offer Anakin reacts very angrily to, remembering his own childhood in slavery on Tatooine. Obi-Wan tells him to locate the missing colonists and, as Anakin asks Admiral Yularen to initiate a planetary bioscan, enlightens Ahsoka about his former apprentice's painful past, a part of his life Anakin has kept secret from his own Padawan."}, {"tag": "p", "text": "Despite Obi-Wan's expectations, however, D'Nar has no intention of surrendering. Instead, he intends to take Obi-Wan and the others captive and ensure their compliance by threatening to kill the colonists with bombs planted throughout the city. By surreptitiously activating his wrist communicator, Obi-Wan manages to allow Anakin, Ahsoka and Cody to listen in on the conversation, and the two Jedi immediately depart on AT-RTs to find and disarm the bombs. The two Jedi fight their way through the droids left in the city and deactivate the bombs one by one. However, the last two bombs are synchronized, rigged to go off if one of them is tampered with. Before the Jedi can disable them, two sniper droids begin firing at them, pinning the pair behind separate platforms in the square. However, they manage to find a weakness in the droids' design, disabling them and disarming the bombs seconds before they explode."}, {"tag": "p", "text": "In the meantime, to divert D'Nar's attention from the disarming attempt, Obi-Wan exploits the Zygerrians' ancient hatred of the Jedi to goad him into hand-to-hand combat, on terms that the loser surrenders unconditionally to the victor. In order to stall, Obi-Wan does not fight back, but when D'Nar learns that the Jedi have disabled his explosives, he runs for it, covering his escape with a bomb attached to the back of his tactical droid. Alerted by Obi-Wan, Anakin and Ahsoka chase the fleeing Zygerrian to his ship, and manage to leap on board. They disable one of the ship's engines, slowing the escape, and enter via the cargo bay, but in turn D'Nar releases his blixus on the two Jedi. While Anakin engages the blixus, Ahsoka sneaks on to the bridge to stabilize the ship. While Anakin disposes of the blixus, Ahsoka duels and bests D'nar in the cockpit of the ship."}, {"tag": "p", "text": "When Anakin furiously threatens D'Nar to reveal the colonists' whereabouts, D'Nar reveals that his queen intends to use them as merchandise in a slave auction to resurrect the Zygerrians' ancient slavery tradition. Finishing his planetary bioscan, Yularen confirms that the colonists are nowhere on Kiros. The Jedi High Council, suspecting Sith activity, tasks the three Jedi with finding the colonists and rescuing them."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The episode is part of the television series' adaptation of the Star Wars: The Clone Wars: Slaves of the Republic comic arc."}, {"tag": "p", "text": "When the Republic fleet enters orbit over the planet, it is composed of a Venator-class Star Destroyer containing Anakin and Obi-Wan, two smaller Arquitens-class light cruisers and a Republic frigate. However, the vessel that enters the planetary atmosphere is an Acclamator-class transgalactic military assault ship."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}