{"url": "Kidnapping_of_Torra_Doza", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Battles of Castilon", "Category:Missions of the Cold War"], "nodes": [{"tag": "h1", "text": "Kidnapping of Torra Doza"}, {"tag": "p", "text": "In 34 ABY, the First Order tasked the pirate Kragan Gorr and his pirate gang with a mission to kidnap Captain Imanuel Doza's daughter Torra in an effort to coerce him into relinquishing control of the Colossus to the First Order."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The First Order, in preparation for their planned war against the New Republic and the rest of the galaxy, wished to obtain control of the Colossus platform on Castilon for use as a staging area. As at this point they did not want to act openly, they hired Kragan Gorr and his Warbird gang to attack the platform repeatedly with the intent to pressure Captain Imanuel Doza, the Colossus' owner, into allowing the First Order a presence on the station for the purposes of security."}, {"tag": "p", "text": "Around the same time, the Resistance became aware of First Order activity around the platform, and to that end sent newly-recruited spy Kazuda Xiono on a mission to the platform, accompanied by astromech droid BB-8. Xiono was present during, and helped fight off, two of the pirates' attacks, but remained unaware of the connection between the pirates and the First Order. In fact, Xiono, along with Poe Dameron, unwittingly assisted the Warbird gang in getting their own spy, Synara San, onto the Colossus when they rescued her from a derelict freighter after a raid gone wrong. Xiono, unaware of San's true allegiance, considered her a friend, and over the course of her time on the platform, San began to reciprocate, coming to care about both Xiono and several of his friends, including Tamara Ryvora and Torra Doza. However, BB-8 harboured doubts about San's trustworthiness."}, {"tag": "p", "text": "The Warbirds' second attack had done enough damage to the platform that Captain Doza had been forced to reconsider the First Order's offer of protection. However, Doza was still reluctant to accept, which made the First Order impatient. They were also displeased that the pirates they had hired hadn't yet had the effect of driving Doza into their arms. To that end, Commander Pyre and Captain Phasma came up with another plan. During a hologram conversation with Gorr about his gang's ineffectiveness, the Quarren demanded triple the pay he had initially negotiated with the First Order due to higher-than-expected losses during the campaign. Pyre and Phasma agreed, but insisted that Gorr and his gang kidnap Torra, who Doza was very close to and protective of. Gorr agreed."}, {"tag": "h2", "text": "The kidnapping"}, {"tag": "p", "text": "Gorr contacted San some hours before the planned operation and told her to be on the late shift at the Colossus loading docks that night, in order to ensure a cargo container in which Drell and Valik would be hiding in got through security. She was to let them out and help them enter Doza Tower. San was suspicious and wanted to know exactly what the operation was about, but Gorr refused to explain, accusing her of having gotten too attached to the platform, and he told her that when this was over, she would be able to return to the Warbirds and her real friends. San then went to Aunt Z's Tavern, where she encountered Xiono, Ryvora and Torra, who were playing holo-darts. Torra, reminded of her recently-acquired hologame Drone-Blaster, invited Xiono, Ryvora and San, along with BB-8, up to her bedroom in Doza Tower. San was surprised to be invited along, and even more so that they considered her a friend. While playing the game, San asked Torra about the increased security presence in the tower, which she attributed to the possible presence of spies on the Colossus. San eventually had to leave due to her comlink buzzing, and Torra told everyone that, as her friends, they were welcome to use her security code to access the tower anytime."}, {"tag": "p", "text": "That evening, Captain Doza was contacted by Commander Pyre, who stressed that if the Colossus continued to go unprotected by the First Order, the pirate attacks would continue, pointing out that Doza needed soldiers, instead of racers like the Ace Squadron, to protect his platform. Doza remained reluctant. The conversation was interrupted by the arrival of Torra, and her father asked her to leave as he was discussing an important security matter."}, {"tag": "p", "text": "Later that night, as planned, the crate containing Drell, Valik and their speeder bikes was delivered to the Colossus, and San, working the late shift, was on hand at the loading docks to let them out once they were alone. Unbeknownst to her, Xiono had decided to come over to the loading decks to see if he could get any more parts for the Fireball, accompanied by BB-8. The two arrived to see San with her fellow pirates, and hid, Xiono assuming that she was in trouble of some kind. When the three pirates departed the loading docks, the two Resistance members followed behind, taking care to remain out of view. Although they were as silent as possible, in the Colossus' internal corridors, Drell heard the two pursuers and turned around, but Xiono and BB-8 were hiding by then. Xiono was forced to suppress a scream of pain from BB-8 rolling over his foot until after the pirates had left. Afterwards, the two ran off in search, having not seen which door the pirates had entered from their hiding place, as Xiono was now convinced that San was in danger."}, {"tag": "p", "text": "San, Valik and Drell used a grappling cord to scale the side of Doza Tower to a level with an external door. Avoiding a few security droids, they reached the door, and San keyed in Torra's security code to allow the pirates entrance. Valik and Drell went ahead, telling San to stand guard, and it was only as they left and the door closed behind them that Drell revealed to San that their mission was to kidnap Torra. San, having grown attached to the girl, was horrified, and headed off unsure of what to do. On the way to their target, the two pirates disabled a quartet of security droids with a droid popper. Torra was in her room, playing Drone-Blaster and facing away from the door, when Valik and Drell arrived. She was alerted to the pirates by her pet Buggles, who began to growl."}, {"tag": "p", "text": "In the lower levels, San contacted Gorr and demanded he explain himself about the kidnapping job. He explained that the First Order had promised to pay them triple the credits for the mission, and accused her of getting soft and beginning to see the Colossus residents as her friends. He ordered San to get to the skiff and bring Torra to him. Disgusted, San resolved to stop the abduction. Captain Doza was eventually alerted to the deactivated droids and his daughter's absence from her room by 4D-M1N, and promptly gave orders for security droids to search the entire platform."}, {"tag": "p", "text": "Xiono ran into San on the lower levels, and she informed him of Torra's kidnapping and that they had to stop it. However, they arrived at the loading docks too late, seeing Valik and Drell fleeing over the ocean on their speeder bikes with Torra. They then set out for Jarek Yeager's Repair Station, where Xiono told San to contact Captain Doza while he and BB-8 entered the Fireball. Upon hearing that his daughter and her kidnappers were off the platform, Doza ordered the Aces to scramble, as Xiono followed the pirates in his ship. Xiono had enough of a head start to see Drell and Valik meeting up with a skiff piloted by a Hassk pirate, which they boarded before sending off their bikes with brightly-glowing engines as decoys, leaving them onboard the harder-to-spot skiff. Gorr, informed of the kidnapping's success, contacted Commander Pyre, who informed the pirate leader his payment was en route. Drell manned the skiff's turbolaser and managed to damage the Fireball's transponder, preventing Xiono from relaying his coordinates immediately."}, {"tag": "p", "text": "When the Aces scrambled, they initially located the abandoned speeder bikes, only to realize they were decoys when Bo Keevil got low enough for a good look. They then spread out in a wider search pattern. Xiono continued to follow the skiff, avoiding fire, as BB-8 worked to repair the Fireball. Torra eventually pretended to slip and kicked the base of the weapon, knocking it out of commission and allowing Xiono to follow more closely. The skiff eventually reached Gorr's sail barge, the Galleon, and Xiono was forced to retreat again due to turbolaser fire. The pirates dragged Torra aboard as she struggled. BB-8 was forced to put out several fires before finishing his transponder repair, and Xiono immediately relayed the coordinates to Doza and the Aces. At this point, the Fireball's proximity alarms detected the presence of an approaching Upsilon-class command shuttle, causing Xiono to veer farther away from the Galleon."}, {"tag": "p", "text": "The shuttle, docking with the pirate vessel, disgorged Major Elrik Vonreg and several stormtroopers. Vonreg, carrying a case, informed the pirates that Commander Pyre \"sent his regards\" before opening fire on them, as he and his crew \"rescued\" Torra from the kidnapping they had arranged. Xiono, watching from the Fireball, was astonished at the rescue, as the First Order vessel fired on their former pirate proxies. Gorr, meanwhile, was outraged by the betrayal. Doza, after being contacted by Vonreg, ordered the approaching Aces to hold their fire and escort Vonreg's shuttle back to the Colossus."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Vonreg, upon reuniting Torra with her father, insisted on leaving behind a small guard detail. Captain Doza, grateful for the \"rescue\", requested some more time to consider the First Order's offer as he wanted to make sure his daughter was all right. Xiono, returning to the Colossus and watching Vonreg's departure, expressed his disbelief at the events to BB-8, who agreed with him that there was something not right about what had transpired. However, most residents of the Colossus, including Tam, fell for the ploy, believing the rescue was completely genuine and that the increased stormtrooper presence on the platform was completely due to Captain Doza's wishes for increased security. This allowed the First Order to begin their occupation of the planet."}, {"tag": "p", "text": "At the loading docks, San, contacting Gorr, was told that the First Order had betrayed the Warbirds, so their deal was over. San asked Gorr what that meant for her, but was forced to end the transmission upon hearing Xiono and BB-8 approach. Xiono confirmed that San had been with two \"customers\" earlier in the evening, and departed. Talking with BB-8, he concurred that the droid's distrust in San had been warranted, as she was clearly a pirate or in league with them. However, despite realizing that San was a spy, Xiono still helped her escape from the First Order before they could arrest her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}