{"url": "Kidnapping_on_Munto_Codru", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Pakuuni sector", "Category:Battles of the Empire Reborn campaign"], "nodes": [{"tag": "h1", "text": "Kidnapping on Munto Codru"}, {"tag": "p", "text": "The kidnapping on Munto Codru was an Empire Reborn mission."}, {"tag": "h2", "text": "Background"}, {"tag": "p", "text": "Under pressure from the loss of his Reborn army during the Assault on Yavin, Lord Hethrir needed to complete his pact with Waru quickly. He identified the Solo's youngest son, Anakin specifically, as having a great enough Force potential to facilitate the pact."}, {"tag": "p", "text": "Chief of State Leia Organa Solo was undergoing a tour of Outer Rim planets at the time. Passing over Mon Calamari and Gbu, Hethrir decided on the planet Munto Codru for his kidnapping attempt. The local tradition of ritualized \"coup abductions\" would provide the perfect cover."}, {"tag": "h2", "text": "The mission"}, {"tag": "p", "text": "While Leia was tied down meeting local ambassadors, such as Ambassador Kirl, Hethrir used his Force ability to temporarily remove her ability to sense her children. Accompanied by Empire Youth he then attacked the children in a secluded glade."}, {"tag": "p", "text": "Using a pressure bomb to knock out Chewbacca, a local page and the children, a tractor beam and skiff were used to remove a round circle of grass with the children unconscious upon it. The wyrwulf of the chamberlain, Iyon was also captured."}, {"tag": "p", "text": "Hethrir also used the Force to allow two hours to pass before Leia was informed of the kidnapping. This created ample time to get offplanet before any reprisals occurred. Leia order the closing of the Munto Codru Spaceport, but it was too late. Accompanied by Chewbacca, and R2-D2, she would leave the planet to search for her children."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}