{"url": "Kijimi", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Bryx sector planets", "Category:Destroyed planets", "Category:First Order planets", "Category:Ice planets", "Category:Kijimi locations"], "nodes": [{"tag": "h1", "text": "Kijimi"}, {"tag": "p", "text": "Kijimi was a frigid mountainous planet located in the Bryx sector of the galaxy's Mid Rim. It was the homeworld of Zorii Bliss, leader of the smuggling gang known as the Spice Runners of Kijimi. During their journey around the galaxy to uncover Jedi artifacts, Karr Nuq Sin and RZ-7 briefly stopped at Kijimi City to refuel the yacht Avadora. Whilst on Kijimi, Sin was questioned by the First Order as they believed he had a clue to finding the Jedi Master Luke Skywalker. In 35 ABY, Kijimi was obliterated by the Xyston-class Star Destroyer Derriphan of the Sith Eternal Final Order fleet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A terrestrial planet, Kijimi had mountainous terrain. The planet had a frigid climate, with thick drifts of snow covering its Mountains. The atmosphere of Kijimi was breathable to a number of inhabitants, including humans, Boosodians, and Anzellans."}, {"tag": "p", "text": "Kijimi had no central government and was effectively an anarchy with some stability. The self interests of members of the population kept the planet from collapsing."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "New Republic Era"}, {"tag": "p", "text": "Following the fall of the Galactic Empire, lawlessness ran rampant in parts of the galaxy. The New Republic was too weak to pacify deeply criminalized worlds, and its failure lead to widespread apathy. The Empire's collapse also lead to a shake up in the spice trade based on Kessel. Competition for the spice trade increased. The pirates of Kjiimi struck a deal with the mine owners that allowed for an exclusive route in an expanded Kessel Run."}, {"tag": "p", "text": "During the era of the New Republic, the First Order had a presence on Kijimi. Maize Raynshi, the daughter of the First Order officer Vroc Raynshi, overheard her father mention Kijimi, and asked her friend Karr Nuq Sin to check out the planet on his search for Jedi artifacts. Nuq Sin and his droid, RZ-7, landed the yacht Avadora at the spaceport in Kijimi City to refuel, and wandered the streets of the city for some time. When Nuq Sin returned to the Avadora, which Nuq Sin had stolen from Vroc Raynshi with the help of Maize, it was surrounded by First Order stormtroopers. An officer of the First Order questioned Nuq Sin, believing he possessed a map that led to the lost Jedi Master Luke Skywalker. Once the First Order released Nuq Sin, he left Kijimi, returning to his homeworld of Merokia."}, {"tag": "h3", "text": "First Order Occupation"}, {"tag": "p", "text": "The First Order had a brutal occupation on the planet. Martial law was imposed and all major hyperspace routes were blockaded. First Order teams patrolled the city, searching for children to kidnap and turn into stormtroopers."}, {"tag": "p", "text": "The scoundrel Zorii Bliss led the Spice Runners of Kijimi smuggling gang during the war between the First Order and the Resistance. Residing in the Thieves' Quarter, Bliss and the Spice Runners stayed neutral in the ongoing war."}, {"tag": "h3", "text": "Destruction of Kijimi"}, {"tag": "p", "text": "The First Order issued a Protocol 13 and removed all troops from the planet. Kijimi was then destroyed by the Xyston-class Star Destroyer Derriphan of the Sith Eternal's Final Order."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Kijimi had a number of inhabitants, including the human Zorii Bliss, who was native to the planet. The residents of Kijimi wore thick furs and animal hides to combat the cold climate. While on Kijimi, Karr Nuq Sin was unnerved by the disreputable appearance of many of its residents. The Anzellan droidsmith Babu Frik also lived on the planet, working among the Spice Runners of Kijimi."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Kijimi City, home to a spaceport, was located on the peak of Mount Izukika, almost hidden between the mountains and the snow. The ancient architecture of the city reminded Karr Nuq Sin of old monasteries. The Thieves' Quarter was a region of Kijimi where the scoundrel Zorii Bliss resided."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kijimi was created for the 2019 film Star Wars: Episode IX The Rise of Skywalker. It first appeared in the novel Force Collector, written by Kevin Shinick and published in 2019."}, {"tag": "p", "text": "The planet shares its name with a synthesizer from Black Corporation, a Tokyo-based synthesizer company. Director J.J. Abrams is a known customer of the company and can be seen posing with a Kijimi synthesizer in an Instagram post by the company."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}