{"url": "Kijimi_summit", "categories": ["Category:Canon articles", "Category:Battle stubs", "Category:Battles in the Bryx sector", "Category:Events during the New Republic Era"], "nodes": [{"tag": "h1", "text": "Kijimi summit"}, {"tag": "p", "text": "The Kijimi summit was an event organized by Zeva Bliss, leader of the Spice Runners of Kijimi. Inviting numerous criminal allies and enemies to Kijimi under the guise of making alliances, Bliss intended to instead execute the criminals present, lifting the Spice Runners up in the galactic underworld. The summit marked the departure of Poe Dameron from the Spice Runners, eventually leading him to return home."}, {"tag": "p", "text": "While Bliss spoke to her guests, her daughter Zorii, alongside Dameron and the EV-series droid EV-6B6, were sent to activate the trap that would leave the criminals prisoner to the Spice Runners. While Dameron was not initially informed of the summit's true purpose, he eventually realized what Bliss planned to do, and refused to follow his orders. He and EV-6B6 abandoned working for the Spice Runners, helping the criminals escape their execution. At the same time, rogue New Republic officer Sela Trune visited Kijimi intent on killing Zeva Bliss, but was struck down and fatally wounded by the Spice Runner leader."}, {"tag": "p", "text": "After the criminals were freed, some, including Tarand Crowe, remained behind to fight against the Spice Runners. However, EV-6B6 was destroyed by the guard Gezlar, who almost succeeded in killing Dameron. After Trune's defeat, Dameron attacked Zeva Bliss. Bliss overpowered Dameron, but was stopped from killing him by Zorii, who assisted Dameron in fighting her mother. Zorii suggested that she and Dameron defeat Zeva and take control of the Spice Runners, but Dameron refused to continue living a criminal life, leading his former partner to order him to run. Dameron found assistance from Crowe, who directed him to a contact of his on Kijimi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kijimi summit serves as the climax of the novel Poe Dameron: Free Fall, written by Alex Segura and published in 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}