{"url": "Kiki_Dorente", "categories": ["Category:Legends articles", "Category:Females", "Category:Selonians", "Category:Talusians"], "nodes": [{"tag": "h1", "text": "Kiki Dorente"}, {"tag": "p", "text": "Kiki Dorente was a Selonian Female who lived on Talus during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kiki Dorente was a Selonian sept who belonged to the Neetha Den, a Selonian den that inhabited a cave near Nashal, on the planet Talus. By the time following the Battle of Yavin, she served as the advisor to the Neetha den mother."}, {"tag": "p", "text": "After the Battle of Yavin, several Selonians of the den were captured by the Talusian Smugglers and kept as hostages in order to exploit the rest of the den. Circa 1 ABY, the Corellian Security Force was aware of the situation but was unable to intervene in Selonians matters. Agent Taarna thus recruited an independent spacer in order to help the Selonians without involving the CorSec. The spacer met Kiki Dorente in her cave and the Selonian accepted the assistance. She first tasked the spacer to reconnoiter the Smuggler Base where her den mates where supposedly held. After the spacer successfully returned to the Selonian cave with the information requested, Kiki and other Selonian mates developed a strategy against the smuggler. Tika Sileste requested the spacer to eliminate the smuggler guards and destroy the droids in the base. Ravi Thienta asked the spacer to recover stolen Selonian's supplies and destroy the smugglers weapons cache. Lika Fimente tasked the spacer to find the captive Selonians in the base. Furthermore, Kiki Dorente sent back the spacer to the smuggler base in order to gather information about the destination of the cargo shuttles leaving the base. Although the spacer achieved most of the objectives, the assault was only a partial success. The spacer defeated most of the smugglers, including their leader, and crippled their ability to exploit the Selonians. However, the spacer discovered that the captive Selonians had already been shipped to Ord Mantell and sold as slaves. As the situation with the smugglers was concluding, Kiki eventually introduced the spacer to the den mother who thanked the spacer for the great assistance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kiki Dorente appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online-role playing game developed by Sony and published by LucasArts, prior to its closure on December 15, 2011. Kiki Dorente was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}