{"url": "Kikla", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Aquatic sentient species", "Category:Mythology", "Category:Wild Space species"], "nodes": [{"tag": "h1", "text": "Kikla"}, {"tag": "p", "text": "According to Kaminoan legend, the kikla were a sentient species of tiny water dwellers on the planet Kamino. They swarmed together to challenge the significantly larger god-beast Protas for rule over the oceans of Kamino. The kikla met Protas at the Ancient Trench and fought the mystical being for a month, but they were unable to defeat the god-beast, who ate the last kikla when the new moon was in the sky. Despite his victory, Protas was eventually defeated by a pod of aiwha."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Kaminoan legend \"The Tale of the Aiwha Pod\" told of the tiny kikla, a sentient, water-dwelling species native to the oceans of the planet Kamino. The kikla were armed with tiny teeth."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Although diminutive, the kikla were legion and valued the title and honor of being the most powerful in the ocean. As such, they challenged the significantly larger monster-god Protas for supremacy, believing they would overpower him with their large numbers. However, the kikla were prone to infighting, even in the midst of battle against Protas."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In \"The Tale of the Aiwha Pod,\" a Kaminoan legend about the cetacean aiwha and translated by Ryan Kaufman, the kikla assembled a vast swarm to challenge the mystical Protas for rule of the oceans of Kamino. The kikla swarm met Protas in the deepest waters of the Ancient Trench and fought the god-beast for a month. They hoped to overwhelm and outlast Protas with their sheer numbers, but the kikla quarreled amongst themselves and fought inconsistently, inflicting only small wounds with their tiny teeth. The single-minded Protas maintained his strength through the prolonged battle, scattering the kikla school and slowly eating them. Finally, at the rise of the new moon, the god-beast devoured the last of the kikla. Yet despite his victory, Protas was eventually defeated by a pod of aiwha."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The kikla were featured in the Star Wars Legends short story \"The Tale of the Aiwha Pod,\" written by Ryan Kaufman and published in the Star Wars: Republic Commando: Prima Official Game Guide in 2005."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}