{"url": "Kilassin", "categories": ["Category:Legends articles", "Category:Creatures of Cularin", "Category:Creatures of unspecified diet", "Category:Jungle and forest creatures", "Category:Reptiles", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Kilassin"}, {"tag": "p", "text": "The Kilassin were a species native to the jungles of Cularin. They resembled great lizards and dinosaurs from other planets in the galaxy. Their scales varied in color ranging from the subtle to the glaringly obvious, partly due to the fact that color didn't hinder their hunting ability."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Kilassin came in two main body types. Though there were individual variations, the two base body types were long and thin with long legs and compact and dense. The former type surveyed their domains as towering, bipedal stalkers. The latter, shambled through the jungles as gargantuan, lumbering beasts. Though most could walk on hind legs for brief periods, capable of attacking with their forelegs, all Kilassin can walk on four legs. Kilassin have long, thick claws, which were able to dig into dead tree trunks for worms or ripping the throats of smaller creatures. Most had mouths full of teeth which were adapted to varying foods, primarily designed more for grinding than tearing."}, {"tag": "p", "text": "The Kilassin do not handle heat well and during the hottest parts of the year, retreated to deep forested valleys or large lakes. During these times, the Kilassin survived by eating fleshy plants and were known to eat each other on occasion. During the coolest parts of the year, they roamed the planet in a nomadic fashion. They would only stay in one place long enough to breed young, eat, or sleep during this time of year. This was also due to the fact that they could occasionally bring down prey that was too large to eat in one sitting. It was not uncommon though for the hunters to leave the half-eaten carcass behind for other Kilassin to find."}, {"tag": "p", "text": "The Kilassin's primary mode of attack was their powerful claws, not their jaw. After bringing down their prey and ripping it apart with their claws, they would eat. Their teeth made eating plants possible for digestion. Though non-sentient, the Kilassin generally only attacked creatures when hungry, fleeing from needless conflict. Modern weapons scared the beasts off immediately. Fortunate for them, Cularin was far from most dangerous sentient beings and their advanced weapons."}, {"tag": "p", "text": "The Killasin were known to exhibit social instincts protective of their whole pack. If they themselves were threatened by an overwhelming force of predators, some senior members would lure the threat away from their pack, knowing they would be killed this way, but willing to sacrifice themselves to save their kin."}, {"tag": "p", "text": "They are related to the sentient species of Cularin, the Tarasin, as both species have evolved from a common ancestor. The Tarasin nevertheless hunted Kilassins for their skin, bones and organs (which the Tarasin believed had medicinal value)."}, {"tag": "p", "text": "This creature was protected by the Cularin Compact of 154 BBY. Some Kilassin had been captured and domesticated by sentients; corporations such as the Metatheran Cartel used them as beasts of burdens in the deep jungles of Cularin where they could not use their repulsorsleds."}, {"tag": "p", "text": "There were rumors about variant Kilassin hiding in the little-explored Ishkik caverns, that were kept in secret after the Tarasin Revolt."}, {"tag": "p", "text": "In about 19 BBY, the criminal Len Markus traveled to the Heart Tree on Cularin, in search of the Eye of the Sun, an ancient Force-imbued object. To defend himself from potential attackers, Markus used the Darkstaff, a Sith artifact that he wielded, to twist 12 Kilassin into becoming servants of the staff. A group of freelance agents came to the Heart Tree to stop Markus and he sent his Kilassin servants to attack them. However, the Heart Tree responded by summoning a large, powerful Kilassin, which engaged the twisted Kilassin in combat."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}