{"url": "Kilian_Rangers", "categories": ["Category:Legends articles", "Category:Force-based organizations"], "nodes": [{"tag": "h1", "text": "Kilian Rangers"}, {"tag": "p", "text": "The Kilian Rangers were a group of Force Adepts found on the planet Kilia IV in the Unknown Regions. They were descendants of Human colonists from the Core Worlds who had settled on Kilia IV before 1000 BBY. The Rangers and their people had lost all contact with the outside galaxy, but this was soon to end during the era of the Galactic Empire."}, {"tag": "p", "text": "The Rangers were integrated into the aristocratic hierarchy of Kilia IV as servants of the local nobles, though they swore also to protect the common people. They valued chivalry, justice, and the rule of law. When they became aware of Force-sensitive children, they would apprentice them as Squires around puberty. Squires served Kilian Rangers as apprentices and servants. The most powerful Kilian Rangers, equivalent to Jedi Masters, were called Kilian Lords."}, {"tag": "p", "text": "At any one time there were no more than five members, usually one Kilian Lord, two Rangers and two Squires."}, {"tag": "p", "text": "Unfortunately, at some point the Kilian Rangers experienced a schism, much like the Jedi, and the dark side aligned Renegades were born."}, {"tag": "p", "text": "Kilian Rangers used ancient technology called shield gauntlets and Siang lances as part of their symbolism and training. The Shield gauntlet was a small personal energy shield worn on the off-hand which could be used to absorb and even deflect energy weapons and shots, though its range was no more than a few feet. The Siang lance was a weapon built from an ancient sporting blaster, fitted with a bayonet. Rangers often imbued their lances with the Force. The majority of their Force-based skillset involved deflection, using their shield gauntlet. They could redirect blaster bolts at other targets, and successfully deflect fully automatic fire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}