{"url": "Kill_Switch", "categories": ["Category:Legends articles", "Category:Bounty hunter starships"], "nodes": [{"tag": "h1", "text": "Kill Switch"}, {"tag": "p", "text": "The Kill Switch was the personal starship of Beilert Valance, a feared cyborg bounty hunter of the Imperial Period. Originally owned by the pirate Alabar Double Ax, the ship was appropriated and renamed after the Sikurdian raider was hunted down by Valance. The former Imperial stormtrooper officer then gathered a crew and traveled across the far reaches of the galaxy in the Kill Switch, filling their days with violence. By 0 ABY Valance became obsessed with tracking down a young Rebel named Luke Skywalker, and subsequently flew the Kill Switch into some of its most violent actions, including the utter destruction of an unarmed, neutral medical station on Telos IV."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A light cruiser, the Kill Switch was a starship used for piracy and bounty hunting around 0 ABY. Propelled by one large engine near the rear of the craft, the Kill Switch had the kind of firepower that could swiftly disable a freighter-sized craft."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Kill Switch was originally owned and operated by Alabar Double Ax, a notorious Sikurdian pirate who was active during the era of the Galactic Civil War. Double Ax was eventually targeted by bounty hunter Beilert Valance—a former Imperial stormtrooper officer who was rebuilt as a cyborg after suffering grievous wounds in battle with the Rebels—who pursued the pirate from Sikurd all the way to the Red Nebula before apprehending him. Valance then appropriated Double Ax's ship, giving it the name Kill Switch. Valance used the ship as his base of operations, putting together a crew that helped him establish himself as an elite bounty hunter by 0 ABY."}, {"tag": "p", "text": "However, by the time of the Battle of Yavin, Valance had begun to lose his grip on reality. Tormented by his status as a cyborg—he was known for his hatred of mechanicals—Valance had become obsessed with an unnamed \"farmboy who had played a crucial part in the rescue of Alderaanian Princess Leia Organa from Imperial captivity. Valance's hatred wasn't political: rather, he despised the lad for his friendship with two droids. As Valance continued his spiral into madness, he led his crew in a campaign across the Outer Rim on the Kill Switch, embarking on a series of increasingly more violent missions. This culminated in Valance's brutal raid on the unarmed, officially neutral medical facility known as Anglebay Station on Telos IV in 0 ABY. Valance's attack on Anglebay Station slaughtered everyone within the hospital and completely destroyed the facility before he and his hunters returned to the Kill Switch and left as suddenly as they arrived."}, {"tag": "p", "text": "Although many of Valance's crew saw the raid as senseless, it did uncover one valuable piece of information: one of the Kill Switch's crew, Remel Fud, overheard the babblings of an elderly patient that pointed them in the direction of well-known smuggler Han Solo, a known associate of Valance's \"farmboy.\" An ensuing investigation led Valance to believe that his quarry—a young man named Luke Skywalker—could be found on the agrarian Outer Rim planet Aduba-3, and the Kill Switch immediately made haste to the farmworld. Upon arriving at Aduba-3, however, they found that some of Solo's friends were waiting for them: the Kill Switch was met above the planet by the Lepi smuggler Jaxxon and his running partner Amaiza Foxtrain in Jaxxon's ship Rabbit's Foot. Valance immediately recognized that the freighter was making a run on the Kill Switch and quickly ordered his crew to fully activate the ship's shields, saving the ship. The Kill Switch promptly pounded the Rabbit's Foot with its laser cannons and disabled the ship, sending it crashing to the planet below. Valance and his crew followed, only to immediately walk into a trap: once they left the ship, Jaxxon and his compatriots stampeded a herd of banthas, which trampled most of Valance's men. Valance survived to discover that the \"farmboy\" they were defending wasn't the target he was looking for, and after a long laugh, Valance returned to his ship and swiftly resumed his search across the galaxy."}, {"tag": "p", "text": "Valance's pursuit eventually led him to the Outer Rim world Feriae Junction. Valance had little linking his quarry to the world except intuition: many hyperlanes crossed at Feriae Junction, and Valance hoped that the ongoing Imperial blockade of the Rebel-held Yavin system could lead Skywalker to the trading post. By this point, Valance was alone, living on the Kill Switch and surviving by hunting local bounties. Valance's hunch was proven true after several weeks, when a contact tipped the hunter off that he had seen Skywalker on the planet. Valance swiftly tracked Skywalker to a scrap yard, only to ultimately let the Rebel leave after his droid, C-3PO, stepped in to save his life."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "The Kill Switch was originally owned an operated by the Sikurdian pirate Alabar Double Ax, before it was taken and renamed by bounty hunter Beilert Valance. A former Imperial stormtrooper officer, Valance used the Kill Switch as he made his name as one of the galaxy's deadliest hunters, distinguished by his sharp instincts and virulent hatred of droids. Valance populated the Kill Switch with a crew full of hardened killers, including his feared first mate Slssk, a Hutlarian former gladiator. Also among the hunters that once called the Kill Switch home was Remel Fud, once a notorious gun-for-hire in the Nembus sector who had been targeted by Valance during his days as an Imperial officer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kill Switch first appeared in Star Wars 16, written by Archie Goodwin and released in 1978. Although it originally went unnamed in its appearances in the Marvel Star Wars comic run, it was officially named in The Hunt Within: Valance's Tale, a 2004 Star Wars Miniatures scenario written by Jason Fry."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}