{"url": "Killun_71", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire moons", "Category:Rocky moons"], "nodes": [{"tag": "h1", "text": "Killun 71"}, {"tag": "p", "text": "Killun 71 was a moon occupied by the Galactic Empire in the years leading up to the Galactic Civil War. Its jagged, rocky surface made it difficult to colonize, though the Empire operated an outpost known as Killun Station on one of the rocky protrusions. In an attempt to acquire codes relevant to rebel operations on the planet Lothal, the rebel cell known as Phoenix Squadron infiltrated the outpost, stealing sensitive information from the Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Killun 71 was a moon located near a larger, white celestial body. The moon had a green appearance from space; this was due to an omnipresent layer of mist in its atmosphere. Its terrain was composed of large, rocky protrusions and jagged landmasses that made colonization difficult."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Despite the moon's large, jagged rocks, the Galactic Empire maintained an outpost on Killun 71 known as Killun Station. Established and operated by the Imperial Security Bureau, Killun Station contained sensitive data and orbital clearance codes for the planet Lothal, making the base a prime target for the rebel cell known as Phoenix Squadron, which was planning an upcoming attack on Lothal."}, {"tag": "p", "text": "In 2 BBY, Phoenix Squadron agents Wedge Antilles and the droids C1-10P and AP-5 infiltrated Killun Station to recover the Lothal codes. Although Chopper was compromised by Imperial Information Office Controller LT-319, the two droids were ultimately successful in their mission."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "One of Killun 71's jagged landmasses was home to Killun Station, an outpost operated by humans and droids of the Imperial Security Bureau. Due to the sensitive nature of the data stored in the base, security was especially tight. Stormtroopers were stationed at every entrance, and the base was equipped with walkthrough identification scanners."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Killun 71 made its first appearance in \"Double Agent Droid,\" the nineteenth episode in the third season of the Disney XD animation television series Star Wars Rebels. The episode aired on March 11, 2017. \"Killun 71\" is likely a reference to Star Wars Rebels art director Kilian Plunkett, who was born in 1971."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}