{"url": "Kimmi_Chyler", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Females", "Category:Humans", "Category:Swoop racers"], "nodes": [{"tag": "h1", "text": "Kimmi Chyler"}, {"tag": "p", "text": "Kimmi Chyler, cousin of Tian Chyler, was the most successful female swoop racer during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Originally from Corellia, Chyler had outraced both Han Solo and Dengar on Agrilat Swamp Circuit. Her success on the swoop track led her to develop a certain arrogant attitude regarding her skills. She owned a silver, red and blue Flare-S swoop with custom thrusters and steering vanes that were envied by her competitors."}, {"tag": "p", "text": "During one of the championships Chyler had hired Dash Rendar, captain of the Outrider, to provide transport for herself and her team. The Alliance to Restore the Republic had also contacted Rendar about transporting valuable cargo as he moved from race to race on different planets. After an encounter with an Imperial Security Bureau on Lok, where the first race of the season, the Lok Marathon was being held - Rendar was forced to hire an additional security for himself and his ship."}, {"tag": "p", "text": "During the travel from Lok to Rori Chyler had shown her sabacc skills, when she played - and robbed every credit of Rendar's bodyguard companion. She had won the Narmle Memorial Rally, but when she and Rendar returned to Outrider's landing pad, they witnessed signs of a struggle. Even though Rendar immediately became cautious about who tried to get aboard his ship, Chyler was unconcerned."}, {"tag": "p", "text": "On Talus, the site of the Nashal River Race, Chyler decided to play sabacc and, taking Rendar's bodyguard with her, headed for the largest casino in the town of Nashal. She choose to share a table with Lonay, a Black Sun vigo, and several hands progressed without incident. When the Twi'lek had wagered all his credits on a final showdown, Chyler beat him with a pure sabacc and began scooping up her winnings. Though Chyler knew the vigo was someone very important, she didn't care, because making other people look bad was part of her job description. The vigo went furious over his defeat and his guards had to hustle him out of the casino. When Chyler and her bodyguard left the casino, Lonay and his thugs confronted them, stating that Chyler had a skifter. Before they could draw their blasters, Chyler and her companion jumped on a nearby swoop, Lonay and his thugs followed them in a XP-38 sport landspeeder. After a high-speed chase through the streets of Talus Chyler swung her swoop into a dead-end alley, with Lonay's speeder following just behind. At full speed she stood on the braking vanes and the swoop headed straight up out of the alley, while the speeder hit the wall hard. Chyler hovered for a second to appreciate the wreckage and then took the swoop back to the Outrider, still acting unconcerned about the encounter. Even though the team had to leave next day, Chyler still found time for more sabacc games. After winning again in another casino, she was about to leave, when Lonay's agents confronted her in the alley. Chyler proved herself to be as good with a hold-out blaster as with a sabacc deck and eventually escaped on her swoop into the night."}, {"tag": "p", "text": "On Corellia, on her home Agrilat Swamp Circuit track Chyler spent more time than usual getting her swoop ready to race. This helped her win the race to the great irritation of Wrenga Jixton who confronted her and her team shortly afterwards."}, {"tag": "p", "text": "The final swoop race of the season was the Mos Espa Race on Tatooine. Kimmi has won enough races to win the championship if she won Mos Espa. Chyler was invited to a lavish party presented by Prince Xizor's Xizor Transport Company, who were looking to sponsor a team. During the party she chatted with Xizor and became influenced by his Falleen pheromones which caused her to develop a short-lived attraction to him. After the party Chyler, Rendar and their bodyguard stopped by a cantina in Mos Espa, where Rendar met with Luke Skywalker and handed him a datapad with important information. Skywalker commented that the files were going to save multiple lives, when Xizor and his Human replica droid Guri entered the room. Xizor ordered Guri to take the datapad and kill everybody present. The fight spilled out into the streets of Mos Espa, where Skywalker used his lightsaber to protect Chyler and her companions from any blaster bolts. Finally, Xizor ordered Guri to leave, promising to expose all information obtained to the Emperor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}