{"url": "Kina_Margath", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Business owners and executives", "Category:Females", "Category:Foster Agents", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Kina Margath"}, {"tag": "p", "text": "Kina Margath was a Human female who resided on the planet Elshandruu Pica. A businesswoman, she managed Margath's on Elshandruu Pica, a complex of hotels, bars, and casinos—including the famous 27th Hour Social Club—with a galaxy-wide reputation for excellence. Having inherited the business from her parents, Margath successfully ran her business empire for many years. In addition to her duties running Margath's, Margath was a Foster Agent for the Alliance to Restore the Republic, using her facilities to house orphaned operatives and assist them in returning to the Alliance. Margath also assisted the New Republic, the successor state to the Alliance, and helped Commander Wedge Antilles during his campaign against former Imperial Intelligence director, Ysanne Isard, by providing him with information on one of Isard's fleet captains, Sair Yonka of the Avarice."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kina Margath was a Human female who resided on the planet Elshandruu Pica, the sector capital of the Quence sector, in the Outer Rim Territories. She was the owner of Margath's on Elshandruu Pica, an expansive entertainment complex in Picavil, the planet's capital city. The sprawling facility included bars, nightclubs, five-star hotels, and casinos, with the centerpiece being the 27th Hour Social Club. Margath inherited control of Margath's from her parents some time between 14 BBY and 10 BBY and turned the complex into a thriving success with a galaxy-wide reputation for quality service and excellence, employing over 1,500 full-time and around 4,500 part-time workers. Customer numbers in the complex ranged from 10,000 on a quiet day to around 100,000 at its peak. Margath kept track of the customer turnover, and was reputedly the only one able to keep an accurate tally."}, {"tag": "p", "text": "Margath spent much of her free time at the 27th Hour Social Club; the club's reputation and its location at the front of the Margath's complex meant that it was usually the first place that visiting customers encountered. Margath found the diverse mix of species and cultures entertaining, and enjoyed watching people having a good time. The 27th Hour Social Club pledged that if they did not stock or know how to create a patron's drink order, then the customer's tab was on the house. An informal contest arose from the declaration, as new and old customers tried their luck in getting a free bar tab for the night by trying to find new or obscure drinks from throughout the galaxy. The offer cost Margath thousands of credits over the years, but did result in a drinks library of over fourteen million concoctions."}, {"tag": "p", "text": "Opposed to the stance that the Galactic Empire took on trade restrictions and prohibition, Margath was also an operative for the Alliance to Restore the Republic during the Galactic Civil War, working as a Foster Agent. Foster Agents were individuals whose mission was to collect orphaned Alliance operatives—agents who had conducted missions, but missed their scheduled extraction—and see them safely returned to the Alliance. Margath enjoyed allowing Alliance operatives to use her businesses as safehouses as long as they attracted no Imperial attention. The position was a dangerous one, as Alliance operatives who had been given Margath's name as a point of contact could have potentially revealed her name if captured by Imperial forces."}, {"tag": "p", "text": "In 1 ABY, on 35:9:15, Margath's was raided by the intergalactic jewel thief known only as the \"Tombat.\" The master thief penetrated the security vaults of the complex and stole gems and settings belonging to the resort's guests. The total cost of the stolen goods was six million credits, with over two million of those credits being accounted for in a necklace of Corusca stones in a mythra setting belonging to Lady Landric, wife of Moff Landric of the Emmo sector. In their place, the Tombat left a single quella stone, which was the thief's trademark. Margath was upset at the heist, which endangered the reputation that Margath's had established for being a high-security business resort. In response to the theft, Lady Landric announced that a full investigation of the complex would be launched. Two days later, the staff at Margath's discovered that all of the stolen jewelery had been returned to the security vaults, along with another quella stone. Inspector Toorka, who was leading the investigation of the initial theft, stated that he believed that the Tombat had simply changed their mind about the theft, and dismissed the notion of another exceptionally skilled thief returning them after outwitting the Tombat to obtain the jewels in the first place."}, {"tag": "p", "text": "In 2 ABY, Imperial Captain Sair Yonka of the Imperial II-class Star Destroyer Avarice embarked upon an affair with Aellyn Jandi, the wife of the local Imperial Moff, Riit Jandi. Margath found out about the affair and befriended Aellyn, agreeing to keep the affair secret from the Moff. Yonka and Aellyn used Margath's for their liaisons, and Margath allowed rumors to spread that Yonka was romancing her. In return, Aellyn secured favorable treatment for Margath's business operations from Moff Jandi, and Yonka supplied her with exotic drinks from the worlds he visited, which helped the 27th Hour Social Club to keep its promise that it could supply any known drink to a patron. Around the same time, Margath acquired a small supply of good-quality Skannbult Likker, a drink whose quality varied greatly. Considered to be the most potent fire-water in the galaxy and unique to the planet Skann in the Astal sector, Skannbult Likker was created locally by the world's farmers. Low-quality, quickly brewed rotgut was readily available, but the high quality product was rarely seen off-world. Margath refused to reveal her supplier, selling double measures for between fifteen and twenty-five credits, although the fast turnover and limited quantity of the liquor made her consider raising the price to twenty credits per single measure."}, {"tag": "p", "text": "In 7 ABY, Commander Wedge Antilles and Rogue Squadron resigned their commissions from the Defense Force of the New Republic—the successor state to the Alliance to Restore the Republic—in the wake of the liberation of Coruscant, the galactic capital. The former Director of Imperial Intelligence, Ysanne Isard, had seized control of the planet Thyferra and the Bacta Cartels by allying herself with the Xucphra Corporation, but the New Republic was hesitant to embroil themselves in what was technically a Thyferran internal affair, so Antilles and his compatriots fought a private campaign against her. Looking to learn more about the forces under Isard's command, Antilles put out requests for information on her starships and commanders, including Captain Sair Yonka. Margath responded with a full report of Yonka's affair. Using that information, Antilles and the Rogues ambushed Yonka while he was visiting his mistress, and offered him a deal to defect to their cause, which he took."}, {"tag": "p", "text": "Sometime in 7 ABY, Margath bought three GAT-12 Skipray Blastboats, which were housed at the starport on Elshandruu Pica. In a brazen move, the Saurton pirate Miktiss stole the three ships as a low-level criminal in his employ created a distraction. Miktiss and his pirates absconded with the ships before the planetary patrol vessels could react. Margath vowed to find out who had stolen the Blastboats. By 11 ABY, Margath's was being regularly supplied with drink concoctions and recipes by the smuggler Booster Terrik. Terrik's son-in-law, Corran Horn, believed Terrik had an attraction to Margath, and found her charming, but Horn's wife, Mirax, believed that Margath was too young for her father."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kina Margath was a professional businesswoman, and projected a confident businesslike persona at all times. Although soft spoken, she was possessed of a quiet authority, and other beings followed her lead. Always immaculately dressed, Margath was effortlessly elegant and appreciated the fine and exotic things in life. Her opposition to the Empire's stance on free trade restrictions led her to lend her time and facilities to the Rebel Alliance as a Foster Agent. However, her involvement in the Alliance did not stop her from striking agreements with those who could supply her with exotic goods, such as Imperial Captain Sair Yonka, and she turned the situation to her advantage by supplying information on his illicit affair with the local Moff's wife to the New Republic."}, {"tag": "p", "text": "Her position running the Margath's complex led her to have an extensive knowledge of alien species, cultures, and languages, and a working knowledge of bureaucratic procedure. She had an interest in gambling, and was able to program and repair computers and operate security systems. Margath carried a hold-out blaster that she was trained in the use of, and generally carried a selection of fake IDs, as well as a forgery kit. She kept between 5,000 and 12,000 credits about her person at all times, and was assisted in running her empire by three Cybot Galactica 3PO-series protocol droids and two Cybot Galactica XC2 administration droids."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kina Margath was first mentioned in West End Games' Galaxy Guide 9: Fragments from the Rim, published in 1993. The publication included information on her and her business, Margath's, in detail, and an illustration of Margath was provided by Mike Vilardi. In 1995, Margath was briefly mentioned in The DarkStryder Campaign in the biography of the Saurton pirate Miktiss, information that would be reprinted in The DarkStryder Campaign, Deluxe—which collected The DarkStryder Campaign and its three supplements into a single boxset—in 1998. Also in 1995, Margath was mentioned in the Galaxywide NewsNets section of Star Wars Adventure Journal 8. However, her name and the name of the complex were misspelt as \"Margrath\" and \"Margrath's,\" respectively."}, {"tag": "p", "text": "In 1997, Margath was mentioned in X-Wing: The Bacta War, and 1998's I, Jedi, both of which were written by Michael A. Stackpole. Margath also received entries in 1998's Star Wars Encyclopedia and its follow-up, The Complete Star Wars Encyclopedia, in 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}