{"url": "Antipose", "categories": ["Category:Legends articles", "Category:Planet stubs", "Category:Centrality planets", "Category:Darth Krayt's Galactic Empire planets", "Category:Galactic Empire planets", "Category:New Republic planets", "Category:Sith planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Antipose"}, {"tag": "p", "text": "Antipose was a planet located in the sector of the Outer Rim Territories known as the Centrality."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Founded as an independent state circa 3350 BBY, the Centrality quickly found its government the puppets of the Hutt Empire. Antipose was settled by Human colonists and became the site of a single city. Avoiding galactic conflict throughout the history of the Galactic Republic, the world joined the Galactic Empire and the entire sector came under the control of the Sorcerers of Tund and their leader, Rokur Gepta. During the Galactic Civil War, the world became the adopted home of the retired pirate Raskar. Earlier in his career, Raskar had stolen a power gem when he worked for the Pirates of Iridium. Using the rarity of the gem as incentive, he built a massive gladiatorial arena to bring in income on the planet; whoever won the competition would receive the gem as a reward. Drawing beings from across the galaxy, Raskar's game brought in enough profit that he could build the largest villa on the world."}, {"tag": "p", "text": "Following the deaths of both Gepta and Emperor Palpatine, the Centrality remained independent from the Imperial Remnant; though it eventually signed a treaty with the New Republic. Untouched by the hordes of Yuuzhan Vong that had invaded the galaxy, the world was absorbed into Darth Krayt's Galactic Empire as of 137 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This world was originally created for the comic strip The Power Gem, published in 1982. Unnamed and simply known as Raskar's world, it was later identified as Antipose by the author of The Essential Atlas, Daniel Wallace, in his blog \"Unstated Canon in the Atlas.\" It may be the same planet as either Antipose IX or Antipose XII."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}