{"url": "Kinetite/Legends", "categories": ["Category:Legends articles", "Category:Alter powers", "Category:Dark side powers"], "nodes": [{"tag": "h1", "text": "Kinetite"}, {"tag": "p", "text": "Kinetite was a variation on the Force lightning ability. It involved molding \"Force energized lightning\" into a sphere of restrained kinetic energy which could be thrown at an enemy. Instead of burning or electrocuting its target like most forms of Force lightning, it acted as a solid projectile. Nevertheless, if the target of the kinetite employed the Force defensively, the kinetite could be deflected back to its origin."}, {"tag": "p", "text": "Darth Vader used this power in an attempt to subdue Luke Skywalker on Mimban. Skywalker, however, managed to deflect it with Obi-Wan Kenobi's help, and later escaped to safety."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the comic adaptation of Splinter of the Mind's Eye depicts Darth Vader using a power superficially similar to Force lightning, the Star Wars: Revenge of the Sith: The Visual Dictionary has stated that it is impossible for Vader to directly channel Force energy through his mechanical arms. Pablo Hidalgo explained in Star Wars Insider Magazine, Issue 80, \"Though the comic adaptation of Splinter, published in the mid-1990s, depicts this action with something that looks an awful lot like Force lightning, the energy that Vader hurls is not exactly that. It is pure kinetic energy—the ball that strikes Luke is called a kinetite, or \"restrained energy globe.\" It is possible it is not even a result of a Force power at all but rather a device that Vader built into his suit.\""}, {"tag": "p", "text": "However, The Rise and Fall of Darth Vader offers a far different explanation, stating that it was Vader's close proximity to the Kaiburr crystal which allowed him to summon \"Force energized lightning.\" The Jedi Path combines these two explanations by stating that Kinetite is a Force power that is created by generating a variation of Force lightning that acted as a kinetically empowered projectile. It is also confirmed that Vader used this power on Mimban, as Luke makes a footnote next to its description in The Jedi Path that Vader used it against him during their duel. What the effect the Kaiburr crystal had on its creation is not known."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}