{"url": "Kingdom_of_Cron", "categories": ["Category:Legends articles", "Category:Tion Cluster historic states", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Kingdom of Cron"}, {"tag": "p", "text": "The Kingdom of Cron was a territory carved out in the Tion Cluster. During the rule of Xer VIII, the pirate father of Xim the Despot, it was also known as Xer's Empire. The kingdom was governed from the capital Chandaar."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Kingdom of Cron was the government of the region of the Tion Cluster later known as the Cronese Mandate. It was ruled by the King of Cron from the capital world of Chandaar. Its principal worlds were along the Greater Cronese Arc."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "Circa 25,150 BBY, the pirate Xer began rapid expansion from his homeworld Argai, creating the Kingdom of Argai within the Kingdom of Cron, King of Cron Ferece summoned Xer to Chandaar, the capital of Cron. Ferece tried to persuade Xer give an oath of fealty, in return for a number of noble titles, and Xer promised to return in a month with a suitable tribute. However, Xer instead led an attack on Chandaar, causing Ferece and his courtiers to flee. In the absence of Ferece, Xer installed himself as the new King of Cron: Xer VIII."}, {"tag": "h3", "text": "Xer's Empire"}, {"tag": "p", "text": "As the new King of Cron, Xer VIII launched several campaings to expand his territory. He explored all the unknown regions of the Tion Cluster and conquered the Kingdom of Barseg. However he didn't manage to conquer the Livien League, the only part of the Cluster out of his control. Circa 25,130 BBY, near the end of Xer's reign, the Kingdom of Cron was divided in three provinces, very similar to the three future Imperial sectors, which one of them was the original Kingdom of Cron."}, {"tag": "h3", "text": "Xim's Empire"}, {"tag": "p", "text": "A decade later his son, Xim the Despot, used the Kingdom as the base for an even more expansive Empire, firstly by conquering the Livien League and his rule soon stretched from the Radama Void to the Hutt Space. During that time, Chandaar stayed the capital of the kingdom but Argai became the capital of the empire."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "Following the death of Xim, c. 25,100 BBY, his empire quickly collapsed and new states were quickly formed out of the former territory of the empire. The Kingdom of Cron became independent again but its territory was considerably reduced, similar to the original kingdom."}, {"tag": "p", "text": "Circa 24,000 BBY, the Tion Cluster and the kingdom joined the Galactic Republic. In the Republic's final years, the Cluster joined the Confederacy of Independent Systems. At this time, the Cluster was shared between the Kingdom of Cron and a larger Tion Hegemony."}, {"tag": "h3", "text": "Modern history"}, {"tag": "p", "text": "Following the end of the Clone Wars, the Galactic Empire divided the Cluster in three sectors. The Kingdom of Cron was reorganized as the Cronese Mandate, a sector almost similar to the historical kingdom, and containing the fourteen worlds of the former Kingdom of Cron."}, {"tag": "h2", "text": "Known systems"}, {"tag": "h2", "text": "Known Kings"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Essential Atlas erroneously refers to the Xer's Empire as forming in 25,120 BBY, a decade after Xim had already assumed the throne."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}