{"url": "Kintan/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic planets", "Category:Kintan locations", "Category:Si'Klaata Cluster planets", "Category:Slavery worlds", "Category:Terrestrial planets", "Category:Type I atmosphere planets", "Category:Yuuzhan Vong planets"], "nodes": [{"tag": "h1", "text": "Kintan"}, {"tag": "p", "text": "Kintan was the homeworld of the Nikto. After a supernova explosion near the system, evolution of the Nikto divided into five subspecies. Kintan was located within the Si'Klaata Cluster, on the Ac'fren Spur."}, {"tag": "p", "text": "Kintan striders, also found around the galaxy as pets of Hutts, were originally from Kintan. However, they were driven to extinction on the planet itself."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 26,000 BBY, the Cult of M'dweshuu formed on Kintan. This violent cult worshiped the nearby M'dweshuu supernova. Around 25,130 BBY, the Cult came to power, and the planet was plunged into four civil wars. In 25,100 BBY, under the terms of the Treaty of Vontor, the Niktos were permanently indentured to the Hutts. The Cult did briefly drive the Hutts offworld about 1000 BBY. Kintan apparently did join the Galactic Republic at least two decades before the Clone Wars, having direct Senate representation, but the Senators were merely mouthpieces for the Niktos' Hutt masters. A new wave of Cult violence broke out in 22 BBY, making travel on the Sisar Run dangerous."}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "During the time of the Cold War, a proxy conflict between the Sith Empire and Galactic Republic, miners on the world had discovered cave paintings, presumably made by pre-civilized Nikto. Eventually, someone was sent to discover the history behind the paintings. Findings revealed that the paintings depicted four terrible wars in Kintan's ancient past and honored a warlord named Da-Shek Yalaa."}, {"tag": "p", "text": "The Morgukai warrior tradition arose on the planet, elite and isolated from other Nikto. In 30 BBY, exiled Twi'lek Kh'aris Fenn took up residence in Fortress Kh'aris on Kintan, guarded by the last two Morgukai, Tsyr and Bok. The two Morgukai kidnapped the Twi'lek heir Nat Secura and brought him to the fortress, but the Jedi saved Nat and slew Tsyr. Bok died on Saleucami during the Outer Rim Sieges in 19 BBY, along with an army of his clones."}, {"tag": "p", "text": "The planet was later taken over by the Yuuzhan Vong in 26 ABY. During the occupation, 75% of the Nikto population was either enslaved or killed, while the rest either fled Kintan or went into hiding in the planets most inhospitable areas. In the years following the war's end, the population slowly returned to its former levels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}