{"url": "Kira_I", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Destroyed planets", "Category:Kira system planets"], "nodes": [{"tag": "h1", "text": "Kira I"}, {"tag": "p", "text": "Kira I was a planet in the Kira system, a part of the Expansion Region's Kira sector. It was an uninhabitable world with no apparent resources of value."}, {"tag": "p", "text": "Kira I was surveyed by Galactic Republic scouts visiting the Kira system years before 70 BBY. At some point following the initial survey, Kira I and two other planets of the system were destroyed by a cataclysm of unknown origin, leaving behind an asteroid field."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kira I was an uninhabitable planet located in the Kira system. Occupying the closest orbital position around its sun, the planet was a part of the Kira sector, which lay in the Trailing Sectors portion of the Expansion Region."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The area of space surrounding the Kira system was explored between 8000 BBY and 5500 BBY. Between 1004 BBY and 1000 BBY, near the end of the New Sith Wars, the system was situated in territory considered either unaligned or contested by the warring Galactic Republic and Brotherhood of Darkness."}, {"tag": "p", "text": "Years before 70 BBY, a Republic scouting team visited the system, giving it only a cursory sensor scan. The scouts did not detect any evidence of valuable resources on Kira I."}, {"tag": "p", "text": "When a follow-up survey of the Kira system was conveyed years later, it was discovered that the three inner planets of the system, including Kira I, had been destroyed by a cataclysm of unknown origin, with only a massive asteroid field remaining in their place. No cause for the planets' destruction could be determined by the survey, and further exploration of the Kira system was abandoned."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kira I was first mentioned in Twin Stars of Kira, a 1993 supplement for West End Games' Star Wars: The Roleplaying Game. Within the book, the planet was mentioned in a section authored by Stephen Crane."}, {"tag": "p", "text": "The 2009 reference book The Essential Atlas placed the Kira system, and therefore Kira I, in grid square N-15. However, the StarWars.com Online Companion to The Essential Atlas later changed the placement to grid square N-16, which this article assumes to be correct."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}