{"url": "Kira_Run", "categories": ["Category:Legends articles", "Category:Expansion Region hyperlanes"], "nodes": [{"tag": "h1", "text": "Kira Run"}, {"tag": "p", "text": "The Kira Run was a hyperlane that was located in Expansion Region. It connected the Harrin Trade Corridor at the Lazerian system with the Enarc Run located at the Ropagi system and was established during the last decades of the Old Republic."}, {"tag": "h2", "text": "Astrography"}, {"tag": "p", "text": "The Kira Run connected the Lazerian system and the Ropagi system, thus building a link between the Harrin Trade Corridor and the Enarc Run respectively. The only stopover on the route was the dead Kira system, which consisted of a massive asteroid field and the planet Kira IV. These asteroids presented a danger to anyone who would travel the route."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Enarc Run and the Harrin Trade Corridor had been well-established hyperlanes for a long time and were thriving with trade. Attempts to connect these two profitable routes, however, were difficult due to the lack of navigation points and numerous deep space hazards between them. This changed when explorers found a reference to the long destroyed and forgotten planet of Kira Prime. Using the Kira system's existing coordinates as a reference, the Haik Expedition started out from the Ropagi system. The route was formally established on 4:11 in 70 BBY."}, {"tag": "p", "text": "The route, however remained dangerous because the asteroid field of the Kira system was largely unstable. For the first decades of its existence, travel on the route was limited to a few shuttle operations. The Run was profitable for those who made it, but ever so often, people died in hyperspace accidents. Around 0 ABY larger trading corporations established standard runs along the route and it soon became an indispensable part of galactic trade. Lazerian and Ropagi - the end points of the Kira Run - experienced an economic boost and became known as the \"Twin Stars of Kira\"."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Lazerian IV"}, {"tag": "p", "text": "Lazerian IV was a terrestrial world located on the Harrin Trade Corridor. It was home to a large Human population, ruled by a monarchy and origin of the Empeth Crystals. The Jedi once had an outpost on the planet. Unbeknownst to the Human population, the planet also was home to Akwin, a species that lived in the oceans of the world. Both species took great care not to harm the environment of the world."}, {"tag": "h3", "text": "Kira system"}, {"tag": "p", "text": "A dead system filled with asteroids and one world, the Kira system was the middle point of the Kira Run. Its name was used to name the Kira Run as well as the Kira sector. Originally the system contained one habitable world, but it was destroyed not long after its discovery - together with two other worlds of the system. After its re-discovery by the Haik Expedition, the Kira system now serves as an stop-over point for all traveling the Kira Run."}, {"tag": "h3", "text": "Ropagi II"}, {"tag": "p", "text": "The world of Ropagi II was home to the near-Human Ropagu and the Kalduu, who lived together in a symbiotic relationship. The Ropagu were physically frail and tended to solve problem through philosophy. To protect their world, they hired mercenaries and off-worlders were limited to only one city. This made Ropagi II the largest mercenary market on the Enarc Run."}, {"tag": "h2", "text": "Travel Times"}, {"tag": "p", "text": "The Kira Run was a short and well-mapped route. With a Class-1 hyperdrive, the travel from the Lazerian system to the Ropagi system did not last longer than two hours."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}