{"url": "Kirtania", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Jungle planets", "Category:Kirtania locations", "Category:Nembus sector planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Kirtania"}, {"tag": "p", "text": "Kirtania was the homeworld of the spider-like, pacifist Araquia people. The Kubaz crime lord Schnil Hakoon settled on the planet and centered his operations in Kinkosa City."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kirtania was the fourth planet orbiting the star Yyrta in the Yyrtan system, in the Nembus sector of the Outer Rim Territories. The world was positioned on a trade route that became popular during the Galactic Civil War. A blue-green world with a decent amount of cloud cover, the planet boasted variable terrain and climates including arctic, deserts, mountains and plains. Kirtania was known for its tropical jungles and woodlands which were full of trees that produced luxury hardwoods. A terrestrial planet, Kirtania had a breathable atmosphere with standard gravity and a temperate climate. Its days lasted for twenty-three standard hours, and the year was 369 local days long."}, {"tag": "p", "text": "The homeworld of the Araquia species, the planet was settled by Humans and various other races. The population numbered some 2 million Humans and 10,000 aliens, which dwarfed the number of 1,500 native Araquia. The planet was divided into three competing economic states, known as Dulai, Kinkosa, and Surana. Kinkosa City was based in Kinkosa. The planet exported medicines, raw materials and metals, and imported high technology in return."}, {"tag": "p", "text": "Kirtania suffered from near constant rainfall. During the rainy season, the rain fell all day and night. During the dry season, the rain was limited to falling in the afternoon and early evening. Large parts of the planet remained unsettled."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Kirtania was the homeworld of the Araquia species, and they numbered in the thousands. The planet was then colonized by several groups of Human and alien settlers, who disturbed the Araquia's natural environment. A misunderstanding between the two groups took place, leading the Araquia to be considered a threat. The Araquia were hunted and exterminated, dropping their population to a mere 1,500 individuals. An understanding was reached, and the Araquia become the overlords and protectors of Kirtania's forests. The economic benefits brought about by the planet's closeness to a popular trade route spurred industrial growth. Soon, the Araquia's knowledge of native plants led them to provide medicines that cured several diseases. One Araquai, Doctor T'Jaleq Kith'Araquia, worked with the noted Ho'Din pharmacologist Sirta Kum to cure the Direllian Plague."}, {"tag": "p", "text": "By the Galactic Civil War, the competitiveness of the three economic states had started to deplete the planet's natural resources as each state attempted to outdo the other. In particular, the tropical jungles and forests were at risk during the demand for luxury hardwoods."}, {"tag": "p", "text": "In an effort to cement a position at the top of Kirtania's economic tree, the state of Kinkosa allied itself with the Galactic Empire. In exchange for privileged trading status over the other two states, and the modernization of Kinkosa City, the state agreed to turn over a large swath of its territory to the Empire for use as a supply station. An Imperial-class Star Destroyer was assigned to patrol Kirtania, and Imperial Customs took over the inspection of incoming ships. Doctor Kith'Araquia tried to persuade the Empire to abandoned their plans through reasoned logic. He failed, and attempted to pass legislation to stop the Empire's activities. The Empire branded him a Rebel sympathizer and was set to arrest him but Kith'Araquia was tipped off. He and his tribesmen retreated into the rain forest to prepare for war."}, {"tag": "p", "text": "During the Galactic Civil War, a group of Rebels based at an outpost on the second moon of Tiragga arrived at Kirtania."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}