{"url": "Kirtarkin/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Anoat sector planets", "Category:Corellian Trade Spine", "Category:Galactic Empire planets", "Category:Terrestrial planets", "Category:Type II atmosphere planets"], "nodes": [{"tag": "h1", "text": "Kirtarkin"}, {"tag": "p", "text": "Kirtarkin was a smoky world of pollution and machinery that traditionally served as the customs checkpoint for the Twin Nebulae sectors in the Greater Javin region of the Outer Rim Territories. Located along the Corellian Trade Spine in the Anoat sector, Kirtarkin collected billions in revenue annually from import/export taxes. During the Galactic Empire's rule, the Imperial Star Destroyer Desolator staged from Kirtarkin while patrolling the Greater Javin."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kirtarkin was a smoky, polluted planet in the Kirtarkin system of the Anoat sector, part of the Greater Javin region in the Western Reaches portion of the Outer Rim Territories. It sat along the Corellian Trade Spine hyperlane and was the Anoat sector's first stop for starships traveling Rimward from the adjacent Javin sector."}, {"tag": "p", "text": "A day on Kirtarkin lasted thirty standard hours, and a year 450 local days. The planet had a temperate climate and standard gravity. Due to Kirtarkin's widespread urban pollution, the planet's atmosphere was classified as Type II, meaning the use of a breath mask was suggested."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A thousand years before the Galactic Civil War, the Corellian Trade Spine formally ended at the planet Javin on the edge of the Mid Rim. Kirtarkin and other worlds lying beyond fell within territory that the Galactic Republic considered then to be Wild Space, an imperfectly surveyed frontier region of the galaxy visited only by scouts and the most daring traders. Countless hyperspace explorers tried to expand the Trade Spine's economic opportunities, but their efforts were thwarted by the dominating Twin Nebulae gas clouds, which proved the greatest impediment to regional navigation."}, {"tag": "p", "text": "Centuries later, the entrepreneur Ecclessis Figg succeeded where his predecessors had failed. Figg's scout ships blazed new hyperspace routes through the Twin Nebulae in the unexplored areas of space on either side of the Trade Spine, which turned the Greater Javin region into an economic powerhouse. The planet Gerrenthum thus found itself at the fortuitous intersection of three lucrative trade lanes, growing from a sleepy frontier outpost to a bustling port world, while Kirtarkin and other surrounding planets followed suit."}, {"tag": "p", "text": "Kirtarkin once fell within the borders of the Republic's Javin sector but was reorganized into the new Anoat sector circa 400 BBY. As the sectoral entry point for Rimward travel down the Corellian Trade Spine, Kirtarkin became the customs world for the Twin Nebulae sectors of Anoat and Yarith. During the reign of the Galactic Empire, Kirtarkin served as the staging point for the Imperial Star Destroyer Desolator on its patrols of the Greater Javin."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Kirtarkin supported a mixed population of 2 billion Humans, Lutrillians, Nothoiins, and Mugaari, who governed themselves in appointed councils."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "An urbanized world of pollution, machinery, and oil slicks, Kirtarkin took in billions of credits each year from tariffs by importing foodstuffs and exporting fuel and technology. The planet had three starports, one stellar and two standard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kirtarkin was created for the 2004 Wizards of the Coast online article \"Galactic Gazetteer: Hoth and the Greater Javin,\" a Star Wars Roleplaying Game supplement."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}