{"url": "Kirtan_Loor", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Corellian Security Force officers", "Category:Humans", "Category:Imperial defectors", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kirtan Loor"}, {"tag": "p", "text": "Kirtan Loor was an agent with Imperial Intelligence and former liaison officer to CorSec who played a large role in the events surrounding the capture of Coruscant by the New Republic. In time, Loor would prove to be one of Rogue Squadron's most persistent enemies. Loor resembled a much taller and younger Grand Moff Tarkin, and possessed an eidetic memory. Both of these traits made Loor very arrogant, making him feel superior to others."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early career"}, {"tag": "p", "text": "The earliest details of Kirtan Loor show that in 2 ABY he became an Imperial liaison officer to CorSec. The officers he was assigned to were none other than Gil Bastra, Iella Wessiri, and Corran Horn. Loor was not interested in the internal affairs of CorSec, and even less in its officers. Loor also took great delight in complicating otherwise simple cases, even to the point of letting the killer of Horn's father go free."}, {"tag": "p", "text": "After enduring years of abuse under Loor, Bastra, Wessiri, and Horn hatched a plot to escape Loor. After they managed to escape right under his nose, Loor left his post as liaison officer, vowing to track down the three former CorSec officers and have his revenge."}, {"tag": "p", "text": "He almost caught up with Corran Horn on the planet of Garqi – Corran Horn was posing as Eamon Yzalli, aide to Prefect Mosh Barris as one of the aliases created by Gil Bastra. Horn was involved in a plot to free a Duros prisoner by the name of Lai Nootka who had some valuable spare parts for Horn's X-wing. Horn was able to frame Mosh Barris for his \"murder\" and Loor was sent to investigate. Horn and Loor missed each other by a matter of hours."}, {"tag": "p", "text": "Three months after events on Garqi, Loor managed to track down and capture Gil Bastra, though Bastra had insisted that he had let Loor catch him on purpose, to keep pursuit off his friends. Loor then attempted to interrogate Bastra, but when he put Bastra in a bacta tank to cure him of a fatal disease, he failed to realize that Bastra had an allergy to bacta. Bastra died in the interrogation attempt, leaving Loor back where he started. It was at that time he was recalled to Coruscant by Ysanne Isard."}, {"tag": "h3", "text": "Employment under Isard"}, {"tag": "p", "text": "After his recall to Coruscant, Loor met Ysanne Isard, Director of Imperial Intelligence. Isard then recruited Loor and ordered him to track down and destroy Rogue Squadron. The reasons for why Loor was chosen are unknown, though it is suspected that Isard knew of his vendetta against Corran Horn, who at the time was a member of Rogue Squadron."}, {"tag": "p", "text": "Working with Admiral Devlia, Loor managed to track down Rogue Squadron to their base on Talasea. Fortunately for Rogue Squadron, Devlia was skeptical and mistrusted Loor's abilities. He only sent a single squad of stormtroopers, who were easily dispatched by Rogue Squadron, but one of the squadron's pilots, Lujayne Forge, was killed in the attack. When the New Republic retaliated and attacked Devlia's headquarters on Vladet, Loor made his escape. He was then ordered to go to Borleias, which was a vital stepping stone for the New Republic to reach Coruscant."}, {"tag": "p", "text": "After his arrival, Loor met with General Evir Derricote. Loor warned Derricote about the inevitable New Republic attack, and also spied on Derricote. After Derricote managed to repel the first New Republic assault, Isard ordered Loor to bring Derricote back to Coruscant with him."}, {"tag": "h3", "text": "Events on Coruscant"}, {"tag": "p", "text": "After the capture of Borleias by the New Republic, and the insertion of Rogue Squadron into Coruscant, Loor was again tasked with fighting off the legendary squadron, though this time, he was only supposed to delay them until Isard could unleash her lethal Krytos virus on the planet's nonhuman population and put pressure on the New Republic. To do this end, Loor enlisted the help of Zekka Thyne and Erisi Dlarit to spy on Rogue Squadron. Unfortunately for him, tough anti-espionage tactics employed by Wedge Antilles prevented him from stopping the New Republic's premature capture of Coruscant."}, {"tag": "p", "text": "As the New Republic closed in, Isard informed Loor that he was to lead the Palpatine Counter-Insurgency Front and perform guerrilla and terrorist attacks on the new government. While leading the PCF, Loor found himself working for Fliry Vorru, a former Corellian Moff. Vorru had Loor attack multiple targets, including a bacta storage facility and a school."}, {"tag": "p", "text": "Loor was not happy with any of this, and secretly plotted to overthrow Vorru and Isard. When he learned of a convoy that was going to deliver bacta to the New Republic, Loor took the chance. Using twelve X-wings he managed to obtain, Loor intended to steal the bacta for himself and blame the theft on Rogue Squadron. Unfortunately, Isard also knew of the convoy and tipped off Warlord Zsinj about it. Zsinj destroyed the entire convoy, including Loor's fake Rogue Squadron."}, {"tag": "p", "text": "With his plan in shambles, Loor was sure that Isard would discover his plans for betrayal. He sought sanctuary with the New Republic by offering to testify in Tycho Celchu's trial and divulging information about all Imperial activities on Coruscant. During his defection, he was codenamed \"Behemoth.\" Loor never got the chance to reap the rewards of his defection, however. Isard received word of a secret witness attending Celchu's trial. Thinking it was General Derricote, Isard sent Diric Wessiri, a sleeper agent and Wessiri's husband, to prevent him from testifying. As Loor was on his way to the courthouse, he was shot by Diric and died at the scene."}, {"tag": "h3", "text": "Loor's legacy"}, {"tag": "p", "text": "As it turned out, even though Isard managed to keep him quiet, Loor got the last laugh. Before he died, Loor kept an encoded data card with him as a failsafe to prevent the New Republic from just killing him. When Horn discovered the card, he managed to decode the data. The datacard revealed every Imperial operation, terrorist cell, and safe house on Coruscant. With Loor's help, the New Republic went a long way into making Coruscant more secure for the future."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}