{"url": "Kit_Fisto%27s_Delta-7B_Aethersprite-class_light_interceptor/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with conjectural titles", "Category:Delta-7B Aethersprite-class light interceptors", "Category:Jedi starfighters", "Category:Unidentified starfighters"], "nodes": [{"tag": "h1", "text": "Kit Fisto's Delta-7B Aethersprite-class light interceptor"}, {"tag": "p", "text": "Kit Fisto flew a Delta-7B Aethersprite-class light interceptor during the waning years of the Clone Wars as an intergalactic peacekeeper, a role he thoroughly enjoyed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Using a Syluire-31 hyperspace docking ring, Jedi Master Kit Fisto flew his Delta-7B to Vassek with his astromech droid, R6-H5, and landed it in the fog not far from the Nu-class attack shuttle that carried Jedi Knight Nahdar Vebb and a small clone squad to the planet. Later, IG-100 MagnaGuards were searching the area for intruders and came upon Fisto's starfighter. R6 piloted the Delta-7B in take-off before the droids could do any damage and though one Magnaguard attempted to hang on to the starfighter, it was shaken off with some maneuvering by R6."}, {"tag": "p", "text": "Not long after, R6 contacted Fisto, who instructed the droid to fly the ship to a south landing platform where he would rendezvous for extraction. R6 arrived in time to see his master locked in a duel with General Grievous and surrounded by MagnaGuards. R6 flew the Aethersprite close enough for Master Fisto to leap out of the fray to safety. Fisto and R6 then used the Delta-7B to both escape the moon and travel to Coruscant to report to the Jedi Council."}, {"tag": "p", "text": "Fisto would also make use of this ship in the rescue of Jedi Generals Obi-Wan Kenobi, Anakin Skywalker, and Ahsoka Tano together with their clone troops and rescued hostages from the Confederate prison, the Citadel."}, {"tag": "h2", "text": "Modifications"}, {"tag": "p", "text": "Jedi training had only improved Fisto's piloting abilities, while the precise and responsive controls of his ship enhanced them even further. His flying tactics were as graceful as they were deadly, inspiring awe and respect in friend and foe alike. As a result of his preferences and skills, Fisto made fewer performance enhancing modifications to ships he flew, than did certain other Jedi, such as Anakin Skywalker. While Fisto made certain modifications to the Delta-7 Aethersprite he flew earlier during the Clone Wars (due to his philosophy that the faster he could get on the ground, the sooner he'd be able to get into the fight), it is unknown if he also personally strengthened the airframe, struts or landing gear of his Delta-7B in order to help it withstand high-speed reentry and rough landings."}, {"tag": "p", "text": "The ship's green markings were the same as the emblems displayed on Kit's gauntlets."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Before the operations of WizKids, Inc. were discontinued by The Topps Company, Inc., the last expansion to the Star Wars PocketModel TCG (Trading Card Game) that was released, Clone Wars Tactics, provided a sneak peak at Kit Fisto's Delta-7B as a game piece."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}