{"url": "Kitak_Hu", "categories": ["Category:Legends articles", "Category:Males", "Category:Merchants", "Category:Paiguns"], "nodes": [{"tag": "h1", "text": "Kitak Hu"}, {"tag": "p", "text": "Kitak Hu was a male Paigun who ran Hu's Emporium, a weapons store marketed towards droids on the crime-ridden \"Gambler's World\" of Vorzyd V. Hu specialized in designing and selling harnesses outfitted with automatic weapons, which could make even droids not designed for combat into deadly forces. In 1 ABY, Hu attempted to sell a pair of these harnesses to the Rebel droids C-3PO and R2-D2, only for their weapons to activate on their own and damage his store."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Paigun, Kitak Hu was the owner and proprietor of a store called Hu's Emporium on the Outer Rim world of Vorzyd V, specializing in selling weapon harnesses for droids that were often the target of gangs and rogue spacers on the \"Gambler's World.\" Located in the dimly lit depths of the capital city of Efavan, Hu's Emporium sold a wide variety of defensive weapons for droids, ranging from small locators to harnesses loaded with automatic weapons, gas grenades, sonic charges, and even a device that purported to read \"evil intent\" at 50 paces. Hu was also an inventor himself, using his shop as a laboratory and testing ground for many of his latest creations."}, {"tag": "p", "text": "In 1 ABY, Hu's shop was visited by C-3PO and R2-D2, a pair of droids looking to help protect their owner, Rebel leader Luke Skywalker, who had come under target by the Galactic Empire. As neither of his prospective customers were designed to handle weapons, Hu recommended a pair of his harnesses outfitted with the latest of his automatic creations. Hu put the devices on the droids himself, but the harnesses proved bulky and difficult to maneuver in, causing R2-D2 and C-3PO to fall down as they tried to make their way to the testing area. The impact with the floor caused the automatic weapons to go off, much to Hu's surprise, as they were only designed to activate when the wearers were under attack. The weapons' activation caused significant damage to Hu's store before they eventually shut off on their own. However, despite the harrowing experience, C-3PO and R2-D2 still purchased a pair of locators from Hu before they went on their way."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Catering his business to droids that were vulnerable to theft on the crime-ridden \"Gambler's World,\" Hu had a less-than-trustworthy reputation, as he was known to exaggerate the effectiveness of the devices he sold. Hu was very confident in his weapons' capabilities and safety for its users, and was considerably surprised in 1 ABY when some of his devices went off on their own, damaging his store."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kitak Hu made his first and only appearance in the Star Wars Legends continuity in Gambler's World, a comic strip story arc written and illustrated by Russ Manning and released in 1979."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}