{"url": "Kitonak/Legends", "categories": ["Category:Legends articles", "Category:Enslaved species", "Category:Kitonaks", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Kitonak"}, {"tag": "p", "text": "Kitonaks were pudgy, slow-moving sentients from the harsh Kurdan Desert which covered the planet Kirdo III. Their physiology was an adaptation to their life as desert nomads, while their psychology was notable for their extreme patience and calm. They were also noted for their talent as musicians."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Kitonaks were small and stocky creatures, with two legs ending in large, two-toed feet, and two arms with three-fingered hands. Their skin color varied from off-white to pinkish Though their fingers were short and fat, they were quite dexterous. Their bodies released a vanilla-like smell."}, {"tag": "p", "text": "Kitonaks had tough skin which folded to seal vulnerable openings, a trait evolved to protect them from the harsh environment of Kirdo III's deserts. They also had some double organs, including two pairs of lungs. Their double lungs could store oxygen, allowing them to hold their breath for up to four hours. Their ears, eyes, and mouth could be sealed, and were almost too small for the casual observer to see. Kitonaks moved slowly, as they walked by expanding and contracting their foot muscles, or slithered slowly in a prone position. Their strong feet anchored them during windstorms, while they leaned into the wind with their aerodynamically shaped bodies and heads. In worse storms, when rocks began to fly, they burrowed into the dunes. Their sense of smell was also centered in olfactory organs in their feet, allowing them to smell their prey through the sands without having to worry about the desert winds."}, {"tag": "p", "text": "Kitonaks were very patient, and never rushed. This was because they fed on creatures called chooba, and they had to stand motionless for a long time until a chooba got near them. The nearsighted chooba mistook motionless Kitonaks for sulfaro plants, which chooba often raided in search of fruit or bird eggs. One chooba satisfied a Kitonak's dietary needs for approximately one month."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Kitonaks lived in nomadic tribes of about one hundred Kitonaks, following migrating chooba herds. Due to their nomadic lifestyle and the tendency for what possessions they had to blow away in windstorms, Kitonak technology was limited to crude, temporary tools and musical instruments. Their tribes were united in a planet-wide participatory democracy, though slow communications and their deliberate thought processes meant that years would pass before decisions were made (by which time, the problem would often have solved itself)."}, {"tag": "p", "text": "The \"Telling of the Story\" was the highlight of a Kitonak tribe's day. Each night, the members of the tribe would take turns at storytelling, which each Kitonak adding his or her own details and plot twists. A single story could take several nights to come to a conclusion. These stories taught young Kitonaks the value of patience."}, {"tag": "p", "text": "Rain came to their home once every ten years. When this happened, Kitonaks went to the newly full riverbeds for the \"Great Celebration of Life,\" plunging into the riverbeds for the \"Dance of Love.\" At the end of this mating ritual, females would emerge with newborn children. Though this made it seem that Kitonaks had an extremely short gestation period, the opposite was the case: these children were actually conceived years earlier during the previous rainy period's celebration. Young Kitonaks clung close to their mother for the first year of life, eventually becoming strong enough to stand on their own even during windstorms. Kitonaks followed a deity called the Cosmic Egg."}, {"tag": "p", "text": "By the age of nine, Kitonaks reached full maturity. More adventurous nine-year-olds would leave overpopulated tribes to wander the desert in search of less crowded tribes. These lonely nomads would often make crude chidinkalu flutes from chidinka plants, and play them to while away the nights and attract other Kitonaks."}, {"tag": "h3", "text": "Psychology"}, {"tag": "p", "text": "Kitonaks were almost always calm and patient, refusing to take action without considering the consequences carefully. In fact, their typical course of action would be to do nothing. Even among Humans or other, \"faster-paced\" aliens, Kitonaks were painfully slow to answer questions or make decisions. One of the only things to anger them was being hurried. They often would slow down out of spite if someone was making them rush."}, {"tag": "p", "text": "The only other things which upset them were quicksands and caves. Caves were believed to be gateways to their mythological underworld, and it was said that no Kitonak returned from them. Quicksands, on the other hand, were a more tangible danger on their homeworld, since predatory creatures able to swallow a Kitonak whole lurked within. A Kitonak stuck in quicksand would easily be able to wait patiently until help came without falling further in — but help would usually be slow to arrive."}, {"tag": "h3", "text": "Sample Kitonak names"}, {"tag": "p", "text": "Most Kitonaks went by a single, simple name. Typical names included:"}, {"tag": "p", "text": "One of the best-known Kitonaks adopted the name \"Droopy McCool\" after abandoning his former alias, \"Snit.\" However, Snit was simply the name his former master Evar Orbus gave him. McCool's true name was a series of whistles which was incomprehensible to most non-Kitonaks. Other recorded Kitonak names may have had similar origins."}, {"tag": "h2", "text": "Kitonaks in the galaxy"}, {"tag": "p", "text": "Kitonaks would sometimes be abducted by off-world slave traders. Usually, these were young Kitonaks on their own for the first time, playing their flutes to attract company. Since the slavers were often initially attracted by a Kitonak's music, they would force them to work as jizz wailers in seedy cantinas. Kitonaks enslaved as laborers usually infuriated their masters by working slowly, and were often freed to work as musicians. Their former masters would take their wages until their slave-debt was repaid. (Of course, harsher masters would sometimes kill their Kitonak slaves.)"}, {"tag": "p", "text": "Some free Kitonak musicians, such as Droopy McCool of the Max Rebo Band, became fairly successful, particularly in the jizz and ontechii genres. Other free Kitonaks used their storytelling skills, patience, and the tendency of other beings to think an unmoving Kitonak was asleep or even non-sentient, to become spies and information brokers. Their clients had to learn to be patient, and let them reveal their information slowly and carefully. Some free Kitonaks considered going back to Kirdo III to give their people advanced technology and drive off the slavers, but it took a long time for such Kitonaks to decide to do anything about it."}, {"tag": "p", "text": "Several Kitonaks served as Palace Overlords for Voontara Fa'athra the Hutt on the planet Nal Hutta during the Cold War."}, {"tag": "p", "text": "During the Galactic Civil War, a few Kitonaks even joined the Rebel Alliance. Terno, a musician and Rebel agent operating in the Minos Cluster, was one such Kitonak. During this period, the Imperial slang term for the Kitonaks was \"Yazbo\"."}, {"tag": "p", "text": "Around 35 ABY, a Kitonak trained to be a Jedi in the New Jedi Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Galaxy Guide 4: Alien Races describes Kitonak hands as four-fingered. However, the illustrations in Galaxy Guide 4, The Essential Guide to Alien Species, The New Essential Guide to Alien Species, Alien Anthology, and Ultimate Alien Anthology show three-fingered hands, in agreement with Droopy McCool's depiction in Return of the Jedi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}