{"url": "Kittle", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Creatures of unspecified diet", "Category:Domesticated creatures", "Category:Felines", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Kittle"}, {"tag": "p", "text": "The kittle (plural: kittles) was a small species of felines kept as personal companions or house pets. They were regarded as cute, and had a cat-like growl. Through the process of bioengineering, beast masters were able to incubate kittles by using their DNA."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Kittles were a species of quadrupedal felines notable for their cuteness, and cat-like growl. They had wrinkly skin which could come in a variety of different hues, including shades of red, yellow and blue. The mammalian vertebrates also had black eyes, short stubby ears, and a long tongue and tail. Though kept as pets, they were also known to run wild. When under attack, kittles would bite and claw back to defend themselves."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Through the use of their DNA, kittles could be incubated and trained by beast masters as personal companions or house pets. During the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, circa 1 ABY, a predator snatched a kittle named Woopywoopums while she was slithering playfully in her owner's yard. Saddened by the loss of their pet, the owner sought to hire a spacer to eliminate a lair of beasts believed to be responsible for the kittle's demise."}, {"tag": "p", "text": "One spacer agreed to eliminate the lair, and for their part in avenging the kittle, the pet owner wished to name a new kittle in honor of the gallant citizen."}, {"tag": "p", "text": "Another owner, a young male Twi'lek, kept a kittle as a pet, for which he displayed a strong bond and a great deal of empathy. One Corellian animal lover was known to go out of their way to divert the speeder they were driving to avoid hitting any wild kittles. On the other hand, a very well armed and murderous religious cult was known to sacrifice kittles and gnorts as part of their rituals. Deeming lawful punishment impossible, a concerned citizen sought to hire a strike team to demolish their temple and put an end to their \"evil\" practices."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kittles were first mentioned in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Early in the game's lifespan, dynamically spawned non-player characters offered a variety of simple missions. In one case, NPCs could offer a destroy mission titled \"Avenge Woopywoopums,\" the storyline of which featured a kittle. The mission required the player to destroy creatures at an assigned waypoint in exchange for a credit reward. Another NPC mission titled \"Evil Cult\" mentioned kittles, as did a mission terminal quest titled \"Take Hard Line Against Animals.\" A kittle was first pictured in the 2004 strategy book Star Wars Galaxies: Jump to Lightspeed: Prima Official Game Guide, and again in the 2005 Star Wars Galaxies: The Total Experience: Prima Official Game Guide."}, {"tag": "p", "text": "However, kittles were not actually included in Star Wars Galaxies until the release of Chapter 7: A Collection of Heroes, on November 1, 2007. The update introduced collections, a type of system which would track discoveries and kills, and award the player with badges and/or other types of rewards for completion. One such collection, titled \"Rodent Eradicator,\" would award the player with a badge and rare kittle DNA once completed. The DNA could then be incubated by beast masters, allowing for kittles to be created as pets. According to the game's directory tree files and source data, there were to be at least two other separate breeds of kittle known as the forest kittle and grassland kittle, however neither of these were known to appear on the live servers. In The Nightsister's Revenge, the fifth expansion of the Star Wars Galaxies Trading Card Game released on December 15, 2009, a kittle received an illustration in a game card."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}