{"url": "Kiviett", "categories": ["Category:Legends articles", "Category:Galactic Empire science and engineering personnel", "Category:Individuals of unspecified species", "Category:Males", "Category:Officers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Kiviett"}, {"tag": "p", "text": "Lieutenant Kiviett was a planetologist serving in the Imperial Military. He was second-in-command of Imperial Survey Team IX3244-B, serving under Captain Toss. While with IX3244-B, he led the first Imperial team to land on the forest moon of Endor."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lieutenant Kiviett's opinion was that a \"barren rock with low gravity and a poisonous atmosphere\" would have been a better site for the shield generator necessary to protect the second Death Star while it was under construction, since there would be no indigenous sentients to interfere with construction and no natural cover for a Rebel military operation against the generator. However, Lord Darth Vader himself had already decreed that the shield generator would be constructed on a world capable of supporting Human life, in order to avoid wasting time and energy building life-support systems for the personnel running the shield generator."}, {"tag": "p", "text": "When IX3244-B's survey frigate arrived in the Endor system, Captain Toss reasoned that the forest moon would be a perfect site. It was suitably remote, and the most advanced lifeforms detected—the Ewoks—had only primitive technology. Though standard procedures dictated that the local sentients had to be investigated, Toss left this task to Kiviett, and immediately reported that Endor fit Lord Vader's requirements."}, {"tag": "p", "text": "Kiviett led an expedition consisting of two stormtroopers and two other personnel down to the moon's surface in a shuttle. They landed within hiking distance of an Ewok village (presumably Bright Tree Village). As they tried to make their way to the village, unseen Ewoks ensured that the Imperials did not get within one kilometer of their village. They did this by obscuring their path, turning it into a shifting maze filled with dead ends and forcing the Imperials to hike in circles. After two hours, as night fell and Kiviett's team became hopelessly lost, the Ewoks began to beat drums all around them. Kiviett's team panicked, and started firing their blasters randomly into the woods. To his credit, Kiviett had his blaster set on stun, and insisted on the rest of his team doing the same. Kiviett was an Imperial officer, but considered himself a scientist first. The shots did not stop the Ewoks, who only stopped when Kiviett and his team found that in their wanderings, they had returned to their shuttle's landing spot. Shaken, all of them agreed to retreat to their frigate."}, {"tag": "p", "text": "Kiviett's report to Toss was dismissed, and apparently not forwarded to any superior officers. Toss did not agree with Kiviett's suggestion that the Ewoks were a potential problem deserving further study. Even Kiviett's suggestion that Imperial personnel and vehicles on Endor be outfitted with forest camouflage was ignored."}, {"tag": "p", "text": "Kiviett was stationed on Endor during the Battle of Endor, though it is unclear if the rest of IX3244-B was on the forest moon at the time. After the battle, he surrendered to the victorious Rebel Alliance's forces. During a post-capture debriefing, he told Alliance historian Voren Na'al about his experiences during the survey of Endor. After expressing his opinion that the Empire lost the battle at least in part because no one listened to him, and that the Empire was doomed to eventually lose the Galactic Civil War, he offered his services as a planetologist to the Rebellion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}