{"url": "Kkowir_Forest", "categories": ["Category:Legends articles", "Category:Forests and woods", "Category:Kashyyyk locations"], "nodes": [{"tag": "h1", "text": "Kkowir Forest"}, {"tag": "p", "text": "Literally meaning \"Dead Forest\" in the Wookiee tongue, Kkowir Forest was an area on Kashyyyk, and home to the local Kerritamba tribe of Wookiees, the Outcasts, and the mysterious Sayormi cult. The Myyydril Caverns lay in the northern parts of the forest."}, {"tag": "h2", "text": "General information"}, {"tag": "p", "text": "The Kkowir Forest was home to the Kerritamba Tribe's village, a village set up by the Kerritamba. The Kerritamba Village and tribe was led by Chief Kerritamba. Many dangers lay in the Kkowir Forest, including the Sayormi, who were believed to be ghosts that lived in the lower levels of the forest, and webweavers, a huge, nonsentient arachnid species. The Dead Forest area was one of the most dangerous areas in the forest. Many Sayormi settled there."}, {"tag": "h3", "text": "Points of interest"}, {"tag": "p", "text": "A few places in the forest interested explorers and dared them to travel further into the forest. The Mysess Glade was where the Great Tree was located. The Myyydril Caverns was where the Myyydril Tribe, a tribe of Wookiees, made a small village. Another area was the Kerritamba Village Arena, just across from the Kerritamba Village."}, {"tag": "h3", "text": "Location"}, {"tag": "p", "text": "The Kkowir Forest was just northwest of Kachirho on Kashyyyk. Dead Guards protected the gate. Although the forest gate was not hard to get to, people feared what lay beyond the gate."}, {"tag": "h2", "text": "Forest life"}, {"tag": "h3", "text": "Animal life"}, {"tag": "p", "text": "In the forest were many types of animals, such as the uller. Webweavers, a huge, arachnid species, lived inside and outside the ShadowWeave Caverns. Urnsor'is could be found in caves in the forest. Shadevale Venomsting were in the rivers that flowed through the forest, and on land next to the river."}, {"tag": "h3", "text": "Plant life"}, {"tag": "p", "text": "Mysess blossoms were fairly common in the forest, and there were many tall trees. Dead stumps of trees were in the Dead Forest area."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kkowir Forest appeared in the video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}