{"url": "Kkkt", "categories": ["Category:Canon articles", "Category:Wookieepedia Featured articles", "Category:Chiefs", "Category:Force-sensitives", "Category:Males", "Category:Members of Kkkt's clan", "Category:Southern Mustafarians"], "nodes": [{"tag": "h1", "text": "Kkkt"}, {"tag": "p", "text": "Father Kkkt was a Force-sensitive Southern Mustafarian male who was the leader of a clanhold on the planet Mustafar during the reign of the Galactic Empire. Kkkt was present when the Sith Lord Darth Vader arrived on Mustafar and sent out a scout party to investigate his landing site, with only one of the Mustafarians returning. Vader then began the construction of his fortress, which was built to tune in to the dark side energies present on the planet and open a portal through the Force. The fortress failed its purpose several times, devastating Mustafar's landscape and prompting Kkkt to unite the other nearby Mustafarian clans against the stronghold."}, {"tag": "p", "text": "Backed by an army of Mustafarians riding on native lava fleas, Kkkt led an assault on Fortress Vader around 12 BBY. During the battle, Kkkt identified Vader and, with the help of two other Force-sensitive Mustafarians, he summoned a large wave of lava to wipe out the Sith Lord's forces. Vader, however, survived and retreated into the Sith cave beneath the fortress. Kkkt led the remainder of his army on a final effort to destroy the stronghold. However, Vader channeled the Force through the structure from the Sith cave and used it to wipe out Kkkt and the Mustafarian army."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "A new arrival"}, {"tag": "p", "text": "Father Kkkt was a Southern Mustafarian male who lived on the lava planet Mustafar. By circa 14 BBY, he was the leader and protector of his own clanhold of Mustafarians on Mustafar. When the Naboo Royal Starship, flown by the Dark Lord of the Sith Darth Vader, entered Mustafar's atmosphere with its shields deactivated, the entire clan witnessed it flying across the sky."}, {"tag": "p", "text": "As Kkkt and another Mustafarian named Zzzs watched the burning starship descend through the atmosphere, Zzzs asked what Kkkt thought it was. Kkkt believed that it was an omen, and he used the Force to manipulate the lava beside him, making a hoop. Through the hoop, he watched the ship as it fell toward the surface. Anxious of the new arrival, Kkkt sent a scout party of four Mustafarians, including Bbbl, Rrrn, and Sssp. Vader then killed Bbbl and forced Sssp to wear the haunted mask of Sith Lord Darth Momin, allowing him to be possessed by the ancient Sith sculptor's spirit. Only Rrrn returned from the skirmish and gave a description of Vader to Kkkt."}, {"tag": "p", "text": "Shortly afterwards, Vader began constructing a fortress on the Gahenn Plains over an ancient Sith cave. Designed by Momin, the fortress was meant to tune the energies of a dark side locus on Mustafar in order to open a portal through the Force. Each failed attempt to open the doorway destroyed the structure and devastated Mustafar's landscape, causing lava storms that inflicted chaos on the Mustafarians. Kkkt protected his clan as much as he could, but as the storms grew worse, holding the lava back took a great toll on him. With other clanholds being affected in the same way, Kkkt decided to rally them against the structure the Sith were building. By the ninth attempt, Vader and Momin had perfected the fortress' design."}, {"tag": "h3", "text": "Fighting for Mustafar"}, {"tag": "p", "text": "Around 12 BBY, Kkkt led an army of Mustafarians riding lava fleas, a native insect species of Mustafar, in a charge on the newly finished fortress and ordered them to tear the structure down. Kkkt's army outnumbered the Imperial garrison of the fortress ten to one and attacked it on the flank. The Imperial forces initially received orders to evacuate, but Vader interjected and had them advance instead. The Sith Lord engaged the Mustafarians, cutting many down with his lightsaber in the process."}, {"tag": "p", "text": "Kkkt identified and watched Vader from a distance together with two other Force-sensitive Mustafarians. The three of them then combined their power and channeled a large wave of lava onto the battlefield, engulfing both the garrison and a portion of the Mustafarian army, although Vader was able to escape. After snuffing out the flames on his armor, Vader retreated into the Sith cave beneath the castle, parting the lava to allow him to reach it. Kkkt was surprised that the Dark Lord had survived but nevertheless proceeded to attack the fortress with his remaining Mustafarians, now believing Vader to be powerless without his garrison. At that point, however, Vader channeled the Force from the Sith cave through the fortress. Kkkt realized Vader's tactic and ordered his forces to pull back, but the Force energy quickly wiped out both Kkkt and the rest of the Mustafarians before they could flee."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As the leader of his own clanhold, Kkkt cared for the safety of his people, to the point that one of his clan, Sssp, thought he was too quick to call something an omen. Kkkt also cared for the protection of Mustafar and referred to lava as the \"blood\" of the planet. He decided to unite the Mustafarian clans to save their land after Darth Vader and Momin's project began devastating Mustafar and its inhabitants. In the end, however, Kkkt decided to sacrifice a large portion of his army when bringing a large wave of lava upon the Imperial garrison protecting Fortress Vader, seeing it as a cost that had to be paid to defeat Darth Vader, who he referred to as the \"dark one.\""}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Kkkt was Force-sensitive, and he used his ability to manipulate lava, creating a hoop out of it on one occasion. He also used the Force to deflect lava as it thrashed upon his people and later combined his power with two other Force-sensitive Mustafarians to flood the Fortress Vader Imperial garrison."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Like other Mustafarians, Kkkt wore armor and a breath mask as protection against Mustafar's heat. Unlike the armor of other Southern Mustafarians, Kkkt's armor had multiple tubes protruding out of the back. Additionally, Kkkt carried a long staff with him and rode a lava flea at the beginning of his assault on Vader's fortress."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kkkt first appeared in the comic Darth Vader: Dark Lord of the Sith 21, which was written by Charles Soule, penciled by Giuseppe Camuncoli, and published by Marvel Comics on September 12, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}