{"url": "Kl%27aal", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Assassins", "Category:Criminals", "Category:Defel", "Category:FarStar crewmembers and personnel", "Category:Males", "Category:Scouts"], "nodes": [{"tag": "h1", "text": "Kl'aal"}, {"tag": "p", "text": "Kl'aal was a Defel criminal who served as a forward scout and later security officer on the FarStar during the search for Moff Kentor Sarne."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Kl'aal escaped from authorities on Af'El after being convicted of the murder of a fellow Defel in a crime of passion. He denied the charges, but the evidence was overwhelming against him. He was found guilty, and vilified for lying. He fled from planet to planet, pursued at first by Defel hunters, then local law enforcement, the Empire, and bounty hunters since he had committed other crimes during his flight. He gained temporary refuge on a remote planet when his starship crashed, and developed a taste for freshly killed meat."}, {"tag": "h3", "text": "In the service of Moff Sarne"}, {"tag": "p", "text": "Eventually, he landed on Kal'Shebbol, and was captured by Moff Sarne's forces. Instead of trying him for his crimes, Sarne offered him a deal. In exchange for protecting him and feeding his new found hunger, Kl'aal would serve as his personal assassin. Kl'aal agreed, but he felt his conscience would be tainted forever. He was put to work killing threats to Sarne and eliminating known members of local resistance groups."}, {"tag": "p", "text": "Prior to the New Republic's liberation of Kal'Shebbol, Kl'aal was recruited by Katarn Commandos pathfinder Lilla Dade to assist her in her mission to scout out Moff Sarne's base. Kl'aal later assisted in the assault on the complex."}, {"tag": "p", "text": "Kl'aal claimed that he believed that the New Republic had a lot of work to do in the Kathol Sector and wanted to help them. In turn, the New Republic couldn't pass up the opportunity to have a Defel on the mission—Kl'aal's natural ability to blend into shadows would be a valuable asset. Kl'aal kept his past a secret from the crew of the FarStar."}, {"tag": "h3", "text": "Onboard the FarStar"}, {"tag": "p", "text": "Kl'aal was the FarStar's forward scout, and often led teams to the surface of new planets to perform recon missions."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kl'aal needed to get down to a planet at least once a week or so to fulfill his need to eat freshly killed meat. While on scouting missions, he would detach himself from the group and gather intelligence on his own. During this time, he would also hunt native prey."}, {"tag": "p", "text": "He was ashamed of his time serving Sarne, and reasoned that the only way to restore his honor was to track the Moff down and kill him. He was aware that several members of the FarStar crew formerly served Sarne, but refused to speak against them as he felt it was dishonorable. He also felt that they, like him, had personal reasons for joining the mission."}, {"tag": "p", "text": "Kl'aal kept to himself while onboard the FarStar, preferring not to get involved in shipboard matters. No member of the crew knew where Kl'aal slept on the ship, and generally assumed that he hid in a quiet corner. Despite this, he had the uncanny ability to appear when needed, or when someone was talking about him."}, {"tag": "p", "text": "The Defel was a strong supporter of both Captain Keleman Ciro and Kaiya Adrimetrum, possibly as a result of serving with them during the assault on Sarne's base. He also had a bond with the Rodian Gorak Khzam, and the two occasionally shared planetary hunts."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}