{"url": "Klaar", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Defel", "Category:Guards", "Category:Males"], "nodes": [{"tag": "h1", "text": "Klaar"}, {"tag": "p", "text": "Klaar was a male Defel and the security chief aboard the Crystal Web Station."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "He was brought to the station on Daran Tal's second visit to the station, along with Lianna Tagon and several others in 1 BBY. He was quite aware of the legends and fears people have of his race, and was absolutely willing to use those fears to help keep the peace aboard the station. Since he could be hiding in a shadow just around the corner, permanent residents of the Crystal Web Station are reluctant at best to do anything that would bring them to Klaar's attention."}, {"tag": "p", "text": "Klaar was in neutral conflict between the New Republic and the Galactic Empire; he preferred the orderly nature of the Empire, but admired the honor and audacity of the Republic. However, he was only interested in keeping the peace on the station and so he tried not to let his personal feelings influence his job. Unknown to even Daran Tal is the fact that Klaar owed an honor debt to Imperial Moff Jeckor."}, {"tag": "p", "text": "Moff Jeckor had onced granted him his freedom while so many other aliens were being enslaved or worse by the Empire. Of course, Jekor did not do this because he felt any friendship or sympathy towards Klaar, simply so that he could later call in favors from the Defel. However, because of this, Klaar's species' honor code demands that he repay the Moff in any way. All the Moff ever asked of Klaar was that he provided him with general information about the station and its inhabitants. Though he hated being used as a spy for the Empire, he consoled himself with the fact that the information he was giving could be easily obtained by anyone on the station."}, {"tag": "p", "text": "However, in 4 ABY, just after the destruction of the second Death Star, Klaar was asked to pass along this information in the most crowded cantina in the station. Unknown to Klaar, Moff Jekor was in fact planning on sending a squad of stormtroopers into the cantina to forcefully conscript \"volunteers\" for use in one of the Moff's capital ships. When this happened, nobody was more surprised than Klaar. Thanks to a New Republic group who were in the cantina at the time, the stormtroopers were repelled. This effectively ended Klaar's honor debt to Jeckor, but landed him in a new one with the group."}, {"tag": "h2", "text": "Sources"}]}