{"url": "Kleb_Zellock", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Bounty hunters", "Category:Crime lords", "Category:Dirconites", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Kleb Zellock"}, {"tag": "p", "text": "Kleb Zellock was a male Dirconite crime lord who lived on the mining world of Tyne's Horky. He claimed ownership to numerous local businesses in the planet's eponymous town and ran his criminal empire out of the popular Doodnik's Café dining establishment. Kleb also operated the largest keschel-ore mine on the planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Several years before the Battle of Yavin, Kleb Zellock met with a Tammuz-an named Sollag Den at Doodnik's Café. Den wanted to hire Zellock to find a lost member of the Tammuz-an royal family named Mon Julpa. He offered the bounty hunter 40,000 keshels if he could locate Julpa before the other bounty hunter, IG-88, had a chance to find him. Zellock accepted the offer and sent his assistant bounty hunter, Yorpo Mog,into the streets to begin investigating. Mog eventually discovered Mon Julpa masquerading as an android at a local auction block. After several misadventures with Julpa's new friends Jann Tosh, C-3PO and R2-D2, they finally captured him. Julpa and the others were sent to work in Kleb's keschel mines."}, {"tag": "p", "text": "During this time, Mog discovered that the mines were rich with a raw element known as Nergon-14. Recognizing the elements use in the construction of proton torpedoes, Kleb decided to smuggle sell his stock of Nergon-14 to the Galactic Empire."}, {"tag": "p", "text": "As Jann Tosh and the others continued working in the mines, they discovered pockets of flammable gas that could possibly cause the Nergon 14 to explode. They escaped from slavery and managed to corner Zellock in his office, who was preparing to escape from the mines before the Nergon-14 had a chance to explode. Gathering as much money as he could carry, he decided to leave Mog behind and board his own custom sport skiff to escape. Thanks to a dysfunctional leg, C-3PO managed to kick Kleb Zellock's mini-stunner in Mog's hands and he, angered at his boss' betrayal, shot Kleb, knocking him out. After which, they and their friends escaped the mines just before the Nergon-14 exploded, dumping all of Kleb's money along the way and promptly turned him into the nearest security station, leaving him seemingly broke."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kleb Zellock was a corpulent male alien with jaundiced, yellow skin and small, sharpened teeth. He dressed in attire common to many spacers throughout the galaxy."}, {"tag": "p", "text": "Like many gangsters, Kleb was a greedy and ruthless individual. He was willing to enter almost any financial engagement so long as there was a promise of great profit. This included the arena of bounty hunting. Active between the years 10 BBY and 5 BBY, Kleb's only true allegiance was to himself, and he commonly betrayed his own servants and clients so long as it suited his purpose."}, {"tag": "p", "text": "Kleb had the ability to emit a shrill, ear-piercing siren wail that caused great pain to those nearby."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kenner designed an action figure of Kleb Zellock in 1985 as part of its Star Wars Droids line. This line of action figures was size-compatible with the other Kenner Star Wars action figures, but design-wise, it represented a different toy line. Kleb's action figure was one of several from both the Droids and Ewoks series that was never released."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}