{"url": "Kleef", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Bounty hunters", "Category:Criminals", "Category:Males", "Category:Mercenaries", "Category:Otolla Gungans"], "nodes": [{"tag": "h1", "text": "Kleef"}, {"tag": "p", "text": "Kleef was a male Otolla Gungan veteran of the Battle of Naboo who briefly served in Senator Jar Jar Binks's security detail on the galactic capital of Coruscant before choosing to follow a criminal's path. During the Clone Wars, Kleef operated as a bounty hunter. He eventually became the second-in-command of the Mandalorian crime lord Chop'aa Notimo's mercenary gang."}, {"tag": "p", "text": "In 2 BBY, Kleef was among Notimo's forces that attacked the Cloud City mining colony over the gas giant Bespin. Following Notimo's orders, Kleef kidnapped Senator Garm Bel Iblis and delivered him to his boss. Kleef was confronted shortly afterward by Dark Lord of the Sith Darth Vader's secret apprentice, Starkiller, who sought to rescue the Senator. Although Kleef prepared for the fight by activating two Heavy Tactical Fighting Unit droids, he was killed by Starkiller."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Kleef was a male Otolla Gungan warrior native to the planet Naboo. In 32 BBY, Kleef fought to liberate his homeworld from the invading forces of the Trade Federation during the Battle of Naboo, and he survived the conflict. Soon after the Federation was ousted from Naboo, Kleef left his homeworld for the galactic capital of Coruscant as part of Gungan Senator Jar Jar Binks's security detail."}, {"tag": "p", "text": "However, having grown bored with his job and seeking both adventure and credits, Kleef left Binks's side and immersed himself in the shady businesses of the Coruscant underworld. During the Clone Wars, Kleef found a good use for his fighting skills as he became a bounty hunter, working for the highest bidder. Eventually, Kleef crossed paths with the Mandalorian criminal kingpin Chop'aa Notimo, who hired the Gungan to train his mercenary henchmen. Kleef went on to became Notimo's most trusted lieutenant and second-in-command."}, {"tag": "p", "text": "At some point in his life, Kleef suffered an injury that cost him his entire right eyestalk and most of his right ear."}, {"tag": "h3", "text": "Bespin"}, {"tag": "p", "text": "In 2 BBY, Notimo's forces attacked the Cloud City mining colony over the gas giant Bespin, engaging in battle against the Bespin Wing Guard led by the cyborg Lobot, the city's computer liaison officer. Senator Garm Bel Iblis was present on Cloud City at the time of the battle, and he went to the loading bays in order to try to negotiate with Notimo to stop the violence. Notimo, however, decided to use the opportunity and kidnap the Senator, dispatching his bounty hunters to do the job. Kleef managed to capture Bel Iblis and had him delivered to Notimo. Meanwhile, Dark Lord of the Sith Darth Vader's secret apprentice, Starkiller, arrived on Cloud City in search of the Senator, hoping to secure his support in the creation of an alliance against the Galactic Empire. Starkiller began to move through the colony, fighting Notimo's mercenaries. Having learned about Starkiller's presence, Kleef made sure to prepare for battle, as he always did. The Gungan retreated to one of Cloud City's tall buildings, backed by two Heavy Tactical Fighting Unit droids."}, {"tag": "p", "text": "While Kleef made final adjustments to the droids, Starkiller entered the building and confronted the Gungan, demanding to know where the Senator was. Kleef told him only that Notimo had Bel Iblis as hostage but did not reveal the exact location. As Starkiller activated his lightsaber, Kleef brought the droids on-line and brandished an edged blade, ready to fight. In a skirmish that followed, Starkiller destroyed the H-TFUs and engaged Kleef in close combat, knocking the weapon out of the Gungan's hands. The Sith apprentice then gripped the Gungan with the Force, Force-choked him, and threw him out of a window to his death, his body bouncing off Cloud City's heavy traffic. The aspiring Sith eventually located Bel Iblis and rescued the Senator after killing Notimo."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A fierce, relentless warrior and a master of many weapons, Kleef was greatly feared for his combat skills. He was bored by the life of a security guard and willingly traded it for that of a mercenary and bounty hunter, seeking excitement and easy money. Kleef was loyal to Notimo, and the latter, in turn, trusted him. Kleef was proud of his species and was outraged by the mere possibility that Starkiller might have considered himself better than a Gungan."}, {"tag": "p", "text": "Kleef also prided himself on the depth of his preparation, ensuring that he always had the equipment necessary for dealing with certain prey. For instance, during the battle against Starkiller, in addition to H-TFU droids, Kleef wielded a melee blade and complemented this by using boomas, the traditional Gungan weapon. While fighting the Sith apprentice, Kleef behaved himself coolly, diminishing Starkiller's powers and mockingly pretending to be afraid of him. He was intent on killing Starkiller and enjoyed the thought of it. When the Sith apprentice asked him about Bel Iblis's whereabouts, Kleef responded with laughter. After Starkiller activated his lightsaber, however, Kleef became serious, stating that the situation was \"not so funny\" anymore. Kleef had orange-colored eyes and green skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kleef was created by Krome Studios for the PlayStation 2, PlayStation Portable, and Nintendo Wii versions of the 2008 video game The Force Unleashed, wherein he was voiced by Kristoffer Tabori, who also voiced Kleef's target for kidnapping, Garm Bel Iblis. Concept art labeled the character as \"Mister Gung.\" In the game, Kleef can be unlocked as a playable character skin via the cheat code \"KLEEF.\" When Kleef is selected, however, cutscenes are disabled."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}