{"url": "Klegger_Corp_Mining_Facility/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederacy of Independent Systems military bases", "Category:Industrial facilities", "Category:Mustafar mines", "Category:Separatist holdout locations", "Category:Techno Union locations"], "nodes": [{"tag": "h1", "text": "Klegger Corp Mining Facility"}, {"tag": "p", "text": "The Klegger Corp Mining Facility, also known simply as the Klegger Mining Facility, was a mining facility on Mustafar built on the side of a mountain, overlooking a lava river. It was owned by Klegger Corporation, a subsidiary of the Techno Union."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Sometime during the Clone Wars, the Confederacy of Independent Systems constructed a droid factory inside a lava lake deep within the mountain. It remained a closely guarded secret, hidden and unused until after the end of the Clone Wars, when Gizor Dellso, a Geonosian Separatist traveled to the planet to convene with the Separatist leaders.[source?]"}, {"tag": "p", "text": "Toward the end of the Clone Wars, it served as the headquarters of the Separatist Council. The Council members were slain there at the hands of Darth Vader. The deaths of the Separatist Council transformed the area into a dark side nexus, similar to the Dark Side Cave of Dagobah."}, {"tag": "p", "text": "The mining facility was destroyed when it was host to the violent duel between Darth Vader and Obi-Wan Kenobi in 19 BBY. The two disabled the facility's shields by damaging the control room, causing the complex to quickly melt into the environment."}, {"tag": "p", "text": "For two months, it was not known what had happened to the members of the Separatist Council, as Palpatine, newly-christened the Emperor of the galaxy, used the public speculation that they were still alive to galvanize the Imperial military. A salvage team eventually traveled to the facility and found the remains of the Separatist leaders executed by Vader.[source?]"}, {"tag": "p", "text": "Gizor Dellso, now a Separatist holdout, was present when the corpse of Poggle the Lesser, the former Archduke of Geonosis, was discovered.[source?] He remained on Mustafar, establishing his base-of-operations at a secret droid foundry hidden within the mountain of the Klegger Corp Mining Facility. By countermanding the droid deactivation signal which he helped create,[source?] he was able to produce a private droid army to resist the Galactic Empire. With the assistance of other Geonosians, he also developed schematics for a prototype infantry droid. When stormtroopers of the Imperial 501st Legion were sent to Mustafar to crush Dellso's uprising, the mining facility was caught in their orbital bombardment which destroyed the factory."}, {"tag": "p", "text": "Years later, it would be replaced by the Mensix Mining Facility, built in the vicinity of the older complex and operational during the Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}