{"url": "Klegger_Corp_Mining_Facility", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Confederacy of Independent Systems locations", "Category:Industrial facilities", "Category:Mustafar mines", "Category:Techno Union locations"], "nodes": [{"tag": "h1", "text": "Klegger Corp Mining Facility"}, {"tag": "p", "text": "The Klegger Corp Mining Facility, also known as the KCM installation or the Mustafarian Mining Complex, was an ore collection complex located on the planet Mustafar."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Valuable ores were mined from the lava and are extracted in different ways. The facility used electromagnetic extraction technologies as well as manual Mustafarian and droid extraction. Owned by the Techno Union, the mining facility was used as cover for the battle droid factory concealed inside the mountain upon which the mine sat. A secret command center was built onto the mining complex to serve as a final redoubt for the Separatist Council."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly before the Battle of Utapau, General Grievous was instructed to send the Separatist Council to the mining complex for their safety. Little did they know, Darth Sidious was sending the council there so they could be easily disposed of later. There, the council was slain by Darth Vader, a Sith Lord, ending the Clone Wars. Shortly after, the complex was the site of a duel between Vader and Jedi Master Obi-Wan Kenobi. The wanton damage of their confrontation compromised the system controlling the protective repulsor fields that kept the facility from melting in Mustafar's extreme heat and most of the complex was consumed by volcanic eruptions."}, {"tag": "p", "text": "Sometime between 3 ABY and 4 ABY, Darth Vader had a flashback of Padmé Amidala being Force choked around this area while being Force-choked by Darth Sidious. After Palpatine left him on Mustafar without his left arm and either of his legs, Vader crawled into the complex. He had flashbacks of his mission to kill the Separatist Council. There, with the help of mouse droids, he replaced his missing limbs with spare parts. Ochi of Bestoon arrived to kill Vader, and the pair dueled fiercely."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}