{"url": "21st_Nova_Corps", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Grand Army of the Republic corps"], "nodes": [{"tag": "h1", "text": "21st Nova Corps"}, {"tag": "p", "text": "The 21st Nova Corps, also known as the Galactic Marines, was a prominent military unit of clone troopers noted for their unique armor and relentlessness in combat. The corps served in the Grand Army of the Galactic Republic as part of the 4th Sector Army under the leadership of Jedi General Ki-Adi-Mundi and Marshal Commander CC-1138 \"Bacara.\" Prior to the conclusion of the Clone Wars, the marines fought Separatist Alliance droid forces in the Mygeeto Campaign where they received Order 66, causing Mundi's men to betray and kill him on the battlefield."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "h4", "text": "Earlier battles"}, {"tag": "p", "text": "In 19 BBY, the 21st Nova Corps participated in the Outer Rim Sieges. Prior to the battle of Mygeeto, the corps took a part in the battles of Orto Plutonia and Rhen Var, both of which ended victorious for Republic troops."}, {"tag": "h4", "text": "Battle of Mygeeto and Order 66"}, {"tag": "p", "text": "Following those victories, Ki-Adi-Mundi and Bacara led the corps in a direct assault on the Separatist world of Mygeeto, managing to break through Separatist strongholds. At some point during the campaign, both leaders of the unit took part in a hologram meeting with other Clone Commanders and Jedi Generals, including Mace Windu and Aayla Secura."}, {"tag": "p", "text": "As the fighting on the planet continued, Mundi's unit reached the droid army on the bridges. The Separatist forces were strong, killing many clones and destroying an UT-AT, but the Jedi General and his troops managed to begin crossing the bridge. However, Bacara's troops received Order 66 from Supreme Chancellor Sheev Palpatine, commanding them to execute Mundi and begin the Jedi Purge. The Marines complied with the order and turned against their general, gunning him down as he fought the Separatist battle droids on the front line."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Organization"}, {"tag": "p", "text": "As a corps of the Grand Army of the Republic, the 21st Nova Corps consisted of 36,864 troopers divided into sixteen regiments. The Galactic Marines were under the command of Jedi General Ki-Adi-Mundi and Marshal Commander CC-1138 \"Bacara\" and were attached to the 4th Sector Army. Mundi personally led a squad of Galactic Marines during the assault on Mygeeto."}, {"tag": "h3", "text": "Equipment and vehicles"}, {"tag": "p", "text": "Clone troopers assigned to the 21st Nova Corps were considered to be of exceptional conditioning and discipline, and were trained to operate in hostile environments, such as fungal clouds to pure vacuum environments. In the field, the corps would use the DC-15A blaster rifle and the DC-15A blaster. Along with their infantry forces, the unit also utilized UT-ATs in combat.\nIn addition to their reputation as relentless soldiers, the Galactic Marines were also distinguished by their specialized armor, a variant of the Phase II clone trooper armor that succeeded the earlier Phase I model. The design of the helmet incorporated a specialized visor designed to filter pollutants and other hazards, which included a special synthmesh visor for the filtration of poisonous gases. Armor worn by the corps evolved into the armor worn by the cold weather assault stormtroopers of the Galactic Empire."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}