{"url": "Antron_Bach", "categories": ["Category:Canon articles", "Category:Humans", "Category:Males", "Category:Merchants"], "nodes": [{"tag": "h1", "text": "Antron Bach"}, {"tag": "p", "text": "Antron Bach was a human male antiques dealer specializing in Jedi artifacts. Over the years, he became friendly with several members of the Jedi Order. During the Great Jedi Purge, a Master named Uvell asked him to help preserve the history of the Order. Uvell gave him a ship, which they loaded with all the artifacts they could find, and sent Bach to a moon that was host to a former Geonosian colony."}, {"tag": "p", "text": "Years later, while attempting to warn the Corellian Resistance of an upcoming crackdown, Miru Nadrinakar crashed her starfighter on his moon. Antron provided a distraction so she could escape the pursuing Imperial forces in his starship."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male human Antron Bach worked as an antiques dealer during the final decades of the Galactic Republic's reign. During his time as a dealer he had a number of clients in the Jedi Order, who he befriended and drank tea with in order to get better prices. He also associated with smugglers, academics and archaeologists, whom he would drink and laugh with in cantinas on the planet Coruscant. When the Clone Wars between the Republic and the Confederacy of Independent Systems ended, and the Jedi Order were betrayed and mostly killed, Bach was asked by Jedi Master Uvell to help save a number of Jedi artifacts. The master loaded up a starship with lightsabers, scrolls and other objects of historical significance and told the dealer to hide in an abandoned Geonosian colony on a nameless moon. Bach did what Uvell asked and went into hiding on the moon, where he would occasionally have to avoid Imperial patrols by battening down the hatches of his home and hiding until they were gone."}, {"tag": "p", "text": "Around 10 years before the battle of Yavin, Bach's solitude was ended when Miru Nadrinakar, a member of the Corellian Resistance, crash landed near his home. An hour after her damaged starfighter had passed his mesa, Bach made his way out to the ship to see if there were any survivors. Upon reaching the site he found the wounded Nadrinakar, who asked for Bach by name much to his surprise and then claimed she needed weapons and transport. Before the pair could converse further however, a trio of Imperial TIE/ln space superiority starfighters flew overhead searching for Nadrinakar, and so the pair made their way to Bach's mesa to seek shelter as the TIEs began bombing the crash site behind them."}, {"tag": "p", "text": "Once inside, Bach told the pilot about his earlier life and about how he had to defend the artifacts for future generations, claiming that he couldn't jeopardize their safety by giving her a ship as her take-off would draw Imperial attention to the colony. Nadrinakar explained that she needed to travel to the planet Corellia to warn her fellow resistance members of an oncoming attack, but Bach was still not convinced to help her. The pair agreed to work together despite their disagreement, in order to make sure the Imperials did not find them. Bach led Nadrinakar through the colony toward the power generator, which they would need to switch off to avoid detection by the sensors of an Imperial frigate in the system."}, {"tag": "p", "text": "To reach the generator they had to pass outside of the colony's tunnel systems, and as they crept round the mesa Bach began humming the Song of Lojuun, a tune from an old Bith opera, which made his companion smile. Nadrinakar then spotted a group of three stormtroopers and an Imperial officer ahead and pushed Bach to the ground, hiding alongside him. She demanded that they make a new plan, as the Imperials were stood atop the hatch to the generator room, but the old antiques dealer demanded they stick to the plan of shutting the generator down and then got up and approached the Imperials in an attempt to mislead them. Bach tried to persuade the group that the pilot from the crashed fighter had attacked him and run off, hoping to lead the search away from the mesa. The Imperials ordered him onto his knees, but before they had a chance to harm him, Nadrinakar opened fire and killed all four of them."}, {"tag": "p", "text": "Alerted to the pair's location, the Imperials began bombing near the mesa as Bach and Nadrinakar scrambled to get through the hatch back into the colony. Once safely underground, the pilot reconsidered her priorities and told Bach they could hide to protect the antiques. Bach too had a change of heart, lying to Nadrinakar and telling her they needed to split up, directing her to the colony's hangar bay but telling her that she was headed to a backup generator that needed to be turned off. Once she was gone, he moved to the generator room and sealed the hangar doors behind the pilot, to prevent her trying to turn back. He then set to work powering up the hangar's exit doors so Nadrinakar could fly out in the old ship that Uvell had given him, and then began preparing a series of distractions so that Nadrinakar might evade the Imperial frigate and escape the star system."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "By the time Bach encountered Nadrinakar he had a protruding gut, and doubted that he possessed the muscle or charm it would take to survive an encounter with a pirate."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Antron Bach was created for \"The End of History\" a short story written by Alexander Freed and published in 2014 in Star Wars Insider 154."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}