{"url": "Klis_Joo", "categories": ["Category:Legends articles", "Category:Almas residents", "Category:Duros", "Category:Educators", "Category:Females", "Category:Jedi Consulars", "Category:Mayors", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Klis Joo"}, {"tag": "p", "text": "Klis Joo was a female Duros Jedi Knight who served the Jedi Order and the Galactic Republic during the last decades of the Republic Classic era. Unlike most Jedi of the era, Joo held a position in a local government, becoming the elected governor of the city of Forard on the planet Almas."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born to Duros parents on the world of Duro, even as a child Klis Joo demonstrated a general aptitude in the use of technology that was common to her species. During her very early years of childhood, Joo was identified to be Force-sensitive and sent to the Jedi Temple on Coruscant for training in the ways of the Force. At the Temple academy, Joo befriended fellow Initiate Nerra Ziveri, and the pair eventually graduated the academy and were selected as Padawans by two Jedi Masters. Under her tutor, Joo traveled the galaxy, learning to temper her emotions and using her persistent nature to eventually pass the Trials of Knighthood. Made a Knight of the Republic by the Jedi High Council, Joo went onto to pursue individual studies in the ways of the Jedi Consular."}, {"tag": "p", "text": "Traveling around the galaxy on solo missions for the High Council, Joo returned to her homeworld in an attempt to learn more about her people's struggles and aid them in whatever way she could. However, it wasn't long before Joo became uncomfortable when confronted with her people's deference and she soon returned to Coruscant. Around this time, Joo met Corellian mechanic Bran Isken, appreciating his skills and commending him for aiding a Duros couple in need. After working out of Coruscant for a time, Joo's old friend and peer Master Ziveri invited the Duros to teach at the experimental academy on Almas. Accepting the invitation, Joo arrived in 53 BBY only to find that Ziveri had mysteriously left the academy. Again growing uncomfortable with her situation, Joo found teaching dull and often grew impatient with her students."}, {"tag": "p", "text": "Making frequent visits to the nearby settlement of Forard, a small town servicing the academy's needs, Joo quickly accepted the office of governor when the position was left vacant after her predecessor passed away. Striving to improve conditions in the small town, Joo raised funding to expand and upgrade the local spaceport, bring the facility up to high standards with twenty berthing bays. To fill the empty position of mechanic magister, Joo contacted her old friend Bran Isken, offering him the job which he accepted."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Short for a Duros, Klis Joo was more hot-tempered then most Jedi, something that her teachers frowned upon during her time at the Coruscant academy. One of Joo's biggest pet-peeves was being mistake for a Neimoidian like so many of her species. Embracing her knack for technological study, Joo often tinkered with ships at the Temple, at one point taking up a hobby of preparing a racing ship in the Eskaron Games. When Joo took up public office on Almas, something discouraged by the High Council on Coruscant, the Duros fell out of practice in listening to the Force for guidance, relying on other judgments to help her decisions."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}