{"url": "Klytonian", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Klytonian"}, {"tag": "p", "text": "The Klytonians were a sentient species who had the ability to communicate with one another at a distance using natural electric fields generated by the thick scales that covered their bodies. Their home system was the Klytonia system, which was located in the Outer Rim Bheriz sector. Klytonians were present in Chalmun's Spaceport Cantina on the planet Tatooine in 0 BBY when the Humans Luke Skywalker and Obi-Wan Kenobi sought passage offworld."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Klytonians were a species of sentient beings whose bodies were covered in leathery scales that generated a natural electric field."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Members of the species were able to communicate with one another over fairly long distances by creating vibrations in their scales' electric fields."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Klytonians hailed from the Klytonia system, a star system that became integrated into the galaxy as part of the Outer Rim Territories' Bheriz sector."}, {"tag": "h2", "text": "Klytonians in the galaxy"}, {"tag": "p", "text": "In 0 BBY, at least two Klytonians were present at the Mos Eisley Cantina on the planet Tatooine when the Humans Luke Skywalker and Obi-Wan Kenobi entered looking for passage to the planet Alderaan. Despite the din in the establishment, the Klytonians used their electrical fields to talk to each other across the crowded bar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Klytonians are mentioned in Cantina Communications, an article written by John Chesterman and originally published in Star Wars Official Poster Monthly 16 in January 1979."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}