{"url": "Knag", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Galactic Empire science and engineering personnel", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Knag"}, {"tag": "p", "text": "Knag was a Human male doctor who worked for the Galactic Empire during the Galactic Civil War. By the time following the Battle of Yavin in 0 BBY, Doctor Knag was posted as a researcher at the Warren, a top-secret Imperial Research Facility on the planet Dantooine. During his time at the Warren, Knag and many other research scientists went rogue, and supported Colonel Bors Teraud's ambitions to overthrow Galactic Emperor Palpatine by creating an army of loyal cyborg followers. However, this attempted coup was foiled by a dutiful citizen who infiltrated the Warren, killed Doctor Knag, and submitted evidence of Colonel Teraud's treachery to the Imperial authorities."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male doctor by the name of Knag served the Galactic Empire during the time of the Galactic Civil War. By the time following the Battle of Yavin in 0 BBY, Doctor Knag conducted research at the Warren, a top-secret Imperial Research Facility in the Rielig Steppes region of the Outer Rim world of Dantooine. Colonel Bors Teraud served as both the Warren's commanding officer, and as Doctor Knag's superior. With his sizeable amount of followers, the megalomaniacal Colonel believed it possible to overthrow Galactic Emperor Palpatine and subvert his control over the entire galaxy. To that end, Colonel Teraud managed to sway Doctor Knag and many other Imperial research scientists and officers to his cause. These Teraud Loyalists, as they were called, betrayed the Empire and supported the Colonel's plans to amass an army of mindless cyborgs intent on launching a coup against the Emperor."}, {"tag": "p", "text": "The Warren descended into chaos after Colonel Teraud and his loyalists banded together to focus on their illicit cybernetics research. A large number of various cyborg creatures, including bols, dune lizards, huurtons, slice hounds, and tusk cats were left to freely roam the sprawling underground facility. A number of rogue droids were also left to patrol the Warren's countless corridors. Many loyal Imperial stormtroopers and Imperial officers, agitated by this insurrection of cyborgs, droids, and Teraud Loyalists, began attacking everything in sight. In addition to their cybernetics work on many of the Warren's creatures, Doctor Knag and the other scientists furthered their unsanctioned research on their fellow Humans. Dirk Maggin for instance, volunteered to be one of Teraud's Loyalists. In doing so, Maggin subjected himself to having his mind controlled by a cyborg device, eliminating his free will. A number of other Imperials were subjected to these same mind control implants, furthering Colonel Teraud's vision of creating an army of faithful cyborg soldiers. However, this research was not limited to only the brains of Humans and other small creatures. Colonel Teraud also ordered Imperial workers to carve the brains out of Krayt dragons, massive carnivorous reptiles native to the planet Tatooine. At least one of these Krayt dragon brains was planted inside an altered All Terrain Scout Transport, turning the simple Imperial walker into a cybernetic monstrosity. The extent of this perverse scientific research drove Imperial worker O'Evitt Piboi to flee the Warren in fear."}, {"tag": "p", "text": "After escaping the Warren, O'Evitt Piboi happened across a spacer in the surrounding countryside. Piboi frantically explained to the spacer the horrors of what was occurring inside the corrupted confines of the Imperial Research Facility. To put an end to Colonel Teraud and his band of loyalists, the spacer accepted Piboi's passkey and infiltrated the Warren to collect evidence of Colonel Teraud's wrongdoing. While exploring the immense confines of the Warren, the spacer battled Colonel Teraud's large band of cyborgs, droids, and loyalists. The spacer also happened upon Doctor Knag himself, who wielded his weapon in a violent attempt to subdue the spacer and turn the individual into yet another one of his cyborgs. As he began attacking the spacer, Doctor Knag revealed his true ambition to have his \"children\" one day take over the facility. Doctor Knag believed himself smarter than Colonel Teraud, and wanted to prove that he was destined to one day rule. However, the doctor's self-serving ambitions were put to an end when the spacer succeeded in killing him during the scuffle. Ultimately, the spacer left the Warren, not only having killed Doctor Knag, but also Colonel Teraud. The spacer also acquired hard evidence of the illicit activities conducted within the Warren. This evidence was submitted to the proper Imperial authorities in Theed, capital of the planet Naboo. For their part in putting a stop to the maniacal plans of Colonel Teraud, Doctor Knag, and their other followers, the spacer was commended by Captain Heff as a hero of the Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Doctor Knag had fair skin, gray hair, and blue colored eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his time as a researcher at the Warren, Doctor Knag wore a white colored smock with a dark gray waistband, and black colored uniform boots. His personal arsenal consisted of multiple types of blaster pistols and slugthrowers, including a DL-18 Blaster Pistol, an FWG-5 Flechette Smart Pistol, a Striker projectile pistol, and an SE-14 blaster pistol. A DH-17 blaster carbine also served as a secondary armament for the doctor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Doctor Knag was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Players who accepted the Warren quest could encounter Knag inside the Imperial Research Facility on the planet Dantooine. If the player were to attack Knag, then the doctor would reveal his plans to turn the spacer into a cyborg, and seize control of the facility for himself. If the player were to be defeated by Knag, then the doctor would remark that the player was not \"salvageable\" enough to be turned into a cyborg. Knag's inclusion in the Warren was only incidental to the actual quest. Killing him was optional, and it was possible for players to avoid encountering him altogether. However, this article assumes 100% game completion, and that the player succeeded in killing Doctor Knag. The game's directory tree files reveal Knag's full name to be Knag Garhun, but the last name of Garhun was never mentioned in the actual game. Therefore, the last name of Garhun is ambiguously canon within the Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}