{"url": "Kni", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Dantooinians", "Category:Duros", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kni"}, {"tag": "p", "text": "Kni was a male Duros who lived during the time of the Old Sith Wars. During the Jedi Civil War, the Sith Empire bombed Kni's homeworld. Kni survived the destruction of the planet and fled and eventually took up residence at the Jedi Enclave on the Outer-Rim world of Dantooine. While there, he was approached by Revan, who was suffering from amnesia."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Jedi Civil War, the Sith Empire bombed Kni's homeworld, decimating the landmasses and boiling the oceans. Kni fled when the Sith Fleet arrived, and narrowly survived the attack.becoming a refugee. He eventually found his way to the agricultural Outer-Rim world of Dantooine, where he found a secret Jedi Enclave. The Jedi allowed him to take up residency at the Enclave, and he would often spend time in it's courtyard."}, {"tag": "p", "text": "In 3956 BBY, he was approached by an amnesiac Revan, and the two discussed the Kni's past. Kni recognized Revan as a Jedi, and thanked him and the Council for granting him residence. Kni still lived at the Jedi Enclave as of its decimation by the Sith."}, {"tag": "h2", "text": "Personality and Traits"}, {"tag": "p", "text": "Kni was a Duros, and therefore shared the same red eyes and blue skin of others of the species, albeit with a more teal tinge. He had a rather hunched posture. While living on Dantooine, he wore a white and mauve tunic, mauve pants, green and white boots, and a utility belt."}, {"tag": "p", "text": "Kni was grateful to the Jedi Order for allowing him the reside at the Enclave. He believed that the Galactic Republic was losing the war, but to no fault of their own. Having seen the decimation of his planet, he believed the Sith to be strong enough to destroy all its enemies. He was capable of understanding Basic, but spoke in Durese. Kni spoke with peculiar grammar, ending many statements as if they were questions, and appending \"yes\" to many of them. Due to his time spent fleeing, he had very few material possessions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kni appeared as a non-player character in the 2003 roleplaying game Star Wars: Knights of the Old Republic. His dialogue is optional, and has no affect on the story or the player's alignment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}