{"url": "Knight_Errant:_Aflame_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Knight Errant"], "nodes": [{"tag": "h1", "text": "Knight Errant: Aflame 4"}, {"tag": "p", "text": "Knight Errant: Aflame 4 is the fourth issue in the Star Wars: Knight Errant comic series and the fourth in the Aflame story arc written by John Jackson Miller. It is was released on January 12, 2011."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Jedi Kerra Holt prevented the destruction of the mining colony of Chelloa… but she also began a Sith-on-Sith war, and the colony is in the middle!"}, {"tag": "p", "text": "Complete annihilation has not come to the planet of Chelloa by the hand of Sith Lord Odion, but a war between him and his rival brother, Lord Daiman, might not leave much of the planet for either of them to rule. It's up to Kerra to find the advantage in the rivalry between the two Sith."}, {"tag": "p", "text": "John Jackson Miller is also writing a Knight Errant novel for Del Rey starring Kerra Holt.\nRead about Kerra Holt here first in Dark Horse Comics!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The Jedi Knight Kerra Holt is the sole survivor of an ill-fated Jedi mission to disrupt the production of baradium on the Daimanate world of Chelloa. The Sith Lord Daiman tricks Kerra into launching an attack on his older brother Odion. Kerra is unsuccessful but convinces Odion to abandon his plan to destroy Chelloa with kinetic corruptors. A furious Daiman tortures his captive Gorlan, while discussing his narcissistic beliefs. He also orders the complete destruction of the town of Jenith in retaliation for harboring a Jedi Knight and the arrest of the village leaders of the ten mining towns on Chelloa. During the ensuing massacre, Kerra rescues Gorlan's family from Sith troopers. The survivors flee to the nearby town of Arboth, where the mobile complexes are housed. Kerra again infiltrates Daiman's compound and rescues Gorlan and the town leaders. Gorlan reveals that he and the deceased Rodian Skodo had used a transmitter to communicate with the Jedi about Daiman's operations. However, Odion had also intercepted the transmissions and learnt about the baradium operations. He also admitted contacting Odion to mislead him, with the futile intentions of keeping him away from Chelloa."}, {"tag": "p", "text": "Following a conversation with Gorlan, Kerra realizes that her true mission was not to take on the Sith Lords, but rather to save the civilians on Chelloa by evacuating them to Republic Space. Prior to leaving the compound, Kerra also leaves a personal message for Daiman by beheading his prized statues to challenge his omnipresence. Meanwhile, Odion prepares to launch his landing ships for a planetary invasion of Chelloa. Kerra, Gorlan, and the town leaders flee to Arboth. At the nearby spaceport, Kerra investigates the fleet of cargo freighters and transports supposedly carrying the workers supposed to work on the mobile factories. She finds that they are all empty and proposes evacuating the entire population of Chelloa: 60,000 sentient beings spread across ten mining towns. Gorlan agrees to help Kerra and activates his lightsaber, symbolizing his re-commitment to the Jedi Order."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}