{"url": "Knight_Errant:_Deluge_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Knight Errant"], "nodes": [{"tag": "h1", "text": "Knight Errant: Deluge 2"}, {"tag": "p", "text": "Knight Errant: Deluge 2 is the second issue in the Deluge story arc of the Star Wars: Knight Errant comic series written by John Jackson Miller."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Answering a distress call, Jedi Knight Kerra Holt has returned to her Sith-held home planet to liberate as many slaves as possible with a single shuttle. She didn't expect to meet a squadron of starfighters from the Republic! With the help of the Devil Squadron, Kerra can go on the offensive, and the entire planet will have a chance at liberation!"}, {"tag": "p", "text": "But there is more to the Devils than it first appears. A scheming Hutt with an evil agenda is infiltrating the planet, and the Sith Lord Daiman is just getting wind of what is happening on his planet!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Responding to a distress transmission, the Jedi Knight Kerra Holt returns to her homeworld of Aquilaris Minor only to discover that it is under attack from the Hutt crimelord Zodoh. At the last minute, Kerra and the Aquilaris locals are rescued by Captain Jenn Devaad's Devil Squadron, a starfighter squadron affiliated with the Alderaanian mercy organization Grace Command. On Vellas Pavo, the Sith Lord Daiman ordered his forces on Aquilaris not to surrender. However, Devil Squadron wiped out all Sith resistance. Kerra herself participated in this campaign, borrowing a Fire Lotus-class starfighter from Devil Squadron and shooting down a Daimanate starfighter. Following the battle, Grace Command began distributing food and medical supplies to the Aquilarians with Kerra assisting in the relief work. Kerra also developed a close friendship with Captain Jenn and learnt more about Grace Command's relief missions. Devil Squadron worked in cooperation with Grace Command by providing a military foothold in Sith Space for it to provide relief assistance to impoverished worlds."}, {"tag": "p", "text": "In response to the widespread epidemic of Deluge addiction among the population, Grace Command arranged for several serious cases to be evacuated on the transport Mother Grace for medical treatment on Alderaan, the headquarters of Grace Command. Devil Squadron also distributed time-locked food cases which would only open once they had departed. One of the recipients was Kerra's childhood friend Joad Kreel, who had become a spice addict. Kerra also got a place within Devil Squadron since one of the pilots Yades was rotating with the transport crew. While Jenn is eager to welcome Kerra aboard, some of her crew particularly Vahss expressed their concerns that Kerra would learn about their secrets. However, Jenn assured them that Kerra as a \"product\" of Vannar Treece would be too focused on the mission to notice anything suspicious and that she would never have to know the rest. However, Joad eavesdrops on their conversation and tries to alert Kerra but she still thought he was under the effects of the spice."}, {"tag": "p", "text": "After escorting Mother Grace to its hyperspace jump point, Devil Squadron encountered Zodoh's Intruder-class starfighter which led them on a wild pursuit. Despite Kerra's call for caution, Jenn was seeking revenge against Zodoh for the harsh treatment she and her crew endured under the Hutt's captivity. Devil Squadron subsequently enters into a trap and is then attacked by Zodoh's fighter-carrier Voracious and Intruder starfighters. At that point, a fleet of Stormdrivers exited hyperspace and Zodoh announced about his intentions to create an artificial global flood on Aquilaris Minor over the intercomm. Zodoh also boasted of his intentions to subdue his Sith rivals by using the Stormdrivers to flood their worlds."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}