{"url": "Knight_Errant:_Escape_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Knight Errant"], "nodes": [{"tag": "h1", "text": "Knight Errant: Escape 1"}, {"tag": "p", "text": "Knight Errant: Escape 1 is the first issue in the Escape story arc miniseries of the Star Wars: Knight Errant comic series written by John Jackson Miller."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Jedi Knight Kerra Holt's next mission starts with a very personal and ultrasecret investigation! But with the dark realities of Sith territory surrounding her, something unexpected may be taking hold of the lone Jedi! As she takes the first step toward her goal, Kerra knows there will be no turning back!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the Aquilaris campaign and the Battle of Darkknell, the Jedi Knight Kerra Holt established contact with the Sith Lord Daiman. Earlier, she had saved the planet Darkknell from the Hutt crime lord Zodoh. In return for her help, Daiman agreed to helped her infiltrate the Odionate, a region in the Grumani sector ruled by his estranged older brother Lord Odion. Kerra sought to destroy Lord Odion and also wanted to discover the fate of her lost parents Aron and Mercia Holt following their separation during the invasion of Aquilaris Minor in 1042 BBY. Disguised as a slave worker trying to escape Daiman's war forges on Tergamenion named \"Mercy,\" Kerra succeeded in making contact with the Claimer Wayman, an Odionate recruiter. He provided her with a signalling device, which he instructed her to activate when she arrived in the Odionate. Despite being mutual enemies, Daiman was willing to help the Jedi woman due to his long-entrenched sibling rivalry and because he had foreseen a great tribulation in the future, emanating in Odion's domain."}, {"tag": "p", "text": "Kerra subsequently infiltrated the Odionate and joined the Novitiates, Odion's elite corps of Dark Side Adepts. Kerra was part of a detachment of Novitiates deployed during an invasion of Skarpos, a planet within Lord Malakite's realm known as the Menagerie. During the fighting, Odion's forces sustained heavy casualties due to General Beld Yulan's suicide wave tactics. Mercy attracted Yulan's ire when she attempted to hold back Yulan's forces from charging into burning tar pits filled with starfighter fuel. Mercy's self-preservation was at odds with Odion's nihilistic philosophy of embracing death through combat. Following the battle, Mercy's forces were reassigned by Wayman and ordered to reconvene with Odion for a debriefing at Jubalene, Odion's newly acquired capital in the former Bactranate."}, {"tag": "p", "text": "On Jubalene, Mercy and other Novitiates witnessed the violent deaths of three Jubalene Duros bankers who had been tricked into fighting an enraged rancor in an arena. Odion could not tolerate the bright energy created by life through the Force due to his hypersensitive Force abilities and thus sought to snuff it out. Thus, the death of another living being for him was a relief from this irritant. During the briefing session, Odion outlined his interests in procuring the Helm of Ieldis, an ancient Sith artifact created prior to the Great Hyperspace War that was capable of driving sentient beings into a homicidal frenzy. Years earlier, Odion had commissioned a mission known as Project Pandemonium to find the Helm, but it had stopped at Sarrassia, then ruled by rival Sith Lord Ayanos Bactra."}, {"tag": "p", "text": "With the collapse of the Bactranate, Odion was now able to continue his quest. He assigned Mercy and her team of Novitiates the task of continuing Project Pandemonium. General Yulan prepared his fleet for an invasion of Sarrassia. While Odion and the other Novitiates left to watch more entertainment at the Sith arena, Kerra took the opportunity to access information about her parents on the data center in the chamber. She found out that they had been conscripted into Project Pandemonium following the invasion of Aquilaris."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}