{"url": "Knight_Errant:_Deluge_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Knight Errant"], "nodes": [{"tag": "h1", "text": "Knight Errant: Deluge 5"}, {"tag": "p", "text": "Knight Errant: Deluge 5 is the fifth and final issue in the Deluge miniseries story arc of the Star Wars: Knight Errant comic series written by John Jackson Miller."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Caught between a Sith and a Hutt, Jedi Knight Kerra Holt must battle both to save the billions on the planet Darkknell from being drowned by a fleet of ships with the power to flood the planet! Her plan is full-steam-ahead brute force - but her enemies are more cunning than she expected. Is this the end of Kerra Holt, the lone Jedi ?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following his successful test demonstration on Aquilaris Minor, the Hutt crimelord Zodoh sends his fleet of Stormdriver to ravage the Daimanate capital of Darkknell. After overwhelming the weak Daimanate defenses, the Stormdrivers quickly flooded large areas of the planet including Daiman's Sanctum Celestial fortress in the capital city of Xakrea, causing extensive damage. Despite all seeming lost with even his Sith relatives collaborating with Zodoh, the Sith Lord Daiman refused to concede defeat by claiming his universe \"had vast resources everywhere and defenders no one would ever expect.\" Kerra and Jenn arrived in the midst of the space battle in their Hutt twin-seater starfighter and entered the hangar bay of Zodoh's flagship Voracious. Kerra infiltrated the Voracious while Jenn engaged Zodoh's starfighter defenses."}, {"tag": "p", "text": "Kerra succeeded in infiltrating the control dome where the Stormdrivers were being coordinated. There, she was attacked by Zodoh, who personally dueled with her. Unlike other Hutts, Zodoh was physically fit and interested in combat. Zodoh was able to gain the upper hand and was about to kill Kerra when the dome was attacked by Jenn's starfighter, exposing the interior to zero gravity space. After rescuing Kerra, Jenn fired a volley which destroyed the Voracious, throwing the Stormdrivers into chaos and turning the tide of the battle. Zodoh survives the battle but is captured by Daiman who personally executes him in the presence of his Sith relatives, who were present via hologram. Meanwhile, Kerra and Jenn escape back to Aquilaris."}, {"tag": "p", "text": "By then, the floods were receding and the planet was drying up. Kerra also reconciled with both her childhood friend Joad Kreel and Captain Jenn Devaad. Under the leadership of the Seacroppers Padgett and Joad, Aquilaris Minor with its extensive underwater harvesting facilities would become a base for refugees fleeing Sith Space to the safety of the Galactic Republic. Jenn also worked out a plan to sabotage Operation Deluge by claiming that she had obtain a contract for distributing Deluge on Aquilaris. She would then dump the Deluge spice into hyperspace and then use the same transport to ferry refugees into the Republic. As a gesture of friendship, Jenn also gave Kerra her own Fire Lotus-class starfighter, to save her having to hitch rides throughout Sith Space. The two women then parted with Jenn returning to the Republic and Kerra continuing her knight errant missions into Sith territory."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}