{"url": "Knight_Errant:_Deluge_3", "categories": ["Category:Real-world articles", "Category:Star Wars: Knight Errant"], "nodes": [{"tag": "h1", "text": "Knight Errant: Deluge 3"}, {"tag": "p", "text": "Knight Errant: Deluge 3 is the third issue in the Deluge story arc of the Star Wars: Knight Errant comic series written by John Jackson Miller."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Jedi Knight Kerra Holt's elation at the prospect of being part of a team again has quickly deflated now that she realizes the motives of the Republic's Devil Squadron are a far cry from her own. But with crime lord Zodoh the Hutt returning to Kerra's home planet and the Sith Lord Daiman about to enter the fight, Kerra must sort out her allies or be destroyed!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "While traveling to fight the Sith Lord Malakite's forces on Heptooine, the Jedi Knight Kerra Holt and her newly-found Devil Squadron friends are ambushed in the Aquilaris Minor system by the Hutt crimelord Zodoh. On Darkknell, much of Daiman's military forces had become affected by the spice Deluge. In response, he ordered the culling of these addicts from his starfighter corps before his Sith relatives found out about it. Unable to reconciled her differences with Captain Jenn Devaad, Kerra Holt disengaged from the dogfight and flew back to Aquilaris Minor, intending to save her people from the coming storm. At the end of the skirmish, the remaining members of Devil Squadron were captured by Voracious's tractor beam and their crew were disarmed and taken captive. Zodoh meets with a captive Captain Jenn, offering to spare her crew if she agreed to acquire the stocks of Deluge spice on Aquilaris."}, {"tag": "p", "text": "Meanwhile, Kerra tries to organize an evacuation on Capital Cay to move the locals to higher grounds. Kerra faced an insurmountable logistical problem due to the lack of sufficient numbers of airspeeders and boats. Many of the Seacroppers also remained in a drug-induced state while their submersibles were in a decrepit state. While visiting the submersible docking yards, Kerra encountered her despondent and dejected childhood friend Joad Kreel and tried unsuccessfully to persuade him to help with the evacuation. Out of frustration, Kerra kicked a food container open only to discover that it contained only Deluge spice. Kerra quickly realized that Devil Squadron were actually spice dealers who were deliberately distributing Deluge among occupied populations."}, {"tag": "p", "text": "Kerra encountered Jenn in the spaceport, forcing several Aquilarians including Padgett at gunpoint to load containers of spice onto her shuttle. After overpowering and disarming her, Kerra confronted the squadron captain about the Deluge spice. Jenn revealed that Grace Command was actually a cover for Baron Lemayne's Operation Deluge which involved undermining the Sith war effort by inundating Sith-controlled Space with Deluge spice. While it succeeded in weakening Sith manpower, it also affected entire local populations. Jenn also justified her actions by stating she wanted to save the lives of her crew. Jenn also revealed that her hatred towards civilians in Sith Space stemmed from civilians refusing to shelter her and other survivors of an ill fated Republic task force dispatched to Dalaang. Unable to reconcile their differences, Jenn leaves on a shuttle with the Deluge supplies to return to Zodoh's flagship, leaving Kerra behind with the civilians."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}