{"url": "Knighting_ceremony/Legends", "categories": ["Category:Legends articles", "Category:Ceremonies", "Category:Jedi culture"], "nodes": [{"tag": "h1", "text": "Knighting ceremony"}, {"tag": "p", "text": "The Knighting ceremony was the ceremony in which a Jedi Padawan or apprentice was made into a full Jedi Knight. An ancient ritual, it was presided over by members of the Jedi High Council or of the other three Councils and led by the Grand Master. This ceremony could be repeated for a Knight who achieved the rank of Master."}, {"tag": "h2", "text": "Overview"}, {"tag": "h3", "text": "Old Jedi Order"}, {"tag": "p", "text": "The Knighting ceremony was an ancient ritual dating back to the beginnings of the Order's history and each Padawan was responsible for preparing themselves and reviewing their role in the ancient rite. Only the High Council could promote an apprentice to the rank of Knight by the end of the Republic; though in the past the student's master was also permitted to knight their own students. After passing the Jedi Trials, the student was assigned a date that the ceremony was set to take place on. The day before the ceremony the Padawan was required to ascend to the heart of the Tranquillity Spire where they were to meditate within the preparation chamber located there. While typically alone, it wasn't unheard of for several Padawans to meet there at once; though socializing was frowned upon as each apprentice was supposed to be searching for their future path."}, {"tag": "p", "text": "The following day, the Padawan was summoned to the next level of the Tower: the Hall of Knighthood. Entering into the darkened chamber, the Padawan would kneel in the center of the room as the Masters present ignited their lightsabers in a ring around the student. Led by the Grand Master of the Order, the other Masters were typically those who sat on the High Council and other prominent Jedi who helped in the apprentice's journey. If the High Council was unavailable, members of the other three Jedi Councils could step in to complete the ring. Reciting the ancient passages used in the traditional ceremony, the Grand Master would lower their lightsaber to just above each of the Padawan's shoulders and, for those of hair-growing species, sever the braid that hung behind the ear of the newly appointed Knight. The Jedi was then able to collect the braid and depart the chamber in silence, the ritual completed."}, {"tag": "p", "text": "While the ceremony was the norm, sometimes expedience overrode tradition. During times of war or on extended journey missions, Masters would knight their own students if they could not return to the Temple or field promotions were necessitated by another ranking military personnel's death."}, {"tag": "p", "text": "In addition to raising a Padawan to Knighthood, the Council also brought Knights to the Hall to grant them the rank of Master. To achieve this rank, a Knight could opt to take a modified version of the Trials, or successfully train a Padawan to Knighthood themselves."}, {"tag": "h2", "text": "New Jedi Order"}, {"tag": "p", "text": "Following the Great Jedi Purge, the exiled Grand Master Yoda trained the last Jedi of the Old Order, Luke Skywalker. Because Yoda died before Skywalker completed his training, the Human never was formally knighted and thus did not initially continue the rite in his resurrected Order. Beginning a new praxeum on Yavin 4, Skywalker trained several classes of apprentices, pronouncing them Knights once they had completed a battery of tests and completed their own lightsabers. Without ceremony, the practice of raising students often took place in casual conversation or during an informal gathering, as was the case with Jaden Korr in 14 ABY."}, {"tag": "p", "text": "It wasn't until 24 ABY that Skywalker came to possess the last remaining copy of The Jedi Path: A Manual for Students of the Force, a guidebook from the Old Order that outlined the knighting ceremony. Working towards formalizing a ceremony that would fit his new Order, Skywalker performed the knighting of Jacen and Jaina Solo, Zekk, Tenel Ka Djo, Lusa, Raynar Thul, and Lowbacca following their year of service in aiding the downfall of the Diversity Alliance and Black Sun. More celebratory than the rituals of the past, the ceremony was held in the Great Temple's Grand Audience Chamber before the entire Order. Incorporating a lightsaber salute from all ranking members of the Order, Master Tionne performed a ballad of the deeds of the newly promoted Knights."}, {"tag": "p", "text": "Three years later, as the first act of the reformed High Council, Skywalker knighted the Padawan survivors of the Mission to Myrkr at a ceremony on Dac. Each student was called individually to be given a brief and private speech by the Skywalker, and then received their formal robes of Knighthood."}, {"tag": "p", "text": "Following the horrors of the Yuuzhan Vong War, the Temple on Coruscant was reconstructed, and the majority of the Order relocated there. Rebuilding the formal knighting hall, the Council once more continued the formal ceremony of the Old Order."}, {"tag": "h2", "text": "Formal passages of the knighting ceremony"}, {"tag": "p", "text": "At each formal ceremony, the Grand Master recited the same ancient words when knighting each Padawan. The formal opening of the ceremony welcomed the participating Masters, and focused their minds on why they were there."}, {"tag": "p", "text": "With that said, the Grand Master would call the Padawan by name and bring their lightsaber down above each of the kneeling student's shoulders."}, {"tag": "p", "text": "With the ceremony complete, the Knight would take up their lightsaber and exit the chamber in silence, signaling the end of the ritual."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}