{"url": "Knight_Errant_(novel)", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Legends novels", "Category:Star Wars: Knight Errant"], "nodes": [{"tag": "h1", "text": "Knight Errant (novel)"}, {"tag": "p", "text": "Knight Errant is a Star Wars Legends novel written by John Jackson Miller. It ties in to Jackson's comic book series Star Wars: Knight Errant, and it was first published on January 25, 2011 by Del Rey. The novel is set in the year 1032 BBY, and it follows the events of Aflame, the comic book series' first story arc."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A thousand years before Luke Skywalker, a generation before Darth Bane, in a galaxy far, far away…"}, {"tag": "p", "text": "The Republic is in crisis. The Sith roam unchecked, vying with one another to dominate the galaxy. But one lone Jedi, Kerra Holt, is determined to take down the Dark Lords. Her enemies are strange and many: Lord Daiman, who imagines himself the creator of the universe; Lord Odion, who intends to be its destroyer; the curious siblings Quillan and Dromika; the enigmatic Arkadia. So many warring Sith weaving a patchwork of brutality—with only Kerra Holt to defend the innocents caught underfoot."}, {"tag": "p", "text": "Sensing a sinister pattern in the chaos, Kerra embarks on a journey that will take her into fierce battles against even fiercer enemies. With one against so many, her only chance of success lies with forging alliances among those who serve her enemies—including a mysterious Sith spy and a clever mercenary general. But will they be her adversaries or her salvation?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "By the beginning of the novel, Jedi Knight Kerra Holt attempts to kill Lord Daiman even as the psychotic Sith does battle with his vicious brother, Lord Odion, at the Battle of Gazzari. However, Kerra decides to save the lives of the innocent people who were in the midst of combat with the help of Jarrow Rusher."}, {"tag": "p", "text": "Following their departure from Gazzari, Kerra, Jarrow, and the others find themselves arriving on a world ruled over by the Sith siblings Qullian and Dromika. Kerra manages to snap their hold over this world just as the forces of Arkadia Calimondra arrive so they can collect their leader's cousins."}, {"tag": "p", "text": "Calimondra takes her cousins, Kerra, Jarrow, and the rest of the innocent people back to her own world, where she shows her society to be a peaceful one, unlike the others. However, Kerra sees through her ruse, as Calimondra has made her society in which no one is special and no one can rise in rank. Calimondra nevertheless asks Kerra for her help in killing Vilia Calimondra so that conflicts like the one between Daiman and Odion can stop. Kerra naturally declines to help the Sith, and she escapes with Jarrow and the others."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}