{"url": "Knights_of_Ren", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Knights of Ren", "Category:Mercenary units"], "nodes": [{"tag": "h1", "text": "Knights of Ren"}, {"tag": "p", "text": "The Knights of Ren was an enclave of masked warriors who served Kylo Ren—master of the Knights of Ren and Supreme Leader of the First Order—during the New Republic Era. They were neither Jedi nor Sith, but members of a new generation of Force-sensitive adepts that emerged to fill the void left by the demise of the last Sith Lords. Adhering to the ways of the Ren, a philosophy epitomized by the lightsaber, the Knights roamed the galaxy causing wanton destruction as devotees of the dark side of the Force. Armed with distinctive weapons for ranged and close-quarter combat, they were fearsome enforcers of their master's will."}, {"tag": "p", "text": "The Knights emerged from the Unknown Regions in the aftermath of the Galactic Civil War, when the Galactic Empire fell to the New Republic. They once followed a warrior known only as \"Ren,\" until Ben Solo joined their ranks after the resurgent Jedi Order fell back into ruin. Supreme Leader Snoke gifted the Knights to the newly christened Kylo Ren, who renounced his former identity and the Jedi Code. Strong with the Force, Kylo was heir to the powerful bloodline of the Sith Lord Darth Vader, but, unknown to him, the Knights' true loyalty belonged to the resurrected Dark Lord of the Sith, Darth Sidious."}, {"tag": "p", "text": "The Knights served as personal bodyguards to Kylo, who usurped Snoke's rule as Supreme Leader, during the final days of the war between the First Order and the Resistance. They were also tasked with hunting Rey, a Jedi apprentice who fought for the Resistance and shared a unique connection with Kylo. After Kylo returned to the light side of the Force, the Knights confronted their former master on Exegol, where they were slain in battle by Solo."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Overview"}, {"tag": "p", "text": "The Knights of Ren were Kylo Ren's most mysterious and deadly servants. They were an enclave of masked elite warriors wielding distinctive weapons for ranged and closequarter combat, making them the elite and fearsome enforcers of Kylo's will. The Knights hailed from the galaxy's Unknown Regions where their name and reputation inspired centuries of cautionary tales about the dangers lurking in uncharted space. Though local folklore warned of the marauders known as the Knights of Ren, the exact origins of their modern incarnation remained mysterious, for they were either directly connected to that ancient tradition or wrapping themselves in the legacy of legends. Nevertheless, the New Republic-era Knights of Ren were a force to be reckoned with. Their martial prowess was without equal, and they thrived in violence and strife."}, {"tag": "p", "text": "The Knights of Ren were neither Jedi nor Sith, but a new generation of warriors imbued with the power of the Force, though not to the extent of the aforementioned Jedi or Sith. As such, the Knights only allowed Force-sensitive beings to join their ranks. Even if a non-Force user was more inclined to their way of thinking than a potential recruit, the Knights would sooner kill them than accept one who could not feel the Force. Aside from the requirement of Force-sensitivity, admission into the group necessitated that a personal sacrifice be made. Another Knight known as \"Ren\" once asked a candidate for the Knights to kill his own brother, and Snoke warned Ben Solo that the price of entry was steep. Ultimately, the path to becoming a Knight of Ren ended in only one of two outcomes: succeed and join the Knights, or fail and die. Not many individuals sought out the Knights of Ren, and those who did regretted it quickly."}, {"tag": "p", "text": "The Knights' connection to the Force was muted by a lack of formal training, whereas Kylo himself had the potential for limitless power, being gifted with the raw strength of his bloodline. Nevertheless, the dark side of the Force was with them. When other Force users sensed the Knights' presence, they would feel the cold touch of the dark side emanating through the Force. In past generations, the Knights would have been considered perfect stock for the Galactic Empire's Jedi hunters, the Inquisitorius, if they could be tamed."}, {"tag": "p", "text": "In combat the dark side surged through the Knights despite possessing only slight Force abilities. Jedi Master Luke Skywalker was unimpressed by their battle skills and basic use of the dark side. According to Skywalker, who fought six of the seven Knights with the Force as his ally, the group was clumsy and untrained. He compared their use of the dark side to the way one used a hammer, whereas Skywalker, the last fully-trained Jedi Knight, wielded the light side as a blade."}, {"tag": "p", "text": "The Knights were served by Albrekh, an eccentric Sith alchemist and metalsmith known for his dexterous, steady hands. An alien whose sensitive ears could tell the heat of metal from the tone it made when struck, Albrekh made use of an ancient Sith forge for the purpose of repairing and improving the Knights' battle gear. His additional equipment included a series of four poseable arm mechanisms with magnetic forceps and reverse-repulsorlift grav-focused bases. The device was used in conjunction with a compressed air cooling nozzle and a molten Sarrassian iron application tool."}, {"tag": "p", "text": "The Knights traveled aboard a customized starship known as the Night Buzzard. A modified Oubliette-class transport manufactured by Osseriton Assemblages, the Night Buzzard was originally a dungeon ship from Osseriton, a penal world in the Unknown Regions. The Knights appropriated the transport for their personal use and altered its appearance to fit with their dark style. Additionally, they made crude modifications to the vessel's engine systems, generating greater thrust but at a cost to its insulation baffles. This resulted in the Night Buzzard spewing a trail of thick, noxious smoke."}, {"tag": "p", "text": "Despite Kylo Ren's ties to the First Order, the other Knights were not aligned with the Imperial remnant, as Kylo and Supreme Leader Snoke were the only Force-sensitive members of that regime. They were an independent, mobile group whose aim was to spread chaos and violence wherever they went. After Snoke was killed by Kylo, the Knights' presence became more common within the First Order's ranks. Where they once traveled the galaxy as marauders and mercenaries, the Knights became enforcers of Kylo's reign as the new Supreme Leader. However, only Kylo had the authority to command them, as the Knights would answer to no one else. This singular devotion to one individual created friction between the Knights and the members of the Supreme Council. After Kylo was redeemed to the light side of the Force and became Ben Solo once more, the Knights did not follow him. In spite of the fact that he had come to view the Knights as his faithful brothers, they had never truly been loyal to their so-called master because, while they were not Sith themselves, their true master had always been the Sith Lord Darth Sidious."}, {"tag": "h3", "text": "Membership"}, {"tag": "p", "text": "Aside from the leaders of the group, the Knights of Ren consisted of six members: Vicrul, Cardo, Ushar, Trudgen, Kuruk, and Ap'lek. The six Knights were commanded, in turn, by a vicious leader known only as \"Ren,\" and the inheritor of his Knights, Kylo Ren."}, {"tag": "p", "text": "Vicrul was the self-styled harvester, the reaper of the fallen, and the targeter of souls. Every victim felled by his weapons augmented Vicrul's power in the dark side, which was muted by his lack of Force-training. Yet with each strike his hate grew, allowing the dark side to surge through him. His latent Force talents, though unbidden and uncontrolled, manifested themselves in heightened reflexes and the power to magnify the fear in his prey."}, {"tag": "p", "text": "Cardo created wide swathes of destruction, whereas his fellow Knights preferred to strike with exacting precision. He had an obsession with weapon modification, making him the Knights' best armorer."}, {"tag": "p", "text": "Trudgen was a collector of trophies from fallen conquests. He incorporated said trophies into his existing armor, weapons and equipment, part of which included a fragment of death trooper armor."}, {"tag": "p", "text": "Ushar had a reputation for forcing his prisoners to grovel for mercy. He would take his time with the victims who whimpered for help, believing they deserved a slow punishment. While those who fought back earned his respect, Ushar would kill them all the same, but faster as they had earned a swift death in his view."}, {"tag": "p", "text": "Kuruk was the most solitary of the Knights. In addition to his role as the group's rifleman, he served as the pilot of the Night Buzzard. Noted for his precision marksmanship, he could be found perched on a high vantage point, covering an assault conducted by his fellow Knights. While Kuruk's helmet was designed to focus his attention on his target, his aim was further sharpened by concentrating on the Force."}, {"tag": "p", "text": "Ap'lek reveled in deception and strategy, employing feints and misdirection to trap an opponent. In this he differed from the other Knights, who preferred a straightforward and violent approach to eliminating their targets. His nascent Force abilities allowed Ap'lek to peer through the smoke screens that he would create to obscure an enemy's vision and disrupt sensors. As a warrior, his preferred lethal weapon was an ancient Mandalorian executioner's vibro-ax."}, {"tag": "p", "text": "Prior to the rise of Kylo Ren, the Knights followed the aforementioned leader who was also known by the name of \"Ren,\" although he insisted that the group did not follow him but rather their way of life. Nevertheless, Ren was the spokesperson of the group, as he would introduce them by name to enemies and potential allies alike. A devotee of the dark side, he followed the Knights' guiding principle, the Ren, and believed in it on a personal level."}, {"tag": "p", "text": "After renouncing the Jedi path, Kylo Ren became the archetype of this new generation of dark side warriors that emerged to fill the void left by the Sith's demise. Adopting the title master of the Knights of Ren, his ability to use the Force granted him many impressive combat skills. Despite his Jedi training and knowledge of arcane dark side lore, Kylo was neither Jedi nor Sith, but a combination of both sides' teachings. This created an imbalance within him, however. Though gifted with the raw power of his grandfather, the Sith Lord Darth Vader, Kylo struggled to overcome the light side within himself. Following his ascension as Supreme Leader of the First Order, Kylo called on his Knights to serve as his personal bodyguards in the same way that the Elite Praetorian Guard protected his predecessor, Supreme Leader Snoke."}, {"tag": "h3", "text": "Philosophy"}, {"tag": "p", "text": "The Knights of Ren lived by a code, to which they were flexible in following: living life the way they wanted, taking what the galaxy gave them, and consuming what the dark side sent them. The Ren, a lightsaber possessed by Kylo Ren's predecessor, also known as Ren, epitomized the Knights' code. The nature of the Ren, according to Ren, was that it just existed. It had no conscience, neither acknowledging or expressing concepts such as morality, regret or concern for what it might destroy. Ren believed in this principle on a deep, personal level to the point where he did not consider himself the Knights' leader. All of the Knights, including Ren himself, followed the lightsaber and what it represented in their view."}, {"tag": "p", "text": "Their devotion to the way of the Ren was matched only by their allegiance to the shadow—the dark side of the Force. The Knights did not search for just any Force-sensitive individuals to join the ranks; they wanted those who had a strong affinity for the shadow. This led Ren to consider a mass murderer and a child for membership, having sensed the shadow's presence in both of them."}, {"tag": "p", "text": "The Knights believed that they had a right to take anything and everything they so desired, particularly Jedi artifacts. As such, they held no regard for Luke Skywalker's claim on all properties of the Jedi Order. Ren's understanding of the Jedi Code was limited, though he suspected that the ideological differences between his Knights and the Jedi were severe, making coexistence impossible in his view. Although their ways failed to impress Skywalker, their lawlessness and power appealed to his young apprentice, Ben Solo, who thought of the Knights for years before ultimately leaving the Jedi Order to join their ranks."}, {"tag": "h3", "text": "Equipment"}, {"tag": "h4", "text": "Armor"}, {"tag": "p", "text": "The Knights of Ren wore battered, hand-crafted armor that, combined with their weapons and battle helms, added to the aura of dread surrounding them. Being well acquainted with violence and strife, they wore the scars and implements of such on their armor. They appeared intimidatingly unified at first glance, but on closer examination each Knight was distinct, expressing preferences in combat style and tactics. All of their gear was custom, created through a combination of originality and heavy modification upon capture."}, {"tag": "p", "text": "Ap'lek wore lightweight plastoid armor beneath his tunic and a water-shedding oiled cloak. His gauntlets and greaves featured raised teeth to assist in parrying and pinning edged attacks. He also wore a smoke canister on his belt. Cardo's coat was flame resistant and made from the hide of riftiaworm. His accessories included a blaster pistol holster on his left leg, tri-braced plasteel-armored greaves, a chest strap to carry concussion grenades, and plasma bolt shells on his lower chestplate. Kuruk's attire was made of a sound-dampening susurra-weave fabric. He had soft-soled boots for silent tread and collar rings to carry his plasma bolt shells. Trudgen's robes consisted of a heavy weave tabard and hood. It was accessorized with armor plates that were taken from his fallen enemies. Ushar wore ironweave vambraces, which made for a crushing backhand. Vicrul's coat was made from the skin of an unknown, monstrously large reptile."}, {"tag": "p", "text": "Like the other Knights, Kylo Ren was dressed in black robes and armor. His cowl was a remnant from his early training, the attached cape was singed from multiple battles, and the robes concealed his padded armor. He later replaced his old cape and cowl with a hoodless cape that was made of static-dampening fabric, grounding electrical interference. After seizing control of the First Order, Ren donned a treated cloak that was flame retardant."}, {"tag": "h4", "text": "Helmets"}, {"tag": "p", "text": "The Knights concealed their faces beneath ominous masks, echoing the helmet of Kylo Ren himself. The Knights purposely shielded their features with masks and battle helms, using theatricality to enhance their fearsome appearance and generate greater levels of terror in their opponents. They believed that anonymity equaled intimidation, for their victims would project the most terrifying nightmares into the absent faces of the Knights who struck them down. The purpose of their masks predated Kylo, as the Knights had been concealing their faces since the time of Ren, their original leader. In situations where intimidation did not suit their purpose, the Knights would remove their helmets, as Ren did for Solo, who, later as Kylo, revealed his own face to the scavenger Rey. General Armitage Hux hated that the Knights covered their faces with masks, but speculated it was to hide that they were hideous and scarred beyond recognition."}, {"tag": "p", "text": "Each helmet was unique to the individual Knight. Cardo's helmet was the most basic of the Knight helms; it was a blast furnace plate molded into a mask and included a neck protector. Ushar's helmet featured an impact crumble left by an opponent, and had breathing tubes as well as anti-ox filters suggesting that Ushar or his mask was of non-human origin. Vicrul's case-hardened helmet was made of pastillion ore and featured synth-leather ear flaps to conceal its opening seam."}, {"tag": "p", "text": "The patchwork helmet of Trudgen, the Knight who collected trophies from his victims, incorporated a fragment of a death trooper's helmet into its design. Kuruk's helmet had a breath screen and vocoder grid as well as blinder flannels designed to focus his vision forward and recesses cut for peripheral line-of-sight. Ap'lek wore a patchwork mask that he created by cobbling together pieces of broken armor. The faceplate was molded into the shape of an unsettling, sinister face of a trickster."}, {"tag": "p", "text": "Like his fellow Knights, Ren wore a helmet that concealed his features. Red markings adorned the helmet's faceplate."}, {"tag": "p", "text": "Kylo Ren's helmet was patterned after the battle gear of the Knights of Ren; it served the twofold purpose of concealing his identity and enhancing his imposing demeanor. Servomotors were attached to the helmet, controlling articulated arms that separated the face mask from the helmet, which allowed Kylo to remove his helmet revealing the uncontained malice in his expression. The silver inlay visor radiated from the eyes as a symbol of power, and the helmet's integrated vocabulator projected Kylo's voice. Beneath the mask's theatrics, however, he was still Ben Solo—son of Han Solo and Princess Leia Organa. In a fit of rage, Kylo smashed the battered combat helmet until nothing but shards remained."}, {"tag": "p", "text": "Once free of Snoke's rule, however, Kylo reclaimed his shattered helmet and gave the fragments to Albrekh so that it could be reconstructed. The eccentric metalsmith applied his skills in Sith alchemy to fuse the shards back together. The reforged helmet symbolized the breaking and rebuilding of Ren's own identity. It was also stronger than before due to the alchemical lattice of Sarrassian iron that Albrekh painstakingly applied throughout the helmet's cracks. As a side effect, the helmet now featured a webwork of luminous red Sarrassian iron holding the shards together."}, {"tag": "h4", "text": "Weapons"}, {"tag": "p", "text": "Each Knight was armed with a unique and lethally effective weapon, suited to both close-quarter and long range combat. Ushar and Ap'lek favored primitive melee weapons, such as weighted clubs and axes, with crude technological enhancements. The muscle-power of their wielders alone was enough to ensure that these weapons delivered crushing blows. However, with the flick of a switch or the twist of a dial, they took on additional attributes that could make the difference in battle. Ushar's war club had a kinetite charged end with concussion vector vanes and was held with a firm grip on the blunt, studded end. The war club had a studded pummel and a concussion absorption head. Its ability to build up a concussion charge in a kinetite generator could be released in a sudden shockwave. In addition, Ushar carried a vibromachete in an inverted sheath on his torso as well as three thermal detonators. Ap'lek's long ax was an antiquated executioner vibro-ax of Mandalorian origin. The weapon was modified with various upgrades, such as an ultrasonic generator cable, making it a conduit for ultrasonic energy, and therfore, vibrating its sharpened end to enhance its cutting power through armor and bone. It was also equipped with vibro-insulator plates to protect the handle. The blade was made from beskar with gore channels cut into the surface."}, {"tag": "p", "text": "Vicrul and Trudgen wielded blade weapons, both of which featured ultrasonic vibro-tech settings that increased their lethality to the point where even glancing hits could cause fatal lacerations. The blades were made of crucible steel saturated with phrik or beskar filaments, granting them considerable strength and durability. Though a lightsaber could cut through these weapons, it required a greater application of pressure from the wielder."}, {"tag": "p", "text": "Vicrul's scythe featured an annealed phrik vibro-scythe blade, with carved ultrasonic echo channel along the chine of the blade, and was shaped into a sawtooth crook for catching enemy blades. The blade was connected to the ultrasonic generator chamber on the opposite end by an insulated handle. Trudgen's vibrocleaver was his signature weapon. Though the enormous vibrocleaver was a traditional, primitive weapon, its add-on modification caused the blade edge to rapidly vibrate through ultrasonic technology, granting it extra cutting power. Trudgen also carried a secondary blade."}, {"tag": "p", "text": "Unlike the other Knights who favored melee weapons for closequarter combat, Kuruk and Cardo brandished blaster weaponry—heavily modified and customized to their personal preferences. As such, Kuruk's blaster rifle and Cardo's arm cannon were unique  hodgepodge constructions. The blaster rifle had three firing modes across two barrels, including a pump-action plasma bolt launcher that fed specialized ammunition into the larger firing chamber. It had a rapid-fire barrel with a cooling sheath, an upper sniper barrel with a direct line-of-sight feed to the macroscope, a pump-action bar, a vented stock for recoil reduction, and a tibanna bulb spikes laser output."}, {"tag": "p", "text": "Cardo's over-powered arm cannon made him the equivalent of a one-man turret. The weapon pod's uppermost barrel was a rapid-fire repeating laser cannon. The same channel was also capable of launching plasma bolts, which were hand-fed into a receiver. The bolts were primed by a separate trigger, allowing the next trigger-pull to release it. The lower barrel was a flammable gel projector. The laser cannon featured an air-cooled barrel; its front view had piezoelectric flame projectors flanking the recessed gel spinneret and a forward handgrip and trigger selector. The weapon's bolts had casing to contain the plasma charge and rifling grooves for increased accuracy."}, {"tag": "p", "text": "In addition to their primary weapons, Vicrul and Cardo had holstered blaster pistols that were almost standard with the exception of the removal of safety circuitry, allowing them to expend their ammunition more quickly and dangerously. The pistols' accessories included a backflash suppressor housing, power level indicator lights, and a stun setting toggle."}, {"tag": "p", "text": "The warrior known as Ren carried a red bladed lightsaber during his time as the original leader of the Knights of Ren. Ren's saber was equipped with a kill switch that would, when activated, cause the weapon to detonate if it left his hand. According to Ren, the resulting explosion was strong enough to destroy everyone and everything within its proximity."}, {"tag": "p", "text": "Kylo Ren's lightsaber evoked an ancient feel, though its components—a harmonic energizer conductive plate, a power cell focusing shunt, a power cell brace, power field conductors, a central diatium power core, exposed power rod terminals, a reserve power cell, an inert power insulator, and cooling vanes—were modern. Its crude appearance suggested it was constructed by an inexperienced hand. However, Kylo preferred its unstable, volatile nature and could have repaired his lightsaber if he so wished. Its partially exposed inner workings allowed for easy modification and upkeep."}, {"tag": "p", "text": "Like all Jedi lightsabers, Kylo's saber was powered by a kyber crystal but one that was damaged, making the weapon dangerously unstable. The stressed, bifurcated crystal was located within the shaft and could barely contain the power of the weapon, necessitating the lateral plasma vents that produced the crossguard blades or quillons as tributaries of the central blade. The quillon blades vented the kyber crystal's excess power. The resulting weapon was a crossguard lightsaber, modeled on an ancient design dating back thousands of years to the Great Scourge of Malachor. The primary plasma blade and quillons in the kyber field matrix had the appearance of serrated blades due to the cracked kyber crystal."}, {"tag": "p", "text": "The crossguard blades emerged soon after the main blade snapped into existence, helping to balance the power of Kylo's lightsaber. Its unstable serrated plasma blade left a trail of embers with each swing. The quillons were created through an array of focusing crystal activators served to split the plasma stream into perpendicular blade energy channels. The emitter shrouds on the crossguard protected the bearer's hand from the smaller blades. The kyber crystal was located atop the crystal cradle; the vent iris opened just after the ignition of the primary blade."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "h4", "text": "From myth to reality"}, {"tag": "p", "text": "For centuries, the Knights of Ren were the subject of myth and local folklore told by the scattered settlements of the Unknown Regions and adjacent border territories. Under the reign of the New Republic—a democratic government formed by the Rebellion that toppled the Galactic Empire's rule—a gang of marauding dark warriors emerged claiming to be the legendary Knights of Ren. These Knights were loyal to Darth Sidious, the Dark Lord of the Sith and Galactic Emperor who had survived his demise by entering a clone body."}, {"tag": "p", "text": "During their exploits in the regions of unmapped space, the Knights were once hired to raid the penal world of Osseriton. After freeing the prisoners, they confiscated one of the prison ships, the Night Buzzard, and modified it to serve as their personal transport."}, {"tag": "h4", "text": "Searching for recruits"}, {"tag": "p", "text": "The Knights of Ren once sought out Karrst and his younger brother Filin, both of whom were wanted for murder by the Sector Security organization. Having learned of Karrst through a friend of the Knights, they spent some time looking for the siblings, who were almost captured by Sector Security when the dark gang found them. The Knights immediately descended on the lawmen, pushing them back and establishing a secure perimeter around the brothers. Using their weapons and Force abilities, the six Knights slaughtered the SecSec team while their spokesman, the warrior known as \"Ren,\" approached the would-be prisoners. Ren assessed the situation and concluded that SecSec was determined to apprehend Karrst and Filin, who were responsible for killing at least a hundred people. Though the Knights were also after them, they did not wish to capture or kill them. Instead, they wanted Karrst to join their ranks."}, {"tag": "p", "text": "Karrst was like the Knights, possessing an inherent sensitivity to the Force or \"shadow\" as the Knights referred to its dark side. Karrst was able to demonstrate his natural ability with telekinesis. His talents impressed Ren and demonstrated proof of what the Knights learned about him from their contact—that Karrst could touch the shadow. Filin pledged his allegiance and that of his brother to the Knights, promising to follow Ren if the Knights helped them to escape from the SecSec forces. However, Ren clarified that it was not he whom the Knights followed, but rather his lightsaber and the way of life that it represented. Ren devoted his life to living by the Knights' code; immersing himself in the shadow, he fought its battles, preserved its artifacts, and consumed the power it gave him. He invited Karrst to do the same, but first they required a sacrifice: the murder of his brother."}, {"tag": "p", "text": "Before Karrst could make his choice, Filin fatally shot his older brother. In doing so, he believed the Knights would let him join their ranks in Karrst's place. While Ren applauded Filin's actions, respecting his willingness to commit fraticide in order to survive, he ultimately killed Karrst's younger brother who was not born with a strong connection to the Force. Trudgen noted that the mission did not go as planned, but it was of little consequence to Ren, who believed that their master would eventually find someone else for them to recruit. In the meantime, they sought to cause destruction elsewhere, leaving the ground littered with the corpses of the entire SecSec team and those of the now dead siblings."}, {"tag": "h4", "text": "Battle of legends"}, {"tag": "p", "text": "The Knights of Ren ventured to the Outer Rim world of Elphrona and found an ancient Jedi outpost dating back to the time of the High Republic Era. The Jedi of the time used it as a storage site, and having never returned to gather their items, it was more of a treasure trove than an outpost. Among its artifacts were Jedi holocrons and exotic weapons. Ren and his Knights intended to raid the outpost and take everything of value. However, the outpost was also visited by Jedi Master Luke Skywalker, his young apprentice Ben Solo, and the explorer Lor San Tekka. In addition to mentoring his nephew in the ways of the Force, Skywalker scoured the galaxy searching for arcane lore that could aid his quest to rebuild the Jedi Order. Shortly after entering the outpost, Skywalker and Solo both sensed the the Knights of Ren emanating with the cold presence of the dark side."}, {"tag": "p", "text": "Skywalker claimed the outpost and its treasures as the property of the Jedi Order, which, at the time, consisted of himself as the last Jedi. Notwithstanding his claim to Jedi artifacts, Skywalker had no intention of allowing them to fall into the Knights' posession, having sensed the dark side in all of them. Ren regarded Skywalker as an old fool, believing that a single Jedi was no match against the combined power of his Knights. When Solo stepped forward, introducing his master and calling him a legend, Ren simply introduced himself and the warriors under his command as the legendary Knights of Ren."}, {"tag": "p", "text": "His warnings ignored, Skywalker instructed his apprentice to protect San Tekka while he personally dealt with Ren's Knights. As the Knights and Skywalker prepared for battle, Ren was musing on how it was almost be a shame to kill the last Jedi, as it would be the first and only Jedi he would ever get to kill. Regardless, he gave the order to attack, causing the Knights to spring into action. With the exception of Ren himself, the other Knights charged in unison, assuring themselves that one man who stood alone against six warriors could not win. Though Skywalker conceeded that he was indeed one man, the Jedi knew that he was not alone with the Force as his ally. Despite their efforts, none of the Knights' attacks managed to connect, as Skywalker either blocked their weapons or evaded them entirely. Knowing they could not defeat him, he used his green lightsaber only as a means to defend himself and was content to defeat the Knights but without killing them."}, {"tag": "p", "text": "With the Knights incapacitated and their weapons destroyed, Ren stepped forward to confront Skywalker himself. Ren activated a kill switch on his lightsaber and revealed that it would explode if the weapon left his hand. However, after observing the last Jedi in battle, Ren concluded that the Force was strong with Skywalker and was no longer certain that he could prevail. Unwilling to die for the artifacts inside the outpost, Ren chose to stand down and retreat with his Knights, leaving the Jedi to claim their prize. Before departing, Ren turned his attention to Skywalker's young apprentice. He sensed that, like themselves, Solo had the presence of the shadow within himself. Ren also removed his helmet and threw it at Solo's feet, telling the boy to seek him out when he was ready to join the Knights of Ren."}, {"tag": "h3", "text": "The fall of Ben Solo"}, {"tag": "h4", "text": "Descent into the shadow"}, {"tag": "p", "text": "Following the destruction of Luke's academy, Solo fled to Snoke who welcomed the would-be Jedi to his space station. Shaken by the training temple's destruction, Solo struggled with feelings of betrayal, believing his uncle tried to murder him in his sleep. This turn of events, combined with the expectations of being the nephew of the last Jedi and the grandson of a prophesied Chosen One, left Solo disillusioned with both the Jedi Order and his own family."}, {"tag": "p", "text": "Having renouncing the ways of the Jedi, Solo confided in Snoke his interest in joining the Knights of Ren. Snoke showed his approval and encouraged Solo to seek out the Knights, telling the young boy that he would not have to keep his power in check like he did while training with the Jedi. When he warned Solo that the Knights of Ren would not accept a recruit who was on the path to becoming a Jedi Knight, Solo revealed the hatred he harbored for his own identity and the legacy attached to it. By joining the Knights, Solo not only saw a chance to learn new things about the Force, but also an opportunity to reinvent himself by adopting a new name."}, {"tag": "p", "text": "Solo asked for Snoke's guidance to locate the Knights of Ren; though the elder Force wielder decided that Solo's first step in his new path should be to find the group on his own, he advised Solo to start where he last encountered the Knights. Snoke also warned Solo that the Knights would exact a heavy price in exchange for admission into their ranks, but Solo did not care and was willing to pay any cost in order start his new life. At the time, however, he was unaware that he would be expected to undergo a particular Sith trial of ascendancy—the sacrifice of someone he cared about."}, {"tag": "h4", "text": "Ben Solo's trial run"}, {"tag": "p", "text": "Solo departed for Elphrona, returning to the abandoned Jedi outpost where he first encountered the Knights of Ren. Snoke also urged him to succeed, for the price of failure was death. Using the helmet that Ren left behind years past, Solo was able to establish a direct line of communication with the dark warrior, who invited the fallen Jedi to join them on the Mid Rim world of Varnak. Before Solo could leave, he was confronted by his fellow Jedi students Hennix, Tai and Voe. As the duel progressed, Tai managed to infiltrate Solo's mind and thereby discovered the latter's intention to seek out and join the Knights of Ren, believing he would find his own path by learning from them."}, {"tag": "p", "text": "After subduing his former Jedi peers, Solo continued on his journey to Varnak and approached the Knights, who were waiting for Solo in a cantina. Ren commented on the young Jedi's disheveled appearance, to which Solo explained his encounter with the other students on Elphrona, claiming that he had killed one of them. Intrigued, Ren asked Solo to recount the duel while the Knights listened, but also inquired to Solo's individual relationship with each of the students in order to determine if the Jedi who was slain was a sufficient death."}, {"tag": "p", "text": "The Knights gathered around Solo as he explained the origins of Voe, Hennix and Tai. Voe considered Solo her rival, yet always failed to reach Solo's level of power, whereas Hennix was known for his humor and intelligence. However, Solo was more cryptic about Tai, who empathized with Solo's internal struggle over his heritage as a Skywalker. Ren nonetheless had a more clear understanding of the three Jedi who confronted his latest potential recruit. Returning to the fight on Elphrona, Solo revealed that Hennix had tried to kill him, believing that Solo had murdered Voe when he had, in fact, saved her from falling to her death. Hennix was inadvertently killed by his own blade, although Solo took responsibility for it."}, {"tag": "p", "text": "Ren, however, was not convinced that Hennix's death satisfied the Knights' qualifications, knowing that Solo had not meant to kill his fellow Jedi. Yet he also took Solo's inherent strength into consideration, as well as the fact that Snoke had vouched for the young boy. Though he agreed to allow Solo to accompany the Knights on their adventures, Ren found Solo's appearance intolerable for a potential Knight, going so far as to compare his tattered Jedi robes to garbage. Turning to Kuruk, he instructed his fellow Knight to provide the fallen Jedi with a fresh set of clothes. Solo's new attire was an all-black outfit that more closely resembled the group he sought to join."}, {"tag": "p", "text": "Accompanied by Solo, the Knights then went to Minemoon, one of the moons of Mimban, to steal the Mindsplinter in exchange of payment. When the Mimbanese miners refused to cooperate, Solo performed telepathy on one of them to discover that the relic was three levels down in a chamber with a red snake. While Ren praised Solo's Force abilities, he nonetheless executed the miners despite his promise to release them and announced to the other Mimbanese present on the chamber his intentions to take the Mindsplinter, ordering the Knights to chop all the miners down. While the Knights jumped towards the chamber to fight the miners, Ren stayed behind with a reluctant Solo. However, Tai and Voe arrived to the scene, with Tai facing Solo whereas Voe jumped to the chamber to rescue the Mimbanese and fight Ren and the Knights."}, {"tag": "p", "text": "While Tai fought against Solo, Voe rescued a Mimbanese woman from getting killed by Ren before lunging at Cardo and facing Vicrul. Meanwhile, Ren went to see how Solo was going in his fight with Tai and snapped Tai's neck before determining that Solo wasn't one of them and that he would eliminate him for his weakness. However, unknowingly manipulated by an unknown voice, Solo bested Ren and killed him with Tai's lightsaber before executing Voe with the Ren. With their leader gone, the Knights of Ren knelt before Solo after he killed Voe, accepting him as their new leader. Solo would take the name of Kylo Ren."}, {"tag": "h3", "text": "The rise of Kylo Ren"}, {"tag": "h4", "text": "Champion of the First Order"}, {"tag": "p", "text": "Solo later became Snoke's apprentice as well as a warlord and champion of the First Order. Snoke used his apprentice and the Knights as a tool for the dark side within the First Order.  Together with General Armitage Hux and Captain Phasma, he formed part of the vanguard of First Order leadership which was strikingly young. This new generation of adherents to the ideals of the old Empire carried a zeal that made up for their lack of experience. Kylo also adopted the Knights' taste for theatricality, using a shrouded and masked visage to impose fear in the tradition of his ancestor, Darth Vader."}, {"tag": "p", "text": "Kylo's rise to power filled the void left by the Sith Order's destruction. While the thousand-year Sith lineage of Darth Bane perished with Vader, the last Sith Lord in the ancient tradition of the Rule of Two, the dark side of the Force remained strong in Kylo as well as his Master Snoke. After turning to the dark side, the former Ben Solo modified his lightsaber, allowing it to channel dangerous amounts of power through a cracked kyber crystal. Kylo's reputation would spread across the stars as he led the armies of the First Order in his master's name. Through Eila a child who escaped from the First Order, the Resistance spy Kazuda Xiono learned about Kylo's involvement in the massacre on Tehar."}, {"tag": "p", "text": "Though Skywalker retreated from the known galaxy, choosing to live out his remaining years as a hermit in exile on the forgotten world of Ahch-To, his continued existence as the last Jedi was a threat that Snoke could not ignore. The Supreme Leader therefore sent his apprentice Kylo on a mission to locate and destroy Skywalker after word reach him that the Resistance was attempting to find the last Jedi as well. This led to a confrontation with Lor San Tekka, an old acquaintance who knew the dark warrior when he was still Ben Solo. In order to find Skywalker, Kylo tracked San Tekka to a village on Jakku, knowing the old explorer harbored a clue to the Jedi Master's location. However, San Tekka would not cooperate, and told the former Ben Solo that he could deny the truth that was his family. As a result, Kylo struck him down with his exotic, red-bladed lightsaber."}, {"tag": "h4", "text": "The sacrifice"}, {"tag": "p", "text": "As the Resistance grew closer to locating Skywalker, Kylo and Snoke sensed an awakening in the Force. When the Supreme Leader learned that Kylo's father Han Solo became involved with the Resistance, he warned his apprentice that he would soon face his greatest challenge yet."}, {"tag": "p", "text": "Kylo assured his master that his training had fortified him against the light and he would not give into feelings of sentiment like his grandfather before him. Nevertheless, he was conflicted. While meditating with one of his trophies, the melted mask of Darth Vader, Kylo beseeched his grandfather to help him resist the pull to the light, so that he might fulfill their destiny and kill the last Jedi in Vader's name. But as before, when Kylo attempted to commune with the spirit who once inhabited the mask, he heard nothing from the charred helm, despite his frequent and intense meditations."}, {"tag": "p", "text": "During the waning hours of the Cold War, the scavenger Rey traveled from her homeworld of Jakku to Maz Kanata's castle on Takodana. Guided by the Force, she found the Jedi lightsaber that once belonged to Anakin Skywalker and his son Luke. Through her dormant connection to the Force, Rey experienced a series of Force visions by touching the lightsaber. Among the things she saw were the Knights of Ren and their master, the dark warrior Kylo Ren."}, {"tag": "p", "text": "Shortly after Kylo captured Rey and brought her to Starkiller Base, he was confronted by his estranged father Han Solo. He knew the time had come to complete the Sith trial of ascendancy; at the time he did not know if he could actually do it. Han beseeched his son to abandon the path of the dark side and come home, telling Ben that his parents missed him. Kylo heard his father's appeal, but there was to be no reconciliation. Kylo ultimately made the sacrifice by murdering his own father. However, this act of patricide did not make the former Ben Solo feel more powerful—he felt weakened, and the conflict in him continued to grow, leaving him more lost than ever before."}, {"tag": "h4", "text": "The ascension"}, {"tag": "p", "text": "Though Snoke had promised Kylo Ren a future where he was heir to the Force, with no Jedi standing in his way, he consistently held his apprentice's power in check, as Luke Skywalker did with Ben Solo. While recovering from his defeat on Starkiller, Kylo was severely reprimanded by Snoke, who dismissed him as a failed apprentice who was unworthy of Vader's legacy. As a result, Kylo came to question the gifts given to him by Snoke, recognizing them as cages and leashes designed to keep him obedient under the Supreme Leader's rule. As his frustrations boiled into a destructive worldview, Kylo destroyed his helmet in a fit of rage and decided that the past had to die, by his own hand. A lifetime spent in the shadow of powerful masters fostered in Kylo the determination to forge his own destiny. Unbeknownst to Kylo, he was being groomed by the Sith Eternal—a dark side sect of Sith cultists—to inherit the legacy of the Sith. Snoke was part of their plan; his role had been designed by the Sith Eternal to act as a final crucible, to groom and mold Kylo into a master not only of attack, but also cunning."}, {"tag": "p", "text": "When Rey sought him out, believing he could be redeemed with her help, Kylo used her arrival as an opportunity to assassinate Snoke. Their unique bond as a Force dyad amplified their powers, making them stronger together. Wanting to rule the galaxy with Rey by his side, Kylo invited her to join him, but the Jedi apprentice would not turn against her allies. They became sworn enemies again, with Rey rejoining the Resistance while Kylo seized control of the First Order as Snoke's self-proclaimed successor."}, {"tag": "h3", "text": "The reign of Kylo Ren"}, {"tag": "h4", "text": "Supreme Leader of the First Order"}, {"tag": "p", "text": "Having usurped the title of Supreme Leader with his killing of Snoke, Kylo Ren gained unprecedented freedom and power. Though he now commanded a vast military, including legions of First Order stormtroopers, Kylo still felt shackled to a fate that he was only beginning to understand."}, {"tag": "p", "text": "While the galaxy was in a state of open war between the First Order and the Resistance, a message of revenge broadcasted across the stars by Darth Sidious in 35 ABY. Unwilling to suffer any threat to his reign, Kylo made it his mission to personally investigate the mysterious message. With the name \"Exegol\" burned into his mind, Kylo found the hidden world of the Sith through his grandfather's wayfinder that he obtained on Mustafar in 35 ABY."}, {"tag": "p", "text": "Kylo ultimately learned that the former Emperor had in fact returned, despite his demise at the hands of his own Sith apprentice, Kylo's grandfather. He also discovered that Sidious' followers had created the Final Order, a fleet comprising planet killer Xyston-class Star Destroyers and an army of elite Sith troopers. Sidious offered to the Supreme Leader control of Exegol's untapped military assets, declaring that Kylo would rule all the galaxy as his successor. Having realized that he was heir to a vast Sith Empire waiting to be unleashed from the Unknown Regions, Kylo accepted the mandate. However, before he could take control of the Sith's forces, Kylo was bidden by Sidious to kill Rey and destroy the last remnant of the Jedi Order."}, {"tag": "p", "text": "His alliance with the Sith Eternal was only a means to an end, however. Notwithstanding his decision to restore the Sith and fulfill Vader's legacy, Kylo felt no indebtedness to the cultists, having sacrificed too much just to end up being subservient to another master."}, {"tag": "h4", "text": "Summoning the Knights of Ren"}, {"tag": "p", "text": "Kylo's return from the Unknown Regions bolstered the First Order Supreme Council's faith in him, having learned from their Supreme Leader about the military assets on Exegol. Despite their militarization efforts, the First Order's forces were much smaller than those of their predecessor, the Imperial Military. By augmenting their military with the Sith Eternal's troops and warships, the First Order would have the means to rule the galaxy as a true Empire."}, {"tag": "p", "text": "However, the Supreme Council was agitated by the presence of the Knights of Ren, who were summoned by Kylo to enforce his rule as Supreme Leader. In this regard, they were Kylo's equivalent to the Elite Praetorian Guards who served as Snoke's personal bodyguards. The Knights acknowledged Kylo as the only one with the authority to command them, much to the Supreme Council's displeasure. General Hux especially hated the Knights. As a First Order officer who favored protocol and had exacting standards about his hair, Hux despised the Knights' unkempt appearance and how they treaded dirt into the polished halls of the First Order's capital ships."}, {"tag": "p", "text": "Traveling aboard their private transport, the Night Buzzard, the Knights and their master arrived on the Resurgent-class Star Destroyer Steadfast, flagship of the First Order leadership. Before his meeting with the Supreme Council, Kylo gave the fragments of his shattered helmet to Albrekh, who reforged it by using Sith alchemy to hold the shards together. Kylo redonned his helmet, marking himself once more as a Knight of Ren, but this time on his own terms."}, {"tag": "p", "text": "The Knights accompanied Kylo as he made his way to the Supreme Council's chamber, tracking dirt through the polished corridors of the Steadfast. Their presence was noticed by several onlookers, including one stormtrooper who referred to the Knights of Ren as \"ghouls\" to a fellow trooper."}, {"tag": "h4", "text": "Hunting the last Jedi"}, {"tag": "p", "text": "To consolidate his rule, Kylo instructed the Supreme Council to crush any worlds that defied the First Order, preparing the galaxy for his anticipated ascension as the new Emperor. Another objective of Kylo's was to find Rey, a task he personally executed alongside the Knights of Ren. He traveled to the desert planet Pasaana with his Knights after learning that Rey was there through the the bond that bridged their minds. Sensing Kylo's presence nearby, Rey confronted him while her comrades attempted to escape on the Bestoon Legacy. During the Knights' hunt for the scavenger that vexed their master, Ap'lek stalked his prey, an unsuspecting Chewbacca, who was subsequently captured by the First Order."}, {"tag": "p", "text": "Rey and her remaining companions managed to escape from the First Order's forces on Pasaana. But while traveling to the occupied world of Kijimi, they were once again pursued by Kylo and his Knights, who went to extraordinary lengths in their determination to capture the scavenger. The First Order's forces also arrived on Kijimi and worked in unison with their leader's subordinate warriors, searching for leads on the scavenger and her Resistance allies. Unbeknownst to the Knights who combed through the Thieves' Quarter of Kijimi City, their targets mounted a rescue mission to save Chewbacca, who was held prisoner aboard the Steadfast."}, {"tag": "p", "text": "The Force connected Kylo and Rey, but as before neither of them could see the other's surroundings. Kylo urged Rey to tell him where she was, wanting to see her in person, but Rey was not willing to give up her location. As Kylo began revealing what he discovered about Rey's origins, the scavenger attacked him, resulting in a lightsaber duel being fought across space and time. During their battle, Vader's mask was teleported to Kylo's location, revealing to the Supreme Leader that Rey was on board his flagship. When he returned to the Steadfast, he told Rey that she was in fact the granddaughter of Darth Sidious. In addition, Kylo had learned that he and Rey were a prophesied dyad in the Force. Believing they could overthrow Sidious and claim the Throne of the Sith together, he tried to convert Rey to the dark side, but once again she refused."}, {"tag": "p", "text": "Kylo would not relent, however. Tracking Rey to Kef Bir, he found the scavenger in the Emperor's Throne Room aboard the ruins of the DS-2 Death Star II Mobile Battle Station. Due to their heritage as the descendants of the last two Sith Lords, Kylo believed that the dark side was part of their nature, making it futile to resist its temptations, though Rey refused as she feared of becoming ruthless like her grandfather. He destroyed the Emperor's wayfinder to prevent her from reaching Exegol without him, causing Rey to attack Kylo. They dueled across the wreckage of the battle station, but as Kylo gained the upper hand, his dying mother called out to him through the Force. Rey capitalized on Kylo's distraction by wounding him with his own lightsaber, until she too sensed Organa's death across the galaxy. Using the Force to heal Kylo's injury, she confessed that the person she wanted to join was Ben and not Kylo."}, {"tag": "p", "text": "After Rey's departure, Kylo found himself conversing with a memory of Ben Solo's father, the late Han Solo. Moved by his parents' and Rey's compassion for him, Ben threw Kylo's lightsaber into the ocean. The dark Knight known as Kylo Ren was no more and Ben Solo, the last Skywalker, was reborn."}, {"tag": "h4", "text": "The redemption of Ben Solo"}, {"tag": "p", "text": "After the loss of their master, the remaining Knights gathered on Exegol while the Sith Eternal's fleet prepared for departure. During the Battle of Exegol, the former Kylo Ren returned to the Sith redoubt but this time as Ben Solo. He entered the Sith Citadel with the intent of protecting Rey from the reborn Emperor, but his path was blocked by the Knights who once followed him. Though Solo briefly thought that the Knights had come to fight alongside him, their hatred towards their former master made Solo realize that those he once considered his faithful brothers were never truly loyal to him but to Darth Sidious. From the perspective of the Knights, their former master was no longer worthy of leading them; they saw Kylo Ren as having regressed to the persona of Ben Solo, whom they regarded as a weaker version of Ren. As such, the Knights of Ren believed they were capable of defeating Solo."}, {"tag": "p", "text": "Solo struck first using his Force abilities to attack the Knights. However, he was surrounded by the same warriors who had trained alongside him, providing them with knowledge of his fighting style. He was further disadvantaged by his lack of a lightsaber, and for a moment Solo regretted discarding his crossguard lightsaber on Kef Bir. After subduing Solo with their weapons, the Knights drew back to prepare another attack, yet were unaware that Solo was in secret communication with Rey, his other half in the Force dyad. Sensing each other's intentions, Rey passed the Skywalker lightsaber to Solo through their bond. Armed with his grandfather's lightsaber, Solo overpowered his former servants before proceeding to the Emperor's throne room to assist Rey in defeating her grandfather. The resulting deaths of Ap'lek, Cardo, Kuruk, Trudgen, Ushar, and Vicrul marked the end of the Knights of Ren."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Knights of Ren were created for the 2015 film Star Wars: Episode VII The Force Awakens and appear through Kylo Ren. They were based on rejected designs for Kylo Ren. The Knights later appeared in the 2019 film Star Wars: Episode IX The Rise of Skywalker, where they were portrayed by Martin Wilde, Anton Simpson-Tidy, Lukaz Leong, Tom Rodgers, Joe Kennard, and Ashley Beck."}, {"tag": "p", "text": "During the Director commentary of The Force Awakens, director J.J. Abrams noted that the Knights had backstory, but it was not revealed at that time. While fleshing out the Knights of Ren for the Star Wars: The Rise of Kylo Ren comic book series, Charles Soule took inspiration from motorcycle gangs, classic Westerns and Samurai tales to dramatize some of the lore behind the Knights."}, {"tag": "p", "text": "According to Rian Johnson, writer and director of the 2017 film Star Wars: Episode VIII The Last Jedi, the reason why the group do not appear in the film is that the movie was already full and there was no room for them. Johnson mused that they could have been used in place of Snoke's Elite Praetorian Guards, but it would have been a waste because all the guards had to die and Kylo's connection to the Knights would have added unwanted complications to the scene."}, {"tag": "p", "text": "In May 2019, Vanity Fair revealed that the Knights of Ren would finally appear in The Rise of Skywalker. The article also featured a photograph of the Knights during filming at Jordan, alongside director J.J. Abrams. Vanity Fair described the Knights as \"masked warriors with specialized weaponry who add an element of chaos to the war between the Resistance and the First Order\" and compared their brutish look to those of the characters from the Mad Max films."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}