{"url": "Knights_of_the_Old_Republic:_Opportunities", "categories": ["Category:Real-world articles", "Category:Miniatures Scenarios"], "nodes": [{"tag": "h1", "text": "Knights of the Old Republic: Opportunities"}, {"tag": "p", "text": "Knights of the Old Republic: Opportunities is a three-part Star Wars Miniatures mini-adventure published on the Wizards of the Coast website in October/November 2006. It was written by Sterling Hershey. It concerns the crew of the Sith mercenary ship Darkmoon, and is set just after Darth Malak assumes control of the Sith Empire in 3957 BBY."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "This summary tells of the story as if the Republic won all of their battles, except the last."}, {"tag": "p", "text": "After the apparent death of Darth Revan, Darth Malak takes command of the new Sith forces. The Jedi believe that the best time to strike the Sith is now. An unknown Dark Jedi has heard of a hidden research facility that has been producing advanced battle droids. The Dark Jedi assembles a team of:"}, {"tag": "p", "text": "With the Dark Jedi being the leader himself. The Sith leader hires a mercenary ship, called the Darkmoon, to hide his crew from the Republic. The Dark Jedi wants the mission to be secret, but the Republic learns of it anyway and sends their own strike team, consisting of:"}, {"tag": "p", "text": "This strike team is to intercept the Darkmoon. After successfully defeating the Sith crew, the Jedi strike team teams up with the mercenaries on the Darkmoon and they land near the facility, but all they find is a group of pirates and one advanced droid, called HK-47. The Darkmoon is also heavily damaged and needs new parts. The Jedi and mercenary team now consists of:"}, {"tag": "p", "text": "Their mission is now to get the needed parts for the Darkmoon and to secure HK-47. The pirate team is made up of:"}, {"tag": "p", "text": "The team of Jedi and mercenaries succeeds in defeating the pirates and securing the advanced droid. A Republic rescue ship soon arrives and eliminates the last of the pirates, however, after searching the pirate base, the team of Jedi and mercenaries discover that the pirates had planned to meet and sell the advanced droid to Darth Malak, at an unguarded location. The strike team decides to travel to the meeting location and defeat Darth Malak, with a strike force composed of:"}, {"tag": "p", "text": "The team arrives at the location, where they find:"}, {"tag": "p", "text": "Unfortunately, the Republic team is unable to defeat Malak and the whole strike force is defeated."}, {"tag": "h2", "text": "External links"}]}