{"url": "Anvil_Squadron", "categories": ["Category:Canon articles", "Category:New Republic stubs", "Category:Anvil Squadron personnel", "Category:New Republic starfighter squadrons"], "nodes": [{"tag": "h1", "text": "Anvil Squadron"}, {"tag": "p", "text": "Anvil Squadron was a starfighter squadron of the New Republic active following the Battle of Endor. During the Galactic Civil War, the Squadron were stationed aboard the Silver Coronet, were often deployed to vulnerable planets such as Mon Cala, in order to defend civilians against Galactic Empire attacks. They also participated at the Battle of Galitan."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Anvil Squadron was part of the New Republic made up starfighter pilots and astromech droids, and was under the command of an individual with the callsign Anvil Leader. In one battle, they were joined by Commander Lindon Javes, who handled their tactics personally."}, {"tag": "p", "text": "Anvil Squadron was attached to a fleet that consisted of their flagship and headquarters MC75 Star Cruiser Silver Coronet, CR90 corvettes, and at least one Nebulon-B medical frigate. The Squadron utilized BTL-A4 Y-wing starfighters, RZ-1 A-wing interceptors, T-65B X-wing starfighters, and UT-60D U-wing starfighter/support craft. The size of the squadron expanded well beyond the usual 12 starfighters estimating to be at least 30 active at one time. Their starfighters were marked with yellow stripes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Before Mon Cala"}, {"tag": "p", "text": "Sometime during the Galactic Civil War, Anvil Squadron were involved in an engagement with Imperial forces, that resulted in shooting down at least one TIE pilot named Shen."}, {"tag": "h3", "text": "Mon Cala"}, {"tag": "p", "text": "Four years after the destruction of Alderaan, Anvil Squadron responded to an Imperial strike on the New Republic's fuel depot above Mon Cala, led by Titan Squadron who were using hit-and-run tactics to cause chaos. Anvil deployed many A-wings, U-wings, X-wings, and Y-wings, but suffered heavy losses during the chaos, including their flagship Silver Coronet."}, {"tag": "h3", "text": "Galitan"}, {"tag": "p", "text": "Later, Anvil Squadron responded to a distress call from the General Hera Syndulla and Commander Lindon Javes, who's fleet was badly wounded and trapped by Imperial forces over the nearby moon Galitan, located within the Ringali Nebula. Led personally by Javes, Anvil fought to protect the heavily damaged Starhawk from a final strike by Titan Squadron, but they were unable to prevent Titan from damaging the Starhawk's tractor beam core, which would later result in its catastrophic overload. Anvil suffered heavy losses, but were able to destroy an Imperial II-class Star Destroyer with Javes' help. Javes' X-wing was shot down during a dogfight with one of Titan's TIE pilots, however he did survive and later helped Vanguard Squadron protect the Starhawk from waves of TIEs, while it was towed into the moon's exposed core. The Starhawk's unstable core exploded as it impacted the moon and caused a massive explosion of molten rocks and a shockwave that destroyed all enemy ships in range."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Anvil Squadron appeared in the single player campaign and as a multiplayer starfighter cosmetic option in the 2020 game Star Wars: Squadrons."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}