{"url": "Knights_of_the_Old_Republic_14", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic (comics)"], "nodes": [{"tag": "h1", "text": "Knights of the Old Republic 14"}, {"tag": "p", "text": "Star Wars Knights of the Old Republic 14: Days of Fear, Part 2 is the fourteenth issue in the Star Wars: Knights of the Old Republic series of comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Unexpected twists at every turn as power-mad evildoers hunt our heroes amidst a galaxy spanning war—Knights of the Old Republic is Star Wars at its very best, nearly 4,000 years before Luke Skywalker! A deadly new threat targets Camper, the seriously senile captain of the renegade vessel the Last Resort, and his youthful guardian Jarael must risk everything to try and save him, even if it's impossible. Meanwhile, fugitive Padawan Zayne Carrick and the conniving Gryph have mistakenly tricked their way into their most dangerous predicament yet & mad dash;surrounded by an army they are trying to escape on a planet that's about to become the biggest battlefront in the galaxy. The second someone recognizes them, they're toast, assuming that a stray blaster bolt doesn't get them first!"}, {"tag": "h2", "text": "Plot Summary"}, {"tag": "p", "text": "Aboard The Last Resort, the HK-24 unit reveals that his intent is to capture Camper unharmed and kill Jarael. Engaging both her and Elbee in a fight, the assassin droid gets the upper-hand but is shot and destroyed by the Mandalorian Rohlan, who has been hiding on the ship in secret since Flashpoint."}, {"tag": "p", "text": "Meanwhile, at a Republic camp on the warfront planet of Serroco, Lieutenant Carth Onasi stops by the Little Bivoli, where Zayne, Gryph, and Slyssk have set up a restaurant for the troops. In the kitchen, Zayne expresses his concerns to Gryph about their current predicament. Being Republic fugitives, Zayne is worried that they will eventually be recognized; Gryph however is too preoccupied with the money that their restaurant is making to worry about getting caught. Later, while cleaning up the restaurant, Zayne engages in a conversation with Onasi in which Onasi reveals that the Mandalorians are planning to attack on the following day."}, {"tag": "p", "text": "That evening, Zayne once again reveals his desire to leave Serroco to Gryph. However, he is unable to convince the Snivvian to leave, and decides to go for a walk through the camp. During his walk, Zayne pauses next to a ship and proceeds to have a vision of the next day's Mandalorian attack in which they destroy the entire planet. Hurrying back to the Little Bivoli, Zayne wakes Gryph and tells him to pack up and leave immediately. Hesitant at first, Gryph reluctantly agrees to leave the planet, but when he starts giving packing directions to Zayne, the Jedi reveals that he is not leaving with him and Slyssk, but is going to see the Republic commander, Admiral Karath."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}