{"url": "Knights_of_the_Old_Republic_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic (comics)"], "nodes": [{"tag": "h1", "text": "Knights of the Old Republic 2"}, {"tag": "p", "text": "Knights of the Old Republic 2: Commencement, Part 2 is the second issue in the Star Wars: Knights of the Old Republic series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After walking in on his friends, and fellow students lying dead next to their masters, Padawan Zayne Carrick flees Taris' Jedi Temple with his masters in hot pursuit. Jumping on his speeder where criminal Marn Hierogryph is still locked up, Zayne and Gryph manage to escape the Jedi by crashing through a University and falling down a garbage chute that brings them to the Lower City."}, {"tag": "p", "text": "While taking a moment to relax, Zayne explains Gryph the reason as to why the Jedi were pursuing. Not convinced that Zayne didn't murder the Padawans himself, Gryph gets hold of Zayne's lightsaber to protect himself. Zayne, however, is able to reason with Gryph and tells him that his clumsiness and lack of ability would prevent him from ever being capable of killing even one Jedi. Persuaded, Gryph hands back Zayne's saber, but not before destroying a surveillance droid that he spots. Aware that both the Jedi and Civil Authority are after them, and knowing that there are bounties on their heads, the duo go into hiding in the Taris underworld."}, {"tag": "p", "text": "Hiding in a cantina, Zayne comes to the realization that in order to find the reason behind the Jedi Masters' behavior, he must leave Taris immediately to revisit the places he where he trained to gather information."}, {"tag": "p", "text": "Meanwhile, back at the Temple, the meditating Jedi foresee Zayne and Gryph's plan: to go into the Undercity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}