{"url": "Anwis_Eddicus", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Supreme Chancellors"], "nodes": [{"tag": "h1", "text": "Anwis Eddicus"}, {"tag": "p", "text": "Anwis Eddicus was a being who served as Supreme Chancellor of the Galactic Republic approximately seven centuries prior to the Battle of Yavin. Eddicus played a role in ending the Death Seed plague, a deadly pandemic that claimed millions of lives. Centuries later, Kuat Systems Engineering's Eddicus-class planetary shuttle was named in the Chancellor's honor. In 22 BBY, the Biscuit Baron chain of restaurants included holocubes depicting historical figures such as Eddicus in with their QuickSnack and QuickSnackLite bundles."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Living approximately seven hundred years before the Battle of Yavin, Anwis Eddicus served as Supreme Chancellor of the Galactic Republic. During this time, a pandemic known as the Death Seed plague struck the galaxy, killing millions of beings. The outbreak ended when the parasitic drochs responsible for the plague were quarantined on the planet Nam Chorios. Supreme Chancellor Eddicus played a role in bringing the pandemic to an end."}, {"tag": "p", "text": "Eddicus was honored on occasion during the final years of the Republic. Kuat Systems Engineering's Eddicus-class planetary shuttle, developed in the decades before the Clone Wars, was named for the celebrated Chancellor. In 22 BBY, Biscuit Baron, a chain of restaurants owned by the Tagge Company, launched a month-long promotion known as \"Heroes of the Republic\" to highlight some of the Republic's more notable historical figures; holocubes depicting these beings were included in bundles of Biscuit Baron's QuickSnack and QuickSnackLite foods. Eddicus was among those honored by the campaign."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Supreme Chancellor Anwis Eddicus was first mentioned in an article on the HoloNet News website, published prior to the release of Star Wars: Episode II Attack of the Clones in 2002. Eddicus was later referenced in the StarWars.com Databank's entry for the Eddicus-class planetary shuttle, written in 2007 by James McFadden as part of the What's The Story? feature. In the entry, McFadden tied Eddicus to the Death Seed plague first mentioned in the 1997 novel Planet of Twilight. Eddicus later received an entry in The Complete Star Wars Encyclopedia. To date, neither the Chancellor's species nor gender have been identified."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}