{"url": "Knights_of_the_Old_Republic_36", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic (comics)"], "nodes": [{"tag": "h1", "text": "Knights of the Old Republic 36"}, {"tag": "p", "text": "Knights of the Old Republic 36: Prophet Motive, Part 1 is the thirty-sixth issue of the Star Wars: Knights of the Old Republic series of comics, and the first of two issues in the Prophet Motive story arc."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The beginning of a whole new era for loner Jedi Zayne Carrick launches our clever, clumsy hero, his con-artist best friend Gryph, and the bold Jarael into the kind of seat-of-your-pants adventure only Star Wars can provide!"}, {"tag": "p", "text": "The perfect starting point for new readers, this story kicks off the next phase in Zayne's life with a long-shot swindle gone wrong! Gryph's got a plan to part some shady-dealing Chev from their unjustly earned credits, but he'll need more than a disguise to protect him when they catch on to his game!"}, {"tag": "p", "text": "A New Era for the Old Republic!!"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "During the Metellos 3 trading session, there are many holograms containing Aurebesh text (with many of them seen from behind, showing a mirror image). Several holograms seen contain the words \"HI BID\" (as well as the credit symbol, two unknown symbols and the letter Trill, a.k.a. T), and several others say \"SOLD\". On page 2, one hologram contains the text \"IVAX NEBULA\" and \"ANOAT\" (seen as a mirror image from behind), another (with the letters \"squeezed\" together, making it hard to read) says \"SECTOR IVAX TIBANNA\" and \"ANOAT\", and yet another has the text \"GAS ”TIBNNA\" [sic]. On page 3, a blue hologram says, \"GAS ”SEFANO\", and a building has a neon sign with \"HOTEL\" written in Aurebesh. On page 5, two holograms contain the words \"GAS\", \"SEFANO\", \"HI BID\", a credit sign, three unknown symbols and the letter Trill (T), \"SECTOR\" and \"””TUWXO\". A hologram on page 8 says \"BID\". The issue also contains several holograms that are partially obscured or with some of the letters outside the panel. On the last page, the lower right-hand corner says \"MILLER\". \"ATYEH\" [sic] . \"DAZO\"."}, {"tag": "h2", "text": "External links"}]}