{"url": "Knights_of_the_Old_Republic_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic (comics)"], "nodes": [{"tag": "h1", "text": "Knights of the Old Republic 4"}, {"tag": "p", "text": "Star Wars Knights of the Old Republic 4: Commencement, Part 4 is the fourth issue in the Star Wars: Knights of the Old Republic series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "With the Taris Orbital Patrols on their tail, the barely-spaceworthy Last Resort makes its way into Taris' asteroid field. With power and transmissions restored thanks to Camper, Zayne Carrick makes a transmission to the Jedi Enclave on Dantooine, hoping to convince Jedi Master, Vandar Tokare, that he is innocent of killing his fellow Padawans. Vandar finds this hard to believe, but he does believe that Zayne may have a diseased mind and therefore doesn't remember actually killing his friends. He suggests that Zayne return to Taris and seek help from one of the Jedi Consulars in restoring his sanity. With the transmission cut short by Jarael due to being brought out of the asteroid field, Zayne remembers something odd about the Jedi masters on Taris: all but one were Consulars."}, {"tag": "p", "text": "Zayne decides that in order to find clues as to why the Jedi on Taris turned on their own Padawans, something must have happened on the Rogue moon where he had had a training mission a couple of days earlier."}, {"tag": "p", "text": "On the surface of the moon with Jarael, Zayne discovers the remains of the Jedi's bulk-lifter droid, Elbee, and hopes that he may be able to recover the droids memory hologram too see if anything of importance regarding his masters actions is saved on it. At that moment, however, Zayne spots his master Lucien and the Taris authorities descending on them with weapons drawn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}