{"url": "Knights_of_the_Old_Republic_7", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic (comics)"], "nodes": [{"tag": "h1", "text": "Knights of the Old Republic 7"}, {"tag": "p", "text": "Star Wars Knights of the Old Republic 7: Flashpoint, Part 1 is the seventh issue in the Star Wars: Knights of the Old Republic series of comics."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the mining colony of Vanquo, a refugee of the Mandalorian Wars is found lurking around camp by a miner. He is brought to the camp's high officer, where he is given food just as a transmission for the mining facility comes in. The transmission is a warning from Jedi Master Q'Anilia, telling the miners to evacuate the planet immediately because the Mandalorians have just invaded. The receiving officer doubts the validity of the transmission, and assumes it is simply a practical joke being played by his colleague at a another outpost. With the use of a Jedi mind trick, the refugee convinces the officer that the Mandalorian threat is real, and when explosions are heard outside, the miners all escape the planet on their ship, leaving the refugee behind."}, {"tag": "p", "text": "With the miners gone, the refugee reveals himself to be Zayne Carrick, who—along with his travel companions Gryph, Jarael, Camper, and Elbee—drove the miners out of the camp to steal their supplies. The plan does not workout however, for in the midst of raiding the supplies, the Mandalorians actually attack the mining facility. Quickly, Jarael, who has Zayne's lightsaber, is surrounded and taken captive, while the others flee into the forest towards their ship, The Last Resort. Despite fighting their way through the forest to their ship, the group is unable to flee due to the fact that a Mandalorian who caught up to them decides to steal their ship rather than kill them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}