{"url": "Knobby_white_ice_spider", "categories": ["Category:Canon articles", "Category:Races and species stubs", "Category:Arachnids"], "nodes": [{"tag": "h1", "text": "Knobby white ice spider"}, {"tag": "p", "text": "The knobby white ice spider was a species of spider that lived in ice caves on Maldo Kreis. The spiders ranged in size from very small to starship-sized, and attacked Din Djarin's ship, the Razor Crest, after Grogu consumed one of the eggs found in the planet's ice caverns."}, {"tag": "p", "text": "Unlike most spiders, the head of the knobby white ice spider was in the center of their body, hanging downward and ending in a circular mouth comprised of outer, grasping teeth and inner rows of smaller teeth, presumably to grind up their prey. They could produce and shoot webbing from their mouths and they had green blood. The species laid soft-shelled eggs in which their young would hatch. The eggs themselves were filled with green juices, slime, and webbing, and were edible by Yoda's species. Smaller members of the species could be killed with most common weapons or even by hand, as demonstrated by Din Djarin crushing a spider that tried to attack him with his bare hand. The larger, mature ice spider had eight legs, while the smaller, younger creatures had only six legs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ice spiders appeared in Chapter 10 of the 2019 Disney+ television series The Mandalorian, which aired on November 6, 2020. It was identified as such in the episode's descriptive audio."}, {"tag": "p", "text": "They were based on a piece of concept art by Ralph McQuarrie that had already been retooled three times before: in the Legends continuity as the knobby white spider, which is in fact an early phase in a gnarltree's life cycle, and in the canon continuity as the spice spider of Taul and the krykna, a spider-like creature found on Atollon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}