{"url": "Knights_of_the_Old_Republic_9", "categories": ["Category:Real-world articles", "Category:Star Wars: Knights of the Old Republic (comics)"], "nodes": [{"tag": "h1", "text": "Knights of the Old Republic 9"}, {"tag": "p", "text": "Star Wars Knights of the Old Republic 9: Flashpoint Interlude: Homecoming is the ninth issue in the Star Wars: Knights of the Old Republic series of comics. It is the first standalone issue."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Secret motivations and a troubled history are revealed in this standalone story of fear, neglect, and betrayal in the Old Republic! After the great Sith War, one Jedi dedicated herself to training only the most gifted seers in hopes of foretelling and preventing the return of the Sith. But obsession with her mission led to oversight elsewhere, allowing dark influences to take hold amidst the Jedi order. Now, events have been set in motion that cannot be undone, the consequences of which will rewrite the fate of the entire galaxy!"}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "In a flashback scene, Lucien Draay's mother Krynda visits her toddler son, who is in the care of a nursing droid named Ninebeedee."}, {"tag": "p", "text": "In the present, Lucien and the other four Tarisian Jedi Masters Xamar, Raana Tey, Q'Anilia, and Feln arrive on Coruscant, only to find the gates of the Draay Estate closed to them. Xamar tells Lucien that the Jedi High Council is concerned that the Jedi Order lacks the resources to find the fugitive Zayne Carrick. Draay reminds the Administrator of his duties and sends one of his associates to monitor their progress. Draay is unwilling to send Tey. Ninebeedee informs Lucien to wait for contact from his mother. Q'Anilia is perplexed at why Krynda does not want to see them."}, {"tag": "p", "text": "In a flashback scene dating back thirty years ago, Lucien eavesdrops as Haazen introduces a Force-sensitive child named Q'anilia. Back at the Jedi High Council, Master Vrook Lamar admonishes the Revanchist for embroiling the Jedi Order in the Mandalorian Wars. He is ordered to retrieve Jedi Knights and Padawans who were captured on Suurja. As the Revanchist leaves, Lucien chats with him and tells him that he was right."}, {"tag": "p", "text": "In a flashback dating back twenty-five years ago, an adolescent Lucien expresses frustration at his mother for not allowing him to train with the other Padawans. Krynda belittles her son for lacking her power of second sight, likening him to his late father. When Lucien speaks up for his father, Krynda storms out. Haazen reassures Lucien that he is not a failed Padawan and explains that his mother blames herself for failing to foresee the rise of the Sith Lord Exar Kun."}, {"tag": "p", "text": "Returning to the present, Master Lamar chastises Lucien and his fellow Masters for failing to protect their Padawans. Vandar Tokare, speaking via hologram, takes responsibility for assigning the Padawans to the Masters when they were not ready. Lucien also takes responsibility for the Padawan's deaths but rejects the notion that it encouraged the recent Mandalorian incursions. Despite the Mandalorian threat, Lucien implores the Jedi to focus on preventing the re-emergence of the Sith. He petitions for the Council to let him and his Jedi Masters lead the search for Zayne. Master Lamar dismisses Lucien's petition and reassigns the Jedi Covenant members to separate postings."}, {"tag": "p", "text": "Xamar asks his fellow Masters why they did not reveal all they had foreseen of Zayne. Feln takes offense while Raana expresses frustration that the Council is ignoring their prophecies about the Sith invasion. Q'anilia warns that she sees more obstacles ahead and that the Mandalorian invasion could cause the Jedi to lose focus. Despite the Council's orders, Lucien resolves that they continue their hunt for Zayne."}, {"tag": "p", "text": "In a flashback scene dating back twenty years ago, Lucien spars with his younger Covenant colleagues in a lightsaber training session, besting them. His mother orders a halt to the training session and tells Haazen that she will not allow her son to hurt her students. Haazen vouches for Lucien and tells her that Lucien is the warrior that his father was. Krynda defends the foresight abilities of her Padawans but Hazen expresses skepticism. Haazen agrees to use the Draay family fortunes and connections to help Krynda's seers but enlists Lucien's help in dealing with the \"higher issues.\""}, {"tag": "p", "text": "Returning to the present, Lucien visits his family estate. Haazen angrily tells Lucien that he was supposed to bring the Padawans to Coruscant for evaluation instead of killing them. Lucien responds that he interpreted the situation on the ground and acted as Haazen would have expected him to do so. Haazen chastises Lucien for almost exposing the Jedi Covenant's activities. When Lucien asks about his mother's whereabouts, Haazen turns the topic to Lucien neglecting to mention Zayne's special relationship with the Force in his earlier reports."}, {"tag": "p", "text": "Haazen disparages Lucien's abilities as a Jedi Master, prompting Haazen to described him as a failed Padawan. Haazen reiterates his orders to bring Zayne back alive but Lucien says that killing him will avert the nightmare he foresaw. Haazen then removes his cloak, revealing his scarred body and mechanical limbs. Haazen responds that he is a veteran of the Great Sith War and knows how to deal with the Sith threat better than Lucien or his mother."}, {"tag": "p", "text": "When Lucien demands to know where his mother is, Haazen ignores him and reiterates his orders. Lucien angrily accuses Haazen of concealing information from him. Lucien leaves the Draay estate with his dark secret."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "Originally Issue #10 of Knights of the Old Republic Comic series, Issue 10 was bumped up to issue 9 to allow Dustin Weaver more time to complete the finale of Flashpoint. The originally intended order was restored for the English trade paperback, but not the German one."}, {"tag": "p", "text": "According to John Jackson Miller, this issue is set the same day as #10."}, {"tag": "h2", "text": "Media"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}