{"url": "Knossa", "categories": ["Category:Legends articles", "Category:City stubs", "Category:Capital cities", "Category:Ossus locations"], "nodes": [{"tag": "h1", "text": "Knossa"}, {"tag": "p", "text": "Knossa was a city on the planet Ossus. Located deep within the Eocho Mountains, the city expanded outward from the Eye of Ashlanae and served as the center of Jedi culture for nearly twenty thousand years."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed of stone and ornamented with bronzium, the city of Knossa was nestled high in the western Eocho Mountains, far to the south of the planet's equator. The buildings of the city spread out from a central peak, upon which was constructed the Eye of Ashlanae, an ancient shrine dedicated to those Jedi that were slain during the First Great Schism. As more and more members of the Jedi Order began pilgrimages to Ashlanae, a large spaceport was constructed into Agorn Mountain. As the city began to grow over the ensuing centuries, eventually the Order established its Praxeum within the city to house and train Jedi visiting Ashlanae. Constantly growing and expanding over the millennia, Knossa eventually came to house a branch library of the remote Great Library. Like many cities, Knossa was home to commercial districts, residential buildings, restaurants, and mechanical facilities. Research facilities and laboratories across the city hosted visiting academics and scholars from a host of members worlds of the Galactic Republic. The city's central plaza held two important obelisks topped with Adegan crystals. When the moons of Ossus aligned with the crystals, they produced a famous and magnificent display of light. The Jedi held this time to be sacred, and used it to remember those of their Order who had fallen in combat. It is from this that the term Ossus Day originated."}, {"tag": "p", "text": "Like the rest of the planet, the city of Knossa was devastated during the Cron Supernova that washed across the planet's surface. Citizens of Knossa that had fled into the nearby crystal caves were able to survive the supernova and emerged to form a tribal society that would come to be known as the Ysanna."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}