{"url": "Knossa_Branch_Library", "categories": ["Category:Legends articles", "Category:Libraries", "Category:Ossus locations"], "nodes": [{"tag": "h1", "text": "Knossa Branch Library"}, {"tag": "p", "text": "The Knossa Branch Library was a satellite facility of the Great Jedi Library on the planet Ossus. Located in the city of Knossa, the branch library provided immediate access to the collection of the Great Library without having to make the long journey out of the city."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Jedi Order commissioned the construction of the Great Jedi Library circa 5000 BBY in the distant Ooroo Canyon, Jedi Master Odan-Urr sought to build a branch of this library within the city limits of Knossa for easy and quick access to the collective works of the Great Library. Where the Great Library's collection was made up of ancient scrolls, treasures, and artifacts, the Knossa branch provided remote access to the digitized collection through the use of holobooks and computer terminals. To look at a scroll or an artifact, a scholar at the branch library had the option of remotely controlling a droid at the Great Library to look through hard copies of non-digitized works. Jedi librarians patrolled the halls of the Knossa branch and were available by appointment to assist or conduct a conference with the Great Library for deeper research."}, {"tag": "p", "text": "When the Cron Supernova wiped all life from the planet in 3996 BBY, the Knossa branch was left in ruins. Later, the con artist Skavak began selling false floor plans, schematics, and maps on the black market. These maps often confused the Great Library with the Knossa branch and the Eye of Ashlanae, making it hard for historians to get an accurate idea of the actual appearance of the facilities."}, {"tag": "h2", "text": "Layout and architecture"}, {"tag": "p", "text": "Erected in the rocky foothills of the Eocho Mountains within the ancient Jedi city Knossa, the Knossa Branch Library was a squat building carved out of unadorned dense stone, making it appear as if the complex was a natural feature of the hill. Crowned by four thick, domed towers, the building's upper levels were perched on top of a stone ziggurat. The complex featured four main levels, as well as three sub-levels, all of which contained material ranging from Pre-Republic time to the modern history of 4000 BBY. The carved stairs leading to the main gates were unbarred, as were the doors, in line with Master Odan-Urr's belief that the knowledge prized by the Jedi should not be kept from any who sought it. With the exception of the highest level, the building blocked out all natural light; artificial light kept the building at a constantly even light so the passage of the suns' light did not increase the weariness of a devoted learner."}, {"tag": "p", "text": "Access to the Knossa Branch was granted through a large entryway in the southern face of the complex. The first level of the Library building was dedicated to peaceful study and cool reflection; its thick, utilitarian walls held a two-story arcade of stained-glass windows detailing the events of the Great Hyperspace War while holoprojectors displayed some of the archive's greatest treasures. Classrooms and lecture halls were located on the first level, as were a collection of study chambers where Padawans and Jedi Knights alike could ponder long-forgotten lore in the still silence of the dark stone building. Conference rooms allowed librarians and researchers alike to meet with staff at the Great Library in real time and seek guidance in deeper research. On the second level, highly ranked Lore Keepers oversaw the many researchers and librarians that maintained the Stacks, the massive shelving systems that held the Order's collection of datacards and reader tapes. A stone balustrade wrapped around the balcony that overlooked the arcade and main entrance below. The third and fourth floors of the building contained the vast Archives of the Order, delicately cataloged by tireless archivists in a system designed by Odan-Urr."}, {"tag": "p", "text": "Sprouting from the fourth floor and accessible by spiraling stairwells were four wide towers containing artifacts sorted by era, all of which spanned what would later be considered the Pre-Republic and Expansionist Eras. The southeast tower, or Pre-Hyperdrive Tower, contained information gathered from civilizations which were bound to their world or star system before the invention of the hyperdrive circa 25,053 BBY. Following the chronological order the northwest, or Pre-Republic Tower housed artifacts that detailed the political state of the galaxy before the Galactic Republic was born in the Core Worlds. The northeast and southeast towers were known as the Early-Republic and Mature-Republic Towers respectively."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}