{"url": "Knossa_Spaceport", "categories": ["Category:Legends articles", "Category:Ossus locations", "Category:Spaceports", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Knossa Spaceport"}, {"tag": "p", "text": "Knossa Spaceport was a spaceport on the planet Ossus constructed around Mount Agorn in the Eocho Mountains. Located on the outskirts of the city of Knossa, the spaceport was constructed by the Jedi Order so that pilgrims could have easy access to the Eye of Ashlanae and the Praxeum built nearby."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed by the Jedi Order circa 24,500 BBY, the sprawling spaceport was built to provide Jedi pilgrims a place to land their ships and rent airspeeders as they journeyed to the Eye of Ashlanae. As the city of Knossa formed around Ashlanae, the spaceport came to be known as Knossa Spaceport. Nearly 20,000 years after its initial construction, the spaceport began servicing those Jedi traveling by air to the distant Great Jedi Library, located in Ooroo Canyon some distance from the city."}, {"tag": "p", "text": "At the end of the Great Sith War, the Brotherhood of the Sith assaulted Ossus in a raid on the Great Library. Having received word that the stars in the Cron Cluster had gone supernova, the Jedi had initiated evacuation procedures and were unable to draw up proper defenses against the Sith. As the spaceport bustled with activity between those fleeing and those carrying precious artifacts offworld, former Jedi Knight Ulic Qel-Droma confronted his brother Cay Qel-Droma at the landing pads of Knossa Spaceport during the planet's last hours. When Ulic Qel-Droma slew his younger brother in a fit of rage, the site was tainted by the action and hallowed in the Force. Wandering off the platform and onto the broad promenade that led out of the city and to the Great Library, Qel-Droma was stripped of his ability to use the Force by several of his Jedi allies as punishment for his crimes. These actions created a vergence in the Force, tainting the entire area with dark side energies. Shortly after these events, the planet was scorched by the supernova and Knossa Spaceport was reduced to twisted stone, metal, and heaps of rubble."}, {"tag": "p", "text": "In the following centuries, as surviving tribes of Jedi and their descendants reclaimed the world and began calling themselves the Ysanna, this site's potent dark side allure was noted. To ward off the unwary from crossing these vergences, the Ysanna created a thirty-meter perimeter of astromech-sized black stones around each site. The Ysanna observed that those who crossed the perimeter and entered into the vergence would have their emotions twisted by the Force, seeing their closest friends as their most dangerous of foes."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A sprawling complex, Knossa Spaceport was constructed at the base of Mount Agorn a mountain in the Eocho Mountain Range. Multiple levels high, the rooftop of the Spaceport was designed to resemble a massive promenade with a large domed structure containing flight control and customs for those arriving and departing the planet. Aside from the rooftop promenade-style landing area and the hangars on the sides of the building, several landing fields surrounded the mountain's base to service overflow from the main landing areas. From the ground entrance of the Spaceport, a paved avenue wound its way away from the spaceport to the distant Great Library in Ooroo Canyon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}