{"url": "Knuckles_(Breakout_Squad)", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Articles that are known by a nickname", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "Knuckles  (Breakout Squad)"}, {"tag": "p", "text": "\"Knuckles\" was the nickname of a clone trooper in Breakout Squad during the Clone Wars. He served in the Mission to Kynachi. In the shuttle to Kynachi, he beat the rest of Breakout Squad in a push up contest, and CT-5177 came second place. Upon leaving Kynachi, Knuckles joined Breakout Squad led by the Jedi Nuru Kungurama. Their next mission was to the Chiss Ascendancy to discuss a possible alliance. They escaped a Techno Union attack but became trapped by a Black Hole. Knuckles and Breakout Squad found an ancient artifact and used it to escape. Supreme Chancellor Palpatine then asked them to escort Commissioner Langu Sommilor back to Coruscant. They met the Commissioner on Vaced, but he was quickly assassinated. Breakout Squad chased after the sniper, who apparently died in the fight. Kungurama then led Breakout Squad to Bilbringi Depot, where they clashed with the Techno Union. During the investigation, they discovered that the Sommilor who had been killed on Vaced was an impostor. Breakout Squad returned to Coruscant, where Kungurama confronted his missing master, Ring-Sol Ambase. Breakout Squad, including Knuckles, was later assigned to investigate the disappearance of the Spice Siren. Knuckles and the squad later joined up with Kungurama for a mission to escort Noggox the Hutt's freighter to Fondor. There they defeated the pirate Dool Pundar and then rescued orphaned younglings on Foless."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Breakout Squad's formation"}, {"tag": "p", "text": "The Galactic Republic clone trooper known as \"Knuckles\" was a soldier of the Grand Army of the Republic and a clone of the Human bounty hunter Jango Fett. At the time of the Clone Wars, he stood 1.83 meters tall. He wore his black hair cropped short. In 21 BBY, was assigned to investigate the planet Kynachi with Jedi Master Ring-Sol Ambase. On the way, the clones conducted a push-up contest, which Knuckles handily won. Their ship was ambushed by Vulture droid starfighters and destroyed. Along with Ambase's stowaway Padawan, Nuru Kungurama, the surviving troopers took an escape pod to the surface. They eventually liberated the world from the Techno Union and Overseer Umbrag, earning themselves the moniker of Breakout Squad. They were able to acquire transport back to Coruscant with Captain Lalo Gunn and her ship the Hasty Harpy."}, {"tag": "h3", "text": "Lost in the black hole"}, {"tag": "p", "text": "En route, they received orders from Supreme Chancellor Palpatine to go to the Chiss Ascendancy for a meeting at Defense Station Ifpe'a. They met the Chiss representative Aristocra Sev'eere'nuruodo to discuss an alliance, and rescued her from a Techno Union attack led by Overseer Umbrag. After escaping into hyperspace, they became trapped near a black hole with Hethra Mcgrrrr's pirate gang. Kungurama and Breakout Squad managed to locate an ancient Infinity Gate with a pair of Sullustan xenoarchaeologists and use it to escape the black hole. The Aristocra returned home while Breakout Squad continued back to Coruscant."}, {"tag": "h3", "text": "Chase on Vaced"}, {"tag": "p", "text": "During the trip back to Coruscant, Breakout Squad was contacted by Chancellor Palpatine again and asked to divert to Vaced to meet Kynachi's Commissioner Langu Sommilor and escort him to the galactic capital. Breakout Squad arrived first and met the Commissioner upon his arrival, but he was quickly assassinated by a sniper. Kungurama ordered Knuckles and Breakout Squad to secure the perimeter, while the Jedi pursued the sniper. The clones got onboard Gunn's ship while Kungurama took a swoop bike. The sniper, a Mandalorian, managed outfight Kungurama and reach his transport. He then engaged the Hasty Harpy, causing both ships to crash and leading his apparent death. After Breakout Squad and Gunn decided to part ways, Kungurama found an imagecaster which led Breakout Squad to take Sommilor's freighter to Bilbringi Depot, where they clashed with Umbrag again, and recaptured the depot."}, {"tag": "h3", "text": "Confrontation on Coruscant"}, {"tag": "p", "text": "Breakout Squad finished investigating the Depot, and discovered that the Sommilor who had been killed on Vaced was an impostor; the real Sommilor was freed from his captivity in the freighter's hold. Knuckle's squadmate Chatterbox had been wounded in the fight, and clone medics arrived to him, with the rest of Breakout Squad donating blood. The squad then returned to Coruscant with Sommilor. During the trip in hyperspace, Umbrag managed to grab Kungurama and wound their ally Gizz, but was shot in the attempt. Knuckles assisted by applying first aid to Gizz. Once on Coruscant, Jedi Master Harro Kelpura ordered their freighter to change course from the Jedi Temple to his lab in Dacho District, which had been broken into. The ship was then damaged by an impact with a dropship belonging to a bounty hunter. The ship crashed, knocking out several of the passengers and cracking Knuckle's helmet. The ship was able to take off and escape, and Kungurama confronted his missing master with Knuckle's help. Five days later, Breakout Squad was assigned to investigate the disappearance of the freighter Spice Siren, which was carrying munitions."}, {"tag": "h3", "text": "Pirates and younglings"}, {"tag": "p", "text": "Breakout Squad was next assembled for a mission to escort Noggox the Hutt's freighter to Fondor. When they arrived at the rendezvous on Affa, they discovered the remains of a massacre. They continued their mission to Fondor, where they defeated the pirate Dool Pundar. Once there, Gizz befriended a blind Twi'lek, Kuvuta Pindi. Kungurama agreed to help her escort orphaned younglings to Foless. Once there, they realized Pindi was trying to steal the orphans, and gave chase. Breakout Squad Pundar and freed the younglings, but Pindi was killed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Knuckles did push-ups to the point that another clone commented that he did them in his sleep. He wore Phase I clone trooper armor with gray Breakout Squad markings and used a DC-15S."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Knuckles appeared in Ryder Windham's young readers series, Star Wars: The Clone Wars: Secret Missions. He and Breakout Squad was first pictured in the comic The Clone Wars: Opress Unleashed, a comic released in 2011 as part of Free Comic Book Day and later included in the comic The Clone Wars: Strange Allies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}