{"url": "Knuckles_(182nd_Legion)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles that are known by a nickname", "Category:Clone troopers", "Category:Members of the 182nd Legion"], "nodes": [{"tag": "h1", "text": "Knuckles  (182nd Legion)"}, {"tag": "p", "text": "\"Knuckles\" was the nickname of a Human male clone trooper in the Grand Army of the Republic's 182nd Legion during the Clone Wars. Early in the war, he participated in a scouting mission to the planet Belgaroth after rumors spread that the local Republic-affiliated Czerka factory was secretly helping the Confederate cause. During the mission, Knuckles and two other clone troopers, Chatter and Recon, fell victim to the droidbreaker creature; however, the last surviving clone, Sergeant Marrt, completed the mission."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human male nicknamed \"Knuckles\" was one of one of the many clones of the bounty hunter Jango Fett bred on the planet Kamino to serve in the Grand Army of the Republic. During the Clone Wars, Knuckles served in the Grand Army's 182nd Legion, and he earned his nickname for his fascination with hand-to-hand combat. At some point between 22 BBY and 21 BBY, Knuckles participated in a reconnaissance mission to the planet Belgaroth on behalf of the Galactic Republic in order to investigate rumors of the Republic Czerka factory's dealings with the Confederacy of Independent Systems. Under the command of Sergeant Marrt, Knuckles and two other clone troopers, Recon and Chatter, landed on the planet and traveled to the factory. Once they reached the facility, Marrt went inside alone to investigate, leaving his squad hidden nearby. Marrt found out that the head of the factory, Tarin, was secretly supplying Reep Tonith of the InterGalactic Banking Clan with illegal FEX-M3 nerve gas grenades."}, {"tag": "p", "text": "Taking one of the grenades as evidence, Marrt tried to leave unnoticed but was spotted by Tonith's battle droids. The droids opened fire and forced Marrt and the other troopers to fall back to a swamp. The swamp was covered with a fog that prevented the clones from sending a signal to the Republic. A screech was then heard throughout the swamp, and Knuckles surmised that more battle droids had found them. Recon, who was a renowned scout, realized that the sound was emitted by something much bigger than a droid. Suddenly, the native droidbreaker creature emerged from the fog and attacked Recon, throwing him into a tree."}, {"tag": "p", "text": "As Chatter started frantically firing in the direction of the creature, Knuckles inspected Recon's body and, upon finding out that he was dead, reported the fact to Marrt. Soon afterward, Chatter was also killed by the creature. Knuckles then charged the droidbreaker and attacked it with his fists. Realizing that he would not be able to defeat the creature, Knuckles told Marrt to escape. Knuckles was killed, but his sacrifice allowed Marrt to formulate a plan, and the Sergeant managed to kill the droidbreaker by using the stolen nerve gas grenade. Marrt buried Recon, Knuckles, and Chatter under the head of the droidbreaker. Determined to avenge the death of his squad members, Marrt attacked the Czerka factory alone. He suffered heavy injuries but was able to capture Tarin, obtain valuable evidence, and burn the facility to the ground, although Tonith escaped."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Knuckles was a brawler first and foremost, and he preferred fighting with his bare hands to using blasters. While traveling to the Czerka factory, Chatter told him a joke about a droid, and Knuckles burst out laughing. Knuckles was visibly frightened after he heard the droidbreaker's screech, and he was shocked by Recon's death. Knuckles was willing to sacrifice his life in order to protect Marrt's, and the Sergeant was grateful to him for that, considering his actions to be very brave. The clone trooper had brown hair. Like all clones of Jango Fett, Knuckles stood 1.83 meters tall. However, unlike his genetic template, who had naturally brown eyes, Knuckles's eyes were blue."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Knuckles appeared in A Trooper's Tale, a short comic strip published in Star Wars: The Clone Wars Comic UK 6.8 in May of 2010. A Trooper's Tale was written by Robin Etherington and illustrated by Andres Ponce."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}