{"url": "Kohlen_crystal", "categories": ["Category:Canon articles", "Category:Crystals"], "nodes": [{"tag": "h1", "text": "Kohlen crystal"}, {"tag": "p", "text": "A kohlen crystal was a type of crystal known only to be found on Pijal's moon. The structure of the crystal was extremely similar to that of the kyber crystals used within lightsabers, although their nature was fundamentally different. They were extremely rare, even more so than true kyber crystals."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Pax Maripher detected a cache of these crystals on Pijal's moon and believed them to be kyber crystals. He hatched a plan to mine them with his associate Rahara Wick in the hopes of turning a massive profit for having discovered a massive cache of kyber crystals previously unknown to the Jedi Order, which used them to power their lightsabers. The two, particularly Maripher, were disappointed when they discovered that while the crystals appeared exactly the same as kyber on the macro level, microscopically they were completely different. The difference between the two led Maripher to later designate them as \"fool's kyber.\" According to Jedi Master Qui-Gon Jinn, the crystals also possessed the same heft as kyber, and even some vibration with the Force."}, {"tag": "p", "text": "Jinn and his Padawan Obi-Wan Kenobi discovered the two with these crystals while on a mission to investigate terrorist activity on Pijal and its moon. Their investigation later led them to discover that a group known as the blackguards had been using the crystals to create a type of personal energy shield which was impervious to lightsabers. They later discovered, however, that a lightsaber powered by one of these crystals could produce an unusual low-powered orange blade which was capable of slicing through the shields. Meanwhile, Maripher, realizing that he could not profit from selling the crystals to the Jedi, sold a number of them to Meritt Col, a Sector Supervisor of Czerka Corporation, for a sum large enough to both upgrade their personal freighter, the Meryx, and take a long vacation."}, {"tag": "p", "text": "The crystals were ostensibly referred to in an ancient prophecy made by a Jedi mystic which stated that \"When the kyber which is not kyber shines forth, the time of prophecy will be at hand.\" Though such prophecies had long been generally disregarded by the Jedi as a whole, Jinn had long held a certain fascination for the prophecies, though he had come to regard them as largely metaphor. This, however, combined with a vision granted to him through the Force, led him to once again come to a literal belief in the prophecies."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}