{"url": "Kol_Atorn", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Kanz sector astronomical objects", "Category:Mandalorian enclaves", "Category:Terrestrial astronomical objects"], "nodes": [{"tag": "h1", "text": "Kol Atorn"}, {"tag": "p", "text": "Kol Atorn was an astronomical object located in the Outer Rim Territories' Kanz sector. It was settled by Mandalorian emigrants and exiles. An individual grew up in the alleys of Kol Atorn and learned an accented version of the Mando'a language from the celestial body's settlers. The individual eventually became a famed Mandalorian leader with the title Mandalore the Hammerborn."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kol Atorn was a terrestrial astronomical object situated in the star system of the same name, a part of the Kanz sector in the New Territories portion of the Outer Rim Territories. Kol Atorn was located far from Mandalore, the Mandalore sector planet that served as the homeworld of the Mandalorian warrior culture. The celestial body's surface featured alleys."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Kol Atorn was eventually settled by Mandalorian emigrants and exiles who spoke an accented version of the Mando'a language, and the celestial body became an enclave of the Mandalorian culture. An individual grew up in Kol Atorn's alleys and learned to speak Mando'a from the Mandalorians residing there. The individual eventually became one of the greatest Mandalores, leaders of the Mandalorian people, specifically coming to be known as Mandalore the Hammerborn."}, {"tag": "p", "text": "Mandalore the Hammerborn's origin on Kol Atorn was noted in Ba'jurne Kyr'tsad Mando'ad, a manifesto of the Death Watch Mandalorian splinter group. The document was supposedly written by the movement's leader, Tor Vizsla—although the Death Watch's opponent Jango Fett doubted its authenticity—and was eventually included in the book The Bounty Hunter Code by Jango's son, the bounty hunter Boba Fett."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kol Atorn was introduced in the 2013 reference book The Bounty Hunter Code: From the Files of Boba Fett. The StarWars.com Online Companion to the 2009 reference book The Essential Atlas placed the Kol Atorn system, and therefore the celestial body Kol Atorn, in grid square N-4."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}