{"url": "Kolar_Ludd", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Galactic Empire military personnel", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kolar Ludd"}, {"tag": "p", "text": "Kolar Ludd, nicknamed the Depopulator, was a male member of the Imperial Special Forces, a military unit of the Galactic Empire. He developed a notorious reputation for killing the inhabitants of entire villages and razing them to the ground. After Ludd was captured by the Alliance to Restore the Republic, he was imprisoned at the impregnable Sunspot Prison. During Eneb Ray's attack on the prison, Ludd managed to break free and attacked Princess Leia Organa but was subdued. He was killed when Eneb lowered his section of the prison's sun shield, causing Ludd and the others to be incinerated by the sun."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kolar Ludd was an Imperial Special Forces soldier who fought during the Galactic Civil War. The special forces would drop Ludd in the middle of an enemy village, where he would kill everyone and set the buildings on fire."}, {"tag": "p", "text": "Eventually, Ludd was captured by the Alliance to Restore the Republic, a movement that sought to overthrow the Galactic Empire. The Depopulator was then locked in Sunspot Prison, a secret penitentiary maintained by the Alliance. Sunspot Prison orbited a star and was protected by a bank of ion cannons. It was regarded as impregnable by its rebel defenders."}, {"tag": "p", "text": "Following the battle of Vrogas Vas, the rogue rebel agent Eneb Ray invaded Sunspot Prison and freed seventeen prisoners from their cells, including Ludd to punish the rebellion he viewed as unwilling to take necessary measures to stop the Empire. Ludd then tried to attack Princess Leia Organa, a prominent leader in the Alliance, who was visiting the penitentiary at the time. Despite his fierce reputation, Ludd was subdued by Organa with the help of the smuggler Sana Starros."}, {"tag": "p", "text": "Organa then herded Ludd and the other prisoners into a holding cell in sector 9. However, Ray used Sunspot's command center to deactivate that sector's sun shields. Ludd and the other prisoners including a Gamorrean and a Zabrak were incinerated by the sun's rays. Ray then taunted Organa about fighting to protect Imperial criminals and urged her to embrace his violent ways."}, {"tag": "p", "text": "Several days later, the elite Imperial Task Force 99 stormtroopers Cav, Kreel, and Misty arrived searching for Ludd. They discovered that the rebels had evacuated the prison and the surviving prisoners. Kreel then told his men they had received a new mission and asked if they were ready to kill some rebels."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kolar Ludd was a fearsome and vicious male Imperial Special Forces soldier. His face was scarred. Ludd had a ruthless reputation of slaughtering the inhabitants of entire villages and razing them to the ground. Due to his fearsome reputation, the Rebel Alliance imprisoned him at the seemingly impregnable Sunspot Prison. When Ray freed the prisoners, Ludd and his fellow inmates attacked Organa but were subdued."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kolar Ludd first appeared in the 2016 comic Star Wars 17, written by Jason Aaron and drawn by Leinil Francis Yu."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}