{"url": "Kolig", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:Mercenaries", "Category:Pilots", "Category:Qulok's Fist", "Category:Slavers", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Kolig"}, {"tag": "p", "text": "Kolig was a male Human bounty hunter and criminal. Serving as the unofficial leader of the bounty hunter group known as Qulok's Fist, he was also the pilot and owner of the organization's vessel, the Steel Fist, a heavily modified YT-1300 light freighter. Presentable and affable, Kolig took the lead in organizing operations, and often went undercover to investigate and appraise potential targets. While working in the Kathol sector of the Outer Rim Territories around 8 ABY, Kolig and Qulok's Fist were employed by Moff Kentor Sarne, the local Imperial warlord. They were paid to tail the New Republic CR90 corvette FarStar, which had been assigned to track Sarne following the Moff's flight from the sector capital of Kal'Shebbol due to its liberation by New Republic forces. Eventually, Kolig and the group engaged the FarStar in the Shintel system at Sarne's request, damaging the corvette before retreating."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kolig, a Human male, was a member of the Qulok's Fist bounty hunter group, a collection of individuals that included Thanis Gul-Rah, Sufar, and Padak, who engaged in various illegal activities including bounty hunting, smuggling, slavery, and mercenary work. Serving as the unofficial leader of the gang, he was also the brains behind the outfit. Kolig was also the owner and pilot of the Steel Fist, a modified Corellian Engineering Corporation YT-1300 light freighter that served as Qulok's Fist's mobile base of operations. Kolig spent many years modifying the ship to his own specifications, and took exception to anyone who damaged it."}, {"tag": "p", "text": "Kolig's main role was to organize the group's operations, but he would often lend assistance to any ground-side mission. Considered to be the most outgoing member of Qulok's Fist, he often posed as a free-trader or freelance pilot to investigate targets that the group planned to hit. At some point, Kolig and Qulok's Fist rescued the Corellian criminal Sufar from Imperial bounty hunters. Sufar, who was being hunted due to a string of murders he had committed, joined their ranks, and the gang tracked down the hunters and allowed the Corellian to torture them to death. The group worked in the Outer Rim Territories during the early years of the New Republic, eventually passing through the Minos Cluster and ending up in the Kathol sector some time around 7 ABY. While in the Kathol sector, the group also worked for the local Imperial warlord, Moff Kentor Sarne. During that time, a hunt on a backwater planet turned into a massacre of a local settlement. That action prompted Thanis Gul-Rah to leave the organization, and settle on Kal'Shebbol, the sector capital."}, {"tag": "p", "text": "In 8 ABY, following the liberation of Kal'Shebbol by New Republic forces, Moff Sarne was forced to flee deep into the Kathol sector. After learning that a New Republic CR90 corvette, the FarStar, had been ordered to track him down, Sarne employed the services of Kolig and Qulok's Fist to tail the corvette and gather information on its movements for him."}, {"tag": "p", "text": "After Qulok's Fist had shadowed the FarStar for a while, Sarne contacted them and informed them of a plan he was putting into motion to delay the corvette in the Shintel system. Sarne had arranged for the FarStar to divert to the planet Shintel by using a deep cover agent on Gandle Ott, Colonel Olaver Lansel, to pass on information to the corvette's command crew. The information indicated that Sarne's destination upon leaving Gandle Ott was the Shintel system, and the crew duly followed the lead to pursue the rogue Moff. At Shintel, the vessel discovered an Imperial base that Sarne had abandoned since he believed the personnel stationed there were more loyal to the Empire than to Sarne himself. During the corvette's visit to Shintel, another agent, Lieutenant Palme, managed to upload a computer virus into the FarStar's systems that caused the hyperdrive to blow out when the crew attempted to engage it to leave the system. Kolig and Qulok's Fist were to journey to the system and attack the corvette in a hit-and-fade operation. Arriving in-system, the gang found the corvette stranded, just as Sarne had planned. Kolig, piloting the Steel Fist, conducted several fast attacks on the FarStar before withdrawing from the system as the ship began to recover. The corvette suffered minor damage, as Sarne had only intended to harass and inconvenience the vessel. The Moff wanted the FarStar to follow him, which in turn would draw other New Republic forces into a trap he was preparing so he could destroy them in one fell swoop."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kolig had dark skin and black hair that was kept neat up top and long at the back, with a long thin mustache that curled at the ends. Well-skilled in combat, Kolig was known to be ruthless. He carried two heavy blaster pistols and possessed a grasp of combat tactics, knowing when to strike at a target and when to keep his distance. He also knew that he would have no chance to spend any credits he earned if he wound up dead through an error. Kolig also particularly despised aliens, believing that they should be enslaved. In his opinion, the more exotic the species, the more it deserved to be in captivity."}, {"tag": "p", "text": "Presentable and dashing, Kolig was supremely calm and confident. He was a smooth operator, and was as at home infiltrating potential targets as he was in combat. A skilled pick pocket, Kolig was especially charming to the ladies, but could not stand rejection from them. Despite his calmness, small annoyances could set him off, including female rejection. He was also extremely proud and protective of the Steel Fist, and despised anyone damaging or even marring the vessel in any way."}, {"tag": "p", "text": "An accomplished pilot, Kolig could fly space transports—with a particular expertise in vessels of the YT-1300 series—and navigate through hyperspace. He could operate the sensor, weapons, and shield systems aboard them, and was also an engineer, capable of repairing and modifying space transports and their weaponry. He was knowledgeable about planetary systems, and typically wore a pilot's flak jacket, and carried a communications headset and comlink."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kolig was created for The DarkStryder Campaign, a supplement for Star Wars: The Roleplaying Game by West End Games published in 1995. Kolig appeared in the \"Rogues Gallery\" section written by Peter M. Schweighofer, and was included so the Gamemaster could use him in an original adventure. Kolig would go on to appear indirectly in the adventure Shintel Downtime, although he would only be encountered aboard his ship, the Steel Fist, along with the rest of Qulok's Fist."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}