{"url": "Kolovish", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Articles to be expanded", "Category:Females", "Category:Members of the Star Cabal", "Category:Pilgrim Matriarchs", "Category:Rutian Twi'leks"], "nodes": [{"tag": "h1", "text": "Kolovish"}, {"tag": "p", "text": "Kolovish was a female Rutian Twi'lek pilgrim who lived on Tython illegally, as well as a member of the Star Cabal during the Cold War between the resurgent Sith Empire and the Galactic Republic. The former leader and Matriarch of the pilgrims, Kolovish retired and lives in an ancient tower in the mountains."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Twi'lek female, Kolovish was the Matriarch of a group of Twi'lek Pilgrims who followed her to the planet Tython in the aftermath of the Great Galactic War. Assisting in the establishment of Kalikori village, Kolovish passed down her teachings to her followers, living among them for nearly two decades before retiring from her duties and leaving the village and taking up residence in an ancient stone tower farther up the mountain. Padawans from the Jedi Order's neighboring Temple would often seek out the Matriarch and ask her for her blessings before completing their training."}, {"tag": "p", "text": "Near the start of the Galactic War, Kolovish was discovered to be a member of the anti-Jedi and Sith organization known as the Star Cabal by Imperial Intelligence.[source?]"}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A leader of the expelled Twi'lek Pilgrims on Tython, Kolovish found many Jedi who have arrived on their new homeworld to be unable to complete the rites of her people. Nevertheless, the former Matriarch welcomed those who climbed the Kalikori path, even ones who saw that their duty was to the Jedi Order instead of the Pilgrims."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kolovish appears in the Jedi-exclusive mission entitled \"The Thousand Steps\" in the 2011 BioWare game, Star Wars: The Old Republic. During the course of the Imperial Agent story, Cipher Nine discovers Kolovish's involvement in the Star Cabal through a reconstructed holocom conference on Dromund Kaas. Later, she appears in a live holocom call aboard the Cabal's headquarters in the Null Zone.[source?]"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}