{"url": "Kolot", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Ewoks", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Kolot"}, {"tag": "p", "text": "Kolot was an Ewok male upon whom Imperial Warlord Zsinj's Project Chubar experimented. The experiments, which left Kolot able to pilot a shuttle, were inspired by the tale of Lieutenant Kettch, a semi-fictional Ewok member of the pirating Hawk-bat Independent Space Force. In 7 ABY, Kolot was in the secret laboratories aboard the Executor-class Star Dreadnought Iron Fist when it was in the Selaggis system. There, Kolot and other test subjects were freed by New Republic–allied Gara Petothel, and the Ewok helped pilot the escapees to freedom in a Sentinel-class landing craft. After his escape, the Ewok later became the co-pilot for Petothel, who took the name Kirney Slane, as she headed a shuttling business out of the planet Corellia."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Learning to fly"}, {"tag": "p", "text": "An Ewok male, Kolot was taken into the Imperial scientific program known as Project Chubar as a test subject. Like others in the program, the Ewok was subjected to tests and other experimentation that increased his intelligence and allowed him to speak the language of Galactic Basic Standard; Project Chubar also had the effect of making its test subjects more aggressive and violent. In 7 ABY, Imperial Warlord Zsinj, who controlled Project Chubar at that time, learned of a genetically-modified Ewok pilot named Kettch, who supposedly few a starfighter for the pirating Hawk-bat Independent Space Force through the use of prosthetic limb extensions. However, Kettch was merely a semi-fictional prank that New Republic pilot Wes Janson had engineered. Inspired by this tale, Zsinj ordered mechanics to create prosthetic limb extensions so Kolot could reach the piloting controls of a starship. Additionally, the doctors in the program put Kolot through flight simulators to see if the Ewok could learn how to fly. In the end, the experiment was a success, and Kolot was able to fly a shuttle despite being an Ewok—a species that was known for its general inability to work advanced equipment."}, {"tag": "h3", "text": "Rescue at Selaggis"}, {"tag": "p", "text": "In 7 ABY, Kolot was aboard Zsinj's flagship, the Executor-class Star Dreadnought Iron Fist, in the Selaggis system, alongside the rest of Project Chubar, after its base of operations was relocated from the planet Saffalore. At the time that Zsinj's Iron Fist and a small fleet of ships were attacked by the New Republic's General Han Solo and his naval group, Gara Petothel, a New Republic–allied former Imperial Intelligence spy, was aboard the Iron Fist after gaining Zsinj's trust. Responsible for the sabotage that left the Iron Fist with its hyperdrive disabled in the Selaggis system, she made her way to the laboratories where Kolot and some of the other Project Chubar test subjects were being held."}, {"tag": "p", "text": "Holding the four medics nearby at blaster-point, Petothel freed Kolot first from one of the ground-level cages after the Ewok agreed to free the other prisoners. Although Kolot wanted to kill the captured medics, Petothel had the Ewok instead go to each cage and, if the inhabitant agreed to not attack Petothel, free them so she could get them off the Iron Fist. When Kolot had released all of the test subjects who had agreed not to attack Petothel, the former Imperial agent asked if any of the test subjects could fly a shuttle so that they could make an escape."}, {"tag": "p", "text": "Kolot answered that he could, surprising and shocking Petothel, who thought he was joking. She was familiar with Kettch, who actually did not exist, as it was merely a stuffed toy and an alias that had been used for starfighter pilot Wedge Antilles. Realizing that the story of Kettch had inspired the creation of Kolot as a pilot, Petothel told a confused Kolot that both he and she were lies that had eventually became true; Petothel herself had infiltrated the New Republic starfighter unit Wraith Squadron as an Imperial spy only to later change her allegiance to the Wraiths. Kolot and the others followed Petothel as she led them to safety, though a pair of freed Gamorreans took the time to gore and kill the bound medics, who had inflicted so much pain on the group."}, {"tag": "p", "text": "Kolot brought with him the limb extensions that had been crafted for him as the group made its way to a hangar bay that had experienced a radiation-leak alert—which Petothel's astromech droid, Tonin, had falsified—and cleared the area of Imperial personnel. Petothel and Tonin momentarily went on ahead of the group into the hangar, and there she was confronted by Imperial General Melvar, as well as Ensign Gatterweld, who had guessed her destination after they had discovered that she had betrayed them. Petothel was saved, however, as Kolot and the group of test subjects overwhelmed the pair. The group tried to kill the Imperials, but Petothel disallowed it, instead having the pair of Zsinj's men bound. While Petothel departed in an X-wing starfighter that she had brought to the Iron Fist, Kolot flew the rest of the escapees and Tonin free of the Super Star Destroyer in a Sentinel-class landing craft, while the battle raged around them."}, {"tag": "p", "text": "Although Petothel's X-wing was subsequently shot down on the moon of Selcaron in the Selaggis system, she and the rest of the escapees, including Kolot, eventually made their way to the planet Corellia. There, Petothel, who had taken the name Kirney Slane, started a shuttle business, with Kolot as her co-pilot and the Sentinel-class shuttle they had stolen."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Modified to have an increased intelligence that dwarfed those of other Ewoks, Kolot had many Human-like mannerisms, such as his shrug and his nod when he was talking with Petothel. Kolot also had a singsong voice when he spoke in Basic. Due to the involvement that the medics had with him during his time as a test subject, Kolot wished to kill the medics when he was released from his cage, though Petothel prevented him from doing so. The Ewok was also able to use reason to govern his decisions, and when Petothel prevented him for killing the medics and instead tasked him with freeing the other subjects, he complied, as it was his best option. Due to his increased intelligence and the flight simulators that he was put through, Kolot, unlike the majority of his species, was able to pilot a shuttle, albeit with the use of limb extensions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kolot first appeared in the novel X-Wing: Solo Command, written by Aaron Allston and released in 1999 as part of the X-Wing novel series. Two of Allston's subsequent novels, Legacy of the Force: Betrayal (2006) and X-Wing: Mercy Kill (2012), suggest that Kolot was still flying as a co-pilot for Petothel in 40 ABY and in 44 ABY, respectively. According to Betrayal, the co-pilot's seat of one of the shuttles owned by Petothel's company, Donoslane Excursions, was designed for a small, furry humanoid, and Mercy Kill states that the cockpit of one of Petothel's shuttles smelled like fur. However, as these descriptions do not explicitly correspond to Kolot, this article does not assume that Kolot was still flying as of 44 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}