{"url": "Komad_Fortuna", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Hunters", "Category:Males", "Category:Tatooinians", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Komad Fortuna"}, {"tag": "p", "text": "Komad Fortuna was a Twi'lek hunter on Tatooine during the Jedi Civil War. Following in the footsteps of his father, a hunter famous on Tatooine for once hunting and killing a krayt dragon, he hunted honorably and only with traditional methods."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Komad had been hunting for decades by 3956 BBY, when Revan first met him in Fazza's hunting lodge in Anchorhead while on Tatooine in search of a Star Map. Revan would come to learn that the Star Map was located in the lair of a canyon krayt dragon, the same dragon that Komad himself was tracking. The dragon was an exceptionally large bull, larger than the one even Komad's father had slain, and its presence was upsetting the ecological balance of the region. With such an ecological threat, Komad believed the Krayt dragon's death would be necessary to restore the natural cycle. Because of the importance of removing the threat it posed, Komad decided to forgo a truly honorable hunt, and settled for baiting the beast to enter a minefield. The job required two, so Komad joined with another hunter and traveled to the cave of the dragon in the Eastern Dune Sea."}, {"tag": "p", "text": "At the same time Revan had entered the Eastern Dune Sea following clues to the Star Map. As he arrived at the mouth of the cave, Komad's partner grew impatient at waiting and heedlessly rushed into the cave, where he was instantly killed by the great beast. Komad took Revan's arrival as an opportunity, and convinced him to take the role of the recently deceased hunter and find bait for the dragon, specifically one of the many wandering herds of banthas. Revan brought the banthas, and the krayt dragon emerged from the cave only to walk immediately into Komad's mines and be killed. Komad extracted two krayt dragon pearls from the corpse, one of which he gave to Revan. Revan entered the cave to find the Star Map, and the two parted ways."}, {"tag": "p", "text": "By chance, it happened that the two met again on Kashyyyk, where Revan pursued another Star Map and Komad sought other prey. Feeling that he had done a disservice to the Tatooinian ecology, Komad had left in search of a greater hunt, that of the dangerous creatures of the Shadowlands. Saddened by Czerka's disregard for nature, Komad sought out the approval of the Wookiees, considering living in the Shadowlands in the manner of Jolee Bindo to gain their trust. Revan and he parted ways for the last time here, and it is unknown what happened to him afterwards."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Alternate Paths"}, {"tag": "p", "text": "Outside the krayt dragon's cave, either for a second krayt dragon pearl or for dark side points, the player may request a larger reward from Komad and kill him upon his refusal."}, {"tag": "p", "text": "In another dark side pathway, when Komad tells the player his plan to kill the krayt dragon the player can tell him that he didn't need him anymore now that he has the plan, resulting in Revan killing him. If this is done, the krayt dragon's two pearls will be available to the player and the dragon's corpse can not be destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}