{"url": "Kom%27rk_Skirata", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles to be expanded", "Category:Articles in need of updating", "Category:Character stubs", "Category:Clan Skirata", "Category:Clone trooper lieutenants", "Category:Galactic Republic intelligence personnel", "Category:Null-class Advanced Recon Commandos"], "nodes": [{"tag": "h1", "text": "Kom'rk Skirata"}, {"tag": "p", "text": "Kom'rk Skirata (pronounced KOM-rohk), originally known as Null-6 or N-6, was a Null-class Advanced Recon Commando in the Grand Army of the Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A year into the Clone Wars, along with Jaing Skirata and clone shadow troopers, he was one of the Clone Intelligence units responsible for locating General Grievous on Utapau. As Kom'rk and Jaing Skirata prolonged their search for General Grievous, they scouted and observed planets within the outer rim. Kom'rk's skills come in handy, his ability to withdraw information out of people was unique to him. He specialized in interrogation and enhanced interrogation, taught by Kal Skirata to gather and study more information about the CIS as well as General Grievous. He would negotiate, gamble, interrogate and even torture/ use enhanced interrogation techniques to prong the information he wanted. He would go to any extent to extract information."}, {"tag": "p", "text": "They did this as early as 21 BBY, but Jaing felt that the information came to them too easily and that someone wanted them to know that Grievous was based there, so they didn't report this information to their superiors until the end of the Clone Wars."}, {"tag": "p", "text": "Kom'rk deserted from the Grand Army of the Republic when Order 66 was issued and went to live on Mandalore with the rest of Clan Skirata. Soon after arriving, he discussed Etain Tur-Mukan's cremation and the Imperial Army's improved computer defenses with his Null ARC brother Ordo Skirata."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kom'rk had a good sense of humor, just like all the other Null ARCs. He gave what he called a \"crumb\" to Kal Skirata to give to Arligan Zey. The chip which he gave Skirata was a recorded conversation between General Grievous and an ally they didn't know Grievous had, the Regent of Garis, minus the location. He told Skirata and his brother Nulls that he didn't want Mace Windu or Obi-Wan Kenobi charging in there and ruining the operation."}, {"tag": "p", "text": "Kom'rk had a personality that differed from the rest of the Null ARCs, he stated his opinion only when needed, and looked into information of any kind extensively, ensuring nothing is forgotten or looked over. Furthermore Kom'rk could catch a liar in an instant. He would usually play around with the \"fake\" story before humiliating the other person."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kom'rk means \"gauntlet\" in Mando'a."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}