{"url": "Kom%27rk-class_fighter/transport", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Ship stubs", "Category:Alliance to Restore the Republic starship classes", "Category:Galactic Empire starship classes", "Category:Gauntlet fighters", "Category:MandalMotors products", "Category:Mandalorian starfighter classes", "Category:Shadow Collective", "Category:Transports"], "nodes": [{"tag": "h1", "text": "Kom'rk-class fighter/transport"}, {"tag": "p", "text": "The Kom'rk-class fighter/transport, also known as the Gauntlet starfighter, was a type of starfighter and troop transport used by the Mandalorian splinter faction known as Death Watch during the Clone Wars. The fighters were utilized as part of a move by Death Watch leader Pre Vizsla to end Satine Kryze's pacifist rule of Mandalore and restore the Mandalorians to their former warrior past. These ships were later used by Maul's Shadow Collective army during battles on Zanbar, Ord Mantell, and Vizsla Keep 09. During each of these battles, Maul utilized a gauntlet fighter called the Nightbrother, colored red and black rather than the normal white and blue color scheme, as a transport and a Shadow Collective flagship. During the reign of the Galactic Empire, a gauntlet fighter known as the Splendour was owned by the Besalisk criminal Galus Vez, who used it to race opponents on his private racing track, the Fool's Run."}, {"tag": "p", "text": "30 years after the Battle of Endor,[source?] the retired pirate Delphi Kloda owned a Gauntlet called the Sparrowhawk, which he lent to his former protege Bazine Netal. The Mandalorian Protectors used a similar fighter known as the Fang fighter."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "During the Clone Wars, the Death Watch used several of these fighters to evacuate their hideout at one of Concordia's mines. Death Watch then prepared several of these fighters to take part in taking Sundari when the Republic's Grand Army would arrive to occupy Mandalore. However, when the Republic did not occupy Mandalore, Death Watch broke their ties with the Confederacy and took their fighters to their camp on Carlac."}, {"tag": "p", "text": "Death Watch's commander Pre Vizsla and his second in command, Bo-Katan Kryze then took one of their fighters and found two Zabraks; former Sith Lord Maul and his brother, Nightbrother Savage Opress. Vizsla then took them to his camp on Zanbar. Together, they agreed to form an alliance with Maul and other criminal syndicates. Maul, Vizsla and their forces then took their fighters to Black Sun's Mustafar base, Gardulla the Hutt's Palace on Nal Hutta, and Jabba the Hutt's Palace on Tatooine."}, {"tag": "h3", "text": "Later history"}, {"tag": "p", "text": "Bo-Katan Kryze was in command of a Kom'rk-class fighter around 9 ABY."}, {"tag": "p", "text": "In 35 ABY, Gauntlet starfighters were part of a fleet assembled by Lando Calrissian to assist the Resistance during the battle against the Sith Eternal forces over the planet Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Gauntlet starfighters were created for the canon animated series Star Wars: The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}