{"url": "Kon_Yel", "categories": ["Category:Legends articles", "Category:Galactic Republic individuals", "Category:Kel Dor", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kon Yel"}, {"tag": "p", "text": "Kon Yel was a male Kel Dor who lived during the Cold War between the Galactic Republic and the reconstituted Sith Empire. A surveyor, Yel enlisted the help of a Republic-allied individual to prevent a meltdown at the ruined Taris ChemWorks Factory on Taris."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Kel Dor male, Kon Yel lived during the Cold War between the Galactic Republic and the Sith Empire. In 3643 BBY, he worked for the Republic Resettlement, part of the Taris Resettlement Initiative, as a surveyor. He investigated the ruins of the Taris ChemWorks Factory near Lake Brell and discoverd that the plant was close to a meltdown and collapse."}, {"tag": "p", "text": "When he returned to Waypoint Station Draay, the nearest Republic outpost, and contacted his employers, Yel informed them that the meltdown would render the area completely uninhabitable. As the area was too dangerous to send in a team, Yel's superiors told the Kel Dor that they would prepare to evacuate. However, the transmission was overheard by a Republic-allied individual, who asked to help. Yel informed the individual that the only way to avoid a meltdown was to perform a burnoff, which meant destroying the piles of chemicals with small directed fires. As there were no teams available to perform the burnoff, the individual offered to do it personally. Braving the rakghouls that inhabited the ruined plant, the individual managed to destroy the chemicals and secure the area. Thanking the individual, Yel contacted the project and informed them of the good news."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kon Yel was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He appears on the Republic version of Taris in Waypoint Station Draay, where he gives Republic players the mission \"Burnoff\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}