{"url": "Konrad_Rus", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Bureaucrats of Darth Krayt's Galactic Empire", "Category:Bureaucrats of the Fel Empire", "Category:Humans", "Category:Males", "Category:Moff Council members", "Category:Moffs of Darth Krayt's Galactic Empire", "Category:Moffs of the Fel Empire"], "nodes": [{"tag": "h1", "text": "Konrad Rus"}, {"tag": "p", "text": "Konrad Rus was a Human male who served as a Moff of the Fel Empire. During the Sith–Imperial War, Rus was a member of the Moff High Council and the leader of the Imperial Mission, an organization born out of Emperor Jagged Fel's Victory Without War program. Rus was present at the meeting between the Moff Council and Emperor Roan Fel at the close of the Sith–Imperial War, during which the Emperor was deposed by Darth Krayt, the Dark Lord of the Sith. Krayt took the throne and forced Rus and the other Moffs to swear fealty to him as the new Emperor."}, {"tag": "p", "text": "Rus continued to serve as the head of the Imperial Mission during the Second Imperial Civil War. He was contacted by Missionary Astraal Vao in the wake of Darth Talon's attack on the Imperial Mission temple on Socorro. Vao had been aiding Roan Fel's Empire-in-exile and was acting as an aide to Princess Marasiah Fel, all of which Rus revealed to Darth Krayt despite Vao's trust in him. Rus and the other Moffs were later tasked with aiding in the search for Cade Skywalker, a bounty hunter and former Jedi. By the time the Sith captured Skywalker, the other Moffs had begun to doubt Rus's loyalty to Darth Krayt, even suspecting him to be a spy for Roan Fel. In reality, his loyalty belonged primarily to the Imperial Mission, and was willing to work with whichever Emperor would allow the program to continue its work."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By virtue of his rank, he was a member of the Moff High Council, and although quiet, he was a skilled political negotiator, who had opposed the bellicose majority on the Council several times."}, {"tag": "p", "text": "With the rest of the Council, Moff Rus witnessed Darth Krayt's seizure of the position of Emperor in 130 ABY; one of the Sith Lord's first acts was to invite the Moffs to swear allegiance to him, and Konrad Rus obeyed, along with his peers."}, {"tag": "p", "text": "Although he remained in office under Krayt, Rus continued to be regarded a good man by subordinates like Missionary Astraal Vao. In 137 ABY, Astraal, stranded on Vendaxa, trusted him enough to inform him of her whereabouts, and that of Princess Marasiah Fel, the daughter of Emperor Roan Fel."}, {"tag": "p", "text": "Moff Rus, however, immediately brought this communication to Darth Krayt. After learning that Krayt planned to subject Princess Sia to Sith torture in order to learn her father's location, he further offered to lure Roan Fel into a Sith trap on Vendaxa using his contacts within the Empire-in-exile, in order to cut out the unnecessary \"unpleasantness\" of making a young woman undergo such a brutal interrogation."}, {"tag": "p", "text": "Konrad Rus's guiding motive seems to have been that service to whoever ruled the Empire enabled the Mission to fulfill its duties: his loyalty to Krayt was based on this surmise, and the same moral calculus can be detected in his offer to help forge a trap on Vendaxa, to avoid what he considered as further and worse atrocities."}, {"tag": "p", "text": "After Cade Skywalker was captured by the Sith, Rus was present via holographic projection at a meeting of the Moff Council in which Darth Maladi instructed the Moffs to cease the search for Cade Skywalker. Following the end of Maladi's transmission, Rus was accused of being a spy for Roan Fel by Moff Geist, leader of the Imperial Army and one of the most militarists among the Council."}, {"tag": "p", "text": "After Emperor Krayt was killed during the Battle on Had Abbadon, his lieutenant Darth Wyyrlok announced to the Moffs that he would be taking control of the Empire until Darth Krayt - whom he was pretending was still alive - recovered. After Admiral Veed's promotion to Regent, Wyyrlok requested an audience with Rus. Wyyrlok informed Rus that the Victory Without War program was to be abandoned and that the Imperial Mission would now teach the galaxy Sith values as well as the Sith Code for the purposes of uniting the galaxy under the banner of the One Sith. Rus was shocked by the news as he had an agreement with Darth Krayt that would allow the Mission to continue its work unchanged. Rus requested an audience with the Dark Lord. However, Wyyrlok informed Rus that meeting Darth Krayt would be impossible and that Rus would be receiving Sith instruction personally."}, {"tag": "p", "text": "Rus was also present in person at a meeting of the Moff Council in which Morlish Veed, the recently named Imperial Regent, announced of his plan to capture Roan Fel at a secret meeting between the deposed Emperor and representatives of the Jedi Order on the planet Agamar. Veed also announced that he had discovered the existence of a spy within Imperial ranks, for which he had decided that no message would go out from Coruscant, or any Imperial ship, without his direct authorization."}, {"tag": "p", "text": "By the time that Darth Krayt had returned to power in 138 ABY it had been reported that Konrad Rus had gone missing."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Konrad Rus was a man unquestionably dedicated to the Imperial Mission and its mission of mercy, a prime representative of the goals of the Victory Without War program begun by Jagged Fel. He was described by Astraal Vao as an embodiment of the values of the Imperial Mission. Due to his actions, and his abhorrence for torture and bloodshed, he gained the admiration of like-minded individuals as well as that of the Missionaries that served under him. However, Rus also gained the contempt of the more conservative, hard-lined members of the Imperial Military such as Moff Geist."}, {"tag": "p", "text": "Rus was also a skilled politician and negotiator. His talent for manipulation earned him the respect of Darth Krayt, even though Rus simply sought to avoid unnecessary bloodshed. Rus understood that in order for the Mission to continue aiding the lowest levels of galactic society, he would have to tolerate the ruthless and violent Sith, even though they represented the exact opposite of the Mission."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Artist Jan Duursema based Konrad Rus's appearance on actor Henry Gibson, best known for his appearances on Rowan & Martin's Laugh-In and as the leader of the Illinois Nazis in The Blues Brothers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}