{"url": "Anzat/Legends", "categories": ["Category:Legends articles", "Category:Bryx sector planets", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Imperial Remnant planets", "Category:Sith planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Anzat"}, {"tag": "p", "text": "Anzat was a legendary Mid Rim world located near the Perlemian Trade Route."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Discovered during the Great Manifest Period of the Galactic Republic, the world was avoided as its inhabitants fed off the life-forces of other sentients. Early Anzati culture developed around the belief that the omnipresent aurora that flicked across the sky was the combined life forces of their ancestors. Eventually, the idea of the Silent Voices or \"soup\" evolved, as Force-sensitives would perceive a type of speechless voice when exposed to the aurora. As early as their alignment with the Sith Empire of Darth Revan during the Jedi Civil War, the Anzati built large floating spaceports to accommodate trade with offworlds. Discouraging non-Anzati from leaving the platforms, the spaceports were a breeding ground for crime and delinquency as smugglers and other low-lifes made their way through the system. The Anzati, on the other hand, made their lives in the tall rocky spires that protruded from the mist shrouded surface. Living in small stone enclosures, many Anzati left the world after their early martial training was complete, making a living in the galaxy as murderers and assassins."}, {"tag": "p", "text": "Unaligned during the New Sith Wars, the world remained isolated through the century long Golden Age of the Old Republic."}, {"tag": "p", "text": "During his training with the Jedi Order, Jedi Tholme traveled to the world to study under the Anzati master assassin Akku Seii. Following his training with Seii, Tholme departed the world to track down one of the Anzati's former students, the assassin Katichak. Decades later, when the Confederacy of Independent Systems created a schism in the Galactic Senate and the Clone Wars erupted, Confederacy leaders opened a contract with the Anzati assassins. Jedi Master Tholme returned to the world to learn what Count Dooku and Sora Bulq were up to, while Jedi Aayla Secura searched for her own answers. Seeking out Seii, Tholme found his old master meditating in a stone courtyard. After refusing to give up information on his contact, Seii set his students against the Jedi, though they were all soundly defeated. Letting the students go, Tholme received some information when Seii revealed that all of the students were his and that no other teachers were currently available. As this broke tradition, Tholme guessed that the Separatists were working with the Anzati masters offworld thus leaving none left on Anzat. Returning to his ship, the Jedi met with Secura who had gleaned some other useful data. While in disguise as a spacer at Maggot's Cantina, Secura had located the ship piloted by Bulq and was able to steal his ship logs before being attacked by a Morgukai Nikto warrior. Killing the assassin, Secura hid as she listened in on a meeting between the fallen Weequay Jedi and the Anzati warrior master Rath Kelkko. Secura and Tholme decided that the latter would continue the investigation alone, following the stolen logs to follow Bulq to Saleucami."}, {"tag": "p", "text": "Following the rise of the Galactic Empire and amidst the Galactic Civil War, Anzat was absorbed into the Greater Maldrood, a mini-Empire formed by Admiral Treuten Teradoc following the death of Emperor Palpatine during the Battle of Endor. While the empire thrived for a time, it eventually collapsed following the New Republic's push towards the Rim. As Admiral Teradoc and other warlords were killed in the Deep Core, Anzat asserted independence and isolated itself. Sometime during this period of war, the exiled Jedi Masters Tholme and T'ra Saa, who had made Anzat their home since the Great Jedi Purge of 19 BBY, saw the end of their fellowship. Tholme succumbed to death, while Saa metamorphosed into the tree-like state of her kind, eventually rejoining the New Jedi Order some time between the Yuuzhan Vong War and the Second Galactic Civil War. Likely invaded, or at least completely cut off from the rest of the galaxy during the Yuuzhan Vong War, the Anzati were still seen about the galaxy in the era of Darth Krayt's Empire, of which Anzat was a member state."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}