{"url": "Kooroo_(being)", "categories": ["Category:Legends articles", "Category:Fellowship of Kooroo", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Religious workers"], "nodes": [{"tag": "h1", "text": "Kooroo  (being)"}, {"tag": "p", "text": "Kooroo was an ancient sage and visionary. Supposedly the author of meditations contained in the scroll known as the Teachings of Kooroo, Kooroo came to be regarded as the spiritual leader of the cult known as the Fellowship of Kooroo. The cult considered the ancient structures known as the Shrines of Kooroo, amid other sites throughout the galaxy, to be a legacy of Kooroo; however, scholars considered the existence of an actual connection between Kooroo and the shrines to be unclear."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Sage and visionary"}, {"tag": "p", "text": "Kooroo was an ancient being who was a sage and a visionary. Kooroo was an adherent of a long-forgotten mystical religion."}, {"tag": "p", "text": "It was claimed that the parchment scroll known as the Teachings of Kooroo, which resided in Shiin's Library in the Mos Eisley spaceport settlement on the Outer Rim Territories planet Tatooine at some point by 85 BBY, contained Kooroo's meditations. Nibao Glumm, a native of Mos Eisley, characterized the supposed meditations of the scroll as \"rambling.\""}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Eventually, Kooroo came to be regarded as the spiritual leader of the Fellowship of Kooroo, an ancient cult of mysterious origins active during the Galactic Civil War. The Fellowship believed that certain landmarks and shrines throughout the galaxy, including the ancient stone structures known as the Shrines of Kooroo, were relics or signs from Kooroo. Members of the Fellowship undertook a pilgrimage to those sites, where they meditated in order to attain the \"enlightenment of Kooroo,\" believed by many to refer to telepathic abilities. The investigative reporter Andor Javin mentioned Kooroo in a TriNebulon News report in 2 ABY."}, {"tag": "p", "text": "By 11 ABY, general consensus among scholars was that the Shrines of Kooroo were built by an advanced alien species known as the Kooroo. However, the purpose of the structures and the existence of an actual connection between the shrines and the being named Kooroo were still unclear by that time, and even the name \"Kooroo\" was conjecture of obscure origin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The being Kooroo was first mentioned in the 1995 West End Games roleplaying game sourcebook Platt's Starport Guide, which was authored by Peter Schweighofer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}