{"url": "Kordan", "categories": ["Category:Legends articles", "Category:Inner Rim species", "Category:Primate sentient species"], "nodes": [{"tag": "h1", "text": "Kordan"}, {"tag": "p", "text": "Kordans were a sentient species, native to Korda Six."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Kordans had evolved from simian-like stock, and represented a sort of primitive physicality. They stood with a hunched over posture, resting their hands and knuckles on the ground, and used all four limbs to locomote. Their wide hands possessed four thick fingers. They were a fairly large species, standing over two meters, even when hunched over. Kordan hair ranged from black to light brown, and covered the majority of their bodies, with the exception of their faces, hands, and feet."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The Kordans had a primitive culture, by galactic standards. Their world ranged from barren rocky plains to small forests, and the Kordans lived among the terrain with little technology at all. They wore loose chain-mail armor, as well helmets, but had little else in the way of protection or weaponry, until the Mandalorian splinter group, Death Watch, arrived."}, {"tag": "p", "text": "The Death Watch changed Kordan culture by giving them advanced weaponry, and showed the primitive beings how to use blasters and anti-artillery cannons. They also trained them in more modern warfare tactics, as they planned to use the natives to their own ends."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Kordans lived alone on Korda 6, uninvolved with the galaxy at large. Their world was overseen by the Korda Defense Force, who avoided the natives due to animosity between the two groups."}, {"tag": "p", "text": "During the Mandalorian Civil War, however, their existence changed quickly and drastically. The Death Watch splinter group enlisted the Kordans to their cause, equipping and training them with advanced weaponry and techniques. The Death Watch hoped to annihilate the True Mandalorians, who, with their leader Jaster Mereel, led the entire Mandalorian culture and all their planetary holdings. The Death Watch forced their Kordan allies to trap a training squad of the Korda Defense Force on their world, knowing that the KDF would enlist the True Mandalorians for help in rescuing their men."}, {"tag": "p", "text": "The True Mandalorians responded as planned, and landed on the planet soon after. Splitting into three squads, one led by Mandalore Mereel, one by Jango Fett, and the other by Montross, the Mandalorians foresaw an easy victory over their primitive enemies. The Kordans, however, proved to be an unwelcome surprise, as they counterattacked with their Death Watch-supplied weaponry, including ion cannons. The Mandalorian companies were quickly scattered and they lost many men, with the Death Watch commandos joining the fight themselves. Montross, in his pride, ignored orders to retreat from the Kordans, and had to be rescued by Mereel's company. When the Death Watch's leader, Tor Vizsla, appeared on the battlefield, Montross retreated, hoping that Mereel would be killed and he could ascend to rule as Mandalore. Mereel was indeed cut down by the attackers, and died on the battlefield, and Fett was named the next Mandalore in his stead. Many Kordans were killed in the battle, and were left with nothing to show for their losses other than their new technology."}, {"tag": "h2", "text": "Appearances"}]}