{"url": "Korin_Aphra", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Articles needing illustration", "Category:Chelli Lona Aphra's crew", "Category:Humans", "Category:Males", "Category:Scholars"], "nodes": [{"tag": "h1", "text": "Korin Aphra"}, {"tag": "p", "text": "Korin Aphra was a human male who lived during the Age of the Empire. He was the father of Chelli Lona Aphra, his daughter born in 24 BBY with his wife Lona Aphra. During the Clone Wars, Chelli and her mother moved away to Arbiflux, where her mother was killed. He was a dedicated scholar."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Korin was intensely interested in the Jedi, especially the Ordu Aspectu. He studied at his home in the University Quarter on the Second Moon of Thrinittik, where he lived with his daughter Chelli Aphra and her mother Lona Aphra. He wrote a report on Oo'ob and the creation of the Farkiller weapon. However, his obsession with researching the Jedi caused him to neglect Chelli and Lona."}, {"tag": "p", "text": "One night, Korin examined some stolen memory crystals he had obtained thanks to bribable librarians. They contained \"The crimes of the Jedi renegade Oo'ob the Apostate.\" Behind him, young Chelli, whom he was supposed to be watching, cut herself. Lona got frustrated that Korin was too embraced in his research, be he argued that he could find the Citadel of Garn and bring light to the galaxy. Lona tried to remind him of the firing squad they could face if his research was discovered, but he failed to pay attention. Subsequently, Lona decided to leave with Chelli. Korin did not realize at first, and assumed that they were going shopping when they failed to come for dinner."}, {"tag": "p", "text": "Lona took Chelli to Arbiflux, where she continued to raise her. When raiders attacked their house, Lona was killed, but not before she contacted the Galactic Empire, telling them everything she could. The Empire rescued Chelli and sent her back to Korin. When Chelli returned to Korin's house on the Second Moon of Thrinittik, she began setting fire to his research material. Korin returned, shocked at what he saw, and Chelli told him how Lona had been killed and warned him that an Imperial psychologist had determined that she might have some mental issues."}, {"tag": "h3", "text": "Reunion with Chelli"}, {"tag": "p", "text": "While Chelli eventually became a doctor in the Archaeological Association, Korin learned from the Sava of her university that she may have placed abersyn symbiotes on Boothi XII so she could pretend to discover them. He leaked enough of this information to the board of the Archaeological Association they would explore the possibility of Chelli faking the discovery. Thus her doctorate was suspended. When Chelli discovered this, while trying to sell a recovered artifact on Archaeo-Prime, Korin confronted her. He explained he made sure her doctorate was taken away so she would assist him in finding the Citadel of Rur."}, {"tag": "p", "text": "Chelli led him back to her ship, the Ark Angel II, where she drew a blaster on him. Korin was confident that she would not hurt him, so she allowed her assassin droid Triple-Zero to reveal his array of torture devices. Before he could be hurt, she changed her mind and asked him why she should help him. He explained he had new data and told his theory of what the Ordu Aspectu was when Triple-Zero asked of what they were. He believed that their quest for immortality had worked and if he was able to find the Citadel it would lead to an awakening of the Force in the galaxy. Chelli speculated that Korin could be wrong and the Ordu Aspectu prophecy might just be a mistranslation. Korin, however, convinced her to join him, explaining if the Ordu Aspectu wasn't a positive thing it was possible that there might be an ancient weapon in the Citadel that she could profit from."}, {"tag": "h3", "text": "Gathering readings"}, {"tag": "p", "text": "Korin guided Chelli to the place where he could get the readings he needed, but refused to give her any more information due to his lack of trust in her. He didn't realize that the location, Yavin 4, was under Imperial control due to Rebel activity on the moon. The group landed on Yavin 4 and observed several platoons of Imperial forces. While Chelli tried to figure out how to get into the temple, her father asked about current affairs. She explained the Battle of Yavin and the destruction of the Death Star. Korin confessed that he thought it was all rumors and fictional stories. Chelli became irate that he was so out of touch, having not known about the destruction of Alderaan, or that she had worked for Darth Vader."}, {"tag": "p", "text": "Chelli sent Black Krrsantan to create a distraction to draw the troops away from the Massassi Temple so Korin could get in to get his readings. He expressed concern about the Wookiee, but Chelli assured him he would be fine. Once Triple-Zero and his fellow droid accomplice, BT-1, entered the temple and opened the ventilation hatches, Korin and Chelli snuck in. While climbing down a rope, Korin dropped a Massassi piece that he was carrying. After Chelli caught the piece, he explained he had been planning on finding the Ordu Aspectu for a long time. While making their way to the part of the Temple where Korin could get the data he needed, he expressed concern that the Rebels would locate their headquarters in a site of historical importance."}, {"tag": "p", "text": "When they reached a room just below the summit, he instructed Chelli to place the crystals into the matching slots so he could get the location of the Citadel. After inserting all the crystals, Korin was disappointed when nothing appeared to happen, and Chelli started to berate him for wasting his life on a wild goose chase and not caring about her enough. BT-1 drew their attention to the sky outside where beams of light were emanating from all the structures in the complex."}, {"tag": "p", "text": "Korin proceeded to get the readings he needed to locate the Citadel, and left with the rest of the crew. Before they could exit the building, they ran into a group of stormtroopers and had to flee, preventing Korin from picking up the crystal artifacts he had used to activate the beacon. Aphra ordered BT-1 to slow the troopers down, and the droid launched grenades at the incoming squad. As the group ran outside, they were confronted by an AT-AT walker. Behind them, stormtroopers, led by Captain Magna Tolvan arrived and Tolvan questioned their presence on the moon. As Aphra tried to defuse the situation, the Ark Angel, piloted by Black Krrsantan arrived, and Korin boarded it, pulling Chelli aboard with him. As group fled under Imperial fire, Korin suggested to his daughter that if she had stayed away from fieldwork, she'd probably be tenured at a university."}, {"tag": "h3", "text": "Exploring the citadel"}, {"tag": "p", "text": "Once he and Chelli were in space, Korin provided the coordinates to find the Citadel. When they arrived at the point in space, he was awed by the appearance of the Citadel. The ship landed and Korin walked to the entrance of the facilty, finding the ancient skeletons of Jedi. Korin began examining the remains. Knowing that Jedi were typically cremated, he predicted that these had died in pain, unless the Ordu Aspectu had a different tradition. While he was examining the remains, Chelli started to loot them. He was shocked, but she explained that she had debts to pay. The group made their way deeper into the facility, and Korin was able to turn on the generator using most of his remaining Ordu crystals."}, {"tag": "p", "text": "While Triple-Zero and BT-1 went to collect the crystal modulator from the Ark Angel, Korin and the rest of the group traveled towards the core in search for the computer core. Chelli expressed her concern over the opening below directly leading to space, and Korin claimed the Ordu wanted to show their followers to understand their smallness compared to the \"majesty of space.\" Before they could find the computer core, though, Krrsantan pushed Korin and Chelli into cover as snowtroopers, led by Captain Tolvan, arrived. Krrsantan then covered Chelli and Korin as they ran into the core. Crossing a force bridge, they took cover behind an elevator that led to the core and Triple-Zero informed them over the comms that Krrsantan had returned to the Ark Angle and was leaving them."}, {"tag": "p", "text": "Chelli shot at the controls for the force bridge, allowing several approaching troopers to fall into the void of space. She and Korin then ascended to the computer core where they found the corpse of Rur. Korin attempted to reboot the Citadel's computer, but was missing a crystal which prevented it from operating. Disappointed, he explained that his interest in the Ordu was an attempt to bring light back into the galaxy. He recognized that he wasn't a warrior but hoped that by restoring the Ordu he could make the galaxy a safe place for Chelli to grow up. Korin told his daughter that her mother wanted to find a place in the middle of nowhere and live their lives, and disagreed with Korin's plan to find and restore the Ordu."}, {"tag": "p", "text": "Korin realized that while both he and Lona had been trying to do the best for Chelli, they had ended up being terrible parents in the process. He then explained how he had learned of Chelli's deception in completing her doctorate and started to explain how she could get her credentials back. She stopped him and gave him a crystal she had found on the corpse of Rur. Chelli told him that restarting the computer would give him access to the Ordu Aspectu's data, but it might be dangerous. Korin inserted the crystal and restarted the computer, which caused Eternal Rur, a copy of Rur's conscience, to reactivate."}, {"tag": "h3", "text": "Uncovering the truth"}, {"tag": "p", "text": "Eternal Rur began asking what date it was, and Chelli tabled a deal where he would explain what had happened to the Ordu Aspectu. Eternal Rur then threatened to torture her and Korin, but she reminded him that it was a slow process. Thus Eternal Rur began his story, detailing how Rur had wished to copy his intellect, but instead transferred his conscience to a Kyber crystal. He further explained that he believed a false conscience was inside Rur's body, and decided to kill him and the rest of the Ordu Aspectu, although Rur had removed one of the crystals from the control core, deactivating him. Once Eternal Rur gave a calendar he was familiar with, the Domancion Accord, Korin was able to figure out that he had been deactivated for a thousand years."}, {"tag": "p", "text": "Enraged, Eternal Rur had one of his droid attack Korin, injuring his leg. He and Chelli retreated down the elevator from the computer core, although they were still trapped due to not having any crystals to activate the Force bridge. Korin suggest Chelli return to the computer core and destroy the console and take the crystal from there. He warned her that it would likely destroy the station and expressed sadness that it would likely eliminate the last vestiges of the Ordu. After Chelli wrecked the console and took the Rur Crystal, which contained Eternal Rur, she moved her dad found Tolvan and her troopers being overran by the droids being controlled by Eternal Rur. Aphra used a crystal to reactivate the force bridge and then deactivate it when Tolvan crossed, separating the Captain from the droids."}, {"tag": "p", "text": "Tolvan signaled for her ship to fly over and she, Korin and Chelli boarded it. Tolvan called to her pilots to take off before finding them dead. As Chelli and Tolvan scrambled to launch the ship themselves, an RA-7 protocol droid, possessed by Eternal Rur, attacked Tolvan. Aphra took control of the ship and flew it away from the citadel as it exploded. The protocol droid was released from control of Eternal Rur and Tolvan drew her blaster on Chelli. Korin then stabbed Tolvan with a lightsaber, incapacitating her."}, {"tag": "p", "text": "Korin and Chelli subsequently dropped Tolvan off on a remote planet. He commented that Chelli had bad taste in women. They then went to find somewhere to securely store the Rur crystal and delivered it to Quarantine World III, although, to Korin's ignorance, Chelli had actually handed over a fake and kept the real crystal to sell. On their way to get rid of the stolen Imperial shuttle, he talked to Chelli about not looking to the past for deliverance and agreed to sort out her doctorate suspension."}, {"tag": "h3", "text": "Captured by the Empire"}, {"tag": "p", "text": "Korin continued chasing religious history. When he attempted to enter Asteroid Helix 13-v, to investigate what he thought may have been a Force cult, he was stopped by members of the Rebel Alliance, who gave him rations and told him to leave. Korin refused, so they pointed their blasters to make him leave. Korin also got to watch the prayer-oolites form aurorae above Piu when the Annual Giganism hit the troposphere."}, {"tag": "p", "text": "At least two years after his adventure to the Citadel of Rur, Korin was on Ash Moon 1 in the Kartovian Formation, where pilgrims of the Central Isopter were staying. However, Imperial forces, led by Darth Vader and General Maximilian Veers, arrived aboard the Executor-class Star Dreadnought Executor in search of rebels. When they found none, they began to use the pilgrims as target practice. Korin attempted to run, making spontaneous claims like knowing Jedi Mind Tricks. He was quickly stopped by Veers, and his stormtroopers discovered the rebel issue ration packs he had been given."}, {"tag": "p", "text": "Veers had Korin taken onto the Executor to be interrogated. After Vader was informed of the capture, he entered the interrogation cell, bringing Chelli, who had been working on the Executor as an archaeologist, with him. Vader Force choked Korin, who was still masked, asking him where the Rebel Alliance's secret base was located and threatening a slow death if he did not answer. Korin answered with a Jedi apothegm, which Chelli recognized and Vader ordered for interrogation specialists. As Chelli questioned Korin's knowledge, Vader removed his helmet, revealing his identity to his daughter. After Vader released Korin, Chelli tried to convince him that her father was harmless. Korin questioned Chelli's presence on the Executor, but they were interrupted as the interrogation droids arrived. They were none other than Triple-Zero and BT-1, who had been captured and enslaved for Vader's use."}, {"tag": "p", "text": "Vader ordered the pair of droids to find out what Korin knew about the rebels and not let Chelli intervene. Chelli prompted Korin to tell them \"everything\" and Korin began telling stories of a religious prophet, not realizing it was about the rebels. Chelli expressed her frustration that Korin was still chasing \"religious nonsense,\" saying that she needed him. Korin told her that people did not change and stated that he did not blame Lona was taking her away. Triple-Zero intervened to begin interrogating Korin and Chelli pleaded for him to tell the droid he knew about the rebels. Realizing that it was about the rebels, who he disliked, Korin complied, recounting his encounter on Asteroid Helix 13-v."}, {"tag": "h3", "text": "Investigating Asteroid Helix 13-v"}, {"tag": "p", "text": "Chelli and Veers reported back to Vader, and the Dark Lord of the Sith brought her, Korin and BT-1 with him to investigate Asteroid Helix 13-v. After they arrived, Vader left BT-1 to watch Chelli and Korin and Chelli tried to explain to Korin how she came to start working for Vader. Korin, though, was distracted with by what was around them. He believed they were in a traditional archicella for the J'doon school, where pilgrims would come to petition the Force for peace and prosperity."}, {"tag": "p", "text": "When he complemented the Empire's technology, Chelli remarked that he sounded like Professor Rupo Ud, one of Vader's archaeologists—until his untimely death to a trap on Ash Moon 1. Korin, whom had met Ud, asked how he was, and Aphra joked that he was let his work get on top of him. Korin suspected that it meant Ud had been crushed by something heavy, but Aphra changed the subject, pointing out where the rebels had camped out. Examining the materials around, she deduced that the rebels were heading somewhere cold. Korin commended her archaeology and Aphra told BT-1 to inform Vader that the rebels had only been on a stopover. BT-1, though, made Aphra do it herself."}, {"tag": "h3", "text": "Rebel attack"}, {"tag": "p", "text": "After Aphra found Vader, he began to leave the site, ordering one of the stormtroopers at his shuttle to shut the place down as well as telling BT-1 to signal bombers to destroy it. Korin protested this decision, but Vader slammed him to the ground with the Force and informed BT-1 that he only needed one Aphra, giving them the journey to decide which one died. Aboard the shuttle, Korin began saying his regrets and Aphra asked how they were going to choose which of them died. Wishing to stay positive, Korin told Chelli about the prayer-oolites and asked what she had been up to. Chelli summarized the many adventures she had endured since last seeing Korin."}, {"tag": "p", "text": "While Chelli put herself down for the backstabbing and running away she had done, Korin reassured her that she had seen and learned so much, and had \"never stopped feeling.\" After telling Chelli he was proud of her, Korin decided that he was the one for BT-1 to kill. BT-1 prepared to shoot when the shuttle began shaking. An Imperial officer stated that they were being pulled in by a tractor beam and the stormtroopers prepared for boarders. As a hull drill cut away the main door, Korin, who suspected a pirate attack, wondered where Aphra was going, but soon noticed a second hull drill above him and the troopers. An ion charge was dropped in and incapacitated Korin and the imperials."}, {"tag": "p", "text": "While Korin was unconscious, the attackers, Extraction Team Misericorde from the Rebel Alliance, took him and the stormtroopers out of the shuttle aboard their ship, the Unnamed. Their leader, Magna Tolvan, recognized Korin and knew Chelli will have been with him. Chelli, who was still conscious, was able to send him off the rebel ship aboard the shuttle by programming it to blow out of the vessel and escape to Ash Moon 1—although she herself fled in an escape pod from the rebel ship with BT-1."}, {"tag": "h3", "text": "Aphra's final message"}, {"tag": "p", "text": "When Korin awoke, the shuttle had arrived at Ash Moon 1 and the girl Vulaada Klam rushed to the ramp looking for \"Aphra.\" Not realizing it was Chelli she wanted, Korin replied to her call, but realized she had been running from a giant beast. Korin told Klam to get behind him. Before the beast could attack Korin and Klam, it was blasted by a U-wing. After it landed, Tolvan went to greet the pair and took them with her."}, {"tag": "p", "text": "By 3 ABY, the three were based at the Rebel Alliance's secret base on the planet Hoth. While Tolvan continued her rebel duties and Klam hearded Tauntauns, Korin spent his time researching the Alliance, intending to write his own history. He was able to out several guiding principles as near-quotations of Jedi apocrypha and also learned of a Force-sensitive pilot in the Alliance. One day, Tolvan approached Korin with news that Chelli had sent a message for the two of them and Klam. Korin was surprised at this, having assumed that Chelli was dead. Thus the three gathered to hear it."}, {"tag": "p", "text": "In the message Chelli explained that she was sorry for leaving them but felt it was necessary as she was a trail of destruction and it had not brought her any happiness. She further told the Korin and the other two to not be sad for her and assured them that it was the only way for everything to end between Chelli and Korin, Tolvan and Klam. After her message ended, the three walked away upset and sat outside. When Tolvan asked if Chelli had made a difference, Korin stated that she had made no difference to the galaxy. He then rambled on about how he thought rebellions were just future tyrannies until Tolvan corrected him, saying whether she made a difference to them."}, {"tag": "p", "text": "Almost immediately after, Luke Skywalker approached them, saying that he himself had met Chelli before. He then explained that the Empire's computers had been sabotaged to stall their search for the rebel base by someone matching Chelli's description. After Skywalker left them, Tolvan asked if she should mention that Chelli had saved the the Emperor's life and Korin told her it was best not to. Korin then questioned if his daughter was out in the galaxy, settling down on some planet, though Klam suggested Chelli would only settle down to make trouble. In response, Tolvan told the two of them she thought Chelli Aphra was doing something in between both extremes."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Korin Aphra was obsessed with his work on ancient religions such as the Jedi. His distraction in investigating the Ordu Aspectu led to Lona Aphra becoming frustrated with him and leaving him with their child, Chelli Aphra. Chelli later argued that he cared more about the dead than he did of the living and, although he had promised to change, he still continued to chase more \"religious nonsense\" after parting with Aphra again. During his time of Hoth, Korin had a beard."}, {"tag": "p", "text": "Korin was a human male with light skin and brown eyes. He formally had black hair but later had none."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Korin was a scholar and was skilled in archaeology. At the Citadel of Rur, he was able to identify that the ancient Jedi had died in pain. At Asteroid Helix 13-v, he was able to identify an archicella of the J-doon school."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}