{"url": "Koro-1_airspeeder", "categories": ["Category:Legends articles", "Category:Airspeeders", "Category:Desler Gizh Outworld Mobility Corporation products"], "nodes": [{"tag": "h1", "text": "Koro-1 airspeeder"}, {"tag": "p", "text": "The Koro-1 airspeeder—with its large, vamped-up luxury model, the Koro-1 Deluxe airspeeder—was a model of dragster-style airspeeder that was manufactured and sold by the Desler Gizh Outworld Mobility Corporation. The Koro-1 airspeeder was followed by Desler Gizh's upgraded Koro-2 model."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 24 BBY, the Commerce Guild opened an office on the tax-free world of Korriban. Guild members deserving punishment were sent there. The Guild, however, motivated other corporations to join them by opening new offices of their own in the Korriban spaceport of Dreshdae. But by 23 BBY, local Guild executives were being robbed in their hotels with alarming frequency by black market thieves, as a Jedi coalition team learned from their Korriban informant, Teluron Thacker. Using rampant local crime against Guild workers as an excuse, therefore, but in violation of Republic law, the Guild sent to Korriban a droid army, which it placed in the front ranks of its local officers and troops clad in full plastoid armor and battlefield helmets. The droid contingency included dwarf and homing spider droids. The aim of the Guild's army and security forces on Korriban, beyond protecting the Guild's workers from petty crime, was to crush the local black market, for Guild executives were tired of having to buy back their own items from the thieves who stole them."}, {"tag": "p", "text": "The Commerce Guild Army and Punitive Security Forces on Korriban also got caught up (surely by the machinations of the Guild with the galaxy's re-emergent Sith) in the pursuit of a Jedi Order coalition team (headed by Obi-Wan Kenobi) sent by the Jedi High Council to track down galactic criminals Granta Omega and Jenna Zan Arbor. While the army battled Kenobi and three other Jedi Masters within the Great Sith Temple's long-abandoned Sith Academy, the Guild's local security forces—the Commerce Guild Army Patrol—led a high-speed chase of the Jedi (whose Koro-1 Deluxe airspeeder was piloted by 18-year-old Anakin Skywalker) into the Valley of the Dark Lords, which ended in the scorching demise of each of the patrol's cruisers."}, {"tag": "p", "text": "The eight-member Jedi coalition team on Korriban was loaned the use of the luxurious 'Deluxe' model of the Koro-1 airspeeder, which seated at least 8 passengers. Teluron Thacker, a Commerce Guild businessman and Jedi Order informant, was the vehicle's owner. Thacker's vehicle, a large company airspeeder for clients, had a bright orange shell with decorative fins, and boasted a pair of sniper blasters. Notwithstanding, he admitted that his 'Deluxe' speeder wasn't very fast or agile. Thacker betrayed his Jedi clients, however, when the Sith-backed Guild \"got to him,\" and his courage crumbled before forces he feared more than the Jedi. Master Siri Tachi noted Thacker's \"jumpiness\" after he had oddly yelled \"I'm sorry!\" as the Jedi took off in the luxury vehicle. Speeding to the Valley of the Dark Lords (in pursuit of Omega and Zan Arbor), the Jedi were soon being tailed by Commerce Guild Army Patrol cruisers and ordered to land their Koro-1."}, {"tag": "p", "text": "Having guided the airspeeder high above Dreshdae, Anakin estimated a ten-minute flight to the Valley and pushed the vehicle to maximum speed. But suddenly the Guild's security cruisers were on their tail, and the comm unit crackled on the emergency channel with a Guild army patrol order for them to land their stolen vehicle. When Kenobi begged to differ, stating the speeder was owner-loaned, the patrol said its owner had reported it stolen and threatened laser-cannon firepower if they didn't comply within thirty seconds. When Kenobi asked his Padawan if he could outrun the patrol, Anakin replied that he could if he had to, and took the speeder into a screeching dive. Struggling to keep up, the army speeders shot out with their cannons. Anakin found that the Koro-1's sniper blasters were disabled, however, when he tried to respond in kind—the Jedi could only hope for canyon-cover as they sped for the Sith Academy. But if Anakin was to outrun the patrol, he realized, he was going to need greater speed. With Jedi Master Ry-Gaul taking over the controls, Anakin crawled past the other Jedi to the rear, let fly the Koro-1 canopy with a servodriver, and, with a fusion cutter that Master Soara Antana had handed him from the cabin tool kit, cut through the fastenings of the luxury model's decorative port fins and kicked them off. He also made deep cuts in the Koro-1's bright plastoid shell and sent it sailing (the canopy, meanwhile, had smacked into the lead security speeder's viewport and sent it careening to the planet's surface). Crawling back to the controls, Anakin could now achieve maximum speed. The renowned Master-pilot Ry-Gaul relinquished the Koro-1 controls to Skywalker, who he deemed better able to handle the evasive flying that was now required."}, {"tag": "p", "text": "Having trained on Podracers, the next bit of ground-hugging flying that was required of Anakin came naturally to him. Even as the mountains loomed ahead, he didn't slow down, but instead kept pushing the speed. As the Koro-1 screamed down into the Valley, Skywalker looped around a peak and dived into a canyon dotted with boulders, whipping through it as if it were a racing course, with the three remaining security cruisers on his tail. While he sensed all obstacles before they appeared, the speeder-pilots behind him did not, and so met their doom. Anakin allowed himself a moment to glance over at his Master, who had turned pale—a metamorphosis he always enjoyed watching. Anakin pushed straight for a tall canyon formation against Kenobi's rebuttal that the Koro-1 Deluxe didn't have, he believed, the kind of maneuverability to pull off the stunt—they'd soon find out for sure, was Skywalker's easy reply. At the last possible second, Anakin wrenched the controls, but instead of turning, he went straight up, causing the bottom of the speeder to skid, space-bound, along the formation: its screaming sound blocked out all other sound, including that of the engine. Smoke and flame rose up around them, which Obi-Wan noticed acutely, closing his eyes. Foolishly attempting the same maneuver, the security speeder behind them crashed head-on into the rock. Straightening out his craft, with all of the patrol vehicles now out of commission, Anakin gleefully noted that no one in the Koro-1 speeder said anything for a moment. In the nerve-splitting rush of vertical air, the fire on both wings had finally died out. Clearing his throat, Obi-Wan spoke at last: \"And now, for the hard part,\" he said."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}