{"url": "Korriban", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Commerce Guild locations", "Category:Confederacy of Independent Systems planets", "Category:Desert planets", "Category:Galactic Republic planets", "Category:High-gravity planets", "Category:Infinite Empire planets", "Category:Korriban locations", "Category:Sith Empire planets", "Category:Sith planets", "Category:Sith Worlds", "Category:Type I atmosphere planets", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Korriban"}, {"tag": "p", "text": "Korriban, known as Pesegam during the reign of Xim, and also known as Moraband by the time of the Clone Wars, was the sole planet in the Horuset system, located across the galaxy from Koros Major. It was the original homeworld of the Sith species and a sacred planet for the Sith Order, housing the tombs for many ancient and powerful Dark Lords of the Sith, and containing immense dark side power."}, {"tag": "p", "text": "After the Hundred-Year Darkness, the remaining Dark Jedi interbred with the Sith species and ruled the Sith using their Force powers. After the Great Hyperspace War, Korriban was abandoned and became a barren world. It was the site of a Sith Academy, and became the headquarters of the One Sith."}, {"tag": "p", "text": "It was close to Bosthirda and was located on the Nache Bhelfia and Kamat Krote hyperspace lanes."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Infinite Empire"}, {"tag": "p", "text": "This remote, foreboding planet was the original homeworld of the Sith species. At some point prior to 30,000 BBY ,a Killik colony was established on Korriban, which eventually produced a Killik Sith Lord. The insectoid colonists were swiftly driven off by the Sith."}, {"tag": "p", "text": "The Rakata invaded Korriban in an attempt to integrate the world into the Infinite Empire around 27,700 BBY, intending to harvest slaves from the planet to be used for Rakatan projects. The sole artifact to survive this era was the ancient Star Map, around which the tomb of Naga Sadow was later built."}, {"tag": "p", "text": "The Rakata were eventually forced off the world after the Sith King Adas led his people against them. Adas died in the battle, and thus, despite this victory, the Sith society crumbled, and, in the ensuing centuries of strife, the Sith relocated to worlds such as Arbra, Ziost, and Tund, using captured Rakatan vessels, leaving Korriban as a graveyard world populated only by religious fanatics."}, {"tag": "p", "text": "The world was at least a nominal member of Xim's empire from around 25,126 BBY until its fall, and was given the name Pesegam."}, {"tag": "h3", "text": "Sith Empire"}, {"tag": "p", "text": "The Sith Empire was founded in 6900 BBY by exiled fallen Jedi fleeing the Battle of Corbos, which concluded the Hundred-Year Darkness. The fallen Jedi landed on Korriban."}, {"tag": "p", "text": "Using their training in the Force, the fallen Jedi amazed the Sith and elevated themselves to god-like status on Korriban, becoming the rulers of the Sith people. As years passed, and interbreeding occurred between the Fallen Jedi and the Sith, the term \"Sith\" came to mean not only the original inhabitants of Korriban, but also their fallen Jedi masters. Until the rise of Naga Sadow, the existence of the Sith Empire was unknown to the Galactic Republic."}, {"tag": "p", "text": "Under the pall of Sith magic, this desolate world became more hellish and dangerous.The Sith Lords erected huge palaces and burial complexes to honor their fallen Dark Lords. Circa 5000 BBY, the planet became an endpoint of the newly-formed Daragon Trail hyperspace lane, when it was discovered by Gav and Jori Daragon. This event triggered the Great Hyperspace War. After the fall of the Sith Empire, the planet lost much of its prominence in the galaxy, eventually falling off the galactic starcharts for a thousand years. Despite the belief the Sith as a species became extinct after the end of the war, isolated enclaves of Kissai and Massassi existed on the planet over a millennia after their empire's fall."}, {"tag": "h3", "text": "Old Sith Wars"}, {"tag": "p", "text": "Korriban was resettled prior to 3993 BBY by Dark Jedi survivors of the Exar Kun War,[source?] and was home to the new settlement of Dreshdae and a Sith training academy. In 3993 BBY, as part of the Great Hunt, Duron Qel-Droma and Shaela Nuur died on the planet, failing to cleanse it of terentateks. The planet became the sector headquarters of the Czerka Corporation. Darth Revan and Darth Malak visited the planet on their quest to discover the Star Forge. After losing his memory, Revan visited and infiltrated the academy again in 3956 BBY on his quest to re-discover the Star Forge for the good of the Republic. Seeking the Star Map in Naga Sadow's tomb he passed the tests and then confronted Uthar. With the death of Master Uthar Wynn, the academy's headmaster, and Darth Malak himself at the hands of Revan in 3956 BBY, the Sith Order collapsed into a civil war (which took place 3956-3950 BBY) which decimated the Sith Order."}, {"tag": "p", "text": "It took the Republic a couple of years to send an expeditionary force to Korriban (around 3954 BBY) in order to deal with any potential Sith who might attempt to take up the mantle of Dark Lord. They found a planet nearly in ruins—barren and lifeless as a result of the then unknown civil war. It was assumed by the commanders of the Republic task force that the remnants of the Sith turned on each other, vying for what little power remained. It was also said that Revan had always intended to return to Korriban one day to subdue any would-be Sith insurgents, but he then disappeared. However, the Republic discovered evidence that several Sith Lords did manage to escape the planetary conflagration, fleeing to remote corners of the galaxy."}, {"tag": "p", "text": "After the fall of Darth Malak, the ancient tombs within the Valley of the Dark Lords were plundered by grave-robbers. Each tomb was once infused with the history and heritage of the old Sith Empire, containing great mysteries and powerful relics of the Force. Many broken, charred corpses littered the plains of Korriban during this time, virtually all that remained of the Sith who once inhabited the world. However, their malignant spirits remained, ready to confront any who disturb their rest by way of their guardian-familiars, the Hssiss."}, {"tag": "p", "text": "In the chaos following the Jedi Civil War, which nearly destroyed the Jedi Order, Jedi Master Lonna Vash used Korriban as a hideout. She was eventually trapped and killed by Sith Lord Darth Sion in the ruins of the academy, and then used as bait to lure the Jedi Exile into Sion's hands. After escaping the trap, the Exile discovered the long lost tomb of Ludo Kressh."}, {"tag": "h3", "text": "Great Galactic War"}, {"tag": "p", "text": "In the aftermath of the Jedi Civil War, a fleet of Republic ships remained to guard the abandoned Sith world of Korriban. This remained until the onset of the Great Galactic War, when the reformed Sith Empire emerged and began conquering worlds in the Aparo sector as well as ambushed the Republic fleet in the Tingel Arm, as part of the Emperor's plan. In the millennium since the Great Hyperspace War, the Empire had lost the location of Korriban, but they regained it when the Sith Emperor dominated the minds of Revan and Malak."}, {"tag": "p", "text": "In order to bolster their forces, the Republic pulled many of their ships to support the fleet which left only a small number of Jedi security ships to patrol Korriban. This action, however, had already been predicted and played right into the Emperor's hand. As the conflict continued, the Sith, knowing that the Republic Forces on Korriban were weakened significantly, staged an assault against the guarding ships and destroyed them thus returning the planet to Sith control, just as the Emperor planned, before the Jedi Council became aware of the incident."}, {"tag": "p", "text": "Retaking Korriban had been a top priority for the Sith Empire, when it re-emerged during the Great Galactic War. After retaking the planet, they re-established the Sith Academy."}, {"tag": "h3", "text": "Cold War"}, {"tag": "p", "text": "In the years after the Treaty of Coruscant, Korriban had become a major center of learning for the Sith Empire, the Sith Empire had seemingly built upon the tombs and the former Dreshdae, as well as uncovering many lost tombs and caverns."}, {"tag": "p", "text": "At some point all Acolytes went through training here, seeking to become an apprentice to a Sith Lord or Darth, the typically brutal trials increased, often becoming trials where only one out of numerous Acolytes could possibly survive, the death count was astronomical."}, {"tag": "p", "text": "The long practice of murder and betrayal among Sith had become illegal among Acolytes, even punishable by death, this did not mean such things did not take place though, as Acolytes would typically lay traps and ambushes in the tombs or caverns to remove challengers and potential threats, often placing blame on the beasts and crazed denizens of those same tombs."}, {"tag": "p", "text": "Eventually the Sith Empire had become desperate in their search to replace those lost on the battlefield, allowing Force-sensitive slaves, captured Jedi and even aliens the opportunity to become acolytes and possibly join the Sith, becoming an apprentice."}, {"tag": "p", "text": "At some point, two powerful beings, the Unidentified Sith Warrior and the ancient Sith Lord Kallig's descendant came to Korriban, though possibly not at the same time, and definitely not under the same circumstances, they would both pass their trials at exceptional speeds and become fully fledged Sith apprentices. They would then change galactic history, with one gaining a seat on the Dark Council and the other gaining the title of Emperor's Wrath."}, {"tag": "p", "text": "Some of the Imperial soldiers stationed there were corrupted by the planet's dark energies and went psychotic, attacking their own comrades or everyone else that wasn't equally corrupted."}, {"tag": "h3", "text": "Galactic War"}, {"tag": "p", "text": "Soon a new war began between the Republic and the Sith Empire. In 3637 BBY, the Republic invaded Korriban and held the Sith Academy for a short time. The attack was planned by Colonel Rian Darok and SIS Agent Theron Shan. However Darok was secretly a member of the Order of Revan, and the attack was merely a means for the Revanites to obtain Rakatan technology from the Academy. A simultaneous attack on Tython was perpetrated by Darok's secret ally, the Dark Councilor Darth Arkous."}, {"tag": "p", "text": "At some point during the Rise of the Eternal Empire, Korriban's many temples were reduced to rubble from bombardment by the Zakuul Fleet for the Sith's unwillingness to bend the knee. Though it would be later rebuilt, many ancient artifacts were left buried beneath the sands."}, {"tag": "h3", "text": "New Sith Wars"}, {"tag": "p", "text": "After capturing Korriban from the Republic in a brutal battle, the Brotherhood of Darkness operated a Sith Academy on the planet. Trainees from the Sith Academy were highly regarded for their potential; those who graduated were reputed as the most powerful Sith Lords amongst the Brotherhood. Such apprentices included a young Darth Bane, who went on to become a Dark Lord of the Sith."}, {"tag": "h3", "text": "Clone Wars and the Galactic Empire"}, {"tag": "p", "text": "In 24 BBY, a Sith Cultist by the name of Granta Omega tried to contact the remaining Sith Lord (or lords) in the galaxy. Although he did meet with the unknown Sith, Omega was killed by Obi-Wan Kenobi, though not before Omega killed Darra Thel-Tanis."}, {"tag": "p", "text": "The world remained desolate until it was taken over by the Commerce Guild just prior to the Clone Wars, c. 24 BBY. Other than Guild employees, the planet was mostly inhabited by those who were unfortunate enough to end up on Korriban and have no way offworld. Eeth Koth led a Republic force to Korriban during the early stages of the war, and the battle cost the lives of many Clone troopers."}, {"tag": "p", "text": "At some point in the Clone Wars, fallen Jedi Quinlan Vos and Tol Skorr were racing to find Darth Andeddu's holocron for Count Dooku. Vos won by allowing a Tuk'ata to scare Skorr off. As a reward, Count Dooku gave Andeddu's lightsaber crystal to Vos."}, {"tag": "p", "text": "At some point near the end of the Clone Wars, Jedi Master Yoda was sent on a mission to Korriban, now alternatively known as Moraband, by the spirit of Qui-Gon Jinn to finish the work he had started and discover the purpose of life. While there, the dark side was used by Sith Lords Darth Sidious and Darth Tyranus to try to \"break\" Yoda and make the Grand Master turn to the dark side. They placed in front of him many visions, among them a demonic version of himself, symbiotic illusions of Order 66, the deaths of Jedi Mace Windu and Ahsoka Tano, the actual ghost of Darth Bane, and a cliffhanger duel with the two Sith alongside Anakin Skywalker. Although the experience was harrowing for him, Yoda was able to go to all that was laid out in front of him."}, {"tag": "p", "text": "After the Clone Wars and the Great Jedi Purge, former Jedi turned bounty hunter, A'Sharad Hett was pursuing his bounty Resk on Korriban. After beheading him, Hett was called by the spirit of the ancient Sith Lord, XoXaan, who taught him the secrets of the ancient Sith."}, {"tag": "p", "text": "Shortly after the Battle of Yavin, Palpatine, now Emperor of the Galactic Empire and the ruling Dark Lord of the Sith, visited the tombs of the ancient Sith Lords on Korriban that were still haunted by the ghosts of the long deceased Sith. He wanted to gain further knowledge of the dark side, but his demands only enraged the mummified Sith. Wounded and cowed, he was rescued by Jeng Droga and had to recover from the assault in a bacta tank on Imperial Center."}, {"tag": "p", "text": "During this time, the Zann Consortium had the option of setting up operations on the planet for knowledge.\nDuring a pilgrimage to Korriban shortly before the Battle of Endor, Emperor Palpatine suffered an ambush from the Rebel Alliance's Renegade Squadron. After trapping him in one of the tombs temporarily, and suffering casualties in doing so, the Squadron were able to infiltrate his landing craft and obtain information about the second Death Star, information that would bring about the tyrant's fall."}, {"tag": "p", "text": "A tomb intended for Darth Vader that, after his defection from the Sith before his death, was offered by the Sith spirits to Darth Sidious, was presumably erected sometime during this period. Another burial chamber was built for Naga Sadow thousands of years ago but was never occupied because Sadow died offworld."}, {"tag": "h3", "text": "New Republic"}, {"tag": "p", "text": "At 11 ABY, Palpatine visited the planet once again for the last time, in order to restore his decaying clone body. He conferred with the Sith spirits, who discouraged his decision to try and save his life, offering him a seat among their mummified remains, the tomb-throne reserved for Vader (the Emperor presumably had no tomb prepared for himself on Korriban because he did not intend to ever die)."}, {"tag": "p", "text": "Darth Sidious insisted that he should live, and the deceased Dark Lords informed him that, although his last body could not be saved, he could survive by using fresh Jedi blood, possessing the newborn Anakin Solo. He did not succeed in his attempt to do so, and lost his final clone body on Onderon shortly after."}, {"tag": "p", "text": "Later, in 14 ABY a cult known as the Disciples of Ragnos arrived on Korriban under the leadership of the Dark Jedi Tavion Axmis of the Empire Reborn, hoping to resurrect the ancient Sith Lord Marka Ragnos. However, their plans were being slowly uncovered by several Jedi, most notably by Luke Skywalker, Kyle Katarn, and his two students: Jaden Korr and Rosh Penin. Eventually, the trails led the Jedi to Korriban. One of the greatest Jedi battles of the time, the Battle of Korriban concluded when Jaden Korr defeated Marka Ragnos's spirit in Tavion's body. Following Axmis' defeat, Imperial support was withdrawn and the Disciples crumbled."}, {"tag": "p", "text": "Years later, Hett finally emerged from his long tutelage under XoXaan, intent on defeating Sidious and Vader, only to learn that they had been defeated and dead. Realizing he went through all that for nothing, he escaped into the Unknown Regions, determined to lose himself, where he met the Yuuzhan Vong."}, {"tag": "p", "text": "The New Jedi Order also revisited the planet on other occasions. At one time, Luke Skywalker sent some Jedi Academy researchers to Korriban, where they discovered the logs of the Jynni's Virtue. The time codes on the log indicated it was recorded just before the Battle of Yavin, however they were found sealed in a 7,000 -year-ld tomb."}, {"tag": "h3", "text": "Rule of the One Sith"}, {"tag": "p", "text": "Korriban was apparently untouched by the Yuuzhan Vong War, as Darth Krayt and his One Sith used it as their headquarters starting around 30 ABY. Until 127 ABY, they remained relatively hidden, acting behind the shadows like Palpatine did."}, {"tag": "p", "text": "In 40 ABY Alema Rar went to Korriban to train under the Sith in order to help Darth Caedus focus himself after the death of Lumiya. Alema Rar met the Sith where after some persuasion was allowed to stay for a little while. Alema trained there and received Darth Vectivus's holocron filled with useless data to give to Jacen. They did not believe Jacen was essential to their plan and ultimately believed he would fail as he was not strong enough. Alema disagreed and believed these Sith were hiding while Caedus, a true Sith, took hold of the galaxy. The next year, Kell Douro, an Anzat spy working for the One Sith, traveled to Korriban and met up with Darth Wyyrlok."}, {"tag": "p", "text": "Some years before 44 ABY, Luke Skywalker had all navigation data about Korriban banned from Jedi computers, and had asked the Galactic Alliance to do the same. Despite this, enough information was found in ancient, locked-up records, allowing Luke, Ben Skywalker, Jaina Solo, and Vestara Khai to get to Korriban while looking for the Lost Tribe of Sith."}, {"tag": "p", "text": "In 137 ABY, Krayt returned to Korriban to demand to the ancient Sith Lords, Darth Nihilus, Darth Andeddu and Darth Bane to give him the teachings to heal him or at least slow down the Vong growths on his body, but the ghosts refused to give him aid. Their magic caused the Vong armor he wore to make him into a creature much like his namesake. The current Dark Lord refused to accept his destiny and dispelled the magic."}, {"tag": "p", "text": "Months later, when Krayt was defeated on Had Abbadon and assassinated by Darth Wyyrlok, his body was entombed within the ancient Temple of XoXaan, kept in a stasis chamber so that the other Sith wouldn't suspect their master's demise. At the same time, Marasiah Fel was abducted and taken prisoner at the planet and Darth Maladi sent Darth Nihl to the planet to verify if Darth Krayt was still alive or if he was dead. The two Sith Lords had become disillusioned with Darth Wyyrlok's handling of the Order and the Empire."}, {"tag": "p", "text": "Following the final death of Darth Krayt at the Battle of Coruscant and the subsequent collapse of Krayt's Empire, all of the Sith troopers housed on Korriban went berserk and attempted to kill everyone around them. Those Sith that could, fled; those who could not were slain."}, {"tag": "h2", "text": "Fauna"}, {"tag": "p", "text": "Due to the planet's harsh terrain, and the power of the dark side, Korriban's native fauna was both vicious and cunning, such as the fierce terentateks. The bat-like shyracks lived in great numbers in caves on the planet. Tuk'ata, sometimes called Sith hounds were also fairly common, particularly in the Valley of the Dark Lords. Dark side dragons, or Hssiss, could be found on Korriban, though as semi-aquatic creatures, they were quite rare. Wraids were also found on Korriban. There is evidence that, at one point, the planet was home to an ape or primate-like species, although by the time of Naga Sadow the species was long extinct. Though it is possible that the primate-like species was somehow connected to the Sith species, no conclusive link between this species and the Sith species was known. The highly venomous pelko bug was an insect native to the planet—its venom had a potent numbing effect and was used in Sith training sabers by the Brotherhood of Darkness during the end of the New Sith War. By the time of the Cold War, K'lor'slugs could also be found on Korriban."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Valley of the Dark Lords was a valley and burial ground of Korriban's Sith Lords. Originally constructed by the planet's natives as a burial ground for their kings; the Exiles of the Jedi Order who came to be known as the Dark Lord of the Sith added their own tombs to the Valley. Along with several prominent tombs, the Valley was home to the ancient Sith Great Temple and Lord Khreusis's Stronghold which would loom over the Valley for several millennia."}, {"tag": "h3", "text": "Sith Academy"}, {"tag": "p", "text": "The Sith Academy was a facility in use since the Jedi Civil War, dedicated to training Force sensitives in the ways of the Sith, and running archaeological projects in the Valley of the Dark Lords."}, {"tag": "h3", "text": "Korriban Arrival Port"}, {"tag": "p", "text": "The Korriban Arrival Port was the main spaceport of Korriban during the Cold War. It was near the Academy and the Valley of the Dark Lords and was mostly used for shuttles to drop potential acolytes who were then taken to the Academy. There, their respective training overseers would meet and brief them on the basics of Sith training."}, {"tag": "h3", "text": "Valley of Golg"}, {"tag": "p", "text": "The Valley of Golg was one of many burial valleys constructed on Korriban by the ancient Sith Empire. It was located near the planet's equator."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Korriban first appeared in Tales of the Jedi – Dark Lords of the Sith 2. The name of the planet was conceived by Kevin J. Anderson."}, {"tag": "p", "text": "Though Ziost was established as the original Sith homeworld in Star Wars: Tales of the Jedi — The Golden Age of the Sith, many sources described Korriban as the Sith homeworld. It was the \"public\" capital world of the Sith Empire during the era of Darth Revan, but was a mausoleum-world for millennia beforehand and would return to such a state not long after."}, {"tag": "p", "text": "The controversy was put to rest in the article Evil Never Dies: The Sith Dynasties by Abel G. Peña, which clearly established the Sith originating on Korriban and relocating the capital to Ziost before the arrival of the Dark Jedi exiles during the Hundred-Year Darkness, though the Dark Jedi exiles themselves landed on Korriban."}, {"tag": "p", "text": "In Star Wars: The Force Unleashed, entering the word \"KORRIBAN\" in the \"Input Code\" section unlocks the Sith stalker armor."}, {"tag": "p", "text": "Korriban appears in the final episodes of Star Wars: The Clone Wars. George Lucas preferred the name \"Moraband\" to Korriban during story development, leading the episode \"Sacrifice\" to refer to the planet as Moraband. The episode guide's trivia gallery clarified the issue, stating that Korriban has had multiple names throughout its history, suggesting that both names are equally as valid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}