{"url": "Apailana/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Females", "Category:Humans", "Category:Monarchs of Naboo"], "nodes": [{"tag": "h1", "text": "Apailana"}, {"tag": "p", "text": "Apailana was a Human female who served as the successor to Neeyutnee as Queen of Naboo. In a similar fashion to the previous monarchs, she was formally styled Her Royal Highness, Queen Apailana of Naboo during her two-year reign."}, {"tag": "p", "text": "Apailana was assassinated in 18 BBY by the Galactic Empire after it was revealed that she was harboring Jedi fugitives of Order 66 on Naboo."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (32–19 BBY)"}, {"tag": "p", "text": "Apailana was a female Human from the Mid Rim planet of Naboo. She was one of the youngest monarchs ever elected on the peaceful world, succeeding Queen Neeyutnee at the tender age of twelve, following the latter's two-year term. She greatly revered Padmé Amidala and Jamillia, and aspired to be as good a ruler as her predecessors. Amidala, now a Senator, supported Apailana's bid for the throne."}, {"tag": "p", "text": "In 19 BBY, shortly after the end of the Clone Wars, the thirteen-year-old Queen was one of the chief mourners at Amidala's funeral, wearing a chersilk mourning robe and a Shiraya fan headdress in tribute to Amidala. The headdress was last worn by Jamillia."}, {"tag": "p", "text": "When Palpatine declared himself Galactic Emperor, Apailana made outward pretenses of loyalty, but secretly harbored doubts about the new regime. Throughout her reign, government buildings and organizations on Naboo continued to refer to the Republic, not the newly-formed Empire."}, {"tag": "p", "text": "At some point, Apailana accompanied Senator Jar Jar Binks on a state visit to the Core World planet of Grizmallt. Naboo was colonized around 3900 BBY by an expedition sponsored by the then Queen of Grizmallt, Elsinoré den Tasia."}, {"tag": "p", "text": "Although respectful of Naboo tradition in not ordering an investigation into Amidala's death, she privately disagreed with the official word from the Empire, which stated that Amidala had been killed at the hands of the Jedi. Apailana then made it known to her inner council that should any Jedi who survived Order 66 be found on Naboo, they would be welcome to remain there. One such Jedi, Ferus Olin, convinced her to shut down Naboo's comm systems and team with Boss Rugor Nass in an attack on the Imperial headquarters on Naboo."}, {"tag": "h3", "text": "Assassination (18 BBY)"}, {"tag": "p", "text": "This attack would prove Apailana's undoing, for soon after, rumors began to circulate that she was indeed harboring Jedi fugitives. Darth Vader, acting on this information, sent the 501st Legion to Naboo with orders to kill the Queen and bring the planet back in line. The 501st uncovered her, but her prepared security guards were able to put up a substantial fight against the 501st stormtroopers. With support from an autoturret grid, the small skirmish was prolonged and turned into a full-scale battle."}, {"tag": "p", "text": "Shortly after the destruction of the autoturret grid's console and the death of many Naboo guards, Apailana appeared, armed with a pistol. Also escaping with the Queen was a group of runaway Jedi who were acting as Apailana's personal bodyguards. Their attack was also meant to cover the Queen's escape as she fled the city."}, {"tag": "p", "text": "However, the 501st proved too powerful for the Queen's Jedi protectors. A scout trooper quickly shot the Queen with his sniper rifle right outside the Royal Palace. To add to the tragedy, none of the Jedi she was hiding survived, some dying protecting the Queen during the battle, and the rest being hunted and gunned down by Imperials after her death."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Shortly thereafter, Kylantha, who appeared—at least on the surface—more accepting of the Empire's control, was elected Queen of Naboo, a position she still held during the early years of the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Apailana first appeared in Star Wars: Episode III Revenge of the Sith, released on May 19, 2005. She was portrayed by Keisha Castle-Hughes, a young Oscar-nominated actress from New Zealand. Castle-Hughes spent seven hours in make-up for her role in Revenge of the Sith and filmed her scene in only one day.[source?] The name Apailana name is similar to \"Pai\" Apirana, Castle-Hughes' character in the 2004 film Whale Rider."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}