{"url": "Korsinite_League", "categories": ["Category:Legends articles", "Category:Sith political factions"], "nodes": [{"tag": "h1", "text": "Korsinite League"}, {"tag": "p", "text": "The Korsinite League was a political faction of the Lost Tribe of Sith on Kesh which existed during the period of turmoil known as the Time of the Rot. Korsinites revered the Tribe's founder and first Grand Lord Yaru Korsin and his daughter Nida Korsin as deities and sought to model their entire lives after them. They regarded the Testament of Yaru Korsin as a sacred text and viewed their opponents as \"heretics\" and defilers\" who were defiling the Tribe, the body of Yaru, and thus deserved to be exterminated. By 3000 BBY, the Korsinite League had come under the leadership of Korsin Bentado, who later attended that fateful year's Pantheon's Peace. During that Testament Day, the leaders of the Sith factions learnt that the Tribe's ancestors had actually been slaves of the Sith Lord Naga Sadow and were in fact not \"special.\" The revelations of the Tribe's \"inglorious past\" triggered a series of violent riots known as the Great Crisis, which saw the various factions fight each other before disintegrating as individual Sith fought each other."}, {"tag": "p", "text": "Later, Korsin joined forces with several of his former opponents including the Golden Destiny mathematician Edell Vrai and the Force 57 leader Neera to destroy the Omen, the ancient Sith starship which had brought the Tribe's ancestors to Kesh, in order to purge the last remnant of the Tribe's inglorious past. However, the Caretaker and historian Varner Hilts stopped the Sith from carrying out their plan by revealing a map which revealed the existence of another continent called Alanciar. As a result, the Sith factions stopped fighting and elected Hilts as their new Grand Lord, ending the Time of the Rot. Bentado and his fellow Korsinites also submitted to Hilts who they respected for redeeming their faith in Korsin. During the Hilts Restoration, Bentado rose to the position of High Lord while many of his followers entered joined the Ebon Fleet, a fleet of airships that was used to invade Alanciar."}, {"tag": "h2", "text": "Beliefs and teachings"}, {"tag": "p", "text": "The Korsinite League believed that the Lost Tribe of Sith's founder Yaru Korsin and his daughter Nida Korsin were living gods, and adored them. They believed that the first Grand Lord came from beyond, that the Tribe itself was the body of the leader. In addition, Korsinites also believed that anyone who would imperil the body deserved neither mercy nor life. They also regarded the Testament of Yaru Korsin as a sacred text which outlined the power structure of the Tribe and had to be followed to the \"letter of the law.\" As a result, Korsinites regarded Testament Day, a holiday held every twenty-five years to commemorate the legacy of Korsin, as a \"grand and celestial time\" which celebrated the lives of Yaru and Nida. Due to their rigid and dogmatic adherence to tradition, the Korsinites were unwilling to accept a public reading of the Testament on any day besides the designated anniversary."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "The Korsinite League was founded by a former slave, a century before 3000 BBY. He took Korsin as a title for himself, separate from the hierarchy of Lords, and patterned his life after those led by the first Grand Lord Yaru Korsin and his successor daughter Nida Korsin. This individual also declared that any worthy Sith individual could aspire to a state of \"Korsin-ness\". His followers decided they could also adopt the title for themselves, which the movement's founder opposed, but it continued well after his death. Thus, all members of the cult had Korsin as their fist name and also wore black uniforms. Some even donned uvak-leather garb which resembled those worn by members of the Skyborn Rangers, the Tribe's aerial force which had been founded by Nida Korsin."}, {"tag": "h3", "text": "The Great Crisis"}, {"tag": "p", "text": "By 3000 BBY, there were hundreds of Korsins of both sexes, who would chant mantras and declare their empires of one to anyone they could. According to the Caretaker and historian Varner Hilts, striking a conversation with a member of the Korsinite League was \"to risk death by cognitive dissonance.\" Their rivals during the Time of the Rot included the Sisters of Seelah, Force 57, and the Golden Destiny. On that same year, Korsin Bentado and the League traveled to the Sith capital Tahv after they learnt that Iliana Merko, the leader of the Sisters, was trying to manipulate the Testament of Yaru Korsin prior to Testament Day. During that same Testament Day, the assembled Sith factions discovered an earlier recording beneath Yaru Korsin's Testament which revealed that the early ancestors of the Lost Tribe were actually slaves of the Sith Lord Naga Sadow. This overturned the Tribe's popular mythology that their ancestors had been great conquerors."}, {"tag": "p", "text": "This revelation sparked a series of violent riots and killings known as the Great Crisis, which devastated much of Keshtah Minor. The Korsinite League fought with their rivals before descending into infighting themselves. During the Crisis, Bentado lost his hand to Merko and vowed vengeance against the Sith woman. Later, Bentado joined forces with the surviving members of the Sith factions including the Force 57 leader Neera and Golden Destiny member Edell Vrai to destroy the ancient starship Omen in an attempt to destroy the \"inglorious\" heritage of the Sith. They were stopped by Caretaker Varner Hilts who revealed the existence of a second continent known as Alanciar. Hilts urged the Sith to commit themselves to reaching and conquering this new continent. Hilts was subsequently appointed as Grand Lord by the other Sith factions including the Korsinite League."}, {"tag": "h3", "text": "Conquering Alanciar"}, {"tag": "p", "text": "While many of the various Sith factions were dissolved during the Hilts Restoration, many former members of the Korsinite League still gravitated around Korsin Bentado, who had become a High Lord in Hilt's government. He was designated as the leader of the invasion force that would invade Alanciar. At the behest of Grand Consort Iliana Hilts, Grand Lord Hilts had appointed Bentado as High Lord in order to give the Korsinite leader something to do besides starting cults around Korsin. In addition, the Grand Lord also assigned the Keshiri servant Squab to work with Bentado. In reality, Squab was a spy who was loyal to Iliana. Meanwhile, Edell Vrai was appointed as the chief engineer for developing airships that would allow the Tribe to reach Alanciar. Edell made an agreement with Bentado to only launch the invasion after the former had returned from a scouting mission to Alanciar."}, {"tag": "p", "text": "In 2975 BBY, Edell made contact with the Alanciari but his airships were attacked and shot down by the natives. However, he and five other crew members survived and these succeeded in capturing the Alanciari trawler Mischance, which they used to return to Keshtah. In addition, they also captured two Alanciari: the signal officer Jogan Halder and the Wardmaster Quarra Thayn. Edell's crew returned to Keshtah by ship while he and Quarra embarked on a reconnaissance mission of Alanciar. Despite the Tribe's poor intelligence on Alanciar, Bentado insisted on invading the continent because he believed that Edell had failed since he was a tinkerer and not a warrior. Hilts reluctantly allowed Bentado and his invasion force the Ebon Fleet, which contained sixty airships, to depart for Alanciar. The Ebon Fleet was staffed by many Korsinite League members but included a large complement of Keshiri servants including Squab, who were loyal to Grand Lord Hilts."}, {"tag": "p", "text": "While Hilts later learnt about the military capabilities of the Alanciari from Edell, he did not share this information with Korsinite League because he intended to annihilate Bentado and his supporters, who he and Iliana viewed as a threat to his rule. As a result, many of the Korsinite League were killed when the Alanciari Keshiri shot down the Tribe's airships with ballistae at the Western Shield. However, Bentado and the crew of his personal dirigible Yaru survived the massacre and managed to escape the battlefield to Sus'mintri, the capital of Alanciar. There, they managed to infiltrate Vaal Hall, the headquarters of the War Cabinet, at night and kill the entire Alanciari government. They also seized control of the building's strategically important signal tower and the \"Worldwatch\", a situation room which controlled all signals and telepathic communications on Alanciar."}, {"tag": "p", "text": "Having realized Alanciar's full military and industrial potential, Bentado then conspired to mutiny against his Grand Lord and create a \"Second Tribe\" on Alanciar. He intended to rule the continent from behind the scenes by using Vaal Hall to command the Alanciari military, semaphore stations, and thoughtcriers. To carry out his plans, he intended to use the Alanciari ballista to shoot down Hilts' flagship Good Omen. However, he was opposed by Edell Vrai, who was loyal to Grand Lord Hilts, and Quarra Thayn, who condemned Bentado for murdering the War Cabinet. Following a brief lightsaber duel with Edell, Bentado was killed by Squab under the orders of Grand Lord Hilts, who had learnt about Bentado's mutiny. Squab then handed command of Vaal Hall over to Edell who then reasserted control over Bentado's men and the signaling devices."}, {"tag": "p", "text": "Following the death of Bentado, the surviving members of the Korsinite League, who had accompanied Bentado to Vaal Hall were disarmed by Edell and the Keshiri servants, including Squab, who had accompanied Bentado. These Keshiri slaves were loyal to Grand Lord Hilts and quickly cooperated with Vrai. Edell was able to force the Korsinites to yield to his authority by threatening to bring all of the Alanciari down upon Vaal Hall if they did not surrender. Edell also communicated a deal from Grand Lord Hilts to the surviving Korsinities. Grand Lord Hilts intended to exile or enslave the defeated Korsinities. Due to their heavy losses at the Western Shield and the death of their leader, the Korsinite League was broken. During a public gathering, Hilts and his new \"ambassador\" Jogan Halder claimed that the Tribe were the benevolent Protectors, gods in Keshiri religion. Meanwhile, Bentado and the Korsinite League were depicted as \"servants of the Destructors\" who had been expelled from the Tribe for their troublesome ways. Following the unification of Alanciar and Keshtah, the surviving Korsinite League supporters were taken into custody and enslaved by Hilt's forces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}