{"url": "Korus", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Educators", "Category:Humans", "Category:Krath", "Category:Males", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Korus"}, {"tag": "p", "text": "Korus was a Human male citizen of the Empress Teta system who served as the royal tutor of Satal and Aleema Keto, heirs to the Tetan throne. Continually berated by the young Ketos, Korus acted as a spy for Satal's father, Lord Keto, secretly reporting on the activities of his son and niece. When Korus' eavesdropping was discovered by Satal and Aleema, who had since formed a Sith cult known as the Krath, they used their newfound dark side powers to make him believe that his tongue was transformed into an Adegan eel."}, {"tag": "p", "text": "In 3997 BBY, a mutilated Korus accompanied the Krath when they stormed the Tetan carbonite smelter that orbited Empress Teta and proclaimed themselves the new rulers of the Tetan worlds. He was then forced to reveal his oral deformity before falling comatose and was the only Tetan official to survive the ensuing massacre. Korus was later made to serve the Krath, who had also maimed him further by sewing his mouth closed. After an innocent mistake that resulted in the soiling of Aleema's gown, Korus was killed—burned alive with Sith magic."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Royal tutor"}, {"tag": "p", "text": "Korus was a Human male citizen of the Empress Teta star system. He was employed by Lord Keto, Emperor of the Tetan Monarchy, as the tutor of the heirs to the throne—Lord Keto's Force-sensitive son and niece, Satal and Aleema Keto. From their childhood, Korus instructed them in royal tradition as well as basic education. During their time with Korus, the children learned the fairy tale of the Krath, a fabled magician-god whose story stayed with them into their adulthood. As Satal and Aleema grew into adolescence, Lord Keto and his sister Magda came to mistrust their children. As a result, Korus was ordered to spy on them and report on their activities. This spawned contemptuous feelings within Satal and Aleema for Korus, and from that moment on he was regarded as the backstabbing lackey of their parents. Nonetheless, Korus remained true to his mandate on both ends; he continued to oversee the activities of his royal charges, while reporting his findings to their parents."}, {"tag": "h3", "text": "Enter the Krath"}, {"tag": "p", "text": "In 3997 BBY, Korus allowed Aleema and Satal to travel unaccompanied to the Galactic Museum on the Republic capital world of Coruscant. Unbeknownst to him, their trip was borne out of their fascination for the dark side of the Force, and, more specifically, the history of the Dark Lords of the fabled Sith Order. The Ketos discovered Sith magic on their journey and reinvented themselves as the Krath cult, so named after the fairy-tale magician-god of their youth. Korus was present for Satal and Aleema's return, and the Ketos, newly empowered with their Sith abilities, decided to enact their revenge against their royal tutor for conspiring against them with their parents. To prevent Korus from further tattling on them, his tongue was transformed into an Adegan eel by Aleema."}, {"tag": "p", "text": "The Krath had also sought to replace their parents as the governing body of Empress Teta and plotted a political takeover of the entire system. During Lord Keto's annual inspection of the orbiting Tetan Tetan carbonite smelter, Korus was forced to join the Krath as they stormed the space station, acting as their chaperone. He was well aware of the breach of protocol that was the Krath's presence during official matters of state, but he was unable to prevent it. As the Krath approached the gathering of Tetan officials, Korus was demanded by Lord Keto to explain his insubordination. Korus' attempt at a reply brought him to the realization that he had an Adegan eel where his tongue should be, which mortified the Tetans and caused Korus himself to fall into catatonic shock."}, {"tag": "h3", "text": "Fatal mistake"}, {"tag": "p", "text": "Korus regained consciousness to find that Lord and Lady Keto, along with the other Tetan officials and also those of the Carbonite Guild who were present on the orbital smelter, had all been executed by the Krath. With all opposition removed, the Krath claimed dominion over the Empress Teta system. Their base of operations was the Iron Citadel of Cinnagar, where Korus was reduced to waiting on Satal and Aleema hand and foot. For further amusement, Korus' lips were sewn together by Aleema, and he was forced to serve his masters food and drink while acting as the object of their constant ridicule. His servitude did not last long, however. While carrying wine ordered by Satal for dinner, Korus stumbled and dropped the decanter, which broke and splattered the drink all over Aleema's new gown. Before Korus could clean the mess, she lashed out at him with the dark side and burned him alive, much to the amusement of those present. Korus' death was the final one of the old Tetan regime, and his passing solidified the rule of the Sith-inspired Krath."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Korus was an elder man of gray hair and modest proportions, often regarded as fat by Lord Keto and his son. His passive demeanor was a direct contribution to the blatant disrespect shown to him by those around him, evidenced by the contempt repeatedly expressed for Korus by Lord Keto, Satal, and Aleema. The younger Ketos viewed Korus as a two-faced dotard and cast an illusion that replaced his tongue with an Adegan eel to prevent him from further serving as Lord Keto's double-agent. Korus was humiliated when his former students later sewed his mouth shut and forced him to wait on them as a manservant. His life was of no consequence to Aleema, who killed Korus accidentally in a fit of rage, yet expressed no remorse, instead reveling in the manner in which she had done it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Korus' initial appearance was in Tales of the Jedi – Dark Lords of the Sith 1, written by Tom Veitch and Kevin J. Anderson. Korus also appeared in John Whitman's full-cast audio rendition of Veitch's and Anderson's Dark Lords of the Sith. Korus is given no actual speaking lines in either version, as he is introduced in both with his tongue having already been replaced with the Adegan eel. Instead he mumbles as one would with a full mouth, which can be identified in the audio drama."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}