{"url": "Korun/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cleanup", "Category:Force-sensitive species", "Category:Human races", "Category:Korunnai"], "nodes": [{"tag": "h1", "text": "Korun"}, {"tag": "p", "text": "The Korunnai (singular, Korun) were a Human race from the planet Haruun Kal. They were a nomadic \"tribe\" of uplanders (which was the rough translation of \"Korunnai\" into Basic). The Korunnai were born into clans or extended families called Ghôsh. For example, Mace Windu and Kar Vastor were both part of the same group, and thus Dôshalo, clan-brothers, to each other. They fought against the Balawai (downfolk) in the Summertime War and were insultingly called Kornos by these enemies."}, {"tag": "p", "text": "The Korunnai were genetically Human in almost every respect, except that they were all Force-sensitive and used their Force powers to bind akk dogs and grassers to themselves."}, {"tag": "p", "text": "It is said that a Jedi craft crashed on the planet during the Sith War, and the Korun were descendants of Jedi. In addition, the Korunnai also had a higher tolerance to poisons, due to living near the toxic cloudsea that covered the lowlands of the planet. Their term for the Force was the Pelekotan."}, {"tag": "p", "text": "The Korunnai spoke Korunnal, and organized themselves into tribes with many similarities to a family unit. These tribes were known as Ghôsh, one of the most prominent being Ghôsh Windu, the tribe of Kar Vastor and Mace Windu. The Korunnai version of a shrug was to tilt the head a centimeter to the right. Their phrase for nonsense was 'tusker poop'."}, {"tag": "p", "text": "Shortly after the establishment of the Galactic Empire, an Imperial fleet bombarded Haruun Kal; by 40 ABY it was unknown if any Korunnai still lived. However, in 5 ABY at least three Korunnai still existed-Nick Rostu, Lorz Geptun, and Kar Vastor."}, {"tag": "p", "text": "Korunnai measured distance not in length, but in transit time."}, {"tag": "h2", "text": "Culture"}, {"tag": "p", "text": "Korun culture was based on what was known as the Four Pillars: Honor, Duty, Family, Herd. They are ordered in terms of importance. First was Honor, which meant obligation to oneself and required one to be honest, brave, to love without reservation, and to have the utmost integrity. The second pillar, Duty, which meant obligation to others: one must do his or her own job and work hard, obey their elders, and stand by their Ghôsh. The third pillar dealt with one's family. It mandated that one must care for his or her parents, teach their children, and defend their family's blood. The fourth and greatest pillar, Herd, was literal: for it was on the grasser herds that the life of a ghôsh depended. Ghôsh families were more important than duty; duty outweighed honor; but nothing was more important than the herd. If the well-being of the herd required the sacrifice of one's honor, then that person must sacrifice it. Similarly, if it requires a person to shirk his or her duty, the same was expected."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}