{"url": "Kosh_Kurp", "categories": ["Category:Legends articles", "Category:Agents of the Galactic Empire", "Category:Males", "Category:Pantorans"], "nodes": [{"tag": "h1", "text": "Kosh Kurp"}, {"tag": "p", "text": "Kosh Kurp was a male Pantoran who worked as an explosives expert for the Galactic Empire. Having witnessed his families' murder as a child during the riots on his homeworld of Intuci, he vowed to exact revenge on Sonopo Bomoor, the Governor responsible for the massacres. Bomoor's real name was in fact Suppoon and shortly after the massacres he resigned as governor to focus on more illegal activities and becoming a Gaar. Kurp devoted his life to finding Bomoor and in the process became an expert in offensive weaponry. His expertise in weapons was so great that Kurp became a weapons specialist for the Empire and it was in this role he would eventually claim his vengeance."}, {"tag": "p", "text": "Aware of Kurp and Suppoons history, Jabba Desilijic Tiure, a Hutt rival of Suppoon, made a bomb threat before visiting Suppoon for a business ceremony known as a Jubjub. Due to Imperial ties he possessed, Suppoon managed to have Kurp come and check his palace for bombs, of which Kurp found none. The Pantoran remained for the Jubjub, where he watched Jabba and Suppoon attempt to outdo each other in a series of trade deals before Jabba revealed Suppoon's old alias of Bomoor. Realizing who Suppoon was, Kurp revealed his past to the Gaar who fired at the weapons specialist to prevent him attacking. The shot rebounded off Kurp's armor and killed Suppoon, after which Jabba ordered all of the dead criminals men to follow Kurp instead. The thug agreed to follow the Pantoran, making Kurp the head of the criminal empire, a job he gave up his work for the Empire for."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "As a boy, the Pantoran Kosh Kurp grew up living with his family in the city of Bonaka Nueno on the planet Intuci in the Outer Rim Territories. Whilst Kurp dwelt there, a Bah'r Kilido named Suppoon used embezzled credits to bribe the Galactic Republic into giving him control of the planet. Under the alias Sonopo Bomoor, Suppoon became the governor of Intuci and ruled as a tyrant, hoarding Republic resources for himself. The hoarding soon resulted in food shortages across the planet which led to widespread rioting of the populace. Fearing that the riots would draw the attention of the Supreme Chancellor, Suppoon came up with a solution to the food problem—eliminating an entire city to reduce the demand for food. Suppoon picked Kurp's home city for destruction and ordered the troops he controlled to massacre the cities inhabitants, encouraging creativity in cruelty to the citizens. A large number of citizens, including Kurp's entire family, were hung from their heels and left to die in an area known as Bonaka square. Only Kurp himself was spared due to an order from Suppoon, who was presented for the hanging and demanded that the young boy be left alive to witness his greatness."}, {"tag": "p", "text": "After witnessing the massacre of friends and family, Kurp swore never to forget the man who had caused their deaths, the Governor he knew as Sonopo Bomoor. He spent twenty years hunting for the Bah'r Kilido, but was unsuccessful as Suppoon abandoned his alias and Governorship and moved on to control an underground criminal empire. During the hunt Kurp familiarized himself with large amounts of weaponry as to discover the best way to cause Bomoor maximum suffering before killing the criminal. Using this knowledge, the Pantoran managed to obtain a job as a weapon specialist for the Galactic Empire, the successor state to the Republic, despite their strong anti-alien policies. In the year 5 BBY the Hutt criminal Jabba Desilijic Tiure threaten to place a bomb in a palace owned by Suppoon and due to the many Imperial connections the criminal, now a Gaar, still possessed, Kurp was sent to assess the threat, not knowing he was in the home of his most despised enemy."}, {"tag": "p", "text": "With neither Kurp nor Suppoon recognizing one another, the weapons specialist searched the palace and found no bomb. Suppoon then asked that the Pantoran stay for a Jubjub–a business ceremony–that he had planned with Jabba at the palace. Shortly after the Hutt arrived Suppoon introduced him to Kurp, whom Jabba was aware of by reputation. The Gaar and the Hutt then proceeded to deal in a variety of goods as Kurp watched. Both criminals tricked each other a number of times as tensions slowly rose, with Suppoon eventually threatening to kill Jabba if he didn't agree to a deal. Thinking he had come out on top Suppoon was horrified when, as he claimed the goods from the agreement, he was stung by a poisonous Tromonid. Jabba offered him antidote but only in return for all the trade goods involved and warned him that Suppoon couldn't simply kill the Hutt and take the cure as Jabba was holding a grenade which would go off if he loosened his grip. Suppoon agreed and administered the antidote, but then asked that Kurp be allowed to look at the grenade. Kurp obliged and took the grenade but without examining it simply held to his chest, and crouching down to cover it, detonate the device. The explosion caused some damage to the man-o'-war armor that Kurp wore but left him and everyone else unhurt. With the bomb threat removed Suppoon ordered Jabba's men to surrender and for the Hutt to be taken away to be tortured, however Jabba still had one move left against the Gaar."}, {"tag": "p", "text": "As Suppoon told him to detonate the bomb that the Hutt still claimed to have hidden, Jabba called Suppoon by his alias, Sonopo Bomoor. Suppoon was unmoved by Jabba's use of his old identity, but Kurp recognized the name of the man who had killed his family. He began questioning Suppoon, who not realizing the danger he was in, admitted that he was Bomoor and had lead the massacre on Intuci. Eventually unnerved by the ferocity of Kurp's questions, Suppoon asked how Kurp new about the massacre and the weapon's specialist revealed his past to Suppoon. The Gaar, beginning to panic, attempted to rationalize his actions and reason with Kurp but the Pantoran began to advance on the criminal and Suppoon fired at Kurp with his blaster. The weapons specialist did not flinch as the bolts reflected off of the man-o'-war armor back at Suppoon, blowing the Bah'r Kilido's head clean off. As the man he had hunted his entire life collapsed dead, Kurp lamented how quick his death had been and how little he had suffered before Jabba approached the expert. The Hutt revealed that he had known of Kurp's hatred of Bomoor and the Gaar's history and had made the bomb threat knowing the Pantoran would be sent. Kurp had been Jabba's \"bomb\" all along and had killed the criminal just as the Hutt planned."}, {"tag": "p", "text": "In gratitude for his unknowing part in his plot, Jabba ordered all of Suppoons former men to serve Kurp as they had the Gaar, which they agreed to out of fear. With Suppoon's criminal empire now at his control, Kurp resigned his job with the Empire, which his superiors accepted in return for a large cut from the syndicate's profits which was then used to fund the Imperial military."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kosh Kurp was a azure-skinned Pantoran with a muscular build and a jutting chin. Having watched his family killed Kurp was driven by a need for vengeance for much of his life, and it was this that drove him to become an expert in offensives weapons as best to cause Suppoon pain. By 5 BBY his reputation was widely known and his talent was great enough for the Galactic Empire to have overlooked the fact he was an alien and hire him. Whilst at Suppoons palace he witnessed the Gaar and Jabba perform illegal deals and threaten to kill one another but made no move to intervene until a bomb was produced. After causing Suppoons death he became frustrated at how quick the criminals end had been, not involving the prolonged suffering that Kurp had long planned to match the suffering of his family."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his time as a weapons specialist for the Empire, Kurp wore a crimson man-o'-war armor, which was considered rare and was originally of Iskalonian design. The armor included two blunt horns which housed various sensors and wireless devices, and a low lying visor which covered the Pantoran's eyes. He also wore brown boots and gloves."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kosh Kurp first appeared in Jabba the Hutt: The Gaar Suppoon Hit, a comic book released in 1995 written by Jim Woodring and illustrated by Art Wetherell. He later received entries in the 1998 sourcebook the Star Wars Encyclopedia and was mentioned in the 49th issue of The Official Star Wars Fact File in an entry for Jabba. In 2013 Kurp's backstory was explored in Barely Tolerable: Alien Henchmen of the Empire, an article released on the official blog of StarWars.com by Abel G. Peña and Rich Handley."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}