{"url": "Koth_Melan", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Alliance to Restore the Republic members", "Category:Bothans", "Category:Males", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Koth Melan"}, {"tag": "p", "text": "Koth Melan was a male Bothan spymaster and head of the Bothan Spynet during the Galactic Civil War. After the Galactic Empire executed his father in 17 BBY for supposed espionage, Melan was sympathetic to the Alliance to Restore the Republic and sought to help them in order to regain his honor. Posing as an official of the Bothan Trade Mission, Melan conducted operations throughout the galaxy, including dealing with the smuggler Dash Rendar on the planet Corellia. He preferred the role of spymaster, rarely venturing into the field and traveled with a cadre of bodyguards."}, {"tag": "p", "text": "In 3 ABY, his agents caught wind of a new Imperial military project that could pose a threat to the Alliance. He attempted to contact Leia Organa, but his message was instead intercepted by Luke Skywalker and Dash Rendar. This proved to be a stroke of luck for Melan, since data pertinent to the project would be passing through the Both system on the Mobquet medium transport Suprosa. He enlisted Commander Skywalker to train the Bothan pilots of Blue Squadron, and then, aboard Dash Rendar's ship, the Outrider, participated in the raid on the Suprosa. With the data retrieved, Melan directed Skywalker and Rendar to Kothlis, where a team of Bothan slicers could decipher the data. While Melan's team were working on the retrieval, the Kothlis safehouse was attacked by bounty hunters, and in the ensuing gunfight, Melan was shot and killed. Despite Melan's death, the data was ferried to the Alliance by agents allied to Borsk Fey'lya, and it was eventually discovered to be the plans for the Death Star II."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Dishonor"}, {"tag": "p", "text": "Koth Melan was a Bothan male of the prominent Clan Alya hailing from the planet Bothawui. His father was a teacher, who disagreed with the Galactic Empire's ideology and attempted to educate his students about the Empire's nature. In 17 BBY, Melan's father was arrested by the Empire, and executed on charges of espionage. The execution was a blow to Melan's honor, and caused him much disgrace. He stopped using the honorific suffix \"y'lya\" as part of his name, vowing to only honor his clan name once he had helped to cause the downfall of the Empire, and in turn avenge his father's death."}, {"tag": "p", "text": "Melan joined the Bothan Spynet; officially, he was an assistant consul general for the Bothan Trade Mission, and was responsible for overseeing Bothan commercial interests throughout the Mid Rim region. His position was an intricately crafted cover which allowed him to travel extensively without arousing suspicion, passing information from operatives and op-fronts to the relevant interested parties and frequently reporting to his superiors on Bothawui and the colony world Kothlis. While his cover was unbroken, Melan made enemies, and always traveled with a cadre of combat trained bodyguards skilled in counter-intelligence and surveillance operations who posed as minor officials and bureaucrats. At some point, he became the head of the entire Spynet."}, {"tag": "p", "text": "Melan rarely engaged directly in operations, preferring the role of spymaster. He refused to meet with anyone whom he did not wish to see first, and maintained a series of secure safehouses including one which was known only to Melan and his entourage. When Melan did venture into the field, it was a sign that the information he was collecting was very valuable and important. His chief of security was often employed as a double, and reportedly performed a credible imitation of the spymaster."}, {"tag": "h3", "text": "Observing the Alliance"}, {"tag": "p", "text": "During the Galactic Civil War, Melan began to take a keen interest in the Alliance to Restore the Republic's movements, despite the Bothan Spynet's supposed lack of allegiance to any particular government or organization. When Rebel pilot Ace Azzameen, with the help of his family, stealthily planted a listening device at Comm Center to monitor communications between the Empire and the Azzameen's main commercial rivals, the Viraxo, Melan was highly impressed. The spymaster sent Azzameen an e-mail, applauding his abilities, labeling them \"Bothan,\" and awarded him the Bothan Friendship Award, as well as honorary membership of the Bothan Spynet."}, {"tag": "p", "text": "At some point, Melan met with the smuggler Dash Rendar near the Agrilat Swamp Circuit on the planet Corellia. He handed Rendar a datapad with information vital for the Alliance, but noticed that the smuggler was being trailed by an Imperial operative. The operative, in league with the Imperial Security Bureau, was attempting to expose Rendar as a Rebel traitor who was supplying arms and equipment to the Alliance. During the ensuing battle, Melan was wounded and ordered Rendar to flee with the information. The Corellian stopped for a moment, but then made his escape, leaving Melan to surrender to the Imperial. In a few hours, clad in binders, he was transported to Captain Jeffren Brek of the Imperial Security Bureau in the city of Bela Vistal. The datapad, however, found its way into the hands of Alliance member Commander Luke Skywalker when Rendar handed it over to the young Jedi Knight on the planet Tatooine."}, {"tag": "h3", "text": "Investigating Imperial projects"}, {"tag": "p", "text": "Some time later, Melan had regained his freedom, and returned to Bothawui. He lived at Safehouse Besh on the planet, and was accompanied by several security agents when he traveled. On one occasion, while returning home, his security escort found a foreign object on the hatch leading to Safehouse Besh. Concerned that it was an explosive, two of the agents, SecOps Four and SecOps Seven, investigated while SecOps Five remained with Melan. They found that the attachment was merely a flexiplast flyer for Krazy Khzam's Repulsor Lot, although they did test it for contact poisons, electronic devices and sharp edges. With no danger apparent, Melan entered his home where he instructed SecOps Seven to pour him some Gruvian Tovash."}, {"tag": "p", "text": "In 3.5 ABY, Melan's operatives bribed a high-ranking Imperial officer and learned that the Empire had began work on a highly-secret construction project, into which vast amounts of money, materiel, and personnel were being diverted. Melan attempted to infiltrate a slicer droid into the main computer complex on the galactic capital, Coruscant, but the effort met with failure. However, the failure brought to light the fact that information pertaining to the project was being stored on special computers with no remote access. To obtain the data, operatives would have to physically get their hands on the computer."}, {"tag": "p", "text": "Melan's operatives learned that one of the computers containing data relevant to the project was being transferred from Coruscant to Bothawui. The Empire planned to use the Mobquet medium transport Suprosa to make the transfer, disguising it as a fertilizer barge. By utilizing a low-key craft instead of a massive convoy, Melan believed that they hoped to avoid Alliance attention. While Melan's operatives worked to obtain the vessel's flight plan, he attempted to contact Princess Leia Organa of the Alliance, requesting that she meet him in the Intergalactic Trade Mission on Bothawui. Initially believing her to be on Tatooine, he dispatched an AS-M12-series messenger droid to the planet. However, while his message droid was in transit, he learned that Organa was in fact on the planet Rodia, and that Luke Skywalker and Dash Rendar were the likely ones to receive the message. As expected, Skywalker and his bodyguard arrived on Bothawui, seeking Melan. The Bothan allowed the two into his presence, and explained the situation to the two Humans. Skywalker's presence was a stroke of luck; Melan had enlisted the Bothan BTL-S3 Y-wing starfighter pilots of Blue Squadron to help capture the Suprosa, but they were inexperienced and would benefit from the experience of a veteran in command. Skywalker agreed, and Melan took the two to a hidden mountain base to meet with the squadron. Skywalker led the group in training exercises for several days, preparing them to meet the Suprosa in the Both system. However, the squadron was one pilot short, and Ace Azzameen, the Alliance pilot from the Liberty honored by Melan earlier, was chosen to fill the vacant slot by Skywalker himself based on the Liberty's pilot credits listings."}, {"tag": "h3", "text": "Raid on the Suprosa"}, {"tag": "p", "text": "One of Melan's operatives obtained the Suprosa's flight plan from a contact within Black Sun, a large criminal syndicate. The source of the information did not bother the Bothan despite both Skywalker and Rendar's concerns as to its source. Melan believed that Black Sun were backing the Alliance to win the war, and noted that war usually made strange bedfellows. With Melan aboard Dash Rendar's YT-2400 light freighter Outrider, Skywalker led Blue Squadron to one of Bothawui's moons to await the arrival of the Suprosa. As the freighter decanted from hyperspace, Skywalker ordered the Suprosa to surrender, which was met with the claim that the ship was hauling fertilizer. Eventually, the Suprosa attempted to flee, and Skywalker, Rendar, and Blue Squadron engaged the craft, attempting to slow its flight. The freighter unveiled concealed weapons, and battle commenced; two Bothan Y-wings were destroyed by defensive fire, while four craft were eliminated by a single diamond boron missile that Rendar was unable to destroy before it exploded in their midst. Eventually, the Suprosa was disabled, and Rendar boarded first, clearing the Imperial presence before Melan and a group of his operatives retrieved the computer."}, {"tag": "p", "text": "Skywalker rendezvoused with them aboard the Outrider, and Melan explained that he would be unable to access the data as it was undoubtedly encrypted and rigged with a self-destruct mechanism. His best slicer team was on Kothlis, a Bothan colony a few light-years distant. The group left the Both system for Kothlis, but en route they were pulled out of hyperspace by the Immobilizer 418 cruiser Claw, escorted by the Victory I-class Star Destroyer Hunter. While Skywalker and Rendar engaged the starfighters deployed by the Hunter, Azzameen led the remnants of Blue Squadron against the Claw, collapsing its shields and forcing it to withdraw. With the interdiction field down, the group was free to continue to Kothlis where Rendar dropped Melan and his team off on the Kothlis II space station before departing for Rodia to update Princess Organa on the situation."}, {"tag": "p", "text": "Melan met with Skywalker on the surface of Kothlis, escorting him to a safehouse on the outskirts of the city where his team were working on decrypting the computer. The safe house, disguised as a row of storage units and dilapidated offices, was a highly modern installation filled with the latest computer technology. As Melan and Skywalker watched, one of the Bothan slicers found some interesting information in Sector Tarp-Hard-Xenon. Before Melan could find out what the excitement was about, the door to the installation was blown inwards, followed by individuals firing blasters."}, {"tag": "h3", "text": "Death and legacy"}, {"tag": "p", "text": "A team of bounty hunters led by the Barabel Skahtul and the Kajain'sa'Nikto Calliose invaded the safehouse, intent on claiming a bounty on Skywalker's head. During the confusion, several of the Bothan slicers were gunned down, while Melan, armed with a hold-out blaster, and Skywalker attempted to hold off the attack. Believing that the attackers were after the computer, he urged Skywalker to retreat further into the complex. One of the slicers pulled the computer from the slicing equipment, and Melan ordered him to run for it while they covered him. The slicer escaped through an unmarked emergency exit just as Melan's blaster ran out of shots. Ordering Skywalker to run, the Jedi was about to when Melan was hit by a blaster bolt. Despite the Bothan's demands to leave him, Skywalker stayed and defended the spymaster. As the wounded Melan lay on the ground, he caught the attention of one of his bodyguards, SecOps Four. SecOps Four, who had been charged with Melan's safety, had failed his duty. However, Melan looked at him not in disappointment, but in hope. SecOps Four understood, and grabbed a case containing stolen Imperial data and fled down the escape corridor. Melan died shortly after, and Skywalker was captured by the bounty hunters."}, {"tag": "p", "text": "Skywalker eventually managed to escape from the bounty hunters, and the information ended up in the hands of the Alliance by way of Borsk Fey'lya's group of Bothan spies, despite an attempt by the Empire to retrieve the information, and the Alliance learned the Empire was constructing a second Death Star in orbit of Endor. However, the attack at Kothlis was part of an elaborate ruse perpetrated by Emperor Palpatine, who wanted the Alliance to learn the location of the construction site of the second Death Star so that he could draw them into a trap. Melan's funeral was held on Bothawui; pilots from the Liberty were granted permission to attend but only if they were already on leave at the time."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Koth Melan was a short brown-furred Bothan with black eyes. A proud individual, he had the utmost faith in the abilities of his Spynet and liked to keep abreast of the movements of important political figures, usually knowing where any one of them was at any given time. Though he lacked technical expertise, he made sure to employ a broad range of sentients with the requisite technical skills. Melan had no qualms with dealing with criminal organizations such as Black Sun, as long as it was all in the pursuit of defeating the Empire."}, {"tag": "p", "text": "Melan had a strict adherence to Bothan culture, subjecting himself to the harsh laws of honor. He suffered the consequences of his father's death by styling his name in a fashion foreign to Bothans. Though he stood to gain considerably more by remaining a neutral party in the Galactic Civil War, he hoped his siding with the Alliance would help him in the pursuit of honor. In Bothese, Melan's given name meant \"philosophical.\" His family name translated as \"moon,\" or \"night.\""}, {"tag": "p", "text": "An adept spymaster, Melan was well informed and knowledgeable about other alien species, their cultures and languages, and planetary star systems. As the head of a Spynet op-front, and the official assistant consul general of the Bothan Trade Mission, Melan was well versed in bureaucratic protocol for both organizations, as well as Clan Alya itself. The spymaster also knew about general law enforcement procedures, business and the value of items. As part of his duties involved dealing with criminals or fugitives from the law, Melan had contacts in the underworld and was trained in survival techniques."}, {"tag": "p", "text": "In his role as a spy, Melan was sometimes required to intimidate, bargain with, persuade or con other individuals into revealing their secrets, skills which he displayed a degree of skill in. He was a shrewd investigator, could be stealthy when the need arose, and was an adept pick pocket and forger. Although he admitted that computer programming and slicing was beyond knowledge range, Melan was trained in general computer programming and skills, as well as droid programming. He could also competently operate communications, security, and sensor systems, and drive repulsorlift vehicles. He was trained in the use of a blaster, and carried a long-barreled hold-out pistol affixed to his waist and right leg. Melan could defend himself in unarmed combat, and apply first aid if needed. He generally carried a datapad and comlink."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Koth Melan first appeared in the 1996 Shadows of the Empire novel, written by Steve Perry. The novel was a part of the Star Wars: Shadows of the Empire multimedia project, and Melan was featured in other media adaptations of the Shadows of the Empire storyline. The same year, Melan's background was detailed in West End Games's Shadows of the Empire Sourcebook. Melan would later appear in the 1999 video game Star Wars: X-Wing Alliance, which crosses over with the events from Shadows of the Empire. In X-Wing Alliance, he is voiced by Denny Delk, though Delk was simply credited as \"Bothan Officer.\""}, {"tag": "p", "text": "Melan was depicted on several cards in Topps' Shadows of the Empire trading card series. The artists who illustrated the cards, Greg and Tim Hildebrandt, had a live model pose for Melan's action shots. His alien look was based on a mask of Lon Chaney, Jr.'s \"Wolf Man\" character, and a sketch by Michael Butkus provided by Lucasfilm which was also used in the concurrent Shadows of the Empire Sourcebook."}, {"tag": "p", "text": "In 2003, the 61st issue of The Official Star Wars Fact File mentioned Melan in its entry on messenger droids, using an image that was originally of a generic Bothan spy on a card in Decipher, Inc.'s 1998 Special Edition Limited release for the Star Wars Customizable Card Game to represent Melan. This effectively retconned Melan as appearing in the 1998 card expansion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}