{"url": "Kothlis_II", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles with conflicting sources", "Category:Alliance to Restore the Republic space stations", "Category:Kothlis system", "Category:Mid Rim space stations", "Category:New Republic space stations", "Category:Orbital stations"], "nodes": [{"tag": "h1", "text": "Kothlis II"}, {"tag": "p", "text": "A Rebel Platform in orbit above the planet Kothlis, Kothlis II served as the Rebel Alliance's outpost in the system. The platform was defended by a Golan space defense platform called Sentinel and a squadron of starfighters."}, {"tag": "p", "text": "After the Rebels succeeded in capturing a secret Imperial supercomputer being transported on the freighter Suprosa from Coruscant to Bothawui, the computer was taken to Kothlis for decoding. The Imperials were able to track it, however, and Darth Vader was dispatched to Kothlis by the Emperor, personally, to capture Luke Skywalker, who was being held prisoner on the planet by a group of bounty hunters, as well as to make it seem as if the Empire was genuinely concerned with the loss of the computer. The Executor, along with the Imperial II-class Star Destroyer Avenger appeared in system to portray the ruse."}, {"tag": "p", "text": "Resulting was the Battle of Kothlis, in which both Kothlis II and the Sentinel were destroyed in the attack, though the supercomputer was secured and delivered to Alliance High Command, who later determined it to be holding the secret plans to the Second Death Star, still under construction over the Forest Moon of Endor."}, {"tag": "p", "text": "However, by 25 ABY, the station had apparently been rebuilt, and housed Kyp's Dozen in the time prior to the Battle of Fondor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: TIE Fighter the protaganist Maarek Stele was sent by Darth Vader in the Garrett to capture a XQ5 platform that was called Kothlis II. This platform was defended by Rebel starfighters piloted by Bothans and the computer was transferred to an Assassin-class corvette called Timoth 4 rather than the Razor. In that game, the station is captured and not destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}