{"url": "Apatros_(colony)", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Settlements"], "nodes": [{"tag": "h1", "text": "Apatros  (colony)"}, {"tag": "p", "text": "Apatros was the only colony on the Outer Rim mining world of the same name. The colony was controlled by the Outer Rim Oreworks Company, which mined cortosis on the planet, and was used to house miners. The colony only contained two unique buildings—the ORO Market and Groshik's cantina. Apatros was the home of a miner named Dessel, who would eventually become the Dark Lord of the Sith Darth Bane."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The colony of Apatros was the only settlement on the Outer Rim planet of Apatros, and was governed by the Outer Rim Oreworks Company. Apatros was mostly a ramshackle town of temporary barracks made of durasteel put together by Outer Rim Oreworks to house the several hundred cortosis miners who worked on the planet. Among the miners, Apatros was commonly referred to as \"the muck-huts\". The domiciles themselves were in poor condition, as the windows, doors, and roofs were perpetually broken and a layer of dust covered the floors. Also, entire families were often forced to live in a single room. The colony and the cortosis mines were connected by a shuttle that went back and forth between the two locations."}, {"tag": "p", "text": "Apatros was less than a kilometer on each square side, making it possible to walk from any given building to any other structure in less than twenty standard minutes. Although all the buildings in Apatros were identical, navigating the streets was easy, as the barracks were placed in straight rows and columns. This formed a grid of streets between the uniformly spaced buildings. The streets were cleaned just enough by Outer Rim Oreworks to keep conditions sanitary, but were always cluttered with junk. Apatros only had two buildings that were dissimilar to the other structures—a market, and Groshik's cantina, which lay a few hundred meters beyond the edge of the town."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Apatros was established by Outer Rim Oreworks to house the cortosis miners who worked on the planet. In the year 1003 BBY, a resident of Apatros and cortosis miner named Dessel got in a fight in the Apatros streets with three crew members of a Galactic Republic ship over a game of sabacc, killing one of them. With the help of a Neimoidian bartender named Groshik, Dessel was able to escape arrest and join the Sith army in the New Sith Wars against the Republic. After serving with distinction, his Force-sensitivity was discovered, and he eventually became Darth Bane, one of the most important and influential Dark Lords of the Sith in galactic history."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Apatros was mostly inhabited by miners working in the cortosis mines, the majority of which were Humans. However, other species lived in the colony, including a Neimoidian named Groshik, who owned a cantina there. The most famous of Apatros' inhabitants was Dessel, who worked in the cortosis mines for years before leaving Apatros and becoming a Dark Lord of the Sith."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Apatros only had two distinct buildings: the general store and Groshik's cantina. The general store, once a barracks, was controlled by Outer Rim Oreworks and sold basic items to miners at high prices. Groshik's cantina was the main hangout of off-duty miners, and was located several hundred meters from the colony. It was operated by the Neimoidian bartender Groshik, and also contained an Outer Rim Oreworks-controlled gambling room."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Apatros colony made its first appearance in Drew Karpyshyn's 2006 novel, Darth Bane: Path of Destruction, the first volume of the Darth Bane Trilogy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}