{"url": "Apelben_Werl", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Admirals and generals", "Category:Females", "Category:Humans", "Category:Planetary leaders"], "nodes": [{"tag": "h1", "text": "Apelben Werl"}, {"tag": "p", "text": "Admiral Apelben Werl was in charge of the Vannix space fleet. She was an old female Human with a jagged scar zigzagging across her forehead. She became Presider of Vannix with the assistance of Leia Organa Solo in 27 ABY."}, {"tag": "p", "text": "Vannix was experiencing a power vacuum after the previous Presider, Sakins, fled the planet with his family, mistresses, and most of the treasury. An election was held to fill the vacant position, between Admiral Werl and Vannix's Senate representative, Addath Gadan. Admiral Werl ran on a policy of resistance to the Yuuzhan Vong, while Senator Gadan favored cooperation and appeasement."}, {"tag": "p", "text": "Leia Organa Solo visited the planet to set up a resistance movement after the fall of Coruscant. Admiral Werl was behind in the polls at time of Leia's arrival and desperately needed Leia's public show of support. The Admiral had little to offer the Solos in a material sense, but nevertheless offered to supply them with some of Vannix's aquatic vehicles. Leia, however, had already chosen to work behind the scenes to shift public opinion in favor of Admiral Werl, strictly for her pro-defense stance."}, {"tag": "p", "text": "Leia planted a recording in R2-D2 and then took him in for repairs, in such a way so that the recording would be sure to fall into the hands of Gadan's political operatives. The recording strongly implied that a backroom deal had been made between Leia and Werl, promising starships for the war effort in exchange for political support. In Gadan's eagerness to outbid Werl's purported bribe, she exposed a counter-bribe of her own in front of holojournalist Fasald Ghem. Rather than endure the scandal, she followed former Presider Sakins into self-imposed exile."}, {"tag": "p", "text": "Admiral Werl went on to become Presider, though Leia's trust in Werl was not so complete as to include her as part of the resistance movement. Instead, Leia used the aquatic vehicles Werl had offered as mobile rebel bases to train operatives to fight an insurgency against the coming Yuuzhan Vong conquest."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}