{"url": "Krag_(Zorbian)", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Humans", "Category:Males", "Category:Pirates"], "nodes": [{"tag": "h1", "text": "Krag  (Zorbian)"}, {"tag": "p", "text": "Krag was a captain of the Zorbian space pirates. During the Imperial Period, he sought a valuable Gemwood tree. Knowing that such a plant was owned by the Ewoks of Bright Tree Village, he led an expedition to the forest moon of Endor. There, after assailing and capturing the Ewok Teebo, Krag and his men were able to capture not only the village's leader, Chief Chirpa, but the entirety of its fighting force."}, {"tag": "p", "text": "Taking Chirpa hostage, Krag and his men marched into Bright Tree Village unopposed. Negotiations were briefly carried out by Chirpa's daughter, Princess Kneesaa a Jari Kintaka, but turned sour when Krag made advances towards her. The princess had been prepared for the pirates, however: she and her fellow Ewoks had devised an elaborate series of traps with which to incapacitate Krag and his men. Beaten by a group of Ewok women and children, Krag and his men opted for a hasty retreat."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Expedition"}, {"tag": "p", "text": "Krag was a Zorbian space pirate who lived during the Imperial Period. Holding the rank of captain, he led a small band of pirates, and had his own ship. Among his other possessions were a bolo-sling, an axe, and a set of blue-hued armor. At some stage, Krag took his men to the forest moon of Endor, in search of a valuable Gemwood tree. An ounce of the tree's wood was, according to Krag, worth more than anything else in the galaxy. Krag knew that one such tree could be located at the local Ewok village, and he therefore made it his group's objective. Once they landed in Endor's forest, Krag and his men ventured out into the wilderness. As they did so, Krag was struck on the helmet by a falling piece of fruit. Looking in the direction from whence the fruit had come, Krag spotted a pair of Ewoks on a tree branch, and ordered his men to apprehend them."}, {"tag": "p", "text": "As the two Ewoks scampered, Krag's men produced their bolo-slings, and threw them at their targets' vantage point. They were able to slow the Ewoks' retreat, until Krag joined in. Together with his men, he was able to pin the Ewoks, Teebo and Wicket Wystri Warrick to the branch, before ordering his subordinates to bring them down. To the captain's anger, Teebo was able to free his compatriot, and Warrick began to retreat from the area. Before he could, another Zorbian bolo-sling hit him, knocking the young Ewok from the tree. Krag's men were unable to find him afterward, however, but the captain was not concerned. Teebo was brought down from the tree to their level, where he defiantly scorned Krag's efforts. The captain, nonetheless, had devised a plan that would make it easier for him to steal the Gemwood tree. He ordered his men to tie up the young Teebo between two stakes, just near his ship, and then set up a large rocket-propelled net nearby."}, {"tag": "p", "text": "As Krag had expected, a large force of Ewok warriors from Bright Tree Village, led by Chief Chirpa himself, ventured out to rescue Teebo. As they cut their friend down, however, Krag's men activated the net, capturing all of the warriors at once. Pleased with his work, the captain noticed that the warriors had inadvertently trodden a path for him to follow straight back to the village. Krag decided that he would bring Chirpa and a select few of his captives with him on the upcoming expedition as hostages, while the rest would remain near the ship, tied up. The captain and his men successfully found the village, and upon entering it, put Chirpa and his warriors on display. The village, to all appearances, was abandoned, but Krag knew better. He loudly issued his ultimatum: if the Ewoks chose not to reveal themselves, he would execute his hostages. The edict prompted the swift appearance of Princess Kneesaa a Jari Kintaka, Chirpa's daughter."}, {"tag": "h3", "text": "Skirmish"}, {"tag": "p", "text": "The princess pleaded for mercy, and ordered all of her fellow Ewoks, women and children all, out of hiding. Pleased with the result, Krag began making advances towards Chirpa's daughter, and asked for the location of the Gemwood tree. Pressing his advantage, he began stroking her chin, but was met with a sharp bite to the finger from the young princess. Krag could do nothing but howl in pain as Kintaka mounted her bordok and rallied her people. Incensed, the captain promised a thousand Novian rubies to the man that could bring him the young princess. However, the pirates were all dispatched or subdued by a series of traps set up by Kintaka and her fellow Ewoks, and in short order, only Krag remained standing."}, {"tag": "p", "text": "The princess moved to free her father, but the captain, drawing his axe, bore down on the young Ewok. In response, she turned and whistled. At first, Krag was puzzled by the act, as none of the princess' allies were close enough to help her. He soon understood, however, when the bordok ran into him, knocking him off his feet. The princess mounted the bordok and swiftly rode away from the downed pirate, but Krag chose not to give up so quickly. Utilizing his bolo-sling, he incapacitated the bordok, throwing the princess from her mount. She ran off towards the village's supply hut, while Krag closed in on her, axe in hand. Soon enough, the princess was trapped. Yet, before the captain could strike her, the Ewok Latara, who was on the hut's roof, poured an entire vat of honey onto Krag, immobilizing him. The captain and his men hastily retreated, empty handed and thoroughly beaten."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A bloodthirsty individual, Captain Krag was all too eager to take up arms against the Ewoks of Bright Tree Village. He had no qualms about killing children, as he demonstrated with his repeated attempts to slay Kintaka during his Bright Tree Village incursion. He was level-headed enough to accurately predict the actions of his foes—as such, his trap was able to lessen the village's fighting power greatly. Krag thought his more ignorant men to be fools, and he would constantly bark out orders to them at any given moment."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Captain Krag made his only appearance in Ewoks 2, which was written by David Manak. The issue was illustrated by Warren Kremer."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}