{"url": "Kraken", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Character stubs", "Category:Masculine programming", "Category:Separatist admirals and generals", "Category:Separatist droid officers", "Category:Super tactical droids"], "nodes": [{"tag": "h1", "text": "Kraken"}, {"tag": "p", "text": "Kraken was an ST-series military strategic analysis and tactics droid used by the Confederacy of Independent Systems during the Clone Wars. He served as commander during the Battle of Ringo Vinda and was decapitated by Jedi General Anakin Skywalker during the battle, but was repaired sometime after his destruction, and participated in the invasion of the planet Scipio."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Time on Ringo Vinda"}, {"tag": "p", "text": "During the year 19 BBY, Kraken served under Separatist Admiral Trench during the Battle of Ringo Vinda aboard a space station that encircled the entire planet. During the battle, clone trooper Tup executed Jedi Master Tiplar in a premature activation of Order 66, and Kraken informed Trench the Galactic Republic was in full retreat. The super tactical droid was then ordered to contact Count Dooku. Kraken's droids then captured Tup and the droid was told by Trench to personally oversee the transportation of Tup to Dooku on the planet Serenno. However, Jedi Knight Anakin Skywalker, Clone Captain Rex and ARC trooper Fives boarded Kraken's Maxillipede shuttle and easily destroyed the battle droids and BX-series droid commandos protecting Tup. Kraken then emerged from the cockpit and proceeded to beat down Skywalker. However, the Jedi sliced the droid's arms off at the elbow and demanded answers as to why the droids wanted Tup, but Kraken boasted that he was able to resist intimidation. Skywalker then decapitated the droid."}, {"tag": "h3", "text": "Time on Scipio"}, {"tag": "p", "text": "Later on in the war, Kraken was rebuilt and served under Count Dooku. He was part of the count's plan to frame Rush Clovis for destroying the InterGalactic Banking Clan. The droid was ordered by Dooku to wipe out the Republic forces on the surface and was placed in command of the Separatist blockade. Then, a Republic fleet led by Jedi Knight Anakin Skywalker attacked the fleet. When Kraken informed Dooku they were suffering heavy losses, Dooku ordered the droid to withdraw. Kraken attempted to protest, saying there were still hundreds of droid forces on the planet, but Dooku told him to leave them, and Kraken reluctantly complied. The droid later informed Dooku that his master, Darth Sidious, was ordering him to return to Coruscant. Dooku ordered Kraken to inform Sidious that he was on his way."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Like all super tactical droids, Kraken had masculine programming and stood 1.94 meters tall. He was also incredibly loyal to Count Dooku. He had yellow photoreceptors and a green paint scheme, with a unique yellow pattern on his plating. He seemed to care about the troops under his command and was reluctant to leave them even when ordered by Count Dooku. His voice also changed when he was rebuilt, getting slightly higher."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}