{"url": "Kral_Grek", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Quarren"], "nodes": [{"tag": "h1", "text": "Kral Grek"}, {"tag": "p", "text": "Kral Grek was a Quarren male born on the planet Mon Cala around the year 56 BBY. In 22 BBY, Grek was in the Uscru Entertainment District on the planet Coruscant when the Jedi Knight Obi-Wan Kenobi landed an airspeeder nearby. Grek's stolen identity profile was later used by the pirate Hondo Ohnaka to test several potential employees of Ohnaka Transport Solutions in Black Spire Outpost on the planet Batuu in 34 ABY."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kral Grek was a Quarren male who was born on the planet Mon Cala around 56 BBY. In 22 BBY, Grek was on the planet Coruscant and was walking past the Outlander Club in the Uscru Entertainment District when the Jedi Knight Obi-Wan Kenobi landed his XJ-6 airspeeder nearby while chasing the bounty hunter Zam Wesell. The Jedi then jumped out and ran toward Grek in the direction of the club's entrance."}, {"tag": "p", "text": "When Grek was 90 years old, his stolen identity profile was in the possession of the pirate Hondo Ohnaka, owner of Ohnaka Transport Solutions. In 34 ABY, Ohnaka made use of the profile while planning a heist during the First Order occupation of the planet Batuu. The pirate sent Grek's profile, along with several others, to the datapads of several potential crew members for the heist in Black Spire Outpost on Batuu and had them memorize details from the profiles. He then quizzed the potential Ohnaka Transport Solutions employees on details from the profiles in order to test whether they were able to remember the necessary details of a cover identity."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kral Grek weighed 165 pounds and stood 5 feet, 11 inches tall. The Quarren had blue eyes, no hair, and orange skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Grek wore a gray shirt and pants while on Coruscant."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kral Grek first appeared in the 2002 prequel trilogy film, Star Wars: Episode II Attack of the Clones. He was first named in the Star Wars: Datapad app that launched alongside the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios Park in 2019. In the Star Wars Legends continuity, the Quarren name Kral meant \"spear,\" and the archaic meaning of the Quarren surname Grek was \"harvester of kelp.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}