{"url": "Krath_Enchanter", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Tetan Royal Space Yachts", "Category:Tetan starships"], "nodes": [{"tag": "h1", "text": "Krath Enchanter"}, {"tag": "p", "text": "The Krath Enchanter was the personal Tetan Royal Space Yacht of Satal and Aleema Keto, the heirs to the throne of the Empress Teta system, in the years leading up to the Great Sith War. In 3998 BBY, they traveled in the ship to the Galactic Museum on the Galactic Republic capital of Coruscant to obtain Sith artifacts, stopping at the Stenness Hyperspace Terminal space station along the way. Once on Coruscant, the Ketos stole a Sith spellbook from the museum and flew the Krath Enchanter to Onderon after hearing that dark side users were still prevalent there. The Krath Enchanter emerged from hyperspace to find a large Republic fleet getting ready to commence an attack on the Onderonian dark side regime, and despite the fleet's presence, Satal Keto flew the yacht through the blockade to the planet below. However, the ship was hit by lasers fired by Republic rocket-jumpers and crashed, although Satal and Aleema Keto managed to escape the wrecked ship before it exploded."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Krath Enchanter was a large, ungainly Tetan Royal Space Yacht with a golden color. The starship had a tall but relatively narrow frame, and had two fan-shaped apparatuses protruding from it. The cockpit was located at the top of the ship at the bow, and the Krath Enchanter was controlled by one pilot. Although the ship was of a bulky size, it was still fast enough to break through a Galactic Republic fleet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Krath Enchanter was a starship in the employ of the monarchy of the Empress Teta system in the years leading up to the Great Sith War. Specifically, the Krath Enchanter belonged to Satal and Aleema Keto, the heirs to the Tetan throne. In 3998 BBY, the Ketos and their friends formed a secret society named the Krath and began dabbling in dark side magic. Wishing to know more about the dark side of the Force, the Ketos flew the Krath Enchanter to the Republic capital of Coruscant, to take Sith artifacts from the Galactic Museum in Galactic City. Along the way, the Krath Enchanter stopped at the Stenness Hyperspace Terminal space station to refuel. As the ship had no cargo, it was cleared to land in Docking Bay Four. After the Krath Enchanter landed on Coruscant, the Ketos stole a Sith spellbook from the museum, and after hearing a news report that stated that practitioners of Sith magic were still active on Onderon, they decided to go there and hopefully unlock the tome's secrets."}, {"tag": "p", "text": "The Ketos made an unscheduled hyperspace jump in the Krath Enchanter to Onderon, and the ship emerged from hyperspace amidst a Republic fleet. Although a Republic Navy officer warned the Krath Enchanter that it was in a security military zone, Satal Keto flew the ship directly through the blockade. However, when the Krath Enchanter entered Onderon's atmosphere, the ship was blasted by Republic rocket-jumpers. Satal was able to keep the Krath Enchanter steady as it hurtled toward the ground, but as the ship accelerated toward the planet's surface, it was hit again. The Krath Enchanter's repulsor systems were destroyed, and the ship crashed into the ancient cobblestone streets of the Onderonian capital of Iziz. Its landing gear was sheared off in the impact, and the Krath Enchanter, now a fiery wreck, ground to a halt. As the fuel tanks ruptured and exploded, however, the Ketos were able to escape from the destroyed craft into the city streets."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "Satal Keto served as the pilot and captain of the Krath Enchanter. Keto was unafraid to take risks while flying the Krath Enchanter, including piloting the ship through the Republic fleet over Onderon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Krath Enchanter first appeared in Star Wars: Tales of the Jedi — The Freedon Nadd Uprising, the third story arc of the Tales of the Jedi comic book series, written by Tom Veitch and released in 1994. The ship made its first appearance in the arc's first issue, and also appeared in the arc's second and final issue, in which it was destroyed. In these appearances, the Krath Enchanter was illustrated by Tony Akins. The ship also appeared in the audio adaptation of The Freedon Nadd Uprising."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}