{"url": "Krath_Holy_Crusade", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Battles of the Krath Holy Crusade", "Category:Conflicts involving the Galactic Republic", "Category:Conflicts of the Deep Core", "Category:Conflicts of the Mid Rim"], "nodes": [{"tag": "h1", "text": "Krath Holy Crusade"}, {"tag": "p", "text": "The Krath Holy Crusade (3997-3996 BBY) was a series of battles fought before and during the Great Sith War, and comprised the bulk of that conflict. The crusade was a culmination of events that began with a violent regime change in the Empress Teta system staged by Aleema and Satal Keto, heirs to the Tetan monarchy and also leaders of the Sith-inspired Krath cult. After the war, the Krath order constructed a series of temples on several of the worlds they had seized during the Crusade. This Crusade started as the Mandalorians began their holy crusade against the Basiliskans on Basilisk, and ended after the defeat of Dark Lord of the Sith Exar Kun on Yavin 4."}, {"tag": "h2", "text": "Origins"}, {"tag": "h3", "text": "Dark side awakening"}, {"tag": "p", "text": "In the year 3998 BBY, two young nobles from the Empress Teta system arrived on Coruscant. Satal Keto and his cousin Aleema, the heirs to the Tetan monarchy, were on a vacation of sorts to the Galactic capital. Upon arriving on the capital world in their royal yacht dubbed the Krath Enchanter, the Ketos started their trip by visiting Coruscant's Galactic Museum."}, {"tag": "p", "text": "In truth, they had come to Coruscant in search of knowledge of the ancient Sith, and more specifically, for anything related to the dark side. At the time of the Ketos' arrival, the museum had nearly completed a new dark side-based exhibit, appropriately titled \"Dark Lords of the Sith\". The Ketos begged to be allowed to explore the incomplete exhibit, but the curator was hesitant due to explicit instructions from the Jedi Order that the hall be off limits until a sufficient security detail was in place."}, {"tag": "p", "text": "The Ketos continued to beg, and finally the curator relented. They were then allowed access to a hall dedicated to the Sith was filled with ancient and priceless artifacts, books, tomes, and amulets, all radiating with dark side power; power that Satal and Aleema could feel through the Force. They quickly stole one of the books and fled back to their lodging quarters. Unable to read the book and dejected by that fact, the Ketos' hope was renewed when they heard a news report about dark side adepts on Onderon who practiced ancient Sith magic. They knew that Onderon was where the secrets of the book had any chance of being revealed to them, and they immediately left Coruscant on a course for the dark side world."}, {"tag": "h3", "text": "Violent political regime change"}, {"tag": "p", "text": "Returning to their system, the cousins began a coup to overthrow their parents; they confused everyone with Sith illusions. They then killed their parents by dipping them in molten carbonite."}, {"tag": "h2", "text": "The war"}, {"tag": "h3", "text": "Last stand of Empress Teta"}, {"tag": "p", "text": "The Krath forces launched an attack at the last free planet, Koros Major. Aleem assisted her forces through use of her Sith powers. Luckily, a detachment of Republic forces jumped into Koros Major's space to assist the barely holding planet. But out of nowhere, myths though extinct space grazers appeared. Jedi Knight Nomi Sunrider saw through the illusions and told the Republic forces to ignore them and concentrate on the stations."}, {"tag": "p", "text": "Satal pulled a trump card against the Republic by sending out the chaos fighters. Nomi assumed all of them were illusions and telepathically attacked Aleema, who was providing some of the illusions, distracting her, not realizing most of them are real. The fighters slammed kamikaze into the Republic forces, forcing them to retreat."}, {"tag": "h3", "text": "Ambush on Deneba"}, {"tag": "p", "text": "Meanwhile, the Krath were enjoying their recent victory over the Republic. Back in their Iron Citadel stronghold, Satal Keto tended to his loxed out cousin Aleema, who through the power of Nomi Sunrider's psychic attack was rendered comatose. When she finally came around, Satal quickly brought Aleema up to speed on the current situation. He told her that the Jedi and Republic fleet had been driven away, thanks to the power of Sith magic. He also told Aleema of the Jedi convocation being held on Deneba. Satal managed to insert one of his Tetan Corsairs in orbit around Deneba for the next stage of his plan. At an appointed time of Lord Keto's choosing, the Corsair would deploy its full concomitant of life-pods, each carrying an assortment of Krath war droids. The second prong of the attack would be on the planet's surface itself; Satal planned to use the Jedi's service droids against them, supplanting their original programing with that of his own Krath war droids. Once the life-pods were deployed, a signal would be transmitted from the Corsair, activating the service droid's programming trap. Chiming the Corsair captain via comlink, Lord Keto ordered him to begin the assault."}, {"tag": "p", "text": "The Jedi were just barely able to escape the ambush, even as Cay's servant droid met a swift demise from the blade of Nomi Sunrider's lightsaber. But Cay's was not the only droid affected by the program trap. All of the Conclave server droids received the Krath transmission, and instantly began attacking their Jedi owners. Cay thanked Nomi while reminding everyone how he warned them of the droids' suspicious behavior. Much to his horror his notions were validated as he and the other Jedi were forced to dodge heavy blaster fire. On top of that, Krath war droids were emerging from the life-pod wreckage."}, {"tag": "p", "text": "The Jedi took the battle directly to them, leaving hundreds of lightsaber-cleaved droids lay strewn across the battlefield. Master Jeth demonstrated one of the more subtle uses of the Force; to reach inside of the droids, and disable their inner-workings. Many more droids fell under Master Arca's droid disabling technique, and Ulic complimented the ability. Just as he was speaking, a war droid blindsided him, and prepared to finish him off. But Arca was aware of Ulic's peril and again used the Force to destroy the droid. As he diverted his attention to speak to Qel-Droma, one of the downed droids activated its secondary systems, and fired a blaster shot into Jeth's back, felling the Jedi Master. Standing behind him was the war droid he just saved Ulic from, blaster still raised and smoking. As the droid mocked them, Qel-Droma gave into his rage and vanquished the droid. He then rushed to his Master's side, to hear Arca's last words of wisdom and encouragement; to fight the dark side, not align with it. Arca told his former apprentice that he had a weapon that the darkness could not withstand: the power of the Light. He then became one with the Force, leaving only his Jedi robes behind."}, {"tag": "h4", "text": "The corruption of Ulic Qel-Droma"}, {"tag": "h4", "text": "Jedi defector"}, {"tag": "p", "text": "Convinced that the only way to stop the Krath is to get inside them, Ulic proposed he personally infiltrate them. Though the Jedi Masters were appalled at the idea, they reluctantly allowed him to try it out. But before he left, Master Odan-Urr showed him, through a Sith holocron, how the Sith spend their lives—literally."}, {"tag": "p", "text": "Qel-Droma's arrival in Cinnagar did not go unnoticed; the Krath were well aware of his presence. He was prepared to kill the young Jedi but Aleema just told him to wait. The next day, she was ready to execute a prisoner when the crowd began rioting."}, {"tag": "h3", "text": "Qel-Droma's rescue"}, {"tag": "p", "text": "Worried about Ulic, Nomi spearheaded a mission to Cinnagar to rescue him. She allowed herself to be captured, just as Ulic was helping the Tetans advance their technologies. Suspicious, Satal had Nomi brought before Ulic and was going to execute her, but Qel-Droma said that he would do it himself the next morning to maintain his cover. He sent a service droid with a message still detailing his mission to Nomi; however, it was intercepted by Satal. Furious at this betrayal, Satal ordered his servant Norgor to kill Ulic and have Nomi brought to him. Ulic was not caught off guard after sleeping with Aleema, though. He learned of Satal planned attack at Deneba. Enraged, he decided to search for Satal as Nomi escaped the dungeons."}, {"tag": "h4", "text": "Death of Lord Keto"}, {"tag": "p", "text": "Satal merely taunted Ulic as the two fought, only to be slain by Ulic who had submitted to his anger."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}