{"url": "Krayt_dragon", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Carnivorous creatures", "Category:Creatures of Tatooine", "Category:Desert creatures", "Category:Dragons", "Category:Reptiles"], "nodes": [{"tag": "h1", "text": "Krayt dragon"}, {"tag": "p", "text": "Krayt dragons were large, carnivorous reptiles that hailed from Tatooine, a desert planet in the galaxy's Outer Rim Territories. They came in two species and, despite their fierceness, were hunted for the precious pearls found in their bodies."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Krayt dragons were giant carnivorous reptiles that came in two species: the smaller and more common canyon krayt, and the larger greater krayt. Tatooine myths also claimed that at least one krayt dragon had large wings. Due to their large size and ferocity, they were the apex predators of Tatooine. Their bodies produced krayt venom, which helped the dragons as an acid in pre-digestion of their food. If a krayt dragon felt threatened it could project the venom from its mouth, dissolving any organic tissue that the venom came into contact with."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Hungry krayt dragons posed a serious threat to the diminutive Jawas, and their cry was enough to ward off the fierce sand nomads known as the Tusken Raiders. Some greater krayt dragons were known to burrow within abandoned sarlacc pits after eating the sarlacc that resided there. Greater krayts were also known to burrow beneath the sand close to the surface, disrupting nearby objects that it passed."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Krayt Dragons were commonly known for their pearls, bodily concentrations that were considered to be highly valuable. The Tusken Raiders also believed that dragon bones possessed powerful magic."}, {"tag": "p", "text": "At the time of the Invasion of Naboo, a canyon krayt dragon had taken up residence in the Laguna Caves on Tatooine, in which rescue teams for the Boonta Eve Classic did not dare to go."}, {"tag": "p", "text": "Sometime after the Great Jedi Purge, a legend arose on Tatooine concerning the Jedi Master Obi-Wan Kenobi who local Tusken Raiders believed had slain a flying krayt dragon."}, {"tag": "p", "text": "Around 9 ABY, a greater krayt dragon repeatedly attacked the village of Mos Pelgo, as well as a group of Tusken Raiders. In order to handle the animal, Cobb Vanth made a deal with Mandalorian Din Djarin, wherein Djarin would aid Vanth in killing the krayt in exchange for the lawman's set of Mandalorian armor. The pair later sought help from the aforementioned Tusken Raiders who entered a friendly alliance with the Mos Pelgo villagers. The allied group of villagers and Tusken Raiders then formulated a plan which involved coaxing the krayt dragon from its den toward a set of buried explosives which were meant to destroy it from the underside. The plan ultimately failed and Djarin was forced to improvise an alternative, making use of explosives that were strapped to a bantha, allowing himself and the bantha to be swallowed whole by the dragon. Using his jetpack to escape from the dragon's mouth Djarin activated the explosives, finally killing the dragon."}, {"tag": "p", "text": "Around 34 ABY, the toy maker Zabaka manufactured small toy replicas of krayt dragon skeletons for children on the planet Batuu's Black Spire Outpost."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although a krayt dragon's skeleton appeared in the 1977 movie Star Wars: Episode IV A New Hope, living specimens made their first appearance in Star Wars: Galactic Battlegrounds, which was released in 2001 in Star Wars Legends. Krayts made their first appearance in Disney Interactive's canon mobile strategy game Star Wars: Commander, which was released on August 21, 2014 for iOS devices. In celebration of the game's second anniversary, players were awarded five krayt dragon gift units, along with five Droideka Oppressors and five Droideka Sentinels. The krayt dragon made its first live-action appearance in The Mandalorian season 2 premiere, \"Chapter 9: The Marshal.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}