{"url": "Krayt_dragon/Legends", "categories": ["Category:Legends articles", "Category:Articles with elements from unlicensed sources", "Category:Creatures of Tatooine", "Category:Desert creatures", "Category:Dragons", "Category:Food creatures", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Reptiles"], "nodes": [{"tag": "h1", "text": "Krayt dragon"}, {"tag": "p", "text": "The krayt dragon was a large carnivorous reptile native to Tatooine."}, {"tag": "h2", "text": "Characteristics and species"}, {"tag": "p", "text": "Krayt dragons grew continuously throughout their lives to an average length of almost forty five meters and weight of two thousand kilograms. They could live for a hundred years and did not weaken appreciably with age. They could be found in the mountain regions of Tatooine. An ancient krayt dragon was the oldest and biggest of all krayt dragons."}, {"tag": "p", "text": "A fierce hunter, the krayt dragon became an important part of indigenous cultures on Tatooine. The krayt dragon was thought by some xenobiologists to have descended from the Duinuogwuin (also known as Star Dragons). Although no substantial evidence was offered in support of a connection to the Duinuogwuin, the krayt dragon was a proven relative of the smaller kell dragon. In honor of the beast's sheer power and ferocity, the Jedi Order named the Shien and Djem So form of lightsaber combat \"The Way of the Krayt Dragon.\""}, {"tag": "p", "text": "The only semi-sentient species known to hunt the krayt dragon was the fabled sand demon."}, {"tag": "p", "text": "When summer mating season began, the howls of krayt dragons filled the canyons of Tatooine. The collection of frenzied, mating beasts scared even the mightiest Sand People away. Obi-Wan Kenobi mimicked a krayt dragon hunting cry when he scared the raiders away from Luke Skywalker in 0 BBY. Skywalker himself later used the same tactic in an attempt to scare a vornskr."}, {"tag": "p", "text": "Sand People would hunt krayt dragons in an initiation rite to prove themselves as warriors. It was considered the most prestigious test for a Tusken warrior."}, {"tag": "p", "text": "The krayt dragon had a set of sharp teeth used for capturing prey, but relied on ingesting stones to grind the food through a series of gizzards into a digestible state. Food would be crushed by the stones tumbled in the gizzards by stomach muscles, grinding food into pulp and turning boulders into smooth stones. The resulting stones, known as dragon pearls, were a valuable commodity among jewelers. The pearls could also be shaped and tuned by Jedi to be used as focusing crystals in their lightsabers. Krayt dragons instinctively went to the Krayt Graveyard when they were about to die."}, {"tag": "p", "text": "Krayt dragons were heavily attracted to areas that were strong in the Force, especially the dark side. Some Sith artifacts, like the Tatooine Star Map, were guarded by krayt dragons."}, {"tag": "p", "text": "In spite of their awesome power, krayt dragons did have weak and exploitable biological characteristics. Firstly, krayt dragons had trouble resisting the allure of the prey of the Dune Sea, specifically the bantha. Secondly, they had difficulty discerning two-dimensional images, often attacking shadows. Thirdly, a well-placed blaster shot could bore right through the weak sinus cavity of a krayt dragon, hitting its brain and killing it instantly."}, {"tag": "p", "text": "The krayt could also secrete a lethal venom, either through its teeth or its spines. Although its nature is unclear, numerous underworld characters such as Bib Fortuna have admitted to using the substance to kill enemies."}, {"tag": "p", "text": "Although some holofilms, such as the holothriller Luke Skywalker and the Dragons of Tatooine, depicted krayt dragons breathing fire, they were in reality incapable of this."}, {"tag": "p", "text": "Krayt dragon meat was comestible. The cookbook Essential Cooking Skills detailed how to best cook that meat."}, {"tag": "h2", "text": "Species"}, {"tag": "p", "text": "At least two species and several subspecies of krayt dragons existed."}, {"tag": "h3", "text": "Canyon krayt dragon"}, {"tag": "p", "text": "The canyon krayt was a common species of krayt dragon that lived in the rocky caves and canyons of Tatooine's desert ranges. More often than not, the term \"krayt dragon\" referred to this lifeform. Patterns of horns and spikes appears to have varied from individual to individual. At least one canyon krayt was noted to have a two-pronged tail."}, {"tag": "h3", "text": "Greater krayt dragon"}, {"tag": "p", "text": "The greater krayt was a rarer, larger species of krayt dragon, known for its tremendous size and continual growth over time. Creatures of near legendary status, greater krayt dragons had ten legs, measured at least 100 meters from snout to tail tip and had the ability to move through or on Tatooine's desert sand. Greater krayt dragons attacked with their massive jaws or whip-like spike-tail, using their claws only to move through the sand."}, {"tag": "h2", "text": "Krayts in Tatooine culture"}, {"tag": "p", "text": "The Sand People of Tatooine revered the krayt dragon as a powerful hunter and centered their primary maturity ritual on it. Adolescent males were abandoned in the Tatooine dune and only accepted back into their tribes as adults when they had slain a krayt dragon. Both the Sand People and Jawas placed the krayt dragon in the position of a powerful spirit, and believed that their bones possessed magic. Jawas brave enough to risk the acquisition of krayt dragon bones were held in high regard among their people."}, {"tag": "p", "text": "A krayt dragon skeleton was exhibited at the Corellian Science Museum during the Cold War, and a painting of a krayt dragon skeleton was on display in Bestine's Museum of Tatooine."}, {"tag": "p", "text": "Revan, who was an amnesiac and searching for the Star Forge to stop Darth Malak, killed a krayt dragon with the help of Komad Fortuna in order to find an ancient Star Map. He collected the krayt dragon's pearl, but what he did with it is unknown. He either gave it to the Sand People so he could be permitted to learn their history, or he may have kept it to make his lightsaber stronger."}, {"tag": "p", "text": "The Sand People often made fearsome-looking backpacks from the skulls of krayt dragons."}, {"tag": "p", "text": "In 32 BBY, bounty hunter Jango Fett was captured by crime lord Gardulla and was forced to battle her krayt dragon, ultimately slaying the beast."}, {"tag": "p", "text": "According to Han Solo and Gavin Darklighter, Krayt Dragons were an integral part of a traditional Tatooine pre-wedding party for the groom-to-be, which is why it was perhaps fortunate that Luke Skywalker's was held on Coruscant, in the Corellian tradition instead."}, {"tag": "p", "text": "A'Sharad Hett, a Human Jedi who lived among the Sand People with his father, took the name Darth Krayt after the dragons upon becoming a Sith Lord."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The artificial skeleton used for A New Hope was left in the Tunisian desert after filming and still lies there. During filming of Attack of the Clones, the site was visited by the crew and the skeleton was still found there. A backpack made from a krayt dragon skull was one of the many items available to players in Star Wars Galaxies."}, {"tag": "p", "text": "Krayt dragons were intended to appear first in Star Wars: Dark Forces but they were renamed kell dragons and became a different (but related) species altogether. Krayt dragons were mentioned in the article Supernatural Encounters: The Trial and Transformation of Arhul Hextrophon, however the article was never officially published. The related information that was to be published in the article is outlined below."}, {"tag": "p", "text": "In the primordial galaxy, the Krayt Dragons first emerged as offspring of the mating of the Firstborn Duinuogwuin species and the bioengineered Basiliskans created by the being Cold Danda Sine. Monstrous and temperamental, the krayt dragons were considered abominations by their Duinuogwuin progenitors."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}