{"url": "Kreetle", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Arthropods", "Category:Creatures of Geonosis", "Category:Creatures of Kashyyyk", "Category:Creatures of Naboo", "Category:Creatures of Tatooine", "Category:Parasitic creatures", "Category:Species of undefined sentience", "Category:Urban creatures"], "nodes": [{"tag": "h1", "text": "Kreetle"}, {"tag": "p", "text": "A parasitic, burrowing arthropod native to Tatooine, the kreetle was often found in cities, homes, and other urban areas."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The parasitic kreetle was equipped with five pairs of legs, a tough reddish-brown exoskeleton, and large mandibles. Giving birth to young in the form of maggot-like larvae,[source?] kreetles thrived on garbage and vegetable remains, and could often be found in abandoned profogg burrows."}, {"tag": "h3", "text": "Behavior"}, {"tag": "p", "text": "Kreetles were located near cities."}, {"tag": "p", "text": "Despite their small size, kreetles were aggressive arthropods, but usually posed little threat to travelers in the large cities they colonized near. Overkreetles were extremely large, aggressive kreetles. However they were not as common, and rarely found in close proximity to cities."}, {"tag": "p", "text": "Kreetles were native to Naboo, From Naboo the kreetle was transported to its moon Ohma-D'un. The Gungans used kreetles as nutcrackers, but also found the arthropod to be a tasty snack."}, {"tag": "p", "text": "They are also native to Tatooine."}, {"tag": "p", "text": "Kreetles fed on flesh, whether living or dead. They attack in groups of four-to-five, taking a bite and then retreating before moving in for another. These creatures shared a symbiotic relationship with slaatik hagworms in the Lianorm Swamp."}, {"tag": "h3", "text": "Kreetles in the galaxy"}, {"tag": "p", "text": "During the Clone Wars, the kreetle could be found on Geonosis and Kashyyyk."}, {"tag": "p", "text": "The word \"kreetle\" was sometimes used as an insult."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Battle of Yavin, Animal Control officer Entha Kandela tasked a spacer to eliminate kreetles around Mos Eisley to prevent them to burrow and weaken the crusty soil all around the city."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kreetles have appeared in several Star Wars video games, the first being the tie-in to Star Wars: Episode I The Phantom Menace, Star Wars Episode I: The Gungan Frontier."}, {"tag": "p", "text": "Although the kreetle is said to have five pairs of legs, they are rendered with only three pairs in Star Wars: Republic Commando."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}