{"url": "Kren_Blista-Vanee", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Humans", "Category:Imperial Advisors", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kren Blista-Vanee"}, {"tag": "p", "text": "Kren Blista-Vanee was a male human who served as an advisor on the Imperial Ruling Council to Emperor Sheev Palpatine during the reign of the Galactic Empire. In 14 BBY, Blista-Vanee was a relative newcomer to the Ruling Council, but proved himself useful in blazing hyperspace routes into the star systems of the galaxy's Deep Core. Along with fellow advisors Mas Amedda, Ars Dangor and Janus Greejatus, he attended a meeting between members of the council and representatives of the Empire's several intelligence agencies concerning the theft of the corvette Carrion Spike from Moff Wilhuff Tarkin by a rebel cell and its subsequent use to attack Imperial facilities. During the meeting Palpatine looked to Blista-Vanee to give details on a number of Interdictor vessels from the Deep Core Security Zone that Tarkin hoped to use to capture the stolen corvette. Blista-Vanee was later among the Ruling Council members who accompanied Palpatine to the second Death Star, and perished alongside the five other dignitaries on board when it was destroyed. Blista-Vanee was fond of watching opera and wore colorful clothes including flamboyant hats."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kren Blista-Vanee first appeared as an unnamed Imperial advisor in the 1983 film Star Wars: Episode VI Return of the Jedi. The character, who was portrayed by an uncredited background extra, went unnamed until the name \"Kren Blista-Vanee\" was used in the Star Wars Legends roleplaying game Star Wars: The Roleplaying Game supplement Galaxy Guide 5: Return of the Jedi. The name was then canonized with its inclusion in James Luceno's 2014 novel Tarkin."}, {"tag": "p", "text": "Blista-Vanee's costume was designed by Nilo Rodis-Jamero. Rodis-Jamero felt that the look of the Imperial advisors was one of the most exciting designs from Return of the Jedi and thought their design would need to convey an idea about the kind of world that the Emperor lived in. Rodis-Jamero based the look on that of Catholic bishops, with red coloring and ornate headpieces."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}