{"url": "Kril%27Dor/Legends", "categories": ["Category:Legends articles", "Category:Mid Rim gas giants", "Category:Mining planets", "Category:Outer Jalor sector planets", "Category:Sith planets"], "nodes": [{"tag": "h1", "text": "Kril'Dor"}, {"tag": "p", "text": "Kril'Dor was a gas giant planet that was located on the Mid Rim. It was a known source of tibanna."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Jedi Knight Jaden Korr and New Republic General Wedge Antilles came to the planet in 14 ABY on a mission to liberate a tibanna gas mining platform from the Imperial Remnant, who was using profits from the mining and sale of the valuable gas to fund the Disciples of Ragnos. The mission was a success; Korr placed several homing beacons in strategic points of the gas platform in order to lead Antilles to the targets and destroy them with proton torpedoes from his X-wing starfighter."}, {"tag": "p", "text": "Korr first had to put beacons on the roofs of the shield generator building, troop barracks, communications array, and TIE Fighter hangar. As the hangar was taken out, the Imperials were unable to send out air support against Antilles. There were several turbolasers on various locations on the platform, but none managed to hit Antilles as he made his runs against his targets. A pair of proton torpedoes knocked out the power generator and disabled all turbolasers. Korr then had to place a beacon inside the command center. There he defeated one of the Sith Cultists based on the platform in a lightsaber duel."}, {"tag": "p", "text": "After the command center, the last target on the mission's agenda, was taken out, several squads of stormtroopers attempted to sabotage the tibanna gas storage tanks. Acting quickly, Korr disabled the bombs and defeated the remaining Imperial troops. Once the station was secured, the New Republic sent its own forces to repair and defend the installation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}