{"url": "Apocalypse_Endor", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 14"], "nodes": [{"tag": "h1", "text": "Apocalypse Endor"}, {"tag": "p", "text": "Apocalypse Endor was a comic appearing in Star Wars Tales 14 and collected in Star Wars Tales Volume 4 and Star Wars Legends Epic Collection: The New Republic Vol. 1."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Apocalypse Endor tells the story of a retired stormtrooper's experience on Endor. It starts in a cantina, years after the Battle of Endor. The old man is asked and teased about how the 'cute and cuddly widdle' Ewoks defeated the Emperor's best troops. The former soldier tells his story."}, {"tag": "p", "text": "Years ago, upon setting up a base on the forest moon, the Imperials went to meet the natives to determine hostility and behavior. The curious Ewoks welcomed the troopers with flowers, but when they tried to use a stormtrooper's E-11 blaster rifle for a flower holder, the paranoid troopers considered that an attempt to block up their weapons, and opened fire. The Ewoks then went completely hostile. Over time they kidnapped and murdered any stormtroopers they could get, and tortured the whole garrison with eerie drums in the night. During a daytime battle, Ewoks swung from vines and shot arrows in the troopers' necks, one of the armor's weak spots. They caused other stormtroopers to slip into a pit of sharpened stone spikes and dropped boulders on other groups."}, {"tag": "p", "text": "When the remaining Imperials were being rounded up, the narrator surrendered quickly and asked for the Ewoks to be taken away. In the cantina, the veteran says that he hasn't slept well since Endor, but what keeps him going is the idea that the second Death Star's debris rained down on the moon and killed many Ewoks. His fellow patrons crush his last happy thought about Endor by revealing that as a myth, that most of the debris was vaporized during the violent explosion of the Death Star and the rest was intercepted by the Rebels, preventing any harm to the forest moon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "p", "text": ""}]}