{"url": "Kromus", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Confederacy of Independent Systems planets", "Category:Esuain sector planets"], "nodes": [{"tag": "h1", "text": "Kromus"}, {"tag": "p", "text": "Kromus was the fourth planet in the Kro'eval system. It had a rich biosphere, and by the time of the Clone Wars, it had a sentient population of 1.3 billion."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, Kromus was on the border of Separatist-occupied space and became the site of a research facility where the Starkiller superweapon was constructed. This was built in the heart of a city of two million inhabitants. The CIS had a superlaser experiment on this planet."}, {"tag": "p", "text": "However, in Galactic Republic records, information on Kromus was swapped with the files on the fifth planet in the system, Kromol, and the Republic believed that the Starkiller was being built on an uninhabited world."}, {"tag": "p", "text": "The Republic only discovered the mistake when they dispatched a fleet led by Jedi General Darrus Jeht to destroy the Starkiller. Believing that there was no other way to prevent the superweapon from escaping, Jeht ordered the command cruiser Maelstrom to bombard the planet and destroy the secret weapon. The blast of the destruction wiped out the city in a matter of seconds, and set off a planetary cataclysm that rapidly destroyed all life on the planet."}, {"tag": "p", "text": "Kromus' atmosphere was scoured away, and the crust was wracked with massive tectonic activity. More than a billion sentients were killed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Due to the information being swapped, it is not entirely clear which are the correct names for the fourth and fifth planets in the Kro'eval system: the fourth planet is normally referred to as \"Kromus\", and that is the name used here, but Darrus Jeht subsequently thinks of it as \"Kromal\", which suggests that that might be the correct name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}