{"url": "Krova_(Hutt)", "categories": ["Category:Legends articles", "Category:Crime lords", "Category:Females", "Category:Hutts"], "nodes": [{"tag": "h1", "text": "Krova  (Hutt)"}, {"tag": "p", "text": "Krova the Hutt was a minor Hutt crime boss with a female personality who operated from a base on the planet of Alvorine, in the Outer Rim Territories. During the Galactic Civil War, Krova made herself an enemy of the Rebel Alliance when she sold vital information to the Galactic Empire. Because of her, an entire contingent of Rebel soldiers were slaughtered by the Imperials at Kolanda Station. Following the fall of the Empire in 4 ABY, the Alliance established a democratic New Republic and indicted Krova for war crimes, siccing bounty hunters on her. Krova, however, arranged a fake capture and returned to Alvorine. Once there, she was attacked and imprisoned by a band of Dark Jedi, who sought to get their hands on ancient Sith holocron she retained."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Krova was born at some point between 840 and 647 BBY, during the first centuries of the Great Peace of the Republic. Krova belonged to the Hutt species, a slug-like and long-lived race from the dying world of Varl. Like all other Hutts, Krova was a hermaphrodite, possessing both male and female reproductive organs, but she chose to assume a feminine personality. She embraced a career that some Humans would qualify as criminal, although the morality of Hutts had little to do with that of many other species. Krova established her base of operations on Alvorine, a colorful, forested planet located in the Outer Rim Territories."}, {"tag": "p", "text": "When a Galactic Civil War broke out between the dominant Galactic Empire and the Rebel Alliance that fought against oppression, Krova understood that she could make more profit by selling information to both sides. Through the Hutt's double game, a number of routine missions turned into slaughters for the Alliance. Most importantly, Krova was personally responsible for the slaughter of many Rebel troopers at Kolanda Station, on the planet Latharra of the Yminis sector. Thanks to the intelligence supplied by Krova the Hutt, the Galactic Empire was able to crush the Rebel troops that were sent there, cutting them down to the last man. That event was later known as the \"Massacre at Kolanda Station.\" As a result, the Alliance officials declared Krova a war criminal and swore they would put her on trial as soon as possible."}, {"tag": "p", "text": "In 4 ABY, the Empire was defeated at the Battle of Endor, and the Alliance turned into a new democratic government, the New Republic. As announced earlier in the war, the former Alliance members placed a bounty on Krova's head due to her past connection with the murders of a multitude of Rebel personnel. Hoping that she could escape the punitive actions of the New Republic, Krova the Hutt left Alvorine in search of a safer hideout. During her escapade, she was ultimately captured somewhere in the Pluthan asteroid field by a Dug bounty hunter named Langro Dis. However, it was believed that Krova herself had arranged the capture and cut a bargain with Dis to ensure her freedom. In any event, she subsequently returned to Alvorine."}, {"tag": "p", "text": "At that time, it was known that Krova had in her possession a Sith holocron, an ancient artifact built by the followers of the Sith religion. Being aware of that device's value, Krova had swallowed it, refusing to divulge its location to safeguard her freedom. However, unknown to the Hutt, the holocron residing in her stomach began to emit a distress signal, attracting a group of Dark Jedi led by Noth, a Near-Human who resided in the wilds of Alvorine. The dark siders confronted Krova, who was forced to turn the artifact over to them. The Hutt was later captured and imprisoned, while her precious holocron, though damaged during Noth's attempt to steal it, remained in the Near-Human's possession."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Krova's physical appearance featured a few unusual traits for a Hutt. While most others were green with either red or yellow eyes, she was a pinkish Hutt with a pale yellow underbelly and blue eyes."}, {"tag": "p", "text": "While she considered herself shrewd, cunning, and a good judge of other beings' character, Krova's confidence in her own skills proved to be misplaced more than once. She was difficult to read or influence through the use of the Force, an ability common to all Hutts and that caused worries to many Jedi Knights since time immemorial. Similarly, like many among her own kind, Krova could speak, read and write Galactic Basic Standard in addition to her native Huttese. However, the Hutts were famous for assuming their racial and cultural superiority, and would rarely use another language than their own mother tongue."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}