{"url": "Appetite_for_Adventure", "categories": ["Category:Real-world articles", "Category:Clone Wars Adventures stories"], "nodes": [{"tag": "h1", "text": "Appetite for Adventure"}, {"tag": "p", "text": "Appetite for Adventure is an eighteen-page comic published October 24, 2007 by Dark Horse Comics in Star Wars: Clone Wars Adventures Volume 9, part of the digest-sized Clone Wars Adventures comic series. The comic was written and drawn by Matthew and Shawn Fillbach—credited as the Fillbach Brothers—lettered by Michael Heisler, colored by Ronda Pattison, and edited by Jeremy Barlow."}, {"tag": "p", "text": "Appetite for Adventure is about the chef Dexter Jettster going on a dangerous mission to the planet Dractu just to retrieve a Dractuvian cave slug to make a special meal for his friend, the Jedi Obi-Wan Kenobi."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Sometime during the Clone Wars between the Republic and Separatists, a small spaceship lands on the planet of Dractu, and the Besalisk chef Dexter Jettster disembarks, in search of something. Jettster heads to a nearby village to seek help from the primitive, yet sentient, Dractuvian natives. After consulting with the village's elder using hand gestures, the elder orders one of his warriors to lead Jettster somewhere, and the two head off."}, {"tag": "p", "text": "Jettster follows the warrior out of the village, and as the pair are moving through a collection of large, spiny trees, the Besalisk cook stops to rest for a moment on one of the trees. However, Jettster's guide motions for the cook to look up, and when Jettster does, he discovers that he is not leaning on a tree, but instead one of the legs of a large, insectoid beast. Shocked, Jettster and his guide run away, with the large beast following them, intent on eating the two. After a short chase, Jettster and the warrior evade the beast by hiding behind a group of large rocks. Relieved that he is no longer being chased by the beast, Jettster fails to notice that he is stuck in a pit of quicksand and sinking until over half his body is submerged in the pit. The warrior grabs a large vine from a nearby tree, and giving one end of the vine to Jettster to hold on to, calmly walks to a nearby field were a creature is grazing. After attaching the other end of the vine to one of the animal's rear legs, the warrior slaps the animal's buttocks, making it run off, pulling the vine. Back at the quicksand pit, Jettster, now completely submerged but still clutching the vine, is sent flying out of the quicksand when the vine is yanked. The dazed Jettster and his guide continue to their destination—a cave."}, {"tag": "p", "text": "The two enter the cave, and find numerous burrows in the wall. The warrior reaches into one and pulls out a Dractuvian cave slug, the reason Jettster had come to Dractu. Jettster thoughtfully reaches in another burrow, hoping to grab a slug himself, but instead pulls out a more vicious Dractuvian caveworm, which bites onto the Besalisk's large chin. While Jettster panics, the Dractuvian warrior manages to yank the worm off, causing the cook to fall to ground. Although stunned, Jettster is overjoyed to find several cave slugs slithering on the ground, and after putting several into a container the cook had brought with him, he and the warrior return to the Dractuvian's village."}, {"tag": "p", "text": "After biding the Dractuvians farewell, Jettster boards his ship and takes off for his diner back on the planet Coruscant. In the diner's kitchen, Jettster prepares one of the cave slugs for a meal, boiling and chopping it up. Jettster walks out of the kitchen towards his good friend, the Jedi Obi-Wan Kenobi, saying he has made a special dinner for him today. Kenobi is surprised to see that Jettster made Dractuvian cave slug, and after taking a bite of the dish, pronounces with a smile that is still as disgusting as he remembered. Jettster is confused, reminding Kenobi that he previously said that cave slug was the best thing he ate on Dractu. Kenobi only replies that Dractu has the worst food in the galaxy, meaning that Jettster went on a dangerous adventure just to make a meal his friend hates."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}]}