{"url": "Kryll", "categories": ["Category:Legends articles", "Category:Alliance admirals and generals", "Category:Humans", "Category:Imperial Army officers of the Galactic Empire", "Category:Males", "Category:New Republic Defense Force admirals and generals"], "nodes": [{"tag": "h1", "text": "Kryll"}, {"tag": "p", "text": "General Kryll was an officer who served with the Alliance to Restore the Republic and later the New Republic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kryll was a Human male Imperial officer who served in the Imperial Army. While engaged in a military campaign, he heard news of the Death Star's destruction of Alderaan. Kryll promptly defected, taking command of battered Alliance forces and assisting in the effort to created the Alliance Special Forces. He was then assigned to the Atrivis Sector Force, where he commanded the Alliance's Outer Rim Communications Center located on the planet Generis."}, {"tag": "p", "text": "When Generis was attacked by Grand Admiral Thrawn in 9 ABY, Kryll's forces were quickly overwhelmed. However, he and Captain Pash Cracken were able to arrange the escape of Atrivis sector Commander-in-Chief Travia Chan, along with her staff."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Because of Kryll's former Imperial service, the general kept a stern bearing and enforced proper military discipline. However, when Kryll was off-duty he loved to sing old spacers' songs off-key in the base's tapcafe. He would often joke that he did not leave the Empire because of the destruction of Alderaan, rather instead it was because the rest of the Imperial Officer Corps didn't sufficiently appreciate his \"fine tenor voice.\""}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Kryll was trained in the use of blasters and blaster artillery, as well as melee combat. He was knowledgeable about alien species, cultures, languages, and star systems, and had a in-depth knowledge of bureaucratic procedure, especially in relation to the Outer Rim Communications Center. Kryll was an effective commander, with a keen grasp of fleet tactics, along with the ability to fly capital ships and pilot them through hyperspace. He was a keen gambler, and was able to repair and program computers and bypass security equipment."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Kryll was armed with a blaster pistol, and carried a comlink and datapad."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}