{"url": "Apple_slug", "categories": ["Category:Legends articles", "Category:Wookieepedia former Comprehensive articles", "Category:Creatures of unspecified diet", "Category:Food creatures", "Category:Gastropods", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Apple slug"}, {"tag": "p", "text": "The apple slug was a creature found on the planet Subterrel. Apple slugs could ripen and were eaten by some individuals. Two dishes made from the creatures included apple slug stew and apple slug sauce. The Besalisk cook Dexter Jettster made the stew while working in the mines of Subterrel, and he later offered both dishes on the menu of his diner on the planet Coruscant."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The apple slug was a type of creature that ripened."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Found on Subterrel, apple slugs were eaten by at least one individual who was working in the mines on the planet."}, {"tag": "h2", "text": "Apple slugs in the galaxy"}, {"tag": "p", "text": "During his time as a miner on Subterrel, the Besalisk Dexter Jettster would occasionally use apple slugs as an ingredient in a stew he prepared in a low-volume mining sluice. The dish, which Jettster dubbed apple slug stew, was one of the Besalisk's favorite dishes and was made with Ojomian onions, ripe apple slugs, space carrots, and a small amount of negamo. Jettster later became a chef and served the stew and a lunch side dish known as apple slug sauce at Dex's Diner, a restaurant located in CoCo Town on the planet Coruscant. At some point prior to the diner's destruction during the first two years of the Galactic Empire, Jettster sold the apple slug stew for 1.7 credits per cup and 2.7 credits per bowl, with the sauce selling for 2.7 credits."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The crew of the 1983 film Star Wars: Episode VI Return of the Jedi designed the apple slug as one of the many alien creatures slated to appear in the Jabba's Palace sequences of the film. The slug was realized as a maquette, which depicted the creature as a mound-shaped alien with wrinkled, green skin; a gaping maw with a red tongue; and four hooked, segmented, black appendages. The creature concept was eventually abandoned before an actual puppet could be constructed for the film."}, {"tag": "p", "text": "The 2009 article \"Dining at Dex's,\" which was written by Gregory Walker and published on the Hyperspace website in the style of an in-universe menu for Dex's Diner, mentioned apple slugs as edible animals. Although Walker's blog confirmed that these apple slug dishes on the menu of Dex's Diner were indeed references to the concept creature, the article provided no description of the species' anatomy, leaving the Return of the Jedi maquette's appearance as cut content."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}