{"url": "Krypder_Riders", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Mid Rim organizations", "Category:Pirate organizations"], "nodes": [{"tag": "h1", "text": "Krypder Riders"}, {"tag": "p", "text": "The Krypder Riders were a group of pirates led by Hudso Shaku that operated on the planet Dallenor during the later years of the Galactic Republic. After a Jedi holocron was discovered during an archaeological excavation on Dallenor, Shaku and the Krypder Riders attempted to steal it. However, the Jedi Obi-Wan Kenobi and Anakin Skywalker, who had been sent to investigate the holocron, defended themselves from the Krypder Riders and prevented the pirates from taking the holocron."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Krypder Riders was a pirate gang that operated on the the Mid Rim planet Dallenor. Led by Hudso Shaku, the gang included many members of Dallenor's native bird-like species. The pirates were outfitted with swords, and many of them wore armor, particularly around their chests and shoulders. Some of the pirates also wore goggles or masks over their faces, along with fabric wrapped around their neck areas. Shaku rode on the back of a quadrupedal creature."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the later years of the Galactic Republic, the Krypder Riders were operating on Dallenor, where a group of offworlders began an archaeological excavation. The pirates initially caused issues with the offworlders until they discovered that the excavated artifacts, comprising broken bits of century-old droids, to be of no value to them. However, that soon changed when an ancient Jedi holocron was discovered. The Krypder Riders inspected the excavation for a second time, forcing Clatriffe, the Togruta in charge of the dig, to plant guards around to keep the pirates away."}, {"tag": "p", "text": "The Jedi Order soon dispatched Jedi Obi-Wan Kenobi and his young Padawan apprentice, Anakin Skywalker, to Dallenor to retrieve the holocron. However, when the Krypder Riders encountered the two Jedi, Shaku hostilely claimed proprietorial rights over the archaeological finds and threatened the lives of the Jedi. Kenobi ignited his lightsaber in defense, prompting Shaku to order his men to seize the laser sword instead as the more valuable prize."}, {"tag": "p", "text": "As the pirates engaged Kenobi, he began incapacitating them. Shaku used the distraction to take Skywalker hostage, demanding the lightsaber in exchange for his young captive's freedom. However, Skywalker used the Force to lift a number of stones and knock down Shaku from behind. With Shaku unconscious, Kenobi prompted the rest of the Krypder Riders to leave."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Krypder Riders first appeared in the comic Age of Republic - Obi-Wan Kenobi 1, written by Jody Houser, illustrated by Cory Smith and Wilton Santos, and published by Marvel Comics on January 2, 2019. On a live Twitch stream chat, Houser revealed that she had named the pirate gang after two of her friends' dogs, Krypto and Derby."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}