{"url": "Krytollak", "categories": ["Category:Legends articles", "Category:Endothermic species", "Category:Expansion Region species", "Category:Krytollaks", "Category:Mammalian sentient species"], "nodes": [{"tag": "h1", "text": "Krytollak"}, {"tag": "p", "text": "Krytollaks were a species of sentient, armored mammals indigenous to the planet Thandruss. They were led by an empress and had a rigid social structure, thinking that absolute monarchy was the only sensible form of government, both on a planetary and galactic level. When Palpatine anointed himself Galactic Emperor at the end of the Clone Wars, the Krytollak empress Devir recognized his right to rule, and her people become staunch supporters of the newly created Galactic Empire. Under the Imperial rule, the Krytollaks went through an era of unprecedented technological development, and some of them left their homeworld for the first time to join the wider galactic community as merchants, mercenaries or bounty hunters."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Krytollaks were sentient, endothermic humanoids of the mammalian class. In addition to their internal skeletons, they also had armored outer shells, usually brown or black in color, which gave them an insectoid look. Some Krytollaks had green shells, which were considered a mark of noble status and gave them access to power. Krytollaks often painted their shells, with nobles usually decorating their shells with their personal crest. A Krytollak's shell would grow with his or her body throughout their lives. Krytollaks never stopped growing—older Krytollaks could be up to three meters tall, with females being ten to twenty centimeters taller on average than males of the same age. Their mouths and their dark brown or black eyes were visible in cracks between their shell plates. Though they could hear by sensing vibrations through their shells, they had no sense of smell. The Krytollak lifespan was about one standard century, with little loss of strength coming with age. Krytollak ate mostly vegetables and carbon-based rocks, with offworld vegetables and rocks considered delicacies."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Krytollaks had a rigid social and political structure, and believed their rulers were destined to rule. They had two social classes: the workers, who made up 96% of the population, and the royals. Royal Krytollaks were those born with green shells, and the brown-shelled children of green-shelled royals. If brown-shelled royals had brown-shelled children, they were removed to the worker class. Royals were schooled from birth to take administrative positions. If their performance merited it, they could rise from leading small villages to more senior positions. At the apex of their society was a single monarch. Krytollaks saw a single ruler as the only sensible way to organize society, which explained their quick acceptance of a galaxywide monarchy. They did not question their social system, or their place in it. Indeed, they were deeply suspicious of democracy, which they saw as overly fallible and fraught with corruption."}, {"tag": "p", "text": "Krytollaks rarely spoke unless directly addressed. They often seemed apathetic, but this was only because they were quite patient, preferring to wait until they fully understood a situation before getting involved. While this made them difficult to anger, they were also very slow to forgive an insult. Among themselves, they preferred violent entertainment. Many social gatherings included relatively friendly brawls, since their thick shells prevented serious injury in hand-to-hand combat. Serious matters of honor among nobles would be settled in duels with melee weapons (as ranged weapons were considered dishonorable.) Vibroblades were greatly prized, though they could only be obtained through offworld trade."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Krytollaks evolved on Thandruss, a planet located within the Expansion Region of the galaxy. Before first contact with the Empire, the Krytollaks were limited to early industrial technology, with steam engines and primitive radionics broadcasting. Despite their primitive technology, they had established a single planetary government. Empress Devir, who began her rule circa 20 BBY, quickly recognized Palpatine as her rightful lord and master, and accepted Imperial advisors to help her rule. As a result of Imperial influence, Krytollak nobles began to dress in robes which imitated Imperial court dress or uniforms. The gray of Imperial military uniforms was reserved for nobles. Under Imperial rule, Thandruss gained the benefits of rapid technological improvement and trade with Imperial-allied corporations and alien species (such as the Sullustans and the Herglics.) However, many Krytollaks were unhappy with the high Imperial taxes which came with these benefits. They remained steadfastly loyal to the Emperor, placing the blame on the Emperor's subordinates instead."}, {"tag": "h2", "text": "Krytollak in the galaxy"}, {"tag": "p", "text": "Under the Empire, a few nobles left Thandruss to seek glory as mercenaries, bounty hunters, or traders. Some workers worked as menial laborers offoworld. Other Krytollaks were pressed into Imperial service, a duty they considered a great honor. Despite their pro-Imperial stance, a few Krytollaks allied themselves with the Alliance to Restore the Republic. These Krytollaks still saw themselves as loyal to Palpatine—their only problem was with certain Imperial Governors and Moffs who they viewed as corrupt servants of the rightful galactic ruler. They believed that if the crimes of his servants were brought to light, Palpatine would restore justice."}, {"tag": "p", "text": "Some Krytollak acted as spies, infiltrating the Alliance to Restore the Republic seeking information for the Galactic Empire."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}