{"url": "Ktil/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Ktilac Regions planets", "Category:New Republic planets"], "nodes": [{"tag": "h1", "text": "Ktil"}, {"tag": "p", "text": "Ktil was an Inner Rim planet that was the homeworld of the Ktilac species. It was a part of the Ktilac Regions, a group of star systems which the Ktilac co-inhabited with the Murachauns and the Tocoyans. Ktil had become a member of the Galactic Republic by 17,000 BBY, and it eventually became a part of the Galactic Empire and the New Republic, as well."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Ktil was a planet located in the Ktil system, a part of the Ktilac Regions in the Slice portion of the Inner Rim. Around 22,000 BBY, a hyperlane connected Ktil to the Colonies' Belnar system. Approximately five millennia later, additional hyperspace routes linked it to the Sistooine and Tirahnn systems. Furthermore, by 12,000 BBY, the Carida system had become the closest neighbor to Ktil along the route to Belnar. That set of hyperlanes persisted until the Great Sith War of 3996 BBY but had ceased to exist by the onset of the Mandalorian Wars in 3976 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 22,000 BBY, Ktil was considered a part of the region known as the Rim, which lay beyond the boundaries of the young Galactic Republic. Space surrounding the planet was explored between 20,000 BBY and 15,000 BBY. By 17,000 BBY, Ktil had become a part of the Republic, lying along hyperlanes controlled by the Core Worlds planet Alsakan and its allies in their political struggle against the galactic capital world Coruscant. Ktil was situated in the territories either unaligned with or contested by the Republic and the Brotherhood of Darkness during the final years of the New Sith Wars, by which time the extent of the former had been greatly reduced."}, {"tag": "p", "text": "Ktil had returned into the fold of the Republic by the time the first campaigns of the Clone Wars took place in 22 BBY, with the Republic's Third Sector Army being charged with engaging the military forces of the Confederacy of Independent Systems in the planet's vicinity. By 17 BBY, however, Ktil had been incorporated into the territory controlled by the Galactic Empire, and the planet was a part of the New Republic twenty-nine years later. As part of their invasion of the galaxy, at some point between 26 ABY and 27 ABY, the extra-galactic Yuuzhan Vong attacked and conquered the Ktil system, but it was no longer under the control of the invaders in 27 ABY."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Ktil was the homeworld of the sentient Ktilac species. The Ktilac ruled over sixty-three star systems in the Ktilac Regions, the latter of which they co-inhabited with the Murachaun and Tocoyan species. The systems controlled by the Ktilac were closed to outsiders. Around 25 ABY, the population of Ktil numbered between ten and hundred million."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ktil was first mentioned in the 2009 reference book The Essential Atlas, authored by Daniel Wallace and Jason Fry, which placed it in grid square N-9."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}