{"url": "Ktriss", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Females", "Category:Named pets"], "nodes": [{"tag": "h1", "text": "Ktriss"}, {"tag": "p", "text": "Ktriss was a female Hssiss dragon and the pet of Great Bogga, the Hutt crime lord of the Stenness star system. Ktriss served as the Hutt's executioner and was often seen sitting at her master's side. A creature from Lake Natth on the planet Ambria of the Stenness Node, Ktriss had the primal ability, like all those of her kind, to manipulate the dark side of the Force. In 3999 BBY, Ktriss demonstrated her killing abilities for Great Bogga, in his court on the moon of Vo Dasha. Pirate captain Finhead Stonebone and his gang were brought before the Hutt for crimes committed against him. When Stonebone rejected Bogga's initial offer to make recompense, Ktriss was unleashed upon one of Stonebone's crewmates, Roko, and devoured him in the company of his peers."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Hutt familiar"}, {"tag": "p", "text": "Ktriss was a female Hssiss, a species of dragon native to Lake Natth on the Inner Rim planet Ambria, of the Stenness Node. The creatures of that lake were suffused with the dark side of the Force—the result of a powerful Jedi Master trapping the planet's darkness there. As such, Ktriss was able to subtly manipulate the Force, using its power to confuse the minds of her prey."}, {"tag": "p", "text": "While still young, Ktriss was happened upon by a traveling Hutt known as Great Bogga, who was the crime lord of the Stenness star system, where Ambria was situated. Bogga was intrigued by the young Hssiss and her species and captured several dragons to take off-world. All were placed on the black market and sold to colleagues and darksiders alike—all save Ktriss, whom the Hutt claimed as his own. Ktriss was taken to his stronghold on the moon of Vo Dasha, where she acted as the Hutt's personal security enforcer. As time progressed, Ktriss grew considerably in size and ferocity, becoming an intimidating presence at the side of Great Bogga."}, {"tag": "p", "text": "In 3999 BBY, several members of Bogga's enforcer gang failed to steal a cache of precious Adegan crystals from a family of travelers moving through the Stenness Hyperspace Terminal. Ktriss was present when only the gang's leader, Gudb, returned in shame, and the sight of him made her drool. Under penalty of Ktriss' wrath, Gudb was threatened into pursuing the crystals' owners to Ambria, the dragon's homeworld. Leaving Ktriss behind, Bogga accompanied his minions but ultimately returned to Vo Dasha empty-handed and defeated by the Jedi Knights who resided there."}, {"tag": "h3", "text": "Roko's demise"}, {"tag": "p", "text": "Around that same time, Bogga's enforcer gang apprehended ore thieves for committing acts of piracy against several of the Hutt's allies. Ktriss lay beside her master as pirate captain Finhead Stonebone, the leader of the gang, was brought before them. As atonement for Stonebone's crimes, Bogga ordered the pirate to go to Ambria and retrieve the Adegan crystals from the Jedi who had previously beaten the Hutt and his minions. Stonebone, however, refused to involve himself with any act that called for raising arms against Knights of the Republic and remained indignant before the Hutt."}, {"tag": "p", "text": "Appalled by Stonebone's defiance, the Hutt decided to demonstrate for the pirate the consequences of disobeying Great Bogga. Ktriss was called into action and let loose upon Stonebone's first crewmate, a humanoid named Roko. Using the dark side of the Force to temporarily cloud the pirate's mind, Ktriss rendered Roko immobile as she fell upon him, much to the horror of Stonebone and the rest of his gang. Ktriss consumed all of her victim, leaving only a bloody mess where Roko had once stood. The sight of his comrade's death at the mercy of Ktriss was enough to compel Stonebone into service, much to the satisfaction of Great Bogga the Hutt."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ktriss was a green-scaled quadruped, with black eyes; a long, massive tail; and spiked protrusions that lined her back in two rows. She was of considerable stature while on all fours, and when she reared up on hind legs, Ktriss stood taller than an adult humanoid of average height. She also had long, sharp teeth and massive talons. She readily responded to the instructions of her master, Great Bogga, who believed Ktriss to be capable of even devouring his lead enforcer, Gudb, in one bite. Ktriss indeed demonstrated hunger for Gudb, gnashing her teeth and salivating heavily while the diminutive gangster was in her presence. Gudb, however, believed that his own pet gorm-worm, Skritch, was more than capable of dispatching Ktriss. The dragon was loyal to her master and frequently accompanied him. Fear of Ktriss' abilities was enough for Captain Stonebone to reconsider the offer that Bogga presented to him."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Ktriss used her large teeth and claws to devour her prey. She was capable of bringing down adult humanoids, evidenced by her overpowering of the space pirate Roko. When Bogga ordered Ktriss to demonstrate her ferocity, the Hssiss obliged by immediately attacking Roko and tearing him to shreds in the presence of his mates. Ktriss was also Force-sensitive and used the power of the dark side when hunting to render her victim temporarily confused, making it easier for her to subdue them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ktriss first appeared in the fourth issue of Tom Veitch's Knights of the Old Republic story arc of the Tales of the Jedi comic series. Ktriss is also featured in the audio rendition by John Whitman, based on Veitch's script. Additional details of her backstory were later established in 2001's The Dark Side Sourcebook, a supplement to the Star Wars Roleplaying Game, published by Wizards of the Coast."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}