{"url": "Kuat_Drive_Yards", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Articles to be expanded", "Category:Culture of Kuat", "Category:Galactic Republic organizations", "Category:Imperial organizations", "Category:Kuat Drive Yards products", "Category:New Republic organizations", "Category:Shipwrights", "Category:Shipyards"], "nodes": [{"tag": "h1", "text": "Kuat Drive Yards"}, {"tag": "p", "text": "Kuat Drive Yards (KDY) was a starship manufacturer based on the planet Kuat. The main production facility of Kuat Drive Yards was the Kuat Drive Yards Orbital Shipyards, a ring around the planet Kuat. It produced many of the galaxy's most terrifying symbols of Imperial might, including the Imperial-class Star Destroyer, and also produced walkers such as the All Terrain Defense Pod. It had several subsidiaries, with Kuat Vehicles focusing on civilian ground products, and Kuat Systems Engineering producing starfighters."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One of the foremost military shipbuilding corporations in the galaxy, Kuat Drive Yards firmly aligned with the Supreme Chancellery of the Galactic Republic a decade before the onslaught of the Clone Wars, after leading Kuati executives were assassinated when the Neimoidians took over the Trade Federation at the infamous Eriadu Conference. With the aid of its subsidiary Rothana Heavy Engineering, KDY produced most if not all of the Republic Military's starships and vehicles throughout the Clone Wars. Notable starships including the Acclamator-class transgalactic military assault ship, LAAT/i gunships, the formidable land-based AT-TE walker, and the Venator-class Star Destroyer were all produced by KDY, making it one of the most influential companies in the galaxy."}, {"tag": "p", "text": "It was only natural for KDY to shift its allegiance following the proclamation of the New Order, and the Republic's transformation into the autocracy that was the Galactic Empire. As a result of its importance in Republic military production, it quickly became the premier starship and vehicle manufacturer for the Imperial Navy and Imperial Army respectively, reaping huge profits as a result. The collusion of industrial and military power led to the distinct, dagger-shaped vessels utilized by the Imperial armed forces, with the company producing the most prominent symbols of Imperial might. The Imperial-class Star Destroyer and AT-AT walker were products of KDY's massive military infrastructure. The Admiralty pushed for KDY's larger vessels, much to the chagrin of the Imperial Starfighter Corps."}, {"tag": "p", "text": "In the months following the Battle of Endor, the New Republic Defense Fleet led by Admiral Gial Ackbar and Commodore Kyrsta Agate lay siege to Kuat and the orbital Kuat Drive Yards shipyards. After sustaining heavy casualties, the Imperial governor Moff Pollus Maksim and the guild head of Kuat Drive Yards capitulated to the New Republic. The loss of Kuat Drive Yards led Grand Admiral Rae Sloane to open peace negotiations with the New Republic. In reality, the peace talks were a ruse for Fleet Admiral Gallius Rax to attack the New Republic leadership on Chandrila and overthrow Sloane."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}