{"url": "Kuat_Drive_Yards/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Arms manufacturing companies", "Category:Corporate Sector Authority Signatory Sponsors", "Category:Culture of Kuat", "Category:Droid manufacturers", "Category:Galactic Republic organizations", "Category:Imperial organizations", "Category:Kuat Drive Yards products", "Category:Shipwrights", "Category:Shipyards", "Category:Techno Union corporations", "Category:Vehicle manufacturing companies"], "nodes": [{"tag": "h1", "text": "Kuat Drive Yards"}, {"tag": "p", "text": "Kuat Drive Yards, KDY, or Kuat Engineering was the largest military shipbuilding corporation in the galaxy at the time of the Galactic Civil War. It was based on the planet Kuat."}, {"tag": "p", "text": "Kuat Drive Yards mainly sold its products to the Galactic Empire, and the Galactic Republic previously. Many Kuat products could be found in TIE Fighters, armored fighting vehicles such as AT-STs and AT-ATs, Star Destroyers, and other military vehicles. Kuat Drive Yards did not sell only to the Imperials, however; many planetary governments purchased its weapons for the purposes of defending their planet from the war.\nThese circumstances helped to make Kuat Drive Yards one of the most famous corporations in the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Founding and early history"}, {"tag": "p", "text": "Kuat Drive Yards was founded in the early days of the Galactic Republic by a group of Human aristocrats known as the Ten. These merchants, led by the Kuat family, joined together with the intent to create the largest, most efficient shipyard in the galaxy. They hired terraformers to change the planet Kuat in the Core Worlds into a paradise world while engineers designed and built the first six of many orbital shipyard complexes."}, {"tag": "p", "text": "That project faced opposition from fledgling trade consortia as well as internal dissent within the merchant families. Despite their use of sabotage, espionage, and hired pirate groups, the trade groups failed to stop the Kuat families, who settled their internal differences by signing the Inheritance Exemption which gave the Kuat family perpetual control over Kuat Drive Yards."}, {"tag": "p", "text": "After these early difficulties, the shipyard grew rapidly in both size and prestige, and by 5000 BBY it was known as a first-class galactic ship builder. In the millennia that followed, the shipyards became noted for building warships that served in the Republic Navy throughout both the Old Sith Wars and the New Sith Wars."}, {"tag": "p", "text": "KDY was not a top tier shipyard, however; that title was held by the triumvirate made up of Core Galaxy Systems, Corellia StarDrive, and Hoersch-Kessel Drive, Inc.. Kuat set its sights on becoming a member of this group, and engaged in a vicious competition with Core Galaxy Systems. Between price wars, industrial espionage, and more underhanded tactics, Core Galaxy suffered severe losses and was forced to sell its assets. In 500 BBY KDY bought the company and retired the Core Galaxy Systems name. With this purchase, Kuat took its place as the top ship builder in the Old Republic. It was soon joined by the Corellian Engineering Corporation (CEC) which had bought out Corellia StarDrive when the older company lost its entire senior design team in a shuttle accident."}, {"tag": "h3", "text": "Expansion and investment"}, {"tag": "p", "text": "KDY quickly earned a reputation as a predatory company. Besides Core Galaxy, Kuat rapidly bought up a number of other small ship builders, and built factories on a number of worlds outside the Kuat Sector. Belderone, Rothana, and Xa Fel were among many worlds to contribute to the KDY construction effort, either directly or through subsidiary corporations such as Rothana Heavy Engineering and Ubrikkian Industries.\nKDY also had a tendency to create subsidiaries to focus on specific markets:"}, {"tag": "p", "text": "KDY was also a significant member in several commercial and trade groups and had two members on the Trade Federation Directorate. The company was also part of the Techno Union, but at some point prior to the Clone Wars decided to cut their ties. Kuat Drive Yards was also a founding member of the Corporate Sector Authority. In exchange for an investment of 50 quadrillion credits, half in direct gifts of credits and equipment, the other half in the purchase of CSA stock and bonds, KDY received a position as a signatory sponsor, allowing it complete access to advertise and sell its products in the Corporate Sector, as well as extremely discounted prices for bulk goods and raw materials which were necessary for the large-scale construction KDY often undertook."}, {"tag": "p", "text": "In the centuries prior to the Clone Wars, Kuat Drive Yards entered into a pronounced rivalry with Rendili StarDrive, challenging Rendili's dominance in the supply of small cruisers to Planetary Security Forces by constructing a number of even larger warship designs. These included several massive Star Destroyers, Battlecruisers, and Star Dreadnoughts, which first came into service as part of the Kuat sector defense fleet. KDY's first battlecruiser, the two thousand, five hundred-meter Procurator-class, was launched in 200 BBY, and became the template for a series of ever-larger and more-powerful battleship designs aimed at attracting contracts from wealthy Core planets, sectors, and powerful mercantile interests. The Procurator-class was refined several times before being supplanted by the four-thousand-meter Praetor-class battlecruiser. KDY's first Star Dreadnought design, the eight-kilometer Mandator-class, was launched twenty years before the Clone Wars and triggered a slew of orders by wealthy sectors for similar battleships."}, {"tag": "p", "text": "Rendili StarDrive was skeptical of the utility of such large ships, which fell well outside the warship restrictions of the Ruusan Reformations and consequently could be equipped only with short-ranged, local hyperdrives. Nevertheless, KDY's advertising won the ear of senators from wealthy Core Worlds sectors, who soon began buying Star Destroyers, Battlecruisers and Star Dreadnoughts for their defense fleets. Some of KDY's experimentation with large designs came about due to their membership in the Techno Union. After the split, KDY decided to create new starships only for the Galactic Republic."}, {"tag": "h3", "text": "Clone Wars through the Battle of Yavin"}, {"tag": "p", "text": "Just prior to the Invasion of Naboo, KDY's advertising had won over many Core Worlds senators: seven of its Star Dreadnoughts were in service - three defended Kuat itself, while the Azure, Ixtlar, Alsaka and Humbarine sectors had bought one each. Meanwhile, dozens of its battlecruisers defended Core and Colonies sectors. It was expected that KDY would support the Trade Federation in its opposition to the Galactic Senate's proposed re-taxation of trade routes in the Outer Rim. However, relations between the two entities soured considerably when Nute Gunray orchestrated the assassination of the rest of the Trade Federation Directorate, including the two Kuati delegates, at the disastrous Eriadu Trade Summit."}, {"tag": "p", "text": "With KDY and the Trade Federation driven apart, shortly afterwards, KDY's subsidiary Rothana Heavy Engineering was subcontracted by the cloners of Kamino to build a full range of assault starships and combat vehicles for a secret Clone Army."}, {"tag": "p", "text": "Shortly before the Clone Wars, KDY also developed modifications, on behalf of the Jedi Order, to the Delta-7 interceptor design in its research shipyards above Gyndine."}, {"tag": "p", "text": "Despite its earlier Republic commitment, at the beginning of the conflict, Kuat was secretly contacted by the Separatists to build a fleet of heavily armed combat vessels that visually resembled bulk freighters. Some senators later claimed that the Storm Fleet contract was an act of treason, but Chancellor Palpatine called it a simple incident of mistaken corporate connections, and KDY escaped punishment."}, {"tag": "p", "text": "The Clone Army and RHE-built vessels soon saw their first action at the Battle of Geonosis, a skirmish which kicked off the Clone Wars. With a number of major shipyards under the control of the Techno Union and other members of the CIS, Kuat was suddenly besieged with orders for capital ships. Within days of the Battle of Geonosis, an order for an additional 1,000 Acclamator transports was sent. More orders followed for a wide variety of warships, support vessels and ground armor, everything from medical ships to heavy assault walkers."}, {"tag": "p", "text": "Kuat also engaged in espionage against Neimoidia, leading to an increased arms race between the two industrial complexes. Kuat took measures to protect their facilities by increasing the numbers of security personnel, upgrading their sector forces, scattering massive minefields around their respective sectors and cutting off a section of the Hydian Way to traffic. The Republic also placed warships along the outer border of the Kuat system. At this point, Kuat's importance to the Republic was so great that even Trade Federation officials remarked on the need to silence Kuat before any eventual campaign against Coruscant itself. News involving the company was published on digital billboards on Coruscant during the conflict."}, {"tag": "p", "text": "Despite being the single largest and most powerful shipyard in the galaxy, the scale of the Clone Wars was beyond even KDY's ability. In order to keep up with the demand for vessels and match Separatist shipyards, KDY joined forces with other loyal companies such as CEC and Rendili StarDrive. CEC focused on small troop transports, corvettes, and gunships, while Rendili and KDY formed the Victor Initiative Project to share development experience for heavy multi-role warships."}, {"tag": "p", "text": "Two key figures would emerge during this program: Walex Blissex and his daughter Lira Blissex. Walex was assigned to head the Rendili effort, which resulted in the Victory I-class Star Destroyer. The Victory-class was rushed into full production six months early when a Techno Union fleet broke the blockade of Foerost. The Victory Fleet managed to defeat the Bulwark Fleet at Anaxes and won significant support for the concept of heavy capital warships."}, {"tag": "p", "text": "The KDY team led by Lira produced two designs. The first, the Venator-class Star Destroyer was designed to be a multi-role warship and an escort for larger battleships. The Venator was larger than the Victory, and carried a far larger fighter complement. The second design, the Imperator-class Star Destroyer was produced in far fewer numbers during the Wars, but gained an increase in production once the conflict was over. The Tector-class Star Destroyer also began its production line, but had a similar service-record to the Imperator, only heading a few Republic task forces."}, {"tag": "p", "text": "Meanwhile, the Venator suffered from an inauspicious start. Several of the first ships were involved in a Senate scandal which resulted in the loss of Duro. Despite this, the Venator proved itself and led the Republic to issue orders for many thousands of the ships. Over a thousand ships alone would take part in the Battle of Coruscant. Venators and the other KDY warships produced during the war, were promoted as the cause of most Republic victories by the company. By war's end, even heavier designs, like the Mandator II-class Star Dreadnaught, helped fill out the Republic Navy's roster.\nThe company also began producing the military Cardan-class space station, but this design was not fielded until after the war. The Clone War-designed Gladiator-class Star Destroyer was also handed over from Rendili StarDrive and made into a warship that enforced the fringes of galactic society after the end of the war."}, {"tag": "p", "text": "As the war drew to a close, the Venator-class production line slowed down in favor of more Imperators and Tectors. These classes went on to have a more illustrious career under the Galactic Empire, while older ships like the Acclamator and Victory served as support ships. The Venator-class gradually disappeared from regular military forces, seeing service only with private defense forces of various Moffs and underworld factions."}, {"tag": "p", "text": "At the Empire's founding, security was increased and the orbital facilities and space stations were militarized and augmented to ensure continued production of warships. Kuat was issued its own Moff to oversee the sector. In addition, because of Palpatine's desire to expand Imperial rule throughout the civilized galaxy, Kuat kept producing multiple warships and ground vehicles in spite of the Clone Wars being over.\nBecause of their support for Emperor Palpatine, KDY received a majority of the contracts for building up the Imperial Navy. In order to focus on capital ships, Kuat Systems Engineering was folded back into the main KDY line, and several of the starfighter designs were sold to Sienar Fleet Systems.\nFor several decades, KDY maintained a rich catalog of destroyers, cruisers, battlecruisers and battleships for the Empire."}, {"tag": "p", "text": "The pinnacle of the KDY line was to be another Lira Wessex contribution. About 3 BBY, KDY drew up plans for a titanic warship, one even more powerful than the Mandator IIs of the Clone Wars. The new Star Dreadnought design was vehemently opposed by a number of Imperial Admirals, but Darth Vader and Emperor Palpatine took a personal interest in the program.\nAs the Death Star project neared completion, the Imperial Navy changed its mind and most Admirals began to support the concept of \"terror styling\" that the new design represented. It was also hoped that the new ship could provide the Navy their own superweapon to compete with the Death Star."}, {"tag": "p", "text": "Four ships were ordered, though the first ship, Executor, began construction at Fondor, rather than Kuat. There were several possible reasons for this move, including the need for secrecy, Darth Vader's plan to use the construction of the Executor to draw out treasonous officers and Rebel spies, a simple demonstration of superiority by Palpatine over KDY, which had made attempts to remain independent of the Empire, or retaliation for KDY's refusal to participate in any part of the Death Star project.\nIrritated, KDY began construction of the second ship of the class at the same time, also naming it Executor. Meanwhile, the company continued to take contracts from other parties, including an order for custom exploration ships for Alderaan just prior to its destruction."}, {"tag": "p", "text": "Several more special projects were begun as well, notably the Eclipse, a superlaser-armed Star Dreadnought. Despite these new projects, KDY was still able to produce Imperial-class ships at a high rate, allowing the Imperial Navy to reach a strength of at least 25,000 of these ships."}, {"tag": "h3", "text": "The Galactic Civil War"}, {"tag": "p", "text": "The schedule for the four Executor-class Star Dreadnoughts would be radically altered as a result of the destruction of the Death Star by the Rebel Alliance at Yavin. The Executor at Fondor was finished only six months later, with the second ship, renamed Lusankya, completed shortly after. Lusankya was promptly buried under the surface of Coruscant at the behest of Ysanne Isard. The other two ships were given to admirals personally chosen by Palpatine."}, {"tag": "p", "text": "With Executor devastating a number of Laakteen Depot Rebel outposts, the Empire ordered an increase in production of these massive ships. Fondor continued to serve as an alternative construction site, but KDY built a majority of the ships in their own facilities, often rushing them out of dock mostly completed and sending them to smaller facilities for finishing work. This allowed a higher rate of production than otherwise possible, as there were a limited number of slipways capable of holding a ship the size of an Executor-class."}, {"tag": "p", "text": "Besides Star Destroyers, Star Cruisers, battlecruisers, and Star Dreadnoughts, Kuat continued to receive huge orders for smaller capital vessels from the Empire. The Imperial Navy was augmenting its forces, and Kuat was the prime provider for their capital ships. New designs were created during this time to counter the actions of the Rebels, such as the EF76 Nebulon-B escort frigate, the VT-49 Decimator, and Star Galleon, all designed as a reaction to Rebel convoy raids."}, {"tag": "p", "text": "The company was known to cut costs, by building individual modules for use on multiple ship-designs. The command tower on the Acclamator-class was an element commonly used on their small warship designs, and the iconic T-shaped towers used on the Imperial and Executor-classes were also highly modular and used on many warship classes during the company's career. When Alderaan was destroyed by the Empire, Kuat recouped their losses by reusing systems meant for Alderaanian perimeter scout ships and orbital customs stations in their new battlecruiser production lines."}, {"tag": "h3", "text": "Kuat of Kuat"}, {"tag": "p", "text": "During the Galactic Civil War, Kuat Drive Yards was led by Kuat of Kuat. A technically minded aristocrat, Kuat of Kuat made every effort to keep KDY independent of the Empire. One of his greatest fears was nationalization, to the point where he believed that the Rebel Alliance was the better choice. Only pragmatism kept him loyal to the Empire, as Palpatine would quickly crush any attempt by Kuat to join the Alliance."}, {"tag": "p", "text": "Pragmatism also guided many of the decisions made by Kuat of Kuat during his tenure as head of the company. Shortly after the Battle of Yavin, KDY was under siege from a number of directions. Emperor Palpatine was suspicious of Kuat's motives in refusing to bid on the Death Star project (the reason was that the Death Star could potentially replace a large number of capital warships, which would result in a severe decrease in profits for KDY), Prince Xizor of Black Sun was making a play for control of KDY itself, and the Rebel Alliance had recently made a surprise assault on the shipyard facilities to draw Imperial ships away from Fresia."}, {"tag": "p", "text": "Kuat of Kuat managed to respond to all of the threats—he placated Palpatine by having KDY absorb an unplanned cost overrun in a series of battlecruisers, and he set into motion a plan that would implicate Xizor in the death of Owen and Beru Lars, hopefully setting the Rebels and Black Sun against each other. This plan failed, however, when the evidence fell into the hands of Boba Fett, along with the Kuati noble Kateel of Kuhlvult. Kuat attempted to kill Boba Fett to destroy the evidence, which was useless after the death of Xizor, and could lead back to Kuat."}, {"tag": "p", "text": "Kuat of Kuat also had to react to a political play by the other major families on Kuat, led by the Knylenn family. The families bribed Fenald, the Chief of Security for KDY, into aiding their attempt to overturn the Inheritance Exemption. The attempt failed, and Fenald was exposed as a spy. He was replaced by Kodir of Kuhlvult. Kuat did not entirely trust his new chief of security, and became increasingly paranoid, to the point where he ordered the shipyards to be wired with explosives."}, {"tag": "p", "text": "His suspicion was merited; Kodir had been the one to hire Fenald. The entire incident had merely been a ploy for her to become chief of KDY security. In the lead-up to the Battle of Endor, many of these plots came to a head. The Rebel Alliance stationed a squadron of Y-wings in the shipyards to watch over the system and ensure that the Empire did not receive the latest batch of heavy warships. Kodir managed to retrieve the evidence against Xizor from Boba Fett as well as Kateel, promptly returning to Kuat and meeting with the Rebel squadron. Kodir offered a deal with the Rebels—if they would help her take control of Kuat Drive Yards, she would provide support for the Alliance."}, {"tag": "p", "text": "Kuat of Kuat managed to hear the conversation, and decided not to allow anyone to have the shipyards. He began the self-destruction of the shipyard facilities. The Rebel squadron took the opportunity to move in and attempt to steal a number of warships, mainly Lancer-class frigates and EF76 Nebulon-B escort frigates. At the same time, Boba Fett arrived to question Kuat as to why the Technician had been attempting to kill him, and after a brief conversation, Fett took control of the large warship Kuat had chosen as his tomb. While Kuat of Kuat committed suicide, Fett piloted the ship out of the dock, cutting the link for the self-destruct sequence. The explosions ended, with 80% of the docks remaining intact."}, {"tag": "h3", "text": "Post-Endor"}, {"tag": "p", "text": "After the Battle of Endor, the Empire took more direct control of Kuat Drive Yards. Construction continued on both new Executor-class vessels, as well as the Eclipse-class, concerning larger vessels, and they also completed the A-9 Vigilance starfighter, which was released six years after the Battle of Endor. But KDY was no longer the independent company Kuat of Kuat had maintained. Security increased, to the point where the system was guarded approximately as well as Coruscant."}, {"tag": "p", "text": "This didn't stop various raiders from attempting to steal ships or attack the shipyards. One of the most famous incidents took place in 4 ABY, with the Battle for the Eclipse, where the Zann Consortium gained access to secret information inside the vaults of Eclipse. Preceding their goal was a huge fleet battle against both a Rebel and an Imperial task force, which led to the destruction of three Cardan-class space stations and the Star Dreadnought Annihilator."}, {"tag": "p", "text": "The other was the Battle of Kuat in 7.5 ABY. In the buildup to this battle, Warlord Zsinj discovered through his network of spies that Kuat was nearing completion of a new Executor-class vessel. He arranged assistance for a member of the ship's complement to set up a black market ring in exchange for access to the new ship when necessary. Zsinj also hired a collection of privateers, mercenaries, and pirates to create an \"expendable fleet.\" What he did not know, was that the New Republic Wraith Squadron had joined his rag-tag armada, posing as a pirate gang, the Hawk-bats.\nWraith Squadron member Shalla Nelprin was selected to join Zsinj's infiltration group."}, {"tag": "p", "text": "The mission went flawlessly, with the infiltrators seizing the bridge of the ship, the Razor's Kiss, and blasting the vessel out of its berth. The defense ships in the system responded quickly, but Zsinj arrived with his fleet, led by another Star Dreadnought, the Iron Fist. After a short battle in which the Wraiths took the opportunity to plant a locator beacon on the Razor's Kiss, Zsinj retreated with his new acquisition. While the Razor's Kiss would be destroyed shortly thereafter by General Solo's task force, Kuat Drive Yards suffered heavily in the three way battle. Besides the theft of the massive warship, several Star Destroyers were lost, and the shipyards suffered severe damage from the violent escape."}, {"tag": "h3", "text": "Changing ownership"}, {"tag": "p", "text": "Only a year later, the New Republic would return to Kuat. After the death of Zsinj at the Battle of Dathomir, the New Republic Fleet under Admiral Ackbar fought a vicious campaign against Admiral Rogriss and Warlord Treuten Teradoc to capture Zsinj's territory. In response to heavy losses, the Imperial fleet pulled back to regroup. The New Republic took the opportunity to strike at Kuat. The battle was short but intense. The Empire suffered a major blow, with the New Republic claiming their most valuable shipyard."}, {"tag": "p", "text": "It was not a complete victory, however. The entire senior design team fled to Byss aboard the partially completed Eclipse, while the shipyards themselves were heavily damaged and rife with Imperial partisans. It would be years before production could resume at anything approaching previous levels—a painful fact for the New Republic, which found itself in dire need of warships during the Thrawn campaign."}, {"tag": "p", "text": "With the return of Palpatine, the Empire managed to retake the Core, including Kuat, though with the shipyards still under repair, Byss remained the primary shipyard for the Empire. A number of KDY projects were begun at Byss, including a second Eclipse-class vessel and the smaller Sovereign-class. This re-occupation was short-lived, as by 11 ABY Palpatine was finally vanquished at Onderon and Byss was destroyed.\nThe new management of Kuat Drive Yards threw its support behind the New Republic, and participated in the New Class Modernization Program."}, {"tag": "p", "text": "During the war with the Yuuzhan Vong, the shipyards continued to produce warships, especially Star Destroyers, for the New Republic and later the Galactic Federation of Free Alliances. The shipyards were captured by the Vong near the end of the war, despite the extreme emphasis on defending it and other major shipyards, though Kuat was returned to the GFFA at the conclusion of the war relatively unharmed."}, {"tag": "p", "text": "As of 40 ABY, KDY's most recent development was the Galactic-class battle carrier, an enlarged Star Destroyer that formed the backbone of several Galactic Alliance fleets.\nOver 100 years after the Battle of Endor, the Fel Empire bought Pellaeon-class Star Destroyers and Ardent-class fast frigates from Kuat."}, {"tag": "h2", "text": "Facilities and construction"}, {"tag": "p", "text": "The actual Kuat Drive Yards were a collection of various facilities throughout the Kuat System. The primary shipyards made up a nearly solid ring, called the Orbital Array, that surrounded the planet Kuat itself. These stations were split into smaller units, designated as slipways, offices, machine shops, factories, drydocks, or apartments for workers. Most Kuati citizens lived within this ring, never setting foot on the surface of the planet below. The orbital array was lightly armed, sufficient to deal with pirates or small warships, though anything above a frigate was beyond the capabilities of the array's defenses."}, {"tag": "p", "text": "Kuat's two moons, Bador and Ronay, were used for weapons and drive testing, to prevent damage to the main facilities or planet in case of any accidents. Further out were a number of secondary facilities. While the orbital array contained the most important shipyards, they were far from the only ones. A massive belt of stations, docks, and repair facilities orbited at the fringe of the Kuat system itself, making up the bulk of KDY's construction capabilities."}, {"tag": "p", "text": "In addition to the Kuat system, KDY had facilities in a number of other systems:"}, {"tag": "p", "text": "Besides starships and vehicles, KDY produced a line of planetary defense weaponry, including ion cannons, turbolasers, and magnapulse weaponry. These products were advertised as \"The first, last, and only line of defense your planet will ever need!\""}, {"tag": "p", "text": "Kuat slipways utilized a unique method to build large capital ships quickly. To maximize productivity, the hulls of ships under construction were wrapped in an airtight shroud, allowing workers to avoid wearing bulky space suits. This shroud was also part of the launching ceremony for a new ship. The work crew was evacuated, and the atmosphere ignited, burning the material away. The ash would settle on the ship until it moved, when it would be shaken off and the new vessel emerged, clean and tempered."}, {"tag": "h2", "text": "Security"}, {"tag": "p", "text": "Kuat Drive Yards security had a long and convoluted history of being both independent and defenders of both the Republic and the Galactic Empire. In the centuries up until the Clone Wars, the Kuat Sector was protected by a large defense fleet, made up of KDY vessels up to the mighty Mandator-class."}, {"tag": "p", "text": "During the Clone Wars, these defense forces were built up and upgraded, and huge minefields scattered around the sector to dissuade attack. After an incident involving the near defection of the Rendili Home Defense Fleet to the Separatists, Chancellor Palpatine managed to convince the Galactic Senate to nationalize all sector and system defense fleets into the Republic Navy. Kuat's fleet was made up of a disproportionate number of modern and heavy warships, and became a major addition to the Republic Fleet."}, {"tag": "p", "text": "Despite this, Kuat began to rebuild its defense force. Under Kuat of Kuat, Kuat Drive Yards made an arrangement with the Empire to provide its own security. Again, ships bearing the emblem of KDY patrolled the system. These ships were later used in a bombing raid on the Dune Sea in an attempt to kill Boba Fett, as well as other operations to track down the bounty hunter in 4 ABY."}, {"tag": "p", "text": "Despite the security deal made with Kuat, the Imperial fleet became nervous about increasing Rebel raids, and stationed several ships near Kuat to provide a rapid response. The Star Destroyer Tyranny was one such ship. Though it was stationed to defend Fresia, it was sent to repel a Rebel raid on the Kuat shipyards at some point before the Battle of Yavin. Other ships included Interdictor cruisers at Venir and Renegg. Commanding the Imperial forces on Kuat was Captain Anton Kale, an unconventional officer who volunteered for the assignment."}, {"tag": "p", "text": "After the Battle of Endor, the Empire took full control of Kuat's defense. Fifteen Star Destroyers were stationed in the system at all times. These defenders were equivalent to the forces defending Coruscant at the time, though Zsinj's raid quickly defeated them, crippling the Star Destroyer Mauler and destroying the Gilded Claw. Later, the defense of the Kuat System fell to the New Republic, who managed to hold the system, even in the face of the Yuuzhan Vong invasion, until the very end of the war, when it was briefly captured."}, {"tag": "p", "text": "Besides physical defenses, Kuat Drive Yards undertook other measures to protect themselves or prevent capture. Every ship built or upgraded at a KDY facility had secret backdoor codes installed, allowing KDY security forces to access and gain control of that ship, or simply shut it down. The KDY facilities and some ships were fitted with secret self-destruct mechanisms to prevent capture. Kuat of Kuat attempted to use these to destroy the orbital array above Kuat, but was thwarted by the actions of Boba Fett, who saved 80% of the yards."}, {"tag": "h2", "text": "Kuat Traffic Control"}, {"tag": "p", "text": "Kuat Traffic Control was a highly organized system run by KDY that both reduced the number of ships traveling in the Kuat System and increased security by a vast degree. The system was based on a concept of staging areas. Three stations, each dozens of kilometers in size, were positioned on the fringes of the Kuat system, far away from the valuable shipyards and orbital facilities."}, {"tag": "p", "text": "Each of the three ports was assigned a role. Kuat Passenger Port handled all civilian travel to and from Kuat. Kuat Freight Port managed the flow of goods and material into and out of the system. Finally, the Imperial Transfer Post was a staging area for all military operations in the system, as well as for deliveries of warships. Each port was only accessible by four systems, two inbound and two out. Passengers entered from the Redrish and the Ulion systems and departed to the Drurish and the Kidir systems. Freight was imported from the Monadin and the Horthav systems, and exported to Venir and Renegg. All information on the staging systems for the Imperial port was classified."}, {"tag": "p", "text": "Once in the system, all traffic to and from the four ports was controlled by Kuat Central Authority, though during combat situations, warships defending the system can take command of traffic control. Ships inside the system were sent to a number of nav points, and then routed to their final destination within the system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The actual location of the Kuat Drive Yards facilities differs depending on the source. Coruscant and the Core Worlds, Empire at War and The Essential Atlas show the yards as being in an orbital ring around the planet Kuat, while Platt's Starport Guide and The Essential Guide to Planets and Moons claim that the shipyards are in a massive ring around the Kuat system itself. Nothing precludes the existence of both rings, however."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}