{"url": "Kuati/Legends", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:Human races", "Category:Kuati"], "nodes": [{"tag": "h1", "text": "Kuati"}, {"tag": "p", "text": "A Kuati was a Human from the planet of Kuat, in the Core Worlds. Their society was matriarchal and dominated by powerful ruling families that constantly fought among themselves and employed telbuns to prevent inbreeding. Kuati nobles referred to themselves in the royal we."}, {"tag": "p", "text": "Kuati were widely known across the galaxy for their shipbuilding skills and their control of Kuat Drive Yards. These shipyards would build warships for a variety of governments including the Galactic Republic, the Galactic Empire and the New Republic."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The origin of the Kuati was traced thousands of years ago when a group of ten wealthy merchant families banded together with the purpose of forming the biggest and most influential shipbuilding concern in the galaxy. Initial obstacles were faced at the hands of the fledgling trading consortiums that were ancient predecessors of the greedy Trade Federation. These consortiums attempted to stop the merchant families from realizing their goal. This saw acts of espionage, sabotage and supposed pirate attacks being made against them with the source of these occurrences not being able to be traced. Ultimately, the Human aristocratic families settled the planet Kuat in 25,000 BBY where the Kuati merchants hired the finest terraformers, ecologists and animal breeders to turn the barren world into a paradise. At the same time, engineers worked to create half a dozen shipyards to form the Kuat Drive Yards."}, {"tag": "p", "text": "In the years of the Republic, the leading merchant family amongst the Kuati was the Kuat family that had a long storied history of being one of the Core Founders. This saw Kuat hold an important role and voice in the Galactic Republic as it was responsible for constructing the vast fleet of ships. These starships were seen in many battles such as the Old Sith Wars and the New Sith Wars. During the reign of Finis Valorum, Senator Risi Lenoan acted as the Kuati representative and was handpicked delegate by Onara Kuat to ensure that the person benefited the Kuat Drive Yards and ultimately the Kuat family by extension. By the time of the Separatist Crisis, Senator Risi Lenoan represented Kuat and was present during the unveiling of a new starfighter for the Jedi Order. Senator Lenoan was present alongside Project Engineer Lead Walex Blissex where they presented the Delta-7 Aethersprite-class light interceptor to Jedi officials Adi Gallia and Aayla Secura."}, {"tag": "p", "text": "Senator Lenoan served faithfully until she was removed from office when questions came regarding her book keeping and KDY funds. As a result, Onara Kuat made Giddean Danu as the new Kuati Senator and believed him to be a malleable political figurehead. However, his views opposed that of the Kuat family as he did not favor the centralization of power within the Republic and supported Jedi oversight during the Clone Wars. Kuat of Kuat believed Senator Danu to be an effective advocate of Kuati independence and any motion to remove him failed. Giddean Danu even declared his intention to reform Kuati politics and investigating Onara Kuat's family. During the Clone Wars, the Republic stationed increased defensive forces at Kuat due to fears over conflict with nearby Neimoidia. This saw the Kuati attempt to infiltrate Neimoidia with modified worker droids equipped with concealed spyware. However, fifteen of these spy-droids were captured in a highly publicized event that was claimed as a victory in stopping the Kuati from stealing Neimoidian secrets."}, {"tag": "p", "text": "Following the Declaration of a New Order, the Galactic Empire was established and the Kuati aristocracy generally remained loyal to the new government due to their strong heritage in supporting the Republic along with its successors. Governance of the Kuat system falling into the hands of Moff Thichis Kuras who was a Kuati though one from the lesser nobility. His appointment was made by Emperor Palpatine in order to balance Kuat's military security needs with Kuati's aristocratic sense of self-governance along with its regal pride. However, Senator Giddean Danu who was a representative to the Imperial Senate secretly supported the efforts of Mon Mothma as well as Bail Organa to undermine the Empire's authority. In this time, the Kuati's sought to ensure their continued economic success through vast commercial starship construction operations. As a result, the great Kuati merchant houses became astonishingly wealthy and notoriously insular during the years of the New Order. This was due to Emperor Palpatine's reign bringing about the largest military buildup in galactic history."}, {"tag": "h2", "text": "Society"}, {"tag": "p", "text": "Kuati houses were often composed of a single extended aristocratic family. Each house had long ago devised a system to prevent unfortunate political alliances that sometimes were brought about as a result of ill-advised marriage."}, {"tag": "p", "text": "Amongst outsiders, it was believed Kuati politics were labyrinthine and cutthroat. Traits such as nepotism, graft, corruption and cronyism were abound with the lines between an aristocrat, business executive and politician being blurred amongst their people."}, {"tag": "p", "text": "An ancient nautical tradition amongst the Kuati involved using a gilded blade to cut a symbolic tether attached to a prototype ship."}, {"tag": "h2", "text": "Notable Kuati"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}