{"url": "Kubindi", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Articles with conflicting sources", "Category:Articles in need of updating", "Category:Galactic Empire planets", "Category:Kubindi locations", "Category:Outer Rim Territories planets"], "nodes": [{"tag": "h1", "text": "Kubindi"}, {"tag": "p", "text": "Kubindi was a planet located in the galaxy's Outer Rim Territories that was the homeworld of the insectivorous Kubaz species. Its population was enslaved by the Galactic Empire, and the Kubaz spy and Kubindi native Garindan ezz Zavor plotted to free his world and its people from Imperial oppression."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the galaxy's Outer Rim Territories, in grid square T-9 on the Standard Galactic Grid, the planet Kubindi was connected via hyperspace route to the world Formos and the space station Junkfort Station."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Galactic Empire had long sabotaged the Kubaz's technological advances to keep them from leaving their homeworld of Kubindi. However, at some point following the founding of the Alliance to Restore the Republic in 2 BBY, the Empire deceived the species into believing that the Alliance was the responsible party for the sabotage."}, {"tag": "p", "text": "As such, the Empire promised to help the Kubaz gain a foothold in galactic trade and politics. In exchange, fifty-one students, including Garindan ezz Zavor, were chosen from the academies on Kubindi to supposedly study under the Empire as diplomats before returning with accolades to their mates and hives."}, {"tag": "p", "text": "Instead, the students were indentured and trained as spies. Meanwhile, the rest of Kubindi's population was enslaved, and an Imperial blockade was installed in the planet's orbit, though the Kubaz themselves were unaware of the Empire's deception. However, Garindan's indoctrination did not take, and, by the year 0 BBY, he was planning to free his world and fellow Kubaz from the oppression of the Empire."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Kubindi was the homeworld of the sentient Kubaz, a species of hive-dwelling insectivores that lived in clans. A cultured people led by elders, they spoke Kubazian, a language composed of a unique series of whirring syllables, and were taught in crèches and academies. Garindan ezz Zavor came from a respectable clan on Kubindi known for breeding and farming a sought-after strain of picolet beetle. The Kubaz seldom traveled off-world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kubindi was first mentioned in the new Star Wars canon in Star Wars: Force Collection, a mobile card game that initially launched on September 4, 2013. Although the launch of Force Collection predates the franchise's canon reset of April 25, 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon."}, {"tag": "p", "text": "Kubindi was originally created for Galaxy Guide 4: Alien Races, a 1989 Star Wars Legends supplement written by Troy Denning for Star Wars: The Roleplaying Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}