{"url": "Kudon", "categories": ["Category:Canon articles", "Category:Kudon", "Category:Sentient species"], "nodes": [{"tag": "h1", "text": "Kudon"}, {"tag": "p", "text": "Kudon were a sentient species in the galaxy. A number of Kudon resided on the moon Kudo III. During the Clone Wars, the Confederacy of Independent Systems enslaved a village of Kudon, forcing them to work in a foundry to create battle droids. The Kudon were freed when Jedi General Anakin Skywalker infiltrated the foundry and discovered the slave operation. In the time of the Cold War between the New Republic and the First Order, Mek Nu'Tiv was a Kudon trader."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Kudon were a species with several canine features, including long furred snouts and pointed ears."}, {"tag": "p", "text": "As well as having fur, Kudon could also have hair on their heads, although some did not, and some had additional facial hair in the form of a beard. Their fur could be various colors, including shades of brown, gray, green, or yellow, and their hair could be brown or red. Kudon possessed curved horns on either side of their heads, and sharp lower teeth that protruded from their mouths. Their hands had four clawed fingers, and their feet had four toes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A village of Kudon existed on Kudo III, a moon of Kudo. After the outbreak of the Clone Wars, the Kudon species remained neutral, choosing not to align with either the Galactic Republic or the Confederacy of Independent Systems."}, {"tag": "p", "text": "The Separatists constructed a battle droid foundry on Kudo III, gassing the village and taking its inhabitants to labor as slaves in the foundry. Hoping that the Republic would attack the foundry and kill the innocent Kudon, they spread false rumors about the foundry to Republic Intelligence, who assumed the Kudon had chosen to work for the Separatist cause. After an attack in the Corvair sector carried out by droids created in the foundry, Admiral Wullf Yularen made plans to strike and destroy it. Jedi General Anakin Skywalker, concerned about the civilian losses, devised a different approach, entering the foundry alone. Once he learnt that the Kudon were being enslaved, he liberated them, allowing them to take blasters and fight back against their captors."}, {"tag": "p", "text": "During the Cold War between the New Republic and the First Order, the Kudon trader Mek Nu'Tiv acquired an Alderaanian data archive. The Resistance learnt of the archive, as did the smugglers Han Solo and Chewbacca, but neither knew of the data it contained. General Leia Organa sent Poe Dameron and Black Squadron to steal the archive, and they eventually succeeded with the anonymous help of Solo and Chewbacca."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kudon first appeared in the comic Poe Dameron Annual 2, written by Jody Houser, illustrated by Andrea Broccardo and published on August 29, 2018."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}