{"url": "Kuliquo_belt", "categories": ["Category:Canon articles", "Category:Asteroid fields", "Category:Galactic Empire locations", "Category:Mining areas"], "nodes": [{"tag": "h1", "text": "Kuliquo belt"}, {"tag": "p", "text": "The Kuliquo belt was an airless and lightless asteroid field used for mining for the Galactic Empire's war effort during the Galactic Civil War. In 3 ABY, the Rebel Alliance's 61st Mobile Infantry deployed a strike force of twenty rebel soldiers to sabotage mining machinery at the Kuliquo belt, and one of the soldiers, Roach, returned with a piece of gold after the mission was complete."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Kuliquo belt was an asteroid field which lacked an atmosphere or light and was located within the vicinity of the Rimma Trade Route. The asteroids contained resources like gold."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, asteroids of the Kuliquo belt were mined for resources to supply the Galactic Empire's war effort. In 3 ABY, the Rebel Alliance's 61st Mobile Infantry targeted the Kuliquo belt asteroid mines as part of its campaign Operation Ringbreaker, which targeted multiple locations that supplied war resources to force redeployments from the Kuat Drive Yards, the 61st's final target. As planned by the 61st's assumed captain, Hazram Namir, a strike force of twenty rebel soldiers Namir trusted to sabotage machinery."}, {"tag": "p", "text": "After the soldiers completed their mission, they returned to the rest of their company and Roach, a soldier who Namir had been urged to pick for the strike force, gifted the assumed captain a piece of gold the size of her fist which she had acquired. Meanwhile, the Rebel Alliance Intelligence Service reviewed Operation Ringbreaker, with General Crix Madine listing the Kuliquo belt in a report as one of the targets on the campaign's first phase. The archivist Hendri Underholt later obtained the report and included it among a compilation of information called the The Rebel Files."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kuliquo belt first appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}