{"url": "Kumru/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Corellian Trade Spine", "Category:Galactic Republic planets", "Category:Javin sector planets"], "nodes": [{"tag": "h1", "text": "Kumru"}, {"tag": "p", "text": "Kumru was a thriving industrial world positioned along the Corellian Trade Spine in the Javin sector of the Outer Rim Territories. The planet was originally governed by the Mugaari species, who surrendered their territorial holdings to the Galactic Republic following hostilities. To the aversion of many of their kin, Kumru's substantial Mugaari population coexisted well with Humans, Lutrillians, and Nothoiins."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kumru was a planet located in the Kumru system of the Javin sector, within the Greater Javin region of the Outer Rim Territories' Western Reaches. It lay along the Corellian Trade Spine hyperlane, between the Aztubek and High Chunah systems."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Along with eleven other regional worlds, Kumru was originally inhabited by the sentient Mugaari species in what was formerly known as Mugaari Space. The Mugaari ruled over this semi-independent collection of star systems for thousands of years, remaining suspicious of the Galactic Republic, which considered their territory a part of Wild Space in those times."}, {"tag": "p", "text": "Only scouts and the most daring traders braved the imperfectly surveyed region of space around Kumru, longing to establish lasting trading relationships with two other local alien civilizations, the Lutrillians and Nothoiins. Yet no such contact could be made without the Mugaari taking an unhealthy portion of the profits. The Republic ended this stalemate by defeating the Mugaari in a brief, one-sided war, allowing Mugaari Space to be reconstituted as the Javin sector. The Greater Javin region soon blossomed into an economic powerhouse, and Kumru itself became a thriving industrial world."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Kumru supported a substantial population of Mugaari who assimilated with Humans, Lutrillians, and Nothoiins far more readily than other Mugaari colonies. Such diversity caused many Mugaari to loathe their Kumru cousins."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kumru was created for the 2004 Wizards of the Coast online article \"Galactic Gazetteer: Hoth and the Greater Javin,\" a supplement for the Star Wars Roleplaying Game. The 2009 reference book The Essential Atlas further developed Kumru's lore."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}