{"url": "Kuna%27s_Eye/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Blue giants", "Category:Moddell sector stars"], "nodes": [{"tag": "h1", "text": "Kuna's Eye"}, {"tag": "p", "text": "Kuna's Eye was a blue giant star in the star system of the same name, located within the Moddell subsector of the Outer Rim Territories' Zuma sector. It was less than 1,000 light-years above the galactic plane, within the thin disk and the Inner Zuma Region. In 43 ABY, it was still relatively young and was surrounded by a protoplanetary disk, which contained minerals, metals, and alloys. The parent system of Kuna's Eye was frequented by prospectors, whose needs were served by the space station and shadowport known as the Mote."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The star Kuna's Eye was a blue giant in the Kuna's Eye system, located at galactic coordinates H-16 in the Moddell subsector of the Zuma sector within the Outer Rim Territories. It was located less than 1,000 light-years above the galactic plane within the thin disk—which extended 1,000 light-years above and below the plane—thus making it a part of the Inner Zuma Region. Kuna's Eye, along with the other Kuna worlds, formed part of the Kuna constellation that was visible from the planet Maya Kovel."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Members of two sentient species, the Tulgah and the Jindas, intended to colonize the Kuna's Eye system from the planet Eriadu circa 130 BBY, but their colony ship, the Free Enterprise, crashed on the Forest Moon of Endor."}, {"tag": "p", "text": "As of 43 ABY, the star was still relatively young and was surrounded by a protoplanetary disk that was rich in minerals, metals, and alloys. Prospectors frequented the area, their needs served by the Mote, a cobbled-together space station and shadowport at the edge of the disk, near the system's periphery."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kuna's Eye and its system were introduced in the \"Endor and the Moddell Sector\" article—authored by Craig Robert Carey, Daniel Wallace, and Jason Fry—in Star Wars Gamer 9, which was released on March 1, 2002. They were later mentioned in the article \"Castaways of Endor,\" written by Wallace and Robin Pronovost and released on December 1, 2008, on StarWars.com for the members of the website's registration-exclusive fanclub, Hyperspace, which has since been retired. The star and the system were later given an entry and placed on a map in the 2009 Del Rey reference book The Essential Atlas, written by Wallace and Fry, in the \"A Closer Look: Endor and the Moddell Sector\" chapter. This section gives a brief description of several astronomical objects, planets, and stars in the sector and supplies historical references and illustrations."}, {"tag": "p", "text": "Some confusion surrounds the sectoral location of the star. The Essential Atlas states that it is located in the Moddell subsector, which is said to be a freestanding subsector, while the newer Star Wars: The Essential Atlas Online Companion says that the Moddell is a subsector of the Zuma sector. This article assumes that the information from the Online Companion is correct."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}