{"url": "Kupalo", "categories": ["Category:Legends articles", "Category:Agents of the Galactic Empire", "Category:Alliance Fleet officers", "Category:Humans", "Category:Males", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Kupalo"}, {"tag": "p", "text": "Kupalo was a Human male Rebel tactical officer who was captured during the Battle of Hoth and brainwashed into becoming an Imperial double agent."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shortly before the Battle of Hoth, Kupalo served onboard the Mon Calamari Star Cruiser Defiance as Commander and Tactical Officer under Admiral Nammo. Kupalo was recognized as highly competent and capable officer, earning the respect of his superior. Kupalo was present on the surface of Hoth at the time of the infamous defeat for the Rebels. He was unable to escape, and was taken prisoner by the invading Imperials."}, {"tag": "p", "text": "The Empire was able to discover Kupalo's status within the Alliance and hatched a plan to get a high placed agent within the ever-growing revolutionary group. Kupalo underwent extensive Imperial 'conditioning', a process that not only created total obedience and loyalty to the Empire among its victims, but left them \"empty shells of their former selves\"."}, {"tag": "p", "text": "Getting the new double agent back into the Alliance, in his former position, without arousing suspicion was a challenge that took careful consideration on the part of the Empire. The answer they came upon was simple, but ultimately effective. They leaked information of an Imperial prisoner Dreadnaught, VTR-LX, that was on its way to a penal station and carrying Rebel prisoners of war. The Dreadnaught and its attendant vessels, Assault Gunboats from Tau Squadron and Delta-class JV-7 escort shuttles from Manticore Squadron, stopped off at a civilian spaceport for refueling. It was here that the Rebels chose their moment to strike."}, {"tag": "p", "text": "X-Wings from Red Squadron, including pilot Ace Azzameen, along with Y-Wings from Green Squadron dropped out of hyperspace just as the Dreadnaught was finishing its refueling at Calast space station. Though the fighters were able to destroy the Gunboats, the Dreadnaught itself and the Escort Shuttles were able to escape into hyperspace, along with the POWs. Quick thinking on the part of Tactical Officer Commander Devers meant that the Rebels could locate the only penal station on the Dreadnaughts hyper vector, the XQ2 Platform Bundil II."}, {"tag": "p", "text": "The fighters took off in fast pursuit, entering the area almost right on top of the Dreadnaught. Red Squadron quickly dispatched the Escort Shuttles and proceeded to engage the TIE Fighters that had left the hangars of the platform, while Green Squadron attacked the Dreadnaught, as per their orders to disable the starship. When its shields finally gave, a furious ion cannon bombardment from the Y-Wings disabled the Dreadnaught, making a boarding action possible."}, {"tag": "p", "text": "Effectively defenseless, the Dreadnaught was unable to prevent the assault transport carrying elite commandos of Storm Unit from boarding the crippled vessel. With the fighters flying cover from attacking TIEs, the commandos were able to retrieve the POWs and escape back to Defiance. Unbeknownst to the Rebels, their greatest prize was in fact a secret weapon for the Empire."}, {"tag": "p", "text": "With the Mon Calamari Cruiser Liberty tasked with hunting the cause of the shipping attacks in the Vilonis sector, Ace Azzameen's Squadron were transferred to the lone capital ship to replenish crewmen lost in a recent engagement. The ship also needed a new Tactical Officer, it was the perfect position for the newly reclaimed commander. Together, Liberty and her new recruits were able to put a stop to the TIE Experimental Project."}, {"tag": "p", "text": "However, Kupalo was not to remain in place for long. Liberty's next campaign was to bring in an Imperial defector, Commander Zaletta. Kupalo chose his moment well. With Rebel forces jubilant from their success, Kupalo called in the Imperial II-class Star Destroyer Subjugator and the Interdictor Cruiser Restrainer hoping to destroy the Nebulon-B Frigate Redemption, Zaletta and possibly even Liberty herself in glorious, swift stroke. It is also possible that with Zaletta's intricate knowledge of secret Imperial projects (including some information regarding construction of the Death Star II) and would have known about Kupalo's involvement with the Empire, so Kupalo would have wanted to eliminate him; this, however, is pure speculation."}, {"tag": "p", "text": "Nonetheless, because of the valiant efforts of the starfighter pilots and the crew of the Liberty and Redemption, the trap failed and the Rebels were able to escape. Kupalo was able to temporarily cast blame on Zaletta, but he knew it would not hold for long. He realized he had to escape, and render Zaletta's defection useless to the Rebellion. He decided to steal Zaletta's shuttle, AA-23, which contained all the information Zaletta had brought to the Alliance. Blasting his way out of the hangar bay, Kupalo also planted charges that destroyed much of the hangar, putting it out of commission for some time. He eluded three pursuing X-Wings by launching homing mines from a hidden compartment on the shuttle's ventral surface, destroying them, and then escaped to hyperspace."}, {"tag": "p", "text": "Knowing he would no doubt make multiple jumps to hinder pursuit, Ace Azzameen and wingmate Olin Garn were dispatched in A-Wings to pursue him. They were able to catch him at the first exit point he made and, despite a group of Gunboats and another barrage of homing mines, the pair were able to damage his engines and force him into submission. Kupalo, however, had yet another contingency plan. He called in the Star Destroyer Imperator, hoping to be picked up. Fighting courageously, Garn and Azzameen were able to single-handedly destroy a huge number of attacking TIE Starfighters, preventing them from reaching the shuttle and the Assault Transport sent to recover it. Kupalo was brought back to Liberty, where he was imprisoned and treated, being replaced in his duties by Commander Zaletta himself."}, {"tag": "p", "text": "As expressed by Liberty's commanding officer Admiral Yamarus, it is doubtful whether he ever fully recovered."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}