{"url": "Kunra", "categories": ["Category:Legends articles", "Category:Jeedai Heretics", "Category:Males", "Category:Shamed Ones", "Category:Yuuzhan Vong warriors"], "nodes": [{"tag": "h1", "text": "Kunra"}, {"tag": "p", "text": "Kunra was a Yuuzhan Vong Shamed One who served as the leading lieutenant of Nom Anor in the revolutionary movement constructed around the Jeedai heresy."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Background and character"}, {"tag": "p", "text": "Kunra was a tall, capable warrior, the only outward indication of his Shaming being the fact that he had stopped adding to his incomplete pattern of warrior tattoos. He also displayed acts of cowardice. By 28 ABY, he was the leading male in one of the small groups of outcast Yuuzhan Vong who lived deep in the rusting underlevels of Coruscant, away from the rest of the Yuuzhan Vong on the Vongformed surface of Yuuzhan'tar."}, {"tag": "p", "text": "The fact that Kunra was physically healthy was not unusual among these outcasts—although some of them had been Shamed in the usual way, through the failure of their biotic implants to graft properly, a number of others were regarded as having broken caste due to their association with botched operations in the course of the war against the infidels. Particularly prominent among them were several exiles from Domain Esh, who had been Shamed when the female warrior Niiriit Esh participated in an unsuccessful mission, although the failure had actually been the fault of the mission commander, Executor Nom Anor. These Yuuzhan Vong, whether they had been formally disgraced or fled to escape punishment, regarded their Shaming as an injustice inflicted by corrupt and incompetent rulers, and by way of counterpoint, they came to see the Jedi Knights not as enemies, but as liberators who would trigger a revolution in Yuuzhan Vong society and restore their former status. As outcasts, this belief combined with the ancient longing of the physically Shamed for restoration onto the path of physical exaltation, and produced a syncretic religious and social-revolutionary movement known as the Jeedai heresy."}, {"tag": "p", "text": "Among these Yuuzhan Vong, however, Kunra stood apart. In contrast to many of the others, he did not use his domain name in defiance of his Shamed status, nor did he ever divulge any details about his past or denounce the injustice of whatever event had led to his becoming outcast; and while he never challenged the other heretics' belief that the Jeedai could help them recover their status, he kept his thoughts and opinions largely to himself."}, {"tag": "p", "text": "When Nom Anor himself joined Kunra and Niirit's group, following his disgrace after the Battle of Ebaq, the former Executor eventually intuited that cowardice had played a part in Kunra's shaming."}, {"tag": "h3", "text": "Time with Nom Anor"}, {"tag": "p", "text": "Kunra, for his part, made no secret of the fact that he distrusted Nom Anor when the former Executor joined his group. Partially, this was because the high-ranking Intendant displaced him as the leading male, and his jealousy was sharpened when Niiriit—to whom Kunra was attracted—started to prefer Anor's company over his own. It was only after their camp was discovered and destroyed by a raiding-party of Warriors that Nom Anor and Kunra were propelled into close cooperation - and it was at this time too that Nom Anor discovered the Warrior's cowardice."}, {"tag": "p", "text": "According to Kunra's own account, he had been talking to the camp's night picket, Yus Sh'roth, when the warriors attacked and fled headlong, leaving the aging Shaper to fight the attackers alone. When Kunra was injured during the subsequent stages of their escape, Nom Anor saved his life, believing that his understanding of the warrior's weakness gave him leverage over him and made him a pliable and useful servant."}, {"tag": "p", "text": "Kunra, as the only other survivor of their group, was now the only other Shamed One who knew Nom Anor's true identity, and when the ex-Executor assumed the identity of Yu'shaa, Kunra, along with Niiriit's brother, Shoon-mi Esh, became one of his lieutenants in spreading the message of the Jeedai and fomenting revolution and, subsequently, saved him from an assassination attempt by the jealous and ambitious Shoon-mi. Kunra admitted his own suspicions that the \"Prophet\" would abandon them immediately if he saw a chance to regain Supreme Overlord Shimrra's favor, but he told Nom Anor that he believed his leadership also gave the Shamed Ones their own chance at redemption, and, for that reason, he was prepared to support him."}, {"tag": "p", "text": "Over the next few months, Kunra became the second-in-command of the revolutionary underground on Yuuzhan'tar. Officially, he was Yu'shaa's bodyguard and herald, but he also became the head of the secret terrorist network embedded within the Heresy, who quietly and ruthlessly rooted out dissenters, ambitious opportunists and infiltrators among the movement. An odd dynamic developed, between Kunra's cynical pessimism and his knowledge of the hypocrisy at the heart of the heresy, and his meek willingness to help Nom Anor and his hope that somehow, the revolution could be made to work."}, {"tag": "h3", "text": "Leader of the Jeedai heresy"}, {"tag": "p", "text": "Just before Nom Anor left his followers to travel to Zonama Sekot with Tahiri Veila and Corran Horn, he noticed for the first time that Kunra was twisting his words during meetings. The former warrior seemed to be pushing an agenda of his own. Away from Coruscant, however, the revolution ceased to matter for Nom Anor, as he betrayed the heretics and secured his own restoration to favor as Prefect of Yuuzhan'tar. In the interim, however, Kunra took over leadership of the movement, and at some point he made contact with Galactic Alliance agents on Coruscant, including Wraith Squadron operative Baljos Arnjak. When Nom Anor once more assumed the identity of Yu'shaa, in an attempt to dissuade the heretics from attacking the Place of Sacrifice, his former lieutenant manipulated his words, inciting the Shamed Ones to greater frenzy."}, {"tag": "p", "text": "After the Battle of Yuuzhan'tar the Shamed Ones at last received their freedom, with the Yuuzhan Vong pledging to abandon their warlike ways and soften the caste structure."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}