{"url": "Kurt", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Beast Riders", "Category:Males"], "nodes": [{"tag": "h1", "text": "Kurt"}, {"tag": "p", "text": "Kurt was a Human male native to the Inner Rim Territories world of Onderon. A member of the Beast Riders of Onderon's wilderness, Kurt was the flight leader of several squads, or \"wings,\" of drexl-mounted warriors in the Beast Rider army."}, {"tag": "p", "text": "Under the command of the superior officer Gobee, Kurt saw action during the final battle of Onderon's centuries-long civil conflict, between his Beast Rider kin and the city-dwellers of Iziz, Onderon's only civilized metropolis. He assisted Gobee by eliminating Iziz's perimeter defenses, and then suppressing the turbolaser bombardment originating from the rooftop of the Iziz Royal Palace. Kurt's actions led to the capture of the city as well as the subsequent defeat of the Iziz forces."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Kurt was a Beast Rider from the wilderness of the planet Onderon, and by the year 4000 BBY, he achieved the rank of flight leader in the Beast Rider army. As a flight leader, Kurt commanded several squads, or \"wings,\" of drexl-riding warriors. He himself was the subordinate of Commander Gobee."}, {"tag": "p", "text": "In the year 4,000 BBY, the centuries-long conflict that plagued Kurt's homeworld between his beast-riding people and the citizens of Iziz, Onderon's only city, was finally drawing to a close. The Beast Riders had risen up against the dark side-worshiping city-dwellers, who were led by the sorceress-Queen Amanoa, whose own power stemmed from the memory of the deceased Dark Lord of the Sith Freedon Nadd. Refusing to be enslaved by the power of the Sith, Kurt and his fellow Beast Riders united under the banner of Beast-Lord Modon Kira. The result was the largest host of warriors ever assembled against Iziz, gathered together with the intention of freeing the city from the oppression of the dark side."}, {"tag": "p", "text": "Early in the battle, Kurt's forces successfully eliminated the defensive towers that lined Iziz's northern wall, allowing the ground troops, mounted on wild boma-beasts, to enter the city unhindered. Kurt then led his riders in an attack against the eastern wall, as he had done successfully against the north side. However, Commander Gobee, who had dismounted his flying beast to lead the ground forces into the city, was pinned down with his troops at the feet of the Iziz Royal Palace by heavy enemy fire. With no other options, Gobee commed Kurt and ordered his squad to discontinue their assault on the east wall, and bombard the palace roof with counterfire. Kurt immediately obliged, and succeeded in eliminating the rooftop turbolasers. This allowed the Beast Riders to finally converge upon the citadel from all sides as Kurt continued to lend supporting fire to his planetside counterparts."}, {"tag": "p", "text": "After intense fighting, the battle and war were subsequently won by the Beast Riders, who managed to defeat the city-dwellers with assistance from several Jedi Knights. In the wake of the fighting, those same Knights remained on Onderon, and further assisted in facilitating a peaceful coexistence between the city-dwellers and Kurt's Beast Rider kin."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Flight leader Kurt was a solid military commander. A testament to his valor, Kurt led by example, leading the charge against enemies from the front lines of battle. As a subordinate of Commander Gobee, Kurt was extremely loyal and obedient, carrying out the senior officer's orders without question. Gobee trusted Kurt among his flight leaders to get the job done fast and efficiently."}, {"tag": "p", "text": "As a ranking officer in the Beast Rider army, Kurt was proficient with flying tamed drexl-beasts. While riding his beast, Kurt was able to redirect his efforts quickly and suddenly, often performing strafing runs and lending supporting fire to beleaguered ground troops from above. Kurt was also adept at firing the various ranged weapons while riding his beast, as most of his ilk were."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Kurt first appeared in the Tales of the Jedi audio dramatization of the Ulic Qel-Droma and the Beast Wars of Onderon comic, written by John Whitman and based off the original script by author Tom Veitch. Kurt only has two short lines in the audio drama, and does not appear by name in the comic version of The Beast Wars of Onderon at all."}, {"tag": "p", "text": "Furthermore, the actor who voiced Kurt's character was never credited alongside the other voice actors of the Tales of the Jedi audio, and the spelling of his name has never been canonically printed anywhere. Thus, this article spells the name as is given that it is the most common spelling of the name in real life."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}