{"url": "Kurth_San", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Cularin residents", "Category:Humans", "Category:Males", "Category:Navy of Thaere members", "Category:Officers"], "nodes": [{"tag": "h1", "text": "Kurth San"}, {"tag": "p", "text": "Kurth San was a male Human who lived during the waning years of the Galactic Republic. He joined the military of the Thaere system, and eventually attained the rank of major. Around 32 BBY, the Thaereian military established a presence in the Cularin system, a close neighbor of Thaere, and San was appointed to command the Thaereian base on the planet Cularin, on the newly-constructed platform city Soboll."}, {"tag": "p", "text": "In 31 BBY, San operated an information stand during the SoroSuub Anniversary celebration, an event that was held on the planet Genarius. He was still in command of Soboll by the time of Clone Wars about eleven years later, when Soboll was besieged by the Cularin Militia, an anti-Thaereian military force. San suspected that the Militia would launch an attack on the city, so he had explosive devices placed around Soboll's perimeter and planned to lure the Militia into Soboll, then detonate the devices, while the Thaereians evacuated the city. The Militia wanted to capture San alive and sent a group of freelance agents to infiltrate the city and apprehend the Thaereian commander."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kurth San was a male Human who was born during the waning years of the Galactic Republic, on a world with heavy gravity. He joined the armed forces of the Thaere system, and quickly attained the rank of captain. He was then chosen to command the flagship of Colonel Jir Tramsig, becoming Tramsig's right-hand officer and eventually becoming a major. In approximately 32 BBY, the Cularin system, a close neighbor of Thaere, became a member of the Republic, and the Thaereian military established a presence there. They constructed the platform city Soboll to serve as their base on the planet Cularin, and San was appointed to command it. At some point, San also became acquainted with fellow Thaereian officers Osten Dal'Nay and Xirossk."}, {"tag": "p", "text": "In around 31 BBY, San traveled to the city Tolea Biqua on Genarius, another planet in the Cularin system, to participate in the SoroSuub Anniversary celebration. During the event, San operated an information stand for the Thaereian military. He did not enjoy the task of giving information that he considered \"unnecessary\" to people, although the Thaereian stand was just a cover. The real reason why San had been sent to Genarius was so that he could evaluate how open the people of the Cularin system were for enlistment in the Thaereian military, even just as members of a reserve corps."}, {"tag": "p", "text": "About eleven years later, during the time of the Clone Wars, the Cularin Militia, a military force that opposed the Thaereian presence in the Cularin system, launched Operation False Horizon to try and drive the military from the system. Most of the Thaereian troops on Cularin withdrew to Soboll, and the Militia besieged the city. Expecting an imminent full-scale attack, San devised a plan to evacuate the city, while destroying a lot of Militia forces at the same time. He had explosive devices placed at key points around the city's perimeter, then planned to lure the Militia into Soboll by causing the city's turbolaser defenses to experience a power failure. The devices would detonate and wipe out the attacking Militia forces, while the Thaereian troops evacuated aboard starships that were concealed inside hangars throughout the city. While his plan was put into place, San remained inside the city's command center."}, {"tag": "p", "text": "The Cularin Militia hired a group of freelance agents, known as the \"Heroes of Cularin,\" to infiltrate Soboll and capture San alive, then negotiate with him for the surrender of the Thaereian forces in Soboll. The agents entered the city and learned from the Sullustan Militia agent Mub Tyeb that San was located in the command center. They entered the base and observed San while he monitored tactical displays in the facility's war room. The major then went into his office and entered a series of commands into a console, beginning a countdown to deactivate the turbolasers in five minutes' time, then detonate the explosives ten minutes after that. San also activated a jamming device, causing a communications blackout in the vicinity of Soboll."}, {"tag": "p", "text": "The Heroes of Cularin entered San's office, where they took him captive and attempted to negotiate with him. With the major in their custody, the agents attempted to make their way off Soboll in an airspeeder that they had stolen from a nearby hangar. However, San began struggling against his captors, punching and kicking them to keep them distracted while Thaereian laser defenses fired on the speeder. San stopped brawling when the vehicle was hit, and it began to plummet towards the jungle below the city. The speeder crash-landed on the ground, but was not seriously damaged, and San was taken into custody by the Militia. They planned to learn information from him about upper levels of Thaereian military, although they believed that he wouldn't give away anything quickly. Soboll was captured by the Militia shortly afterward."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kurth San was a large man, standing nearly two meters tall. He was brown-haired and dark-skinned, with a square jaw and a vibrodagger scar on his left cheek. He sprang while he walked, allowing him to move more quickly than would be expected for someone of his height. He was also very neat in his appearance and was admired for this."}, {"tag": "p", "text": "San was a serious man, and a strict commander, ensuring that the men who served under him were in peak condition and ready for action. While he commanded Soboll, he developed interesting assignments to keep his soldiers occupied. He even considered sending patrol ships to carry out exercises near the base of the Oblee crime lord Nirama in the Cularin system asteroid belt to try and deter smugglers from operating in the Cularin system. He was very loyal to his superior, Colonel Tramsig, and was happy to put Tramsig's interests above his own. However, he suspected Tramsig of having dealing's with the system's smugglers and was worried by this."}, {"tag": "p", "text": "Major San was very pleased to be assigned to serve with the Thaereian forces on Cularin and believed that it was appropriate for the Thaereians to claim that they were present in the Cularin system under the authority of the Republic, because they were protecting the system and it could not do so by itself. However, he did not always act in the best of interests of the people of Cularin, as demonstrated during the siege of Soboll, when he was prepared to cause civilian casualties by detonating the explosive devices."}, {"tag": "p", "text": "San was bilingual and had the ability to speak both Basic and Tarasinese, the language of the Tarasin, a sentient species native to Cularin. He spoke with a Core Worlds accent."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kurth San was first mentioned in the Living Force Campaign Guide, a Wizards of the Coast sourcebook published in 2001 that outlined the setting of the Living Force campaign, a supplement to the Star Wars Roleplaying Game. He later appeared in two Living Force adventures, Blown Away and Lockdown on Soboll."}, {"tag": "p", "text": "In the Living Force Campaign Guide, San was identified as being a member of the Republic Military, the armed forces of the Galactic Republic. However, the Wizards.com article Over Thaere later retconned all references to the Republic Military in the campaign guide as instead alluding to the Thaereian military, thus making San a member of that organization instead."}, {"tag": "p", "text": "Blown Away was an interactive scenario that was intended for use at roleplaying events and outlined how the event staff were to play the roles of the various non-player characters that featured in the scenario, including San. The major was advised to be portrayed as being evasive and businesslike, dismissing people if they asked him uncomfortable questions, while being pleasant and explaining about the opportunities for advancement within the Thaereian military if someone seemed genuinely interested. The other non-player characters were meant to act as if the didn't trust him."}, {"tag": "p", "text": "When San encounters the Heroes of Cularin in Lockdown on Soboll, the details of what occurs can vary, depending upon the actions taken by the players, who role-play as the heroes. When the player characters first enter San's office, they can choose to disobey their orders and shoot San on sight. They then have the option of trying to negotiate with him, to persuade him to disarm the explosive device. If they do so, then San only gives way slowly because he believes that he is negotiating from a position of strength and so continually reminds them of how much time is left on the countdown. He also takes the conversation off on tangents to unrelated topics, such as the players' backgrounds and their views on Osten Dal'Nay and Xirossk. If the players' conversation with him begins to lull, then Thaereian troops suddenly launch an assault on the office."}, {"tag": "p", "text": "The players can choose to bargain with San, to get him to give them the abort code for the explosives, in return for letting a specific number of Thaereian ships escape the city. San refuses to believe the players if they offer to let him go, and if they ask for safe passage from the city for themselves, he promises to let them leave in twenty minutes, after the detonation of the explosives. If the players are successful with their negotiations, San disables the device and puts the countdown to the explosion on hold, while the players check with the Cularin Militia that the deal they negotiated with San is acceptable."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}