{"url": "Kuruk", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Humanoids", "Category:Knights of Ren", "Category:Males", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Kuruk"}, {"tag": "p", "text": "Kuruk was a humanoid Force-sensitive male who served as a member of the Knights of Ren, under the command of an individual known as Ren."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Encounter with Luke Skywalker"}, {"tag": "p", "text": "At some point before the rise of the First Order and their war against the Resistance, Kuruk joined the Knights of Ren, an organization of Force-sensitive warriors who followed the dark side and an ideology based on the Ren, the lightsaber wielded by Ren, the leader of the Knights. Traveling throughout the galaxy, the Knights of Ren searched for other Force users to join their ranks."}, {"tag": "p", "text": "At some point, Kuruk, together with his fellow knights, Ap'lek, Cardo, Trudgen, Ushar, Vicrul, and Ren traveled to Elphrona to steal artifacts in the Jedi outpost there. At the same time, Luke Skywalker, a young Ben Solo and Lor San Tekka were there too. When the young Ben discovers a Lightsaber rifle, Ren tells Skywalker that everything inside the outpost belongs to him and his allies as Kuruk and the other knights confront the trio. Skywalker retorts that it all belongs to him, as it is a Jedi outpost and he is the last Jedi. Telling the Knights that they are going to get what they came for, Ren ignites his lightsaber. Skywalker tells Tekka to stay out of the fight and orders Solo to look after him. Tekka protests that Skywalker will not be able to fight the seven Knights on his own. Igniting his lightsaber, Skywalker replies that he will be just fine."}, {"tag": "p", "text": "Ren orders the Knights to attack Skywalker. Dodging their attacks, Skywalker uses the Force to repel the Knights, throwing them against the walls of the outpost, including Kuruk. On the side, Tekka marvels at Skywalker's ability. Skywalker asks the Knights if they have had enough. Ren replies that they still have numbers on their side. Skywalker lifts their weapons into the air and crushes them, leaving only Ren with a weapon. Ren flips a switch on his lightsaber, telling Skywalker that if the weapon leaves his hand it will explode, killing them all. He also adds that he can sense the dark side in Solo. Skywalker tells Ren to leave. Ren agrees, but unmasks first. He asks Solo whether he is sure he wants to be a Jedi, and tells him to contact the Knights if he ever wants to explore his dark side more."}, {"tag": "h3", "text": "Battle with Sector Security"}, {"tag": "p", "text": "After hearing from their master about the Force-sensitive criminal Karrst, who, along with his brother Filin, caused over one hundred deaths, Kuruk and the other Knights of Ren sought to locate him. Eventually finding the brothers under attack from forces of Sector Security, Vicrul and the Knights of Ren dealt with the aggressors while Ren spoke to Karrst."}, {"tag": "p", "text": "After Karrst hesitated when Ren informed him that entry into the Knights of Ren required the death of his brother, Filin instead killed Karrst and requested to join in his place. However, as Filin was not sensitive to the Force, Ren killed him."}, {"tag": "h3", "text": "New Master"}, {"tag": "p", "text": "Eventually, Ren passed the location of the knights through his helmet to Solo, who passed the tests and became Kuruk and the knights' new leader, using the name Kylo Ren."}, {"tag": "p", "text": "Some point in 35 ABY, Kuruk and the knights surrounded Ren and Albrekh, who was fixing Ren's helmet. They then accompanied Ren to the Steadfast via their ship, the Night Buzzard. As they walked with Ren passing the hallways, they got the attention of two stormtroopers."}, {"tag": "h3", "text": "Skirmish on Pasaana"}, {"tag": "p", "text": "Kuruk and the knights were sent to hunt for Rey and her allies. As Rey went to confront Ren. Together with Ap'lek, he sneaked on Chewbacca, capturing him and bringing him to stormtroopers, who captured him and the dagger he was holding."}, {"tag": "h3", "text": "Battle of Exegol"}, {"tag": "p", "text": "A short time after the hunt for Rey, Kuruk and the other Knights of Ren were lurking in the Sith Citadel of Darth Sidious on Exegol. During the Battle of Exegol, Kylo Ren, now the redeemed Ben Solo, entered the Citadel in an attempt to kill Sidious."}, {"tag": "p", "text": "Before Solo could reach the Throne of the Sith, Kuruk and the Knights confronted their former master. The Knights were able to swiftly overwhelm Solo in his unarmed state, forcing him to the ground and beating him. However, through the use of their Force-bond, Rey was able to give Solo his grandfather's lightsaber. Using Anakin's lightsaber, Ben swiftly cut down Kuruk before dueling the remaining Knights."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Kuruk was Force-sensitive and an adept of the Dark side of the Force but was untrained which resulted in his powers being stunted. Despite that he was able to use telekinesis against his former leader. As a Knight of Ren, Kuruk displayed martial prowess few could match. He was the most solitary of the Knights and served as the group's primary sniper and pilot of the Night Buzzard. During the battle, Kuruk would usually stay behind and cover assaults with his precision marksmanship."}, {"tag": "p", "text": "Despite his great skill, Kuruk was slain by his redeemed former master, Ben Solo, during the Battle of Exegol."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Kuruk and Cardo were the only Knights of Ren not to primarily use bladed weaponry. Instead, Kuruk relied on a multi-barreled custom-designed rifle. The rifle has three modes across two barrels: rapid firing, sniping, and a pump-action mode designed to fire plasma bolts."}, {"tag": "p", "text": "Like all of the Knights of Ren, Kuruk wore all black. He wore a collar that contained plasma bolt shells and a coat made of sound-dampening susurra-weave fabric. His boots were soft-soled which gave him a silent tread. Kuruk's helmet was designed with sides blocking most of his peripheral vision. The helmet instead made him focus on his target and he would sharpen his aim by concentrating with the Force. Kuruk's helmet was equipped with a breath screen and a vocoder grid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kuruk was portrayed by stunt performer Joe Kennard in the 2019 movie Star Wars: Episode IX The Rise of Skywalker, although the character is only listed as \"Knight of Ren\" in the film's credits."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}