{"url": "Kwi", "categories": ["Category:Legends articles", "Category:Outer Rim Territories species", "Category:Reptilian sentient species"], "nodes": [{"tag": "h1", "text": "Kwi"}, {"tag": "p", "text": "The Kwi were the degenerated descendants of the saurian Kwa—Dathomir's first sentient inhabitants."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Kwi were large, bipedal lizards with powerful hind legs and tiny forelimbs. They had light blue flesh covered in cobalt-blue scales. The scales located at the top of their skulls had an iridescence that tended to be almost lavender in hue. The face of a Kwi featured two bloodred eyes, a mouth full of black teeth shaped like spades and a long, black tongue. Thanks to their conformation, they could race at incredible speed. To put themselves into a running position, the Kwi would lower their heads and lift their tails out straight behind them to act as a counterbalance. An average member of the Kwi species was three meters tall and four meters long."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "Being the degenerate descendants of the sentient Kwa, the Kwi did not have the ability to use an articulated language. However, they could still communicate through various types of noise. For example, a honking noise could be used by a Kwi to call others. When traveling in herds across the plains, individuals running on the perimeter of the group would snort and grunt to issue instructions. If those leading reptiles issued contented grunts, the herd would stay on its current course, but if they snorted two or three times on one side of the group, the herd would veer away. The Kwi could also communicate with certain members of other species, provided that those possessed psychic abilities matching the Kwi's."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 31 BBY, many Kwi were slaughtered by the Nightsisters during their attempt to access the secrets of the Infinity Gate."}, {"tag": "p", "text": "The remaining Kwi disappeared into the deserts and would form tribes including the Blue Desert People and the Blue Mountain People, as well as the Rhoa Kwi. The Kwi also migrated every dawn and every dusk."}, {"tag": "p", "text": "During the Galactic Civil War, Geonosian bio-engineers at the Geonosian Bio-Lab on Yavin 4 experimented with mutated Kwis. In 8 ABY, Luke Skywalker and Isolder encountered a group of Kwi who aided them before returning to their simple existence in the desert. In 23 ABY, while on board the Off Chance, Tenel Ka and Luke Skywalker saw the Blue Mountain People herd migrating in the dawn light."}, {"tag": "p", "text": "The Witches of Dathomir of the light side apparently respected the Kwi. The offer of a Kwi to let someone ride them was an opportunity the Witches considered to be a rare honor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}