{"url": "Kwilaan/Legends", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Space explorers"], "nodes": [{"tag": "h1", "text": "Kwilaan"}, {"tag": "p", "text": "Kwilaan was the famous Galactic Republic explorer who discovered the Renatasia system and the Naboo system. In the name of Elsinoré den Tasia, Queen of Grizmallt, Kwilaan led the first Human colonists on the planet Naboo. Millennia later, the explorer was remembered by the descendents of those early settlers, and the city of Keren's main spaceport had been named after him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male of the Human species, the famous explorer Kwilaan lived during the fourth millennium before the rise of Palpatine's Galactic Empire, a time dominated by terrible conflicts such as the Mandalorian Wars, the Jedi Civil War and the Dark Wars. In the year 3951 BBY, the bloodbath of the Dark Wars ended, and the galaxy entered a period of recovery, during which the Queen of Grizmallt Elsinoré den Tasia sponsored a new age of colonization. Over the five next decades, hundreds of expeditions were launched into the so-called \"wild space.\" Around the same period, Kwilaan discovered a star system located in the southern quadrant of the galaxy, which was then named the Naboo system."}, {"tag": "p", "text": "Around 3900 BBY, in the final years of her reign, Tasia decided to sponsor one last undertaking: the colonization of Naboo, the main planet in the star system discovered earlier by Kwilaan. The explorer himself was tasked with leading the original settlers to their new homeworld. With the blessing of a famous Jedi Master, the colony ship Beneficent Tasia was chartered, along with its support ships, Constant and Mother Vima."}, {"tag": "p", "text": "After surviving many hazards, the Beneficient Tazia reached Naboo and crashed on the planet, with Kwilaan still on board. The explorer then led the distraught settlers in the Gallo Mountains, a mountain chain located on Naboo's main continent, where they founded the farming community of Dee'ja Peak. Within weeks of their arrival, the colonists encountered the native Gungans, a species of land-dwelling amphibians. While no records of previous Republican visits to Naboo existed, the indigenous population remained indifferent to the sudden appearance of Kwilaan's expedition, as if they had already met Humans before. Although the two species were instantly distrustful of the other, neither resorted to violence, and the Humans were allowed to establish their first settlements without any hindrance."}, {"tag": "p", "text": "Many a century after Kwilaan set foot on Naboo, his memory was still vivid. In Keren, the most important trading city on the planet, the stellar-class Kwilaan Starport was named after him. The scout was also remembered on the occasion of the Festival of Light, which celebrated the day Naboo joined the Galactic Republic. Through fireworks and holographic displays, the Naboo would evoke the story of their origins, and Kwilaan himself featured in his own tableau. Additionally, a tapestry in his image hung in the Banquet Hall of the Naboo Royal Palace in Theed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In the modern tapestries and holograms representing Kwilaan were accurate, the explorer was a slender, light-skinned man, and he sported a short white beard when he discovered Naboo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}