{"url": "Kwilaan_Starport", "categories": ["Category:Legends articles", "Category:Keren locations", "Category:Spaceports"], "nodes": [{"tag": "h1", "text": "Kwilaan Starport"}, {"tag": "p", "text": "The Kwilaan Starport was a stellar-class starport in the city of Keren on Naboo, in the Mercantile District. It was named after the scout who charted the Naboo system and later led the original Human settlers to Naboo."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Under King Ars Veruna's reign Kwilaan Starport was upgraded to a stellar-class starport and obtained a Bureau of Ships and Services accreditation. Senator Palpatine's address at the ceremonial re-opening of the starport compared it favorably to other ports across the galaxy."}, {"tag": "p", "text": "Kwilaan provided standard amenities for its type, though cost overruns would be expected when imports of unusual parts or supplies were needed. The government of Naboo attempted in the years before and after the Trade Federation blockade to encourage major manufacturers to open branch offices and skilled craftsbeings to open businesses in or near the starport."}, {"tag": "p", "text": "In 32 BBY, the only major off-world presences were the Republic Office of Xenosociology or ROX, the Kazellis Corporation and the Trade Federation itself. There was no BoSS branch located here because of the backwater status of Naboo, and the under-capacity traffic at the starport. At that time, the Senator was lobbying for a BoSS office to be opened in order to give a sense of security to potential traders and thus expand Naboo's interstellar economy. After abolishing the tax-free zones utilized by the Trade Federation, however, a clause in the law required the expansion of BoSS into the former zone to oversee the new customs requirements."}, {"tag": "p", "text": "During the great influx of refugees caused by the Separatist Crisis, starports like Kwilaan suffered under the strain of managing both the locales and the immigrants, leading to the population of Kwilaan becoming impoverished."}, {"tag": "p", "text": "Despite falling on hard times, Kwilaan would survive as a starport into the Galactic Civil War."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}