{"url": "KyLessian_fruit_bat", "categories": ["Category:Legends articles", "Category:Bats", "Category:Carnivorous creatures", "Category:Creatures of KyLessia", "Category:Flying creatures", "Category:Non-sentient species"], "nodes": [{"tag": "h1", "text": "KyLessian fruit bat"}, {"tag": "p", "text": "KyLessian fruit bats were carnivorous, nocturnal bats native to the planet KyLessia. Their name referred to their nesting in wulfruit trees; they did not eat fruit. The creatures were small, measuring 15-30 centimeters long, and were extremely lightweight. They possessed webbed wings and skin that grew feather-like scales. They were black in color, and their dark coloration extended even to the enamel on their fangs, which was a dark gray that approached black, making the creature nearly invisible at night. Their vision took in the infrared spectrum, allowing them to see in darkness; and they communicated using ultrasonic calls that exceeded the range of normal human hearing."}, {"tag": "p", "text": "While a single Kylessian fruit bat was unlikely to be a threat, large groups of them could be very dangerous. They hunted on cloudy nights devoid of starlight or light from any of the planet's three moons. They would land as a flock on a prey animal; their black coloration, quiet flight, and extremely light weight meant that the animal neither saw, heard, nor felt their arrival until all were settled in place. One observation saw 48 bats gathered on a single prey animal, nestled in groups along the creature's flanks. Once the entire flock of fruit bats had gathered, they would issue an ultrasonic signal that observing colonists were unable to detect, but that triggered the entire flock to simultaneously attack, burrowing into the creature's fur. The resulting wounds on the animal looked as though it had been savagely attacked by a much larger predator."}, {"tag": "p", "text": "The livestock of the colonists on KyLessia were frequent victims of the KyLessian fruit bat, and these livestock losses were originally thought to be the result of predation by bigger creatures. Infrared observations on cloudy nights demonstrated that the fruit bats were responsible. In addition to nesting in wulfruit trees, they often hid in caves and sheds during daylight hours. Nocturnal by nature, bats found in daylight were easy to subdue."}, {"tag": "p", "text": "Imperial governor Wilek Nereus of Bakura, a collector of the teeth of predatory creatures, included the fangs of KyLessian fruit bats in his collection."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}