{"url": "Kyle_Katarn%27s_third_lightsaber", "categories": ["Category:Legends articles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Kyle Katarn's third lightsaber"}, {"tag": "p", "text": "This lightsaber was created and used by Jedi Battlemaster Kyle Katarn after he joined the Jedi Praxeum on Yavin 4. He later left it behind when he abandoned the Jedi, only to take it up again during the Empire Reborn crisis."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "Sometime after his fall to the dark side on Dromund Kaas, Katarn joined the Jedi Praxeum and built his own lightsaber to replace the one he had taken from the Dark Jedi Yun."}, {"tag": "h3", "text": "Disuse"}, {"tag": "p", "text": "Despite his attendance at the Praxeum—which he started due to fear of falling to the dark side again—Katarn became worried when both Gantoris and Kyp Durron turned to the dark side. Unwilling to risk turning again, Katarn gave his lightsaber to Luke Skywalker and left the Praxeum, becoming a mercenary again, alongside his partner, Jan Ors."}, {"tag": "h3", "text": "Empire Reborn crisis"}, {"tag": "h4", "text": "Return to the Praxeum"}, {"tag": "p", "text": "However, when Dark Jedi Desann supposedly killed Jan during a mission to Artus Prime, Kyle became vengeful and returned the Praxeum to get his lightsaber back. Skywalker told him that to do so, he would have to go through the Praxeum's exercise course to retrieve it. When Katarn succeeded, he set off to find Jan."}, {"tag": "h4", "text": "Nar Shaddaa"}, {"tag": "p", "text": "Katarn's lightsaber would continue to serve him on Nar Shaddaa, where he used it to intimidate a bartender into telling him where crime lord Reelo Baruk was. The bartender signaled the cantina's mercenaries, and they attacked Katarn. Using only his lightsaber, Katarn managed to defeat the mercenaries and retrieve his weapons—including his modified Bryar pistol. He then spoke to the bartender again, who told him that Baruk was running a scrap yard. Fighting through the scrap yard, Katarn rescued Lando Calrissian and defeated Baruk."}, {"tag": "h4", "text": "Cloud City"}, {"tag": "p", "text": "Katarn then traveled to Cloud City on Bespin, which Desann's forces were attempting to capture. Fighting through the underlevels of the city, Katarn encountered a Reborn—a Dark Jedi fueled with the power of the Valley of the Jedi. Katarn defeated the Reborn, along with many more of the Force sensitives throughout the city, until he reached Tavion Axmis, Desann's apprentice. Katarn bested her and threatened to kill her, but relented and let her go when Tavion told him that Jan was still alive."}, {"tag": "h4", "text": "Cairn and the Doomgiver"}, {"tag": "p", "text": "Katarn snuck aboard a freighter to the Lenico Belt, where Admiral Galak Fyyar had a mining operation. There, Katarn met Skywalker, who was disturbed by Kyle's discovery that Desann was mining cortosis—a lightsaber-resistant material. Together, Katarn and Skywalker fought off a team of Reborn, then split up. Before departing aboard Fyyar's ship, the Doomgiver, Katarn witnessed a duel between Skywalker and Desann."}, {"tag": "p", "text": "Aboard the Doomgiver, Katarn signaled Rogue Squadron, then dueled a group of Desann's Shadowtroopers, their armor lined with cortosis. Following this encounter, he rescued Jan, and the pair split up—Katarn headed for the shield generator and Jan for the escape pods. After disabling the generator, Katarn dueled Fyyar, who was defeated."}, {"tag": "h4", "text": "Yavin 4"}, {"tag": "p", "text": "Katarn and Jan landed on Yavin and Katarn fought toward the Praxeum, defeating many stormtroopers and swamptroopers, along with several more Shadowtroopers. Once inside the Praxeum, Katarn assisted several Jedi students in battling Reborn and Shadow troopers. Finally, Katarn reached Desann, and the two engaged in a duel. In the end, Desann was slain, and his Reborn rounded up. Though Skywalker offered to take Katarn's lightsaber back, Katarn said he would hold onto it for a while."}, {"tag": "h4", "text": "Alzoc III"}, {"tag": "p", "text": "Shortly thereafter, Katarn and Jan investigated an outpost on Alzoc III, where Katarn fought another Reborn. After the mission was complete, Katarn returned to the hangar and found Jan surrounded by Imperials. After killing the stormtroopers, Katarn confronted the officer, who threatened to kill Jan. Jan, however, took the Imperial by surprise, and both she and Katarn escaped Alzoc III."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The hilt of Kyle Katarn's third lightsaber is able to be used in Star Wars: Jedi Knight: Jedi Academy multiplayer, where it uses the name Katarn, after it's owner. The hilt is not available without cheats or modifications in single player, however."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}