{"url": "Kyli_Ned%27Ix", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Pilots", "Category:Technicians", "Category:Males", "Category:Verpine"], "nodes": [{"tag": "h1", "text": "Kyli Ned'Ix"}, {"tag": "p", "text": "Kyli Ned'Ix was a male personality Verpine adventurer and technician. Able to repair or modify almost any type of equipment, Ned'Ix found himself on the planet Kal'Shebbol in the Kathol sector of the Outer Rim Territories in 8 ABY. Following the liberation of the world by the New Republic, Ned'Ix attempted to join the crew of the CR90 corvette FarStar, which was tasked with a mission to track down the rogue Imperial warlord Moff Kentor Sarne, who had fled from Kal'Shebbol with his forces. Despite Ned'Ix's superior technical skills, the command crew of the corvette felt that his habit of jury-rigging equipment was actually more of a danger than an asset and turned him down. Undaunted, Ned'Ix repaired and modified a Ghtroc Industries Class 720 freighter that he found abandoned on the planet. Naming it the \"Fxz'Et,\" he loaded the ship with spare parts and junk and headed out after the FarStar, determined to help the expedition in any way he could."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Kyli Ned'Ix, a Verpine with a male personality, was a master technician who could fix or modify nearly any piece of equipment, and was able to craft small but useful gadgets from junk, although he refrained from fashioning weapons of any kind. In 8 ABY, Ned'Ix was present on the planet Kal'Shebbol in the Kathol sector of the Outer Rim Territories when it was liberated by New Republic forces. The local Imperial warlord, Moff Kentor Sarne, was forced to flee his capital and headed deeper into the sector with the bulk of his military forces. Realizing the threat that he still presented to the stability of the sector, the New Republic authorized a mission to track him down, assigning the CR90 corvette FarStar to the job. However, a lack of available manpower meant that the New Republic was forced to hire civilian personnel from the local population of Kal'Shebbol to assist in crewing the vessel. Ned'Ix learned of the mission, and, seeing an opportunity for adventure, he applied to join the crew. However, despite his exceptional technical skills, Ned'Ix was turned down as the command crew felt that his penchant for jury-rigging and modifying equipment could have placed the ship and crew in unnecessary danger."}, {"tag": "p", "text": "Rather than be left on Kal'Shebbol, Ned'Ix resolved to help the FarStar in any way possible. Discovering an old Ghtroc Industries Class 720 freighter that had been abandoned on Kal'Shebbol, he repaired the vessel and enhanced it with junk components left behind by both the New Republic and the Galactic Empire. Ned'Ix gathered together a large amount of technological parts—including disassembled droids, fused turbolaser circuit boards, and ion drive power couplings—and fitted the ship with a small laser cannon and a pair of proton torpedo launchers. Naming the vessel the \"Fxz'Et,\" Ned'Ix launched after the FarStar, determined to aid the New Republic crew with their mission, even if they didn't want him aboard the ship."}, {"tag": "p", "text": "Ned'Ix encountered the crew of the FarStar on several occasions during their months-long mission. However, he was still not allowed to join the crew despite his wishes, settling instead for a little recognition for his efforts when he was of service to them, and assistance from them with navigating his way through the Kathol sector."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Kyli Ned'Ix's chitinous carapace was green, and like all Verpine, gave him a measure of protection against physical blows. His eyes were the same color as his carapace, and he possessed the Verpine's microscopic sight. Ned'Ix was capable of communicating with other Verpine, and even specially tuned comlinks, within a range of one kilometer by using his antenna as an organic telecommunicator. A determined and adventurous being, Ned'Ix wanting nothing more than to join the crew of the FarStar and assist them in their expedition. Even when told that he could not join the crew, he did not hold a grudge and came up with a way to assist them in his own fashion."}, {"tag": "p", "text": "A highly skilled technician, Ned'Ix could repair or modify most equipment, and loved creating new devices from the junk in the hold of the Fxz'Et. His skills allowed him to modify a comlink into a jamming device, but he was easily distracted when working on a new gadget. However, he indulged his creativity too much sometimes, often to the point of forgetting about everything else. Several times, Ned'Ix landed the Fxz'Et on the nearest planet he could find regardless of any danger, or allowed the ship to drift in orbit. Often, the result was Ned'Ix getting into trouble with local Imperial forces or criminal elements who discovered him. He also had a habit of modifying equipment that did not need it. This usually resulted in making the equipment more powerful or more useful, but rendering it unstable at the same time."}, {"tag": "p", "text": "A capable pilot and astrogator, Ned'Ix could fly small vessels and operate their weapons and shield systems effectively. His technical expertise allowed him to repair blasters, computers, droids, space transports and starfighters, and he was able to program both computers and droids. He was skilled in the use of explosives and security systems. Ned'Ix typically carried a blaster pistol for defense, along with his comlink jammer, a datapad, and security cardlock breaker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kyli Ned'Ix was created for The DarkStryder Campaign, a supplement for Star Wars: The Roleplaying Game by West End Games. Appearing only in the Rogues Gallery, the character was intended as both a potential source of comic relief for the adventure by blundering into a delicate situation at the wrong time, and as a gamemaster \"out;\" Ned'Ix could be used to rescue players who were having trouble in an adventure by supplying them with a helpful gadget, or by leading them to where the Gamemaster intended them to go. He was mentioned specifically in the adventure Shintel Downtime; during the adventure, the FarStar is attacked by Qulok's Fist, a group of bounty hunters working for Moff Sarne. If the players are having trouble dealing with their opponents, one of the suggested options that the gamemaster can employ to help the characters is that Ned'Ix arrives in the system and assists them."}, {"tag": "p", "text": "Ned'Ix was later namechecked in 2010's The Unknown Regions, a sourcebook for Wizards of the Coast's Star Wars Roleplaying Game, as an example name for Verpine characters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}