{"url": "Kylo_Ren%27s_helmet", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Armor", "Category:Combat headgear"], "nodes": [{"tag": "h1", "text": "Kylo Ren's helmet"}, {"tag": "p", "text": "Kylo Ren's helmet was a combat helmet worn by Kylo Ren, master of the Knights of Ren and the dark side apprentice of Supreme Leader Snoke. Patterned on the battle gear of the Knights of Ren, the helmet concealed Ren's face, hiding his former identity as the Jedi apprentice Ben Solo. It was black with a silver inlay decorating the visor frame. In addition, it contained a vocoder that modulated his voice. After its reconstruction, the helmet featured a luminous red alchemical lattice of the Sarrassian iron that was used to weld the shards together. As a result, Ren's reforged mask was far stronger than it once was."}, {"tag": "p", "text": "Ren donned the helmet after renouncing his family and Jedi heritage to join the Knights of Ren, a group of masked marauders from the Unknown Regions of the galaxy. The helmet marked Ren's status in their ranks, while also serving to inspire fear in the tradition of his grandfather, the Sith Lord Darth Vader, who also wore a mask. Despite its purpose, the helmet was seen by Snoke and General Armitage Hux as Ren's way of hiding his lineage as the son of Han Solo and Princess Leia Organa, by mimicking Vader's appearance. Solo confronted Ren, shortly before the Battle of Starkiller Base. He told him to remove his mask, wishing to look upon the face of his son. Although Ren obliged Solo's request, he ultimately killed his father in an attempt to extinguish the light side of the Force that persisted within him. However, the act of patricide only left Ren more conflicted than ever, and his master denounced him as a \"child in mask,\" unworthy to follow in Vader's legacy. Angered by this rebuke from Snoke, Ren destroyed his helmet and redoubled his efforts to submit himself entirely to the power of the dark side."}, {"tag": "p", "text": "Following his accession as the new Supreme Leader of the First Order, Ren scavenged the fragments of his shattered helmet. The Sith alchemist Albrekh welded the shards together with Sarrassian iron, resulting in a far stronger version of Ren's helmet. Rey, the last of the Jedi Order, saw through the mask's symbolism, sensing that Ren remained haunted by his patricidal act. Ren did not bring the helmet with him when he confronted Rey in the Death Star ruins on Kef Bir, and Rey sensed that he would never wear the mask in front of her again. Shortly thereafter, Ben Solo discarded the trappings of Kylo Ren, having returned to the light through Rey's compassion and his parents' forgiveness."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Original version"}, {"tag": "p", "text": "Kylo Ren's helmet was a battered, face-concealing black combat helmet with a silver inlay that radiated from the eyes as a symbol of power. Modeled on the battle gear worn by the Knights of Ren, the helmet served to hide Ren's former identity as Ben Solo—the nephew and fallen apprentice of Jedi Master Luke Skywalker. In addition, its aesthetic design and integrated voice-projecting vocabulator enhanced Ren's imposing appearance."}, {"tag": "p", "text": "Like the mask worn by his grandfather, Darth Vader, Ren's helmet had a built-in vocoder that modulated his voice, resulting in a deep, intimidating voice. The face mask was connected to the helmet via articulated arms driven by servomotors; a hinged mechanism sealed the mask to the helmet. Although he wore the helmet to make himself appear more intimidating, on rare occasions he would remove it via the servomotors to stare down his opponents with unrestrained malice in his eyes."}, {"tag": "p", "text": "Despite the helmet's design, neither Ren's father nor his master—Han Solo and Snoke, respectively—were impressed by it. Solo deemed the helmet unnecessary, whereas Snoke thought it was ridiculous. General Armitage Hux, a First Order officer and rival of Ren, opined that the helmet was superfluous compared to the one worn by Vader, who could not breathe without it. Hux further posited that Ren used the helmet to hide his resemblance to Han Solo and Princess Leia Organa, his famous parents who served in the Alliance to Restore the Republic that defeated the Galactic Empire."}, {"tag": "p", "text": "All that remained of the helmet in its original version was a \"twisted hunk of black and silver.\" It had been shattered by Ren into many pieces, some of which were warped beyond recognition. The damage was such that Ren doubted Albrekh's skills as a Sith alchemist could rebuild a helmet that had been reduced to shards."}, {"tag": "h3", "text": "Reforged mask"}, {"tag": "p", "text": "Kylo Ren's reforged helmet was strengthened through Sith alchemy. Sarrassian iron was painstakingly applied between the shards of the shattered helmet, creating a bright red alchemical web that resembled crimson lightning or scars. The resulting helmet was heavier and smelled of molten iron, but was stronger than the previous version."}, {"tag": "p", "text": "Ren admired the rebuilt and redesigned version of his helmet, which he likened to a \"thing of jagged beauty.\" It retained its original shape and appearance, save for the red fractures that formed a web of red iron over it. Notwithstanding its increased weight and smell, Ren considered his reforged helmet an example of perfection. It symbolized not only the breaking and re-forming of his identity, but also the Knights and his grandfather."}, {"tag": "p", "text": "As before, the helmet was a symbol of his status as a Knight of Ren. In addition, it symbolized his leadership over the Knights as well as the First Order, having taken the title of Supreme Leader after his master's death. Ren noted how the helmet looked more intimidating than before, with visible red cracks over the silver inlay and the mouth plate. First Order stormtroopers and officers flinched away when their masked leader was nearby, and Ren could sense General Hux's unease about his appearance through the Force."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "A child in a mask"}, {"tag": "p", "text": "During the rise of the First Order, Supreme Leader Snoke began training the fallen Jedi Ben Solo in the ways of the dark side of the Force. Adopting the persona of Kylo Ren, Snoke's new apprentice took to regularly wearing a battle helmet that concealed his former identity as he sought to follow in the example of his grandfather, Darth Vader, who also wore a mask during his time as a Dark Lord of the Sith. Yet his efforts to emulate Vader in appearance did not meet with his master's approval. Snoke especially disdained the mask and how it allowed Ren to hide his inner conflict, which he wished his apprentice would overcome. At one point, Snoke brought Ren to Dagobah and ordered him to leave the mask on the shuttle. When Ren hesitated to comply, the Supreme Leader backhanded him across the face, causing Ren to drop the helmet, which Snoke pointed to while telling him that he had to stop pretending to be like Vader."}, {"tag": "p", "text": "In the year 34 ABY, Ren captured a Jakku scavenger named Rey during the hunt for his uncle and former master, and brought her to Starkiller Base for interrogation. Rey called her captor \"a creature in a mask.\" In response, Ren removed his helmet, revealing the face of Ben Solo behind the mask's theatrics. The scavenger was surprised to discover that Ren was, in fact, a young human male. Ren donned his helmet once more after Rey escaped from her cell, but removed it again at the request of his father, Han Solo, who confronted his son in the hope of turning him back to the light side of the Force, causing Ren to drop the helmet and offer his lightsaber to Solo. Yet despite Solo's efforts to redeem his son, Ren killed his father by stabbing him through the torso with the lightsaber."}, {"tag": "h3", "text": "Destroyed"}, {"tag": "p", "text": "The act of patricide did not strengthen Ren's connection to the dark side, however. It weakened him and contributed to his defeat in a duel with Rey, an inexperienced girl who was unfamiliar with the art of lightsaber combat, as observed by Snoke. Ren was wearing the mask when he reported to Snoke's throne room on the Supremacy, hiding his scarred face."}, {"tag": "p", "text": "Snoke reproached Ren after initially praising him, having once believed that his apprentice had the potential of becoming a worthy heir of Darth Vader because of the raw, untamed power that Ren inherited through his bloodline. He ordered Ren to remove his helmet, to Ren's surprise, calling it a \"ridiculous thing.\" Snoke disdained the helmet, which he saw as a representation of Ren's petulance and desire to emulate his grandfather. In Snoke's eyes, Ren was more of a \"child with a mask\" than a true successor of Vader, and possessed too much of his father's compassion."}, {"tag": "p", "text": "Ren struggled to control his anger as he left the throne room. However, once he was alone in a turbolift, cradling the helmet in his hands, Ren was overcome with unrestrained fury. He smashed his mask against the wall; the Force grew increasingly powerful within him, giving Ren the strength to break the mask until all that remained were twisted fragments of silver and black metal. Seething with rage, he endeavored to regain his status by proving his worth to Snoke. Unbeknownst to Ren, Snoke had stoked his apprentice's anger as part of his efforts to draw Rey into a trap by taking advantage of the Force-bond between her and Ren."}, {"tag": "h3", "text": "Broken and re-formed"}, {"tag": "p", "text": "The helmet's remains were retrieved by Ren; having killed Snoke and usurped the title of Supreme Leader, Ren was resolved to rebuild the symbol of his status amongst the Knights of Ren. For a time, however, he carried on without it. Though he was better recognized with the helmet, Ren grew to believe that his face—scarred and cruel—induced greater fear because it showed that he was real."}, {"tag": "p", "text": "In 35 ABY, the helmet was reforged using an ancient Sith forge by the Symeong metalsmith Albrekh, who used Sarrassian iron to painstakingly meld the helmet back together, making it stronger than ever."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kylo Ren's helmet was introduced in the 2015 sequel trilogy film Star Wars: Episode VII The Force Awakens, directed by J.J. Abrams. It was inspired by Kylo's insecurities, and he wore it as an intimidating factor. It was later destroyed in Rian Johnson's 2017 film Star Wars: Episode VIII The Last Jedi. Johnson regarded the decision to lose Ren's mask for The Last Jedi as somewhat \"terrifying,\" as the helmet was the symbol of the movie on the packaging for merchandise of The Force Awakens and had also proven popular as a Halloween costume with children by the time The Last Jedi began filming. Despite this, and his own love of the helmet, he considered it an important aspect of the film to get inside Ren's character a little more and for viewers to be able to look into his eyes."}, {"tag": "p", "text": "Though The Last Jedi film and most of its literary adaptations showed Ren destroying his helmet by smashing it against the wall of the turbolift aboard the Supremacy, the film's storybook adaptation described Ren destroying his helmet by crushing it beneath his feet."}, {"tag": "p", "text": "As Ren left his helmet on the bridge in Starkiller Base after killing Han Solo, it is never explained how Ren reacquired his helmet in The Last Jedi considering Starkiller base exploded. When a fan asked Pablo Hidalgo on Twitter how Ren reacquired his helmet, Hidalgo responded, \"Perhaps a loyal stormtrooper fetches it. Stuff does happen off-screen.\""}, {"tag": "p", "text": "In an interview with SlashFilm.com, Star Wars costume designer Michael Kaplan revealed that he was very surprised with the decision to destroy Kylo Ren's helmet in The Last Jedi. He stated it took him and J.J. Abrams a while to come up with the right mask for Kylo Ren in the first film. He went on to say that to have it be the first thing to be taken away and destroyed was very disappointing."}, {"tag": "p", "text": "The mask returned for the 2019 film Star Wars: Episode IX The Rise of Skywalker, where Ren donned a repaired version with deep red lines running through it. Abrams compared the fractured mask to Kintsugi, a Japanese ceramic art of repairing broken pottery by dusting the lacquer used to glue the pieces back together with powdered gold, silver, or platinum. It treats the breakage of the piece as a part of its history, instead of something to hide. The breaks in Ren's mask were meant to be a visual representation of his fractured character. Instead of hiding him as it did before, the mask tells his history, and his behavior is revealed."}, {"tag": "p", "text": "In the themed area Star Wars: Galaxy's Edge at Disneyland and Walt Disney World, Kylo Ren appears as both a walkaround character in the land and as an animatronic in its flagship attraction Rise of the Resistance. In all of these instances, Ren has his helmet intact and wears it, despite the events depicted in the land and its attractions taking place between The Last Jedi and The Rise of Skywalker, after its destruction but before its reconstruction.[source?] The story \"Tales of Villainy: Follow and Lead\" from the second issue of the Star Wars Adventures series has a similar issue, depicting Ren wearing the intact helmet at around the same time period."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}