{"url": "Kyren", "categories": ["Category:Legends articles", "Category:Birds", "Category:Creatures of Ansion", "Category:Flying creatures", "Category:Herbivorous creatures", "Category:Herd and pack creatures", "Category:Species of undefined sentience"], "nodes": [{"tag": "h1", "text": "Kyren"}, {"tag": "p", "text": "Kyren were relatively small but lethal flying creatures native to the planet Ansion."}, {"tag": "p", "text": "Almost jet black with four membranous wings, two large at the front of the thorax and two smaller ones at the rear, the kyren would glide on the upper wings while being propelled by the rear ones. A bright yellow splotch decorated each wing, possibly as an aid for identification. The kyren were legless, and instead boasted a pair of thick, furry tufts that ran the length of its underside, like runners on a sled. Since they were airborne for most of their lives, the kyren had little need for legs."}, {"tag": "p", "text": "The kyren's mouth seemed large for its body size, a wide gape lined top and bottom with twin ridges of razor-sharp horn. Kryen used these ridges as airborne scythes, clipping the crests of ripened grain on the plains as they flew by. Thus, the field of grain was never flattened or destroyed, only shorn of their ripened seed, and left looking perfectly manicured. Kyren migrated from region to region according to the seasons, traveling in flocks that grew to 150 million, and upwards of as many as 200 million individuals, creating for land-dwellers a dark eclipse as they flew overhead."}, {"tag": "p", "text": "Kyren flocks did not move to avoid any objects in their way, whether unable or unwilling, and thus despite their herbivorous nature were highly dangerous to any creature that could not find proper cover to hide behind. They made a screeching noise, and reportedly smelled very bad. Though many hundreds died during migration, no one ate them because even after a Kryen was cooked, it tasted \"like boiled mud. All grease.\""}, {"tag": "p", "text": "In 22 BBY, while on a mission to settle a planetary border dispute and to convince all parties involved to resist all efforts at secession and to vote to remain within the Galactic Republic, a Jedi diplomatic team encountered a migrating swarm of kyren. The Jedi, their Alwari guides, and their suubatar mounts took cover behind native jijite columns until the blindly lethal (but also suicidal) avian swarm had passed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}