{"url": "Kyran_Silene", "categories": ["Category:Legends articles", "Category:Corellians", "Category:Males", "Category:Slaves", "Category:Zabrak"], "nodes": [{"tag": "h1", "text": "Kyran Silene"}, {"tag": "p", "text": "Kyran Silene was a male Zabrak who lived on Corellia during the time of the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the time of the Battle of Yavin, Kyran Silene lived in Tyrena. He was the husband of Madison Silene and he was friend with Bandor Mokk."}, {"tag": "p", "text": "At some point, Kyran Silene was captured by the Corellian slavers and enslaved in the Corellian Slaver Bunker near Tyrena. Circa 1 ABY, Kyran led a group of slaves who managed to escape the bunker. However, the escaped slaves did not reach Tyrena and established a camp in the wilderness. In the meantime, Madison contacted a spacer who had previously helped her friend Angela to find her missing husband. The spacer interrogated Bandor Mokk and the man finally revealed that Kyran Silene was captured by slavers but managed to escape. The spacer then traveled to the camp of the escaped slave. There, Kyran Silene explained that he could not come back until the situation was resolved. The spacer therefore infiltrated the Corellian Slaver Bunker and sliced the bunker's main computer. Using the bunker's own communications array, the spacer broadcasted the slavers' records on the CorSec emergency request channels. Dozens of CorSec agents quickly moved to the slaver bunker and freed all the slaves. Kyran Silene eventually returned to a normal life with Madison."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kyran Silene was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Kyran Silene was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}