{"url": "Kyrouac", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles from unlicensed sources", "Category:Agriworlds", "Category:Galactic Empire planets", "Category:Vodilux sector planets"], "nodes": [{"tag": "h1", "text": "Kyrouac"}, {"tag": "p", "text": "Kyrouac was a backwater Inner Rim farming planet held by the Galactic Empire. The planet's fauna included brush bats and a shelled creature residing in the Spiral Sea. The Kyrouaquian population was governed by the Kyrouaquian High Council, and the planet's capital of Montalvia was the only settlement with a spaceport."}, {"tag": "p", "text": "During the Galactic Civil War, the Rebel Alliance sent a diplomatic delegation to Kyrouac in order to convince the Kyrouaquian High Council to join the Rebellion. However, a member of the council informed the Empire about the Rebel presence on the planet, leading to a contingent of Imperial stormtroopers arriving in Montalvia aboard cargo starships used for transporting grain. The arrival of the transports was noticed by the Kyrouaquian Jedi enthusiast CSL Danenberger."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Kyrouac was a terrestrial planet that was located in the Inner Rim's Kyrouac system, a part of the Vodilux sector. One feature of the planet's surface was the Spiral Sea, which was home to a species of shelled creatures. Kyrouac's fauna also included the brush bat. Dry grass was present at the edge of a field at the spaceport of Montalvia, the capital city."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Imperial backwater"}, {"tag": "p", "text": "Kyrouac lay at the periphery of the galactic community for centuries. The military forces of the Galactic Republic did not visit the world during the height of the Clone Wars. Despite Kyrouac formally being a part of the Galactic Empire, neither did the Imperial Military until the Galactic Civil War, which was fought against the Rebel Alliance."}, {"tag": "p", "text": "During the latter conflict, the Alliance, noticing Kyrouac's potential value as a source of food supplies, sent a diplomatic party to the Kyrouaquian High Council to discuss the possibility of the planet joining the Rebellion. When the Rebels arrived on Kyrouac, CSL Danenberger, a local Force-sensitive enthusiast of the Rebellion and the history of the Jedi tradition, unsuccessfully sought ways to approach and aid the delegation, hoping to join the Alliance that way."}, {"tag": "h3", "text": "Betrayal on Kyrouac"}, {"tag": "p", "text": "As the talks between the Rebels and the Kyrouaquian High Council progressed, a member of the council contacted the Empire with information about the diplomats present on the planet. In response, an Imperial Star Destroyer arrived in Kyrouac's orbit, and several grain transports with enough Imperial stormtroopers aboard to take over the government of the planet's capital, Montalvia, were dispatched to the city."}, {"tag": "p", "text": "One day, while the talks were still ongoing, Danenberger took a walk through Montalvia, patrolling for signs of anything unusual. The youth then noticed an unusually large number of transport starships—which, unbeknownst to Danenberger, were carrying the stormtroopers—landing at the Montalvia spaceport."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The natives of Kyrouac, known as Kyrouaquians, spoke Galactic Basic Standard and included members of the Human species. CSL Danenberger was a Human citizen of the planet whom many other Kyrouaquians considered to be crazy due to the youth's keen interest in the history of the Jedi Knight tradition. The population of Kyrouac was governed by the Kyrouaquian High Council and consisted mostly of farmers. The locals sold grain to offworlders, who then sent transport ships, including a GR-75 medium transport, to the Montalvia spaceport to fetch their purchased goods."}, {"tag": "p", "text": "The city of Montalvia was run by a local government and had its own police as well as a service of medics. Several alien sentients, including a Rodian, were present at a local cantina in the city during the Galactic Civil War."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The capital city of Kyrouac was Montalvia. It was the only settlement on the planet large enough to host a spaceport, which lay off the southwestern edge of the city. During the Rebel diplomats' visit to Kyrouac, their lodgings were located in the western section of Montalvia. The city also featured a jail, a cantina, and abandoned warehouses."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Kyrouac was introduced in Alone Against the Empire, a solitaire roleplaying adventure written by Lester W. Smith for use with West End Games' Star Wars: The Roleplaying Game and published in Challenge 32 in 1988. The 2009 reference book The Essential Atlas placed the Kyrouac system, and therefore Kyrouac itself, in grid square K-14."}, {"tag": "h3", "text": "Further events on Kyrouac"}, {"tag": "p", "text": "As a solitaire roleplaying adventure, Alone Against the Empire presents numerous possible scenarios for how the further events on Kyrouac involving CSL Danenberger, the character controlled by the player, unfold, depending on the player's choices. If Danenberger ignores the unusual activity at the Montalvia spaceport, the Jedi enthusiast soon visits a cantina and eventually gets involved in a brawl. The situation can result in Danenberger either getting killed, ending up in the local jail, or succeeding in leaving the cantina. The latter two outcomes lead to the discovery that the Rebel delegation is no longer at its lodgings, and all three outcomes serve as endings for the adventure."}, {"tag": "p", "text": "If Danenberger investigates the landings at the spaceport, the youth can then either stealthily approach the area where the grain transports are landing or do so openly. A stealth-based approach leads to Danenberger discovering that the transports are carrying Imperial stormtroopers. At that moment, a stormtrooper may notice Danenberger, which may lead to the youth's incarceration or death. If Danenberger successfully leaves the spaceport for the Rebel lodgings, the youth then informs the delegation's commander of the developments at the spaceport, after which the Rebels, guided by Danenberger, evade Imperial capture. The Rebels and Danenberger then enter a firefight with stormtroopers at the spaceport in order to escape the planet aboard the delegation's starship, after which the adventure ends."}, {"tag": "p", "text": "Approaching the landing site of the Imperial transports openly leads to an encounter with the area's security guard, which can result in an attack on Danenberger and possible incarceration. Again, upon successfully leaving the spaceport, Danenberger heads to the Rebel lodgings, where the youth then has to convince the Rebel commander of the suspicious nature of the transport landings. Success leads to both Danenberger and the Rebels witnessing the stormtroopers at the spaceport, followed by the aforementioned firefight. Failure may result in either incarceration due to the actions of a Kyrouaquian official in league with the Empire or a return to the spaceport and the stealth approach to the landing site."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}