{"url": "Kyuzo", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Kyuzo", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Kyuzo"}, {"tag": "p", "text": "Kyuzo were a sentient humanoid species native to the gravity-heavy Outer Rim world of Phatrong, where they evolved dense muscle fibers and fast reflexes. A species known for its strong sense of honor and proud martial history, the Kyuzo's clovocs, a subculture of fighting orders that maintained law and order in specific regions of their homeworld, were one the most recognized elements of the species' culture in the galaxy at large. Notable Kyuzo included the bounty hunter Embo and Constable Zuvio of Niima Outpost, a frontier trading post located on the planet Jakku."}, {"tag": "h2", "text": "Biology"}, {"tag": "p", "text": "A lanky, bipedal humanoid sentient species, the Kyuzo originated on the gravity-heavy Outer Rim world of Phatrong. Life under these circumstances resulted in the evolution of dense muscle fibers far better developed than the average bipedal species' and fast reflexes, which made them dangerous opponents on planets with standard gravity, though their thin arms and legs concealed their considerable strength. Kyuzo had green skin ranging from lighter olive shades to deep blue-green colors and wrinkled faces that sported a pair of piercing, yellowish eyes. There were two primary phenotypes within the Kyuzo population: some had compound eyes, while others had eyes with black, slit-shaped pupils akin to those of humans. The exact genetic history behind this divergence was known to few non-Kyuzo scientists, but the two groups were genetically compatible, with offspring inheriting one trait or the other from a parent. Like many other species, Kyuzo spanned a wide range in terms of height and build with some members of the species towering over most other humans and others considerably smaller in stature. For example, the well-known bounty hunter Embo was lean and stood 1.99 meters tall, while Constable Zuvio was stocky and only stood 1.6 meters in height. In addition, some had only four digits on each hand, while others had five."}, {"tag": "p", "text": "Due to the uncommon makeup of their homeworld's atmosphere, Kyuzo frequently wore corrective lenses and a highly pressurized filter mask or bandages over their faces to protect their sensitive respiratory systems and assist them in coping with uncomfortable climates like galactic standard habitable environments. As well as causing respiratory and vision problems, exposure to such conditions caused a Kyuzo to become ill within in a short period of time, interfered with their ability to concentrate, and slowed them down considerably, though the symptoms were not fatal."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "A species known for its strong sense of justice and honor, most Kyuzo regarded oaths and contracts as unbreakable and many species sought to them as mercenaries, law-enforcement personnel and bounty hunters. A highly political species, the Kyuzo developed societies that spanned considerable geographical areas, and most identified as members of a particular country or region. Most major islands and continents were their own political units, though they did form a loose confederacy."}, {"tag": "p", "text": "Kyuzo warriors traditionally wore wide-brimmed war helmets that also served as shields or as thrown missiles, which were originally designed as a headpiece by the inhabitants of the Kwaidan Peaks to protect travelers from torrential rains during monsoon season in southern Phatrong. However, not all Kyuzo were fighters—they were found in a number of professions, and many lived simple lives as farmers and merchants. Despite their honor, Kyuzo had a fondness for rogues, and many of their myths and stories featured outcast heroes who are forced to oppose the social order. Kyuzo favored their own language, which consisted of quickly spoken short words and phrases. Although Kyuzos could learn to understand Galactic Basic Standard, the most prevalent language in the galaxy, without difficulty, and most picked up the skill at a young age, they found it difficult to speak and grammatically confusing. As a result, they favored their own language and relied upon electronic translators or interpreter droids to smooth their interactions with outsiders."}, {"tag": "p", "text": "There were many social and political organizations on their homeworld of Phatrong, but one particularly noteworthy cultural phenomenon was that of clovocs, fighting orders that maintained law and order in specific regions of Phatrong. They existed apart from Kyuzo political structure and were hired by governments to help maintain the peace or fight their enemies. The hundreds of clovocs varied widely in numbers, expertise, technique, tradition, and structure, with each tending to keep a particular type of mission, such as mercenary work, local policing, or acting as a standing army. In peaceful times, clovocs participated in grand tournaments featuring their best fighters to showcase their skills and attract potential patrons for their services. These stylized battles were generally not fought to the death, though accidents did occur, and a few Kyuzo warriors found themselves fleeing Phatrong after killing an opponent in one of these contest, lest staying to provoke the wrath of a powerful clovoc. Some clovocs encouraged their members or even entire branches to work offworld as mercenaries, while others forbade the practice. As many of the Kyuzo who traveled offworld were members of a clovoc, there warrior orders were one of the most recognized elements of Kyuzo culture in the galaxy at large."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Kyuzo had a proud martial history: some clovocs dated back to the earliest days of Phatrong's recorded history, or were perhaps more ancient, if their foundational myths were to be believed. Kyuzo society began with the development of early city-states, and the loose confederation that controlled Phatrong elected the world's representatives senators in the Senate of the Galactic Republic as well as the Imperial Senate of the Galactic Empire. At some point, the Ekaqume clovoc put down a rebellion on Phatrong's Kambey Plains in a single day. Following the Imperial Senate's dissolution, the office of the local Imperial governor replaced the confederation and oversaw Phatrong directly, maintaining control using their own forces and only dealing with the clovocs if absolutely necessary. Their reputation made the Empire cautious on Phatrong, and as long as taxes were paid on time, it generally exerted little direct influence over the world. Despite this, Kyuzo rebel sympathizers on Phatrong worked tirelessly to recruit like-minded individuals in hopes that they could bolster the Alliance to Restore the Republic at large and form the core of a major resistance force on their homeworld."}, {"tag": "h2", "text": "Kyuzo in the galaxy"}, {"tag": "p", "text": "The Kyuzo species was not a prominent species in the galaxy at large, though some traveled extensively for business, trade, and exploration, often in the service of one clovoc or to escape other. A male Kyuzo from his species' homeworld, Embo found great success as a bounty hunter during the Clone Wars, and at one point in the conflict was ranked second only to the infamous Duros Cad Bane. Some Kyuzo settled the farming village of Jowloon on Jaresh, an arboreal world located in the Corva sector of the galaxy's Outer Rim Territories, where they were led by an elderly Kyuzo matriarch named Nyessa, who lived there along with her cousin Grimshaw. During the Galactic Civil War, the villagers were extorted by the Galactic Empire until, with the assistance of the Alliance to Restore the Republic, they were able to force the Empire out of their settlement. During the Iron Blockade, which was established by the Galactic Empire to prevent the Anoat sector's populace from learning of the crushing Imperial defeat at the hands of the Alliance to Restore the Republic in the Battle of Endor, a Kyuzo criminal named Khalu was a member of the South Sector Sinners. Thirty years after the Battle of Endor, a male Kyuzo constable named Zuvio enforced the law in Niima Outpost, a frontier trading post located on the mostly lawless Western Reaches world of Jakku, along with his deputies, his cousins Drego and Streehn."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Kyuzo species first appeared in \"Bounty Hunters,\" the seventeenth episode of the canon animated series Star Wars: The Clone Wars' second season. The species' name was taken from one of the character names in The Seven Samurai (七人の侍), a movie by the late Akira Kurosawa, to whom \"Bounty Hunters\" was dedicated in memory of. The species may been inspired by alternate designs for Neimoidian warriors worked on by Sang Jun Lee for Star Wars: Episode III Revenge of the Sith, one of which featured a breathing mask and bore a close resemblance to Embo."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}