{"url": "Aqua_droid/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Aqua droids", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "Aqua droid"}, {"tag": "p", "text": "Aqua droids were a advanced model of a battle droid able to fight both on land and underwater. They were used in the Separatists' attack on Kamino. They also were used in the Separatist's attempt to let the Quarren gain political control of the planet Mon Calamari."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "While agile in water, aqua droids could not cope with their earlier counterparts on land, making them easy targets during the invasion of Tipoca City. They were stored in a classic droid style with their legs folded in a fetal position against their chest. Aqua droids were portable and can fold up to fit into Trident ships, the ships would deploy a rack of folded droids, when activated, the droids unfolded and dropped to the ground ready for action. While stored, their ocular sensors retracted like a periscope into their higher torso, protecting it from explosions. They were often armed with a retractable laser cannon on their right wrist which was modified to be more active submerged in water - and the pressure of deep oceans - though they could be regularly modified to fire small grenades or missiles, like their B2 counterparts, by replacing an arm."}, {"tag": "p", "text": "For propulsion underwater, their feet could fold into propellers, and a head that could be tucked in to their bodies to reduce drag while swimming. They were about as tough and powerful as a standard B2 droid and have a very similar armature, despite their skeletal look. They could also be ordered to do security or construction tasks. Despite the fact that the aqua droids were agile and effective underwater, they were ungainly when above water and on dry land. This weakness was one of the main reasons that they were defeated on Kamino. However, aqua droids proved to be quite durable and were shown to withstand multiple blaster shots before falling."}, {"tag": "p", "text": "Aqua droids also share the deep voice tone of the B2, but respond to orders with the famous \"Roger, Roger\" B1 Battle Droid."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Aqua droids were the main attack droids used in the assault on Kamino's, Tipoca City. They were deployed from pods disguised as wreckage from a Separatist frigate. Also disguised in this wreckage were un-assembled Trident ships. After these were assembled, the droids launched their attack using the tridents to pierce the outer-hull of Tipoca City to gain access. The defending Clone Troopers and Jedi Generals Anakin Skywalker and Obi-Wan Kenobi managed to hold off the attack and destroy all of the droids."}, {"tag": "p", "text": "Their presence during the conflict between the Quarren and Mon Calamari allowed the Confederacy a quick initial victory. After the Gungan reinforcements arrived on Dac, they were again used to defeat the army and take control of the planet. They were unsuccessful later defeated when a combined rebellion of Quarren, Mon Calamari, and Republic/Gungan forces overwhelmed the aqua droids and Riff Tamson, driving the Separatists away from the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}