{"url": "Aqualish", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Amphibian sentient species", "Category:Aqualish", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Aqualish"}, {"tag": "p", "text": "Aqualish were a species of sentient humanoids from the planet Ando, who were identifiable by round black eyes and fur. Some members of this race possessed four eyes, others only one pair."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Aqualish generally had bald heads, fur around their cheeks, and they appeared to have different skin colors from each other. Aqualish also tended to have either twoor four eyes, and different kinds of hands. The criminal Ponda Baba had hairy hands with five digits, while some Aqualish who were a part of the Galactic Republic Senate sported hairless hands with three digits. The species spoke Aqualish. Aqualish had red-colored blood that did not cauterize."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The lives of Aqualish revolved around water, but they did not need it to thrive and could settle far from it. Some Aqualish, like the arms manufacturer Amda Wabo, came from the planet Ando. They could be found among the galactic community by the time of the Galactic Republic, where a number of them were members of the Republic Senate."}, {"tag": "p", "text": "However, some Aqualish did not agree with the direction of the Republic, and at least two Aqualish politicians aligned themselves with the Sith Lord Count Dooku. Multiple other Aqualish went to work for Dooku's anti-Republic faction, the Confederacy of Independent Systems. During an armed conflict between the Confederacy and the Republic, referred to as the Clone Wars, an Aqualish named Pune Zignat worked alongside the Neimoidian General Lok Durd. Both were captured by Republic forces on the planet Maridun. After the Clone Wars, the Republic was dissolved and transformed into the Galactic Empire. Two of the Aqualish who had aligned themselves with the Confederacy were murdered by the Sith Darth Vader on the planet Mustafar."}, {"tag": "p", "text": "During the Galactic Civil War, some Aqualish turned to piracy and bounty hunting, while others decided to join the Rebellion in order to restore the Republic and regain their seat in the Senate."}, {"tag": "h2", "text": "Aqualish in the galaxy"}, {"tag": "p", "text": "As well as being senators for the Galactic Republic and officers for the Confederacy, some Aqualish have found careers as both criminals and arms dealers. Utonk Hid was an Aqualish gunman who was a guest at Tiggs Leo's tavern on the planet Coruscant. An Aqualish criminal was Ponda Baba, who, along with his friend Doctor Cornelius Evazan, had the death sentence on twelve star systems. Baba lost his arm to Jedi Obi-Wan Kenobi during a cantina brawl."}, {"tag": "p", "text": "Amda Wabo was an Aqualish arms dealer who worked out of the planet Garel. During the reign of the Galactic Empire, Wabo attempted to sell T-7 ion disruptor rifles to the Empire through Minister Maketh Tua. Their efforts were disrupted by a group of rebels from the planet Lothal, and some of the weapons ended up in the hands of the crime boss Cikatro Vizago. At least one Aqualish was a member of crime lord Jabba the Hutt's court on the planet Tatooine."}, {"tag": "p", "text": "A group of Aqualish used the former Mandalorian covert of the Tribe on Nevarro, particularly the Armorer's workshop, as a hideout around 9 ABY, where they were intercepted and killed by the Marshal of Nevarro Carasynthia Dune, prior to the second skirmish on Nevarro."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Aqualish species first appeared through the character of Ponda Baba in the first Star Wars film, Episode IV A New Hope in 1977. An Aqualish appeared in Jabba the Hutt - Galactic Gangster, an episode of Star Wars Galaxy of Adventures, which are a series of shorts that are not supposed to be taken as literal canon events. Within the short, the Aqualish, who had been taken captive by bounty hunter Boba Fett, is brought before Jabba the Hutt. The crime lord proceeded to drop the captive into his rancor pit, allowing Pateesa to eat the Aqualish."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}