{"url": "LEGO_Star_Wars:_The_Empire_Strikes_Out", "categories": ["Category:Real-world articles", "Category:LEGO Star Wars films"], "nodes": [{"tag": "h1", "text": "LEGO Star Wars: The Empire Strikes Out"}, {"tag": "p", "text": "LEGO Star Wars: The Empire Strikes Out is a LEGO TV special that aired on Cartoon Network on September 26, 2012. It was released on DVD on March 26, 2013."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The movie begins just as the rebels destroy the Death Star. Luke Skywalker and Han Solo fly back to the rebel base on Yavin 4, where Princess Leia Organa is briefing the rebel troops. She says that, since the rebels destroyed the Death Star, the Empire is probably planning a counter-strike, so all the rebels should evacuate to their secret base on Hoth. As they do this, Luke, R2-D2, Han, and Leia will attack a stormtrooper base on Naboo, with Han and Leia gathering Gungan Warriors and Luke and R2-D2 finding the base's location. As they all leave hurriedly, they leave behind C-3PO, who is devastated until he finds out that Chewbacca and the Millennium Falcon have also remained behind."}, {"tag": "p", "text": "Han and Leia left to greet Boss Nass and the Gungan warriors that would be assisting them. Luke finds the stormtrooper base, but as he tries to contact Han and Leia regarding its location, his location is given away by some fangirls of his. He tries to flee from them, attempting to wear a Darth Vader costume, though this fails and he is forced to flee the planet."}, {"tag": "p", "text": "Meanwhile, Darth Vader confronts his officers on an Imperial Star Destroyer, Admiral Piett, Admiral Ozzel, and General Veers. Admiral Ozzel assures him that he sent probe droids to track Skywalker, though the Skywalker that the droids were tracking was Anakin Skywalker, Darth Vader. In anger, Vader warns Ozzel that he has failed him for the last time, but Firmus Piett taunts him over the fact that Ozzel will fail them again if he lives, leading to a fight which Vader puts an end to. Later, Emperor Palpatine arrives and plans to rebuild the Death Star out of LEGO pieces with Darth Vader and Darth Maul, whom Vader is surprised and upset to hear has returned. Maul and Vader soon develop a sibling rivalry, and Vader jumps at the opportunity to leave and hunt down the Millennium Falcon, which had left Yavin 4 after C-3PO misinterpreted a message Luke had sent him as a cry for rescue."}, {"tag": "p", "text": "While flying, Luke's X-wing starfighter and Darth Vader's TIE Advanced collide, resulting in Vader crash-landing on Tatooine and Luke crashing into a Star Destroyer, where, still in his Darth Vader costume, is mistook by the Imperials on the ship for Darth Vader. On Tatooine, Vader is captured by Jawas, who attach droid pieces to him and attempt to sell him. Vader, however, uses the force to free himself and construct a podracer to escape on."}, {"tag": "p", "text": "On Naboo, Leia, Han, and the Gungan warriors go to Luke's last destination, finding the stormtrooper base and planning a surprise attack, only for Chewbacca and C-3PO to crash land the Millennium Falcon on them, alerting the stormtroopers and starting a battle, resulting in the heroes being forced to surrender. However, Luke arrives in his Darth Vader costume and orders the stormtroopers' AT-AT Walkers to destroy the stormtrooper base. He then attempts to leave with the \"prisoners\", but Darth Vader arrives, unmasks Luke and starts dueling with him, while the Gungan warriors, Han, and Leia, with the help of X-Wing Starfighters, fend off the Imperials. Darth Vader is about to reveal that he is Luke's father, but C-3PO convinces Luke's young fans to annoy Vader instead by showing them a picture of Anakin Skywalker at age 19, forcing him to flee before he can tell Luke. Luke and his friends then leave the planet, taking out an Imperial Star Destroyer sent after them in the process."}, {"tag": "p", "text": "Palpatine discovers that while Maul had been in charge of building the new Death Star, he had made it look like himself, which Darth Maul thought was \"awesome\", much to Palpatine's horror. Vader's fans cause him to fly into the \"Darth Star\", destroying it, and the debris hits the Star Destroyer's view-ports, creating a vacuum that sucks Darth Maul into space. Overjoyed at Darth Maul's disappearance and the destruction of Maul's Death Star, Palpatine hugs Vader and praises him. Soon, in the style of the awards ceremony at the end of A New Hope, Palpatine awards Vader the \"Employee of the Month\" award, and when Darth Vader's fans catch a glimpse of Vader's face beneath his mask, they are no longer crazed over him and chase after Darth Maul instead. Overjoyed with the recent turn of events, Vader pats the back of one of the stormtroopers standing attention at the event, inadvertently causing all of the stormtroopers to fall over like dominoes. Palpatine cries, \"Vader!\" angrily, ending the movie."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The special featured many references to the Star Wars saga:"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}