{"url": "LEGO_Star_Wars:_The_Freemaker_Adventures_Season_One", "categories": ["Category:Real-world articles", "Category:Non-canon articles", "Category:Pages needing citation", "Category:LEGO Star Wars: The Freemaker Adventures"], "nodes": [{"tag": "h1", "text": "LEGO Star Wars: The Freemaker Adventures Season One"}, {"tag": "p", "text": "LEGO Star Wars: The Freemaker Adventures Season One is the first season of the animated television series LEGO Star Wars: The Freemaker Adventures. The season consisted of thirteen 22-minute long episodes that aired on Disney XD between June 20 and August 29, 2016."}, {"tag": "h2", "text": "Production"}, {"tag": "p", "text": "The first season of The Freemaker Adventures was created by Bill Motz and Bob Roth, who conceptualized the story as the adventures of a scavenging family between the events of The Empire Strikes Back and Return of the Jedi. The series drew on characters and plot elements from both the Star Wars Original and Prequel trilogies. The first season was jointly produced by the LEGO Group, Lucasfilm, and Wil Film."}, {"tag": "p", "text": "The first season was directed by Michael Hegner, Jens Møller, Martin Skov, Frederik Budolph-Larsen, and Per Risager. Meanwhile, illustrator and art director Doug Chiang and LEGO Lead Model Designer Erik Varszegi worked on designing the show's objects and structures. Veteran Lucasfilm sound editor Matthew Wood served as the show's sound designer and also voiced the B1-series battle droid character R0-GR (\"Roger\"). The first season's music score was composed by Michael Kramer, who drew inspiration from John Williams."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "The Freemaker Adventures' first season was distributed by The Walt Disney Company through its digital cable and satellite television channel Disney XD. StarWars.com also released three promotional trailers in the early half of 2016 to promote the series. Beginning with \"A Hero Discovered\", the first four episodes were released between June 20 and June 23, 2016 on Disney XD along with several other platforms including Video on Demand and the Disney XD app on computers, phones, and other devices."}, {"tag": "p", "text": "After the fifth episode \"Peril on Kashyyyk\" debuted on June 27, the series took a two-week hiatus until the release of \"Crossing Paths\" on July 11, 2016. The series than ran until the premiere of its thirteenth episode \"Return of the Kyber Saber\" on August 29. On December 6, the first season was released in the form of two-disc Blu-ray and DVD sets entitled LEGO Star Wars: The Freemaker Adventures – Complete Season One. The complete first season collection also included several bonus items including promotional clips, the one-minute Freemaker Salvage and Repair video, behind the scenes footage, and interviews with cast members."}, {"tag": "h2", "text": "Episodes"}, {"tag": "h2", "text": "Trivia"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}]}