{"url": "LEGO_Star_Wars:_The_Quest_for_R2-D2_(film)", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Pages needing citation", "Category:LEGO Star Wars films"], "nodes": [{"tag": "h1", "text": "LEGO Star Wars: The Quest for R2-D2 (film)"}, {"tag": "p", "text": "LEGO Star Wars: The Quest for R2-D2 is a short film made by M2Film to celebrate the ten-year anniversary of LEGO's Star Wars license. The film premiered on August 28, 2009 in the 9:00 ET (8:00 CT) time block on Cartoon Network. The movie was shown in two parts in the breaks of a rerun of Cartoon Network's live-action show Destroy Build Destroy.[source?] It was later made available on the official LEGO Star Wars website and LEGO Club YouTube channel."}, {"tag": "h2", "text": "Opening narration"}, {"tag": "h2", "text": "Synopsis"}, {"tag": "p", "text": "R2-D2 strolls across the desert planet he landed on after getting shot out of Anakin Skywalker's starfighter. Artoo eventually comes upon on an oasis. Meanwhile, Skywalker and Ahsoka Tano leave Coruscant in a Y-wing and Jedi starfighter respectively. The two arrive at an asteroid field, where a space slug lunges for Skywalker. The slug misses Skywalker's ship, and its mouth closes around an asteroid instead. Tano then shoots the rock out of the space slug's mouth. On Tatooine, R2-D2 is relaxing at the oasis. Three Jawas sneak up on him, disable Artoo with their ion blasters, and take him to their sandcrawler."}, {"tag": "p", "text": "Elsewhere, the search for Artoo continues. The elite squad of clone troopers searches a snow planet, led by Commander Cody and Captain Rex. Cody and Rex follow the direction given by a droid finder, only to discover an army of Separatist battle droids. Cody and Rex slide across the ice and whack the top of the droid finder into the army. The top of the finder collides into droids and disables an AT-AT until the whole army is neutralized. Cody and Rex then build an attack shuttle over the wreckage."}, {"tag": "p", "text": "The search for Artoo continues as the Jawas hold a sale back at their sandcrawler. R2-D2 is one of the droids on display and gets the interest of one General Grievous. Grievous takes Artoo to his base, but the droid eludes his captors and sends distress signal before hiding in a closet. Onboard the Twilight, Anakin Skywalker and Ahsoka Tano detect the signal. The Twilight jumps into hyperspace along with the attack shuttle, a V-19, and an ARC-170."}, {"tag": "p", "text": "Meanwhile, Artoo finds that a pink astromech named R2-KT had already occupied the closet just as Grievous discovers Artoo's hiding place. Skywalker's force arrives at the base and heads toward the Separatist ship. Droid starfighters rush to intercept, but the Republic ships blast their way through. Skywalker and Tano land in a hangar and fight their way through battle droids. Elsewhere, Cody and Rex race down a different corridor. Meanwhile, Count Dooku, Asajj Ventress, and Grievous watch as a machine is lowered to extract Artoo's secret. Skywalker and Tano arrive and take out both the machine and the battle droid holding down Artoo. Dooku, Ventress, and Grievous ignite their lightsabers just as Cody and Rex arrive alongside the Jedi."}, {"tag": "p", "text": "Obi-Wan Kenobi and Yoda show up, and Kenobi ignites his lightsaber. Yoda, however, uses the Force to open a hole in the floor beneath the Separatists, and the three fall into space. Yoda continues to move pieces to assemble a CR90 corvette. Everyone boards the starship, and the Separatist ship explodes after they leave. Aboard the corvette, Kenobi has R2-D2 turn on his holoprojector. After bringing up a hologram of a ship, Artoo displays the correct hologram: an advertisement for the grand opening of Skywalker World. He then gives everyone VIP all access tickets to Skywalker World."}, {"tag": "p", "text": "The last scenes show the characters enjoying their time at Skywalker World. Skywalker and Tano each get cotton candy. Kenobi and Yoda try out the \"Force-O-Meter\". Rex and Cody play a shooting game. Finally, Artoo enjoys a boat ride with R2-KT."}, {"tag": "h2", "text": "Crew"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "LEGO Star Wars: The Quest for R2-D2 begins with a loose adaptation of the Battle of Bothawui, which first appeared in the Star Wars: The Clone Wars episode \"Downfall of a Droid\", which first aired on November 7, 2008. Despite this, the outcomes of \"Downfall of a Droid\" and LEGO Star Wars: The Quest for R2-D2 are completely different."}, {"tag": "p", "text": "Anakin Skywalker lands the Twilight in Hangar THX-1138. This is yet another reference to the film THX 1138. Shortly after landing the Twilight, a TIE Advanced x1 starfighter catches Anakin's eye. During this short time, the shadow of Darth Vader can briefly be glimpsed behind him. In Skywalker world, when R2-D2 goes on a boat ride with the pink astromech, two X-wings can be seen making a smoke trail in the shape of a heart, and the \"Tunnel of Love\" entrance is the helmet of Darth Vader. On Hoth, some clone troopers are shown building a snowman with Darth Vader's helmet. Also, when Anakin and Ahsoka are getting cotton candy, Princess Leia is the one selling it. Another well-known George Lucas character, Indiana Jones, appears at the Jawa \"garage sale,\" removing C-3PO's head from a cardboard box."}, {"tag": "p", "text": "The theme music played at the beginning of the film is Kevin Kiner's variation of the Star Wars theme from Star Wars: The Clone Wars."}, {"tag": "p", "text": "The short was released as a bonus feature on the Blu Ray/DVD combo of LEGO Star Wars: The Padawan Menace."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}