{"url": "LEGO_Star_Wars:_The_Yoda_Chronicles", "categories": ["Category:Real-world articles", "Category:Animated television series", "Category:LEGO Star Wars: The Yoda Chronicles"], "nodes": [{"tag": "h1", "text": "LEGO Star Wars: The Yoda Chronicles"}, {"tag": "p", "text": "LEGO Star Wars: The Yoda Chronicles, also known as The New Yoda Chronicles., is a seven-part animated series that debuted on Cartoon Network on May 29, 2013 and May 29, 2014 on Disney Channel. It also includes an eleven-part \"Mini Movie\" web TV series that was released alongside the seven episodes. It was written by Michael Price, who had previously written LEGO Star Wars: The Padawan Menace and LEGO Star Wars: The Empire Strikes Out."}, {"tag": "h2", "text": "Premise"}, {"tag": "p", "text": "LEGO Star Wars returns in epic style with THE YODA CHRONICLES, a thrilling, funny and action-packed new LEGO Star Wars story told in three animated TV specials! Set in the “Prequel” Star Wars timeline, THE YODA CHRONICLES stars the one and only Yoda—the Jedi Master who has seen it all, done it all, and taught generations of Jedi Knights—in an all-new adventure. With the help of a fresh class of Padawans, Yoda leads the Jedi in a desperate fight to stop Darth Sidious and his minions from creating a new super-weapon that could crush the Republic and win the war for the forces of Evil."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Lucasfilm Ltd. allowed the LEGO group free reign with developing the storyline. The team worked to make sure everything looked consistent if it would have been made with LEGO bricks, as well as adding humor to the story."}, {"tag": "h2", "text": "Release"}, {"tag": "p", "text": "The first three episodes were released on Cartoon Network between May 29 and November 27, 2013. The remaining four episodes were released on Disney XD under the title The New Yoda Chronicles without the LEGO logo between May 4 and November 23, 2014 since Cartoon Network owned the broadcasting rights to the name LEGO Star Wars: The Yoda Chronicles."}, {"tag": "p", "text": "The first two episodes were released on DVD on September 11, 2013, and the final four were released on DVD on September 15, 2015. Several mini-movies have been released which tie into the series proper: episodes 4-6 tie into \"Escape from the Jedi Temple\". The third episode \"Attack of the Jedi\" still misses a DVD release as of January 2016."}, {"tag": "p", "text": "The first three Mini-Movie episodes were released with the first three episodes. The later eight Mini-Movie videos tie into the later four episodes."}, {"tag": "p", "text": "The New Yoda Chronicles episodes are available on the Disney+ streaming service, which launched on November 12, 2019. Disney+ also has an alternate version of \"Clash of the Skywalkers\" titled \"Duel of the Skywalkers.\""}, {"tag": "h2", "text": "Episodes"}, {"tag": "h3", "text": "TV episodes"}, {"tag": "h3", "text": "Mini Movies"}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}