{"url": "LIN_demolitionmech_autonomous_minelayer", "categories": ["Category:Canon articles", "Category:Articles needing illustration", "Category:Imperial droids", "Category:LIN demolitionmech autonomous minelayers", "Category:Mining droid models"], "nodes": [{"tag": "h1", "text": "LIN demolitionmech autonomous minelayer"}, {"tag": "p", "text": "The LIN demolitionmech autonomous minelayer, also known more simply as just the LIN demolitionmech or LIN mining droid, was a model of dome-shaped mining droid designed and manufactured by Cybot Galactica to plant explosives to blast away rocks and debris. They were also used to lay mines on battlefields and had protective shells to protect against explosions and falling debris. These shells did however slow the droid considerably, and they also suffered from vulnerability to moisture and damage to their treads."}, {"tag": "p", "text": "The droids initially sold well, but after a mining accident was inaccurately blamed on a LIN demolitionmech the line's reputation was irreparably damaged and so the model was retired and the remaining stock sold off to the Galactic Republic for use in the Clone Wars. LIN mining droids would later see use by both criminal elements and the Galactic Empire."}, {"tag": "p", "text": "In 0 BBY, a LIN designated LIN-V8K was among the droids on board the sandcrawler that rebel droids R2-D2 and C-3PO were brought aboard during the secret mission to the planet Tatooine. Along with the rest of the droids on board, it was brought out for display at the Lars moisture farm; however, the LIN unit was not selected for purchase by the moisture farmer Owen Lars."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Dome and explosives"}, {"tag": "p", "text": "The LIN demolitionmech autonomous minelayer was a solidly constructed mining droid designed to plant explosive mines on battlefields or to blast away rocks and debris. The model's most obvious feature was its large, heavy, black durasteel protective dome, which armored the droid against falling debris and was tough enough to deal with explosives and the results of their deployment. The dome's weight also inadvertently made its presence all the more necessary, as the LIN demolitionmech's drivetrain could barely cope with the weight, causing the droid to be extremely slow. This meant that it inevitably was still within range of any explosives it laid when they were triggered."}, {"tag": "p", "text": "The front half of a LIN unit's dome contained a rotating explosives storage rack that held the droid's ordnance, which could include timer mines. This sat beneath the model's single retractable manipulator arm, which was strong enough to use its primitive pincer to remove objects hindering the droid's progress, but was primarily intended to pick up an explosive from the rack and then place it at the key point decided by the droid's various sensors."}, {"tag": "h3", "text": "Sensors"}, {"tag": "p", "text": "The cone-shaped primary visual sensor was sat atop a stalk at the rear of the mine rack, extending out through a slit at the top of the dome and protruding just in front of the apex. It could not retract, as the droid needed to see at all times. The visual sensor resembled a stumpy, armored periscope and in the event that it was damaged due to its inability to retract, it was the most easily replaced component within the droid. The sensor was capable of sending a live feed to external operators so that they could review the droids progress. At the very center of the the dome the droid could extend a telescoping acoustic signaller through the slit to speak in binary, as otherwise an internal signaller would be muffled by the dome."}, {"tag": "p", "text": "The rear half of the units dome contained a range of internal sonic sensors which were designed to detected structural weakness in surrounding terrain, including everything from rock walls to building structural supports. This allowed either the droid itself or an external operator to determine where best to place an explosive. The sensors could also detect and set off mines that the droid's dome would protect it from. The droid's vital communications antenna sat above the sonic sensors and extended through the same slit as the visual sensor, protruding just behind the apex, but as it was vulnerable it could retract within the dome to avoid damage. The communications equipment was extremely powerful, as it was designed to send signals through solid rock."}, {"tag": "h3", "text": "Treads"}, {"tag": "p", "text": "At the base of the dome lay a flat ground sensor that sat above the unit's two sturdy drive treads, each of which consisted of five drive wheels within a rotation track. The treads were the same as those used in WED Treadwell repair droids, although with additional armor added. Despite this the treads were still extremely vulnerable to damage. Excessive moisture, as such was often found in damp mining operations, caused havoc with the LIN mining droid's moving components and could cause them to seize up. This could sometimes leave the droid in awkward places and was considered a even more serious issue then the droid's ponderous movement speed, as recovering a droid stranded in the middle of a mine clearing operation was not an easy task."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "An unfair reputation"}, {"tag": "p", "text": "The LIN demolitionmech autonomous minelayer was manufactured by Cybot Galactica to meet civilian and military needs and initially did reasonably well when marketed in the mining and demolition industries, although its slow speed and vulnerability to moisture occasionally frustrated customers. Orders for the droid dried up however after a LIN unit was blamed for a faulty charge going off deep underground during a mining operation, resulting in the deaths of a number of miners."}, {"tag": "p", "text": "The droid and its manufacturer were later exonerated through an investigation into the incident, but the damage was already done as model had gained an unfortunate and unfair, but permanent, reputation. Cybot Galactica quietly retired the line and was able to sell off its remaining stock to the Galactic Republic for use as mine clearance droids during the Clone Wars, a role in which they provided good service."}, {"tag": "p", "text": "Following their retirement, the cut-priced droids also became popular with criminal elements, who used their internal sonic sensors to have the droids break into secure vaults, only further harming the model's terminally damaged reputation. Despite this, LIN droids were also used by the Galactic Empire during its reign, with some being deployed on board the Death Star superweapon."}, {"tag": "h3", "text": "Abandoned on Tatooine"}, {"tag": "p", "text": "Several LIN droids were left behind on the desert planet Tatooine after the mining companies they belonged to abandoned operations their. These droids were scavenged by members of the Jawa species, who also took over the sandcrawler left by the companies, and in 0 BBY, the LIN mining droid LIN-V8K was amongst many droids kept aboard the sandcrawler of the Jawa clan that discovered the rebel droids R2-D2 and C-3PO."}, {"tag": "p", "text": "When the sandcrawler reached the Lars moisture farm, the LIN unit was amongst the droids wheeled down the sandcrawler's ramp and placed in a sales lineup for the Lars family to inspect, although the Jawas had difficulty getting the elderly unit to move properly. The homestead owner Owen Lars looked over the lineup, but ultimately chose to only purchase the rebel droids. The sandcrawler was later attacked by Imperial stormtroopers searching for R2-D2 and C-3PO, and the Jawas inside massacred."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the script of the Star Wars: The Clone Wars episode \"The Hidden Enemy,\" the opening sequence was to originally feature clone troopers setting up their own LIN modified for combat that they had nicknamed \"The Beast.\" This content was ultimately cut from the final episode as it was deemed unnecessary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}