{"url": "LR-57_combat/retail_droid", "categories": ["Category:Canon articles", "Category:Retail Clan products", "Category:Separatist battle droid models"], "nodes": [{"tag": "h1", "text": "LR-57 combat/retail droid"}, {"tag": "p", "text": "The LR-57 combat/retail droid, also known as the LR-57 combat droid, Retail Caucus droid, or retail droid, was a model of battle droid used by the Retail Caucus and the Confederacy of Independent Systems during the Clone Wars, most prominently at the Battle of Christophsis."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "With its relatively low versatility, the LR-57 was used for very particular situations. It stood bipedal like its more common B1 and B2 battle droid counterparts, but was taller and wider in size. Its legs were attached to a small pelvic mount that held its large head. The front face of the head had between one and three photoreceptors. From the back of the cylindrical head protruded two arms equipped with double laser cannons. These primarily functioned as typical blasters at mid-range, however they could also be used for physical attacks for close-combat. They were capable of vocalizing in Galactic Basic Standard."}, {"tag": "p", "text": "Located near the front of its head, the LR-57 had two sensory antennae on either side, that aided one of their specialties as ambush attackers. The droid was able to lay dormant in shallow ground in wait of enemies traversing above, using the exposed antennae to detect disturbances. When set in a dense arrangement, tripping a single dormant LR-57 would cause all others within a short proximity to also activate."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Battle of Christophsis"}, {"tag": "p", "text": "The LR-57 model was first seen used by the Confederacy during the Battle of Christophsis. An indeterminate number was buried in the immediate vicinity of a vital shield generator as a final measure of protection. Jedi Knight Anakin Skywalker and his padawan Ahsoka Tano infiltrated separatist territory to disable the shield generator. Upon arriving at the site, Tano ran ahead impatiently, despite her master's warnings. Without noticing the field of LR-57 antennae sticking up from the ground, she inadvertently activated several instances of the large droids."}, {"tag": "p", "text": "Skywalker promptly began cutting down LR-57 units as they slowly react to the Jedi's sudden appearance. While Tano started attaching explosives to the generator, one LR-57 approached from behind and attempted to strike her with its arm. She narrowly dodged the attack before decapitating it, but the head rolled over more buried LR-57 units. As Skywalker became corned by the droids, Tano used the Force to collapse the wall behind him and crush the remaining LR-57 droids."}, {"tag": "h3", "text": "Battle of Malastare"}, {"tag": "p", "text": "The Confederacy used LR-57 battle droids alongside traditional B1 battle droids, B2 battle droids, and dwarf spider droids in the Battle of Malastare. They were part of a large battalion of separatists forces in an assault on a Republic base, all of which fell victim to the Republic's test of their prototype electro-proton bomb."}, {"tag": "h3", "text": "Carlac"}, {"tag": "p", "text": "One instance of the LR-57 model, Battle droid 513, ended up in a camp of the Mandalorian terrorist group, Death Watch, on Carlac. It, along with several other droids, was repeatedly used as target practice by the Mandalorians. They were often callously left in a state of disrepair before being rebuilt for continued use, but the soldiers would not bother wiping their memories, l Its right leg had been replaced with that of an LM-432 crab droid and its right arm with that of a B1 battle droid."}, {"tag": "p", "text": "When Lux Bonteri brought Ahsoka Tano to Death Watch's camp, R2-D2, who had accompanied her, was ordered to repair the broken droids. With the Battle droid 513 begging him to repair it and the others, the astromech granted its request. The LR-57 expressed gratitude, offering its assistance in any way possible as repayment. R2 asked for them to help rescue Tano from Death Watch, to which Battle droid 513 agreed, preparing the other droids for battle."}, {"tag": "p", "text": "The group of droids engaged the Death Watch soldiers, allowing R2, Tano, and Bonteri to escape, but were quickly dispatched, and the Battle droid 513 was destroyed by Bo-Katan Kryze."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}