{"url": "LS-515", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:Lothal Imperial Garrison members", "Category:Stormtroopers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "LS-515"}, {"tag": "p", "text": "LS-515 was a human female scout trooper that served the Galactic Empire. While patrolling an Imperial excavation site centered around the Lothal Jedi Temple, LS-515 and her speeder wing-mate LS-412 were ambushed by the Spectres rebel group. The rebels stole the scouts' armor to use as disguises."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "LS-515 was a female scout trooper who was stationed on Lothal in 1 BBY. She and her wingmate LS-412 were assigned to patrol the perimeter of the excavation camp outside the Lothal Jedi Temple on 614-AvA speeder bikes. While on patrol, they stumbled upon a holographic projection of Grand Admiral Thrawn from the Battle of Atollon. LS-515 and LS-412 were then knocked out by the Lasat Garazeb Orrelios, who was a member of the Spectres rebel cell. As Zeb hit her, her helmet flew off."}, {"tag": "p", "text": "The rebels Sabine Wren and Ezra Bridger then stole her and LS-412's armor and infiltrated the camp. Despite the rebel impostors' disguises, LS-515 and LS-412's absence did not go unnoticed by the other Imperials. While Sabine and Ezra were trying to unlock the Painting of the Mortis gods, a stormtrooper confronted \"LS-515\" and asked why she and LS-412 had deviated from their regular patrol. Sabine claimed it was a misunderstanding and offered to go to \"Operations\" and sort it out. At the mobile command center, the Imperial Minister Veris Hydan exposed her as an undercover rebel and placed the camp on lockdown."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "LS-515 was a female human who served as a scout trooper in the Imperial Military. She wore white armor over a black uniform and rode a 614-AvA speeder bike."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "LS-515 first appeared in the Star Wars Rebels Season Four episode \"Wolves and a Door\", which premiered on February 26, 2018. She was voiced by Vanessa Marshall, who also voiced the rebel protagonist Hera Syndulla."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}