{"url": "LS-150_Heavy_Accelerated_Charged_Particle_Repeater_Gun", "categories": ["Category:Legends articles", "Category:Arakyd Industries products", "Category:Personal heavy weaponry"], "nodes": [{"tag": "h1", "text": "LS-150 Heavy Accelerated Charged Particle Repeater Gun"}, {"tag": "p", "text": "The LS-150 Heavy Accelerated Charged Particle Repeater Gun (Heavy ACP Repeater) was a large air-cooled repeater with disintegrating plasma cartridges."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Mostly seen in the hands of Trandoshan Elites, the LS-150 was a bit more portable than a turret off a starship. Arakyd Industries manufactured this gun (along with other guns such as the Accelerated Charged Particle Repeater Gun, the Heavy Repeater's little brother.) The LS-150 used a 200-round magazine and chewed through rounds quickly, and these ammo packs were large and bulky, allowing a typical Human to only carry one in reserve."}, {"tag": "p", "text": "While ACP weapons generally lacked effectiveness against armored droids, the LS-150's brute firepower and high cycling rate granted its effectiveness against heavy units such as a Super Battle Droid or mass amounts of B1-Series battle droids. It also tore through living targets such as Humans and Trandoshans mercilessly killing or injuring them very quickly."}, {"tag": "p", "text": "For close combat, it had a bayonet to stab enemies in front of one as seen when a heavy mercenary made a clone trooper a victim of its brute power aboard the Prosecutor."}, {"tag": "p", "text": "It had a fairly good range but was rather heavy and large for a weapon, compensating for its raw power in both melee action and shooting, which explains why only well-trained users like the Trandoshan heavy mercenary often used this kind of weapon. In fact, it was so heavy that a human carrying it usually had balancing issues, making it difficult for him to run."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars, the weapons were used by Trandoshan mercenaries and slavers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}