{"url": "LSx-series_slicer_droid", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic droids", "Category:Espionage droid models", "Category:Imperial droids", "Category:Loronar Corporation products", "Category:Slicer droids"], "nodes": [{"tag": "h1", "text": "LSx-series slicer droid"}, {"tag": "p", "text": "The LSx-series slicer droid was a model of slicer droid manufactured by the notoriously corrupt and rapacious Loronar Corporation, and was one of the few known dedicated slicer droids on the market. It was introduced to the galaxy during the early years of the Galactic Empire where it was falsely identified as a programming and computer sciences droid, marketed toward educational institutions and technology companies. The droid, however, was in fact a dedicated slicer unit geared toward industrial espionage and for utilization by military intelligence units."}, {"tag": "p", "text": "Along with the aboveboard marketing, Loronar exerted all its corporate strength into peddling the LSx-series to any law enforcement agencies or government intelligence units that may desire their use, including the Galactic Empire and various factions that were aligned with the Alliance to Restore the Republic, and while the Imperial Security Bureau and Imperial Military agencies dissented at utilization after they had already signed contracts with both Arakyd Industries and MerenData to purchase espionage and slicer droids, the Alliance snapped LSx droids up in bulk to bolster the government's small intelligence corps."}, {"tag": "p", "text": "LSx-series droids were humanoid-shaped constructs just under two meters tall, with spindly limbs as well as a long, animal-like head reminiscent of Baktoid Combat Automata's B1-series battle droids, and were equipped with cutting-edge slicer gear and powerful programming and data analysis firmware that easily rivaled that of most intelligence agencies and criminal organizations. Packed into their hands and bulky forearms was an array of fine manipulators, computer probes, scomp links, circuit chasers, and other electronics and computer repair tools that allowed the droids to access anything from datapads to military-grade mainframe. Mounted between the knuckles of their right hand, they could even carry a scomp-spiker, which was a highly illegal piece of industrial espionage and sabotage equipment that poured a devastatingly high-voltage charge through computer systems to destroy both hardware and software, and although they were not programmed for combat, the LSx-series droids were capable of self-defense if necessary, and the scomp-spiker made for an extremely nasty weapon against both organics and droids."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}