{"url": "LUH-989", "categories": ["Category:Legends articles", "Category:Wookieepedia Good article nominations", "Category:B1 battle droids", "Category:Trade Federation military members"], "nodes": [{"tag": "h1", "text": "LUH-989"}, {"tag": "p", "text": "LUH-989 was a B1-Series battle droid that served in the Trade Federation Droid Army. Between 39 BBY and 36 BBY, the battle droid commanded a listening array on the moon Alaris Prime used to spy on the Trade Federation's rival Wookiee colonists. LUH-989 sent several droids to attack a camp led by the Wookiee Chewbacca, who, after defeating them, counterattacked by destroying the listening array."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "LUH-989 was a B1-Series battle droid used in the Droid Army of the Trade Federation. Between 39 BBY and 36 BBY, LUH-989 was placed in command of a secret listening array on a beach on the moon Alaris Prime as part of the Trade Federation's illegal colonization effort there. The array was used to spy on the Federation's enemies, the rightful Wookiee colonists led by the Wookiee Chewbacca. The array was guarded by four B1-Series battle droids, two advanced beetle droids, and two droidekas."}, {"tag": "p", "text": "LUH-989 launched an attack on Chewbacca's camp with a force of three beetle droids and six Battle Droid Beta Versions. Chewbacca's Wookiees repelled the attack, and scouts from the camp of the Wookiee leader Shoran subsequently discovered LUH-989's listening array, which led the Wookiees to plan to destroy it. LUH-989's droids killed one of Shoran's heavy bowcaster troopers who walked into the array. Afterward, a force of Wookiees gathered by Chewbacca marched into the array, destroying the transmitters there along with every droid guarding them."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "LUH-989 was tasked with overseeing the Trade Federation's secret listening operations on Alaris Prime and commanded a variety of battle droids for that purpose. Like other battle droids, he had masculine programming and was 1.91 meters tall. LUH-989 had light tan plating with brown markings and was equipped with a backpack from which an antenna extended."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "LUH-989 wielded an E-5 blaster rifle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "LUH-989 appeared in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds. In the Wookiee tutorial campaign, the droid was identified as the Trade Federation commander in the sixth level, entitled \"Allies and Jedi.\" He was also available as a unique unit in the game's scenario editor, and his name could appear as a Trade Federation AI commander in the standard game mode. LUH-989's profile image and model are identical to those of other unique battle droid units. His model uses different colors than his profile image, featuring the tan color common to other B1-Series battle droids on his head and parts of his limbs along with the player's alignment color on his chest and legs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}