{"url": "Laboi", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Laboi", "Category:Mammalian sentient species", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Laboi"}, {"tag": "p", "text": "The Laboi were a species of sentient, fur-covered, serpentine mammals. They ranged from two to ten meters long, but despite their size, a lack of limbs limited them to manipulating only simple technology that depended on grasping basic tools with the tail or mouth. Some female Laboi had natural telekinetic powers that augmented their ability to interact with their surroundings. The Laboi hailed from the planet Laboi II, a world that took 4,040 hours to rotate on its axis. Although this long day resulted in blistering heat in the daytime and biting cold in the night, the Laboi were well adapted to both extremes. Their fur changed color; it turned white in the day to reflect heat and turned bright primary colors at night as camouflage against Laboi II's mineral forests."}, {"tag": "p", "text": "Laboi were entirely carnivorous, as their sharp teeth revealed. Their preferred prey was the ovolyan, a bantha-sized, reptilian quadruped. The creature also ate Laboi when it could, which made ovolyan hunts treacherous at best. Laboi society revolved around the hunt, an event during which the largest male served as pack leader. Since Laboi continued to grow throughout life, the rulers were also the oldest and most experienced hunters. Despite their lack of modern galactic technology, the Laboi were knowledgeable and refined, with many advanced philosophers and theorists. One of their most impressive art forms was the creation of crystal gardens, which they tended at night with stir-sticks, or with telekinesis for subtle and intricate effects. Some Laboi were found off Laboi II, where they attained intellect-based employment as scholars and executives. During the regime of the Galactic Empire, some Laboi became crime lords, a position that put them in competition with the Hutts, a species notorious for its criminal dealings. Laboi did not enjoy a particularly good reputation with non-Laboi, who often worried that the serpentine creatures saw them as food. The impression was sometimes correct, since Laboi were aggressive predators by nature, and some held non-Laboi life to have little or no value."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Laboi were a species of sentient, serpentine mammals who completely lacked limbs. Their bodies tapered to a pointed tail, which the beings were able to use as a fine manipulator. Despite their often large size, Laboi could coil their bodies to reduce their overall length by about two thirds, although they found such a position uncomfortable. Unlike snakes and many other vermiform creatures, the Laboi were covered in thick fur, which came in shades of red, violet, blue, and green. Their hair served as insulation and camouflage, and helped the Laboi resist the cold and blend into the brightly colored mineral fields of their homeworld, Laboi II, during the frigid night. During the hot day, however, the coat lost its color and turned stark white to absorb less heat from the planet's sun, Er'Dox Kaan. The Laboi's fur also played a role in respiration: each hair was hollow to allow it to expel hot air from the respiratory system."}, {"tag": "p", "text": "The Laboi muzzle was long and narrow, and brimmed with sharp teeth that betrayed the species as carnivores—as were all forms of animal life on their homeworld. Above a cleft upper lip was a hairless nose perforated by four nostrils which led to sinus cavities that were devoted solely to olfaction. In fact, the Laboi's discriminatory sense of smell allowed them to track prey by scent alone. Two large eyes with vertical slits for pupils straddled the snout. Two prominent, flat, round ears jutted from the sides of the head. The species's countenance and serpentine form made them overall seem threatening and dangerous to non-Laboi."}, {"tag": "p", "text": "The species was divided into two sexes. Female Laboi gave birth to litters of young known as worms. The number of worms per litter depended on the size of the mother at the time of conception: a two-meter-long Laboi female could expect to bear a single worm, while an eight-meter-long matriarch could deliver up to twenty young at once. Laboi continued to grow throughout their lives. Adults males ranged in length from two to ten meters and in girth from one to three meters, while sexual dimorphism limited females to eight meters in length. Although the extent of the power was limited, female Laboi sometimes exhibited telekinetic abilities, an aptitude the males lacked. More prevalent in older females, the source of the capability remained a mystery until at least the Galactic Civil War; theories attributed it to everything from the Force to electromagnetism related to the mineral deposits of the Laboi's homeworld."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Divided into groups known as tribes or packs, the Laboi inhabited variegated fields of chromatic formations known as Laboian mineral crystals. The denizens of a particular crystal plot sedulously tended the rock gardens by stirring up the molten deposits of minerals puddled throughout their territory. The task was accomplished with either stir-sticks or, for those Laboi with such abilities, telekinesis. The species valued telekinetic rock tending more than that which relied on cruder tools, as mental manipulation allowed for more subtle working of the molten minerals."}, {"tag": "p", "text": "Status in Laboi society depended on physical size; longer Laboi held a higher rank than shorter ones. Because the species continued to grow throughout adulthood, the association of length with status meant that the highest-ranking Laboi in a particular pack were also the oldest. Those Laboi who had yet to reach two meters in length were considered the lowliest members of the group, and the loss of their lives was not considered a cause for lamentation."}, {"tag": "p", "text": "Laboi were aggressive by nature, and much of Laboi society revolved around the hunt. Nevertheless, they were fairly discriminating in their carnivorous tastes—their keen sense of smell made them picky about the foods they ate—and their favorite prey was the ovolyan, a large, bantha-sized reptilian creature that lumbered about on all fours. The same animal, incidentally, also enjoyed eating Laboi. Each Laboi pack fell under the command of the pack leader, the oldest—and thus largest—male in the group. The individual's position came solely due to his age; the pack leader needed not necessarily be the strongest male, only the oldest. The pack leader took care to organize the group's defenses against predators and to organize hunting activities. Each hunting party consisted of both males and females, although older and larger females rarely participated, as they were valued more as child bearers. The hunting party was led by a chief, the largest male to take part in the chase other than the pack leader. During an attempt to take down an ovolyan, typical Laboi hunting tactics called for the smallest hunters to stalk the potential kill, create an ambush, and then attack. Due to their lack of limbs and tools, Laboi combat involved direct physical attacks and weaving out of harm's way. Only if the younger hunters failed to take down the prey did the chief enter the fray. The loss of younger Laboi hunters to dangerous prey was considered part of the normal course of such a dangerous endeavor. Laboi music celebrated the hunts and told of daring clashes, unexplained vanishings, and valiant chiefs."}, {"tag": "p", "text": "By the time of the Galactic Civil War, the Laboi had not developed advanced technology. However, their homeworld had a starport with limited facilities, which afforded them access to items brought to their world by traders interested in purchasing cargoes of Laboian mineral crystals, which were considered chic in the Core Worlds. Lack of limbs prevented the Laboi from using much of standard galactic technology, which was mostly developed for species with fine manipulators. However, a few Laboi paid exorbitant prices to commission specialized equipment, such as mouth-operated guns. Still, most Laboi were content with what Laboi II had to offer and desired little from other worlds."}, {"tag": "p", "text": "The species was by and large open to foreign systems of belief and tolerant of other ways of life, and their native philosophical traditions were rich and deep. One indigenous religion had affinities with various galactic faiths that recognized the Force, and some Laboi may have developed the ability to use the Force. Laboi philosophy recognized the sanctity of intelligent life, although the species's overriding drive to eat sometimes conflicted with such notions. Some tribes recognized only other Laboi as \"sentient\" and thus ate offworlders with no compunction; others preferred to engage non-Laboi in deep discussions about philosophy first, then eat them. The most liberal-minded Laboi refused to eat other sentients in most circumstances—although even friends might be fair game in a survival situation. Regardless of an individual Laboi's attitude toward the palatability of sentient life, the species suffered a widespread reputation among non-Laboi as eaters of other intelligent species and as beings with whom one had to constantly be on guard."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Laboi evolved on the planet Laboi II, whose unusual rotation and orbit around its sun, Er'Dox Kaan, made the local day and night each 2,020 standard hours long. As a result, the planet became hot enough to melt metals in the daytime and cold enough to freeze organic beings in the night. However, strong winds whipped from one side of the world to the other and redistributed temperatures to some extent. To cope with this environment, the Laboi evolved specialized fur, each hair of which could both change color and expel hot air to help control body temperature."}, {"tag": "p", "text": "After they first encountered outsiders from the greater galaxy—sometime between 20,000 and 8000 BBY—the world became part of the Suolriep sector in the Outer Rim Territories, located within a portion of the Slice that brought their world into the influence of Hutt Space between 3976 and 3960 BBY, and from 1004 to 1000 BBY. During the regime of Emperor Palpatine, Imperial sentientologist Obo Rin included an entry on the Laboi in his Catalog of Intelligent Life in the Galaxy, a work in which he described those sentient species he considered to be the most important in the galaxy and of the most interest to the Empire."}, {"tag": "h2", "text": "Laboi in the galaxy"}, {"tag": "p", "text": "Few Laboi ventured from their homeworld. One reason for such reticence was the fact that their limbless anatomy made integration into galactic society difficult. Those Laboi who were able to find employment offworld leaned toward pursuits that relied more on knowledge and mental abilities than physical ones. For example, Laboi worked as administrators, business and corporation leaders, philosophers, academicians, and theoreticians. The Laboi had a reputation as eaters of other sentients, which presented another impediment to those members of the species interested in attaining employment off Laboi II. However, by the time of the Galactic Civil War, certain Laboi had ventured into the galactic underworld, where they infringed on the territory traditionally claimed by the Hutts, a species notorious for its criminal proclivities. Like their gastropod rivals, Laboi crime lords typically remained behind the scenes, where they managed and orchestrated their operations but relied on others to carry out their bidding. One such crime lord was the Laboi Qa'till, who operated from the planet Hypotria and eventually gained control of all starship maintenance operations on the world. Qa'till's underlings killed a Rebel Alliance operative on the world sometime during the Galactic Civil War."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Author Troy Denning introduced the Laboi in Galaxy Guide 4: Alien Races, a book published as part of the Star Wars: The Roleplaying Game line from West End Games in 1989. Game rules allow players to portray Laboi characters; these statistics show Laboi to have the potential for great strength, but to suffer lower aptitudes for intelligence-based, piloting, and technological tasks. Chuck Truett revised Denning's entry on the Laboi for the second edition of the book, published in 1994. These revised statistics represent the species in a similar fashion to Denning's, basing their strength on the overall length of the individual. The book notes that Laboi who learn piloting abilities are generally only able to use them in a theoretical sense due to their lack of appendages. Both editions of Galaxy Guide 4 provide two different ranges for the Laboi's length, in one instance reporting the range as two to six meters but in another as two to ten meters."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}