{"url": "Labor_droid", "categories": ["Category:Canon articles", "Category:Droid stubs", "Category:Labor droid models", "Category:Labor droids"], "nodes": [{"tag": "h1", "text": "Labor droid"}, {"tag": "p", "text": "Labor droids, also referred to as worker droids, were a type of droid designed to perform manual tasks, such as unloading cargo from transports or collecting scrap metal into piles."}, {"tag": "p", "text": "A model of labor droid known as the PK-series worker droid was used by the Trade Federation aboard the Saak'ak, a modified Lucrehulk-class LH-3210 cargo freighter, during the Invasion of Naboo, and the Federation used labor droids to collect the still-usable remains of B1 battle droids destroyed during the Battle of Naboo."}, {"tag": "p", "text": "The ASP-series labor droid was a series of labor droid used on worlds across the galaxy, including Coruscant, Florrum, and Tatooine. An ASP droid designated K0-5D was heavily modified for gladiatorial combat and fought in the sparring pits aboard the Weequay pirate ship Marauder, where he usually emerged triumphant due to his steel-shredding servos and integrated flamethrower, earning him the nickname \"Maximo.\""}, {"tag": "p", "text": "A RIC-series general labor droid, a crude model of labor droid also known as a rickshaw droid, designated RIC-920 pulled a rickshaw in Mos Espa, a port city located on the desert world of Tatooine, and another RIC was in use on the planet Jakku. Labor droids equipped with repulsorlifts were utilized in a refinery complex located in an asteroid field known as Pressy's Tumble."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Labor droids first appeared in Star Wars: From the Adventures of Luke Skywalker, a 1976 Star Wars Legends novelization of Star Wars: Episode IV A New Hope ghostwritten by Alan Dean Foster but credited to George Lucas. They became canon when several ASP-series labor droids were digitally inserted into the 1997 Special Edition version of A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}