{"url": "Lady_Luck_(comic)", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 3"], "nodes": [{"tag": "h1", "text": "Lady Luck (comic)"}, {"tag": "p", "text": "\"Lady Luck\" is a 16-page comic featured in Star Wars Tales 3. It was written by Rich Handley and Darko Macan, illustrated by Chris Brunner, lettered by Steve Dutro, colored by Michelle Madsen and Dave Stewart, and edited by Dave Land and Peet Janes. It takes place in 1 ABY."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "In Cloud City, Lando Calrissian wins a game of sabacc against Barpotomous Drebble, gathering over 25,000 credits. He leaves the casino and sees an alien running away from a prone woman, carry her pendant. Lando throws a knife at the control panel for the door the alien is attempting to escape through, stopping him in his tracks. The alien throws the pendant to his Toydarian friend Zlato, but Lando uses his cape to capture Zlato and grab the pendant. The proper authorities come around and arrest the criminals, as the woman thanks Lando for what he's done; Lando notices that she sat next to Drebble during his sabacc game, and when she did, his luck quickly turned around."}, {"tag": "p", "text": "Lobot comes around and tells Lando that the Baron Administrator Dominic Raynor has challenged Lando to a game of sabacc. Lando agrees and goes to where Raynor is waiting, and the Baron happens to have the woman, who he calls Ymile, by his side. The game goes on for quite some time, as Lando, after getting a pure sabacc, bets his ship, the Cobra. Raynor reveals an Idiot's Array, the best hand in the game, winning the Cobra from a much-chagrined Lando. Lobot tells Lando that someone's been using a skifter to rig the game. Dominic denies it, of course, but Lobot reveals that indeed the dealer was using one."}, {"tag": "p", "text": "The dealer claims that Drebble paid him off, and Raynor has Drebble locked up. Lando asks what will become of the game, and Raynor simply says that he shouldn't relinquish the winnings due to someone else cheating. Suddenly, Lobot presents Lando with an anonymous gift of five million credits, from someone who wants to see the game continue. Raynor sees this and demands another game. And so, Lando and Dominic continue playing, when Lando puts up 4 million credits and his starship lot on Nar Shaddaa against Raynor's Baron Administratorship. Dominic laughs it off at first, but Lando tells him that it has three pre-Empire Surronian Farstars, which have become collector's items under the Empire, and Raynor agrees to the bet. Lando reveals he has pure sabacc, causing Baron Raynor to angrily call the guards, but of course they don't listen to him. Lando Calrissian has become the new Baron Administrator of Cloud City."}, {"tag": "p", "text": "Lobot reveals to Lando later that Ymile's pendant was a skifter, and that, coupled with Lobot's connection to the Cloud City computers, allowed Lando to get the right cards at the right time. And the money came from the collective efforts of fifty thousand Ugnaught workers on Bespin, who hated what Raynor had done to the city. Lando walks over to a balcony and dramatically drops Ymile's pendant off the edge."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "This story explains why Lando has a ship called Lady Luck in later years. This also could be the incident referred to by Barpotomous Drebble in the Marvel Star Wars comics when he accuses Lando of cheating him."}, {"tag": "p", "text": "In the third panel of the comic's second page, Mike Mignola's Hellboy makes a cameo as a background character."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "The events taking place in this tale—unlike other stories in the ambiguously canon Star Wars Tales series—have been canonized by being included in sources such as The New Essential Chronology, Star Wars: The Ultimate Visual Guide and the short story Lando Calrissian: Idiot's Array."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}