{"url": "Laeras-Wu", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Force ghosts", "Category:Males", "Category:Voss Mystics"], "nodes": [{"tag": "h1", "text": "Laeras-Wu"}, {"tag": "p", "text": "Laeras-Wu was a male Voss who lived on the planet of the same name well before the Galactic War between the Galactic Republic and the Sith Empire. A Force-sensitive Mystic, Laeras-Wu died sometime before 3640 BBY, and his spirit remained within the Shrine of Healing on Voss alongside fellow Mystics Shanatka-Lo and Hanar-Ye to teach Force rituals to other Mystics and healers. Laeras-Wu, Hanar-Ye, and Shanatka-Lo taught the Sith Lord Fulminiss a healing ritual at the request of the Mystic Valen-Da, and though Fulminiss corrupted the ritual with the dark side of the Force, the three spirits remained confident in the wisdom of their fellow Mystic."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Voss male, Laeras-Wu was born on the planet Voss and spent his whole life on his homeworld, becoming a Mystic who was capable of seeing the future. Laeras-Wu died sometime well before 3640 BBY, but his spirit remained behind, tethered to the Shrine of Healing on Voss along with the spirits of fellow Mystics Shanatka-Lo and Hanar-Ye. The three spirits shared their knowledge with visiting Mystics and healers, including the secrets of a healing ritual that could heal the mind of a patient by drawing on the strength of many. In the year 3640 BBY, during the Galactic War between the Sith Empire and the Galactic Republic, the Mystic Valen-Da visited the Shrine with the Sith Lord Fulminiss."}, {"tag": "p", "text": "Because it was decreed by a Mystic, Laeras-Wu and his companions dutifully taught Fulminiss the healing ritual, though the Sith corrupted the ritual so that it tore open the minds of its victims, and they watched as Fulminiss used the ritual against the healers who had accompanied Valen-Da. Valen-Da and Fulminiss then departed the Shrine, though the spirits witnessed Valen-Da leave a holoprojector in the corner of the chamber with a message for the commando Tala-Reh. When the Jedi Knight known as the Hero of Tython arrived at the Shrine in search of Valen-Da not long afterwards, Laeras-Wu and the others witnessed the deranged healers attack the Jedi and force the Knight to kill them in self-defense, and Laeras-Wu requested that the Hero end the bloodshed as they did not intend the Knight any harm. The three Mystics then explained what Fulminiss had done with the ritual, and faded away after informing the Knight of Valen-Da's message for Tala-Reh."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Force-sensitive Voss male, Laeras-Wu possessed the orange eyes and blue patterned skin that all males of his species did, and his skin was various shades of blue and white. Like all Voss, Laeras-Wu did not possess hair, and he wore Mystic robes that were white and blue in color. As a spirit, Laeras-Wu appeared as a ghostly yellow apparition, and he retained his faith in the wisdom of the Mystics even after his death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Laeras-Wu first appeared in the Jedi Knight class mission \"Bloody Pilgrimage\" on the planet Voss in Star Wars: The Old Republic, a video game released by BioWare in 2011."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}