{"url": "Lagos/Legends", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:New Mandalorians"], "nodes": [{"tag": "h1", "text": "Lagos"}, {"tag": "p", "text": "Lagos was a Human female student who attended at the Royal Academy of Government on Mandalore during the Clone Wars."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lagos was one of the students of the Royal Academy of Government that aided in the exposure of corruption in the Mandalore government. Soon after being instructed by Ahsoka Tano on the dangers of corruption in government, Lagos, along with Korkie, Amis, and Soniee broke into the warehouse where the food rations were being stored. Upon breaking in, it was discovered that a government official had been making deals in order to strengthen the black market on Mandalore. After recording the deal, the students were shortly after discovered, but escaped capture."}, {"tag": "p", "text": "After unwittingly confessing to Ahsoka what they had done, they soon took the recording to Duchess Satine Kryze, in the hopes that she would fix the problem. However, Satine although assuring them she would do something, also warned them not to get involved. This led the cadets to contact Prime Minister Almec with the information. Unknown to them however, Almec was the one responsible for the dealings. Almec had attempted to capture the students, but the intervention of Ahsoka prevented it from happening."}, {"tag": "p", "text": "Attempting to warn Satine about Almec, it was discovered she had already been captured. Ahsoka in an attempt to discover Satine's location, handed the students over as prisoners hoping Almec would reveal where Satine was, with no success. After Satine would not sign a confession of treason under pain of torture, Almec had planned on torturing the students in the hopes Satine would cooperate, but Ahsoka managed to escape and along with the students managed to capture Almec and root out the corruption in the Mandalore government."}, {"tag": "p", "text": "In 20 BBY, the Shadow Collective took over Mandalore under the leadership of Pre Vizsla and Darth Maul. Lagos assisted Korkie Kryze and Bo-Katan and the Nite Owls in rescuing Satine, who had been imprisoned in the Sundari prison. Lagos flew the speeder used to transport the Duchess as they were chased by Mandalorian super commandos. They were able to get Satine out of Sundari so that she could send send a message for help to Obi-Wan Kenobi. Unfortunately, Satine was recaptured, but Lagos and the other students managed to escape the Mandalorian super commandos during the Battle of Sundari."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lagos is portrayed by voice actress Ryan Templeton."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}