{"url": "Lagos", "categories": ["Category:Canon articles", "Category:Females", "Category:Humans", "Category:New Mandalorians"], "nodes": [{"tag": "h1", "text": "Lagos"}, {"tag": "p", "text": "Lagos was a Mandalorian human female cadet of the Royal Academy of Government on Mandalore during the Clone Wars. During her time at the academy, Lagos befriended Korkie Kryze—nephew to Duchess Satine Kryze of the New Mandalorians. With the aid of their friends, Amis and Soniee, they helped the Jedi Padawan Ahsoka Tano during her investigation of a black market conspiracy on the Mandalorian homeworld. In the aftermath of the Death Watch takeover of Mandalore, Lagos was part of a failed attempt to rescue the imprisoned Duchess."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A native of the planet Mandalore, Lagos was born in a time after her homeworld renounced the warrior traditions of its ancient past. During the reign of the New Mandalorian government, which coincided with the galaxy-wide Clone Wars between the Galactic Republic and Confederacy of Independent Systems, Lagos attended the Royal Academy of Government where Mandalorian cadets enrolled before pursing a political career. While at the academy, she maintained friendships with several classmates, including Amis, Soniee, and Korkie Kryze—nephew of the New Mandalorian leader Duchess Satine Kryze."}, {"tag": "p", "text": "During the Clone Wars, Lagos and her friends became acquainted with Jedi Padawan Ahsoka Tano, who arrived in Sundari under pretense of visiting the academy as a guest lecturer while investigating allegations of corruption in the Mandalorian capital city. Having grown concerned about the food shortages on Mandalore, Lagos was persuaded by her friends to participate in their own investigation into the matter. With Tano's aid, the cadets were able to expose Prime Minister Almec's illegal activities, including the establishment of a black market trade network on Mandalore."}, {"tag": "p", "text": "In 19 BBY, the New Mandalorian government was overthrown and replaced by Death Watch, consequently leading to the imprisonment of Duchess Satine. As a result, Lagos joined her friends in a plot to rescue the deposed head of state from Maul's Mandalorian super commandos. Despite their efforts, however, the group failed to escape with the Duchess, who was subsequently executed by Maul."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a cadet of the Royal Academy of Government, Lagos was among the best and brightest of Mandalorian youth and therefore groomed by the prestigious institution for a future in politics. Due to her cautious nature, Lagos was overwhelmed at times by her adventure-seeking classmates. Depending on the circumstances, however, she was courageous enough to support her friends in hostile situations."}, {"tag": "p", "text": "Lagos was a human female. During her adolescence, she had blond hair, blue eyes, and light skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "When saving the Duchess, she was armed with a WESTAR-35 blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lagos first appeared in \"The Academy,\" the sixth episode in Season Three of the Star Wars: The Clone Wars television series. She was portrayed by voice actress Ryan Templeton. Lagos later appeared in the fifth season episode \"The Lawless,\" but had no lines in the episode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}