{"url": "Lak_Sivrak/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Alliance Army personnel", "Category:Alliance Fleet officers", "Category:Force ghosts", "Category:Males", "Category:Pilots", "Category:Shistavanens", "Category:Space explorers", "Category:Task Force on Alliance Security personnel"], "nodes": [{"tag": "h1", "text": "Lak Sivrak"}, {"tag": "p", "text": "Lak Sivrak, sometimes known only as Sivrak, was a Shistavanen male scout who sometimes worked for the Uvena System Constabulary. Sivrak obtained fame working for the Galactic Empire, unaware of the tyranny of his employers. Sivrak then found a hidden settlement of members of the Alliance to Restore the Republic and, lacking political convictions, decided to help them. He discovered their status as fugitives and swore not to report them. However, the Empire found the settlement nonetheless and discovered that Sivrak had not reported it. Sivrak became a fugitive of the Empire, and was forced to hide from the stormtroopers in Mos Eisley."}, {"tag": "p", "text": "Sivrak visited the local Chalmun's Spaceport Cantina and there he met Dice Ibegon, a Force-sensitive Florn Lamproid that convinced him to join the Alliance with her. Ibegon and Sivrak became lovers and fought the Empire together. While the Shistavanen had initially followed her only to court her, Sivrak became a proud Rebel warrior, fierce opponent of the Empire and member of Alliance Intelligence. Ibegon died during the Battle of Hoth, and a heartbroken Sivrak kept on fighting, honoring her last wish."}, {"tag": "p", "text": "Sivrak was a starfighter pilot during the Battle of Endor. His starship was damaged beyond repair and his death could be imminent. It was then that Dice Ibegon contacted him again, using the Force to give him a last chance: He could rewrite history, turning his back to the Alliance when he had first met Ibegon in the cantina, knowing that he would have to suffer and die otherwise. Sivrak chose to stay with his beloved, and joined her as a Force ghost after his heroic death at Endor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The scout"}, {"tag": "p", "text": "Lak Sivrak was a male of the Shistavanen sentient species, born in one of the planets in the Shistavanen-controlled Uvena system. He had a brother, Tagg Sivrak. At some point, Lak Sivrak heard about the sentient species known as Florn Lamproids, discovering that they were the only intelligent beings in a planet full of threats."}, {"tag": "p", "text": "Lak Sivrak became an expert scout and tracker, like many other Shistavanens from Uvena. Sivrak was employed by the Galactic Empire to chart several dangerous territories in the galaxy. Sivrak proved to be an enterprising, profitable professional and one of the best scouts in the Empire. This Imperial world scout obtained notoriety among his peers."}, {"tag": "p", "text": "At some time before 8 BBY, the Uvena System Constabulary approached Sivrak and asked for his help in the search for the missing Shistavanen Alpha Premier Korta Sarc. Sivrak worked in this task along with another Shistavanen scout, Yurdak Fav. Sivrak and Fav found a murdered Sac at the Jenet embassy, and from that point on they were relieved of this task. Sivrak then spent a time with Fav and other scouts and concluded that Fav was essentially a good being. After this, Sivrak returned to his home warren."}, {"tag": "p", "text": "Sivrak spent a lot of time scouting the galaxy, having little to no contact with the civilization. He was unaware of the tyranny of his employers, or of the fact that an organized anti-Imperial Alliance to Restore the Republic even existed. Sivrak believed that all politicians were bureaucrats of similar morality, and he was content simply by not dealing directly with them."}, {"tag": "p", "text": "While he was probing the space, he accidentally discovered a secret settlement on a rocky moon. It was a safe world affiliated with the Alliance, populated by families of Imperial fugitives and refugees from planets that the Empire had razed, including Dalron Five and Alderaan. Sivrak believed they were survivors of a crash or mere settlers, and he offered to help them preparing for the winter. The Rebels were suspicious, but Sivrak convinced them of his good intentions and helped them. During dinner and bonfire meetings, the Rebels told Sivrak about the tyranny and atrocities of the Empire, and about the pride the Rebels felt. Eventually, Sivrak decided to leave the colony, and swore his new friends that he would not betray their secret home. True to his word, Sivrak traveled to a different sector and quickly wrote down a report for the Empire, explictly saying that the rocky moon was lifeless."}, {"tag": "p", "text": "The Empire nonetheless hired a second scout to charter places that Sivrak might have missed. This person found the Rebel colony and reported it to the Imperial Navy. The colony was evacuated, thanks to a warning by Rebel spies, but the Empire captured several prisoners and questioned them with thorough methods One tortured Rebel revealed that Sivrak had visited the colony several months before this event."}, {"tag": "p", "text": "The Empire began looking for Sivrak, under charges of hiding the presence of a Rebel safe world in a system he had discovered. They started by freezing Sivrak's accounts, and then they sent stormtroopers after Sivrak. Sivrak's first notification of the Empire disliking him was when he had to blast these stormtroopers. However, he was still unaware of the reasons why the Empire had betrayed him."}, {"tag": "h3", "text": "The fugitive"}, {"tag": "p", "text": "Suddenly deciding that he was aghast at the horrors the Imperial soldiers performed, Sivrak deserted. Dropping his first name to change his identity, he intended to hide at a different point of the galaxy. The Imperial forces chased him, prompting him to reach the planet Tatooine, and he eventually escaped to the local spaceport, Mos Eisley, soon before the Battle of Yavin. Low on money, Sivrak considered helping the Alliance in exchange for money, but he did not know how he could contact them."}, {"tag": "p", "text": "Sivrak noticed that the Empire had a presence in Mos Eisley, particularly in the form of stormtroopers. He also discovered that many locals were information brokers who would sell him to the Empire should they discover his identity. As such, the newcomer Sivrak chose to speak with very few people, to the chagrin of these information brokers. This led many to conjecture about the mysterious individual known only as Sivrak, and nicknamed \"the wolfman\".\nThe locals correctly assumed that Sivrak came from the Uvena system, and the notched blaster rifle slung over his back suggested them that he was a scout. However, they erroneously believed that Sivrak was only trying to start his career when the Empire began to exact punishment for unauthorized exploration and restrictions scouting of the Outer Rim Territories, causing the wolfman to be unemployed."}, {"tag": "p", "text": "Lak Sivrak, with boots heavy due to dust and sweating due to the heat of the twin suns, decided to enter a local business where he had never been before, Chalmun's Spaceport Cantina. He wiped his paw agains this mouth while his eyes adjusted to the change of lighting. Sivrak sat down to drink alone, but he expected to make some business."}, {"tag": "p", "text": "In fact, the Gotal official Feltipern Trevagg was also at the cantina, looking for an amateur assassin to kill his assistant Balu. Trevagg believed that Sivrak was fierce and big enough to do the job, unlike other candidates such as weakling Greedo or excesively dangerous Dannik Jerriko. However, Trevagg did not approach Sivrak at this point because the Gotal was busy courting M'iiyoom Onith."}, {"tag": "p", "text": "A running Jawa scuttled past Sivrak. The Shistavanen then looked behind the bar and saw the snake-like female Dice Ibegon, a mysterious Florn Lamproid. Sivrak perceived Ibegon's sex through her pheromones, she then turned to him and seductively offered to buy him a drink, using the Shistavanen. Feeling a rise in temperature at meeting her, Sivrak partially undressed and sat next to her. Ibegon shared a drop of her bantha-blood with Sivrak, putting it in his muzzle with her tail. Sivrak used all of his social skills to impress her with romantic words in an attempt to seduce her. When she expressed sympathies for the Alliance, Sivrak expressed support for this view just to be with her. Soon, they were embracing, but they interrupted the act when perceiving a nearby fight between the Aqualish thug Ponda Baba and a lightsaber-welding old man. Sivrak thought that local Imperial authorities would soon be at the cantina to investigate and, not wanting to be spotted by those, decided to leave. Ibegon went with him."}, {"tag": "p", "text": "Meanwhile, Trevagg was considering to hire Greedo as his minion, but Greedo was killed by Han Solo only minutes after Sivrak's leaving. Seeing that, Trevagg looked for Sivrak, and was disappointed when he couldn't find the Shistavanen."}, {"tag": "p", "text": "Ibegon and Sivrak talked about the Alliance that night and many times during the following nights. Sivrak's desire to help the Alliance became stronger. Ibegon quickly felt in passionate love with Sivrak, noticing that his ideas were like hers."}, {"tag": "p", "text": "Ibegon and Sivrak returned to Chalmun's cantina later, becoming usual customers. The barman, Wuher, was used to serve Sivrak a mug of crushed Gilden, with its organ tendrils still writhing to attest their freshness. Sivrak met the Abyssin Myo several times during his time in Mos Eisley, more commonly at the cantina. The Shistavanen decided that Myo was quite a friendly being."}, {"tag": "p", "text": "After the Battle of Yavin, Rebel historian Voren Na'al made a research on Sivrak and, after a careful analysis through the Alliance data banks, discovered Sivrak's past help to the Alliance. Na'al considered Sivrak to be a good potential recruit who was only scared because of his past relation to the Empire—even if he was short of money. Na'al suggested sending recruiters that Sivrak could bind with, including other scouts and kids akin to those living on the rocky moon colony."}, {"tag": "h3", "text": "The Rebel"}, {"tag": "p", "text": "Lak Sivrak helped several agents of the Alliance while on Mos Eisley without joining the Alliance himself. Eventually, around 1 ABY, a group of Rebels recruited him and Ibegon for the Alliance armed forces."}, {"tag": "p", "text": "During his first few months in the Alliance, Sivrak provided important information on Imperial scouting procedures, served in several battles and became a lieutenant. He also joined the Task Force on Alliance Security, an Alliance Intelligence group that compiled information on important threats for the Alliance. In this task, he provided addenda to the report on Yurdak Fav, who was disrupting Alliance activities, and on Myo, who had joined the Alliance-opposing Galactic Outdoor Survival School. Sivrak believed that both of them were not really evil and that they should be captured, questioned, and maybe even recruited."}, {"tag": "p", "text": "While he had initially been reluctant to join the Alliance, in time he became proud of his service as a warrior, and made Ibegon his female companion. He talked with other Rebels and became familiar with stories about Imperial biogenetists taking Rebel corpses to clone parts and keep them alive for research or entertainment. The Alliance also gave him a medkit adapted to the biology of his species."}, {"tag": "p", "text": "The Empire was still looking for Sivrak, knowing that Sivrak had become a Rebel scout. A squad of stormtroopers tried to capture a different Shistavanen, Riv Shiel, believing him to be Sivrak. Shiel had to kill the stormtroopers, earning his own death mark."}, {"tag": "p", "text": "Sivrak, by then considered a Rebel grunt, and Ibegon had been assigned to Echo Base, on the frozen planet Hoth, by 2 ABY. They fought in the Battle of Hoth, where Sivrak was a pilot. During the attack, Sivrak felt hope when the Rebel 1.4 FD P-Tower antivehicle artillery blasted an All Terrain Armored Transport, and then hopelessness when the AT-AT armor absorbed the shot."}, {"tag": "p", "text": "Eventually leaving his vehicle, Sivrak ran through the trenches during the battle, tracking Ibegon through scent. He found her bleeding, fatally wounded, on the snow. Ignoring direct orders, Sivrak fell next to her, wanting to die with her. With her last words, Ibegon asked Sivrak to keep on fighting Empire and to believe in the power of the Force. Sivrak agreed to do it because she had asked him, but Ibegon told him that it was his only option. She blessed Sivrak, eager to stay with him forever, and then died. A Human Rebel prompted Sivrak to the evacuation point, but the grieving Sivrak snarled at him and, once the Human had gone, Sivrak gave Ibegon a funeral pyre with his blaster to prevent Imperial scientists from defiling her corpse. He also said her the words \"May the Force be with you\"."}, {"tag": "h3", "text": "The sacrifice"}, {"tag": "p", "text": "By 4 ABY, Lak Sivrak was an X-Wing pilot under Admiral Ackbar of the Alliance. He joined the Rebel fleet for an attack against the second Death Star during the Battle of Endor. He, like many other Rebels, was briefed about the Bothan spies having confirmed that the Death Star was unfinished, but during the battle this information proved to be false. Sivrak believed that the battle had been lost because of this, and he started dodging enemy starships before even evasive maneuvers were ordered. He noticed the Imperial fleet approaching sector 47, but the Imperial capital ships were static, as if they assumed Imperial starfighters were enough to deal with the Rebel attackers."}, {"tag": "p", "text": "The Rebel command ordered the starfighters to protect the fleet even if it cost them their lives. Sivrak believed that his life meant little without Ibegon, and as such he did not fear his own death. He sent his X-Wing in a collision course with three enemy TIE fighters, which prevented him from helping a medical frigate under attack. The TIEs confronted Sivrak, who roared against them crying the name of his beloved. Sivrak destroyed one of the TIEs, but his X-Wing was fatally damaged by them, and then he had a vision: Sivrak felt he was entering Chalmun's cantina for the very first time, reliving the moment where he first met Ibegon; however, the Shistavanen did had flashforwards of future events. He tried to question Ibegon about that, accusing her of using the Force while at the same time denying its existence."}, {"tag": "p", "text": "Sivrak's senses returned to the Battle of Endor, but the confused Shistavanen first tried to look for Ibegon in his canopy. Assuming that he had had a hallucination, Sivrak felt his X-Wing falling to the Forest Moon of Endor, even after all of his efforts. Through his communicator, he discovered that General Han Solo's commando team had failed to destroy the Imperial bunker with the force-field generator protecting the Death Star. Sivrak considered his two alternatives: He could either direct the ship to a crash-land in the forests, where he could survive and became again a hunter and a tracker, no longer chased by the Empire, or alternatively ram the Imperial bunker in a suicide attack that could succeed where Solo had failed, should he could avoid the land defenses. In his briefing, Sivrak had been told that such an idea had a one-in-one-million probabilities of success."}, {"tag": "p", "text": "Sivrak's meditaitons were interrupted by the two surviving TIE fighters, that attacked him. The Shistavanen veered his ship and dropped all the available mines and decoys, then turned to face any surviving enemy. He confirmed that one of the TIEs had been destroyed, then had vivid memories of Ibegon's death on Hoth, and then saw the last TIE fighter blindedly shooting at him. This surprised Sivrak, but he could avoid the attack and bring it down. Then, he felt the local atmosphere bringing the vehicle to the point of no return."}, {"tag": "p", "text": "During these last seconds, Sivrak had a vision of a desert Chalmun's cantina where Ibegon reported Jabba the Hutt's death. The Shistavanen noticed that Ibegon had died before Jabba did, and this changed the scenario to their first meeting once again. Sivrak understood that, using the power of the Force, Ibegon was giving her lover an alternative, a way out: Sivrak could leave the cantina alone, instead of going with Ibegon, and then he would be spared from a life of sacrifice for the Alliance, and from the loss of a lover. This was a choice that Ibegon made because she loved Sivrak. Sivrak, who also loved Ibegon, chose to embrace the Florn Lamproid once again, knowing how it would end."}, {"tag": "p", "text": "Deciding that sometimes choice is an illusion, Sivrak sent his ship to ram the shield generator. Only too late he discovered that General Solo had already destroyed it, but he could no longer change course. Sivrak's starship collided on the moon's surface."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The survivors of the Battle of Endor held a victory party along with the local species, the Ewoks. During it, a ghost-like, semi-transparent, bright Force spirit of Lak Sivrak met Dice Ibegon's. They joined, paw in tail, and walked to meet three other friends that were waiting for them. Ibegon and Sivrak were together again, their spirits shining in the Force."}, {"tag": "p", "text": "Lak Sivrak was listed as dead during the Battle of Endor, having crashed on the moon after destroying several TIE fighters."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lak Sivrak was a furry, 1.82-meter Shistavanen. Like others of his species, he had sensitive but powerful fangs and a rough-rasped tonge hidden in a canine muzzle. His nostrils flared when detecting a particular scent, specially fresh blood or smoke, and he had a full-throated voice that he could use to shout a battle cry or to snarl. His bright, red eyes perceived a greater wavelenght than a Human's—but less than a Lamproid's— and needed time to adjust to a change of lighting. He also had upright ears that could recognize the voice of several species even if filtered through an intercom, or the music of the Modal Nodes. His hands ended in manipulative paws and, while he sometimes used boots, his feet were strong enough to not require those. Sivrak was known to howl at challenges and to face death—specially if he could perceive it as a hunter's death—with primal rage that were common to Shistavanen Wolfpeople."}, {"tag": "p", "text": "Behavior-wise, Sivrak was a typical Shistavanen male: Not aggressive, but ferocious, and clearly ferocious-looking by other species. Although his trust was hard to obtain, Sivrak was known to be very loyal. As a Rebel soldier, he ignored direct orders to stay with his dying female companion, and he was not beyond snarling at a fellow to scare him away."}, {"tag": "p", "text": "Ambicious and hard-working, Sivrak was an excellent scout, tracker and warrior, with important skills that he honed during his time in the Alliance. He had specialized knowledge about planetary systems, alien species and survival, and was a qualified navigator and pilot. His weapons of choice were the blaster pistol, the blaster rifle and the vibroblade, and he commonly carried survival gear with him. During his time as an Imperial scout, Sivrak used the idiom \"moving forward\" when he felt the need to change location."}, {"tag": "p", "text": "Sivrak was not a firm believer in the power of the Force, even after he had promised Ibegon to believe. When he first had a vision during the Battle of Endor, he dismissed it as a hallucination. However, before the end of the Battle, he had became a believer."}, {"tag": "h3", "text": "Relationships"}, {"tag": "h4", "text": "Dice Ibegon"}, {"tag": "p", "text": "Lak Sivrak's relationship with Dice Ibegon began as a hormonal release: He was first impressed by the female pheromones she exhuded, and then admired the twists of her muscular coils. Being familiar with Florn Lamproids by that point, Sivrak knew that Ibegon's snake-like body was very strong, able to constrict the skull of a Bantha until it crushed. Sivrak also liked Ibegon's light sensor and her mouth full of needle-like teeth."}, {"tag": "p", "text": "This eventually became true love. After her death, Sivrak was unable to forget her. His life had no longer a meaning and he became a suicide fighter, shouting Ibegon's name as his battle cry."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Sivrak first appeared as an unnamed extra in the movie Star Wars: Episode IV A New Hope. Makeup artist Rick Baker decided to use off-the-shelf masks to perform some reshoots of the booths in the cantina scenes. He used two different furry wolfman masks. The first one to appear onscreen would be identified as \"Wolfman\" during the shooting, and later as Arleil Schous, a Defel. The other mask was called \"Hyena-Man\" during the production. In 1989, the Expanded Universe gave \"Hyena-Man\" a more detailed identity as Lak Sivrak, the Shistavanen Wolfman."}, {"tag": "p", "text": "Lak Sivrak, the Shistavanen Wolfman, was not mentioned in the novelization of A New Hope, beyond a widely generic mention to \"creatures with fur\" in the cantina."}, {"tag": "p", "text": "In 1997, Sivrak was digitally replaced for the Special Edition of A New Hope. A detailed puppet later known as Ketwol would be seen in his place, leaving Lak's canonicity disputed. In 1998, the first action figure of Sivrak was released, for the fourth yearly update of the series The Power of the Force."}, {"tag": "p", "text": "Sivrak appears in the non-canon comic The Emperor's Court. In this comic, Sivrak is a drooling person with dark gray fur, instead of the brown fur he had in the movie; and Dice Ibegon whispers for him. He is one of the witnesses to testify on the murder of Greedo, but Han Solo objects saying that \"that wolf-guy wasn't even there.\" This comic deals with the changes made for the Special Edition of A New Hope, including the scene of Greedo's death and the disappearance of Sivrak—but even then, pre-Special Edition stories in Tales from the Mos Eisley Cantina specified that Sivrak left the cantina before Greedo's death."}, {"tag": "p", "text": "The Essential Guide to Characters says that Dice Ibegon was a Rebel agent when she first met Sivrak, and then says that Sivrak and Ibegon joined the Alliance together."}, {"tag": "p", "text": "The role-playing guide The Movie Trilogy Sourcebook (1993) includes a text on Sivrak very similar, but not exact, to Sivrak's description in Galaxy Guide 1: A New Hope (1989). Both books provide role-playing stats for Sivrak, representing him at different moments of his life: The stats in The Movie Trilogy Sourcebook are higher, because Sivrak's skills have improved with his age. However, in an uncommon situation, Sivrak had lost his knowledge of Medicine at some point after joining the Alliance."}, {"tag": "p", "text": "The book The Star Wars Rules Companion shows an image of Lak Sivrak without giving any new information. Roleplaying guides Ultimate Alien Anthology and The Unknown Regions list Sivrak's name as one of the example names for Shistavanens."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}