{"url": "Lake_of_Apparitions", "categories": ["Category:Legends articles", "Category:Beyond shadows", "Category:Lakes"], "nodes": [{"tag": "h1", "text": "Lake of Apparitions"}, {"tag": "p", "text": "The Lake of Apparitions was a lake that existed in a realm of the Force known as beyond shadows. Any being who walked across the Lake had to step carefully, or they would sink into the Depths of Eternity, from which they couldn't be saved. While walking across it the spirits of deceased Force-sensitives could be seen on the surface of the water, known as the Mirror of Remembrance. Over the Lake hung heavy mists, which were known as the Mists of Forgetfulness."}, {"tag": "p", "text": "While on their journey to discover what had caused Jacen Solo to turn to the dark side of the Force as Darth Caedus, Luke Skywalker and his son Ben traveled to the Maw, where they found Sinkhole Station, a small space station resembling Centerpoint Station that was home to the Mind Walkers—a group of Force-sensitives who could separate their minds from their physical beings in order to go beyond shadows. When Luke and Ben went beyond shadows with the Mind Walkers, they traveled to the Lake of Apparitions, where they talked to the spirits of Anakin Solo, Mara Jade Skywalker, and a once-more peaceful Jacen Solo."}, {"tag": "p", "text": "Later, after arriving on Abeloth's world on a mission with the Lost Tribe of Sith to eliminate Abeloth, the Skywalkers realized that every location they had seen beyond shadows corresponded to an actual location on the planet. On Abeloth's homeworld, the Skywalkers Mind Walked with Sith High Lord Sarasu Taalon, Sith Saber Gavar Khai, and Captain Leeha Faal, and again they entered the Lake of Apparitions. There, the Jedi and Sith both encountered many of their deceased friends, and Skywalker again saw and spoke briefly with his wife. However, Faal also met some of her deceased enemies, who dragged her into the Depths of Eternity, killing her."}, {"tag": "p", "text": "Skywalker later returned to duel Abeloth again during the Liberation of Coruscant, and received the help of Darth Krayt, though it was unknown to him at the time, and his deceased wife, where they were able to, albeit temporarily, defeat her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}