{"url": "Lama_Su/Legends", "categories": ["Category:Legends articles", "Category:Galactic Republic bureaucrats", "Category:Kaminoans", "Category:Males", "Category:Planetary leaders", "Category:Sith minions"], "nodes": [{"tag": "h1", "text": "Lama Su"}, {"tag": "p", "text": "Lama Su was a male Kaminoan who hailed from a race of expert cloners on the planet Kamino. As Prime Minister, he personally oversaw the creation of the clone troopers—the new army of the Galactic Republic—from Tipoca City, the capital of his homeworld. Although Kamino's contribution to the Republic Military gained Lama Su's people a seat in the Galactic Senate during the Clone Wars, their actions were also partially responsible for the systematic extermination of the Jedi Order and the rise of Darth Sidious's Galactic Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the year 32 BBY, Lama Su was the Prime Minister of Kamino, and thus he also served as the leader of the Kaminoan Ruling Council of Colony Governors. Around the same time, Chancellor Palpatine—the public persona of the Sith Lord Darth Sidious—manipulated Jedi Master Sifo-Dyas into secretly placing an order for the creation of a clone army with the cloners on Kamino. Due to the Kaminoans' preference for isolation and Lama Su's own limited understanding of the greater galaxy, the Prime Minister never considered the consequences that a new pan-galactic military force would have on the future. Instead, Lama Su saw the Jedi's proposal as a business opportunity with advantages for Kamino's economy."}, {"tag": "p", "text": "Over the next decade, Lama Su and his scientists developed the first generation of clone troopers, all based on the genetic code of the bounty hunter Jango Fett. Aside from his role as a template, Fett also assisted Lama Su as an advisor, and the two closely monitored the training of the clones. During the development phase of the clone army, Lama Su ordered the cloners to heavily modify the clone subjects in accordance with his instructions to engineer soldiers programmed with absolute loyalty. The Prime Minister saw to it that the clones were made with greater docility and a diminished sense of individuality. Through such modifications, Lama Su was confident that the army as a whole would be completely subservient; capable of obeying any order without question."}, {"tag": "p", "text": "When the Jedi Knight Obi-Wan Kenobi visited Kamino in 22 BBY, Lama Su and Taun We assumed that he came to inspect the progress of the clone troopers. The Prime Minister assured Kenobi that the project proceeded on schedule, and that the first two-hundred thousand combat-ready units would be joined by a million more clones in the imminent future. In his eagerness to impress his Jedi guest with a tour of Kamino's creations, Lama Su overlooked Kenobi's apparent ignorance of the cloning project. Shortly after Kenobi's reported his findings to the Jedi High Council, Supreme Chancellor Palpatine organized Lama Su's clone troopers into the Grand Army of the Republic and placed them under the command of Jedi officers. With the formation of the Confederacy of Independent Systems, the Republic deployed its clone forces against the Separatist Droid Army, thus initiating the galaxy-wide Clone Wars."}, {"tag": "p", "text": "Around the first year of the war, Su was present when Kenobi returned to Kamino to stop the Zeltron bounty hunter, Vianna D'Pow, from stealing Fett's cloning DNA template. During the first Separatist invasion of Kamino, Lama Su coordinated the planet's defense with the Jedi's support. After enemy battle droids breached Tipoca City's outer security perimeter, Lama Su activated a batch of Alpha-class Advanced Recon Commandos—also known as ARC troopers—to protect the facility's cloning assets."}, {"tag": "p", "text": "Jango Fett's death at the beginning of the Clone Wars left the Kaminoans with a limited supply of genetic samples. They were forced to adopt alternative strategies in order to continue the production of clone troopers, such as breeding new clones from the DNA of existing clones. Lama Su was less than impressed by some of the younger clone generations, and so he recommended to Jedi Master Shaak Ti that a new template would have to be selected if the Jedi hoped to maintain an army of efficient troopers."}, {"tag": "p", "text": "Su later went with Shaak Ti to welcome Obi-Wan Kenobi, Anakin Skywalker, and the 501st Legion to Tipoca City. The prime minister was surprised to learn that the Confederacy of Independent Systems intended to attack Kamino, despite the Republic Military blockade that surrounded his homeworld. In preparation for the coming battle, Su positioned himself within Tipoca City's central command center."}, {"tag": "p", "text": "Near the end of the Clone Wars, Su was approached by Nala Se, who informed him that Protocol 66 had activated prematurely in the clone trooper CT-5385. Su contacted Darth Tyranus to share this news with him and was ordered to terminate the defective clone so an autopsy could be performed on his body. He was also instructed to remove the clone's bio-chip and send it to Tyranus before the Jedi Order could discover the true nature of the chip."}, {"tag": "p", "text": "In 19 BBY, Chancellor Palpatine commissioned the creation of cloning centers on Centax-2, one of the moons of Coruscant. The new facilities differed from their Kaminoan counterparts in two fundamental ways: they were staffed by Arkanian Microtechnologies's scientists, and they utilized Spaarti cloning cylinders that could engineer battle-ready clone soldiers in one year instead of a decade. By that time, Lama Su no longer trusted the intentions of Chancellor Palpatine, and so he discreetly prevented some of the clone units from being absorbed into the Grand Army."}, {"tag": "p", "text": "In the aftermath of the Clone Wars, most of the Jedi were betrayed and murdered by their clone troopers after Chancellor Palpatine—the public guise of the Sith Lord Darth Sidious—declared all Jedi as enemies of the Republic. Lama Su's clone army was ultimately a pivotal factor not only in the Sith plot for revenge against the Jedi Order, but also in Palpatine's rise to power as emperor of the first Galactic Empire."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lama Su was fiercely proud of his world's achievements in the science of cloning, the major exporting good that was vital to Kamino's economy. His people's reputation as expert cloners was important to him, and thus it was Lama Su's imperative to ensure that Kamino produced clones of the highest quality; genetic failures were completely unacceptable to him. With the exception of several unstable units, Lama Su regarded the clone troopers as some of Kamino's finest products, as well as a testament to the ingenuity of those who served under his employ. The pride he felt in the Kaminoans' reputation was magnified by the combat training and education programs that they utilized to create efficient soldiers for the Galactic Republic."}, {"tag": "p", "text": "Although Lama Su had interactions with offworlders through his capacity as Prime Minister, he hardly possessed a worldly nature, and thus he only had a limited understanding of galactic affairs or Human behavior. As such, he was unconcerned with the purpose of the Republic's clone army. Their creation was a business deal to him, and so he treated the matter as a merchant-client relationship; Kamino was hired to build a military for the Republic, and Lama Su intended to honor that transaction in exchange for a considerable amount of credits."}, {"tag": "p", "text": "The clones themselves were of great importance to Lama Su, although not in the same sense as the Jedi who developed an affinity for them. He was pleased that the clone troopers existed because of the skills and accomplishments of his people and while he did regard them as a magnificent accomplishment on Kamino's part, Lama Su ultimately saw the clones as valuable export products with highly profitable military applications. Some Jedi officers developed close bonds with their clone soldiers, but Lama Su neither shared or cared for the Jedi's sense of compassion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lama Su was a computer-generated character voiced by Anthony Phelan in Attack of the Clones. The character's name is pronounced similar to Lamassu, an Assyrian protective deity. He was voiced by Bob Bergen in his appearance in the CGI Clone Wars TV series."}, {"tag": "p", "text": "Originally, Lama Su was indended to be a female character, but was changed to male at the last second."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}