{"url": "Lambarian_Crab", "categories": ["Category:Legends articles", "Category:Smuggler starships", "Category:YT-2400 light freighters"], "nodes": [{"tag": "h1", "text": "Lambarian Crab"}, {"tag": "p", "text": "The Lambarian Crab was a modified Corellian Engineering Corporation YT-2400 light freighter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The ship, by then using a different name, was initially owned by a honest trader, Matas Havel, who traveled from the Colonies to the Outer Rim Territories. He invested profits in increasing the cargo capacity and the shields to deal with attacking pirates."}, {"tag": "p", "text": "Circa 0 ABY, Havel retired and sold the ship to Finious Crab, who christened it Lambarian Crab. Wanting to smuggle in the Corellian system, Crab removed security and backup systems to make space for  speed- and stealth-increasing customizations. He also added three secret compartments, one in the cover of a hallway, another in a cargo pod and a third one in the cockpit deck escape pod socket."}, {"tag": "p", "text": "Crab then made a name for himself in the Corellian system, dodging blockades and customs and enraging both the Galactic Empire and the Corellian Security Forces. However, during a run to Eriadu, the life support system failed to Crab's negligence in keeping up with maintenance; the pilot was frozen in hyperspace, although the ship reached Eriadu."}, {"tag": "p", "text": "The Crab was then salvaged and sold to Wroonian gunrunners Fillio Androu and Linx Mallicker. They discovered and made good use of two of Crab's secret compartments, but the last one in the cockpit deck escape pod socket remained not found."}, {"tag": "p", "text": "The Wroonians then used the ship to deal with illegal weapons through the Rimma Trade Route, traveling from the Core Worlds to the Outer Rim Territories. They avoided Corellia because the ship was wanted there. Their customers were Imperial officers and cells of the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Stock Ships suggests that the undetected smuggling compartment, locked for several years, could hold some valuable small object, including Jedi relics, maps to the Katana fleet and evidence to blackmail a person who, at that point, could have become a Grand Moff."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}