{"url": "Lamaredd/Legends", "categories": ["Category:Legends articles", "Category:Articles with non-canon elements", "Category:Lamaredd locations", "Category:Waterworlds", "Category:Wild Space planets"], "nodes": [{"tag": "h1", "text": "Lamaredd"}, {"tag": "p", "text": "Lamaredd, also known as Great Menahua, was a planet in the Lamaro system of the Outer Rim Territories. With water covering 85% of its surface, Lamaredd was rich in minerals and seafood, as well as having its own native sentient species, the primitive Menahuun."}, {"tag": "p", "text": "In 500 BBY, Hugo Bartyn, an agent of the Outer Rim Oreworks Company, claimed the planet to exploit it for its industrial use. ORO then named him the local Administrator of Lamaredd. After getting rid of the Menahuun, Bartyn made good use of this time to create a fishing community, Bartyn's Landing, populated by indentured servants of amphibious species who fished for him. Eventually, these people were released from their servitude, but most of them remained on the planet. Soon after the battle of Naboo, the believed-dead Menahuun, who had turned into an aggressive civilization, reappeared."}, {"tag": "p", "text": "Later, the Galactic Empire sent a number of troops to this planet. Lamaredd was left untouched during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lamaredd was the third planet in the remote, little known Lamaro system, also known as the LM0228 system. Like the other planets in the system, Lamarebb, Lamarecc, and Lamaremm, Lamaredd probably owed its etymology to a notation in an old star map. Lamaredd was near a branch of the Corellian Run that stopped being heavily used centuries before the battle of Yavin, as well as several other less-known hyperspace routes. Due to the loopholes of crafty entrepreneur Hugo Bartyn, the whole system disappeared from the star-charts, adding to his privacy."}, {"tag": "p", "text": "Lamaredd was a tropical planet, full of life and lacking natural ice caps. 85% of the surface was covered in water, which in turn was plentiful of flora and fauna—including the fearsome aquatic predator called Gulletbeast and many others that, even five centuries after the colonization of Lamaredd, had not been discovered by aliens."}, {"tag": "p", "text": "The greatest mass of land was only known as the northern continent, which served as the natural habitat for the native species, the primitive lemuroid Menahuun, who lived in a peaceful, nomadic society of hunters-gatherers for thousands of years, calling their planet \"Great Menahua\". The second-largest continent was Little Mon Cal, 10,000 kilometers long in its greatest dimension. Sparsely populated islands punctuated the oceans."}, {"tag": "p", "text": "Every fourteen years, Lamarebb and Lamarecc approached each other, almost touching. This caused a natural phenomenon of lights in the skies of the third planet of the system, Lamaredd, and also scrambled communications."}, {"tag": "p", "text": "The Lamaro system was surrounded by an asteroid cloud, the Reef, that could cause hyperspace anomalies to starships; those suffering that fate commonly were forced to land on Lamaredd, as the planet hosted the only spaceport in the system."}, {"tag": "p", "text": "Energy weapons, including blasters, were seldom used or even owned in Lamaredd, because it was too a remote location to obtain spare magazines; slugthrowers and knives were the common alternative. However, a number of the citizens were professional high-sea fishermen who could not resort easily to powder, so they did use energy weapons. Common vehicles included fishing trawlers, gondola skimmersubs, and swoops; in rare situations, air vehicles were used."}, {"tag": "p", "text": "Lamaredd was a planet with a strong presence of the Force. A number of locals, including charlatans, healers, and shamans, used the Force, believing it to be \"magic powers\" (the native species called the energy Pa'ela, literally meaning \"holy blood\"). Nonetheless, the Jedi Order had no permanent presence on the planet and the superstitious locals mistrusted the Jedi. Two of the strongest presences of the planet, the Outer Rim Oreworks Company and Bartyn Gourmet Delicacies, disliked the official attention of any external security agent, including the Jedi, who could discover their irregularities."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Initial mappings of the Lamaro system by members of the Galactic Republic failed to reveal the great amount of useful minerals on Lamaredd. In the fifth century BBY, a team working for the exploratory branch of the Outer Rim Oreworks corporation mapped Lamaredd. This time they used long-range spectrometry equipment and discovered the mineral wealth of Lamaredd, particularly in the mountains of the northern continent. The leader of the exploratory team, Hugo Bartyn, theorized that this was due to geologically recent volcanic activity, and estimated that ORO's investment in mines would gain profitable returns in a short time."}, {"tag": "p", "text": "Hugo Bartyn also noticed that the local seafood was exportable, but these goods were beyond ORO's area of expertise. Bartyn intended to exploit this natural resource of Lamaredd by himself, without sharing his profits with ORO. Lastly, Bartyn detected the native, primitive Menahuun and identified them as sentient, but nonetheless they were a problem for the exceptional-profitable mining activity. Consequently, Bartyn hurried to register Lamaredd with the Senate Mining Bureau in the name of ORO, and then he presented his first report to ORO. Bartyn asked ORO to name him the planetary Administrator so that he could manage the soon-to-be-built mines, and he also requested a land in the bay, near the location of the mines. ORO accepted Bartyn's conditions."}, {"tag": "p", "text": "ORO sent engineers and construction droids to build ORO Mining Station LM0228 in the Maw range, along with pipes that would throw away wastes in a far, north-western point of the ocean. Meanwhile, Bartyn and his team of federates made the first contact with the religiously-awed Menahuun, only to violently hunt them. Bartyn mistakenly believed that the Menahuun inhabited only coastal areas, but there were several forest-dwelling tribes that he was unaware of. Eventually, the coastal Menahuun hid in the woods and, along with their cousins, escaped towards the north. Bartyn's people believed that they had succeeded in wiping out the Menahuun, although Bartyn himself was unsure about that."}, {"tag": "p", "text": "ORO then delivered hundreds of mining droids to work in the mines, something that they did on Bartyn's command. ORO expected the building droids to go back to their headquarters along with the engineers, but Bartyn bribed a number of people so that the construction droids would remain on Lamaredd. Bartyn then bought an old Hoersch-Kessel LH-3010 capital freighter and used his droids to place it in the bay. Bartyn, who intended the three-kilometer ship to be transformed into a port city, used mining gear to blow away or customize parts of the freighter. The ad hoc town was named Bartyn's Landing, apparently an idea of the team's medical droid MD-0C6."}, {"tag": "p", "text": "Under Administrator Bartyn, the Mining Station profited ORO in so little time that ORO decided not to worry about Bartyn's probably illegal methods. They did know that Bartyn probably had annihilated any native sentient species of Lamaredd—it would not have been the first time. As such, they were unprepared when Bartyn began to secretly claim all the key locations of Lamaredd, gaining property over Jotsen's Island and the other areas."}, {"tag": "p", "text": "Wanting to profit from the seafood, Bartyn programmed ORO's droids with specialized software and bought 209 old Ubrikkian Industries 222 fishing trawlers from the Hutts. He also recruited poor, uneducated amphibian aliens from the planets Champala, Dac, Iskalon, and Naboo to settle Bartyn's Landing and work as fishermen and in the seafood processing plant he was building. The Chagrians, Gungans, Iskalonians, Mon Calamari, and Quarrens became indentured servants to Bartyn due to his crafty machinations, and worked as slaves while Bartyn made a fortune by exporting seafood to Hutts and Alderaan nobles through his own company, Bartyn Gourmet Delicacies. Because the aliens belonged to different cultures and were unaccustomed to the conditions, inter-species violence was common."}, {"tag": "p", "text": "In due time, Bartyn allowed some of his settlers to move to other cities, most notably the Quarren community that founded The Shoals on the opposite side of the bay of Bartyn's Landing. Bartyn, a great aficionado to big-game hunts, spent part of his time \"taming\" the jungles. In a move that would profit his sailors, Bartyn attempted to eradicate the Gulletbeasts, which were a threat to his trawlers, but he failed."}, {"tag": "p", "text": "ORO eventually discovered that Bartyn had claimed most of the planet for himself, and sent a security staff to take control of the spaceport that Bartyn had built in Bartyn's Landing. Bartyn allowed them to control the spaceport in the name of ORO, but they still had to answer to the local Administrator of ORO. From that moment on, the mandatory customs check for incoming visitors would become a rude, while brief, experience."}, {"tag": "p", "text": "Eventually, Bartyn's indentured servants gathered to create the Sailor's Union circa 517 BBY. The Union threatened Bartyn's control to the point that, after a sudden work stoppage in the open sea, Bartyn was forced to negotiate. The aliens wanted more living space, both in Bartyn's Landing and outside: Bartyn agreed to lease acres of the nearby terrain to any worker agreeing to protect the terrain from natural predators. Also, Jotsen's Island was to be ceded to the aliens as homeland, and it became the sovereign state of Little Mon Cal, and it was soon settled with the creation of the city of Farsands. Eventually, Farsands became the headquarters of the Union."}, {"tag": "p", "text": "Meanwhile, the Menahuun were hiding in the northern territories, trying to learn about the invaders from afar. A sudden scarcity of resources led to previously-unheard tribal conflicts that turned their peaceful hunter-gatherer society into a competitive one."}, {"tag": "p", "text": "In 499 BBY, unidentified creatures perceived as \"beasts\" kidnapped babies in Bartyn's Landing and, at the same time, altar-like piles made with stone appeared in the outskirts, presumably for the same reasons. Several trawlers suffered inexplicable breakdowns, some of them being lost in the high sea. When Hugo Bartyn and his partners traveled to the forest in an attempt to discover the truth behind these irregularities, they, too disappeared mysteriously. Their gear and clothing were found ripped soon afterward. Although the Menahuun were believed to be responsible, their implication was never proved."}, {"tag": "p", "text": "Hugo Bartyn was succeeded by his daughter Tria Bartyn, who discontinued the politics of her father: She freed the indentured servants, authorized them to live wherever they wanted to and even encouraged the Sailor's Union to expand, for which she would be historically known as \"Benevolent Tria\" and became a revered, almost religious figure along with the First-Wavers. During her times, tourism also flourished in Lamaredd."}, {"tag": "p", "text": "During the following centuries, Administratorship of the ORO mines was inherited by descendants of Hugo Bartyn, which allowed ORO to continue profiting from Lamaredd. The Administrator also inherited the title of mayor of Bartyn's Landing along with most of the property there, including BGD, the local bank, and several businesses. Although the spaceport was property of ORO, BGD still restricted the exports of seafood through unclear means. ORO paid the Security Chief of the area, although the person with this title was elected. Beyond the borders of Barytn's Landing, the number of aliens was bigger."}, {"tag": "p", "text": "The Menahuun were coincidentally living near the area used for ORO to dump the wastes from the mine. As centuries passed, the flora began to die and the region became uninhabitable. Believing this to be a conscious attack on the part of Bartyn's inheritors, the Menahuun tribes went back to their ancestral lands. While in the Maw range, they coincidentally found a tunnel leading to the insides of the droid-operated mines. They sneaked in the ORO mines and, once the Menahuun noticed that the droids were ignoring them, the Menahuun turned the area into their own city, Hua'bal. They lived there for what they called \"three generations.\""}, {"tag": "p", "text": "C. 69 BBY, Lamaredd was raided by outlaws led by Byrch \"The Padawan\" Dyshkava, a Dark Jedi. The recently appointed Security Chief of Bartyn's Landing, Mix Liddell, managed to stop them, although Dyshkava himself escaped. He would eventually be captured by the Menahuun of Hua'Bal and retained for years."}, {"tag": "p", "text": "C. 36 BBY, Guther Bartyn, Administrator of Bartyn's Landing, approached the automated family mines during a hunting trip and he was greeted with laser fire. He assumed that a gang of outlaws were hiding in the mines, but at that point, the mines were inhabited by aggressive Menahuun."}, {"tag": "h3", "text": "Soon after the Battle of Naboo"}, {"tag": "p", "text": "C. 29 BBY, several unusual situation happened in Lamaredd. Little Mon Cal was devastated by a fungal plague; fortunately, Bartyn's Landing sent a doctor with medical supplies and a security attachment—which was particularly helpful when pirates tried to hijack the shipment during the trip. The Jedi Council sent a team to research the local history, and they accidentally discovered an anti-Human terrorist movement that bore a grudge to Hugo Bartyn. Guther Bartyn competed in a sea race around Lamaredd with a visiting Neimoidian dignatary. Gulletbeasts attacked several boats. Miss Mylla, manager of an entertainment house in Bartyn's Landing, decided that one of her employees needed a new career and sent her to a business partner in Little Mon Cal as a \"package\". Several boats disappeared in the area of the Rank, raided by a flotilla of Menahuun. Corrupt starport guards had organized a smuggling ring, violating local ORO codes and damaging the lives of Lamaredd inhabitants. Lastly, the outskirts of Bartyn's Landing were crawling with predators."}, {"tag": "p", "text": "All of these events paled in the face of what happened afterward: The Menahuun had finished any tribal conflict and were preparing for open war, using galactic technology they had stolen and adapted. Although the Menahuun had specific orders to restraint until an event known as the \"Reckoning\", a number of impulsive young individuals had begun raids against farms and trawlers, although they were only detected as \"gremlins\". Two of the escorts working for Miss Mylla's Saloon disappeared mysteriously at the Maw Range. Administrator Bartyn, suddenly worried about the security of his personal yacht Tria Blue, assigned a detachment from the spaceport security to watch her from her deck."}, {"tag": "p", "text": "Dyshkava, until then a prisoner of the Menahuun, escaped from them and reached Bartyn's Landing, where he warned his former adversary Liddell of the impending threat the Menahuun posed. Liddell hired new subordinates and asked them to corroborate Dyshkava's story by tracking his steps and looking for Menahuuns. The Seconds did find hostile Menahuun presence in a coastal area where Dyshkava had said, and later had a new contact with them while investigation gobling rumors in the pier."}, {"tag": "p", "text": "Liddell's Second found the Menahuun community hiding in the mines. A shaman there, Eeytch, had predicted their coming and challenged them to a fight against several Menahuun champions; should they win, the Menahuun would accept to negotiate a conflict resolution. This eventually happened and the Menahuun agreed to stop their raids, living peacefully with the alien communities."}, {"tag": "p", "text": "This situation was problematic for ORO, as the Menahuun were living proof of the irregularities committed by ORO agent Hugo Bartyn, including slavery and genocide. To avoid a potential scandal, ORO retired from Lamaredd. This in turn reduced the power of the Bartyn Family, who then lost the political power to democratically-elected Administrators; and then lost Bartym Gourmet Delicacies to the town council of Bartyn's Landing. Guther Bartyn went insane and re-programmed mining droids to attack Bartyn's Landing, specifically targeting any Menahuun. Meanwhile, the seas saw the appearance of a new threat in the form of the pirate known as the Red Quarren."}, {"tag": "p", "text": "Sometime in or before 196 BBY, a Gamorrean named Gammy trained as a chef on this planet. Having spent years working in the finest restaurants there, he became the first Gamorrean to earn the title of Galactic gourmet."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "The Menahuun were a native sentient species from Lamaredd. They had always managed to live in peace with the environment, never knowing scarcity until the arrival of \"visitors from the sky.\" In further years, their number dwindled until the near extinction, but as of 29 BBY, they had become again a thriving civilization—while a more hostile one."}, {"tag": "p", "text": "A number of Humans accompanied Hugo Bartyn to Lamaredd, and more came in more recent years, but their cities were populated mostly with commonly-amphibious aliens, either descendants of the First-Wavers or those who came in further years. The more common species included Chagrians, Gungans, Mon Calamari, and Quarren, as well as Aqualish, Rodian, and Talz. As of 29 BBY, at least one Trandoshan, one Ortolan, and one Snivvian were known to live in Bartyn's Landing."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The jungle-covered northern continent of Lamaredd was the seat of its main activity. The geologically-young mountains in Krakana's Maw, including Mt. Hugo, were the site of the mining activity of ORO through ORO Mining Station LM0228, later known as the Menahuun community of Hua'Bal. That continent also included the most important city in the planet, Bartyn's Landing, which served as planetary capital and spaceport. Inhabitants of Bartyn's Landing regularly performed hunting activities in the jungle to keep dangerous predators away from their living area. Other locations in the continent included the Row and the Quarren town The Shoals."}, {"tag": "p", "text": "The second biggest continent was known as Jotsen's Island, and later as Little Mon Cal, and was considered the alien homeland and an independent state. The capital city of Little Man Cal was Farsands, also the seat of the Landing Union chapter, main headquarters of the Sailor's Union. The Union was powerful there, although not immune to corruption."}, {"tag": "p", "text": "Other remote locations included Bartyn's Retreat, a small island in the planetary equator holding the Bartyns' vacation home, and the small portuary town of Cape Regret. An area known as the Rank was a known dangerous aquatic dead zone. A lost ancient Sith Temple was erroneously believed to have existed in Lamaredd."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lamaredd was created by writer Cory J. Herndon and featured in the article Bartyn's Landing and in the role-playing adventure Reckonings, both of them published in the magazine Star Wars Gamer #7 (2001). The planet was also mentioned in the entry about the Menahuuns in Ultimate Alien Anthology (2003)."}, {"tag": "h3", "text": "Alternate endings"}, {"tag": "p", "text": "The article assumes that the player characters of Reckonings achieve the best possible ending but, should they fail, the adventure offers an alternative path that takes place during an open war between the Menahuun and the citizens of Bartyn's Landing. The Menahuun repeatedly raid Bartyn's Landing, clashing with the armed citizens. Several civilians attempt to leave the city and start anew in other parts of Lamaredd, with Miss Mylla trying to reach Little Mon Cal—but failing to arrive due to a transport accident near the Rank that left her boat and herself to the mercy of the Menahuun. The martial Menahuun extend through the planet, taking control of several locations including Bartyn's Retreat, while crime extends in the civilized areas."}, {"tag": "p", "text": "Alternatively, the best possible ending of Reckonings featured the Menahuun peacefully and completely joining the alien communities and becoming full-fledged citizens. The little civil unrest from this situation was counteracted by the teamwork of Menahuun leaders, Liddell, and disgruntledly, Guther Bartyn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}