{"url": "Lambda-class_T-4a_shuttle/Legends", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Galactic Alliance starship classes", "Category:Galactic Empire starship classes", "Category:Galactic Republic starship classes", "Category:Lambda-class T-4a shuttles", "Category:New Republic starship classes", "Category:Shuttle classes"], "nodes": [{"tag": "h1", "text": "Lambda-class T-4a shuttle"}, {"tag": "p", "text": "The Lambda-class T-4a shuttle, also known as the Imperial Shuttle, was a standard light utility craft in common with the Imperial military as a transport for troops and high-ranking individuals."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Sienar Fleet Systems' Lambda-class shuttle was based on a tri-wing design with a central stationary wing flanked by a pair of folding wings. When in flight position, the wing configuration resembled an inverted Y. When landing, the lower wings folded upwards. This design feature was implemented as a means to protect the ship's occupants as it touches down."}, {"tag": "p", "text": "The Lambda was designed as both a cargo and troop transport and could carry 80 metric tons or more than 20 soldiers. It had a crew of six: a pilot, co-pilot, navigator, communications officer, gunner, and engineer. A shuttle could be piloted by a skeleton crew consisting of a single officer during emergencies. It was also equipped with a Class 1 hyperdrive since its mission profile involved traveling across the galaxy."}, {"tag": "p", "text": "The cockpit was at the front of the craft, and the boarding ramp was behind and under it. Its main drive units were capable of reaching speeds of 850 kilometers per hour inside atmospheres, or 50 MGLT. Cooling intakes were on the fuselage, and formation lights were at the end of the wings."}, {"tag": "p", "text": "The Lambda was reasonably well armed, with three double blaster cannons (one rear-mounted) and two double laser cannons. The military version built by Cygnus Spaceworks was armed with ten laser cannons. It was also protected by a powerful deflector shield, which was powered by a pair of generators. A Lambda was covered by a heavily reinforced hull capable of deflecting laser fire. The shuttle class was so well armed that it was able to travel across the galaxy without an escort, thus making it suitable for covert operations."}, {"tag": "p", "text": "Additionally, the shuttle was equipped with a state-of-the-art communications grid."}, {"tag": "p", "text": "In an emergency the cockpit could be jettisoned from the main body and travel a short distance at sublight speed. The lifeboat did not have enough space for all passengers when the shuttle had its full complement and therefore priority was given to the most senior officers on board."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lambda-class T-4a shuttle was designed by former Cygnus Spaceworks employees who were lured away by Sienar Fleet Systems, which promised them high salaries, a portion of future profits, and even personal star yachts. Although these shuttles were primarily manufactured by Sienar, Cygnus was subcontracted to build a more heavily armed military version. The T-4a was the immediate successor of the Theta-class T-2c shuttle, and was first introduced in 19 BBY at some point after the Imperial subjugation of Kashyyyk."}, {"tag": "p", "text": "The Lambda-class shuttle was used along with the TIE/sh VIP shuttle to transport officers between ships in a fleet. Lower ranking officers usually used the TIE shuttle, while the larger Lambda-class shuttles were reserved for flag officers. The Lambda was also favored by Imperial personnel because it was heavily armed and shielded. Thus, the vehicle class found itself used by key Imperial officials including Darth Vader and even Emperor Palpatine himself. Vader and the Emperor in particular utilized shuttles during instances that required them to make a personal appearance as a means of motivating the troops. These high-ranking officials often converted the cargo space into personal quarters and equipped them with secure HoloNet transceivers directly connected to Imperial Center. Emperor Palpatine's shuttle was equipped with extra shielding, for obvious reasons. It was also rumored that it was equipped with a cloaking device for added protection."}, {"tag": "p", "text": "Although it's primary purpose was military-based as well as government-based in terms of use, it is sometimes used for civilian tours, a notable example being the Startour 7."}, {"tag": "p", "text": "The Lambda-class shuttle Tydirium was captured by the Alliance to Restore the Republic and used to insert a strike team on the forest moon of Endor. In addition to this, the Alliance maintained a fleet of Lambda-class shuttles as support ships, with the Alliance Starbird painted on the central wing."}, {"tag": "p", "text": "During the Galactic Civil War, the Rebels used a fleet of captured Lambda-class shuttles as support ships. The Alliance logo was painted on their central wing, to help tell them apart from the Imperial ships."}, {"tag": "p", "text": "The Alliance shuttles were occasionally used as landing craft or scoutships."}, {"tag": "p", "text": "With the fall of the Empire, Cygnus also manufactured a variant of the shuttle similar to the original version, largely to compete with Sienar. The Lambda also found itself used by various sectorial and planetary security forces including the New Republic and the Galactic Federation of Free Alliances. Jacen Solo and Ben Skywalker used an armed Lambda-class variant during their mission to Adumar in 40 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lambda shuttles were erroneously referred to as \"Tyderian class\" in some sources, a misunderstanding originating from the shuttle Tydirium."}, {"tag": "p", "text": "The name Lambda comes from the Greek letter (uppercase Λ, lowercase λ) whose lowercase form resembles the general arrangement of the shuttle's wings. The designation of this shuttle type as Lambda-class dates back to the novelization of Return of the Jedi (1983), and was picked up by contributors to West End Games when that company began writing material about the shuttle."}, {"tag": "p", "text": "In Return of the Jedi (and in a re-used scene inserted into the special edition of The Empire Strikes Back), there are inconsistencies between the ILM model and the mock-up used on the set. The main difference between the two is the cockpit of the shuttle. While the bottom of the cockpit lines up with the bottom of the shuttle's body in the ILM model, the mock-up of the shuttle has a cockpit that dips much further down. The other notable difference is that the landing gear of the shuttle in the mockup are much taller, allowing people to easily walk underneath, while with the ILM model, there wouldn't be enough room for a person to fit under the Lambda. This has affected other Star Wars media as well, most likely due to using different reference pictures when creating illustrations."}, {"tag": "p", "text": "The Sienar/Cygnus connection has occasionally been a source of confusion, but the StarWars.com Databank indicates that the Lambda's predecessor was built by Cygnus and the designers of that shuttle were lured away by Sienar, who then built the original Lambda shuttles. Cygnus then built the Lambda under license from Sienar. Sienar and Cygnus also cooperated on the Sentinel-class landing craft, a derivative design."}, {"tag": "p", "text": "Another derivative design known as the Delta-class JV-7 escort shuttle was seen in the X-Wing computer game series. The craft library of the game X-Wing Alliance describes it as a \"militarized version of the Lambda-class shuttle built under subcontract to Sienar,\" but little else is known about its design and manufacturing history."}, {"tag": "p", "text": "In these titles that feature the Delta-class, the Lambda-class was toned down. It lacks the potently deadly rear turret, has less armor and shields, and is slower than the Delta. Lambda-class shuttles are frequently found in the hands of pirates and smugglers, rather than exclusively used by Imperials. Missions often use them as starfighters (instead of their role of transporting important personnel) and not surprisingly they fare poorly due to their large size and lack of maneuverability."}, {"tag": "p", "text": "One notable inconsistency in several official sources is the layout of the cockpit. Star Wars: Complete Cross-Sections shows six seats in the center of the cockpit and additional seats on each side, two of which accommodate port and starboard gunners. An early drawing from Lucasfilm Ltd. also showed this layout, and was used by the artist drawing the shuttle. However, the deckplan for the shuttle shown above only contains six seats in the cockpit. The movie cockpit also appears to only hold six crew members. The Lego model's cockpit only holds four."}, {"tag": "p", "text": "A Lambda-class T-4a shuttle is in the pilot episode of the Firefly television series created by Joss Whedon. It can be seen lifting off from the Evesdown Docks in the background behind Serenity."}, {"tag": "p", "text": "In September of 2010, LEGO Star Wars released a model of the shuttle that was fully in scale to minifigures. The shuttle model included folding wings, detachable landing gear, and five minifigures: Jedi Knight Luke Skywalker, Darth Vader, a shuttle pilot, an Imperial officer, and a stormtrooper. The model was dubbed an Ultimate Collectors Model."}, {"tag": "p", "text": "In 1995 the model kit company AMT/Ertl released a model kit of the Imperial Shuttle. This model resembles the set piece rather than the ILM filming miniature. The German model company Revell released a second kit of this ship, which appears to have been based on the AMT/Ertl kit and has the same proportionality."}, {"tag": "p", "text": "In Star Wars: Rogue Squadron II: Rogue Leader and Star Wars: Rogue Squadron III: Rebel Strike (the latter via a co-op port of the former), a Lambda-class T-4a shuttle, specifically the Tydirium, was playable during the late stages of the mission \"Imperial Academy Heist.\" In the former game, the player can unlock and play it outside of the level, although only for Triumph of the Empire and Revenge on Yavin, by getting a Gold Medal for both levels. However, in the latter game, it was only playable via that level, and cannot actually be selected for missions due to the Revenge on Yavin level being cut out from the Co-Op mode of the latter game. Nonetheless, in Rebel Strike, the player can at least get details on the shuttle by approaching the shuttle and pressing the c-stick in the Arcade mode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}