{"url": "Aquilaris_Minor", "categories": ["Category:Legends articles", "Category:Aquilaris Minor locations", "Category:Grumani sector planets", "Category:Outer Rim Territories planets on the Hydian Way", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Aquilaris Minor"}, {"tag": "p", "text": "Aquilaris Minor, or simply Aquilaris, was a planet in the Grumani sector of the Outer Rim."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Aquilaris Minor was a predominantly ocean world, though it had some landmass. Its oceans were rich in marine flora and fauna including algae and eels which were harvested as food by members of the Seacroppers' Guild. Much of its surface landmass was flat with no high mountain ranges. Known terrain included equatorial beaches and polar fjords. Its landmass also included at least one chain of islands near Capital Cay. The highest known point on Aquilaris was Tarrah Hill, which was even pregnable to flooding."}, {"tag": "p", "text": "The planet's main city Capital Cay served as a key seaside port with a large fleet of Seacropper Submersibles and boats. Capital Cay also boasted at least one spaceport for interstellar traffic. Due to its flat landmass and large oceans, the planet's landmass was vulnerable to global flooding. During the Aquilaris campaign, a fleet of Stormdrivers equipped with weaponized vaporators created a global flood which inundated much of Aquilaris' surface landmass."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Between 3701 BBY and 3699 BBY, the hyperlane of Hydian Way was charted through Aquilaris as part of the Seswenna Expansion. During or after this period, the planet joined the Galactic Republic and opened itself as a major resort world and exporter of seafood. While the Republic kept a foothold in the Grumani sector, the New Sith Wars threatened to tear the sector apart. Accepting refugees from abroad, Jedi Knight Vannar Treece led the resistance on this world before it fell to the Sith Chagras Hegemony in 1042 BBY."}, {"tag": "p", "text": "Following the death of Lord Chagras, his empire collapsed into several pocket states. Aquilaris was subsequently ruled by several different Sith Lords and its people suffered much poverty and deprivation under their rule. By 1032 BBY, the planet had been incorporated into Lord Daiman's princedom known as the Daimanate. His policies included exploiting Aquilaris as a source of seafood to feed his military forces, which led to severe hardship among the Aquilarians. As with his other subject worlds, Daiman built large statues and holographic projectors depicting himself to maintain his ideological grip over the planet."}, {"tag": "p", "text": "The Republic's Grace Command led by Baron Lemayne on Alderaan ran a top-secret operation which involved distributing the addictive spice Deluge to Sith-occupied space including Aquilaris. While it succeeded in weakening the Sith military forces without committing substantial Republic resources, the spice disrupted the lives of many Aquilarians who became addicts. Following a three-way battle at Capital Cay, the Daimanate garrison was overwhelmed by Hutt forces under Zodoh and Grace Command's Devil Squadron. Meanwhile, the Jedi Knight Kerra Holt infiltrated her homeworld after receiving a distress call from the Seacroppers' Guild. She subsequently established contact with Devil Squadron and assisted in mopping-up operations against Daiman's Sith forces."}, {"tag": "p", "text": "While Grace Command was welcomed as liberators by the local population and delivered much needed food and medical relief supplies, they secretly distributed more stocks of Deluge spice. Their modus operandi involved departing from Aquilaris and then allowing Sith forces to recapture the planet, thus spreading the addiction. However, Devil Squadron was ambushed and captured by Zodoh following a dogfight in the Aquilaris Minor system. Meanwhile, Zodoh had deployed a fleet of Stormdrivers, capital ships capable of generating artificial floods. He intended to flood Aquilaris' surface as a means of intimidating the local Sith lords."}, {"tag": "p", "text": "Zodoh forced Devil Squadron's Captain Jenn Devaad to bring back the remaining stocks of Deluge spice on Aquilaris. He planned to synthesize his own stock and then lace food supplies with the spice to weaken resistance in the Grumani sector. However, his scheme was sabotaged by Devaad who had rigged their containers with explosives. The ensuing explosion allowed her to escape and disrupted the Stormdrivers' artificial storms and floods on Aquilaris. Meanwhile, Holt—with the assistance of local Seacroppers Padgett and Joad Kreel—managed to evacuate thousands of flood refugees to an underwater harvester station. Despite the widespread damage caused by the global flood, Aquilaris' small population meant that fewer lives were lost. Satisfied with his successful testing on Aquilaris, Zodoh dispatched his Stormdrivers to Darkknell, the capital of Daiman's princedom."}, {"tag": "p", "text": "Following the Battle of Darkknell, the floods gradually subsided and the refugees were able to gradually return to their homes. Aquilaris was saved from further Sith incursions by false intelligence that it was still completely submerged in water. With its underwater harvester stations, Aquilaris would subsequently become a major base for shuttling refugees out of Sith space into Republic territory. Following the Aquilaris campaign, the flow of the Deluge spice was halted. Meanwhile, Devaad misled Grace Command with false intelligence that she had secured a contract for distributing Deluge to Aquilaris. En route, however, Devaad would arrange for the Deluge to be dumped into the space while the same transport ship would be used to ferry refugees to Republic space."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aquilaris Minor first appeared during the Star Wars: Knight Errant comic series, making its debut during a flashback scene in Knight Errant: Aflame 2 on November 10, 2010. The planet would then play a greater role in the plot of the Deluge story arc. Throughout the Knight Errant series, the planet has always been referred to as Aquilaris."}, {"tag": "p", "text": "Jason Fry confirmed that Aquilaris Minor was invented to account for mapping discrepancies between the planet Aquilaris from Knight Errant and previous sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}