{"url": "Lamos_Chatoor", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Legal professionals", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lamos Chatoor"}, {"tag": "p", "text": "Lamos Chatoor was a male Imperial judge who had served in that capacity for twenty years by 0 ABY. However, he illegally used his position to further himself and his friends. In 0 ABY, he was approached by Emperor's Hand Mara Jade, who planned on executing him for his corruption. Although he attempted to plead and trick his way out of it, Jade killed him with her lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lamos Chatoor was a male judge who served the Galactic Empire. By the year 0 ABY, he had served the Empire in that capacity for twenty years, starting in 19 BBY. However, for five years of that time, he had used his position for extortion, theft, and influence selling. In the year 0 ABY, Emperor's Hand Mara Jade went to Chatoor in order to execute him for the crimes he had committed. He first tried to persuade her that he did not deserve to die, and, when that did not work, he proceeded to plead for her to not kill him."}, {"tag": "p", "text": "However, his ploys were only a stalling tactic so that two men could arrive and attack Jade. They did so, but Jade was ready for them and killed them when she redirected their own blaster bolts back at them with her lightsaber. During the hassle, Chatoor attempted to make a grab for Jade's dropped blaster, but she caught him in time, holding him at bay with her lightsaber. He then began to again plead for his life, stating that Jade had no friends, and that he was willing to be one to her. Jade quickly silenced him by passing her lightsaber through his neck, thus ending his life."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although Lamos Chatoor had been an Imperial judge for twenty years by 0 ABY, he was a corrupt individual and used his position as a judge to better himself, his friends, and his supporters. He also had made deals that had defrauded the Empire and its citizens. When faced with death, he attempted to plead, persuade, and trick Mara Jade. When Jade had a blaster held to his head, his face turned red in color, and he began sweating excessively. Later, when Jade held a lightsaber to his throat, his face turned white and contorted. Although he claimed to be innocent, he tried to shoot Jade in the back, and Jade stated that an innocent person would not shoot an Imperial agent in the back."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lamos Chatoor first appeared in chapter three of the 2011 novel Choices of One, written by Timothy Zahn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}