{"url": "Aquilaris_campaign", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles of Aquilaris", "Category:New Sith Wars campaigns"], "nodes": [{"tag": "h1", "text": "Aquilaris campaign"}, {"tag": "p", "text": "The Aquilaris campaign was a campaign of the New Sith Wars in 1032 BBY. It was centered around the Outer Rim world of Aquilaris Minor in the Grumani sector. It was a three-way campaign which involved the Sith Lord Daiman's Daimanate, Hutt crime lord Zodoh's empire, and the Galactic Republic and Jedi Order represented by Grace Command's Captain Jenn Devaad and Jedi Knight Kerra Holt respectively. Each party had their own vested interests in the planet."}, {"tag": "p", "text": "Sith Lord Daiman had recently acquired the planet in the power vacuum following the collapse of the Chagras Hegemony. Zodoh had wanted to expand into traditional Sith Space by using his new Stormdriver superweapons to intimidate his Sith rivals. First, he intended to test them on Aquilaris Minor by using their weaponized vaporators to submerge the planet in water. Meanwhile, Grace Command had intended to drive out the Sith while secretly inundating the population with the narcotic spice Deluge as a means of undermining the Sith war effort under Operation Deluge. Their cover as a paramilitary relief organization concealed the unethical agenda of Baron Lemayne. In contrast, the Jedi Knight Kerra Holt had planned to liberate the planet from Sith occupation and rescue the Aquilarians from the machinations of both Zodoh and the Sith."}, {"tag": "p", "text": "Zodoh and Grace Command wiped out Daiman's meager garrison, with the latter taking control of the planet. Zodoh's forces retreated into the far reaches of the Aquilaris system but lured Devil Squadron into a trap. The entire squadron with the exception of Captain Jenn were killed. Zodoh then proceeded to test his fleet of Stormdrivers on Aquilaris, creating a global flood which inundated much of the surface in water. Subsequently, Jenn managed to escaped and disrupted the coordination of the Stromdrivers in the process. Despite this minor setback and the destruction of stocks of Deluge spice during the escape, Zodoh regarded this as a victory since it had proven the effectiveness of his superweapons. He then dispatched his fleet to Darkknell, capital of Daiman's princedom. There, Zodoh was defeated through the combined efforts of Kerra and Captain Jenn, who wanted to avenge the murder of her squadron mates."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Background"}, {"tag": "p", "text": "Following the Jedi Knight Kerra Holt's adventures in various Sith princedoms of the Grumani sector, she received a distress call from a member of the Seacroppers' Guild on Aquilaris Minor. She hitched a ride aboard a transport and lands in Capital Cay, the main city on Aquilaris Minor. In reality, the distress call was just a coded signal calling for spacers to deliver Deluge, a highly addictive spice. Aquilaris Minor had been Kerra's homeworld until she had been forced to flee offworld during an invasion by the Chagras Hegemony in 1042 BBY. In the successive years, this remote watery world had changed hands between various Sith Lords. By 1032 BBY, the planet had fallen under the control of Lord Daiman, the ruler of the Daimanate who saw himself as the \"Creator\" of the Universe and believed that other sentient beings did not exist. He forced the people of Aquilaris Minor to harvest seafood for him. To cope with the poverty and hunger, many of the planet's inhabitants became addicted to the spice Deluge which became a substitute for food."}, {"tag": "p", "text": "Unknown to Kerra and the Aquilaris locals, the planet had attracted the attention of two other groups: the Hutt crime lord Zodoh and Grace Command. The ambitious Zodoh had acquired a fleet of Stormdrivers, tactical warships equipped with weaponized vaporators capable of generating artificial floods and storms. With Daiman preoccupied with consolidating his new territories in the former Bactranate, Zodoh decided to expand his operations into the Grumani sector. He intended to use Aquilaris Minor as a testing ground for his new Stormdriver weapons."}, {"tag": "p", "text": "Meanwhile, Grace Command, a seemingly benevolent relief organization, was actually a black operation mounted by the Alderaanian Baron Lemayne. Under the cover of fighting the Sith and distributing relief supplies to liberated populations, Grace Command was actually distributing Deluge spice in Sith worlds. This was part of Baron Lemayne's strategy of sabotaging the Sith war effort without having to waste substantial Republic resources and manpower. Grace Command sent Captain Jenn Devaad's Devil Squadron to \"liberate\" Aquilaris Minor."}, {"tag": "h3", "text": "False dawn"}, {"tag": "p", "text": "Zodoh's Intruder-class starfighters dropped out of hyperspace inside Arkadia Minor's patrol zone and wiped out the Daimanate starfighter defenses. Zodoh's starfighters then ravaged the Daimanate garrison on Capital Cay, driving the Sith into retreat. The garrison commander attempts to leave on a food transport and get reinforcements from Scepter Cay. However, he and his men were ambushed and killed by Kerra, who had been hiding aboard the food transport. Kerra then headed to the Seacroppers' barracks where she met her old friends Padgett and Joad Kreel. Kerra attempted to convince them to escape Aquilaris with her only to discover that most of the Seacroppers apart from Padgett had become Deluge spice addicts. She also learnt that the distress transmission was actually a code signal calling for more spice."}, {"tag": "p", "text": "Shortly later, one of Zodoh's Stormdrivers arrives above Capital Cay and unleashed a stormy deluge over the city, sweeping Daiman's defenders into the sea. Kerra launched a lone attack on Zodoh's Stormtriver with her blaster pistol. While her bolts failed to dent the ship, it distracted the ship's crew long enough for Devaad's starfighters to destroy the Stormdriver. Captain Devaad's Devil Squadron had just emerged from hyperspace and attacked Zodoh's raiders. Facing renewed opposition, Zodoh ordered a tactical withdrawal. Captain Devaad's Devil Squadron are greeted as liberators by Kerra and the local people, who do not suspect their true intentions. In the outskirts of the Aquilaris Minor system, Zodoh contacted the Grumani Sith Lords from his flagship Voracious. He offered to sell them slaves and munitions if they allowed him to annex the Daimanate. Satisfied with the Stormdriver's test demonstration at Capital Cay, Zodoh brought a fleet of Stormdrivers from Nal Hutta, the Hutt homeworld."}, {"tag": "p", "text": "In the aftermath of Capital Cay's \"liberation\", Kerra and Devil Squadron wiped out the remaining Daimanate forces on Aquilaris Minor. Shortly later, the Grace Command transport Mother Grace landed at Capital Cay to distribute food and medical supplies to the starving inhabitants of Aquilaris Minor. Kerra managed to secure a place on Devil Squadron despite concerns from Jenn's comrades who feared that Kerra will discover their secret agenda. Kerraa's friend eavesdropped on a secret Devil Squadron meeting and learnt about Grace Command's real agenda. Later, Kerra and her Devil Squadron comrades escorted the Mother Grace out of the Aquilaris Minor system while traveling to fight the Sith Lord Malakite's forces on Heptooine."}, {"tag": "p", "text": "While traveling through the Aquilaris system, they stumbled upon Zodoh's Intruder starfighter. Desiring revenge for their enslavement, Captain Jenn and her comrades pursued the Hutt. However, this turned out to be a trap and Devil Squadron was soon attack by a swarm of Intruder-class starfighters. In the midst of the fighting, Zodoh's Stormdriver fleet arrives from Nal Hutta. Zodoh announced his plans to use Aquilaris Minor as a testing ground for his new weapons. Sensing that Zodoh has lured them into a trap, Kerra breaks ranks with her Devil Squadron allies and returned to Capital Cay. Kerra' decision came at a timely moment because Zodoh's flagship Voracious then trapped the squadron with a tractor beam projector."}, {"tag": "h3", "text": "Stormy trials"}, {"tag": "p", "text": "Back at Capital Cay, Kerra tried to organize an evacuation of Aquilaris Minor's population but the spice-addicted Seacroppers were either unwilling or unable to help due to their drug-induced state. She tried to reason with her despondent childhood friend Joad Kreel but her efforts came to naught. Kerra also discovered that the \"food containers\" supplied by Grace Command only contains Deluge. Meanwhile, Zodoh coerced his captive Captain Jenn into recovering the \"food containers\" she had distributed on Aquilaris in return for the release of her crew. Jenn reluctantly complied and forced the Aquilaris locals at gunpoint to return their \"food containers.\" However, she was quickly ambushed and disarmed by Kerra Holt, who had by then deduced that Grace Command were actually spice dealers. Jenn rationalized her actions by arguing that Grace Command was aiding the Republic's war effort against the Sith. Unable to reconcile their differences, Kerra allowed Jenn to return to Zodoh to secure the release of her squadron mates."}, {"tag": "p", "text": "Following Captain Jenn's departure, Zodoh's Stormdrivers unleashed an artificial global rainstorm and flood on Aquilaris Minor. Kerra and Padgett struggled to evacuate the peoples of Aquilaris Minor to Tarrah Hill, the highest feature on Aquilaris Minor. After much difficulty, Joad finally overcame his melancholy and evacuated many Aquilaris refugees in a Seacropper Submersible. They evacuated the refugees to an underwater harvesting station beneath Aquilaris Minor's oceans. Meanwhile, Captain Devaad brought the Deluge \"food containers\" to Zodoh only to discover that the Hutt crimelord had already murdered her squadron mates by letting them out through the ship's airlock. In retaliation, she detonated the \"food containers\", which had been converted into improvised remote-controlled bombs. These explosions damaged parts of the Voracious and disrupted the Stormdrivers' \"global flood\" on Aquilaris. The end of the downpour enabled Kerra, Padgett, and Joad to evacuate more Aquilaris refugees. Despite these losses, Zodoh regarded the Stormdrivers' test demonstration on Aquilaris as a success and ordered his forces to depart for Darkknell, the capital of the Daimanate."}, {"tag": "h3", "text": "Aftermath"}, {"tag": "p", "text": "Following the end of the Great Aquilaris Deluge, Jenn Devaad escaped from the Voracious and reconciled with Kerra Holt. She also revealed that Zodoh planned to flood Darkknell with his Stormdrivers. Seeking to save the lives of billions on that planet, they traveled on Jenn's stolen twin-seater starfighter to Darkknell. By that stage, Daiman's rivals had made a deal with Zodoh to attack the Daimanate; allowing Zodoh to Battle of Darkknell with ease. Zodoh's Stormdrivers devastated Daiman's throneworld and almost succeeded in destroying Lord Daiman and his princedom. However, Kerra and Jenn succeeded in infiltrating and destroying Zodoh's flagship Voracious, which throws his Stormdrivers into disarray. With their leader incapacitated, Daiman's forces regained the upper hand. Daiman's forces also captured Zodoh himself, who was brought before Daiman, who had him dehydrated with one of his own weaponized vaporators. This ended Zodoh's threat to the Grumani Sith Lords."}, {"tag": "p", "text": "Following the defeat of Zodoh, Kerra and Jenn returned to Aquilaris Minor where the floodwaters had already begun to subside. Kerra also reconciled with her childhood friend Joad Kreel, who had begun the process of ending his Deluge addiction. Padgett and Joad planned to use Aquilaris as a base to shuttle refugees out of Sith Space. They were able to carry out their operation because most of the Sith Lords believed that Aquilaris had been completely submerged by Zodoh's Stormdrivers. In addition, Captain Jenn also agreed to help ferry refugees into Republic space and to sabotage Grace Command's spice-distribution operations by dumping them into space. Kerra then embarked on a quest to find her long-lost parents and sibling, which took her into the heart of the Odionate, the realm of the Sith Lord Odion who saw himself as the \"Destroyer\" of the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Aquilaris campaign serves as the main conflict for Star Wars: Knight Errant: Deluge, the second five–issue story arc of John Jackson Miller's Star Wars: Knight Errant series, which ran from August 17, 2011 to December 21, 2011. It featured the comic series' main protagonist Kerra Holt and her homeworld of Aquilaris Minor. The Aquilaris campaign also served as a means of introducing three new characters, the supporting characters Joad Kreel and \"Old\" Padgett and the Hutt antagonist Zodoh. As of 2015, the conflict on Aquilaris Minor has not been given an official canonical name."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}