{"url": "Lamproid/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Endothermic species", "Category:Lamproids", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Lamproid"}, {"tag": "p", "text": "Lamproids, also known as Florn Lamproids, were a species of sentient carnivores from the Outer Rim planet Florn. The countless dangers of their homeworld had shaped them into consummate predators: they had well-muscled, serpentine coils that could constrict with deadly force, and mouths that could deliver mortal blows from rings of keen fangs. They employed a venomous stinger at the tip of the tail and a milky venom in their saliva. The Lamproid body was segmented and had six short limbs with clawed pincers. A tiny, wet sensory filament curled from between their fangs to detect scent, and light stalks on their heads sensed a range of the spectrum beyond that of most species. Some possessed the ability to communicate feelings telepathically, although this was not believed to be a species-wide trait."}, {"tag": "p", "text": "Lamproids descended from intestinal parasites that had evolved into independent, intelligent predators. They were primitive by most species' standards, lacking in both art and culture. However, their brains were excellent at solving puzzles. This made them popular prey for unscrupulous hunters seeking a challenging hunt."}, {"tag": "p", "text": "Members of the species spread beyond their homeworld and proved to be aggressive colonizers. They particularly thrived on jungle and forest planets, although they were known even on desert worlds like Tatooine. Although few galactic citizens knew much about the species and even mistook them for non-sentient pests, some Lamproids adapted to galactic technology and society and plied the starlanes as spacers, soldiers, and smugglers. One such Lamproid was Dice Ibegon, agent of the Alliance to Restore the Republic and lover of Lak Sivrak."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Lamproids were sentient, vermiform invertebrates related to intestinal parasites. Their bodies were thick, segmented tubes of muscle that grew to as long as six meters in length and often twisted serpent-like into coils. Their anatomy was roughly divided into three equal sections: head, thorax, and tail. Six thin, jointed limbs, each with a pair of sharp, claw-like pincers, extended from the midsection. Thin flaps of skin fringed the tapered tail, a part of the body that doubled as a fine manipulator. Veiny, wrinkled skin covered their bodies and came in shades of brown, gray, gray-green, and pink, sometimes blotched with yellow or sporting ring-like spots. Lamproids crawled about on their bellies. They could hold around 1.3 meters of their thorax and head upright; one Lamproid of such height weighed 45 kilograms."}, {"tag": "p", "text": "The Lamproid head was dominated by a slack, pulsating oral cavity lined with circles of fangs and surrounded by four longer mouthparts. Their teeth could be many colors, including black reddish-orange, yellow, and white. A straw-like tongue unfurled from the central orifice to facilitate smell and taste, and ingestion. Four photosensitive stalks adorned the head and allowed Lamproids to sense beyond most species' visual spectrum. By shifting these finger-like eye knobs, a Lamproid could monitor more than one direction at a time, a handy adaptation to surviving in dangerous environments. The eyestalks could be black or pink; they lost rigidity upon a Lamproid's death."}, {"tag": "p", "text": "The species was carnivorous and drank blood. Although non-Lamproids often found their appearance hideous and horrifying, these fearsome adaptations had molded them into consummate predators. Their rows of razor-sharp teeth were capable of shredding flesh, and their milky, toxic saliva was able to fell large prey. The tail terminated in a barbed stinger that could deliver its own venom; the optimal attack range for a Lamproid 1.3 meters in height was 12 meters. The beings were known for their immaculate reflexes, incredible bursts of speed, and ferocious strength capable of separating a bantha from its skull—features that served them equally well in offense and defense."}, {"tag": "p", "text": "Members of the species emitted pheromones that signaled others and provided information such as whether a Lamproid was male or female. Some exhibited telepathic abilities as well. For example, when the Human conman Cecil Noone encountered a caged female Lamproid in 0 ABY, she slowly conveyed to him the notion to free her. The suggestion began as an itch at the back of his neck followed by a tickle inside his head. The sensation spread to his forehead and grew more pronounced and insistent. Finally, he experienced stress behind his eyes and then felt the strong urge to free the caged Lamproid. They could also dissipate mild pain. In the same encounter, Noone, who had an injured hand, felt the pain relieved. Nevertheless, the pain gradually returned after the Lamproid went free."}, {"tag": "p", "text": "Lamproids were endothermic, and their blood was purple. Individuals typically went about unclothed, although those that had adapted to galactic society sometimes sported minimal trappings, such as a kerchief about the neck or an insulated jumpsuit in arctic conditions."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Lamproids had no obvious culture and created no art, so many beings considered them little more than simple animals. Nevertheless, they were clever beings, and could solve complicated puzzles that required high levels of intelligence."}, {"tag": "p", "text": "Lamproids were aggressive, natural-born hunters, reputed to be among the most dangerous predators in the galaxy—their instincts were so honed for the hunt that the smell of blood alone was enough to make a Lamproid's tail shake. They hunted by first stalking their prey. Once a Lamproid felt confident enough to make a kill, he or she made a quicksilver strike at full strength and betrayed his or her presence with only a fearsome hiss. Once the prey was grappled, the Lamproid coiled its body around the prey and constricted his or her body to crush and suffocate the victim. Lamproids also attacked with their tail stinger, the venom of which was enough to put down a Houk. The mouthful of razor teeth was another potent weapon. Those Lamproids capable of telepathy could also attempt to get into the prey's head to cause pain and disorientation. When threatened, the tail stinger was the favored means of defense."}, {"tag": "p", "text": "Lamproids formed mating pairs. They felt genuine affection for one another and conveyed their compassion by intertwining their bodies. One Lamproid, the female Dice Ibegon, even entered a love affair with a member of a totally unrelated species, a Shistavanen male named Lak Sivrak."}, {"tag": "p", "text": "Lamproids could learn to speak Basic with their hissing voices. Like other species, Lamproids communicated emotions via facial expressions, although their different morphology meant that they could not perform conventional actions like smiling. Instead, a Lamproid conveyed amusement by shifting its teeth. Some Lamproids showed Force-sensitivity and learned to communicate with others using the Force."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lamproids evolved on Florn, a planet notorious for its perils. In fact, the planet was so dangerous that offworlders stood little chance of survival there for any significant length of time without hyperaccelerated nerve implants. Lamproids developed from intestinal parasites that eventually evolved the ability to live outside their hosts. The species became the only species from their homeworld to develop sentience."}, {"tag": "p", "text": "Outsiders from another planet arrived on Florn sometime between 27,500 and 25,127 BBY. These explorers were Tionese, and by 25,096 BBY, Florn—known at the time as \"Tinatorn\"—had been claimed as part of the expanding empire of Xim the Despot, considered a part of a region of the empire known as the Far Indrexu. Despite Xim's death and the dissolution of his empire, Lamproids spread beyond the planet and colonized many worlds. In fact, xenobiologists once believed that the species had no single homeworld and were instead native to several. Members of the species particularly preferred worlds with large tracts of forest or jungle."}, {"tag": "p", "text": "Between 15,000 and 8000 BBY, explorers from the Galactic Republic reached Florn for the first time. Although the world was for a time reckoned as part of Wild Space, it eventually became part of the Pakuuni sector of the Outer Rim Territories. Several centuries prior to 4166 BBY, the Overic Griplink hyperlane connected Florn to the planets Mon Calamari to the east and Quermia to the west, placing the Lamproids in contact with the Mon Calamari and Quarren species native to the former. These connections also brought the Lamproid homeworld into various galactic conflicts, as when, in 3963 BBY, the Mandalorian Neo-Crusaders won a battle there against the forces of the Galactic Republic during the Mandalorian Wars, and when the world fell within territory controlled by Darth Revan during the Jedi Civil War of 3959 to 3956 BBY. The world was considered Galactic Republic territory from 1004 to 1000 BBY, a span of time during the New Sith Wars, and of Separatist Space during the Clone Wars."}, {"tag": "p", "text": "Members of the species largely supported the Alliance to Restore the Republic during the Galactic Civil War, and several Lamproids secretly worked as recruiters for the Rebellion. Despite the Lamproids' Rebel sympathies, Florn became part of Warlord Zsinj's holdings in 7 and 8 ABY, after the Battle of Endor splintered the Galactic Empire into various Imperial Remnant factions. By approximately 25 ABY, the population of the Florn system had reached some 500 million to 1 billion inhabitants. In 137 ABY, it fell within territory controlled by Darth Krayt as part of his Galactic Empire."}, {"tag": "h2", "text": "Lamproids in the galaxy"}, {"tag": "p", "text": "Although they had joined the galactic community as early as the reign of Xim the Despot and spread to many worlds, to most citizens of the galaxy, Lamproids remained little-known and were often mistaken for non-sentient creatures. In 0 ABY, this enabled the Krish big-game hunter Tyro Viveca to capture a mated pair and cage them on his estate on the planet Kabal—despite the fact that Viveca himself knew the Lamproids to be sentient. The hunter killed the male Lamproid and had the being's stuffed body on display in his home. He kept the female in a force cage to be hunted another day, but the conman Cecil Noone freed her after a con gone bad put him on the run from the Krish. The female Lamproid stalked her one-time tormentor and nearly killed him, but Viveca managed to decapitate her with his hunting blaster, sacrificing another trophy to save his own life."}, {"tag": "p", "text": "Some Lamproids became acclimated to galactic-standard technology and society and made their way as spacers or smugglers. For example, a Lamproid was present in a Mos Espa cantina on the planet Tatooine in 32 BBY, and another was at the Mos Espa Grand Arena on that world during the Boonta Eve Classic that same year. Another was a patron of the Black Hole cantina on the planet Kiffex in 30 BBY. In 2 ABY, the Animal Control Division of the Corellian Security Force (CorSec) put out a briefing to mission terminals on Corellia that alleged that the organization had caught a group of Lamproid smugglers trying to stage a live game of dejarik using real creatures. The Lamproids split at the first sign of trouble and freed the beasts. CorSec offered a small reward to anyone willing to exterminate the smuggled animals. Another Lamproid was part of Jabba the Hutt's entourage and at one point traveled aboard Jabba's sail barge, the Khetanna. Bartenders who were familiar with the species offered blood-based cocktails for such customers. Clarified bantha blood was one of these beverages, although other mixes had decidedly murkier origins."}, {"tag": "p", "text": "Dice Ibegon was among the Lamproids to support the Rebel Alliance during the Galactic Civil War. In 0 BBY, she visited the Mos Eisley Cantina on Tatooine to look for likely candidates—and came under brief inspection by the Gotal Feltipern Trevagg, who was looking to hire an assassin to kill co-worker Predne Balu; he discounted the Lamproid when the vibrations she caused in his head cones disquieted him. Ibegon met the Shistavanen Lak Sivrak at the cantina and convinced him to join the Alliance. The two became lovers and fought together in the Battle of Hoth in 3 ABY, but Ibegon died during the Rebel evacuation. Nevertheless, Ibegon had learned Force abilities such as telepathy and time shifting, and she was able to guide Sivrak from the afterlife as a Force ghost so that the two might be together forever in the afterlife."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lamproid species was designed for the cantina sequence of Star Wars: Episode IV A New Hope, released in 1977. The character was a hand puppet created by Rick Baker's special effects team along with the other alien characters who appear in close-ups shot during the film's post-production in Los Angeles, California. Phil Tippett designed the puppet to counterbalance the other cantina denizens, who were primarily human beings with masks. Tippett originally intended for the creature to simulate breathing through its mouth parts. The character was known as the \"drooling arm\" during production due to its ability to emit red slime through an internal tube. In preparation for shooting the close-up featuring the character, Tippett rushed to get the goo tube fitted into the puppet when producer Gary Kurtz questioned the grotesque effect. Nevertheless, director George Lucas approved the blood-like drool but first filmed the scene without it. On another take, Lucas called for the goo, and Tippett's assistant, Laine Liska, worked the mechanism to release it. The slime shot forth more forcefully and spread farther than intended. Lucas ultimately decided against using the effect in the film due to its messiness. The character was also referred to as \"Snake Head\" during shooting, and was later officially dubbed \"Nake.\""}, {"tag": "p", "text": "Nevertheless, in 1995, Judith and Garfield Reeves-Stevens established the species' name as Florn Lamproid and the cantina character as Dice Ibegon in the short story \"One Last Night in the Mos Eisley Cantina: The Tale of the Wolfman and the Lamproid,\" part of the anthology Tales from the Mos Eisley Cantina. Decipher's Star Wars Customizable Card Game 1995 Premiere Limited and 1998 Jabba's Palace Limited card sets, and the 2000 short story \"Fair Prey\" by Daniel Wallace added other tidbits about the species."}, {"tag": "p", "text": "Until 2009, depictions of Lamproids were based on the Dice Ibegon puppet, which had only been sculpted from the neck up. In fact, Decipher even used a production shot of this prop as the basis for its \"Florn Lamproid\" card, adding a member to Jabba's court who was not actually present in Star Wars: Episode VI Return of the Jedi. In 2009, however, Hasbro's Star Wars: The Legacy Collection toy line included a Dice Ibegon action figure. It was the first full-body depiction of a Lamproid and revealed several new details about their anatomy."}, {"tag": "p", "text": "The species' name is alternatively given as Florn Lamproid, simply Lamproid, or both. Some sources do not capitalize the word lamproid."}, {"tag": "p", "text": "Lamproids appear in several non-canonical stories, including three from the Star Wars Tales comic book. In the story \"Hate Leads to Lollipops,\" a Lamproid with a bib is seated at a Coruscant RIB hutt. In \"The Emperor's Court,\" a devoted Dice Ibegon fawns over Lak Sivrak as he gives testimony about who fired first in the Han Solo–Greedo shootout of the original A New Hope and its Special Edition. Dice Ibegon is pictured in Star Wars: The Action Figure Archive, but no information is provided about her or her species. Similarly, a Lamproid makes a cameo in the introduction to Star Wars Tales 23 as a spectator at a pazaak match played by Dark Horse Comics editor Jeremy Barlow. Dice Ibegon appears as a background character in a gag featured in the children's book Darth Vader and Son."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}