{"url": "Lanai", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Avian and airborne sentient species", "Category:Lanais", "Category:Unknown Regions species"], "nodes": [{"tag": "h1", "text": "Lanai"}, {"tag": "p", "text": "Lanais were an avian sentient species who lived on Temple Island on the ocean planet of Ahch-To for thousands of years. The females of the species took on the role of Caretakers and attended to the ancient structures on the sacred island—which was the site of the first Jedi Temple, where Jedi Master Luke Skywalker came to live as a hermit after his Jedi students were killed by his nephew Kylo Ren—while the males were known as the Visitors."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Native to the aquatic planet Ahch-To, Lanais were an avian sentient species who dwelled on Temple Island which held the first Jedi Temple. They evolved from the same evolutionary stock of seabirds, that produced unintelligent porgs and were distinguished by their gray skin and bird-like skinny feet. Innate watershedding ability of their skin, hair and plumage afforded by natural oils allowed Lanais to withstand intense oceans of their planet. They possesed salt glands, that helped to extract sea salt from their food and drink, and extra membranes that enabled sharp underwater vision."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Lanais spoke a non-Basic language of the same name, which was combination of spoken words and hand motions, and were able to communicate with Jedi Master Luke Skywalker during his self-imposed exile on Ahch-To. Written language, which consisted of cuneiform marks based on the shape of their feet, was rare, and fire signals were preferred for long-range communications."}, {"tag": "p", "text": "To keep rhythm during their repetitive chores, their culture was intrinsically musical. Lanai-song was a mix of whistles and guttural oscillations that echo from their village and worksites. The Lanais' technology was solely derived from fish, useful skins and skeletons were gathered during their fishing in bountiful oceans of their homeworld."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "For thousands of years, Lanais inhabited the Temple Island on Ahch-To, and the female Caretakers tended to the ancient structures at the site of the first Jedi temple. After the death of his Jedi students at the hands of his former apprentice and nephew Kylo Ren, the legendary Jedi Master Luke Skywalker came to Ahch-To, home of the Lanais, to live in solitude. The Jedi Master's presence on the island was accepted and tolerated by the Lanais, but when Rey came to the island to be trained by him, the Caretakers found that she disrupted their work. On one occasion, Rey lifted two Lanai using the Force out of frustration before she put them back down."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lanais were created and developed for the 2017 Star Wars saga film Star Wars: Episode VIII The Last Jedi. The Caretakers were first revealed in an article by Entertainment Weekly, released on August 9, 2017."}, {"tag": "p", "text": "Rian Johnson, the writer and director of The Last Jedi, wanted the Lanais to bear resemblance to nunnery in real life. They were designed by Neal Scanlan's crew, and Michael Kaplan made their working costumes which reflected \"a nun-like, spartan sort of existence.\" Johnson also described their language as \"a blubbery sort of Scottish fish talk.\" The creature effects supervisor Neal Scanlan also said that he felt like \"the only creatures that would ever exist on the Ahch-To island were those indigenous to it, where very few other species and DNA would have reached them.\" This led Scanlan to the idea of the Lanais being an extrapolation from the porgs—a sea bird species native to Ahch-To—and having bird-like feet, despite being a further developed race."}, {"tag": "p", "text": "During the film's production, the Lanais were animated with a person inside, one of whom was a friend of Daisy Ridley, the actress who portrays the character Rey in the film."}, {"tag": "p", "text": "During the development of Star Wars: Episode IX The Rise of Skywalker, Lanai were at one point going to appear as a group of assassins on Kijimi."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}