{"url": "Lancer-class_pursuit_craft", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Bounty hunter starships", "Category:MandalMotors products", "Category:Transport classes"], "nodes": [{"tag": "h1", "text": "Lancer-class pursuit craft"}, {"tag": "p", "text": "The Lancer-class pursuit craft, also known as the Lancer Pursuit Craft, was a patrol ship produced by MandalMotors at the behest of the Black Sun crime syndicate. Bounty hunter Asajj Ventress utilized the Lancer-class craft Banshee during the Clone Wars, while hunter Ketsu Onyo flew a Lancer-class vessel, the Shadow Caster, during the reign of the Galactic Empire. Another Lancer-class, the Nebular Kelpie, was seen during the Battle of Exegol, allied with the Resistance."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "Blurring the line between civilian freighter and warship, the Lancer was more interdiction and patrol vessel than workaday cargo hauler. Created on special commission for Black Sun by MandalMotors, the Lancer was designed to chase down fleeing cargo vessels and outrun other patrol ships. The design was based on SoroSuub Corporation light freighters."}, {"tag": "p", "text": "Fast, tough, and able to withstand hard use with irregular maintenance, the Lancer was able to fly, fight, and survive in the most dangerous and remote parts of the galaxy. To accomplish this, they had numerous redundant systems, and were extremely easy to maintain; in addition, they were highly modular, allowing for a broad array of modifications to fit the needs of any user. These qualities made them extremely attractive to smugglers, bounty hunters, and many backwater planets looking for a fast, cheap, and well-armed patrol ship."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Roughly the size of a YT-1300, the Lancer-class had a thin saucer-like main hull reminiscent of many of CEC's more popular ships. A narrow two-position tandem cockpit protrudes from the saucer's leading edge, and seated a pilot and co-pilot in cramped but well laid-out surroundings. This arrangement could be modified for a single pilot's chair."}, {"tag": "p", "text": "A bank of powerful sublight engines mounted aft provided primary thrust, while high performance ion engines mounted on sponsons midships provide additional straight line speed - enough to run down nearly anything in its class. While not as agile as a starfighter, the Lancer's speed and narrow silhouette made it a difficult target to track and hit in the heat of battle. The ship's primary armament was comparatively light, but a state of the art fire control system - the MK.IV Fire Control System - made them incredibly potent. Beyond this, the craft held a number of hard points for customization, allowing for upgrades and improvements to its systems and weapons."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Ships of this class were deployed during the Clone Wars, most notably by Asajj Ventress who used the Banshee during her time as a bounty hunter."}, {"tag": "p", "text": "Years later, the bounty hunter Ketsu Onyo used the Shadow Caster to aid the Phoenix rebel cell. During the First Order/Resistance War, the Salathera was used by Tara Rashin of the Guavian Death Gang to attack and board a cargo vessel ferrying parts to the Droid Depot. Another ship named the Nebular Kelpie, was used by a young Shungbeek named Kid Malmash to help fugitives of the war to safe zones, then later the ship was seen battling on the planet of Exegol, during the battle of Exegol between the Resistance and the Sith Eternal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lancer-class pursuit craft first appeared in the form of the Banshee, which was shown at Celebration Anaheim during \"The Untold Clone Wars Panel.\" Originally set to appear in unfinished episodes of Star Wars: The Clone Wars, the episodes were adapted into a novel written by Christie Golden entitled Dark Disciple after the show's cancellation. Concept art of the Banshee, based off Doug Chiang's work on the Republic gunship, was shown during the panel. The final model was revamped into the Shadow Caster, featured in the episode \"Blood Sisters\" of Star Wars Rebels. The production asset for the Banshee was released in the episode's trivia section on Starwars.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}