{"url": "Ar%27alani", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Admirals and generals", "Category:Chiss", "Category:Chiss Expansionary Defense Force officers", "Category:Females", "Category:Irizi family"], "nodes": [{"tag": "h1", "text": "Ar'alani"}, {"tag": "p", "text": "Ar'alani, born as Irizi'ar'alani and also known by the core name Ziara, was a Chiss female admiral who served in the Expansionary Defense Fleet of the Chiss Ascendancy during the reign of the Galactic Empire. She was once a member of the Irizi family—one of the Nine Ruling Families that controlled the Ascendancy. The Vigilant, a Nightdragon man-of-war, served as her command ship during and shortly after the Clone Wars. Later in the Imperial period, her command ship was the Chiss heavy cruiser Steadfast."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "While she was a cadet, Ziara helped Thrawn clear his name when he was accused of cheating. They would later become close friends. At one point, Irizi'ar'alani was a blood of the Irizi family, and was known by her core name of Ziara. When she was promoted within the Expansionary Defense Fleet, she was no longer considered a part of any family, and became known as Ar'alani."}, {"tag": "p", "text": "Ar'alani became the temporary caregiver of Che'ri while her \"Momish\", Thalias, was on a mission with Thrawn."}, {"tag": "p", "text": "By time of the Galactic Empire's reign, Ar'alani served as an Admiral in the Chiss Ascendancy Expansionary Defense Fleet."}, {"tag": "p", "text": "Shortly after the Battle of Batonn, Commander Eli Vanto of the Imperial Navy, defected to the Ascendancy under the guidance of Grand Admiral Mitth'raw'nuruodo. Journeying into the Unknown Regions, Vanto came across Ar'alani's ship, the Steadfast, and informed the admiral that he had been sent by Thrawn to aid the Ascendancy. Ar'alani allowed the former Imperial officer to join her ship's crew and assigned him to data analysis."}, {"tag": "p", "text": "Following Thrawn and Darth Vader's rescue of Force-sensitive Chiss girls from the Grysks, Ar'alani informed Thrawn that she would return the children to their families. Ar'alani also promised to bolster the defenses of the colony world from which the children were taken."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Unlike Thrawn, Ar'alani saw personhood in non-Chiss individuals before seeing them as potential assets."}, {"tag": "p", "text": "She was a very devoted officer that cared about the prestige and efficiency of the Chiss Expansionary Defense Fleet. She was known to refer to her officer subordinates by their names and it was noted that she took special effort to learn them. Her tactical genius caught not only the attention of the higher-ups, but also that of Thrawn’s, who at one point professed that she had an eminently tactical mind. She was confident in her tactics but was not opposed to outside opinions and realized the importance of different perspectives when it came to analyzing situations.[source?]"}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Ar'alani was a master tactician. She was very patient, known to wait for days or even weeks for the right time to take action. She was fluent in the Chiss primary language Cheunh, as well as the trade languages Meese Caulf, Minnisiat, and Sy Bisti."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ar'alani first appeared in canon in the 2017 novel Thrawn and was first pictured in the sixth and final issue of the comic series Star Wars: Thrawn, the adaptation of the book which was released in 2018. Before that, Ar'alani appeared in Star Wars Legends, in the 2006 novel Outbound Flight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}