{"url": "Ar%27alani/Legends", "categories": ["Category:Legends articles", "Category:Admirals and generals", "Category:Chiss", "Category:Chiss Expansionary Defense Force officers", "Category:Females"], "nodes": [{"tag": "h1", "text": "Ar'alani"}, {"tag": "p", "text": "Ar'alani was a female Chiss Admiral, a member of the Defense Hierarchy of the Chiss Defense Fleet, which served as the high command of the entire Chiss Expansionary Defense Force. Ar'alani, as a member of the Hierarchy, had been obliged to resign her status in one of the Ruling Families, and to devote herself entirely to the military. In contrast to the black uniforms with flashes in Family colors that were the normal dress of Chiss military personnel, she wore a pure white uniform."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Shortly before 27 BBY, Ar'alani commanded the force that defeated a scouting party of Yuuzhan Vong. Shortly afterward, she arrived at Crustai to intervene in the actions of Commander Mitth'raw'nuruodo against the Vagaari, and to investigate the appearance of the Human smugglers Dubrak Qennto, Maris Ferasi and Jorj Car'das. The Chiss were concerned that the Galactic Republic and the Yuuzhan Vong might be in league and coordinating attacks against the Chiss Ascendancy."}, {"tag": "p", "text": "Despite her frequent clashes with Thrawn over the morality of his tactics, her duplicitous aid enabled the Force Commander to lure the Vagaari into a trap. After Mitth'raw'nuruodo successfully captured a Vagaari 'treasure' ship, she backed him in opposing the Chaf family, who sought the spoils of war for their own ends. Syndic Mitth'ras'safis 'requested' her to look into the activities of Thrawn after the apparent loss of the Whirlwind, yet she covertly allied herself with Thrawn again, lying to various members of the CEDF about Jorj Car'das when she 'forgave' Thrawn for allowing the 'spy' to escape. In this instance her concern for the safety of the Chiss overrode the strict codes of war forbidding preemptive strikes, as Car'das's escape was a lure designed by Thrawn for the purpose of capturing both the Vagaari and Outbound Flight Project. Ar'alani was even actively involved in the next phase of the operation; liberating the Geroon home world. While this may have been an entirely innocent gesture on her part, this is doubtful, as her absence allowed Thrawn to provide data on the Vong to Kinman Doriana, in exchange for his loyalty and assistance in eliminating the Vagaari and the Outbound Flight."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}