{"url": "Lando_-_Double_or_Nothing_4", "categories": ["Category:Real-world articles", "Category:Star Wars: Lando - Double or Nothing"], "nodes": [{"tag": "h1", "text": "Lando - Double or Nothing 4"}, {"tag": "p", "text": "Lando - Double or Nothing 4 is the fourth, penultimate issue of the canon comic book miniseries Star Wars: Lando - Double or Nothing. It was written by Rodney Barnes, illustrated by Paolo Villanelli, and published on August 29, 2018 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "THE GALAXY'S MOST DEBONAIR ROGUE! Having been freed from BATALLA and his warrior clan, LANDO now faces a host of new obstacles. Will he get past the STORMTROOPERS, find RYTHUS and get the arms to him and his people? Is all of this possible while wearing a cape? Will his mustache start a grooming trend? All will be answered in this issue!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Locating Kristiss"}, {"tag": "p", "text": "TIE fighters were chasing the Millennium Falcon through the Wastelands Of Kullgroon. Lando Calrissian who was piloting the Falcon with his droid companion L3-37, decided to take the daring risk of flying through a canyon. The ship took a lot of damage but managed to lose the TIE fighters and get through the canyon. As Lando landed the ship, L3 told him that there was a sewage expulsion port nearby and sarcastically suggested that Lando go investigate the sewers \"capeless.\""}, {"tag": "p", "text": "Lando was walking through a cave he was cornered by a small but large numbered, spider-like creatures. Lando killed many of the spiders but was met by a very large one. But Lando got passed the spider and jammed the door, giving him enough time to locate Kristiss. He located Kristiss on level seven of the Imperial outpost of Kullgroon and asked L3 to hack into the mainframe and kill the security monitors."}, {"tag": "h3", "text": "Planning the revolt"}, {"tag": "p", "text": "At the droid factory on Kullgroon, Kristiss was being forced to work on droids alongside her father, Rythus. She was then hit with a small object causing her to turn her head. Lando was sitting behind her but hidden away from the guards. Rythus did not like Lando at first but came around to him. But Lando was infuriated when he learned that the Petrusians are peaceful and would not go to war. Kristiss and Rythus hoped that their people would listen to Lando and get a different point of view."}, {"tag": "p", "text": "Lando then got up on a table and gave a speech about how he didn't run when that partner of Dawinian showed up whom he was sleeping with. While no one said anything at first, Kristiss hollered her support which caused everyone else to show support too. Calrissian took a third of the Petrusians to go collect the weapons from the Millennium Falcon while the rest stayed back to work the lines."}, {"tag": "h3", "text": "The revolt begins"}, {"tag": "p", "text": "At the sewers, Lando and his group of Pestrusians fought through hordes of the spider-like creatures with tools used as melee weapons. Although the creatures could easily be destroyed, they could assemble themselves again. The Falcon came by and Lando hoped on to grab a new communicator and cape from L3-37."}, {"tag": "p", "text": "Soon after the stormtrooper transfer began to happen, Kristiss told Lando over the communicator that she and her group were ready. Lando and his group of newly armed Pestrusians took to their positions. A few of them followed him as they made their way to Kristiss and when he reached Kristiss, who was next to two other stormtroopers he shouted that now was the time for Pestrusian freedom."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}