{"url": "Lando_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Lando"], "nodes": [{"tag": "h1", "text": "Lando 5"}, {"tag": "p", "text": "Lando 5 is the fifth and final issue of the Marvel Comics Star Wars comic book miniseries Star Wars: Lando.  It was written by Charles Soule, pencilled by Alex Maleev, and published on October 7, 2015."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Chanath Cha tells Lando Calrissian that she is planning to blow up the Emperor Palpatine's luxury yacht Imperialis per his orders. The Ugnaught Korin Pers, a former Sava specializing in ancient cultures, protests that the objects aboard are priceless. Chanath responds that her mission was to find the thieves who stole his ship and bring them to the Emperor. When Calrissian suggests a Plan C, Chanath points the gun at him and tells Lando that plans can get people killed. Lando tries to shift responsibility onto the rogue Aleksin but Chanath disagrees."}, {"tag": "p", "text": "After some discussion, Lando and Chanath reach a compromise agreement. Chanath will destroy the Imperialis but she will help Lando and Korin escape aboard her ship Scimitar. Chanath reluctantly agrees to take her wounded former lover Lobot, who was stabbed in the gut by an Emperor's Royal Guard. Before they can proceed, Aleksin and Pavol, who have been corrupted by the dark side of the Force, demand that Lando and his companions leave the ship or die. Knowing that Korin is a seeker, Aleksin tries to entice him with the mask."}, {"tag": "p", "text": "Overcome by her desire for knowledge, Korin takes the Sith mask from Aleksin. Corrupted by the dark side, she decides to join Aleksin and Pavol in taking the treasure for themselves killing the others. However, Aleksin kills Korin with his double-bladed lightsaber out of jealousy. Chanath saves Lando and herself by shooting the corridors shut. Chanath then activates the ship's auto-destruct sequence and tells Lando to fetch Lobot out of the medbay. Lando manages to evacuate Lobot from the bacta tank but find their path blocked by Aleksin."}, {"tag": "p", "text": "Meanwhile, Chanath tells O-66 to bring the Scimitar to dock with the Imperialis. However, O-66, who has reattached his arms, replies that his prime directive was to protect and honor the Scimitar. When Chanath threatens to ignite her pulse bomb, O-66 replies that he deactivated the bomb and mocked her for telling him about it. He then flies the ship away, leaving Chanath to die. Chanath is ambushed by a lightsaber-wielding Pavol. However, Chanath reveals that she can fight with knives and prepares to fight him."}, {"tag": "p", "text": "Elsewhere, Lando tries to reason with Aleksin to share the ship with him. He promises to get Chanath to deactivate the self-destruct mechanism. Chanath deactivates his double-bladed lightsaber but Lando shoots him in the chest with his blaster. As they move through the corridor, Lando admits that he made up the claim that he hated blasters. Lobot starts to struggle against the implants. They soon discover that Chanath has killed Pavol. Chanath breaks the bad news but Lobot connects his AJ^6 cyborg construct to the ship's interface and overrides the self-destruction mechanism code."}, {"tag": "p", "text": "Despite struggling with his implants, Lobot manages to overturn the self-destruct mechanism. However, the implants have taken over his mind. Lando and Lobot enter an escape pod. They try to convince Chanath to come with them by appealing to her feelings for Lobot. Chanath tells him that she has moved on. Lando promises to find a way to cure Lobot, which activates a final message Lobot recorded for Lando on his implant before losing control of his mind. The message tells Lando not to worry because he has beaten bigger odds and reassures him that Lobot is not angry about what has happened to him and that he lives by his own choices. It then tells Lando to stop playing and find something to believe in other than himself - to use his luck and charm to do something good, knowing that his old buddy can be a better person. As the escape pod flies into space, leaving the exploding Imperialis in the distance."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}