{"url": "Lando_-_Double_or_Nothing_5", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: Lando - Double or Nothing"], "nodes": [{"tag": "h1", "text": "Lando - Double or Nothing 5"}, {"tag": "p", "text": "Lando - Double or Nothing 5 is the fifth and final issue of the canon comic book miniseries Star Wars: Lando - Double or Nothing. It was written by Rodney Barnes, illustrated by Paolo Villanelli, and published on September 19, 2018 by Marvel Comics."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "LANDO'S made his way to an ambivalent Pretusian [sic] slave force. But can he convince them to stand up against the STORMTROOPERS who now are lower in number? Will ELLTHREE temper her passions in the face of massive droid abuses? Will Lando find a good card game and say \"to hell with it all\"?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "Lando leads the revolt"}, {"tag": "p", "text": "At the Imperial outpost of Kullgroon, stormtroopers were shooting at the rebelling Petrusians after Lando Calrissian called for them to revolt against the occupying Imperial forces. Lando took out many stormtroopers with the help of Kristiss and her people. They won the fire fight but lost a lot of lives in the process."}, {"tag": "p", "text": "At the Wastelands Of Kullgroon, the Millennium Falcon was docked on the ground. Overhead, TIE Brutes flew passed the ship and on their way to the revolt. L3-37 quickly contacted Lando about the incoming threat. Lando and Kristiss's father Rythus were pinned down as more stormtroopers came into the outpost. Lando was unconvinced that they would come out alive. Rythus tried to inspire Lando into fighting for the cause but he looked up to Kristiss and called her name. Kristiss kicked a stormtrooper off the balcony she went over to a monitor. Rythus told Lando that they did not fix the droids to what was told of them but instead, the Pestrusians prepared the droid to rise up and revolt. Using the monitor, Kristiss commanded the droids to rise up. Hundreds of broken down droids made their way to the outpost."}, {"tag": "h3", "text": "Droid rebellion"}, {"tag": "p", "text": "The droids sprung a surprise attack in the stormtroopers. Rythus told Lando they have to get to the rendezvous spot as the droids and the Pestrusians continued to attack the stormtroopers. Lando was angry with Rythus, telling him that he was the leader of the mission or the \"captain.\" An annoyed Rythus ignored Lando."}, {"tag": "p", "text": "L3 flew in with the Millennium Falcon to help the droid uprising. She shot down multiple enemy craft and left the Falcon. She climbed to the top of a hill and raised her arm with her blaster. Below her the droids were making a stand against the limited amount of stormtroopers. Back inside the outpost, a number of stormtroopers left to go deal with the droids outside. This gave the rebelling Pestrusians the chance to break through and get out of the outpost. Lando noticed that Kristiss got shot up on the balcony. He killed the stormtroopers that shot her and went over to aid her. It was a non fatal wound but as she was getting up a stormtrooper threw a thermal detonator but the explosion just barely missed them. Kristiss took Lando's blaster pistol and shot a long rope loose. She and Lando grabbed onto the rope and swung across the outpost and over the stormtroopers."}, {"tag": "h3", "text": "A successful revolt"}, {"tag": "p", "text": "Rythus told them that they have to reach their rendezvous point and separated from Lando and L3. Lando and L3 disposed of the surrounding stormtroopers and made their way to the Millennium Falcon. But the Falcon was taken over by stormtroopers. L3-37 talked Lando out of attacking the stormtroopers and they made their way over to the rest of the group. A Imperial shuttle landed down on the ground next to them. Kristiss' group had hijacked the shuttle and were using it so the Petrusians could escape on it. Lando reluctantly boarded the ship with them."}, {"tag": "p", "text": "Later on, L3 informed Lando that she had found the ship's location to be Vandor. Kristiss agreed to drop Lando off there but before he was given a box that contained the credits he earned from the job."}, {"tag": "p", "text": "A week later Lando was on Vandor, standing over a cliff the was overlooking the Falcon. He promised to get her back, but he wanted to settle down for a little bit. He suggested he play a few games of sabacc and pay off his debts to Brushaun. L3 agreed with him and he went to go play sabacc."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}