{"url": "Lando_Calrissian,_Junior", "categories": ["Category:Legends articles", "Category:Calrissian family", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lando Calrissian, Junior"}, {"tag": "p", "text": "Lando Calrissian, Junior, nicknamed Chance, was a Human male born around 41 ABY to Tendra Risant Calrissian and Lando Calrissian, Senior. The curly-haired child was nicknamed Chance and was adored by his father, who, along with his wife, brought up their son in a life of affluence. The Calrissians owned eight homes, and Calrissian Junior was with them on Lujo when their friends the Solos visited them in 43 ABY. He was also with them on Kessel later in the year when groundquakes were threatening a mining operation they owned, and the entire family attended the wedding of Jagged Fel and Jaina Solo one year later."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lando Calrissian, Junior was a Human male, the son of Lando Calrissian, Senior and Tendra Risant Calrissian. Calrissian Senior first learned of his wife's pregnancy while on the planet Kashyyyk late in the year 40 ABY. Already over seventy years old, he was shaken by the news, believing simultaneously that he was both too old and not yet ready to be a father. His friends Han and Leia Organa Solo reassured him, however, pointing out that the wealthy couple would spoil their child and would be the parents that everyone dreamed of having. Feeling better about the situation, Calrissian told his friends he would likely comm them for parenting advice, and he left Kashyyyk to be with his wife."}, {"tag": "p", "text": "In 43 ABY, Lando Calrissian, Junior was a curly-haired infant who greatly resembled his father. Nicknamed Chance, he was adored by Calrissian Senior, who called his son his lucky star. The Calrissian family owned eight homes, including one on Kuat, and when the Solos visited them at their seaside residence on Lujo, Calrissian Junior was greeted by their granddaughter Allana. He shyly showed her his Perystal doll, a dragon from the holovid program Castle Creep, before retreating to the comfort of his father. The entire group then went sailing on the Calrissians' catamaran Windchaser."}, {"tag": "p", "text": "Later in the year, Calrissian Senior invited the Solos to Kessel to help him investigate groundquakes that were threatening his mining operation on the rocky world. After their arrival, Calrissian Junior played with Allana under the watchful eye of his nanny droid, Nanna, as well as the Solos' droids C-3PO and R2-D2, in a chamber adjacent to the conference room where the adults sat and discussed their problem. Nanna later put him down for a nap, and when he woke up, he joined Allana in the cafeteria, where he was confused that the Solos had not yet returned. They had in fact been trapped in the mines behind walls of rock, but the senior Calrissians were later able to locate them while their son ate breakfast with Allana."}, {"tag": "p", "text": "With the help of some old friends, the Calrissians and Solos sucessfully stabilized the Great Kessel Fault. The entire Calrissian family attended the wedding of the Solos' daughter Jaina to Imperial Head of State Jagged Fel one year later aboard the Hapan Battle Dragon Dragon Queen II."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As an infant, Lando Calrissian, Junior had curly hair and looked to be all but a clone of his father, who was very fond of his son and brought him up in wealth and luxury. When the criminal Craitheus Qreph offered to purchase one of Calrissian Senior's asteroid refineries and made what Calrissian perceived to be a veiled threat to his wife and son's safety, the famous gambler's face outwardly displayed fear."}, {"tag": "p", "text": "Nicknamed Chance, the young Calrissian watched the holovid program Castle Creep and played with dolls from the show. He enjoyed showing them off but was too shy to speak more than a handful of sentences about them to Allana Solo, preferring the safety of his father's legs. He was more comfortable with her a few months later, bombarding her with questions about her grandparents—whom he thought of as Aunt Leia and Uncle Han—while he rhythmically kicked the underside of a table. When he ate breakfast with Allana, Calrissian Junior played with his food."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lando Calrissian first discovers his wife's pregnancy in the 2007 novel Fury, written by Aaron Allston. The Essential Reader's Companion dates the book to the very end of 40 ABY, but when Calrissian Junior first appears in James Luceno's Millennium Falcon novel, set in early-to-mid 43 ABY, he is said to already be three years old."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}