{"url": "Lando_Calrissian_and_the_Mindharp_of_Sharu", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The Lando Calrissian Adventures"], "nodes": [{"tag": "h1", "text": "Lando Calrissian and the Mindharp of Sharu"}, {"tag": "p", "text": "Lando Calrissian and the Mindharp of Sharu is a Star Wars Legends novel written by L. Neil Smith. It is the first volume of the Star Wars: The Lando Calrissian Adventures series, and it was first published in paperback by Del Rey on June 12, 1983. The complete series was compiled in The Lando Calrissian Adventures (1994)."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Gambler, rogue, and con-artiste, Lando Calrissian was born with a well-developed taste for the good life. More comfortable at the dealer's end of a fast shuffle than at the rear end of a blaster, Lando always had his sensors scanning for the chance to pick up easy credits."}, {"tag": "p", "text": "So when he heard that the planets of the Rafa System were practically buried in ancient alien treasure, he hopped aboard the Millennium Falcon and brushed up on his rusty astrogation. He never stopped to think that someone might be conning the con man…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Not long after winning the Millennium Falcon, Lando Calrissian visits the Oseon system in the Centrality. In a sabacc game on the asteroid Oseon 2795, Lando meets the Ottdefa Osuno Whett, who tells him of the supposed treasure of the Rafa system, one-time home of a highly advanced race called the Sharu—and also source of the extremely valuable life-crystals, which are harvested at a penal colony on Rafa IV. Running short of credits, Whett persuades Lando to let him put up a droid as a gambling stake. When Lando wins the hand, he discovers that the droid is actually in storage on Rafa IV."}, {"tag": "p", "text": "Hoping to claim his prize long enough to resell it, Lando travels to Rafa IV and picks up the Class Two multiphasic robot, a chrome-plated, five-tentacled droid called Vuffi Raa. He is subsequently waylaid by the local police force and beaten and arrested on trumped-up charges. Brought before the system's governor, Duttes Mer, and Mer's sinister associate, Rokur Gepta (a Sorcerer of Tund), Lando is railroaded into searching for a legendary artifact called the Mindharp. He is given the Key, a miniature version of the Mindharp, and set free, although Mer and Gepta disable the Falcon's hyperdrive to insure that Lando does not attempt to renege on their deal."}, {"tag": "p", "text": "Lando and Vuffi Raa soon encounter an old man named Mohs, one of the Toka (the Rafa system's primitive, apparently servile humanoid population). Mohs, who identifies himself as the High Singer of the Toka, tells them that he believes Lando is the Key Bearer and Vuffi Raa the Emissary described by Toka legend. He convinces them to travel to Rafa V, the next planet in the system, to find the Mindharp. Unfortunately for Lando and the droid, Mohs leads them into a trap. On Rafa V, the pair are waylaid by a group of Toka armed with primitive weapons, who nearly destroy Vuffi Raa and leave Lando to die of exposure."}, {"tag": "p", "text": "Lando manages to free himself and rejoin Vuffi Raa, whose self-repair systems have enabled him to survive the damage inflicted on him. Overcoming a group of Rafan policemen sent by Mer to waylay them (in the hopes that Lando had already succeeded in his mission), Lando and Vuffi Raa patch their wounds and set out to find Mohs. The Toka Singer, unexpectedly contrite for his earlier betrayal, leads them to the base of one of the Sharu's massive pyramids and shows them how to use the Key to enter it."}, {"tag": "p", "text": "Separated, Lando, Vuffi Raa, and Mohs make a disorienting journey into the interior of the pyramid, which seems to have the ability to warp both space and time. Mohs undergoes an epiphany—his previously stunted mental capacity begins to expand, but he is mysteriously blinded at the same time. Lando and Vuffi Raa, meanwhile, appear to be wildly different sizes, experiencing time at different rates. After observing a tableau of the planet's evolutionary time scale and the development of the Sharu themselves, Mohs disappears, and Lando and Vuffi Raa find themselves in a vast hall containing the Mindharp."}, {"tag": "p", "text": "Lando takes the Mindharp, and he and Vuffi Raa exit the pyramid, only to find themselves back on a street in Teguta Lusat, the capital of Rafa IV, with no evidence of how they got there. Vuffi Raa, responding to previously established programming, immediately has Lando arrested and brought before Duttes Mer. The governor informs them that they have been gone not for a few days, but for four full months. Mer tells Lando that everything that brought him to Rafa in the first place, including his encounter with Osuno Whett in the Oseon, had been a set-up; Mer and Gepta needed someone who would fit the description of the Toka prophecy. The Mindharp, Mer explains, is an enormously powerful device capable of controlling every sentient mind in the Rafa system, even across interplanetary space."}, {"tag": "p", "text": "Having achieved his goal, the governor has Lando sent to one of the Rafa system's life-crystal orchards for what is likely to be a very brief life sentence. Lando is rescued, however, by Vuffi Raa, now free of his programmed imperative, and rather guilt-stricken at having betrayed his master. Lando tells the droid that he realizes he recognized some of the Toka language as Old High Trammic, a language with which he has some familiarity. He realizes that there are going to be serious consequences if Mer attempts to use the Mindharp."}, {"tag": "p", "text": "Rafa IV is wracked by a series of violent earthquakes. Lando and Vuffi Raa make their way to the Teguta Lusat spaceport, where they find that the governor has retrieved the Millennium Falcon from Rafa V. Rokur Gepta, meanwhile, leaves his cruiser, the Wennis (which has been in orbit around Rafa V, awaiting Lando's return, for months), desperate to take the Mindharp from Mer before the governor causes a disaster."}, {"tag": "p", "text": "Lando and Vuffi Raa encounter Mohs aboard the Falcon. The Singer, whose intellect is no longer that of a primitive man, Mohs confesses what he has now learned: the primitive Toka are themselves the long-vanished Sharu. Generations earlier, the Sharu were threatened by some unknown external menace; to hide from it, they deliberately concealed their cities (and indeed, the minds of their entire population) beneath the massive pyramids that cover most of the Rafa system. The activation of the Mindharp will reverse the process, causing the Sharu cities to emerge from beneath the surface—with catastrophic results for the Imperial cities built over them—and the minds of the \"Toka\" will be restored."}, {"tag": "p", "text": "Rokur Gepta reaches the governor's office too late to stop Mer from activating the Mindharp. Mer is obliterated by the unleashed energy, and Gepta himself only narrowly escapes. Although his ship is hit by a burst from the Millennium Falcon's guns, Gepta survives, swearing revenge on Lando and his mechanical partner."}, {"tag": "p", "text": "Lando and Vuffi Raa, meanwhile, make a hasty escape from the Rafa system, carrying the last load of valuable life-crystals that will ever be harvested there."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The 1998 CD-ROM Star Wars: Behind the Magic originally dated the events of Star Wars: The Lando Calrissian Adventures to 10 BBY, while the 2000 reference book The Essential Chronology and the subsequent 2005 The New Essential Chronology placed the events in 4 BBY. Ultimately, the 2012 book The Essential Reader's Companion dated the series to 3 BBY–2 BBY, placing Lando Calrissian and the Mindharp of Sharu between the novels The Force Unleashed II (2010) and Lando Calrissian and the Flamewind of Oseon (1983)."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}