{"url": "Lando_Calrissian_and_the_Flamewind_of_Oseon", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Star Wars: The Lando Calrissian Adventures"], "nodes": [{"tag": "h1", "text": "Lando Calrissian and the Flamewind of Oseon"}, {"tag": "p", "text": "Lando Calrissian and the Flamewind of Oseon is a Star Wars Legends novel written by L. Neil Smith. It is the second volume of the Star Wars: The Lando Calrissian Adventures series, following The Mindharp of Sharu and preceding The Starcave of ThonBoka. It was first published in paperback by Del Rey on September 12, 1983, and the complete series was later compiled in The Lando Calrissian Adventures (1994)."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A solar system with little more than luxury hotels catering to the underemployed filthy-rich, the Oseon was every gambler's dream come true. And so it was for Lando Calrissian, gambler, rogue, and con-artiste. Until he broke the gambler's cardinal rule: never beat a cop at high-stake games of chance."}, {"tag": "p", "text": "Soon Lando and his feckless five-armed robot companion were being stalked by two enemies—one they knew but could not see, and one they saw but did not recognize…until it was too late."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following their adventures in the Rafa system, Lando Calrissian and his droid companion, Vuffi Raa, lift off from Rafa IV with a hold full of valuable life-crystals. After the sale of the crystals and with a decent stake, Lando decides to attempt the honest occupation of freelance freighter captain. Not counting the difficult issues of filling out landing-permit forms, going over bills of lading, and figuring overhead and profit margins, plus a nearly fatal pirate attack, Calrissian yearns to practice his original profession again. So, while on Dilonexa XXIII after a failed delivery, he jumps at the chance when he receives an invitation from Lob Doluff, Administrator Senior of the Oseon system, to play sabacc in the credit-rich asteroid belt. As an added pleasure, he will be arriving just prior to the seasonal event known as Flamewind. Unbeknownst to Lando and Vuffi Raa, Rokur Gepta is also making his way to the Oseon in an attempt to exact revenge on Calrissian for his treachery in the Rafa system."}, {"tag": "p", "text": "As the pair make their way to Oseon 6845, the Millennium Falcon experiences a bit of misfortune. An explosion rocks the underside of the starship, and it is discovered that a bomb was placed there on their previous stop on Dilonexa. After repairing the damage, the crew make a safe planetfall in the Oseon. Vuffi Raa discovers a second explosive device on the ship shortly after touchdown, alertly defusing it and averting disaster. During a particularly lucrative turn at the gaming table, Calrissian receives word that his ship is on fire. When Lando reaches the space terminal, he realizes there is nothing wrong with the Falcon. As he turns to leave, he is set upon by an unknown assailant. After a brief struggle, Lando dispatches his attacker using his concealed stingbeam. Lando Calrissian starts to believe that someone or something is out to get them. Thinking his actions an act of self-defense and fearing no punishment, he promptly reports the incident. Doluff and his peacekeeper assistant, Bassi Vobah, agree with the charge of self-defense, but the Oseon system has a strict no-weapons statute, punishable by death."}, {"tag": "p", "text": "Requiring the service of an independent pilot, Lob Doluff offers Lando Calrissian a deal as an alternative to execution. It has been discovered that Bohhuah Mutdah, an extremely wealthy inhabitant of the Oseon, received an illegal shipment of lesai every season during Flamewind, when it was forbidden to travel within the system. The radiation that accompanied Flamewind was a detriment to navigation and life support systems. Nevertheless, Lando is to act as the supplier and transport Bassi Vobah, along with Imperial narcotics agent, Waywa Fybot, to Oseon 5792. After the deal is made, the two law-enforcement officers will arrest Mutdah, and Lando will be free to depart the Oseon with all his belongings, including his winnings."}, {"tag": "p", "text": "During the trip from the sixth to fifth belt, the crew of the Millennium Falcon and her passengers are set upon by a ragged squadron of two dozen starfighters. With some respectable flying, Calrissian evades the bandits, dispatching a pair of them. Finding a crevasse on an unpopulated asteroid, Lando and Vuffi Raa set down to effect repairs and strengthen the Falcon's shields. Unfortunately, the fighters discover the crevasse in their search for the starship. Employing a tactic which detonates part of the rock, Lando Calrissian destroys all but five attacking fighters. They retreat, and the Millennium Falcon continues its journey to 5792."}, {"tag": "p", "text": "The four adventurers make an uneventful landing on Oseon 5742, where Calrissian is promptly escorted, with his vacuum-wrapped parcel, to Bohhuah Mutdah. Shortly after introductions are made, Vobah and Fybot burst in and attempt to arrest Mutdah. The narcotics agent promptly eliminates his colleague to shelter the entrepreneur. It is soon discovered that Waywa Fybot is in league with Mutdah, who promised the avian a discharge from his duties in exchange for protection. To Lando's confusion, Bohhuah Mutdah shoots and kills the Quor'sav, and his obese form is immediately transformed into that of Rokur Gepta. Things are finally beginning to make sense. During a session of torture by chagrin, Calrissian discovers it was Gepta who made his life as a tramp freighter captain difficult. Raising rates, lowering resale prices, and even arranging the harassment and death of Bohhuah Mutdah—and his subsequent replacement—was part of Gepta's scheme. Apparently, the vengeance of Rokur Gepta knew no bounds."}, {"tag": "p", "text": "As Gepta prepares Calrissian for another round of torture, the habitation dome of Bohhuah Mutdah is compromised by a strafing run by the five remaining fighter-craft Lando previously encountered. While the Sorcerer of Tund is distracted by the attack, the gambler makes quick his escape and works his way back to the spaceport to raise ship. Manning the Falcon's quad-guns with Vuffi Raa at the controls, Lando engages the enemy. The pair finish off three and scatter the last two. Seeing that one of the fighters was disabled and adrift, the droid suggests a rescue of the pilot. As the aged soldier is brought on board, it is discovered that he is Klyn Shanga, a Renatasian and the flight leader of the squadron who accused the droid of being the destroyer of their Renatasia III. After pleading his case, and in an effort to exhibit clemency, Vuffi Raa suggests that he and Lando allocate a portion of the profit from their recent exploits to Renatasia. In true rogue fashion, Lando responds by trussing up his prisoner, replying, \"…forget it. I'm going to enjoy being rich.\""}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}