{"url": "Language/Legends", "categories": ["Category:Legends articles", "Category:Articles which may contain original research", "Category:Articles needing additional sources", "Category:Languages"], "nodes": [{"tag": "h1", "text": "Language"}, {"tag": "p", "text": "There were a number of languages throughout the galaxy, of which the most common was Galactic Basic. It was not uncommon for beings to speak at least two languages in addition to their native tongue, particularly among those involved in space-faring occupations and those who had attended military or educational academies. For a comprehensive list of languages, see the category languages linked to at the bottom of the page."}, {"tag": "h2", "text": "Common languages"}, {"tag": "h3", "text": "Galactic Basic Standard"}, {"tag": "p", "text": "Galactic Basic Standard, also known as Galactic Standard, was a constructed language, inspired largely by the languages of the various founding species of the Galactic Republic: the Humans, the Duros, and the Bothans. It was the lingua franca of the galaxy, and almost all Humans spoke it instead of their historical language."}, {"tag": "p", "text": "Galactic Basic used the Aurebesh script."}, {"tag": "p", "text": "Some aliens had difficulty speaking Basic, often due to the structure of their vocal cords or analogous organ."}, {"tag": "h3", "text": "Binary"}, {"tag": "p", "text": "Binary, or Droidspeak, was a language of beeps, trills, and whistles spoken primarily by astromech droids such as R2-D2. It was also spoken by other models of droid. Organic beings who spent a lot of time with droids could often pick up a basic understanding as well."}, {"tag": "h3", "text": "Bocce"}, {"tag": "p", "text": "Bocce was an artificial language used by spacers. It was composed of elements from several languages."}, {"tag": "h3", "text": "Bothese"}, {"tag": "p", "text": "Bothese was the language of the Bothan species, natives of the planet Bothawui, and barthalemeu."}, {"tag": "h3", "text": "Catharese"}, {"tag": "p", "text": "Catharese was the language spoken by the Cathar Species, natives of the Cathar Planet."}, {"tag": "h3", "text": "Cheunh"}, {"tag": "p", "text": "Cheunh was the language of the Chiss species, a dominant force in the Unknown Regions."}, {"tag": "h3", "text": "Dosh"}, {"tag": "p", "text": "Dosh was the language of the Trandoshan species, natives of the planet Trandosha."}, {"tag": "h3", "text": "Dug language"}, {"tag": "p", "text": "Dug was the language of the Dug species, natives to the planet Malastare."}, {"tag": "h3", "text": "Durese"}, {"tag": "p", "text": "The Duros language remained a popular language among space travelers due to the abundance of Duro spacefarers, despite the predominance of Basic."}, {"tag": "h3", "text": "Ewokese"}, {"tag": "p", "text": "Ewokese was the language of the Ewok species, natives of a moon of the planet Endor."}, {"tag": "h3", "text": "Gamorrese"}, {"tag": "p", "text": "Gamorrese was the language of the Gamorrean species, natives of the planet Gamorr."}, {"tag": "h3", "text": "Geonosian language"}, {"tag": "p", "text": "Geonosian was the language of the Geonosian species native to Geonosis. It consisted of click consonants, possible through the dual-mandibles of Geonosians—one moving vertically, and a second, internal set moving horizontally."}, {"tag": "h3", "text": "Hapan language"}, {"tag": "p", "text": "The Hapan language was spoken by residents of the Hapes Cluster."}, {"tag": "h3", "text": "High Galactic"}, {"tag": "p", "text": "High Galactic was a prestige language, most commonly used among Imperial courtiers."}, {"tag": "h3", "text": "Huttese"}, {"tag": "p", "text": "Huttese, the language of the Hutts, was popular among criminals, especially in the (considerable) sections of the galaxy where the Hutt criminal network was powerful."}, {"tag": "h3", "text": "Jawaese"}, {"tag": "p", "text": "Jawaese was the language of the Jawa species, natives of the planet Tatooine."}, {"tag": "h3", "text": "Kaleesh language"}, {"tag": "p", "text": "Kaleesh was the language of the Kaleesh species, natives of the planet Kalee."}, {"tag": "h3", "text": "Kaminoan language"}, {"tag": "p", "text": "Kaminoan was the language of the Kaminoan species, natives of the planet Kamino."}, {"tag": "h3", "text": "Mando'a"}, {"tag": "p", "text": "Mando'a was the traditional language spoken by Mandalorians."}, {"tag": "h3", "text": "Olys Corellisi"}, {"tag": "p", "text": "Olys Corellisi (\"Old Corellian\") was the language spoken by the original settlers of Corellia. It became extinct around 4000 BBY."}, {"tag": "h3", "text": "Pak Pak"}, {"tag": "p", "text": "Pak Pak was the language of the Neimoidian sub-species, native of the planet Neimoidia."}, {"tag": "h3", "text": "Rodese"}, {"tag": "p", "text": "The native tongue of the Rodians, Rodese, was popular due to the large number of spacefaring Rodians."}, {"tag": "h3", "text": "Shyriiwook"}, {"tag": "p", "text": "Shyriiwook was the main language of the Wookiees. It was considered the most emotive of Wookiee tongues, as opposed to the technical Thykarann or tribal Xaczik dialects. It could be understood by those who spoke Basic, but it was nearly impossible for non-Wookiees to pronounce."}, {"tag": "h3", "text": "Snivvian language"}, {"tag": "p", "text": "Snivvian was the language of the Snivvian species, natives of the planet Cadomai Prime."}, {"tag": "h3", "text": "Sullustese"}, {"tag": "p", "text": "Sullustese was the language of the Sullustan species, natives of the planet Sullust."}, {"tag": "h3", "text": "Sith language"}, {"tag": "p", "text": "Sith was the native language of the people of Ziost and Korriban. Later it, became the language of the Sith. The language had at least two dialects, Sith and High Sith."}, {"tag": "h3", "text": "Tarc language"}, {"tag": "p", "text": "The Tarc language was spoken by the Tarc species, who were unable to speak Galactic Basic Standard."}, {"tag": "h3", "text": "Togruti"}, {"tag": "p", "text": "Togruti was one of the main languages of the Togruta species, natives of the planet Shili. The language was often spoken partnered with Galactic Basic Standard."}, {"tag": "h3", "text": "Twi'leki"}, {"tag": "p", "text": "Twi'leki, commonly known as Ryl, was the language of the Twi'lek species, natives of the planet Ryloth."}, {"tag": "h3", "text": "Tusken"}, {"tag": "p", "text": "Tusken was the language of the Tusken Raider species, natives of the planet Tatooine."}, {"tag": "h3", "text": "Yuuzhan Vong"}, {"tag": "p", "text": "The language of the extragalactic Yuuzhan Vong invaders was guttural and grammatically different from Basic, but otherwise straightforward."}, {"tag": "h2", "text": "Droids and computers"}, {"tag": "p", "text": "Droids and computers used either the natural languages that their masters used, usually Basic, or special machine languages. Protocol droids such as C-3PO were \"fluent in over six million forms of communication\" and were often employed as translators, with the ability to also download new language packs for languages such as Tusken. Astromech droids such as R2-D2 were able to understand commands in Basic and perhaps other languages, but could only communicate through an information-dense language of beeps and whistles; devices existed that could translate this language into Basic, such as the display in an X-wing cockpit that allowed the ship's astromech and pilot to commmunicate. Simpler droids communicated only through sounds indicating affirmative/negative, or other simple replies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Language building"}, {"tag": "p", "text": "The languages of some fictional worlds have been worked out in great detail, with grammatical rules and large vocabularies, such as J. R. R. Tolkien's Elvish languages and the Klingon language of Star Trek. The Star Wars languages, in contrast, are not systematically worked out. The Wookiee growls and the beeps of the astromechs mainly carry emotional indicators for the audience via intonation, and Huttese is mainly a jumble of words taken from numerous real Human languages."}, {"tag": "p", "text": "Other languages heard are longer chunks of actual Human languages, albeit ones likely unfamiliar to most of the audience. In A New Hope, for instance, the language spoken by the character Greedo in conversation with Han Solo is actually a simplified version of Quechua, an indigenous language of the Andean region of South America. In Return of the Jedi, Lando Calrissian's copilot, Nien Nunb, speaks the real Human language Haya, a dialect spoken in Tanzania. Similarly, the Ewok language was based on Kalmyk."}, {"tag": "p", "text": "One can also hear some Finnish in The Phantom Menace. After the first lap of the pod race, Watto yells \"Kiitos!\" (\"Thank you!\" in Finnish) to Sebulba, and Sebulba answers \"Ole hyvä!\" ('You're welcome!\")."}, {"tag": "p", "text": "In the The Clone Wars episode Liberty on Ryloth, an Aurebesh Republic display includes the text \"UND UBERHAUPT,\" German for \"and anyway.\" In The Academy, when Soniee and her fellow students break into the Government warehouse, her datapad says \"ENTRARE,\" Italian for \"enter.\""}, {"tag": "p", "text": "Despite these inconsistences, a language guide to the most common Star Wars languages such as Huttese and Bocce exists: The Galactic Phrase Book & Travel Guide, which collects much of the data given in the books and movies surrounding the saga, forming some kind of official vocabulary, rules and phrases. Also covered in the book is Droidspeak, Ewokese, Gunganese, Jawaese, Neimoidian, Shyriiwook, Sullustan, and Tusken."}, {"tag": "p", "text": "Mando'a has become a usable constructed language, developed by author Karen Traviss."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}