{"url": "Arabelle_Lorteli", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Females", "Category:Galactic Alliance individuals", "Category:Legal professionals", "Category:Zoolli"], "nodes": [{"tag": "h1", "text": "Arabelle Lorteli"}, {"tag": "p", "text": "Arabelle Lorteli was a female Zoolli judge handpicked in 43 ABY by Galactic Federation of Free Alliances Chief of State Natasi Daala to oversee the Court of Jedi Affairs. In that position, Lorteli signed warrants for the arrest of psychotic Jedi Knights and presided over former Jedi Tahiri Veila's case, siding decisively with the Galactic Alliance. Later, however, the Jedi Council tricked Lorteli into signing a document that gave the Jedi permission to access a secret Galactic Alliance Security blockhouse in which psychotic Jedi Knights Valin Horn and Jysella Horn were being held in carbonite. Lorteli was later relieved from duty by Daala."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The female Zoolli judge Arabelle Lorteli served the Galactic Federation of Free Alliances. In 43.5 ABY, Lorteli was selected by Galactic Alliance Chief of State Natasi Daala to oversee the Court of Jedi Affairs, which Daala formed mainly to deal with the increasingly alarming issue of young Jedi Knights falling prey to a strange illness that caused them to believe that everyone they knew had been replaced by impostors. Lorteli approved a warrant for the arrest of psychotic Jedi Knights Bazel Warv and Yaqeel Saav'etu, but Galactic Alliance Security Captain Atar was unable to procure the two Jedi. Later, much to the displeasure of the Jedi Order, Lorteli oversaw the arraignment of bounty hunter Tahiri Veila, who had, in years past, been a Jedi as well as a Sith. Lorteli sided decisively with the Galactic Alliance and even refused to allow the Twi'lek Nawara Ven to serve as Veila's defense attorney for the case."}, {"tag": "p", "text": "Later, however, the Jedi Council tricked Lorteli into getting her to sign a document that granted the Jedi permission to visit Detention Center 81, a Galactic Alliance Security blockhouse in which Jedi Knights Valin Horn and Jysella Horn were being held captive in carbonite. The Horns had been captured by Galactic Alliance Security forces after falling prey to the strange psychosis, and were eventually placed in the facility under the command of Colonel Wruq Retk. A group of Jedi, accompanied by several members of the press, accessed the facility and showed the treatment the Horns were receiving, garnering public sympathy for the Jedi's situation. As a result, Daala publicly dismissed Lorteli from duty, and Judge Mavari Zudan took over Veila's case."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lorteli thought rather highly of herself and seemed to enjoy her position as overseer of the Jedi court. Being handpicked for her position by Chief of State Daala herself, Lorteli had the freedom to act without having to worry about being particularly fair, and the judge ruled her cases decisively in favor of the Galactic Alliance. However, Lorteli was weak-minded and susceptible to Jedi mind tricks, as exhibited when the Jedi got her to sign a document granting them permission to enter a secret Galactic Alliance Security facility."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arabelle Lorteli was created by Star Wars author Troy Denning for the third novel in the nine-part Fate of the Jedi series, Fate of the Jedi: Abyss, released on August 18, 2009. Lorteli later received mention in the fifth novel of the series, Fate of the Jedi: Allies, by Christie Golden."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}