{"url": "Lannik/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Galactic Republic planets", "Category:Lannik Space planets", "Category:New Republic planets", "Category:Sith planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Lannik"}, {"tag": "p", "text": "Lannik was the home planet of the Lannik species, located in Lannik Space of the Mid Rim."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lannik was ruled by a hereditary monarchy and was independent of the Galactic Republic."}, {"tag": "p", "text": "Unlike most other Republic planets, the considerable natural resources and mineral wealth of Lannik were largely unmined and unexploited, making it a tempting prize for enterprising would-be manipulators such as Red Iaro leader General Zug and corrupt Gran Senators on Malastare such as Aks Moe."}, {"tag": "p", "text": "Pugil was a sport popular on Lannik. A local team was the New Osler Flejj Beasts."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The planet was discovered by Duros scouts."}, {"tag": "p", "text": "Lannik was discovered by the Galactic Republic sometime between 17,000 BBY and 12,000 BBY. In 11,198 BBY, the planet was victim of the Twenty-Third Pius Dea Crusade."}, {"tag": "p", "text": "During the Great Sith War, Krath came from Daalang and conquered the planet, from which they moved to Bothawui. Lannik was the site of a battle won by the Republic during the Jedi Civil War."}, {"tag": "p", "text": "It suffered from anti-Republic terrorists known as the Red Iaro until 32 BBY. Under the Galactic Empire and even at the end of the Swarm War, the planet remained isolated."}, {"tag": "p", "text": "The planet joined the New Republic sometime between 4 ABY and 7 ABY. It was a New Republic stronghold during the Zsinj and Thrawn campaigns."}, {"tag": "p", "text": "Lannik was conquered by the Yuuzhan Vong during their invasion of the galaxy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}