{"url": "Lanvarok", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Projectile weaponry", "Category:Sith weapons"], "nodes": [{"tag": "h1", "text": "Lanvarok"}, {"tag": "p", "text": "The lanvarok was a combination two-handed polearm weapon and projectile launcher that released sharp, poison-coated discs guided by the power of the dark side. Initially purposed as a hunting tool, the massive lanvarok was the primary combat weapon of the Massassi warriors of the Sith species, both melee and ranged, and also the device brandished by Sith Lords during ceremonies. The original lanvarok was inspired by the natural left-handed disposition of all members of the Sith species, a distinction that was also maintained in the weapon's alternate forearm-mounted, combat-exclusive projectile dispenser design. A right-handed version was later developed by Sith Lords of Human descent."}, {"tag": "p", "text": "Prevalent during the ancient Sith Empire, use of lanvaroks was confined to the borders of Sith space until they were exposed to the galaxy by the Massassi who fought on behalf of the Dark Lord Naga Sadow during the Great Hyperspace War. Lanvaroks were brought to the jungle moon of Yavin 4 by the warriors who joined Sadow in exile, and remained the foremost weapon of the Massassi for more than a thousand years. A variant of the lanvarok was later developed as a forearm-mounted gauntlet. Both versions were especially uncommon in the galaxy at large after the extinction of the Sith race, although an occasional lanvarok was found among the collections of antique dealers, the cargoes of smugglers, or the arsenals of assassins. Those Massassi warriors who served aboard the Sith dreadnaught Harbinger that was propelled five thousand years forward in time brought lanvaroks with them into the modern era."}, {"tag": "h2", "text": "Description"}, {"tag": "h3", "text": "Battleaxe"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The original lanvarok, fabricated at a cost of about 250 credits, was a large polearm weapon that was at least as tall as the beings for whom it was designed, the Massassi warriors of the ancient Sith, a species whose inherent left-handed predilection was the weapon's inspiration. Prior to their discovery of metallurgy and the manipulation of alloys thereby derived, materials such as wood and bone were used in the construction of lanvaroks and the discs with which it was equipped. Sharply speared at either end, the exotic lanvarok included a compact, crescent-shaped axehead at its summit with an opposing long spike, a shape reminiscent to some of a Dreadnaught-class warship. Several small, poison-coated discs valued at five credits apiece were spring-loaded and hidden within a launcher mounted on the side of the axehead. The heft of the weapon, at just under ten kilograms, was such that only the especially strong Massassi warrior was capable of using it effectively. Individuals occasionally decorated their personal weapons with tassels and inscriptions."}, {"tag": "h3", "text": "Variant"}, {"tag": "p", "text": "The battleaxe version of the lanvarok was adapted into a forearm-mounted gauntlet that bore few similarities to the original, including an inflated 4,000 credit price tag. Forged of durasteel and sometimes plated with lightsaber-impervious cortosis alloy, the gauntlet model was lighter, and was not a halberd with ranged attack capabilities granted by an equipped disc launcher, but was instead a worn device similar in function to a blaster pistol. A thick, perforated and padded metal cuff around the base of the forearm supported the attached launcher mechanism, disc cartridge, and emitter. The channel through which the ejected disc traveled extended from the launcher assembly and tapered at the end of the user's hand, and included a primary triggering handle that curved downward and fit into the wielder's grip. An additional release trigger was installed near the underside of the forearm cuff and required Force-manipulation to subtly activate the disc launcher. Among the design cues that were transferred to the new lanvarok were the weapon's left-handed exclusivity. However, further modifications saw the development of a right-handed version which, like those specifically suited to left-handed warriors, was not interchangeable from either side."}, {"tag": "h3", "text": "Usage"}, {"tag": "p", "text": "Brute strength rather than skill was necessary to properly control the massive lanvarok, in a firm two-handed grip, with one hand at the base of the hilt and the other situated underneath the axehead. A quick forward swing and return of the weapon released a single poison-coated disc, while a longer arc cast a wider flurry of multiple discs which were aimed at the throat and face, but instead fanned out in a wildly random pattern. Because of their unpredictable trajectory, Massassi sometimes guided the discs with dark side power to targets as distant as five meters, with such precision as to even disarm opponents. Sith Lords, for whom the weapon was not designed, only carried lanvaroks during ceremony and were compelled to direct its discs through the Force. When the lanvarok had exhausted its ammunition, which was time-consuming to reload, the axehead became the primary means of attack. The curved shape of the blade easily penetrated scaled reptilian hides, and was ideal for rending flesh from bone, as well as the clean removal of limbs and heads. The long, sharp opposite end was speared through targets in a killing maneuver."}, {"tag": "p", "text": "Defensively, Massassi lanvaroks were held aloft to parry incoming attacks. In an intimidating gesture, adept warriors spun their weapons with sufficient speed to produce an audible hum, before a spray of discs were released on the back swing. Those with greater skill were able to effectively wield a lanvarok one-handed and in tandem with a blaster pistol. Lanvaroks were also on occasion used to pry open cargo bay blast doors. The lanvarok's pointed summit kept enemies at bay under threat of impalement. When not in use, the lanvarok was worn in a scabbard across the back, or simply held in hand, ready for action. Neither the polearm lanvarok nor the discs with which it was equipped were able to withstand direct contact with a lightsaber's blade."}, {"tag": "p", "text": "The gauntlet lanvarok design was inspired by the natural left-handedness of the Sith species. Although the primary release mechanism was located in the palm, the wielder enjoyed enough freedom to arm him- or herself with additional weapons in either hand. The subtle, Force-activated trigger toward the forearm cuff made for unexpected discharges of the ammunition. The tedious reload time was mitigated by the unpredictability of multiple discs, quietly dispersed in a short yet random and nearly inescapable spray; opponents were completely surprised by a weapon that fired and dealt damage comparable to a blaster pistol. The cortosis-alloy that was occasionally incorporated in lanvarok construction was an added measure of protection from reciprocal lightsaber attacks. Each weapon was designed specifically for the right or left hand without interchangeability."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Lanvaroks were in use by ancient Massassi warriors long before the arrival of the Dark Jedi exiles of the Hundred-Year Darkness on the planet Korriban whose technological advancements brought an end to the primitive and barbarous culture of the Sith. Sorzus Syn, one of those same Dark Jedi who then became the first Sith Lords, recorded a description of both lanvarok versions within her journal, including her first encounter with the forearm mounted versions equipped by the armored soldiers of Domoru Krev. Directions for the construction of Massassi lanvaroks were sometimes found within Sith holocrons. Legend told that hunting was its primary purpose; by the height of Sith civilization, however, the lanvarok had been the Massassi's foremost combat weapon for generations. Marka Ragnos, the immensely powerful Dark Lord of the Sith Golden Age, wielded a lanvarok, among other weapons, in battle. Many of the Massassi warriors under the command of Ragnos' successor, Naga Sadow, were armed with lanvaroks as they invaded the Galactic Republic during the Great Hyperspace War. Among Sadow's forces was the Sith dreadnaught Harbinger, crewed by Massassi warriors who utilized lanvaroks to little effect—and often each other's bane—against the Jedi infiltrator Relin Druur. The surviving Massassi still wielded their lanvaroks against Druur when a botched hyperspace jump resulted in the propulsion of the Harbinger several millennia into the future. Another Sith Dreadnaught, the Omen, was said to have born resemblance to a lanvarok gauntlet. While lanvaroks had been exposed to the galaxy at large during the Hyperspace War, with the defeat and near-annihilation of the Sith Empire by war's end, they were anything but prevalent. The device was still remembered by the citizens of the succeeding Empire, whose Lords regarded lanvaroks with much admiration."}, {"tag": "p", "text": "The remnants of the Massassi race relocated to the moon of Yavin 4 and maintained lanvarok usage for the duration of their existence. In 3997 BBY, descendants of the original colonists were visited by the Dark Jedi Exar Kun, whom they disarmed with discs hurled from polearm lanvaroks. When the Massassi later became subjects of Kun, who had since become Dark Lord of the Sith, they wielded lanvaroks in the pursuant Great Sith War. The signature polearm became something of a rarity with the eradication of the Massassi after the war, and discovery of one usually fetched plentiful returns."}, {"tag": "p", "text": "Forearm-mounted lanvarok gauntlets were seen in the galaxy following the institution of the Order of the Sith Lords, but were still as uncommon as the polearm version. One of the final Lords of that Order, Darth Maul, armed himself with a lanvarok gauntlet. During the Galactic Civil War, Emperor's Hand Mara Jade owned a Sith lanvarok and contemplated its use for an assassination attempt against the crime lord Dequc. However, its need for a left-handed operator ultimately forced Jade to choose another weapon. Jade then gave the lanvarok to her friend and smuggler Talon Karrde, who tried to sell it to fellow privateer Booster Terrik, much to the interest of his daughter Mirax."}, {"tag": "p", "text": "In 5 ABY, while in search of a rare lanvarok, Plumba of the Imperial Ruling Council visited the proprietor of Antiques by Dumas on Imperial Center, who had recently acquired a priceless specimen. Plumba paid top dollar for the artifact, only to die when he soon afterward activated the device, a booby-trap set for him by Imperial Intelligence Director Ysanne Isard."}, {"tag": "p", "text": "During the Second Galactic Civil War, Jedi apprentice Ben Skywalker experienced a vision of a female Sith Warrior armed with a Massassi lanvarok, a sighting that helped him learn to operate an ancient Sith Meditation Sphere."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Massassi lanvarok first appeared in Star Wars: Tales of the Jedi - Dark Lords of the Sith. The weapon was initially drawn by Christian Gossett, with its last appearance in that story arc rendered by Art Wetherell. John Whitman's audio rendition of Dark Lords of the Sith, featured lanvaroks in action, complete with sound effects of the discharge of the weapon's discs. Carrasco returned as the penciller of Tales of the Jedi — The Sith War, several issues of which featured polearm lanvarok-armed Massassi warriors. A lone Massassi lanvarok also appeared in First Encounter, the third comic in Tales of the Jedi — The Fall of the Sith Empire penciled by artist Dario Carrasco, Jr.. Lanvaroks and the unique fighting style employed by the Massassi were also featured prominently in author Paul S. Kemp's Crosscurrent, a novel set in the same era as The Fall of the Sith Empire 3: First Encounter. The weapon was also briefly mentioned in another of Kemp's works, The Old Republic: Deceived."}, {"tag": "p", "text": "The first appearance of an otherwise nondescript Sith lanvarok occurred in February of 1997, six months before the August debut of the previously established Massassi version, in Michael A. Stackpole's X-Wing: The Bacta War. He purposely neglected to describe the weapon beyond its left-handed requirement, which resulted in a running gag, also of his design, about an interesting weapon that had yet to be visually depicted for fans. Stackpole's 1998 I, Jedi novel mentioned the lanvarok from The Bacta War, and the same weapon was drawn several months later by Carlos Ezquerra for the first issue of the Star Wars: Mara Jade – By the Emperor's Hand comic book series. Mara Jade's lanvarok was again referenced in the official video game game guide for Star Wars: Empire at War. The weapon was briefly mentioned in the Star Wars: Jedi Knight II: Jedi Outcast video game and appeared in Aaron Allston's Legacy of the Force: Exile via Force vision."}, {"tag": "p", "text": "Full specifications and historical data was given for both lanvarok versions, along with illustrations, in Wizards of the Coast's Dark Side Sourcebook, with Sith used interchangeably to describe the two variations. Also, the forearm version rendered for the aforementioned source effectively put an end to Michael Stackpole's gag, and resulted in the retcon of the polearm as the prototype predecessor to the mounted launcher. Additional details were provided three years afterward in Del Rey's New Essential Guide to Weapons and Technology, which included a fully illustrated schematic of the forearm-mounted design, and also noted the polearm version's transition to a forearm-mounted weapon."}, {"tag": "p", "text": "Although a Massassi lanvarok is shown releasing three simultaneous discs in Dark Lords of the Sith 4: Death of a Dark Jedi, a description supported by The Dark Side Sourcebook, Wizards of the Coast's Knights of the Old Republic Campaign Guide describes instead a single discharge weapon. Visual depictions of both versions were provided in Drew Karpyshyn's Heritage of the Sith, an article for Star Wars Insider 88, while a convoluted historical mention of the lanvarok was given in Evil Never Dies: The Sith Dynasties, an online supplement to the same magazine. An entry was provided for only the forearm-mounted lanvarok in The Complete Star Wars Encyclopedia, a reference book written by Stephen J. Sansweet and Pablo Hidalgo. Both lanvarok versions were referenced in 2012's Book of Sith: Secrets from the Dark Side reference book, in an in-universe account given by original Sith Lord Sorzus Syn."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}