{"url": "Lantillies/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Honorable Union of Desevro & Tion planets", "Category:Lantillian sector planets", "Category:New Republic planets", "Category:Perlemian Trade Route", "Category:Planets with shipyards", "Category:Randon Run", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Lantillies"}, {"tag": "p", "text": "Lantillies was a planet in the Lantillies system and the sector capital of the Lantillian sector in the Mid Rim. Located along the Perlemian Trade Route and at the head of the Randon Run, Lantillies was heavily involved in the shipping and shipbuilding industries, and its Human natives were well-known for their emphasis on reliability over elegance. Lantillies was conquered by the Honorable Union of Desevro & Tion early in galactic history, though the planet was a member of the Galactic Republic through much of the government's history. Lantillies later became a stronghold of the New Republic during the Yuuzhan Vong War of 25–29 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The planet Lantillies was located in the Lantillies system, a star system in the Lantillian sector of the Mid Rim. The capital of the Lantillian sector, Lantillies fell within the boundaries of the region of space commonly known as the Kashyyyk Region. A bustling city-world, Lantillies was a major player in shipping and shipbuilding industries, as it was located along the Perlemian Trade Route and sat at the end of the Randon Run hyperlane that linked Lantillies with Randon, the capital of the nearby Mytaranor sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Lantillies was discovered by the greater galaxy sometime between the years 25,000–24,000 BBY, and early on in the Tionese War between 24,000–23,900 BBY, the forces of the Honorable Union of Desevro & Tion conquered Lantillies during their march up the Perlemian Trade Route towards the Galactic Republic. Lantillies was a part of the Republic by 22,000 BBY, and during the Mandalorian Wars of 3976–3960 BBY, the Lantillies system was the site of a Republic victory against the Mandalorian warrior culture. The Lantillian Planetary Security Forces were responsible for protecting Lantillies in the later years of the Republic."}, {"tag": "p", "text": "The Lantillian ShipWrights corporation was based on Lantillies during the final years of the Republic, though in 22 BBY the company was forced to recall a number of their GX1 Short Haulers when it was discovered that they had malfunctioning Fabritech 7Y4 sensor suite. Fabritech blamed the Lantillies shipping industry, and Lantillian ShipWrights asked their customers to return the vessels to the Lantillian Spacers' Brotherhood for refitting. During the Clone Wars against the Confederacy of Independent Systems between 22–19 BBY, Lantillies served as the headquarters of the Grand Army of the Republic's Twelfth Army under Moff Therbon."}, {"tag": "p", "text": "When the Republic was replaced by the Galactic Empire in 19 BBY, Lantillies and its shipping guilds remained neutral in the Galactic Civil War between the Empire and the Alliance to Restore the Republic. However, Lantillian natives Barlon Hightower and Bren Quersey flew as pilots for the Alliance, as Hightower joined the Alliance after he came to believe that there was no room for neutrality in the civil war. In 5 ABY, the Third Fleet of the New Republic—the government that succeeded the Alliance—joined together with the defense forces of nearby Contruum to establish a beachhead along the Perlemian at Lantillies. By 25 ABY, the region of space around Lantillies had an average population of 10 to 100 billion sentients per inhabited planet, and Lantillies was a stronghold of the New Republic during the Yuuzhan Vong War against the extra-galactic Yuuzhan Vong species between 25 and 29 ABY."}, {"tag": "p", "text": "Lantillies had been considered as a potential candidate for one of the Lost Thrones of Xim the Despot."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Lantillians, as Lantillies' inhabitants were known, were primarily Human, though they were well-known for their disinterest in flashiness or elegance in starship design, as they placed a priority on reliability. Lantillians were also rather open-minded about alien species, freely admitting them into their companies and guilds without prejudice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lantillies has received a number of mentions in early role-playing guides, as several variations of ships bore the \"Lantillian\" description, and the planet was greatly expanded upon in the 2009 reference guide The Essential Atlas."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}