{"url": "Lapti_Nek/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Musical pieces", "Category:Songs by the Max Rebo Band"], "nodes": [{"tag": "h1", "text": "Lapti Nek"}, {"tag": "p", "text": "\"Lapti Nek\" was a well-known Huttese song. The Max Rebo Band performed this song in Jabba's Palace. \"Lapti Nek\" was one of Sy Snootles's favorite songs. The phrase \"lapti nek\" meant \"work it out\" in Huttese. The song was speedily composed by Max Rebo as a major attempt to impress Jabba the Hutt in order to gain a larger payment."}, {"tag": "h2", "text": "Lyrics"}, {"tag": "h3", "text": "Huttese"}, {"tag": "h3", "text": "Basic translation"}, {"tag": "p", "text": "The lyrics translate into Galactic Basic Standard as:[source?]"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Lapti Nek\" was composed by John Williams's son, Joseph, for the 1983 film Return of the Jedi."}, {"tag": "p", "text": "Star Wars Insider 89 noted the irony of what is essentially a workout song being \"performed with gusto for the morbidly obese Jabba.\" While this mischaracterizes Jabba's physique, which is fairly typical of a Hutt, it does reflect a noticeable contrast between Jabba's sedentariness and workout music."}, {"tag": "p", "text": "\"Lapti Nek\" was replaced with \"Jedi Rocks\" in the 1997 Special Edition and subsequent releases of Return of the Jedi."}, {"tag": "p", "text": "This song can be heard on the \"jukebox\" in the Star Wars Galaxies game, under the name \"Max Rebo 1.\" It is also heard in Jabba's throne room."}, {"tag": "p", "text": "In Russian, \"lapti\" means \"bast shoes,\" usually made from bast of the birch tree and worn by peasants."}, {"tag": "p", "text": "In the original release of Return of the Jedi, Sy Snootles' voice was dubbed by Annie Arbogast, a member of the sound department."}, {"tag": "h3", "text": "Commercial releases"}, {"tag": "p", "text": "The film version of the song has never been commercially released due the original masters being lost. An alternate version appears on the Return of the Jedi soundtrack, with Michele Gruska on vocals. The Huttese lyrics in this article are from this soundtrack version; the words lapti nek do not appear in the film version."}, {"tag": "p", "text": "Lucasfilm Ltd. officially sanctioned a number of remixes to promote the release of Return of the Jedi."}, {"tag": "h4", "text": "Lapti Nek (Special Extended Dance Remix) 12\" Single"}, {"tag": "p", "text": "This collector's edition single, released in 1983 by Polygram, contains two dance remixes of \"Lapti Nek\" by Steve Thompson."}, {"tag": "h5", "text": "Track Listing"}, {"tag": "p", "text": "The Club Mix features lyrics in Huttese performed by Michele Gruska while the Dub Mix is an instrumental track."}, {"tag": "h4", "text": "Lapti Nek Overture (From Return of the Jedi) 12\" Single by Urth"}, {"tag": "p", "text": "This single was released by Warner Bros. Records, Inc. in 1983 under the Bantha Music label. The band Urth was formed specifically for this recording."}, {"tag": "p", "text": "The \"Lapti Nek Overture\" combined Huttese lyrics, by Annie M. Arbogast, Ewokese lyrics, by Ben Burtt, and English lyrics by Joseph Williams. Joseph performed as part of Urth, on vocals."}, {"tag": "p", "text": "Both tracks were produced and arranged by Jay Gruska."}, {"tag": "h5", "text": "Track Listing"}, {"tag": "h4", "text": "Meco"}, {"tag": "p", "text": "Meco has released a few versions of \"Lapti Nek\" on various records."}, {"tag": "p", "text": "Ewok Celebration (1983 12\" LP Complete Album), released by Arista (catalog number AL 8-8098) and produced by Harold Wheeler, Lance Quinn, Meco Monardo and Tony Bongiovi, included:"}, {"tag": "p", "text": "Ewok Celebration/Lapti Nek (1983 7\" Single), released by Arista (catalog number AS 1-9045) and produced by Lance Quinn, Meco Monardo and Tony Bongiovi, included:"}, {"tag": "h4", "text": "Fancy Man"}, {"tag": "p", "text": "An English version of the song entitled \"Fancy Man\" can be heard on the From Star Wars to Jedi: The Making of a Saga documentary. This version also has never been commercially released."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}