{"url": "Lar_Le%27Ung", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Jedi Masters of the New Jedi Order", "Category:Males", "Category:Pau'ans"], "nodes": [{"tag": "h1", "text": "Lar Le'Ung"}, {"tag": "p", "text": "Jedi Master Lar Le'Ung, a male Pau'an, was a member of the New Jedi Order at the start of the Yuuzhan Vong War. In 25 ABY, he was stationed at the Jedi Praxeum on Yavin 4 when Prince Finn Galfridian was rescued from the subjugation of his homeworld of Artorias at the hands of the Yuuzhan Vong by Jedi Master Luke Skywalker and brought to the Praxeum for Jedi training. When the Jedi were requested to aid in the evacuation of the planet Rychel, which was under attack from the intergalactic invaders, Le'Ung was tasked with leading the New Republic troops against the Yuuzhan Vong."}, {"tag": "p", "text": "The Yuuzhan Vong had deployed two siege creatures—Tu-Scart and Sgauru—and with Galfridian at his side, Le'Ung led the troops in an attempt to distract the creatures long enough for Skywalker to rescue the refugees. As the battle wore on, the Republic troops lost hope and began to run back to their ships. Le'Ung realized that Tu-Scart was emanating fear and, knowing the refugees needed more time, raised his lightsaber and called for his troops to hold. As he did so, the Pau'an was attacked from behind by a Yuuzhan Vong warrior who stabbed Le'Ung through the chest and hurled the Jedi Master into the open mouth of Tu-Scart."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Jedi Master in the New Jedi Order, the Pau'an Lar Le'Ung was stationed at the Jedi Praxeum on the moon Yavin 4 in 25 ABY, just months after a species of intergalactic invaders, the Yuuzhan Vong, began their attack on the galaxy. At the Praxeum, Le'Ung was one of the Jedi who oversaw the training of Jedi apprentices Jacen, Jaina, and Anakin Solo. Le'Ung was present when leading Jedi Master Luke Skywalker brought Prince Finn Galfridian to the Praxeum to be trained as a Jedi after Galfridian's homeworld of Artorias was subjugated by the Yuuzhan Vong."}, {"tag": "p", "text": "After Galfridian and some of his fellow apprentices encountered a Tuk'ata—an ancient Sith creature—in Yavin 4's jungle, Le'Ung, Skywalker, and Master Kyp Durron discussed Galfridian's future as a Jedi. Their discussion was interrupted, however, by news of a Yuuzhan Vong attack on the planet Rychel and a request for the Jedi to aid in the evacuation of the world. Leaving Durron behind to watch over the Praxeum, Skywalker and Le'Ung left to lead the mission, taking Galfridian with them."}, {"tag": "p", "text": "While en route to Rychel, Le'Ung briefed the Jedi team on their mission objectives and the current situation from onboard one of the New Republic fleet's Bulwark-class battle cruisers. The Pau'an was given command of the Republic troops that were participating in the mission, with orders to distract two siege creatures—Sgauru and Tu-Scart—that the Yuuzhan Vong had deployed, while Skywalker attempted to rescue and evacuate the planet's prisoners. With Galfridian at his side, Le'Ung led the troops against the coufee-armed Chazrach slave warriors and siege creatures fighting for the Yuuzhan Vong, while air support in the form of T-65XJ X-wing starfighters assaulted the creatures from the sky. Tu-Scart managed to bring down several of the Republic fighters without suffering any damage itself, with one of the downed fighters crashing perilously close to Le'Ung and his troops."}, {"tag": "p", "text": "As Republic fighters crashed around them, Le'Ung's troops lost hope after realizing that their weapons were having little effect on the siege creature and began to run back to their ships. Nonetheless, the Jedi Master recognized that they were not just fighting the creature itself; it was emanating fear. The Pau'an raised his lightsaber in the air and called for his troops to hold, knowing the refugees needed more time. Just at that moment, however, he was stabbed from behind by a Yuuzhan Vong warrior wielding an amphistaff. The warrior drove his weapon right through Le'Ung's chest and hurled the Jedi Master's body into the maw of Tu-Scart, the sight of which renewed the fear that afflicted the Republic forces."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "As the battle continued, Galfridian retrieved Le'Ung's fallen lightsaber and attempted to rally the Republic troops yet again to continue their attack on the siege creatures. The troops managed to repel the beasts long enough for Skywalker to fill the evacuation ships with the civilians, though many of the natives were left behind. When the evacuation ships left, Galfridian wanted to return for Le'Ung, but Skywalker told the young man the Pau'an was gone. Later, when Galfridian resolved to return to his home planet, Skywalker gave the young Jedi Le'Ung's lightsaber, noting that he had used it with compassion."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lar Le'Ung was a male Pau'an with pale skin. Forgoing conventional Jedi robes, Jedi Master Le'Ung dressed in traditional Pau'an clothing and carried a cane. A respected member of the New Jedi Order, Le'Ung was involved in the training of Jedi apprentices at the Praxeum on Yavin 4 and was called upon by Master Luke Skywalker to discuss the future of Finn Galfridian. During the discussion, the Pau'an revealed that he was uncomfortable with the Jedi being seen as weapons, unlike his contemporary Kyp Durron. When the Jedi were called upon to aid in the evacuation of Rychel, Le'Ung performed the mission briefing and was tasked by Skywalker with leading the Republic troops in the battle."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "A powerful Jedi, Le'Ung was capable with a lightsaber as well as in the use of the Force. During the evacuation of Rychel, he fought the Yuuzhan Vong and their war creatures with his orange-bladed lightsaber and was able to sense the fear that Tu-Scart was emanating. Due to the Yuuzhan Vong being invisible to the effects of the Force, however, Le'Ung was unable to sense the impending attack from a Yuuzhan Vong warrior, leading to the Jedi Master's death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lar Le'Ung first appeared in the second issue of the Star Wars: Invasion comic series, Refugees, Part 2, released in August 2009, and known only as \"Master Le'Ung.\" He went on to appear in the third issue of the series, Refugees, Part 3, in which his first name \"Lar\" was revealed. Le'Ung later made a small appearance in Star Wars: Invasion 0, which collected and expanded the two StarWars.com online previews for Invasion. All of the issues in which Le'Ung appeared were written by Tom Taylor and penciled by Colin Wilson. Taylor named Le'Ung after his friend, Australian comedian and Star Wars fan, Lawrence Leung."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}