{"url": "Laranth_Tarak", "categories": ["Category:Legends articles", "Category:Articles which may contain original research", "Category:Females", "Category:Jedi Purge victims", "Category:Post-Ruusan Jedi Knights", "Category:Twi'leks", "Category:Whiplash members"], "nodes": [{"tag": "h1", "text": "Laranth Tarak"}, {"tag": "p", "text": "Laranth Tarak was a female green-skinned Twi'lek Jedi Knight and a Gray Paladin, a marginalized group of Jedi that fought with more weapons than just a lightsaber. A survivor of Contingency Order 66, Paladin Tarak helped the secret organization Whiplash get surviving Jedi and their associates off Coruscant in the early days of the Great Jedi Purge."}, {"tag": "p", "text": "She did not use a lightsaber, preferring twin DL-44 blasters. She was a childhood friend of Jax Pavan, and would eventually assist him in his search for Bug-Eyes, and later join Whiplash with him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born to Twi'lek parents on the planet Ryloth, Laranth Tarak was identified as Force-sensitive at an early age and delivered to the Coruscant Jedi Temple for formal instruction in the ways of the Force at the Temple academy. Meeting fellow initiate Jax Pavan during her early training, Tarak was selected as a Padawan and saw very little of Pavan during her apprenticeship, and less and less of her old friend when she was made a Jedi Knight. Studying independently as a Knight, Tarak became fascinated with the teachings espoused by the Gray Paladins, a group of Jedi who eschewed the use of the Force and opted to use blaster weapons."}, {"tag": "p", "text": "Seeking to aid the Galactic Republic as a Paladin, Tarak carried two DL-44 heavy blaster pistols, and her belief in the Grays Paladins' philosophy earned her the disdain of many of her colleagues in the mainstream Order, many of whom considered her blasphemous, sacrilegious, and heterodoxical. Tarak's involvement in the Clone Wars, the massive conflict between the Republic and the Confederacy of Independent Systems, is unknown, though she was stationed on Coruscant when Supreme Chancellor Palpatine betrayed the Order by issuing Contingency Order 66 to the Grand Army of the Republic. Clone troopers on every front opened fire on their Jedi leaders while members of the 501st Legion stormed the Jedi Temple as part of Operation: Knightfall. Aiding in evacuating Initiates, Padawans, and Temple employees, Tarak ran into Pavan as he fled the Temple Precinct and into the lower levels of Galactic City."}, {"tag": "h3", "text": "Whiplash"}, {"tag": "p", "text": "Several months later, Tarak encountered Pavan again on Amtor Avenue in the Blackpit Slums, her face scarred and her left lekku shortened by blaster fire. When Pavan detailed the dying request of a fellow Jedi, Tarak agreed to join him in the hunt for a droid named 10-4TO. Tarak led Pavan to the manse of Rokko the Hutt of the Besadii clan, who assisted them and their other comrades, Nick Rostu, Den Dhur and the seemingly fully sentient droid I-5YQ. Following a trail given by the Hutt, the Jedi and their companions delved deep into the Works only to be cornered by Prince Xizor. Xizor, who was already in the possession of the droid the Jedi sought, killed Rostu while the others in the group fled. As they escaped the Falleen prince, the group was cornered by feral droids which had overloaded a nearby reactor. Escaping aboard the Far Ranger, the team met with a representative of Whiplash, an underground pro-Jedi movement, and agreed to aid them in their fight for justice."}, {"tag": "p", "text": "Over time, Tarak grew to find her work with Whiplash tedious and longed for a change of pace. While the group began residing in a small apartment, Tarak set off on her own, in part due to her feeling that a distinctively bad future awaited the group. As Tarak investigated these feelings, she was attacked by the Jedi hunter Aurra Sing and barely survived. After Sing was taken off her trail, Tarak returned to the apartment to find that the group had been paid a large sum of credits for their solving the murder of Ves Volette. It was in the next few weeks, while the group attempted to get Dejah Duare off Coruscant, that Tarak felt another tremor in the Force moments before Sing attacked them once more. Sing severed Tarak's right arm before Pavan defeated the dark Jedi. He then rushed Tarak to a nearby medcenter. After she recovered, Tarak revealed to Pavan her intentions of parting ways with the group, citing her individualist nature and a need for solidarity."}, {"tag": "p", "text": "Some time later, the pair crossed paths again when they rescued an untrained Force-sensitive, Kajin Savaros, roaming the streets of Ploughtekal Market. Aiding Pavan in the boy's education in the ways of the Force, Tarak was forced to protect him when he was attacked by Probus Tesla and several other member of the Inquisitorius. As she defended the young man from the dark-side Force-users, Tarak was struck by Force lightning created by Inquisitor Mas Sirrah. Nearly succumbing to his power, Tarak was rescued when Savaros used his raw power to utterly destroy Sirrah's body with an unbridled use of the Force. Because of this incredible power, Tarak agreed with the others that Savaros should be moved off-world. During a transfer to a safe house, Tarak was downed by spice gas and her unconscious form imprisoned within the Imperial Security Bureau's headquarters. Aided in escaping by her friends, Tarak was brought by Darth Vader to the roof of the building for a prisoner exchange with Pavan. The group, betrayed by their former comrade Duare, was forced to fight their way out of the building, fleeing back into the undercity after Vader was subdued by his overuse of the drug bota."}, {"tag": "h3", "text": "The last Jedi"}, {"tag": "p", "text": "Some time after this, Thi Xon Yimmon, the leader of Whiplash, came to believe that he was in imminent danger of being apprehended. To prevent this, the Whiplash council selected Pavan, Tarak, Dhur and I-5 to escort him to Dantooine. En route, they were forced out of hyperspace by a gravity well generator and faced capture from a wing of ships commanded by Darth Vader. Pavan gave the order to abandon ship, but Tarak waited until Vader's flagship had lowered its shields to board them, and fired a laser cannon at the ship at point-blank range. Backblast and shrapnel from the ensuing explosion fatally injured her, and moments later she died in Pavan's arms. Her last words to her lover were the final line of the Jedi Code, \"There is no death, there is the Force.\""}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Tarak was muscular and tall. Her face and neck were scarred from an early mission against the Empire, which had also cost her ten centimeters of her left lekku. Far from trying to cover up her disfigurements, she did not have the scarring removed, and kept her lekku in front of herself so that they could be seen."}, {"tag": "p", "text": "Due to her Gray Paladin training she was an excellent shot with her two blasters, able to even shoot other blaster bolts off of their trajectories, deflecting them as if with a lightsaber. She hated to be stripped of her weapons."}, {"tag": "p", "text": "Tarak rarely revealed any of her personal thoughts or feelings to others. When she developed an attraction to Jax Pavan, she did not admit it to him but became very quiet and withdrawn, finally only letting Pavan know by opening herself to him in the Force in a very personal session in which he also revealed his thoughts to her. Though they both realized that Pavan returned her affections, he was totally inexperienced with relationships, and Tarak withdrew from the connection, to Pavan's confusion. Several times after this, Pavan would sense that Tarak still had feelings for him, but he failed to act on any of these, again due to his inexperience."}, {"tag": "p", "text": "After Tarak's capture and torture at the hands of Darth Vader a few months later, Pavan confronted Tarak about their mutual attraction, this time refusing to let her dismiss it as she had in the past. Pavan and Tarak again opened themselves to each other in the Force, finally realizing that they did love each other. However, they mutually came to a decision to not rush into anything."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}