{"url": "Larrin_sector", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Galactic Empire sectors", "Category:Inner Rim sectors", "Category:Northern Dependencies sectors"], "nodes": [{"tag": "h1", "text": "Larrin sector"}, {"tag": "p", "text": "The Larrin sector was located in the Inner Rim. The rocky world Filordis, home of the sentient Filordus species, was situated in the sector. Members of the Caarite species met with the Filordi on the latter's homeworld in 33 BBY, inviting them to become partners in the foundation of the Metatheran Cartel. During the reign of the Galactic Empire, the holovid actress J'fe Din used her popular melodramatic series Starflash to covertly transmit vital information to Rebel Alliance agents in the Larrin sector, hastening the downfall of the Imperial rule there."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Larrin sector was located in the Northern Dependencies portion of the Inner Rim. It contained the Filordis system."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While the Larrin sector was under the rule of the Galactic Empire, the popular melodramatic holovid series Starflash ran there for three years. The series established the position of its lead performer, J'fe Din, at the top of the Larrin sector's vid charts, making her the most popular vidstar in the sector. Unknown to the Larrin sector's Imperial authorities or the show's billions of fans, Din and her producer used the series to surreptitiously convey vital information, such as codes, passwords, and messages, to Rebel Alliance agents operating in the sector."}, {"tag": "p", "text": "Starflash ended its run when the Empire's rule was defeated in the Larrin sector, with Din's efforts having hastened the regime's collapse in the sector by at least a year. Din subsequently revealed her true support for the New Republic, which succeeded the Alliance following the beginning of the Empire's fragmentation in 4 ABY. The holovid actress later starred in Imperial Truth, a docudrama series produced in the Larrin sector that dramatized the realities of the Imperial reign. Din's continued open promotion of the New Republic greatly improved that government's standings in the Larrin sector."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The Larrin sector's Filordis system was home to the rocky world Filordis. The area of space surrounding Filordis was explored by the Galactic Republic at some point between 25,000 BBY and 20,000 BBY, and Filordis constituted a part of the civilized galaxy by the time the Great Sith War took place in 3996 BBY. Around that time, a hyperlane passing through the sector connected Filordis to the Nouane and Tirahnn systems; however, that hyperspace route had ceased to exist by the time the Mandalorian Wars were fought twenty years later."}, {"tag": "p", "text": "In 33 BBY, the Filordi, the sentient natives of Filordis, met with members of the Caarite species on the former's homeworld. The Caarites invited the Filordi to become partners in a new business venture, the Metatheran Cartel, to which the Filordi agreed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Larrin sector was first mentioned in the 1995 West End Games Star Wars: The Roleplaying Game supplement Heroes & Rogues, which was written by Paul Sudlow and Rick Stuart."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}