{"url": "Lars_homestead", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Moisture farms", "Category:Tatooine locations"], "nodes": [{"tag": "h1", "text": "Lars homestead"}, {"tag": "p", "text": "The Lars homestead was the home of the Lars family for at least three generations. It was a moisture farm located on the Great Chott salt flat in the Jundland Wastes on the planet Tatooine."}, {"tag": "p", "text": "The farm was originally owned by Gredda and Lef Lars. They passed it on to their son, Cliegg Lars who then passed it on to Owen and Beru Lars. Owen and Beru raised Luke Skywalker, son of Anakin Skywalker, on the farm until age nineteen. The farm was burned and Owen and Beru killed by the Galactic Empire as they searched for the droids C-3PO and R2-D2, who had been traced to the farm."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "A moisture farm, with sixty-three separate vaporators scattered on the property, the Lars farm was located on the Great Chott salt flat, on the outskirts of the Jundland Wastes, far removed from the closest city, Anchorhead. The homestead itself was mostly underground, to keep it cool, and always provided adequate room for the Lars family."}, {"tag": "p", "text": "The homestead's most prominent feature was the main living pit, a crater housing a courtyard from which occupants could access the various rooms, lofts and areas of the homestead. It was accessed via the main entry dome, set to the side of the living pit, and opposite the vehicle utility pit. The dome was made from pourstone, and hand-built by Cliegg Lars. It featured an external security access keypad and message center, and was commonly surrounded by various apparatus such as dew condenser jugs and area sensors."}, {"tag": "p", "text": "The crater walls were composed of hard packed soil, laced with magnetic ore, that served as insulation from the heat of Tatooine's twin suns, and from the chilly night-time temperatures. Funnel flowers grew around the rim of the crater. The center of the courtyard was given up to two GX-8 water vaporators, commonly serviced by a droid patch-in unit. The courtyard provided access to the family dining room and kitchen, a storage room and sleeping lofts. The crater rim was commonly surrounded by power distribution conduits and fusion generator supply tanks."}, {"tag": "p", "text": "A tech dome was situated behind the entrance dome. The tech dome featured a hinged roof, allowing access to an elevator leading into the garage below. The garage had enough space to house the family vehicles, including Luke's X-34 landspeeder, the family V-35 Courier and Luke's T-16 skyhopper. A vehicle recharge port was located next to the outer dome."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "It was originally owned by Gredda and Lef Lars, who passed it on to their son, Cliegg Lars,[source?] who lived there with his son, Owen, and for the last years of her life, his wife Shmi. After his father's death, Owen and his wife, Beru, inherited the farm. Shmi Skywalker Lars was buried there in 22 BBY and later Cliegg himself. Before the onset of the Clone Wars, two tombstones could be seen outside the homestead: one for Edern Lars, Cliegg's brother, and the other for Shmi. By the end of the Clone Wars, however, they were removed."}, {"tag": "p", "text": "In 0 BBY, Owen purchased two droids, C-3PO and R2-D2, from Jawa traders, He did not recognize, or chose not to acknowledge, C-3PO as the droid owned by Luke's father over two decades before, nor did he know R2-D2 held the secret plans for an Imperial superweapon and was being hunted by the Empire. When Imperial stormtroopers traced the sale of the droids to the Lars home and did not find them there, the farm was burned down with its occupants, Owen and Beru, still inside. The droids were safe in the care of Obi-Wan Kenobi and Luke Skywalker."}, {"tag": "p", "text": "Circa 1 ABY, the Rodian Zef Ando discovered the abandoned farm and decided to take the place for his own. Sometime after the Battle of Yavin, Luke returned to the ruins of his childhood home and paid last respects to his slain aunt and uncle. Tombstones were re-erected in the wake of their execution. Afterwards, he allowed the alien Throgg to take possession of the farm after he left Tatooine. This angered Huff Darklighter, the father of Luke's childhood friend Biggs, who wanted the property for himself. He convinced the Anchorhead Municipal Council to pass an anti-alien landowner tax. Unable to pay it, Throgg sold the farm to Jula Darklighter, Huff's brother."}, {"tag": "p", "text": "In the year 8 ABY, Han Solo and Leia Organa Solo traveled to Tatooine to acquire the Alderaanian Moss painting Killik Twilight, which contained coded information about Rebel agents deep under cover within the Imperial Remnant. While tracking down the painting, Leia and Chewbacca were caught in a sandstorm and found their way to the old Lars homestead, still owned by Jula Darklighter. While waiting for the storm to pass, Jula's wife, Silya, gave Leia an old journal she had found buried in the sand near one of the moisture vaporators. The journal had been recorded by Leia's grandmother, Shmi, and gave Leia an understanding of her father's background which had shaped the man, and monster, he had become. After the storm passed, Jula and Silya helped locate Han, who had been lost in the desert during the storm."}, {"tag": "p", "text": "Over a hundred years later, by 137 ABY, Luke’s descendant Cade Skywalker used the long-abandoned Lars homestead as a refuge during a sandstorm common to Tatooine. While there he had visions of the Lars family and Luke appeared to him. After a tense confrontation with his ancestor, he viewed a possible future of him becoming a Sith, with his loved ones dead at his feet. These visions helped Cade once again gain his bearings on the thin line he walked between the light side and the dark side of the Force; it remained abandoned after the sandstorm lifted and Cade and his company left."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lars homestead scenes from the entire saga were filmed in Tunisia, North Africa. The domed Lars homestead was left to decay after filming finished on the original Star Wars: Episode IV A New Hope, in 1976."}, {"tag": "p", "text": "The crater remained unchanged over the years and helped pinpoint the exact site location for new dome construction on Attack of the Clones in 2000. Movie magic deceives the viewer into thinking the dome, crater and inner courtyard are at the same location. The dome and crater rims reside at Nefta, while the courtyard is at the Hôtel Sidi Driss in Matmata, 249 kilometers away."}, {"tag": "p", "text": "In 2012, the homestead site was saved and restored by Terry Cooper, Mark Cox, Robert L. Cunningham, Mark Dermul, Imanuel Dijk, and Michel Verpoorten, who raised $11,700 from fans around the world, via a Facebook group."}, {"tag": "p", "text": "The Tatooine Training mission in the 2003 video game Star Wars: Rogue Squadron III: Rebel Strike starts at the Lars homestead."}, {"tag": "h3", "text": "Non-canonical storyline"}, {"tag": "p", "text": "During the Dark Times, Darth Maul, who had been outfitted with cybernetic legs after his bisection at the hands of Obi-Wan Kenobi, tracked the Jedi to the Lars homestead. Owen Lars tried to fight Maul but was disarmed. Kenobi, who had been hiding nearby, leapt out to engage the Sith Lord and defeated him. Kenobi held his lightsaber hilt at Maul's head, reluctant to kill him, but Lars shot the Sith with the remains of his rifle. Lars then ordered Kenobi to stay away from the infant Luke Skywalker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}