{"url": "Larsh_Hill", "categories": ["Category:Legends articles", "Category:Financial professionals", "Category:InterGalactic Banking Clan members", "Category:Males", "Category:Muuns"], "nodes": [{"tag": "h1", "text": "Larsh Hill"}, {"tag": "p", "text": "Larsh Hill was a Muun male financer and member of the InterGalactic Banking Clan. He was one of the most trusted agents and a friend of Hego Damask, alter ego of the Sith Lord Darth Plagueis, and even earlier, of Damask's father; the same role was played after his death by his son, the future Separatist Council leader San Hill."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Hill was well associated with Hego Damask, and was one of the first to meet him on Muunilinst in 67 BBY, after the injured Muun returned from Bal'demnic after killing his Bith Master, Darth Tenebrous. Hill was one of Damask's trusted allies and accompanied Damask practically on any business venture. Hill accompanied Damask to Naboo, for Damask Holdings to secure the plasma reserves with the aid of Bon Tapalo and Ars Veruna."}, {"tag": "p", "text": "In 52 BBY, Hill was given the honor to join the Order of the Canted Circle—this honor, however, proved fatal, as his initiation ceremony was chosen by the Maladian assassins hired by Pax Teem for their attack on Damask. In the Fobosi District of Galactic City, Hill, in the presence of Damask and the members of the Canted Circle, genuflected in front of a disguised Maladian assassin. A pendant was brought in a swinging motion to Hill's neck, which decapitated him immediately, and his head rolled a few meters away from his body as one after another of his hearts failed."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hill was a fatherly figure towards Hego Damask. He often showed concern towards the young Muun, but was occasionally exasperated by him. Hill valued business, but he sometimes displayed grudges with business partners, such as the Tonith family."}, {"tag": "h2", "text": "Appearances"}]}