{"url": "Lasavvou", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Ithorians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lasavvou"}, {"tag": "p", "text": "Lasavvou was a male Ithorian stranded on the moon Nar Shaddaa after the Jedi Civil War. The Ithorian couriered assorted cargo around the galaxy and was in the middle of such a delivery in 3951 BBY, taking a large shipment of cryogenic power cells to a contact that was supposed to meet him on the moon. However, his contact did not show up, leaving him unable to pay the departure fee imposed by the dock authority, a branch of the Exchange syndicate. As a result, he was denied permission to leave and the authority threatened to impound his ship. He was helped by Meetra Surik, who was able to negotiate a waiver of the departure fee for him. In exchange, Lasavvou gave the Exile one of the power cells and his word that he would transport a refugee, Kahranna, and her family off the moon. In reality, he was planning to leave without the refugees, but was Force persuaded to help the family by Surik."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lasavvou was a male Ithorian who couriered shipments across the galaxy. At some point, he joined the Ithorian Supremacy League, the nature of which he refused to reveal. In the middle of a delivery of cryogenic power cells in 3951 BBY, Lasavvou became trapped on the moon of Nar Shaddaa in the Outer Rim Territories. Although Lasavvou was able to pay the fee for landing at the docks with what credits he had, his contact did not show up, and so he was unable to pay the 600-credit departure fee to the dock authority, a branch of the Exchange crime syndicate. As a result, the dock authority threatened to impound his starship, confiscating the cargo. With the credits he had brought with him, he rented a room in a flophouse by the docks until he could scrounge together enough credits to pay the fee."}, {"tag": "p", "text": "The Ithorian was later approached by Meetra Surik, whom he initially believed to be from the dock authority. Surik offered to find a way to waive the departure fee for him, and in return, Lasavvou offered her one of the power cells should she be successful. Surik spoke to Fassa, the dock master, about waiving the fee and they settled on the condition that Lasavvou would give him one of the power cells in exchange. Lasavvou was delighted to hear that Surik was able to negotiate the fee and gladly gave Fassa a power cell. With the Ithorian's gratitude, Surik received her power cell as well. Surik also asked Lasavvou to take a woman from the Refugee Sector named Kahranna, as well as her family, with him off the moon. Secretly, the Ithorian planned to leave without the family, though Surik realized this and used the Force to persuade him into taking them along."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lasavvou was a male Ithorian who piloted his own starship as a courier. He was a strong believer in Ithorian supremacy, disliking other species because he perceived them as looking down on Ithorians, and thus joined the Ithorian Supremacy League. However, after accidentally saying the name to Surik, he would not speak of the organization and pretended to know nothing about it. When he agreed to bring Kahranna with him off-moon, this animosity toward other races led him to attempt to leave without her and her family. His ruse was discovered by Surik, who then Force-persuaded the Ithorian into keeping his word. Despite his dislike of other species, he was not above accepting help from a Human when it benefited him in the end."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lasavvou is a non-playable character from Obsidian Entertainment's Star Wars: Knights of the Old Republic II: The Sith Lords, made in 2004. Lasavvou's name is misspelled twice in the game as \"Lassavou.\""}, {"tag": "p", "text": "There are several options, both light- and dark-sided, for the exchange with Lasavvou to play out. If the Exile follows the dark path when the Ithorian asks if she is part of the dock authority, the player can say that she is and that they can negotiate a lower price. Lasavvou will then give her 200 credits to get more time to pay the fee, but will never talk to the Exile again. Alternatively, the player can tell Lasavvou that the player's characters are there to take his possessions, in which case he attacks the Exile and is killed."}, {"tag": "p", "text": "If the Exile follows the light side of the Force, which is the canonical choice, she talks to Fassa about the problem. Earlier in the game, the Exile has the opportunity to help Fassa with reordering ships that had docked; had she done this, Fassa waives the departure fee. If the Exile has not done so, she either pays the departure fee or arranges for Lasavvou to give Fassa some of the power cells in exchange for allowing the Ithorian passage off the moon; the Exile is still given a cell of her own in thanks. Depending on the player's Awareness stats, the player may or may notice when Lasavvou lies about his deal to transport Kahranna off-moon. If the Exile does not have enough Awareness points to do so, Lasavvou leaves without the family and the Exile is forced to find alternate transportation for them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}