{"url": "Laseema%27s_apartment", "categories": ["Category:Legends articles", "Category:Coruscant apartments"], "nodes": [{"tag": "h1", "text": "Laseema's apartment"}, {"tag": "p", "text": "Laseema's apartment was located on the planet Coruscant, at the edge of the city world's lower levels. Housed within the same permacrete complex as the Kragget all-day restaurant, the apartment occupied an entire floor above the diner and could be accessed from its rear. The apartment was purchased for Laseema—a Twi'lek woman formerly employed at Qibbu's Hut—by the Mandalorian soldier Kal Skirata in 21 BBY. During an anti-terror operation based at the Hut, Laseema had entered into a relationship with one of Skirata's surrogate sons, a clone commando by the name of Atin; considering the young woman as good as family due to that relationship, Skirata bought the home for Laseema in order to help her get a fresh start away from her exploitative employer. As the Clone Wars went on, the apartment came to serve as a safehouse and meeting place for the various members of Clan Skirata, before finally being abandoned in 19 BBY as Laseema and the Skirata clan departed Coruscant for Mandalore."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The apartment was located on Coruscant, the capital world of the Galactic Republic, nestled within the Core Worlds region of the galaxy. Housed within the same permacrete building complex as the Kragget all-day restaurant, situated at the edge of the ecumenopolis' lower levels, the apartment occupied an entire floor above the dining establishment, and gave off a sense of being an urban fortress. It was accessible from the rear of the Kragget, beyond the kitchens, using a turbolift or a flight of stairs, and required a code key to enter. The apartment's doors opened into a large living room—likely converted from a previous warehouse area—around which several other rooms were arranged, and had access to an emergency exit that led up the roof of the complex in which it was located. The apartment was furnished with a couch, several chairs, a table, a conservator that was kept stocked with food, and cabinets for storage. A mirror also hung on one of the walls of the apartment's living room."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 21 BBY, the Mandalorian soldier and Grand Army of the Republic military contractor, Kal Skirata, undertook an anti-terror operation alongside a team of clone commandos. During the course of the covert operation, the counter-terror team was based out of the Coruscanti cantina Qibbu's Hut, where a young Twi'lek woman by the name of Laseema was employed at the time; while the commandos were headquartered there, a clone soldier known as Atin entered into a relationship with Laseema. After their mission came to a successful conclusion, Skirata decided to help Laseema find a new life away from the exploitative, Hutt-owned cantina. He purchased an apartment for Laseema above the Kragget restaurant—a secure diner he and numerous officers of the Coruscant Security Force frequented—intending to allow the young Twi'lek to stay there free of charge. Though Laseema accepted Skirata's initial generosity and moved into the apartment, leaving her old job, she insisted on gaining employment at the Kragget as a waitress in order to remain self-sufficient."}, {"tag": "p", "text": "Later that year, following the birth of his grandson Venku, Skirata moved into one of the spare rooms of Laseema's apartment in order to house and care for the child, as his parents—clone commando Darman and Jedi General Etain Tur-Mukan—were on active duty with the Republic Grand Army. Not long after, another room was offered to Laseema and Skirata's good friend Bardan Jusik, a former Jedi Knight in need of a place to stay following his recent departure from the Jedi Order."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Laseema's apartment was first introduced to Star Wars canon via a mention in the third entry into the Republic Commando series of novels, True Colors, written by author Karen Traviss and published October 30, 2007. The apartment later appeared in full in Traviss' sequel to True Colors, Order 66, published just over a year later on September 16, 2008."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}