{"url": "Laser_trip_mine", "categories": ["Category:Canon articles", "Category:Wookieepedia former Good articles", "Category:Land mines"], "nodes": [{"tag": "h1", "text": "Laser trip mine"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Laser trip mines, also known as personnel mines, were powerful explosive devices that saw use during the Galactic Civil War between the Galactic Empire and the Rebel Alliance. Projecting a laser trigger upon activation, the mine would detonate when enemy infantry crossed the tripwire. The laser trip mine also had a built-in scrambler, jamming the scanners of enemies nearby."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The laser trip mine, or the personnel mine, was a powerful type of mine used for infantry combat. Handheld in size and triangular in shape, the black-colored device had a circular back. When activated, it would project a red or blue laser trigger from the charge's center to the nearest surface that intersected its path, along with flashing red lights and a beeping sound."}, {"tag": "p", "text": "The mine would detonate upon a soldier crossing the tripwire or when it was fired upon. The device additionally featured a built-in scrambler that jammed nearby enemy scanners."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The laser trip mines were used during the Galactic Civil War, a conflict between the Galactic Empire and the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The laser trip mine first appeared in the new Star Wars canon in the Death Star expansion pack for the video game Star Wars Battlefront, released in 2016. In the game, the mine appears as a \"Star Card\" ability that can be unlocked via an in-game challenge called \"Sapper.\" Star Wars Battlefront Companion, a supplementary mobile application for the game, also introduced the name personnel mine for the explosive. Originally featured in the 2002 Star Wars Legends video game Star Wars: Jedi Knight II: Jedi Outcast, the device was designed by 3D artist Erik Rading for Star Wars Battlefront."}, {"tag": "p", "text": "The laser trip mine also appeared in Star Wars Battlefront II in 2017, as a \"Star Card\" ability exclusively for the specialist trooper class, such as security battle droids, clone sharpshooters, and Imperial scout troopers. In both Battlefront games, the explosive can be used by troopers from all factions, including the Galactic Republic, the Separatist Alliance, the Galactic Empire, the Rebel Alliance, the New Republic, the First Order, and the Resistance. Furthermore, the mine's laser tripwire appears red to enemies, but it is seen blue by the teammates of the player who places the charge, and the explosive does not detonate when they cross it in both games."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}