{"url": "Latts_Razzi/Legends", "categories": ["Category:Legends articles", "Category:Bounty hunters", "Category:Females", "Category:Theelins"], "nodes": [{"tag": "h1", "text": "Latts Razzi"}, {"tag": "p", "text": "Latts Razzi was a female Theelin bounty hunter who was active during the Clone Wars. At some point in 20 BBY, she was affiliated with Boba Fett, Bossk, C-21 Highsinger, and Dengar. Her main weapon was a scaled grappling boa which, when used, snapped like a whip or lariat and was being used to grapple enemies. She also had a heavy blaster pistol, but did not use it as much as her whip. She was one of the bounty hunters during the job on Quarzite to help deliver cargo to Otua Blank."}, {"tag": "p", "text": "Shortly after this mission, Razzi was with Asajj Ventress in Chalmun's Spaceport Cantina in Mos Eisley. This coincided with Savage Opress being on Stobar in search of his brother."}, {"tag": "p", "text": "Sometime later, Razzi was on Nal Hutta under the employ of Jabba Desilijic Tiure. When Sith Lords Darth Maul and Savage Opress and Death Watch leader Pre Vizsla came seeking an alliance, the meeting did not go too well and the three retreated. Razzi was part of the team present that pursued the three."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Latts Razzi was a bounty hunter during the Clone Wars. During that time, Latts joined a team of bounty hunters under the leadership of Boba Fett on Tatooine. Razzi, along with fellow team members Bossk and Oked, went to Chalmun's Spaceport Cantina. After seeing Oked killed by Asajj Ventress, she and Bossk decide to invite her for drink and told her if she didn't join their team to fill in for Oked, they'd turn her to the authorities. Razzi and Bossk then took her to meet Fett and the others to take part in a job on Quarzite."}, {"tag": "p", "text": "The group was tasked with guarding a large wooden chest aboard a subtram, which was to be delivered to the planet's dictator Otua Blank. Though the trip began easily enough, soon the tram was beset by Kage Warriors, who sought the cargo for themselves. One by one, the hunters where tossed from the train by the warriors. Though Razzi was one of the last hunters standing, the Warriors' leader, Krismo Sodi, was able to dispatch her when she mistakenly grappled C-21 Highsinger. Sodi kicked Highsinger off the train and Razzi was pulled off with him."}, {"tag": "p", "text": "In their absence, Fett was also bested by Sodi, who soon revealed that the cargo was his sister, Pluma Sodi, who was to be forcibly wed to Blank. Ventress, having suffered many changes in her recent past, ended up placing Fett within the chest and selling him to Blank, collecting both a bounty from the warlord as well as from the Kage Warriors for freeing Pluma. She then shared the first bounty with Razzi and the others, telling them that Fett would join them soon enough."}, {"tag": "p", "text": "Razzi was later seen back at Chalmun's sharing a table with Ventress and was worried that her new associate was on edge."}, {"tag": "p", "text": "Sometime later, Razzi was on Nal Hutta under the employ of Jabba Desilijic Tiure. When Sith Lords Darth Maul and Savage Opress and Death Watch leader Pre Vizsla came seeking an alliance, the meeting did not go too well. Jabba summoned his bounty hunters, Razzi included, to attack. Vizsla set fire to the council table in order for Maul's group to escape. The bounty hunters chased them onto the landing platform where they were winning the fight until Bo-Katan and more Death Watch soldiers showed up, forcing the bounty hunters to retreat back inside."}, {"tag": "p", "text": "Once inside, the bounty hunters tried to take down Maul, Opress, and Vizsla but the three were too powerful. Defeated, Razzi and Dengar tossed smoke grenades down the hall to cover the escape of their fellow bounty hunters Embo, Sugi, and Marrok. Razzi and the others fled the palace and Maul allowed them to leave as they were only bounty hunters."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Razzi was shown to be indifferent to the job at hand as long as she got paid. However, she also showed some concern about her fellow hunters as shown when she worried about the Dark Jedi-turned-bounty hunter Asajj Ventress."}, {"tag": "h2", "text": "Talents and abilities"}, {"tag": "p", "text": "Latts was proficient in hand-to-hand combat, as shown when she fought against the Kage Warriors, and in the use of her grappling boa, a weapon as of yet unique to her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Latts Razzi was voiced by Clare Grant in the fourth season episodes \"Bounty\" and \"Brothers\", and the fifth season episode \"Eminence\" of The Clone Wars."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}