{"url": "Lauli_Wahlo/Legends", "categories": ["Category:Legends articles", "Category:Criminals", "Category:Cyborgs", "Category:Males", "Category:Quarren", "Category:Business owners and executives"], "nodes": [{"tag": "h1", "text": "Lauli Wahlo"}, {"tag": "p", "text": "Lauli Wahlo was a male Quarren who lived in the underworld of the planet Coruscant during the Clone Wars. During the war, he and his Twi'lek associate Jan Dez were approached at Wahlo's noodle shop by Jedi Padawan Ahsoka Tano and Master Tera Sinube, who were looking for Tano's stolen lightsaber. Wahlo answered them that he knew where to buy one, but once the Togruta revealed herself to be a Jedi, Dez explained that her weapon had been pilfered by Bannamu, who could be found at the Spider Arms Hostel."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the first year of the Clone Wars, the Quarren Lauli Wahlo was serving a hungry Ithorian at his noodle shop when the elderly Jedi Master Tera Sinube and the young Ahsoka Tano came looking for the latter's lightsaber, which had been stolen from her by a pickpocket during the arrest of the Weequay arms dealer Car Affa who sold weapons to the Separatists. Wahlo admitted that he knew where to get a lightsaber for a price of 20,000 credits. Tano, anxious to get her weapon back, revealed that she was a Jedi and the rightful owner of the weapon. Wahlo's Twi'lek counterpart, Jan Dez, told her that her lightsaber was in the possession of a Patrolian criminal named Bannamu, who stayed at the Spider Arms Hostel."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lauli Wahlo was a blue-eyed and orange-skinned Quarren, who owned a small noodle shop which was located in the lower part of Coruscant. At some point before 22 BBY, he had lost his right eye and it was replaced with a cybernetic one. Although a criminal, he did not like betraying one of his old friends, Bannamu, but because the Patrolian had stolen Tano's lightsaber and she wanted it back, Wahlo made a rare exception."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lauli Wahlo made his only appearance so far as a minor character in the eleventh episode of the second season of the The Clone Wars television series, \"Lightsaber Lost\" which aired on January 22, 2010. James Arnold Taylor voiced Wahlo, who was credited as \"Bounty Hunter #1\". Taylor also spoke the voices of Bannamu and the Spider Arms Hostel attendant in the same episode."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}