{"url": "Aralia", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Antemeridian sector planets", "Category:Confederacy of Independent Systems planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Aralia"}, {"tag": "p", "text": "Aralia was a tiny, semi-tropical world located in the Andron system of the Outer Rim's Antemeridian sector."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Under the Galactic Republic, spice-trade was outlawed and smuggling the substance was made a capital offense in 980 BBY. Aralia continued to see success as a resort world, but suffered a setback circa 200 BBY[source?] when a spice-smuggler crash-landed in the jungles. On board the ship was a nest of Ranats, a mildly-intelligent species which had evolved on the planet Rydar II. Calling themselves the Con Qeecon or \"the conquerors\", the Ranats quickly multiplied and began building their underground maze of warrens. Infesting the ground and depleting the food supply of many of the native wildlife, the Ranats became more of a nuisance then a welcome co-inhabitant of the world."}, {"tag": "p", "text": "Joining the Confederacy of Independent Systems during the Clone Wars, the planet was subjugated by the Galactic Empire when the CIS was defeated. Under Imperial rule, the Human inhabitants initiated Project Aralia,[source?] a massive amusement park designed to boost the economy on Aralia. During this time, the Ranat colonies, which each maintained a population of one hundred individuals, began to interfere in the construction of the massive park. Angered, the Humans called for their eradication and the Empire obliged. The Imperial governor issued a decree stating that Ranats could be killed in self-defense and that they were barred from purchasing or owning weapons. Darth Vader personally helped to drug groups of Ranats and use them as guards for some of the extermination camps built on the planet."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}