{"url": "Lawquane_farmstead", "categories": ["Category:Legends articles", "Category:Articles needing verification", "Category:Farms", "Category:Saleucami locations"], "nodes": [{"tag": "h1", "text": "Lawquane farmstead"}, {"tag": "p", "text": "The Lawquane's farmstead was a farm located on the Outer Rim world of Saleucami, within the planet's wetland region. The home of the Lawquane family—comprised of former clone trooper Cut Lawquane, his Twi'lek wife Suu, and their two children, Shaeeah and Jek—the farm enjoyed lush soil and good weather, contributing to a fertile growth of crops. The Lawquane farmstead was also home to a herd of eopies, which the family raised for milk and meat, and kept as beasts of burden. During the second year of the Clone Wars, the farm and the Lawquane family were drawn into a battle between the forces of the Galactic Republic and the droids of the Confederacy of Independent Systems when an escape pod filled with damaged commando droids was activated in the nearby fields. The battle droid commandos were repelled by the combined efforts of Cut Lawquane and his temporary guest, Clone Captain Rex, saving his family and protecting the farm."}, {"tag": "h2", "text": "Layout"}, {"tag": "p", "text": "The Lawquane farmstead's central feature was the main farmhouse, an unattractive mix of wood, starship parts, and other assorted material that had been scavenged for its construction. Nearby was a barn used to house the farm's eopies, and outside, a corral for containing the herd. The Lawquane family raised these hardy beasts for their milk, meat, and hides, in addition to keeping them as beasts of burden for use around the farm. On the farthest reaches of the farmstead were the agricultural fields, where the family grew their crops in the lush soil and good weather afforded by Saleucami's wetland region."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Following his desertion from the Grand Army of the Republic after a disastrous battle with the forces of the Confederacy of Independent Systems over the planet Saleucami, the former clone trooper Cut fell in love with a female Twi'lek by the name of Suu Lawquane. The two were married and Cut adopted Suu's two children, Shaeeah and Jek, becoming a family. Together, they made the modest farm their home, and made a good life for themselves growing crops and raising eopies. Far from the front lines of the Clone Wars, the family enjoyed the peaceful evenings their farm home provided."}, {"tag": "p", "text": "The peace they enjoyed would be threatened by the arrival of Confederacy forces under the command of General Grievous. After suffering a loss against the Republic's Clone Army in Saleucami's orbit, Grievous and his droids made planetfall in a number of escape pods. One heavily damaged pod crashed on the outskirts of the Lawquane farmstead, where it and its commando droid occupants were accidentally activated by Shaeeah Lawquane. As the commando-series battle droids turned on the farmhouse, Cut took up arms to protect his family and home with the assistance of Captain CT-7567—known informally as \"Rex\". Previously injured by another commando droid, Rex had been given refuge at the Lawquane farmstead while his wound healed. Now under attack, the two clones fought and destroyed the droids, keeping Lawquane and his family safe, and avoiding more than minimal damage to the farmhouse. Rex left the farm to rejoin his unit the following morning, deciding against turning Cut Lawquane in as a deserter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}