{"url": "Lawquane_family", "categories": ["Category:Legends articles", "Category:Stub", "Category:Families", "Category:Farmers"], "nodes": [{"tag": "h1", "text": "Lawquane family"}, {"tag": "p", "text": "The Lawquane family was an intermixed family of Twi'leks and a Human, who lived on the Outer Rim world of Saleucami during the Clone Wars. Initially comprising the pink-skinned Lethan Twi'lek female, Suu Lawquane, and her two children, Shaeeah and Jek Lawquane, following his desertion from the Grand Army of the Republic, the former clone trooper Cut married Suu and adopted her two children. The four of them made a life for themselves on a farm they called their own, located in the wetland region of Saleucami, where they grew crops and raised a herd of eopies."}, {"tag": "p", "text": "After suffering a loss against the Galactic Republic's Clone Army in orbit over Saleucami, the Supreme Commander of the Droid Armies, General Grievous and his droids made planetfall in a number of escape pods. One heavily damaged pod crashed on the outskirts of the Lawquane family farmstead, where it and its commando droid occupants were accidentally activated by Shaeeah Lawquane. As the commando-series battle droids turned on the farmhouse, Cut took up arms to protect his family with the assistance of Clone Captain Rex. Previously injured by another commando droid, the Lawquane family had provided Rex with a place to stay at the farmstead while his wound healed. Now under attack, the two clones fought and destroyed the droids, keeping the Lawquane family safe from harm. Despite standing orders to the contrary, Rex left the farm to rejoin his unit the following morning, deciding against turning Cut Lawquane in as a deserter for the sake of allowing the family to stay together."}, {"tag": "p", "text": "The Lawquanes' story would come to the attention of the greater galaxy during the New Republic era, when the adult Shaeeah Lawquane published her memoir My Stepfather's Face: A Soldier's Secret."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}