{"url": "Lazslo", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Humans", "Category:Males", "Category:Mechanics", "Category:Resistance members"], "nodes": [{"tag": "h1", "text": "Lazslo"}, {"tag": "p", "text": "Lazslo was a male human who served as a head mechanic in the Resistance."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lazslo worked as the head mechanic aboard the MC85 Star Cruiser Raddus, and assisted with the cruiser's automation refit during the evacuation of D'Qar. He chastised Rose Tico for studying the ship's schematics while the rest of the crew worked, and suggested she'd learn about the ship by getting her hands dirty. Later he and other flight techs were called to the control room, where General Leia Organa informed them that the refit had jammed the hangar doors, preventing their pilots from assisting Commander Poe Dameron in a dogfight with several First Order TIE fighters. Lazslo informed her he would check the main access panel, though he discovered the problem was more complex than he thought when all doors on the ship closed, locking the mechanics out of the control room and Lazslo from the rest of the ship's system. However, Tico found the Mon Calamari failsafe automatic reboot code in the schematics, and was able to unlock the ship to let the pilots soar to Dameron's rescue. Lazslo joined in celebrating the victory as the ship's crew cheered Tico's ingenuity."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lazslo was a gruff human male who prized practical hard work over reading and study, and believed the only way to get to know a new ship was to get one's hands dirty. He butted heads with Rose Tico over this during the evacuation of D'Qar, and asserted his superiority as head mechanic. Poe Dameron joked that he could grumble the ears off a Gungan, and that the only things worse than problems were Kowakian monkey-lizards with Hutt fleas, and Lazslo's morning breath. However, he was not above celebrating a victory, and cheered for Tico after she helped save Dameron from TIE fighters."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}