{"url": "Lead_Cloning_Technician", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Imperials", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Technicians of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Lead Cloning Technician"}, {"tag": "p", "text": "The Lead Cloning Technician was an Imperial scientist who was stationed on the planet Kamino, the homeworld of the Kaminoan race that developed the Clone Army of the Old Republic. At the time when the Lead Cloning Technician was stationed on Timira City, Kamino had long since lost its freedom; its people became obligated to serve the Republic's successor state, the Galactic Empire. Under the Technician's observation, the Imperials eventually developed the \"accelerated cloning process,\" a procedure that engineered stormtrooper clones at a much faster rate than the Kaminoan method and Spaarti technology. At the behest of the Sith Lord Darth Vader, the Technician was placed in charge of a clandestine project: the creation of a perfect clone of Galen Marek, Vader's secret apprentice who perished in an act of rebellion against the Sith Order."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lead Cloning Technician of Timira City, a Kaminoan cloning facility located on the planet Kamino, was tasked with a seemingly impossible task in 1 BBY: the creation of a stable clone of a Force-sensitive genetic template. At the time, there had never been a known successful attempt to clone a subject who was strongly connected to the power of the Force. Although the exact reason was unknown, it was generally assumed that the Force was somehow responsible for the instabilities that undermined the development of Force-sensitive clones."}, {"tag": "p", "text": "Darth Vader, Dark Lord of the Sith and apprentice to Emperor Palpatine, was determined to achieve the impossible, and thus the Lead Cloning Technician was assigned to engineer the first successful clone of a Force-sensitive subject. The genetic template, from which the Force-induced DNA would be extracted from, was the deceased body of Galen Marek, a former Sith assassin who once served Darth Vader under the codename of \"Starkiller.\" The motive behind Vader's actions was the assassination of his own Master, an act which he was incapable of achieving on his own. As such, the operation to duplicate Marek's genetic code was classified and conducted within the secret laboratories of Timira City. In order to prevent Marek's DNA from becoming compromised by the natural process of decomposition, the former secret apprentice's corpse was frozen and preserved within a secret chamber in Timira City, thus preventing it from rotting. Although the Lead Cloning Technician desired greater access to the template itself, Darth Vader alone possessed unrestricted access."}, {"tag": "p", "text": "The flaws within the accelerated cloning process, combined with the inherent difficulty of replicating an exact copy of a Force-sensitive subject's genetic code with perfect precision, essentially made the project a frustrating series of \"trial and error\" attempts. After roughly six months since the project began, Timira City's laboratories were filled with hundreds of aberrant monstrosities, completely unstable and utterly deranged in mind. Through unyielding determination and labor, the Lead Cloning Technician slowly but steadily corrected the various mistakes, which eventually led to more stable subjects."}, {"tag": "p", "text": "As further attempts to clone Marek gradually led to greater progress, the frequency and intensity of instabilities became increasingly rare with each clone. Physical deformities were eliminated, and thus the improved clones bore an exact physical resemblance to their genetic donor at the time of his death. Yet while the physical aspect was corrected, the unstable minds of the clones remained a dilemma for some time. The clones that Darth Vader personally trained proved too inadequate to replace Marek at the Sith Lord's side. The primary factor behind their collective failure was Marek's own mind. The apprentice's memories had been downloaded into the clones as a form of flash training, thus enabling them to utilize their genetically inherited gifts almost immediately after their creation."}, {"tag": "p", "text": "But the clones acquired more than just the knowledge of Marek's skills due to the memory imprints; they gained the memories of his life and experiences, as well as certain emotional attachments. Ultimately, however, some clones were emotionally different than others. During their training in lightsaber combat against Sith Training Droids, certain clones refused to destroy the droids that were disguised as Marek's long dead father. Other clones were too distracted by memories of the child that their progenitor had once been. The Lead Cloning Technician observed one particular clone who was unable to attack a Sith Training Droid. Although the subject struck down every camouflaged droid without hesitation, an undisguised droid triggered the memory of PROXY, due to its similar appearance to the apprentice's holodroid friend."}, {"tag": "p", "text": "As the project neared its end, only two clones proved to be more stable than those that preceded them: the so-called Starkiller and the Dark Apprentice. Although the two were virtually identical in various ways, only the latter proved worthy to become the new disciple of Darth Vader. Starkiller, the clone who eventually became known by his progenitor's former codename, succeeded in his trials to the point where Vader assumed that he would be the first success in a very long line of failures. But as with the others who became compromised by certain emotional attachments due to the memory imprints, Starkiller was ultimately deemed as yet another disappointment because of his obsession with Juno Eclipse, the Human female whom Marek fell in love with. This obsession caused the clone to rebel against his Master by escaping from Kamino in order to locate Eclipse."}, {"tag": "p", "text": "The clone who became Darth Vader's \"Dark Apprentice\" proved to be far greater and more impressive than his renegade \"brother,\" as well as the rest of his imperfect precursors. Although his rate of progress impressed both Vader and the Technician who observed his development, the clone was initially troubled as the others were, but to a lesser degree. Early signs of his inherent weaknesses included the first memory he experienced upon his decanting—a memory of Juno Eclipse. In spite of his initial curiosity about her whereabouts, the clone maintained a steady focus on the objective of passing his trials without error. Nevertheless, he still experienced the same identity crisis that drove his brothers to madness, but eventually overcame the side-effects after compartmentalizing Marek's memories, an action which allowed him to distinguish his own experiences from those of Marek."}, {"tag": "p", "text": "The clone's rate of success astounded the shocked Lead Cloning Technician, who finally concluded that the project was finally ready to be deemed a success. With the project's conclusion, the Technician anticipated an opportunity to leave Kamino for home. By this time, the results of the entire project had been recorded onto the Technician's personal entry logs in the form of a private journal. In the aftermath of the Assault on Kamino, fought between the Alliance to Restore the Republic and the Galactic Empire, the Technician's notes were found in the garbage processing facility on Kamino Station X."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Lead Cloning Technician found the aberrant clones' meaningless gibbering to be extremely disturbing. The constant rate of failures greatly vexed the Technician, who hoped in vain for greater access to the source of the Force-sensitive genetic material. Having become accustomed to a steady series of one disappointment after another, the Technician was joyously elated and encouraged by the progress made by the Dark Apprentice, a clone who succeeded where all of the others failed. All of the Technician's hopes became invested in the final outcome of the dark clone, and thus it was the Technician's great hope that the project would finally be concluded after months of laborious, error-filled procedures. Furthermore, the Technician was also eager to complete Darth Vader's project in order to return to home and family."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lead Cloning Technician's logs appear in the in-game Databank of the 2010 video game Star Wars: The Force Unleashed II. It is possible that the Lead Cloning Technician is the same character as the Unidentified cloning technician from the Star Wars: The Force Unleashed II - Cloning Tank interactive online feature, as they both kept similar logs in terms of content and mannerisms and were in charge of important clone subjects. He may also be the same technician killed by Boba Fett in the Force Unleashed II comic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}