{"url": "Leafar", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Leafar starships", "Category:Undefined social groups"], "nodes": [{"tag": "h1", "text": "Leafar"}, {"tag": "p", "text": "The Leafar were a group involved in merchant shipping based out of the Leafar system. Shortly after the Battle of Yavin, they began to challenge the Galactic Empire. The Empire responded by sending the Imperial-class Star Destroyer Badi Dea to attack their shipping convoys. The ambush was foiled by the Alliance to Restore the Republic, which, initially, sent five X-wing starfighters to protect Leafar shipping. Three separate groups of Leafar ships were defended by the Alliance, which called in reinforcements as the battle continued. The Leafar later aided the Alliance by supplying it with information on a new shield technology being produced by the Empire."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Leafar were a group who controlled the Leafar system, located in the Greater Plooriod Cluster of the Expansion Region. They were involved in merchant shipping. Shorty after the destruction of the first Death Star over Yavin 4 in 0 ABY, they began to actively challenge the Galactic Empire. In retribution, the Empire dispatched the Imperial-class Star Destroyer Badi Dea to an important Leafar transfer point located near their system, with the aim of destroying numerous Leafar merchant vessels. Unaware of the Imperial presence, a Leafar convoy consisting of five passenger-carrying CR90 corvettes from the Yavin Express group, three goods-carrying BFF-1 bulk freighters from the Cargo-Go group, and seven Lambda-class shuttles from the Lambda group began to emerge from hyperspace at the transfer point."}, {"tag": "p", "text": "Rather than the Imperial forces waiting in ambush, however, the Leafar witnessed a battle already underway: five T-65 X-wing starfighters from the Alliance to Restore the Republic were engaging TIE/Advanced starfighters and TIE/sa bombers from the Badi Dea. The leadership of the Rebel Alliance had heard of the Leafar's growing insurgency, and, hoping to gain a new ally, they had dispatched Keyan Farlander and four other pilots from Red Squadron to the Leafar way-point. With the arrival of the Leafar convoy, the Imperial bombers began targeting the merchant ships, prompting Farlander to focus on destroying the bombers, while his wingmates held off the TIE Advanced."}, {"tag": "p", "text": "Given the significant Imperial presence, the Rebels brought in reinforcements, with two RZ-1 A-wing interceptors from Gold Squadron arriving several minutes into the engagement. Thirteen minutes later, the MC80 Star Cruiser Maria and the EF76 Nebulon-B escort frigate Whitehawk arrived, launching additional starfighters. The combined Rebel forces were able to hold off several waves of Imperial starfighters long enough for the majority of the Leafar convoy to escape, before disengaging themselves. Of the total Leafar ships, at least three corvettes, two freighters, and four shuttles were able to escape the ambush."}, {"tag": "p", "text": "Following this assault, the Leafar were able to supply the Rebel Alliance with some intelligence that they had gained on Imperial plans. The Alliance had captured several TIE/Advanced starfighters with a new shield technology, and the Leafar knew this was being developed for use with larger starships, such as Corellian corvettes. Following receipt of this information, the Alliance eventually managed to capture the prototype corvette Blade 5, using it to ram the bridges of numerous Star Destroyers as part of Operation Ram's Head."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Leafar were created for Star Wars: X-Wing Tour of Duty: Imperial Pursuit, the first expansion pack for the award-winning computer game Star Wars: X-Wing, created by LucasArts and released in 1994. The Leafar were connected with two missions carried out by the player in the role of Keyan Farlander. In the first, their convoy is under attack, while in the second, they are only mentioned in its framing story. The Leafar system was later included in an update to the Star Wars: The Essential Atlas Online Companion."}, {"tag": "p", "text": "The X-Wing Collector's CD-ROM: The Official Strategy Guide, published in 1995 by Prima Games, provided players with walkthroughs of the relevant missions, presented as Farlander's mission reports. Consequently, while it is in theory possible for a player to complete the mission prior to the arrival of the Maria and Whitehawk, canonically Farlander did not. There is no canonical number of Leafar starships that survived, but there is a minimum of nine—three corvettes, two freighters, and four shuttles—set out for the mission to be successful."}, {"tag": "p", "text": "While the Leafar control a star system and are an entity capable of joining the Rebel Alliance, it is not made clear whether they are a species, a culture, or an organization. Until canon clarification, this article treats them as a generic organization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}