{"url": "Leaf_shoe", "categories": ["Category:Legends articles", "Category:Footwear"], "nodes": [{"tag": "h1", "text": "Leaf shoe"}, {"tag": "p", "text": "Leaf shoes were articles of clothing used by the Ewoks that allowed the user to walk up vertical surfaces. The shoes were invented by the Ewok Princess Kneesaa a Jari Kintaka during the Stranglethorn crisis, using inspiration from the Ketes."}, {"tag": "h2", "text": "Invention"}, {"tag": "p", "text": "During a mission to the Kete hive, Kneesaa and her companion Wicket Wystri Warrick witnessed a Kete walking straight up the outside of his hive, using his sticky feet to anchor himself to the outside walls. As the Ewoks also needed to enter the hive, Kneesaa devised a plan to duplicate the Ketes ability. Grabbing several leaves from around the area, the young Ewok dipped the bottom side of the leaves into a sticky bog that surrounded the hive. The two Ewoks then tied the leaves around their feet, giving them the ability to walk straight up the outside of the hive as well."}, {"tag": "h2", "text": "Use"}, {"tag": "p", "text": "After obtaining a nectar pearl from the hive, the two Ewoks returned to their village to combat the stranglethorn that was threatening their way of life. The sticky shoes were once again employed during this combat, as several of the young Ewok woklings had been trapped in the highest tree by one of the stranglethorns. Kneesaa equipped the shoes once again to walk vertically up to the imprisoned Ewoks and defeat the carnivorous plant. After reaching the woklings, Kneesaa created custom leaf shoes for all of them, so they could follow her back down the tree. The young Ewoks and their rescuers made it down the tree just as the Ewoks began to celebrate the defeat of the stranglethorn thanks to Wicket's efforts."}, {"tag": "p", "text": "The Ewoks were impressed with Kneesaa's invention, and even old Shaman Logray decided to use the shoes to test their effectiveness. Although the shoes were useful tools in scaling the trees of the village, they apparently fell into disuse after the stranglethorn crisis, either because they were not needed or because the Ewoks ran out of the sticky substance that had been obtained from the Kete hive."}, {"tag": "h2", "text": "Appearances"}]}