{"url": "Learn_to_Draw_Star_Wars:_Villains", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Learn to Draw Star Wars"], "nodes": [{"tag": "h1", "text": "Learn to Draw Star Wars: Villains"}, {"tag": "p", "text": "Learn to Draw Star Wars: Villains is a canon activity book that provides step-by-step instructions on how to draw Star Wars villains. The book was written and illustrated by Russell Walks, and it was published on November 6, 2018 by Walter Foster Publishing."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Learn to Draw Star Wars: Villains will teach you to draw your favorite villains from the Star Wars galaxy—from the lowly stormtrooper and the notorious bounty hunter Boba Fett to the infamous crime lord Jabba the Hutt and the terrifying Sith Lord Darth Vader."}, {"tag": "p", "text": "In this 128-page drawing guide, Lucasfilm collaborator and professional artist Russell Walks shows artists of all skill levels how to render their favorite Star Wars villains as detailed pencil portraits. After a brief introduction to drawing tools and materials, basic pencil techniques, shading techniques, and how to depict different textures, the book dives right into step-by-step drawing projects. See how each drawing lesson begins with basic shapes, with each new step building upon the last, eventually progressing to a finished fine art piece. Experience this legendary series from a whole new perspective as you develop your drawing skills with the easy-to-follow step-by-step instructions, insightful character notes, and drawing tips."}, {"tag": "p", "text": "Included in Learn to Draw Star Wars: Villains are drawing projects for Darth Maul, General Grievous, Count Dooku, Emperor Palpatine (Darth Sidious), Darth Vader, Bib Fortuna, Jabba the Hutt, Boba Fett, Kylo Ren, Captain Phasma, and Supreme Leader Snoke. Russell Walks also shows how to best depict a villainous character, four ways to draw lightsabers, a comparison of Darth Vader and Kylo Ren's masks, the differences between Jango Fett and his clone Boba, how to draw different types of stormtrooper helmets, and more."}, {"tag": "p", "text": "So grab your drawing pencils, and use the Force—or join the Dark Side—on your artistic journey through the Star Wars galaxy!"}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}