{"url": "Learning_Patience", "categories": ["Category:Real-world articles", "Category:Star Wars Rebels Magazine comics"], "nodes": [{"tag": "h1", "text": "Learning Patience"}, {"tag": "p", "text": "\"Learning Patience\" is a comic story written by Martin Fisher, drawn by Ingo Römling, and edited by Gunther Nickel. The story was published in the second issue of Star Wars Rebels Magazine, which was originally released in the UK on February 25, 2015, and later in the US on December 15, 2015."}, {"tag": "h2", "text": "Plot"}, {"tag": "p", "text": "Aboard the Ghost, Ezra Bridger and Kanan Jarrus continue Jedi Training as Ezra attempts to stack a cup onto another cup on the Ghost's Dejarik Hologame table. Unable to do so, Kanan instructs Ezra to clear his mind and concentrate - something Ezra simply can't achieve. Frustrated that he is unable to complete the task before him, Ezra questions his ability to train as a Jedi, to which Kanan offers that patience is one of the most valuable skills a Jedi can learn, as one day lives may depend on it."}, {"tag": "p", "text": "The next day, as the Ghost is engaged by an Imperial transport Ezra, Hera, Sabine, and Chopper attempt to out maneuver the Empire in an Ion Storm. Narrowly escaping their attackers, the Ghost and the Imperial transport lose power in the storm. With no time to lose and moderate damage to several of the Ghosts' systems from the ion storm, the Ghost crew, minus Kanan and Garazeb Orrelios who are away in the Phantom, go to work to repair the ship before their attackers find them. With Sabine and Chopper busy, Ezra is tasked with working on reconnecting the power grid."}, {"tag": "p", "text": "A short time later, a frustrated Ezra again finds himself unable to complete the task until Chopper arrives to help him. Disappointed in himself Ezra, confides to Hera that he feels useless, and is not able to help out with repairs to the Ghost or do well in his Jedi training. Hera only offers him a sliver of advice before heading back to the engines to help Sabine with the targeting systems."}, {"tag": "p", "text": "On the bridge Ezra, attempting once again to focus on his work, finds it blowing up in his face literally. Hera who enters the cockpit of the Ghost almost immediately after informs and apologizing Ezra that there is no more time because the Imperial Transport managed to get it's engines back online. With both of them realizing it would only be a matter of time before they destroyed. Realizing they are out of time and can't sit still any longer, Hera attempts to get the Ghost moving. Ezra, still unable to fix the console, closes his eyes and extends his hand, an act which confuses Hera. With Sabine, who finished fixing the targeting systems and can't fire the Ghost's weapons until Ezra is finished with the repairs to the console in the cockpit; and Hera, scrambling to keep everyone alive by getting the ship out of harms way - everyone looks to Ezra to who focuses and uses the force to manipulate the parts into an almost immediate repair. With the turbolasers back online, Sabine destroys the Imperial Transport, whose shield was still down, as Hera gets the Ghost out of the Ion Storm. Ezra and the rest of the crew make the jump to hyperspace to rendezvous with Kanan and Zeb."}, {"tag": "p", "text": "The rest of Ghost crew is picked up somewhere in space. As the Phantom links back up with the Ghost. Sabine and the crew learn about a Imperial transmission center destroyed by Kanan and Zeb on their mission. Kanan, laughably frustrated that the other half of the crew isn't talking about their mission, is jokingly told by Ezra to have some patience."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}]}