{"url": "Aramis", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Humans", "Category:Males", "Category:New Mandalorians"], "nodes": [{"tag": "h1", "text": "Aramis"}, {"tag": "p", "text": "Aramis was a human male who served Duchess Satine Kryze and was killed in a plot to assassinate Satine Kryze when his speeder's controls were compromised."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 21 BBY, Aramis was assigned to transport Duchess Satine Kryze and three of her guards from Coruscant. They had just departed a Galactic Senate meeting convened to discuss whether the Republic should invade Mandalore to deal with the group known as Death Watch, which had been terrorizing Mandalore. Death Watch sabotaged the transport's controllers when it was high above the ground. Kryze asked what was happening, and Aramis said it was the navigation computer. Realizing that all hope of transporting Kryze where she wanted to go was lost, Aramis told her he'd try to get near a landing platform. As soon as he got near the landing platform, he ordered Kryze's guards to jump. Aramis stayed on the transport, which lost control entirely and crashed into a building, killing him."}, {"tag": "p", "text": "Kryze informed the Republic of the incident. The Republic decided not to pursue charges related to Aramis's death, since they thought it was only an accident. When she informed them of the timing, directly after the Senate meeting, the Republic agreed that they must invade Mandalore. Later, after seeing a hologram of Deputy Minister Jerec, the Republic changed their minds."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Aramis had light brown eyebrows, blue eyes, and light skin. He was willing to die for Duchess Satine Kryze."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aramis was voiced by Corey Burton."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}