{"url": "Aramis/Legends", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:New Mandalorians", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Aramis"}, {"tag": "p", "text": "Aramis was a male Human speeder pilot for Duchess Satine Kryze of the Mandalore system during the Clone Wars. In 22 BBY, Aramis was transporting Duchess Kryze from the Republic Senate Building on Coruscant when his airspeeder was sabotaged by the Death Watch, a terrorist organization trying to kill Kryze. Barely having any control over the damaged speeder, Aramis was able to fly close enough to a balcony so that the Duchess and her guards were able to jump off the speeder before he crashed it into a building, resulting in his death."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Aramis was a Human male airspeeder pilot for the Duchess Satine Kryze of the Mandalore system. Around 22 BBY, during the Clone Wars, Aramis was flying the Duchess and three of her guards from the Galactic Republic Senate Building on the capital world of Coruscant, in a ComfortRide passenger airspeeder. However, unbeknownst to Aramis, their speeder had been sabotaged by Death Watch, a terrorist group from Mandalore trying to kill Kryze so that they could take over the system. As Aramis's speeder left the Senate Building, a member of Death Watch detonated an explosive in the speeder, disabling one of its engines and deactivating its navigation computer."}, {"tag": "p", "text": "Aramis began lose control of the airspeeder, which started to fall from the airlanes. Managing to steer the speeder towards a nearby balcony, Aramis ordered the Duchess and her guards to jump out of the speeder to safety while the pilot kept the ship somewhat stable. Kryze, reluctant to jump and leave Aramis in the damaged speeder, tried to protest, but her three guards forced her out of the descending ship and onto the balcony. With his four passengers safe, Aramis lost complete control of his ship, and the speeder crashed into a building, killing the pilot."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Aramis cared about the Duchess Satine, enough that he was willing to sacrifice his life so that she and her guards could jump to safety. Aramis was also a skilled enough pilot that he was able to regain partial control of a heavily damaged airspeeder."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Aramis first appeared in the 2010 \"Duchess of Mandalore\", the fourteenth episode in Season Two of The Clone Wars television series. In the episode, Aramis was voiced by Corey Burton."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}