{"url": "Lecersen_Conspiracy", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Core Worlds organizations", "Category:Galactic Alliance organizations", "Category:Imperial organizations"], "nodes": [{"tag": "h1", "text": "Lecersen Conspiracy"}, {"tag": "p", "text": "The Lecersen Conspiracy was a clandestine organization of various individuals bent on overthrowing the leadership of both the Galactic Federation of Free Alliances and Imperial Remnant, to form a new government in its wake."}, {"tag": "p", "text": "Organized in 44 ABY and led by Kuati Senator Haydnat Treen, conspirators included fellow Senator Fost Bramsin, Alliance Chief of Starfighter Command Merratt Jaxton, Alliance Chief of Naval Operations Sallinor Parova, and Moff Drikl Lecersen of the Imperial Remnant."}, {"tag": "p", "text": "Their plan was to restore the Galactic Empire to what it was in the immediate wake of the Clone Wars, with Lecersen succeeding the late Palpatine as the Emperor and Treen as Grand Moff and possibly Empress. They ensured that Daala became more and more isolated, even from her own security detail and that the Jedi were convinced she was targeting them. This included Operation Duusha, an attempt to frame Daala for an attack on Han and Leia Solo and undermine her standing as Chief of State, and the attempted assassination of Nek Bwua'tu. The latter attack allowed them to replace him with Parova and also removed one of Daala's key supporters and one of the few intermediaries between her government and the Jedi Order. The conspiracy was about to execute their takeover when the Jedi enacted their own coup against Daala. Treen adapted the plan knowing their own plans would be in ruin if they did not adapt."}, {"tag": "p", "text": "The new transition government was headed by the Triumvirate comprising of Jedi Master Saba Sebatyne, Treen and Jaxton, thus giving the conspirators control of two-thirds of the new executive body. Afterwards, they gained a new member, the General Stavin Thaal, and started plans to overthrow Fel. However, they made a fatal mistake when they added to the conspiracy the new senator Kameron Suldar, who was actually the Lost Tribe High Lord Ivaar Workan; as a result, they became co-involved in the fighting between the Jedi and Abeloth as well as her Sith allies. During this time, Natasi Daala, the deposed Chief of State, had discovered that Lecersen had been behind the formation of the Freedom Flight which had partially led to her overthrowing. She blackmailed him and forced him to support her bid to take over the Imperial Remnant."}, {"tag": "p", "text": "With Lecersen gone, the conspiracy had lost its spine and Suldar's actions had paralysed its efforts. Treen and Thaal both realized this and decided that it was time to shut down the operation and clean up their loose ends. By this time, Nek Bwua'tu had regained consciousness and had come to believe that a conspiracy was present in the government. Along with a small group of allies, he started investigating this. The group captured Admiral Parova and tried to get her to confess but Suldar had her silenced before she could say anything."}, {"tag": "p", "text": "This helped Treen and Thaal in their cover up. They decided to lay the blame on their dead conspirators: Treen murdered Fost Bramsin by poisoning him and making it look as though he had died of natural causes and Thaal forced Jaxton to commit suicide after having made him write a note claiming that him, Bramsin and Parova had formed a conspiracy to rebuild the Empire. Treen then retired to Kuat and Thaal disappeared. Later the Wraith Squadron uncovered and arrested general Thaal and the head of Galactic Alliance Security, General Borath Maddeus, who was also revealed to be a conspirator."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}