{"url": "Lee-Char/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Galactic Republic individuals", "Category:Kings of Mon Cala", "Category:Mon Calamari"], "nodes": [{"tag": "h1", "text": "Lee-Char"}, {"tag": "p", "text": "Prince Lee-Char was a Mon Calamari male who served as the leader of the planet Dac during the Clone Wars. He was originally set to take up the throne from his father, King Yos Kolina, and become the eighty-third king of Dac, but when his father was assassinated, his homeworld was plunged into a brief civil war. After the civil war ended, Brother Lemcke crowned Lee-Char king of Dac. He ruled as King for two years until he was killed during the Imperial invasion of Dac."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born some years prior to the Clone Wars, Lee-Char was the son of Dac's king, Yos of the Kolina family. Being the son of the king and in the royal bloodline, Lee-Char was set to be the king of Dac after his father died or if he resigned. Though, in 21 BBY, when the Separatists were starting to move into the Calamari system, Lee-Char's father was assassinated by an unknown assailant, forcing Lee-Char to become the new king."}, {"tag": "p", "text": "Shortly after his father was assassinated, a meeting was called to settle the dispute between the Quarren and the Mon Calamari to see if Lee-Char was to be the new king. While the Mon Calamari invited the Republic—Senator Padmé Amidala and Jedi Knight Anakin Skywalker acting as the representatives. Meanwhile, the Quarren invited the Separatists—with Riff Tamson acting as the representative—which ultimately began a dispute. Even though Lee-Char tried to reassure everyone that he would serve all his people faithfully, Mon Calamari and Quarren both, Tamson intervened and started up a quarrel and the Quarren left."}, {"tag": "p", "text": "Shortly after Captain Ackbar and the Republic representatives returned from their ship, Lee-Char was found with Dac's senator, Meena Tills, and his safety was entrusted to Ackbar and the captain was to be Lee-Char's bodyguard. Though, Ackbar raised his concerns to Tills about the prince's young age and his leading the military, he did as she said, and Lee-Char stated that he agreed with Ackbar. Before preparing for battle, Brother Lemcke addressed Lee-Char during a Mon Calamari and the Prince informed his people of how he was able to lead his people successfully. A battle ensued almost immediately after his talk and Lee-Char, accompanied by Skywalker and Ackbar, went to the battle field to watch over the attack. Though Skywalker disagreed, Lee-Char chose to stay with his people and told Ackbar to continue his offense. During the battle, Lee-Char led Amidala and Skywalker towards a shortcut so that they could get soldiers behind the battle droids, though, the tube to the short cut was destroyed and Lee-Char stated that they had to wait for the Republic reinforcements."}, {"tag": "p", "text": "Shortly after the destruction of the tube, Republic reinforcements, led by Commander Ahsoka Tano and Jedi General Kit Fisto, arrived and aided the Mon Calamari in battle. During the battle, the Mon Calamari started to cheer for the reinforcements and Ackbar told Lee-Char to make the cheering for him and gave him a blaster. Shortly after that, Riff Tamson swam towards Lee-Char to kill him, but Ahsoka Tano, who was using an underwater speeder, rushed towards him and saved him from the gnashing jaws of Tamson. Though, while in the tube, they were trapped by Tamson but were able to escape when several Mon Calamari guards attacked Tamson. Afterwards, the droids retreated and hid inside the coral, waiting for more reinforcements. Though, shortly after that, the city plaza was swarming with Hydroid Medusas, beasts from the planet Karkaris, and Lee-Char, under the supervision of Ackbar, ordered the soldiers to open fire. However, the droids reappeared and the second wave of the battle recommenced and Lee-Char and Ackbar led the retreat to the caves."}, {"tag": "p", "text": "Later on, the group contacted Masters Yoda and Mace Windu and asked for more reinforcements, but lost the connection moments later. The group then decided to head to the surface to reach the Republic cruiser. Though, before they got to the surface, the ship exploded and Lee-Char and company were forced to grab onto the wreckage to the sea floor. Lee-Char soon split up with Ahsoka, Kit, and the remaining clones, and they went into hiding. As they went into hiding, Lee-Char and company witnessed the planet's Mon Calamari population being escorted into work camps. Lee-Char then used a conch shell to make a loud sound, making the Mon Calamari look towards the Prince's direction, noticing that he was still alive and stated that they would fight for him, instilling hope in them. Droids then rushed over to kill the Prince, but were soon cut down by the Jedi. The Jedi reinforcements, the Gungans, arrived and assisted Lee-Char in freeing his people. However, a Separatist ship came and created a vortex around the Prince, and Tamson soon started to attack Ahsoka and Lee-Char. Though, Fisto soon distracted Tamson, and Lee-Char and Ahsoka were able to get away."}, {"tag": "p", "text": "Shortly after witnessing the rest of the Gungans taken to the work camps, Lee-Char stated that the failure was his. However, he then explained to Ahsoka that he needed to convince Nossor Ri to help them and planned to unite all the Quarren, Mon Calamari, and the Gungans. Lee-Char and Ahsoka then made their way to one of the prison camps to inform Ackbar of their plan. While discussing the plans with Ackbar, he said that the Quarren murdered his father, but Lee-Char stated that he knew all along that it was Riff Tamson, but was soon captured after that. While speaking with Tamson, Lee-Char pleaded for Nossor Ri's help, but was then taken outside to be executed."}, {"tag": "p", "text": "Before he could be executed, Nossor Ri went over to help the Prince and squirted ink to blind the Karkarodon bodyguards. In the ensuing skirmish, Ahsoka, Skywalker, Kit Fisto, and the Senators were freed and Ackbar, the Mon Calamari, Quarren, the clones, and the Gungans continued to fight against the Separatists. Meanwhile, Lee-Char, whose combat skills had improved since the start of the civil war, and his bodyguards continued to fight the droids, but Tamson arrived and killed his bodyguards. However, Lee-Char managed to grab an explosive device from Tamson's belt while battling the Karkadon and, upon learning that it was Tamson who murdered his father, vowed to return the favor and threw it right at him, stabbing him in the right part of his chest. Lee-Char then fired several shots from his spear blaster at the explosive as Tamson drew closer and closer, before firing one accurate shot that hit and detonated the explosive, killing the Separatist leader."}, {"tag": "p", "text": "Afterwards, Lee-Char was crowned as king of Mon Cala and pledged his loyalty to all people of Dac. However, when the Clone Wars came to an end and the Galactic Empire was established in 19 BBY, King Lee-Char was killed while he defended his world during the Imperial subjugation of Mon Calamari."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lee-Char showed potential as a leader being able to inspire his people through his bravery and charisma. He was loyal to his homeworld and was willing to risk his life for the good of his people. Lee-Char wished for peace between the Quarren and the Mon Calamari. He was able to persuade Nossor Ri to turn against Riff Tamson by pointing out that Tamson wanted to become ruler of the seas and that Nossor Ri and the rest of the Quarren were simply pawns in Tamson's scheme. Though he was inexperienced, Lee-Char had enough combat prowess to kill Riff Tamson, avenging his father's death."}, {"tag": "p", "text": "Lee-Char appeared to be very respectful to his elders, especially Captain Ackbar. He also seemed to agree with Jedi Padawan Ahsoka Tano on several things and showed deep respect for her and the other Jedi. Also, like most Mon Calamari politicians, Lee-Char proved to have been a very good negotiator, as seen while he was convincing Nossor Ri to aid him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Star Wars: The Clone Wars television series, Lee-Char was voiced by Adam McArthur."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}