{"url": "Leed", "categories": ["Category:Legends articles", "Category:Males", "Category:Royalty", "Category:Rutanians"], "nodes": [{"tag": "h1", "text": "Leed"}, {"tag": "p", "text": "Leed was the Prince of Rutan, the son of King Frane of Rutan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The laws of Rutan and Senali made the kings of the planet and the moon exchange their firstborns when they were seven years old, in order to avoid a war. Leed went to Senali and was raised among the Banoosh-Walore clan. Eventually, Leed fell in love with Senali culture, and decided to stay on the moon. When he told his father of his decision to stay, Frane cut off all contact, convinced that Leed was influenced by Meenon, Senali's leader."}, {"tag": "p", "text": "Leed's brother Taroon decided to take advantage of this. Enlisting a group of supporters, Taroon sent them to Senali, posing as a nomadic ghost clan to raid the other native clans. Eventually, evidence would point to Leed being their leader, leading him to be banished from both Rutan and Senali, leaving Taroon to inherit the throne."}, {"tag": "p", "text": "However, Frane requested the aid of the Jedi Order, which sent Jedi Master Qui-Gon Jinn and Padawan Obi-Wan Kenobi to Rutan to negotiate with Leed. Along with Taroon, the Jedi went to Senali and tracked Leed's foster sister Drenna to his hiding place. Once found, Leed remained firm in his decision to stay, which soon sparked an argument between Taroon and Drenna over who had the better culture. After teaching Taroon to fish, the brothers reconciled, and Leed agreed to return to Rutan."}, {"tag": "p", "text": "In the middle of the night, Leed was kidnapped by Taroon's supporters but was later rescued by the Jedi and Drenna. He then returned to Senali to face his father, but Frane refused to accept his decision to stay on Senali and leave the throne to Taroon. Thus, he broke his bargain with the Jedi to keep Meenon's daughter, Yaana, from being imprisoned to force Leed to stay on Rutan and begin royal training."}, {"tag": "p", "text": "Leed came up with a plan to rescue Yaana, explaining to the Jedi that last summer, he refused to participate in the royal hunt, so his father threw him in prison for a day, claiming it was part of royal training. A bird accidentally flew into the prison exhaust system and tripped the alarm multiple times, so Leed planned on recreating the same circumstances. However, just as Leed, Drenna and the Jedi had freed Yaana, they were caught by Frane. To spare his friends from being punished, Leed agreed to his father's terms to stay on Senali. But as the Jedi refused to leave Yaana on Rutan, Frane agreed to allow Drenna to stay."}, {"tag": "p", "text": "Leed joined his father on the royal hunt, when they discovered the royal seeker droids being destroyed by the Jedi, Drenna and Taroon at the nek dog kennels. Taroon then confessed to having conspired to take the throne. This impressed Frane, who finally acknowledged that Taroon would be a worthy heir to him and accepted Leed's wish to stay on Senali, deciding that he would be ambassador to both worlds. Leed returned to Senali the next day and was warmly welcomed by the Banoosh-Walore. and agreed with Taroon to be his successor and the future King of Rutan."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}