{"url": "Leeha_Narezz", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Jedi Masters of the Jedi Order", "Category:Members of the Jedi strike team", "Category:Nautolans", "Category:Redeemed Jedi"], "nodes": [{"tag": "h1", "text": "Leeha Narezz"}, {"tag": "p", "text": "Leeha Narezz was a female Nautolan Jedi Knight serving the Jedi Order and the Galactic Republic during the Cold War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Force-sensitive Nautolan, Leeha Narezz was trained in the ways of the Force by the Jedi Order and obtained the rank of Jedi Knight during the Great Galactic War, a conflict between the Galactic Republic and the reconstituted Sith Empire. During this time, she created medical droids she nicknamed the Meedees, and theorized that the Force helps evolve droids who have gone without memory wipes to sentience. Gaining the reputation of a warrior who \"never knew failure,\" Narezz was considered remarkable by Jedi Master Tol Braga. Following the Treaty of Coruscant and during the ensuing Cold War, Narezz was selected by Master Braga to join a strike team intent on capturing the Sith Emperor and redeeming him. Unknown to Master Braga, the team's informant was actually Narezz's secret lover, Jomar Chul. Through Chul, the team was able to discover that the Emperor's Fortress was protected by a powerful cloaking device."}, {"tag": "p", "text": "In an effort to find a way through the shields, Narezz was assigned to the frozen world Hoth to find a downed Imperial shuttle belonging to the only non-Sith to see and modify the systems of the space fortress. Along with the help of a Hero of Tython, his companions and the Republic troopers stationed at the planet led by Sergeant Fideltin Rusk, they found the shuttle in a cave in Highmount Ridge. Leeha got there first, but was cornered by Imperial forces. When the Hero arrived to save her, they were contacted by Imperial Guardsman Lassicar, who demanded they surrender, as a second wave of reinforcements appeared. However, Rusk and his men entered from above and rappeled down the walls, assisting the Jedi against the Imperials. They then found a cowardly Imperial engineer named Urrisov, who, under gentle interrogation from the Hero, explained that the White Maw pirates had stolen the shuttle's databanks. However, they missed the decryption file, which Narezz took from the young tech. Sergeant Rusk had fought the pirates before the Empire arrived on Hoth, and knew that the White Maw kept a depot in a crashed dreadnaught protected by ray shields. The databanks would no doubt pass through the depot, but the ray shields needed to come down before the Jedi and soldiers could do anything to retrieve them."}, {"tag": "p", "text": "Narezz explained that the Meedees have discovered two generators powering the ray shields and instruct Rusk and the Hero to strike at them separately. Later meeting up at the Republic base just outside the Starship Graveyard, Narezz informed the Hero and Rusk that the Imperials and White Maw are fighting for control of the wreck of the Star of Coruscant. At the Hero's suggestion, Rusk chose to attack the White Maw, figuring the pirates were undisciplined, while the Hero attacked the Imperials, allowing Narezz to get the databanks. After the Hero had dealt with Lassicar, Narezz instructed her fellow Jedi to meet her and Rusk back at Aurek Base. By the time, the Hero arrived, Rusk was telling Narezz how he and his squad handled a Gen'Dai. They are then graced by the presence of General Grayne, who assigned Rusk to serve under the Hero. Narezz left on her own, as her shuttle could only fit herself and the Meedees."}, {"tag": "p", "text": "Narezz returned to the Jedi Order's Temple on Tython with the data on the fortress. Upon delivering the data, Narezz rejoined the rest of Braga's team in her personal starfighter before departing for the Dromund system. Passing through the space station's shields without problem, the team entered the station only to be overtaken by Imperial forces. Escorted before the Emperor, who waited for them in his throne room, the Jedi team was placed under the Emperor's control and corrupted to the dark side of the Force."}, {"tag": "p", "text": "During Narezz's forced stay at the station the Emperor assigned her to delivering messages and orders to Imperial elites around the station. During a raid on the station, the Nautolan woman was confronted by Hero of Tython who quickly defeated her in battle. During the fighting, Narezz was able to break the Emperor's thrall over her mind and escape the space station with her life. Returning to Tython, Narezz debriefed the Jedi High Council on her experience, revealing that the Emperor had an unsettling and deep-seated hatred for the Hero of Tython."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Narezz was among the strongest and most resolute Jedi of her time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Leeha Narezz appears as a boss in the video game Star Wars: The Old Republic as part of the Onslaught expansion. In the expansion, Narezz only appears in the Imperial story, given that her role is replaced by Barden Golah in the Republic version of the story."}, {"tag": "p", "text": "In the Imperial story, Narezz was sent to investigate the Dantooine Jedi Enclave, where she encountered the Commander, Darth Krovos, and Darth Rivix. Despite being defeated by the Commander's party, she escaped the encounter after Darth Malgus interrupted the battle with his trap."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}