{"url": "Leesis", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Christoph system", "Category:Savareen sector moons", "Category:Terrestrial moons"], "nodes": [{"tag": "h1", "text": "Leesis"}, {"tag": "p", "text": "Leesis was a terrestrial moon of the Outer Rim planet Christophsis. At the Battle of Christophsis during the Clone Wars, Galactic Republic starships under the command of Jedi General Anakin Skywalker took cover behind Leesis after their initial attempts to breach Christophsis's Separatist blockade. From behind the moon, the Republic dispatched a prototype stealth ship with the aim of slipping past the enemy fleet and delivering relief supplies to the Christophsian people."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Leesis was a moon that orbited Christophsis, a planet in the Christoph system, within the Savareen sector of the Outer Rim Territories. Leesis was located in Standard Galactic Grid square Q-16. The terrestrial moon had a light-colored surface that was marked by large fissures."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Clone Wars' Battle of Christophsis in 22 BBY, Galactic Republic naval forces commanded by Jedi General Anakin Skywalker positioned their ships in front of Leesis as they attempted to breach the Separatist blockade of Christophsis and send relief supplies to Senator Bail Organa, who had established a refugee camp for the Christophsian people on the planet surface. Unsuccessful in attempting to penetrate Separatist Admiral Trench's defenses, Skywalker ordered his ships to take cover behind Leesis upon the arrival of Jedi General Obi-Wan Kenobi to the system."}, {"tag": "p", "text": "Kenobi remained with the fleet on the other side of the moon while Skywalker took command of the IPV-2C Stealth Corvette, a prototype stealth ship that Kenobi had brought with him, in an effort to slip by the blockade and deliver aid to Christophsis. Due to the Republic's apparent halt of its attack, Trench ordered his Hyena-class Droid Bombers to raid Organa's camp in the hope of pressuring the Republic to reemerge from behind Leesis. The bombing run prompted Skywalker to alter his objective and take aim directly at Trench, which ultimately destroyed the Separatist cruiser and allowed Kenobi's forces to engage the rest of the blockade head-on."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Leesis appeared in \"Cat and Mouse,\" the sixteenth episode in the second season of the animated television series Star Wars: The Clone Wars, which aired on March 26, 2010. Initially referred to as simply \"Christophsis's moon,\" it was given the name \"Leesis\" in the 2017 reference book Star Wars: The Visual Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}