{"url": "Arani_Korden", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Naboo", "Category:Naboo Underground", "Category:New Republic Senators", "Category:Nobility"], "nodes": [{"tag": "h1", "text": "Arani Korden"}, {"tag": "p", "text": "Arani Korden was a Human female who was the daughter of a Theed noble and later served as Senator to represent Naboo in the New Republic during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Arani was always in pursuit of adventure and excitement, and had a habit of getting herself into trouble. She was sneaky and confident, and had a great sense of humor. She attended the Theed Royal House of Learning. Korden, Galak, Rorworr, and Rann I-Kanu were tasked by Rann's master to seek out a rumored group of smugglers hiding in a base near Theed. One of Arani's contacts came up with the location of the group after a couple of days. There, they found a hidden smuggler's base led by Saidle Frex. They defeat Frex and his gang and rescued the abducted archeology professor Tasrah Boh in the process."}, {"tag": "p", "text": "At the age of 16, she played a role in defending Naboo from Trade Federation forces in 32 BBY as a member of the Naboo Underground, and the Naboo Resistance. A decade later, Arani found herself in the Clone Wars, watching a holographic representation of a battle, while Kelko surveyed the action with a pair of electrobinoculars. After the fall of the Republic, she and Kelko were seen on an Imperial city, trying to distract an Imperial while her Rodian companion tried to get away."}, {"tag": "p", "text": "During the reign of the Empire, Arani's previous experience with Jedi with the Naboo underground and the academy lead her to help a number of Jedi escape the initial portions of the Jedi purge. Her time with the Naboo Resistance also lead to her relative, Tavin, to place her in charge of the security of the family business: Korden Outfitting and Surveying. Arani used her position during the Galactic Civil War to allow the Rebellion to steal needed supplies from warehouses."}, {"tag": "p", "text": "After becoming a hero of Skorrupon, Arani returned to her homeworld, Naboo, and became the New Republic senator of the planet."}, {"tag": "p", "text": "In later years, Arani became the CEO of the Korden Outfitting and Surveying, and continued to use its resources to aid those fighting oppression. As the New Republic began to fall into a dictatorship, Arani used the company to found out-of-the-way settlements in which she let those who needed to keep a low profile escape in to."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the Star Wars Roleplaying Game rulebook, under the 'Classes' section, this character is called \"Arani Karden\". Though class-wise, Arani Karden is a noble, whereas Arani Korden is a \"scoundrel\", and somewhat younger. This misspelled name is corrected in the Star Wars Roleplaying Game Saga Edition Core Rulebook, though Korden is still classed as a noble."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}