{"url": "Legacy_(2006)_18", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy"], "nodes": [{"tag": "h1", "text": "Legacy 18"}, {"tag": "p", "text": "Legacy 18: Claws of the Dragon, Part 5 is the eighteenth issue of the Star Wars: Legacy comic series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Hoping to free their friend Cade Skywalker from the clutches of the Sith, Deliah Blue and Jariah Syn receive help from a surprising source. And Cade, who was captured by the Sith while trying to free Jedi Hosk Trey'lis, discovers that Hosk has found his own path to freedom, via the Force."}, {"tag": "p", "text": "The good, evil, and those in-between are coming together, and the result is going to shake the foundations of the Empire!"}, {"tag": "p", "text": "This is the future of Star Wars, the continuation of the story that started in the original trilogy, and none of it has been seen before."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "This issue starts out with Cade Skywalker being tortured by the Embrace of Pain. While Cade is bound helplessly to the Embrace, Darth Krayt tells the story of how he became Sith. After being disgraced in front of his people in the duel with Obi-Wan Kenobi on Tatooine, he fled into the Unknown Regions. Upon arriving, he encountered enemies that were not in the Force. His ship was attacked by a vessel of unknown origin and a fight followed between him and this new threat. Against weapons that were not known to him, the soon-to-be Sith Lord was overpowered and rendered unconscious."}, {"tag": "p", "text": "When he awoke, he found himself in the Embrace of Pain, with a new organic arm to replace his prosthetic one and in the company of someone who he could feel in the Force. Vergere explained to him his new situation involving the extragalactic Yuuzhan Vong. Sensing the darkness within him, Vergere told him that they will speak again. The Yuuzhan Vong shapers experimented on him, replacing one eye with the eye of another creature and enhancing his body to withstand their treatments. During his captivity, he would speak with Vergere who explained to him in a very cryptic way how she had studied under Darth Sidious to train in the ways of the dark side. At one point, he had a vision of himself leading a new order of Sith to conquer the galaxy. Explaining his views on Darth Bane's Rule of Two and how he would change them, the fallen Jedi A'Sharad Hett ceased to be and finally became Darth Krayt."}, {"tag": "p", "text": "Escaping the Yuuzhan Vong shortly before their invasion began, he fled to Korriban where he laid low throughout the War and he started his study under XoXaan. Thus began the new Sith Order. Over the many years, Darth Krayt built a large following of Sith, attempting to bring in Lumiya who refused and spent her time with Darth Caedus, who proved very useful to keep the eyes of the New Jedi Order away from Krayt's Order."}, {"tag": "p", "text": "After finishing his explanation, Krayt tells Skywalker that he needs him to heal him. Cade says he can't concentrate enough to be very effective when healing, but Krayt tells him that the Embrace of Pain will help him concentrate. Aboard the Mynock, the rescue crew mobilize to extract Cade from the Temple. At night, Cade sneaks out of his room to see Darth Talon who knocks him out and bring him before Darth Krayt. Krayt reveals that he knew all along of Cade's plan and that he has plans to make him become a real Sith. Hosk Trey'lis is brought before them and Krayt offers Cade an ultimatum; kill Trey'lis or die. Cade refuses, knowing that Krayt's threat to kill him is empty since Krayt himself has acknowledged that he needs Cade to save him. However, the Bothan Jedi tells Cade that he is ready to die, but Cade again refuses saying that he will not allow anyone to die for him. Angered by Cade's stubbornness, Krayt himself ends Trey'lis' life with one swing of his lightsaber, but Trey'lis becomes one with the Force. Skywalker is almost ready to give into his anger when a vision of his father appears before him and urges him to reconsider. However, Cade gives into to his anger and uses his power to shatter the transparisteel case containing his father's lightsaber, and begins his fight against Darths Krayt, Nihl and Talon. Darth Talon attempts to attack Cade, but he stabs Talon through the stomach and takes her out of the fight. A duel then ensues between Nihl and Cade, with Krayt taunting Cade and urging him to join the Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Darth Caedus is mistakenly referred to as Darth Cadeus in this issue. This was corrected in the trade paperback."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "External links"}]}