{"url": "Legacy_(2006)_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy"], "nodes": [{"tag": "h1", "text": "Legacy (2006) 5"}, {"tag": "p", "text": "Legacy 5: Broken, Part 4 is the fifth issue of the Star Wars: Legacy comic series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A galaxy-shaking secret is revealed in the heat of battle! Old friendships will be strained to the breaking point, unlikely new alliances will be formed, and the relentless forces of evil will pursue their dark ends with even greater vigor and purpose. In a universe on the brink of either destruction or salvation, it is the actions of an unexpected few that will determine the fates of all. The previously uncharted future of Star Wars takes a surprising turn in this latest issue of Legacy—be there!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On Korriban, Darth Krayt uses Holocrons to summon Darth Andeddu, Darth Nihilus and Darth Bane to teach him how to use the Force to rid him of the Yuuzhan Vong life forms that plague him. The three Sith Lords refuse to help Darth Krayt because he violated the Rule of Two, so he vows to find another way to heal himself."}, {"tag": "p", "text": "On Vendaxa, Cade Skywalker, Jariah Syn, Deliah Blue, Marasiah Fel and Astraal Vao flee to Cade's ship, the Mynock, and come face to face with an Acklay. The Acklay swings its massive claw to crush Astraal but she is saved by her brother Shado Vao and Jedi Master Wolf Sazen. Shado and Sazen quickly dispense the Acklay and prepare to leave with Astraal and Marasiah who tells Jariah and Deliah that she won't be paying them. In the distance a fireball erupts from three line signaling the destruction of the Jedi's transport. Jariah and Deliah take no time in doubling the price for transporting Marasiah, Astraal and the Jedi to Marasiah's father Roan Fel. The conversation is interrupted by Darth Talon and several beasts under the Sith's persuasion. Darth Talon quickly gets the upper hand on both Jedi using Force lightning until Marasiah intercepts the lightning with her lightsaber claiming that she won't let another person die. Darth Talon easily Force throws Marasiah to the ground and tells her to run. Sazen tells Cade to take Marasiah to his ship and flee but Cade chooses to stay using the Force to pick up a pile of junk and hurl it at Darth Talon knocking her into the trees. The group returns to the Mynock to find that it's flight systems are destroyed. Cade, Jariah and Deliah get to work fixing the ship while Sazen and Shado stand guard. Astraal sends as message to Moff Konrad Rus on Coruscant who she trusts updated him on all that has happened. Darth Krayt stands near by listening to the message. When the transmission ends, Darth Krayt and Moff Rus begin to plan on how they are going to lure Roan Fel out of hiding using his daughter as bait."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "External links"}]}