{"url": "Legacy_(2013)_16", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy Volume 2"], "nodes": [{"tag": "h1", "text": "Legacy 16"}, {"tag": "p", "text": "Legacy 16 is the sixteenth issue of the new Star Wars: Legacy comic series. It was released by Dark Horse Comics on June 25, 2014."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Imperial Knight Jao Assam is awaiting execution, and Ania Solo is on a mission to intercede. But when it is discovered that Jao has escaped—with the Sith Darth Wredd—Ania has doubts about her friend. But she still has to rescue him, in case he isn't a bad guy…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following Ania Solo's kidnapping, the Imperial Knight companion Jao Assam temporarily suspends his quest to hunt down the rogue Sith Darth Wredd, who wanted to assassinate the Galactic Empress Marasiah Fel, the head of the Imperial Knights. After a grueling rescue mission, Ania was arrested for the alleged murder of the Imperial Knight Teemen Alton. However, Jao succeeds in clearing Ania's name by presenting evidence that the real murderer was a deceased bounty hunter who had tried to frame her for the crime. While Ania was acquitted and released by the Galactic Federation Triumvirate, Jao Assam is arrested and imprisoned for deserting the Imperial Knights, a crime which carried the death penalty. In prison, he was visited by his quarry Darth Wredd who wanted to recruit him as his Sith apprentice and offered him a way out of his predicament—a Sith lightsaber."}, {"tag": "p", "text": "On Coruscant, Ania Solo attempts to seek an audience with Galactic Empress Marasiah Fel in an effort to gain clemency for the Imperial Knight. Her efforts are rebuffed by the senior Imperial Knight Antares Draco who was adamant that the Empress would not change her decision. Unsuccessful, Ania returns to AG-37's freighter, which was berthing at a Coruscant spaceport. There she rejoins her companions, the Mon Calamari Sauk and the assassin droid AG-37, who are making preparations to head offworld. Meanwhile, Darth Wredd and Jao escape in a starship, killing several stormtroopers and wrecking a hole in the prison wall in the process."}, {"tag": "p", "text": "Following Jao's escape, Ania is detained by several stormtroopers and brought before Empress Fel, who had decided to grant the junk dealer an audience. During their meeting, Empress Fel confides in Ania that she is certain that Jao Assam had not fallen to the dark side of the Force. Instead, she believes that he is trying to follow his vows as he sees fit. However, the Empress is unwilling to break the law by favoring Jao, who has willfully abandoned his post. Despite this predicament, the Empress sees a solution to Jao's legal situation. If Ania were to find Jao and bring him back, she would be willing to consider finding a loophole around the desertion charges. Empress Fel assigns Ania and her companions with a platoon of Trandoshan stormtroopers and sent them to rescue Jao. The rescue mission departs Coruscant on AG-37's freighter."}, {"tag": "p", "text": "Meanwhile, Darth Wredd and Jao land on the floating world of Mala. There, Wredd recounts his life story to the captive Jao. Growing up on Mala, Wredd had discovered that he was Force-sensitive in his youth. Unable to join the Jedi Order due to the Massacre at Ossus, Wredd instead became a skilled swordsman and the champion of his village. Towards the end of the Second Imperial Civil War, Wredd's world was destroyed by the One Sith who tested a bioweapon on it, which destroyed all life and knocked the planet off its orbit, causing it float in space. While Wredd was allowed to live, he was forcibly apprenticed to a Sith master."}, {"tag": "p", "text": "Due to the destruction of his homeworld and his family, Wredd harbored a deep hatred towards the One Sith. He then elaborated how he had killed his master and impersonated the Imperial Knight Yalta Val during the Carreras Incident. With the death of his master, Wredd was now free to destabilize the galaxy. When Jao expresses his skepticism, Wredd presents a broken blade from his sword, confirming that he was indeed telling the truth. Wredd then arranges for Jao to escape his cell and transmit the coordinates of their planet to Ania Solo. As planned, Ania and her companions intercept Mala's coordinates. Upon exiting hyperspace, Sauk and AG-37 quickly recognize Mala as the same elusive floating world they had encountered during the Carreras Incident."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}]}