{"url": "Legacy_(2013)_14", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy Volume 2"], "nodes": [{"tag": "h1", "text": "Legacy 14"}, {"tag": "p", "text": "Legacy 14 is the fourteenth issue of the new Star Wars: Legacy comic series. It was released by Dark Horse Comics on April 23, 2014."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A look into Ania Solo's prison-camp past reveals a secret connection to the brutal bounty hunter who is desperate to bring her to justice—dead, not alive!"}, {"tag": "p", "text": "But bounty hunters are only part of Ania's problems!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A year has passed since the liberation of the Mon Calamari Shipyards. The Imperial Knight Jao Assam, Ania Solo, the Mon Calamari engineer Sauk, and the assassin droid AG-37 embark on a quest to hunt down the rogue Sith Darth Wredd, who is waging an insurgency against the One Sith. Jao has seen a Force vision of Darth Wredd attacking Empress Marasiah Fel, the leader of the new Galactic Federation Triumvirate and is determined to foil his conspiracy. While visiting Lasgo Port, Ania is kidnapped by her former flame Ramid who escapes into hyperspace. Ania is then pursued by a mysterious bounty hunter. This new foe forces Ania and Ramid to put aside their differences and to work together to survive."}, {"tag": "p", "text": "On Coruscant, the Imperial Knight Master Yalta Val uncovers more evidence that exonerates Ania of the murder of Teemen Alton. He learns that the real killer had a prosthetic hand while Ania was fully biological. On the inhospitable glass rain planet, Ania's companions Jao, Sauk, and AG-37 find Ramid's wrecked starship but no sign of her. Shortly later, it begins to rain glass shards and Jao and Sauk are forced to seek shelter within AG-37's freighter. Due to his mechanical body, AG-37 alone is able to withstand the glass shards and scouts the surrounding area."}, {"tag": "p", "text": "Forced to shelter from the glass storm under a speeder bike, Ania and Ramid reconcile their differences and forgive each other for the wrongs they had inflicted on each other. Ramid forgives Ania for abandoning him during their escape attempt from the Imperial labor camp on Drash-so. Meanwhile, Ania forgives Ramid for kidnapping her. During the storm, they are shielded by several giant beetles which feed on the glass shards. Following the storm, they travel to the planet's sole settlement in order to get transportation offworld. Meanwhile, Jao and Sauk received a hologram transmission from Master Val, who presents new compelling evidence that exonerates Ania. Meanwhile, AG-37 spots Ania and Ramid traveling together on a speeder bike towards the settlement. AG-37 alerts Sauk and Jao who also bring their freighter there."}, {"tag": "p", "text": "Upon arriving at the settlement, Ania and Ramid discover that the bounty hunter has killed all of the residents. During a confrontation, the bounty hunter kills Ramid and attempts to take Ania prisoner. However, Jao arrives and fights her off. Ania takes the opportunity to escape outside the building only to find herself caught in an acid rain storm.In desperation she covers her head and eyes with her jacket."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}]}