{"url": "Legacy_(2013)_15", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy Volume 2"], "nodes": [{"tag": "h1", "text": "Legacy 15"}, {"tag": "p", "text": "Legacy 15 is the fifteenth issue of the new Star Wars: Legacy comic series. It was released by Dark Horse Comics on May 28, 2014."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "The good news: Ania Solo has escaped the vengeance of a crazed bounty hunter.The bad news: She has been taken into custody by the Empire for the murder of an Imperial Knight!Somebody's getting a death sentence!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "A year has passed since the liberation of the Mon Calamari Shipyards. The Imperial Knight Jao Assam, Ania Solo, the Mon Calamari engineer Sauk, and the assassin droid AG-37 embark on a quest to hunt down the rogue Sith Darth Wredd, who is waging an insurgency against the One Sith. Jao has seen a Force vision of Darth Wredd attacking Empress Marasiah Fel, the leader of the new Galactic Federation Triumvirate and is determined to foil his conspiracy. While visiting Lasgo Port, Ania is kidnapped by her former flame Ramid who escapes into hyperspace. The appearance of a mysterious masked bounty hunter forces Ania and Ramid to put aside their differences and work together to survive."}, {"tag": "p", "text": "Following the death of Ramid at the hands of the bounty hunter, Ania escapes outside only to get caught in an acid storm. At the eleventh hour, she is rescued by AG-37 who carries her to safety. Meanwhile, the bounty hunter seemingly incapacitates Jao Assam with a thermal detonator. Despite saving Ania, AG-37's internal circuits are damaged by the acid rain. Unwilling to lose his memories, he convinces Ania to manually shuts him down. Shortly later, Ania is recaptured and overpowered by the bounty hunter. The bounty hunter then reveals herself as a former prison guard from the Imperial labor camp on Drash-so. In revenge for her escape, the bounty hunter intends to frame Ania for the murder of the Imperial Knight Teemen Alton. To complete the frame-up, she attempts to amputate Ania's left hand so that she can plant her prosthetic hand."}, {"tag": "p", "text": "Before the bounty hunter can carry out her work, she is ambushed by the Imperial Knight Jao Assam. Following a fierce duel, Jao succeeds in severing the bounty hunter's prosthetic hand. Ania manages to kill the bounty hunter by using her remote to summon her TIE Bomber. Ania uses the TIE Bomber to crush the bounty hunter to death. Meanwhile, Sauk receives news that a force of stormtroopers has landed. These stormtroopers arrest Ania and extradite her to Coruscant to face trial for the alleged murder of Alton. Jao and Sauk are powerless to stop them. After retrieving the damaged AG-37, they fly to Coruscant to clear her name."}, {"tag": "p", "text": "On Coruscant, Ania appears before a three-member tribunal consisting of the Imperial Knight Antares Draco, a Sullustan Galactic Alliance Remnant official, and a female Human Jedi. Knowing Ania's innocence, Master Yalta Val volunteers to represent her and challenges the Triumvirate's evidence by pointing out that Alton's killer wielded a prosthetic arm; something that Ania does not have. While the Alliance and Jedi members are swayed, Draco demands physical evidence. Jao arrives just in time with the bounty hunter's severed prosthetic hand. He reveals that the bounty hunter intended to frame Ania by attaching it to her hand. Confronted with the evidence, the tribunal are forced to acquit Ania."}, {"tag": "p", "text": "Ania is released and is reunited with her companions Sauk, AG-37, and Jao's adopted Imperial communications droid. However, this good news is shattered by the revelation that the Imperial authorities had decided to imprison Jao Assam for desertion; a crime which carries the death penalty within the Imperial Knights. Meanwhile, a despondent Jao is visited by his elusive quarry—Darth Wredd. Sensing Jao's plight, Darth Wredd offers him a way out of prison—a Sith lightsaber."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "External links"}]}