{"url": "Legacy_(2013)_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy Volume 2"], "nodes": [{"tag": "h1", "text": "Legacy 2"}, {"tag": "p", "text": "Prisoner of the Floating World part 2 is the second issue of the Star Wars: Legacy Volume 2 comic series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Ania Solo found a lightsaber inside a broken Imperial communications droid. Now she's being pursued by the local police—and a determined Imperial Knight who is willing to kill to get the weapon!"}, {"tag": "p", "text": "Fortunately, as a black-market salvage dealer, Ania has made some formidable friends of her own…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Following the defeat of Darth Krayt's Galactic Empire, the One Sith are driven underground. A new Galactic Federation Triumvirate consisting of the Jedi Order, the Fel Empire, and the Galactic Alliance Remnant is established. The new Empress Marasiah Fel embarks on an ambitious project to link the Outer Rim Territories with the rest of the galaxy. During a mission to the Carreras system, the Imperial Knight Yalta Val is kidnapped by a mysterious Sith apprentice, who steals his armor and impersonates him. On the Ottega system, the young Imperial Knight Jao Assam is concerned that he has not received any communications from his counterpart Master Yalta Val. Meanwhile in the sewers of Carreras Major, the junk dealer Ania Solo and her Mon Calamari friend Sauk evade a Carreras security patrol on their shuttle."}, {"tag": "p", "text": "The mysterious Sith apprentice confers with the captive Val and offers him the opportunity to join the dark side of the Force. Following news of Ania's skirmish with the Carreras authorities, the Sith impostor decides to deal with her. Back at Solo's junkyard on Carreras Minor's moon, Ania and Sauk make plans to escape the Carreras system. They are then visited by their friend AG-37, a kindly IG-88 assassin droid, who advises them to get rid of their lightsaber. Shortly afterwards, they are visited by the Sith impostor \"Yalta Val\" and a complement of Carreras guards. The Sith impostor demands that Ania return his lightsaber. When she refuses, he uses the Force to retrieve it and orders his men to kill her and her companions. Following a pursuit, Ania and Sauk are rescued by AG-37, who mows down their pursuers with two blaster rifles."}, {"tag": "p", "text": "In response to Ania's escape, the Sith apprentice mobilizes Governor Biala's security forces despite her protests. Meanwhile, Jao Assam confers with his superiors Empress Fel and Antares Draco, head of the Imperial Knights. He conveys his concerns about Yalta Val's lack of communications and offers to go into the Carreras system to investigate the situation. However, Empress Fel refuses to authorize his trip and orders him to remain in the Ottega system. Following their hologram conference, Empress Fel confides in her lover Draco her worries about the problems facing the Imperial Knights. Draco reassures her and urges her to stay strong. Ania and her companions escape offworld on AG-37's freighter. While repairing the damaged Imperial comm droid, Ania and her companions discover a holo-recording of an Imperial Knight fighting a Sith. They quickly realize that the Sith impostor and the Imperial Knight Yalt Val are not the same man. Shortly after, AG-37's freighter encounters a Shifala naval blockade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}