{"url": "Legacy_(2013)_8", "categories": ["Category:Real-world articles", "Category:Star Wars: Legacy Volume 2"], "nodes": [{"tag": "h1", "text": "Legacy 8"}, {"tag": "p", "text": "Legacy 8 is the eighth issue of the new Star Wars: Legacy comic series."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Ania Solo and Imperial Knight Jao's search for Sith leads to the poisoned Mon Calamari homeworld of Dac—where their ship is boarded by pirates who have taken over the planet's orbiting shipyards. Jao senses the dark side at work—especially when he and Ania are marked for death!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "After learning of Darth Wredd's plot to attack Empress Marasiah Fel, the young Imperial Knight Jao Assam and his junk dealer friend Ania Solo embark on a quest to hunt down the rogue Sith. Their quest leads them to the Nalydian homeworld of Nalyd. Jao and Ania attempt to question Wredd's henchman, Dieben, about the whereabouts of Darth Wredd. With Dieben facing execution, Ania and Jao rescue him from the authorities. However, Dieben is killed during the escape attempt before he can divulge any information. Facing trouble from the Nalydian authorities, Ania manages to buy her and Jao's way out of their predicament by highlighting Jao's combat prowess as an Imperial Knight. In return for returning the body of Dieben, the Nalydian authorities divulge that Dieben was traveling to Dac, the poisoned homeworld of the Mon Calamari species, where he had several \"powerful friends.\""}, {"tag": "p", "text": "While Jao is skeptical that they will find Dieben there, they decide to travel to Dac since they have no other leads on the rogue Sith Wredd. Upon arriving in the wrecked Mon Calamari Shipyards, their shuttle is boarded by Dac pirate droids which disable their electronics and stabilization controls. They are then steered into a hangar bay where their vessel is boarded by pirates. However, Jao and Ania overpower them and steal their clothes. While exploring the interior of the Mon Calamari Shipyards, Jao and Ania discover that a pirate syndicate is using enslaved Mon Calamari and Quarren refugees to build a fleet of starships. While exploring the shipyards, they encounter two Mon Calamari and Quarren slaves, named Luen and Tikin, who confirm that the pirates are using a scam to lure Mon Calamari and Quarren refugees to the Calamari system."}, {"tag": "p", "text": "Jao orders his Imperial communications droid to relay a distress signal to the Triumvirate authorities on Coruscant. While Ania is concerned that Jao is putting himself in danger, he argues that the danger of the pirates to the galaxy outweighs his own life. Shortly later, Ania and her companions are pursued by pirates. Following a chase through the shipyards, they stumble upon the Sith Darth Luft, a member of the One Sith who reveals that Darth Wredd is not on the Dac system. Darth Luft then throws Ania and her companions down a trapdoor which leads into an escape pod. The escape pod is then jettisoned into the poisoned oceans of Dac."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}]}