{"url": "23", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Clone troopers"], "nodes": [{"tag": "h1", "text": "23"}, {"tag": "p", "text": "23 was one of six rookie clones assigned to work with Clone Commander Vargus and the rest of his squad, an Advanced Recon Force trooper known as Falco, a medic known as Splice and a demolitions expert known as Dom."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "23 was selected to join Commander Vargus in a mission to find the 313th Legion, which had gone missing on Ando Prime during a routine assault on a Separatist base. The six rookies and Falco went ahead to scout. When the droid base was seen, Falco went to take a closer look and ordered the rookies to stay behind. After about an hour, 18, the sergeant in the group of rookies, contacted Vargus, who ordered them to wait for him, Dom, and Splice. Inside the base, they found Falco talking with Clone Commander Cody and Jedi General Obi-Wan Kenobi. A further search of the base revealed a Skakoan scientist and engineer, Vylagos, who had built a Hyperspace warping device, which had accidentally been triggered, sending the droids and clones to a remote, barren Outer Rim world. The rookies went through, along with Falco and Dom. Vylagos had given them a device which, when activated, would bring every living thing within one kilometer to be transported back to Ando Prime. General Po Bandis ordered the clones to destroy a Confederacy listening post. Upon arriving, the clones hijacked a droid tank. Falco destroyed the outpost with it and drove it back to the general, Dom throwing out pulse grenades the whole way. When they got back, the general activated the device and transported all the clones back to Ando Prime."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "23 was created for the book, The Clone Wars: Decide Your Destiny: The Lost Legion. In some variations, 23 doesn't exist and is replaced by 16."}, {"tag": "h2", "text": "Appearances"}]}