{"url": "Legacy_of_the_Force:_Bloodlines", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Legacy of the Force"], "nodes": [{"tag": "h1", "text": "Legacy of the Force: Bloodlines"}, {"tag": "p", "text": "Legacy of the Force: Bloodlines is the second novel in the Star Wars: Legacy of the Force series. Written by Karen Traviss, it was released in the United States by Del Rey on August 29 and in the U.K., Australia, and New Zealand by Arrow Publishing on September 7, 2006. Bloodlines contains a 20-page excerpt of the next book in the series, Legacy of the Force: Tempest, by Troy Denning. The audio version was narrated by Marc Thompson. The cover features Boba Fett."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "A new era of exciting adventures and shocking revelations continues to unfold, as the legendary Star Wars saga sweeps forward into astonishing new territory."}, {"tag": "p", "text": "Civil war looms as the fledgling Galactic Alliance confronts a growing number of rebellious worlds-and the approaching war is tearing the Skywalker and Solo families apart. Han and Leia return to Han's homeworld, Corellia, the heart of the resistance. Their children, Jacen and Jaina, are soldiers in the Galactic Alliance's campaign to crush the insurgents."}, {"tag": "p", "text": "Jacen, now a complete master of the Force, has his own plans to bring order to the galaxy. Guided by his Sith mentor, Lumiya, and with Luke's young son Ben at his side, Jacen embarks on the same path that his grandfather Darth Vader once did. And while Han and Leia watch their only son become a stranger, a secret assassin entangles the couple with a dreaded name from Han's past: Boba Fett. In the new galactic order, friends and enemies are no longer what they seem.…"}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "The working title for Bloodlines was Necessary Evil."}, {"tag": "p", "text": "The Science Fiction Book Club released an exclusive hardcover version of this novel."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}