{"url": "Arasuum", "categories": ["Category:Legends articles", "Category:Mandalorian deities"], "nodes": [{"tag": "h1", "text": "Arasuum"}, {"tag": "p", "text": "Arasuum was a deity in the ancient Mandalorian religion. Known as the sloth-god, the Mandalorians viewed Arasuum as the personification of stagnation, who tempted the ancient clans to engage in idle consumption. Opposing Arasuum was the god Kad Ha'rangir, who embodied the universal opportunity for change and growth that destruction created. Mandalorian mythology held that Arasuum and Kad Ha'rangir waged an eternal war against one another."}, {"tag": "p", "text": "The Mandalorians who believed in these ancient gods waged ritual warfare as a means of worship toward Kad Ha'rangir, whose ideals they served, taking on the name Mandalorian Crusaders as a reflection of the holiness embodied by the conflict they engaged in. By fighting wars in the destroyer god's name, the Mandalorians sought to earn Kad Ha'rangir's favor, and defied the temptations of Arasuum."}, {"tag": "p", "text": "However, over time, the belief in Arasuum and the worship of Kad Ha'rangir fell out of favor. After witnessing a spiritual vision on the planet Shogun, the Mandalorian leader known as Mandalore the Indomitable decreed that the act of war itself would be the center of Mandalorian worship, and that to wage war was to be divine, though the worship of war, too, would decline as the centuries passed. Despite this, Arasuum and the Mandalorian gods of old would not be forgotten: millennia later, in 19 BBY, the Mandalorian soldier Kal Skirata knew of their former place in Mandalorian mythology, and the historian Vilnau Teupt recounted their importance to the early Mandalorians during his keynote speech at the four hundred twelfth Proceedings of Galactic Anthropology and History at the Brentaal Academy in 24 ABY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arasuum was first mentioned in the article titled The Mandalorians: People and Culture. Authored by Karen Traviss, the article was published February 2006 as part of the eighty-sixth issue of the Star Wars Insider magazine. Arasuum was also mentioned in the later reference book, The Essential Guide to Warfare, written by Jason Fry and Paul R. Urquhart, and published April 3, 2012."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}