{"url": "Legacy_of_the_Force:_Revelation", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Star Wars: Legacy of the Force"], "nodes": [{"tag": "h1", "text": "Legacy of the Force: Revelation"}, {"tag": "p", "text": "Legacy of the Force: Revelation is the eighth novel in the Star Wars: Legacy of the Force series. It is a paperback by Karen Traviss and was released February 26, 2008. An exclusive hardcover edition of the book was published by the Science Fiction Book Club. The audiobook is narrated by Marc Thompson. The cover is of Jacen Solo, now transformed by the dark side as Darth Caedus."}, {"tag": "h2", "text": "Editions"}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "During this savage civil war, all efforts to end Jacen Solo's tyranny of the Galactic Alliance have failed. Now, with Jacen approaching the height of his dark powers, no one–not even the Solos and the Skywalkers–knows if anything can stop the Sith Lord before his plan to save the galaxy ends up destroying it."}, {"tag": "p", "text": "Jacen Solo's shadow of influence has threatened many, especially those closest to him. Jaina Solo is determined to bring her brother in, but in order to track him down, she must first learn unfamiliar skills from a man she finds ruthless, repellent, and dangerous. Meanwhile, Ben Skywalker, still haunted by suspicions that Jacen killed his mother, Mara, decides he must know the truth, even if it costs him his life. And as Luke Skywalker contemplates once unthinkable strategies to dethrone his nephew, the hour of reckoning for those on both sides draws near. The galaxy becomes a battlefield where all must face their true nature and darkest secrets, and live–or die–with the consequences."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The novel starts off with Jaina Solo contemplating on what kind of monster that her brother, Jacen, has become, and that one day, she will have to kill him. But not before she is properly trained by Boba Fett to neutralize Jacen."}, {"tag": "p", "text": "The first story of the novel surrounds Ben Skywalker's investigation into his mother's death. Determined to prove that it was Jacen who killed Mara Jade Skywalker on Kavan, Ben takes fellow Galactic Alliance Guard member Lon Shevu—who makes sure that his boss, Heol Girdun, doesn't find out what he is doing—to Kavan in order to find proof over who Mara's killer really is. During their investigation where Ben found his dead mother, he sees her Force ghost, and, as well as telling each other that they still love each other, Mara implies to look for hair samples from Jacen's StealthX that would be hers, thus proving that he killed her. Ben and Shevu do this, and continue in other elements into their investigation, such as to Jacen and Mara's whereabouts, his visit to Hapes at the time, etc."}, {"tag": "p", "text": "The second story revolves around Jaina realizing that she cannot take on her brother because, even though they are equally powerful, Jacen is more mastered in the Force than Jaina is, and thus, would be able to defeat her more likely. So she goes to Mandalore where she receives training from Boba Fett and his Mandalorian allies into unconventional fighting that would make her a more dangerous opponent to her brother. Meanwhile, Fett finally has his ex-wife, Sintas Vel, unfrozen from carbonite, but she recovers slowly over time, letting her memories catch up with her, getting her sight back, etc."}, {"tag": "p", "text": "The third story revolves around Darth Caedus trying to recruit the Imperial Remnant into the Second Galactic Civil War on the Galactic Alliance's side by offering the Moff Council more territory in the way of Bilbringi system and Borleias. Though Grand Admiral Gilad Pellaeon is reluctant, he agrees to lend the Imperial Remnant's help to the GA's aid in order to defeat the rebelling Fondor. Meanwhile, Caedus's fellow Chief of State Cha Niathal sees the error of her colleague's ways and secretly betrays the Galactic Alliance by lending pertinent information of the GA military's tactics to the New Jedi Order for Luke Skywalker and his Jedi cohorts to sabotage their efforts at Fondor. And as for Pellaeon, predicting that Caedus would do something brash, he gets the help of Admiral Natasi Daala to counter Caedus in case he does anything stupid. To help Pellaeon, Daala hires out Fett and his Mandalorian lackeys to defeat Caedus if Pellaeon's predictions became true. Jaina decides to go on this mission with Fett and the other Mandalorians."}, {"tag": "p", "text": "After Niathal and Pellaeon are assured that Caedus will not be beyond their control, the combined GA-Imperial Remnant fleets attack and launch the Second Battle of Fondor. Initially, the battle does not go to the GA-Imperial Remnant's favor, but Caedus improves chances of victory by mind-manipulating the commanders and crews of the other ships in his command to become more aggressive and press their attack against Fondor. The battle eventually turns to the GA-Imperial Remnant's favor, and Fondorian President Shas Vadde begs his planet's surrender. Niathal and Pellaeon comply, but Caedus continues even after a decisive victory, wanting to press home the advantage so that Fondor can never be a threat to the GA ever again, which is also decided by the rage of the dark side of the Force that he had built up inside himself. When Caedus refuses to follow Niathal's orders to withdraw his forces, she officially renounces him of command and tells her forces to aid Fondorian battle forces against Caedus. However, Caedus still has loyalty among the forces, and he takes in more than Niathal in terms of numbers to totally defeat Fondor. Meanwhile, aboard Pellaeon's Star Destroyer, the Bloodfin, Pellaeon refuses to help Caedus, prompting Tahiri Veila, acting as a liaison to the Sith Lord, to threaten the Grand Admiral at blaster point in his day cabin to assist in defeating Fondor. Pellaeon still refuses, and Tahiri shoots him. However, before dying, Pellaeon finds that the Moffs, led by Quille, will take over and agree to help Caedus, but the Grand Admiral manages to notify Daala on his comlink to attack Caedus's forces and that the Moffs have betrayed him. With that, Grand Admiral Gilad Pellaeon, ruler of the Imperial Remnant, dies."}, {"tag": "p", "text": "As the Second Battle of Fondor progresses, Daala and her fleet arrives to decimate Caedus's forces. But as the battle nears its end, Caedus's forces manage to hold their own, and the Sith Lord, disguised as an evac medic aboard a medical transport, goes over to the Bloodfin to help evacuate Tahiri as Fett, Jaina, and the other Mandalorians also board the Star Destroyer to neutralize the Moffs for Daala. Both operations go successfully, although some of the Moffs like Drikl Lecersen manage to escape, even after one of the Mandalorians, Baltan Carid, nearly kills Caedus, but is held back via comm by Fett so that Jaina can kill her brother. However, Caedus and Tahiri escape severely wounded, but they make it back to the Anakin Solo alive. And because Caedus controls a majority proportion of the GA military, Niathal is branded a traitor to the government and is forced into exile with her obedient forces."}, {"tag": "p", "text": "Following the Second Battle of Fondor, Caedus confesses to Shevu that he was responsible for Mara's death, and that he is a Sith Lord. Shevu takes this in stride, but because he had a wire on him, recording everything that Caedus has said, Shevu gives the recording to Ben. Finally having evidence that positively matches Jacen's involvement with Mara's death, Ben shows this to the rest of the Solos and Skywalkers, confirming their suspicions as to how low Jacen Solo has sunk."}, {"tag": "p", "text": "Fett's arc in the novel comes to an end as Sintas finally recovers her memories thanks to the healing abilities ex-Jedi Mandalorian Gotab. Sintas reconciles with Fett, despite the age difference thanks to the carbonite freezing, as her assumed hatred toward him was nonexistent, and that their late daughter, Ailyn, had misinterpreted her mother's feelings toward her ex-husband. Fett's granddaughter, Mirta Gev, gets married to fellow Mandalorian boyfriend Ghes Orade, and Jaina comes to grips with her morals as a Jedi thanks to Gotab, revealing himself to be Bardan Jusik, Jedi veteran of the Clone Wars. Jusik tells Jaina to set aside those morals until she can kill her brother, and then she can ponder her actions when the war is over."}, {"tag": "p", "text": "The novel ends at the new undisclosed Jedi base, moved from Endor, with Luke sleeping and Ben still wondering what to do now that he knows that Jacen killed his mother. Then Luke wakes up in his tent and begins to talk to someone that Ben cannot see, but he knows who it is. With that, and a tear shed, Ben falls asleep, finally at peace with his mother's death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Caedus's new Sith lightsaber, as depicted on the cover, resembles that of his grandfather, Darth Vader. Though depicted on the cover, Caedus does not actually wield this lightsaber in the book."}, {"tag": "p", "text": "An extract from Revelation was published prior to its release with Legacy of the Force: Fury. This contained a continuity error, Qui-Gon Jinn killed a Sith on Naboo, a reference to the presumed death of Darth Maul in Star Wars: Episode I The Phantom Menace, who was actually killed by Obi-Wan Kenobi. This error was fixed when Revelation was released and the words Qui-Gon Jinn were switched for Kenobi."}, {"tag": "p", "text": "Pellaeon fantasized about the furor Daala might create, should she decide to become the \"first\" female Moff, contradicting earlier mentions and appearances of Crowal, a female Moff from Valc VII who supported Pellaeon during the Yuuzhan Vong War."}, {"tag": "p", "text": "Tahiri's murder of Pellaeon would become the focus of a subplot in Fate of the Jedi, when she is put on trial by GA Chief of State Natasi Daala for the crime."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}