{"url": "Legacy_of_the_Force:_Invincible", "categories": ["Category:Real-world articles", "Category:Articles with an excess of redlinks", "Category:Incomplete lists", "Category:Star Wars: Legacy of the Force"], "nodes": [{"tag": "h1", "text": "Legacy of the Force: Invincible"}, {"tag": "p", "text": "Legacy of the Force: Invincible is a Star Wars Legends novel written by Troy Denning. It is the ninth and final volume of the Star Wars: Legacy of the Force series, and it was first published in hardcover by Del Rey on May 13, 2008. The story is set in 41 ABY, and it features the climactic duel between Jaina Solo and her fallen brother, Darth Caedus."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "No war can last forever. Now, in the long and punishing battle between the defiant champions of the New Jedi Order and the juggernaut that is the Galactic Alliance, the endgame is finally at hand. With so much lost—and nothing less than the course of the future still at stake—there can be no turning back. No matter the consequences."}, {"tag": "p", "text": "The rebel cause is losing ground under the twin blows of Admiral Gilad Pellaeon's assassination and the death of Mara Jade Skywalker. At the same time, having gained the support of the Imperial Remnant and its ruthlessly efficient forces, the Galactic Alliance, with the extraordinary power and dark brilliance of newly ascendant Sith Lord Darth Caedus at its helm, may be unstoppable. Tormented and torn between the call of duty and the thirst for vengeance, Luke has searched the Force and beheld an unspeakable vision of the galaxy enslaved under tyranny more monstrous than even Palpatine's. Now it seems that the last, best hope lies in mobilizing the scattered Jedi for one decisive search-and-destroy mission. The objective: eliminate Darth Caedus."}, {"tag": "p", "text": "It's a plan that will be as difficult and dangerous to execute as it is daring. For Caedus is a scion of both the Skywalker and Solo bloodlines whose command of the Force surpasses even that of his grandfather Darth Vader. There is only one who is bound by destiny to stand against him in what will surely be a duel to the death, only one with an outside chance of bringing down the dark lord who was once Jacen Solo."}, {"tag": "p", "text": "Failure is not an option. The furious final moments between power and peace are here, and whoever confronts Darth Caedus will decide the outcome—and the fate of those left standing."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Jaina and Boba Fett travel throughout the interior of Nickel One as Darth Caedus's Galactic Alliance and Imperial Remnant forces raid the asteroid during the Battle of Roche. Jaina and Fett find that the Remnant is using some sort of aerosol nanokiller attack used to kill the Verpines working in the asteroid. Jaina leaves at Fett's command to get back to the Jedi Coalition while he stays behind to do as best he can to fight off the invaders with the Verpines in order to honor his mutual-aid treaty with them."}, {"tag": "p", "text": "Jaina makes it back to the Jedi base at Shedu Maad where she, her family and the rest of the Jedi High Council plan to sneak onto Coruscant and get information as to Darth Caedus's whereabouts. Later, on Coruscant, Ben Skywalker meets up with his friend and Galactic Alliance Guard spy Lon Shevu who discreetly tells Ben that Caedus is located at Nickel One. Unfortunately, Ben figures out that they are being spied upon by the rest of the GAG, and he tries to escape, resulting in the Skirmish on Coruscant. But Ben is captured by Tahiri Veila and her forces, along with Shevu, who is arrested for aiding Ben in his failed escape. Jaina and her mother, Leia, try to save Ben using a commandeered medical frigate, but they run headlong into a GAG ambush that forces Jaina to abandon Ben on Coruscant as she and her mother make their escape."}, {"tag": "p", "text": "Despite Ben's capture, his father, Luke, tells Jaina and her parents, when they get back to Shedu Maad, that he expected Ben to get captured because he had foreseen it in his visions, as he had been countering Caedus's own powers to muddy his visions. This is so that when Jaina would finally meet Caedus in a duel to the death, the Sith Lord would not expect it coming. The only reason that Luke himself will not go after Caedus, as he is clearly more powerful than him, is that when Luke killed Lumiya in vengeance for the death of his wife, Mara, he had been tainted by the dark side of the Force. Knowing that Caedus is Mara's actual killer, Luke also knows that he would end Caedus not for the good of the galaxy, but because to enact his vengeance, thus losing himself to the dark side completely. Now, in the aftermath of Ben's capture, Luke had also foreseen Ben getting his information from Shevu, which had reveals to the Jedi Coalition that Caedus is at Nickel One."}, {"tag": "p", "text": "Luke, Leia, her husband Han, Saba Sebatyne and Jaina all take a Skipray 24r Blastboat to Nickel One. While Saba, the Skywalkers and the elder Solos distract Caedus's holding forces with the help of Fett and the Mandalorians, Jaina inserts herself into Nickel One to carry out killing her brother. She meets up with the dispatched Mandalorian forces inside who were sent by Fett to kill the Moff Council. The Mandalorians invade the meeting room where the Moffs hold their meetings, and fight off their guards and stormtroopers as Jaina finds herself a sniping position for when Caedus would reveal himself in the battle. He shows up, but does not give Jaina an opportunity to take him down as he defeats the rest of the Mandalorian forces. He then tells the Moffs and the remaining two stormtroopers to find a safe location while he deals with the sniper, who he does not know is Jaina. Jaina and Caedus then lightsaber duel, but the latter thinks that the former is Luke. However, at the end of the fight, when Jaina cuts off his arm and Caedus immobolizes her with Force lightning, Luke loses hold of Jaina through the Force, thus shattering the illusion cast upon to the Sith Lord, and Caedus sees his real opponent. Jaina then escapes, having failed her mission and too wounded to carry on, and Caedus is left believing that Luke was physically involved in the fight. And after Jaina recovers from her injuries, having returned to the Jedi Coalition, she finds that Caedus has left a blood trail on her that is used in a similar technique harnessed by the Nightsisters of Dathomir, as it can have anyone who put the blood mark on the individual be able to track the latter down. When Luke discovers this, he declares to everyone else in the Coalition that Caedus will now track them down to Shedu Maad and possibly obliterate them if they do not fight back."}, {"tag": "p", "text": "Back on Coruscant, Tahiri interrogates Ben as to where the Jedi base is, but when he refuses to comply, Tahiri uses Shevu's life as leverage. Ben relents, but Tahiri accidentally electrocutes Shevu to death. She is horrified at what she has done, and Ben manages to escape, knocks Tahiri unconscious, threatens the guards into compliance and manages to get Shevu's body properly disposed of. Then he later gets a message telling him to meet someone he is familiar with at Nova Station, and meets up with Hapan Queen Mother Tenel Ka Djo's cousins, Trista and Taryn Zel, who agree to ship him back to Shedu Maad. However, Caedus's fleet tracks him down and attempts to take the Zels' ship, the Blue Slipper. But Prince Isolder's fleet manages to counter Caedus and allow for Ben and the Zels to escape. However, Isolder's fleet is defeated and captured. Ben arrives back at Shedu Maad and is aprised of the fact that Caedus now knows where the base is, thanks to Jaina's mark. The entire Jedi Coalition, along with the help of the Hapes Consortium, prepare for battle against Caedus."}, {"tag": "p", "text": "As Caedus's fleet arrives in the Maad system and battles the forces of the Jedi Coalition, Jaina manages to get aboard the dying Anakin Solo, as it has been weakening thanks to the attacks brought upon it by the Coalition's forces. However, Zekk has been lost in the raid, and his fate becomes unknown for the rest of the battle. Meanwhile, Caedus finds out that the Moffs have managed to create a nanokiller from Isolder's biology that they plan to bring onto Tenel Ka's flagship, the Dragon Queen, and kill everyone aboard of royal bloodline to level the playing field in the battle where the Hapans are concerned. Caedus disallows this, although he even knows that they are lying about their compliance. The Sith Lord, when asked by Tahiri why he simply cannot go back in time and fix such problems with flow-walking, then reveals to her that going back in time to see the late Anakin Solo did not really change the past, as the flow-walks have been too insignificant to be of any consequence. Though she hates him for deceiving her in such a way, Tahiri remains loyal to Caedus and goes down to Shedu Maad to plant a bomb that can wipe out the Coalition's base. Then Caedus tries to enlist Isolder's help in trying to stop the Moffs from unleashing their nanokiller against those board the Dragon Queen. Isolder believes that Caedus is lying, which forces the Sith Lord to break the prince's neck, killing him. Then Caedus takes Isolder's body to an immolation pit to dispose of the corpse, but Jaina tracks him down there and they duel again. Caedus tries to convince Jaina that he needs to save Tenel Ka and his daughter, Allana, from the Moffs' nanokiller, but Jaina thinks that he is lying, like Isolder. Their fight continues, and they both sustain many injuries. But eventually, Caedus's injuries become too great for him to carry on, so rather than wasting the last of his life against Jaina, he becomes Jacen Solo again and alerts Tenel Ka of the danger that she and Allana face. He is unable to complete this warning before Jaina strikes him down with her lightsaber, ending Darth Caedus's life just as his sister realizes what he was trying to do."}, {"tag": "p", "text": "On Shadu Maad, Ben confronts Tahiri and stops her from activating the baradium bomb to destroy the Jedi base. Making her see that she is a better person than Caedus, Ben redeems Tahiri and she turns back to the Jedi's side. Meanwhile, aboard the Anakin Solo, the Coalition forces defeat Caedus's GA forces and round up the Moffs, thus ending the Second Galactic Civil War. They threaten to unleash them to the Hapans for their nanokiller attack on the Dragon Queen, which killed many of royal bloodline, such as Allana, but not Tenel Ka, and unless the Moffs let Jagged Fel rule the Imperial Remnant, they will face certain death by the Hapes Consortium. The Moffs let Jag become their ruler and agree to help clean up the mess that the war has brought upon to other planets. The Solos, despite all that Caedus has done, fall into grief over his death, as he was still Han and Leia's son, and Jaina's brother. What is worse is that Jaina failed to believe that Caedus had told the truth about trying to save Tenel Ka and Allana, and that she had killed him when he became Jacen again in order to alarm Tenel Ka of the nanovirus attack. This makes Jaina evaluate what being the Sword of the Jedi really means."}, {"tag": "p", "text": "Later, Jaina is recovering from her injuries from her last duel with Caedus. Han and Leia show that in a way, Caedus had won the war, as the worlds of the Confederation and the Imperial Remnant have allied to restore the Galactic Alliance, bringing a united galaxy that Caedus had sought for. Natasi Daala is the new Chief of State, Zekk remains missing and it turns out that Allana had survived the nanokiller attack. The incomplete warning that Jacen had given Tenel Ka through the Force was enough to to save herself and Allana from the nanokiller, and then the Queen Mother had given Allana, renamed Amelia, a war orphan, to Han and Leia so that, with everyone else believing that she is dead, no one will go after her via Hapan assassination. Jaina fondly accepts \"Amelia\" into the Solo family."}, {"tag": "h2", "text": "Development"}, {"tag": "p", "text": "Working titles for the novel included Maelstrom and Descent."}, {"tag": "p", "text": "Author Troy Denning initially proposed an ending to Invincible that included Jacen flow-walking to the time of Anakin Solo's final mission in The New Jedi Order: Star by Star (2001), to corrupt Tahiri to be his apprentice. During Jacen's final duel with Jaina, he would have conjured up an image of their mortally wounded brother, Anakin, to vex her. However, by reaching into the past, he would have made contact and switched places with Anakin. The events of the past would not have been altered; the body in the past would be a disguised Darth Caedus, while Anakin would have been transported to the future and resuscitated by Jaina. Ultimately, this idea was not explored beyond just being suggested in the outline."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The 2012 reference book The Essential Reader's Companion dates the events of Legacy of the Force: Invincible to 41 ABY, placing the novel after Legacy of the Force: Revelation (2008) and before Crosscurrent (2010)."}, {"tag": "p", "text": "Each chapter of Invincible begins with a joke told by Jacen Solo when he was a teenager. Most of the jokes were taken from the Star Wars: Young Jedi Knights series (1995–1998), by Kevin J. Anderson and Rebecca Moesta. Additional jokes were contributed by Andria Hayday and Sue Rostoni."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}