{"url": "Lehon", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Galactic Republic planets", "Category:Infinite Empire planets", "Category:Junk planets", "Category:Lehon locations", "Category:Lehon system planets", "Category:Sith planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Lehon"}, {"tag": "p", "text": "Lehon, also referred to as Rakata, Rakata Prime, and the Unknown World, was the homeworld of the Rakata species and the secret capital of their Infinite Empire."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lehon was a tropical world in a remote and relatively unknown corner of the galaxy known as the Tempered Wastes, a largely void area of space. Its surface was largely covered by oceans dotted by numerous clusters of islands and archipelagos. It was the only habitable planet in the Lehon system, but it shared an orbit around its primary star with the Star Forge, an ancient Rakatan space station and factory which drew its fuel directly from the system's primary star. The planet itself was orbited by two small moons, but one of them was close enough to be visible from the surface during daylight, covering a significant portion of the sky."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Infinite Empire"}, {"tag": "p", "text": "Millennia before the birth of the Galactic Republic, the planet was the capital of the ancient Infinite Empire of the Rakata (c. 35,000 – 25,200 BBY). The Rakata were a scientifically advanced species that powered their technology with natural Force sensitivity and used their knowledge to enslave and subjugate other, less-developed species. They created several technological marvels including the semi-sentient Star Forge, which churned out war droids and starships at a rapid rate. The Rakata built large cities on their homeworld, which later became crumbling ruins reclaimed by the jungle."}, {"tag": "p", "text": "The Infinite Empire, which, at its peak, included approximately 500 planets, eleven billion Rakata, and over a trillion slaves, ended in a brutal civil war. During the final days of the Empire, the Rakata were forced to flee back to their homeworld due to widespread slave insurrections and the ravages of a deadly plague which stripped them of their Force abilities, but, on its surface, their war continued. The surviving Rakata, now extinct beyond their homeworld, succumbed to barbarism, with cannibalism becoming common among their warring factions. Battling warlords severely damaged the surface of Rakata Prime through the use of weapons of mass destruction that fragmented it into islands. The majority of the species were forced to flee underground because their planet had become almost uninhabitable."}, {"tag": "h3", "text": "Jedi Civil War"}, {"tag": "p", "text": "During the reign of the Galactic Republic, various Rakatan tribes, including the tribe of the One, emerged back onto the surface of the now-backwater planet, but their civilization was still one of battle and bloodshed. Only the Elders—descendants of the priest caste of the Infinite Empire—kept memories of their once-glorious past alive. Only they had access to the advanced technologies their species had created long ago. They used it to isolate and guard their forbidden lore in the Temple of the Ancients."}, {"tag": "p", "text": "The planet itself was protected by a disruptor field that could disable any incoming ship's communications and navigational systems. This field, operated from the summit of the Temple, was originally constructed to protect the Star Forge. Over the millennia, the planet had become a technological graveyard, with its tropical islands strewn with the wreckage of spaceships unfortunate enough to have stumbled across the mysterious planet's hidden location. The planet was infested with foreign fauna, including rancors and gizka, which the Rakata said came from the sky aboard crashed ships."}, {"tag": "p", "text": "Lehon was visited by Revan twice, in 3959 BBY and 3956 BBY, during the Jedi Civil War. Both times, he used the help of the Elder Rakatan tribe to enter the Temple of the Ancients and was granted passage to the Star Forge. However, the first time, as Dark Lord of the Sith, he lied to the Rakata, saying that he would destroy the great factory, while in fact he wanted to claim it for himself and use it to build an immense Sith fleet to challenge the Republic. The second time, after his redemption, Revan was given the task of freeing an elder from the Black Rakata. After entering the One's chambers, Revan killed the One and other Black Rakata. With this, the elders allowed Revan to enter the temple. Revan disabled the disruptor field to allow the Republic fleet and his own ship, the Ebon Hawk, to breach the factory's defenses."}, {"tag": "p", "text": "When the Star Forge was eventually destroyed in a fierce battle between the Republic and the Sith, the Republic commanders—Admiral Forn Dodonna and Jedi Master Vandar Tokare—celebrated the end of the Jedi Civil War at the Temple exterior. During the ceremony, Revan and his companions were each awarded with the Cross of Glory."}, {"tag": "h3", "text": "Post–Civil War"}, {"tag": "p", "text": "After the Jedi Civil War, the entire Lehon system was littered with wreckage from the destroyed Star Forge and the remnants of crippled vessels which had fought in the final battle of the war. Lehon itself became surrounded with asteroid-like rings of rubble which made navigation to and from the planet extremely dangerous. Though the wreckage would have been valuable as a source of resources, the Galactic Republic chose to make the entire system a protected historical site which was not to be entered without permission."}, {"tag": "p", "text": "Eventually, the planet became accessible to the rest of the galaxy. Lehon was incorporated into the Galactic Republic as a historical preserve. However its true nature was kept secret to avoid creating a panic or encouraging opportunists to attempt to make use of Rakatan secrets. Tourism was kept very minimal. While some Rakata took to the stars, a majority of the population refused to move off-world."}, {"tag": "p", "text": "In 3637 BBY, during the Galactic War, Revan returned to the planet with a large group of fanatical followers with the hopes of building an army to fight the Sith. He established his main base of operations at the Temple of the Ancients, which was later attacked by a mixed squadron of both Republic and Sith loyalists. Revan's lieutenants were defeated, thwarting the former Dark Lord's plans."}, {"tag": "p", "text": "In 3629 BBY, after the fall of the Eternal Empire, Horizon Guard Scout Commander Sterla joined forces with Tassar on Rakata Prime to construct a new Star Fortress to use against the Eternal Alliance, but they were eventually stopped by the Alliance Recon Unit."}, {"tag": "p", "text": "Around 1000 BBY, Darth Bane arrived on Lehon to access Darth Revan's Sith Holocron. Upon landing on the surface, he sensed that the planet was still deeply steeped in the dark side of the Force, even more so than Korriban. By the time of his arrival, the planet was reasonably well known, but it was largely ignored because many of the darker aspects of Rakatan history had been suppressed by the Republic and the Jedi. In a battle with the Sith Lord Kas'im, Bane destroyed a part of the Temple of the Ancients by collapsing one of the major archways, in a duel with his former master."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Star Wars: Knights of the Old Republic, the planet was referred to as the Unknown World. The New Essential Chronology was the first source to give an official name, Rakata Prime, until its native name was eventually given as Lehon in Darth Bane: Path of Destruction."}, {"tag": "p", "text": "In a non-canonical ending of Knights of the Old Republic, if Revan goes to the dark side at the top of the Temple when he reaches the shore announcing his turn, Carth Onasi runs off into the forest while Mission Vao is killed either by Revan (in which event Zaalbar is also killed), or by Zaalbar under the Forceful persuasion of Revan. At this point, Carth is not heard from again until Star Wars: Knights of the Old Republic II: The Sith Lords."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}