{"url": "Leia,_Princess_of_Alderaan", "categories": ["Category:Real-world articles", "Category:Articles that need plot summary", "Category:Incomplete lists", "Category:Canon young-adult novels", "Category:Journey to Star Wars: The Last Jedi"], "nodes": [{"tag": "h1", "text": "Leia, Princess of Alderaan"}, {"tag": "p", "text": "Leia, Princess of Alderaan is a young-adult novel written by Claudia Gray and published by Disney–Lucasfilm Press. It was released on September 1, 2017, as part of Journey to Star Wars: The Last Jedi."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "It is Leia Organa's sixteenth birthday and she participates in the traditional ceremony where she declares her intention to one day take the throne of Alderaan. But she's much more concerned about the way her parents are acting lately: lots of meetings and late dinners and not talking to her as much as they used to. Eventually she discovers the reason for their secrecy: their involvement in the increasingly organized rebellion. When Leia decides to become involved herself in the fight against the Empire, whether her parents approve or not, she will have to prove to them that she is a valuable asset who must be allowed to take a stand, regardless of the risk to herself. Her stand will also put her at odds with a pacifist young Alderaanian man who gives Leia her first kiss…and her first real loss."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "h3", "text": "The Day of Demand"}, {"tag": "p", "text": "Princess Leia Organa is preparing for her Day of Demand, with the help of her attendant droid WA-2V. She's nervous, and has to hurry to the throne room once she's finally ready. In the antechamber, she readies herself, and takes the Rhindon Sword down from the wall, surprised by its weight. The curtain is pulled back, and all two hundred guests turn to look at Leia, who marches forward, sword held high. She approaches the dais where her parents, Queen Breha and Viceroy Bail sit. As Leia reaches the dais, Breha calls out the opening line of the ceremony, and Leia announces herself, with the variant line for when the heir is adopted. The ceremony continues, with Leia naming the challenges of the body, mind and heart she will complete in order to prove herself worthy to inherit: climbing Appenza Peak, representing Alderaan in the Apprentice Legislature and undertaking charity missions to needy planets. Breha asks the audience to bear witness, and the guests cheer. Leia is dejected when her parents turn away to greet guests instead of congratulating her, although Lord Mellowyn of Birren tells her she was \"wonderful.\" For the past six months, Leia's parents have been ebbing away, paying her far less attention than they used to: Bail is constantly busy with private meetings with senators from faraway worlds, and Breha has suddenly turned into a society hostess, constantly throwing extravagant banquets that last nearly until dawn. That night, watching a storm from her bedroom window, Leia vows to do something too great for her parents to ignore."}, {"tag": "h3", "text": "A mercy mission"}, {"tag": "p", "text": "The next day, Leia heads to the Aldera spaceport to set out on her first relief mission. 2V reminds the princess to show respect to the Imperial officials she deals with. Leia is privately thrilled that she can now request the use of the Tantive IV, and is met outside the ship by Captain Raymus Antilles. She thanks him for readying the ship so quickly, and after he tells her they can be underway within the hour, Leia is struck by the realization that he doesn't yet see her as a leader. The trip to Wobani is swift and uneventful, and Leia spends it checking the corvette's cargo. The planet's economy has completely collapsed as a result of the Commodities Enhancement Program, and Leia is angry that none of the senators, including her father, have spoken out about the suffering of its people. So she hasn't told her parents where she's going. When the Tantive IV lands, Leia is shocked when she sees the extent of what has happened to Wobani and its people. She is met by an Imperial officer who, once informed that Leia is ready to get started, calls off the stormtroopers guarding the landing pad, and the starving residents of the camp flood towards the ship. Leia, enraged when she sees the officer smirking at the Alderaanians' difficulties in setting up amid the crowd, grabs a loudhailer and yells for everyone to stop, giving orders so the distribution of aid can begin in an orderly fashion. Once the aid is being distributed, Antilles remarks that the deprivation of the Wobani reminds him of how fortunate they are on Alderaan. Leia, wondering how she is supposed to turn away, decides she's going to evacuate as many refugees from the planet as can fit on her ship."}, {"tag": "p", "text": "Captain Antilles is dubious about the idea, as Leia explains that she's going to talk to the official in charge, believing that he'll agree because she's helping to solve his problems. Antilles doubts it, as Imperial officers aren't known for flexibility, and orders Lieutenant Ress Batten to accompany Leia to the Imperial headquarters. On the way there, Batten notes the refugees' lack of vehicles, speculating that they weren't allowed to bring them, and disapprovingly notes the Emperor's tendency to cause more suffering if a plan of his unintentionally creates suffering. The head Imperial, Major Tedam, refuses to budge at Leia's request, stating he lacks the authority to renegotiate the terms of their landing permit and that her ship can only depart with crew onboard. Upon returning to the Tantive IV, Leia, refusing to give up on her plan, is inspired by the sight of an old woman sewing to \"hire\" some refugees as crew for the ship in order to get people offworld. Since the corvette only has room for 100 more people, Leia goes looking for that number of the neediest refugees, including the old woman and her husband. After the Tantive IV departs, Tedam angrily attempts to call the Alderaanians out for violating the terms of their landing permit, and Leia calmly states that they have done no such thing. Antilles informs the princess that she will have to tell the queen about this. Due to Imperial travel restrictions, the Tantive IV must pass through Calderos Station, a deep-space waypoint, on its way back to Alderaan. Upon arriving, the crew is shocked to see that the station has been attacked. They are approached by a patrol of TIE fighters who demand they identify themselves, and once the corvette's identity is verified, they are ordered to leave immediately. Leia notes that the damage to the station makes it easier for people to travel through the region clandestinely, and realizes that people aren't just complaining about the Empire anymore – they're fighting back."}, {"tag": "p", "text": "Upon their return to Alderaan, Lieutenant Batten tells Leia that she informed Central they were coming, and Captain Antilles, seeming oddly distracted, says he should contact the viceroy. Leia wonders why, as the viceroy only handles off-planet affairs, the actual governing of the planet being done by the queen. Just then, a droid announces Queen Breha's arrival, as she enters with a large entourage. Breha addresses the refugees, welcoming them to Alderaan and promising them all a stipend so they can start their new lives. The refugees cheer, and Breha walks over to Leia and gives her a hug. Then, displeased, she orders Leia to the palace immediately. In the palace library, Breha scolds Leia for going on a mission to a planet in a dangerous situation without informing her parents, as they have important business. Leia angrily asks if the \"important business\" is planning another dinner party, and Breha raises her voice, a rare occurrence. Leia explains that she went to Wobani because there were people in need, and Breha says she knows how desperate they are, but that the planet is one of many loose threads that could become a fuse. Leia wonders what she means. Breha calls Leia out on her lie of omission about her mission, and after Leia nods, the queen explains that she's spent several hours dealing with angry Imperial officials who don't like the idea of being tricked by a young girl. She stresses that Alderaan cannot afford to be associated with any \"dissident action,\" and Leia asks if they shouldn't want to do something about the Empire, as she thought she would help someplace that really needed it. Breha tells Leia that her father and his allies in the Senate have been conducting secret negotiations for resettlement of the people of Wobani for months. Leia is horrified when Breha explains that her actions have destroyed all of Bail's hard work, stating that she's trusting her daughter with this because she's nearly an adult. Breha says that in a few months, Bail might be able to restart negotiations, and tells Leia to choose her missions more carefully from now on. Leia responds that she does have a reason why she didn't talk to her parents: because they didn't have time. Breha apologizes, and heads off to her books. Leia, walking through the palace, passes her father's office and sees him talking to Captain Antilles, and is hurt by the fact that the captain had a chance to report to Bail before she had a chance to talk to him."}, {"tag": "h3", "text": "Pathfinding"}, {"tag": "p", "text": "The day after, Leia catches a ride on a suborbital jumper belonging to the Alderaanian royal guard to her first pathfinding class. Upon arriving at the chalet, she introduces herself to the students already there: Chassellon Stevis of Coruscant, Harp Allor of Chandrila, Sssamm Ashsssen of Fillithar, and an Ithorian. Leia is struck by the next person she meets, a tall girl with green hair in a garishly colored jumpsuit who eventually introduces herself as Amilyn Holdo of Gatalenta, stating that she hopes the course is dangerous because she wants to get comfortable with the nearness and inevitability of death, which weirds Leia out. The course instructor arrives with the rest of the students, including Kier Domadi, the other Alderaanian Apprentice Legislator, and Leia introduces herself to him. The instructor introduces herself as Chief Pangie of the Chandrilan Pathfinding Corps, and explains that over the next several months the class will be going to many different worlds. Pangie demands that everyone show their field generators, and once she's satisfied, the class sets off. Five hours later, Leia and most of the other students are exhausted as they trudge into a small clearing in the forest, where they find a hoversled. The Chief reveals that it's her hoversled, and before departing announces to the students that their next challenge is to find their way back to the chalet before nightfall, or they will get kicked out of the class, to the students' shock."}, {"tag": "p", "text": "As the students slowly make their way back, they bicker over how fast everyone should be going, while Amilyn looks for snow owls. At a lightning-killed tree, Leia and Kier remember that the group needs to turn west. Harp, rushing ahead, slips on ice and breaks her ankle. This prompts an argument, as Leia and Kier refuse to leave Harp in the woods, while Chassellon thinks that, as all of the students have trackers, they should leave Harp behind and hurry to reach the chalet before the sunset deadline. He insinuates that Leia has to stay behind with Harp to keep up appearances, which infuriates her. Chassellon persuades half the class to leave with him, with only the Ithorian even pausing to give an apologetic nod. Only Amilyn and Sssamm stay with Leia, Kier and Harp. Leia, left in charge, decides they will go west. Later, as Amilyn takes her turn dragging the makeshift travois Kier made to carry Harp, she points out a \"bright side\" to the situation: \"Who would've guessed we'd encounter mortal peril so soon?\" Harp does not find this comforting, and tearfully apologizes for slowing them down. Kier reassures her that nobody learns anything new without failing the first few times, and tells Leia that he's noticed she holds herself to a higher standard, because she is royalty."}, {"tag": "p", "text": "Shortly, the group arrives at a wide, snowy slope, too steep to easily walk down. Sssamm, with his sharp Fillithar vision, spots Chassellon's group about two kilometers ahead. Amilyn mentions that she used to love tobogganing when she was a little girl. As Leia, Kier and Sssamm discuss how to carry Harp, Amilyn pulls an emergency tent out of her pack, revealing that they can flatten it out to create a makeshift toboggan. Kier points out it will be difficult to steer, and Sssamm slithers onto the tent, using his coils to hold out the edges and sticking his tail into an unfastened flap to create a sail. They set out down the slope. At sunset, Chassellon and his group, tired and miserable, arrive at the chalet, and are stunned to find Leia's group lounging at the hearth drinking mocoa. Chief Pangie scolds Chassellon for not showing compassion, and when he states he'll tell Queen Breha about what happened, Leia informs him that the exercise was actually her mother's idea, to the Coruscanti's shock. When Leia arrives home, cheerful, she asks a guard if she can see her parents, and is deflated when told that they're planning a banquet and gave instructions not to be disturbed."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The original preview chapter of the book included in paperback editions of Lost Stars had Senator Gall Trayvis, who appeared in the first season of Star Wars Rebels, attending Leia's Day of Demand, with his homeworld identified as Osk-Trill. However, in the published novel, Trayvis was replaced by Cinderon Malpe of Derella."}, {"tag": "h2", "text": "Reception"}, {"tag": "p", "text": "The first printing of the book contained the words \"Strength through joy,\" with Leia Organa attributing them to an Alderaanian philosopher. The words were also coincidentally used as a slogan by Nazi Germany. This generated much controversy on social media platforms, such as Twitter, which led to a response by a Disney–Lucasfilm Press PR representative with a quote by the author of the novel, Claudia Gray, claiming she did not know the real-life history of the phrase when she wrote the book and apologized for its used in such context. The phrase was changed to \"Joy drives out fear\" in later editions of the novel."}, {"tag": "h2", "text": "Legacy"}, {"tag": "p", "text": "On December 12, 2017, it was announced that LINE will be publishing a manga adaptation of the novel."}, {"tag": "h2", "text": "Media"}, {"tag": "h3", "text": "Editions"}, {"tag": "h3", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}