{"url": "Leia_Organa%27s_aunts", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Alderaanians", "Category:Unidentified aunts", "Category:Unidentified humans", "Category:Unidentified royalty"], "nodes": [{"tag": "h1", "text": "Leia Organa's aunts"}, {"tag": "p", "text": "Leia Organa had a number of adoptive aunts. These aunts doted on Organa, but treated her as if she was simply a simpering princess. On one occasion, the young Leia complained to one of her aunts that being a princess had to be about more than silently doing one's duty, but her older relative simply replied, with a sad smile, that it aptly described most of a princess's job."}, {"tag": "p", "text": "The princess loved her aunts, even though she was frustrated by their tiresome etiquette lessons. Leia's aunts did not approve of her joining the Imperial Senate and daydreamed of her marrying a prince. In time, Leia did come to appreciate her aunts' lessons in public speaking, which built her confidence. Despite her aunts' antiquated views of what it meant to be a princess, they approved of Leia being trained in self-defense."}, {"tag": "p", "text": "When, during a mission to Sesid, Princess Leia was forced to crawl up a volcanic chimney, she amusingly thought that her aunts would probably chide her about her appearance if they could see her filthy, half-frozen, and covered with bites."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Leia Organa's aunts, then named Rouge, Celly, and Tia, were first mentioned in Children of the Jedi, a 1995 novel written by Barbara Hambly and published by Bantam Spectra. In that book, they were introduced as the main caretakers of a teenaged Leia Organa. However, that story is part of the Star Wars Legends continuity, formerly known as the \"Expanded Universe,\" and is therefore not official canon. In 2015, the idea that Princess Leia had several aunts was canonized in A New Hope: The Princess, the Scoundrel, and the Farm Boy, a retelling of the classic Star Wars: Episode IV A New Hope story written by Alexandra Bracken. Contrary to their Legends counterparts, the canon aunts were not named, and their number went unmentioned."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}