{"url": "Leia_Organa_Solo", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Semi-protected articles", "Category:We're Doomed!", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Articles with non-canon elements", "Category:Alderaanians", "Category:Alliance High Command personnel", "Category:Bright Tree tribe honorary members", "Category:Corellian nationals", "Category:Coruscanti", "Category:Desilijic servants", "Category:Diplomats", "Category:Endor strike team personnel", "Category:Females", "Category:Galactic Alliance individuals", "Category:House of Organa", "Category:House of Solo", "Category:Humans", "Category:Imperial Senators", "Category:Impersonators", "Category:Jabba's dancers", "Category:Jedi Coalition personnel", "Category:Jedi Knights of the New Jedi Order", "Category:New Republic Chiefs of State", "Category:New Republic Senators", "Category:Pilots", "Category:Rebel Force-sensitives", "Category:Royalty", "Category:Skywalker family", "Category:Slaves", "Category:Space explorers", "Category:Spies", "Category:Waiters"], "nodes": [{"tag": "h1", "text": "Leia Organa Solo"}, {"tag": "p", "text": "Leia Organa Solo (born Leia Amidala Skywalker), a Force-sensitive Human female was at various stages of her life, a politician, revolutionary, and Jedi Knight of the New Jedi Order. The daughter of Jedi Knight Anakin Skywalker and Senator Padmé Amidala of Naboo, Leia was the younger twin sister of Luke Skywalker, and, shortly after her birth, she became the adopted daughter of Bail Organa and Queen Breha of Alderaan, making her a Princess of Alderaan. An accomplished Senator, Leia Organa was most famous for her strong leadership during the Galactic Civil War and other subsequent galactic conflicts, making her one of the galaxy's greatest heroes. Later she married Han Solo, and became the mother of their three children: Jaina, Jacen, and Anakin Solo. Around the start of the Swarm War, Leia unknowingly became a grandmother through Jacen's daughter Allana."}, {"tag": "p", "text": "She had a forceful personality and bright intellect, having accomplished much in her youth: she was a strong proponent for the Rebel Alliance, the youngest Senator ever of the Galactic Empire at eighteen standard years of age, and a member of the Royal Family of Alderaan. Years later, she was instrumental in the creation of the New Republic, and was elected to the position of Chief of State, serving twice in that office."}, {"tag": "p", "text": "Due to her powerful Force heritage, Leia, following her family's legacy, became a Jedi Knight in the New Jedi Order. She was partially trained by her brother Luke and later by Jedi Master Saba Sebatyne, who declared her a fully trained Knight at the end of the Swarm War. This training would serve her well as the galaxy teetered on the edge of collapse into civil war once more during the Second Galactic Civil War, although it complicated her allegiance. During this conflict, Leia's son Jacen turned to the dark side of the Force, becoming the Sith Lord Darth Caedus. Leia and Han became determined to destroy Caedus, feeling that their son was already dead. However, it was their daughter Jaina who ended his life in a lightsaber duel that also concluded the war."}, {"tag": "p", "text": "In the aftermath of Caedus' death, the Solos became the guardians of their granddaughter Allana, at the behest of her mother, Tenel Ka of Hapes, and remained two of the galaxy's most important figures, standing with the Jedi Order amidst the tensions that arose between it and the government of Chief of State Natasi Daala."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life (19–1 BBY)"}, {"tag": "h4", "text": "Birth on Polis Massa"}, {"tag": "p", "text": "A Human female, Leia was born on the asteroid colony of Polis Massa in 19 BBY, shortly after the start of the Great Jedi Purge and the formation of Palpatine's Galactic Empire. Her heavily-pregnant mother, the Naboo Senator Padmé Amidala, had been suffering a Force choke by her spouse Anakin Skywalker, a Jedi Knight who had fallen to the dark side of the Force. Amidala had been brought in a panic to a hospital of the Polis Massa Base by Jedi Master Obi-Wan Kenobi, who had arranged rendezvous with Yoda, Grand Master of the Jedi Order, and Senator Bail Organa of Alderaan. Due to Amidala's condition, the Polis Massan surgeons were nearly forced to remove the twins she was carrying, but the children were born just in time. In a few, feeble breaths, Amidala named her twins \"Luke\" and \"Leia.\" The Senator died mere moments after their birth, effectively orphaning Leia and her older twin brother. The medtechs of the Polis Massan facility had been struggling to save Amidala, but their efforts had been in vain. With the twins' father believed dead on Mustafar, Bail Organa wondered what the Jedi intended to do with Luke and Leia."}, {"tag": "p", "text": "Obi-Wan Kenobi and Yoda knew that the children, both strong in the Force, had to be protected from the inherently evil Emperor Palpatine, who intended to hunt down the remaining Jedi. Amidala's corpse was sent back to Naboo, with the instruction of making it look like she was still pregnant. In this way, nobody would know of the children's existence. When they decided it would be best if the twins were separated, Master Kenobi suggested that he would take the boy, and Master Yoda would take Leia. However, Yoda disagreed, arguing that they should wait for the right time before training the twins in the ways of the Force. At that point, Bail Organa offered to adopt baby Leia, as he and his wife were childless and longing for a daughter. The Jedi agreed, and the infant boy Luke was sent to live on Tatooine with his father's stepbrother Owen Lars and his wife Beru. As promised, Leia was adopted and raised by Bail Organa and his wife, Queen Breha Organa, who had been friends of Amidala during the antecedent conflict known as the Clone Wars. Through adoption, Leia Amidala Skywalker became known as Leia Organa, Princess of Alderaan. Nineteen years would pass before the twins saw each other again."}, {"tag": "h4", "text": "Adoption into the House of Organa"}, {"tag": "p", "text": "Leia, the orphaned daughter of the Naboo Senator and the fallen Jedi Knight Anakin Skywalker, was given a loving home within the House of Organa, one of the galaxy's so-called Ancient Houses. Her adoptive parents could not have children of their own, so Leia became the crown princess, and, as such, was formally referred to as \"the Princess Leia Organa, of the Royal House of Alderaan.\" Although the Organas were not trying to hide the fact that Leia was adopted, they never informed the Princess of her parentage, nor did they reveal the existence of her twin brother. However, during the short time between her birth and her mother's death, Leia gained a faint memory of her mother as a beautiful and kind, yet sad woman."}, {"tag": "p", "text": "Leia had a large extended family to take part in her upbringing. It included Silya Shessaun, a mentor and friend of Amidala, Queen Breha's sister Deara, and Bail Organa's three sisters Tia, Rouge, and Celly, whom Leia later described as \"three redoubtable dowagers\" that \"made her girlhood an intermittent burden.\""}, {"tag": "p", "text": "Even though Leia was rather advanced for her age, having learned to speak and walk before the age of one, she did not show any signs of Force potential—much to the relief of her adoptive father, who knew that being a Force-sensitive in Palpatine's Empire would be a heavy burden. However, she had inherited her biological father's gift, which surfaced for the first time in 18 BBY when her caregiver Memily was about to lean on a weakened railing overlooking a cliff. By throwing a laserball at it, Leia alerted Memily and saved her life."}, {"tag": "p", "text": "Because of the incident, Leia became a target of the Galactic Empire for the first, but certainly not the last time. Word of a child with extraordinary reflexes had reached the galactic capital of Coruscant, and Inquisitors Ferus Olin and Hydra were sent to investigate. Olin, a former Jedi apprentice, was in fact a double agent trying to save as many Force-sensitives as possible, and had come to Alderaan on Obi-Wan Kenobi's behest. Even though the Inquisitorius was not aware of the child's gender, Kenobi feared that the toddler might be Leia and wanted to turn the Empire's eye away from Alderaan. Olin covered up the incident, stating it was nothing more than a rumor, and Leia's heritage remained a secret. The Imperial informer turned out to be Deara Antilles; Queen Breha had mercy on her sister, but exiled her from the royal family forever. Following the incident, Olin settled on Alderaan. The former Jedi was tasked with protecting the Princess, following her like a shadow under the guise of the obsequious botanist Fess Ilee. Olin's act was so convincing that the young Princess came to despise that greasy yes-man Ilee who always seemed to get in her way."}, {"tag": "h4", "text": "The tomboy Princess"}, {"tag": "p", "text": "Nicknamed Lelila, the Princess grew up with Winter, the orphaned daughter of Bail Organa's aide Sheltay Retrac. Leia's best friend and companion since earliest childhood, Winter possessed a natural grace and poise that often led court visitors to mistake her for the Princess of Alderaan, while the tomboy Leia was regarded as a domestic girl. The Princess's lack of upper-class gentility remained a constant source of despair to her aunts Tia, Rouge, and Celly, who were nevertheless determined to turn her into what they called \"a Proper Princess,\" and hired deportment teachers to drill into her manners fitting for the heir of an Ancient House. One part of making her a lady was to learn how a princess dresses up and does her hair. According to Alderaanian customs, Leia's hair was allowed to grow long and arranged into elaborate hairstyles. Ironically, one of Leia's trademark symbols—her signature \"bun\" coiffure—was inherited from her mother's homeworld of Naboo, although a long time passed before she came to know it. To avoid the tiresome hairstyling, she even cut her hair once—only to be forced to wear a wig, even though she argued that she did not need earmuffs in the summer."}, {"tag": "p", "text": "While Leia disliked being \"everyone's dress-up doll,\" her bright and outspoken nature blossomed out when she had a chance to learn diplomacy, government and languages. Like her birth mother Padmé Amidala before her, Leia had the benefit of palace education: the best equipment and the finest tutors, among them Arn Horada, who instructed her in galactic politics and history, and Amidala's former handmaiden Sabé, who tutored her in matters of court etiquette and diplomacy. Wanting to expose her to as many experiences as possible, Bail Organa often took his daughter along to trips to other worlds, such as Ithor, where he attended the Time of the Meeting as the representative of the Imperial Senate. About six years old at the time, the Meeting was an unforgettable experience for Leia."}, {"tag": "p", "text": "Despite knowing that she was loved, Leia sometimes felt an outsider to her family. Winter was like a sister to her, but the young Princess still wished she had a brother or a sister of her own, someone she could truly feel close to. In her growing years, she often felt that she was just slightly different, without exactly knowing how, and that a part of her was missing. Winter remained a comfort to Leia, despite the differences in their personality. Though the pair's physical resemblance was tempered by Winter's stunning white hair, the friends soon learned to employ similar looks for tactical advantage, a practice they would continue throughout their lives. Winter sometimes disguised herself as Leia so that the Princess could escape the Aldera Royal Palace to create mischief and visit inappropriate boys. Leia also befriended Neena, a musically talented girl about her age who lived in the Organa household."}, {"tag": "p", "text": "Besides receiving palace education, Leia attended the Collegium for Young Ladies in Crevasse City as of 12 BBY. During her time there, the young Leia expressed early tendencies toward rebellion. When the school's staff once served bottled juice instead of freshly squeezed, a seven-year-old Leia staged a sit-in protest with the other students. After playing the forbidden anthem of the Old Republic, and reprogramming the Collegium's security mainframe to swap every reference to Palpatine with a curse, the Princess was finally expelled from the school."}, {"tag": "p", "text": "In the year 11 BBY, Leia and her friend Winter once hid a giant wooly moth in the desk drawer of Alderaan's Minister of Agriculture. The harmless joke, however, took a more serious turn when it was discovered that the moth had eaten the budget for the whole next year, written on a sheet of flimsiplast. As a means of punishment, Leia was banned from participating in a party held in the Grand Ballroom of the Royal Palace. The Princess and Winter attended the gala anyway, hidden behind a marble staircase with a store of scavenged food. Having accidentally crossed the eyes of Fess Ilee, the young girls were afraid and got out of their hiding place, bumping into Bail Organa, who promptly banned them to their rooms. The following night, the Princess got over the wall so she could join Winter at the Gingerbell blossom festival. Walking alone in the deserted streets of Aldera, Leia was almost kidnapped by a trio of goons who worked for Senator Ask Aak of Malastare. Aak wished to use the child as a bargaining chip so that Bail Organa would vote they way he wanted. The rapture attempt, however, was thwarted by Ferus Olin, who had been following the Princess in the streets. Later that night, Leia lost her way. The Princess climbed upon a half-finished building so she would be able to see the Palace in the distance, but she nearly fell while trying to climb down. Once again, Ferus Olin's timely intervention allowed Leia to escape unharmed."}, {"tag": "p", "text": "Two years later, Princess Leia was attending the prestigious Alderaan Select Academy for Young Ladies under the tutelage of the strict Madame Vesta, whom the Princess described as \"a rancor of a nanny.\" Together with other daughters of Alderaanian nobles, the Princess learned etiquette, table manners and many other useful (and to her mind, rather boring) things that a lady needed to know. During this time, Leia saw the downside of the upper class as well: many of the girls had a condescending attitude towards ordinary people, and expensive parties were thrown in the court even though many in the galaxy were hungry and suffering. Once she reached her adolescent years, Leia discovered that one of her school friends used drugs."}, {"tag": "p", "text": "However, her adolescent years also had their share of cherished memories. Leia became friends with Heeth and Raal Panteer, two scions of the patrician House Panteer. Once, the Princess snuck out at night with Raal Panteer to swim in the reflecting pools of Aldera. The pair, who had fallen in love, exchanged their first kiss on that occasion, but the relationship failed to last. Organa and the Panteer brothers would meet again during the Galactic Civil War. At age thirteen, Leia and Winter met Jahan Cross, the son of the Alderaanian diplomat Davim Cross. Both young girls had a \"mad crush\" on him, which, according to the Princess, \"lasted three whole days.\" After a long hiatus, the three met again in 3 BBY, on the occasion of the 25th anniversary of the Alderaan Ascendancy Contention. Upon seeing the two young ladies three years after leaving Alderaan, Cross made it look like he did not recognize Leia, \"mistaking\" Winter for the Princess on purpose."}, {"tag": "h4", "text": "A senator in the making"}, {"tag": "p", "text": "Leia showed promise in politics and from early on, Bail Organa began grooming her to one day succeed him in the Imperial Senate, encouraging her to attend Alderaanian debates and palace receptions for offworld personnel. In this Leia unknowingly followed the footsteps of not only her adoptive father, but her late birth mother, who had entered politics at an early age and became a Senator. Indeed, Leia resembled Padmé Amidala in many ways: she was confident, poised, and a had a quick political wit."}, {"tag": "p", "text": "When Leia was thirteen, she met Wilhuff Tarkin for the first time when he came to visit Bail Organa on Alderaan. She had heard a lot about the Moff from her father, none of it good. She instantly disliked him, maintaining that he represented everything that was wrong with the Empire. Leia was particularly disgusted with the idea of Tarkin having a slave, as she did not understand how it was possible that the Emperor allowed slavery. She even dropped a water balloon on his head while \"watering her plants.\" The visit made Leia seriously contemplate what kind of galaxy she lived in, and what she could do to change it."}, {"tag": "p", "text": "At the age of sixteen, Leia attended the University of Alderaan together with Winter, whose holographic and audiographic memory, as Leia would joke, was very useful with homework. They studied history and art, two subjects the Empire seemed eager to suppress, which in Bail Organa's opinion was all the more reason to study them. Leia also began training with Giles Durane, a mercenary her father had hired to teach her self-defense and marksmanship. True to her tomboyish nature, she enjoyed these lessons far more than those of Madame Vesta, and showed considerable talent in both areas."}, {"tag": "p", "text": "Around this time, the Princess began to realize that her father was preparing her for something more than just becoming the next Senator of her home planet. A month before turning seventeen—the age of adulthood in the eyes of Alderaanian law—she accidentally overheard a secret HoloNet meeting Bail Organa was having with fellow Senators Mon Mothma of Chandrila and Garm Bel Iblis of Corellia, where the name Alliance to Restore the Republic came up. Leia's hatred for the Empire had been growing over the years—she certainly found their treatment of non-Humans and women atrocious and their desire to control everything appalling—but this was the first time she heard anyone discuss an open rebellion. She decided not the tell her father what she had heard, but promised herself to make him proud and do whatever it took to restore the freedoms the Empire was systematically taking away."}, {"tag": "p", "text": "Among the Ancient Houses, it was customary to bring the daughters to Coruscant when they finished school at seventeen—or even sixteen, if the parents were ambitious to start the long and complex search of a suitable groom candidate at the Imperial Court. The Princess's aunts would have been glad to see their niece marry someone from one of the other old Houses; Leia, however, regarded their heirs as \"brainless twerps\" and refused to be presented to the Emperor until she could do so as a Senator in her own right, not simply as a young girl in the Court marriage market. Her aunts were horrified, doubly so when Leia's decision was backed by Bail Organa."}, {"tag": "p", "text": "The time for Leia's introduction at the Imperial Palace came soon enough, though. At the age of 18, she became the youngest Imperial Senator ever elected, and Bail Organa formally presented her to Palpatine shortly before she assumed her Senatorial post. Having witnessed earlier a Caamasi being arrested by two stormtroopers for simply trying to buy a meal at a restaurant, Leia firmly decided that she would bring up the issue to Palpatine at the same time. When she met the Emperor, however, she became frightened by the dark side radiating from him and was unable to do anything more than mutter thanks to his compliments as Darth Vader watched. Following the reception, Bail assured her that there was nothing to be ashamed of, as it was a common reaction to seeing Palpatine, especially for the first time. To make her feel better, Organa told Leia how proud he was of her, and related a piece of good news—he had arranged for the Caamasi she saw arrested to be released. Happy, Leia went to meet the Caamasi, who introduced himself as Eg'ros Akala."}, {"tag": "h3", "text": "Imperial Senate and involvement in the Rebellion (2–0 BBY)"}, {"tag": "h4", "text": "The Rebel Senator"}, {"tag": "p", "text": "Sometime after turning 17, Leia had shared with her father her disgust of the Empire and how it treated its citizens, as well as her desire to make a difference with him. Her fire and abilities were noted by some Imperial officials because, as of 2 BBY, Leia was being held captive on the planet Kashyyyk to keep her out of the way. She was not harmed, but rather treated as a dignified \"guest\" as the Imperials in charge did not wish to provoke a galactic incident by harming the daughter of a powerful and wealthy Senator. Still, she was not allowed to leave, nor was she permitted to communicate with the outside world. Also, Captain Ozzik Sturn threatened to have her be an \"unfortunate victim in a Wookiee uprising.\" While on the planet, Leia collected data on the Skyhook that was being used to take Wookiee slaves from the planet in mass numbers. She stored this data in her droid, R2-D2. When Darth Vader's secret apprentice, Galen Marek, arrived to save her in order to enlist the trust and cooperation of her father, Leia refused to leave until the skyhook was destroyed. Marek promised to destroy it if she would go leave the planet and fly to safety, which she did."}, {"tag": "p", "text": "A few weeks later, Leia participated in the meeting on Corellia to establish the Rebel Alliance with her father, Mon Mothma, Garm Bel Iblis, Jedi Rahm Kota, and Galen Marek. However, while the other attendees of the meeting were present in person, Leia participated via hologram. Her physical absence turned out to be beneficial as that her holo transmission was able to be terminated before her involvement could be discovered when the meeting was raided by stormtroopers led by Darth Vader. Thus her direct involvement with the new Rebellion was unknown to Vader and the Emperor."}, {"tag": "p", "text": "Leia was also present on Kashyyyk for the meeting that did officially establish the Alliance to Restore the Republic. Because Marek had sacrificed his own life to save her father, Kota, Mothma, and Bel Iblis from the Emperor so that they might live to establish the Rebellion, she suggested the adoption of his family crest as the symbol of the fight against the Empire."}, {"tag": "p", "text": "In 1 BBY, Bail Organa—now a known enemy of the Empire—stepped down as Senator of Alderaan, a position he had held for thirty-one years, and Leia took his place. A keen political thinker, Leia knew that her diplomatic immunity and consular ship would be perfect for running covert missions for the Alliance. Bail agreed, and thus began Leia's double life as a Senator and a Rebel."}, {"tag": "p", "text": "Young Senator Organa inherited her father's diplomatic cruiser, the Corellian corvette Tantive IV. Raymus Antilles, a relative of Queen Breha who had served under Bail Organa as well, continued as the captain of the ship. Winter accompanied Leia to Coruscant as an aide; she was aware of the Princess's involvement in the Rebellion, and participated in many of the Alliance's operations herself in the following years."}, {"tag": "p", "text": "During her time in the Senate, Leia worked with Senator Pooja Naberrie of Naboo, her maternal cousin. The two became good friends, completely unaware of their familial relationship. Not everyone was pleased with the young Senator, however. Despite her first intimidating encounter with Palpatine, Leia became one of the leading voices of criticism towards the Emperor's policies. Being somewhat of a political firebrand, her outraged sense of justice made some people feel threatened, while others viewed her as pathetically idealistic. Drost Elegin, head of the Ancient House Elegin and a notorious playboy at Palpatine's court, mockingly called her \"Madame Senator\" and \"Little Miss Inalienable Rights.\""}, {"tag": "p", "text": "Shortly after becoming a Senator, Organa began working with fellow Senator Mon Mothma on the Rebel war effort against the Empire. During her years in the Alliance, Leia was taken by Mothma as her political protégé and groomed Organa for eventual leadership.[source?]"}, {"tag": "p", "text": "During the early stages of the Galactic Civil War, Leia aided Star Tours as a rebel front for ferrying Rebel spies. When one of the Rebel spies nearly ended up captured at Spaceport THX1138, Leia gave a transmission to the escaped StarSpeeder 1000 carrying the spy to go to the rendezvous point where the spy will be safely extracted by the Rebels. In addition, she eventually ended up getting a price on her head and was among the most wanted criminals in the galaxy."}, {"tag": "h4", "text": "Mission to Ralltiir and the Battle of Kattada"}, {"tag": "p", "text": "Prior to the Battle of Yavin 4 Leia went on a diplomatic mission to Ralltiir, a world subjugated by the Empire. It was here that she discovered a wounded Rebel who possessed vital information on the Death Star. While in the process of rescuing him, Leia encountered the Moff of Ralltiir, Lord Tion. After getting the information, Leia rescued the Rebel. Later, Leia killed Tion in self-defense, making her an enemy of the Empire. After discovering the Imperial superweapon, Rebel spies were able to steal the Death Star's blueprints, sending them to the Rebel Alliance before being killed."}, {"tag": "p", "text": "Following the trip to Ralltiir where they retrieved the Ralltiir rebel, Basso, Princess Leia and her uncle Raymus Antilles traveled on the Tantive IV to Kattada's main space port in Haleoda. Upon arriving, they were greeted by Haleoda's ruler Madam Mia Ikova, a sympathizer of the Rebel Alliance, who agreed to help deliver supplies to the rebels on Ralltiir. Later, at the spaceport, Leia and Mia Ikova received word from a messenger that an Imperial patrol ship was landing. By then, Leia and her crew had realized that it was too late to escape and that they could not leave Mia Ikova and her people to deal with the Empire alone. The Imperial Landing craft landed directly beside the Tantive IV, and both sides opened fire. Shortly after, a force of stormtroopers and scout troopers departed from the landed on the planet under the command of Commander Karg, who announced that all who were present were under arrest in the name of Emperor Palpatine. After refusing to surrender Karg ordered his legion of stormtroopers to shoot, injuring Mia."}, {"tag": "p", "text": "Enraged at her refusal to surrender, Karg attempted to shoot Leia. Luckily, Leia was saved when the Tantive IV turbolaser turret opened fire on Karg, wounding him severely. The Tantive IV's crew then retrieved Leia, Ikova and Karg and brought them to the medical bay. Unfortunately, Mia wasn't able to overcome her injuries and died. Leia blamed herself for what had happened and wished she had never come to Kattada. Ikova's father responded by reminding Leia that she had come to seek help for the rebels on Ralltiir who needed their aid badly and that she should not let what had occurred sway her from her purpose, before presumably dying. Later, Organa lead a ground assault, successfully neutralizing the imperial threat on the planet. Following the battle, Leia left for Alderaan on the Tantive IV after saying farewell to her Kattadan allies."}, {"tag": "p", "text": "After the disastrous Battle of Kattada, Organa was contacted by her father, giving her an important mission to track down Jedi Master Obi-Wan Kenobi and bring him to Alderaan. Leia set a course to the planet Tatooine with the stolen Death Star plans in tow."}, {"tag": "h3", "text": "Early Galactic Civil War (0 BBY–4 ABY)"}, {"tag": "h4", "text": "Death Star I campaign"}, {"tag": "p", "text": "In 0 BBY, Organa was captured along with her ship, the Tantive IV, by Darth Vader. She was secretly on a rebel mission above Tatooine to find Jedi Master Obi-Wan Kenobi and return him to Alderaan, although she simply stated she was a member of the Imperial Senate on a diplomatic mission to Alderaan. After a skirmish between the star destroyer and Tantive IV, the rebel ship's reactor was damaged, and Darth Vader boarded the ship through the main hangar of his star destroyer after pulling in the damaged ship with a tractor beam. The Sith Lord sought to recover the plans for the Death Star I, which Imperial Intelligence suggested had been stolen by Rebel spy Kyle Katarn.[source?]"}, {"tag": "p", "text": "Unknown to Vader, the young senator had hidden the plans inside an R2 unit, R2-D2, and sent the droid to find the legendary Jedi Master Obi-Wan Kenobi on the planet Tatooine. Leia attempted to hide from the stormtroopers in her ship, but was found and stunned after shooting one of them with her sporting blaster. She was cuffed and brought before Lord Vader, who accused her of treason, although Leia untruthfully denied any connection with the Alliance."}, {"tag": "p", "text": "Vader brought her to the Death Star I, where he personally interrogated and tortured her, seeking the location of the plans and the hidden Rebel base from which the Empire suspected the Alliance was striking. Remarkably, she managed to keep silent, despite Vader's Sith powers and the use of an interrogation droid. In an interrogation cell, she was able to resist punishment and refrain from revealing the base's location."}, {"tag": "p", "text": "Wilhuff Tarkin, Leia's old acquaintance and now a Grand Moff, threatened Organa with the destruction of her homeworld, Alderaan, if she did not reveal the location of the Rebel base. She lied, giving them instead the location of a long-since abandoned base on Dantooine. Tarkin proceeded with the destruction of Alderaan regardless, saying Dantooine was too desolate and sparsely populated to make a suitable demonstration of the superweapon's power; this was one of the most infamous acts of the Empire and a shocking example of the Tarkin Doctrine of rule by terror. Leia was then placed in a holding cell and scheduled to be executed, while the Imperial Navy deployed scout craft to investigate Dantooine."}, {"tag": "p", "text": "Princess Organa's message had reached Obi-Wan Kenobi by this time, and he set out from Tatooine with Luke Skywalker, intending to bring R2-D2 to Leia on Alderaan. Kenobi had hired Han Solo as a pilot. Arriving in the Alderaan system shortly after the world's destruction, the Millennium Falcon was captured by the Death Star's tractor beam, while the station was still positioned in the system."}, {"tag": "p", "text": "Surprisingly, this small group managed to avoid immediate capture. Finding that Organa was on the station, they set out to rescue her. Killing a number of stormtroopers they succeeded in rescuing Leia. Tarkin had by this point discovered that Dantooine was indeed abandoned. In order to find the true location of the hidden base, he ordered his soldiers to allow the small band to escape with Leia, after planting a tracking device on the Falcon. Darth Vader, meanwhile, set out to find Obi-Wan Kenobi, whom he later killed in a duel."}, {"tag": "p", "text": "The Princess ran with the band of rescuers, traveling along a large portion of the station to try to locate the Millennium Falcon. They found the ship, and, using Obi-Wan's duel with Vader as a distraction, escaped the station, thanks to Obi-Wan disabling the tractor beam. Organa realized that her escape must have been deliberately permitted by the Empire, and surmised that the ship was being tracked. However, she nonetheless decided to return to the base on Yavin 4."}, {"tag": "p", "text": "Presumably, she would have been arrested immediately had she tried to land on any inhabited Imperial world, and finding another place to trade ships would have been complicated and dangerous. (Locating the tracking device would have been virtually impossible, given how small such a device could be.) This was a risk, of course: if no weakness could be found, or if the discovered weakness could only be exploited by, for instance, a saboteur on board the Death Star, it would be necessary to stage a massive evacuation."}, {"tag": "p", "text": "Returning to Yavin 4, Princess Organa found that her gamble had paid off, as the plans did in fact reveal a weakness that starfighters could potentially exploit: a small exhaust vent in the polar trench. The rebel Alliance readied their fighters, and, receiving Instructions from Leia, readied for what would be known as the Battle of Yavin, a major turning point in galactic history, and the event the new date system for the galaxy was based on. During the battle, the Death Star was destroyed by Organa's twin brother, Luke Skywalker (although this familial relationship was unknown by both twins at this time) after two runs attempting to hit the vent. This marked a turning point for the Rebellion."}, {"tag": "p", "text": "Following the Rebel victory at the Battle of Yavin, Leia held a public ceremony, rewarding Luke Skywalker and Han Solo for their accomplishments and heroism during the battle. She gave Han the rank of Captain and Luke the rank of Commander."}, {"tag": "h4", "text": "Hero of the Rebellion"}, {"tag": "p", "text": "Several days after the Battle of Yavin, Leia received reports that Han Solo was stealing Sith treasure from the ancient temples on the forest moon. She, along with Luke, raced out to catch him, but he rocketed away in the Millennium Falcon just as they got to the temple. Furious, she denounced Solo, despite his efforts at the major battle, and issued a warrant for his arrest, should he return to Yavin 4. When he did return, she found out that the treasure was sold to finance the Alliance, and she forgave him. Subsequently, she went with him on a mission to the Incom Factory to negotiate the purchase of new X-wings with Vors Voorhorian."}, {"tag": "p", "text": "A week after the Battle of Yavin, Leia, R2-D2, and Luke traveled to Rebel base of Akuria II to insure against a sudden Imperial counter-attack on Yavin. But because Artoo wasn't properly repaired the ship went off course. After a near-miss with an Imperial fleet, Organa and Skywalker encountered four android children, who had the power to control the elements, and a computerized \"Keeper\" on a formerly war-torn world who helped them to escape the Imperials."}, {"tag": "p", "text": "When the Galactic Empire destroyed Alderaan the Rebellion lost a lot of its funds. Therefore, Jan Dodonna sent Leia to Muunilinst where she should meet the Muun Mak Luunim. That Muun had codes for some secret accounts of the Rebellion and although Leia wanted to travel to some survivors of Alderaans destruction by Delaya she agreed to the mission. Together with Luke, Chewbacca, Han and the droids she flew to Muunilinst but they were attacked by an imperial TIE fighter before they could meet Mak Luunim. In the fight an unknown pilot came to their aid and adjacent he crashed on a moon. Leia and the others found his empty fighter and by the searching of him they met a reek which Luke could beat. After that they discovered the pilot in a cave where they were attacked a second time by a reek and Han shot with his blaster for their defense so that they were surrounded in the cave. Only Luke could disburden them and with the Falcon the group and the pilot who said that his name had been Tobin Elad could leave the moon. Because he told Leia that he had been a warrior who had lost his home and family she got some sympathy for him. They took him with them to Muunilinst nevertheless Han and Leia weren't sure whether they could trust him. On Muunilinst Luke must drive a race for the Muun Nal Kenuun so that he gave him the codes of the Rebellion which he took after the death of Mak Luunim. Without the others Leia and Luke made an emergency plan and before the race began the two seemed to have a controversy. Leia left the group and appropriate the krayt dragon Urgiluu of Nal Kenuum. So she had a pressurizing and could change the freedom of the group against the dragon when Kenuum wanted to get the head money of Han and Tobin. With the codes of the Rebellion they went back."}, {"tag": "p", "text": "Against Luke's better judgment, Leia sought the help of Raal Panteer, a childhood friend from Alderaan, in finding a new location for the Rebel base. Raal did not care for the Rebellion much, though he did care for Leia, and proposed that she stay on the moon with him and together they could preserve a bit of Alderaan together. When Leia accompanied Raal on a tour through the wild preserve, they crash-landed on planet where Panteer was bitten by a creature and died. Enraged Heeth ordered Leia to leave the planet, refusing to help the Rebellion."}, {"tag": "p", "text": "Shortly after the loss of their base on Yavin 4, Leia, Nera Dantels, and Jorin Sol accompanied Luke to Jabiim where they discovered that the locals had a personal vendetta against Anakin Skywalker after he abandoned them to the Confederacy of Independent Systems during the Clone Wars. They were captured by the natives shortly after. Having managed an escape from the rebel group who wanted revenge for their father's actions during the Clone Wars, Leia, Luke, and the droids fought their way through Imperial stormtroopers and encountered Nolan Gillmunn, a local resistance leader and son of Orliss Gillmunn. Becoming allied with Nolan and his band of rebels, Organa and the others participated in the subjugation of Jabiim."}, {"tag": "p", "text": "In 0 ABY Organa traveled to Metalorn on a mission to spread the message of hope to its residents. Metalorn, a factory planet, had been controlled by the Empire, under the direction of Governor Corwyth with no information of the Rebellion reaching its citizens. Leia managed to evade Imperial stormtroopers long enough to contact her former instructor Arn Horada in order for him to spread the word that the Rebel Alliance actively opposed the Empire's tyranny. Soon after Organa was confronted by Baron Orman Tagge before she was able to establish any details, but managed to escape with the help of a youngster named Tammi."}, {"tag": "p", "text": "A short time later, she was forced to land on Bedlam while escaping from Imperial forces. Leia soon found the remains of Imperial stormtroopers that had apparently been lying there for thousands of years. She then met four Bedlam Spirits—Tilotny, Horliss-Horliss, Cold Danda Sine and Splendid Ap—and three stormtroopers. The Spirits, curious about the \"tiny movers,\" decided to play with them. Tilotny turned one stormtrooper into a diamond and then transformed Leia's heart into a diamond as well, killing her instantly. Meanwhile, Tilotny killed the remaining stormtroopers and ordered Splendid Ap to clean the mess. He resurrected Leia and the stormtroopers, but placed the latter 8,000 years in the past. After regaining consciousness, Leia somehow managed to return to Yavin base."}, {"tag": "p", "text": "During the time period shortly after the Battle of Yavin, Leia was assigned to go Shelkonwa to meet with an Adarian named Yeeru Chivkyrie to see if she could integrate three separate Adarian groups into the Rebel Alliance. Originally, Luke and Han were going to go with her, but a series of pirate attacks on their supply lines caused the Alliance to send them to investigate, and Han's attention had been annoying her anyway. She would later regret that decision, though. Arriving on Shelkonwa, Leia met with the leaders of the resistance groups, and later with Administrator Vilim Disra, who she had been told wanted to seek to join the Alliance. However, Disra, upon seeing her, double-crossed them, locking down the spaceports and starting a search for her. Leia took cover in a small lower-income neighborhood, posing as a tapcafe waitress. While there, she foiled a burglary attempt on a nearby tenement, causing the local populace to not tell patrollers of her presence. Eventually, Vader and the 501st Legion arrived in search of her, but Han, Luke, and Chewie arrived on Shelkonwa, having heard that she was in trouble. Using an ISB freighter that had been appropriated by the Hand of Judgment, who were working with Han, Luke, and Chewie, they made their way back to the Falcon, where the Rebels and rogue stormtroopers parted ways."}, {"tag": "p", "text": "With Organa now exposed as a Rebel, she took over the Alliance's diplomatic efforts. At the Conference of Uncommitted Worlds on Kabal, she won the Alliance the support of Silver Fyre and her Aquaris Freeholders. She also encouraged sedition among the planets of the distant Minos Cluster."}, {"tag": "p", "text": "Just before the Evacuation of Yavin, a transport filled with Alderaanian refugees, Bail Organa landed at the Rebel base. As Leia went out to greet them, she was reunited with Darlen, a friend from her life as a Princess on the destroyed planet."}, {"tag": "p", "text": "Sometime after the Battle of Yavin 4, Leia, accompanied by Luke, crash-landed on Mimban. On Mimban, Leia and Luke encountered Halla, a Force-sensitive. They struck a deal with her, promising to find the Kaiburr crystal if she aided in their escape. During their search, Leia and Luke confronted Darth Vader. Darth Vader managed to injure Skywalker and would have killed him if it weren't for Leia. Using Luke's lightsaber, Leia briefly dueled the Dark Lord and while had been able to strike a glancing blow on him, she was quickly defeated due to her inexperience with the weapon. Luke was able to heal her wounds with the Kaiburr crystal and defeated Vader, with the help of Obi-Wan Kenobi's spirit. Leia subsequently secured funding from the Circarpous IV business underground after revealing an illegal Imperial mine on Mimban."}, {"tag": "p", "text": "Shortly after the disastrous mission to Mimban, Leia was able to access lost Organa resources of money and capital on Ord Mantell greatly needed for the Rebel war effort. Leia also focused her efforts on rallying planets to help them defeat the Empire. On one occasion she traveled to the Minos Cluster, where she helped unify Rebellion against the Empire."}, {"tag": "p", "text": "At some point during 1 ABY Leia crash landed on Phelarion. Under the alias Lerna she became a domestic servant for Lady Tarkin until she was able to escape on board the Millennium Falcon."}, {"tag": "p", "text": "Around 2 ABY, the Rebels began to move their base to the ice planet Hoth after their base on Yavin 4 was discovered. Leia helped establishing Echo Base since it was but a small outpost. In 3 ABY, Luke went missing while on a patrol. Worried, Organa sent Han to look for him. Fortunately Han returned with an unconscious and badly injured Skywalker in tow. Luke was immediately put into a bacta tank and recovered from his encounter with a wampa. When Han confronted Leia on the issue of their relationship, an incensed Organa kissed Luke, causing a love triangle between the three friends."}, {"tag": "p", "text": "Admiral Ozzel, the Imperial officer directing Lord Vader's fleet, used probe droids to find the Rebel base, although at the time, he thought they were smugglers. When Vader confirmed that it was indeed the rebel base, he ordered a full-scale attack. Discovering that the Alliance was at risk, Organa helped coordinate the evacuation of the Rebel base from Hoth. Transports were launched to take members to other bases, accompanied by fighters and ground-based ion cannons. Snowspeeder squadrons and infantry were deployed to hold off incoming Imperial AT-ATs. However, the attacking forces penetrated the rebel base, and damaged it substantially. Despite the ongoing battle, she remained composed and issued commands from the crumbling base. Luckily, she was able to escape any danger and flee with C-3PO, Han Solo and Chewbacca on the Millennium Falcon, left with no other option but to accompany them due to a cave-in caused by the bombardment blocking the path to the transports. Pursued by Imperial fighters, and hobbled by a non-functional hyperdrive, they escaped by flying into an asteroid field."}, {"tag": "h4", "text": "Crisis at Cloud City"}, {"tag": "p", "text": "Princess Organa's initially adversarial relationship with Han Solo around this time evolved into a more romantic one. In the asteroid field, Han Solo, Chewbacca and Princess Leia landed in a tunnel on a small asteroid, attempting to repair the damaged hyperdrive of the Millennium Falcon. The trio did not realize that the tunnel was in reality the throat of a fabled space slug, but escaped just in time. They then tried to find a system near enough to reach; they make their way to Bespin."}, {"tag": "p", "text": "Not long after their escape from Hoth, Leia, Han, Chewbacca, and Threepio went to Cloud City, then owned by Han's friend, Lando Calrissian, to get help with the Falcon. Soon after they landed, on platform 327, Cloud City officials came to greet them, but the group does not know that they only allowed them onto the system because the Imperial bounty hunter, Boba Fett was present searching for the escaped rebels, and had followed them. C-3PO went missing, and Lando took them in for breakfast, only for the trio to find that Darth Vader and his stormtroopers were lying in wait. Han was soon tortured and Leia and the Wookiee were thrown in the dungeon. Moments later Lando came to the dungeons to tell the group that he did what he needed to and informed them of Vader's trap for Luke Skywalker."}, {"tag": "p", "text": "Solo was then used as a test subject for the carbonite-freezing process, which Darth Vader intended for Luke Skywalker (Solo survived the freezing process, and was taken to Jabba the Hutt by the bounty hunter Boba Fett.) Before he was frozen, her parting words were \"I love you,\" to which Solo responded \"I know.\" (Listen (help·info)) After Han was frozen Leia unsuccessfully warned Luke of the incoming danger before being taken as Vader's prisoner. Lando then felt pity for the prisoners and escaped in the Millennium Falcon along with Princess Leia, Chewbacca, and the rediscovered C-3PO and R2."}, {"tag": "p", "text": "Leia displayed latent telepathy, despite having never been trained in the use of the Force, when Luke reached out to her and she sensed his distress as he hung from a weather vane after being defeated by Darth Vader. She led the Falcon back to rescue him, and together they departed for a secret rendezvous point where the Rebel fleet was hiding."}, {"tag": "h4", "text": "Rescue of Han Solo"}, {"tag": "p", "text": "As the war continued, Leia, C-3PO, R2-D2 and Rebellion finance minister Viscount Tardi traveled to the banking world of Aargau to complete the financing of a sale of X-wing fighters to the Rebellion. However, they were unaware that Darth Vader and his entourage of paid assassins were also on the planet."}, {"tag": "p", "text": "Vader's assassins made several attempts on Tardi's life, but Leia's quick wit not only saved the Viscount, but destroyed the assassins as well. Ultimately Vader was forced to play his hand and cut Tardi down with his lightsaber, only to discover that Viscount Tardi was actually just a droid made in his image and the real Tardi had died months ago. Leia had R2-D2 record video images of the \"murder\" and transmitted them to C-3PO who was at police headquarters in order to prevent Vader from exposing their ruse to the authorities. Leia needed the fake Viscount to secure the loan, and used the Crown Jewels of Alderaan as indisputable collateral. As a precaution, Leia had to manipulate Vader into destroying the duplicate droid of Tardi."}, {"tag": "p", "text": "Unbeknownst to Organa, Darth Vader had manipulated her as he really had no interest in preventing her financial deal for the starfighters; he only wanted to take possession of the priceless Alderaanian jewels. He bribed an officer at the local customs station and acquired the treasure, having only played along with Leia's plan to ensure he could leave the planet without the jewels being missed by the authorities. Nonetheless, Leia secured the funding for the starfighters."}, {"tag": "p", "text": "In the months that followed, Leia divided her time between missions for the Alliance and the search for Han. At one point, she was forced to stop the search as Skywalker was infected with a lethal disease called \"Crimson Forever\" after boarding an Imperial vessel, finding its crew members crimson-colored and dead. Suspecting a red-glowing stone aboard the ship to be the source of whatever killed the Imperials, Luke rushed back to the Rebel headquarters, but he was already infected. In a short time, Luke was lying comatose, his eyes turned scarlet red. Leia remembered a story Han Solo had told her about the Red Nebula that featured a pair of stones similar to the one that infected Luke. Chewbacca regaled the tale, and the group came to the conclusion that the \"Crimson Forever\" stone was indeed one of those Chewbacca and Han had encountered—when the two stones were separated, they were extremely lethal. After summoning Lando Calrissian and Chewbacca to the Rebel base on Golrath, the trio set out in the Falcon and ventured to the Red Nebula. Leia and Lando boarded the vessel while Chewbacca waited in the Falcon and immediately saw victims of the \"Crimson Forever\". Convinced that it was nearby, they started looking for the second stone. Their search was cut short, however, when they were captured by a gang of bounty hunters employed by Domina Tagge."}, {"tag": "p", "text": "Tagge explained that the stones were part of her plan to kill Luke Skywalker as revenge for the death of her brother, Orman Tagge, which Darth Vader had falsely accused Luke of being responsible for. She had hired the bounty hunters to retrieve the stones once word of the deadliness of the red-glowing rocks reached her. Bombing the planet where the stones had been held, she soon had them in her grasp. Shortly afterwards, an Imperial warship loaded with Imperial stormtroopers boarded the Nebula unaware that Tagge had tinkered with the canister of their stone, making it burst open when it was placed under the pressure of hyperspace travel. Tagge managed to coax them into leaving by revealing the location of the Rebel base on Golrath. By the time they arrived near Golrath, they were all dead, and the ghost ship trap was set for Skywalker. However, priest, one of Tagge's prisoners, released the stone in Tagge's ship from its canister as well, killing many. Domina and a few bounty hunters were able to seal themselves away on the ship, avoiding certain death, but lacking space suits to shield themselves from the disease, they were trapped."}, {"tag": "p", "text": "Escaping Tagge and her crew by jumping through an airlock, Leia and Lando were picked up by the Falcon. Realizing that they needed the stone to cure Luke, Leia struck a deal with Domina—the Rebels would save her and her bounty hunters from the \"Crimson Forever\"-infested ship, and in return, she would hand over her stone so they could stop the plague. As the crystals were reunited on Golrath, Luke was cured. Domina and her accomplices flew off in an escape ship per the agreement, and the stones were loaded aboard the Imperial ghost ship, which was sent straight into Golrath's sun. The Rebel base, however, was destroyed by Leia to avoid discovery by the Empire."}, {"tag": "p", "text": "Shortly afterwards, Leia and Captain Chedaki went to investigate Imperial activity in the Shiva system, but as the two entered a shuttle to go down to the planet Shiva IV, the ship was damaged by a space mine that caused an explosion that killed Chedaki. Leia was forced to launch the damaged shuttle in order to protect the ship and the rest of the crew from harm."}, {"tag": "p", "text": "The shuttle crashed on Shiva IV, soon after Leia was immediately attacked by a savage raiding party. A group of natives led by Aron Peacebringer and Kéral Longknife repelled the raiders and rescued the princess. After her encounter with the raiding party Leia returned to the capital Illyriaqüm with Aron, and tried to warn him of the danger that the Galactic Empire posed, but the warlord was not convinced that such an empire existed. But during a gala of Calian nobility, Aron and Leia were both secretly captured by Imperial stormtroopers and brought before General Sk'ar as prisoners. However, Leia and Aron escaped."}, {"tag": "p", "text": "Some time later, Organa sought assistance from Prince Xizor of the Black Sun criminal syndicate. In order to get past Imperial security, Leia was disguised as the Ubese bounty hunter Boushh, and Chewbacca took on the identity of the Wookiee bounty hunter Snoova. From there the two became guests of Black Sun's leader, the Falleen Prince Xizor. Xizor also became enamored of Leia, and attempted to seduce her. He used his pheromones upon her and was succeeding when he was interrupted by Chewbacca, who revealed Xizor's scheme to her. Upon returning to Xizor's presence, she stalled for time and then quickly rebuffed his advances by kneeing him in the groin, leaving an enraged Xizor who locked her up. Leia was able to escape due to the efforts of Luke, Chewbacca, Lando Calrissian and Dash Rendar."}, {"tag": "p", "text": "Upon discovering that Han was being held captive in Jabba's Palace, Leia once again posed as the bounty hunter Boushh and entered into Jabba's demolition games in order to increase her credibility with the Hutt as well as to prove that she is in fact the notorious bounty hunter.[source?] It was because of this that she was able to perform the role of Chewbacca's captor in order to infiltrate Jabba's Palace. She played her role well, for the urging of more money led the Hutt to believe \"he\" was his kind of scum. However, in order to convince the ruthless Hutt, Leia coldly held an armed thermal detonator ticking down its time until it blew unless Jabba agreed to a higher bounty."}, {"tag": "p", "text": "That night she freed Solo from carbonite but Solo and Leia were caught by Jabba. Han was thrown into a cell with Chewbacca, while Jabba had other plans for her. To Leia's discomfort, he licked her face. She was then forced into replacing Oola as Jabba's favorite slave girl. Two of the dancers stripped her of her costume and put a Huttese slave-girl costume on her while the Max Rebo Band played music. Afterward, Rebo himself snuck Organa a blatberry pie as he thought she looked malnourished. She was kept beside Jabba on his large throne using a metal chain. The night after her captivity, she was offered to Boba Fett by her new master. However, Fett was not interested in the enslaved princess and went to sleep after arguing with her."}, {"tag": "p", "text": "Leia's spirits rose when Luke arrived to rescue everyone but were temporarily dashed when Jabba tried to kill Luke by putting him into the rancor pit. To her relief, Luke killed the monster; however, Leia was rewarded by being choked and hassled around by her furious master. Leia, unlike her friends was to be kept alive and remain serving Jabba. During the ride on Jabba's sail barge, she was made to drink a grotesque drink and was kept close to the crime lord. After Luke escaped once again and as Jabba's skiff guards fell into the sarlacc, Leia made her move. She crushed the light that lit up the barge and turned it into a pitch-black frenzy. As everyone was too preoccupied to help Jabba, Leia hopped over him and choked him with the very chain that held her captive, dealing with the vile gangster once and for all. R2-D2 then cut her chains and she joined Luke on the top deck of the sail barge. From there she pointed the deck gun at the barge and swung away to safety with Luke."}, {"tag": "h4", "text": "Endor and a shocking revelation"}, {"tag": "p", "text": "After leaving Tatooine, Leia joined the gathered Rebel fleet near Sullust, and accompanied General Crix Madine's commando force to the forest moon of Endor where the Death Star II's shield generator was located. Mon Mothma, alliance leader, and Admiral Ackbar explained that the superweapon was protected by a deflector shield on the forest moon of Endor, and that while a strike team including Luke, Han, and Leia sabotaged the shield, a fighter team would penetrate the main reactor."}, {"tag": "p", "text": "Soon after Leia accompanied Luke and Han to Endor, using a stolen Imperial Shuttle to bypass the Super Star Destroyer Executor. On Endor, Leia and Luke confronted stormtroopers, attempted to ride speeder bikes back to an Imperial Base. In order to make sure their arrival was kept secret, Leia jumped on a speeder bike, with Luke in tow, and chased them throughout Endor's dense forests. Leia was able to shoot down one but was also shot down herself and collapsed. After falling off of her stolen speeder bike, she was found by a curious Ewok named Wicket Wystri Warrick, a local to the sanctuary moon of Endor. Soon after a stormtrooper attacked them, but Leia and Wicket were able to subdue him. To keep her safe, Wicket took her to his village where she was considered a princess to the Ewoks."}, {"tag": "p", "text": "Worried, Han, Luke, Chewbacca, R2-D2, and C-3PO searched the forest, only to be captured by Ewoks, however, the Ewoks saw Threepio as a god. Taken to Bright Tree Village as a feast to honor Threepio, Leia reunited with her friends and tried, unsuccessfully, to convince them to let her friends go. Fortunately 3PO was able to persuade them to let Han, Luke, Chewbacca, and R2 go, with the help of Skywalker. Later on, the Ewoks accepted them as part of their tribe."}, {"tag": "p", "text": "The night before the battle, Organa received news that forever changed her life. Her long-time \"friend\", Luke Skywalker, asked Leia if she remembered her biological mother. Leia explained that her mother had died when she was very young. Though she had some memory of her, they were only \"images\" and \"feelings.\" She recalled her mother as being \"very beautiful, kind, but sad\". Luke confided that he had no memory of his mother. He then revealed to her that they were brother and sister, and that the fallen Jedi, Darth Vader, was their father. After Luke revealed to her of their relationship, Leia told Luke that she had somehow knew that Luke was her brother. When Luke told Leia that he had to confront Darth Vader, still stricken with shock, she tried to convince him to just \"run far away\" instead, but Luke had already made up his mind and left her deeply shocked."}, {"tag": "p", "text": "Leia fought alongside Han in the battle that followed, though she was injured with a blaster wound to her upper arm during the fighting. They were able to infiltrate the shield generator, but Imperial reinforcements arrived and they were captured. But with the help of Chewbacca and a tribe of ewok warriors, they managed to escape. Even with this injury, Leia was able to push down a stormtrooper with her foot and shoot two others who attempted to capture her and Han at the shield bunker. The mission to Endor was eventually a success, and the Death Star II was destroyed in the epochal Battle of Endor when Lando Calrissian and Nien Nunb, piloting the Millennium Falcon, flew into the station's core and destroyed it from the inside. Following the battle, Leia informed Han of her familial relationship with Luke, and the two shared a kiss as the explosion of the Death Star lit the skies above."}, {"tag": "h3", "text": "Founding of the New Republic (4–8 ABY)"}, {"tag": "h4", "text": "Truce at Bakura"}, {"tag": "p", "text": "Immediately after the Battle of Endor, the Rebel Alliance answered a distress call from Bakura, which was under invasion by the Ssi-ruuk. Leia and Han Solo also struggled to find some time together and hash out their newly-formed relationship. Leia discovered that Bakura chafed under Imperial rule. The remaining Imperial forces were outnumbered and outgunned by Ssi-Ruuk invaders, and the result was a truce between the Imperials and the Rebels. While meeting with sympathetic Bakuran Senate officials, Leia was arrested for sedition by Imperial governor Wilek Nereus and was imprisoned in an out-of-the-way complex. She was rescued by a typically crazy stunt by Han Solo. Returning to orbit in the Falcon, the Alliance forces helped beat back the Ssi-ruuk but were then betrayed by Nereus. As Han grimly prepared to ram the Falcon into an Imperial vessel to allow the other Rebels to escape, he ordered Leia to an escape pod, but she refused. Fortunately, Luke was able to convince the Imperial fleet commander Pter Thanas to surrender. Leia then aided the short, swift Bakuran overthrow of the government and was present at the surrender of Nereus. While on Bakura, the spirit of Anakin Skywalker appeared to Leia to beg for her forgiveness, which she would not, or could not grant at that time, since she had just learned of her parentage, and the fact that he was Darth Vader. Shortly afterwards, the Alliance of Free Planets was formed."}, {"tag": "h4", "text": "Nagai-Tof War"}, {"tag": "p", "text": "As the Empire was crippled and the Alliance of Free Planets was founded, Leia embarked on several missions to secure the new order. But before Leia and the newly formed Alliance of free planets could reverse the changes done by the Empire, she was caught up in the Nagai–Tof War."}, {"tag": "p", "text": "Traveling to several worlds with Mon Mothma, Leia became embroiled in the events surrounding the Battle of Herdessa. Almost immediately after Leia had pledged her support, she was thrust into an open conflict between Lumiya's forces and the Herdessan Rebels. Personally leading a large group of Herdessan shocktroopers, Lumiya burst into the Rebel's base. Nearly all the Rebels were incapacitated by stun beams in the firefight, but Leia and the Herdessan resistance leader Suzu were able to escape from the battle. Realizing that Leia and the Rebels were a threat Lumiya ordered the residents to track her down."}, {"tag": "p", "text": "The Herdessan Rebel Finn was soon detained and Lumiya prepared to execute him. Luckily, Suzu and Leia created a diversion that delayed the execution and allowed Leia to ambush Lumiya's guards. As Leia distracted the guards, Suzu released the rest of the prisoners and a final fight broke out between Lumiya's men and the now armed rebels. As the Rebels and the Imperial exchanged blaster fire, the remaining Herdessan citizens seized the opportunity to rise up against Lumiya and her corrupt allies. Attacking the Imperials from the rear, the Herdessan citizens quickly subdued their former oppressors and ended the battle."}, {"tag": "p", "text": "After the Battle of Endor and the formation of a new government, certain members began to talk amongst themselves about the manner in which the leadership of the Alliance was run, claiming it was too oppressive. The leaders of the discontent parties gathered on Kabray to share their concerns with one another. Admiral Gial Ackbar dispatched Princess Leia and Han Solo, along with four Zeltrons as an escort, to the gathering to listen to their concerns and show them the leadership was not aloof, not deaf to their concerns."}, {"tag": "p", "text": "The Nagai leadership targeted this gathering as an opportunity to disrupt the Alliance's diplomatic base and dispatched 13 Nagai warriors, led by Knife, to round up the non-combatants. The Nagai arrived before the Alliance reps and easily captured the party of diplomats. When Leia and Han finally arrived they walked right into a trap and were captured without a fight. While they tried to formulate a plan involving Leia pretending to faint, the Zeltron boys set their own trap. They hoisted Jahn up to the ceiling where he wedged himself in the corner above the door. When a Nagai guard entered the room, he jumped on him, knocking him to the ground. The remaining Zeltrons rushed out of the cell and attacked the remaining Nagai in a fierce brawl. Leia and Han appropriated blasters from downed Nagai and joined in on the fighting. Eventually, the Nagai were all rounded up and captured by the Alliance team."}, {"tag": "p", "text": "Things went from bad to worse when Princess Leia's transport was caught in the crossfire and forced to make an emergency landing on Trenwyth. There she found the injured Nagai soldier Tai, whom she nursed back to full health, before both parties made their separate ways, leaving the planet in the clutches of the Tof. Unaware of an oncoming Nagai assault, Leia and the others had rendezvoused on Zeltros, where they were hoping to persuade the Zeltron leaders, Arno and Leonie, to join the war effort. To celebrate the arrival of the Free Alliance heroes, the Zeltron leaders threw a grand party. However, Nagai lieutenant Den Siva and the Nagai forces gate-crashed the festivities, capturing Leia and her friend Dani. The Tof also happened upon Den Siva, and blackmailed Siva into leading his Nagai forces and their prisoners into a Tof ambush—leaving Leia and Dani in the clutches of the Tof. Fortunately, Leia and Dani's sneak attack gave the prisoners a chance to strike back at the Tof. Rallied by Lando, the prisoners were able to defeat the Tof forces, and in the aftermath of the carnage, Den Siva emerged, with an offer to join the Alliance."}, {"tag": "p", "text": "The final battle of the war came at the Battle of Saijo after the Alliance allied with the Nagai against the Tofs. It was during this battle that Leia would again encounter Lumiya, formerly Shira Brie. The war ended when the prince of the Tof, Sereno, surrendered and Lumiya being betrayed by a the Tof soldier Bey."}, {"tag": "h4", "text": "Leader of the New Republic"}, {"tag": "p", "text": "Princess Leia Organa was a founding member of the New Republic, which was formally promulgated in 5 ABY. Her first New Republic position was Minister of State, which she served as during the taking of Coruscant by the New Republic. Also, she served as Councilor during the Thrawn crisis. She went on to succeed Mon Mothma as its Chief of State, and later filled other offices, such as Minister of Defense, and various diplomatic posts. Although most of her life was devoted to such matters of state, she engaged in limited study of the Jedi arts, with her twin brother Luke Skywalker as her teacher. Notably, she wielded a blue lightsaber that she built herself, and then Luke gave her a ruby-red lightsaber to complement the weapon she had constructed earlier. Because of her duties as leader of the New Republic, Leia became more of Jedi Consular than a Jedi Guardian.[source?]"}, {"tag": "p", "text": "Right after the founding of the New Republic, the false Prophet of the Dark Side known as Kadann foretold that the chosen heir to the Galactic Empire would present himself bearing the glove of Darth Vader. An Imperial Grand Moff, Bertroff Hissa, heard the prophecy and used it to proclaim Palpatine's son, Trioculus, as the new Galactic Emperor. Now Emperor, Trioculus asked for Leia's hand in marriage. Leia accompanied her brother on his mission to locate the Glove of Darth Vader, a rare gauntlet once owned by her father."}, {"tag": "p", "text": "Sometime after 5 ABY, Zorba the Hutt was set free from his prison holding cell, after his prison on Kip was infiltrated. He found out about his son Jabba's death and vowed revenge on Leia, Han, Luke and the others responsible. He had one of his hunters, Cobak, kidnap Princess Leia, who was vacationing at the Fun World. Zorba, finally face-to-face with Leia, introduced himself as Jabba the Hutt's father, and vowed to take her to the Great Pit of Carkoon, where he would feed her to the Sarlacc. En route to Tatooine, the Zorba's Express was captured by the Imperial Moffship, and both Leia and Zorba were captured. They dropped Zorba into the Pit, but he was spit out, and Leia got a low priority bounty on her head in the years to come."}, {"tag": "p", "text": "Soon after, Leia was kidnapped by Kadann, who planned to turn her to the dark side and make her Queen of the Empire. Fortunately Leia was rescued and with her help, Luke and the others were able to find Palpatine's real son, Triclops, and subdue Trioculus and Grand Moff Hissa."}, {"tag": "p", "text": "As the New Republic grew in size and legitimacy, Organa sat on its Provisional Council as a representative from Alderaan. Her brother designed a regimen of Jedi training exercises for her, although she rarely found the time or the peace of mind to do them. While the military prepared itself for a conquest of Coruscant, Organa made attempts through numerous channels to contact the Imperial Warlord Zsinj, including the Imperial HoloNet and several levels within Zsinj's own organization. Wanting to gauge how strong the New Republic was, Zsinj rebuffed her every time. With no permanent headquarters, the Provisional council convened on Noquivzor at the request of Senator Borsk Fey'lya, holding a meeting that Wedge Antilles was permitted to attend. Organa sought out Antilles after the meeting, and caught up with her old friend before being called away by Mon Mothma."}, {"tag": "p", "text": "Coruscant was soon after taken by the New Republic, and became the permanent headquarters for the previously mobile Provisional Council. As Councilor Sian Tevv had been exposed to the Krytos virus, the council's meetings were punctuated by a light bacta mist circulating through the air. At one such meeting, Antilles appeared before the council, and pleaded with them to drop murder charges leveled against Tycho Celchu following the death of Rogue Squadron pilot Corran Horn. Remaining silent while he pled his case, Organa proposed a recess, and remained in the chamber with Antilles during the break, informing him that the spread of the Krytos Virus had nearly bankrupted a fragile New Republic, and that Celchu's trial had to proceed in order to keep public opinion of the government from collapsing. With the New Republic close to falling apart, Organa secretly headed to the Hapes Cluster in order to ask their ruling Consortium for aid."}, {"tag": "h4", "text": "Disastrous courtship"}, {"tag": "p", "text": "Leia, now busy with Minister of State duties while Han was away for a few months fighting Warlord Zsinj, caused a significant rift between the two. During this time, Leia had been conducting negotiations with the Hapes Consortium and was visited by the Hapes delegation at the time of Han's return. They presented Leia with a total of 63 different gifts—one from each Hapan world—including a Hapan Gun of Command, rainbow gems from Gallinore, a plant which promoted longevity and intelligence, several Star Destroyers, and last, the hand of the Hapes cluster ruler Ta'a Chume's son, Prince Isolder, in matrimony—which Leia seriously considered, as Isolder was handsome, well-mannered, and, most importantly, would provide both the New Republic and the Alderaanian exiles a great deal of benefit."}, {"tag": "p", "text": "Jealous, Han kidnapped Leia and took her to Dathomir, a planet he had won in a high-stakes sabacc game. During the flight, Leia was hostile and icy towards Han for abandoning his responsibilities. To make amends, Han promised to return and accept whatever punishment was deserved if she would spend a week with him and did not love him by the end. However, they found out that the planet was owned by Zsinj and were shot down onto Dathomir, which was interdicted. They encountered the Singing Mountain Clan of Dathomiri witches and set to work repairing the Millennium Falcon. They met up with Luke and Isolder, who had come to rescue them but were also trapped on the planet, and sparks flew between Han and Isolder again. However, the Nightsisters had a plan to capture the Falcon and get off the planet, so Leia had to put all her effort into getting off the planet rather than over which man she should marry. Soon afterwards a battle broke out, which resulted in the end of Zsinj and his army and the marriage between Han Solo and Leia Organa."}, {"tag": "p", "text": "After the near-disastrous courtship, Leia married Han Solo in 8 ABY. Mon Mothma officiated the wedding. To start their honeymoon, Han Solo took Leia to see the Corphelion Comets and even managed, albeit in a typical unorthodox manner, to get the romantic view all to themselves. At first, she did not want to have children, as she feared they would turn out like her father, however she would soon discover the truth. Right after the wedding Leia and Han went on an important mission to Tatooine to retrieve Killik Twilight and the Shadowcast key hidden within it. It was there that Leia came across her father's childhood friend Kitster Banai in the Valley of the Spirits. With Banai's help, Leia discovered her grandmother Shmi's diary and the location of the moss painting. After speaking to Banai and another of her father's childhood friends, Wald, and reading her grandmother's diary, Leia discovered her father had not been born or raised as the evil monster she had known, and decided that there was nothing inherently evil in the Skywalker bloodline. Soon afterwards, she became pregnant with twins."}, {"tag": "h3", "text": "Return of the Empire (9–19 ABY)"}, {"tag": "h4", "text": "Thrawn campaign"}, {"tag": "p", "text": "A year later during the Thrawn Crisis, Grand Admiral Thrawn ordered Noghri commandos to kidnap the pregnant Leia in exchange for Joruus C'baoth's help, who attempted several times to capture her. C'baoth had planned to turn Leia and her brother Luke to the dark side and make them his apprentices. To avoid capture she hid on the planet Kashyyyk, but her would-be kidnappers tracked her and unsuccessfully tried to abduct her. She later learned that Darth Vader once landed on the Noghri home planet Honoghr and tricked the Noghri into serving the Empire by promising to help their planet recover from the ecological disaster that it suffered during the Clone Wars. Because of this, they were fiercely loyal to Vader and later to Thrawn, his successor. The Noghri discovered Leia was the biological daughter of Darth Vader by her bloodline scent, and went to Honoghr and convince the Noghri of the Empire's deception. They left the service of the Empire and became allies of New Republic. Leia was addressed as \"The Lady Vader\" among the Noghri and both she and her family became revered figures in their society, to the point where Leia, known to the Noghri as the Mal'ary'ush, or \"Daughter of the Savior\", was granted a permanent bodyguard of lethal Noghri warriors."}, {"tag": "p", "text": "Also, during the Thrawn crisis, Leia gave birth to the twins Jaina, named after Han's mother, and Jacen on Coruscant. Despite her pregnancy and later her newborn children, Leia continued to play a pivotal role in the fledgling New Republic as Thrawn's depredations threatened the security of the galaxy. Leia helped get Garm Bel Iblis the command of Coruscant's defense forces after Thrawn laid siege to the planet and also helped root out the mysterious Delta Source that had given the Imperials so much vital intelligence. Finally, Leia helped procure the aid of Talon Karrde to the New Republic, authorizing payments to the smuggler to get his help and information. Karrde would later ask Han Solo, after Solo said it took Leia to bring him to the Alliance, if she had any sisters. During the later part of the Rebel Alliance and the early part of the New Republic, Princess Leia was highly popular among both the rank-and-file Alliance fighters and the leaders. After the twins were born, prior to the deaths of Thrawn and C'baoth, Imperial Intelligence agents staged one last unsuccessful attempt to apprehend Leia and the twins.[source?]"}, {"tag": "h4", "text": "Return of Palpatine"}, {"tag": "p", "text": "In 10 ABY, she discovered to her horror that Palpatine was alive and that her brother had turned to the dark side. After learning of Palpatine's return, Leia went to Nar Shaddaa where she encountered the old Jedi, Vima-Da-Boda, who told her the tale of her fall and bequeathed to Leia a box containing a 10,000 year old lightsaber discovered on Ossus around 850 BBY."}, {"tag": "p", "text": "Traveling to Byss to rescue Luke with Han, Chewbacca and C-3PO, she got the four of them captured. Palpatine was quick to try taking advantage of this and attempted to turn her. Showing her the ancient Jedi Holocron of Bodo Baas to tempt her, and stirring her anger by revealing that he intended to make her unborn child his next receptacle, his attempt backfired and Leia flipped over his bed and fled, stealing the Holocron. She then encountered Luke."}, {"tag": "p", "text": "Luke revealed that he had faked his turn and had been working to sabotage Palpatine's plans from the inside. Aiding in the escape of her, Han, Chewie and C-3PO, he sent R2-D2 back with them, having downloaded the master control codes for the World Devastators ravaging Mon Calamari into him. He then said that he would remain on Byss to attempt to assassinate the Emperor. After they fled, Luke went through with the attempt and failed."}, {"tag": "p", "text": "After the battle of Mon Calamari, Palpatine and a broken Luke arrived in his flagship, the Eclipse at Pinnacle Base, where the New Republic was celebrating. While Leia was studying the Holocron in her quarters, the simulacrum of Bodo Baas told her a prophecy written by his Master, which foretold the upcoming events. Palpatine demanded the presence of Leia and the return of the Holocron. Leia met with the Sith aboard the Eclipse. Luke then implored for Leia's help in shaking off the Dark Side. Leia aided him and Luke managed to return to the light. Palpatine was enraged and engaged Luke in a brutal lightsaber duel. As Leia observed their duel, she gave energy to Luke through the use of battle meditation and together they were able to subdue Palpatine. When Palpatine summoned a Force storm against the New Republic fleet in retaliation, Luke and Leia summoned a wave of light side energy and enveloped Palpatine in it, cutting off his control of the storm. While the storm destroyed Eclipse and Palpatine, they fled."}, {"tag": "p", "text": "After the death of Palpatine's clone on Byss, Leia returned to Nar Shaddaa to remove Vima and extract from her knowledge of the holocrons and the destroyed Jedi Order."}, {"tag": "p", "text": "After fleeing to Nespis VIII, Leia's second son was born and named Anakin after his grandfather Anakin Skywalker. Leia, who had been hesitant to tap into her Force potential, learned the valuable techniques from Vima, including how to shield the newborn Anakin. This skill allowed Leia to save him from being possessed by the spirit of Palpatine. With the reborn Palpatine's clone body rapidly deteriorating, she was forced to flee to Onderon to hide Anakin Solo from him. The Emperor did eventually find her, but he was shot in the back, and a sacrifice from Empatojayos Brand saved them from Palpatine's spirit."}, {"tag": "p", "text": "Leia loved all three of her children dearly, but because of her position as Chief of State, she had barely enough time to devote to her family. As a result of kidnapping attempts, Leia sent the children to various safe worlds where they were put in the care of her most trusted friend, Winter. Though they were safe, the children, especially Jaina, missed her dearly. However, when they returned to their parents, the children viewed Leia as a stranger and wanted to believe that Winter was their mother. Jaina would begin to notice her distance from her family, leading to a big rift between them years later.[source?]"}, {"tag": "p", "text": "Although her sibling relationship to Luke Skywalker—and their relationship to Darth Vader—became public knowledge, she remained known as the heir to Bail Organa, and thus a member of the Royal House of Alderaan. She played an important role for those Alderaanians who still lived, having been offworld at the time of the planet's destruction. She founded New Alderaan, over which the Royal House of Alderaan, in the person of Leia Organa Solo and her children, continued to hold sovereignty. The government on New Alderaan also administered their former Alderaan system.[source?]"}, {"tag": "h4", "text": "Jedi search"}, {"tag": "p", "text": "In 11 ABY, when her brother Luke was disabled by Kyp Durron and the spirit of an ancient Sith Lord named Exar Kun, Leia and the family went to visit the Jedi Praxeum on Yavin 4 and were baffled by his condition. During the dinner that followed, Leia, along with the twins and the students felt a great disturbance in the Force when the planet of Carida was destroyed by Kyp Durron. Leia helped the Jedi students make plans to deal with Exar Kun to save Luke."}, {"tag": "p", "text": "Also during this time, Terpfen was being used by the Empire to locate Leia's youngest son on Anoth. During which she also had the twins with her and had to chose between the twins and Anakin. Cilghal, said she would help take care of the twins and so Leia and Terpfen set off to see Admiral Ackbar, since he was, along with Luke, the only person who knew where Anoth was."}, {"tag": "p", "text": "After having the Admiral with them, they set out to Anoth to find Imperials searching for Anakin. Leia sought to the Force and found out that her son was still on the planet along with her best friend Winter, who had been exiled there. After she landed, Leia confronted the Admiral who was taking her child. She was very menacing toward him, although he had started to strangle her son. When the Admiral tripped, Terpfen grabbed the baby and handed him to Leia. Leia was so relieved, she could do nothing else but cry and rock her son."}, {"tag": "p", "text": "Mon Mothma's health began to decline that year. No one could discover the source of her illness until Terpfen, Admiral Ackbar's chief mechanic, told her that the Caridan Ambassador Furgan had poisoned her. With that knowledge, the Jedi healer Cilghal healed her by removing the poison drop by drop. Leia replaced Mon Mothma as Chief of State at this time."}, {"tag": "p", "text": "The next year as Luke began the process of restoring the Jedi Order, Leia, Han, and Chewbacca set out on a mission of their own, vital to the survival of the fragile New Republic. They begin searching for the long-lost children of the Jedi. The quest took them to the Jedi planet of Belsavis, a nearly forgotten frozen world. Having heard tales of a Jedi exodus from the dark crypts below the planet's surface and also hearing that since the time of the exodus no one entering the crypts has returned alive, Leia went to Belsavis to start her search."}, {"tag": "h4", "text": "Planet of twilight"}, {"tag": "p", "text": "During the Death Seed plague crisis in 13 ABY Leia was kidnapped by Seti Ashgad and was taken to Nam Chorios, the home of Tsils and the strange alien lifeform, droch. She was held captive by Beldorion, a Hutt Dark Jedi. Beldorion told her stories of the ancient Jedi Masters such as Thon and Yoda, whose power he admired, if not their principles. Despite the fact that his Force abilities were greatly boosted by the planet, Beldorion was killed by Leia in a lightsaber duel. Leia managed to escape and was reunited with Han, Chewbacca, Luke Skywalker, and Lando Calrissian."}, {"tag": "p", "text": "Ashgad and Moff Tol Getelles had planned to devastate the Meridian sector through the use of the Death Seed. However, their efforts were foiled by Leia and Luke. Soon afterwards Leia participated in the Battle of Nam Chorios. The battle ended when Luke managed to convince the Chorian crystal mind of the threat that Ashgad posed to the galaxy if his plans succeeded. As a result, Ashgad was killed, though Getelles still survived."}, {"tag": "h4", "text": "Waru"}, {"tag": "p", "text": "During the Empire Reborn movement of 14 ABY, while on a diplomatic mission to the planet Munto Codru, Jaina, Jacen and Anakin were kidnapped by Lord Hethrir, the Imperial Procurator of Justice, in a fiendish plot to take advantage of their Force powers and sacrifice young Anakin to the creature Waru. To get them back, Leia disguised herself as a pirate, assuming her childhood nickname \"Lelila\" as her alias. Along with Chewbacca and Artoo, she followed the kidnappers' trail to a disabled refugee ship, from which children were also missing. It was here that she learned of Hethrir's twisted plan to restore the Empire."}, {"tag": "p", "text": "As she followed the path of her children across space, Luke and Han arrived on Crseih Station in order to discover the secret of Waru's sinister cult. While in the process of rescuing her children, Leia freed Hethrir's mate Rillao, whose son Tigris was with Hethrir. She arrived on Hethrir's worldcraft on her yacht Alderaan, rescued the twins and then loaded all the other children aboard the ship before leaving for Crseih Station to rescue Anakin. In the end, Waru destroyed Hethrir before vanishing from the known galaxy following a confrontation with Leia, Han and Luke."}, {"tag": "p", "text": "Also in 14 ABY, Chewbacca was seen in Mos Eisley in a diplomatic mission for Leia. She, however, was not present in Tatooine at the time, and it is not known if Chewbacca retrieved any useful information during the mission."}, {"tag": "h4", "text": "Black Fleet Crisis"}, {"tag": "p", "text": "Chief of State Organa Solo guided the New Republic through a number of dangerous external crises from post-Imperial warlords. As the threat of Imperial warlords shrank and the New Republic's growth accelerated rapidly, she also faced a number of internal political conflicts in the Third Electoral."}, {"tag": "p", "text": "During the Black Fleet Crisis in 16 ABY, Leia faced a ruthless leader of the Duskhan League, an arrogant Yevetha who seemed bent on a genocidal war that could shatter the fragile unity of the New Republic. To end this threat Leia called upon the Senate to take a stand and eliminate the Yevetha threat, even at the cost of Han's life."}, {"tag": "p", "text": "Using the New Republic's lack of intelligence on the Dushkan League and Senatorial political infighting to his advantage, Nil Spaar extended his negotiations with Chief of State Solo over a period of weeks. Pressured by military and intelligence advisors who sought answers, and potentially an ally against the Core Imperial strongholds, Organa Solo entered the discussions, only to find herself on the receiving end of a political plot to throw the New Republic into confusion. These two forces came to a head, Leia had no choice but to invoke the Article Five of the Common Charter to forestall a recall vote against her office and declare war against the Yevetha. Cracks in Leia's widespread popularity began to show during this period, cracks that would accelerate with the political ascendance of Borsk Fey'lya."}, {"tag": "h4", "text": "Almanian Uprising"}, {"tag": "p", "text": "However, these \"cracks\" would soon resurface in the Almanian Uprising. Leia Organa Solo, Chief of State of the New Republic and President of the Senate, had been under intense pressure from the Black Fleet Crisis political situation. As a result, there were many attempts on her life. Leia, however, was determined to put it behind her. Her new term of the Senate added several new ex-Imperial Senators and ex-Imperial worlds, such as the Senator for Exodeen. Despite reassurance from Mon Mothma, she was unsure of the situation. As Leia took the podium and started into an inspired speech, powerful bombs rocked the Imperial Palace Senate chamber. Leia was knocked off her feet, over a hundred Senators were dead or wounded and Leia herself had lost her hearing."}, {"tag": "p", "text": "More disturbingly to Leia, as she recovered she sensed Luke, in trouble and injured. She had planned to find him incognito, but Mon Mothma sent along a fleet under the command of Wedge Antilles to help her. She found Luke on Almania, where they along with Han, confronted the fallen Jedi student Kueller. Leia accidentally left her brother behind after she rushed ahead not realizing that Luke was still weak. In those moments when they were apart, Kueller found Luke and forced a lightsaber duel. Leia came back to find both locked in combat. Terribly weakened, Luke abruptly decided to give up. As Kueller raised his lightsaber to strike Luke down, he lost his connection to the Force. Kueller tried to use his anger to tap into the Force, but doing so was useless, since a thernbee that had swallowed an ysalamir nutrient frame had wandered into the general vicinity. He had one last trick up his sleeve, though: he used a remote to send the signal to self-destruct his remaining droids. However, Kueller's last gasp of malice was thwarted thanks to the efforts of R2-D2, C-3PO, and young mechanic Cole Fardreamer. As Kueller had attempted to activate his remaining bombs, Leia shot him. She removed the death mask from his lifeless body, revealing Dolph's boyish face."}, {"tag": "h4", "text": "First Corellian Insurrection"}, {"tag": "p", "text": "In 18 ABY Leia and her family took a vacation to Han Solo's home planet of Corellia. While the dust of the defeated Empire settled, Chief of State Leia Organa Solo announced a major trade conference on Corellia, the President of the Senate determined to bring Corellia back to its previous state. Once there they learned of the Human League, headed by Han's cousin Thrackan Sal-Solo and the Sacorrian Triad. The Human League and the Sacorrian Triad joined forces causing the First Corellian Insurrection."}, {"tag": "p", "text": "Thrackan managed to imprison Leia and Han while he kidnapped their children. During her imprisonment, Leia met with Mara Jade and the two plotted their escape from the Corona House. With the help of Jade's ship, Jade's Fire and their own ingenious plan, the two successfully decided to retreat to Selonia, hoping the children were safe with Chewbacca."}, {"tag": "p", "text": "On Selonia, Leia, Mara and Han attempted to convince the Selonians to change their mind—and they too were imprisoned for a short time. Sinisterly, Thrackan dropped the jamming field long enough to show Leia a hologram of him with her children in custody—to the immense outrage of the Selonians. The Overden immediately released the three just as Luke arrived and began planning a course of action. Meanwhile, Leia's youngest son Anakin managed to stop the destruction the Centerpoint Station was causing."}, {"tag": "p", "text": "Despite Leia's brave actions throughout the crisis, the Senate entered a new phase of criticism for her letting the insurrection get as far as it did, many seeking to oust her from her position.[source?]"}, {"tag": "h4", "text": "Caamas Document Crisis"}, {"tag": "p", "text": "During this time she became involved in the Caamas Document crisis in 19 ABY, in which Thrawn presumably came back from the dead. While on Wayland during a leave of absence from the position of Chief of State, Leia became entangled with a Devaronian who had found a datacard and wanted to keep it under the Debble Agreement. He claimed to be working for Talon Karrde, but did not recognize the smuggler chief. After offering to sell it to her for a ridiculous price, he threw a smoke grenade and tried to escape, but was caught and forced to land by the Wild Karrde. That datacard turned out to reveal that Bothans had been involved in the attack on Caamas. She served as a Councilor on the New Republic High Council during the leave of absence. Ponc Gavrisom served as New Republic Chief of State during her leave."}, {"tag": "p", "text": "Leia was also irritated to learn that Han had taken her place in negotiations between the Ishori and Diamala, which he characteristically handled with his usual subtlety and diplomatic skill—next to none. Leia also visited Bothawui with Han to investigate the Bothan Clans to try and find the names of the Bothans involved as well as the financial well-being of the clans. During their stay, Han was blamed for a riot instigated by Imperial Intelligence and the Solos left the planet."}, {"tag": "p", "text": "While still on her leave of absence to spend more time on her Jedi training, Han arranged a vacation to the sleepy Pakrik system. When traveling near the backwater world of Pakrik Minor, the Millennium Falcon was attacked by assassins. However, they were rescued by a sleeper of cell of clones, including Carib Devist, that Thrawn held left on Pakrik Minor. In exchange for their silence, they helped fix the Falcon and allowed Han and Leia to leave. Shortly afterwards, a shuttle containing Elegos A'Kla and Ghent arrived with news that Admiral Pellaeon wanted to discuss a peace treaty. Leia immediately left with the Caamasi and Ghent, along with her Noghri bodyguard. Leia had successfully managed to discuss the treaty preliminarily with Pellaeon, but returned to find fleets of warships facing off over Bothawui."}, {"tag": "p", "text": "Leia was on board one of the Ishori ships in place around Bothawui as part of the hostile standoff over the planet when Imperial saboteurs successfully lowered the shield around Drev'starn and used a captured weapons cluster on one of the ships to bombard the planet. Then the Imperials lured each of the fleets into attacking the other. As full-scale battle threatened, Leia sensed danger and worry from Han in the Falcon, who had been trapped by an Imperial Star Destroyer that was cloaked. She started moving the Ishori ship towards the threat, which absolutely incensed the Ishori captain. However, just as Leia was about to charged with mutiny under Ishori war-law, President Gavrisom stepped in and nationalized the warship using an obscure New Republic law. The Imperial ships, expecting to surprise the Rebels after the fleets had already battered each other, were surprised to find a united fleet attacking them led by Lando Calrissian, who Leia had selected."}, {"tag": "p", "text": "After receiving the Caamas Document, Leia began talks with Admiral Pellaeon that led to Pellaeon–Gavrisom Treaty and an end to the Galactic Civil War. Once the Caamas Document crisis was dealt with, Leia, along with Mirax Terrik Horn and Iella Wessiri Antilles, took some time off to help Mara Jade prepare for her wedding to Luke. Leia along with her family attended Luke's wedding on Coruscant, where she helped stop an assassination attempt."}, {"tag": "p", "text": "In 21 ABY Leia Organa Solo was elected back into office of Chief of State of the New Republic."}, {"tag": "p", "text": "All three of her children were trained as Jedi at Luke Skywalker's Jedi Praxeum from 22 ABY, and would defend the galaxy from the Yuuzhan Vong War as part of the New Jedi Order. In 24 ABY Leia and her children, Jaina and Jacen, were able to stop the Diversity Alliance, an anti-Human organization, from wreaking havoc. Unfortunately, Leia's role as Chief of State came to an end when Borsk Fey'lya succeeded her as the leader of the New Republic.[source?]"}, {"tag": "h3", "text": "The Yuuzhan Vong War (25–29 ABY)"}, {"tag": "h4", "text": "A new threat"}, {"tag": "p", "text": "After serving a second term, Leia resigned as Chief of State, and was succeeded by Borsk Fey'lya. After the death of Chewbacca on Sernpidal in 25 ABY, Leia went before the Senate to bring attention to the fact that the approaching Yuuzhan Vong were a threat to the galaxy. Her pleas went unheeded, and the invasion continued full force. Leia contributed to the war effort by aiding in the evacuations of Dubrillion and Dantooine, finally getting help from the Advisory Council via Admiral Traest Kre'fey's threat to place her into power via launching a military coup d'état. Soon after she joined SELCORE, a movement that aided refugees."}, {"tag": "p", "text": "Leia and her husband suffered a brief period of estrangement some months after the death of Chewbacca; her husband was still struggling with his grief and rage over the death of his longtime friend. After the death of Chewbacca, Han blamed Anakin for Chewbacca's death and returned to the loner he once was, leaving the family to go on adventures with his friend Droma. Leia buried herself in her work with SELCORE, hoping that her husband would one day come back and mend the severed ties with their family."}, {"tag": "p", "text": "A year later, during the Battle of Duro, Leia was captured by Warmaster Tsavong Lah, who tortured her to the brink of paralysis. Lah intended to sacrifice Leia to Yun-Yammka, the God of War and the patron deity of the Warrior caste. Fortunately, Jacen managed to locate his mother and managed to knock Lah out a window, tearing the Warmaster's left foot loose. Shortly afterwards Han returned and rescued her."}, {"tag": "p", "text": "After Duro was taken by the Yuuzhan Vong, Leia and Han fled to Corellia for Leia to recover. However, they were chased away by Han's cousin Thrackan Sal-Solo, now the Governor-General of the Corellian sector. They then decided to take a short break to try and close the rift in their marriage that was formed by Han's grief over Chewbacca. While on vacation, Leia and Han ran into a previously unknown group of Jedi called the Wild Knights which was lead by Saba Sebatyne, and helped bring them to Luke's attention, and into the limelight of the war."}, {"tag": "h4", "text": "Death of a son and aftermath"}, {"tag": "p", "text": "The Solo family enjoyed small blessings early during the war, beginning with the reconciliation of Han and Anakin, who Han originally had blamed in no small part for Chewbacca's death. Shortly afterwards, Leia's nephew Ben Skywalker was born, whom she adored and called \"Skycrawler.\" Other great changes in Leia's life were also taking shape: after having become more and more fed up with the New Republic politics and especially the anti-Jedi sentiment prevailing in the Senate, she eventually made a decision to step out of political life entirely, feeling it was the direction the Force was guiding her to. Even though she had to compromise this decision in some occasions, she largely managed to lead a more low-profile life in the years to come."}, {"tag": "p", "text": "Perhaps the greatest tragedy the Solos would face during the war came shortly afterwards, when on the doomed Mission to Myrkr, Anakin died while leading a Jedi team tasked with the destruction of the Jedi-hunting Yuuzhan Vong creations, the voxyn. To make things worse, her eldest son Jacen was presumed lost as well after the other Jedi of the strike team felt his supposed death through the Force. Leia, however, was convinced that he was still alive, even though everybody else including Han did not really believe her. For a short period of time, Tahiri Veila was put in the care of the Solos after she suffered terrible dreams as a result of her shaping and Anakin's death."}, {"tag": "p", "text": "Almost concurrently with Anakin's death, the Yuuzhan Vong launched a massive attack that overwhelmed Coruscant. Still struggling with the overwhelming grief of her son's death, Leia—at the urging of Fey'lya—managed to make an impassioned plea to all New Republic forces to fight and resist at all costs. Meanwhile, Leia and Han gained temporary custody of their nephew as his parents were busy fighting the war. She enjoyed Ben's company but in some ways, she was reminded of her the son she had just lost. During the Fall of Coruscant, Leia was forced to turn Ben over to C-3PO as Viqi Shesh was planning to kidnap the infant. Fortunately, Lando was able to save both Threepio and baby Ben from harm's way. After Coruscant's fall, Han and Leia went to Hapes for Anakin's funeral."}, {"tag": "h4", "text": "Aiding the war effort"}, {"tag": "p", "text": "After the funeral, the Solos journeyed to Borleias, meeting up with Wedge, Luke, and Mara, engaged in a defense of the planet. Leia and Han joined the Insiders, and helped deliver the Myrkr strike team survivors to the Maw. Leia, convinced that Jacen was alive, nevertheless talked Han out of going to Coruscant to look for him, saying she needed him helping her with the Insiders. Returning to Borleias, Leia and Han were then sent on missions to sabotage Yuuzhan Vong activities. On one planet, Leia was forced to abandon a political associate in favor of a more pro-war candidate, and on Aphran IV she and Han were captured by local Peace Brigade-allied forces. Artoo and Threepio sprung them out of prison, and they continued on their way."}, {"tag": "p", "text": "Though they were facing one of the most devastating wars in the galaxy, Leia and Han once again found hope when Jacen was indeed proven to be alive and returned from the Yuuzhan Vong captivity along with his mentor Vergere. Following the reunion with their older son, Leia and Han went on several missions to restore HoloNet communications in the Unknown Regions, and foiled a second attempt of the Ssi-ruuk to invade Bakura in the process."}, {"tag": "p", "text": "When Zonama Sekot made its existence known near Coruscant in 29 ABY, Han and Leia traveled there to be reunited with the rest of their family. There they met Harrar, a Yuuzhan Vong priest. Solo also played a major role during the Battle of Yuuzhan'tar. Leia and Han, along with Harrar, Threepio and Artoo, crashed the Millennium Falcon into the well of the World Brain. After the destruction of Shimrra and Onimi, Leia and the others traveled with Nom Anor across the labyrinth the mighty war vessel of the Master Shaper. However, the executor turned on them, shooting his venom at Han. Jacen managed to save him just in time. Before he could kill them off, Leia engaged Nom Anor, slicing off his hand in the process. They managed to escape and arrived at conclave on Zonama Sekot, which marked the end of the Yuuzhan Vong War."}, {"tag": "p", "text": "Though the war caused much pain for the Solos and Skywalkers, their relationship became stronger. It was during this time that Leia and Jaina were able to repair their tenuous relationship. She had forsaken politics to become Han's copilot, a position she would hold for five years."}, {"tag": "h3", "text": "The Dark Nest Crisis (35–36 ABY)"}, {"tag": "h4", "text": "A cry for help"}, {"tag": "p", "text": "In 35 ABY, Han and Leia followed several Jedi including Luke and Mara into the Unknown Regions and discovered that Raynar Thul was alive, and had been taken in by a nest of Killiks. During the mission to Myrkr, Thul had been incapacitated by the Nightsister Lomi Plo and the Dark Jedi Welk. They took him and escaped on the Tachyon Flier, which was under fire during Myrkr outbound, where all three were presumed lost. In truth, the Tachyon Flier had crashed onto the planet Yoggoy, a Killik nest, and made all three Force-users into Joiners. Raynar Thul was integrated into the Yoggoy nest while Lomi Plo and Welk were integrated into the Gorog nest. All became leaders of their respective nests, Raynar even created a new lead nest named Unu and became the Prime Unu, now reborn as UnuThul. The Killik nests took on the persona of the people they integrated, or Joined into their nests. The Yoggoy nests, and each other nest, except for Gorog, gained Raynar's sense of compassion and value for life, whereas the Gorog nest retreated into secrecy, due to the want of Lomi Plo and Welk to hide. The Gorog became the Dark Nest, and secretly controlled the other nests, without their even knowing."}, {"tag": "p", "text": "UnuThul greeted the Solos in Yoggoy hangar with a masterful display of his current Force power. In the Prime Chamber, UnuThul used \"we\" to address himself, stating Raynar Thul no longer existed and \"they\" were now UnuThul. Luke insisted that he sensed Raynar's presence in UnuThul, and guessed Raynar might be in hiding. Raynar then guided the Jedi to read the Chronicle on the wall, explaining the transformation of Raynar Thul to UnuThul, and the rise of the Unu nest. UnuThul explained the Unu nest as \"the nest of the nests.\""}, {"tag": "p", "text": "In the following interview Luke sensed the Raynar presence rose repeatedly to the surface but was swallowed by the presence of the hive mind. UnuThul claimed that the Crash was remembered, but not the Dark Jedi, and concluded that they must be dead. When Luke tried to probe UnuThul again, the hive mind was able to powerfully push Luke out. When Mara demanded the location of the missing Jedi, UnuThul suddenly Force probed Luke with such a power that required the combined strength of Luke, Mara, Saba and Leia to stop him."}, {"tag": "p", "text": "Still refusing to surrender the location of Qoribu, UnuThul stated that anyone could leave whenever they wanted, and decided to assign a Yoggoy guide to escort the Jedi back to Lizil. The Jedi soon realized that such a collective mind allowed UnuThul to spy on them almost anytime and anywhere on Yoggoy. They visited the crash site, and Leia received Jacen's flow-walking message about Qoribu which was in the Gyuel system. Insects dark blue in color then attempted to assassinate the Jedi Masters at the crash site, which the Jedi barely escaped with Nanna killing several of the blue insects in the process. However, the Yoggoy guide that accompanied the Jedi denied ever seeing any blue insects before its death. When they traveled back to the hangar, Han and UnuThul exchanged harsh words on the matter of attempted assassination. As the debate became a stalemate, Luke proposed that it was another party who attempted to assassinate the Jedi, but UnuThul insisted that even if someone else attacked the Jedi, the hive mind would also be aware. To avoid a war with the Chiss, Leia suggested to UnuThul that the Killik nest be moved to a new planet, but made him think it was his idea."}, {"tag": "p", "text": "Afterwards, Leia decided to formally join the New Jedi Order. Luke and the other Masters initially thought that she meant she was ready to take her place, as in their minds her long history of service to the Force was enough to grant her such a status without question. Instead, Leia insisted that she wanted to earn her place in the order rather than simply be accepted in as the daughter of Anakin and sister of Luke, asking Saba Sebatyne to train her. The Barabel found the idea highly amusing for several seconds, until she realized Leia was completely serious. The former senator, resistance fighter, and head of a galactic government now wanted Saba to challenge her in \"new and unexpected ways.\""}, {"tag": "p", "text": "Although skeptical at first, Saba took Leia as her apprentice and treated her more or less as any other Jedi she would train. Which was, in fact, more uncomfortable for the Masters of the Jedi Order than Leia, since more than a few had spent their adult lives taking orders from her and were very close friends. More than once, Saba was forced to remind Leia not to be so familiar with the Masters to the simultaneous amusement and embarrassment of all concerned. However, the results were astonishing as the second child of Anakin Skywalker finally started to reach her true potential in the Force."}, {"tag": "h4", "text": "Swarm War"}, {"tag": "p", "text": "Just prior to the Swarm War, Luke and Han had been taken prisoner by the Killiks in order to gain help for stopping the Fizz. Upon returning from Ossus with Master Saba, as well as Mara Jade Skywalker and a team of Jedi in StealthX's, Leia was captured by Admiral Nek Bwua'tu, commander of the 5th Fleet, stationed in the Utegetu Nebula to prevent the Killiks from leaving their homeworlds. While arguing with the Admiral aboard the Admiral Ackbar, the Killiks attacked the ship. Led by Alema Rar, the Killiks managed to take over the ship, with Leia fighting Rar to a standstill before escaping, just as Han and Luke returned from Utegetu."}, {"tag": "p", "text": "Around this same time, R2-D2 had a malfunction where he had shown Luke a holoclip of the mother he had never known. Before Luke could get more out info out of Artoo, Artoo had a meltdown, claiming he was protecting Luke. Frustrated, Luke contacted master slicer Zakarisz Ghent, who managed to recover one other holo featuring Padmé and Anakin Skywalker, which was displayed to both Luke and Leia."}, {"tag": "p", "text": "Leia did not approve when Luke took complete control of the Jedi Order. During the Jedi convocation at Ossus, she and Han discovered that Tenel Ka had recently given birth to a daughter Allana, whom she did not know was her granddaughter through her son Jacen, though she did suspect Jacen knew who the father was. She later went off with Han forsaking the Order to search for their daughter Jaina in the Unknown Regions. They were detained many times, but eventually got to their destination."}, {"tag": "p", "text": "On Tenupe, during the Swarm War, Leia dueled for the third time with Dark Jedi Alema Rar. Saba observed this duel, and was very approving when Leia finally defeated Alema. In truth, the Dark Jedi was dragged off by a huge creature, one that Leia soon knocked off a cliff. The Chiss were less than happy with this explanation and lack of proof of Alema's demise, however."}, {"tag": "p", "text": "Leia then had her lightsaber taken by Saba, who told her that it did not reflect her skills anymore, and that it was time that she build a new lightsaber, one fit for a fully-fledged Jedi Knight. Leia had built her old lightsaber some 20 years before. However, Organa would continue training under Sebatyne for a further four years."}, {"tag": "h3", "text": "Second Galactic Civil War (40 ABY–41 ABY)"}, {"tag": "h4", "text": "Rising tensions"}, {"tag": "p", "text": "In 40 ABY, when tensions with Corellia rose, Leia remained a member of the Alliance in an official capacity. However, she was secretly aiding the Corellian independence movement. She was present at the Battle of Tralus. Although she was a member of the Alliance fleet, she helped the Corellians to their victory. However, after the battle, Leia did not realize that her son Jacen had turned to the dark side."}, {"tag": "p", "text": "As the war raged on Leia and Han found themselves banned from Corellia after Thrackan Sal-Solo placed a bounty on the entire Solo family. In order to avoid danger Han and Leia hid on Corellia, splitting up and meeting in Coronet. Getting useful information from Dur Gejjen, Han decided that Thrackan was too dangerous to be left alive and decided that he should die, though he had doubts about killing him in cold blood. While on Corellia, Han and Leia learned of a terrorist attack on a hotel in Coruscant leading to the deaths of thousands. They did not approve when they learned that Jacen and Ben were leading Galactic Alliance Guard raids on the Corellian parts of Coruscant. After hearing the news Leia and Han decided it was time to face their son and left for Coruscant."}, {"tag": "p", "text": "During their return to Coruscant, Leia and Jacen performed a Force meld in order to keep the aged ship intact. Soon after, Han, with the help of Boba Fett and Mirta Gev, killed Thrackan, thus ending his reign of terror. Meanwhile, Leia noticed that Jacen has become distant and was slowly becoming a stranger to the whole family. When Leia and Han discovered that Jacen killed Ailyn Vel, Han disowned Jacen while Leia was stricken with shock and betrayal."}, {"tag": "h4", "text": "Allegiance with Corellia"}, {"tag": "p", "text": "Shortly afterwards, Leia, Han, and C-3PO were summoned to the Kiris Asteroid Cluster where the secret Corellian fleet was located. Upon their arrival, they were greeted by Wedge Antilles who was recently bestowed upon the rank of admiral. Han believed that he was summoned to help Antilles defeat the Blockade of Corellia, but he was proven wrong once Dur Gejjen interfered. Instead of leading the attack with Wedge, Han and Leia were tasked with being decoys in order to draw Queen Mother Tenel Ka onto Corellia's side."}, {"tag": "p", "text": "Traveling to Hapes in order to warn Tenel Ka of danger, Leia and Han learned that Gejjen had been using the Solos to disrupt Tenel Ka's security routine and draw her out into the open for an attack. In the process of warning her, Leia and Han unexpectedly walked into an assassination attempt on Tenel Ka by the assassin Nashtah. Due to a series of unfortunate events, the two were forced to work with the assassin in order to escape. The three then set their course for Telkur Station. En route to the station, Leia and Han felt uncomfortable around Nashtah, though they insisted on finding the identity of the coup's leader. During their conversation, Nashtah revealed to Leia and Han that she'd seen Anakin Skywalker race in the Boonta Eve Classic. It was then that Leia revealed the reason for having children, though Han was upset about revealing such information to a stranger. Leia also stated she would not allow Jacen to become a new Darth Vader after Aurra Sing (Nashtah's true identity) questioned her about Jacen's destiny."}, {"tag": "p", "text": "They arrived on Telkur Station, only to encounter Jagged Fel, who was presumed lost after the Battle of Tenupe during the Swarm War. During their conversation, Fel revealed that he was marooned on Tenupe for two years after being shot down by Leia. While on Tenupe, he had discovered that Alema Rar was still alive and seeking to kill Leia and her family in revenge for crippling her during their last duel. He also revealed that his family was going through financial troubles, causing him to become a bounty hunter. After the conversation, the three were drugged while Jagged slipped away."}, {"tag": "p", "text": "Han and Leia eventually escaped Sing, only to take another passenger by the name of Lalu Morwan, who was responsible for hiring Sing to assassinate Tenel Ka and her young daughter. Due to Han's injuries he gained during their skirmish on Telkur Station, Leia was forced to fly the Falcon. Jacen ordered the Star Destroyer Anakin Solo to open fire upon the Millennium Falcon. Han and Leia escaped the confrontation, though the Falcon's turrets and central core were destroyed by the turbolaser blasts, resulting in the deaths of the Solos' trusted Noghri bodyguards Cakhmaim and Meewalh. During the battle, Leia's nephew, Ben Skywalker, attempted to arrest Leia and Han for their supposed crimes against the Galactic Alliance. In an attempt to arrest the two, Ben accidentally slashed Zekk in the abdomen, severely injuring him. After making sure that Jaina, Zekk, Ben and his crewman escaped, Leia and Han escaped into hyperspace."}, {"tag": "p", "text": "With the Falcon in desperate need for repair, Leia and Han traveled to a Tendrando Arms space station at Gyndine, where they reunited with their longtime friend, Lando Calrissian. Leaving Threepio behind to overlook the repairs, the trio left the planet in Lando's yacht, the Love Commander. They managed to get through Corellia's security zone, partially due to their deceitful disguises and Leia's use of a Jedi mind trick."}, {"tag": "h4", "text": "Breaking from Corellia"}, {"tag": "p", "text": "Meeting with Denjax Teppler in a Coronet cantina, they discovered that neither Teppler nor Wedge knew of the conspiracy to kill the Queen Mother and that it was the doing of Dur Gejjen. After their conversation, the group was forced to exit the cantina after several CorSec officers tracked Teppler to the cantina. Leia, Han, and Lando parted ways with Denjax shortly thereafter, being chased back to the Love Commander. Only with the intervention of the Pulsar Skate and the Errant Venture were Leia and the others able to defeat Corellian fighters attacking them. Aboard the Errant Venture, Leia reunited with many of her friends and family. They also encountered the smuggler Uran Lavint, who informed them of Alema's existence on the ship and the conference being held on Gilatter VIII. In an attempt to rescue Jacen from a violent ambush, Leia was once again confronted by Alema. The fierce duel that followed ended with a draw, with Alema crashing Lavint's ship, the Duracrud, into the Errant Venture."}, {"tag": "p", "text": "Unbeknownst to her and Han, Jacen intended to make them his sacrifice for his ascension to Sith Lord; however, Mara's interference led Jacen to choose her as his sacrifice. Leia, along with Han, went to Hapes to comfort Luke and Ben in their grief in the loss of Mara."}, {"tag": "h4", "text": "Opposing Caedus"}, {"tag": "p", "text": "Leia was scheduled to deliver the eulogy on Coruscant at the Funeral of Mara Jade Skywalker, but a squad of GAG troops intercepted her and Han, despite Luke's guarantee of safe passage. They were forced to fight their way out and flee the Temple before reaching the funeral room, leaving Leia's master, Saba Sebatyne to eulogize Mara, as Han and Leia did not want Mara's funeral to become a firefight."}, {"tag": "p", "text": "Instead, they escaped Coruscant and went to Kashyyyk in an attempt to persuade the Wookiees not to side with the Galactic Alliance. However, GA Intelligence agents Jae Juun and Tarfang caused some interference with their efforts and Leia had to use the Force to seize the stone that gave its wielder the right to address the Wookiee council. About that time, Luke and the other Jedi, having broken with Jacen, arrived on Kashyyyk to assist them. However, Jacen was not far behind and began attacking the planet's forests, outraging both Han and Leia. In response, Luke, the newly arrived Jaina, and the other Jedi launched an attack on the Anakin Solo and its escorting Fifth Fleet in their StealthXs. Han and Leia, meanwhile, took off on the Falcon for the Hapes Cluster to meet with Hapan Queen Mother Tenel Ka."}, {"tag": "p", "text": "Upon arriving at Hapes, through the Force, Leia sensed the disturbance caused by the explosion of Luke's fighter after Jaina, attempting to stop Jacen in his own StealthX from disrupting Luke's attack run, hit Luke's starfighter and destroyed it by accident. Leia was devastated by feeling her twin's death, but pulled herself together to face Tenel Ka, which was needed immediately to remove Hapan support from Jacen."}, {"tag": "p", "text": "As she and Han left the Falcon, they were ambushed by Tahiri Veila, who was one of the few Jedi still loyal to Jacen—though only because he had manipulated her love for his younger brother Anakin in order to control her and use her as a spy. Leia and Tahiri fought viciously in the Hapan Royal Hangar, with Leia gaining the upper hand. It is likely that Leia would have killed Tahiri had Han not stopped her and Queen Mother Tenel Ka arrived. Tenel Ka sent Tahiri away for ambushing the Solos, giving her a \"Royal Guard Escort\" out of the Hapan system. Leia and Han were successful in persuading Tenel Ka to withdraw Hapan support of Jacen."}, {"tag": "p", "text": "Later, Leia was in on a meeting between the Jedi, the Bothans and Confederate forces. She and Han had no opposition to the Bothan's statement that they were going to send assassins after Jacen, for they had realized earlier that their son was already dead - that this evil and wicked Jacen was not the one they had known all their lives. Leia could no longer feel \"Jacen\", or the boy that she had known as Jacen, in the Force; he had not been ripped away as Anakin had been, but a gradual disappearance that she had not noticed until he was gone."}, {"tag": "p", "text": "Leia later attempted to plead with Jacen on renouncing the dark side, but he simply shut her out, refusing. In reality, Leia had not expected her pleas to work, she was merely distracting Jacen to provide time for Jaina, Han, Zekk and Jag to hack into the computers upon the Anakin Solo. Later, Han and Leia used the knowledge obtained here to help rescue the Hapan Princess Allana, whom Jacen was hiding in secret quarters. While Luke, Ben, and Saba distracted Jacen by make a charge for the bridge, Han, Leia, and Iella Wessiri Antilles crawled through air vents to reach the young princess. After Allana was rescued, Han and Leia discovered that Allana was their granddaughter."}, {"tag": "p", "text": "After returning Allana to her mother on Hapes, Han and Leia traveled back to the Jedi outpost on Endor. Leia and her daughter Jaina met with Ben Skywalker to discuss his belief that Jacen had murdered his mother. He promised them that he would seek evidence to prove or disprove that Jacen killed Mara. Later Leia and Han were present on Endor when Ben received a recording from Lon Shevu that showed Jacen admitting to the murder, and revealing his new name of Darth Caedus."}, {"tag": "p", "text": "A short time later, the Jedi abandoned the base for an undisclosed world near the Transitory Mists. Leia and Han accompanied the Jedi, and were pleased that the location of the new base would give them additional opportunities to see their granddaughter. When the recording of Jacen confessing to be both the Sith Lord Darth Caedus and Mara Jade's killer was shown, Leia burst into tears and hugged Ben."}, {"tag": "p", "text": "Following Jaina's training under Boba Fett, she revealed to Han and Leia that she had to be the one to kill Jacen, now known as Darth Caedus. Jaina and her mother followed Ben discreetly to Monument Plaza while he met with one of his local contacts, Lon Shevu, a captain in the Galactic Alliance Guard. However, Shevu had been followed by Caedus's agents, including his apprentice Tahiri Veila. After Shevu was captured, Ben escaped away from the two Solos, trying to keep them from being discovered. Leia and Jaina attempted pursuit anyway after Veila captured Ben, but they were forced to break off the chase after Veila starting leading them into an obvious trap where they would be captured as well. Heart-stricken, they made their way back to their ship and returned to Shedu Maad to inform Luke Skywalker that they had lost his son. As they broke the news to him, Skywalker informed them that he had already foreseen that possible future and allowed it to happen anyway, for the sake of bringing down Caedus."}, {"tag": "p", "text": "Jaina embarked on a mission, dueling Caedus first on Nickel One, and then encountering him on the Anakin Solo. After a duel and being mortally wounded, Caedus stopped fighting so he could warn Tenel Ka about a threat to Allana. Jaina thought this to be a trick and killed him, horrified when she felt Jacen reaching out to Tenel Ka. Jaina then sat on the floor holding Caedus's head in her lap as Jagged Fel and her parents came to her aid. Han and Leia tried to avoid looking at their son's body but quickly broke into tears. Jaina would later say that she thought Caedus reaching out to Tenel Ka meant that he became Jacen before his death, and that she felt Jacen die through her twin bond, not Caedus."}, {"tag": "p", "text": "Though the Solos struggled to get through this hard time, they were able to remember Jacen as the kind young man he had once been, not the Sith he had turned into. The war had ended. Additional comfort and joy came from her granddaughter, Allana, whom Tenel Ka had given to Han and Leia to raise under the pseudonym Amelia because she knew that they could give the girl a safer life than she could on Hapes. Allana began training at the Jedi academy, though she ultimately left the academy to reside permanently with her grandparents."}, {"tag": "h3", "text": "Picking up the pieces (43 ABY–)"}, {"tag": "h4", "text": "Sojourn"}, {"tag": "p", "text": "At the conclusion of the war between the Galactic Alliance and the Confederation, Natasi Daala was elected as the new Galactic Alliance Chief of State, and relations between the government and the Jedi Order proved tense. After Allana, still in the care of her grandparents and living under the alias of Amelia, discovered a strange object resembling an antiquated transponder aboard the Millennium Falcon, the Solos decided to track down the previous owners of the ship in the hopes of learning about it; as well as using the time as a means of escaping the tension of Coruscant. By this time, Leia had been planning on writing a multi-volume memoir of her life and the plan to seek out the Millennium Falcon's origins inspired her to call the second volume The Crook, The Wook, and Me."}, {"tag": "p", "text": "Having visited Lando, the Solos learned that the transponder remained active and appeared to have been installed sometime during the Clone Wars. In addition, Lando alerted Leia to an encounter he had with Jedi Knight Seff Hellin on the planet of Taris, during which Hellin tried to commission a force of Mandalorian Hunter Droids for himself, as a means of combating Chief of State Daala's Mandalorian security forces. Unnerved by this, the Solos headed to Taris and encountered the rogue Jedi Knight themselves."}, {"tag": "p", "text": "Allana immediately noticed similarities between the way Jacen and Seff felt in the Force. Indeed, Seff interfered with an important Alliance operation, leading to a warrant for his arrest. However, using powers akin to those Jacen had been known to use, the rogue Jedi was able to escape his captors. Fearing the implications of this, Leia immediately contacted Luke, who also believed there to be a connection between Seff and Jacen. In addition, Seff's actions led to further discord between the Jedi and Chief Daala, who feared that Jacen had set a trend for younger Jedi turning to the dark side, forcing Luke to recall all Jedi to the Temple."}, {"tag": "p", "text": "The Solos ultimately followed the transponder and the information provided by the Falcon's previous owners to a hidden Old Republic \"Insignia of Unity\" which had once adorned the Senate Building, though it proved to be nothing more than a simulacrum. En route back to Coruscant, Leia received a communication revealing that Luke had been arrested by Chief Daala for \"dereliction of duty\" and as such the Solos rushed to his aid."}, {"tag": "h4", "text": "Mission to Kessel"}, {"tag": "p", "text": "Luke ultimately gained his freedom by exiling himself from the Jedi Order and subsequently began a quest to learn what had lead to Jacen's fall to the dark side. In Luke's absence, Kenth Hamner was appointed Grand Master. Further complicating relations between the Order and the government, Jedi Knight Valin Horn began to exhibit similar behavior to Seff Hellin. Indeed, along with displaying a power possessed only by Jacen, Jedi Horn was adamant that every single person in his life had been replaced by a double. Both Leia and Han participated in the capture of the deranged Jedi, though it was Luke who ultimately stopped him."}, {"tag": "p", "text": "The Solos were soon contacted by Lando and were forced to aid him in saving the planet of Kessel which had succumbed to violent earthquakes at the time Centerpoint Station was destroyed. Leia was instrumental throughout this, as her ability to use the Force proved an advantage. The Solos discovered a strange species of pure energy based beings living within Kessel, who monitored every gravity well in the galaxy, and who had begun to leave en masse; causing the earthquakes that wreaked across Kessel. Ultimately, however, the Solos and their allies proved able to save Kessel from destruction."}, {"tag": "p", "text": "Later, the Solos were summoned back to Coruscant by the Council in the aftermath of Jysella Horn succumbing to the same psychosis as a her older brother and Seff Hellin. It had become obvious that this mental illness was not an isolated event, and Cilghal wished to discuss the behavior Seff Hellin had displayed during his earlier encounter with the Solos, lest it be important. Darkmeld had secretly captured the rogue Jedi, and Cilghal was carrying out tests in the hopes of finding a cure for the mysterious illness."}, {"tag": "h4", "text": "Coruscant Livestock Exchange and Exhibition"}, {"tag": "p", "text": "After returning to Coruscant, Leia convinced Han that they should attend the Coruscant Livestock Exchange and Exhibition for a day, so as to provide an outing for Allana not fraught with danger, and to surprise her by purchasing a member of the animal species she gravitated towards most as a pet. It took several days for arrangements to be made for the Solo family to attend the event. Jaina accompanied her mother, father and niece to the event, while Jedi Knights Natua Wan and Radd Minker escorted them. Originally, Han and Leia had hoped that Jedi Knights Bazel \"Barv\" Warv and Yaqeel Saav'etu would be able to accept the assignment to escort them, as Allana was particularly fond of them, however, they were off world at the time."}, {"tag": "p", "text": "The small group first observed the animals in the outdoors exhibits, before moving on to the Small Animal Hall. In addition, the group made an effort to avoid journalist Javis Tyrr, who had consistently attacked the behavior of the Jedi on his Holoshow and had taken a particular interest in the activities of Jaina. It seemed the group was successful after entering the Dangerous Animal area at the insistence of Allana. Unfortunately, Javis Tyrr proved to be among the least of the group's worries."}, {"tag": "p", "text": "In the excitement, the Solos and Jedi Minker had failed to notice the disappearance of the Falleen Jedi Natua Wan. However, Leia, Jaina and Radd Minker soon sensed a sudden disturbance in the Force, and after turning to find Natua missing, Leia immediately realized that she to had succumbed to the illness that plagued Seff Hellin, Valin and Jysella Horn. Wan proceeded to release the dangerous animals from their cages and retract the bridges leading to emergency exits, in the hopes of killing everyone inside; as, overcome by the mystery illness, she believed them to be \"impostors.\" In the ensuing chaos, Leia was forced to demonstrate her prowess as a Jedi by killing five boar-wolves to save a young child and a mother nexu who had injured an Ithorian spectator."}, {"tag": "p", "text": "After this, Wan proceeded to taunt Leia, who made her way to the control room expecting to confront her. However, despite Wan's voice emanating from there, she was nowhere to be found. Leia soon found Wan confronting Jaina, and aided her daughter in a brief lightsaber duel with the Falleen, before Jedi Minker head-butted the deranged Jedi, rendering her unconscious. Leia noted that Wan had demonstrated the ability to throw her voice using the Force, a strange ability her late son Jacen had also been known to possess. Wan's rampage proved particularly disastrous, as Javis Tyrr had managed to capture a large amount of the chaos on film and aided in souring the deteriorating relationship between the Jedi Order and the government of Chief Daala."}, {"tag": "p", "text": "Leia was intimately involved in negotiations with Daala after Wan's rampage, and Javis Tyrr's discovery that the Jedi had secretly captured Seff Hellin; which he proceeded to make public. These negotiations resulted in the Jedi being able to retain custody of Wan and Hellin, though Daala's people would have to be allowed access to them at all hours. In addition, Leia, Jaina acting Grand Master Kenth Hamner, Cilghal, and Tekli were forced to publicly apologize for being involved, or failing to prevent, the Jedi's deception."}, {"tag": "p", "text": "During this time, Kenth Hamner noted that Leia was expected to soon rise to the rank of Jedi Master. She may have become one at some point following this."}, {"tag": "h4", "text": "Another fall"}, {"tag": "p", "text": "Sometime after Leia and Han went to see Hellin. As they were talking, the Knight attacked Leia, but was subdued only after Cilghal subdued him with their stun stick. An hour or so afterward she helped subdue Jedi Knight Bazel Warv and Jedi Knight Yaqeel Saav'etu. Right after that, GAS found out about it and served a warrant automatically."}, {"tag": "p", "text": "Leia was the negotiator of course and decided that the GAS squad needed a little help understanding. Jaina and Jag were also there and had decided to step out. Leia then performed, as Jaina later referred to in Jag's limo, a Sligh Slipper and closed the door to the Temple, preventing GAS from getting in. When they went back inside the Temple, they found Barv having convulsions. Jedi Apprentice Melari Ruxon, whom Han had told to fire another dart at the patients if they so much as twitched, had fired two darts at him."}, {"tag": "p", "text": "Leia had to calm the apprentice and her partner about the disease that was claiming their Knights, saying that everything was going to be alright and that Master Cilghal would figure this out. Master Hamner then came in demanding what had happened outside. Han was sent to find something to help transport Barv after he had interrupted their \"discussion.\" Hamner then demanded why she ignored a warrant saying that he would have preferred the two Knights in carbonite \"if that was what the law demanded.\" Leia reminded him that the law was not justice and that they could not turn over the Knights because they were and especially when Daala's solution is to turn them into carbonite."}, {"tag": "p", "text": "She was saved by the bell when Master Cilghal came in, saying she had good news. However, as usual, her first priority was her patients and she had asked them to help move them. Master Hamner said he had strong objections, telling her that there was a warrant out for them. She asked the Solos how many they had hurt, learning that they had not hurt anyone. Cilghal then asked why they had a warrant out for them and Leia told her that the government considered them a \"public endangerment\" and saying that it was an overstatement telling her that they had had the Knights inside the Temple in two minutes flat. Master Hamner argued that since they had served a warrant, the Jedi are required to submit to it. Cilghal immediately took the Solos' side saying Daala was not going to freeze her patients to score points with public relations, and that if Master Hamner was that desperate, he was going to have to call the Council into it and take a vote."}, {"tag": "p", "text": "Leia had begun levitating Barv (with difficulty) when Apprentices, Swen and Reeqo's robes were found. At first Hamner had panicked, but Cilghal said that they had not caught the disease because they were too young. She then revealed that only the children who were in the Maw during the Yuuzhan Vong war were at risk, and that the adults were probably in the clear since none of them had fallen ill."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "In her youth Leia had a fiery attitude and was headstrong, though not as much as her brother and father. As a child, Leia was not fond of her role as the Princess of Alderaan. She was often seen by many, especially her family, as a tomboy and was sometimes mistaken for a domestic girl rather than a princess. As she matured her outspoken nature blossomed and her dislike of her title ceased. Leia also had a strong personality and a bright intellect. Unlike her brother, Luke Skywalker, and her father, Anakin, Leia never looked for adventure or rushed into things without thinking. Like her mother, Leia avoided the corruption of politics, and instead concentrated on helping others."}, {"tag": "p", "text": "Despite growing up on the peaceful world of Alderaan, Leia never became soft. Throughout the Galactic Civil War, Leia proved to be the leader that everyone was willing to follow. Her fierceness and determination to restore freedom to the galaxy helped the Rebel Alliance get through even the toughest of battles. Leia had always put duty before her own personal needs, making her the perfect leader for the New Republic. However, this would be a burden as she had to be away from her young children. Over time her strong stance on political matters ceased and by the time of the Black Fleet Crisis many were seeking to oust Solo from her position as Chief of State."}, {"tag": "p", "text": "Leia was known for having compassion for her friends, and would go to great lengths to help them, whenever she could. This was why she had a strong bond with her son, Jacen, who shared her view. Unfortunately, this bond was shattered after Jacen fell to the dark side."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Though Leia would originally follow in her mothers footsteps, becoming a shrewd politician, she possessed many other talents. Indeed, Leia would eventually follow the path of her father and brother, becoming a Jedi of considerable skill; both with the Force and a lightsaber.[source?]"}, {"tag": "p", "text": "During her first term as senator, she was taught self-defense and combat skills by Giles Durane, a weapons master and friend of Bail Organa. Leia was an excellent marksman, missing rarely, if ever, with a blaster."}, {"tag": "p", "text": "Leia was also an able starfighter pilot. She was known to fly an Y-wing fighter on a number of missions for the Alliance."}, {"tag": "p", "text": "Leia was a skilled tactician who was involved in the planning of several important engagements during the various galactic conflicts of her time."}, {"tag": "p", "text": "As of 2 ABY, Leia Organa admitted she did not know how to swim."}, {"tag": "p", "text": "Though hesitant about her Jedi training, Leia was later taught various Force techniques, and she eventually became a full-fledged member of the New Jedi Order. Being the daughter of Anakin Skywalker, it was theorized that her full Force potential might have been the same as her brother Luke's. Under Jedi Master Saba Sebatyne, Leia dramatically increased her Force powers and skill with a lightsaber, to the point that Sebatyne believed her to be the equal of any Jedi Knight.[source?]"}, {"tag": "p", "text": "A short time after having learned of her Force-sensitivity in 4 ABY, Leia was able to use the Force to sense her brother's presence, confirming he had survived the destruction of the second Death Star. During the Swarm War, Leia was able to use her much increased connection to the Force, having become the student of Master Sebatyne, to sense the whereabouts of Alema Rar by distinguishing between the powerful Living Force presences on the planet Tenupe, which contrasted sharply with Alema's hidden presence."}, {"tag": "p", "text": "In 10 ABY, Leia helped her brother defeat Palpatine through the use of her natural talent with battle meditation; at this time Leia had little Force training and her ability to use such a powerful Force power is indicative of her strength in the Force."}, {"tag": "p", "text": "Still untrained, Leia was able to shield her infant son Anakin, from Palpatine's disembodied spirit, preventing the Sith Lord from possessing the child."}, {"tag": "p", "text": "Leia was skilled in the use of telekinetic powers such as Force Push, Force Pull and Saber throw, as well as in using the Force to plant herself firmly in place. Leia exhibited a talent for telekinetically controlling the air paths taken by fog, being able to manipulate it at great speeds, allowing the Millennium Falcon to race through it without losing visibility prior to the onset of the Dark Nest crisis. In 40 ABY, Leia was able to telekinetically hold the Millennium Falcon together against the pressure caused as it crashed through the atmosphere of Coruscant. However, it took the combined might of Leia, Jaina and Jacen to ultimately land the severely damaged ship with the Force."}, {"tag": "p", "text": "Although strong in telekinesis, Leia was not very good with levitation. In 43.5 ABY, she strained in moving Jedi Knight Warv and could not divide her attention to Han when he said that two apprentices had left their robes behind."}, {"tag": "p", "text": "Before she had any proper training, Leia's earliest displays with a lightsaber showed promise. She had been able to wound her own father, Darth Vader, before being quickly defeated on Mimban. After training under Master Sebatyne, Leia's skills became formidable, allowing her to hold her own against, and severely injure, the much younger Alema Rar on several occasions. Even before her official training, Leia proved capable of defeating the centuries-old and fully trained Dark Jedi Beldorion in a fierce lightsaber duel. Despite her grief over the supposed death of her brother, Leia proved capable of dueling Tahiri Veila; indeed, it was the intervention of Han Solo alone that made Leia spare the aspiring Sith apprentice's life."}, {"tag": "p", "text": "Like the other Jedi of her family, Leia demonstrated a talent for participating in Force Melds. Notably Leia participated in a battle meld with her daughter, Master and Zekk during the Battle of Tenupe."}, {"tag": "p", "text": "Leia was capable of telepathic feats; being able to communicate through the Force with her brother at a seemingly limitless range. Leia also demonstrated an ability to reach out to others in the Force to read their feelings or emotions. In her interrogation during the Swarm War, Leia was able to telepathically read the mind of her interrogator so as to learn his name and unnerve him.[source?]"}, {"tag": "p", "text": "During her third duel with Alema Rar, Leia was temporarily able to fool Alema into relinquishing her weapon; an exceptional achievement against a fully trained Jedi Knight. Leia proved able to use Jedi mind tricks on troopers who attempted to arrest her during the funeral of her sister-in-law."}, {"tag": "p", "text": "Leia also showed a talent in Force-flashing electronical devices. In 44 ABY, Leia and Han went to visit Tahiri Veila in her cell, as her trial had just begun. The guards there however would not let Leia and Han speak to Tahiri alone, the most they got was speaking to Tahiri alone in her cell, as the camera was recording their conversations. Leia Force-flashed it so all three of them could talk in privacy without being overheard by anyone.[source?]"}, {"tag": "h2", "text": "Romances"}, {"tag": "h3", "text": "Raal Panteer"}, {"tag": "p", "text": "Raal Panteer was a childhood friend of Leia's, who, even after the destruction of their homeworld, seemed to be interested in a relationship with the Princess. His death ended any such possibility, however. However, when the two were younger, they shared their first kiss in the reflection pools on Alderaan at night."}, {"tag": "h3", "text": "Luke Skywalker"}, {"tag": "p", "text": "During the Galactic Civil War, Leia was one third of a love triangle as Luke Skywalker and Han Solo both harbored feelings for her. She seemed to have shared these feelings for both men to some respect. However, after Luke and Leia discovered they were siblings, their relationship evolved into that of brother and sister, and Leia's love for Solo was realized."}, {"tag": "h3", "text": "Fenn Shysa"}, {"tag": "p", "text": "When Han was frozen in carbonite, Leia spent most of her time looking for his whereabouts. During her search she came across Mandalore Fenn Shysa, who had planned to assassinate her as he thought that Leia was her deceased mother, Padmé Amidala. Eventually Shysa joined Organa in her search for Han and as a result the two developed a relationship. However, the relationship did not last.[source?]"}, {"tag": "h3", "text": "Prince Denid"}, {"tag": "p", "text": "During a mission to the planet Velmor, Leia had a brief relationship with the planet's pro-Alliance ruler, Prince Denid, and masqueraded as his betrothed, Lady Loren of Alderaan. Nothing came out of it, however, and it was apparently discontinued after the completion of the mission."}, {"tag": "h3", "text": "Prince Xizor"}, {"tag": "p", "text": "Then there was Prince Xizor, who was the leader of the Black Sun criminal organization. However, this relationship was one of seduction and not love. Xizor was a member of the Falleen species, who were known for their special ability to attract members of the opposite sex by using their pheromones, which he used to his advantage by seducing Organa. The relationship was short-lived though, as Leia was able to overcome his seduction and delivered an embarrassing kick to Xizor's groin."}, {"tag": "h3", "text": "Trioculus"}, {"tag": "p", "text": "During his campaign against the New Republic, Trioculus became infatuated with Leia Organa. Though the feeling was not mutual, Trioculus believed he could convince her to betray the New Republic and turn to the dark side of the Force. His attempts to do so included telling her to accept her own darker aspects, and explaining that evil acts and murder were sometimes necessary, and did not diminish his own capacity to love.[source?]"}, {"tag": "p", "text": "Trioculus's obsession with Leia would ultimately lead to his downfall: first when he tried to kill Zorba the Hutt for wanting her dead, which led to his capture and the rise of Kadann, and finally when he married Project Decoy's human replica droid, believing it to be Leia, which killed him.[source?]"}, {"tag": "h3", "text": "Prince Isolder"}, {"tag": "p", "text": "In 8 ABY Prince Isolder of Hapes asked for Leia's hand in matrimony. At a formal reception he presented many gifts which Leia accepted, nearly saying yes to his proposal. However, Han intervened and during a trip to Dathomir Isolder fell in love with the Dathomiri witch Teneniel Djo."}, {"tag": "h3", "text": "Han Solo"}, {"tag": "p", "text": "When they first met, the two got off to a rocky start; however, as they worked together during the Galactic Civil War, Leia and Han Solo developed a relationship that would last throughout the war. Though Leia did not admit at first, she had feelings for Han, but she also had feelings for Luke. However, when Han became frozen in carbonite, Leia realized that she loved him."}, {"tag": "p", "text": "In 8 ABY, the two were married and had three children, Jaina, Jacen, and Anakin Solo, in the next two years. Even with the death of their youngest child Anakin and the fall of Jacen to the dark side, their relationship grew stronger. Not even the war would tear them apart."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Leia Organa Solo appeared in Star Wars: Episode IV A New Hope; the novel depicted her slightly before the film's release in 1977. She would go on to be born in the conclusion of the prequel trilogy, in 2005. However, that her brother, Luke, and she would be born in the prequels was announced in 1998. The original trilogy was rereleased in theaters and VHS to commemorate the twenty year anniversary of Star Wars: Episode IV A New Hope the year before and Star Wars Trivial Pursuit was released to coincide with this. The limited edition game, released in 1998, contained a sequestered pack of questions that served as a preview of the first new trilogy installment, one of which divulged this."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "Leia was played most notably by actress Carrie Fisher in the original trilogy and The Star Wars Holiday Special. All subsequent images of her likeness were based on Fisher's appearance. She was also played by Aidan Barton (the son of editor Roger Barton) as an infant in Revenge of the Sith."}, {"tag": "p", "text": "Leia has been also been portrayed vocally by Ann Sachs in the Star Wars radio drama, Lisa Fuson in Star Wars: Galactic Battlegrounds, Star Wars: Masters of Teräs Käsi and Star Wars: Shadows of the Empire, Susanne Egli in the audio adaptations of Rebel Agent and Jedi Knight from the Dark Forces saga, Grey DeLisle in Star Wars: Force Commander, Catherine Taber in Star Wars: The Force Unleashed and Star Wars: The Force Unleashed II, and Clare Grant in Star Wars: Smuggler's Gambit."}, {"tag": "p", "text": "Carrie Fisher also made an appearance as Leia on the November 18, 1978 episode of Saturday Night Live (which aired one day after the holiday special), which she also hosted as herself. The July 1983 issue of Rolling Stone magazine parodied this appearance. In Star Tours: The Adventures Continue, Julie Dolan supplied the voice of Leia, while the image supplied for her hologram transmission was a modified version of unused footage from her plea to Obi-Wan Kenobi in A New Hope."}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "In the rough draft of A New Hope, Leia was a 14-year-old princess (the same age as Queen Amidala in The Phantom Menace), the spoiled daughter of King Kayos and Queen Breha of Aquilae. In that draft, she had two brothers, Biggs and Windy, whose identities were substantially revised into their current form by the fourth draft (though they did not appear in intervening versions). The later story synopsis established her as Leia Antilles, the daughter of Bail Antilles from the peaceful world of Organa Major. In the fourth draft the names were turned around so that Leia Organa came instead from Alderaan. Interestingly, when George Lucas was writing background material for licensees in 1977, he wrote that she had several brothers, and that she was unaware whether her parents had escaped the destruction of her homeworld. No-one from the House of Organa, however, had reached the Rebels as yet."}, {"tag": "h3", "text": "Name"}, {"tag": "h3", "text": "Costumes"}, {"tag": "p", "text": "The costume designer for the films had a \"no lingerie in space\" policy, which prevented Fisher from wearing a brassiere. To maintain decorum, adhesive tape was used in place of the banned garment. Despite the ban on some undergarments, Leia's metallic bikini scenes were voted by Empire magazine as among the most memorable in movie history.[source?]"}, {"tag": "h3", "text": "The \"doughnut hairstyle\""}, {"tag": "p", "text": "Leia's well-known hairdo in A New Hope has been affectionately dubbed the \"doughnut hairstyle,\" or cinnamon buns, by many science fiction fans.[source?] Miss Piggy of Jim Henson's Muppet Babies once copied said hairdo using doughnuts in a Star Wars-centric episode of the series. Also, in one scene from Mel Brooks' Spaceballs, Princess Vespa also appears to have the hairstyle, but reveals that she is actually merely wearing a large pair of headphones. In addition, in the parody film Thumb Wars, the role of Leia was filled by a character named Princess Bunhead, who, as the name implies, had two cinnamon rolls for hair. Finally, preceding all the other parodies, the short film Hardware Wars shows Chewchilla, the Wookiee Monster actually eating one of Princess Ann-Droid's cinnamon buns."}, {"tag": "p", "text": "In reality, however, Leia's hairdo may not be as unique as it first appears. Young marriageable Hopi Indian women traditionally wore a very elaborate \"squash blossom\" hairdo that superficially resembles Princess Leia's. George Lucas commented the hairstyle in Time magazine: \"In the 1977 film, I was working very hard to create something different that wasn't fashion, so I went with a kind of Southwestern Pancho Villa woman revolutionary look, which is what that is. The buns are basically from turn-of-the-century Mexico.\" Indicating that the hairstyle originated from the Soldaderas during the Mexican Revolution."}, {"tag": "p", "text": "In Europe, a similar hairstyle still persists in the Spanish region of Valencia, and can be seen during the Falles festival."}, {"tag": "p", "text": "Leia's signature hairdo also inspired a recurring freshman gag at the U.S. Naval Academy. Along with \"wildmans\" and \"assassinations,\" the \"Princess Leia\" is another popular method for freshmen (Plebes) to taunt their superiors. The freshman smears peanut butter on a pair of hamburger bun halves or English muffin halves, sneaks up behind an upperclassman in the dining hall, and sticks them on the upperclassman's ears. These dining hall pranks, however, have been discouraged in recent years."}, {"tag": "h3", "text": "Leia as a cultural figure"}, {"tag": "p", "text": "Owing to the character's positive reception and the cultural legacy of Star Wars, Leia has been referenced or parodied in several TV shows and films, and celebrated in cosplay. with Fisher also appearing in Leia's bikini costume on the cover of the Summer 1983 issue of Rolling Stone, and a painting of Leia and other characters surrounding Lucas appeared on the cover of the May 25, 1983 issue of Time announcing Return of the Jedi. Princess Leia also appeared on a 2007 US postage stamp and a 2015 UK stamp. In addition, the #58th issue of Nintendo Power magazine claimed that Leia, alongside Alien protagonist Ellen Ripley, acted as the inspiration for the design for the Super Metroid comic protagonist Samus Aran.[source?]"}, {"tag": "h3", "text": "Her biological mother"}, {"tag": "p", "text": "George Lucas stated that he wanted one of the Skywalker twins to recall their mother, hence Leia describing her as \"very beautiful, kind but sad\" in Return of the Jedi."}, {"tag": "p", "text": "When Star Wars: Episode III Revenge of the Sith came out, many people did not understand how it was possible that Leia claims to remember her mother although she had known her for barely a minute. There has been some debate about whether Leia is discussing her biological mother, Padmé Amidala, or her foster mother Breha Organa. However, the official Star Wars website explicitly states in its \"Q & A\" section that Leia is remembering Padmé. But seeing as Bail and Padme were good friends outside of politics, the Organa's may have photographic images of Padme to which Leia is referring. Another unlikely possibility could be Leia's Force abilities have given her a connection through the Force with her estranged biological father's memories of Padmé."}, {"tag": "h3", "text": "Princess Leia's Theme"}, {"tag": "p", "text": "Princess Leia's Theme is the musical leitmotif in the Star Wars saga that represents Princess Leia Organa."}, {"tag": "p", "text": "It is first heard in A New Hope, when Princess Leia is captured by Darth Vader. Later, it is heard as R2-D2 plays Leia's holographic message to Obi-Wan Kenobi. It is also heard very fully as Leia nostalgically remembers the innocent past. The theme plays when Obi-Wan Kenobi is killed by Darth Vader, even though Leia has no direct involvement in this event. This was written in the soundtrack notes for A New Hope. Finally, it plays in the end credits of A New Hope."}, {"tag": "p", "text": "In The Empire Strikes Back the theme is again present and is also developed in the new theme Han Solo and the Princess, which acted as the film's love theme. Princess Leia's Theme plays as Han Solo tells Leia that he must leave to settle his debt with Jabba the Hutt. The only other time it plays is at the end of the movie, when Leia and Lando Calrissian rescue Luke Skywalker from Cloud City on Bespin. During this film, Leia's theme is replaced by the love theme mainly as a representation of Han and Leia being a couple. However, once Han is taken by Boba Fett, Leia's theme returns to signify again, she is alone."}, {"tag": "p", "text": "In Return of the Jedi, the theme is only heard as Leia shoots a stormtrooper on the moon Endor."}, {"tag": "p", "text": "The theme was revived for the \"prequel\" trilogy. Its first occurrence in a sequential viewing of the six-film Star Wars saga is in Revenge of the Sith, when her adoptive parents, Bail Organa and his wife, hold the newborn Leia during the final montage of shots at the end of the film. It reappears soon after during the end credits of the movie. This was to uplift the depressing mood of the movie and remind people that there was hope."}, {"tag": "h2", "text": "Alternate endings"}, {"tag": "h3", "text": "Senator Leia Organa, Sith apprentice"}, {"tag": "p", "text": "In the graphic novel, Star Wars Infinities: A New Hope, the Rebel Alliance is defeated and Princess Leia finds herself a captive of the Emperor. Darth Vader begins training her in the ways of the Sith, helping her to develop her Force powers, in the hopes that one day they will overthrow the Emperor and rule the galaxy together. Additionally, she becomes the senator representing Coruscant in the reformed Imperial Senate. Leia takes her training from Darth Vader seriously and in the final climactic battle with Luke, she uses her father's Sith lightsaber to attack him. Luke manages to turn Leia back to the light side and escapes Coruscant prior to its destruction. Years later, Leia becomes the Chancellor of the New Republic, leading the galaxy into a time of peace and prosperity."}, {"tag": "h3", "text": "Leia Organa, Jedi Knight"}, {"tag": "p", "text": "In the Endor downloadable level for Star Wars: The Force Unleashed II, Leia is once again involved with the mission to Endor to destroy the shield generator protecting the second Death Star. Vader sends the Dark Apprentice, a clone of Galen Marek, to eliminate the Rebels and protect the shield generator. After killing Han and Chewbacca, the Dark Apprentice proceeds into the shield generator to find Leia. Leia reveals that Luke died during the Battle of Hoth, and that she took up his destiny of becoming a Jedi Knight. The two clash furiously in the generator room, however, the Apprentice was more skilled than Leia. The fight continued outside, where the Dark Apprentice managed to overpower and kill Leia, thus ending the mission to destroy the shield generator."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}