{"url": "Lekku", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Anatomy", "Category:Twi'lek culture"], "nodes": [{"tag": "h1", "text": "Lekku"}, {"tag": "p", "text": "Lekku (singular lek), also referred to as head-tails, were long, fleshy appendages that protruded from the head of all Twi'leks, Togruta, and male Ozrelanso. The Togrutas sported three of them, while the other species had two (occasionally four, in the case of Twi'leks)."}, {"tag": "h2", "text": "In Twi'leks"}, {"tag": "p", "text": "In Twi'leks, lekku were shapely prehensile tentacles that grew from the crown of their skulls. While Twi'leks normally had two lekku, certain individuals like Orn Free Taa had four of them. Those organs were very sensitive to touch, and a damaged lek could cause severe harm to a Twi'lek. In addition to their spoken language, Ryl, the Twi'leks could also communicate through subtle lekku gestures."}, {"tag": "p", "text": "Despite the high sensitivity of those organs, some Twi'leks like Cham Syndulla tattooed their lekku. Some wore them simply hanging down their back or falling over the chest, while others like Bib Fortuna bent them around the neck or shoulders for aesthetic purposes."}, {"tag": "h2", "text": "In Togruta"}, {"tag": "p", "text": "The name \"lekku\" was also used to describe the striped head-tails of the Togruta. That species, however, had three such appendages: two lekku to the front, falling over the chest, and one thicker lek that was centered at the rear base of their skull. As seen on Governor Gupat Roshti, a male Togruta's lekku were shorter than those of a female. The color of a Togruta's lekku was determined by their DNA, and they grew as their wearer matured. In adolescence, the head-tails extended only slightly past the collarbones, but could reach below the waist by adulthood."}, {"tag": "h2", "text": "In Ozrelanso"}, {"tag": "p", "text": "In male Ozrelanso, lekku were tentacles that grew on the sides of their skulls."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lekku first appeared in the film Star Wars: Episode VI Return of the Jedi, along with the Twi'lek species."}, {"tag": "p", "text": "In The High Republic: Into the Dark, Togruta Jedi Master Jora Malli's lekku are misidentified as her montrals when the appendages are described as streaming behind her when the airspeeder she is riding goes into a dive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}