{"url": "Len_Markus", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Criminals", "Category:Cularin Belt residents", "Category:Dark Jedi", "Category:Force-sensitive Believers", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Len Markus"}, {"tag": "p", "text": "Len Markus was one of Nirama's lieutenants. He was not Nirama's second-in-command, but rather was a representative of the smugglers in Nirama's organization, and held a bit of power in the Organization. He stood in the background and pulled strings, being the one who gave most of the orders to the smugglers."}, {"tag": "p", "text": "Len Markus was not a true albino, but he had an appearance similar to one, being very pale. If he wanted to accentuate his paleness, he would dress in light colors, or wear dark clothing if he wanted to blend in. Markus was very personable, with a charming smile. He did not inspire trust, but he was able to make others believe that he trusted them, even if he didn't. He was two-faced, shifted his allegiances and positions, and generally acted as a criminal lieutenant was expected to act. Nirama found Markus, and his attempts to placate Nirama with delicacies from all over the galaxy, to be amusing. Nevertheless, Nirama trusted Markus even in times of distress, when trust was a luxury Nirama could hardly afford."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In 32 BBY, Nirama's pilot Arraxx was racing through the moon of Eskaron. Arraxx crossed paths with a private race between Blood Raptors member Gael Kinner and intimidated entrepreneur Teeloo. To avoid collision, Kinner shot Arraxx's ship and destroyed it, making Nirama loose money, assets and his temper in front of people he respected. Upset, Nirama ordered Markus to bring both Kinner's and Teeloo's ships and crew, undamaged. Markus took five Human thugs, two Trandoshans and one Twi'lek, and tracked the racers to Tolea Biqua. He intimidated them arriving in a raven-black Z-95 Headhunter, privately talked with Teeloo, and kidnapped all of them, taking them to Nirama's mansion in Mikish. At that point, he could not imagine what would be the punishment for something like that."}, {"tag": "p", "text": "Markus notified Nirama that he had brought the offenders, and he was present while Nirama questioned each of the groups in turn. When Nirama was finished with the Raptors, Markus offered the Raptors's personal items and weapons to Teeloo's allies, as the Raptors were in no condition to use them any longer. Nirama asked Teeloo to stay a little longer than his crew, and Markus tried his best to calm the crew and convince them that Nirama had already outed his wrath with the Raptors, so he would not harm Teeloo. Markus was right: Nirama was hiring Teeloo at that point."}, {"tag": "p", "text": "Some months later, Markus escorted Nirama to his main weapon storage facility, Rothe Gate. Nirama wanted to go there following a lead on his missing employee Jobril, which he believed was connected to The Cell, a faction of his Organization who opposed to Nirama's lead. Nirama wanted to meet with some people who had information on these subjects, he gave a speech with Markus to his left, and then began some audiences. Markus remained at the door, checking any incoming person for potential threats. The Cell attempted to assassinate Nirama during this meetings, but Markus and other employees successfully protected the crime lord."}, {"tag": "p", "text": "At some point, Markus heard about the Darkstaff and sought it out. He eventually located it, but was pursued by some of the Cularin system's heroic individuals. As Markus passed over the Almas Sith fortress with the Darkstaff, the fortress emitted a tremendous blast of Force lightning, engulfing his ship. Len Markus, the Darkstaff, and his ship disappeared. Simultaneously, the entire Cularin system disappeared from the galaxy, only to reappear suddenly almost ten years later with no noticeable passage of time within the system."}, {"tag": "p", "text": "Len Markus was considered missing, and Nirama promoted Nadin Paal to fill in the void. Markus was, however, alive and well, although the Darkstaff suffered damage during the attack. Wanting to repair the Darkstaff, Markus contacted Chevin slaver Phylus Mon. Markus wanted Phylus Mon to travel to Almas and use Sith rituals to repair the Darkstaff. In exchange for this, Markus offered Phylus Mon the secret of the Sith battlelord rituals. Phylus Mon accepted the deal, because the rituals would allow him to have an enslaved army."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}