{"url": "Len_Parvek", "categories": ["Category:Legends articles", "Category:Alliance individuals", "Category:Eternal Empire individuals", "Category:Eternal Empire military", "Category:Humans", "Category:Males", "Category:Military personnel"], "nodes": [{"tag": "h1", "text": "Len Parvek"}, {"tag": "p", "text": "Len Parvek was a Human male who served in Zakuul's military as part of Koth Vortena's crew and later in the Alliance against his native homeworld."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Born on Zakuul, Len Parvek spent years serving in the Eternal Empire's military, being a surbordinate officer of Koth Vortena. A loyalist of the Immortal Emperor Valkorion, his faith in his homeworld eroded after Arcann seized his father's throne and embarked on a brutal conquest against the Galactic Republic and the reconstituted Sith Empire. During the Occupation of Denon Vortena and his crew were ordered to massacre the rioting Denon civilians until they stopped rebelling. This was the turning point for Koth, who refused the order and was relieved of command. Recognizing a a kindred spirit in his captain, Len freed Koth from the brig and smuggled him to safety aboard the Asylum shadowport. Both defectors spent months fleeing from Knights of Zakuul, recruiting a crew of misfits such as former Republic Corporal Ralo and prodigy engineer Tora."}, {"tag": "p", "text": "In 3631 BBY Koth allied with Lana Beniko to rescue her associate from carbonite. While making their escape from Zakuul, they came across the legendary vessel called the Gravestone, which they used to travel to Asylum. There, Len and the rest of the crew joined Koth in working on restoring the ship to its full capabilities. When the Eternal Fleet arrived at their position, starting the Battle of Asylum, Len callen upon SCORPIO to fire the ship's turbolasers and later joined in defense of the ship against Skytrooper forces. The crew managed to escape the battle on the Gravestone and traveled to Odessen, where Beniko set up a formal Alliance against the Eternal Empire, which Koth and Len joined along their entire crew."}, {"tag": "p", "text": "The Alliance eventually managed to dethrone Arcann, only for his sister Vaylin to clain the Eternal Throne in his place, teaming up with SCORPIO. The two of them used subterfuge to initiate on Assault on the Gravestone, boarding the vessel under the guise of a civilian shuttle. Vortena himself managed to evade capture, but Len, Tora and the rest of the crew were held as Vaylin's prisoners on the ship's bridge. When SCORPIO required personal information about Koth to break his encryption key, Vaylin used the force to torture Parvek, until he revealed the passcode - names of the soldiers who died under Koth's command during his military days. Vaylin and SCORPIO then left the bridge, allowing Koth and the Alliance Commander to reach it and free Len and the rest of the crew. Koth revealed that he installed a quantum bomb on the ship and ordered Len and the rest of the crew to the escape pods, they managed to eject shortly before SCORPIO took control over the vessel and launched it into hyperspace. The Alliance eventually managed to defeat Vaylin and claim the Eternal Throne, after which it was transformed into the Eternal Alliance, unifying the military of Zakuul and the Eternal Fleet with the cause of the Alliance, which Len Parvek continued to be a part of."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Len Parvek first appeared in \"Chapter 6: Asylum\" of the Knights of the Fallen Empire digital expansion of the video game Star Wars: The Old Republic."}, {"tag": "p", "text": "If the player makes two Dark Side choices to allow the Sun Generator to explode in Chapter III: The Outlander and later allow Kaliyo Djannis to detonate the bombs in the Spire during Chapter X: Anarchy in Paradise, Koth Vortena will become fed up with the player's cruelty and abandon the Alliance alongside Len Parvek and Ralo, while Tora will remain behind. In this event, they will later return during the Battle of Odessen and steal the Gravestone from the Alliance during the battle. The crew will still be captured by Vaylin and her forces, only sans Tora, and Koth will still order them to evacuate in an escape pod, except in this situation the nearby Alliance Fleet is not friendly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}