{"url": "Leontyne_Saresh", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Galactic Republic governors", "Category:Galactic Republic senators", "Category:Saresh family", "Category:Slaves", "Category:Supreme Chancellors", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Leontyne Saresh"}, {"tag": "p", "text": "Leontyne Saresh was a female Twi'lek who, throughout her career, served as a senator, governor, and Supreme Chancellor during the Galactic War with the reconstituted Sith Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A female Twi'lek whose ancestors once lived on the city-world of Taris before its destruction, Leontyne Saresh escaped Imperial slavery as a youth. She joined the government of the Republic and quickly became a prominent member of the Galactic Senate. However, her uncompromising views and her vocal opposition of the Empire led to her appointment as the Senatorial Supervisory Governor of Planetary Affairs on the ruined world of Taris, a position that had destroyed the careers of several other promising individuals. But Saresh took the assignment to heart, putting all of her resources and intellect to work directing the planet's resettlement initiative."}, {"tag": "p", "text": "When the Empire invaded Taris in 3642 BBY and crushed the resettlement project, Saresh managed to escape back to the Republic. By 3640 BBY, her political standing was significant enough to secure her the position of Supreme Chancellor after her predecessor Dorian Janarus was killed by a bounty hunter. She would later preside over recognition ceremonies for the Barsen'thor of the Jedi Order and the commander of the Special Forces unit Havoc Squad, and during the former ceremony, personally welcomed the members of the Rift Alliance back into the Republic fold."}, {"tag": "h3", "text": "War with the Hutt Cartel"}, {"tag": "p", "text": "Two years later, Chancellor Saresh journeyed to Keylander Station in orbit of the planet Makeb, which had been occupied by the Hutt Cartel as part of a war of conquest. From there, she summoned a Republic operative and briefed them on the situation, with Jedi Grand Master Satele Shan and Supreme Commander Jace Malcom joining in via holocall. Saresh made it clear that the priority was to liberate the people of Makeb, but also stressed that the Cartel's ambitions had to be ended permanently."}, {"tag": "p", "text": "Saresh was later disappointed to learn that Makeb was doomed to destruction due to the Hutts' careless mining of the planet's core, causing massive groundquakes. After a Republic operative managed to save millions of refugees aboard a massive ark, the Supreme Chancellor confronted Makeb's de facto Chief of State, Shalim Avesta, accusing him of having known that the groundquakes were getting worse and that he used the Republic, knowing they'd be obligated to help when Makeb had nothing to give. Shalim denied her accusations."}, {"tag": "p", "text": "The Republic operative reminded everyone that they still had the issue of the refugees aboard the ark. Shalim also mentioned that they also had Cartel leaders who were willing to side against Toborro the Hutt. Saresh was none too happy to see that the Republic has a worthless ally and a broken one, but did note that these Hutts have most of the influence, wealth and power in the Cartel and asked her operative on how they should proceed. The operative suggested that the Hutts' fleet should be used to defend lightly defended planets while the Hutts help build a new colony for Makeb's refugees. The Chancellor agreed to the suggestion. She then commended her operative for giving the Republic a chance at winning the war before departing the station."}, {"tag": "p", "text": "Sometime afterwards, Saresh, along with Satele Shan and Jace Malcom, made a HoloNet broadcast to publicly announce the apparent death of the Sith Emperor, whose death was confirmed by a joint Jedi-SIS committee. But Saresh had no illusions that the Dark Council was still the major power in the Empire, and proclaimed that the Republic would emerge victorious."}, {"tag": "h3", "text": "Revanite Conspiracy"}, {"tag": "p", "text": "At a later stage of the war, Saresh learned that Satele's fleet had temporarily allied with Darth Marr against the Order of Revan. Following Revan's defeat on Yavin 4, Saresh communicated with the Grand Master, expressing her displeasure at being left in the dark. Satele pointed out that Malcom didn't share her concerns and stated that the two of them appreciated the Chancellor's trust in them. Saresh then demanded to be informed when her fleet was back in position."}, {"tag": "h3", "text": "Invasion of Ziost"}, {"tag": "p", "text": "Saresh later installed a double agent, Rane Kovach, in Sith Intelligence to feed her intel on both Sith Intelligence and the SIS. Through Kovach, Saresh learned that Theron Shan had assembled the Sixth Line, Jedi commandos working for the SIS, on an unauthorized mission to Ziost. She personally communicated with Shan to admonish him for his unilateral actions. Though Shan tried to explain the situation on Ziost, Saresh declared her intention to invade the planet to cripple the Empire and face the former Sith Emperor, Vitiate, head-on. Despite Shan's pleas, the Republic fleet had already arrived. This only made a bad situation worse, as Vitiate began possessing combatants on both sides to intensify the violence to fuel himself. Saresh was later contacted by Kovach, who had shut down the Ziost Orbital Defense Command Center, trying to warn her of the danger Vitiate posed, but she refused to hear him, ordering him to continue with his task of gathering intel on Sith Intelligence and the SIS."}, {"tag": "p", "text": "Theron later managed to convince Saresh to make a strategic retreat after Vitiate consumed all life on Ziost. In the aftermath, Saresh and Grand Master Satele put Theron on administrative leave for his unilateral actions."}, {"tag": "h3", "text": "Eternal Empire's Conquests"}, {"tag": "p", "text": "The Eternal Empire overran the Republic and Sith Empire not long afterwards. At some point, Saresh took an opportunity to remove the former Imperial Elara Dorne from Havoc Squad, though Supreme Commander Malcom stood up for her, and had her assigned to his personal staff. Even after Coruscant was blockaded, Saresh refused to discuss surrender. She was eventually overruled by the Senate and a cadre of Senators negotiated a cease-fire with the Eternal Empire. Under the treaty with Zakuul, the Republic was held under an arms limitation statute and forced to pay regular tribute to Zakuul in the form of raw material and resources. Unable to break the treaty, Saresh nonetheless arranged for those Senators' disgrace or dismissal."}, {"tag": "p", "text": "As her term as Supreme Chancellor reached its end, Saresh, desperate to hold onto power, attempted to get the Senate to extend her term indefinitely, but failed due to a extortion campaign conducted by the Shroud against the Senate. Ousted from power, Saresh, single-mindedly determined to carry on the war with the Sith Empire, arranged for a carefully-selected successor, Jebevel Madon, to be elected in her place, whom she would control from the shadows. Despite having a common enemy in the Eternal Empire, Saresh was obsessed with fighting the Sith Empire. With a wide range of supporters backing her, Saresh used her influence to sever the Senate's say in military manners, and convinced the general public that the state of emergency required executive action, which many believed was costing the Republic its soul. Her policies were protested by Admiral Bey'wan Aygo, whom she summarily discharged from the Republic military. Some time afterwards, a small group of military officers attempted to arrest Saresh for her crimes but a traitor in their group sold them out and Madon had them quietly arrested."}, {"tag": "h3", "text": "Attempted Coup"}, {"tag": "p", "text": "Following the invasion of Voss, Saresh learned that the Outlander—a veteran from the previous war who was leading a rebellion against the Eternal Empire—was meeting with Empress Acina on Dromund Kaas to discuss an alliance against Zakuul, and decided to seize the opportunity to take control of the Outlander's Alliance. Collaborating with Imperial Minister of Logistics, Gelmid Lorman, promising to allow him to seize power in the Empire, Saresh sent a group of GenoHaradan to Dromund Kaas to sabotage Acina's shuttle while she and the Outlander were in talks, and ordered them to find their targets' bodies. However, the GenoHaradan's assassination attempt failed, as the Outlander and Acina escaped before the shuttle crashed, forcing Saresh to withhold the GenoHaradan's bonus until they find the bodies to further motivate them. Just after Lorman told Theron Shan and Lana Beniko that the Outlander was presumably dead, Saresh called Dromund Kaas and expressed false sympathy for the Outlander's apparent demise, and offered to step in to fill the power vacuum and asked for the Alliance to join her. Theron immediately refused her offer, but Saresh promised that in time they will see that she is right."}, {"tag": "p", "text": "Saresh later traveled to Odessen to make her move to take control of the Alliance. Her timing seemed perfect, as some of the lower ranking Alliance members were willing to hear her out, uncertain on how the Alliance would continue without their leader. But just as she had begun her speech, the Outlander, having survived the GenoHaradan and Lorman's betrayal, confronted Saresh and put an end to her attempted coup. Saresh refused to apologize for her actions, stating that she saw an opportunity and took it, and that she deserved to lead the Alliance. She assumed that she would be executed, stating that it's what she and Vaylin would do. Her fate was decided by the Outlander."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Saresh was a charismatic and firm individual. While managing the Taris reconstruction she promoted cooperation and perseverance, though she would also be harsh to those who didn't follow her plans. When she was elected Supreme Chancellor, she promised not peace, but victory over the Empire. However, her hatred for the Empire led her to be a warmonger who refused anything less than total victory over it, all the while hiding her megalomania behind a facade of patriotism. This was shown when she sent an invasion force to Ziost and ignored the warnings about the Sith Emperor's presence which jeopardized the lives of the invasion force's members. She also displayed a tyrannical side after the Eternal Empire invaded by ruining or dismissing anyone who disagreed with her. In the end, she showed herself to be an unrepentant, power hungry manipulator by attempting to murder the Outlander to seize control of their Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Leontyne Saresh is a character in the 2011 video game Star Wars: The Old Republic and following expansions: Rise of the Hutt Cartel, Shadow of Revan and Knights of the Eternal Throne. She is voiced by Julianne Grossman."}, {"tag": "h3", "text": "Gameplay alternatives"}, {"tag": "p", "text": "In Knights of the Eternal Throne Chapter II: Run in the Shadows, the player has the option of either sending Saresh to prison (light side choice) or executing her on the spot (dark side choice) for her attempt to take control of the Alliance; for additional dark side points, the player also has the option to punch Saresh before passing sentence. Whether Saresh lives or dies, the player will receive an in-game mail from Supreme Chancellor Madon, saying that while the actions (imprisonment or killing) will be publicly condemned, privately the Chancellor is grateful to be rid of her."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}