{"url": "Lequabis_system", "categories": ["Category:Legends articles", "Category:Expansion Region star systems", "Category:Freestanding subsectors star systems"], "nodes": [{"tag": "h1", "text": "Lequabis system"}, {"tag": "p", "text": "The Lequabis system was an Expansion Region star system. Following the Imperial occupation of Cloud City on the planet Bespin in 3 ABY, the Rebel Alliance was forced to search for other sources of the important Tibanna gas. Alliance Captain Eedan therefore tasked a group of Rebel agents with surveying gas giant planets in several star systems. The exploration of the Lequabis system eventually proved fruitless, and the Rebel scouts continued with their search in the Poviduze system."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Lequabis system was a remote star system located in the Freestanding subsectors portion of the Expansion Region. The system contained at least one gas giant–type planet."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly after the Galactic Empire occupied the Cloud City settlement on the Outer Rim Territories planet Bespin in 3 ABY, the Rebel Alliance, which until then had been acquiring Tibanna gas from Cloud City for use with blaster and laser weaponry, was forced to seek other sources of Tibanna. To that end, Captain Eedan of the Alliance's Ordnance and Supply section tasked a group of Rebel agents with surveying gas giants in several Inner Rim and Expansion Region systems for any deposits of Tibanna."}, {"tag": "p", "text": "The group explored the Lequabis system in its modified YT-700 Transport, the Jackpot, but found no usable Tibanna deposits there. The Rebel scouts then continued with the search in the Expansion Region's Poviduze system."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lequabis system was first mentioned in \"Wind Raiders of Taloraan,\" an article published in the February 1995 fifth issue of the Star Wars Adventure Journal. The article was written by James L. Cambias and contained a roleplaying game adventure for use with West End Games' Star Wars: The Roleplaying Game. The 2009 reference book The Essential Atlas, written by Daniel Wallace and Jason Fry, placed the star system within grid square I-14."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}