{"url": "Lepi/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Lepi", "Category:Mammalian sentient species", "Category:Mid Rim species"], "nodes": [{"tag": "h1", "text": "Lepi"}, {"tag": "p", "text": "The Lepus carnivorus, more commonly known as Lepi, were a species of sentient rabbit, ranging in color from green to dark blue. Their most distinctive features were long ears and feet and buck teeth. Native to the planet Coachelle Prime, their high reproductive rate forced them to colonize the entire star system to avoid overcrowding. The Lepus carnivorus were typically gregarious individuals, although prone to bursts of anger if their family or species was insulted. Lepi were constantly in motion and were known for their speed."}, {"tag": "p", "text": "The most famous Lepus carnivorus was the smuggler Jaxxon, best known for his part in defending a village on Aduba-3, alongside New Republic hero Han Solo. Along with six others, they repelled the superior forces of the Cloud-Riders. Other notable Lepi included the criminal Grubbat Fhilch, executed by Jabba the Hutt, and the Tatooine colonist Heff, killed by Jodo Kast."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Lepus carnivorus were sentient bipedal lagomorphs with large ears and feet. They had lanky frames, with males averaging 1.9 meters in height, while the smaller females averaged 1.6 meters. The strong legs of the Lepi were capable of great speeds as well as delivering powerful kicks, often used in fights to bludgeon their opponents. Lepi were covered in short fur that ranged in color from green to dark blue to white. Lepi also had tails, although these differed in length from stubby to quite long."}, {"tag": "p", "text": "The Lepus carnivorus had large eyes—likely adapted for dark warrens—which gave them sharp vision. That occasionally led to the misconception that Lepi consumed space carrots, which were known to improve eyesight. However, most Lepi preferred various forms of meat, such as hambones. Some Lepi even claimed to be carnivorous. A number of long whiskers grew from their short snouts. Long incisors, occasionally referred to as \"buck teeth,\" jutted from their jaws, useful in their omnivorous diets. The long ears of the Lepi were very sensitive and occasionally colored in different shades, such as pink fur."}, {"tag": "p", "text": "The Lepus carnivorus had a very high metabolism such that they were virtually always in motion, giving them an appearance of flightiness. That skittishness was also influenced by their evolution from high-strung herbivores; their \"fight-or-flight\" instinct very much favored flight."}, {"tag": "p", "text": "Lepus carnivorus sexually matured around age ten, when they were considered young adults. Females gave birth in prodigious numbers; mothers often had up to three dozen offspring in their lifespan. Lepi reached old age around sixty to seventy-four, after which they were considered venerable."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Lepus carnivorus society revolved around the vast warrens they built under the surface of their planets. Larger families lived in their own smaller burrows. Lepi were fiercely loyal and proud of their families. They were quick to anger and prone to violence, especially in reaction to insults to their family or species. Their awkward appearance subjected them to mockery. However, as a whole, Lepi were typically a gregarious species, quick witted with a strong sense of humor."}, {"tag": "p", "text": "The Lepi were often curious and impulsive, leading many to seek out adventure far from their homeworlds. That also stemmed from a desire to rise above the insults they often received. It was common among Lepi to find a determination to achieve great deeds not only for personal fame, but also to redeem their species in the eyes of the galaxy."}, {"tag": "p", "text": "The native language, both written and oral, of the Lepi was Lepese, or Lepp. However, that quickly became secondary to Basic as the language of preference. Non-Lepi, such as Seeqov Thranx, a Vratix research scientist, were capable of learning the language. Lepi were prone to wild gesticulations when talking amongst themselves."}, {"tag": "p", "text": "Lepi names were typically one word, with examples including Augdon, Gagen, Javilla, Lupher, Maximort, Nevlin, Roonis, Saper, Zylo, and Trixx."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lepus carnivorus evolved on the planet Coachelle Prime, located in the Terr'skiar sector of the Mid Rim. The world was shrouded by streamers of gas from the Thornhedge Nebula, and formed part of a constellation known on Oseon 6845 as the Silly Rabbit. Due to their high reproductive rate, they soon filled their world to capacity and were driven to develop stardrives in order to avoid overcrowding. They swiftly colonized all five planets in the Coachelle system, along with its asteroid belt. That seemingly provided enough room for their species, although some Lepi were involved in other colonization efforts such as on the planet Tatooine, and they were part of the wider galaxy by as early as the year 3964 BBY. The many colony ships used in these endeavors were later left largely intact and poorly guarded, susceptible to theft by enterprising Lepi, such as Jaxxon."}, {"tag": "p", "text": "Coachelle became a minor trade world, located at the end of the Ootmian Pabol hyperlane, and connected to Terr'skiar, the sector capital. The droid-manufacturing company Coachelle Automata shared its name with the Lepi homeworld. The company produced the LEP servant droid, which was in common use during the Clone Wars. That droid model had distinctive \"ears,\" reminiscent of the Lepi species."}, {"tag": "h2", "text": "Lepi in the galaxy"}, {"tag": "p", "text": "The Coachelle system had long provided sufficient living space for the whole of Lepus carnivorus civilization. Despite that, Lepi were known offworld both by reputation and via their presence there. For instance, during the Cold War between the Galactic Republic and the Sith Empire, a dance known as the Lepi Hop was known throughout the galaxy. Further, a number of Lepi personally ventured beyond their star system into the galaxy at large. They tended to stick to the fringe as scouts and tech specialists, while some of the more aggressive became soldiers. Some Lepi were known to have the capacity to become Jedi Knights, although none were known to have achieved that feat. One Lepi to leave the Coachelle system was Heff, who was part of colonization efforts of the planet Tatooine during the early period of the Galactic Empire. Heff established a gift shop called Heff's Souvenirs in the city Mos Eisley and lived to be one of the last three surviving members of the colony. He had at least one daughter, Tebbi. However, Heff was killed in 0 ABY by the bounty hunter Jodo Kast, who was hunting the Rebel Adar Tallon. Heff's daughter later sold the shop to the Sullustan Moplin Jarron."}, {"tag": "p", "text": "A less upright Lepi citizen was Grubbat Fhilch. He embezzled credits from the podracing operation of Jabba the Hutt. He was subsequently tracked down to his home warren by the bounty hunter Boba Fett, who handed him over to the crime lord. Jabba had him thrown into a sarlacc pit as retribution. Fhilch was notable for possessing a long tail."}, {"tag": "p", "text": "Perhaps the most famous Lepus carnivorus was Jaxxon, who featured in the Tri-Nebula Entertainment holodocumentary \"Eight for Aduba-3: The Saga of the Starhoppers.\" Originally raised on Coachelle Prime in a family of twelve siblings, he had a checkered past before his involvement in those events. After a youth spent in juvenile centers, Jax stole a freighter and ventured out to the Outer Rim Territories. He lived on Nar Shaddaa for a time before joining a mercenary group in the Corus system. After the group was double-crossed in the Corporate Sector, he purchased a WUD-500 star yacht which he called the Rabbit's Foot. The dysfunctional ship forced him to land on Aduba-3, where he would make his claim to fame. While there, he answered a call from Han Solo for warriors to protect the village of Onacra against local brigands. The con man Dozer Creed observed a group of Lepi engrossed in conversation on the planet Wukkar in 0 ABY."}, {"tag": "p", "text": "Solo assembled a group of six mercenaries for the task, in addition to himself and his Wookiee copilot Chewbacca. Wielding twin heavy blaster pistols, Jaxxon and his companions fought strongly against Serji-X Arrogantus and his Cloud-Riders, finally repelling them with the aid of the Behemoth from the World Below which was summoned by a local shaman. With his reward credits, the green Lepi was able to leave Aduba-3, having teamed up with the Human woman Amaiza Foxtrain."}, {"tag": "p", "text": "The ramifications of the Aduba event did not finish there for Jaxxon, however, as he was soon attacked by the bounty hunters Remel Fud and Dafi, under orders of Beilert Valance. He was seeking one Jimm Doshun from Aduba-3, erroneously believing him to be Luke Skywalker. Jax was tortured, but showing typical Lepi resilience, gave up little information to the hunters. However, when they later inadvertently revealed the location of Jimm, the Lepi returned to Aduba to fight off the hunters."}, {"tag": "p", "text": "Later, in 137 ABY, a Lepi named Gusha owned Gusha's Luck, a cantina on Tatooine. It was frequented by another Lepi, along with the former Jedi Padawan-turned-smuggler Cade Skywalker."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lepi first appeared in Star Wars 8 published in February 1978, featuring Jaxxon as one of the Aduba 8. This was the first Marvel Comics story arc after the adaptation of Star Wars: Episode IV A New Hope. The species was created by writer Roy Thomas in homage to Bugs Bunny, who often addressed strangers with the generic nickname \"Jackson\" in his 1940s cartoons. He also bore a striking resemblance to two other characters: the cartoon character Bucky O'Hare, who debuted shortly after the Marvel run, and Jazz Jackrabbit, a platform computer game character. Jaxxon called himself a \"Lepus carnivorus\": Lepus carnivorus is Latin for \"carnivorous rabbit,\" and the species name would later be shortened to Lepi, the Latin plural. Star Wars 16 misspelled the scientific name of Jaxxon's species as \"Lepus carnivorous.\""}, {"tag": "p", "text": "After his appearance in the Marvel story arc, Jaxxon was largely ignored in later Expanded Universe publications. He was brought out of limbo in the Star Wars Gamer article The Starhoppers of Aduba-3 by Pablo Hidalgo—with Cory J. Herndon and Michael Mikaelian—published March 1, 2001. This article gave a bio for Jaxxon as well as providing information on the species in general. Hidalgo drew inspiration from Bugs Bunny in his choice of the Coachelle system as their star system. In the 1953 short \"Bully for Bugs,\" Bugs asks, \"Excuse me, can you direct me to the Coachella Valley and the Giant Carrot Festival… therein?\" Hidalgo carefully mirrored this sentence, also ending his in \"therein.\""}, {"tag": "p", "text": "Through providing example names for Lepi, the Starhoppers article retconned several rabbit-like individuals as Lepus carnivorus. These included Heff—and by proxy, Tebbi—from Tatooine Manhunt (June 1988) and Grubbat Fhilch from the  Star Wars Tales comic \"Fortune, Fate, and the Natural History of the Sarlacc\" (December 20, 2000). It also gave \"Trixx\" as a common Lepi name. This is a reference to the cereal Trix, whose advertisements feature a rabbit who tries to trick kids into giving him the fruit-flavored food before being told, \"Silly rabbit, Trix are for kids.\" The name was not in Hidalgo's original submission, but was changed in editing. The Silly Rabbit constellation is also a reference to these Trix ads."}, {"tag": "p", "text": "The Lepi were also featured in the Ultimate Alien Anthology (April 19, 2003), which provided further example Lepi names. Among these was Maximort, which suggests a connection with the rabbit-like character Max, previously canonized by Abel G. Peña in The Dark Forces Saga (April 7, 2005). Max appeared as an unlockable cameo in Star Wars: Jedi Knight: Dark Forces II (October 9, 1997)."}, {"tag": "p", "text": "Since this time, Lepi have appeared in a couple of other sources. Jaxxon made it into July 2005's Star Wars Insider 83, in the 20 Most Memorable Moments of the Expanded Universe, where he was cited as one of the five goofiest moments."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}