{"url": "Leritor/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems planets", "Category:Galactic Republic planets", "Category:Sith planets", "Category:Terrestrial planets", "Category:Yucrales sector planets"], "nodes": [{"tag": "h1", "text": "Leritor"}, {"tag": "p", "text": "Leritor was a mineral-rich Mid Rim planet of rolling plains and oceans. The native Sauvax engaged in aquaculture; Human colonists mined the minerals. Amid a brewing war between the colonists and the Sauvax, Profex Rynalla attempted to excavate a Sith artifact buried within the planet's mountainous Bleaks."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Leritor was a world in the Mid Rim, near both the Bothan sector and the Corellian Run."}, {"tag": "p", "text": "Leritor had abundance of metals and its inland plains were fertile for farming, but beyond that it had minimal importance when considered in a galactic level. By the end of the Galactic Republic, the planetary natural resources had not been exploited by important galaxy-wide conglomerates."}, {"tag": "p", "text": "The surface of the world was covered by oceans in its major part. In land, the temperatures commonly approached 80ºF, which helped the inland plains become fruitful. The mountain ranges were almost uninterruptedly covered by rains, with the water falling from the summits in form of rivers, nurturing the soil in the plains before reaching the oceans."}, {"tag": "p", "text": "The only sentient species evolved in the planet, the amphibious Sauvax, inhabited the coastal region fishing in the continental shelves. The Sauvax diet also included sea brackens, sea urchins, anemones, and crustaceans. The fauna of Leritor also included big birds that inhabited the mountain summits."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Great Sith War, the Krath came from Manda and conquered the planet, from which they moved to Ando. After a first Republic victory, Leritor was eventually invaded by the Sith during the Galactic War."}, {"tag": "p", "text": "A Sith starship once crash landed on Leritor, specifically in the mountain range known as the Bleaks. The ship was badly damaged and partially buried, but some of its occupants survived the crash and used the dark side of the Force to threaten the native Sauvax. Eventually, the Sith were unable to thrive in Leritor, and disappeared. The wreck of the ship remained, holding an abandoned Sith treasure that increased the power of the dark side of the wielder. Although the galaxy forgot about the ship, a trail leading to Leritor remained in the archives of the University of Sanbra."}, {"tag": "p", "text": "Centuries later, a group of Humans from the Core Worlds, unhappy with the region they were living in, decided to settle in a more primitive planet and live as farmers. Their survey team scouted Leritor and found the lush plains, appropriate for the activity they had in mind. They also found the native Sauvax. As the colonists wanted a bloodless harmony with any other sentients, the survey team and the main Sauvax tribe (or kuuvan) signed the Settlement Pact. Following this Treaty, the Humans could farm the interior prairies as intended, but they could not be within 100 kilometers of the coastline, which would be considered Sauvax territory. The Sauvax, however, could go freely through the Human-inhabited steppes if they wanted to contact Humans for commerce or cultural exchange — something that they did. As the Humans were satisfied with this treaty, they took care to not break it."}, {"tag": "p", "text": "The Humans settled down and brought their combine-reapers: Massive tracked vehicles that were used to grow and harvest their crops, and even to live inside of them. The colonists divided the land among them and farmed each their own territory, returning later to collect the mature crops. Freighters were called to export the annual production; each combine-reaper included its own landing area in its upper part. As the machines were long-ranged, the Humans became mostly organized nomads. A capital city was nevertheless built, mostly an expanding depot that every combine-reaper visited annually to get supplies and be repaired if needed. This place was in the center of the main continent."}, {"tag": "p", "text": "Leritor was later visited by Profex Rynalla, a dark side scholar and adept who wanted to recover the missing Sith artifact, the Bracers of Najus. Rynalla, using her ships and two dozens of Klatooinian soldiers, intended to kidnap locals and force them to dig the starship. Noticing the two distinct groups in Leritor, Rynalla decided to attack a Sauvax settlement, kidnap some Sauvax, and misdirect the other settlements making them believe that the farmers had done this. Similarly, Rynalla attacked one combine-reaper, the Nellist, captured the more abled farmers, killed the others and leave false proof pointing the Sauvax. She established a camp in the Bleaks, around the ruined Sith starship, and her excavation eventually found the Bracers. However, some meddlesome offworlders discovered Rynalla's plot and defeated her."}, {"tag": "p", "text": "During the Clone Wars, Leritor was located within Separatist space."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the extragalactic invaders conquered Leritor."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Leritor was inhabited by the Sauvax, an amphibious sentient species that built elementary villages near the coastal line. Each village, or kuuvan in Sauvax, was inhabited by a single Sauvax tribe, also known as kuuvan. They used little technology, preferring simple tools such as their multi-purpose gruush spear."}, {"tag": "p", "text": "The inner plains, more than 100 kilometers from the coast, were inhabited by Human farmers that roamed in their combine-reapers. The farmers had little contact with the Sauvax, apparently not enough to learn their language."}, {"tag": "p", "text": "A group of twenty-three Klatooinians once inhabited the planet Leritor in secret."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "The coastal area of Leritor, near the oceans, was spotted with several permanent Sauvax settlements or kuuvans. The kuuvans were built in tidal pools, oceanfronts and precipices. They were composed by harsh stone-made dwelling buildings and commonly other non-residential structures, such as meeting areas, food storage pools and drying racks."}, {"tag": "p", "text": "The inland area of the continent included the cultivation area for the combine-reapers. As the harvesters themselves were mobile dwellings, they commonly visited their crops but not remained there. The Humans had a storage area in the center of the continent, used for political and pragmatic purposes, which was the only permanent Human settlement of the planet."}, {"tag": "p", "text": "The mountain range known as the Bleaks was rarely inhabited. It was commonly scourged by non-stop rains, and only the local birds appeared to live there. The chain was the place where the Sith starship had crashed centuries before the time of the Galactic Empire. As such, Profex Rynalla camped there, building her main headquarters around the wrecked vehicle. She also build another smaller camp near the edge of the mountains, where two of her minions would stop any escaped prisoner."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}