{"url": "Lesim", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Imperial Army officers of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lesim"}, {"tag": "p", "text": "Lesim was an Imperial Army major during the Galactic Civil War. Stationed aboard an All Terrain Armored Transport that was patrolling the Forest Moon of Endor in 4 ABY, Lesim encountered Rebel Alliance Commander Luke Skywalker, who surrendered himself to the major and his stormtroopers with the request to be delivered to the Dark Lord Darth Vader on the moon. Believing he would earn a promotion to general for capturing the famous Rebel, Lesim hoped to have a hologram taken with Skywalker before bringing him to Vader."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lesim served as an officer with the Galactic Empire during the Galactic Civil War against the Alliance to Restore the Republic. He attained the rank of major in the Imperial Army by 4 ABY. That year, during the early stages of the Battle of Endor, Lesim was stationed in command of a group of stormtroopers aboard an All Terrain Armored Transport walker that was patrolling the Endor moon. Lesim's stormtroopers were approached by Rebel Alliance Commander Luke Skywalker, who willingly turned himself in with the intention of being delivered to the Dark Lord of the Sith Darth Vader while on the moon. Skywalker used a mind trick with the Force to persuade the troopers to deliver him to their commanding officer, and the Imperial soldiers escorted the Rebel to Lesim via the walker's transport section, with his confiscated lightsaber presented to the major."}, {"tag": "p", "text": "Peering at his captive intently for several moments, Lesim announced that he recognized Skywalker's face from Imperial Intelligence files and believed that he would be promoted to general for capturing the famous Rebel. He ordered one of his men, Arno, to bring him his imager so that he and Skywalker could have a hologram taken with each other. Lesim complied with Skywalker's Force-persuasion to bring him to Vader, but the major still requested to have the hologram taken with his prisoner first. Ultimately, another Imperial officer, Commander Igar, personally delivered Skywalker to Darth Vader on Endor. The story of Skywalker's capture on Endor was later compiled by Alliance historian Voren Na'al from reports that Na'al gleaned from both Skywalker and captured Imperial troops after the Battle of Endor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lesim was created for the short story The Capture of Luke Skywalker, published as part of the 1990 West End Games sourcebook Galaxy Guide 5: Return of the Jedi and written by Michael Stern."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}