{"url": "Arbitrator", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Executor-class Star Dreadnoughts of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Arbitrator"}, {"tag": "p", "text": "The Arbitrator was an Executor-class Star Dreadnought in the Imperial Navy. Around the time of the Galactic Civil War, the command ship was considered to be one of the Empire's most critical Super Star Destroyers. In the aftermath of the Battle of Endor, the Arbitrator was pursued by several New Republic ships. Attempting to escape them, the dreadnought jumped to erroneous hyperspace coordinates, which resulted in the destruction of the vessel after it was pulled into a black hole."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "As an Executor-class Star Dreadnought, the Arbitrator measured 19,000 meters long and was armed with 5,000 turbolasers. It was also equipped with engines and a hyperdrive. The ship transmitted tracking data to the Hall of Imperial Register on the Imperial planet Coruscant, allowing for a black box recording of information so it could be discerned what occurred before the ship was destroyed, captured, or surrendered."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The command ship Arbitrator was mentioned in The Rebel Files, a compilation of information, reports, and accounts belonging to the Rebel Alliance, between 0 BBY and 3 ABY, around the time of the Galactic Civil War. It was mentioned in a list compiled by Alliance Admiral Ackbar regarding the Imperial Navy's most critical Executor-class Star Dreadnoughts, both those in service and those under construction. Before the Battle of Endor in 4 ABY, the Arbitrator was one of the Empire's thirteen Super Star Destroyers, a title given to several classes of Imperial capital ships. After the battle, which saw the Alliance defeat the Empire after the Emperor and the second Death Star were destroyed, the Empire fractured, and the Rebel Alliance transitioned into the New Republic."}, {"tag": "p", "text": "Sometime after the battle, between 4 ABY and 5 ABY, the Arbitrator was pursued by forces of the New Republic's fleet. In an attempt to escape, the ship made an erroneous hyperspace calculation, causing it to be evaporated after it was sucked into a black hole. In 5 ABY, after the vessel's destruction, Imperial Grand Admiral Rae Sloane of the Executor-class Ravager visited Coruscant to research Gallius Rax, her mysterious superior. While at the Hall of Imperial Register, Sloane discovered that eleven of the thirteen dreadnoughts originally in the Empire's service, including the Arbitrator, had been destroyed, captured or surrendered, with the only two remaining being the Ravager and the Eclipse."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Arbitrator was first mentioned in the 2016 novel Aftermath: Life Debt, the second entry in the Star Wars: The Aftermath Trilogy, written by Chuck Wendig."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}