{"url": "Lettow/Legends", "categories": ["Category:Legends articles", "Category:Core Worlds planets", "Category:Locations of Force-based groups"], "nodes": [{"tag": "h1", "text": "Lettow"}, {"tag": "p", "text": "Lettow was a planet in the Lettow system of the Core Worlds, just on the border of the Deep Core. Early in the Galactic Republic's history, the planet served as the headquarters of the Dark Jedi of the Legions of Lettow, though the First Great Schism between the Legions and the Jedi Order ended in a final battle on Lettow."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lettow was a terrestrial planet in the Lettow system of the Core Worlds, located on the very western edge of the Deep Core. The Dark Jedi Xendor established an academy on Lettow's surface."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Lettow was discovered by the greater galaxy sometime between 25,000 BBY and 24,500 BBY. In 24,500 BBY, Xendor sought permission from the Jedi Order to establish an academy where he and other Jedi could study other Force traditions. When they denied his request, Xendor left the Order with his lover, Arden Lyn, and a number of other Jedi and built his academy anyway on Lettow. Turning to the dark side of the Force, Xendor began to attract more and more followers to Lettow, and his followers started calling themselves the Legions of Lettow. However, war soon broke out between the Legions and the Jedi, sparking the First Great Schism. Xendor was slain in battle on Columus, and the Jedi Awdrysta Pina led the Jedi in a final assault against the remaining Legionnaires under Arden Lyn on Lettow. Pina's forces defeated the last of the Legions, though Lyn fled the planet and was pursued by Pina."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lettow and the Legions of Lettow have been mentioned in a number of reference guides and sources dealing with galactic history and the history of both the Jedi and Sith."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}