{"url": "Level_1782", "categories": ["Category:Canon articles", "Category:Coruscant levels", "Category:Coruscant underworld locations", "Category:Junkyards"], "nodes": [{"tag": "h1", "text": "Level 1782"}, {"tag": "p", "text": "Level 1782 was a level of the planet Coruscant which consisted of one gigantic junk yard. During the reign of the Galactic Empire, a camp was set up among the scrap by fugitives hiding from the Empire. The Alderaanian siblings Anandra Milon and Santigo Milon were reunited on Level 1782."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Level 1782 was a level of the city-planet Coruscant. The level consisted of one large junkyard walled with scrap metal and full of broken airspeeders, hovertrains and billboards that had been dumped there, or fallen from the higher levels. Rats could frequently be found running through the towers of debris in Level 1782, but during the reign of the Galactic Empire a group of sentients also made a home of the junkyard. A camp was set up in the hull of an old starship amongst the junk, by fugitives from a dozen species that had been persecuted by the Empire, including Mon Calamari, Herglic and near-humans. The camp consisted of various makeshift dwellings and stalls, and could be reached by climbing a mountain of old hovertrain parts."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Shortly after the destruction of the planet Alderaan, the fugitives Anandra Milon and her younger brother Santigo Milon were directed to Level 1782 by a Herglic criminal. The pair came seeking shelter, as they were originally from Alderaan and so now wanted by the Empire. After nearly an hour of searching, the pair came across a Mon Calamari, who Anandra at first tried to rob. Santigo then spoke to the creature, who, recognizing them as fellow fugitives, led them back to the camp for shelter. The pair were welcomed by the camp-dwellers, and joined them in hiding in the relative safety of the scrap yard."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Level 1782 first appeared in One Thousand Levels Down, a short story written by Alexander Freed and published in Star Wars Insider 151 in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}