{"url": "Level_3204", "categories": ["Category:Canon articles", "Category:Coruscant levels", "Category:Coruscant underworld locations"], "nodes": [{"tag": "h1", "text": "Level 3204"}, {"tag": "p", "text": "Level 3204 was a level of the city-planet Coruscant. It was mostly occupied by residents originally from the planet Alderaan, but after the planet's destruction by the Galactic Empire most of the occupants rioted before being arrested by Imperial Stormtroopers. Anandra Milon and her little brother Santigo Milon were two residents of Level 3204 who managed to escape the arrests."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Level 3204 was a level of the city-planet Coruscant which included streets of apartments, parks and community centers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the reign of the Galactic Empire, Level 3204 was inhabited by a large number of individuals from the planet Alderaan. As such the occupants of level celebrated the Alderaanian festival of Coronation Day and imported fruits from their homeworld. When Alderaan was destroyed by the Empire, the residents of Level 3204 began holding vigils for those lost, gathering in their hundreds in parks and community centers where they set up memorials containing handwritten letters, childrens' toys, and holocam images of the dead. As more information became available from official statements and pirate news feeds about Alderaan's fate, the vigils turned to riots and Imperial stormtroopers were called in."}, {"tag": "p", "text": "At first the Stormtroopers simply broke up the riots, Killing some protestors such as the resident named Reffe, who at the time was ranting about Imperial corruption. The following day however, the trooper returned and begun arresting individuals in the streets. The day after that they begun going door to door to make arrests. Two Level 3204 residents who escaped the arrests were Anandra Milon and her little brother Santigo Milon, who hid in the bucket of a cleaning droid that normally cleaned their windows on a weekly basis. Their mother remained in their apartment on Level 3204 though and opened the door for the troopers. Other residents of Level 3204 at this time were Anandra Milon's uncle, who had lived next door to Reffe, and a droid mechanic who owned an apartment next door to the Milon family's."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Level 3204 was first mentioned in \"One Thousand Levels Down,\" a short story written by Alexander Freed and published in Star Wars Insider 151 in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}