{"url": "Level_One_Starfighter_Qualification_Test", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic"], "nodes": [{"tag": "h1", "text": "Level One Starfighter Qualification Test"}, {"tag": "p", "text": "The Level One Starfighter Qualification Test was an assessment given by the Alliance to Restore the Republic to hopeful pilots. The test took the form of two simulated missions under the guidance of a superior officer acting as an instructor. In order to qualify for active combat duty as a Rebel starfighter pilot, prospects had to complete all stated mission objectives."}, {"tag": "h3", "text": "Deep Space Strike Evaluation"}, {"tag": "p", "text": "For the first portion of the test, prospects would fly a Y-wing starfighter designated Rookie One in a series of mock deep space strike missions based on previous Rebel raids. Part one of the strike evaluation requires a pilot to completely destroy all storage containers at an Imperial tibanna processing facility. While the facility was largely defenseless, the attack would provoke a visit from local Imperial patrols. After the destruction of the containers, pilots would fly to the second target area to begin the next assault."}, {"tag": "p", "text": "In target area two, pilots were charged with the destruction of the Carrack-class light cruiser Sodrab undergoing repairs at the Damorian Repair Yard near Draik 4. The facility was protected by a number of static weapons emplacements and was near enough to an Imperial base that reinforcements were never more than a few minutes away. The purpose of this exercise was to teach pilots how to attack a target from long-range using warheads (proton torpedos in this instance). Furthermore, pilots were taught that \"dumb-firing\" warheads (that is, firing a warhead without targeting the enemy and acquiring a target lock first) can be an effective strategy for avoiding point-defense weapons."}, {"tag": "p", "text": "In the final target area, prospective starfighter pilots were to engage an Imperial convoy passing near Cirtappa. The convoy had only a light escort consisting of a Lancer-class frigate and a few assault shuttles. While their instructor provided cover, pilots were expected to destroy at least one quarter of the convoy vessels before they entered hyperspace. If the mission objectives could be met, pilots would then move on to the second stage of the test."}, {"tag": "h3", "text": "Starfighter Superiority Evaluation"}, {"tag": "p", "text": "In the first target area of the Starfighter Superiority Evaluation, pilots would be pitted against TIE Fighters in a series of mock dogfights while their instructor observed. Upon completion of the solo component of the evaluation, pilots would join up with their instructors to form a two-man flight element and square off against TIE Interceptors. While the solo dogfighting tested the pilots' skills in one-vs-one, one-vs-two, and one-vs-many scenarios, the two-man element tested a pilot's ability to work well with a wingmate. Rookie pilots employed basic strategies like flanking to outmaneuver their opponents with their instructor's assistance."}, {"tag": "p", "text": "In target area three, the pilot's element was joined by another rookie's element to form a four-man flight group. In this exercise, a pilot learned how to best function in a four-man flight while facing equal, then greater numbers of TIE Interceptors. Finally, three flights would come together to form a full squadron. The superiority evaluation culminates in a furball between Imperial fighters and bombers and the Rebel rookie squadron. Capital ship support for the Empire and Alliance came in the form of the Victory Star Destroyer Marut and the MC80 Cruiser Defiance, respectively. If the rookies could force the Marut Task Force to withdraw they would successfully complete the Starfighter Superiority Evaluation."}, {"tag": "h2", "text": "Appearances"}]}