{"url": "Leviathan_Submersible_Carrier", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic vehicles", "Category:Aquatic vehicles", "Category:Tirsa Wargear products"], "nodes": [{"tag": "h1", "text": "Leviathan Submersible Carrier"}, {"tag": "p", "text": "The Leviathan Submersible Carrier, produced in the years before the rise of the Rebellion, was found in many private armies around the galaxy. It was a large underwater vehicle manufactured by Tirsa Wargear. Originally designed to carry combat airspeeders, the Leviathan was later upgraded to serve as a mobile starfighter base. These craft were two hundred meters in length and were similar in shape to large, aquatic mammals. A command pod and three laser cannons were the only protrusions from the ship's flat top deck. The Leviathan's single landing bay was usually covered by large blast doors."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "It was developed as a sea-going base of fighter operation, thus being immune to hit and run raids. It could also travel underwater."}, {"tag": "p", "text": "The hull was originally designed to carry airspeeders which were often used in ground battles, but it became the custom to upgrade leviathans into being able to carrying starfighters instead, and could carry one squadron, as well as repair and maintenance facilities. The carriers had a top speed of 60 kph. The craft had a crew of 110 and 6 gunners; provisions were also included for 30 additional passengers and up to 7,500 metric tons of cargo."}, {"tag": "p", "text": "Hidden beneath the water and always on the move, Leviathans were difficult targets for the enemy. However, because they had no shields and little weaponry, they were extremely vulnerable if detected. Although they usually hid deep underwater, Leviathans had to surface in order to launch their fighters, or at least come close to the surface to scan for targets in orbit. Against spaceborne enemies, the Leviathan often deployed small sensor buoys which floated to the surface of the water. These sensor buoys would scan for enemies in space, storing their data until a time when the Leviathan could safely surface and collect them."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Leviathans were a primary component of the Carigan defense, and their sale was eventually banned by the Empire. However, this was not before the Rebel Alliance, and a number of planetary defense forces and private militaries, had acquired these carriers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}