{"url": "Leviathan_(creature)", "categories": ["Category:Legends articles", "Category:Biological superweapons", "Category:Carnivorous creatures", "Category:Desert creatures", "Category:Reptiles", "Category:Semi-sentient species", "Category:Sithspawn", "Category:Subterranean creatures"], "nodes": [{"tag": "h1", "text": "Leviathan  (creature)"}, {"tag": "p", "text": "The Leviathans were an ancient species of bioengineered serpentine creatures created by fallen Dark Jedi during the Hundred-Year Darkness. Some sources speculated that they may have been created by Karness Muur; however, Sorzus Syn took credit for their creation in her chronicle."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Leviathans were large, carnivorous reptiles, created to roam the battlefields as living superweapons and draw the life energies of enemy soldiers into blister traps that dotted their wide backs. They were hatched from eggs, and young Leviathans appeared serpentine with no limbs, eyes, or even the species' signature blister traps. Despite this, Leviathans were aggressive towards other living organisms even at this stage of their lives. As adults, Leviathans developed into large bipedal creatures with four smaller forelimbs and two tentacles around the jaws. The hide of an adult Leviathan was incredibly tough, and enabled them to even travel through lava unscathed."}, {"tag": "p", "text": "During their adult stage, Leviathans also developed several blister traps used to store the life energies of their prey. When they killed a being, they absorbed all of the victim's life force and knowledge. Even if a being was freed from the creature's blister traps, the victim was rapidly aged and weakened. Adult Leviathan could also interfere with the Sense abilities of Force-sensitives, causing the victim to hear screams, develop headaches and trigger obsessive behavior centered around making the pain stop. Adult Leviathans had long tentacles surrounding a gaping maw filled with rows of long teeth, two sets of eyes—one atop the other—and four nostrils in a similar arrangement. Leviathans were capable of projecting fire, which helped engender their fearsome reputation. While those Leviathans on Corbos had purple skin, their offshoots on Kesh had a bluish-green hue to their skin."}, {"tag": "p", "text": "Leviathans as a species were capable of hibernating for millennia but could be awakened when prey was around. Leviathans could be slain through sustained lightsaber strikes. While their large size gave them an advantage over most other lifeforms in close-quarter scenarios, Leviathans could also be destroyed by concentrated fire from turbolaser cannons and even Force lightning. As with many other sentient and non-sentient lifeforms, Leviathans could also be electrocuted."}, {"tag": "h2", "text": "Behavior and intelligence"}, {"tag": "p", "text": "Despite its massive girth, the Leviathan had incredible speed and was capable of outrunning its prey. The Leviathan was also equipped with a series of blister traps on its back, which it used to drain the life energies of its prey. The beast actively hunted its prey, and when it had trapped them within its tendrils, the blister traps resonated with a bright blue aura as it began to drain the life energy and knowledge of its prey. The Leviathan hunted a diverse range of species including Humans, Rodians, Keshiri, S'kytri and even non-sapient creatures like uvaks. After digesting the life essences of their prey, the Leviathans also absorbed their knowledge and intelligence, which could be accessed by whoever controlled them. Should the beast be directly attacked by other beings, the Leviathan relied on its mass, teeth, and tendrils for self-defense."}, {"tag": "p", "text": "Despite their size and strength, the Leviathans only had the cognitive intelligence and reasoning of a non-sentient pet. They regarded all other beings and animals as prey to be devoured and lacked any form of intelligent speech. Instead, the Leviathans communicated through grunts and roars. The Dark Jedi Baron Remulus Dreypa used a Sith amulet to direct and control the Leviathans on Kesh. Even those not controlled by a master still posed a danger to other beings. Several Leviathans on Corbos were known to hibernate for millennia and then emerge whenever they sensed the presence of a large number of prey."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "The Hundred-Year Darkness"}, {"tag": "p", "text": "This species was created during the Hundred-Year Darkness and therefore predated the Lords of the Sith and must have been created by dark-side alchemy discovered independently from Sith Alchemy. For this reason, they can be more accurately referred to as \"dark-side spawn.\" However, the term Sithspawn has become a popular phrase during much of history. The Dark Jedi and future Sith priestess Sorzus Syn stated that her work creating Howler, Shambler, Pit Horror creatures eventual culminated in the creation of Leviathans. Her experiments with Leviathans would later help her master and improve Sith Alchemy. One specimen, called Krespuckle the Ever-Hungry, became her personal favorite."}, {"tag": "p", "text": "Leviathans were primarily created by the Exiles to reinforce the Dark Jedi armies towards the end of the war. Following the Battle of Corbos in 6900 BBY, Leviathans virtually disappeared from the galaxy. A small remnant population managed to survive undetected on Corbos. Growing increasingly feral, these survivors only emerged whenever colonists attempted to establish themselves on the planet. In the succeeding millennia, numerous groups of colonists would be wiped out, their disappearances considered a mystery. Meanwhile, these Dark Jedi were exiled by the Jedi Order into the Stygian Caldera where they forged the Sith Empire. The Sith priestess Sorzus Syn also established a laboratory where she grew several Leviathan larvae."}, {"tag": "h3", "text": "The Keshiri Saga"}, {"tag": "p", "text": "At some point following their exile, the Sith Lord and former Baron Remulus Dreypa and some of his fellow exiles decided to leave the Sith Empire and take revenge on the Jedi Order and their weak Republic. They then assembled a strike force, gathering their new armies and several Leviathans. Those Sith Lords left their recalcitrant brothers behind them and ventured out of the Stygian Caldera. But Dreypa and his forces came across a Jedi patrol composed of Corbos veterans looking for the Exiles, to make sure that they were unable to try to seek revenge on the Jedi and Republic. After a pursuit across the galaxy, the Jedi and Sith ships crash landed on Kesh, where the space battle became a tremendous clash of lightsaber and Force-powers. During the Great Calamity, several Leviathans were unleashed and caused extensive damage. Many of the Keshiri natives were also killed during the fighting."}, {"tag": "p", "text": "However, the Sith grew disillusioned and disgusted with the damage they had wrought on the Keshiri. They had Dreypa sealed away within an oubliette and then made peace with the Jedi. Since the two Force orders were stranded on a remote planet, they withdrew to the frozen continent of Eshkrene in the south pole where they established a new community and new order known as \"The Doomed,\" which strove to find a balance in the Force. Prior to his captivity, however, Dreypa had hidden several Leviathan larvae within the volcanic crater at Sessal Spire. These Leviathan would remain dormant beneath the volcano for several millennia until 2974 BBY. Following his escape, Dreypa led a peasant revolt against the ruling Lost Tribe of Sith, but his forces were routed at the Battle of the Marisota Floodplain. Dreypa and his local quisling Parlan Spinner lured the Tribe's commanders to the volcano, where they unleashed the Leviathans."}, {"tag": "p", "text": "The Leviathans quickly wiped out much of the Lost Tribe's forces and then destroyed an army of \"Doomed\" adherents who had flown on a flock of uvaks in a desperate attempt to stop Dreypa. During the fighting, Spinner switched sides and helped save the lives of his former enemies—the Grand Consort Iliana Hilts and her daughter Takara—from being devoured by a Leviathan. He managed to wound and temporarily immobilize the Leviathan grabbing the Grand Consort and her daughter. While Spinner had managed to stop the monster before it could steal her entire life force, Iliana was transformed into an old woman. Dreypa's Leviathans then laid siege to the Lost Tribe's capital at Tahv, causing the city extensive damage."}, {"tag": "p", "text": "However, they were stopped by Spinner who had stolen an ancient Jedi starship hidden under the city and he used the ship's tractor beam projector to drag one of the Leviathans before killing it with turbolaser cannons. Spinner then proceeded to destroy most of the remaining Leviathans with the Last Hope's armaments. The last remaining Leviathan was then slain by the Sith princess Takara who nearly beheaded it with Force lightning. Dreypa himself perished at the end of the Siege of Tahv when Spinner locked the starship's autopilot and sent it on a one-way journey into Sessal Spire's volcanic caldera. Spinner and Takara survived the battle and the Lost Tribe rebuilt its damaged capital and consolidated its power over Kesh. The former outcast himself became one of the Grand Lord's Hands which greatly improved his social standing within the tribe."}, {"tag": "h3", "text": "The New Republic"}, {"tag": "p", "text": "By the time of the New Republic, Leviathans were considered by most people throughout the galaxy to be extinct but they still endeared a fearsome reputation. In 12 ABY, the New Republic established a mining colony on Corbos. However, their activities awakened a Leviathan which attacked the settlement and devoured the workers, draining their life energies. However, the Corbos miners managed to send a distress transmission to Coruscant. With the Combined Defense Forces of the New Republic still preoccupied with the Imperial warlords, Admiral Ackbar convinced Senator Leia Organa Solo to ask Jedi Master Luke Skywalker to send Jedi students from the new Jedi Praxeum on Yavin 4 to deal with the Corbos problem."}, {"tag": "p", "text": "Master Skywalker dispatched the new Jedi Knight Kyp Durron and one of the Academy's newest students—Dorsk 82, a clone who was created to replace the deceased Dorsk 81, as was his planet's custom. Upon arriving, Kyp and Dorsk found that the entire Corbos Mining City had been destroyed. As they searched through the ruins they found broken weapons and blood, showing that the miners had been killed. However, Kyp was troubled because he could hear the miners screaming for help through the Force, causing him to think they were still alive. Upon finding more blood he realized that they must be dead. Kyp then suggested that they sleep in the ruins and search for the creature the next day. However, Kyp was unable to sleep due to the constant screaming and wailing he sensed through the Force. He went alone to find the beast."}, {"tag": "p", "text": "When Dorsk 82 woke up and found that Kyp was gone, he contacted the Jedi Academy and requested for reinforcements. Meanwhile, Kyp's trail led him to a steep cliff where he found the fossil of a deceased Leviathan. Kyp continued to sense the screams of the deceased and miners and decided that he must continue to find the source. Back on Yavin IV, Skywalker dispatched two more Jedi—Kirana Ti and Streen—to go and help Kyp and Dorsk on Corbos, having received Dorsk 82's call for help. After climbing another cliff, Kyp finally encountered the Leviathan.\nAfter goading the beast, Kyp engaged the Leviathan in a vicious battle and inflicted numerous lightsaber wounds before finally using a grappling hook to climb onto its back. There, he discovered the ghoulish faces of the miners within a milky portal which turned out to be the creature's blister trap. Kyp used his lightsaber to penetrate the blister and free the trapped spirits."}, {"tag": "p", "text": "However, the Leviathan flung the Jedi off its back and grabbed Kyp with its tendrils, intending to force him down its maw. Meanwhile Kirana and Streen quickly teamed up with Dorsk 82 to search for Kyp within the mines. They also encountered several Leviathan larvae which they proceeded to kill. Meanwhile, Kyp managed to break free of the Leviathan by unleashing Force lightning which fried the monster. He then released the miners' spirits from the blister traps of the deceased creature. By then, the other Jedi had succeeded in climbing out of the mines and found Kyp standing by the body of the monster. Dorsk 82 gave Kyp his lightsaber back, which he had picked up on the way out. Without warning, a much larger Leviathan appeared and attacked the four Jedi."}, {"tag": "p", "text": "After a fierce battle, the Jedi team managed to force the monster into a volcanic crater and, believing it to be dead, stood around the lava. However, Kyp commented that he could still hear the terrible screaming in his head and his words were confirmed as the monster emerged unscathed from the lava. The Jedi continued to fight it, trying to avoid the drops of lava now falling all around them. Eventually Dorsk 82 discovered a functioning power generator and convinced Kyp to attach the cables around the monster in order to electrocute it. Kyp succeeded in entangling the Leviathan within the cables and Dorsk 82 hit the switch. Instantly, the huge monster was engulfed with electricity and was killed."}, {"tag": "p", "text": "Following Kyp's mission, several archaeological teams visited the planet in the following years, but they didn't report any Leviathan sightings, supporting the conclusion that the species was extinct. Regardless, colonists and miners continued to avoid the planet under the belief that some of the creatures may have survived underground, even though there was no proof of this."}, {"tag": "h3", "text": "The Legacy era"}, {"tag": "p", "text": "In 137 ABY, One Sith scientist Vul Isen of the One Sith engineered a species of Sea Leviathan to aid in the genocide on the planet Dac. Following the destruction of the beast, Master Treis Sinde reported to Emperor Roan Fel that the One Sith may recreate and mass produce the land based species as the conflict in the Second Imperial Civil War raged on. However, the failure of the Sea Leviathan and the growing threat of the resurgent Jedi and the Galactic Alliance Remnant ended further Sith plans to spawn more Leviathans for the war effort."}, {"tag": "p", "text": "Unwilling to commit more resources to Dac, the Sith Regent Darth Wyyrlok instead ordered Vul Isen to implement the Final Protocol: the destruction of all life on the planet. Satisfied with the prospect of continuing his work elsewhere, Isen infected Dac's oceans with viral spores, which would be carried by oceanic currents and kill every life form on the planet within a week. Three days later, Dac's oceans were already covered with the bodies of the dead. Isen's action caused the deaths of more than eighty percent of the planet's population, and would have caused total extermination if not for the intervention of the Galactic Alliance Remnant and an evacuation fleet of civilian volunteers."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Leviathan were first developed as a major antagonist in Kevin J. Anderson's Jedi Academy: Leviathan comic series, which ran from October 1998 to January 1999. In this standalone comic, the Leviathans were also drawn by Dario Carrasco, Jr.; inked by Mark G. Heike, Bill Black, and David Jacob Beckett; and colored by Ray Murtaugh. Their origins as Dark Jedi sithspawn was further explored in other Expanded Universe literature like Bob Cooper's article Straight from the Horse's Mouth, which first appeared in Star Wars Insider 35, and Daniel Wallace and Anderson's The New Essential Chronology, which was first released on October 25, 2005. The New Essential Chronology linked the Leviathans to the Dark Jedi who instigated the Hundred-Year Darkness. Wallace's Book of Sith: Secrets from the Dark Side, which was first released on February 10, 2012, identified the Dark Jedi exile Sorzus Syn as the creator of the Leviathans."}, {"tag": "p", "text": "Leviathans also made a cameo flashback appearance in John Ostrander and Omar Francia's Star Wars: Legacy series when they appeared in Legacy 30, which debuted on November 26, 2008. Leviathans later provided a conceptual basis for the aquatic Sea Leviathan, which debuted in the ninth Legacy story arc, Fight Another Day. This story arc focused on developments in the planet Dac and consisted of two issues, running from January 28 to February 29, 2009. Leviathans also feature as minions of the antagonistic Sith Lord Remulus Dreypa in John Jackson Miller's standalone Star Wars: Lost Tribe of the Sith comic series, which ran from August 8 to December 12, 2012. They debuted at the cliffhanger of Lost Tribe of the Sith—Spiral 3, which was first released on October 10, 2012. For this standalone comic, the Leviathans were drawn by Andrea Mutti, inked by Pierluigi Baldassini, and colored by Michael Atiyeh."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}