{"url": "Li-Suun_Niik", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Crime lords", "Category:Force-sensitives", "Category:Humans", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Li-Suun Niik"}, {"tag": "p", "text": "Li-Suun Niik was a Human male crime lord operating on the banking planet of Aargau."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The details of Niik's origin and how he became the biggest criminal mastermind on the planet was known only to him. It was not known whether he was a native of Aargau or an offworlder, furthering suspicions that his name was just a moniker. His whereabouts were hidden, only appearing to people who have impressed him considerably."}, {"tag": "p", "text": "Niik mainly dealt with electronic theft and smuggling precious metals like gold. He built his criminal organization with only a small group of loyal people numbering in hundreds, quite small compared to galactic standards. He compensated by dealing with his contacts working for the Bank of Aargau like Captain Smalyun and Depositor Councilwoman Balazausa, or hiring offworld mercenaries when needed."}, {"tag": "p", "text": "It was believed that he masterminded or had a hand in almost all major crimes committed on the planet. The organization remained independent and never gave a portion or selling out their operation to the Hutts or Black Sun. Niik also held the distinction of being the only individual in Aargauun history to deprive the Bank of Aargau of more than one hundred credits and evade arrest."}, {"tag": "p", "text": "Unknown to most of his operatives including his closest advisers, Niik was Force sensitive, which would explain his success through the years. It is not known whether Emperor Palpatine and Darth Vader knew of his connection to the Force during their visits to Aargau, but he was strangely left alone without repercussions."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Training himself, Niik was able to use several different Force powers like Mind trick, Telekinesis, Force healing, Force speed, Force grip and Alter."}, {"tag": "p", "text": "He could speak Ancient Aargauese, Basic, Binary, Huttese and the Sith."}, {"tag": "h2", "text": "Sources"}]}