{"url": "LiMerge_Building", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Coruscant commercial buildings", "Category:Locations of the Sith", "Category:Skyscrapers", "Category:The Works locations"], "nodes": [{"tag": "h1", "text": "LiMerge Building"}, {"tag": "p", "text": "The LiMerge Building was Darth Sidious's secret hideout on Coruscant. The building was located in The Works industrial district, near the Senate District and the crash site of the Invisible Hand."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "This building, constructed as the headquarters for LiMerge Power some three centuries before its use by Darth Sidious, was designed as a weapons manufacturing facility. Additionally, it was believed to have served as the corporate headquarters for the factories that surrounded it. The top two-thirds of the building appeared to be little more than an unadorned pillar with a rounded summit, and the superstructure of the lower portion was supported by massive fins reinforcing a circular base. Several docking bays were located on the level where these fins met the structure itself. Permaglass windows and skylights dotted the exterior of the building."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Darth Sidious was known to have used the LiMerge Building as his Sith headquarters during the training of Darth Maul, and perhaps even before that time. Following Maul's defeat on Naboo, Count Dooku became Sidious's new apprentice, and used the LiMerge Building as his base of Sith operations. Following his escape from Geonosis, Dooku returned to his Master in their hideout on Coruscant to report the onset of the Clone Wars. He also brought Sidious the plans for the Separatist Ultimate Weapon."}, {"tag": "p", "text": "With Dooku leading the Confederacy of Independent Systems during the war, he was known to bring some of his acolytes to the LiMerge Building, though none realized its connection to Sidious. Following the assassination of Senator Viento, Quinlan Vos met with Dooku here along with Tol Skorr and Khaleen Hentz."}, {"tag": "p", "text": "It was a mention of this location by the reformed Vos that clued Tholme in to the true nature of the building, which in turn led to an investigation of the structure, carried out by Commander Valiant, Captain Dyne, and Jedi Master Mace Windu. Their search for Darth Sidious led through the building and into the downlevel tunnels, which they realized connected not only to areas of the Senate District, but also to the lower levels of 500 Republica. Getting to know this, the Jedi became certain that Darth Sidious was in fact a member of Palpatine's inner circle. Due to the large amounts of footprints disguising Sidious' footprints, as well as a Separatist attack on the planet, Valiant and Dyne were the only ones remaining to investigate, as Mace Windu had to break off from the investigation due to the recent events. Dyne and Valiant eventually deduced only one organic lifeform within the area they lost Sidious' tracks at via basic holoradio channels (the military channels having been blocked out), and then entered an elevator to locate Sidious. However, they were killed in an ambush by Geonosians before entering the area Sidious was suspected of being at, although Dyne managed to live long enough to get a glimpse of Sidious when he inspected the damage, realizing that Sidious was in fact Palpatine himself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Coruscant and the Core Worlds introduced the Factory District and placed both the Grungeon Block and the LiMerge Building in that district, but later sources moved them to the Works."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Notes and references"}]}