{"url": "Liak", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance Army personnel", "Category:Kashyyyk residents", "Category:Males", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Liak"}, {"tag": "p", "text": "A male Wookiee from Kashyyyk, Liak joined the Alliance to Restore the Republic when his friend and hunting partner Zherriak was killed during an Imperial slave raid of their homeworld. Small for his species, he became a member of Koris Haslam's commando team and participated in several missions for the Alliance. Because of his intricate knowledge of jungles and his instinctive sense of direction, which could be applied to space stations and other compounds, he was selected to participate in the rescue of Rebel leader Gebnerret Vibrion from an Imperial prison on Selnesh. During the mission, he acted as a prisoner accused of smuggling and of Rebel sympathies, and he helped his team escape through the prison's underground tunnels."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Wookiee Liak grew up on the forest planet of Kashyyyk, where he lived in the jungle's upper levels. He became good friends with the Wookiee Zherriak, with whom he swore an honor bond, and the two frequently hunted together."}, {"tag": "p", "text": "When Liak was about middle-aged—between 301 and 350 standard years by his species's standards—the Galactic Empire, the dominant galactic government at the time, came to Kashyyyk on a slave raid. Zherriak was killed, and Liak and several other Wookiees were taken captive. However, before they could be forced into slavery, the surviving Wookiees overpowered the Imperials and captured their starship. Most of the survivors returned to Kashyyyk to resume their lives, but Liak, determined to take revenge on those who had killed his friend, turned to the Alliance to Restore the Republic."}, {"tag": "p", "text": "Liak became a commando and undertook several undercover missions during the Galactic Civil War in a team commanded by the Human Lieutenant Koris Haslam. Along with other commandos—the Humans Melenna Seltrayne, Barsoulentinial Enkhet, Gowan Ch'lessan, and Doctor Aurin Leith—Liak was later selected to take part in a mission to rescue Rebel leader Gebnerret Vibrion from Imperial custody on the planet Selnesh. Vibrion, an elderly Human with Zithrom's syndrome—a kidney disorder that was treated through consistent doses of the medicine Clondex—had knowledge of critical information that could mean disaster for the Alliance should it be extracted by the Imperials. To infiltrate the Selnesh Imperial Detention Center, in which Vibrion was being held, Ch'lessan and Enkhet disguised themselves as Imperial stormtroopers, while Liak and Seltrayne played the part of captured smugglers with suspected ties to the Rebellion. Doctor Leith was to assume the role of an ignorant passenger taking transit to the planet Sestooine with the two smugglers. Liak's sense of direction was called upon for the mission, as his instinctive ability to navigate through the jungles of his homeworld also applied to the complex corridors of space stations and other structures, a trait that his comrades found mysterious."}, {"tag": "p", "text": "After four days in hyperspace, the group reached Selnesh, and Liak, Seltrayne, and Leith were put in binder cuffs before their ship landed in a docking bay in the Imperial prison. Once the group was inside the prison's central computer bank, Halsam, impersonating an Imperial officer, ushered out the Imperials on duty under the pretense that he needed to interrogate the smugglers. When the Imperials left, the binders were removed, and the team located Vibrion's cell. Liak, prepared to help in any way necessary, stayed at Leith's side while she gave Vibrion several doses of revitalizing drugs and Clondex. However, when Haslam grew worried that the Imperials were beginning to suspect that something was amiss, he ordered Liak to open the door to the access tunnel through which the group planned to escape. Once the door was open and Vibrion was able to walk, Liak led the team toward the docking bay. Before they could make it into the bay, however, a firefight broke out with a group of Imperial stormtroopers that had followed the Rebels into the tunnel. While his companions defended against the Imperials behind them, Liak threw a concussion grenade into the bay, killing several Imperial troopers. The team ran to the ship and subsequently escaped the planet with no casualties."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Liak, whose name meant \"autumn,\" \"blood,\" or \"red\" in Shyriiwook, was slightly smaller than most Wookiees, who were between two and 2.3 meters as adults. However, Liak was not short enough to stand fully upright in the Selnesh detention center's underground tunnels. He had pale blue eyes and a long coat of golden-brown fur, and, like most Wookiees, Liak had a strong code of honor and justice; he swore vengeance on the Galactic Empire after they killed his friend Zherriak and enslaved his people. Despite this, Liak was calm and rational, and he became an invaluable member of Koris Haslam's commando team as the voice of reason. Frequently, Halsam and Seltrayne squabbled amongst themselves, and Liak had to gently but firmly remind the two of the task at hand. He was able to discern the anxiety of others, and he attempted to calm his teammates when they became emotional. When Doctor Leith became nervous during the rescue operation, which was her first mission, Liak offered her calming words, and, although the doctor could not comprehend Liak's Wookiee language, she understood that he was trying to reassure her."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Though gentle by nature, Liak was a cunning warrior with a mind honed for perception and survival. He was skilled in many areas of war, including hand-to-hand combat, though by Wookiee honor he was forbidden to use his climbing claws in battle. He was also very knowledgeable, having an understanding of the operation and repair of many vehicles, including repulsorlift vehicles and starships. Raised on the upper levels of Kashyyyk, Liak developed an intimate understanding of the planet's complex jungles and honed his instinctive sense of direction, which he put to use many times in the service of the Rebellion. He was skilled in the use of bowcasters and grenades, both of which he carried, along with a comlink, medpac, and ammo bandolier, during his mission to the Selnesh Detention Center for the Rebellion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Liak's only appearance to date is in the short story \"Do No Harm,\" written by Erin Endom and illustrated by Christopher Trevas. \"Do No Harm\" was originally published in May of 1996 in Star Wars Adventure Journal 10, which included statistics on several characters, including Liak, for Star Wars: The Roleplaying Game. The story was later reprinted in the short story anthology Tales from the Empire in 1997 and archived online on Hyperspace in 2006."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}