{"url": "Liana_Merian/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Alderaanians", "Category:Females", "Category:Galactic Republic bureaucrats", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Liana Merian"}, {"tag": "p", "text": "Liana Merian was a Human female from the peaceful planet Alderaan. During Finis Valorum's rule as Supreme Chancellor of the Galactic Republic, Merian served as one of Senator Bail Antilles' aides in the Senate. In the year 32 BBY, she witnessed the political crisis engineered by the invasion of planet Naboo by the Trade Federation. A decade later, shortly before the start of the Clone Wars, Merian joined the Alderaanian branch of the Refugee Relief Movement—or RRM. She worked alongside her compatriot Celly Organa, Chair of the RRM, and the former Chancellor Valorum, in preparing the Chianar site, a 100-hectare plot, for settlement."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female, Liana Merian came from Alderaan, a planet renowned throughout the galaxy for its natural beauty, in the decades leading up to the fall of the Galactic Republic. At seventeen, Merian reached the age of responsibility, becoming a fully responsible adult in the eyes of the local legislation. She chose to pursue a political career, and she eventually attained the position of senatorial aide. During the rule of Supreme Chancellor Finis Valorum, Merian joined the Galactic Senate as part of the Alderaanian delegation led by Senator Bail Antilles. At the time, she shared her duties with Agrippa Aldrete, an older gentleman who had been the current senator's immediate predecessor. In 32 BBY, Liana Merian was serving under Antilles when the peaceful planet Naboo was besieged by the droid army of the Trade Federation, an event that led to the removal of Chancellor Valorum and the election of Palpatine of Naboo."}, {"tag": "p", "text": "By 22 BBY, two months before the outbreak of the Clone Wars between the Republic and the Confederacy of Independent Systems, Merian had returned to her homeworld. There, she helped the local branch of the Refugee Relief Movement—or RMM for short—settle a new village at Chianar, a 100-hectare plot on the green plains of Alderaan. During her involvement with the project at Chianar, Liana Merian worked alongside prestigious personalities such as Celly Organa, Chairwoman of the RRM, and the former Chancellor Valorum. She attended the sod-turning ceremony of the new settlement along with Finis Valorum, and her presence was immortalized in a HoloNet News report."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Liana Merian was a slender woman with light skin and long, brown hair she would coil in twin buns. When serving in the Senate, she put on bright-red lipstick and donned a simple, yet elegant, full length robe with puffed sleeves and a turtleneck. The white color of her dress showed her ties with the Alderaanian ambassadorial milieu. When she needed to roll up her sleeves to help with the RMM's ground-breaking ceremony, Merian had swapped her ambassadorial robe for more practical work clothes. In a HoloNet News report, Merian was seen wearing a knee-length, cream-colored tunic with wrist bindings, a pair of trousers and sturdy work boots. She did, however, retain her trademark hairstyle, and also wore a necklace."}, {"tag": "p", "text": "Most Alderaanians were educated and cultured pacifists who displayed redoubtable inner strength. They were far from passive, and they refused to fight only because they had chosen the nobler path of diplomacy. The senatorial aide Merian lived up to this reputation. She was proud of her homeworld, and was known to use the prosperous example of Alderaan to actively promote peace throughout the Republican Space. Encouraging trade was also part of her political agenda. As a member of the RRM, she also cared for the homeless citizens of the galaxy, those who were displaced by the closure of planets that joined the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Liana Merian was among the many secondary characters that were cut from the 1999 movie Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy. Merian was portrayed by an uncredited actress and had a single, non-speaking appearance in a Galactic Senate scene, along with Agrippa Aldrete, a draped Human and Bail Organa—played by Adrian Dunbar. In this scene, Organa seconded Queen Amidala's Vote of No Confidence that removed Chancellor Valorum from office. The footage was left on the cutting room floor, but Dunbar's character was ultimately identified as Bail Antilles, and pictures of Liana Merian were released in various sources following the release of the film, bringing the character back into canon."}, {"tag": "p", "text": "With her white gown and twin \"cinnamon buns,\" Merian's appearance in the promotional pictures is strikingly similar to Princess Leia Organa in her diplomatic outfit from Star Wars: Episode IV A New Hope."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}