{"url": "Arc_Hammer", "categories": ["Category:Legends articles", "Category:Industrial facilities", "Category:Kuat Drive Yards products", "Category:Starships of the Galactic Empire", "Category:Super Star Destroyers"], "nodes": [{"tag": "h1", "text": "Arc Hammer"}, {"tag": "p", "text": "The Arc Hammer was an Imperial spacefaring production facility used to supplement the Imperial Stormtrooper Corps with dark troopers, a new generation of battle droid stormtroopers to be used in the Galactic Civil War against the Rebel Alliance."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Arc Hammer was a factory ship of a unique design. Like many other Imperial starships, the Arc Hammer had a long, narrow, dagger-shaped hull; however, it also had four large columns surrounding a central one that protruded from below and a small, flat bridge structure in front of the columns on its dorsal side."}, {"tag": "p", "text": "The Arc Hammer served as a primary testbed of the Dark Trooper Project, a brainchild of General Rom Mohc which was to create larger, more powerful robotic versions of stormtroopers. The Dark Troopers were developed inside the vessel. Construction lines filled the interior and four large ventral hangars were responsible for receiving cargo vessels and loading batches of dark troopers into transports or deploying them directly above a target world."}, {"tag": "p", "text": "The Arc Hammer was equipped with enough weaponry to defend itself in space battles. The inside of the Arc Hammer was a large maze and was very similar to that of other Star Destroyer designs. The inside contained large amounts of conveyer belts and moving vertical columns for maximum Dark Trooper construction.\nThe Arc Hammer cost billions of credits to construct."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Arc Hammer was a titanic space faring construction facility constructed at Kuat Drive Yards and was classified as a dreadnaught. After the destruction of the newest Imperial superweapon, the Death Star in 0 BBY, the Empire started to share General Rom Mohc's views, who considered that all soldiers should be given a chance to face each other in a one-on-one combat. Mohc eventually persuaded the Imperial officials to greenlight the Dark Trooper Project, which involved creating droid versions of Imperial stormtroopers. To this end, he was provided with the Arc Hammer."}, {"tag": "p", "text": "In order to ensure secrecy of the project, the factory frequently made jumps to hyperspace, and only one ship, the Dark Lord of the Sith Darth Vader's Super Star Destroyer Executor, knew its exact position at any given time. The Dark Trooper project proceeded quickly, and by 0 ABY the first working prototypes were made. To demonstrate the power of the Dark Troopers, it was arranged to attack the Rebel Tak Base on the planet Talay. The demonstration was successful; only one Rebel ship managed to escape from the planet, although it was boarded by a Dark Trooper as well, who then killed all crew aboard. The base itself was destroyed with all hands. However, before its destruction, Admiral Toka managed to send a distress signal."}, {"tag": "p", "text": "After receiving the distress signal, the Rebel-allied mercenary Kyle Katarn was assigned to investigate the loss of Tak Base. While there, Kyle discovered a large gun, too cumbersome to be efficiently wielded by a regular stormtrooper."}, {"tag": "p", "text": "Eventually, after investigating various secret Imperial factories and weapons scientists, he learned of the Dark Trooper Project, and infiltrated Arc Hammer via a cargo transfer. He later destroyed the ship by placing sequencer charges throughout certain exhaust ports within the ship."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The length of the Arc Hammer is determined by comparing it to Executor and several escorting in the first cutscene of the game. It is shown clearly to be about half the length (and slightly smaller) than the Executor, albeit being further away from the camera than the Star Dreadnought."}, {"tag": "p", "text": "Another way to calculate it more precisely is to compare it with the Imperial-class Star Destroyers that are closer to the camera than it. The Arc Hammer is at least 6 times the size of a Star Destroyer that is closest to it; therefore, the Arc Hammer is definitely longer than 9.6 km."}, {"tag": "p", "text": "Star Wars: Empire at War: Forces of Corruption has the Arc Hammer at a fraction of the Executor's size, and is more or less the size of an Imperial-class Star Destroyer. The reasoning behind this is that the ship's role is as a factory and research facility and would therefore not need to be as big as the Executor. The game's Prima guide claims the ship is the size of a Star Destroyer, but since that term has been used to describe ships in size from the Demolisher to the Executor, this provides no clear estimate."}, {"tag": "p", "text": "\"Sand Blasted\" shows a different and inconsistent version of the factory, which resembles a proper Star Destroyer with two columns protruding from the fuselage."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}