{"url": "Liberation_of_Camp_Four", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Battles of the Invasion of Naboo"], "nodes": [{"tag": "h1", "text": "Liberation of Camp Four"}, {"tag": "p", "text": "The Trade Federation prison Camp Four was liberated during the Invasion of Naboo in 32 BBY. The Federation had enslaved most of the planet's inhabitants and put them into camps such as Camp Four, so Naboo's Bravo Squadron wanted to liberate the camp to add to the Naboo Resistance as they prepared to retake their planet from the invaders. The Bravo Squadron pilots infiltrated the camp, fighting through droid starfighters to reach it. Lieutenant Gavyn Sykes stole a Federation speeder to sneak into the camp, and the other pilots provided cover while he freed the prisoners."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Trade Federation invaded and occupied the planet Naboo in the year 32 BBY and enslaved much of the planet. Many of the planet's leaders were put into the prison Camp Four, while Naboo's Queen, Padmé Amidala, was forced to escape to the planet Tatooine. As the battle for control of Naboo wore on, the fight became increasingly desperate. Members of the Royal Naboo Security Forces' Bravo Squadron, having dealt with a traitorous smuggler, Borvo the Hutt, needed to get back on the offensive, and to do so, the squadron set out to liberate prison camps and gain new recruits. Kol Kotha, a former employee of Borvo, had previously scouted the camps, and he suggested they head to Camp Four."}, {"tag": "h2", "text": "The liberation"}, {"tag": "h3", "text": "The valley"}, {"tag": "p", "text": "The squadron first had to locate the camp. Under cover of darkness, Bravo Squadron infiltrated a valley, and Lieutenant Gavyn Sykes, the flight lead, ordered the pilots to listen to Kotha's recon report. Kotha said they had information that Camp Four was located in an area north of the valley. The Trade Federation had completely stripped the area for its own purposes. One of the pilots, Lutin Hollis, broke formation to look for the camp, because he suspected his family was in there. He gave away the squadron's position when he flew into an area occupied by an installation that was part of Camp Four, and the base responded by launching many droid starfighters, as well as a landing craft. Sykes ordered the flight to break and attack, and the squadron had to escape under heavy fire from the base and from a missile turret. The landing craft continued its voyage through the valley to drop off speeders at processing centers."}, {"tag": "p", "text": "Skyes followed and shot down the landing craft, which tried to fight back by launching airborne mines from a rearward launcher. Sykes dedicated its destruction to the planet of Naboo."}, {"tag": "p", "text": "Meanwhile, more starfighters and bombers attacked local farmhouses. Kotha said they did not have time to help, but the Naboo pilots shot down the attackers anyway. With that threat eliminated, they continued the search for the camp, flying over three gunboats patrolling the nearby waters. The sensors on Sykes' N-1 starfighter located Camp Four in the valley below them, and he reported it to the squadron and warned them to watch for anti-air emplacements. Flying through a canyon, the squadron found a Trade Federation hangar that was releasing troop carriers. Kotha proposed that they find a way to get in from the ground. Kotha also proposed that the Federation was using the speeders to transport prisoners from across the planet, and Sykes realized the speeders were heading straight into the camp. After shooting down the starfighter defenders, Sykes landed in the hangar and took a Heavy STAP. He programmed several unoccupied troop carriers to enter the base and followed them in."}, {"tag": "h3", "text": "The Camp"}, {"tag": "p", "text": "Once inside the gates, however, the battle droids scanned the carriers and noticed they were unoccupied. They ordered Sykes to stop, but when he continued to head into the camp, the base went into high alert. Tanks and Heavy STAPS poured out of their hangars, but Sykes managed to destroy them. He traveled up the nearby cliff and found the first cell blocks. Kotha tried to strafe the camp's power generator in his starfighter but missed, and subsequent fire from laser turrets drove him off, forcing Sykes to destroy it himself before moving to the next cell block."}, {"tag": "p", "text": "Once inside, the prisoners called to him. Sykes told them to stand back so he could blow the door. When they were free, the prisoners ran to nearby civilian speeders, and Sykes escorted them uphill to the next set of cell blocks, destroying turrets and droids along the way. The rescued prisoners hid behind a security hangar while Sykes switched to a Gian speeder inside. He came out into a maelstrom of fire from the defense turrets. Hollis strafed the camp, blowing a hole into a wall so Sykes could destroy next generator and take the laser fencing off-line. Sykes was able to free the prisoners in that block, and then went up another cliff to take down the generators powering the entrance to the next section of camp."}, {"tag": "h3", "text": "Endgame"}, {"tag": "p", "text": "As Sykes escorted the prisoners downhill into the last group of cell blocks, they were ambushed and trapped by more tanks and fighters. Hollis flew in and took out several tanks and also blew a hole in the wall. The breach allowed Sykes to take down the last generator. Sykes freed the last prisoners and went up a separate hill to destroy the generator, which powered the rear gate. After Hollis' strafing run, Sykes told him to get clear and that they would handle it from there."}, {"tag": "p", "text": "On the way down from the generator, Sykes found advanced laser technology, which was useful to the Naboo Resistance."}, {"tag": "p", "text": "Once the gates were down, the rescued prisoners were able to leave. Sykes led them out while firing at the last droids."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "With the camp liberated, the Resistance gained new recruits, including several seasoned officers. With an expanded force, the Resistance set its sights next on retaking the capital after Naboo's Queen returned home and forged an alliance with the Gungan Grand Army."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The rescue of the Camp Four prisoners was a mission appearing in the 2000 video game Star Wars: Episode I: Battle for Naboo. The mission took place in two parts: in a starfighter searching for the camp and in a speeder rescuing the prisoners. The mission would not proceed until the starfighters near the hangar were destroyed. In the course of the mission, it was possible to find an upgrade. Picking it up fulfills the bonus objective. Switching speeders mid-mission was an option, and it was possible to play using the Heavy STAP. Shooting down the landing craft was also optional; its flight path can be traced to the camp, and if left alone, the ship will fly into the camp. Additionally, the player is not required to release the prisoners, only destroying the power generators in the camp, although failing to do so affects the \"friendlies rescued\" score. This article assumes 100 percent game completion."}, {"tag": "p", "text": "The event was also mentioned in the Gavyn Sykes' entry in 2008's The Complete Star Wars Encyclopedia, and was later discussed in the 2011 magazine Star Wars: The Official Starships & Vehicles Collection 62."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}