{"url": "Liberation_of_Abridon", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Battles in the Koradin sector", "Category:Battles of the Galactic Civil War"], "nodes": [{"tag": "h1", "text": "Liberation of Abridon"}, {"tag": "p", "text": "The Third Battle of Abridon took place in 4 ABY, right before the Battle of Endor. The Alliance to Restore the Republic supported the Abridon Nationalists in their effort to drive the Galactic Empire off Abridon."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Several months before the battle, the Nationalists had revolted against the Empire with the Rebel Alliance's support. That uprising was put down by Imperial general Brenn Tantor. However, while the Rebel presence had been destroyed, the Nationalists continued to fight, holed up in the industrial center of Sayan. It was after months of fighting that the Nationalists appealed again to the Rebellion for aid, offering their allegiance and military supplies in exchange for driving the Empire off the planet."}, {"tag": "p", "text": "Shortly before the Battle of Endor, the Rebellion made the decision to relieve the planet. General Tyr Taskeen, the man who had commanded the first Rebel army, returned with Tantor, who had defected to the Alliance after refusing an order from his superior to massacre civilians."}, {"tag": "p", "text": "Tantor's forces landed on the southern edge of the capital. Tantor quickly moved to defend his position by taking the Imperial base just to the east of his position."}, {"tag": "p", "text": "Tantor then moved north in to the city proper, seizing the Imperial base he himself had previously set up at the foot of Government Mound. With no more centralized Imperial positions in the vicinity, he retook the Government Center. One Abridon in the Government Center revealed to Tantor that his family, along with many other citizens, were being held in a camp outside the city."}, {"tag": "p", "text": "Tantor's troops swiftly found the holding center, from which they liberated several prisoners. One of them was Hamman Flatt, former lieutenant governor of Abridon and a Nationalist, whom Tantor had imprisoned on his last visit. Flatt offered a deal to the Rebels: he would lead Abridon into the Rebel fold and provide a shipment of A-wings if Tantor and Taskeen would drive the Empire off the planet and relieve the Nationalists in Sayan, where the Empire had begun leveling the city with artillery."}, {"tag": "p", "text": "Tantor was inserted at the edge of Sayan. Using the city's running street battles as cover, he crept the TR-MB, a light escort of armor, and several Hover Transports filled with troopers and pilots for the A-wings to the Abridon Shipyard, located on an island at the edge of the city. Capturing the shipyards and rushing the flight of A-wings into orbit, Tantor fortified his position, which was approachable only by two causeways. Calling down reinforcements from orbit, he smashed the Imperial presence in the city, completely cleansing it of enemies. Completely free of the Empire, Abridon joined the Rebellion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}