{"url": "Liberation_of_Calodan", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Articles with conjectural titles", "Category:Battles", "Category:Events during the New Republic Era"], "nodes": [{"tag": "h1", "text": "Liberation of Calodan"}, {"tag": "p", "text": "Around 9 ABY, during the New Republic Era, the city of Calodan located on the forest planet of Corvus was liberated from Magistrate Morgan Elsbeth and her army of guards by the former Jedi Ahsoka Tano and the Mandalorian warrior Din Djarin."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "During the Clone Wars, Morgan Elsbeth's people were massacred, though she survived. In her anger, she partook in an industry that contributed to the production of the Imperial Starfleet after the Galactic Empire's rise to power at the end of the Clone Wars, plundering worlds for resources and destroying them in the process. At some point she acquired a staff of pure beskar. By around 9 ABY, after the fall of the Empire and during the time of the New Republic, Elsbeth had become Magistrate of the walled city of Calodan on the forest planet of Corvus, from where she continued her business and worked under her master, Grand Admiral Thrawn. Calodan's citizens suffered under Elsbeth's ruthless rule, for she oppressed the villagers and considered their lives to be meaningless, torturing prisoners and forcing the citizens, who she would use as hostages, to live in poor conditions. She maintained her rule with an army of scout guards led by a hired gunslinger, Lang, and was guarded by two HK-87 assassin droids."}, {"tag": "p", "text": "At this time, the former Jedi Ahsoka Tano came into conflict with Elsbeth, seeking the knowledge of her master's location and the freedom of Calodan's citizens by defeating her. The Mandalorian warrior Din Djarin, seeking out a Jedi in order to reunite his foundling child, Grogu, with them; he received information on Tano, including her location, from fellow Mandalorian Bo-Katan Kryze. Djarin arrived to town and was summoned by Elsbeth, who offered the bounty hunter the beskar staff in exchange for killing the Jedi, unaware that Djarin had in fact already been seeking her out. Elsbeth provided Djarin with the coordinates to the Jedi's location; there, traveling alone, Djarin found Tano in the forest. Djarin offered to help Tano in her mission to liberate the village if she properly trained Grogu, which Tano agreed to."}, {"tag": "h2", "text": "The liberation"}, {"tag": "p", "text": "Appearing from the midst of the forest, Ahsoka Tano leaped over the city's walls, defeating the scout guard posted on the battlements before confronting Morgan Elsbeth and her forces in the city. Elsbeth ordered her hired gunslinger Lang and her forces to kill Tano and execute the remaining citizens before locking herself behind the inner gate. Tano ran across the roofs of nearby buildings evading blaster fire, and as Lang, the guards, and Elsbeth's two HK-87 assassin droids split up across the city, Din Djarin arrived on his jetpack to free the prisoners before they could be terminated."}, {"tag": "p", "text": "Across the city, Tano defeated the remaining scout guard and one of the assassin droids while Djarin freed the prisoners and helped them inside Wing's home. Lang caught Djarin and realized he had joined forces with Tano, who leapt over the gate and confronted Elsbeth in a duel behind it while Lang and Djarin listened on in a stand-off. Elsbeth, fighting with the beskar staff, disarmed Tano of one of her lightsabers but Tano eventually disarmed her and demanded to know the location of her master. Lang attempted to trick Djarin into letting his guard down and blast him when they heard Elsbeth's staff drop, but Djarin shot and killed Lang before he could blast him. Wing warned Djarin about the other assassin droid from above and behind. Djarin then shot the droid before it could kill him."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The citizens of Calodan celebrated their freedom after Elsbeth's defeat while Wing took up the mantle as governor of Calodan with Tano's support. Tano gave the staff to Djarin outside the city."}, {"tag": "p", "text": "Djarin eventually returned to his Razor Crest ship to say farewell to Grogu and bring him to Tano for training. However, Djarin remained with Grogu for some time before eventually departing his ship. There, Tano told Djarin that Grogu saw him as a father and refused to train him due to their strong bond. Tano instead advised Djarin to travel to the ruins of an ancient temple on Tython, where Grogu could choose to reach out through the Force and possibly be sensed by other Jedi who could come looking for him. Djarin agreed and parted ways with Tano, who walked back towards the town as Djarin and Grogu flew away on the Crest."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The battle appeared in \"Chapter 13: The Jedi\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, written and directed by Dave Filoni and released on November 27, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}