{"url": "Liberation_of_Cloud_City", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Battles of Bespin", "Category:Battles of the Iron Blockade"], "nodes": [{"tag": "h1", "text": "Liberation of Cloud City"}, {"tag": "p", "text": "The liberation of Cloud City occurred in 5 ABY during the Galactic Empire's Iron Blockade of the Anoat sector, when the planet Bespin was liberated from Imperial control. The fight began when Lobot, aide to the former Baron Administrator of Cloud City; General Lando Calrissian of the New Republic relayed messages to him and formed a resistance movement with the Bespin Wing Guard on the planet. Soon after, the Uprising in the Anoat sector, led by an individual known as \"the Smuggler,\" liberated Bespin, basing the Uprising's operations in the Paradise Atrium of Cloud City."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "Shortly after the Battle of Hoth during the Galactic Civil War, the galaxy-wide conflict between the Alliance to Restore the Republic and the Galactic Empire, the planet Bespin of the Anoat sector was taken into Imperial custody; Imperial forces led by Darth Vader had arrived on the mining planet to set a trap for Luke Skywalker, a Rebel commander and Jedi-in-training. The Imperials set the trap in Cloud City, where Baron Administrator Lando Calrissian agreed to let the Imperials stay, as long as they wouldn't return. However, Vader altered the deal, seizing control of Cloud City and the rest of Bespin. During this time, Calrissian placed the Bespin Wing Guard under the control of his cybernetically-enhanced aide, Lobot, and fled the planet to join the Rebellion."}, {"tag": "p", "text": "In 4 ABY, the Empire suffered a critical defeat by the Rebel Alliance at the Battle of Endor, in which Galactic Emperor Sheev Palpatine was killed. Following their loss, Imperial forces on Bespin relocated Cloud City's garrison to more strategic locations. With Cloud City free of Imperial troops, the city's streets filled with celebrations and displays of fireworks. However, before news of the Emperor's death was able to reach the citizens of Bespin and the rest of the Anoat sector, Imperial Governor Ubrik Adelhard issued the Iron Blockade. The blockade prevented news of the Rebel victory from reaching the Anoat sector, claiming that reports saying otherwise were rebellious propaganda. Despite the Empire's control of Bespin, Imperial forces launched multiple attacks on Ugnorgrad, an Ugnaught colony on Bespin, which suffered as a result."}, {"tag": "h2", "text": "The liberation"}, {"tag": "p", "text": "With Cloud City free its Imperial garrison, Lobot formed a militia to fight the remaining Imperials. To help the fight, Lobot relayed messages to and from Calrissian, now a member of the New Republic, and Lobot used the additional intelligence to launch strategic attacks. Hoping to apprehend Adelhard from his chamber in Cloud City's prime tower, Lobot hired the pirate Kars Tal-Korla and prepared an intrusion team. Tal-Korla captured Borgin Kaa, an Imperial officer, from his luxury level apartment. With Kaa detained, Tal-Korla extracted the code needed to open an access panel connected to Adelhard's chamber. Once the panel was opened, Lobot and the intrusion team moved to apprehend the Governor, although they were unsuccessful in their attempt."}, {"tag": "p", "text": "During this time, an individual known as \"the Smuggler\" had come across a recorded hologram of Leia Organa, a Rebel Alliance leader, on Nar Hypa. The message revealed that the Emperor had been defeated, so the Smuggler and their associates rallied the Ivax Syndicate, the Noble Court, and the Kouhun to form a resistance movement known as the Uprising. The Ivax Syndicate's leader, Voras the Hutt, was a resident of Cloud City's Paradise Atrium on Bespin, and the fledgling movement successfully fought to liberate the planet."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Following the liberation of Bespin, individuals celebrated and launched fireworks. Needing a base of operations, the Uprising made a home for themselves in Paradise Atrium, where they continued plotting against the Empire. However, the liberation of Bespin caught the attention of Bragh, commander of the Imperial Purge Troopers, who began targeting members of the Uprising."}, {"tag": "p", "text": "Some Imperial holdouts survived on the planet until late in the war. One was Chinook Station, a refueling outpost controlled by troops under Admiral Garrick Versio. The station was destroyed by Inferno Squad shortly before the Battle of Jakku, further crippling the Empire's already crumbling supply lines."}, {"tag": "p", "text": "By the time of the Battle of Jakku, Lando had managed to starve out Adelhard's remnant. Most of the Imperial surrendered but holdouts remained throughout Cloud City. Lando managed to convince several Imperial troops holding out in the Bolo Tanga room of the Casino level to surrender by offering to spare their lives, give them food and lodging, and letting them leave Cloud City. A dozen took up Lando's offer but a sergeant tried to kill Calrissian. The Baron Administrator managed to kill the sergeant with his Vitiator blaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The liberation of Bespin first appeared in the 2015 novel Aftermath, which was written by Chuck Wendig. The liberation later appeared in Chapter 1 of Star Wars: Uprising, a mobile game created by Kabam for iOS and Android platforms. On November 12, 2015, Kabam opened Chapter 2 Story Missions to Uprising players, officially announcing that Bespin had been liberated."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}