{"url": "Liberation_of_Coruscant_(Lost_Tribe_of_Sith_emergence)", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Liberation of Coruscant", "Category:New Jedi Order events"], "nodes": [{"tag": "h1", "text": "Liberation of Coruscant  (Lost Tribe of Sith emergence)"}, {"tag": "p", "text": "The liberation of Coruscant was the final campaign of the Lost Tribe of Sith's emergence in the year 44 ABY, when the forces of the New Jedi Order and their allies attempted to destroy those of the Sith, who had infiltrated the Galactic Alliance government on the planet Coruscant. The liberation movement took place over several weeks, with the early stages fought mostly in secret until the dark side entity Abeloth sparked widespread devastation by causing seismic and volcanic activity across the planet surface. The conflict ended with the destruction of the Lost Tribe and the Assault on the New Jedi Temple and the Destruction of one of Abeloth's bodies in the New Jedi Temple, which coincided with the Duel at the Font of Power where the last body of Abeloth was killed by Jedi Knight Ben Skywalker and Vestara Khai, and finally her Force essence which brought about her final if not permanent death at the hands of Grand Master Luke Skywalker and Darth Krayt. Luke believed that Abeloth would return from death, so he sent a dozen Jedi Knights to look for the Mortis monolith and the planet Mortis to retrieve the Dagger of Mortis that killed The Ones."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "The Jedi Order had retreated from Coruscant in the weeks before the battle as a ploy to draw the members of the Lost Tribe out into the open. Following the failed attempt to find Abeloth on Upekzar, the Jedi began to return to the capital in groups of twos and threes, disguised in order to evade the Sith infiltrators in Coruscant security. The Tribe had increased security at immigration, knowing that the Jedi would be coming back to the planet."}, {"tag": "p", "text": "As a way of alienating the Jedi, the Sith-controlled BAMR News network had begun an anti-Jedi propaganda program that presented the Jedi Order as the \"Jedi spice cartel\". Grand Master Luke Skywalker was described as the overlord of the cartel, and the Jedi were cast as violent criminals who ran spice to fund their anti-Freedom Flight and anti-GA activities. The network's main reporter, a Sith Saber named Kayala Fei, used a Force technique to lull her viewers into a receptive state of mind, effectively a wide-scale mind trick. Another member of the Tribe, Jestat Vhool, was masquerading as the superintendent of Galactic Alliance Security and was \"investigating\" the Jedi as a way of furthering their ruse."}, {"tag": "p", "text": "Apart from an incident where Vestara Khai was recognized by Ruku Myal, a member of the Tribe, and Luke and Vestara were forced to kill him, the infiltration was successful. Yaqeel Saav'etu and Yantahar Bwua'tu were nearly discovered by the Sith, but Bazel Warv was able to make it look like the three were simply spice smugglers. They were captured by GA Security, but easily escaped."}, {"tag": "h2", "text": "The battle"}, {"tag": "h3", "text": "The Jedi deliver an ultimatum"}, {"tag": "p", "text": "After the Jedi regrouped, they began their preparations for the upcoming battle.\nThey spread out across the planet's surface, targeting the Sith impostors. Just before they began the attack, the Jedi sent a single message to every single member of the Tribe on Coruscant: \"Surrender or die. Decide now.—The Jedi Order\". Simultaneously, the Jedi began to strike at the Sith, eliminating them one by one. Jestat Vhool died when he leapt out of his speeder, believing there was a bomb, and was crushed by a falling scaffold dropped by Jedi Master Corran Horn. Kayala Fei was killed by Octa Ramis when the Sith leapt out of the way of a falling piece of equipment after receiving her message, but jumped straight into a live electrical wire. Many Sith met similar ends, but some escaped by taking hostages—Jaina Solo, Jysella Horn, and Valin Horn were unable to kill Lord Tela Rovas, who masquerading as a Chief Justice, when she used fellow judge Robr Selvi as a shield. The Jedi had agreed that in order to minimize collateral damage, any civilians who got in the way would not be harmed."}, {"tag": "p", "text": "One of the primary target of the assassinations was High Lord Ivaar Workan, who was disguised as Senator Kameron Suldar. Jedi Knight Ben Skywalker and his girlfriend, Sith-turned-Jedi apprentice Vestara Khai, were sent as diversions to Suldar's office to distract the High Lord until the other Jedi began to attack the Sith across Coruscant, at which time Grand Master Luke Skywalker and Jedi Knights Doran Sarkin-Tainer and Seha Dorvald would arrive. The duel resulted in Workan's death, along with at least five of his Sith guards."}, {"tag": "h3", "text": "The assault on the Temple"}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "After the second assault on the Temple, many Sith escaped from the Temple and fled across Coruscant, forcing the Jedi to pursue them. This, combined with the widespread devastation from the seismic and volcanic activity caused by Abeloth, left much of Coruscant in flames and ruins. Much of the undercity was heavily damaged, and they were also plagued by death clouds—massive clouds of ash, toxic smoke, and poisonous gas that were trapped in the lower levels of Coruscant. Less than a month after the battle, the number of casualties was estimated to be in the billions."}, {"tag": "p", "text": "A provisional government for the Galactic Alliance was formed under acting Chief of State Wynn Dorvan who had to deal with not only the difficult situation on Coruscant but also with the new movement of anti-Jediism brought about by the Lost Tribe's actions to discredit them, namely through subcommittee investigation and the accusations of them being a spice cartel. The situation on Coruscant did not help the situation and the Senate eventually decided to remove the Jedi from Coruscant. They had garnered enough votes to override the Chief of State's veto and Luke Skywalker agreed to move the Jedi to their hidden base on Shedu Maad."}, {"tag": "p", "text": "A suggestion was made by the newest member of the Jedi Council, Jedi Master Jaina Solo, that Dorvan introduce a resolution that would make any attempt to infiltrate the Galactic Alliance an act of war as a means to discourage the Sith from returning. Dorvan agreed but it is unknown if the Senate approved this resolution."}, {"tag": "p", "text": "Dorvan was later elected permanent Chief of State of the Galactic Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}