{"url": "Liberation_of_Kessel", "categories": ["Category:Legends articles", "Category:Battles of the Galactic Civil War", "Category:Battles of Kessel"], "nodes": [{"tag": "h1", "text": "Liberation of Kessel"}, {"tag": "p", "text": "The Liberation of Kessel was a battle conducted in 4 ABY. A Wookiee army landed on Kessel to re-power the atmosphere factories and rescue the slaves."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "After the Galactic Empire lost the Battle of Endor in 4 ABY, it was decided to abandon Kessel. The atmosphere factories were shut off, although the slaves were forced to continue working the Glitterstim spice mines. The Wookiees, shortly after liberating their homeworld, heard of the situation and sent a strike force to reactivate the atmosphere factories."}, {"tag": "h2", "text": "The battle"}, {"tag": "p", "text": "Generals Han Solo and Lando Calrissian, Chewbacca, and the Jedi Knight Luke Skywalker and and a force of Wookiees: 6 workers, 8 Repeater Bowcaster troopers, 4 Advanced Berserkers, 4 Missile Troopers, 2 Heavy Torpedo Launchers, 1 Kettrifee Air Mover, and 8 Advanced Agrs. The strike force established a base, consisting of a troop center, a Command center, a Fortress, and a shield generator on a cliff north of the Imperial's Detention Center A, Detention Center B, and Detention Center C. The Wookiee forces endured attacks from the Imperial military bases which sent stormtroopers and All Terrain Armored Transports, but with additional units, the Wookiees were able to construct power cores and reactivate the four nearby atmosphere factories."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "The Imperials lost control of Kessel, and the slaves were freed after the battle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Liberation of Kessel was first mentioned in the strategy guide for the 2001 video game Star Wars: Galactic Battlegrounds. It appeared during the Chewbacca campaign's bonus mission. The player was tasked with re-powering the atmosphere generators, and may build any sized army to do so. Players could attack or ignore the Imperial bases; the strategy guide recommends the player just concentrate on building the power cores."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}