{"url": "Liberator-class_starfighter", "categories": ["Category:Legends articles", "Category:Ship stubs", "Category:Eternal Alliance starship classes", "Category:Galactic Republic starfighter classes"], "nodes": [{"tag": "h1", "text": "Liberator-class starfighter"}, {"tag": "p", "text": "The Liberator-class starfighter, known by the reconstituted Sith Empire as the Talon fighter, was a model of fighter used by the Galactic Republic prior to and during the Great Galactic War."}, {"tag": "p", "text": "One of the ship's variants was the Striker-class, mostly used by Jedi Master Satele Shan."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Liberator-class starfighter served as the primary defense against the Mk VI and Mk VII Imperial interceptors employed by the reconstituted Sith Empire during the Great Galactic War and the Cold War."}, {"tag": "p", "text": "Like other starfighters and smaller transport designs of the era, excluding a few notable exceptions like the Defender-class light corvette, the Fury-class Imperial interceptor, the BT-7 Thunderclap assault ship, and the X-70B Phantom-class prototype transport, the Liberator-class did not have hyperdrive engines.\nThis forced their pilots to rely on larger ships, such as the Thranta-class corvette and Valor-class cruiser to carry them to their destination."}, {"tag": "p", "text": "A different model of the fighter, known as the Striker-class, had additional room for an astromech droid and lightsaber storage."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "These starfighters were used to escort a diplomatic convoy of Republic transport ships to investigate unidentified starships that had invaded the Tingel Arm of the galaxy. They were obliterated by the forces of the Sith Empire's navy. Several fighters were also used to reclaim Alderaan following the battle of the same name."}, {"tag": "p", "text": "These fighters later served as the primary starfighters during the Great Galactic War and the subsequent Cold War against Mk. VI Imperial interceptors used by the Imperial Navy. They were loaded onto the Republic's Thranta-class corvettes and Valor-class cruisers."}, {"tag": "p", "text": "The Jedi Master Satele Shan was known to use the Striker-class variant on missions for the Republic."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Striker variant of the Liberator-class starfighter appears in the 2012 LEGO Star Wars set 9497 Republic Striker Starfighter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}