{"url": "Liberator_(Venator-class)", "categories": ["Category:Canon articles", "Category:Venator-class Star Destroyers of the Galactic Empire"], "nodes": [{"tag": "h1", "text": "Liberator (Venator-class)"}, {"tag": "p", "text": "The Liberator was a Venator-class Star Destroyer belonging to the starfleet of the Galactic Empire. Five years after the inception of the Empire, it was parked at R/M Facility Four deepdock at Belderone."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "In its dorsal flight deck, there were passing starfighters, ground-effect vehicles and, at least, one Theta-class T-2c shuttle."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Stationed at Belderone"}, {"tag": "p", "text": "In 14 BBY, the Liberator was stationed at the world Belderone, home to an Imperial naval base and the R/M Facility Four deepdock, along with several CR90 corvettes, two Carrack-class light cruisers, and several Victory-class Star Destroyers. At the same time, Imperial Moff Wilhuff Tarkin and Sith Lord Darth Vader were dispatched to the Outer Rim planet Murkhana to investigate a cache of suspicious communications devices. In reality, the cache was a trap to goad the Moff to the planet, allowing a rebel cell to steal Tarkin's prized corvette, the Carrion Spike, while he was investigating the counterfeit equipment."}, {"tag": "p", "text": "The thieves immediately traveled to the Galidraan system, where they attacked the Empire's Galidraan Station with the Carrion Spike's advanced weaponry and cloaking technology. Although Vader and Tarkin managed to track the stolen craft to the station and damage its hyperdrive, the corvette fled soon after. Fearing the rebels would move on to attack another Imperial site, Tarkin contacted a colonel on Galidraan Station and requested a list of local systems that hosted Imperial resources. When Belderone was mentioned, Tarkin asked which ships were kept at the world's deepdock, information which the colonel also supplied. Deducing that the planet Nam Chorios would likely be the insurgents' next target, Vader and Tarkin requested the colonel instruct Belderone to send the Liberator there."}, {"tag": "h3", "text": "Hunting the Carrion Spike"}, {"tag": "p", "text": "As ordered, the captain of the Liberator commandeered the starship to Nam Chorios, where instead of facing the insurgents, the ship was boarded by Tarkin and Vader shortly before the attack on Lucazec, when the Liberator received Teller's HoloNet transmission of the attack. Though Vader left the ship as soon as the Goliath arrived from Coruscant with his personal starfighter, Tarkin stayed at the Liberator's data center for several hours. Finally, he asked the Liberator's captain to provide him with a shuttle for his personal use so as to rendezvous with the Goliath. Afterwards, instead of returning to Belderone, the Liberator was deployed to Ord Cestus, down the Perlemian Trade Route, as a result of the attack on the TaggeCo mining facility."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Liberator first appeared in Tarkin, a novel written by James Luceno and released in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}