{"url": "Liberty_(Venator-class)/Legends", "categories": ["Category:Legends articles", "Category:Flagships", "Category:Ships of the Open Circle Fleet", "Category:Venator-class Star Destroyers"], "nodes": [{"tag": "h1", "text": "Liberty (Venator-class)"}, {"tag": "p", "text": "The Liberty was a Venator-class Star Destroyer that served as the flagship of General Aayla Secura's fleet during the Clone Wars."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Liberty was a Venator-class Star Destroyer in the Republic Navy during the Clone Wars between the Republic and Confederacy of Independent Systems. Manufactured by Kuat Drive Yards, the Liberty had several DBY-827 heavy turbolaser turrets, at least one deflector shield generator equipped, a pair of command towers, and engines equipped. The Star Destroyer also had a hangar bay built into its belly, large enough to fit a Charger c70 retrofitted Consular-class cruiser. The belly hangar bay also had an airlock that allowed other starships to dock with the Liberty."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Sky Battle of Quell, General Secura's fleet was attacked by several Munificent-class star frigates under the command of a tactical droid. All three Republic destroyers sustained heavy damage and called for aide from General Skywalker, who quickly arrived with Admiral Yularen and his Padawan, Commander Ahsoka Tano in the Resolute."}, {"tag": "p", "text": "The Resolute arrived in time to launch three LAAT/i gunships to board the Liberty and extract all Republic personnel. Rocket droids took notice of the new arrivals and were distracted enough to break off and intercept them. Skywalker, Tano and Captain Rex joined Secura and Commander Bly in fighting the droids aboard their cruiser. However, the Separatist tactical droid commander, too impatient to wait for the rocket droids to finish their mission, ordered the cruiser destroyed. Skywalker called a Consular-class frigate for the evacuation, and sacrificed himself to save the others from a raging inferno caused by the increasing laser fire. Tano and Secura managed to drag him aboard the frigate shortly before the cruiser was destroyed."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}