{"url": "Liberty/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Flagships", "Category:Liberty task force ships", "Category:MC80 Liberty type Star Cruisers"], "nodes": [{"tag": "h1", "text": "Liberty"}, {"tag": "p", "text": "The Liberty was an MC80 Star Cruiser that served in the Alliance Fleet during the Galactic Civil War. It was the namesake of the Liberty type subclass. During the Battle of Endor, the Liberty was the first Rebel ship destroyed by the second Death Star battlestation."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Liberty was due to be the original recipient of the Death Star plans according to Operation Skyhook; however, the sudden appearance of the Imperial-class Star Destroyer Immortal caused the transfer of the plans from the Tantive IV to stop. Keyan Farlander and Hamo Blastwell, in R-22 Spearheads, helped two X-wings from the Liberty fight off the Imperial forces while both ships escaped and the corvette moved to Tatooine."}, {"tag": "p", "text": "Shortly after the Battle of Hoth, the Liberty was one of the most active cruisers in the Rebel fleet. Under the command of Admiral Yamarus, the cruiser and its task force repeatedly led raids and \"hit and run\" strikes against Imperial facilities and warships. When information came to light on a series of raids being carried against civilian merchants in the Vilonis sector, the Liberty was sent to investigate."}, {"tag": "p", "text": "Operating alone, it uncovered details about a series of Imperial experimental starfighters and proceeded to shut the TIE Experimental Project down. At this stage, her Tactical Officer was Commander Kupalo, an Imperial double-agent. At some point, it also was instrumental in setting up a mutual cargo-retrieval operation with Dunari as well as destroying a pirate group, the Hurrim."}, {"tag": "p", "text": "The Liberty became a famous Rebel warship during its service in the Airam sector, wherein, with Rogue Squadron aboard, it assisted in the destruction of the Executor-class Star Dreadnought Vengeance, suffering heavy damage in the process."}, {"tag": "p", "text": "It also participated in the recovery of Imperial defector Commander Zaletta, who played a key role in acquiring the second Death Star plans, and later served as the Liberty's tactical officer."}, {"tag": "p", "text": "Rebel pilot Ace Azzameen served aboard the cruiser for much of the period leading up to the Battle of Endor. Azzameen was famous for flying in the strike team responsible for the capture of the shuttle Tydirium and was possibly part of Lando Calrissian's crew—possibly a gunner—on the Millennium Falcon during the battle."}, {"tag": "p", "text": "Following the discovery of the second Death Star, the Liberty was recalled to the main Alliance fleet in preparation for the Battle of Endor in 4 ABY. The Liberty was lost during the battle, gaining the dubious distinction of being the first ship destroyed by the new Death Star's superlaser."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Because of her frequent appearances in video games (such as Azzameen's headquarters), the Liberty is one of the more commonly known Mon Calamari Cruisers."}, {"tag": "p", "text": "The exact designation and specifications of this vessel are still matters of speculation, since the frequent appearances of Mon Cal Cruisers in books, games, films, and supplemental materials are rarely consistent."}, {"tag": "p", "text": "The Liberty has lent its name to a visual layout of the Mon Cal Star Cruiser, in that any subsequent winged cruiser of approximately 1.200 meters length is classified as a MC80 Liberty type Star Cruiser."}, {"tag": "p", "text": "Due to not having another Mon Calamari Star Cruiser model but the MC80a, the Liberty is depicted as such in Star Wars: X-Wing vs. TIE Fighter. However, in one of the detailed cutscenes it appeares as a Home One-type ship."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}