{"url": "Liddle", "categories": ["Category:Canon articles", "Category:Alliance to Restore the Republic members", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Liddle"}, {"tag": "p", "text": "Liddle was a human male member of the Rebel Alliance. After the Battle of Yavin, Liddle traveled to the planet Tibrin as part of a diplomatic mission with fellow Rebels Luke Skywalker, Leia Organa and Tadd. Liddle was extremely excited to meet Skywalker due to his exploits during the Battle of Yavin, and on Tibrin he and Tadd questioned Skywalker about his work with the Alliance, drawing the attention of a KX-series security droid. This led to an Imperial attack on the Rebels in which Liddle was injured and Skywalker captured."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Working with a hero"}, {"tag": "p", "text": "The human male Liddle was a member of the Rebel Alliance after the Battle of Yavin. Liddle was sent on an important mission to the planet Tibrin with the Jedi Padawan Luke Skywalker, Princess Leia Organa and Tadd."}, {"tag": "p", "text": "Skywalker, Tadd, and Liddle piloted the starship Breha together in order to reach the planet, and as they approached Tibrin, Skywalker ordered Liddle to set up an orbit pattern. Despite the Imperial presence on Tibirin, the ship was cleared to land, causing Liddle and Tadd to theorize that the Empire was trying to recover from the Battle of Yavin, where Skywalker had destroyed the Imperial Death Star superweapon."}, {"tag": "h3", "text": "Loose lips sink ships"}, {"tag": "p", "text": "Upon setting down on an ocean landing pad in Tibrin's capital city of Tibrina, the four Rebels disembarked together and while Organa greeted the Ishi Tib Mariod Govi, Liddle and Tadd questioned Skywalker about his past exploits in service of the Rebellion. The duo were overheard speaking about Rebel activity by an Imperial KX-series security droid, triggering an almost immediate attack on the Rebels by Imperial stormtroopers firing from a neighboring landing pad. During the fighting, Liddle was knocked to the floor and injured by the stormtroopers fire. On Organa's orders, Tadd then tried to throw a grenade at the Imperials, but was struck by a blaster bolt mid-throw and so dropped the explosive."}, {"tag": "p", "text": "The grenade the rolled toward Skywalker and exploded, knocking the Jedi unconscious and causing the platform that Organa, Tadd, Liddle and the Breha were stood on to sink into Tibrin's oceans. Organa managed to climb aboard the pad that the the Imperials had been standing on and witnessed them capture an unconscious Skywalker. While Liddle and Tadd were recovering from their injuries, Organa managed to infiltrate the Imperial-class Star Destroyer Stormbringer were Skywalker was being held and rescue him, escaping with the aide of the Ishi Tiib after they chose to stand against the Empire. Liddle, with a bandage around his head and his right arm in a sling, was then present when Organa met again with Mariod Govi, who apologised for the fact that the Ishi Tiib had not intervened against the Imperials sooner."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Liddle was extremely excited to work with Luke Skywalker and spoke to him about his various heroic exploits with the Alliance, even doing so in public where they could be overheard by Imperials. He had no combat experience prior to the mission to Tibrin, but pretended he did when Skywalker asked. Liddle had fair skin and brown eyes and hair."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Liddle wore a Rebel uniform that included a dark brown jacket over a blue shirt with black, fingerless gloves, a black belt and black boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Liddle first appeared in comic \"The Trouble at Tibrin\", which was written by Landry Q. Walker and published in Star Wars Adventures 4 on November 29, 2017. The comic identified the character only as Liddle, but Walker provided the characters first name and expanded on his backstory on Twitter, revealing that the character and his name were inspired by the late Star Wars fan film maker John Liddle. Walker stated that Liddle's first name was Jaahn and that at one point he was a spice addict and was imprisoned by the Galactic Empire on Oreenda Fayeet. After the Rebel Alliance freed him from imprisonment, Liddle joined their cause."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}