{"url": "Lieutenant/Legends", "categories": ["Category:Legends articles", "Category:Law enforcement ranks", "Category:Military ranks"], "nodes": [{"tag": "h1", "text": "Lieutenant"}, {"tag": "p", "text": "Lieutenant was a rank widely used in military, paramilitary or police organizations, normally borne by low-ranking commissioned officers. It was higher than a second lieutenant and lower than a captain."}, {"tag": "p", "text": "In space fleets, most lieutenants were found in command of small vessels, as senior officers aboard medium-sized vessels and as junior and mid-ranking command personnel on large capital ships."}, {"tag": "p", "text": "Surface forces often saw lieutenants holding the lowest level of field commands (such as platoons in the Imperial Army), as aides to more senior officers, or as vehicle operators. Sometimes, clone lieutenants were given command of fleets and ground forces. One such person was clone trooper Lieutenant Trapper, who led a platoon of men at the Battle of Malastare."}, {"tag": "p", "text": "Starfighter forces placed lieutenants as junior officers, rarely any higher in the command hierarchy than lead of a wing-pair. Even a flight of three or four fighters was rarely led by a lieutenant, although exceptions were made when there was a general lack of senior or experienced officers. In the months before the Battle of Yavin, Hamo Blastwell even commanded Red Squadron as a lieutenant."}, {"tag": "p", "text": "Within the Empire, the rank of lieutenant had two different insignias, each representing a specific time period. Prior to the Battle of Yavin, the rank of lieutenant was represented by four blue squares and two code cylinders. In addition, the rank of lieutenant or higher was required to man the Command sector duty posts onboard the Death Stars, as well as given the task of supervising the command sectors. In the aftermath of Yavin, due to the events resulting from the destruction of the first Death Star, it was represented by an interim plaque of two red squares above two blue squares, and one code cylinder that was in effect until the reorganization had been concluded. Fleet Admiral Holt implied during his indoctrination speech at the Imperial Naval Academy that the rank of lieutenant is earned by spending 30 months of rigorous physical and academic training at the academy."}, {"tag": "p", "text": "Somewhat confusingly, in the starfighter forces of both the Imperial military and the New Republic, the title \"lieutenant\" could be used to address not only flight lieutenants, but also the more junior flight officers."}, {"tag": "p", "text": "In the Rebel Alliance's starfighter corps pre-Battle of Hoth the rank of lieutenant stood between flight officer and captain and was identifiable via a silver patch on the left shoulder with two yellow bumps, one on the top-center and the bottom-center, respectively. Post-Battle of Hoth, it ranked between Lieutenant Junior Grade (a then-recent addition) and captain, and the insignia was subsequently changed to a patch with a gold trim-border and a red dot in the center, though as before it was placed on the left shoulder of the uniform. The rank of captain during the latter time period did, however, possess a similar rank insignia to that of lieutenant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}