{"url": "Life,_Death,_and_the_Living_Force", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 1"], "nodes": [{"tag": "h1", "text": "Life, Death, and the Living Force"}, {"tag": "p", "text": "Life, Death, and the Living Force is a 15-page comic featured in Star Wars Tales #1, written by Jim Woodring. It takes place in 44 BBY. It was collected in Star Wars Tales Volume 1 and Star Wars Legends Epic Collection: Rise of the Sith Vol. 1."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "On the planet of Arorua, a young Obi-Wan Kenobi narrowly escapes death at the hands of a squollyhawlk. He seeks out his Master Qui-Gon Jinn, who has a small, obnoxious Moggonite named Mosko Bolpa on his shoulder. They take him back to their camp, where he annoys Obi-Wan to no end, but gets fed by Qui-Gon, for which he is less than grateful. Mosko leaves, and, in the middle of the night, brings what is apparently his clan to the camp in an attempt to kill the two Jedi and steal everything they have. They are unsuccessful, as the Jedi end up killing every last one of them. Qui-Gon suggests they find a new camp, fearing that more of them will come."}, {"tag": "p", "text": "While searching for a new campsite, Obi-Wan asks Qui-Gon why he originally fed and took care of Mosko, then killed him without a hint of remorse. Qui-Gon explains that everything he does is dictated by the Living Force; if Mosko had killed him, he would not have been able to do his job as a Jedi. Obi-Wan points to a nearby mountain as a new campsite, but as they get closer to it, it starts looking incredibly horrific. Qui-Gon explains that it's a sacrificial altar to a silan. Qui-Gon says that he must go in; that the Living Force is directing him. Obi-Wan reluctantly goes with him, and the two ruthlessly kill the massive silan inside."}, {"tag": "p", "text": "When the two Jedi have set up camp nearby, Obi-Wan asks if and why that was really the right thing to do. Qui-Gon says that the Living Force is a mysterious thing, and he doesn't know why it told them to carry out the attack. Despite this, Qui-Gon comforts Obi-Wan, telling him that he \"is in the hands of something much greater and much better than he can imagine.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}