{"url": "Life_Day_orb", "categories": ["Category:Legends articles", "Category:Wookiee culture"], "nodes": [{"tag": "h1", "text": "Life Day orb"}, {"tag": "p", "text": "Life Day orbs were glass-like, shining orbs used in the celebrations of Life Day, a Wookiee holiday. The globes had a variety of uses during the festivities. Small ones were colored and attached to the branches of ornamented trees, while others were kept as memorabilia. Most importantly, Wookiee households displayed such orbs on their tables and gathered around them before joining a silent prayer ceremony."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Life Day orbs were glass-like globes, typically clear, or with a glowing blue hue, and containing a field of stars representing the afterlife. However, other Life Day orbs came in a variety of different colors, such as green, red, and yellow. Unlike the more traditional, crystalline orbs, these brightly colored ornaments were used as festive lamps. While these ornamented orbs glowed and sparkled, they lacked the field of stars seen in their more symbolic counterparts."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The origins of Life Day lay in the culture of the Wookiees, sentient mammals who hailed from the arboreal world of Kashyyyk, with evidence that Wookiees celebrated the holiday by beating tree drums as early as 1,500,000 BBY. Life Day orbs, a Wookiee artifact, were a traditional symbol carried by Wookiees during the Life Day celebrations. The glass-like, shining orbs constituted one of the holiday's most ancient of traditions, as evidenced by its portrayal in a painting titled Ancient Life Day, in which it was seen being carried like a lantern by a Wookiee reveler. The orbs typically contained a field of stars representing the afterlife. The beings of Kashyyyk believed that when when they died, they would walk off into the stars. The globes had a variety of uses during Life Day festivities; small ones were colored and attached to the branches of ornamented trees, or hung from the ceiling, while others were kept as memorabilia. Most importantly, Wookiee households displayed such orbs on their tables and gathered around them before joining a silent prayer ceremony. Over time, the tradition of putting up colorful decorations, like Life Day orbs, had spread to other parts of the galaxy. By the end of the Cold War around 3640 BBY, other species and cultures carried Life Day orbs as part of the holiday tradition. A jolly old man known as the \"Master of Ceremonies,\" accompanied by a group of Life Day Revelers, sold Life Day orbs aboard the Galactic Republic's Carrick Station, and the Sith Empire's Vaiken Spacedock, in exchange for gift parcels."}, {"tag": "p", "text": "Later, during the time of the Clone Wars, the hallowed halls of the Jedi Temple were decorated with colored Life Day orbs during their Life Day festivities. By the time of the Galactic Civil War, Life Day had become increasingly important to the Wookiees since the Galactic Empire had enslaved many of their kind. In 1 ABY, the Rebel Wookiee Chewbacca, along with his friends, family, and many other Wookiees, carried Life Day orbs during the Tree of Life ceremony on Kashyyyk. Afterwards, Chewbacca participated in a more intimate ceremony with his family, by gathering in silent prayer around a number of Life Day orbs placed on a table in their home. During other Life Day festivities around this time, Oraalarri the Elder and his family, comprising of Anarra, Radrrl, and Tebeurra, imparted gifts of Life Day orbs to revelers who visited their camps on the Forest Moon of Endor, Yavin 4, and Dathomir. As a culturally significant aspect of the Wookiee holiday, Life Day orbs were featured prominently in several artworks, namely paintings, such as the aforementioned Ancient Life Day, as well as Family Bonds, which depicted Chewbacca's family proudly holding a collection of Life Day orbs. Yet another painting depicted two young Wookiee pups presenting Life Day orbs to one another."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Life Day orbs made their first appearance in the television film The Star Wars Holiday Special, which aired on November 17, 1978. In the script for the film, the glowing orbs are not given a specific name, and are simply referred to as \"globes.\" The globes were first identified as Life Day orbs when they were introduced to the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing games developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Capitalization of the name, however, was somewhat inconsistent. The description for the item fully capitalized it as a \"Life Day Orb,\" whereas discussions with the Wookiee Tebeurra consistently referred to the object as a \"Life Day orb.\" This article assumes the latter form to be correct. In a December 19, 2003 feature titled \"Happy Holidays 2003,\" the developers encouraged players to celebrate Life Day during the months of December and early January. For their part, the developers began dropping numerous Wookiee Life Day orbs and robes in the city halls of player cities that were registered on the planetary map. The developers intended for the mayors of such cities to share the items with their residents. In addition to letting mayors hand out the items, the developers began attending various live events, and handed out orbs to players and merchants to give away or sell. They continued to hand out orbs and robes throughout the months of December and into January, and ensured that the items did not become exceedingly rare. With the release of Publish 11.5 on December 14, 2004, players could receive a Life Day orb from the Wookiee elder Oraalarri, during that year's Life Day event. On December 22, the developers also added a new a level-up item called \"An Energetic Lifeday Orb.\" This item could be looted from various NPCs and creatures, and used in order to grant the player an additional experience level. On January 4, 2006, the celebrations were concluded as part of Publish 26.6, and the Life Day orbs could no longer be obtained. During the Life Day event which premiered on December 12, 2007, players who interacted with one of the large wroshyr trees would receive two gift boxes, one of which would contain a Hanging Life Day Orb."}, {"tag": "p", "text": "Sony Online Entertainment was also responsible for the production of the Star Wars: Clone Wars Adventures video game, yet another MMORPG which featured Life Day orbs during their celebratory events. During the December 17, 2010 update, Republic Credits could be earned by clicking on \"Republic Credit Orbs\" which appeared randomly throughout the Jedi Temple. Credits could in turn be spent on various Life Day-themed items, including a Life Day Decorations Pack which contained various Life Day orbs. Life Day orbs were similarly featured during the game's subsequent Life Day events, up until the game's closure in 2014. Life Day is also featured in the 2011 MMORPG Star Wars: The Old Republic, produced and released by BioWare. As part of Game Update 1.6: Ancient Hypergate released on December 11, 2012, Life Day orbs were made available for sale on the Cartel Market, an in-game microtransaction store in which players exchange Cartel Coins for various in-game merchandise. Starting with the 2015 festivities released as part of Game Update 4.0.3 on December 15,, Life Day orbs, which were originally sold on the Cartel Market, were now sold by the Master of Ceremonies in exchange for gift parcels. However, a new item was made available on the Cartel Market, which spawns a small Life Day orb that follows the player around."}, {"tag": "p", "text": "Two StarWars.com blog posts describe how to make homemade Life Day orbs for a Life Day-inspired real world celebration. One blog post, titled \"DIY Wookiee Life Day Wreaths,\" describes how to make a Life Day Wreath affixed with a Life Day orb, using an ornament filled with blue ribbon. Another blog post, titled \"How to Host a Life Day Celebration,\" describes how to make Life Day orbs using plastic snow globes, flameless tea lights, and rhinestone stickers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}