{"url": "Life_debt/Legends", "categories": ["Category:Legends articles", "Category:Awards", "Category:Gungan culture", "Category:Noghri culture", "Category:Trandoshan culture", "Category:Wookiee culture"], "nodes": [{"tag": "h1", "text": "Life debt"}, {"tag": "p", "text": "The life debt was a social institution found in many honor-bound cultures throughout the galaxy, including the Wookiees, Trandoshans, Gungans, Noghri, Talz, and Srrors'tok. To summarize, if a person's life was saved by another, the saved person was obligated to pledge their life to protecting and looking after their savior, even to the point of sacrificing their own life, if necessary."}, {"tag": "p", "text": "The particularities of this bond, and the overall strength of the institution, varied from culture to culture. Among the Gungans, the bond was fairly loose, while among the Wookiees, the life debt was an extraordinarily solemn matter. Some unscrupulous recipients of a life debt would take advantage of their position by enslaving and otherwise mistreating the unfortunate person sworn to their service."}, {"tag": "p", "text": "In Wookiee culture, this tradition is believed to have started when a young Wookiee named Urothko was nearly killed in the Shadowlands, only to be rescued by an elder called Stalpaac. After being saved, Urothko pledged his life to Staalpac. The story was soon spread to other villages and tribes, thus creating the tradition."}, {"tag": "h2", "text": "Known life debts"}, {"tag": "p", "text": "The Trandoshan Slyssk declared Marn Hierogryph his ghrakhowsk after Gryph faked saving the Trandoshan's life with help from Zayne Carrick."}, {"tag": "p", "text": "The Wookiee Zaalbar swore a life debt to Revan after his rescue from Gamorrean slavers on Taris, continuing his servitude up to at least the Battle of the Star Forge. Another Wookiee, the slaver and bounty hunter Hanharr, believed he owed a life debt to Mira after she defeated him in combat, but spared his life. Hanharr was insulted and enraged both by the mercy she showed and by her refusal to accept his service. Thus, Hanharr was willing to arrange for Mira to be killed to erase his debt. After being defeated but not killed by Mira a second time, his life was saved by Kreia. This new life debt allowed Hanharr to attempt to kill Mira under Kreia's orders."}, {"tag": "p", "text": "Jar Jar Binks's life debt to Qui-Gon Jinn began when the Jedi Master saved his life during the Trade Federation's invasion of Naboo. Binks then served as a guide for Qui-Gon Jinn and Obi-Wan Kenobi up until Qui-Gon Jinn's death."}, {"tag": "p", "text": "The entire Noghri species owed a life debt to, at first, Darth Vader, and later his daughter Leia, when Darth Vader went to Honoghr after the planet was devastated during the Clone Wars. When it was found that Vader had tricked them, several years after his death at Endor and while they were under the control of Grand Admiral Thrawn, they pledged their allegiance to Leia."}, {"tag": "p", "text": "Chewbacca's life debt to Han Solo began after Solo, then an officer in the Imperial Navy, saved the Wookiee from slavery. Chewbacca's debt to Solo later expanded to include his wife Leia Organa Solo, his children Jacen, Jaina, and Anakin, and his brother-in-law Luke Skywalker. However, the Wookiee life debt seemed unique, in that not even the debt could erase Chewbacca's obligation to return to Kashyyyk on Life Day. Also, his life debt was not nullified by death as is with many others. After Chewbacca's death, the life debt was carried on by Chewbacca's son Lumpawarrump and his nephew Lowbacca."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}