{"url": "Light_Infantry_Utility_Vehicle", "categories": ["Category:Canon articles", "Category:First Order vehicles", "Category:Repulsorcraft"], "nodes": [{"tag": "h1", "text": "Light Infantry Utility Vehicle"}, {"tag": "p", "text": "The Light Infantry Utility Vehicle (LIUV), also known as the First Order snowspeeder (or snow speeder), was a wedge-shaped assault craft used in frigid climates. The snowspeeder was manned by one First Order snowtrooper, and could hold two others, one of which could take control of the forward-mounted FWMB-10 repeating blaster cannon. Snowspeeders were present at Starkiller Base during the Battle of Starkiller Base thirty years after the Battle of Endor. The Resistance members Finn and Rey stole one in order to infiltrate the thermal oscillator, a key point of the base. They briefly dueled with three snowspeeders that they managed to disable, and they soon arrived at their destination. Shortly after, their ally the Wookiee Chewbacca borrowed it to return to the starship Millennium Falcon. A year later, an LIUV was present in Hangar 12 of the Steadfast over Kijimi with a different type of forward-mounted blaster cannon in place."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The First Order snowspeeder is one of the vehicles used by the First Order. It appeared as part of merchandise released on Force Friday on September 4, 2015, leading up to Star Wars: Episode VII The Force Awakens."}, {"tag": "p", "text": "For Episode VII, snowspeeders were meant to take part in a chase scene during the Battle of Starkiller Base, when Finn and Rey steal one and have to fight off another First Order speeder during their mission to take down the base's oscillator. Concept art was created for it, but it did not appear in the film. The scene was filmed but subsequently cut, though the deleted scene was included in the bonus features of the home video release of Star Wars: Episode VII The Force Awakens. However, this particular scene was still present in The Force Awakens novelization and later adapted (with major differences to the novelization's depiction) into the episode Perilous Pursuit in the second season of Star Wars: Forces of Destiny. One of these differences was that three speeders pursued Finn and Rey in the episode rather than having only one speeder chase them down in both the deleted scene in the film and the included scene in the novelization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}