{"url": "Arcann", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Alliance individuals", "Category:Cyborgs", "Category:Eternal Empire individuals", "Category:Heads of government and state", "Category:Humans", "Category:LGBTQ+ individuals", "Category:Males", "Category:Redeemed Force-sensitives"], "nodes": [{"tag": "h1", "text": "Arcann"}, {"tag": "p", "text": "Arcann was a Force-sensitive male Human who was the son of Senya Tirall and Valkorion, the \"Immortal Emperor\" of the Eternal Empire of Zakuul. He was the twin brother of Thexan, with whom he led a series of raids against the worlds of the larger galaxy. During the attack on Korriban Arcann was caught in an explosion that took his left arm and scarred the left side of his face, necessitating cybernetic replacements. Subsequently, Arcann became furious at the indifference of Valkorion and attempted to kill him, only for Thexan to intervene and be struck down by Arcann's lightsaber instead. When Valkorion offered to share his power with the Outlander, Arcann attempted to assassinate Valkorion again, which was successful, killing Valkorion's physical body while his spirit attached himself to the Outlander, whom Arcann trapped by freezing in carbonite. Arcann assumed his father's Eternal Throne and led the Eternal Empire in a massive invasion of the larger galaxy, which prevailed over both the Sith Empire and the Galactic Republic within a year, forcing them pay tribute and making Zakuul the dominant power in the galaxy."}, {"tag": "p", "text": "Arcann ruled as Emperor for five years after his father's death, until the Outlander was rescued from carbonite and started a war against Zakuul. During the Battle of Odessen, Arcann was defeated by the Outlander and taken by his mother to recuperate, while Arcann's sister Vaylin along with SCORPIO took over the Eternal Throne in his absence. After being healed on Voss, Arcann returned to Zakuul to aid the Outlander against his sister, joining the Alliance."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Arcann and his twin brother were sons of the \"Immortal Emperor\" of the Eternal Empire of Zakuul, and Senya Tirall, a member of Valkorion's elite guard from the ranks of the Knights of Zakuul. As children, Arcann and Thexan would often swap clothes to confuse their servants. Senya loved the twins but they didn't return her affections, even after their sister Vaylin was born. The children played together, sparring in the shadow of the Eternal Fleet or running away and living in the Endless Swamp for a month. The twins were trained from childhood to be warriors, but Arcann gradually became resentful of their father's apparent lack of interest or affection towards them, his resentment growing as the years passed, despite Thexan's attempts to placate him. Eventually, when Vaylin began displaying dangerously unstable power, Valkorion locked her away on Nathema to contain her powers. When Senya attempted to leave Valkorion and take her children, Arcann and his siblings simply laughed, calling her weak."}, {"tag": "h3", "text": "Injuries and Fratricide"}, {"tag": "p", "text": "When the twins reached adulthood, Arcann retrieved Vaylin from her prison in the Sanitarium on Nathema. Upon arriving on the planet, Arcann discovered it was devoid of the Force and felt his corrupting presence on his mind. Later, when Valkorion presented Vaylin with her first lightsaber, Arcann and Thexan moved to defend their father when she ignited her blade, only to hold back at his command. To their relief, Vaylin deactivated her lightsaber and knelt down before Valkorion."}, {"tag": "p", "text": "By 3636 BBY, Arcann and Thexan requested their father's permission to lead an attack to test the strength of the galactic powers of the greater galaxy. Valkorion approved their venture, but decreed that only Thexan would lead the Eternal Fleet, ordering Arcann to remain on Zakuul. Arcann disobeyed his father's wishes and joined his brother anyway. They fought on many worlds, driving back the Galactic Republic and the reconstituted Sith Empire, before finally striking at Korriban."}, {"tag": "p", "text": "They clashed with the Sith under the command of Darth Atroxa in the Valley of the Dark Lords. During the battle, Arcann was grievously wounded in an explosion that took his arm and left the left side of his face scarred. The prince was taken away from the battle to an encampment, where he was operated upon. By the end of the ordeal, Arcann had been fitted with a replacement cybernetic arm, the left side of his face hidden behind a durasteel mask made to conceal the prince's burnt face. The following day, Arcann was on his feet again and led a renewed assault, killing Darth Atroxa after he used his new cybernetic arm to twist her wrist."}, {"tag": "p", "text": "Returning to Zakuul, Arcann and Thexan presented the lightsabers of the fallen Jedi and Sith as trophies from the battle to their father. However, Valkorion turned away in silence, and overcome by the dark side of the Force, Arcann became furious and attempted to attack the Emperor. Thexan, in an attempt to prevent his father's death, pulled his brother back. Arcann turned his attention to Thexan and struck out at him, but their brief duel ended when Arcann struck his brother down with a cut across the stomach, and the glint of the dark side faded from his eyes while he cradled Thexan. After his brother's passing, Valkorion instructed Arcann, now his only son, to come with him."}, {"tag": "h3", "text": "Eternal Empire conquest"}, {"tag": "h4", "text": "Becoming the Eternal Emperor"}, {"tag": "p", "text": "Arcann later attempted to inform his father of a joint Imperial-Republic fleet approaching their territory, but Valkorion was already aware, and sent the Eternal Fleet to intercept them. In the aftermath of the battle, Arcann recovered two survivors, Darth Marr and the Outlander, whom he brought directly to his father on his Eternal Flagship. Before they entered the Eternal Throne room, Arcann was approached by the Scion Heskal, whom he mocked for still putting faith in the catastrophe the Scions foretold before dismissing him."}, {"tag": "p", "text": "Arcann then brought the prisoners before Valkorion, whom they identified as the former Sith Emperor of the Sith Empire. When Valkorion offered them a chance to kneel, Darth Marr refused and was executed for his defiance. Vaylin then ordered the Knights and the Scions to clear the room, leaving Arcann, Valkorion and the Outlander alone. As Valkorion extended his offer to share his Empire with the Outlander, Valkorion was soon afterwards struck down, killing his physical body while his spirit attached himself to the Outlander, who was incapacitated by the experience. Arcann assumed his father's Eternal Throne and as the new Emperor of Zakuul, pinned his father's murder on the Outsider, using it as an excuse to launch an attack on the Core Worlds. However, he sensed that Valkorion's spirit was inhabiting the Outlander's body and had the Outsider frozen in carbonite."}, {"tag": "p", "text": "Arcann's war was swift and brutal, his forces prevailed over both the Sith Empire and the Galactic Republic within a year. Both sides, represented by the Galactic Senate and the Minister of Logistics respectively, signed formal treaties with Zakuul, which demanded regular tribute in raw materials and placed them under strong arms limitation statures, making them incapable of challenging the Eternal Empire directly and making Zakuul the dominant power in the galaxy. For all intents and purposes, Arcann held dominion over the galaxy, though he ignored the animosity between Republic and Empire, who were more intent on fighting each other than uniting against Arcann. Soon after ascending to the throne, he enacted a Scion massacre, which intended to wipe the order of Scions of Zakuul entirely for believing in prophecies and pre-ordained order of things, which Arcann detested. Arcann also allowed the heretical Heralds of Zildrog to rule the Old World of Zakuul while also implementing many restrictions that effectively left them powerless. He was also brutal on dissidents, branding those who questioned his rule or followed the religion of the Old Ways as traitors, forcing many of them into exile. His rule solidified, Arcann ruled the Eternal Empire unchallenged for five years after his father's death."}, {"tag": "h4", "text": "The Outlander escapes"}, {"tag": "p", "text": "In 3631 BBY a former Sith Intelligence Minister Lana Beniko and an exiled Zakuulan naval officer Koth Vortena managed to free the Outlander from carbonite and escape pursuit by Vaylin and Zakuulan Knights, to Arcann's displeasure. The Emperor determined that the escaped prisoner would try to hide in the Endless Swamp and send Skytrooper forces to sweep the area with large metallic sensor reading. However, the dissidents managed to locate the Gravestone, a legendary starship that once overpowered the Eternal Fleet, and get it airborne. Arcann ordered the Eternal Fleet to blast the vessel as it tried to escape Zakuul, only to witness as one omnicannon blast from the Gravestone destroyed more than two dozen Eternal Fleet warships before jumping into Hyperspace. Later, Vaylin was able to confirm that the Outlander was aided by their mother, who turned on their children and went rogue after the Scion massacre. Though Vaylin wondered whether Senya was aware of Valkorion's survival inside the Outlander's mind and was attempting to restore his rule, Arcann claimed that it was irrelevant, vowing that their mother would either return to them or face the consequences."}, {"tag": "p", "text": "Not long afterwards, the Outlander and Senya had returned to Zakuul and were spotted in the Old World. When Vaylin informed her brother about this development, Arcann wondered why their foes would escape only to return and publicly informed the denizens of Old World to watch out for the fugitives. Unexpectedly, the leader of the Scions-in-hiding Heskal contacted Arcann and revealed that the Outlander was present on the Asylum shadowport, acting in accordance with the prophecy he witnessed. Arcann ordered the Eternal Fleet to deploy, boasting that the Outlander would not be able escape."}, {"tag": "h4", "text": "Battle of Asylum"}, {"tag": "p", "text": "Arcann made his way to Asylum before his Eternal Fleet did and personally executed five Scions in the the Scions' hideout before impaling Heskal on his lightsaber just as the Outlander arrived to meet with him. Arcann then offered the Outlander to peacefully return to carbonite until a way to exorcise Valkorion from his mind is found and surrender the Gravestone, in exchange for letting all of the Outlander's companions to leave freely. His terms were refused, and Arcann engaged the Outlander in combat just as the Eternal Fleet emerged from hyperspace and started bombarding the shadowport. The fight was interrupted by a shuttle that crashed into the hideout, allowing the Outlander to flee the scene. Arcann then went to the Control Spar which controlled the docking clamps preventing the Gravestone from leaving. When the Outlander arrived and released the docking mechanisms, Arcann engaged his foe again, destroying the droid HK-55 in the process. However, Arcann was knocked out from the Control Spar to the levels down below, allowing the Outlander and their companions to return to the Gravestone and escape. In the aftermath of the battle of Asylum, Arcann informed Vaylin that Valkorion's power has been diminished."}, {"tag": "p", "text": "Upon their return to Zakuul, Arcann began brooding over the fact that Valkorion was now plotting against his own children. Vaylin mentioned that she revealed to Senya during the duel on Asylum that Thexan was slain by Arcann and not killed during the fighting in the Core Worlds, as was publicly announced. Mildly sentimental, Arcann remarked that Thexan should be alive, ruling the Empire alongside his brother and sister as it was meant to be ruled."}, {"tag": "h4", "text": "An open revolt"}, {"tag": "p", "text": "Despite a widespread search for the Gravestone and the Outlander that Arcann ordered, neither Vaylin nor the Eternal Fleet patrols were able to located them for weeks. Losing patience, Arcann ordered Vaylin to bombard one inhabited world in five sectors each, hoping to either lure the Outlander out of hiding or give someone else an incentive to reveal their whereabouts. As his order was being carried out, the Outlander visited Zakuul once more and allied with the local terrorist and anarchist Firebrand for a raid on Overwatch, destroying the controls for the droids that maintained Zakuul capital city of the Spire, plunging it into chaos. Arcann used this attack as an excuse for the bombardments, claiming that the targeted worlds supported the Outlander and that the attacks were retaliation for the acts of terrorism on Zakuul. Blaming the Knights of Zakuul for their inability to apprehend the Outlander, Arcann ordered them to fight to the death in the dueling circle in pairs as a punishment and a motivation. Vaylin voiced her concern that their search efforts would be impaired with their number of Knights cut in half, but Arcann ignored her."}, {"tag": "p", "text": "The Outlander by this point had formed an Alliance against the tyranny of Zakuul, which made increasingly bold strikes against the Eternal Empire, while the whereabouts of its headquarters remained a mystery to Arcann and Vaylin. Arcann voiced Vaylin his frustrations at their father for refusing to face him in open combat, to which Vaylin suggested that Valkorion was punishing Arcann for stealing his throne. Arcann countered that their father was completely devoid of emotions all their lives, not even acknowledging him murdering Thexan. As Vaylin became nostalgic regarding their late brother, Arcann asked whether he still had her support, which Vaylin affirmed."}, {"tag": "p", "text": "The Alliance then struck at Vandin, where the Eternal Empire's stealth treasury ship, the Gilded Star, was hiding in the atmosphere of the gas giant. As it went up for its annual resupply, Alliance operatives raided it and escaped with its treasure hull's content just as Vaylin arrived to inspect the ship. Upon her return to Zakuul, Arcann interrupted his sister's fantasies of revenge against Senya by asking whether she remembered their mother from when they were children. Vaylin refuted her strong belief that Senya hated her for being more powerful, with Arcann agreeing that Senya never truly understood her children or their father. Though Vaylin reminded that the Outlander and Senya stole their valuables, which would inspire other worlds to rise up in rebellion, Arcann assured her that the riches could be replaced and fear of his power would discourage any further uprisings."}, {"tag": "p", "text": "Arcann and Vaylin later observed a real-time holographic report of a Mandalorian army assaulting an Eternal Empire weapons factory on Darvannis. Vaylin suggested dispatching the Eternal Fleet to annihilate the Mandalorians, but Arcann was content to watch their enemies struggle and declined. As the battle progressed, the Mandalorians were gaining the advantage, and noting that the Mandalorians seemed inspired by a cause they could believe in, Arcann realized the Outlander was on Darvannis alongside them. As Vaylin rebuked him for not taking her advice, Arcann realized that he spent too long sitting on the Eternal Throne and decided to hunt the Outlander himself."}, {"tag": "p", "text": "As Vaylin threatened to execute a Knight of Zakuul for the loss of the Darvannis factory, Arcann received a distress call from an Eternal Fleet warship transporting Imperial Admiral Zasha Ranken, Republic Senator Tai Cordan and exiled Zakuulan holo-performer Malita Tal to Zakuul for him to interrogate about the Outlander's whereabouts. The distress call from a GEMINI captain revealed that the Outlander and Senya were attempting to commandeer the ship, which Arcann deemed foolish. He then took his Eternal flagship and a significant detachment of the Eternal Fleet to intercept his enemies, but the Gravestone escaped into hyperspace just as the Eternal Fleet arrived on the scene and began laying fire. Not long afterwards, Vaylin informed her brother that all Eternal Fleet vessels outside their sector were not responding to the orders. Arcann dismissed this turn of events as of little consequence, determined to hunt down the Outlander and Valkorion before worrying about the Eternal Fleet. Neither was aware that in their absence SCORPIO, an advanced artificial intelligence, had taken over the Eternal Throne, controlling both the Skytroopers and the Eternal Fleet, and through it their entire Empire."}, {"tag": "h4", "text": "Downfall"}, {"tag": "p", "text": "In an attempts to let her enemies destroy each other, SCORPIO revealed her actions to Arcann, also informing him that the Alliance base was located on the planet Odessen. Consumed by his desire for revenge, Arcann ordered his detachment of the Eternal Fleet to attack Odessen, planning to deal with SCORPIO after killing the Outlander and his father. In a countermove, the Alliance faced the Eternal Fleet with the Gravestone, proceeding to cause massive damage to it with the omnicannon. As the battle raged on, the Outlander, Senya Tirall and Lana Beniko boarded the Eternal Flagship in an attempt to kill Arcann. Seeing her mother on the security cameras, Vaylin revealed Arcann's position on the bridge to the Outlander, while also luring Senya away from him to confront her personally. As the Outlander confronted and engaged Arcann on the bridge, SCORPIO took control of the remaining part of the Eternal Fleet and used the present ships to fire at the Eternal Flagship, intending to eliminate both Arcann and the Outlander in one fell swoop. Demanding response from his father, Arcann battled the Outlander while SCORPIO's assault tore the flagship apart around them. Arcann was eventually overcome and as the Outlander stood over him, he staggered back and was crushed by collapsing debris, forcing the Outlander to retreat before the flagship blew apart."}, {"tag": "p", "text": "However, Senya arrived soon after the Outlander left and pulled Arcann from under debris, his left cybernetic arm completely destroyed. Lamenting her inability to save him, Senya was interrupted by the arrival of Vaylin and offered both her children to come back to her. Vaylin angrily refused and took a strike at her mother, but Arcann Force-pushed her away, saving Senya and enraging Vaylin for denying her the pleasure of killing her mother. While Vaylin vengefully retreated back to Zakuul, Senya carried Arcann away to his personal shuttle and escaped into hyperspace with the intention of healing him away from the Alliance forces."}, {"tag": "p", "text": "Returning to Zakuul, Vaylin allied herself with SCORPIO and claimed the Eternal Throne. As one of her first acts as Empress of Zakuul, Vaylin declared a bounty on her own mother. Though the majority of the Knights of Zakuul remained loyal to the new Empress, some were terrified that Vaylin might disband or destroy their order. This group of Knights reached Senya with an offer to meet on Ord Mantell, where they could provide healing supplies for Arcann. However, Vaylin became aware of the dissident Knights and slaughtered the host before Senya arrived on Arcann's shuttle. Vaylin engaged Senya amidst burning rhydonium, but Senya was able to escape and take off in the shuttle that still carried Arcann's unconscious body."}, {"tag": "p", "text": "Senya eventually made it to Voss, where she hoped to use Voss healing ritual to heal both Arcann's injured body and his spirit, curing him of the hatred that had consumed him. However, Vaylin followed her and launched an invasion of Voss, determined to kill all her family in one fell swoop. The Eternal Fleet met resistance from the Alliance forces and Senya was forced to contact the Outlander, now the Alliance Commander, for help. The Commander and Theron Shan traveled to Senya's position at the Shrine of Healing where the Voss Mystics were treating still unconscious Arcann and offered to hold of Zakuulan forces so that the healing ritual could be completed. The Voss healing worked by taking the strength of many to heal an injured patient and as it became aware that there was not enough time until their position was overwhelmed, Senya ordered the Mystics to take her strength to heal her son. The Mystics complied and transferred her strength to him, those this left Senya comatose. Arcann awoke confused and, witnessing his mother's lifeless body, fled the Shrine back to his shuttle, believing her dead. As he was boarding it, the Alliance Commander caught up with him and attempted to stop him, but Arcann, despite having only one working hand, managed to pilot the shuttle away and escape into hyperspace. His mind healed, Arcann abandoned the mask that covered the scarred half of his face and acquired a new cybernetic prosthetic for his left arm. He also amassed a group of Zakuulan loyalists, willing to aid him in reclaiming the Eternal Throne from his sister. Alliance Intelligence put at an extensive search for Arcann, but was unable to locate any reliable trail that could lead to him."}, {"tag": "h3", "text": "Joining the Alliance"}, {"tag": "p", "text": "When Vaylin announces the upcoming Grand Festival of Empress Vaylin, Arcann saw this as an opportunity to confront his sister. During the Festival, a shuttle with his followers launched several missiles at the Palace of the Eternal Dragon, with Arcann and the loyalists debarking in the chaos. This interrupted the Alliance Commander, who also saw the event as a chance to strike at Vaylin, learning that Valkorion conditioned her to become powerless when the phrase \"Kneel before the Dragon of Zakuul\" was spoken in her presence. Arcann found Vaylin at the Palace balcony and tried to talk her down peacefully, but Vaylin became convinced that her brother was complicit in her conditioning and attacked him in a fit of rage. The arrival of the Alliance Commander and Theron Shan interrupted their fight, allowing Vaylin to escape on a speeder bike. To the Commander's surprise, Arcann addressed him peacefully, and acknowledged his past crimes without signs of hostility. When Theron Shan doubted his trustworthiness, Arcann joined him and the Commander in the fight against the Horizon Guard who arrived to kill them. After the Guards fell, Arcann wondered whether the Commander was controlled by his father like a puppet or merely housed his essence. Valkorion's spirit then revealed himself to Arcann and called him weak, to which Arcann replied that he was no longer his father's son and that the Commander was more deserving of the Eternal Throne than he was. Arcann's offer to join the Alliance and stand against Vaylin was accepted and the Commander broadcast the act of him swearing new loyalty to the galaxy. Witnessing the broadcast, Vaylin was enraged and ordered the Eternal Fleet to bomb the entire Palace to rubble, but Arcann managed to escape with the Alliance on a shuttle piloted by Lana Beniko."}, {"tag": "p", "text": "Upon his arrival to the Alliance base on Odessen, Arcann was initially treated as an enemy by the Alliance personnel, many of whom suffered under his rule for years and joined the Alliance to oppose him in a first place. However, the Commander insisted that having the former Eternal Emperor on the side was good for both the morale and for adding additional pressure on Vaylin. Knowing his sister, Arcann compared her to a wounded predator and claimed that she would find a way to strike back. The Alliance soon learned that Vaylin found a way to break her conditioning, which required her to return to Nathema. Arcann provided the location of the planet and warned of its nature as a void in the Force, visiting which could cause him to fall back to his old ways. Appreciating Arcann's honesty, the Commander traveled to Nathema with Lana Beniko and Theron Shan, but was unable to stop Vaylin from her breaking her bonds, an act which caused Senya to wake from her coma in fear."}, {"tag": "p", "text": "No longer chained by her conditioning, Vaylin immediately launched an assault on Odessen, intending to wipe the Alliance and her entire family who opposed her. As the battle raged on multiple fronts, Arcann and his mother teamed up to protect the dry-docked Gravestone from the Zakuulan forces. When the Commander caught up with them, the mother and son pledged their support for the cause once more and offered to stand by the Commander's side against Vaylin. The Commander contacted Vaylin via a holo-call, successfully taunting her to abandon the safety of her flagship and travel to Odessen surface for a face-to-face confrontation. Holding an Alliance member hostage, Vaylin awaited on the Alliance landing platform as the Commander and her family arrived to stop her. Her power raging out of control, Vaylin killed her hostage and caused a massive Force Storm, leaving the Commander no choice but to stike her down. As Vaylin lay dead, Senya and Arcann lamented her loss, but were relieved that the conflict was over. Arcann was concerned about the storm of energy that flowed to Commander when Vaylin was struck and cautioned to remain wary about a possible trap by Valkorion."}, {"tag": "p", "text": "However, Vaylin's death left the Eternal Throne empty, leading the GEMINI captains to revert to their basic programming and commanding the Eternal Fleet to bombard inhabited worlds indiscriminately. The Alliance leadership boarded the Gravestone and departed for Zakuul, intending to end the threat once and for all. Using upgrades from Iokath the ship was able to breach the Eternal Fleet blockade and Senya and Arcann volunteered to accompany Commander through the Spire. Together, they traveled down to surface in a boarding pod that landed in the Garden of Izax and made their way to the Spire as the Eternal Fleet burned Zakuul around them. When entering the Eternal Throne room, Arcann was taken aback at seeing his old Throne and lamented the death of millions he caused while holding it, while Senya assured him that he became a better man since. Arcann offered the Commander to take the Throne and pacify the Fleet, but as soon it was done, Valkorion revealed his ultimate goal, assaulting the Commander for control of their body. Within the depth of their mind, the Commander was fighting back by locating Dramath's holocron, which was told to hold power to destroy Valkorion once and for all. The Throne room was breached by the attacking skytroopers and mother and son hold them off for a while, until Senya told Arcann to use the physical holocron to join the Outlander in the fight against his father. Meditating on the holocron, Arcann's consciousness emerged inside the Commander's mind, where he learned that Vaylin's essence remained bound to Valkorion after her death. The Commander used Dramath's holocron to free Vaylin from direct control by Valkorion, though when offered a chance to avenge her own death she agreed that her father was making a good point. However, the Commander and Arcann managed to change her mind and the three engaged Valkorion in the mind-space. After toying with them for a while, Valkorion destroyed the holocron, claiming that nothing was able to stop him. However, since his spirit was now bound to Vaylin's, the Commander used the phrase \"Kneel before the Dragon of Zakuul\" to rob him of his own strength. Overpowered and weakened, Valkorion watched as Senya joined her children in the Commander's mind and together the family watched the Immortal Emperor's final words and moments, until the Commander put a final end to his millennia-long existence. Back in the physical world, Arcann noted that he no longer felt his father's presence and did not think he could return to the world of living again. The Commander then proclaimed the age of the Eternal Alliance, unifying the military of Zakuul and the Eternal Fleet with the cause of the Alliance, which Arcann and his mother continued to be a part of."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Arcann was a calculating, shrewd, patient and ruthless young man. Arcann deeply desired love and acknowledgment from his father, Valkorion, but his father's lack of interest in his children caused Arcann to develop a deep resentment for his father, to the point that, in a fit of rage, Arcann attempted to kill him. Both Arcann's parents believed jealousy to be Arcann's hidden and fatal weakness. Arcann loved his sister Vaylin, and his acknowledgment of her abilities kept her loyal to him. Arcann was also arrogant, and believed himself beyond the reach of destiny."}, {"tag": "p", "text": "Arcann was a fierce frontline warrior, and when working with his brother Thexan, the two were nearly unstoppable. Arcann and Thexan were inseparable as children, with Thexan helping Arcann in times of need and Arcann having complete faith and loyalty in Thexan. When Arcann lost his arm, Thexan never left his side, something Arcann deeply appreciated. After accidentally killing Thexan, Arcann was shocked and heartbroken by his action, which he later showed regret for. Arcann spoke of missing Thexan to their sister Vaylin, believing that Thexan would've sided with him against their father."}, {"tag": "p", "text": "After being healed on Voss, Arcann's personality changed drastically, with him becoming more calm and humble, no longed hiding his scarred face beneath a mask. When speaking to Valkorion, he showed regret of his past atrocities and easily dismissed his father without showing signs of anger or hatred. He threw his support behind the Outlander and remained loyal after Vaylin's death. Although tempted to reclaim the Eternal Throne for a brief moment, Arcann supported the Outlander's ascension to the throne and even entered their mind to assist in the final battle against Valkorion, defeating his father forever. Regardless of the Alliance Commander's decision regarding the nature of the newly formed Eternal Alliance, Arcann assured the Outlander of his continued support."}, {"tag": "h2", "text": "Powers and Abilities"}, {"tag": "p", "text": "Arcann was a naturally strong Force user and a highly skilled duelist, being able to defeat both Sith Lords and Jedi Knights. He utilized a yellow bladed lightsaber in combat. He demonstrated use of yellow Force lightning and powerful Force pushes, which shows a great proficiency of telekinesis. Arcann most proficient ability was the use of Force Lightning. Even with a cybernetic arm being an hindering him from become a master of the ability like his father, Arcann was able to conjure small storms with the ability. Arcann was also skilled with Convection he was able to chain both Lightning and Convection to an ability that destroyed HK-55 instantly. Defensively Arcann can employ Tutaminus, he was capable of defending against Valkorion's Force storm for a brief period of time. Arcann had skill in politics, and after taking control of Zakuul he made it the most powerful political faction in the galaxy. He also had a degree of talent as a military commander, managing to defeat both the Republic and Empire within the short span of one year with the might of the Eternal Fleet."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arcann first appeared in Sacrifice, a cinematic trailer produced by Blur Studio for Star Wars: The Old Republic's fifth digital expansion, Knights of the Fallen Empire. The trailer was released at the Electronic Entertainment Expo on June 15, in 2015, and the official website's page for the new expansion, released on the same day, provided his name. In the game Arcann is voiced by Erik Todd Dellums, who also voiced his twin Thexan. If player makes a Light Side choice during Knights of the Eternal Throne Chapter I, Arcann is redeemed and later joins him as a permanent companion. If a Dark Side choice is made instead, Arcann is killed, though his spirit still becomes a temporary companion in Chapter X. Two customizations are available for Arcann from the Dark vs. Light vendors on the fleet: one for his Fallen Empire appearance and one for his Eternal Throne Dark Side appearance."}, {"tag": "p", "text": "Game update 5.8 allowed Arcann to became a romance option for players of both genders if you chose the Light Side option to keep him alive."}, {"tag": "h3", "text": "Gameplay alternatives"}, {"tag": "h4", "text": "Knights of the Fallen Empire"}, {"tag": "h4", "text": "Knights of the Eternal Throne"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}