{"url": "Light_freighter", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Ship stubs", "Category:Incomplete lists", "Category:Freighter classes", "Category:Freighters"], "nodes": [{"tag": "h1", "text": "Light freighter"}, {"tag": "p", "text": "Light freighters were a type of freighter used during the final days of the Galactic Republic and during the rule of the Galactic Empire. The Ghost, a starship owned by Hera Syndulla and used by rebels from Lothal, was a modified VCX-100 light freighter. The Millennium Falcon, a smuggling ship owned by Han Solo that later became part of the Rebel Alliance, was a YT-1300 light freighter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Light freighters have been in production since at least 56 BBY,[source?] at which time the YT-1300f known as the Millennium Falcon was manufactured by the Corellian Engineering Corporation. These ships were fairly common in the galaxy, being used to transport all sorts of goods (legal and otherwise) to and from worlds such as Naboo, Coruscant, and Kessel. These freighters continued to be in use, in both transport and combat roles, well into the Galactic Civil War. Later, the Falcon saw action in the Cold War. During the Clone Wars, Trandoshan Bounty hunter Bossk piloted a YV-666 light freighter christened the Hound's Tooth. Lux Bonteri used XS stock light freighters to deploy Onderonian rebels into battle."}, {"tag": "p", "text": "During the Imperial Era, the Spectres operated a VCX-100 light freighter known as the Ghost, which served as their mobile headquarters and home. Flown by Twi'lek captain Hera Syndulla, the ship and its crew took part in dozens of missions aimed at undermining Imperial rule. Starting around 2 BBY, Mart Mattin owned a YT-2400 light freighter named Sato's Hammer. He led a small rebel cell known as Iron Squadron, which conducted a low-intensity guerrilla campaign against the Imperial presence on Mykapo. Other freighter captains operated models such as the Allanar N3 light freighter in different locations around the galaxy."}, {"tag": "p", "text": "During the period leading up to the cold war, the human scavenger Rey flew a 690 light freighter for a short time."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}