{"url": "Light_corvette/Legends", "categories": ["Category:Legends articles", "Category:Corvette classes", "Category:Galactic Empire starship classes", "Category:Light Corvettes"], "nodes": [{"tag": "h1", "text": "Light corvette"}, {"tag": "p", "text": "The Rendili StarDrive light corvette, commonly known as the Imperial Customs corvette, was a light starship commonly used for patrol and inspection actions."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Imperial Customs Office employed a force of patrol vessels that operated independently from the Imperial Navy in order to spare the Imperial government the expense of assigning ships of the line to monitor shipping, interdict piracy, and perform search-and-rescue operations."}, {"tag": "p", "text": "Rendili StarDrive's light corvette was the backbone of this force. Systems with an Imperial Customs branch generally had at least one of these vessels, and more important systems had several. While it was not capable of taking on large warships, these ships were more than adequate for taking on most freighters or starfighters. For boarding operations, the corvette carried a stormtrooper platoon. They were often supported by the smaller Imperial Customs frigate, also a Rendili product."}, {"tag": "p", "text": "Rendili StarDrive sold the Light Corvette to the Imperial Customs Office by an exclusive contract, but smaller governmental organizations, such as the Rodian Home Fleet, also acquired the light corvette for system patrol and defense. The utility and efficiency of these craft also created a demand from less legal organizations. Pirates often made an effort to capture light corvettes, and smaller shipbuilding operations such as those at shadowports manufactured copies of the design."}, {"tag": "p", "text": "One corvette, the Gatekeeper, tried to intercept a young Princess Leia Organa at Quellor, but it was destroyed in a suicide attack by a resistance fighter in order to maintain her cover."}, {"tag": "p", "text": "Right after the Battle of Endor, a customs vessel arrived at Tatooine bearing news of the Imperial defeat to the Prefect."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}