{"url": "Light_side_of_the_Force/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles needing additional sources", "Category:The Force", "Category:Light side"], "nodes": [{"tag": "h1", "text": "Light side of the Force"}, {"tag": "p", "text": "The light side of the Force, also commonly known as the Ashla by ancient Force-sensitives on Tython, or simply the Force by the Jedi, was a method of using the Force that entailed the devotion of oneself to the will of the Force and was aligned with honesty, compassion, mercy, and self-sacrifice. An alternative method juxtaposing the light side was the dark side of the Force; to allow one's emotions to take hold of oneself and thus achieve feats of power that were considered unnatural, as well as to access the power of immortality in a quicker, easier fashion. Proponents of the light side rejected the dark side for its result of consuming life, and Kreia, who advocated for the individual over the will of the Force, saw submission to either side the Force as a betrayal of the self, criticizing followers of the light side for letting their sentient selves die for the will of the Force."}, {"tag": "h2", "text": "Definition"}, {"tag": "p", "text": "The largest group of proponents and teachers of the light side were the Jedi Order, who strove to maintain peace and justice throughout the galaxy. The Jedi were well aware of the dangers of the dark side of the Force and were dedicated opponents of its use, as it represented corruption and a disregard for the natural order of the universe. The dark side was considered the domain of the Sith, whom the Jedi attempted to destroy in order to keep the Force in balance. The Force played a large part in the Jedi use of a lightsaber, giving them the ability to foresee events in the future, giving the impression of heightened awareness and amazingly quick reflexes that kept them from accidentally injuring themselves in combat and allowing them to perform other feats, such as using a lightsaber to deflect incoming blaster fire. A Jedi would use the Force to help in the construction of their lightsaber, both to assemble its intricate component pieces and, initially, to charge its power cell."}, {"tag": "p", "text": "With experience, there were a seemingly infinite number of things a Jedi could achieve through use of the light side. This did not only apply to Jedi, of course, but indeed any Force-sensitive. The Jedi used their powers to gain greater knowledge, in contrast to their ancient enemies, the Sith. Whereas the Sith would use their powers to try to rule the galaxy, the Jedi would use their power to fight in its defense and to guide its direction, although this difference did not always appear so clear-cut. Many people were distrustful of the Jedi Order's great influence on the leaders of the Old Republic."}, {"tag": "h2", "text": "Nature of the light side"}, {"tag": "p", "text": "The light side of the Force was aligned with happiness, joy, love, and benevolence, or alternatively simply calmness, which some believed nurtured the light side and provided insight into its ethical uses. It was generally concerned with the ideas of good, generosity, healing, and wisdom, as opposed to evil, harm, and hasty judgment. In order to achieve harmony with the light side of the Force, its practitioners would often meditate to clear themselves of emotion; particularly negative emotions such as aggression, anger, and hatred, since these were shown to open a Jedi to the possibility of acceptance of the dark side. Predictably, this offered several contradictory instances, with some works favoring a calm, emotionless and sometimes even out-rightly unfeeling view of the light side, while others aligned it with positive emotions."}, {"tag": "p", "text": "The light side was treated as being both a form of impersonal intelligence and an essence of good. According to the self-aware interpretation, the light side was held to actively influence events to the degree that some Jedi thought of themselves as mere \"tools\" of the Force. Though this implied a lack of choice regarding an individual's fate, the Jedi, as leading proponents of the light side, insisted that it was, rather, \"the ultimate free will.\" This they explained as being because the Force (at least the light side) did not compel anyone. A destiny could be accepted or spurned. And all choices along the way were free to make."}, {"tag": "p", "text": "Since Ashla was also the name of the Force itself, before referring only to the light side, it could mean that the light side is also the \"normal\" nature of the Force. This view was not shared by the Potentium followers who, according to Jedi orthodoxy (which labels it a misinterpretation) stated that since the Force was inherently good, the dark side was not evil, either. Conversely, however, the Force-being known as the Father had implied that, had the galaxy possessed too much of the light side, the ramifications might be just as bad as if it possessed too much of the dark side. Indeed, at least a few works have depicted the light side as capable of harm to the extremes as the dark side, such as with Darth Gravid, whose alignment with the light side eventually drove him insane."}, {"tag": "p", "text": "While some Sith acknowledged the benevolent qualities of the light side, most did not view it as a force of good, seeing it as either weak and ineffective or as an unnatural repression of emotions and restricting to free will; these often served as their justifications for embracing the dark side. Several of the Gray Jedi attempted to balance usage of both sides of the Force, believing that wholly submitting oneself to either light or dark was harmful to the individual Force-user."}, {"tag": "h2", "text": "Known light side Force powers and techniques"}, {"tag": "p", "text": "The light side of the Force was generally harder to use than the dark side, because dark side Force powers were all aggressive and easily fueled by anger or hatred. This allowed darksiders to advance faster, but they were not inherently more powerful than the lightsiders. Light-sided Force abilities were virtually all defensive and passive in nature. While there were light-side abilities for increasing one's strength or courage, or incapacitating an enemy, none of them were truly aggressive (with the notable exceptions of Electric Judgment, Sever Force, and Combustion)."}, {"tag": "h2", "text": "Characteristics of light side users"}, {"tag": "p", "text": "Most beings who have used the light side of the Force have known its calming abilities. The Jedi try to maintain calm at all times, even in situations which would normally cause intense stress. They had the ability to calm animals, including people, and increase morale using only their minds. Almost every lightsider felt the tempting call of the dark side of the Force at some time or another, but most used the light side's abilities to restore their normal tranquility. Some Force users that used these abilities are as follows."}, {"tag": "h2", "text": "The Chosen One"}, {"tag": "p", "text": "An ancient prophecy foretold of a being who would bring balance to the Force and destroy the Sith. Some believed this to be Anakin Skywalker, as his blood contained the greatest amount of midi-chlorians ever measured by the Jedi Council. Found on Tatooine by Jedi Master Qui-Gon Jinn, Anakin proved to him that he had extensive Force abilities without prior training. The most obvious indication was his ability to compete in podraces, which required tremendous reflexes, reflexes which could only be employed by a Human if he was Force-sensitive. Joining the Jedi Order, Anakin sped through his training due to his strong affinity with the Force but, due to the machinations of Darth Sidious, fell to the dark side as Darth Vader. However, Anakin did eventually fulfill his role as the Chosen One when he re-embraced the light side and destroyed his master in order to protect his son. Anakin was mortally wounded in the act and died shortly afterwards. With his death, he had restored balance to the Force by destroying both Sith, Sidious and himself, though the Sith would eventually return."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ashla was the name given to the light side of the Force in early drafts of Star Wars and was established as canon in the Expanded Universe by the Power of the Jedi Sourcebook. Darth Bane: Rule of Two also said the ancient Jedi and Sith called the light side Ashla."}, {"tag": "p", "text": "The Power of the Jedi Sourcebook states that the Potentium (the view that the Force is one, and its sides are just a matter of choice of Force powers) is a corrupt, misguided philosophy, thus being the first source to establish from the official perspective that the Jedi Orthodox philosophy reflects the true nature of the Force."}, {"tag": "p", "text": "Throughout the films, the \"light side\" of the Force is never directly named, rather it is considered the Force itself. It is only mentioned by name in sources from the Expanded Universe. In all six films in the Legends continuity, the actions of the Jedi and the Force itself can be interpreted as the light side. However, from an in-universe philosophical standpoint, this can be debated."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}