{"url": "Lightmaker", "categories": ["Category:Canon articles", "Category:Ship stubs", "Category:Phoenix Squadron starships", "Category:Sphyrna-class corvettes"], "nodes": [{"tag": "h1", "text": "Lightmaker"}, {"tag": "p", "text": "The Lightmaker, also known by its callsign \"Corvette Five,\" was a Sphyrna-class Hammerhead corvette that served in the Alliance to Restore the Republic's fleet. Before the Galactic Civil War, the ship was sent by Senator Bail Organa to reinforce Commander Jun Sato's unit of the rebellion along with two other Hammerheads, the Amity's Arrow and the Duchess Senna. The three ships were stolen by one of Sato's sub-units, the Spectres, during a raid on the planet Lothal. When part of Phoenix Cell, it was one of the few ships to escape the disastrous Battle of Atollon where one of the other two Hammerheads was destroyed along with many other ships."}, {"tag": "p", "text": "Under the captaincy of Kado Oquoné, it participated in the Battle of Scarif, the opening battle of the Galactic Civil War. After being flanked by two Imperial Star Destroyers (ISDs) and badly damaged, the Lightmaker withdrew from the field of fire to guard the line of retreat. Admiral Raddus later ordered Oquoné to ram his corvette into the side of the disabled Star Destroyer Persecutor, causing it to crash into the ISD Intimidator before sending the latter crashing into the Shield Gate protecting Scarif, disabling the planetary force field and thus allowing crucial transmissions between Scarif and the rebel fleet. Though the plan was successful, the corvette was destroyed in combat."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "During the battle of Scarif, the Lightmaker's cockpit was crewed by several humans and droids. This included Captain Kado Oquoné, a male who served as the vessel's commanding officer. Before ramming the Star Destroyer Persecutor, the ship was evacuated of several nonessential personnel, leaving a skeleton crew in place to perform the manuever."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lightmaker first appeared as one of the three Sphyrna-class corvettes given by Bail Organa to the Lothal rebels in \"A Princess on Lothal,\" the mid-season premiere of the second season of the Star Wars Rebels TV series, which aired on Disney XD January 20, 2016. The corresponding episode guide on StarWars.com identifies the three Hammerhead corvettes as P1, P2, and P3."}, {"tag": "p", "text": "The corvette was later identified as the Lightmaker in the 2016 novelization of Rogue One: A Star Wars Story."}, {"tag": "p", "text": "Although Star Wars: The Rebel Files states that the three ships given to the Lothal rebels were named Lightmaker, Duchess Senna, and Amity's Arrow, and Rogue One's Lightmaker appears very similar to Star Wars Rebels' P1, with a notable difference being the lack of the Aurebesh characters \"P1\" on the Rogue One model, no official source to date clarifies the three Rebel Files ships' correspondance to P1, P2, and P3."}, {"tag": "p", "text": "Rogue One's visual effects supervisor, John Knoll, mentioned that there was much back-and-forth about whether the crew survived; cutting to shots of escape pods were deemed distracting by Gareth Edwards, so ILM merely implied they survived by not having the pods present during the collision of the disabled Star Destroyer with the Shield Gate. Knoll speculated that, given the Death Star fires on the position where the pods would land, it was still unlikely any of the Lightmaker's crew survived. The novelization of the film clarified that the ship was evacuated of nonessential personnel before performing the maneuver as well as including a scene where Raddus notices several escape pods floating by afterwards, mentioning that Raddus did not dare hope of them originating from the Lightmaker."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}