{"url": "Lightning_Squadron", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Grand Army of the Republic squadrons"], "nodes": [{"tag": "h1", "text": "Lightning Squadron"}, {"tag": "p", "text": "Lighting Squadron was a military cavalry squadron in the Grand Army of the Republic, composed of Advanced Recon Force clone troopers. During the Clone Wars, Lightning Squadron served under the leadership of Clone Commander CT-411 \"Ponds,\" who reported directly to Jedi General Mace Windu. In 22 BBY the squadron deployed to Ryloth as part of a military campaign to liberate the Twi'lek homeworld from Separatist occupation."}, {"tag": "p", "text": "The combined forces of the Galactic Republic and Twi'lek Resistance marched on the capital city of Lessu. The ARF troopers \"Razor\" and \"Stak,\" both of whom were part of Lightning Squadron, accompanied General Windu as the vanguard of the assault. Through their actions, the rest of the army gained entry to the city, resulting in the capture of Emir Wat Tambor and the Separatist military's withdrawal from the planet."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lightning Squadron was a military unit of the Grand Army of the Republic. Its ranks consisted of Advanced Recon Force Scout Troopers; a variant of the standard clone trooper, ARF troopers were noted for their intelligence and survival skills, as well as their ability to pilot the All Terrain Reconnaissance Transport walkers. Their clone armor was also a variant of the Phase I clone trooper armor, designed to be lighter in weight for the purpose of speed and stealth."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "In 22 BBY, the first year of the Clone Wars, the Twi'lek homeworld of Ryloth fell to the Confederacy of Independent Systems. In retaliation, the Galactic Republic initiated a campaign to liberate the planet and its people. After the Republic Navy secured the battle in space, the Grand Army of the Republic deployed to the surface with Jedi General Mace Windu leading the assault on the capital city of Lessu. The Separatist forces attempted to halt the invasion by using a group of Armored Assault Tanks to ambush Windu's forces, leading Clone Commander CT-411 \"Ponds\" to call on the support of Lightning Squadron at the general's command. Utilizing their AT-RT walkers, the squadron's ARF troopers charged toward the enemy and although they successfully defended the army, Windu's forces sustained casualties during the skirmish."}, {"tag": "p", "text": "In the aftermath of the ambush, Windu scouted ahead taking the ARF troopers \"Razor\" and \"Stak\"—both of Lightning Squadron—with him. Upon encountering Cham Syndulla, leader of the Twi'lek Resistance, the rebel Twi'leks brought the ARF troopers and their Jedi officer to the resistance headquarters where Windu ultimately convinced the rebels to fight alongside the Grand Army in a combined effort to free Ryloth from Separatist control. Before commencing with the main attack on the capital, Windu infiltrated Lessu and distracted the battle droids while Razor and Stak made their way to the control room and reactivated the plasma bridge, allowing both clone troopers and rebels to enter the city. The battle ultimately concluded in a decisive victory for the Republic, resulting in the Separatists' full retreat as well as the capture of Emir Wat Tambor, a member of the Separatist Council."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lightning Squadron first appeared in the Season One episode \"Liberty on Ryloth\" of the 2009 Star Wars: The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}