{"url": "Lightsaber_Lost", "categories": ["Category:Real-world articles", "Category:The Clone Wars episodes"], "nodes": [{"tag": "h1", "text": "Lightsaber Lost"}, {"tag": "p", "text": "\"Lightsaber Lost\" is the eleventh episode of Season Two of the Star Wars: The Clone Wars television series. It aired on January 22, 2010 after a two week wait."}, {"tag": "h2", "text": "Official description"}, {"tag": "p", "text": "When a wily pickpocket steals Ahsoka's lightsaber, she enlists the help of an ancient Jedi to track down her weapon and reclaim her honor."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Anakin and Ahsoka are in the slums of Coruscant searching for Car Affa, an arms dealer selling Republic weapons to the Separatists. They arrive at a bar where Affa is hiding, and Anakin instructs Ahsoka to wait outside while he apprehends the fugitive. When the patrons storm out of the bar, Ahsoka is jostled by the crowd and her lightsaber gets stolen. She chases the thief, but loses him in the crowd. Unwilling to inform Anakin about her loss, she heads to the Archives in the Jedi Temple, where she meets Tera Sinube, a Jedi Master with specialized knowledge about Coruscant's criminal underworld. Sinube finds Ahsoka's thief in the database, a Patrolian named Bannamu. Before Ahsoka rushes off, Sinube insists that he comes along, advising her that slowing down will help her find what she's looking for."}, {"tag": "p", "text": "Back in the slum district, they are directed to Bannamu's hideout—the Spider Arms Hostel. Ahsoka eventually locates Bannamu, and learns that he has sold her lightsaber to an assassin called Nack Movers. The two Jedi hurry to find him, while Sinube advises Ahsoka again to be patient in their search. At the apartment owned by Movers' girlfriend, they find that the lock has been cut open and Movers has been killed. The two Jedi soon see a frightened female called Ione Marcy hiding in the apartment, who asks if the men who killed Movers have gone. Ahsoka goes to search the bedroom, where she gets attacked by Cassie Cryar, wielding Ahsoka's lightsaber. Upon learning that Ahsoka is a Jedi, Cassie jumps through the window and runs away along the city's rooftops. Ahsoka chases after her and contacts Sinube, informing him about the development."}, {"tag": "p", "text": "Sinube realizes an inconsistency due to the fact that Ahsoka's attacker was a female while Ione Marcy claims that men had broken into the apartment. Coupled with sensing something more than just shock in her, Sinube deduces that Ione Marcy was involved in the crime. He subtly attaches a tracking device to her and summons GU-series Guardian police droids, but Ione escapes in an airspeeder."}, {"tag": "p", "text": "Meanwhile, Ahsoka is closing on Cassie on the top of a high building, when Cassie jumps and lands in Ione's passing speeder. Sinube picks up Ahsoka in another speeder, and they follow the tracking device to a train station. Police droids apprehend Ione, but Cassie manages to dash off onto the top of a departing train. Ahsoka runs after her and they ultimately enter a wagon, where Cassie takes a Twi'lek mother and child as hostages, still with Ahsoka's lightsaber in her hand. When the train arrives at the next station, Cassie attempts to run away again, but Sinube, having gotten to the station first, intercepts her and disarms her. Cassie is arrested. Later, Sinube suggests that Ahsoka should share the lesson she has learned as they head to the Jedi Temple. Master Yoda greets them and invites Ahsoka to share with the younglings the value of patience and the responsibilities of never losing their lightsabers."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "The flashback in this episode contains a scene from the Season One finale, \"Hostage Crisis.\" Although aired first, according to the official chronology those events would not occur until well after those of \"Lightsaber Lost.\""}, {"tag": "p", "text": "When Ahsoka visits Jocasta Nu in the Jedi Archives Library, a criminal file on Brea Tonnika is open on the computer Nu is using. The Aurebesh text next to her picture reads \"LAST SEEN ON CORUSCANT WANTED FOR MURDER.\""}, {"tag": "p", "text": "When Ahsoka is looking for a lightsaber to buy near the noodle bar, behind her on the wall is written \"Massage.\""}, {"tag": "p", "text": "When Ahsoka and Master Sinube are walking down the hall toward Nack Movers' apartment, Ahsoka's sash keeps clipping through the bottom of her skirt."}, {"tag": "p", "text": "When Ahsoka is chasing Cassie Cryar, numerous floating advertising boards they jump over feature Aurebesh writing. One such board reads \"SODA,\" another reads \"STAR TOURS GLEE ANSELM CALL 1-800-555-6576 NOW!\" The text under Palpatine reads \"KUAT DRIVE YARDS AWARD\" before being cut off."}, {"tag": "p", "text": "Despite the fact that one of the floating ads Ahsoka jumps on involves Palpatine making a speech and that the speech is included in the quotes on the episode guide, neither the character nor Ian Abercrombie, the Supreme Chancellor's usual voice actor, appear in the credits."}, {"tag": "p", "text": "A list of destinations that pops up at the hovertrain station has Burbank listed, a reference and in-joke to the town in California. A similar in-joke would appear later in the Season 5 episode, \"To Catch a Jedi.\""}, {"tag": "p", "text": "Pablo Hidalgo mentioned that Cassie Cryar and Ione Marcy were intended to have been lovers."}, {"tag": "p", "text": "The episode is based on the classic Kurosawa film Stray Dog."}, {"tag": "h2", "text": "Credits"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}, {"tag": "p", "text": ""}]}