{"url": "Lightsaber_crystal", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Lightsaber crystals"], "nodes": [{"tag": "h1", "text": "Lightsaber crystal"}, {"tag": "p", "text": "Lightsaber crystals, also known as kyber crystals, were a variety of crystals, gems, stones, or other objects that were used as the energy source of a lightsaber."}, {"tag": "p", "text": "At the heart of every lightsaber was a set of crystals that resonated to produce the efficient, powerful blade. While the most common crystals used in the process were from the Adega system, Ilum, and Dantooine (in the so-called Crystal Cave), Jedi and Sith used a variety of crystals to produce various colors, effects and unique abilities. Some crystals could even enhance the Force skills of a particular user. Other gems, such as colored crystals or diamonds, were used exclusively for prismatic effects. However, not all lightsaber crystals were actually crystals. Plenty of Jedi or Sith used a different material or substance in place of a crystal, such as physical remains, shards of glass, and even special micro machinery."}, {"tag": "p", "text": "During the Great Sith War epoch, many lightsabers were created using Kunda stones, a natural geologic formation from the planet Kadril, in place of crystals. These stones boasted numerous practical applications in medicine and communications; however, when added to other focusing crystals, they produced a broader beam."}, {"tag": "h2", "text": "Preparation"}, {"tag": "p", "text": "Before placing the crystal in the lightsaber, the Jedi or Sith had to imbue it with the Force. To do this, the Force-user was required to meditate on the crystal for many days. Luke Skywalker meditated on his crystal in Ben Kenobi's home with only R2-D2 to keep him company."}, {"tag": "p", "text": "While the Jedi mostly used natural crystals, the Sith usually used red-hued synthetic crystals. However, Luke Skywalker created his lightsaber using a synthetic crystal, because he had no access to natural crystals on Tatooine. Sith-made synthetic crystals created a slightly more powerful blade when energized by the dark side of the Force. Sith lightsaber blades could occasionally \"break\" the blade of a Jedi saber. Darth Sidious had Darth Maul use a special furnace to make his own crystals. Maul worked constantly for several days to make the four crystals needed for his double-bladed lightsaber. Their creation required intense concentration, as Darth Maul had to use the Force not only to make them the proper shape and to ensure that the crystals were free from impurities, but also to keep himself alive for the long time it took in the blistering heat of the furnace. Maul was particularly proud of this achievement and believed it to be an example of the Sith's superiority over the Jedi. However, Sidious did not make his subsequent apprentices—Tyranus and Vader—create their crystals in such a manner, instead supplying them himself."}, {"tag": "p", "text": "Luke Skywalker, who had decided to create his lightsaber crystal instead of using a natural one, also used a special furnace he found in Obi-Wan Kenobi's home to prepare his crystal. As exemplified in both Skywalker and Maul's cases, the creator of a synthetic crystal channeled his Force energies and personality into the crystal as it was formed, making it unique in every way, including the color."}, {"tag": "p", "text": "The Jedi Order had an advanced technique that allowed, in case of need, the cleaning of synthetic crystals made by dark-side users from the hate of their former owners. In 41 ABY, Jaden Korr, who had lost his lightsaber, used the Force to banish the dark side from the red crystal of a Dark Jedi he had killed. Through meditation, he was able to remove all traces of the dark side and imbue the crystal with the light side, turning the Dark Jedi's lightsaber into a yellow-bladed Jedi weapon."}, {"tag": "h2", "text": "Significance of colors"}, {"tag": "p", "text": "Around 4000 BBY, lightsaber crystals were used to indicate a Jedi's chosen class. Blue indicated a Jedi Guardian, a Jedi who used the Force on a more physical level. Green indicated a Jedi Consular, a Jedi who preferred to reflect on the mysteries of the Force and fight the dark side at its heart. Yellow indicated a Jedi Sentinel, a Jedi who honed his or her skills in a balance of combat and scholarly pursuits."}, {"tag": "p", "text": "This distinction fell out of practice in later years, when most Jedi used blue or green crystals from Ilum caves based on personal choice, and then the use of crystals coming from various source worlds became marginal. However, specific roles like the temple guards all used yellow crystals to power their lightsabers.  Purple and orange crystals were still used by some Jedi until the fall of the Jedi Order, but they were exceedingly rare, and often passed down through generations.[source?] During the Galactic Civil War, the Galactic Empire banned trade and possession of all lightsaber crystals.[source?] No longer having Ilum crystals at their disposal, Jedi of the New Jedi Order settled for the use of various crystals and gems, creating lightsaber blades of multiple colors."}, {"tag": "p", "text": "The synthetic crystals, favored by users of the dark side for their offensive properties, were filled with the negative energies of their creators, which gave the crystals their red color; the majority of the Sith and Dark Jedi wielded crimson-bladed lightsabers, though colors similar in hue to red, such as orange and magenta, were not unheard of."}, {"tag": "h2", "text": "Known lightsaber crystals"}, {"tag": "p", "text": "There were a number of different stones, minerals, and crystals that could be used in the construction of a lightsaber. Some jewels created different colors and effects in the lightsabers in which they were placed. Often, the rarer the crystal, the more powerful its effects on a lightsaber."}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Known color crystals"}, {"tag": "p", "text": "For millennia, the Jedi Order lit lightsabers in every color and hue imaginable. However, following the Battle of Ruusan, the hues of most available crystals had been limited to either blue or green. Lightsaber color crystals could also be compressed, resulting in a pulsating blade, or they could be unstable, resulting in a core which swirled and sparkled."}, {"tag": "p", "text": "Lightsaber crystals of different hues could also be used in the same lightsaber to make a new blade color; for example, Galen Marek used Rahm Kota's green crystal along with his father's deep blue crystal to create an aqua blue blade."}, {"tag": "p", "text": "The following is a list of all known blade colors."}, {"tag": "h3", "text": "Blue crystals"}, {"tag": "h3", "text": "Green crystals"}, {"tag": "h3", "text": "Yellow and Orange crystals"}, {"tag": "h3", "text": "Red crystals"}, {"tag": "h3", "text": "Purple crystals"}, {"tag": "h3", "text": "Other crystals"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Crystals first appeared in the Star Wars galaxy simply as an embedded decoration on the lightsaber hilt in the A New Hope novelization. Aside from this single instance, there are no crystals mentioned in the original trilogy or its novelizations."}, {"tag": "p", "text": "Most crystals with special properties were from various video game and roleplaying-game sources. Since these special powers were often a function of game play, and not of the storyline, it is questionable if these powers are canon. However, since there are several examples of crystals with special powers in actual storylines (e.g. Lambent, Kaiburr, etc.), it is generally accepted that other crystals had special powers as well."}, {"tag": "p", "text": "In Star Wars Galaxies, players must \"tune\" lightsaber crystals to themselves before they may use them in a lightsaber. Once tuned, the crystal can only be used by that player, and only in lightsabers created by that player."}, {"tag": "p", "text": "In Star Wars: The Old Republic, players are able to gain lightsaber crystals to use with their lightsabers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}