{"url": "Lignan_crystal", "categories": ["Category:Legends articles", "Category:Lightsaber crystals", "Category:Sith crystals"], "nodes": [{"tag": "h1", "text": "Lignan crystal"}, {"tag": "p", "text": "Lignan crystals were powerful lightsaber crystals crafted from Lignan ore which enabled the blade of a lightsaber to last longer and burn hotter than normal crystals as well as enhance a dark side user's force powers."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lignan crystals were exceptionally powerful lightsaber crystals that were made from Lignan ore—an ore that was very powerful in the dark side of the Force. Lignan crystals enabled a lightsaber blade to burn hotter and last far longer than normal lightsaber crystals. This allowed the Lignan-enhanced lightsabers to cut through objects faster—when a strike team of Sith ambushed exiled Jedi Grand Master Luke Skywalker and his son, Ben, they were forced to cut through thick metal doors to reach the Jedi, and the Grand Master attempted to cut an escape hole through the viewport of the room they were in. However, the Lignan-enhanced lightsabers managed to cut quicker than Skywalker's, and the Sith engaged the Jedi in combat before they could escape."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Sith starships Omen and Harbinger were mining Lignan ore on Phaegon III's largest moon for Sith Lord Naga Sadow during the Great Hyperspace War in 5000 BBY when they were ambushed by the Jedi Master Relin Druur and his Padawan, Drev Hassin. The Omen attempted to flee but was knocked off-course after colliding with the Harbinger just as the former jumped into hyperspace."}, {"tag": "p", "text": "The Harbinger's hyperdrive was sabotaged by Druur and Hassin rammed the Jedi's Infiltrator starfighter into the ship's bridge, but the crew of the ship attempted to jump into hyperspace anyway. The vessel failed to enter its hyperlane, and its Captain, Saes Rrogon, used the power of the Lignan to hold the ship together as it accidentally traveled millennia into the future, arriving at a secluded star system in 41 ABY. There, Druur dueled with Rrogon and used the Lignan stored aboard the Harbinger to overpower and kill the Sith Captain and then destroy the ship."}, {"tag": "p", "text": "After being knocked off-course, the Omen crash-landed on the remote planet of Kesh. Much of the vessel's Lignan ore was salvaged from the crash; and the crystals became valued antiques and a prized symbol of the survivors' Sith heritage. The survivors of the crash were stranded on Kesh, unable to rebuild their ship or contact the outer galaxy, so they formed the Lost Tribe of Sith. The Lignan crystals were used by the Tribe, but they were reserved for only their most powerful members. In 41 ABY, Sith apprentice Vestara Khai was given a lightsaber with a Lignan crystal after she was chosen to be an apprentice by Ship, a Sith Meditation Sphere that discovered the Tribe on Kesh."}, {"tag": "p", "text": "Later, members of the Sith Tribe's strike team sent to kill Luke Skywalker used Lignan crystal-enhanced lightsabers that allowed them to cut quickly through a metal hatchway at Sinkhole Station, allowing the Sith to engage Skywalker and his son, Ben, before they could cut a hole in the viewport and flee the room."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}