{"url": "Lillia_Venn", "categories": ["Category:Legends articles", "Category:Females", "Category:Grand Lords", "Category:Humans"], "nodes": [{"tag": "h1", "text": "Lillia Venn"}, {"tag": "p", "text": "Lillia Venn was a female Human member of the Lost Tribe of Sith on Kesh. She was an elderly woman and was the oldest member of the Circle of Lords, the Tribe's government. In 3961 BBY, Lillia ascended to the rank of Grand Lord, the highest rank in the Tribe. She had been elected as a \"compromise\" candidate from among the Circle of Lords after the other six High Lords had been unable to agree on a new leader. Due to her old age, her political rivals, the Red and Gold Factions, regarded her as a weak leader who would not last that long in power. Still, Lillia sought to outmaneuver and defeat her opponents in order to maintain her grip on power."}, {"tag": "p", "text": "Following the ascendancy of Lillia, the Sith Lady Candra Kitai was appointed to assume her former seat in the Circle of Lords. By not aligning herself with the Red or Gold Factions, Candra became the second most important person in the Tribe due to her position as the tiebreaker: the one who would select Lillia's successor if she passed away. Thus, Lillia came to view Candra as a potential threat to her rule.\nIn 3960 BBY, an opportunity came for Lillia to flex her muscles against her political opponents. She manipulated Campion Dey, the Kitai family's uvak wrangler, to make an assassination attempt against herself during the rake-riding games on Donellan's Day. After outliving his usefulness, Dey was executed by Venn's loyal allies: the Luzo brothers Flen and Sawj Luzo."}, {"tag": "p", "text": "Lillia then falsely accused Lord Candra of plotting to assassinate her. As punishment, the Kitai family were reduced to the status of slaves and were also stripped of all their titles, ranks, lands, and belongings. In addition, Lillia ordered the public executions of Dernas and Pallima, the leaders of the Red and Gold factions. Candra was also coerced into confessing that she had conspired with Dernas and Pallima to assassinate and overthrow Lillia. To make a public example of her last surviving rival, Candra was forced to shovel manure at the capital Tahv's zoo in full public view. The victorious Lillia then appointed three of her own supporters, including the two Luzo brothers, as High Lords to the Circle."}, {"tag": "p", "text": "The downfall of the Kitai family led Candra's daughter Orielle Kitai to flee to her friend Jelph Marrian's farm. There, Candra discovered that Jelph was actually a Jedi Shadow and that he possessed a hyperspace-capable starship, a discovery that was of Kesh-shaking\" importance. Since the ancestors of the Tribe had become stranded on Kesh during the Great Hyperspace War, the Tribe had always sought to return to the stars and carve out an empire. She informed her mother Candra who told her to contact the four other High Lords from the two factions through the architect Gadin Badolfa. However, Candra did not believe her daughter Orielle's discovery and secretly informed Lillia in return for \"improved working conditions.\""}, {"tag": "p", "text": "Seeking to \"conquer\" the stars, Lillia and her entourage traveled to Jelph Marrian's farm. There, they captured Orielle, who had already reconciled with Jelph. While her followers including the Luzo brothers stood guard outside, Lillia then entered the barn where Jelph's starfighter was kept and entered the starfighter's cockpit. However, Jelph attacked the Sith with four blasters, another technology that had been unknown to the Tribe for millennia, and managed to rescue Orielle from Lillia's followers. They then escaped by jumping into the Marisota River. Meanwhile, Lillia and all her followers were killed when she unwittingly activated the ship's \"anti-theft system\" which consisted of two proton torpedoes that were buried beneath thousands of kilograms of ammonium nitrate-based explosives. The resulting explosion also destroyed the entire farm and caused the surrounding riverbank to sink beneath the Marisota River."}, {"tag": "p", "text": "Lillia's death during the so-called Night of the Upside-Down Meteor created a power struggle known as the Time of the Rot, which would last almost a millennium until 3000 BBY. Following her disappearance, Venn's rivals attacked and killed her supporters. These rivals then fought among themselves and degenerated into several warring factions. Despite her brief reign, Lillia's legacy was commemorated in the form of an airship that was named in her honor in an effort to rehabilitate historical figures from the Tribe's history. This airship took part in an ill-fated reconnaissance mission to the continent of Alanciar in 2975 BBY."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Grand Lordship"}, {"tag": "p", "text": "Lillia Venn was a Human woman who was a member of the Lost Tribe of Sith, the descendants of a group of stranded Human Sith who had colonized the planet Kesh during the Great Hyperspace War. She grew up almost a millennium after the reign of Grand Lord Nida Korsin, who had ruled for 79 years. By 3961 BBY, Lillia had reached her senior years and was one of the seven High Lords in the Circle of Lords, an elite ruling council which governed the Sith Tribe. By that time, the Force-sensitive members of the Tribe had become the new ruling elite on the continent of Keshtah Minor and lorded over the native Keshiri, who had become a large serf underclass which worshiped the Sith as the race of gods known as the Protectors. Internal divisions had also emerged within the Tribe with two important political factions being the Red and the Gold Factions, led by her rivals High Lords Dernas and Pallima respectively."}, {"tag": "p", "text": "That same year, the reigning Grand Lord passed away. Per tradition, the spouse and household servants of that particular Grand Lord were put to death. Per Nida's tradition, the Grand Lord's successor was also selected by merit from among the Circle of Lords. Since the ruling circle was evenly split between the Red and Gold Factions, the Circle of Lords had been unable to agree on a successor. Thus, the independent Lillia Venn was elected as a compromise candidate. Lillia had been elected because she was the oldest High Lord and the other Lords had thought that she would not last that long in power on account of her age. While the Red and Gold Factions swore fealty to Grand Lord Lillia, they continued to compete for her coveted position. However, Lillia was unwilling to cede her position to any other Sith and sought the opportunity to bring about their downfall. She allied herself with the two Luzo brothers Flen and Sawj Luzo, who were two prominent leaders within the Sith Sabers, the Tribe's equivalent of the Jedi Knights, and served as her personal bodyguards."}, {"tag": "p", "text": "As Grand Lord, Lillia resided at the capitol building in the Sith capital city of Tahv, the \"Crown of Kesh\" which had been the first Keshiri settlement that the Tribe's ancestors had settled in. Following the accession of Lillia to the Grand Lordship, the Sith aristocrat Candra Kitai was appointed as High Lord to take Venn's seat within the Circle of Lords. Since Candra was not aligned with the two major factions, she became the second most important person within the Tribe. Due to her position, Candra assumed the role of tiebreaker and had the power to select the elderly Lillia's successor in the event that the Grand Lord died. Recognizing Candra's importance, Lillia publicly accorded Candra with the highest respect and honor and invited her to attend public functions like the rake-riding games at the Korsinata stadium in the capital Tahv."}, {"tag": "h3", "text": "The Assassination Attempt"}, {"tag": "p", "text": "As Grand Lord, Lillia Venn was fully aware that the other High Lords coveted her position and were willing to do anything to reach the \"pinnacle of power.\" Thus, she engineered a conspiracy to eliminate three of these so that she could appoint her own supporters to the Circle of Lords, thus tilting the balance of power in her favor. Lillia identified the Red and Gold faction leaders Dernas and Pallima, as well as the freshman High Lord Candra Kitai as her targets. Lillia decided to stage an assassination attempt on herself and use it as a pretext to purge some of her rivals from office. This opportunity presented itself during Donellan's Day in 3960 BBY. Donellan's Day was a public holiday which commemorated the life and legacy of Nida's son Donellan, who had died before he could ascend to the Grand Lordship. Bereft of a heir, Nida had instituted a succession system based on meritocracy."}, {"tag": "p", "text": "On Donellan's Day, rake riding matches were held at the Korsinata stadium in Tahv. Rake riding was a violent blood sports which pitted rival grounded uvaks and their uvak wranglers against each other. These uvaks had their wing muscles severed at birth, rendering them flightless permanently. Glass prongs were then attached to their tough wing edges, turning them into fearsome weapons. One of the uvak wranglers contesting that match was the young Human Sith Campion Dey, who came from the southlands which Candra represented. Campion Dey was a close friend of the Kitai famliy who had sponsored his training. Somehow, Lillia conspired with Campion Dey to stage an assassination attempt against her during the Donellan's Day rake-riding games. Once he had outlived his usefulness, Lillia intended to have him executed to create the impression that High Lord Candra had conspired against her."}, {"tag": "p", "text": "Lillia's plot unfolded as planned and the other High Lords were caught completely by surprise. At the start of the match, Campion Dey and his uvak broke from the match and charged onto the grandstands. He then ignited his lightsaber and rode up towards the Grand Lord's luxury compartment which was near the top of the stadium. Lillia Venn then unleashed a torrent of Force lightning on the uvak, causing it and its rider to fall backward onto the lower seating. Her bodyguards Flen and Sawj Luzo then executed the assassin with their lightsabers. Following the assassination attempt, Lillia's Keshiri aide closed the shutters to the Grand Lord's compartment. Meanwhile, the stadium descended into chaos. Since Candra had not actually staged the assassination attempt, she was shocked by Campion's actions and instructed her daughter Orielle Kitai, a Sith Saber, to return to their family estate at Starfall while she tried to clear her name."}, {"tag": "p", "text": "Lillia then moved against her opponents. She accused Candra of conspiring to assassinate and overthrow her. Under much duress, Candra was coerced into confessing that she had conspired with both Dernas and Pallima, the leaders of the Red and Gold factions, to assassinate Lillia. Dernas and Pallima were executed in their stadium boxes by Flen and Sawj Luzo, who were later rewarded by being appointed as replacement High Lords in the Circle of Lords. However, Lillia, who knew Candra was innocent, spared her life and instead enslaved the entire Kitai family. Their lands were expropriated and all of their personal belongings were burnt in a large public bonfire by Kita's own Keshiri servants, who had been ordered to do so by the Grand Lord herself. Following her enslavement, Candra pledged her eternal loyalty to Grand Lord Venn who would keep her alive as her personal slave. Candra was immediately put to work shoveling manure at \"the zoo\", a public enclosure where Tahv's uvak were kept. To further humiliate her defeated rival, Candra was forced to do her work in public view."}, {"tag": "p", "text": "Meanwhile, Orielle fled to her friend Jelph Marrian, who owned a farm on the banks of the Marisota River. After Orielle related her story to Jelph, the slave and horticulturalist concluded that Lillia had actually staged her own assassination attempt. Had the Grand Lord not staged her own assassination and really suspected Candra, Jelph reasoned that she and Orielle would have been executed. The fact that Lillia had not executed the Kitais showed that she knew they were innocent but instead wanted to make public examples of them to deter other potential rivals. While Orielle was initially skeptical, she accepted Jelph's analysis of the assassination attempt after recalling that the other two High Lords had died out of public view and that the bonfire at her family estate had been witnessed by many Humans and Sith. Orielle's absence from Tahv meant that she escaped her mother's punishment."}, {"tag": "h3", "text": "The Jedi Starship"}, {"tag": "p", "text": "However, Lillia was not finished with Orielle Kitai, who had managed to escape enslavement since she was away from Tahv. She sent her two allies Flen and Sawj Luzo to deal with her. The two Luzo brothers had a hostile relationship with Orielle, whom they regarded as a rival to their leadership of the Sith Sabers. They learnt from several traders that Orielle regularly frequent Jelph Marrian's farm and traveled there by uvak. Upon arriving at Marrian's farm, they killed Orielle's uvak Shyn on the pretext that slaves were not allowed to own uvak, which were regarded as a status symbol on primitive Kesh. Jelph was away at that time because he was looking for ingredients in the jungle to produce fertilizer. After finding Orielle, they informed her that her mother had confessed to plotting with both the Red and Gold factions to kill Lillia. When questioned, both admitted that Candra had done so under duress."}, {"tag": "p", "text": "The two Luzo brothers also confiscated Orielle Kitai's lightsaber, the last relic of her life as a Sith. When she refused, Flen threatened to harm both her mother and her \"farmer boy\" friend. Orielle reluctantly surrendered her lightsaber. Prior to their departure, the two brothers also left Orielle with a shovel, a \"gift\" from Grand Lord Lillia to mark her new status as a slave. This shovel had been forged from one of the few bits of debris from the Omen, the Sith starship which had brought the Tribe's ancestors to Kesh during the Great Hyperspace War. Humiliated, Orielle lost her temper and destroyed Jelph's garden in a fit of rage. While rummaging through Jelph's barn, she discovered a starship beneath a mound of dung. This starship turned out to be an Aurek-class tactical strikefighter from the Galactic Republic."}, {"tag": "p", "text": "Orielle quickly realized that Jelph had come from the wider galaxy and that this starship could restore her family's fortunes. Since the Tribe had crash-landed on Kesh in 5000 BBY, they had not been able to return to the stars since they lacked the spare parts and technology to do so. The Tribe's access and knowledge of hyperspace travel was also inhibited by an edict by Nida banning anyone from visiting the Sith mountainside temple. Orielle returned to Tahv where she found her mother Candra working at the zoo. While Candra was skeptical of her daughter's discovery, she still told Orielle to contact the four other High Lords from the Red and Gold Factions and also gave her the special code to indicate a \"Kesh-shaking\" discovery. Unknown to Orielle, Candra secretly alerted Grand Lord Venn to her daughter's planned meeting with the High Lords in return for \"improved working conditions.\""}, {"tag": "p", "text": "Lillia then gathered her entourage including the Luzo brothers and traveled to Jelph Marrian's farm by uvak. The two Luzo brothers had recently been promoted to the position of High Lords as a reward for their loyalty. Meanwhile, Orielle reconciled with Jelph, who admitted that he was a Jedi, and the two former enemies subsequently fell in love. They then returned to Jelph's farm in an attempt to misdirect the High Lords by claiming that Orielle had found a sack of blasters, an offworld technology that was unknown to the Tribe. While traveling to the farm, Jelph and Orielle's uvak was pursued by Lillia's flight of uvak. Since they were able to tap into a jet stream, Lillia and her followers arrived at the farm first and quickly secured the perimeter. Candra's information proved useful and Lillia found Orielle's \"Kesh-shaking\" discovery in Jelph's barn."}, {"tag": "h3", "text": "An Untimely Death"}, {"tag": "p", "text": "Shortly after Grand Lord Lillia Venn's arrival, Jelph and Orielle arrived at the farm. While Jelph hid in the surrounding bush, Orielle went up to meet the \"visitors\", intending to present her discovery in an attempt to hide the starship from them. However, Lillia had already discovered Jelph's starship and used the Force to grasp Orielle, immobilizing her. Four guards then emerged from behind the barn and took Orielle into custody. Shortly later, the Grand Lord herself emerged from the barn and was accompanied by Flen and Sawj Luzo. Sawj revealed that the Tribe had allowed Orielle to deliver her message to Badolfa but that her mother Candra had informed Lillia. Lillia herself then confirmed that Candra had indeed \"betrayed\" her own daughter in exchange for \"improved working conditions.\" Had any of the other High Lords arrived at the meeting, Lillia announced she would have executed them for treason."}, {"tag": "p", "text": "However, she was content with her prize: Jelph's hyperspace-capable starship. Flen Luzo then led the elderly Grand Lord through the partially excavated manure pile towards the starship. Venn was triumphant that she had been the first since the Tribe's arrival to discover a starship that was capable of traveling to the stars. While examining the starfighter, she commented that she had spent her entire life aspiring for the Grand Lordship and expressed her annoyance that other people were thinking that it was time for her to die. She regarded the discovery of the starfighter as another peak that she could conquer and vowed to realize her people's ambitions of conquering the stars. She promised to take her followers with her after testing the starship's engines."}, {"tag": "p", "text": "While Lillia and her bodyguards were preoccupied with the discovery, Jelph Marrian used the Force to levitate a bag of blasters towards his hiding place behind the farmhouse. After sending a telepathic signal to Orielle warning her to get down, Jelph opened fire on her captors, killing two guards immediately. Since the last remaining blasters had ceased to function during the first century of the Tribe's colonization of Kesh, they were thrown into a panic. During this commotion, Jelph and Ori managed to escape into the Marisota River and started a new life in Keshtah's jungle highlands. Despite the fighting, Lillia was unwilling to let anything distract her from playing with her new discovery. After settling herself into the vessel's cockpit, she began to toy with the Aurek-class strike fighter's controls. Meanwhile the two Luzo brothers ordered the surviving Sith Saber to guard the barn's entrance against Orielle and her mysterious ally."}, {"tag": "p", "text": "Since the stable's doorway was large enough to accommodate wide-winged uvak, Lillia and her followers thought that they would be able to drive the starfighter through it. As the starfighter hovered towards the exit, Sawj and Flen suddenly realized that the vehicle was still connected to its moorings. In fact, two mono-filament cords had been tied around the starfighter's landing struts. These cords were in fact part of an ingenious anti-theft system which had been constructed by Jelph to destroy the starfighter and its occupants in the event that it was discovered by the Sith. These lines were connected to two proton torpedoes which were surrounded by thousands of kilograms of ammonium-nitrate based explosives. Lillia Venn initially mistook the initial explosions for a natural demonstration of the starfighter's power. However, her elation dissipated when the starfighter's four remaining proton torpedoes detonated in their launch tubes, destroying the starfighter, Lillia and her entourage, and the surrounding farmland."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Grand Lord Lillia Venn's untimely death in 3960 BBY would have significant repercussions for the Lost Tribe of Sith. Jelph Marrian's ingenious anti-theft system succeeded in destroying all traces of Lillia and her entourage along with the starfighter and the farm. The explosion was so strong that it caused the entire surrounding riverbank to sink into the Marisota River and was witnessed as far as Tahv by Keshiri laborers who were on duty. The events at Jelph's farm would be remembered in the Tribe's history as the \"Night of the Upside-Down Meteor\". Following Lillia's disappearance, the Red and Gold factions attacked her supporters and seized power, installing the former High Lord Candra Kitai as the new Grand Lord. However, Candra's reign as Grand Lord was brief and her only notable achievement was to close down Tahv's zoo. The Red and Gold factions then fought among themselves, before splintering into many factions which fought each other for control of the Tribe's leadership."}, {"tag": "p", "text": "For almost a millennium, the Lost Tribe of Sith was locked into a violent internecine conflict known as \"the Time of the Rot\", which devastated much of Keshtah. As a result, Keshtah's cities and infrastructure crumbled into ruins. By 3000 BBY, Keshtah had descended into its \"Dark Ages\" with the Tribe had been reduced to a few thousand people, threatening the viability of the Sith Tribe. In 3000 BBY, the historian and Caretaker Varner Hilts succeeded in reuniting the Tribe by rallying around the cause of reaching and conquering Alanciar, another continent in Kesh's southern hemisphere that was home to large Keshiri civilization. During the Sith Tribe's invasion of Alanciar, one of the Sith airships used in the exploration of that continent was christened the Lillia in an attempt to rehabilitate Lillia and other historical figures in the Tribe's history. This airship was destroyed shortly after arriving in Alanciar by an Alanciari ballista, killing all of its crew."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As with many of her fellow members of the Tribe, Lillia Venn was ambitious and sought to control everything. She also shared many of her compatriots' desire to return to the stars and to rule the galaxy. She was ruthless towards her opponents and was willing to use both deception and murder to achieve her goals. She engineered her own assassination attempt and used it as an opportunity to execute Dernas and Pallima, the leaders of the Red and Gold Factions, and to facilitate the downfall of High Lord Candra Kitai. Lillia also regarded the Grand Lordship as the pinnacle of power in the Tribe and was unwilling to yield her coveted position of Grand Lord her rivals. She was also known to make examples of her enemies as in the case of Candra, who was forced to shovel manure in full public view as punishment for her alleged role in the assassination attempt against Lillia."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Despite her old age, Lillia Venn was proficient in the dark side of the Force. She used Force lightning to attack her would-be assassin Campion Dey. Later, Lillia used the Force to grasp Orielle Kitai, immobilizing her."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lillia Venn first appeared as the main antagonist of John Jackson Miller's two eBooks Lost Tribe of the Sith: Purgatory and its sequel Lost Tribe of the Sith: Sentinel, which were first released on October 25, 2010 and February 21, 2011 respectively. This marks her only known appearances in the Star Wars Expanded Universe. Most of her lines are told through the point-of-view of Orielle Kitai, one of the two main protagonists in the series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}