{"url": "Limmie/Legends", "categories": ["Category:Legends articles", "Category:Articles with conflicting sources", "Category:Limmie", "Category:Sports"], "nodes": [{"tag": "h1", "text": "Limmie"}, {"tag": "p", "text": "Limmie, also called bolo-ball depending on the location, was a sport. The Galactic Cup of Limmie was composed of many teams throughout the galaxy."}, {"tag": "p", "text": "Though a popular sport on many planets, it was almost ignored on Coruscant. Even Galactic Cup matches held on Coruscant were poorly attended, and HoloNet News sportswriters did not seem to fully understand the rules. By contrast, the people of the planet Fwillsving were highly enthusiastic limmie fans. After Fwillsving's team defeated Kubindi in a 22 BBY Galactic Cup match, the ensuing celebrations left the city of Svitalos in ruins. Limmie was the favorite sport of Mandalorians and clone commandos. In Mando'a, the game is called Meshgeroya—the beautiful game. In 0 BBY the Galactic Cup was put on hiatus after the destruction of Alderaan and Team Alderaan was dissolved."}, {"tag": "h2", "text": "Major teams"}, {"tag": "h2", "text": "Famous players"}, {"tag": "h2", "text": "Rules of the game"}, {"tag": "p", "text": "Two teams play against each other, trying to score a goal. Single points are awarded for each goal. Actions like kicks, headers and physical contact in the form of tackles are allowed. An off-side rule also exists and penalties are awarded for infringements. The game is refereed by an on-field referee and two linesmen over two timed halves."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Complete Star Wars Encyclopedia, released in 2008, introduced an inconsistency in the naming of the sport. While an article on the HoloNet News website in 2002 specified that the game was called limmie in the Core and bolo-ball outside of the Core, The Complete Star Wars Encyclopedia stated the opposite. The discrepancy has yet to be resolved."}, {"tag": "p", "text": "Limmie is clearly meant as a parody of the real-world sport of soccer, as evidenced by their almost-identical rules, and the fact that both are nicknamed \"the beautiful game\". The unpopularity of limmie on Coruscant is possibly a reference to soccer's low popularity in the United States in contrast to the rest of the world."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}