{"url": "Limit_of_Vision", "categories": ["Category:Legends articles", "Category:Jedi starfighters", "Category:Seltaya-class fast couriers"], "nodes": [{"tag": "h1", "text": "Limit of Vision"}, {"tag": "p", "text": "Limit of Vision was a Hoersch-Kessel Seltaya-class fast courier flown by Jedi Master Jai Maruk while performing recon missions along the Hydian Way in the late stages of the Clone Wars."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 19 BBY, Jedi Master Jai Maruk used the ship to investigate CIS activity near the Wayland system. The vessel was badly damaged when Maruk ran into Separatist forces near Vjun, and he was forced to land the ship there. He was later apprehended by Dark Jedi Asajj Ventress, who injured Maruk but spared his life in order for him to deliver a message from Count Dooku to Grand Master Yoda. The Limit of Vision was also spared for Maruk to escape in."}, {"tag": "p", "text": "Upon Maruk's return to Coruscant, Padmé Amidala espied the ship from her apartment, hoping that it was her husband Anakin Skywalker returning from the Outer Rim Sieges. Upon inspecting the ship more closely, however, Amidala concluded that it was not Skywalker."}, {"tag": "p", "text": "The ship was kept by Boz Addle, the Jedi Temple's chief mechanic. He had a special fondness for the ship, and was quietly dismayed by the damage it received during Maruk's mission. When Maruk returned to Coruscant to meet with Yoda and the Jedi Council, Maruk wryly apologized to Addle for the sorry state of the ship, whose damage included electrical sparking, meteorite pocking, laser cannon burns and several proton torpedo impacts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Limit of Vision appears in the Clone Wars novel Yoda: Dark Rendezvous by Sean Stewart, in which it features in the first chapter. It makes no further appearances past this point. Despite the Seltaya-class courier being listed later in the novel as employing an astromech droid, no mention is made of a droid in Maruk's vessel."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}