{"url": "Lin-D", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Masculine programming", "Category:Third-degree droids"], "nodes": [{"tag": "h1", "text": "Lin-D"}, {"tag": "p", "text": "Lin-D was a masculine-programmed entertainment droid designed to tell jokes and make wisecracks. With a humanoid design, and gray, silver, and orange plating, Lin-D's facial features sported a perpetual grin and a pair of adjustable, white photoreceptors—both qualities that underscored his flippant attitude and penchant for making light of any situation. Indeed, Lin-D's loquaciousness proved unbearable to some; the protocol droid C-3PO found him to be quite annoying. Lin-D met C-3PO and his companions, the Humans Mungo Baobab and Auren Yomm, in 15 BBY after being forced to join a team of enslaved rowers on the large galley Roon Clipper, which was operated by agents of Governor Koong of Tawntoom Province on the planet Roon. When the astromech droid R2-D2 infiltrated the galley while out on the Roon Sea, Lin-D was freed with the others and fled on a lifeboat. He was incapacitated in the ensuing skirmish with Koong's drones, but R2-D2 restored him to full working order."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lin-D was an entertainment droid manufactured before the end of 15 BBY and programmed to spread amusement and good cheer. By the conclusion of that year, Lin-D fell into the hands of Koong, the Governor of the Tawntoom Province of the planet Roon. Koong forced the droid to join a crew of organic and mechanical slaves on an ocean-going galley called the Roon Clipper, where they were forced to serve as rowers. One day, Lin-D found himself chained to a galley bench and tasked with rowing the craft across the Roon Sea to Koong Island with a cargo of valuable gems known as Roonstones in the hold. The entertainment droid's seatmate—to whom he was shackled at the ankle during the voyage—was another mechanical, a protocol droid named C-3PO who had recently joined the slave workforce after being captured along with his master, Mungo Baobab, and a friend, Auren Yomm."}, {"tag": "p", "text": "Lin-D attempted to lighten the mood by joking about the situation, but C-3PO found him annoying. With a crack of the slavedriver's electro-whip, Lin-D joined the other captives in their hours-long journey."}, {"tag": "p", "text": "Part of the way through the voyage, Lin-D and the other prisoners were freed from their shackles by the astromech droid R2-D2, a colleague of C-3PO's who had sneaked aboard the Clipper. When the freed captives stole lifeboats held on the vessel, Lin-D joined C-3PO, R2-D2, Baobab, and Yomm in a craft as they made their escape. The escapees faced a savage storm and whirlpool, and an attack by drones that resulted in the loss of the lifeboat's motor and sail. During the latter debacle, the sail landed on Lin-D, incapacitating him."}, {"tag": "p", "text": "After C-3PO and the others escaped their perils in the boat, they checked on the prone entertainment droid. They feared Lin-D irreparable and consoled R2-D2, who had taken a liking to the comic mechanical. Nevertheless, over the remainder of the trip to Umboo Province, R2-D2 restored Lin-D back to full working order. The resuscitated droid expressed his thanks and suggested that he, R2-D2, and C-3PO form a touring act, \"Lin-D and His Cosmic Cutups.\""}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "As a third-degree droid, Lin-D was designed to interact with organic beings directly. He was an entertainment droid, programmed to spread humor and mirth. As such, he told jokes constantly, even in the most dire of circumstances. Indeed, he claimed that dangerous circumstances were the most opportune times to tell jokes since it was during such crises that levity was most needed to lighten the mood. The droid tended to laugh at his own gags; his laugh was a high-pitched, staccato sound that terminated in a snort. Although some members of Lin-D's audience found his constant quipping annoying, the droid had little sympathy for them; for instance, when C-3PO expressed irritation at the entertainment droid's shenanigans, Lin-D said he thought the protocol droid needed to lighten up. Lin-D was fluent in Basic and was programmed with a masculine personality."}, {"tag": "p", "text": "Lin-D had a humanoid body structure, with two arms, two legs, a torso, and a head. Although his neck and limbs were long and thin, standing him a bit taller than 1.7 meters, he had a pot belly. Lin-D's face was elongated, with a large nose and a long jaw centered between wide cheeks. The droid had a large, ever-grinning mouth that could open and close. Lin-D's neck, hands, nose, and brow were gray in color, and his fingers, mouth, jowls, forehead, and upper arms were silver. In contrast, his forearms, elbows, torso, and legs were rich orange with light-orange piping. He sported two orange circles where a Human's ears would be, and he had white photoreceptors with small black pupils in their centers. Lin-D could move the pupils in different directions either in tandem or separately, an effect he exploited to enhance the zaniness of his comic performances."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lin-D appears in \"Across the Roon Sea,\" an episode of the Star Wars: Droids: The Adventures of R2-D2 and C-3PO animated cartoon that was written by Sharman DiVono based on a story by Ben Burtt and directed by Ken Stephenson. The episode originally aired on November 23, 1985. An animation error has Lin-D appear in some scenes with five fingers per hand but only four fingers in others."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}