{"url": "Lina_Graf", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance Intelligence members", "Category:Engineers", "Category:Females", "Category:Graf family", "Category:Humans", "Category:Impersonators", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Lina Graf"}, {"tag": "p", "text": "Lina Graf was a young female human whose parents worked as frontier explorers. One day, Graf's parents were kidnapped by agents of the Galactic Empire, leaving her and her brother Milo alone on a remote planet. The siblings then decided to undertake a dangerous journey across Wild Space to rescue their parents. At some point during their adventures, the Graf siblings found themselves looking for allies on an ancient frontier world, but fell into a trap laid by Captain Visler Korda, an Imperial officer. Later on, Graf and her brother managed to trace their parents' latest clue to a remote jungle planet that housed a frightening beast."}, {"tag": "p", "text": "Eventually, Lina became a commander in the Alliance to Restore the Republic's Intelligence. At one point, she and her team crash landed on the planet Mustafar, not far from Darth Vader's castle. After escaping from the castle, she later returned to the castle in order to rescue a member of her team, posing as an Inquisitor."}, {"tag": "p", "text": "Years later, Lina became the great-aunt of Emil Graf. On at least one occasion, she shared with him a story of a thief who frequently stole from Dex's Diner, only to be tracked down by Jedi Master Obi-Wan Kenobi and have the stolen possessions returned."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Lina Graf was born around 28 BBY in the waning years of the Galactic Republic to cartographers Auric and Rhyssa Graf aboard the family's Mu-class shuttle, the Whisper Bird.The Grafs also had a son, Milo Graf, one year after Lina's birth. Due to the nature of their parents, Lina and Milo grew up travelling across Wild Space as Auric and his wife mapped out the uncharted star systems and sold them off to various buyers."}, {"tag": "p", "text": "Lina's parents' travels, while primarily based in Wild Space, also encompassed the Outer Rim Territories and reached as far as the Core Worlds. While visiting the planet Coruscant, Lina ate at Dex's Diner and developed a love of the nerfburgers served there. On one occasion, she sat beside Jedi Knight Obi-Wan Kenobi at Dex's Diner and was present when he began his pursuit of the Pa'lowick thief Tri Tellon. Early in their explorations, before the outbreak of the Clone Wars, the Grafs visited the oceanic planet of Mon Cala, and Auric made many friends among the Mon Calamari people. These travels were not without dangers, one instance taking Lina to a mining yard on Cedonne, where she was nearly flattened by a loadlifter.. In another instance on Chankin, the Grafs were attacked by pirates, and Lina and Milo witnessed their father use the Whisper Bird's weapons system to disable those of the pirates. During an excursion to the planet Indoumodo, the Graf siblings played speeder tag with their parents on speeder bikes through the Termite forests of Northern Indoumodo, the younger Grafs losing after crashing into a massive greddleback termite mound. The family's droid, CR-8R, recorded the game using holo-drones for posterity. Around 20 BBY, when Lina was eight years old, her father brought her to explore the ice caves of Orto Plutonia, where he taught her to scale the sheer cave walls and use an ice pick. A year later, around 19 BBY, Lina visited a village on Ikari, where she encountered a tribal elder whose sensor mask enhanced his senses of sight, hearing and smell, allowing him to hunt better than the rest of his tribe."}, {"tag": "h3", "text": "Imperial Entanglement"}, {"tag": "h4", "text": "Abduction and escape"}, {"tag": "p", "text": "Around 18 BBY, the Graf family was mapping out on uncharted swamp planet on the edge of wild space, a planet which the Graf's had exclusive rights to map thanks to the work of their agent, Dil Pexton. Whilst on the planet, Lina received a holo message from her brother asking for her assistance as he had wandered off into the swamplands with the family's pet Kowakian Monkey-Lizard, Morq, despite the warnings of his parents. Lina and the family droid, CR-8R, ventured out on a landspeeder in search of the younger Graf using a tracker their mother had put on his speeder bike and eventually located him as well as his damaged vehicle. Milo had discovered and was trying to capture a species of animal that he described as similar to a Sullustan ash-rabbit although the creature proved too quick for him which was what led to him asking Lina for help."}, {"tag": "p", "text": "The group eventually got close enough for Milo to aim his father's wrist mounted net launcher at the creature but before he could take the shot a creepervine grabbed Lina by her ankles with the intention of devouring her. Despite her struggling the young Graf girl was unable to break free from the creatures vines so she went to grab her fusion cutter out of her toolbelt but it had fallen as she was lifted into the air. Luckily, Morq was able to scoop up the tool and deliver it the Lina allowing her to cut through the vines and come crashing down the the swampy floor, injuring her shoulder in the process."}, {"tag": "p", "text": "After making sure Lina was okay, CR-8R received an impromptu data load from an unknown source that was encrypted in an ancient dialect which he began to decrypt. The group then travelled back to camp as Lina and her brother was worried they'd be in trouble for wandering off too far. When they arrived back at camp their parents were nowhere to be seen and all the equipment they had brought was also gone, only the tents remained. After some investigation the children located their mother's necklace and a holo recorder buried under the mud which Lina was able to clean up and review the footage stored on there. The group watched a recording which showed a squadron of stormtroopers led by a Captain Korda confront Auric and Rhyssa, demanding the hand over their maps and other data for free in service of the Empire. In order to avoid any trouble, Lina's mother used her datapad to transfer some of their data over to the Imperials although this was not enough. Korda informed the couple that Darth Vader himself had tasked him with the capture of the cartographers so that they could personally serve the needs of the Empire and when they resisted the stormtroopers beat and arrested them explaining why Rhyssa's necklace was left behind. In the struggle the couple let it slip that their children were nearby so Korda ordered his men to destroy the family's ship, the Whisper Bird, and to track down and eliminate Lina and her brother."}, {"tag": "p", "text": "After witnessing the recording the two children decided to try and beat the Stormtroopers to their family's ship by using their landspeeder and taking advantage of the fact the troopers were on foot. When they arrived they realised they were too late and hid whilst the Stormtroopers exited the cavern where the Whisper Bird was waiting, as they hid they overheard the troopers and discovered they'd rigged the cavern to explode. Using his net launcher, Milo provoked a creepervine to attack the Stormtroopers, allowing him, Lina, Morq and CR-8R to dart past them up towards the cave although the soldiers did notice them and the subsequent gunfire caused the cave entrance to collapse after the Grafs were inside. Thinking there was no way out, the Stormtroopers left assuming the children would be killed in the upcoming explosion."}, {"tag": "p", "text": "In order to escape, the children used the Whisper Bird to conduct a pulse scan, allowing them to get a complete map of the cave allowing Lina to pilot the ship through the cavern to an alternative exit. Due to the narrow walls of the cave Lina couldn't extend the wings of the ship and therefore relied on the ships landing thrusters to fly causing the ship to be badly damaged during the escape."}, {"tag": "h3", "text": "Rescuing Lieutenant Hudd"}, {"tag": "p", "text": "After joining the Rebel Alliance, Graf and a team of rebel operatives undertook a fact-finding mission to the Outer Rim, though during the course of the mission they crash landed on Mustafar. Whilst exploring Fortress Vader, Lieutenant Thom Hudd was captured and was kept prisoner where he was tortured by Vaneé, the aide of Darth Vader. Graf however, managed to escape."}, {"tag": "p", "text": "At some point, Graf acquired a set of an Inquisitor's armor, and while impersonating them, she infiltrated the fortress to rescue Hudd. After talking and fighting with Vaneé, the aide stated that Graf was no Inquisitor, revealing that he knew it had been Graf because she was not carrying a lightsaber. After briefly being defeated by the aide, Graf regained the upper hand and along with Hudd, managed to escape Mustafar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lina Graf first appeared in the 2016 junior novel Adventures in Wild Space: The Escape by Cavan Scott, which was the prelude to the junior novel series Star Wars: Adventures in Wild Space. In Scott's original sample for what became the Adventure in Wild Space series, Graf was a Twi'lek rather than human."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}