{"url": "Lina_Soh", "categories": ["Category:Canon articles", "Category:Articles with spoilers", "Category:Articles to be expanded", "Category:Females", "Category:Humans", "Category:Supreme Chancellors"], "nodes": [{"tag": "h1", "text": "Lina Soh"}, {"tag": "p", "text": "Lina Soh was a female Supreme Chancellor of the Galactic Republic during the High Republic Era, holding office around 232 BBY. Jedi Master Avar Kriss noted that Soh appeared to be far more delicate than she actually was."}, {"tag": "p", "text": "Elected prior to the Great Hyperspace Disaster, Soh oversaw a period of great expansion. Soh established outreach programs, such as the Starlight Beacon, to bring the worlds of the Outer Rim Territories into the Republic. At the chancellor's request, the Jedi Order also established its own outposts in the far reaches of the galaxy, to provide assistance to any group or world who might require it. These outposts were built to function autonomously from the authority of the Jedi Temple on Coruscant and, by extension, that of the Republic itself."}, {"tag": "p", "text": "Soh was focused on the unification of systems in the quickly expanding Republic as exploration into the Outer Rim Territories increased. Part of her efforts on this front included the Great Works, which were projects she helmed that included the creation of the Starlight Beacon as well as constructing other communications relays throughout the galaxy, holding the Republic Fair, negotiating a treaty between the Quarren and Mon Calamari, and other technological innovations."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Supreme Chancellor"}, {"tag": "p", "text": "Lina Soh was a human female whose family came from Daghee. Her son, Kitrep Soh, did not enjoy being in the public eye alongside her."}, {"tag": "p", "text": "Around 232 BBY, Lina Soh served as the Supreme Chancellor of the Galactic Republic. Envisioning the spread of the Republic's influence in the galaxy, Soh planned many Great Works as part of her vision, including an outreach program. The cornerstone of these efforts was the space station Starlight Beacon, the first in a planned network of such stations. Shortly before Starlight was due to open, however, the freighter Legacy Run was destroyed in the Great Hyperspace Disaster, an incident which disrupted hyperspace travel galaxy-wide and led to the near-destruction of the Hetzal system. Admiral Pevel Kronara and Jedi Master Avar Kriss, who led the Republic rescue effort in the system, kept Soh apprised of developments there."}, {"tag": "p", "text": "In the aftermath, as Emergences of the debris continued to occur throughout the Outer Rim Territories, Soh ordered an extensive interdiction on hyperspace travel to prevent further incidents, while authorizing a task force to investigate the cause."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "During the Imperial Era, the senile Hutt Marlo believed he was still in the High Republic Era while participating in a holoconference. When asked for his opinion on a matter, Marlo stated that he believed Chancellor Soh was a woman with which they could do business, although he did not trust her cats."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lina Soh had a delicate build which belied her strength of will. Believing in the good the Republic could do through continued expansion, Soh was determined to do what she could for the galaxy. Her views were emphasized through her catchphrase, \"We are all the Republic.\""}, {"tag": "p", "text": "Soh had two pet targons, Matari and Voru. The twin targons were closely bonded to Soh and were loyal to her in a way no other being was. They acted as bodyguards as well as companions and were said to have never left her side. Soh often spoke to Voru and Matari as she verbally thought through her ideas or plans. While the targons did not possess the ability to understand basic, they could sense and understand her feelings and emotions."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lina Soh is a character created for Star Wars: The High Republic publishing project. Soh was first mentioned in \"Starlight: Part One - Go Together,\" a short story written by Charles Soule and published in Star Wars Insider 199 on December 15, 2020. She later debuted in the novel The High Republic: Light of the Jedi, which was also written by Soule and released in 2021."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}