{"url": "Line_of_battle", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic military units", "Category:Galactic Republic military units", "Category:Imperial military units", "Category:New Republic military units"], "nodes": [{"tag": "h1", "text": "Line of battle"}, {"tag": "p", "text": "A line of battle, also called battle line or simply line, was a level of organization for capital ships within a fleet. Usually it was the lowest unit above a single starship and beneath the squadron."}, {"tag": "h2", "text": "Old Republic"}, {"tag": "p", "text": "During the Clone Wars, the level above a single ship was a called a section. Sections were commanded by the most senior ship captain present, unless there was a Jedi Commander."}, {"tag": "p", "text": "A section was called a line when it was made up of larger and heavier armed ships, so-called ships of the line. These lines were organized in groups of 3-4 ships."}, {"tag": "p", "text": "Flotillas were composed of smaller ships like corvettes or patrol craft operated in sections of 6-12 ships."}, {"tag": "h2", "text": "Galactic Empire"}, {"tag": "p", "text": "Under the Galactic Empire, the Imperial Navy had several kinds of lines, each suited for a different task. Each line had four ships, but in reality, these number varied. At 3 ABY, the lines actually consisting of four ships made up around seven percent of the Imperial Navy. A line usually had 1-20 ships, commanded by a Captain of the Line."}, {"tag": "p", "text": "An attack line was composed of either six light cruisers and frigates or three heavy cruisers. Its mission profile was to engage other capital ships of similar size or to draw away enemy fire from Star Destroyer"}, {"tag": "p", "text": "A heavy attack line consisted of four to eight ships, none smaller than a light cruiser, sometimes even a Victory-class Star Destroyer. On the battlefield, this line was able to come even against the same number of enemy capital ships and could operate independently from central command."}, {"tag": "p", "text": "Pursuit lines were made up of light cruisers and sometimes corvettes and even frigates, operating in numbers of 4-10 ships. On the battlefield, pursuit lines engaged retreating ships and followed them to their base. A popular tactic employed by the these lines was Beambaiting."}, {"tag": "p", "text": "A recon line had two or four ships, often light cruiser with improved sublight speed and improved Hyperwave signal interceptors. These ships operated alone or in pairs, tracking down Rebel bases. Often recon lines are sent into enemy territory to actively look for hostile bases and fleets. However, their mission is not to actively engage the enemy, but to retreat and report their findings."}, {"tag": "p", "text": "Skirmish lines engage enemy capital ship or starfighters. This role was later mostly taken over by the increasing number of TIE fighters, however these lines now serve as cover and provide cover fire for them. Skirmish lines consist of 4-20 ships, mostly corvettes, but also Skipray blastboats and frigates. These lines were sometimes used as a convoy escort."}, {"tag": "p", "text": "The torpedo line consisted of only two Torpedo Spheres and was used for planetary bombardment."}, {"tag": "p", "text": "A troop line had only four ships, two Evakmar-KDY transport or Delta-class troop transports and two Strike-class medium cruisers. Due to the strict level of organization within the Imperial Army, this line was the most consistent within the Navy."}, {"tag": "p", "text": "The Star Destroyer line consisted of only a single Imperial-class Star Destroyer, but also a Super-class Star Destroyer. At the beginning of the expansion of the Navy, a study concluded that an Imperial-class Star Destroyer was equivalent to a Squadron. However, to acquire more Star Destroyers, the Admiralty classified the Star Destroyer as a line, since there were more lines than squadrons."}, {"tag": "h3", "text": "Known lines"}, {"tag": "h2", "text": "Rebel Alliance"}, {"tag": "p", "text": "Due to the nature of the Rebellion, an organized fleet structure was nearly impossible to keep. Single sector forces differed too much to form a single unified stricture. When the Mon Calamari joined the Rebellion and donated their Mon Calamari Star Cruisers, the new Supreme Commander, Admiral Gial Ackbar formed so-called Roving Battle Lines."}, {"tag": "p", "text": "A line consisted of 3-10 cruisers plus any number of escorts, close support vessels and starfighters. The lines were mobile and engaged the Empire only when necessary, sometimes drawing forces from the local sector. If necessary, a line disbanded for a while in order to avoid detection by the Empire. A Battle Line was commanded by the most senior ship captain or a Line Admiral."}, {"tag": "p", "text": "A battle line had several sub-elements, but these seldom operated alone:"}, {"tag": "p", "text": "The Cruiser element formed the backbone of the line and had the most firepower. They engaged similar-sized ships of the enemy."}, {"tag": "p", "text": "The Close Support element was made up of frigates and corvettes and had the duty to protect the cruisers from enemy close support ships. While their role was defensive, these ships would launch offensives as well, depending on the battlefield situation."}, {"tag": "p", "text": "Picket elements were Fast-attack patrol ship and other picket ship, for example Light freighters. These ships were responsible for detecting approaching enemies and early engagements to force the enemy into battle formation."}, {"tag": "p", "text": "The Starfighter element had two roles: Starfighter escort stayed close to the capital ships and engaged attacking enemy fighters, while Attack Starfighters penetrated the enemy's close support line to attack the cruisers."}, {"tag": "h3", "text": "Known lines"}, {"tag": "h2", "text": "New Republic"}, {"tag": "p", "text": "The New Republic's basic level of organization above a single ship was the task force. From their structure, they were similar to the Roving Battle Lines of the Rebellion. A task force consisted of a single Star Destroyer or Carrier as flagship, two heavy cruisers, two transports or carrier, three frigates and four gunships. Additional support ships brought the average number of ships in a task force up to 21. A task force was usually commanded by a Commodore or an Admiral."}, {"tag": "h3", "text": "Known task forces"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}