{"url": "Lira_Hardin", "categories": ["Category:Canon articles", "Category:Character stubs", "Category:Females", "Category:Imperial Army personnel of the Galactic Empire", "Category:Imperial defectors", "Category:Individuals of unspecified species", "Category:Republic Army personnel"], "nodes": [{"tag": "h1", "text": "Lira Hardin"}, {"tag": "p", "text": "Lira Hardin was a female native of the astronomical object Gall. Long before the Separatist Crisis, Hardin left her native Gall for the Judicials of the Galactic Republic, where she was trained as a combat engineer, becoming a part of the Republic's 9th Engineering Battalion. Later, during the Clone Wars against the Confederacy of Independent Systems, she was moved to the Grand Army of the Republic for the duration of the conflict, where she participated in the bombardment of the planet Xorrn near the end of the war, which resulted in the destruction of several Trade Federation core ships."}, {"tag": "p", "text": "After the Clone Wars, and the Republic's transition into the Galactic Empire, Hardin continued to serve in the 9th Engineering Battalion, but after having bore witness to the subjugation of Rampa I, she resigned from the Empire and returned to her homeworld. However, despite her resignment, the Empire soon followed her to Gall where they proceeded to bombard her hometown and place Jans Coorsa under leadership of Gall, which resulted in Hardin becoming involved in clan politics and was soon named patrician of the Hardin family. Despite her contradictions of Coorsa, they did share a mutual respect, and after the decimation of their village, Hardin convinced Coorsa to go into hiding on Xorrn, where they reactivated the Geonosian-built droid factories of Foundry Four and created an orbital repair yard. After Jans' passing, Hardin opposed his grandson, Kal Coorsa, who sought higher-profile clients, particularly the Rebellion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lira Hardin was introduced in the 2016 Fantasy Flight Games adventure book Friends Like These as part of the Star Wars: Age of Rebellion roleplaying game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}