{"url": "Lirin_Car%27n", "categories": ["Category:Canon articles", "Category:Bith", "Category:Males", "Category:Musicians"], "nodes": [{"tag": "h1", "text": "Lirin Car'n"}, {"tag": "p", "text": "Lirin Car'n was a Bith male who was a kloo horn player and a member of Figrin D'an and the Modal Nodes. The son of renowned kloo horn player Lirin D'avi, he was a talented musician but nevertheless disliked playing professionally. He was with the Modal Nodes on Tatooine in 0 BBY, playing at both Jabba's Palace and Chalmun's Spaceport Cantina."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Lirin Car'n was born the son of Lirin D'avi, a renowned musician considered by many Bith to be the best kloo horn player that had ever lived. Car'n eventually followed in his father's footsteps, and after his father's death, came into possession of his kloo horn."}, {"tag": "h3", "text": "The Modal Nodes"}, {"tag": "p", "text": "Car'n eventually joined the band Figrin D'an and the Modal Nodes, led by the eccentric Figrin D'an. However, Car'n grew to despise his bandleader as well as his bandmates, as well as the restless lifestyle of a musician."}, {"tag": "p", "text": "D'an, who was considered insufferable because of his tendency to book gigs without the band's consent, secured them a gig on the Outer Rim world of Tatooine, assuring them it would pay well and only last for a standard week. D'an, however, had not told them that he had a price on his head, and, having been found by Rodian bounty hunter Greedo, had sold the band into indentured servitude to pay off his debt. The job, which was actually for Hutt crime lord Jabba Desilijic Tiure, lasted for over a year, causing further friction between the band and its leader."}, {"tag": "p", "text": "By 0 BBY, however, D'an secured the band's freedom, a feat accomplished by exposing Greedo's activities behind Jabba's back. They arrived in the spaceport of Mos Eisley; instead of making their way off-planet, however, D'an secured the band a gig playing at Chalmun's Spaceport Cantina."}, {"tag": "h3", "text": "Mos Eisley"}, {"tag": "p", "text": "At some point, Car'n had fallen into debt with Greedo; desperate for credits, he set out to sell his father's kloo horn in Mos Eisley. However, before he could do so, he became intoxicated and lost the horn to the Abyssin Myo in a card game. Unbeknownst to Car'n, Myo promptly became similarly intoxicated and lost it, the Talz pickpocket Muftak having stolen it. Now without his horn to sell to the Rodian loan shark, Car'n hired Sakiyan bounty hunter Djas Puhr to retrieve it. Though Puhr had also been hired to retrieve it by Myo, Car'n promised him a payout of two hundred credits in exchange for the kloo horn."}, {"tag": "p", "text": "Car'n was found by Greedo, accompanied by hired muscle, Cornelius Evazan and Ponda Baba. Despite not having the money, Greedo granted Car'n clemency, partially because of Car'n's pleas for mercy and partially because of Greedo's mission to kill the smuggler Han Solo, who was also in Chalmun's Cantina at the time."}, {"tag": "p", "text": "Eventually, Puhr acquired the horn from a Scrapper, who had in turn acquired it from Muftak's companion Kabe, having sold the item to pay off a loan to Ackmena. Car'n confronted the combined group of pickpockets, thieves, and scoundrels at a table at the cantina. In the heated conversation it became clear that much of the group's complicated caper stemmed from Solo's failure to deliver his cargo of narcotics to Muftak, but Puhr convinced the group to let the smuggler live, promising to pay off all the debts himself."}, {"tag": "p", "text": "Though Greedo's attempt to murder Solo went forward, this was hampered by the arrival of Luke Skywalker and Jedi Master Obi-Wan Kenobi in the cantina, who, in an altercation, incapacitated Baba and Evazan. Without his henchmen, Greedo confronted Solo alone and was killed. With Car'n now debt-free, Puhr returned his kloo horn, defusing the situation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}