{"url": "Lirin_Car%27n/Legends", "categories": ["Category:Legends articles", "Category:Bith", "Category:Males", "Category:Mercenaries", "Category:Musicians"], "nodes": [{"tag": "h1", "text": "Lirin Car'n"}, {"tag": "p", "text": "Lirin Car'n was a Bith male musician and professional kloo horn player for the popular jizz band known as Figrin D'an and the Modal Nodes. Along with his band mates, Lirin was a registered member of the Intergalactic Federation of Musicians in good standing. Like many Bith, Lirin possessed a highly evolved brain, which allowed him a special acuity when it came to analyzing and relating to music. As such, his talents helped to greatly enhance the quality and popularity of the Modal Nodes' music."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lirin wasn't always a musician. Prior to taking up the kloo horn, he worked as a mercenary and was a close associate of the Abyssin known as Myo. Between jobs, however, Lirin would find time to perform as a backup player for the Modal Nodes."}, {"tag": "p", "text": "Shortly before the Battle of Yavin, Figrin D'an and the Modal Nodes had entered into an exclusive contract with the Tatooine crime lord Jabba Desilijic Tiure. They would routinely perform in the courts at Jabba's Palace and his Mos Eisley townhouse, but it didn't take long before they all regretted entering into a contract with the Hutt. Recognizing Jabba's penchant for executing underlings that displeased him at a moment's notice, the Modal Nodes began to fear for their lives. It would only be a matter of time before Jabba decided to make a snack of the musicians, by tossing one down into the dungeon abode of his pet rancor. Fortunately for them, a golden opportunity was fresh at hand."}, {"tag": "p", "text": "One of Jabba's rivals, a Whiphid named Lady Valarian, offered the band 3,000 credits to perform at her wedding to the Whiphid hunter D'Wopp. Figrin decided that the fast money would enable them to get off of Tatooine and out from under the thumb of Jabba the Hutt. They arrived at the Star Chamber Café reception hall inside of the Lucky Despot Hotel & Casino in Mos Eisley."}, {"tag": "p", "text": "Jabba learned of the Modal Nodes' breach of contract and sent several of his bounty hunters down to the casino to disrupt the festivities. As luck would have it, Imperial stormtroopers likewise raided the party, and a massive firefight broke out. During the confusion, the Modal Nodes met a party guest named Wuher, who showed them a quick way out. Wuher put in a good word for them with Chalmun—a Wookiee who owned a nearby cantina where Wuher tended bar. Chalmun hired the Modal Nodes to play a couple of gigs at his bar, the following evening. They were performing when Luke Skywalker and Obi-Wan Kenobi entered the cantina seeking a pilot willing to ferry them to the Alderaan system. They continued to perform at Chalmun's on a regular basis. At least once, Chalmun's night-shift manager, Ackmena, livened the bar's atmosphere by singing along with the Modal Nodes' rhythms. However, Car'n was not present for this performance."}, {"tag": "p", "text": "Shortly after this event, Figrin D'an wagered the band's instruments and equipment on a hand of sabacc. He lost the bet, but the Modal Nodes soon convinced him to win their equipment back. He eventually succeeded, and the Modal Nodes went on to play the intergalactic circuit."}, {"tag": "h2", "text": "Notes"}, {"tag": "p", "text": "Like many in the band, Lirin Car'n did not actually own his kloo horn. All of the instruments and equipment were the property of Figrin D'an (the only exception to this was Doikk Na'ts, who custom built his own Fizzz)."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The role of Lirin Car'n was played by makeup artist Doug Beswick. Beswick did not receive screen credit for the role in A New Hope."}, {"tag": "p", "text": "Lirin was not seen on the bandstand in A New Hope. Instead, he was seen sitting at one of the table-booths in the cantina."}, {"tag": "p", "text": "In 1995, Kenner released a special Power of the Force series mail-in offer for a five-piece action-figure lot containing the members of the Modal Nodes. Lirin Car'n was one of two members not included in the set. The other was Sun'il Ei'de."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}