{"url": "Lirra", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Baxel sector planets", "Category:Galactic Empire planets", "Category:Slavery worlds", "Category:The Slice planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Lirra"}, {"tag": "p", "text": "Lirra was an Outer Rim planet with mineral pools and mud flats on its surface. Located within the Baxel sector close to the border with Hutt Space, Lirra was originally colonized by Human settlers, but almost a century prior to 2 ABY, the Humans on Lirra became outnumbered by members of the Hutt Jhank Shel clan."}, {"tag": "p", "text": "By 2 ABY, Lirra was a resort world, with over a million Humans serving the Hutts as slaves. When an undercover news crew discovered the status of the Humans, the Galactic Empire drove the Jhank Shel off Lirra and claimed the planet, causing Lirra's Human population to be retrained to become Imperial citizens."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lirra was a planet located within the Lirra system of the Outer Rim Territories' Baxel sector. Located close to the border of Hutt Space as a part of the region known as the Slice, the planet was connected by the Shag Pabol hyperlane to the Outland Transit Station and the planet Teth. Lirra had extensive networks of mud flats and mineral pools on its surface, for which it was well known in galactic society."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Lirra was home to a colony of Human settlers almost a century before the year 2 ABY. Around that time, the Jhank Shel kajidic, a clan of the Hutt species that had been embroiled in settlement rights disputes with Human inhabitants of the Baxel sector for hundreds of years, moved enough of its members to the planet to outnumber its Human population. The Jhank Shel then called for a plebiscite to bring Lirra into the Hutt fold."}, {"tag": "p", "text": "Nearly a hundred years later, an undercover news investigation team discovered and revealed to the Galactic Empire the existence of over a million Human slaves living on Lirra as indentured servants of the Hutt clan. Combined with Lirra's location within an Imperial-held sector near Teth, the regional seat of Imperial power, this information caused great pressure for the Empire to intervene in the situation on Lirra."}, {"tag": "h3", "text": "Imperial takeover"}, {"tag": "p", "text": "Three months later, in 2 ABY, Imperial military forces under the command of Moff Heedra of the Baxel sector were sent in to claim Lirra and a few lesser surrounding star systems. In an address claiming Lirra, Heedra declared it a disaster planet. The takeover was carried out over a weekend and was largely peaceful, with the Imperial troops forcing the Jhank Shel to relocate to Hutt Space."}, {"tag": "p", "text": "By the date 37:11:9, when Colonial News Nets issued a news report detailing the Imperial takeover of Lirra, government relief assistance groups were en route to the planet to help retrain the Humans of Lirra to live as Imperial citizens. According to the report, a governor was expected to be appointed by the Emperor's staff in order to supervise the rebuilding of Lirra's infrastructure. Although the Hutt government had issued a protest against the takeover of Lirra, there had been no official response from the Empire by 37:11:9."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "By 2 ABY, Lirra was a resort world inhabited by Hutt members of the Jhank Shel clan as well as over a million Human slaves. That year, the Hutt rule of Lirra was ended by the Galactic Empire, which then attempted to retrain the planet's Human inhabitants as Imperial citizens."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Lirra had at least one settlement, the city Shando. A Colonial News Nets report issued shortly after the Imperial takeover of Lirra stated the metro area of Shando was calm on the morning of 37:11:9."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lirra was first mentioned in the \"Galaxywide NewsNets\" feature of West End Games' Star Wars Adventure Journal 12, which was published in February 1997. The 2009 reference book The Essential Atlas placed the planet in grid square U-12."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}