{"url": "List_of_Legends_elements_in_the_films", "categories": ["Category:Real-world articles", "Category:Films", "Category:Real-world lists"], "nodes": [{"tag": "h1", "text": "List of Legends elements in the films"}, {"tag": "p", "text": "C-canon elements from licensed Expanded Universe (EU) creators have appeared in the Star Wars films, mainly the prequel trilogy. Most of these are brief appearances, almost taking the form of Easter eggs, and are even hardly distinguishable. However, others are more substantial."}, {"tag": "p", "text": "The prequel trilogy also has many references to names and elements introduced in the television series Star Wars Droids due to Ben Burtt's large involvement in both, not the least of which is the cameo by himself as Ebenn Q3 Baobab in The Phantom Menace."}, {"tag": "p", "text": "The reverse process is also true: many Expanded Universe works have given names and/or background information to nearly every element shown in the films. Additionally, the Visual Dictionary series, along with other official sources such as \"What's The Story?,\" has also introduced many retcons, thus \"creating\" C-canon depictions in films—e.g. the Star Wars: Revenge of the Sith: The Visual Dictionary identifies Count Dooku's tunic in Revenge of the Sith as being created on Vjun, a planet found heretofore strictly in the EU. The significance of these identifications, for the most part, is downplayed in this article."}, {"tag": "p", "text": "After the reboot of 2014, EU material has been harvested for use in the new continuity, and films including Star Wars: Episode VII The Force Awakens borrow Legends material."}, {"tag": "h2", "text": "Star Wars: Episode I The Phantom Menace"}, {"tag": "h2", "text": "Star Wars: Episode II Attack of the Clones"}, {"tag": "h2", "text": "Star Wars: Episode III Revenge of the Sith"}, {"tag": "p", "text": "Revenge of the Sith has several elements that first appeared in Legends sources, such as Labyrinth of Evil, that were written during the movie's production. However, since those sources have borrowed those elements directly from the finished post-production movie script (for example, General Grievous was written for the film but first appeared in Star Wars: Clone Wars), they are not included."}, {"tag": "h2", "text": "Star Wars: Episode IV A New Hope"}, {"tag": "h2", "text": "Star Wars: Episode V The Empire Strikes Back"}, {"tag": "h2", "text": "Star Wars: Episode VI Return of the Jedi"}, {"tag": "h2", "text": "Star Wars: Episode VII The Force Awakens"}, {"tag": "h2", "text": "Rogue One: A Star Wars Story"}, {"tag": "h2", "text": "Star Wars: Episode VIII The Last Jedi"}, {"tag": "h2", "text": "Solo: A Star Wars Story"}, {"tag": "h2", "text": "Star Wars: Episode IX The Rise of Skywalker"}, {"tag": "h2", "text": "Notes and references"}]}