{"url": "Listehol_Campaign", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Battles of the Listehol Campaign", "Category:Early Imperial campaigns"], "nodes": [{"tag": "h1", "text": "Listehol Campaign"}, {"tag": "p", "text": "The Listehol Campaign was an Imperial Period campaign launched by the Galactic Empire in 18 BBY as part of the Reconquest of the Rim. Its purpose was to drive out a union composed of Tervig and Zygerrian slavers, along with Sikurdian pirates, from the pair of Outer Rim hyperlanes known as the Listehol Run and the Shaltin Tunnels. An Imperial fleet under the command of Admiral Wullf Yularen and Captain Bannidge Holt emerged victorious at the planet Sagma, then besieged the planet Zygerria before it negotiated peace with the Imperials. The Listehol Campaign ended after Imperial raids directed by Yularen from his fleet failed to take the world of Tervissis."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "By the year 18 BBY, at the time of the Imperial Period, a union of Tervig and Zygerrian slavers, along with Sikurdian pirates, had made the Outer Rim hyperlanes known as the Listehol Run and the Shaltin Tunnels dangerous trade routes for shipping, and had also carried out raids into the Corporate Sector, a region near those routes. In response to these activities, the Galactic Empire dispatched Admiral Wullf Yularen, along with Captain Bannidge Holt, to deal with the slavers and pirates as part of the campaign to regain control of that area with the Reconquest of the Rim."}, {"tag": "h2", "text": "The campaign"}, {"tag": "p", "text": "Commanding a fleet of Invincible-class Dreadnaught Heavy Cruisers—originally intended for the Corporate Sector's government, the Corporate Sector Authority—complemented by squadrons of TIE/LN starfighters launched from a few Venator-class Star Destroyers, Yularen won the first engagement against the criminal union at the planet Sagma, where his fleet withstood a swarm of Sikurdian pirates."}, {"tag": "p", "text": "The Imperial fleet then advanced down the Listehol Run and proceeded to besiege the world of Zygerria, an interdiction that ended after the an Zygerrians negotiated peace with Imperial Advisor who arrived backed by stormtroopers. Zygerria then served as a base of operations for Yularen's fleet, which launched a series of raids against the Tervig homeworld of Tervissis. However, the Tervig slavers proved to be intractable, and the failed Imperial offensive ended the Listehol Campaign."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Holt, for his role in the campaign, became a newly minted war hero for the Empire and was later given command of a portion of the naval forces involved in the Western Reaches Operation the next year. Yularen's reputation was also raised by his successful campaign."}, {"tag": "p", "text": "The raids against Tervissis were generally strategic failures and did not stop the Tervig slavers. As a result, the Empire would ultimately resort to conquering the planet outright in 13 BBY."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Listehol Campaign was first mentioned in The Essential Guide to Warfare, an extensive guide dedicated to the conflicts in the galaxy, written by Jason Fry and Paul R. Urquhart and released in 2012."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}