{"url": "Little_Bivoli", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Captured starships", "Category:Galactic Republic starships", "Category:Quartermaster-class supply carriers"], "nodes": [{"tag": "h1", "text": "Little Bivoli"}, {"tag": "p", "text": "The Little Bivoli was a Quartermaster-class supply carrier that served as a fringer provisioning ship for the Republic Navy until its destruction in 3963 BBY. It was stolen from its original owners on Ralltiir by the Trandoshan Slyssk, a former member of the pirate organization Raff Syndicate. He was hired by the Snivvian black marketeer Marn \"Gryph\" Hierogryph, a companion of the Jedi Padawan Zayne Carrick—both accused of perpetrating the Padawan Massacre of Taris, where four of Carrick's fellow Padawans were killed by their Masters. When the ship left Ralltiir, it was contacted by the Republic Navy's Battle Group Serroco and ordered to join formation, as the supply carrier had served the fleet previously. The battle group jumped to hyperspace for Serroco, where it took part in a battle against the Mandalorians in the ongoing war between the Republic and the Mandalorians. Hierogryph continued the ship's provisioning role in order to make quick money and did so successfully with the Little Bivoli earning the reputation for being better than the Navy commissary. It was on Serroco that the Little Bivoli was destroyed when the Mandalorians bombarded the planet from orbit."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Little Bivoli was a Quartermaster-class supply carrier, manufactured by Corellia StarDrive, which served as a provisioning ship. Both sides of the forty-five meter long ship could fold out to reveal dining areas with tables and chairs. The dining areas were on the diagonal surfaces of the vessel when folded and would not be beneath the partial shelter of the overhanging hull when open, meaning that these parts were not protected from rain. The buffets and galley serving these dining areas were located in the middle of the ship."}, {"tag": "p", "text": "Stores for cargo and quarters for the ship's crew were situated above the galley with the cockpit to the front of the ship on the starboard side. There was also a walkway that ran over the galley from the cockpit which gave a view of the entire dining area on that side. The dining areas were staffed by serving droids which were often not adequately maintained. The ship's name was written in Aurebesh on the sides of the ship above the sections which folded out."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Acquisition"}, {"tag": "p", "text": "In 3963 BBY, the Arkanian offshoots Jarael and Camper left the planet Ralltiir on their ship, The Last Resort, to find a cure for Camper's illness on Arkania. Their companions, the Snivvian black marketeer Marn \"Gryph\" Hierogryph and the Jedi Padawan Zayne Carrick, were forced to look for passage offworld in order to continue with Carrick's plans to clear himself and Hierogryph from being the falsely accused perpetrators of the Padawan Massacre of Taris—where four of Carrick's fellow Padawans were killed by their Masters. After bidding farewell to The Last Resort's crew, the Jedi met up with Hierogryph, who told him that he had already found them passage by hiring a ship, and that they were to go to Pad 223 at midnight to collect it."}, {"tag": "p", "text": "Unbeknownst to Carrick, the Snivvian had hired the Trandoshan Slyssk, a former member of the pirate organization Raff Syndicate, to steal a ship for them. They did not have the money to buy a ship and Hierogryph did not think it proper to steal a ship himself. Slyssk was kicked out of the Raff Syndicate before learning how to actually fly the ships he was taught to steal. He demonstrated this lack of skill at piloting when he delivered the Little Bivoli to Pad 223 by knocking over a lamppost and damaging another. After some difficulty in getting the timid Slyssk to emerge, he eventually did so, but the Trandoshan demanded ten times the nine thousand credits that Hierogryph was to pay him; as a result of the Snivvian's reputation, Slyssk felt that Hierogryph could easily afford it. The two then argued about the price for the ship, causing Carrick to burst out laughing at the futility of his companion's argument. Hierogryph then subtly suggested that the Padawan use the Force to coerce Slyssk into standing down. Carrick pulled a damaged lamppost down on top of Slyssk, but not before Hierogryph pulled him out of the way. This fooled Slyssk into making a life debt to him, declaring the Snivvian to be his Ghrakhowsk, the Trandoshan term for the person to whom a life-debt was being pledged. It was this life-debt that let Hierogryph and Carrick have the ship without having to pay Slyssk in that he had to, by terms of the life-debt, serve his Grakhowsk."}, {"tag": "p", "text": "At this point, the previous fringer owners—freelance provisioners that supported overwhelmed official channels—arrived and started shooting at the trio in an attempt to stop them from stealing the Little Bivoli. To save themselves from trouble with the original owners, Slyssk, Carrick, and Hierogryph rushed onto the ship and took off. When they reached orbit, they were hailed by the Courageous, the Inexpugnable-class flagship of Battle Group Serroco. The crew of the Little Bivoli was ordered to merge into formation for a hyperspace jump bound for Serroco, given that their newly acquired vessel had often served as a provisioning ship for the Republic Navy throughout the Republic's ongoing conflict with the Mandalorian Neo-Crusaders."}, {"tag": "h3", "text": "Camp Three"}, {"tag": "p", "text": "Upon arriving on Serroco with the Republic fleet, the Little Bivoli continued its role as a provisioning ship, as Hierogryph did not want to pass up an opportunity to make easy money. The ship was soon common knowledge at Camp Three for having the best food served in the camp, even more so than the army commissary. One of the ship's popular dishes was Bivoli Tempari, prepared by Slyssk. According to Hierogryph, Trandoshans such as Slyssk were not known for being good cooks, because no one had ever asked them to cook. Hierogryph used this to entice Carth Onasi, a lieutenant in the Courageous battle group, to eat at the Little Bivoli. With Hierogryph being the host at the front, Carrick was relegated to dish-washing, but it seemed that he often did not actually wash the dishes. At one point, the Snivvian host went to see why the supply of clean plates for the buffet was low and found the Jedi meditating on the Force to clear his mind, due to the stress of hiding in the Republic Navy while being a fugitive from the false accusations that he was behind the Padawan Massacre. Carrick was forced to abandon his meditation when one of the serving droids dropped a tray of food on some soldiers' coats."}, {"tag": "p", "text": "After a confrontation with the disgruntled soldiers, Carrick met Lieutenant Onasi—being careful to use an alias so as to keep his identity hidden—and started talking about the Republic camps. At the close of their conversation, the lieutenant remarked that he had a lot of work to do before the Mandalorians arrived the next day."}, {"tag": "p", "text": "When Onasi had left, Carrick went to find Hierogryph counting large piles of credits in a room in the ship. The Padawan stated how he felt they should pull out before the Mandalorians arrived, to which the black marketeer responded with the fact that the soldiers were hungry and laden with money making his business as the new manager of the Little Bivoli rather successful. After becoming irritated by his companion's refusal to leave, Carrick left the ship to get some air. He then had a Force vision of the Mandalorians bombing Serroco, which would later be the turning point of the imminent Battle of Serroco. Carrick told Hierogryph that they had to pull out as soon as possible, and then stowed away aboard Onasi's ship to reach the commander of the Courageous, Admiral Saul Karath, so that he could warn Karath of what the Padawan had foreseen."}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "The Mandalorians arrived in orbit the following day, and it was only after lunch that Hierogryph started closing up to leave Serroco, despite Carrick's request for him to depart earlier. However, Slyssk revealed that there was not enough fuel left in the Little Bivoli to even make it into orbit and explained that he had stolen the ship before the original owners had time to fully refuel the ship. Slyssk and Hierogryph managed to escape from the planet aboard a Republic troop transport and were reunited with Carrick soon thereafter."}, {"tag": "p", "text": "After the bombardment, the Little Bivoli showed up on the Courageous' scanners as being destroyed. The ship was then officially listed to the general public as a ship destroyed in the Battle of Serroco, among other fringer ships, in The Admiral's List: Remember Serroco! Edition."}, {"tag": "p", "text": "Later, around the time of the Trial of Demagol, Hierogryph acquired a restaurant chain as part of a propaganda story in honor of his and Slyssk's actions at Serroco. One of the restaurants on Coruscant, Goodvalor's Little Bivoli, was a replica of the Quartermaster-class ship."}, {"tag": "h2", "text": "Owners and operators"}, {"tag": "p", "text": "The original owners of the Little Bivoli operated the ship as a fringer provisioning ship. The only other owner was Hierogryph, who assumed ownership when Slyssk stole it for him. Slyssk served as the cook for the ship while it was in operation on Serroco while Hierogryph served as the host. During his time on the ship, Carrick cleaned plates for the buffet, but served food when the serving droids malfunctioned. The gold humanoid droids were poorly maintained during their service with the original owners of the Little Bivoli which resulted in them dropping trays of food on occasion."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Little Bivoli was first introduced in Days of Fear, Part 1, and was destroyed at the conclusion of the story arc in Days of Fear, Part 3. The Little Bivoli was later identified as a Quartermaster-class supply carrier in the Knights of the Old Republic Campaign Guide, which was released in 2008. Dustin Weaver penciled the Little Bivoli in Days of Fear, Part 1 and Days of Fear, Part 3, whereas Brian Ching penciled it in Days of Fear, Part 2. John Jackson Miller was the writer for these three issues."}, {"tag": "p", "text": "Miller derived the name for the Little Bivoli from Bivoli Tempari; a foodstuff which he found in Star Wars Galaxies that first appeared in Riders of the Maelstrom."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}