{"url": "Llaban", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Males", "Category:Tetans"], "nodes": [{"tag": "h1", "text": "Llaban"}, {"tag": "p", "text": "Llaban was a Human male native of Kirrek, and leader of the rebel forces that fought against Empress Teta's military in the Unification Wars of the Koros system. Llaban's forces clashed with the Tetan military in 5000 BBY in the confrontation on Kirrek, and although the rebels were able to besiege the Tetans for over a month, Teta eventually seized victory due to the efforts of Jedi Knights Odan-Urr and Memit Nadill. Later that same year, after the outbreak of the Great Hyperspace War, Llaban was appointed by Teta, due to his desire for amnesty and his effort in the Unification Wars, to lead the fight against the Sith Empire on Kirrek. Although chances of winning against the large Sith force seemed long at first, Llaban and his army fought with resounding success and won the second battle at Kirrek."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Llaban was a Human male native of the Koros system planet of Kirrek. In 5000 BBY, the political leader known as Empress Teta launched a campaign to unify the seven worlds of the Koros system. Llaban, not wanting Teta's dreams of Koros system unity to become a reality, led a makeshift army of rebels and pirates in opposition of Teta's forces on Kirrek. In the Battle of Kirrek, the concluding battle in the Koros Unification Wars, Llaban's rebels encircled and besieged Teta's forces in a citadel. The siege lasted a month, until the beleaguered Tetan soldiers received assistance from Jedi Knights Memit Nadill and Odan-Urr, who used the Force power of battle meditation to raise the spirits of the Tetan forces and lower the morale of Llaban's rebels. Although a desperate call for turret fire downed several Tetan supply ships, Llaban and his rebels were defeated in the Battle of Kirrek."}, {"tag": "p", "text": "Later that same year, forces led by Dark Lord of the Sith Naga Sadow, ruler of the long-isolated Sith Empire, invaded the Galactic Republic. The Great Hyperspace War, as it came to be known, was fought on two fronts; one at the Republic capital of Coruscant and the other in the Koros system. With the battle for the Koros system about to begin, Llaban went to Empress Teta's palace in the city of Cinnagar on Koros Major and asked her if he and his rebels could fight against the Sith in order to gain amnesty for their involvement in the rebellion. Although one of Teta's top advisors and generals, Vontaige, was strongly opposed to this, Teta placed Llaban in charge of the defense of Kirrek. Also, Teta promised to recall prisoners of war exiled to Ronika to aid Llaban in Kirrek's defense. Alongside Jedi Knight Odan-Urr and Jedi Master Ooroo, Llaban rounded up his old army of rebels and prepared them for battle with the Sith, reinforcing their positions with sharpened wooden stakes and trenches. The large Sith fleet appeared in the sky and launched dropships containing troops to the surface. The Battle of Kirrek had begun."}, {"tag": "p", "text": "Although Llaban and his army fought hard against the Sith, the sheer size of the enemy force, which featured dozens of large Sith war behemoths, seemed too overwhelming. Despite Odan-Urr's battle meditation, the Sith Massassi warriors were able to break through their lines. With the Massassi pushing forward, Llaban ordered his soldiers to retreat. However, Ooroo at last entered the fray; a Celegian, Ooroo lived in a container filled with the cyanogen gas that he breathed. As the cyanogen gas was poisonous to oxygen breathers, Ooroo poked several holes in his container, letting the winds blow the gas toward the Sith. This strategy was initially successful, but more invaders kept coming. Finally, ships carrying the reinforcements from Ronika arrived and gave Llaban and his army new hope for victory. The combination of the soldiers from Ronika and Ooroo's cyanogen gas spelled doom for the Sith, and the Battle of Kirrek was won."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Although Llaban fought against Empress Teta in the Unification Wars, he was able to swallow his pride and appeal to her before the outbreak of the Great Hyperspace War. He was a capable leader, as shown by his gathering of a rebel army on Kirrek and his subsequent leading of that force with great success in both the Unification Wars and the Great Hyperspace War. Llaban willingly served Teta even after his defeat in the Unification Wars and was shocked and grateful for Teta's granting of prisoners from Ronika to bolster his forces. In battle, Llaban wore orange war paint on his face."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Llaban first appeared in Tales of the Jedi: The Fall of the Sith Empire, a story arc of the Star Wars: Tales of the Jedi comic book series, written by Kevin J. Anderson and released in 1997. He made appearances in the third and fourth issues of The Fall of the Sith Empire. In these appearances Llaban was illustrated by Dario Carrasco, Jr."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}