{"url": "Lo-Taren/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Garnac's hunting guild members", "Category:Males", "Category:Trandoshans"], "nodes": [{"tag": "h1", "text": "Lo-Taren"}, {"tag": "p", "text": "Lo-Taren was a male Trandoshan who was a part of a group of Trandoshans who captured beings and then hunted them down for sport."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lo-Taren was present on Felucia during a battle there between Republic and Separatist forces. He spotted Ahsoka Tano standing alone and seizing his chance, he took out his stun blaster and fired at her, knocking her unconscious. He then took her to a HCT-2001 Dragonboat-class Reugeot 905 freighter and locked her up along with other prisoners. He, along with the rest of his crew then transported the prisoners to a Trandoshan moon, Wasskah and then dumped them on Island Four. He then fired at them, killing two of the prisoners while the rest, including Tano, escaped."}, {"tag": "p", "text": "The next morning, he spotted Tano wandering around the forest and attacked her but Tano sensed him and dodged his shot. He was knocked aside but he regained his conscious and physically attacked Tano, managing to throw her off. Picking up his blaster, he was about to execute her when he suddenly felt a force choking his neck. It was Kalifa, a Jedi initiate who, along with O-Mer and Jinx met Ahsoka overnight. Kalifa would've killed Lo-Taren had Ahsoka not stopped her. He then shouted out a call to his comrades and then proceeded to attack them again, only to be Force pushed into a tree by O-Mer and Jinx, knocking him unconscious. Sometime after the four Jedi ran off, he regained conscious and headed back towards his base, a large floating fortress."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Soon enough, after Ahsoka killed Dar, one of the Trandoshans, and after Dar's father killed Kalifa out of anger, Ahsoka, O-Mer, Jinx and their new found ally, Chewbacca infiltrated the fortress. Lo-Taren and a friend of his were called out and they fired on the prisoners. Soon, they managed to gain the advantage and were about to execute the prisoners but a squad of Wookiees, who had earlier been called by Chewbacca, arrived and attacked the Trandoshans. Lo-Taren, along with Sochek fired at a Wookiee while utilizing a hover pod as cover during a gunfight. However, the Wookiee, who used a Kashyyyk long-gun, managed to hit Lo-Taren in the face with a well-placed shot, ending the Trandoshan's life. Sochek would soon join his friend in death after the Jedi lifted the pod he was using as cover and he was promptly shot by the same Wookiee."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}