{"url": "Lo_Khan", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Individuals of unidentified species", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Lo Khan"}, {"tag": "p", "text": "Lo Khan was a male smuggler who was active during the early years of the Galactic Empire. Khan was a calm individual and tried to stay on the safer side of smuggling, avoiding dispute and armed conflict whenever possible, and spending time joking and drinking with his friends inside cantinas during his free time. As a smuggler, he made the most profitable run of his life on the Gamor Run, where he stole a spice shipment belonging to one of his rivals, Uxbeg. After stealing it, he delivered the payload to a Hutt crime lord named Spadda in the Aikhibba system. Along the way, he teamed up with Luwingo, a Yaka cyborg who was having trouble finding work. Luwingo saved Khan's life in a shootout with Uxbeg's henchmen. This impressed Khan enough to hire the Yaka as his full-time bodyguard, thus cementing what was to become a long and fruitful partnership. Khan earned enough money from that adventure to semi-retire himself, spending the following years inside cantinas all around the galaxy while doing various smuggling runs in his freighter, the Hyperspace Marauder."}, {"tag": "p", "text": "In 10 ABY, while docked at the Imperial Freight Complex around Byss, Khan ran into a couple of his old smuggling friends, Salla Zend and Shug Ninx, who were fleeing pursuing Imperial forces. Khan agreed to let Zend and Ninx store the Millennium Falcon, the ship the two fugitive smugglers were borrowing from former New Republic General Han Solo, inside the Marauder's cargo hold. As Zend and Ninx prepared to leave, an Imperial Hunter-Killer probot located the Falcon inside the Marauder and fired on Khan's ship in an attempt to apprehend the rogue vessel, much to the smuggler's dismay. The Marauder was impounded by the Imperials, stranding Khan and Luwingo on Byss for the next few weeks. Eventually, Khan and a group of smugglers were able to take advantage of a secret New Republic attack on Byss to retrieve their ships from the Imperial impound. Khan and the newly formed smuggler fleet aided the New Republic forces in escaping the doomed mission to besiege the Emperor's Citadel just as the tide was turning in the Empire's favor. The group then proceeded to assist in the evacuation of New Alderaan after the planet was attacked by Emperor Palpatine's forces."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Smuggling career"}, {"tag": "p", "text": "Lo Khan was a seasoned, laconic male smuggler who was known to have performed difficult smuggling runs since before the rise of such infamous criminals as Han Solo and Lando Calrissian. Khan made the largest haul of his smuggling career on the Gamor Run, a hyperspace route in the Mid Rim. Khan had learned that one of his smuggling rivals, Uxbeg, had been contracted to transport a spice shipment to a criminal named Spadda. Uxbeg was still busy running a load of bulk yeast paste to the Corporate Sector prison Stars' End, allowing Khan an opportunity to craftily intercept Uxbeg's pending shipment. Upon acquiring the shipment, Khan was surprised to learn that it was a spice consignment from the royal governor of the Thokosia system destined for the Aikhibba system, a minor stopping points along the Gamor Run. Khan was already running low on fuel and, deciding to take the shipment immediately, departed rather than give his rival ample time to arrive and pick up the shipment himself."}, {"tag": "p", "text": "Stopping in the Deneba system to refuel, Khan encountered a Yaka cyborg that he had met on an earlier run known as Luwingo. Luwingo was despondent about the state of his affairs, and Khan—sympathizing with the Yaka, as he had been in similar situations before—decided to take Luwingo with him and give him a small cut of the profit to which Khan never demanded any payback. Soon, Khan and Luwingo had a run-in with a group of Uxbeg's thugs. The skirmish degenerated into a firefight that resulted in Luwingo taking a blaster bolt to protect Khan. Khan feared that Luwingo was dead, but to his amazement, the Yaka simply shook off the injury. It was then that Khan became aware of Luwingo's usefulness and loyalty, and so decided to hire Luwingo as his full-time bodyguard. Upon delivering the cargo to Aikhibba, Khan was shocked to learn that Spadda was the infamous crime lord \"Spadda the Hutt\" and became disappointed when the Hutt shortchanged him immensely. Nevertheless, Khan still received a significant sum that enabled him to spend the following years relaxing in smugglers' bars across the galaxy while performing small runs in his modified Xiytiar-class transport, the Hyperspace Marauder, at his leisure. At some point during the Galactic Civil War, he began hauling military supplies to the Deep Core for both sides of the war."}, {"tag": "h3", "text": "Aiding the New Republic"}, {"tag": "p", "text": "By 10 ABY, Emperor Palpatine had resurrected himself in a clone body and began constructing a revived Galactic Empire based around the Deep Core world of Byss. New Republic heroes Princess Leia Organa Solo and former smuggler Han Solo enlisted the help of smugglers Salla Zend and Shug Ninx in their attempt to rescue Leia's brother and Jedi Knight Luke Skywalker, who had recently been captured by the forces of the new Empire. The group traveled in Solo's YT-1300 light freighter Millennium Falcon to the Emperor's Citadel on Byss, where Han and Leia allowed themselves to be captured as part of their plan to rescue Skywalker while Zend and Ninx escaped with the Falcon. Zend and Ninx fled to the Imperial Freight Complex on Byss, where Lo Khan allowed his fellow smugglers to conceal the Falcon inside the Hyperspace Marauder."}, {"tag": "p", "text": "Khan, while willing to help his fellow smugglers in need, was also concerned about the well-being of both his ship's and his own life. As Khan, Luwingo, and the two fugitive smugglers discussed recent events at the complex's cantina, the Byss Bistro, Ninx received a comlink transmission from Han Solo, who requested extraction from the Citadel. As Zend and Ninx headed back toward the Falcon, an Imperial Hunter-Killer probot designated Judgement 12-X7 scanned the Marauder and discovered the Falcon inside the ship's cargo hold. The probot was able to capture the Falcon with its tractor beams but only after it crippled and impounded the Marauder. Khan, was unworried, however, as he felt confident that he could use his connections to free the Marauder."}, {"tag": "p", "text": "It was not long before Lo Khan received a chance to recover his ship. For the next few weeks, Khan and Luwingo found themselves stranded on Byss, where they once again met up with Salla Zend and Shug Ninx at the Byss Bistro. The two smugglers came back to Byss, intending to salvage Zend's ship, the Starlight Intruder, and were able to get past Imperial security by posing as maintenance workers delivering a set of obsolete repair parts to Khan. Khan revealed, much to Zend's disappointment, that the Intruder had already been stripped by Imperial-sanctioned scavs and melted to slag. Khan's break finally came in the form of a surprise attack by New Republic forces inside X-1 Viper Automadons led by Generals Wedge Antilles and Lando Calrissian. Soon, however, the Imperials unleashed their chrysalide rancors, alchemically mutated dark side beasts on the Viper Automadons. As things began to look grim for the New Republic, Salla Zend, feeling that she had a responsibility to them, rallied Khan and many other smugglers together to aid the New Republic forces."}, {"tag": "p", "text": "Luwingo laid down covering fire with his tripod laser as Khan and the other spacers rushed to their impounded ships. With Luwingo safely on board, Khan lifted off in the Hyperspace Marauder and joined the small fleet of smuggler ships. Khan made use of the Marauder's newly-installed 700 Penetrator laser cannons in conjunction with the other smuggler ships to save Antilles, Calrissian, and the droids C-3PO and R2-D2 from a chrysalide rancor. Khan and the smuggler ships escaped Byss's orbit and were surprised when the Imperials allowed them to reach a jumping distance without firing on them—for fear of damaging the nearby, partially-constructed Galaxy Gun superweapon. The smuggler ships safely escaped to the New Republic–held Pinnacle Base. Shortly thereafter, Khan and the smuggler ships helped evacuate the New Republic safe world of New Alderaan, where Leia Organa Solo's children, Jacen and Jaina Solo, were hiding out, before finally heading off to the New Republic base at the Space City orbiting Nespis VIII."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lo Khan was an easy-going, laconic smuggler who had gained a reputation as one of the most lax in his trade. He spent much of his free time becoming drunk in cantinas with old friends, all the while occasionally performing small, safe runs in the Hyperspace Marauder to make a living. Khan was one of the older smugglers of his time and preferred to keep out of trouble. He typically kept to the more well-policed routes and spent most of his money on upgrading the shields and hull of his ship, for which he owned a beckon call. Khan liked to avoid conflicts and preferred to make few enemies, so he kept the Marauder unarmed for many years before finally deciding to arm it with twin 700 Penetrator laser cannons. If the Marauder was ever taken over by pirates, the ship's computer was programmed to override the computer on the pirating vessel and give Khan complete control of all of the ship's systems. Khan was not above mercy, however, and was willing to leave life support and low-level ion thrusters operational before stripping any valuable gear from the pirate ship. While hauling in the Deep Core, he could usually be found sitting in the Byss Cantina with his fellow smugglers. Khan was also willing to help a friend in need, so long as he or his ship did not get damaged in the process. Khan formed a long-standing friendship and partnership with his Yaka cyborg first mate, Luwingo, beginning with their first run together."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lo Khan was created by author Tom Veitch for the fifth issue of the Star Wars: Dark Empire comic book series. He later returned for the latter half of the sequel series, Star Wars: Dark Empire II, and was given a complete backstory by Michael Allen Horne in the Dark Empire Sourcebook. He was also given brief mentions in various other sources over the years. He was voiced by Joe Hacker in the Dark Empire and Dark Empire II audio adaptations."}, {"tag": "p", "text": "Though the fifth issue of Dark Empire indicates that Khan was saved by Luwingo during a firefight against Imperials, the Dark Empire Sourcebook instead identifies the attackers as hirelings of Uxbeg. This article assumes that the Dark Empire Sourcebook, being the most recent and comprehensive source on the subject, is correct."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}