{"url": "Loag", "categories": ["Category:Legends articles", "Category:Assassins", "Category:Criminal organizations", "Category:Religious organizations"], "nodes": [{"tag": "h1", "text": "Loag"}, {"tag": "p", "text": "The Loag, a group of assassins, oppressed the planet Merisee during the Old Republic. They were apparently wiped out by six Jedi after an effort of a full year. Three of the Jedi were killed in the violent ousting of the cult. At the end of the campaign, the Jedi took the Loag Dagger, which the assassins had sworn their blood oaths on, and it was placed in the care of the Galactic Museum on Coruscant."}, {"tag": "p", "text": "The Loag returned to Merisee some time during the Imperial era. Their actions, while hidden from the commoners of Merisee, had far-reaching effects around the planet. The Loag had a secret citadel carved from a hollowed out dormant volcano near a land bridge."}, {"tag": "p", "text": "It was extremely difficult to make contact with the Loag. If their presence was ever publicly revealed, Merisee's government or the Empire would have taken actions to eliminate them. The Loag cult accepted contracts from many sources—crime lords, disgruntled governments, even Imperial officers and dignitaries with someone to silence. The Loag cult had many loyal informants throughout the galaxy who contacted those who would hire Loag assassins. There were some cases of informants who attempted to betray the Loag, but they all ended up dead at the hands of Loag assassins. Even the Loag's informants could not tell when they were being spied upon. Assassination fees were high (the lowest known fee was 5,000 credits), but the Loag was known for being able to fulfill its contracts."}, {"tag": "p", "text": "During the Imperial era, there was a power struggle going on within the Loag. The largest faction wanted to make sure that the Loag remained anonymous, aware of the legacy of the past and convinced that it was too early to make a move for power. They wanted to conduct all the business they could, mostly off-world, and help defend their best interests."}, {"tag": "p", "text": "The smaller faction, which comprised about five percent of the Loag but also boasted some very charismatic leaders, wanted to become more visible and exert power and influence over Merisee affairs. If they believed that the Loag is being threatened in any way, they would take matters into their own hands. They were also convinced that the Empire would not crack down on this bid for power if the group made it clear that they would be loyal to the Empire and the sector Moff, who openly despised Merisee's virtually invisible and ineffectual governor, Branff Miro."}, {"tag": "p", "text": "The Loag were still active in 11 ABY, when the Loag dagger was found to be missing on Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}