{"url": "Lob_Doluff", "categories": ["Category:Legends articles", "Category:Bureaucrats", "Category:Centrans", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lob Doluff"}, {"tag": "p", "text": "Lob Doluff was the Administrator Senior of the Oseon system, a somewhat fat man, bald, with a small mustache and a tendency to sweat."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Like many residents of the Oseon system, Doluff was extremely wealthy and could have lived out his days in luxury. However, believing in the principle of noblesse oblige, he entered public service in an effort to help the common sentient who was less well off than he. His money often gave him rather more latitude in dealing with his superiors, but it did not guarantee independence by any means."}, {"tag": "p", "text": "For the Administrator Senior of a system that featured the brilliantly colorful Flamewind once a Galactic Standard Calendar year, it was a bitter irony that Doluff was color-blind. Unable to appreciate the Flamewind's beauty, and in fact finding it a nuisance because of all the extra problems it brought each year, he instead took pleasure in growing plants, enjoying their fragrance and persistence in survival rather than their color."}, {"tag": "p", "text": "In 4 BBY, Rokur Gepta threatened Doluff with his death, that of his family, and the installation of a much less ethical Administrator Senior unless he invited Lando Calrissian to play sabacc with him, as part of his complex trap to snare the gambler. Reluctantly, Doluff went along for the greater good, and played a few hands with Lando, Bassi Vobah the incorruptible policewoman, Del Cycer the retired businessman (and possibly another professional gambler) and the trunk-thing whose real name none of the others could pronounce. When Lando killed Colonel Kenow on Oseon 6845 in self-defense—and was arrested due to the Oseon's laws against weapon possession—Doluff sent Lando, along with corrupt Imperial officer Waywa Fybot, on a mission to arrest lesai addict Bohhuah Mutdah, another step in Gepta's plan. However, in an attempt to protect Lando, he also sent Bassi Vobah along."}, {"tag": "p", "text": "Doluff had a secret, one that was another part of Gepta's blackmail threat—he threatened to reveal Doluff's addiction to lesai. As he sent Lando off, he wished that lesai really did have the emotion dulling side-effects claimed by governments, as it would have made things so much easier on him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}