{"url": "Lobaoc", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Mieru'kar sector planets", "Category:Swamp planets"], "nodes": [{"tag": "h1", "text": "Lobaoc"}, {"tag": "p", "text": "Lobaoc was an Outer Rim Territories planet located in the Mieru'kar sector. Its surface featured lakes and marshes, which were home to the tentacled and omnivorous dianogas. Human and Near-Human farmers maintained several settlements on Lobaoc. At some point between 67 BBY and 19 BBY, the Jedi High Council of the Jedi Order learned of the existence of a young Force-sensitive girl on Lobaoc. The Jedi Council dispatched the Mon Calamari Jedi Ambaln to investigate the situation and bring the child back to the Order for Jedi training. Upon realizing that Ambaln had fallen to the dark side of the Force during a prior assignment, the Council also sent a group of individuals to Lobaoc after the fallen Jedi."}, {"tag": "p", "text": "On Lobaoc, Ambaln convinced the girl's parents to give up the child for training, and he subsequently set a trap for any agents of the Jedi Council sent after him. When the group arrived in the planet's Koab village, Ambaln's droid, Z-N0, led the individuals toward a boathouse, where Ambaln was hiding. At that point, dianogas ambushed the group, and Ambaln used the distraction to attempt to escape to his starship."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lobaoc was a planet located in the Lobaoc system, a part of the Outer Rim Territories' Mieru'kar sector. It was a watery world of lakes and marshes, the depths of which were inhabited by dianogas, tentacled omnivores that were originally native to the Hutt Space planet Vodran but had spread throughout the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "At some point between 67 BBY and 19 BBY, the Jedi High Council of the Jedi Order learned of the existence of a young Force-sensitive child on Lobaoc, a girl in the Human Glirin family who had potential for training as a Jedi. To appraise the situation and bring the potential Jedi back for training, the Jedi Council dispatched the Mon Calamari Jedi Consular and investigator Ambaln to Lobaoc. However, after the investigator had already departed on his mission, the Council realized that Ambaln, whose prior assignment had been as a deep undercover operative within a criminal syndicate, had fallen to the dark side of the Force. The Mon Calamari had grown disillusioned with the Jedi Council's leadership and planned to create a new council, starting with the child on Lobaoc. To foil Ambaln's plans and bring him back to the Jedi Order for rehabilitation, the Council then also sent a group of individuals to Lobaoc."}, {"tag": "p", "text": "After arriving at the Koab village on Lobaoc, Ambaln flew his Whitecloak fighter out to the Glirin family's farm in the marsh outside the settlement. After convincing the Glirin girl's parents to give up their child for Jedi training, the Mon Calamari dispatched his translator and personal servant, the J9 worker drone Z-N0, to walk back to Koab. The droid was ordered to wait by the village's landing pads for the arrival of anyone looking for Ambaln and then to lead them to a boathouse, where the fallen Jedi claimed he would talk to the Jedi Order's agents sent after him. Leaving the Glirin girl to wait at his starship about a mile from Koab, Ambaln himself then went to wait at the boathouse. He intended to spring a trap upon the Jedi Council's agents by having a group of dianogas ambush them on the causeway connecting the structure to the rest of the village."}, {"tag": "p", "text": "Early in the following morning, the group sent by the Jedi Council after Ambaln arrived in Koab. While acquiring information from the locals, the individuals learned that Z-N0 had come back from the Glirin farm mid-morning that day. The group then met the droid, who led it to the boathouse in which Ambaln was hiding. At that point, the dianogas attacked the Council's agents, and the Mon Calamari attempted to use the distraction to swim to his starship. Although the group sent by the Council caught up with the fallen Jedi before he was able to escape, Ambaln claimed that he had hidden the girl in the planet's marshes and that she would die before the agents could find her. The Mon Calamari then distracted the group enough to once again escape toward his ship, enlisting the aid of more dianogas to ward off his pursuers."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Lobaoc featured a number of settlements inhabited by Human and Near-Human farmers who harvested water-grown crops in Lobaoc's murky shallows. The Human Glirin family kept a farm on Lobaoc. When the Jedi Knight Ambaln visited Koab, his mechanical servant, Z-N0, was the only droid in the settlement and thereby was noticed and remembered by most of the village's inhabitants."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Koab was a village on Lobaoc that had a population of a few thousand individuals. Floating causeways connected the center of Koab to warehouses and storage sheds located at the settlement's edges, as well as to a collection of landing pads—large metal slabs floating above the ground on repulsorlift pods—located at several flat, mostly dry areas that constituted the village's spaceport. The longest causeway of Koab led to a boathouse."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lobaoc was introduced in \"Swim Meet,\" a Star Wars Roleplaying Game mini-adventure authored by Jeff Quick and published on the Wizards of the Coast website on August 22, 2002. The 2009 reference book The Essential Atlas placed the Lobaoc system, and therefore the planet Lobaoc, in grid square N-3."}, {"tag": "p", "text": "\"Swim Meet\" presents several options for how the player-characters' encounter with Ambaln on Lobaoc may proceed. If Ambaln is caught during his initial escape attempt, the Mon Calamari distracts the player-characters with conversation before attempting to flee once again. If at that point Ambaln loses his pursuers, he swims back to his starship and leaves Lobaoc. The fallen Jedi then spends a few weeks staying hidden before returning to Lobaoc with the young girl to begin her training in his own doctrine of the Force. This article assumes the scenario plays out as described."}, {"tag": "p", "text": "Although \"Swim Meet\" is set in the Rise of the Empire era, the adventure can also be adapted for play in the Rebellion era or the New Jedi Order era. In the former case, instead of Ambaln being a Jedi, the adventure suggests that the Mon Calamari operates a child slavery ring and employs additional confederates instead of calling on dianogas for assistance. If the adventure is instead set in the New Jedi Order era, gamemaster players only need to change all references to the Jedi Council to refer to the Jedi Academy. In addition, if one of the player-characters is of the fringer class, the adventure suggests that Lobaoc, or a world nearby, could be the character's homeworld."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}