{"url": "Lobar_Aybock/interview", "categories": ["Category:Wookieepedia interviews"], "nodes": [{"tag": "h1", "text": "Lobar Aybock/interview"}, {"tag": "p", "text": "Originally from User talk:Xwing328."}, {"tag": "p", "text": "To: Xwing328 \nFrom: Edward M. Erdelac"}, {"tag": "p", "text": "Hey Xwing328 -"}, {"tag": "p", "text": "Glad you enjoyed the story and thanks for putting so much work into Lobar's page!"}, {"tag": "p", "text": "Only a couple things I noticed (I probably could've changed these myself, but I didn't wanna step on your toes) -"}, {"tag": "p", "text": "In the first, preamble paragraph, it's stated that the Calians were deemed unfit to be stormtroopers due to being red skinned and near human. In Fists Of Ion it's not specifically stated what the Empire's reasons were for not using Calians. It's probable that this was a factor, but the overlarge T'Syriél were used by S'kar as stormtroopers without a problem and they were far less human looking than Calians (see Marvel Star Wars #53 and the wookiepedia entry on T'Syriél Stormtroopers). I don't say this expressly, but my thought was that the Calians were deemed unmanageable because of their independent nature, which did not take easily to stormtrooper indoctrination. Specifically, their ryastraad battle madness couldn't be harnessed and made them too unpredictable."}, {"tag": "p", "text": "Under 'Life As A Shockboxer,' there is a sentence near the beginning which reads..."}, {"tag": "p", "text": "'Aybock would stay at a hotel relatively close to his shockboxing matches, so that he could run to the arena to get pumped up before the race.' - The word 'race' should be changed to 'fight.'"}, {"tag": "p", "text": "Some behind the scenes stuff I didn't put in my blog..."}, {"tag": "p", "text": "The name of Lobar's Chevin manager/cornerman Eedund Cus comes from a combination of Muhammad Ali's real-life boxing cornerman Angelo Dundee and the great Cus D'amato, who trained Mike Tyson."}, {"tag": "p", "text": "Lobar's Gungan fight doctor Stitchy is named after the UFC cutman Jacob 'Stitch' Duran."}, {"tag": "p", "text": "I began Fists Of Ion wanting to expand on Wayne Humfleet's concept of shockboxing, which was loosely described in the WEG supplement Heroes and Rogues but never fleshed out (due to the fate of WEG). The best and most resonating representation of a boxing hero to me has always been Stallone's Rocky Balboa, so I set out to do a Rocky story in the Star Wars universe. The scene of Lobar running through the streets with all the Rust Rats behind him was the first scene I started with in my head and is a direct translation of the Gonna Fly Now scene in Rocky II. As a further homage to that, 'Lobar Aybock' is a tuckerization of 'Rocky Balboa.'"}, {"tag": "p", "text": "The other big inspiration for the story was the real life 1938 Joe Louis-Max Schmeling fight which at the time had huge societal signifigance - a black American went up against an athlete who represented Hitler's German Aryan ideal...and won. In Star Wars, shockboxing was dominated by Barabels as a Barabel invention (Lobar alludes to the fact that nobody thinks a Barabel can be beat), and nearhumans were certainly considered second class citizens during the reign of the Empire - as it says in the story \"not near [human] enough.\" Lobar was a stand-in for Louis with Tull Raine being a greatly exaagerated Max Schmeling."}, {"tag": "p", "text": "Anyway, that's it. Great job on the article! It's a real thrill to be able to look up your own creations on wookiepedia. Being a fan who has browsed and revised these pages myself I know it's all due to a lot of dilligent work."}, {"tag": "p", "text": "Thanks, Xwing!"}]}