{"url": "LobwuWa_Loba", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Aqualish", "Category:Individuals of unspecified gender", "Category:Podracers"], "nodes": [{"tag": "h1", "text": "LobwuWa Loba"}, {"tag": "p", "text": "LobwuWa Loba, an Ualaq Aqualish from the planet of Tatooine, was an aspiring Podracer pilot in 32 BBY, when Loba attended the Boonta Eve Classic as a spectator. Over the next decade, Loba was able to build a reputation in the Podracing world and, in 22 BBY, Loba competed in a race held in the Mos Espa Grand Arena on Tatooine."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 32 BBY, the Ualaq Aqualish LobwuWa Loba wanted to pilot podracers for a living. Loba, a Tatooinian, was present in that world's Mos Espa Grand Arena to watch the Boonta Eve Classic from the personal box of a junk dealer named Watto."}, {"tag": "p", "text": "The Aqualish became a relatively established Podracer over the next ten years. In 22 BBY, Loba returned to the Grand Arena as the local favorite to win a Podracing competition. Loba's was among the names of competitors that a neophyte bounty hunter Boba Fett recognized as an appreciator of the sport. The winner of the race had been predetermined by the Hutt crime lord Jabba Desilijic Tiure."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Loba was thuggish-looking with four black eyes, brown skin, and light blond hair. The Aqualish had the ability to pilot a podracer and determination enough to make this dream to become a professional racer a reality."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "LobwuWa Loba appeared on a viewscreen in the young reader novel Boba Fett: Hunted (2003) by Elizabeth Hand, which was chronologically set between the second and third Star Wars films. In 2012, the incarnation of Star Wars Insider's Rogues Gallery from Issue 131, \"An Audience of Aliens,\" identified individuals in Watto's viewing box from the Star Wars: Episode I The Phantom Menace film (1999). The article established retroactively that Loba was among them."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}