{"url": "Lobot/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Baron Administrators", "Category:Bespinites", "Category:Clerical workers and assistants", "Category:Criminals", "Category:Cyborgs", "Category:Humans", "Category:Males", "Category:Mayors", "Category:Planetary leaders", "Category:Slicers"], "nodes": [{"tag": "h1", "text": "Lobot"}, {"tag": "p", "text": "Lobot was a Human male who served as the chief administrative aide to Baron Administrator Lando Calrissian on Cloud City over the planet Bespin. His brain was connected to the city's central computer which allowed him to communicate directly with the city's computer network. In this capacity, he served as the city's first and only computer-liaison officer."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early years"}, {"tag": "p", "text": "Lobot was the son of a slaver, who traveled across the galaxy raiding backwater and poor worlds for slaves. At the age of 15, his father was killed when their ship was boarded by pirates. Lobot served as the pirates' slave for two years before he escaped to Cloud City in the gas giant of Bespin."}, {"tag": "p", "text": "Arriving there with no means of survival—no money, job, or home—the young Lobot was arrested by the Bespin Wing Guard for stealing and convicted of the crime. However, he requested that the Baroness Administrator Ellisa Shallence preside over his case. Seeing potential in the young vagabond, Ellisa sentenced Lobot to fifteen years of involuntary service to the Cloud City community, rather than serve a lengthy prison term, and for him to undergo cyborg augmentation. Cloud City techs shaved Lobot's head, drilled holes in his skull, and fitted him with a Biotech Aj^6 cyborg headband. Lobot indentured himself to the city by becoming the first cyborg computer-liaison officer in its history. He became one of the most hardworking and loyal employees in Cloud City, and even when his sentence was fulfilled, he freely chose to continue serving his community. He was rewarded for his loyalty by being named chief administrative aide to the Baron Administrator."}, {"tag": "p", "text": "Lobot's new cybernetic implants increased his intelligence dramatically. He could communicate with the city's central computer at all times, controlling issues of bureaucracy, law enforcement, computer programming, repair and security, as well as the communication systems, repulsorlifts, and life-support systems. In many ways, Lobot was Cloud City—he was the true power behind its everyday operations, whereas the Baron Administrator served that role to the public's face. In the past, running the city's computer took dozens of specialists. Now, Lobot could fulfill the duties of many instantly."}, {"tag": "p", "text": "The only negative side effect was that his speech centers deteriorated under the neural pathways to his brain. While he retained the ability to speak, his speech was reduced to minimal, infrequent sentences. Regardless, he rarely felt the need to speak, for he could fulfill his duties without verbal communication. His observations of the world came to focus on numbers and formulas. His loss of humanity seemed strange only to those who did not know him."}, {"tag": "h3", "text": "Assisting Starkiller"}, {"tag": "p", "text": "Around 2 BBY, Lobot met with Vader's apprentice Starkiller who was looking for senator Garm Bel Iblis. However, Lobot had to inform him that Bel Iblis wasn't present because he'd gone to negotiate with Chop'aa Notimo, whose gang of mercenaries were wreaking havoc in Cloud City. During this encounter, Lobot displayed the ability to completely resist Marek's attempted use of a mind trick. While Starkiller went on his rescue mission, Lobot led Cloud City security forces in the resistance and effort to win back Cloud City against the mercenaries."}, {"tag": "h3", "text": "Calrissian's aide"}, {"tag": "p", "text": "In 1 ABY, a gambler named Lando Calrissian arrived in the city, challenging inept Baron Administrator Dominic Raynor to a winner-takes-all game of sabacc."}, {"tag": "p", "text": "Lobot recognized in Calrissian an opportunity to boost the struggling work of the city. He inconspicuously helped Calrissian win the game, with Lando becoming the city's new administrator as well as managing to win back his ship, the Cobra. Calrissian retained Lobot's services, utilizing his abilities in ways never before thought of, such as in Lando's more clandestine operations."}, {"tag": "p", "text": "During Calrissian's reign, Lobot did not object when his master secretly aided the Rebellion. He certainly held no affinity for the Empire from his days as a slave. When the scientist Issan Len was murdered in the city and the Rebels were blamed, Lobot assisted Calrissian in clearing his name. Lobot even saved Calrissian's life when the rogue supervisory droid EV-9D9 rigged the city with secretly planted bombs."}, {"tag": "p", "text": "In 3 ABY, he was present when Lando Calrissian greeted his former friend Han Solo along with his Rebel companions Princess Leia Organa, Chewbacca and C-3PO. When an Imperial force under the Princess' father, Darth Vader, was revealed and arrested Solo and his companions, Lobot was instrumental in helping a repentant Lando to rescue them, responding immediately to Calrissian's issued \"Code Force Seven.\" Lobot arrived with a group of Cloud City guards to free Leia, Chewbacca, and a dismantled Threepio from their Imperial captors. When the group was making their escape from the city, Lobot, through the city's central computer interface, informed R2-D2 that the Empire had deactivated the hyperdrive on the Millennium Falcon, and also informed the droid the precise manner by which to repair it. Using this vital information, R2-D2 in turn repaired the malfunctioning hyperdrive, helping the group elude Imperial capture for good."}, {"tag": "p", "text": "After the takeover of Cloud City by Imperial forces, he served the Imperial garrison's governor Captain Hugo Treece. However, during an insurrection by the Ugnaughts, his motivational programming capsule was sabotaged as part of their plot to access Cloud City's central computer. Calrissian returned months later to find a malfunctioning Lobot, who initially attacked him. Calrissian managed to remove and repair the capsule, enabling Lobot's computer interface abilities to disarm eleven bombs strategically placed throughout the city by the Ugnaughts.. Treece tried to kill Calrissian by throwing him off the city to the depths below, but Lobot once again saved him by using a life-jet to catch him. Along with Calrissian, Luke Skywalker, and Lieutenant Shira Brie, Lobot helped to overthrow the Imperial presence in the city for the time being."}, {"tag": "p", "text": "Following that brief insurrection, and with a new mean streak, Lobot vowed to hunt down and dismantle EV-9D9 as payback for the droid's attempted destruction of Cloud City. Stealing a cloud car, Lobot traveled to Jabba's Palace on Tatooine but was captured by the Hutt before he was able to complete his mission. Though Jabba at first planned to feed Lobot to his rancor, Tamtel Skreej—actually a disguised Lando Calrissian—spoke up for his former companion and asked that Jabba instead place Lobot in his demolition games. Jabba agreed immediately, but Lobot did not realize that Skreej was his friend in disguise, so the two became fierce rivals in the competition. He eventually escaped Jabba and made it back to Cloud City."}, {"tag": "h3", "text": "Later life"}, {"tag": "p", "text": "Lobot continued to serve Cloud City even when Zorba the Hutt became Baron Administrator in 5 ABY, and when the city was retaken for the Empire by Grand Admiral Thrawn. Lobot was captured by Imperials during the liberation of Cloud City, but the former clone trooper X2, now a Jedi Knight, freed Lobot from his prison cell. X2 also protected Lobot while he retook control of the city's computer system. Soon, Bespin was liberated."}, {"tag": "p", "text": "Lobot later became the Baron Administrator of Cloud City for a number of years, through at least 17 ABY, during which time he accompanied Lando Calrissian on a New Republic mission to investigate the mysterious ship codenamed the Teljkon Vagabond, which had reappeared near Gmar Askilon. There, Lobot played a major role in discovering that the Vagabond was crafted by the long-extinct Qella species as a \"tool kit\" for melting their frozen homeworld of Qella, which was trapped in an ice age. He accomplished this seemingly impossible task by detaching part of his cybernetic headgear and reattaching it to part of the Vagabond's central nervous system, finding that he could communicate with the ship in this manner."}, {"tag": "p", "text": "Lobot continued his adventures with Lando in 19 ABY, this time accompanying Han, Lando and Moegid as spies to the Imperial Capitol of Bastion to attempt to secure a copy of the original Caamas Document and quell the growing instability of the New Republic. Because of his neural implants, he was able to act as a puppet for Moegid's expert computer skills to investigate the Imperial library undetected."}, {"tag": "p", "text": "In 23 ABY, Lando established the GemDiver Station, which harvested minerals from the gas giant of Yavin. A loyal Lobot continued to serve Lando there, although he later returned to Cloud City, where he remained during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As assistant to the flamboyant Lando Calrissian, Lobot was not one to neglect his appearance, often sporting a fineweave sherculién-cloth shirt."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lobot's only appearance in the Star Wars movies is in Star Wars: Episode V The Empire Strikes Back, where he is portrayed by John Hollis. He also appears in the Star Wars: The Force Unleashed video game, where he is portrayed by voice actor Tom Kane."}, {"tag": "p", "text": "A character serving as Lando Calrissian's assistant was present in most of the original screenplays of The Empire Strikes Back, and many production paintings depicted this character as a tall, regal, dark-skinned woman. One of the later drafts of the script established this character as a cyborg, and it was then that actor John Hollis was selected for the role by the filmmakers. Hollis was originally only hired for a week's worth of work, but because of the film's extended shooting schedule, he remained on the Bespin set at Elstree Studios for ten weeks."}, {"tag": "p", "text": "Throughout most of the film's production, Lobot was only referred to as \"Lando's aide\" and is referred to as such in the credits. He was to have a great deal of dialogue, mostly with Calrissian. However, the filmmakers decided that the character had been lobotomized as a result of the installation of his cybernetic implant, causing him to become a mute. This decision reportedly did not concern Hollis. As a reference to this change, the character was named \"Lobot,\" a shortened form of the word \"lobotomy.\" The cybernetic implant prop Hollis wore on his head was completely battery-powered and was connected to a spring clip that was fit around the actor's head. However, the prop was quite heavy and uncomfortable to wear."}, {"tag": "p", "text": "A scene cut from The Empire Strikes Back depicted a critically injured Lobot being carried away by Stormtroopers. This was meant to serve as Lobot's death scene, but it was ultimately removed by the filmmakers because it was possible that the character would appear in the following film, Star Wars: Episode VI Return of the Jedi."}, {"tag": "p", "text": "In Robot Chicken: Star Wars, Lobot can be seen disco dancing to a Star Wars disco theme in a quiet hallway of Cloud City."}, {"tag": "p", "text": "Lobot's appearance in Star Wars: Demolition gave him pre- and post-match taunts which created a rather more aggressive (not to mention vocal) character than seen in The Empire Strikes Back, and is contrary to all other representations of Lobot throughout Star Wars Legends. The game is the only chance to hear his voice, aside from the Force Unleashed video game."}, {"tag": "p", "text": "In The Empire Strikes Back, Lobot mouths a soundless reply to Lando before taking captured stormtroopers to the security tower. The French dub (from the 2004 European release) adds an audible answer."}, {"tag": "p", "text": "In Star Wars: The Force Unleashed, Starkiller attempts to use a Mind trick on Lobot, but it has no effect. In LEGO Star Wars II: The Original Trilogy and LEGO Star Wars: The Complete Saga, Lobot is a playable character if purchased and can suffer mind tricks."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}