{"url": "Locap", "categories": ["Category:Canon articles", "Category:Plants of Naboo"], "nodes": [{"tag": "h1", "text": "Locap"}, {"tag": "p", "text": "Locap was a type of plant found on the planet Naboo that harvested plasma from deep water porous rocks. The Gungan species discovered locap and learned to harvest stable plasma from the plant's buds using bongos, allowing them to use it as an energy source."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Locap was a strange type of plant that could be found in the deep waters of the planet Naboo. The plant's roots burrowed into porous rock and siphoned out plasma, which was then naturally stabilized by the locap's digestive processes. The stable plasma then collected in buds found at the tip of locap's stalks."}, {"tag": "p", "text": "The buds had circular lobes with spiny teeth that snap shut when any pressure is felt. The plants grew extremely slowly and lived for centuries. Locap plants also had gigantic brown branches, large enough for humanoid scale cities to be built on top."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Thousands of years prior to 32 BBY, the sentient Gungan species native to Naboo were forced underwater in a fierce struggle for territory and discovered locap. They were able to harvest plasma from the plant's buds using bongos equipped with front-mounted siphons, then used the natural energy source to power much of their technology, including their underwater cities. Farming locap was a dangerous job due to the bud's teeth."}, {"tag": "p", "text": "The city of Otoh Gunga, anchored to a cliff located deep within Lake Paonga, had hydrostatic bubbles that sat upon locap branches, including the City Bigspace."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Locap first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. It was first identified in the current canon in the 2016 reference book Star Wars: Complete Locations. Its name originated in the Star Wars Legends continuity, where it was first mentioned in the 2000 reference book Inside the Worlds of Star Wars: Episode I, which was written by Kristin Lund."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}