{"url": "Loci_Rosen", "categories": ["Category:Legends articles", "Category:Wookieepedia Comprehensive articles", "Category:Alliance Military officers", "Category:Males", "Category:Merchants", "Category:Mon Calamari", "Category:Pilots"], "nodes": [{"tag": "h1", "text": "Loci Rosen"}, {"tag": "p", "text": "Loci Rosen was a Mon Calamari male. He was formerly a merchant while looking for work, although everywhere he went, he turned up empty handed. Rosen served the Alliance to Restore the Republic as a pilot during the Battle of Endor in 4 ABY, where he also served as an officer. At the battle, the Alliance successfully destroyed the Galactic Empire's second Death Star battlestation. Following the battle, Rosen was among the many to dance while celebrating the victory on the surface of the Forest Moon of Endor, playing a musical instrument while doing so."}, {"tag": "p", "text": "Rosen wore a helmet that signified a high rank in the Rebel Alliance, offered moderate protection, and had a built-in communication device. He also donned a beige Mon Calamari Crewman uniform. Rosen was good-willed even as his search for work was unsuccessful. He had brown-mottled skin and orange eyes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Loci Rosen was created for the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. During production he was referred to as \"Forest Ackbar.\" Rosen was portrayed by Stephen Fitzalan. The scenes in which he appeared were filmed between January 20 and 22 of 1982 on Stage 3 in Crescent City, California. Conceptual art that was originally intended to be of Admiral Gial Ackbar was repurposed to become Rosen, or as it was labeled, \"Forest Akbar.\" The art, done by Nilo Rodis-Jamero, was accompanied by instructions and Polaroids on how to wear the character's costume."}, {"tag": "p", "text": "Rosen was first identified on a card for the 2001 Tatooine Limited expansion for the Star Wars Customizable Card Game. According to a fan-run website for the game, he was named as an anagram of Decipher employee Eric Olson."}, {"tag": "p", "text": "Both the 1995 reference book The Essential Guide to Characters and the 1998 reference book Star Wars Who's Who: A Pocket Guide to the Characters of the Star Wars Trilogy mistakenly use an image of Rosen to depict Admiral Gial Ackbar."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}