{"url": "Lod", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Males", "Category:Slavers", "Category:Toydarians"], "nodes": [{"tag": "h1", "text": "Lod"}, {"tag": "p", "text": "Lod was a Toydarian male slave master who owned a young Human female named Marka during the final years of the New Sith Wars. The two encountered the Sith Master Finn and his apprentice after they destroyed a building on the planet. He instructed Marka to impress the Sith in an attempt to sell her to them. When she refused, Lod struck Marka, knocking her to the ground. Lod then conversed with Finn and insulted the apprentice, which angered the young man. The apprentice murdered Lod, freeing Marka from slavery."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lod, a Toydarian male, lived during the final years of the New Sith Wars. As a slave master, he subjugated a young Human female named Marka. Lod and Marka met the Sith Master Finn and his apprentice after they destroyed a building on the planet."}, {"tag": "p", "text": "Lod attempted to offer Marka to the two Sith, instructing the woman to impress them by showing them her teeth. After she refused, Lod hit Marka, which knocked her down to the ground. As Lod talked with Finn, he called the apprentice a slave, which enraged the young man. Finn's pupil murdered Lod, freeing Marka from the Toydarian's bondage."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The Toydarian male Lod physically punished Marka when she disobeyed his order to impress Finn and his Sith apprentice. He assumed that Finn's pupil was the man's slave."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lod first appeared in the short comic \"The Apprentice\", which was featured in Star Wars Tales 17 and written by Mike Denning. In the comic, he was drawn by David Nakayama. The story was later compiled into a trade paperback version and republished in Star Wars Tales Volume 5. Plausible stories in Star Wars Tales 1–20 were initially viewed as S-canon until referenced in a non-Tales source, at which point the subject matter was elevated to C-canon status. Lod later received an entry in The Complete Star Wars Encyclopedia, which raised the character's appearance in The Apprentice to C-canon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}