{"url": "Loden_Greatstorm", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles to be expanded", "Category:Jedi Masters of the Jedi Order", "Category:Males", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Loden Greatstorm"}, {"tag": "p", "text": "Loden Greatstorm was a  Twi'lek male Jedi Master who was part of the Jedi Order during the High Republic Era and was considered one of the best teachers of the Order. Greatstorm saw every moment as a learning experience and sought to better himself and those around him, especially Padawans. He was considered strong and wise and considered to have a great sense of humor. He wielded a yellow lightsaber."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The Great Disaster"}, {"tag": "p", "text": "Jedi Master Loden Greatstorm and his Padawan, Bell Zettifar, were present during the rescue effort in Hetzal system when debris from the Legacy Run entered the system from hyperspace during the Great Disaster. When they were attacked by marauders, Loden lifted the marauders into the air and dropped them to injure them."}, {"tag": "h3", "text": "Elphrona Outpost"}, {"tag": "p", "text": "In the aftermath of the Great Disaster, Greatstorm and his Padawan went to Elphrona, where they were stationed at a Jedi outpost along with Indeera Stokes and Porter Engle. When the Jedi on Elphrona discovered that the Blythe family was kidnapped, they chased the Nihil raiders who kidnapped them. Greatstorm and Zettifar were able to save the mother and Loden protected her when the Nihil ship began firing at them. When Stokes showed up with two Vectors, they began pursuing the enemy. Greatstorm used the mind trick to force the Nihil pilot to slow her ship and open air lock, so they could get inside the ship and save the family. Stokes was able to save the son, but Loden's Vector was destroyed by incoming Nihil ships and he wasn't able to escape with the father."}, {"tag": "p", "text": "After being captured by the Nihil, Loden was locked in a cell on Gaze Electric, where Marchion Ro set up special cells to imprison Greatstorm."}, {"tag": "h3", "text": "Death and legacy"}, {"tag": "p", "text": "Following the Nihil attack on the Valo Republic Fair, the Jedi journeyed to the Nihil's main base on the planetoid Grizal for a counterattack. Greatstorm fell from the Gaze Electric and was saved by Zettifar's telekinesis. They fought side-by-side for a time, though Greatstorm was soon exhausted. The pair were attempting to prevent Lourna Dee from escaping when Ro unleashed the Great Leveler, a creature that could sever a being's connection to the Force. Zettifar and Elzar Mann were overcome by visions, but Greatstorm was killed. His body appeared to be petrified with his features frozen in a scream. When Stellan Gios touched the deceased's cheek, his body crumbled into dust."}, {"tag": "p", "text": "Sometime before Greatstorm was lost, Reath Silas had met the great Jedi and seen how his rare ability to influence emotions with the Force could be beneficial when used correctly. After the Master's death, Silas thought of the example set by Greatstorm when the empathic Imri Cantaros smoothed out his upset feelings, and he was prepared to cite Greatstorm to defend Cantaros against Vernestra Rwoh's concerns about manipulating emotions."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Force-sensitive Jedi Master, Greatstorm had a strong ability to wield the Force."}, {"tag": "p", "text": "Greatstorm was skilled with telekinesis, exemplified when he saved his Padawan, Bell Zettifar, from a large fall by levitating him to safety. Additionally, he could also re-direct explosives, diverting a deadly splinter grenade into the air, to save civilians from marauders. Greatstorm was able to levitate and manipulate multiple enemies at once, lifting eight armed marauders high into the air, disarming them, then dropping them, severely injured. He was also capable of powerful Force pushes, blowing apart a large metal gate, ripping it from the hinges and breaking the locks."}, {"tag": "p", "text": "Greatstorm could also use the Force to influence minds. He demonstrated this by forcing the Nihil pilot Ultident Margrona to slow her ship and open the outer air lock."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Loden Greatstorm wore cream-and-gold Jedi robes. He wielded a yellow-single-bladed lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Loden Greatstorm was created for the Star Wars: The High Republic multimedia project, and was first revealed in an article on StarWars.com, which showed concept art of the character."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}