{"url": "Loje_Nella/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Accountants", "Category:Cliffborer worms", "Category:Desilijic servants", "Category:Females"], "nodes": [{"tag": "h1", "text": "Loje Nella"}, {"tag": "p", "text": "Loje Nella was an intelligent cliffborer worm who worked as an assistant accountant to the Nimbanel Mosep Binneed, in service to the crime lord Jabba the Hutt. In 4 ABY, she watched the Max Rebo Band perform \"Lapti Nek\" in Jabba's Palace on the planet Tatooine. Nella and the Hutt's court later caught Princess Leia Organa trying to rescue the smuggler Han Solo from imprisonment in the palace."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A reluctant employee of the Hutt crime lord Jabba Desilijic Tiure, Loje Nella served as an assistant accountant to the Nimbanel Mosep Binneed. However, she purposefully misappropriated Jabba's credits to obstruct his criminal activities."}, {"tag": "p", "text": "In the year 4 ABY, Nella watched the Max Rebo Band perform the song \"Lapti Nek\" in the main audience chamber of Jabba's Palace on the planet Tatooine from between the Human Jess and Quarren Tessek, two members of the Hutt's court. Later, Princess Leia Organa of the Rebel Alliance infiltrated the palace in disguise to rescue the captive smuggler Han Solo from the Hutt's clutches. However, Jabba learned of her deception and lay in wait with members of his court to catch Organa in the act."}, {"tag": "p", "text": "Between Max Rebo and Droopy McCool of the Max Rebo Band, Nella was hidden in a curtained lift shaft when the group caught Organa, having just freed Solo from carbonite in the connecting audience chamber. The Hutt and members of his entourage later attempted to execute Solo, along with his allies Chewbacca the Wookiee and the Jedi Luke Skywalker, at the Great Pit of Carkoon, though much of the court was killed in the ensuing battle, including Jabba himself."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "An intelligent cliffborer worm covered in green moss, Nella had brown skin and eyes. She was reluctant to work for Jabba and intentionally mismanaged his funds. Nella laughed when Jabba's court captured Leia Organa during her failed rescue attempt of Han Solo."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Conception and portrayal"}, {"tag": "p", "text": "Originally created for the 1983 film Star Wars: Episode VI Return of the Jedi, Loje Nella was portrayed via a puppet operated by Mike Quinn and given the production nickname \"Toadstool Terror\" by the creature creators of the Industrial Light & Magic Monster Shop. She was officially named by the \"Loje Nella\" card from the 1998 Jabba's Palace Limited expansion set of the Star Wars Customizable Card Game, published by Decipher, Inc."}, {"tag": "p", "text": "\"Who's Who in Jabba's Palace,\" a 2002 article written by Daniel Wallace for Star Wars Insider 60, mistakenly claimed that Nella was cut from Return of the Jedi, despite being present in the background of the final film. Cut footage of Nella was later used in \"Lapti Nek\": The Music Video from Jabba's Palace, a music video distributed by MTV in 1983 to accompany the release of the \"Lapti Nek\" record."}, {"tag": "h3", "text": "Continuity"}, {"tag": "p", "text": "There existed a period of confusion surrounding the identity of Loje Nella's species. The Star Wars Customizable Card Game described her as having \"descended from a species of cliff boring worms,\" in keeping with The Illustrated Star Wars Universe, a 1995 reference book written by Kevin J. Anderson, which depicted the cliffborer worm using a production sketch of Nella by Joe Johnston. Despite this, an image of Nella was edited by Cliff Nielsen and featured on the cover of Jedi Apprentice: The Shattered Peace, a 2000 young-readers novel written by Jude Watson, intended to represent a member of the Rutanian species."}, {"tag": "p", "text": "To further complicate matters, Leland Chee, manager of Lucasfilm's Holocron continuity database, initially claimed on the now-defunct StarWars.com Message Boards that Nella was a Riorian, another species based on concept art of the worm creature that would become Nella. However, Chee would later debate the accuracy of this and said that the identity of Nella's species should be determined in a future source. The Complete Star Wars Encyclopedia, released in 2008, ultimately confirmed that Nella was an \"intelligent cliff-borer worm.\""}, {"tag": "p", "text": "While \"Who's Who in Jabba's Palace\" referred to Nella using masculine pronouns, The Complete Star Wars Encyclopedia referred to the character as female. Given that The Complete Star Wars Encyclopedia is the more recent source, this article treats its material as the correct version."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}