{"url": "Lok/Legends", "categories": ["Category:Legends articles", "Category:Galactic Empire planets", "Category:Karthakk sector planets", "Category:Lok locations", "Category:Trade Federation planets", "Category:Type I atmosphere planets", "Category:Volcanic planets"], "nodes": [{"tag": "h1", "text": "Lok"}, {"tag": "p", "text": "Lok (/lɒk/ lock) was a barren and dusty pirate world in the Outer Rim Territories."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Lok was a planet located in the Karthakk system, in the Karthakk sector of the Outer Rim Territories."}, {"tag": "p", "text": "It was a harsh and inhospitable world. Jagged mountain ranges, long expanses of baked desert, desolate flats, dangerous sulfur pools and lava pits were commonly found on the planet. Lok was also the home of several hostile creatures, including the massive Kimogila."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Old Republic era"}, {"tag": "p", "text": "Lok was one of the first planets in the Karthakk system to be colonized. It was originally home to outlaws who saw the world as a potential staging ground for raids into the Mid Rim."}, {"tag": "p", "text": "The pirate Nym lived on Lok as a child. He became a powerful warlord during years leading up to the Invasion of Naboo and founded a pirate group known as the Lok Revenants. They attacked ships coming and leaving the planet until the Trade Federation decided to invade the planet after one such pirate raid in 32 BBY."}, {"tag": "p", "text": "The occupation of Lok lasted ten years. During that time, the Trade Federation used Nym's captured base as a staging ground for their raids in the Karthakk system. The Lok Revenants finally reclaimed Lok during the first days of the Clone Wars, in 22 BBY, thanks to the support of Jedi Master Adi Gallia and the Mere Resistance."}, {"tag": "h3", "text": "Imperial era"}, {"tag": "p", "text": "In the aftermath of the Trade Federation defeat in the Karthakk system, the Lok Revenants became the main power of Lok and Nym ruled the planet as a Pirate King. A city named Nym's Stronghold was built around Nym's old base and served as planetary spaceport for the entire planet. A space station was also built in Lok orbit to control starships wishing to land at the Nym's Stronghold spaceport."}, {"tag": "p", "text": "During the Galactic Civil War, a swoop racing competition known as the Lok Marathon was held on the planet."}, {"tag": "p", "text": "The Galactic Empire eventually claimed Lok and established a military presence on the planet. An outpost was built there, as part of a plan to extend Imperial control over less developed worlds. After the Battle of Yavin, this base was commanded by General Otto. However, although the planet was technically under Imperial control, Nym remained Lok's true ruler. Nym was more friendly with the Rebel Alliance than with the Empire but since General Otto did not try to interfere with the Lok Revenants, Nym decided to not defy the Empire directly."}, {"tag": "p", "text": "Around 1 ABY, Nym's droid factory on Lok was the site of a large battle between spacers affiliated with the Lok Revenants and IG-88's revolutionary droid army."}, {"tag": "h3", "text": "Post-Galactic Civil War"}, {"tag": "p", "text": "Around 137 ABY, Lok was home to a cantina called Brogar's Safe House which served as a safe-house for various fugitives. It was there that Cade Skywalker captured gambler Naxy Screeger and Jedi Hosk Trey'lis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the 2003 massively multiplayer online role-playing game Star Wars Galaxies: An Empire Divided, three moons could be seen from the surface of Lok. With the release of the Jump to Lightspeed expansion pack in 2004, the three moons could yet again be seen from space. This is in contradiction with the Legacy Era Campaign Guide released in 2009, which claims Lok only had two moons. As the Campaign Guide is the more recent source regarding the number of Lok's moons, this article assumes that it is Legends canon, and that the appearance of a third moon in Star Wars Galaxies is erroneous."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}