{"url": "Lok_slicers", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Articles with gameplay alternatives", "Category:Outer Rim Territories organizations", "Category:Slicer groups"], "nodes": [{"tag": "h1", "text": "Lok slicers"}, {"tag": "p", "text": "A group of slicers operated on the planet Lok at the time of the Galactic Civil War. They were based in a building near Nym's Stronghold."}, {"tag": "h2", "text": "Dscription"}, {"tag": "p", "text": "The slicers belonged to different species, including Bith, Aqualish, Devaronians, Humans, a Bothan and an Ithorian. They lived in a house located in the barren wilderness not far from Nym's Stronghold. The building was filled with technology of all kinds, including computers, terminals, viewscreens and various droids. It was defended by several IG-106 sentry droids and all slicers were armed with small firearms. Members of this group included Kelson Sharphorn, Skaelor Tay and Byd Chillings, various quality assurance staff members and several slicer students."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "After the Battle of Yavin, the Corellian technology-hating Meatlump terrorists had expanded to Lok, establishing a small Meatlump camp near Nym's Stronghold. They planted an explosive device in the slicers' house to destroy the building and the technology in it — most likely along with most of the slicers."}, {"tag": "p", "text": "However, a spacer working for Corellia Times reporters Vani Korr and Halden Wes who had infiltrated the Meatlump gang discovered the plot. The spacer traveled to Lok, found the bomb in time and managed to defuse it."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The slicer appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "The slicers and their house were added to the game with the update dubbed \"Chapter 10: The Search for the Meatlump King\", released on June 19, 2008. The slicer NPCs were not part of any quest but they were indirectly involved in the so-called \"Meatlumps Theme Park\". In the basement of the house, there was a bomb that the player had to defuse as part of the quest \"Muddle the Meatlumps\". While there were several slicer NPC enemies in the house, none of them had to be killed for the mission, though it was likely that some of the NPCs would attack the player. \"Chronicle Relics\" could be looted from them. Such relics could be used by players in the Chronicle Quest system to create their own quests for other players. By using the relics related to the slicer NPCs, the quests would task the player with killing slicer in the house, or just traveling to the house."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}