{"url": "Lokir-Ka", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Diplomats", "Category:Government figures", "Category:Males", "Category:Smugglers", "Category:Voss"], "nodes": [{"tag": "h1", "text": "Lokir-Ka"}, {"tag": "p", "text": "Lokir-Ka was a male Voss Diplomat living on Voss during the Galactic War and a husband of the Adjudicators member Mirev-Ka."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lokir-Ka appeared to be the perfect Voss citizen holding the title of Honores. He obeyed laws, respected the Voss Mystics and had followed the career path his government laid out for him based on his charm, intelligence and gift for outsider languages, becoming one of the top Voss diplomats in their tractative with the Sith Empire and the Galactic Republic. However, Lokir-Ka concealed a barely-suppressed wanderlust and unseemly fascination with foreign cultures that would shocked his peers."}, {"tag": "p", "text": "After years of working with Republic and Imperial ambassadors trained in polite doublespeak, Lokir-Ka found the blunt statements of underworld gangsters uniquely appealing. His occasion arose when a young smuggler arrived on Voss in search of a trade of Gormak cyberbeasts transported offworld by the Exchange for the crime lord Rogun the Butcher. Lokir offered himself as government's contact for the smuggler, directing him to his Exchange contact Scratch in the Minev-Ra Caves. Scratch's arranged meeting between the Voidhound and Jela Reneke turned into a disaster, as she managed to convince the Voss authorities that her cyberbeast smuggling operations were instead managed by Lokir-Ka's contact. Lokir-Ka kept the Adjudicators off the smuggler's trail long enough for him to confront and defeat Jela Reneke, but afterwards insisted on bringing the matter before the Adjucators. His wife Mirev-Ka led the proceeding while Lokir-Ka acted as a defendant. The Adjudicators found the Voidhound innocent of cyberbeast smuggling, but guilty of other things such as dealing with Gormak and venturing into the Nightmare Lands. As a term of servitude, Mirev-Ka and Lokir-Ka asked the smuggler to make deliveries to several of the Voss who ventured into the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "If the player is female it's possible to start a love story with Lokir-Ka, despite him being married."}, {"tag": "h2", "text": "Appearances"}]}