{"url": "Lokmarcha", "categories": ["Category:Canon articles", "Category:Alliance Army officers", "Category:Alliance Special Forces personnel", "Category:Dressellians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lokmarcha"}, {"tag": "p", "text": "Lokmarcha was a male Dressellian soldier who served as a major in the Alliance to Restore the Republic during the Galactic Civil War. He was killed during the Operation Yellow Moon mission."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Galactic Civil War"}, {"tag": "p", "text": "Lokmarcha was a major in the Alliance to Restore the Republic's commandos. He was assigned as security during Operation Yellow Moon by Crix Madine. During the mission briefing, he attempted to assert that he was in control during combat conditions, but Leia Organa explained that she was in charge at all times. He grudgingly agreed with her."}, {"tag": "p", "text": "During the flight to Basteel, he and Kidi Aleri had an argument over what should be done to Imperials if the Empire was defeated. While she hoped they would be treated mercifully, he advocated that they should be tried and killed. Organa broke up the argument and took Lokmarcha aside to admonish him for arguing with a team member. He explained that was just trying to toughen Aleri up so she wouldn't freeze when she saw combat. He then revealed that he knew Operation Yellow Moon was a diversionary tactic and was ordered by Organa not to reveal that fact to any other of the team. On their approach to Eladro City, Lokmarcha warned the claustrophobic Antrot that he probably wouldn't like it there much."}, {"tag": "h4", "text": "Basteel"}, {"tag": "p", "text": "Once they landed, Lokmarcha accompanied the rest of his team to the city. He was worried that the crowds in the local bazaar would make it hard for him to protect Organa. After leaving the rest of the team in the bazaar, he went with Organa to Bon Yoth's house to make contact with the former rebel. When Yoth tried to prevent them from entering his home, the commando forced his way in. Yoth refused to help the rebellion, and Lokmarcha called him scared. While Yoth declined to rejoin the rebellion, he did show Organa and Lokmarcha a way to get to the surface and plant a hyper-transceiver beacon by crawling up his chimney into the network of vents and tunnels that ran through the rock. Organa stated the Antrot and Aleri would have to go with them, and Lokmarcha doubted they were tough enough to make the difficult climb. Organa insisted that they come along, in case she needed their technical skills and sent Lokmarcha back to the bazaar to fetch them."}, {"tag": "p", "text": "Once they were all back together, Lokmarcha took lead and climbed up the chimney first. When they reached an intersection of tunnels, he scouted around while the others rested and found another chimney that could lead them to the surface. After the beacon was placed, Aleri entered several Alliance codes by memory into the beacon. Lokmarcha scolded her for memorizing codes, explaining that if she was captured, the Empire would be able to learn all of them from her. When they reached the surface, Lokmarch huddled with the others under a sheet of insulation that Antrot had while waiting for Nien Nunb to arrive in his ship. Lokmarcha was rescued along with the rest of the team and safely made if off the planet."}, {"tag": "h4", "text": "Sesid"}, {"tag": "p", "text": "On the way to the next destination, Lokmarcha busied himself by sharpening a large knife while the rest of the team watched a unauthorized holofeed showing the Imperial crackdown on Basteel. Aleri revealed that the codes they were using might be compromised and Lokmarcha watched closely to see if Organa would reveal the true nature of Operation Yellow Moon. Once they landed on Sesid, Lokmarcha remarked that he preferred this planet over Basteel. Nunb suggested that they change into clothes more appropriate to the tourist nature of the planet, and Lokmarcha had to wear an outfit consisting of purple shorts, a t-shirt advertising a local smazzo band and polarized eye lenses. He had to store his weapons and armor in a duffel bag."}, {"tag": "p", "text": "The team rented a repulsorcraft and Lokmarcha commented on how frivolous the tourists seemed when worrying about the local weather while a galactic war was taking place but Aleri reminded him that is what the rebellion was fighting for. Lokmarcha admitted he hadn't thought of it that way. He piloted the craft to the rendezvous point so that Organa could meet her contact and the rest of the team could place the beacon. When they arrived at the island, Lokmarcha came to the conclusion that he should accompany Antrot and Aleri to the top of the volcano to place the beacon, but was hesitant to leave Organa alone since his mission was to protect her, not the others. Organa ordered him to go with Antrot and Aleri, explaining that she could take care of herself but the tech and the communications specialist weren't so capable. After placing the beacon, Lokmarcha returned to find Organa asleep on the beach. The team boarded their replusorcraft and started to head back to Thrinaka when they were warned by Nunb that Imperials had landed and were searching the town. Lokmarcha took evasive action and told Organa to get a set of electrobinoculars to look for enemies. She spotted Stormtroopers on waveskimmers and switch places with Lokmarcha, so that he could fire on their pursuers. When the princess steered their craft into a submersible that surfaced in front of them, Lokmarcha warned against it since it was unknown who was on-board it but Organa reasoned that it was safer than being shot at by the Imperials."}, {"tag": "p", "text": "The vehicle submerged and escaped the Imperials but Lokmarcha and his team were confronted by the Draedan pirate Aurelant and his crew. Lokmarcha moved to protect the princess, but she told him to stand down since they were heavily out-numbered. He was disarmed and watched as Organa negotiated with the pirates. Lokmarcha and the rest of the rebels were able to escape the planet with Aurelant's assistance."}, {"tag": "h4", "text": "Jaresh"}, {"tag": "p", "text": "Lokmarcha and the rest of the team landed near Jowloon and went to meet their contact on the planet, Nyessa. As they walked through the village, Aleri pointed out some stormtroopers on patrol, but Lokmarcha warned her not to draw attention to themselves. Once they met the matriarch of the village, she loaned them a pair of urdas so they could ride up to the communication tower and plant a beacon. Lokmarcha rode one of the beasts with Aleri, while Organa took the other with Antrot. At the tower, Aleria realized it wasn't a transmitter but a conduit, and worried their signal would get lost in all the traffic. Lokmarcha encouraged her to improvise a method to make their signal more detectable. While Aleri and Antrot were busy, Lokmarcha met with Organa to discuss Nyessa's plan to oppose the Imperial presence on the planet. He convinced the princess that they had to follow through on the plan to make sure they kept the Empire's attention on them and away from the fleet. Once Aleri was done placing the beacon, Organa had a crisis of conscience and decided to reveal the true nature of Operation Yellow moon despite Lokmarcha's objections. The rest of the team agreed with the princess and agreed to help defend Nyessa. Lokmarcha took a sniper's position in a barn overlooking the square where Nyessa and her people would confront the Imperials. After Antrot set off a charge to startle the animals corralled in the square, Lokmarcha shot off the lock so that they would stampede over the Imperials. When some of the forces were able to avoid the animals, Organa decided to directly fight them. The commando demanded that she stay hid in the barn, so that he could protect her but she told him to just shoot anyone who came near her. During the skirmish, he shot several stormtroopers."}, {"tag": "h4", "text": "Yellow Moon"}, {"tag": "p", "text": "Once they were safely in hyperspace on their way to the rendezvous, Lokmarcha raised objections to Organa's plan to meet with any ships that responded to the placed beacons and warn them off. He pointed out that the Empire could break the codes and would realize the full extent of Operation Yellow Moon. Aleri came up with an idea to use a tight-beam broadcast so the signal couldn't be overheard. Later, as the trip continued, Lokmarcha and Aleri shared a romantic embrace on the acceleration couch."}, {"tag": "p", "text": "As they were ambushed by the Shieldmaiden, Lokmarcha told Antrot and Organa to hold off on their plan to self-destruct the Mellcrawler and explained he had his own plan. He also revealed that he found out about Organa's plan due to Antrot's tendency to talk in his sleep. He was captured along with his crewmates and imprisoned on the Star Destroyer. He told Khione that he would reveal all the he knew if he could see Organa. The Captain determined he would not, but allowed him to enter Organa's cell so that the princess would be forced to watch as an interrogation droid tortured him. He then detonated an electromagnetic pulse bomb that he had implanted in his chest, killing him instantly and disabling a large part of the Star Destroyer. This enabled Organa and the rest of her team to escape."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Lokmarcha was initially going to lead the mission to destroy the second Death Star's shield generator on Endor. But after his death during Operation Yellow Moon he was replaced by General Han Solo."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lokmarcha was coldly pragmatic. He had no problems with sentients being killed if it was for the greater good. He also believed that in the event of the Alliance to Restore the Republic's victory, all former Galactic Empire personnel should face trials and be executed. He took pride in the fact that he always did his duty."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Lokmarcha was extremely skilled at combat, familiar with blasters and knives."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}