{"url": "Lolo_Purs", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Clerical workers and assistants", "Category:Females", "Category:Rodians"], "nodes": [{"tag": "h1", "text": "Lolo Purs"}, {"tag": "p", "text": "Lolo Purs was a female Rodian aide to Senator Onaconda Farr and the Representative of Rodia during the Clone Wars. During the war, she murdered Senators Farr and Mee Deechi."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "Lolo Purs was a female Rodian who served as an aide to the Senator of Rodia, Onaconda Farr, during the Clone Wars. During the war, a bill was proposed by the Kaminoan Senator Halle Burtoni to fund military activity, escalating the war. This vote was opposed by Burtoni's opponents, including Padmé Amidala, Bail Organa, and Farr. During the speech, Purs observed."}, {"tag": "h4", "text": "Murders in the Senate"}, {"tag": "p", "text": "As the Clone Wars continued, Purs was furious that the Senate, Rodia, and the people simply forgot Farr's treason and brief dealings with the Separatists. Believing him too weak to represent the Rodian people, Purs poisoned Farr in secret during a meeting with his allies. As his aide, she became acting senator for her homeworld. The Senate assigned Lieutenant Tan Divo to investigate Farr's murder, thus postponing the vote to counter Burtoni's legislation. As the investigation went on, Purs put a dagger into Deechi's chest after he told Amidala and Organa of a meeting Farr had at the docks and accused Burtoni to take the pressure of possible suspicion off her."}, {"tag": "p", "text": "However, when Burtoni was taken to be arrested one of Farr's allies, Padmé Amidala, was able to piece together the facts and notice that Purs was the true culprit. When Purs was properly accused, she tried to escape with Amidala as a hostage. However, Amidala escaped, knocking her out and arresting her."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lolo Purs was a dedicated servant to her homeworld. She was, however, an individual who didn't forget easily. Furious that Onaconda Farr temporarily negotiated with the Separatists, she engineered his death and, when she was discovered, even blamed Halle Burtoni, who at the time was representing the other side of the reduced military spending bill."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Purs wore elegant white and red robes from Rodia."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lolo Purs is voiced by Jennifer Hale in The Clone Wars television series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}