{"url": "Lone_battle_droid", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles with conjectural titles", "Category:B1 battle droids", "Category:Separatist droids", "Category:Separatist military members", "Category:Trade Federation members", "Category:Unidentified B1 battle droids"], "nodes": [{"tag": "h1", "text": "Lone battle droid"}, {"tag": "p", "text": "During the Clone Wars, a lone battle droid deserted the Separatist Droid Army after being disconnected from the droid collective. A B1-Series battle droid forged by the Trade Federation, the droid had no independent thought, as its thinking was done by a Central Control Computer. It fought in numerous battles during the Clone Wars, but was continually damaged or destroyed, only to be rebuilt with new parts."}, {"tag": "p", "text": "The droid was eventually posted to the planet Antamont along with a sizable Separatist force, as part of an attack on a Republic stronghold on the world. As the droid forces marched through a narrow mountain walkway, the B1 activated a Republic land mine. The explosion caused great damage, and the droid's connection to the central mainframe was severed. With newfound freedom and independent thought, the B1 put its own survival by any means as its number one objective and fled the battle. It was followed by a grapple droid, who attempted to persuade the runaway B1 to return to duty; when it refused, the grapple droid attacked, and the two ended up falling off the edge of a cliff. The grapple droid eventually shut down, but the B1 remained relatively undamaged. It fled further away from the battle for a time, until its battery eventually expired. Several years later, the lone battle droid was found by two local farmers, who decided to recharge the droid for use on their ranch."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Cog in the war machine"}, {"tag": "p", "text": "During the Clone Wars, the Trade Federation produced B1-Series battle droids en masse for the Separatist Droid Army. The spindly, skeletal droids were slave circuited to a Central Control Computer mainframe—or core—located in another, secure location. It guided the droids' movements so that they fought as one, with a hive-mind, and did not think independently. Alone, each droid was of little use in doing battle, but in huge numbers they were effective; essentially disposable, when one was destroyed, two more took its place."}, {"tag": "p", "text": "One such battle droid fought in numerous battles during the Clone Wars. Constructed at a Trade Federation factory like all of its kind, the B1 marched into battle many times, fighting for the Confederacy of Independent Systems against the Galactic Republic, but was frequently damaged. Each time the droid incurred such damage, it was salvaged and returned to the factories for reconstruction. After being rebuilt, it was redeployed to another battle, and the process repeated itself manifold. During one particular Clone Wars battle, the droid lost all of its limbs and suffered a mark on its cranium, until it was salvaged from a pile of damaged droids on the battlefield and rebuilt."}, {"tag": "h3", "text": "Desertion"}, {"tag": "p", "text": "At some point in the Clone Wars, the droid was posted to the green, mountainous planet Antamont, the site of a Republic stronghold. The Confederacy launched an attack force toward the stronghold; hordes of battle droids, grapple droids, spider droids, and Hailfire droids marched and rolled along a narrow path through the mountains to reach it. The scarred B1 was at the front of its particular group; the pathway was littered with Republic mines, and it trod on one, detonating the mine. The explosion destroyed a number of other droids and damaged some vehicles, while the B1 who had set it off was sent sprawling through the air and down the hillside toward a river, adjacent to the road. It collided with a rock in the river, damaging its cranium and causing itself to shut down for a few moments."}, {"tag": "p", "text": "After reactivating, the droid realized that its connection to the droid collective had been severed; for the first time in its existence, its role and reason to exist were in question. As the droid returned to its comrades' sides and watched the Confederate and Republic forces meet and begin battle, a new directive took hold, placing the droid's survival above all else. Immediately after making this realization, the B1 turned away from its fellow droids and fled, down the hill side and away from battle, having realized it was likely to be damaged once more or permanently destroyed in battle. The droid ran, down hills and up hills, until it eventually reached the edge of a massive cliff, where it stopped, having put several kilometers between itself and the CIS forces. With the droid's new cognizance came hope, and the possibility of a different life, one of the droid's own choosing. However, the droid's flight did not go unnoticed and as it began to ponder its future, a Separatist grapple droid arrived at the cliff's edge, having trailed the B1 from the battle site. The grapple droid informed the B1 that desertion was violation of protocol, and ordered it to return to the fray post haste. The B1, however, had no intention of doing so."}, {"tag": "h3", "text": "Compassion"}, {"tag": "p", "text": "The battle droid, its blaster rifle still intact, refused to comply and fired upon its assailant, though the shots had little effect. The B1 implored the other droid to stop and think, to question its orders and try to save itself from the inevitable destruction on the battle field. The grapple droid's programming did not permit this; it cut off half the B1's arm with its pincers, disarming the droid of its weapon in the process. The B1 refused to submit, though, dodging the other droid as it attempted to inflict further damage upon its comrade. The grapple droid pursued the B1 toward the cliff edge; the B1 besought it to disconnect itself from the core and live a free life, or to at least let the B1 go free. The grapple droid refused, launching itself powerfully at the other droid. The B1 managed to move aside, making the grapple droid fall over the edge of the cliff; however, the plummeting droid was able to grab hold of the B1, pulling it down with itself."}, {"tag": "p", "text": "Both droids eventually collided with the ground, but the grapple droid came off far worse. The B1, still able to walk effectively, made to flee, but the barely functioning grapple droid spoke to it, asking why it did not return to central control to have its batteries recharged, for its battery would not last long in the wilderness. The B1 told its comrade that it would rather a mere two days of freedom than a much longer life of blind obedience and inevitable doom. The B1 then stayed with the grapple droid for a time as the grapple droid's little remaining power began to wane. The grapple droid, its connection to the core now severed, too, was afraid of going off-line, but the B1 eased its fears, staying with it until the grapple droid eventually shut down permanently."}, {"tag": "h3", "text": "New life"}, {"tag": "p", "text": "The droid returned to a vantage point to survey the ongoing battle between the Separatist droids and the Republic forces. Realizing that it had one last chance to go back, that this was the point of no return, the droid turned its back on the warring, heading into a forest. It wandered through Antamont's terrain until twilight, when it stopped and sat against a solitary tree at the top of a mountain. Its battery eventually expired, and the droid remained in the same sitting position through many seasons, without anyone interfering with its body."}, {"tag": "p", "text": "Eventually, years after the Battle of Antamont and the end of the Clone Wars, two farmers stumbled upon the droid's body. They were surprised to see a B1 in one piece on their world, as most were badly damaged during the battle, and were intrigued by the droid's location atop a mountain, for the battle had taken place in a valley. One of the farmers remarked that, if they could charge the droid's battery, it might be able to help them around their ranch. The two farmers then took the droid back to their ranch, ready to reactivate it."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Like all B1 battle droids deployed by the Trade Federation before and during the Clone Wars, the runaway droid was not capable of proper independent thought; its thinking was done by the central control mainframe. It marched into battle with its comrades, and was destroyed time and again, only to be rebuilt. Individual battle droids were not given much consideration by either side in the Clone Wars; to the CIS, they were cheap and expendable, their strength only in their numbers; to the Republic soldiers and Jedi they fought, they were soulless entities whom they could cut down without remorse."}, {"tag": "p", "text": "However, once the droid was damaged and its connection to the core severed, it became capable of independent thought—and realized the futility of its existence. The B1 knew that if it returned to battle, it would merely be damaged and reconstructed yet again, until it was eventually shut down permanently. The battle droid set survival at all costs as its ultimate aim and deserted the battlefield, violating commands it would not have been able to had it still been connected to the mainframe. Freedom was all the droid cared for, and it would happily have taken a few short days of freedom than return to it prior existence, where it was doomed."}, {"tag": "p", "text": "The droid's new-found cognizance also led to it developing a personality, and something of an attitude. When faced by the grapple droid that had followed it, the B1 became impertinent and snarky, mocking the other droid. However, it also developed a sense of compassion, and tried to ease its companion's fears before the grapple droid's battery expired, staying with the other droid."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This character was created by Jeremy Barlow for \"Pathways,\" a short comic featured in Clone Wars Adventures: Volume 8, illustrated by the Fillbach Brothers. The droid is the central character of the story, though it goes unnamed. Barlow has stated that \"Pathways\" is one of the best Star Wars pieces he has written, as it introduced a new character and got the readers to care about him in a short space of time. The character was subsequently referenced in the Antamont entry of The Complete Star Wars Encyclopedia, by Daniel Wallace, Pablo Hidalgo, Stephen J. Sansweet and Bob Vitas, though again was not given a name or designation."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}