{"url": "Long-handle_lightsaber", "categories": ["Category:Legends articles", "Category:Lightsaber variations"], "nodes": [{"tag": "h1", "text": "Long-handle lightsaber"}, {"tag": "p", "text": "The long-handle lightsaber was a variation of the traditional Jedi weapon with a handle several times longer than that of a standard lightsaber. Requiring a particular fighting style from the wielder, this weapon was easy to swing around the body, using joints of the body as fulcrums upon which the lightsaber could be levered."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Darth Chratis, a Sith Lord who lived during the Cold War, used a staff that could become a long-handle lightsaber."}, {"tag": "p", "text": "Dark Jedi Warb Null also used a long-handle lightsaber that featured a red blade in one end and an emerald green one out the other, making it a double-bladed lightsaber. It was later found by Telloti Cillmam'n and used to kill his master, Ekim Ryelli."}, {"tag": "p", "text": "One of the Bpfasshi Dark Jedi defeated by Jedi Master Yoda during the Clone Wars used a long-handle lightsaber made of an as-yet unknown material. Jedi Master Zao used a lightsaber with a hilt that was also a long wooden cane, which the blind Veknoid used to help him get around. Jedi Master Yarael Poof also used a long-handled lightsaber to fit his tall frame."}, {"tag": "p", "text": "Jedi Master Kyle Katarn's third lightsaber had a longer hilt than an average lightsaber, but it is unclear whether it fit under the category of long-handle lightsaber."}, {"tag": "p", "text": "This type of lightsaber was favored by the Sith Lord Darth Nihl, whose lightsaber was long and staff-like in appearance. The handle seemed to be made not of metal, but almost of wood or coral (possibly of Yorik coral as in others lightsaber hilts of the One Sith). On the opposite end to the blade emitter was a ring big enough to fit Nihl's hand. Nihl used this lightsaber to cut off Wolf Sazen's right arm at the shoulder."}, {"tag": "p", "text": "However, like most double-bladed lightsabers, the long handle presumably meant that opposing duelists could target the handle itself to great effect."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}