{"url": "Loom_Carplin", "categories": ["Category:Legends articles", "Category:Alliance Military members", "Category:Humans", "Category:Males", "Category:Mantooinians"], "nodes": [{"tag": "h1", "text": "Loom Carplin"}, {"tag": "p", "text": "Loom Carplin was a Human male who served as Travia Chan's Chief of Staff during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Loom Carplin was a Human male from the planet Mantooine. A founding member of the Mantooine Liberators, Carplin was the highest-ranking survivor of the resistance group after it was crushed by Imperial forces. After Travia Chan merged the Fest Resistance Group with the survivors of the Liberators to form the Atrivis Resistance Group that later became the Atrivis Sector Force under the Alliance to Restore the Republic, Carplin served as Chan's Chief of Staff. Due to medical conditions that confined her to a repulsorchair, Carplin acted as Chan's eyes and ears, constantly traveling throughout the sector and even taking charge of critical missions. Carplin was assisted by Busurra, a Wookiee; Busurra acted in Carplin's stead when the latter was off base on a mission."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Big and strong with long mutton chops, Carplin was a warrior first and foremost. He often took charge of difficult operations undertaken by the Atrivis Sector Force."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Carplin was skilled in the use of blasters, and blaster artillery. He was also adept at unarmed combat, and the deployment of grenades. Physically fit, Carplin was a strong swimmer, and trained in stealth and survival techniques. His experience as Chief of Staff gave him a working knowledge of the operation of a bureaucracy, as well as knowledge about alien languages and planetary star systems. Carplin also knew how to contact the criminal underworld if needed. His mechanical and technical proficiencies included being able to drive repulsorlift vehicles, operate demolitions equipment, apply first aid, and bypass security systems."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Carplin was armed with a blaster pistol, and carried a comlink and datapad."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Loom Carplin was created for the The Rebel Alliance Sourcebook by West End Games. The later novel The Last Command mentioned that the Rebels managed to \"sneak Travia Chan and her people out from under the Imperials' collective snout.\" This likely included both Carplin and Busurra."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}