{"url": "Loopa", "categories": ["Category:Legends articles", "Category:Bith", "Category:Males", "Category:Musicians", "Category:Twisted Rancor Trio Band Members"], "nodes": [{"tag": "h1", "text": "Loopa"}, {"tag": "p", "text": "Loopa was a male Bith musician who played the kloo horn and served as Ujaa's replacement in the Twisted Rancor Trio."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "In the early days of the Twisted Rancor Trio, founded by Gilthos Uksaris, the band struggled due to the lackluster performance of Ujaa, one of the band's three members. When Ujaa was fired following the complaints of the leader singer Elinda, Uksaris was in need of a suitable replacement, and Loopa became the one to take Ujaa's place. The third member, Ujii, as the brother of Ujaa, was displeased at Ujaa's dismissal and quit the band. To assist Uksaris in finding a replacement for Ujii as well, Loopa recommended the Bith Fodo, an offer Uksaris gladly accepted."}, {"tag": "p", "text": "Elinda, Loopa, and Fodo would thus form the second incarnation of the Twisted Rancor Trio, much more successful than the first. The group began to gain fame and were most popular on its homeworld of Taris where Elinda's voice was especially admired."}, {"tag": "p", "text": "Eventually around 3956 BBY, the band attracted the attention of Davik Kang, a powerful businessman that was actually head of the local crime syndicate, the Exchange. Though Kang's connections to the Exchange were not expressly known, rumors prevailed regarding it, and these rumors were enough to dissuade Elinda from accepting Kang's invitation for the band to perform at his estate. Uksaris, believing that this was the chance for the band to rise to stardom, thought that the opportunity was too great to pass up, and neither Loopa and Fodo were prepared to decline the invitation either. On the eve of the scheduled performance, Uksaris made a last minute recruitment of Elinda's sister Ashana to replace Elinda as the lead singer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Loopa, like the rest of the members of the Twisted Rancor Trio, only appear as a hologram in the video game Star Wars: Knights of the Old Republic, as part of a puzzle that the player, Revan, can encounter in searching the Lower City Apartments of Taris. A security crate delivered to Gilthos Uksaris is rigged by a Holo-Sec Corp anti-theft explosive which can only be disarmed by activating the six holoprojectors of the members of the band surrounding the box in order of their recruitment. The solution is derived from consulting the datapad on the nearby table of a draft of Guts and Glory: A Chronicle of The Amazing Story of The Twisted Rancor Trio, which details the history of the band."}, {"tag": "h2", "text": "Appearances"}]}