{"url": "Loppak_Slusk", "categories": ["Category:Legends articles", "Category:Crime lords", "Category:Exchange members", "Category:Males", "Category:Quarren", "Category:Telosians"], "nodes": [{"tag": "h1", "text": "Loppak Slusk"}, {"tag": "p", "text": "Loppak Slusk was a male Quarren crime boss on Citadel Station representing the Exchange, an intergalactic crime syndicate. Instructed by G0-T0, the Nar Shaddaa crime boss, Slusk came to Citadel Station over Telos IV to try and integrate the Exchange into the new Telos. Making an alliance with the Czerka Corporation brought the attention of Meetra Surik, a Jedi who happened to have a bounty on her head. When Slusk tried to collect the bounty, Surik resisted, and Slusk's operations almost came to an end."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Around 3951 BBY, Slusk was instructed by his boss, the Exchange crime lord G0-T0, to start a new Exchange cell on Citadel Station. After the planet Telos IV was bombarded by the Sith Empire, the massive Citadel Station had been constructed to serve as a home for displaced Telosians as well as a base for the Telosian Restoration Project, a massive terraforming operation that would restore the surface of Telos."}, {"tag": "p", "text": "The farsighted Goto hoped that Slusk's cell could integrate themselves into the Telosian economy before it was reconstructed. Slusk was able to successfully establish an Exchange base on Citadel Station, using the legitimate front of the Bumani Exchange Corporation to act as the Exchange's legal face. He recruited several lieutenants, including Benok and Luxa. Before long, the Exchange began conducting a number of illegal operations over Telos, including illegal arms and spice smuggling, and controlling gambling outfits."}, {"tag": "p", "text": "During this time, Slusk made a deal with Jana Lorso, Czerka Corporation representative on Citadel Station. Lorso was attempting to seize control of the Restoration project away from the peaceful Ithorians. Slusk agreed to provide extra muscle for Czerka in an attempt to harass the Ithorians, in exchange for use of Czerka's private hangars to use in their illegal operations. This plan proved beneficial for both sides, until the arrival of Meetra Surik."}, {"tag": "p", "text": "Only a short time prior to Surik's arrival on the station, Goto himself had posted a massive bounty on all Jedi. Slusk intended to capture Surik and transport her to Nar Shaddaa. Surik was arrested by the TSF, pending an investigation of the destruction of the Peragus Mining Facility (Surik was suspected of involvement). Slusk, utilizing one of Czerka's hangars, allowed an assassin posing as a TSF agent named Batu Rem to come aboard the station. The assassin took it from there, deactivating security cameras, etc. The assassin failed however, and Surik was later released."}, {"tag": "p", "text": "Surik obviously wanted to make trouble on the station, and put a damper on Czerka's plan. Lorso contacted Slusk, and asked him to send a band of thugs to one of the dock modules and retrieve an information droid from the Ithorians. Slusk attempted to do so, but Surik had allied herself with the Ithorians and dispatched the assassins."}, {"tag": "p", "text": "Soon after, an illegally-modified blaster carried by one of her assailants, led Surik to Samhan Dobo, the chief supplier of black market arms on Citadel Station. Surik subsequently shut down Samhan's operations with the help of the TSF, crippling a leg of Slusk's operations."}, {"tag": "p", "text": "The final act of Surik against Slusk was the infiltration of his headquarters. Despite having informed his security personnel that no one representing the Ithorians was to be admitted, Surik nonetheless entered the offices of the Exchange. Slusk was confronted by Surik, claiming to have come representing Chodo Habat, the leader of the Ithorians on Citadel Station. Enraged that Surik had been able to infiltrate his headquarters, Slusk ordered his chief-enforcer, Benok, to handle the Jedi."}, {"tag": "p", "text": "Surik killed Benok and his men, and followed Slusk to his quarters. Slusk, furious that the Gamorrean guarding the door to his office had given Surik access, sent his droid bodyguards to destroy Surik, and shut his office tight."}, {"tag": "p", "text": "But not even droids could stop the Jedi. Slusk, fearful for his life, asked Surik what she wanted. Surik simply told him that she wanted the Exchange to lay off the Ithorians. Slusk was surprised that Surik went to all the trouble for just a simple request, but the meeting was interrupted by Luxa. Suspicious, Slusk asked Luxa if she had been responsible for the Jedi's admittance. Luxa confirmed Slusk's suspicions, obviously intending to take power from Slusk, with the Jedi's help. The Jedi, however, tried not to get involved. Enraged that Surik would not help her as she had planned, Luxa attacked Surik, flanked by her Gamorrean bodyguards. Together, Slusk and Surik defeated Luxa's coup d'état."}, {"tag": "p", "text": "Surik once again asked Slusk to lay off the Ithorians, claiming that she had proved she could make trouble for Slusk. The Quarren, seeing the Jedi's proven strength, agreed to lay off the Ithorians, but warned Surik not to push the Exchange any further."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Slusk was very much like most Quarren. He had little regard for the intelligence of others, considering himself to be superior. This arrogance caused him much trouble, as he not only underestimated Luxa's capability for betrayal, but also the abilities and powers of the Jedi. Nevertheless, Slusk was an adept businessman, and operated the operations on Citadel Station very well, pulling in a stable flow of credits. As such, Goto held Slusk in high regard, viewing successful Exchange bosses as superior to more ruthless ones, or more tactful."}, {"tag": "p", "text": "Slusk himself did not have a very large moral center, obviously due to his affiliation with an intergalactic crime syndicate. Nevertheless, Slusk was not above bribery or extortion, and did whatever he could to root the Exchange into Citadel Station, bribing officials, and assassinating other potentially troublesome targets. Slusk also did not tolerate foolishness, threatening to kill subordinates for allowing a representative of the Ithorians to enter the Exchange offices."}, {"tag": "p", "text": "Slusk also held his personal safety in very high regard, surrounding himself with a number of defenses for his own protection. Slusk was always flanked by two droid bodyguards, similar in construction to the war-droid series. The chamber outside his office was filled with ruthless Gamorrean guards. Beyond that, Benok usually had a few men stationed near the door when he was away. Benok himself was Slusk's \"chief of security\" (or in other words, top thug). Closer to home, Slusk had concealed turrets on either side of his desk."}, {"tag": "p", "text": "Slusk wore an array of gear, typical for most Quarren at the time. He wore long bluish-white robes, with a wide metal belt going across his torso, and a short brown cape behind him that fell to his lower back. Slusk also had a sonic pistol, similar to other Quarren crime bosses, such as Saquesh."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Although the above is considered the most canonical light-side ending, the following options are available to the Exile."}, {"tag": "p", "text": "If the Exile is working for the Ithorians:"}, {"tag": "p", "text": "Alternatively, the Exile, if on the dark side of the Force, can ally herself with Czerka, and attempt to kill Slusk for Jana Lorso, to which Slusk feels betrayed. The scenario can be played similarly to the above encounter:"}, {"tag": "p", "text": "If you kill Slusk for Lorso, his men will retaliate by attacking the Czerka offices."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}