{"url": "Lord_Corvax%27s_Lightsaber", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Pages needing citation", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Lord Corvax's Lightsaber"}, {"tag": "p", "text": "Lord Corvax's Lightsaber was an ancient lightsaber that was wielded by Lord Dorwin Corvax, the husband of Lady Corvax."}, {"tag": "p", "text": "After Dorwin's death, Lady Corvax tried to resurrect him using the Bright Star to power the Aeon Engine. This partially failed, trapping Dorwin between the living world and the next one. After this event, Dorwin came to be known as the Black Bishop, and the planet Mustafar was transformed from a verdant place into an inhospitable lava world. Lady Corvax hid the Lightsword away in her Sanctum."}, {"tag": "p", "text": "Many years later during the Imperial Era, the Black Bishop would end up giving the Lightsword to one of his descendants. This new owner would use it to command an army of ancient droids known as the Marching Horde, duel Darth Vader, and destroy the Bright Star and Aeon Engine. Dispatching the Bright Star and Aeon Engine damaged the Lightsword, after which could no longer project a blade. Back on the descendant's ship, the Windfall, the descendant and ZO-E3 discovered that when combined with an artifact they recovered, the Lightsword also projected a star map from Mustafar to somewhere in Wild Space."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Lightsword was rather unique among lightsabers. It was single-bladed, like most sabers; however, it also had a crossguard. Unlike the crossguards of crossguard lightsabers like that of Kylo Ren, this crossguard had no vents or smaller blades, and had a semicircular design. It was much more like a regular sword's crossguard."}, {"tag": "p", "text": "Also, unlike most lightsabers, its Kyber crystal (the source of the blade) was exposed, instead of being encased in the hilt. The crystal was placed in the central area of the crossguard, and emitted a blade through two curved prongs that spiraled from the top of the guard. The crystal had a very dark blue color, and sparked with electricity when being activated to form a blue blade. The lightsaber's hilt emitted smoke for a short time after the blade was deactivated."}, {"tag": "p", "text": "The hilt was narrow, and came to an end at a flat, circular pommel with golden accents. These accents covered the crossguard as well. The entire saber was made of some sort of grey metal."}, {"tag": "p", "text": "As it represented the power of Lady Corvax and her husband, ancient Mustafarian technology was keyed to respond to it. It can command the Marching Horde through specific motions made with the blade ignited, it can be presented to sealed doors to make them open, and serves as the key to the chamber where the Bright Star was hidden."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}