{"url": "Lord/Legends", "categories": ["Category:Legends articles", "Category:Articles needing additional sources", "Category:Nobility", "Category:Titles of nobility"], "nodes": [{"tag": "h1", "text": "Lord"}, {"tag": "p", "text": "Lord was a title of nobility, deity, and, in past times, a military rank, such as a Jedi Lord. The female version of Lord was Lady. It was in common use among the Sith, usually used in lieu of Darth when formally referring to Dark Lords."}, {"tag": "p", "text": "During the New Sith Wars, various high-ranking Jedi also held the rank, including Hoth, Saleeh, Gale and Valenthyne Farfalla."}, {"tag": "p", "text": "As a title of nobility, it was recognized by many different worlds as a position of power and authority. Many societies incorporated the title in their way of life and/or as a part of their governments. Several examples include:"}, {"tag": "p", "text": "It was considered a great honor to be granted the title of Lord by Emperor Palpatine. During the rule of the Galactic Empire, the Emperor would elevate several loyal servants to the rank and title of Lord for their service to him or for performing a great deed in name of the Empire. The members of the Imperial Ruling Council were addressed as such."}, {"tag": "p", "text": "As a title of deity, \"Lord\" was used in various swear words and other phrases. For example, Leia Organa was known to use the phrase, \"Lord knows how many....\""}, {"tag": "h2", "text": "Lords of the Tapani Sector"}, {"tag": "p", "text": "Lord was one of the titles of nobility used by the ruling class of the Tapani sector. Higher than the rank of Baron, Lords and Ladies were from the most powerful families in a noble house. They controlled significant House assets, and often took on positions of leadership such as running businesses or commanding the House militia. Lords and Ladies were wealthy, and maintained spacious palaces on both their homeworlds and Procopia. The High Lord of a House was appointed from the ranks of a House's Lords."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "\"Lord\" as used by Leia may be the title of an Alderaanian deity."}, {"tag": "p", "text": "Apparently it served as a form of address for the Speaker of the Galactic Senate; in the Revenge of the Sith novelization, Anakin Skywalker addresses Mas Amedda as \"Lord Speaker.\""}, {"tag": "p", "text": "Leia was known as \"Lady Vader\" among the Noghri, as she and her family were revered figures in their society."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "See also"}, {"tag": "h2", "text": "Notes and references"}]}