{"url": "Lore_Keeper", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Lore Keepers"], "nodes": [{"tag": "h1", "text": "Lore Keeper"}, {"tag": "p", "text": "A Lore Keeper was a broad term for a Jedi Knight who had pursued the school of thought that gave one the title of Jedi Consular within the Jedi Order. Consisting of archivists, historians, and librarians, the Lore Keepers maintained the repositories of knowledge that allowed the Order to grow and learn, calling on wisdom from the Jedi Masters long since past, and contributing knowledge from the scholars of the future."}, {"tag": "h2", "text": "Overview"}, {"tag": "p", "text": "One of the oldest ranks in the Jedi Order, the first Lore Keepers served on Tython before the rise of the Galactic Republic. The stewards of knowledge accumulated by Jedi High Council member Rajivari, the Lore Keepers tended to the first incarnation of the Jedi Archives; the Fount of Rajivari. As the Order grew and moved to Ossus and elsewhere the Lore Keeper position became more defined. Divided into three distinct roles within the Order, the Lore Keepers could be found at the Jedi facilities on Coruscant, Telos IV, Kamparas, and Obroa-skai. Making up the Librarian's Assembly at the Jedi Temple of Coruscant, they oversaw the operation of the Jedi Archives and answered directly to the Council of First Knowledge. The leader of the Order's Educational Corps was the Chief Librarian, overseer of the Archives and protector of its knowledge. Provided with personal chambers adjacent to the Archives, the Chief Librarian worked closely with the Caretaker of First Knowledge, the leader of the Council of First Knowledge. On occasion, such as in the time following the Ruusan Reformation with Master Restelly Quist, the Chief Librarian also held the title of Caretaker. Quist's predecessor, Barra-Rona-Ban was the first Chief Librarian following the Reformation and one of the only Jedi to meet one of the two remaining Sith Lords and survive. Even before Master Ban, the Kel Dor historian Gnost-Dural oversaw the recollection of data within the Temple Archives of Tython following the Sacking of Coruscant. The final Chief Librarian, former Jedi High Council member Jocasta Nu died among her beloved books when Darth Vader executed Operation: Knightfall on behalf of Supreme Chancellor Palpatine."}, {"tag": "p", "text": "Following the reformation of the Order under Grand Master Luke Skywalker, Tionne Solusar took up the mantle of Chief Librarian and restored the Stacks and added information missing from the time of the Galactic Civil War. Master Solusar eventually stepped down from this role and the title was given to Master Markre Medjev."}, {"tag": "h3", "text": "Jedi archivists"}, {"tag": "p", "text": "The Jedi archivists were tasked with the tedious job of storing all text in the Archives and library. Translating all data in to various common tongues, the archivists would store and sort the information gathered into one of the four halls of the Archives. Specializing in the storage, organization and retrieval of knowledge, they would receive and archive knowledge so that others might learn, and in the process expand their own awareness of the galaxy. Delving into many areas of study, allowing the Force to guide them to their areas of specialty, these Jedi rarely saw combat, and were only sent on data-retrieval missions, or to accompany diplomats in need of a constant stream of information."}, {"tag": "p", "text": "The Jedi archivists were at their height in times of peace, flourishing in their libraries, and growing the Archives to astounding proportions. However, during the Clone Wars, they became few in number. The older Jedi believed that the younger Jedi at the time did not have the patience to become archivists, instead training to become Jedi Guardians. One of the few potential archivists of the era was Padawan Olee Starstone; however, Order 66 interfered in her training and progress."}, {"tag": "h3", "text": "Jedi librarians"}, {"tag": "p", "text": "Walking the halls of the library and Archives, the Jedi librarians were the main interface with the collection of knowledge stored at the Temple and its satellite facilities. Interacting with visiting Jedi and assisted by small droids, a librarian could help locate any resource at a moments notice. Some librarians also studied as historians, such as Madame Jocasta Nu in the latter days of the Republic."}, {"tag": "h3", "text": "Jedi historians"}, {"tag": "p", "text": "Jedi historians, or chroniclers, were members of the Librarian's Assembly specializing in research not only into the history of the Jedi, but also the early beginnings of the Republic. The historians were responsible for the oversight and analysis of the Holocrons, led by the Caretaker of First Knowledge, the leader of the Council of First Knowledge."}, {"tag": "p", "text": "Historians of the Old Republic sometimes wore special robes based on Ansatan design, signifying an elevated learning to that of their peers. Over the centuries, Madame Nu, her ancient predecessor Atris, and the reformed Order's first historian, Tionne Solusar were known to dress in these patterns."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}