{"url": "Lorian_Nod", "categories": ["Category:Legends articles", "Category:AgriCorps members", "Category:Humans", "Category:Jedi Consulars", "Category:Jedi trainees of the Jedi Order", "Category:Males", "Category:Redeemed Jedi"], "nodes": [{"tag": "h1", "text": "Lorian Nod"}, {"tag": "p", "text": "Lorian Nod was a male Human Jedi serving the Jedi Order and the Galactic Republic as a member of the Agricultural Corps following his expulsion from the Coruscant Jedi Temple's academy in the decades preceding the Clone Wars. Nod eventually turned away from the Order to become a pirate on the Outer Rim of the galaxy before achieving elected office on the planet Junction V."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "A Force-sensitive Human born on the planet Junction V in 102 BBY, Lorian Nod was trained in the ways of the Force by the Jedi Order at the Coruscant Jedi Temple. As an Initiate in the Temple's academy, Nod was sorted into a clan of his peers where he became quick friends with fellow student, Dooku. As a student, Nod possessed no personal lightsaber, and had plans on becoming a Jedi Consular upon achieving knighthood. Training for over a decade in each other's company, Nod was jealous of Dooku when he was selected in 89 BBY by Jedi Master Thame Cerulian to continue his training as a Padawan. In the days following Dooku's apprenticeship, the pair investigated Cerulian's private chambers while the Corellian Jedi was away on a mission."}, {"tag": "p", "text": "Eager to learn about the Jedi Master, the pair discovered several documents and journals, including one which contained information drawn from a Sith holocron that was stored in the Holocron Vaults of the Temple Archives. Fascinated by the device, Nod attempted to convince Dooku to help in gain access to the device. Citing the regulations of the Archives and the Vaults, Dooku refused his friend and chastised him for broaching the subject. Undeterred, Nod slipped into the Vaults and stole the Dark Holocron in secret, accessing its hidden knowledge within his own chambers. Sickened by the dark side of the Force which was imbued in the holocron, Nod came to Dooku for help. As Dooku scolded his friend for stealing the ancient artifact, Jedi Councilor Oppo Rancisis was drawn to the darkness emanating from the room and confiscated the holocron. Nod accused Dooku for stealing the holocron and Dooku, who, shocked by the accusation, was unable to say anything."}, {"tag": "p", "text": "In the following days, the Council placed the two former friends on opposing teams during a group exercise through Coruscant. The teams, tasked with obtaining a muja fruit from the Old Galactic Market in the Senate District, eventually crossed paths and Dooku and Nod engaged in a fight. Upon returning to the Temple, the Council called the pair to a meeting, during which Dooku, who was infuriated with his friend's betrayal, explained that Nod was the only one to seek out the holocron and he alone bore the guilt. With this knowledge, the High Council deemed Nod unfit to continue along the Jedi Path at the Temple not for stealing the holocron, but for lying and implicating a friend. Dooku would maintain his apprenticeship with a mild warning to watch his pride."}, {"tag": "p", "text": "Following the High Council's decision, the Council of Reassignment placed Nod in the Agricultural Corps, a division of the Order's Service Corps, where the failed Jedi would stay for the next thirteen years. Eventually, Nod abandoned his post with the Service Corps and became the leader of a band of space raiders along the Outer Rim."}, {"tag": "p", "text": "In 76 BBY, Nod was secretly hired by the Sith Lord Darth Tenebrous to kidnap Senator Blix Annon. During the kidnapping, he encountered an older Dooku, who by then had obtained the rank of Jedi Knight and taken on the training of sixteen-year-old Qui-Gon Jinn. Nod managed to capture the two Jedi on Von-Alai but was unable to keep them; their escape nearly resulted in Nod's death after a brief encounter with an enraged Dooku. Before Dooku could kill him, Padawan Jinn calmed his master and Nod was arrested, tried, and sent to prison."}, {"tag": "p", "text": "Released around 52 BBY after many years imprisoned, Nod returned to his homeworld where he rose to become leader of a group called the Guardians, a group meant to protect the world from the rogue government of Delaluna, Junction V's moon. With the people in fear of a destructive weapon called the Annihilator, which Nod propagated as being in the possession of the Delalunan government, Nod assumed control of the planet's government for eight years. It was not until Qui-Gon Jinn, now a Master, and his own apprentice Obi-Wan Kenobi were passing through Junction V on a stopover during a mission and learned about the supposed threat of the Annihilator that Nod's power was questioned. The two Jedi soon discovered that Nod's rule was built on lies and propaganda and with the help of a woman named Cilia Dil, the Jedi managed to overthrow the leader and once more send him to prison."}, {"tag": "h3", "text": "Separatist crisis"}, {"tag": "p", "text": "Following a prison sentence of nearly two decades, Nod reconsidered his life and changed his outlook on things. Once released, he returned to Junction V to truly help out its citizens rather than do things for his own gain. Elected through a proper election, Junction V, along with Delaluna and the Bezim and Vicondor systems, created the Station 88 Spaceport under Nod's governance. As the lives of his constituents began to prosper, the galaxy broke out in all out war, as the Galactic Republic and the Confederacy of Independent Systems began the Clone Wars. Several weeks after the start of the war, the Confederacy sought to claim the Station 88 spaceport for themselves, given its strategic Mid Rim location. Dooku, now the Sith Lord Darth Tyranus, contacted Nod, telling him that with his support, he could convince the leaders of the other worlds controlling the spaceport to join the Confederacy of Independent Systems. However, Nod sought to do the exact opposite, and contacted Grand Master Yoda of the Jedi Order, hoping to redeem himself for all of the terrible crimes he had committed. Nod informed the Order that he would be attending a meeting with the other rulers and Dooku on the Separatist-held world of Null in which he would formally decline the Confederacy's offer."}, {"tag": "p", "text": "The High Council sent Obi-Wan Kenobi, now a Knight, and his apprentice, Anakin Skywalker to Null to meet with Nod in secret as a way to spy on Dooku during the summit. Shortly after they arrived, the leader of Delaluna, Samish Kash, was assassinated by the Confederacy as a means to draw out the Jedi which Dooku suspected were in attendance. Kenobi, uneasy with the forced alliance with Nod because of their past encounter suspected that Nod was indeed a turncoat and a Separatist sympathizer. After accusing Nod, Kenobi learned that the assassination attempt had been botched and that Kash was indeed alive. At the conference, the rulers of Junction V and its neighbors announced that they would not join the Separatist cause, causing Dooku to order their deaths. As the droids prepared to assassinate the leaders, the Jedi arrived to cut down the Separatist soldiers and save the leaders. Noticing Dooku flee during the battle, Nod followed his former friend into a secret hangar where he attempted to stop the Separatist leader from escaping. Sensing Nod's approach, Dooku stood in wait and impaled his former colleague through the back with his crimson lightsaber, killing Nod."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}