{"url": "Lorjan_Sakku", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Individuals of unspecified species", "Category:Jedi trainees of the Jedi Order", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lorjan Sakku"}, {"tag": "p", "text": "Lorjan Sakku was a male Jedi Padawan who was apprenticed to a Cerean Jedi Master millennia before the conflict known as the Cold War. After Lorjan's brother, Lyhesh, went insane and threatened the Jedi Order, Lorjan redeemed his brother but died in the process. Lorjan's sacrifice was remembered by his Master, who named her deceased Padawan the \"Barsen'thor,\" which translated to \"Warden of the Order\" from her native Cerean language. The title was adopted by the Jedi Order for future use, and it was awarded to exceptional members of the Order."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lorjan Sakku was a male individual who lived thousands of years before the Cold War between the Galactic Republic and the reconstituted Sith Empire and had a brother named Lyhesh, with both brothers being Force-sensitive. Lorjan was eventually discovered and chosen by the Jedi Order to be trained as Jedi, becoming a Padawan to a Cerean female Jedi Master. At one point, Lorjan's brother became a victim of an attempted poisoning. Lyhesh survived, but the incident drove him insane, and the man became a threat to the Jedi Order."}, {"tag": "p", "text": "Lorjan bravely defended the Order against his own maddened brother, successfully redeeming Lyhesh and allowing him to serve the Force again, but Lorjan had sacrificed his life in the process. In recognition of his actions, Lorjan's Master posthumously bestowed upon him the title of \"Barsen'thor\"—which translated to \"Warden of the Order\" from her native Cerean language. In honor of Lorjan's sacrifice, the Jedi Order retained the title and awarded it to exceptional Jedi, although only two individuals had received it by the time of the Cold War."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lorjan Sakku was a selfless individual who risked his life to stop his own brother from harming the Jedi. Believing in the possibility of redemption for his sibling, Lorjan successfully brought Lyhesh back from his poison-induced delirium, even though it had cost him his life. Lorjan's Master then commemorated her Padawan with the title of Barsen'thor, and the Jedi Order adapted the title for future use, awarding it to Jedi who displayed skill and wisdom comparable to Lorjan's."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Lorjan Sakku was a Force-sensitive individual and a member of the Jedi Order. However, before he was able to finish his training with his Master, he died while trying to stop his brother, who had become a threat to the Jedi."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lorjan Sakku was first indirectly mentioned in the 2011 massively multiplayer online role-playing game Star Wars: The Old Republic, developed by BioWare. Although his name was not revealed, the game established that the playable Jedi Consular character was only the third person in the history of the Jedi Order to carry the title of Barsen'thor. In 2012, Star Wars: The Old Republic Encyclopedia established Sakku's name and gender in an entry on Jedi ceremonial titles, although his species was not established."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}