{"url": "Lorka_Gedyc", "categories": ["Category:Legends articles", "Category:Death Watch members", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Lorka Gedyc"}, {"tag": "p", "text": "Lorka Gedyc was a Mandalorian warrior of Clan Gedyc, and a member of the radical Mandalorian splinter group known as the Death Watch. By the time of the Galactic Empire's foundation in 19 BBY, Gedyc had become the organization's most recent leader as it continued to exist in hiding, moving to ally Death Watch with the Empire."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Following the end of the Clone Wars and the rise of the Galactic Empire in the year 19 BBY, Gedyc had become the leader of the Death Watch. Gedyc thought highly of the Mandalorians of ages past, who had conquered star systems and forged an empire that spanned across vast swaths of the galaxy. The state of the greatly diminished Mandalore sector following the defeat of Mandalore the Ultimate was abhorrent to Gedyc, who considered Mandalorian holdings in the era to be little more than an assortment of \"dirtball\" worlds, and felt that the Mandalorians' penchant for mercenary and bounty hunting work was tantamount to scrambling for crumbs."}, {"tag": "p", "text": "Seeing this as an opportunity to restore the glory the Death Watch leader believed the Mandalorians had lost, Gedyc allied Death Watch with the Galactic Empire, and the Death Watch soldiers Dred Priest and Isabet Reau assisted the Imperials in establishing their garrison on the Mandalorian homeworld of Mandalore, just outside the planetary capital city of Keldabe, in the failed adventure park known as the \"City of Bone.\" Priest thought highly of Gedyc and the Death Watch leader's plans, and like Gedyc, saw the Empire as an opportunity to re-establish the Mandalorians' former power."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lorka Gedyc was first introduced to Star Wars canon in the 2009 novel Imperial Commando: 501st, the fifth entry in author Karen Traviss' Republic and Imperial Commando series."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}