{"url": "Lorrd_Artifact", "categories": ["Category:Legends articles", "Category:Sith artifacts"], "nodes": [{"tag": "h1", "text": "Lorrd Artifact"}, {"tag": "p", "text": "The set of tassels later designated the Lorrd Artifact were created by Lumiya in the archaic pattern-based languages from different species and cultures found throughout the galaxy. It contained both Jedi and Sith morals. It was discovered by Wedge Antilles and Tycho Celchu who passed them on to Jaina Solo and Zekk right after the attack at the Kuati Toryaz Station, in which drugged assassins were brought to the station to kill the Jedi and politicians, both from Corellia and the Galactic Federation of Free Alliances, to sabotage peace talks aimed at stabilising the Corellia-Alliance conflict. Luke Skywalker assigned Jaina to continue the investigation of the artifact, but Jacen felt a Force connection to the tassels. Without informing Luke, Jacen convinced Jaina that he should be the one to follow up on the clue."}, {"tag": "p", "text": "Through the Force, Jacen was able to decipher one tassel himself, but he needed help from experts in the field of tactile communication to translate the rest. This meant bringing the tassels to professor Heilan Rotham on Lorrd."}, {"tag": "p", "text": "While waiting for Rotham to complete her translations, Jacen's companion Ben Skywalker spotted a shuttle that had been seen fleeing Toryaz Station as the attacks were occurring. Covert surveillance of the shuttle led them to a woman calling herself Brisha Syo. They failed to immediately recognize Syo as Dark Lady of the Sith Lumiya, who knew that any investigation would eventually lead to professor Rotham on Lorrd."}, {"tag": "p", "text": "Though the tassels were only the means to an end of Lumiya and Vergere's decades long plan to lure Jacen to the dark side, once he decided to take the path of the Sith, the prophecies in the tassels served as a sort of guideline for the steps he must take to ascend as a Sith Lord."}, {"tag": "p", "text": "Each tassel contained a message encoded in a different form of tactile communication. They are given below in the order translated, which was mostly from top to bottom—except for the last, which was translated out of sequence by Jacen himself once Rotham was done reading off the rest."}, {"tag": "p", "text": "As Jacen came to accept this destiny, he understood many of the events prophesied could be accomplished through a number of widely different ways. However, Lumiya was unwilling or unable to give him definitive answers."}, {"tag": "p", "text": "An alternate order of the Tassels was later revealed, apparently following the sequence in which Jacen fulfilled the prophecies:"}, {"tag": "p", "text": "Some of the prophecies, such as \"he will make a pet,\" were not fulfilled prior to his death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}