{"url": "Lorth_Needa/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Death Squadron personnel", "Category:Humans", "Category:Imperial Navy captains of the Galactic Empire", "Category:Males", "Category:Republic Navy officers"], "nodes": [{"tag": "h1", "text": "Lorth Needa"}, {"tag": "p", "text": "Lorth Needa was a Human male fleet officer in the Republic Navy during the Clone Wars and the Imperial Navy during the Galactic Civil War. He served as lieutenant commander of the Republic Carrack-class cruiser Integrity in Home Fleet Strike Group Five of the Coruscant Home Fleet during the Battle of Coruscant, in which he was prepared to destroy General Grievous's flagship, the Invisible Hand, should the general be unable to prove that Supreme Chancellor Palpatine was being held captive aboard the warship. During the Imperial era, Needa was promoted to captain of the Imperial II-class Star Destroyer Avenger by Fleet Admiral Kendal Ozzel and assigned to Darth Vader's Death Squadron, often being tasked with following up on certain leads regarding the location of the Rebel Alliance's hidden headquarters. Needa served as one of Ozzel's advisors, earning him the distrust of both Vader and Emperor Palpatine."}, {"tag": "p", "text": "In the aftermath of the Battle of Hoth, where General Maximilian Veers's assault on Echo Base forced the Rebels into fleeing, Needa and the Avenger were charged with capturing Han Solo's YT-1300 light freighter, the Millennium Falcon, and her crew. The Falcon outran the pursuing Star Destroyers and hid within the Hoth asteroid field, but the Avenger plunged into the field, intent on completing its assignment. The search proved to be hazardous as the warship sustained damage, and its gunners were forced to fire on the asteroids rather than remain alert for the elusive freighter. Nevertheless, when the Falcon emerged from the maelstrom, the Avenger was right behind the freighter. Before Needa could detain the craft, Solo charged the Avenger and landed on a blind spot on the aft of the destroyer's conning tower; as a result, the destroyer's sensors could not find the vessel. Believing to have failed his mission, Needa went to the Star Dreadnought Executor to personally apologize to Vader. The Dark Lord of the Sith accepted his apology after making sure that the captain would never fail again. Two Imperial Navy troopers then dragged Needa's lifeless body away."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Republic Navy service"}, {"tag": "p", "text": "A Human male from Coruscant, Lorth Needa was a veteran command officer, having served in Strike Group Five of the Coruscant Home Fleet during the Clone Wars. In the Battle of Coruscant, in which the Confederacy of Independent Systems launched a surprise attack on the Republic capital of Coruscant, Lieutenant Commander Needa served as commanding officer of the Carrack-class cruiser Integrity, which was part of the Republic defenses. Togather with two other Carrack-class cruisers and A Dreadnaught- Class heavy cruiser, Needa trapped the Providence-class carrier/destroyer Invisible Hand as it was trying to escape, and demanded the surrender of its commander, the cyborg Separatist General Grievous. During this encounter, Needa did not believe the general's claims that Supreme Chancellor Palpatine, leader of the Republic, was aboard the Invisible Hand. The Republic commander told Grievous via hologram that he had ten minutes to prove his claim—if he could not, the ships of Strike Group Five would open fire on the Separatist flagship and destroy it. Grievous did not surrender, but the Supreme Chancellor was rescued by Jedi Generals Anakin Skywalker and Obi-Wan Kenobi."}, {"tag": "p", "text": "The Invisible Hand was severely damaged by Republic fire, and while Grievous fled, the two Jedi began to pilot the remains of the Hand to crash-land on Coruscant. Needa watched, greatly impressed, as Skywalker skillfully maneuvered the ship into the capital world's atmosphere. The lieutenant commander informed Jedi Master Yoda via hologram of Kenobi and Skywalker's success; he also told the diminutive Jedi to have the surface-defense systems stand down and a flight of emergency firespeeders deployed to attempt to douse the fires on the Hand's hull. Yoda thanked him for his valiant assistance during the battle, and as the Jedi's hologram faded away, Needa watched helplessly as the Hand continued to fall, doubting that Skywalker would be able to succeed. Though the battle had been won, he feared that should the Chancellor perish, the war would be lost. Nevertheless, Skywalker succeeded in his endeavor, and the Chancellor survived unharmed."}, {"tag": "p", "text": "Shortly thereafter, Palpatine declared himself Emperor and reformed the Republic into the first Galactic Empire, declaring the Jedi Order an enemy of the state. As part of the subsequent Imperialization, the Republic Navy was reorganized into the Imperial Navy. Two weeks into Palpatine's New Order, the Emperor and his Sith apprentice Darth Vader—formerly known as Anakin Skywalker—spoke before a gathering of naval officers and announced that they were all required to serve the navy in the unstable times that would follow the Clone Wars, and that any who dissented would be purged from the military."}, {"tag": "h3", "text": "Captain of the Avenger"}, {"tag": "p", "text": "Needa continued to serve in the navy, eventually rising to the rank of captain. Fleet Admiral Kendal Ozzel, commander of the Star Dreadnought Executor and the Imperial Death Squadron, placed Needa in command of the Imperial II-class Star Destroyer Avenger, a position previously held by Captain Ferdas. The Avenger, having gone through many captains within its history, was noted to be an unlucky ship when it came to its commanders. As a member of Death Squadron—Vader's personal fleet—Needa aided in the mission to discover and destroy the Rebels' hidden headquarters. While serving in the unit, Needa gained a reputation for efficiency in quelling uprisings in the Outer Rim Territories, and Admiral Ozzel assigned Avenger to the \"point\" position in Death Squadron. Needa became one of Ozzel's closest advisors."}, {"tag": "p", "text": "The Galactic Civil War between the Empire and the Rebel Alliance had increased in magnitude since the destruction of the Empire's planet-destroying Death Star I battlestation at Yavin Prime, and the Empire had become determined to find and destroy the Rebels' new base of operations. To speed up this search, Admiral Ozzel often sent Needa and the Avenger off on missions independent from the rest of the Death Squadron to check on certain leads relating to the Rebels' hidden command base. Regardless of Ozzel's trust in the Avenger's captain, Darth Vader and Emperor Palpatine felt quite different. The two Sith Lords distrusted Ozzel and all of his advisors, and Vader would execute any of them for the simplest of mistakes."}, {"tag": "p", "text": "Around 0.5 ABY, a group of Rebels trapped aboard the Star Destroyer Desolator, heading for the Rebel base on the planet Isis, managed to replace Isis's coordinates in the warship's navicomputer with those of the rogue star G-138. As a result of the sabotage, the Desolator collided with G-138 and was destroyed. The Imperial News Bureau claimed the ship's destruction was the result of a hyperdrive malfunction, denying that there was any Rebel involvement. Needa was quoted in the Bureau's announcement, saying such thoughts of Rebel sabotage were \"ludicrous.\""}, {"tag": "p", "text": "As the hunt for the Rebels' headquarters continued, Needa was responsible for sending out Viper probe droids to the Tokmia and Allyuen systems to aid in the search, in conjunction with the Star Destroyer Stalker. Ultimately, a probe droid launched from the Stalker discovered the existence of a planetary shield generator on the ice world of Hoth. Though Admiral Ozzel was skeptical of the find, Darth Vader insisted that the generator marked the location of the Alliance's command base. The Sith Lord ordered Death Squadron into hyperspace with the sixth world of the Hoth system as their target."}, {"tag": "h3", "text": "Battle of Hoth and the hunt for the Millennium Falcon"}, {"tag": "p", "text": "Before the Battle of Hoth could even commence, Ozzel died at Vader's hand for his mistake in bringing Death Squadron out of hyperspace too close to Hoth, a move that alerted the Rebels to the Imperials' presence and allowed them to raise their shield and begin the evacuation of Echo Base. While the battle raged on between the Rebels and General Maximilian Veers's Blizzard Force of AT-ATs and AT-STs on the planet below, the fleet of Star Destroyers was charged with preventing the fleeing GR-75 medium transports and other Rebel craft from escaping. Seventeen of the thirty GR-75 transports were destroyed by the Imperial fleet, but destroyers such as Captain Xamuel Lennox's Tyrant were disabled by the Rebels' planetary ion cannon. As the Imperials claimed victory, the YT-1300 light freighter Millennium Falcon, piloted by the smuggler Han Solo and his Wookiee co-pilot Chewbacca, escaped from Echo Base's main hangar with Princess Leia Organa of Alderaan aboard. Needa and the Avenger were charged with the pursuit and capture of the Falcon and its crew."}, {"tag": "p", "text": "The Avenger did just that, and the Falcon, with an inoperable hyperdrive, was unable to flee the system. However, Solo's light freighter outmaneuvered the Star Destroyer and nearly caused it to collide with another pursuing destroyer. After chasing the Falcon into the Hoth asteroid field, the Avenger lost track of the freighter when it sought shelter in a cave on one of the larger asteroids. Nevertheless, the destroyer ventured into the asteroid field at Vader's command. The Avenger suffered damage while it searched for the elusive Falcon, and the gunners stationed onboard were forced to focus their attention on incoming asteroids rather than looking out for the YT-1300 freighter. While present during a holographic conference of twenty battleship commanders aboard the Executor, Needa informed the Dark Lord of the Sith that it had been some time since the Millennium Falcon had appeared on the Avenger's sensors. Needa, his hologram faded and disrupted by static, noted that, given the amount of damage that the Imperial fleet had sustained due to asteroid collisions, the Falcon had to have been destroyed. However, Vader believed otherwise, and he was set on capturing the freighter regardless of the fleet's losses."}, {"tag": "h3", "text": "Failure and death"}, {"tag": "p", "text": "The Millennium Falcon eventually reappeared after discovering that the alleged cave it had hidden in was in fact the mouth of a giant space slug. The Avenger managed to spot the freighter as it attempted its escape, and Needa had a priority signal sent to the Executor to inform Ozzel's replacement Admiral Firmus Piett that the Falcon was about to be captured. A link was established on the Star Dreadnought's bridge, allowing those assembled—including a group of bounty hunters that Vader had gathered to hunt down the Falcon and her crew—to listen to Needa as he gave orders during the pursuit. While the Avenger pursued the Falcon out of the asteroid field and into the neighboring Anoat system, the YT-1300 moved into what Needa had assumed to be attack position. Rushing to the viewports, Needa watched with his horrified command crew as the Falcon charged the bridge, setting off alarms throughout the Imperial warship. Needa asked if their deflector shields were up before commenting that Solo must have been insane to attempt to ram the destroyer head-on."}, {"tag": "p", "text": "Needa and his crew dropped to the floor in terror, but Solo veered his ship up sharply, narrowly missing the Star Destroyer's bridge. As he rose from the deck, Needa ordered his crew to track the ship, wondering if they would attempt another pass. The Avenger's logistics officer, Commander Nemet, reported that the Falcon had vanished from their sensors—unknown to the Imperials, Solo had cut his ship's power and landed on a blind spot on the conning tower of the Avenger. Needa dispelled the idea that the Falcon may have possessed a cloaking device, and the deck officer suggested that the freighter had simply gone into hyperspace. The captain, both angry and confused, wondered why they would have attempted such a daring maneuver only to flee the system. Flabbergasted, Needa wondered how the ship could have escaped him. Seconds later, communications officer M'Kae reported that Vader demanded an update on the pursuit."}, {"tag": "p", "text": "Needa ordered his ship to rendezvous with the Executor so he could personally apologize for losing Vader's prey, believing that it was the honorable thing to do. However, he had the Avenger perform one last sensor sweep of the area for their elusive quarry—to no avail. Needa ordered a TIE/sh VIP shuttle to be prepared for his visit to the Executor, departing the Avenger for the last time. Upon arriving, he immediately went to the Star Dreadnought's bridge, where the captain met with Vader. The captain apologized to the Sith Lord, but Vader lost his patience, calling the man inept for failing to capture a mere group of outlaws. Needa knew that Vader's anger—combined with his own failure—would lead to a certain death, so the captain begged for his life. But Vader noted that the Empire had no use for Needa's ineptness; having finished berating the captain, Vader telekinetically throttled him to death as he had done to Kendal Ozzel earlier. Vader then formally accepted the man's apology, and Needa's body was dragged from the bridge by two Imperial Navy troopers."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "As a consequence of Lorth Needa's failure, members of the Needa family were purged from the Imperial military on Darth Vader's orders. His first cousin once removed, Virar, had been attending the Imperial Academy during the Battle of Hoth, and as he was not ambitious, he had been allowed to live. Many family members, from Virar's grandparents to cousins, however, were killed. Virar became the commander of one of Coruscant's orbital mirrors, OSETS 2711. His subordinates, including Cadet Pedetsen, had suggested—without any concrete proof—that Lorth had failed in capturing the Millennium Falcon because he had sympathies to the Rebel Alliance. Pedetsen stated that Virar had been placed on OSETS 2711 because the Empire could not prove Lorth's alleged Rebel loyalties. Virar was even willing to believe this."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lorth Needa was an efficient commander and could be ruthless at times, a trait he exhibited during the Battle of Coruscant, when he threatened to destroy the Invisible Hand should Grievous choose not to surrender. Later, as Skywalker maneuvered the crumbling Hand into Coruscant's atmosphere for a landing, Needa watched in both awe and terror, impressed with Skywalker's great skill but also fearing for the Chancellor's life. A disciplined officer, Needa stood expressionless as the events unfolded, but he still ached in fear, clenching his hands tightly. Though not religious, he asked the Force that should the remnants of the Hand explode, all aboard would be granted, at the very least, a quick death."}, {"tag": "p", "text": "Needa was an able leader, but both Vader and the Emperor harbored suspicions about him. The captain showed a degree of concern for both his crew and Vader's fleet when he suggested to the Dark Lord that they pull out of the asteroid field during the search for the Millennium Falcon, but Needa's failure in capturing Solo's freighter cemented, in Vader's mind, that the Avenger's captain was inept. He had been overconfident in his pursuit of the Millennium Falcon from Hoth, and this factored into his execution by Vader. Needa had decided that personally apologizing to the Dark Lord was an honorable thing for a man in his position to do, thus also sparing his ship's crew the Sithlord's wrath; nevertheless, the captain begged for his life as Vader prepared to kill him."}, {"tag": "p", "text": "In addition to his native Basic, Needa was able to speak Ryl, the native language of the Twi'leks of Ryloth. When it came to the policies of the New Order, Needa had taken specialized courses to further understand the many facets of Palpatine's doctrine. The captain also possessed a considerable knowledge of the workings of the Imperial Navy that he was in service to."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Portrayal and name"}, {"tag": "p", "text": "Lorth Needa first appeared in the novelization of 1980's The Empire Strikes Back. Known only as \"Captain Needa\" in the film, he was portrayed by actor Michael Culver. In the radio adaptation of the film, Needa was voiced by Nicholas Kepros. Needa was not given a first name until 1996's X-Wing: Wedge's Gamble, when his first cousin once removed, Virar, revealed his first name to be \"Lorth.\""}, {"tag": "p", "text": "In The Empire Strikes Back, a blooper occurred after Vader executed Needa. When the Navy troopers begin to drag away his body, Culver visibly locked his legs in such a way as to help those portraying the Navy troopers to stand him up easier."}, {"tag": "h3", "text": "Continuity issues"}, {"tag": "p", "text": "There is some uncertainty over the identity of the Star Destroyer that launches the probe droid that lands on Hoth. Both Galaxy Guide 3: The Empire Strikes Back and Star Wars: The Visual Dictionary designate the ship as the Avenger, presumably based on dialogue between Needa and a subordinate that was ultimately cut from the radio adaptation of The Empire Strikes Back. However, the Star Wars Customizable Card Game, the Star Wars Encyclopedia, and Star Wars: Behind the Magic all identify the warship as the Stalker. In an attempt to clarify this issue, 2009's The Essential Atlas states that the Avenger and the Stalker launched probe droids to the Allyuen, Tokmia, and Hoth systems—though it doesn't state which destroyer launched probes to which systems. This article assumes that the Stalker launched the probe droid that discovered Echo Base."}, {"tag": "p", "text": "In Star Wars 40, Al Williamson and Carlos Garzon used reference photography of Needa's death for Admiral Ozzel's execution."}, {"tag": "p", "text": "In the novelization of The Empire Strikes Back, Needa and the Avenger take the place of Captain Xamuel Lennox and the Tyrant in the scene where the Rebels' ion cannon fires on a Star Destroyer approaching Hoth. However, while the ship is merely disabled by the ion blasts in the film, the novelization describes the cannon fire hitting the destroyer's conning tower, setting off explosions that propel the out-of-control warship into the void. Regardless, Needa and the Avenger reappear in later scenes."}, {"tag": "p", "text": "The Empire Strikes Back Storybook offers an alternate interpretation of Needa's execution that comes into conflict with the dialogue featured in the radio adaptation. In this version, the captain merely states that the Millennium Falcon has escaped despite his best efforts, before being immediately executed by Darth Vader. The radio adaptation, on the other hand, presents a dialogue that occurs between the two men before Vader telekinetically kills Needa. This article assumes that the radio adaptation illustrates the correct version of the scene."}, {"tag": "h3", "text": "Possible appearance"}, {"tag": "p", "text": "In the non-canon Star Wars Infinities: The Empire Strikes Back 1, when the Falcon and crew are escaping Hoth during the Imperial assault, Solo charges the bridge of a Star Destroyer, lands on its conning tower immediately afterward, and drifts away along with the garbage that the destroyer releases before jumping to hyperspace—a course of events practically identical to Solo's maneuver against the Avenger in the film. Neither the captain nor the destroyer are named in the comic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}