{"url": "Lost_Ones", "categories": ["Category:Legends articles", "Category:Coruscanti", "Category:Criminal organizations"], "nodes": [{"tag": "h1", "text": "Lost Ones"}, {"tag": "p", "text": "The Lost Ones was a street gang that lived and operated in the undercity of Coruscant. It was composed of juvenile delinquents who had run away or been abandoned by their parents because of their bad behavior. Chief among them was Norys, a youth known for his reputation as a bully. They were the rivals of the Blank Look Gang and possibly at some point hired spacers to prevent the blankers from stealing a collection of antique Twi'lek pots from the Galactic Museum in CoCo Town."}, {"tag": "p", "text": "Members of the Lost Ones marked their territory with a symbol resembling a targeting cross surrounded by a triangle. Because normal, intact weapons were hard to come by in Coruscant's undercity, they resorted to arming themselves with weapons that had been cobbled together from sharp pieces of scrap."}, {"tag": "p", "text": "After the botched training of the Solo twins and Lowbacca, Brakiss and the Great Leader of the Second Imperium decided that it would be best to recruit disadvantaged youths instead of the prominent targets that they had kidnapped initially. Given that very few would care about the disappearances and those that did care had very little recourse to the law, this plan had many advantages."}, {"tag": "p", "text": "The members of the Lost Ones fit that profile. After he was captured, Zekk was used by the Shadow Academy to convince them to help fill the ranks of the Second Imperium. Those who were Force-sensitive would be trained to be Dark Jedi. Those who were not still were useful because they knew their way around a planet that was considered to be the heart of the New Republic. Such knowledge could be turned to the purposes of espionage and sabotage. The latter group would be trained as elite stormtroopers and TIE pilots."}, {"tag": "p", "text": "Former members of the Lost Ones participated in the assault on the Jedi Praxeum on Yavin 4. Their fate after that is unknown though they were either killed or captured."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}