{"url": "Lost_Tribe_of_Sith_emergence", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Conflicts of the Core Worlds", "Category:Conflicts of Hutt Space", "Category:Conflicts of the Inner Rim", "Category:Conflicts of the Outer Rim Territories", "Category:Conflicts of Wild Space", "Category:Lost Tribe of Sith emergence", "Category:Sith"], "nodes": [{"tag": "h1", "text": "Lost Tribe of Sith emergence"}, {"tag": "p", "text": "The emergence of the Lost Tribe of Sith marked the entrance of the Sith Tribe into galactic affairs after millennia of isolation on the planet Kesh. In 5000 BBY, the dreadnaught Omen crashed on Kesh, and the survivors of the accident formed the Lost Tribe. They were unable to contact the outside galaxy or repair their vessel, so the Tribe remained trapped on the world until the arrival of a Sith Meditation Sphere known as Ship in 41 ABY. Ship helped take the Sith offworld to stage attacks on vessels, which were salvaged for parts to repair the Omen and captured for use in the Sith fleet. In 43.5 ABY, the Tribe felt the presence of Jedi Grand Master Luke Skywalker in the Force, and Ship was forced to leave the Tribe by the dark side entity Abeloth. The Sith thus sent a strike team under Lady Olaris Rhea to recover Ship and kill Skywalker. The mission went poorly; Ship remained in Abeloth's control, and the strike team's sole survivor was Rhea's apprentice, Vestara Khai."}, {"tag": "p", "text": "Lord Viun Gaalan led the mission to recover Khai, who had fled to the planet Dathomir. Gaalan captured several dark side-wielding Nightsisters from the world, but Skywalker, his son Ben, and the Force-sensitive Dyon Stadd forced him to flee. The Jedi captured Khai, but before they could leave Dathomir, they were stopped by a Sith fleet led by High Lord Sarasu Taalon, who proposed an alliance to confront Abeloth—who was causing a psychosis amongst the Jedi. The alliance held together until they battled Abeloth, and the Sith betrayed the Jedi and tried to capture the entity. The Jedi nevertheless survived, and Luke Skywalker appeared to kill Abeloth. The Sith repaired their alliance with the Skywalkers to learn more about Abeloth, but when they discovered that she had actually survived, the alliance again fell apart."}, {"tag": "p", "text": "The Sith then hunted the Jedi and Abeloth to the moon Pydyr, where another battle left Taalon dead. Soon afterward, Sith Saber Gavar Khai arranged a project to prevent the culmination of a vision that Taalon had seen of a Jedi queen who could prevent the Sith's rise to power; but the plan ultimately failed. Meanwhile, Gavar Khai led Operation Shieldfall to kill or capture Abeloth and eliminate the Skywalkers on the planet Nam Chorios, but the Jedi defeated the Sith there. Afterward, Abeloth feigned an alliance with the Sith and traveled to the Kesh capital city, Tahv, where she attempted to assassinate the Sith Grand Lord Darish Vol and proceeded to destroy the city itself. As she fled, several Sith led by Khai deserted the Tribe and joined Abeloth's fleet; however, Khai was soon after killed by his daughter."}, {"tag": "p", "text": "The Jedi then left the galactic capital Coruscant on a mission to destroy Abeloth that ultimately failed. Meanwhile, the Sith infiltrated Coruscant, but Abeloth killed Vol and forced the Sith on the capital to assist her in becoming Galactic Alliance Chief of State. The Jedi returned to liberate Coruscant, killing High Lord Ivaar Workan and several other Sith before the Tribe retreated into the New Jedi Temple at Abeloth's behest. The Jedi's assault on the Temple was foreseen by Abeloth and was initially a failure, resulting Abeloth's capture of Vestara Khai and Ben Skywalker. She tried to convince them to turn into beings like her—known as the Ones—but they killed Abeloth, while her other bodily manifestations were also killed. Meanwhile, the Sith on Coruscant were finally forced from the Temple, hunted down throughout the planet, and defeated."}, {"tag": "h2", "text": "Prelude"}, {"tag": "p", "text": "In 5000 BBY, the Sith dreadnaughts Omen and Harbinger were sent on a mission to procure powerful Lignan crystals—lightsaber crystals made of the rare Lignan ore—for use by the Sith Empire in the Great Hyperspace War. However, they were ambushed by the Jedi Relin Druur and Drev Hassin, and in the ensuing skirmish, both Sith vessels attempted to flee into hyperspace. The two ships collided as the Omen's hyperdrive engaged, knocking them both off course. The Omen came out of hyperspace very close to the remote planet Kesh, where it crash-landed in a mountain range. The vessel's communications devices were rendered useless, and the world—home only to the technologically primitive Keshiri species—did not contain the materials needed to rebuild the Omen. The Sith who survived the crash thus took control of the world from the Keshiri and set up a new Sith Tribe, ruled by a Grand Lord and a council called the Circle of Lords. They made the city of Tahv their capital and built a Sith Temple over the preserved wreckage of the Omen."}, {"tag": "h2", "text": "The emergence"}, {"tag": "h3", "text": "A new armada"}, {"tag": "p", "text": "The Sith Tribe survived for over 5,000 years in isolation on Kesh until the time of the Second Galactic Civil War, when, in 41 ABY, the Sith Meditation Sphere Ship found the Tribe. Ship informed the Sith of the happenings of the galaxy since the Omen's accident, including the Sith Empire's failure in the Great Hyperspace War, the collapse of another Sith Order, and the renewed dominance of the Jedi Order in the galaxy. The Sith Tribe thus decided to use Ship in the rebuilding of a brand new Sith armada to serve the Tribe in an invasion of the galaxy."}, {"tag": "p", "text": "On the first mission, Ship took High Lord Sarasu Taalon, Lady Olaris Rhea, Lord Ivaar Workan, Sith Saber Ruku Myal, and Rhea's apprentice, Vestara Khai—Khai being the first person on Kesh who had been contacted by Ship—to attack a Damorian s18 light freighter and salvage it for parts to begin repairs on the Omen. They ambushed the freighter, slaughtered the crew, and brought the vessel's parts back to Kesh. The Tribe continued its attacks on various vessels, leaving none of their victims alive, until the Omen was successfully repaired, at which point they turned their efforts toward the capture of intact ships. The Sith also built a spaceport for their fleet at Tahv, and by 43.5 ABY, the armada numbered greater than two dozen vessels."}, {"tag": "p", "text": "In that year, the Jedi Grand Master Luke Skywalker came into contact with a powerful object, the Codex, which magnified his presence in the Force. The Sith then decided to send a strike team to eliminate the Grand Master in order to pave the way for their invasion. While that plan was being discussed, however, Ship's will was overcome by Abeloth—a powerful dark side deity who periodically destroyed civilizations throughout the galaxy—and the Meditation Sphere abruptly deserted the Tribe. The strike team was thus given the task of tracking down and recovering Ship before killing Skywalker."}, {"tag": "h3", "text": "The strike team"}, {"tag": "p", "text": "The strike team embarked on their mission aboard a captured warship, the Eternal Crusader. To the Sith's surprise, Ship allowed Vestara Khai—who accompanied her Master, Rhea, and several other Sith on the mission—to track the Meditation Sphere. Though the Sith were suspicious of a trap, they decided to continue on their task regardless, and finally arrived at a planet in the Maw. There, a group of the Sith went planetside to retrieve Ship; however, they were unable to find the vessel, and the planet's dangerous flora and fauna began taking its toll on the strike team's numbers. Soon, the Sith also encountered Abeloth, who claimed to have been stranded on the world for the past thirty years. While she pretended to help the Sith in their search for Ship, she actually forced the Meditation Sphere to stay out of their possession. At one point, Abeloth attempted to use her control over the world to drown Rhea, but Khai successfully saved her Master. After the incident, Khai was able to see through Abeloth's apparently Human appearance—in reality, she possessed a much more alien form. The strike team continued shuttling down reinforcements from the Eternal Crusader until there was no one left aboard the warship."}, {"tag": "p", "text": "Meanwhile, Sith Master Yuvar Xal had grown weary of Rhea's leadership and planned a coup against her. Before he could carry it out, however, Abeloth finally allowed Ship to return to the Sith, as she had learned of the presence of Skywalker—as well as his son, Jedi Knight Ben Skywalker—aboard the space station Sinkhole Station in the Maw. Abeloth instructed the Sith to capture the Skywalkers and take them back to Kesh. Ship then took the surviving members of the strike team—which had been whittled down to approximately fifteen Sith—to the station, where Rhea changed the objective back to eliminating the Jedi. They ambushed the Skywalkers, but their attack went poorly. Xal attempted to execute his coup in the middle of the fighting, and he and his apprentice were killed, along with the rest of the strike team excepting Khai, who managed to flee to the planet Dathomir."}, {"tag": "h3", "text": "The alliance"}, {"tag": "p", "text": "Desperate to learn the identity and origin of their dark side assailants, the Skywalkers tracked Khai to Dathomir, where they found her under the protection of the native Dathomiri Witches, who—unaware of her Sith origins and intentions of betrayal—had adopted her into their Clan. Meanwhile, Khai had sold the vessel in which she had escaped in order to send a hypercomm message back to her homeworld, informing the Tribe of the strike team's destruction and her survival. She also made an arrangement with a group of local darksiders known as the Nightsisters to meet with members of her Tribe and exchange techniques, although in reality she intended for the Nightsisters to be captured by her Tribe."}, {"tag": "p", "text": "Lord Viun Gaalan led a contingent of Sith planetside to capture the Nightsisters and retrieve Khai, but before he could leave with the Sith apprentice, the Skywalkers and their Force-sensitive ally Dyon Stadd arrived and attacked the Sith. Gaalan was forced to flee without Khai, who was subsequently captured by the Jedi. Her treachery revealed to the Witches, they banished Khai from their Clan. However, as the Jedi took her offworld, they were confronted in orbit by a large fleet of ChaseMaster frigates commanded by High Lord Sarasu Taalon. To the Jedi's surprise, Taalon proposed an alliance to travel into the Maw and confront Abeloth—who had been inducing a psychosis amongst the Jedi Order's Knights. The Skywalkers were forced to reluctantly agree, although they did not trust the Sith—indeed, the Tribe planned not to kill Abeloth as Taalon suggested, but to capture her for their own use and then kill the Jedi."}, {"tag": "p", "text": "In order to keep some amount of leverage, Luke Skywalker convinced Taalon to let him keep Khai aboard his own vessel, the Jade Shadow—despite the fact that Khai's father, the Sith Saber Gavar, was amongst Taalon's forces—as well as to meet up with his friend, businessman Lando Calrissian, who could assist them in navigating the Maw. They agreed to meet Calrissian at the planet Klatooine; however, while there, Taalon became fascinated by the planet's wintrium Fountain of the Hutt Ancients, and he ordered two of his vessels to obtain a sample of the wintrium. They desecrated the sacred fountain and were abruptly captured by Hutt forces; the crew of one frigate was condemned to death, while the crew of the other was allowed to go free. Nevertheless, the Violation, as it was called, led to a crisis between the Klatooinians and the Hutts—who were bound by treaty to protect the fountain—and ultimately an uprising against the Hutts. The uprising went on to inspire several other slave revolts across the galaxy."}, {"tag": "p", "text": "Meanwhile, the main fleet had left Klatooine, as both Taalon and Grand Master Skywalker had begun to feel restless, and Calrissian—who was accompanied by Jedi Knight Jaina Solo—caught up to the fleet just outside the Maw. Luke Skywalker convinced the Sith to stop first at Sinkhole Station, because that was where he and his son had first encountered Abeloth shortly before the strike team's ambush. However, upon their arrival they found that it had been demolished. One Sith vessel flew too close to the wreckage and was destroyed, despite the efforts of Calrissian and his asteroid tug. The fleet then moved on to Abeloth's planet, where Vestara Khai and Ben Skywalker—both of whom had flown in Ship before; the latter during the Second Galactic Civil War—sensed Ship's presence, and the allies landed to search for Abeloth."}, {"tag": "p", "text": "Luke Skywalker led Taalon, Gavar Khai, and Sith Captain Leeha Faal to the realm of the Force known as beyond shadows to try and locate Abeloth. However, while there, Faal fell into the Depths of Eternity—from which no one could be saved or retrieved—much to Taalon's fury. Soon afterward, Skywalker saw his deceased wife, Mara Jade Skywalker, in the Lake of Apparitions, and she convinced him that they had to leave the realm immediately. Meanwhile, Vestara Khai tricked Stadd, who had recently fallen prey to Abeloth's psychosis, into believing that she and the Sith were on his side, and she released him from his captivity aboard the Jade Shadow. The Jedi and Sith tracked Stadd via a homing beacon placed on him by Vestara to a cave, where they found him near death. He awoke and revealed that Abeloth had begun to drain his life energy, freeing him from the psychosis, and that she had fled down a tunnel upon sensing the allies' approach."}, {"tag": "p", "text": "The allies found Abeloth and attacked her, while Jaina Solo piloted her StealthX starfighter in combat against Ship. During the battle, the Sith finally turned on the Jedi. Nevertheless, Ben Skywalker was able to hold off Gavar Khai in combat while the elder Skywalker fought Abeloth and the rest of the Sith attempted to capture the entity. Despite the Sith's efforts, the Jedi Grand Master defeated and appeared to kill the entity; and Ship immediately fled from Solo. The Sith and Jedi then agreed to temporarily reinstate their alliance in order to investigate more into Abeloth and her origins. Calrissian, Solo, and the entire Sith fleet were sent offworld, leaving just Taalon, the Khais, and the Skywalkers to investigate. However, the Sith sabotaged Calrissian's asteroid tug, sending it on a course toward the gaseous Ashteri's Cloud rather than the galactic capital planet Coruscant. An s18 light freighter and three BDY crew skiffs crewed by Sith forces entered combat with Solo in her StealthX, but she managed to hold the Sith off long enough to flee with Calrissian into hyperspace. Upon Solo's return to Coruscant, the Jedi High Council scrambled to respond to the Sith threat, but contention between the Jedi and the Galactic Alliance Chief of State Natasi Daala delayed Jedi reinforcements from launching."}, {"tag": "h3", "text": "Pool of Knowledge"}, {"tag": "p", "text": "The tenuous allies soon discovered that Abeloth was not actually dead—she had possessed Stadd's body in addition to her own, so Grand Master Skywalker had actually only killed the one of Abeloth's bodies. Nevertheless, Abeloth was weakened by the loss of one of her bodily manifestations, and she did lose control over the psychosis of the Jedi Knights on Coruscant. However, the being whom the Skywalkers and the Sith had thought was Stadd and whom they had left to recover from his injuries aboard the Jade Shadow was actually Abeloth, and by the time they returned to the vessel she had already escaped. In their ensuing search for her they came up empty-handed, until they finally spoke with Ship, who directed them to the Pool of Knowledge, a powerful Force nexus on the world—unbeknownst to them, Ship had already fallen under Abeloth's influence once again. Despite the Jedi's reluctance, the Sith insisted on finding the Pool. Once there, Taalon viewed a Jedi queen on the Throne of Balance in the Pool, and fearing that she might prevent the Sith from coming to power, he ordered that the Jedi tell him who she was. They declined, and a duel quickly broke out. No deaths were suffered on either side and the Jedi escaped; however, during the fight, Taalon jumped into the Pool, and afterward he slowly began to transform into the same kind of being as Abeloth. Meanwhile, Abeloth herself had returned to the Sith and Jedi vessels, commandeered the Jade Shadow, and fled the world."}, {"tag": "p", "text": "Taalon and Gavar Khai decided to beat the younger Khai and send her to spy on the Jedi, ordering her to pretend that they had attacked her in punishment and that she was trying to escape. The elder Skywalker saw through the plan, but he agreed to take her along nonetheless. She and the Jedi tracked Abeloth to Pydyr, where the young Khai managed to send a message to her Tribe, informing them of Abeloth's whereabouts. Taalon and Gavar Khai quickly arrived with a large contingent of Sith, and Taalon offered the Jedi another alliance, promising to kill Abeloth—Luke Skywalker knew that Taalon just wanted to learn more about what he was becoming, but he was forced to accept the offer due to the Sith's overwhelming numbers. In the ensuing battle, numerous Sith were killed due to illusions projected onto them by Abeloth, Taalon was killed by Vestara Khai, who knew that she could not allow a second Abeloth to come into existence, and Abeloth again escaped—although the Jedi killed another of her bodily manifestations."}, {"tag": "p", "text": "The remaining Sith attempted to take the Skywalkers into custody, and when the Sith learned that the young Khai had killed Taalon, they assumed she had turned traitor. She decided to assist the Skywalkers in fleeing from the Tribe's forces, and they escaped as a large wing of Jedi StealthX reinforcements arrived after finally launching from Coruscant. The Jedi arrivals dominated the Sith forces, and Vestara Khai and the Skywalkers immediately continued tracking Abeloth. The entity set up an ambush for them by a group of smugglers at the space station Meliflar Station, but to no avail. Khai secretly sent her father a message when they ultimately located Abeloth on the planet Nam Chorios, and he led the Sith fleet to the planet in Operation Shieldfall. Shortly before the operation commenced, Sith Saber Tola Annax took a contingent of Sith planetside to ambush the Jedi. Annax's two attacks failed; but the Sith soon afterward located Abeloth at a pumping station in the town of Crystal Valley."}, {"tag": "p", "text": "Meanwhile, Gavar Khai had developed the Jedi Queen project, wherein a group of Sith led by Saber Querdan Dei were tasked with hunting down and killing the Jedi queen that Taalon had seen in the Pool of Knowledge. The Sith discovered that the likeness of Tenel Ka Djo, the Queen Mother of the Hapes Consortium, closely resembled the Jedi queen, and they set about a plot to assassinate her to prevent her from giving birth to the queen in the future. However, they put their plan into motion while Djo was on a diplomatic mission to Klatooine, and the project was disturbed by the interference of the prophesied queen, who had actually been born years previously—Djo's daughter, Allana Solo. The girl was able to delay the Sith long enough for her adopted mother, Jedi Knight Leia Organa Solo, to arrive. Organa Solo engaged Dei in a duel and killed him, and the Jedi Queen project was temporarily abandoned."}, {"tag": "p", "text": "On Nam Chorios, the Sith finally located and attacked Abeloth, who was already weakened from contention with the Jedi—who had defeated the entity by forcibly withdrawing from her another one of the beings she had previously consumed, after which another of her consumed victims committed suicide. The Sith went on to surround Vestara Khai and the Skywalkers, but before they could kill the Jedi, the young Khai killed a tsil—a sentient crystal—resulting in a massive death convulsion in the Force that incapacitated all of the Jedi and Sith in the area. She and the Skywalkers recovered before their Sith assailants, and they fled the pumping station. Meanwhile, the Sith fleet, commanded by Gavar Khai, was ambushed by the Jedi StealthX wing—which had been in hiding in the system at Grand Master Skywalker's orders in anticipation of the arrival of Sith reinforcements. The Jedi forces, including Jaina Solo's Gray Squadron, Jedi Master Kyle Katarn's Gold Squadron, and the supporting White Squadron, again easily defeated the Sith. Gavar Khai was forced to call a retreat, and Abeloth narrowly escaped from the Jedi in Ship."}, {"tag": "h3", "text": "Devastation of Tahv"}, {"tag": "p", "text": "Afterward, Abeloth contacted Saber Khai and proposed an alliance with him to take down the Jedi. He agreed, and upon conference with Grand Lord Vol and the Circle of Lords on Kesh, they approved of the idea as well. The Sith planned large festivities at their capital city of Tahv in order to celebrate Abeloth's arrival; although Khai found his loyalties caught in between the political maneuvering of Abeloth and Vol before the celebrations even began. When Abeloth was brought planetside, she took part in the arranged festivities; however, that evening, she decided to stage an attack."}, {"tag": "p", "text": "She appeared to the Grand Lord Vol in his sleep and attempted to kill him. However, she maneuvered too recklessly, allowing him to infiltrate her mind. He discovered her desperate loneliness and need for adoration and he mentally dueled her, telling her that she was not loved. Abeloth's assassination attempt turned into a frantic fight to free herself from Vol's grasp, and she finally broke away, leaving Vol weak and in agonizing pain. He quickly told his aide, Revar, to help him to his vessel and to warn the Tribe of Abeloth's betrayal, but it was too late. Abeloth was anguished and infuriated, and she discharged wave after wave of destructive dark side Force energy upon the city of Tahv in her torment, killing thousands of its inhabitants and leaving the city burning and in ruins."}, {"tag": "p", "text": "Abeloth quickly moved to flee in the Meditation Sphere Ship, but as she took off, several other frigates also launched from the spaceport. Gavar Khai, aboard his flagship, the Black Wave, finally decided to abandon the Tribe and join Abeloth. He ordered that all vessels cover Abeloth's retreat, and he commanded that all those who declined his order or failed to answer were to be shot down. Officially a part of Abeloth's fleet, the Black Wave kept Ship safe long enough to flee into hyperspace. Afterward, the Sith Tribe was forced to abandon their devastated capital. Though weakened, Vol survived the destruction, and he prepared for the next stage of the Sith's invasion of the galaxy. The Sith forces under Abeloth's command served to distract the Jedi while she recovered. Gavar Khai and nine Sith Sabers under Abeloth's command found the Skywalkers, Jaina Solo, and Vestara Khai on the planet Dromund Kaas. After the Sabers were all killed in the ensuing duel—including Gavar Khai at the hands of his daughter—Annax was made commander of Abeloth's fleet. Following the death of her father, Vestara Khai officially joined the Jedi Order under the tutelage of Luke Skywalker."}, {"tag": "h3", "text": "Infiltration of Coruscant"}, {"tag": "p", "text": "Meanwhile, several Sith forces began subverting the government on Coruscant. High Lord Ivaar Workan infiltrated the Galactic Alliance Senate disguised as Senator \"Kameron Suldar\" and quickly gained prominence. Several Sith infiltrated various strategic positions within the Galactic Alliance, and others simply came to the planet itself in preparation for their move to take over the seat of government. Meanwhile, the Jedi Order left Coruscant at the orders of Luke Skywalker, who claimed that the Jedi needed to separate themselves from governmental affairs following their strained tensions with the recently ousted Daala administration. He made the Order's departure a largely public ordeal, ensuring that the Sith took it as a sign that they should put their plans into motion. Unbeknownst to the Tribe, he and the majority of the Jedi Order were embarking on a mission to the planet Upekzar to eliminate Abeloth and Ship, so that they could then return their focus to the Tribe—which would be gathered on Coruscant—and defeat the Sith all at once. However, the Jedi walked into a trap laid out by Abeloth—the entity had left Tola Annax on Upekzar as the focal point for a powerful Force explosion. Some of the Jedi were killed, although the majority managed to escape. During the mission, Vestara Khai killed Jedi Knight Natua Wan in order to ensure the life of Ben Skywalker, an act that made her realize she could never be a Jedi."}, {"tag": "p", "text": "The Sith indeed took the Jedi's departure as a sign to advance their plans, and began to send Sith into the Jedi Temple. Meanwhile, they also arrested Organa Solo, the last Jedi on the planet. Workan reported to Vol that their plans were in motion; however, he also revealed that the new Senator Rokari Kem had suggested that she knew the truth about his identity—unbeknownst to the Sith, Abeloth had consumed Kem and come to Coruscant in the Senator's guise. Vol responded that he would come to Coruscant and kill Kem himself, and the Sith would then execute the final stages of their plan to take over the galaxy. However, when Vol arrived and went to assassinate \"Kem,\" she overwhelmed and defeated him. Still disguised as Kem, Abeloth then contacted Workan and showed him the Grand Lord's head, ordering the High Lord to meet with her the next day."}, {"tag": "p", "text": "She commanded Workan to initiate a vote to replace the current interim Chief of State, Padnel Ovin, with herself. Workan called for the vote, but Ovin stalled with a lengthy speech—unbeknownst to the Sith, he was engaged in a plan to give Chief of Staff Wynn Dorvan and other allies of the Jedi time to free Organa Solo from her imprisonment. Finally, Abeloth used the Force to cause Ovin to collapse, and he quickly died. Using her powers to influence the Senators, Abeloth was able to win the vote, and she rose to power as Chief of State. She then came before Dorvan, who had been captured by three Sith following Organa Solo's escape, and revealed her true form. Soon after her rise to power, Abeloth—calling herself the \"Beloved Queen of the Stars\"—also took over the title of Grand Lord of the Tribe and commanded the Sith on the planet."}, {"tag": "h3", "text": "Endgame"}, {"tag": "p", "text": "Once the Sith had established themselves within the Senate, they began to take over other important administrations. Suspecting that the Jedi would soon return and infiltrate their way back into Coruscant, the Sith set themselves up as immigration inspectors. Vestara Khai, however, had predicted their move and forewarned the Jedi—who indeed returned to liberate Coruscant—and the Jedi practiced concealing their lies and Force presences so the Sith would not detect them. The Jedi's efforts were further facilitated by members of Club Bwua'tu, a secret government organization led by Admiral Nek Bwua'tu and his uncle, Eramuth. Meanwhile, the Sith on Coruscant served under Abeloth, who remained in disguise as Chief of State Rokari Kem. Abeloth ordered High Lord Korelei to torture Dorvan in an attempt to learn valuable information about the Jedi, but he withheld what important information he knew."}, {"tag": "p", "text": "The Jedi arrived aboard the starliner Plain Lady, fooling the Sith inspectors on the vessel. As they passed through the immigration inspection stage in the Galactic Center Spaceport, Sith Captain Suhale grew suspicious of Jedi Knights Yantahar Bwua'tu and Yaqeel Saav'etu. However, three nearby Knights, Bazel Warv, Seff Hellin, and Vaala Razelle, helped Bwua'tu and Saav'etu escape the Sith by pretending to be simple spice smugglers in league with the two. Afterward, in an attempt to create anti-Jedi sentiment, the Sith spread through the news that the Jedi were running a spice cartel. Meanwhile, elsewhere in the spaceport, Sith Master Ruku Myal recognized Vestara Khai, despite her disguise. When Myal activated his lightsaber, nearby Galactic Alliance Security troops assumed he was a Jedi and opened fire, and Khai killed the Sith Master with his own shikkar—a glass dagger. The Jedi then sent a message across the HoloNet, ordering the Sith to surrender or be killed. The Sith refused to surrender, and the Jedi carried out myriad targeted assaults all across the planet, killing nearly 1,000 Sith. Among those killed were Master Jestat Vhool, who was posing as a Galactic Alliance Security Superintendent; Saber Kayala Fei, who was an announcer for BAMR News; and Ivaar Workan, who was killed in a duel in his Senate office. Still, some of the targeted Sith did manage to escape, such as Lady Tela Rovas, and about 5,000 Sith remained alive on Coruscant."}, {"tag": "p", "text": "Meanwhile, the Sith launched a wing of Skipray twelve-jays to the planet Ossus to ambush the Jedi Academy there. Leia Solo and her husband, Captain Han Solo, along with Hapan Queen Mother Tenel Ka Djo and Jedi Masters Tionne and Kam Solusar, led the evacuation effort to save the Jedi Initiates and their families and transport them to the secret Jedi base on the planet Shedu Maad in the Hapes Cluster. Four wings of Hapan Miy'til starfighters helped defend the evacuating craft, but the transport Sharmok 718 was boarded by Sith and planted with a baradium bomb. The Jedi and Hapan forces recognized that the vessel was behaving oddly and realized that the Sith had boarded, but when the Hapan Volgh Squadron opened fire, the Sharmok exploded with a three-kilometer radius, killing all those aboard and destroying Volgh Squadron. The Jedi realized that the blast had been intended to kill Tenel Ka Djo, whom the Sith still believed could be connected to the prophesied Jedi queen. During the mission, Allana Solo also had a vision of the nest of Barabel Jedi Knights Tesar Sebatyne, Wilyem, Zal, and Dordi being attacked, and their younglings being killed. Despite her earlier promise to the Barabels to keep the nest's location in the Jedi Temple a secret, she reported her vision, and the Solos traveled back to Coruscant to tell Jedi Knight Warv, who also knew of the nest."}, {"tag": "h4", "text": "Battleground Coruscant"}, {"tag": "p", "text": "Since the Jedi's advantage on Coruscant was due to their knowledge of the planet and of the Sith's positions, Abeloth and Korelei wanted to bring the fighting out into the open, where the Sith—who greatly outnumbered the Jedi—could easily win. However, when Abeloth stopped torturing Dorvan and made him an aide to help her rule, he convinced her that the Coruscanti people would not submit to Sith rule so easily; in reality, he hoped to protect civilians from being hurt by preventing the fighting from taking place in public. At Dorvan's suggestion, they instead agreed to withdraw all Sith forces into the Jedi Temple, where the Jedi would be forced to face them openly. After they pulled seventy-five percent of the Sith on Coruscant into the Temple, Jedi Master Saba Sebatyne led several Jedi Knights, including Izal Waz, on a perpetual hunt of the Sith forces who remained outside. The Jedi and Club Bwua'tu recognized that the Sith withdrawal was a trap, and thus planned to launch an assault on the Temple from thirty points, hoping to draw the Sith out to the perimeter while Luke Skywalker deactivated the Temple's shields and the rest of the Jedi on the mission—who would take secret entrances into the Temple's center—could drive the Sith to the exterior of the Temple."}, {"tag": "p", "text": "The Galactic Alliance Marines, commanded by Admiral Gavin Darklighter, commenced their attack, but the Jedi in the Temple were ambushed by numerous Sith who were aware of their plan—Abeloth had anticipated the Jedi battle plan and prepared the ambush. During the battle, Vestara Khai was knocked unconscious and captured by the Sith, and the Sith forced the Jedi to retreat. Meanwhile, Luke Skywalker and Jedi Master Corran Horn discovered that the computer interface they had hoped to use to override the lockdown of the Temple had been disabled, meaning that the Sith had known about their assault well ahead of time. In the meantime, Abeloth had grown powerful enough to make use of multiple bodily manifestations at once—one as Chief of State Kem, one as the Imperial lieutenant Lydea Pagorski, one as the Temple's central core computer itself, and one as Lady Korelei."}, {"tag": "p", "text": "As the assault outside the Temple went on, inside the building Dorvan successfully stole a hold-out blaster from Sith Master Tsiat. Then, when Abeloth—in the form of Rokari Kem—entered a trance, he shot the body multiple times, killing it. However, Abeloth quickly arrived on the scene in her true form and stopped Dorvan from committing suicide. Meanwhile, Jaina Solo and the Skywalkers, along with Horn, his children, Valin and Jysella, and Solo's astromech droid, Rowdy, made their way to the Temple's computer core, where they hoped to lower the shields. Jysella found Dorvan in the core, but Abeloth kidnapped Ben and trapped Valin in an airlock. Jysella managed to rescue both her brother and Dorvan, but since Abeloth controlled the computer, they were unable to complete their objective."}, {"tag": "p", "text": "Meanwhile, Vestara Khai had returned to consciousness and fled from the Tribe, but she was eventually cornered by High Lord Sashal and a group of Sith. Khai—who had recently deduced the identity of the Jedi queen, Allana Solo—told Sashal the girl's identity in an attempt to convince the Sith that she was still on their side. Sashal then gave her a detonator and told her to complete her mission to kill the Jedi queen, revealing that the hatchway through which Khai had hoped to escape had finally opened, and Allana, Han, and Leia Solo were outside, along with Warv—with whom the Solos had met regarding Allana's vision. Khai threw the detonator, which connected with the Solos' ship, the Millennium Falcon, but failed to kill Allana. In the ensuing combat, Warv was killed and the majority of the Sith were slaughtered, but the three Solos escaped."}, {"tag": "h4", "text": "Abeloth's destruction"}, {"tag": "p", "text": "Abeloth in Pagorski's form traveled to the Imperial Remnant, where she hoped to cause disruption by assisting Admiral Natasi Daala in winning the first Imperial election. Meanwhile, the Jedi and their allies changed their objective to destroying the shield generators in order to send in Void Jumper marines, and Corran Horn, Jaina Solo, and Luke Skywalker succeeded in killing one of Abeloth's bodies in the form of Lady Korelei, while Abeloth's body in the form of Lydea Pagorski was simultaneously destroyed on the planet Hagamoor 3 by former Jedi Tahiri Veila and bounty hunter Boba Fett, at the behest of the Imperial Head of State Jagged Fel. As such, the Jedi were able to take out the Temple's shields, allowing access to the interior of the Temple for the Void Jumpers. Meanwhile, Han, Leia, and Allana Solo battled Sith through the Temple, meeting up with Jedi Knight Zekk, the Hapan Taryn Zel, and several Hapan commandos, before they finally located the Barabel nest and warned them of Allana's vision."}, {"tag": "p", "text": "As the assault on the Temple went on, about 300 Sith fled the building and were hunted down through Coruscant by the Jedi. The Jedi Council convened—along with Darklighter, Nek and Eramuth Bwua'tu, Senator Luewet Wuul, and other allies to discuss their next move, as well as to hear a report from Jedi Knights Lowbacca and Tekli, who had learned the truth of Abeloth's nature from the Killiks—at least 100,000 years previously, Abeloth had been a servant to a family of powerful Force wielders called the Ones. She swam in the Pool of Knowledge and drank from another Force nexus, the Font of Power, resulting in her transformation into a member of the Ones; but one who sought to destroy. She had been imprisoned by the Ones, but the Ones had been killed during the Clone Wars, and the use of the flow-walking technique by Sith Lord Darth Caedus during the Second Galactic Civil War had finally set Abeloth free. While the meeting continued, Abeloth began to cause massive geologic activity on Coruscant, destroying numerous buildings, including the Galactic Justice Center. She then left Coruscant in Ship with Vestara Khai and Ben Skywalker, hoping to convince them to join her in forming a new family of the Ones."}, {"tag": "p", "text": "The Sith who remained on Coruscant were hunted down and defeated, although they—along with the remnants of Abeloth's seismic destruction—caused massive damage to the city-planet, resulting in civilian deaths estimated as high as in the billions. Jaina Solo and Luke Skywalker quickly launched in the vessel Rude Awakening after Ship, hoping to save both Khai and the young Skywalker from Abeloth. Meanwhile, Jagged Fel piloted the yacht Parting Gift to pick up the Barabel Jedi, their younglings, the Solos, and their escort. The extraction was successful, and Master Saba Sebatyne, Tahiri Veila, and a unit of Void Jumpers led by Sergeant Major Gef Olazon stayed behind on a mission to destroy the manifestation of Abeloth coupled to the Temple's core computer. Meanwhile, as Ben Skywalker and Vestara Khai resisted Abeloth's efforts to make them join her, Jaina Solo and Luke Skywalker contemplated whether or not it was the will of the Force for the young Khai and Skywalker to replace the Ones who had previously held Abeloth at bay."}, {"tag": "p", "text": "As Solo confronted Ship in the Maw and began to battle the Meditation Sphere, Luke Skywalker entered the realm beyond shadows and located Abeloth, fighting her with the help of a Sith stranger from another faction of Sith, even while Ben Skywalker and Vestara Khai dueled Abeloth at the Font of Power. Sebatyne's team inside the Jedi Temple fought through many Sith, as well as Sith shadow-ghouls created by Abeloth. Finally, they destroyed the computer core, forcing Abeloth's being out, and Sebatyne killed the entity. Meanwhile, Abeloth was also killed beyond shadows, as well as by Khai and Ben Skywalker on her planet in the Maw. With all of her bodily manifestations defeated at once, she was finally destroyed. Ship, who was at last completely freed from Abeloth's control, quickly fled from Solo."}, {"tag": "h2", "text": "Aftermath"}, {"tag": "p", "text": "Luke Skywalker was severely weakened in his combat with Abeloth, but he also recognized the Sith stranger as the same man he had seen in his visions back before the Second Galactic Civil War—a man he had previously assumed to be the Sith Lord Darth Caedus. While in the Lake of Apparitions, the Grand Master spoke again with both his wife and Caedus, the latter of whom revealed that he had fallen to the dark side and acted as he had during the Second Civil War in order to prevent his own vision coming true—one with the Sith stranger on the Throne of Balance and Allana at his side. As the Grand Master remained in a comatose state, Solo piloted the Rude Awakening to pick up the young Khai and Skywalker. At first, she only allowed the young Jedi Knight on board, and she revealed to him Khai's attack on the Solos and betrayal of Allana's identity. Solo and Skywalker then went to find Khai, but she was retrieved by Ship before they could capture her. Khai believed that she could never go back to her Tribe on Kesh, and Ship revealed that there were other Sith in the galaxy who needed her help and could use her knowledge of the Skywalkers to their advantage."}, {"tag": "p", "text": "Meanwhile, back on Coruscant, the last of the Sith had been hunted down, and the Galactic Alliance—with a recovered Wynn Dorvan in place as Chief of State—had a seismic activity team assess the massive damage done to the capital. Volcanic activity and groundquakes had ceased, but there were over 100,000 sites throughout the Coruscant underworld that required examination. Furthermore, there was a great welling of clouds of poisonous gas throughout the city-planet. The public was abound with anti-Jedi sentiment due to the Sith's efforts over the BAMR network to convince the Coruscanti that the fighting was due to a war going on between a supposed Jedi spice cartel and their rival. As such, the Galactic Alliance Senate voted to remove the Jedi from Coruscant, with enough votes to override a veto from Dorvan. Upon the return of Jaina Solo and the Skywalkers, the Jedi Grand Master agreed that the Order's relocation was in the best interests of all involved, and the Jedi moved to their secret base on Shedu Maad. Meanwhile, the Solos decided that since Allana's identity was known by the Sith, there was no point in trying to keep it a secret any longer. During the wedding of Jagged Fel and Jaina Solo, she was announced publicly as the Chume'da, heir to the Hapes Consortium."}, {"tag": "p", "text": "Soon after the defeat of the Sith on Coruscant, the Jedi received reports from Jedi Knights Sothais Saar and Avinoam Arelis—who were assisting enslaved populations in the Outer Rim Territories to win their freedom—that a tentacle had suddenly materialized from the Force and briefly assailed them. The Jedi realized that it was Abeloth starting the slow process of reforming her body, and thus decided that they needed to arm future generations against Abeloth's inevitable return. During Skywalker's training under Yoda on the planet Dagobah, the Jedi Master had told him a story of the discovery of the Ones during the Clone Wars—Skywalker's father, Anakin, and the Jedi Obi-Wan Kenobi had found the world Mortis, where the Ones lived; and during the mission the Ones had been killed by the use of a Force-empowered dagger. Luke originally thought that the tale was untrue, but upon the revelations regarding Abeloth, he believed that if the Jedi could locate Mortis, they could find the dagger and with it kill Abeloth permanently upon her return. As such, he organized a group of Ten Knights to search for the Mortis monolith, the gateway to Mortis, to find the dagger."}, {"tag": "h2", "text": "Combatants"}, {"tag": "h3", "text": "Lost Tribe of Sith"}, {"tag": "p", "text": "The Lost Tribe of Sith were the descendants of the survivors of the 5,000 BBY crash of the starship Omen on the planet Kesh. The accident occurred during the Great Hyperspace War, when the Sith had the intention of fighting for their Empire to take control of the galaxy. Due to the destruction of their vessel and equipment in the crash, the native Keshiri's lack of advanced technology, and the planet's lack of sufficient material to make repairs, the survivors were stranded on the remote world with no way to contact their fellow Sith. As such, the Tribe held on to a desire to return to the galaxy and conquer it in the name of the Sith, a goal which they were eager to put in motion upon the arrival of Ship. With Ship to ferry them offworld, the Tribe began working as pirates to build up their navy and achieve important strategical positioning for their fleet, which contained hundreds of vessels by 44 ABY. By the time of their emergence, the Sith Tribe numbered in the tens of thousands."}, {"tag": "p", "text": "The Sith were willing to go to extensive measures to attain their goals, including temporarily allying with their greatest enemies, the Skywalkers. Although the Tribe suffered internal strife between rival members, they were still capable of working together toward a common goal in large numbers, and they were taught to respect and obey their superiors. Many of their number were susceptible to Abeloth's influence, however, causing their plans of galactic domination to stall. Furthermore, Abeloth's power was so great that she murdered the Tribe's Grand Lord and ultimately forced the other Sith to serve her purposes and assist in her rise to power. Abeloth then took the title of Grand Lord for herself, and from that point forward, she used the Tribe to further her will. Abeloth was eventually destroyed, and the Jedi and Galactic Alliance forces defeated the Sith on Coruscant. Nevertheless, the location of their homeworld remained a secret, so the Sith who had stayed on Kesh were not immediately eradicated."}, {"tag": "h3", "text": "New Jedi Order"}, {"tag": "p", "text": "The New Jedi Order was formed by the Jedi Luke Skywalker following Emperor Palpatine's purge of the original Jedi Order. By the time of the emergence, the New Jedi Order numbered approximately 1,000 to 1,500 Jedi in all. During the first two years of the Lost Tribe's activity of Kesh, the Jedi Order remained unaware of the Sith. It was not until the strike team ambushed the Skywalkers at Sinkhole Station that the Jedi learned of the new threat, and even then, they were not certain of the nature of their assailants. Since Vestara Khai led them back to Dathomir, the Skywalkers even suspected briefly that their attackers were from that world. Furthermore, since two most recently dominant Sith Order had been dictated by the Rule of Two, the Jedi were surprised by the fact that the Tribe consisted of many more Sith. The Jedi were further hindered in their dealings with the Sith by the fact that Grand Master Skywalker had been put on trial in 43 ABY and exiled from Coruscant for allowing the Jedi Knight Jacen Solo to fall to the dark side and become Darth Caedus during the Second Galactic Civil War. The Grand Master was accompanied on his travels by his son, but he was not allowed any other form of contact with the Jedi Order."}, {"tag": "p", "text": "Furthermore, when the Jedi on Coruscant were made aware of the Sith threat, they were unable to mobilize due to their conflict with the administration of Chief of State Natasi Daala. When Jedi had begun to fall prey to Abeloth's psychosis, the government and the Jedi did not agree on who should be allowed to keep the psychotic Knights. Interim Grand Master Kenth Hamner was also very conservative in his leadership; he refused to allow the Jedi to launch their StealthX wing to help the Skywalkers on Pydyr because he feared that Daala would believe the launch was directed at her and would start an open war on the Order. Eventually, Hamner was killed in combat with Jedi Master Saba Sebatyne after he tried to sabotage the launch of the starfighters. Sebatyne was then made interim Grand Master until Skywalker was granted pardon and allowed to return. Skywalker then led the entire Jedi Order off Coruscant for a mission to eliminate Ship and Abeloth, with the purpose of luring the Sith Tribe to Coruscant so that upon their return the Jedi could defeat the Sith in one operation. Though the operation originally went poorly due to Abeloth's foresight, the Jedi eventually succeeded in defeating her and the Tribe. Much of Coruscant was devastated in the process, and public opinion—partially due to the efforts of the Sith infiltrators themselves—was turned sharply against the Jedi. As such, the Order was forced to leave the capital, and they relocated to their secret base on Shedu Maad."}, {"tag": "h3", "text": "Abeloth"}, {"tag": "p", "text": "At least 100,000 years before the emergence, Abeloth was a servant to the Ones—the powerful Force-wielding Father, Daughter, and Son. She eventually came to be the Mother of the family, but she bathed in the Pool of Knowledge and drank from the Font of Power, turning her into a powerful dark side entity. She then became a legendary destroyer of civilizations, and the Ones imprisoned her; although she was periodically able to escape and bring chaos to the galaxy, her actions caused the Daughter and Son to work together and trap her. However, during the Clone Wars, the Father, Daughter, and Son were all killed, leaving no one to keep Abeloth in check. Abeloth was imprisoned on a planet in the Maw, where she was kept detained by Sinkhole Station. She was able to extend her reach over Force-sensitive beings who spent time in the Maw, causing them to develop a psychosis and yearn to find her. Those who came to her stayed at Sinkhole Station and become known as Mind Walkers; she routinely fed off of their life energies. Following the destruction of Centerpoint Station in the Second Galactic Civil War, Sinkhole Station began to fall into disrepair, until finally, in 44 ABY, Abeloth was able to destroy Sinkhole. The constant warring between Jedi and Sith—and namely Darth Caedus' use of the flow-walking technique—ultimately caused Abeloth to be freed. Afterward, she was finally able to move offworld, although she was kept on the run by the Jedi and Sith who hunted her, preventing her from achieving her desire to become the \"Beloved Queen of the Stars.\""}, {"tag": "p", "text": "Her true nature remained a mystery to the Sith and Jedi for some time, although her actions were often dominated by the presence of the former Jedi Callista Ming, whom she had consumed. Ming, a former lover of Luke Skywalker, at times was able to influence Abeloth's actions and even prevent her from harming Skywalker. On Nam Chorios, the Grand Master finally extracted Ming's presence from Abeloth, allowing the former Jedi to die. Abeloth's hold on her psychotic followers was broken when she was severely weakened after her initial defeat to Skywalker on her prison world, as well as following the removal of Ming's spirit. She finally resolved to have her Sith followers lead the Jedi astray, giving her time to gather her strength and take over the government on Coruscant. She grew in power, taking command of the Sith forces on Coruscant and attaining the title of Grand Lord. She also quickly increased the number of bodily manifestations she wielded, consuming more and more beings—although the bodies of the non-Force-sensitives whom she consumed quickly wore out and required replacement. Finally, Saba Sebatyne, Tahiri Veila, and a group of Void Jumpers succeeded in destroying Abeloth's manifestation in the Jedi Temple's computer core, while Luke Skywalker and Darth Krayt—the Sith whom Skywalker recognized from his visions—killed another manifestation in the Lake of Apparitions beyond shadows, and Vestara Khai and Ben Skywalker killed another at the Font of Power. Before long, however, Abeloth started the slow process of reforming her body."}, {"tag": "h3", "text": "Galactic Federation of Free Alliances"}, {"tag": "p", "text": "The Galactic Federation of Free Alliances became the leading galactic government following the collapse of the New Republic during the Yuuzhan Vong War. The Alliance was politically tied to the New Jedi Order; it included a High Council consisting of six Jedi and six members of the Alliance. The Alliance's first Chief of State was Cal Omas, who led the government through the Dark Nest Crisis, the Swarm War, and part of the Second Galactic Civil War, which began with the secession of a Confederation led by the planet Corellia. During the war, Omas was ousted in a coup by Jacen Solo and Admiral Cha Niathal, and the Alliance later came under the sole control of Solo. The Jedi Order, Hapes Consortium, Mandalorians, Maw Irregular Fleet, and the Alliance-in-exile—Galactic Alliance forces no longer loyal to Solo—formed a Coalition to defeat the Alliance. After the war's end, Natasi Daala was elected as the Galactic Alliance's Chief of State."}, {"tag": "p", "text": "While the Sith on Kesh prepared for their invasion, Daala began to take measures against the Jedi Order, such as the arrest and exile of Luke Skywalker. As Jedi Knights began to fall prey to Abeloth's psychosis, Daala's policies against the Order grew stricter, resulting in her use of Galactic Alliance Security forces to capture the psychotic Jedi. She went on to hire Mandalorians to try and capture the psychotic Knights; and when the Order refused to cooperate with her, Daala authorized a Mandalorian raid and siege of the Jedi Temple. Eventually, the Jedi ousted Daala and established the first Triumvate of interim Jedi Grand Master Saba Sebatyne, Senator Haydnat Treen, and General Merratt Jaxton in her place. Wynn Dorvan later replaced Jaxton, but when the Jedi Order announced that they were leaving Coruscant, the triumvirate was dissolved and Padnel Ovin was elected Chief of State. However, both the Sith and Abeloth had infiltrated the Galactic Alliance, and Abeloth murdered Ovin and became Chief of State. During the liberation of Coruscant, Club Bwua'tu—a secret organization within the Alliance—Galactic Alliance Marines under the command of Gavin Darklighter, and several other government forces helped the Jedi eradicate the Sith and defeat Abeloth. After the crisis, Wynn Dorvan became the Chief of State."}, {"tag": "h3", "text": "Hapes Consortium"}, {"tag": "p", "text": "The Hapes Consortium was a matriarchal, hereditary monarchy based on the capital world Hapes in the Hapes Cluster. Hapes was ruled by a Queen Mother, with an heir to the throne known as the Chume'da. Hapes was founded thousands of years before the Sith Tribe's invasion by the first Queen Mother. In 27 ABY, Tenel Ka Djo, who was training as a Jedi, became the Queen Mother after the death of her mother, the Queen Mother Teneniel Djo. Due to Tenel Ka Djo's ties to the Jedi Order, the Hapes Consortium remained a close ally of the Jedi for years; even after she resigned from the Order in 36 ABY in order to focus more on her reign. When her former lover, Jacen Solo, became the Sith Lord Darth Caedus and took control of the Galactic Alliance, Djo pledged the Hapan forces to a Coalition to defeat him. At the end of the war, after a nanovirus attack on the Hapan royal family, Tenel Ka Djo faked the death of her daughter, Allana Solo, in order to protect her."}, {"tag": "p", "text": "The Hapes Consortium did not become actively involved in the war with the Sith until the Tribe discovered that she bore a striking resemblance to the Jedi queen that Sarasu Taalon saw on the Throne of Balance. Nevertheless, the Sith's attempts to assassinate Djo and Allana Solo failed. Later, Tenel Ka Djo led Hapan forces to help the Jedi in their evacuation from the Ossus Jedi academy, transporting them to a secret base on Shedu Maad in the Hapes Cluster itself. Furthermore, the Hapan Taryn Zel, accompanied by several Hapan commandos, assisted in the assault against the Sith in the Jedi Temple on Coruscant. Following the defeat of the Sith forces, Allana Solo's identity as Chume'da was revealed to the galaxy."}, {"tag": "h2", "text": "Key Sith figures"}, {"tag": "h3", "text": "Darish Vol"}, {"tag": "p", "text": "The Human male Darish Vol was the Grand Lord of the Lost Tribe of Sith. In that capacity, he was the Tribe's highest authority and most respected member during the time of the emergence. Along with Lady Rhea, he handpicked the first strike team sent to retrieve Ship and kill Skywalker. Throughout the Sith's battles with the Jedi, Vol remained on Kesh to oversee the Tribe's activities at home. When Abeloth was brought back to Kesh with the proposal of an alliance, he remained very wary of her; his fears were soon confirmed when she attacked him and laid waste to the city. Later, when the Sith stood poised to execute their coup of the government, he finally traveled to Coruscant. However, upon his arrival, Vol went to assassinate Rokari Kem, a Senator who High Lord Workan believed knew of the Sith plan. Kem was actually Abeloth in disguise, and she killed and beheaded Vol."}, {"tag": "h3", "text": "Ivaar Workan"}, {"tag": "p", "text": "Ivaar Workan was a Human male who had risen to the rank of Lord by 41 ABY. He was one of the Sith selected to participate in the Tribe's first mission offworld, under the command of High Lord Sarasu Taalon. Later on during the emergence, he remained on Kesh, where he became one of the few beings whom Darish Vol trusted not to betray him; and by 44 ABY he had achieved the rank of High Lord. Toward the final stages of the Sith's plans, Workan traveled to Coruscant, where he infiltrated the Senate disguised as \"Kameron Suldar\" from the planet B'nish. During his time on Coruscant, he uncovered a conspiracy plotting to take over the Galactic Alliance and helped to eliminate it, as it clashed with the Tribe's plans. He worked to pave the way for the Sith invasion, although his encounter with Rokari Kem made him uneasy. Indeed, his fears were confirmed when she killed Vol, and he learned she was actually Abeloth in disguise. Workan was then forced to assist her in her rise to the position of Chief of State. Soon afterward, when the Jedi launched their mission to liberate Coruscant, Workan was a target assigned to Vestara Khai, Ben Skywalker, Luke Skywalker, and Jedi Knights Doran Sarkin-Tainer and Seha Dorvald. The five engaged in combat with Workan and three Sith guards in his Senate office, and Ben killed the High Lord with a blaster shot in the face."}, {"tag": "h3", "text": "Sarasu Taalon"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Sarasu Taalon was a male Keshiri who rose to the rank of High Lord and was active throughout much of the Tribe's emergence. He led the Sith on their first mission offworld with Ship, and by 44 ABY had come into command of no fewer than eleven ChaseMaster frigates in the Sith armada. He convinced the Skywalkers to ally with the Sith and proceeded to command the Sith forces during their joint mission to confront Abeloth. After that mission's failure, he remained onworld to learn more about Abeloth, and it was during the altercation in the Pool of Knowledge that he learned of the existence of a Jedi queen who could prevent the Sith's rise to power. Too, he dove into the Pool itself, and he began to transform into the same kind of being as Abeloth. He subsequently led Sith troops to Pydyr after learning of Abeloth's presence there, and again forced the Skywalkers to help him find Abeloth. However, upon confronting Abeloth, he showed a yearning to know more about what he was becoming as opposed to his supposed desire to kill her. Vestara Khai made use of a Jedi distraction to kill Taalon, as she believed she could not let another being like Abeloth come into existence."}, {"tag": "p", "text": ""}, {"tag": "h3", "text": "Gavar Khai"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Gavar Khai was a Human male Sith Saber in the Tribe who rose to a level of prominence in the Sith forces during the emergence. He first served under Sarasu Taalon during their allied mission with the Jedi to confront Abeloth. Khai recognized his daughter's growing care for the younger Skywalker, and rather than discouraging it, he suggested that she use it to try and turn him to the dark side. During the Sith's betrayal of the Jedi, Gavar Khai turned the attack upon Luke Skywalker, although the younger Skywalker soon intervened and held the Sith Saber off. Afterward, when they found that Abeloth had survived, Saber Khai suspected the Jedi of treachery on numerous accounts. He lost his forearm in the duel at the Pool of Knowledge, but he was eventually fitted with a prosthetic."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Khai again accompanied Taalon on the Sith mission to Pydyr, where he was the first Sith to hear that his daughter had killed Taalon. He remained unsure of his daughter's loyalties after the incident, although she messaged him to inform him of Abeloth's location on Nam Chorios. Saber Khai personally developed the Jedi Queen project, and he also led Operation Shieldfall to Nam Chorios—but both ventures ultimately ended in failure. Following Abeloth's destruction of Tahv, her influence on Khai finally won over, and he decided to defect from the Tribe. She sent him and several other Sith to lead the Jedi off her trail, and he was soon killed in a duel with his daughter."}, {"tag": "h3", "text": "Vestara Khai"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The Human female Vestara Khai, at the time a Sith Tyro, was the first being on Kesh whom Ship contacted—due to her ambition and aptitude. As such, she was honored by the Tribe and made the apprentice of Lady Olaris Rhea. She was allowed to travel with Ship on the Sith's first mission in the emergence, and she spent the next two years in the growing Sith armada. She was chosen for the strike team's mission to recover Ship and kill the Skywalkers; the young Khai was the only Sith to see Abeloth's true form, and she was also the sole survivor of the skirmish with the Jedi. Afterward, the Sith apprentice used her skills and wits to survive and avoid capture by the Jedi by staying with the Witches of Dathomir. However, when the Jedi allied with the Sith, she was kept aboard the Jade Shadow for the mission, and over time she began to develop a relationship with Ben Skywalker. Her subsequent objective to spy on the Jedi following the duel at the Pool of Knowledge resulted in further travels with the Skywalkers, and when she killed Taalon she was forced to flee with the Jedi, knowing that her fellow Sith would not give her time to explain her actions. Though Vestara Khai still tried to assist her Tribe toward its ultimate goal in every way that she could, she was forced with increasing frequency into situations wherein she found herself helping the Skywalkers."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Finally, after Khai was forced to kill her father in combat, and upon learning of the death of her mother, she decided to officially rescind her Sith ways and join the Jedi. Nevertheless, after a mission in which she decided to kill another Jedi in order to ensure the safety of Ben Skywalker, she came to feel that she could never truly be a Jedi. Vestara Khai thus decided to assist the Jedi against her Tribe in order to assure the deaths of all of the High Lords—who were duty-bound to kill her, since she had killed Taalon—before leaving the protection of the Order. She took part in the liberation of Coruscant and assisted the Jedi in killing High lord Ivaar Workan. She later revealed the identity of the Jedi queen to her Tribe in order to stop them from harming her, placing her in a situation wherein she was forced to betray and attack the Solos. Abeloth soon afterward offered Khai the title of \"Daughter of the Night,\" a member of the Ones, irresistible and powerful. However, she ultimately refused, and helped Ben Skywalker kill Abeloth. Nevertheless, she knew he would not forgive her for betraying the Solos, so she fled in Ship. The Meditation Sphere promoted her to Sith Lord and informed her of a different faction of Sith that she could join."}, {"tag": "h2", "text": "Key Jedi figures"}, {"tag": "h3", "text": "Luke Skywalker"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The Human male Luke Skywalker fought with the Rebel Alliance and New Republic against the Galactic Empire, and he rebuilt the Jedi Order and led it through numerous crises—including the Yuuzhan Vong War and the Second Galactic Civil War. However, in 43.5 ABY he was exiled from Coruscant for failing to prevent Jacen Solo's fall to the dark side during the latter war. Accompanied by his son, Ben, the exiled Grand Master embarked on a quest to discover why Jacen Solo had fallen to the dark side. It was during their travels that the Skywalkers first encountered the Sith Tribe; they were initially uncertain of the identities of the darksiders, but quickly discovered that they were in fact Sith. When Taalon proposed an alliance, Skywalker realized he had no option but to grudgingly accept, despite the knowledge that it was only a matter of time before the Sith betrayed him."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The confrontations with Abeloth became more personal for the elder Skywalker when he discovered that she had consumed his former lover, Callista Ming, although he eventually freed Ming's spirit from Abeloth on Nam Chorios. The Grand Master received numerous grievous injuries during his battles with Abeloth and the Sith, but he refused to take much time to heal, as he feared giving his enemies enough time to recuperate themselves. Finally, following Daala's removal from office, Skywalker's exile was lifted and he was allowed to return to Coruscant and resume command over the Jedi. He lured the Sith to gather on Coruscant by pretending to move the entire Order to another location, but the Jedi's subsequent mission to eliminate Ship and Abeloth was unsuccessful; and while they were gone from Coruscant, Abeloth became Chief of State."}, {"tag": "p", "text": "The Grand Master then spearheaded the Jedi's mission to liberate Coruscant. After his son was kidnapped by Abeloth, he and Jaina Solo traveled to the Maw to confront the entity. The elder Skywalker decided to go beyond shadows to do so, and he was assisted there by a Sith stranger—one who he had seen in visions before, though he had previously assumed that the Sith in his visions was actually Caedus. He and the Sith were successful in destroying Abeloth, and though Skywalker was greatly injured and willing to allow himself to die, an apparition of his wife convinced him to survive. The Grand Master also achieved the objective of his original mission in discovering the reason for Caedus' fall to the dark side—he had seen the same Sith stranger on the Throne of Balance, alongside Allana Solo, Caedus' daughter with Tenel Ka Djo. Afterward, Luke Skywalker led the Jedi off of Coruscant to their new headquarters on Shedu Maad."}, {"tag": "h3", "text": "Ben Skywalker"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The son of Luke and Mara Jade Skywalker, Ben Skywalker was born during the Yuuzhan Vong War and was present at Shelter, where Abeloth gained her hold on numerous future Jedi Knights who later fell prey to her psychosis. However, he withdrew from the Force during his time there, so Abeloth was unable to hold sway over him. Ben Skywalker later took part in the Second Galactic Civil War, during which his Master, Jacen Solo, turned to the dark side, becoming Darth Caedus and killing the young Skywalker's mother. Ben Skywalker helped the Jedi Coalition win the war, and when his father was put on trial and exiled, the young Jedi Knight insisted that he accompany the Grand Master on his travels. The younger Skywalker proved himself an asset to his father on numerous occasions, and helped the elder Skywalker defeat about fifteen Sith on Sinkhole Station. After locating Vestara Khai on Dathomir but being unable to take her into custody, the young Skywalker developed an attraction to her, which she reciprocated. Over the course of his travels with his father, Ben Skywalker's skills grew increasingly prominent, to the point that he was able to singlehandedly duel and defeat three Sith Sabers."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "During the allied mission with the Sith to confront Abeloth in the Maw, his relationship with the young Khai strengthened, and despite her numerous attempts to undermine the Jedi, Ben Skywalker grew more and more convinced that he could turn her to the light side. Throughout his travels with the Sith apprentice, the young Skywalker served as the primary advocate for his father to trust her to do the right thing. Finally, after she was forced to kill her own father in combat, Ben Skywalker comforted the young Khai and promised to help her become a Jedi. The young Jedi Knight, alongside Vestara Khai, assisted in the liberation of Coruscant; Ben Skywalker himself killed High Lord Ivaar Workan early in the campaign. However, he was eventually captured by Abeloth, who tried to convince him and Khai to join her as members of the Ones, offering to make Skywalker the \"Prince of Light.\" Ben Skywalker refused, and with Khai's help was able to defeat her. Upon learning soon afterward of Khai's earlier betrayal of the Solos, however, the young Jedi was very distraught; he and Jaina Solo attempted to capture her, but she escaped in Ship."}, {"tag": "h3", "text": "Jaina Solo"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Jaina Solo, daughter of Leia Organa Solo and Captain Han Solo, rose to the rank of Jedi Knight during the Yuuzhan Vong War, when she was also proclaimed by her uncle Luke Skywalker to be the Sword of the Jedi. During the Second Galactic Civil War, she was forced to kill her brother, Jacen Solo, after he turned to the dark side and became Darth Caedus. During the time of the emergence, she found herself in a complicated relationship with Imperial Remnant Head of State Jagged Fel, made difficult due to their conflicting duties. After temporarily breaking off their engagement, Jaina Solo left the political tension on Coruscant between Daala and the Jedi Order in order to help the Skywalkers in their dealings with the Sith. She tracked them to Klatooine, where she met up with Lando Calrissian and eventually joined the allied Sith and Jedi fleet. While the Skywalkers and the Sith battled Abeloth, Solo piloted her StealthX in combat with Ship."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "She later fought off an ambush by Sith pirates and returned to Coruscant to inform the Order of the true extent of the Sith threat. Later, when the Tribe commenced Operation Shieldfall, Jaina Solo led Gray Squadron in the ambush of the Sith forces. After Vestara Khai and the Skywalkers escaped from the Sith on the surface, Luke Skywalker joined Solo in Gray Squadron in pursuit of Ship and Abeloth. Though Ship was damaged, the Meditation Sphere managed to escape with Abeloth intact. Solo went on to join the Skywalkers and Khai aboard the Jade Shadow in their ensuing search for Ship on various Sith worlds. Solo was later part of the Jedi strike team sent to liberate Coruscant, and during the assault on the Jedi Temple—when Solo, Luke Skywalker, and Master Corran Horn believed they would almost certainly die—the Grand Master promoted Solo to the rank of Jedi Master. Upon learning of Ben Skywalker's kidnapping, she and Luke Skywalker immediately launched after him, and she battled Ship once more in the Maw. Afterward, Solo married Jagged Fel, who had ceded his bid for election as Head of State of the Empire in order to ensure Daala's defeat in the same election."}, {"tag": "h3", "text": "Saba Sebatyne"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Saba Sebatyne was a Barabel Jedi who rose to a prominent position in the Jedi Order during the Yuuzhan Vong War; she founded and led the all-Force-sensitive Wild Knights squadron, and at the end of the war was made a Jedi Master and granted a seat on the Jedi Council. In that capacity, she helped lead the Jedi through the Dark Nest Crisis and the Swarm War—during which time she trained Leia Organa Solo to Knighthood—as well as the Second Galactic Civil War. While the Sith on Kesh prepared for their invasion of the galaxy and Grand Master Luke Skywalker was exiled from Coruscant, Sebatyne and the other Masters who remained on the world faced the increasingly anti-Jedi policies of the Natasi Daala administration and the problem of Jedi falling prey to Abeloth's Force psychosis. Interim Grand Master Kenth Hamner took a non-confrontational stance and attempted to avoid conflict with the Galactic Alliance, but his policies were unsuccessful, and Sebatyne began to call for a stronger front against Daala."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Furthermore, when the Order became aware of the Sith threat, the Masters arranged the launch of a fighter wing to assist the Skywalkers. Hamner tried to prevent the launch and attacked Sebatyne, and in the ensuing skirmish, he fell to his death. The Masters then insisted that Sebatyne become interim Grand Master, and she reluctantly accepted the role. She then led the Order to oust the Daala administration and put a triumvirate in its place. With the anti-Jedi government gone, Skywalker's exile was ended, and Sebatyne gladly gave up her position of Grand Master. Sebatyne served on the Triumvirate until the Jedi left Coruscant for their mission to Upekzar. During the liberation of Coruscant, Sebatyne led a group of several Knights to hunt down the Sith who did not retreat into the Jedi Temple. She later led Tahiri Veila and a unit of Void Jumpers to defeat Abeloth's manifestation inside the Temple's computer core; after they forced Abeloth from the core, Sebatyne killed the entity."}, {"tag": "h3", "text": "Allana Solo"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Allana Solo was the daughter of Hapan Queen Mother Tenel Ka Djo and Jedi Knight Jacen Solo. As the Chume'da—the heir to the Hapan throne—she came under attack on numerous occasions. The Second Galactic Civil War was a time of turmoil for the young Solo; her father fell to the dark side of the Force while trying to prevent a vision he had seen of his daughter and a Sith Lord together on the Throne of Balance. During the war, Jacen Solo—now Darth Caedus—kidnapped her and revealed that he was her father; later, when the young Solo was rescued, Han and Leia Solo discovered their relation to the girl. Near the end of the war, the Council of Moffs targeted the Hapan royal family with a nanovirus, causing Djo to stage her daughter's death and send her to live with Han and Leia Solo as a war orphan named \"Amelia.\" While the Lost Tribe grew in power, Allana Solo accompanied her grandparents on a mission to the planet Kessel, during which she felt Abeloth reaching out to her. She later adotped a pet nexu cub, Anji, with whom the girl formed a close bond."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Meanwhile, Sarasu Taalon saw the young Solo ruling over the galaxy on the Throne of Balance; he demanded to know the identity of the Jedi queen, causing a split in the Tribe's weak alliance with the Skywalkers. Gavar Khai then developed the Jedi Queen project to eliminate the Jedi queen. The Sith discovered that Djo closely resembled the queen, and Querdan Dei succeeded in locating Djo and deducing Solo's identity, but he was unable to kill either of them. Allana Solo was later present for the evacuation of Ossus, during which she had a vision of a secret Barabel nest in the Jedi Temple being attacked. She convinced her parents to return to Coruscant, where they met with Bazel Warv and planned to rescue the Barabels. However, the Sith ambushed them, and Warv was killed protecting the young Solo. Nevertheless, the young Solo succeeded in helping to save the Barabels and their younglings. Later, during the marriage of Jaina Solo and Jagged Fel, Allana Solo's true identity as Chume'da was revealed to the galaxy."}, {"tag": "h2", "text": "Other key figures"}, {"tag": "h3", "text": "Ship"}, {"tag": "p", "text": "Ship was a Sith Meditation Sphere—a Sith warship used by the Sith Empire to teach apprentices how to fight—that was programmed with a male personality. The vessel was unearthed by Ben Skywalker during the Second Galactic Civil War on the planet Ziost; Skywalker flew Ship to his then-Master, Jacen Solo, who presented it to his secret Sith Master, Lumiya. Ship intervened on behalf of Lumiya's Sith numerous times throughout the war, and after Lumiya's death, the Dark Jedi Alema Rar controlled the vessel. When Rar was killed, Ship fled to find a more suitable master. Dician, a member of the One Sith, attempted to recruit Ship, but the Meditation Sphere refused, and instead found the Lost Tribe of Sith on Kesh. Ship first contacted Vestara Khai, due to the girl's ambition. The vessel then began to help the Tribe capture vessels to form a new armada and plan out their invasion. However, Abeloth's will overcame Ship's, causing the vessel to suddenly leave Kesh for Abeloth's world. The Tribe's strike team sent to recover Ship and kill the Skywalkers ultimately failed on both accounts."}, {"tag": "p", "text": "Later, when the Sith allied with the Jedi to confront Abeloth, Ship battled the Jedi Jaina Solo in orbit over Abeloth's world. With the entity's defeat, Ship was freed from her control. The Sphere fled, but Abeloth's will soon overcame Ship once again, and she used the vessel to pit the Jedi and Sith against each other. After Abeloth fled Pydyr in Ship, the Sphere attempted to assault Khai and the Skywalkers on Nam Chorios, but failed to kill them. When Abeloth was forced to flee Nam Chorios in Ship, she took the vessel to Kesh, feigning an alliance with the Sith. Upon her betrayal of the Sith, she again fled in the Sphere. After rising to power on Coruscant, Abeloth took Khai and Ben Skywalker with her in Ship to her planet to try and convince them to join her. Solo meanwhile confronted Ship in the Maw, but Abeloth was destroyed, and Ship fled the fight. The Meditation Sphere returned to Vestara Khai and rescued her from the Jedi, promising to take her to another faction of Sith."}, {"tag": "h3", "text": "Darth Krayt"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "The man who eventually became the Sith Lord Darth Krayt was born A'Sharad Hett, the son of a Jedi named Sharad Hett. A'Sharad Hett served the Jedi Order during the Clone Wars, and by the end of the conflict he had attained the rank of Jedi Master. Hett survived Order 66, which began the purge of the Jedi Order, and returned to his homeworld, Tatooine, where he began to amass an army of Tusken Raiders. However, Hett came into conflict with the Jedi Obi-Wan Kenobi, who forced him to leave the planet. Hett then found the holocron of the Sith Lord XoXaan, who taught him the ways of the dark side. He was captured by the Yuuzhan Vong shortly before their invasion of the galaxy, and in their custody he met the Jedi-turned-Sith Vergere, who further assisted him in his dark side training. Hett ultimately escaped the Yuuzhan Vong and traveled to the planet Korriban, where he took the name Darth Krayt. There, Krayt instituted the Rule of One, a Sith doctrine allowing for a full Sith Order, as opposed to the previously dominant Order's Rule of Two, which allowed for only two Sith at any point in time."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Krayt became the ruler of the One Sith, who hid with him on Korriban and grew in strength while the Jedi remained unaware of them. Prior to the Second Galactic Civil War, Jacen Solo saw his daughter standing alongside Krayt on the Throne of Balance; Solo's attempt to prevent that future ultimately resulted in his fall to the dark side of the Force. During the Civil War, Luke Skywalker also saw visions of Krayt; however, at the time he assumed that the man he saw was his nephew, Jacen Solo. Later, as Abeloth rose to power in 44 ABY, Krayt became aware of the entity and knew that he had to stop her. he was also aware that the rest of the Ones were dead, and that the only way to defeat the deity was by the combined power of Sith and Jedi. As such, he traveled to Coruscant, where he looked on as Abeloth, the Sith, and the Jedi fought at the Jedi Temple. He then traveled beyond shadows, where he met Luke Skywalker. Krayt tried to hint that he was a member of the Sith Tribe, but Skywalker recognized that he was not, which meant that there was another Sith faction in the galaxy. Nevertheless, they agreed to work together, and successfully destroyed Abeloth beyond shadows. Krayt then returned to the One Sith and ultimately led them to invade the galaxy in 127 ABY; and by 130 ABY they had achieved galactic dominance in the form of a new Empire."}, {"tag": "h3", "text": "Jagged Fel"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Jagged Fel, the son of Soontir and Syal Antilles Fel, was raised with the Chiss of the Empire of the Hand in the Unknown Regions. He helped the New Republic in their fight against the Yuuzhan Vong, during which time he began a relationship with the Jedi Jaina Solo. After the war, Fel returned to the Chiss and eventually led them into the Swarm War against the Killiks. At the end of the war, he was shot down and stranded for two years on the planet Tenupe, and subsequently exiled by the Chiss for releasing the Jedi Lowbacca against their will during the Dark Nest Crisis. Fel assisted the Jedi during the Second Galactic Civil War—he defeated Alema Rar, and after the war ended, Fel became the Imperial Head of State. In 43 ABY, Fel came to Coruscant for the Unification Summit to discuss uniting Hapes, the Galactic Alliance, and the Imperial Remnant."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "There, he became engaged to marry Jaina Solo and assisted the Jedi in their struggles against the Daala administration. Fel first became aware of the Lost Tribe when Solo revealed to him that the Skywalkers had encountered a Sith threat, although he initially could do nothing to help the Jedi without risking war with the Galactic Alliance. When he next met with Solo, she detailed the events of the Sith's emergence to him. Fel later returned to Imperial Space, where he employed Tahiri Veila as an Imperial Hand and battled the forces of Daala, who had been ousted from the Galactic Alliance. Abeloth, in the form of Lieutenant Pagorski, ultimately convinced Daala to instead call for an election. Fel tasked Veila with hunting down Abeloth, and he ultimately withdrew from the election in order to ensure the victory of Admiral Vitor Reige over Daala. Reige gave Fel the Parting Gift, which Fel then piloted on Coruscant for the assault on the Sith and Abeloth in the Jedi Temple. Afterward, Fel married Jaina Solo."}, {"tag": "h3", "text": "Tahiri Veila"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Tahiri Veila was a Jedi Knight who had served the New Jedi Order since before the Yuuzhan Vong War. During the war, she was captured and experimented upon by the Yuuzhan Vong, brainwashing her into believing she was the Yuuzhan Vong \"Riina Kwaad.\" She was rescued by her friend Anakin Solo, youngest brother of Jacen and Jaina Solo, but he was killed during the war, and her grief resulted in the resurfacing of her Riina Kwaad personality. She was ultimately able to mentally join with the Kwaad personality and gain control over herself again. Nevertheless, her grief over the death of Anakin Solo did not pass, causing her to fall to the dark side and become the apprentice of Darth Caedus during the Second Galactic Civil War. While Caedus was killed at the end of the war, Ben Skywalker dueled and redeemed Veila."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Veila then became a bounty hunter, but in 43 ABY she was arrested and put on trial for killing Admiral Gilad Pellaeon during her time as a Sith. Veila was ultimately sentenced to death, and Daala was soon overthrown and placed in the same prison as Veila. When Daala made her escape from the prison, Veila managed to flee with her. Veila first went to see Han and Leia Solo, who sent her to Jagged Fel. Fel employed her as first his personal bodyguard, and later more actively as an Imperial Hand. She assisted Fel during his battle with Daala's forces, but when the battle was cut short by the arrival of Abeloth, Fel dispatched Veila to hunt down the entity. Veila found Boba Fett at the Moon Maiden mine on Hagamoor 3, where they discovered Abeloth—in the body of Imperial Lieutenant Lydea Pagorski—had set up her base. With Pagorski's body quickly deteriorating, Abeloth attempted to consume Veila, but she and Fett succeeded in destroying Abeloth's body. Later, Veila accompanied Fel to the Jedi Temple on Coruscant, where he relinquished her of her duty and encouraged her to return to the Jedi Order. She joined Master Sebatyne and a group of Void Jumpers on a mission to destroy Abeloth's consciousness in the Temple's computer core, and they ultimately succeeded."}, {"tag": "h3", "text": "Boba Fett"}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Boba Fett was a clone of the renowned bounty hunter Jango Fett. Raised by Jango Fett until the bounty hunter's death at the outbreak of the Clone Wars, Boba Fett followed his father's footsteps and became a bounty hunter himself. As his father had been killed by a Jedi, Mace Windu, Fett held a grudge against the Jedi for his entire life. During his life, Fett collected bounties for crime lords, the Galactic Empire, and other various individuals. At one point he hunted down the leader of the Mandalorians, Fenn Shysa, whose dying request was for Fett to take his place as Mandalore. When the Yuuzhan Vong invaded the galaxy, Fett and the Mandalorians played an integral part in the war against the species. Later, during the Second Galactic Civil War, Fett learned that he was terminally ill. After his daughter was killed by Caedus, Fett ultimately offered to help the Coalition against the Galactic Alliance, and even agreed to train the Jedi Jaina Solo in preparation for her fight against her brother. Although Fett was ultimately cured from his illness, the Imperial Remnant, at the behest of Caedus, deployed a nanovirus targeting the Fett gene onto the Mandalorian homeworld, so that Fett could never return."}, {"tag": "p", "text": ""}, {"tag": "p", "text": "Fett did not become involved in the emergence until late in the conflict. Following the deposing of Daala and her incarceration in the Armand Isard Correctional Facility on Coruscant, Fett helped her escape the prison; and Daala's fellow inmate, Tahiri Veila, escaped with them as well. Afterward, Fett tracked down the scientists who had created the nanovirus and deployed it on the Mandalorian homeworld. His search took him to the Moon Maiden mine on Hagamoor 3, where Veila, who was hunting Abeloth, found him. The dark side entity had set up a base in the mine, and Fett and Veila worked together to complete both of their missions. Fett received the information about his nanovirus that he had been hoping to find, and he and Veila destroyed one of Abeloth's bodies."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lost Tribe of Sith and its plans to conquer the galaxy first appeared in Christie Golden's Fate of the Jedi: Omen, the second novel of the nine-part Fate of the Jedi series, co-authored by Aaron Allston and Troy Denning. The Tribe and its invasion went on to appear in each subsequent novel in the series, as well as \"First Blood,\" a short story by Golden set during Omen. The backstory of the Lost Tribe was further detailed in John Jackson Miller's Lost Tribe of the Sith eBook series, as well as briefly in Paul S. Kemp's Crosscurrent. The emergence was also mentioned in Golden's post-Fate of the Jedi short story, Getaway."}, {"tag": "p", "text": "Although the Tribe's forces on Coruscant were shown to be defeated in Denning's Fate of the Jedi: Apocalypse, the final installment in the Fate of the Jedi series, it was not stated how many Sith remained on Kesh—nor whether or not they possessed any working vessels with which they could continue offworld travel. Thus, whether or not the emergence ended after the liberation of Coruscant—or whether or not the Tribe was even capable of continuing their emergence—is currently canonically unknown. As such, this article presents the results of the war based on the events up to that point."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}