{"url": "Lost_Tribe_of_Sith", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Secret societies", "Category:Sith organizations", "Category:Tribes", "Category:Wild Space organizations"], "nodes": [{"tag": "h1", "text": "Lost Tribe of Sith"}, {"tag": "p", "text": "The Lost Tribe of Sith was a marginal Sith Order that formed on the remote planet Kesh. It was founded in 5000 BBY after the warship Omen, carrying members of Sith Lord Naga Sadow's Sith Empire, was ambushed, knocked off-course, and forced to crash-land on the world. The Tribe quickly dominated the native Keshiri species, who believed the newcomers to be their gods. Sith Captain Yaru Korsin became Grand Lord of the Tribe and of the Keshiri, a title that was passed on to his daughter, Nida, after his death. Isolated from the outer galaxy for years, the Sith built a Temple in the Takara Mountains over the Omen's crash site and moved their headquarters to the capital city Tahv. Although the original Tribe consisted of several members of both the Human and Sith species, Yaru Korsin ordered a purge of all members of the latter in 4985 BBY. Over time, the Sith formed a ruling Circle of Lords, made up of Lords and High Lords, and ruled by the Grand Lord. Although one Jedi Knight, Jelph Marrian, discovered the Sith in 3963 BBY, the destruction of his strikefighter permanently stranded him on the world as well."}, {"tag": "p", "text": "The Sith remained isolated for millennia, largely unaware of the state of the galaxy and the Sith, but after the end of the Second Galactic Civil War in 41 ABY, the Sith Meditation Sphere Ship found the Tribe. Ship informed the Tribe of the Jedi's newfound dominance in the galaxy and of the recent destruction of the last remnants of the Sith Order. Ship assisted the Tribe in traveling offworld and forming a new armada, and two years later, the Tribe felt the presence of Jedi Grand Master Luke Skywalker in the Force and determined to kill him. However, Ship was suddenly overcome by the will of Abeloth, a dark side entity living in the Maw, and deserted Kesh for Abeloth's world. The Sith quickly launched a strike team to recover Ship and assassinate Skywalker. The team encountered Abeloth in the Maw, and she weakened the strike team before allowing Ship to return to them so that they could continue on their mission. Their attack on the Jedi failed, however, and Skywalker and his son Ben tracked Vestara Khai, the team's sole surviving member, to the planet Dathomir. There, a team led by Viun Gaalan captured a group of the darksider Nightsisters and dueled with the Skywalkers while attempting to retrieve Khai, although again the Sith were defeated."}, {"tag": "p", "text": "Shortly afterward, a fleet led by High Lord Sarasu Taalon convinced the Jedi to form an alliance against Abeloth, who was causing a psychosis among the Jedi Knights. The allied mission resulted in the Sith betraying the Jedi in hopes of killing the Skywalkers and forcing Abeloth to serve them, but the Sith failed yet again to kill the Jedi. Abeloth was defeated, and the Jedi and Sith temporarily repaired their alliance in order to learn more about her origins. However, the alliance was soon broken, and a later confrontation between the two parties and Abeloth resulted in the death of Taalon. Meanwhile, the Sith perfected their piracy techniques and built a war fleet in preparation to conquer the galaxy."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Foundation of the Lost Tribe (5000 BBY)"}, {"tag": "h4", "text": "Subjugation of Kesh"}, {"tag": "p", "text": "In 5000 BBY, the Sith dreadnaught Omen was ambushed while mining Lignan ore for use in Sith Lord Naga Sadow's planned Sith invasion of the galaxy. As the warship fled into hyperspace, however, it collided with the fellow Sith vessel Harbinger, knocking it off-course and causing it to crash land on the remote Wild Space planet Kesh. The Sith soon evacuated the crash site, which was located in the midst of the Cetajan Mountains. However, the Omen's captain, Yaru Korsin, returned to the crash site to try to send a transmission in the hopes of being rescued. However, his half-brother, Devore, was already there, and insisted that since they had failed Sadow's orders, they would be killed. Devore attacked Yaru, and in the ensuing duel Devore was thrown off the edge of a cliff to his death. Yaru Korsin also discovered that the ship's transmitter had been destroyed."}, {"tag": "p", "text": "By the end of their second day on Kesh, the Sith's entire complement of Massassi workers had died. The survivors of the crash soon after met a member of the native Keshiri species, Adari Vaal, who had been branded as a heretic by her people for her geologic teachings and had witnessed on her Uvak the death of Devore. With the aid of Vaal, Korsin tricked the natives into believing that the survivors were the Skyborn, the legendary gods of the Keshiri. Korsin was proclaimed as the Grand Lord of the Skyborn, and the Sith began to mine for the metals needed to repair their vessel, although Vaal knew that the metals needed to repair the Omen—if they existed on Kesh at all—would be buried deep beneath the planet's surface. Indeed, the appropriate metals were never found, and the materials needed to upkeep many of the Sith's technologically advanced equipment were unattainable on Kesh. Nevertheless, the Tribe constructed a Sith Temple over the Omen's crash site in the Cetajan Mountains, which were renamed the \"Takara Mountains\" after Grand Lord Yaru Korsin's mother, Takara. The Sith themselves established rule over the Keshiri, who willingly submitted themselves to an eternity of servitude."}, {"tag": "h4", "text": "Purge of the Red Sith"}, {"tag": "p", "text": "Among the roughly three hundred shipwrecked, all of the survivors of the Omen's crash were members of the Human or Sith species, except for one surviving Houk. However, the members of the Sith species—known as the \"Red Sith\"—were unable to reproduce; none of their offspring lived past their first day. Unbeknownst to any of the other Sith, Seelah Korsin—the widowed wife of Devore Korsin who had since remarried to Yaru Korsin—ensured the deaths of all of the Red Sith offspring in hopes of making the Tribe purely of a Human bloodline. Meanwhile, the surviving Red Sith—who had taken the moniker the \"Fifty-Seven\"—feared that their inability to reproduce was due to Kesh itself, and thus pushed for the Tribe to work toward finding a way to leave Kesh. To that end, fifteen years after the Omen's crash landing, when Grand Lord Korsin gave the spokesperson for the Red Sith, Ravilan, the assignment of examining eight Keshiri villages along the Ragnos Lakes, Ravilan decided to poison the Keshiri. He had recently discovered that cyanogen silicate—a cauterizing agent that had been used by the Massassi aboard the Omen—was deadly to touch for the Keshiri, but had no adverse effects on the Red Sith. Ravilan and the other Red Sith traveled first to Tetsubal, the village farthest from the Sith Temple in the Mountains, where Ravilan introduced the cyanogen silicate into the town's aqueduct systems. Tetsubal's entire Keshiri population was killed, along with Ravilan's Human aide."}, {"tag": "p", "text": "Ravilan sent a message to the Sith Temple through the Force, and Yaru and Seelah Korsin quickly responded. Upon their arrival in Tetsubal, Ravilan lied that he had arrived to find the entire village already dead, and he suggested that, since the plague could also affect Humans, the Sith should cut off all contact with the Keshiri immediately. As the Grand Lord recalled all Sith in the Tribe to the Takara Mountains and sent out reconnaissance fliers to see if the plague had spread, Seelah Korsin—who had discovered Ravilan's treachery—decided to use the cyanogen silicate to her own political advantage. She introduced the silicate first to the village Rabolow, and then to more and more of the villages on the Ragnos Lakes. She then persuaded her husband that it was Ravilan and the Red Sith who were spreading the plague. Convinced that they were plotting against him, Yaru Korsin ordered for a purge of all of the Red Sith on Kesh. Taken completely by surprise, the Red Sith were quickly hunted down and wiped out; the Grand Lord and his chief lieutenants soon cornered the last surviving members of the species at the precipice where the Omen had crashed, and those who surrendered were thrown off the cliff to their deaths. Ravilan, the last surviving member of his species, was soon after captured by Seelah Korsin and tortured. She confirmed that she had seen to the deaths of all of the Red Sith babies, and that she was behind the poisoning of the Keshiri towns and the Red Sith massacre. She then had Jariad—her son from her marriage with Devore—kill Ravilan. However, Seelah herself had played into the hands of Adari Vaal, who had begun to lead an underground resistance movement to rid the Sith from Kesh—Vaal felt responsible for her species' subjugation fifteen years earlier, and desired to personally remove the Tribe from her homeworld. After the Purge, Seelah also erased the Tribe archives of all entries about the Sith species and about the slave status of the human survivors of the Omen in the Sith Empire."}, {"tag": "h4", "text": "Korsins' legacy"}, {"tag": "p", "text": "In 4975 BBY, on the twenty-fifth anniversary of the Tribe's arrival on Kesh, Korsin held Dedication Day to celebrate the Tribe's arrival and show that the Sith were not going to leave Kesh. The fact that Sadow had not found them after twenty-five years and that the planet did not have the materials required to repair the Omen led Korsin to resign himself to the belief that the Sith could never leave Kesh. This was why the Sith had left their Temple in the Takara Mountains to settle more comfortably into Tahv, which had become the Sith capital. Furthermore, in a population which counted at this time nearly six hundreds Sith, Korsin had hierarchized the commandment of the Tribe, founding the Circle of Lords, which was filled with the High Lords and Sith Lords that the Grand Lord had appointed, while Tahv structures were reorganized to accommodate the new institutions. The eugenics programs of Seelah Korsin had also introduced in a tribe now exclusively human, with the exception of the old Houk Gloyd, a worship for racial purity and physical perfection. Meanwhile, the Tribe continued to dominate the Keshiri; the native species was not allowed to ride uvak—a reptavian species that had been domesticated and used for travel on Kesh for millennia—and the majority of the natives still worshiped the Sith as their gods. However, Adari Vaal's resistance movement continued to grow stronger, and she plotted to steal all the Uvaks of Keshtah to prevent the increasing number of Sith from governing their continental domain and thus bring down their grip on the Keshiri, who were much more numerous and scattered in hundreds of villages."}, {"tag": "p", "text": "An opportunity of rebellion which presented itself when Seelah Korsin set off her plan for revenge against Korsin in order to put Devore's son, Jariad, on the throne of Kesh. The young High Lord had discreetly united the former allies of his father and Sith convinced by rumors about the incompetence of the Grand Lord into his corps of Sith Sabers, while Seelah monitored Nida, the despised daughter that she had with Korsin, ensuring that she was not properly trained and away from the capital so she couldn't become a rival to her half-brother. Taking advantage of a the visit of the temple by Yaru Korsin, who came to make sure everything was in order after the departure of the last Sith to Tahv, Seelah launched the attack with Jariad and his Sabers, while the Keshiri resistance, using Seelah as a decoy, went into action. Accompanied by Gloyd and four bodyguards, Yaru Korsin was surrounded by two dozen of Sith Sabers led by his treacherous relatives, when the theft of the Sith Temple uvaks by the Keshiri, allowed him to gain a little time."}, {"tag": "p", "text": "But during the battle, Korsin was separated from his protectors and cornered on the cliff from which he had pushed his brother twenty-five years earlier. While Jariad Korsin was preparing to give him the coup de grace and thus avenge his father, Nida arrived with her Skyborn Rangers and moved to the aid of the fatally wounded Grand Lord. Unfortunately for Seelah and Jariad, if Korsin had not planned the rebellion of Adari, the Grand Lord saw through their intrigues and had secretly prepared Nida to succeed him. In fact, unbeknownst to Seelah who only saw Nida as a means for her and Jariad to stay close to the Grand Lord, Yaru Korsin had staged the death of some of his most trusted Sith so that they could train Nida in the dark side of the Force, while the function of Sith ambassador to the Keshiri, imagined by Seelah to keep her daughter away, had allowed Nida to form a network of influence among both Keshiri as well as among the Sith faithful to her father. It was thanks to her spies that Nida Korsin was made aware of the plans of the Keshiri resistance, which she had succeeds to thwart in Tahv before coming to the Temple as agreed with her father, to confound her mother and her half-brother and eliminate the members of the conspiracy."}, {"tag": "p", "text": "Nida Korsin and her followers eradicated Jariad and his forces, but they arrived too late to save Yaru Korsin. Regarding Seelah, who had lost the use of her legs during the last stand of Gloyd, she was abandoned in the Sith Temple now sealed after her daughter had telling her elevation to the rank of Grand Lord in accordance with the last wishes of Yaru Korsin, ratified by the surviving High Lords. As for her father who was celebrated with the Testament Day, Korsin went on to became a legendary figure of the Tribe, initiating a golden age for the Sith of Kesh which was later celebrated though the Festival of Nida's Rise. She died in 4896 BBY, after a seventy-nine years tenure, having instituted a succession based on merit instead of heredity when her son, Donellan, waited too long to make his move and died."}, {"tag": "p", "text": "Concerning the Keshiri Resistance, the plan of Adari Vaal which was to take all the stolen uvaks over the deep seas, when exhausted they would crash and drown with their riders, while on the continent the remaining members of the resistance would kill all the remaining uvaks and the major Sith sympathizers before members of the tribe could intervene, succeeded all across the continent with the exception of Tahv. Because of the betrayal of Vaal's own son, Tona, whom for love Nida Korsin had revealed the Resistance plan to the Sith one day before its execution, the Lost Tribe managed to keep the uvaks of the capital. Defeated, Adari and her disciples flew to a certain death over the western ocean of Keshtah, but against all odds the resistance leader and approximately three hundred Keshiri survived the travel and settled on an unidentified inhospitable island, while the humans believed them dead."}, {"tag": "p", "text": "Indeed, if in the annals of the history of the Tribe of the Sith the slaves were exclusively Keshiri, the situation changed after the end of the Korsin bloodline, when a rebellion led by Ermon Parrah tried to steal the crippled Omen and return to the stars. Defeated by Sith loyal to the Grand Lord, the conspirators and their families were put into slavery, creating over the decades an intermediate class of enslaved humans, which mixed with heirs of the non-Force-sensitives members of the Omen crew."}, {"tag": "h3", "text": "The Time of the Rot (3960 BBY)"}, {"tag": "h4", "text": "Fall of the Kitai House"}, {"tag": "p", "text": "Over the next millennium, the successors of the Korsins relayed each other, Grand Lord after Grand Lord, to guide the Tribe through its golden age. This delicate balance of power was preserved by several Sith factions and thus allowed the order envisioned by Yaru Korsin to thrive on Kesh. However, in 3960 BBY, the legacy of Korsin began to falter, when the Red Faction of High Lord Dernas and the Gold Faction of High Lord Pallima, unable to reach agreement placed the old High Lady Lillia Venn on the throne, waiting to settle their differences. This precarious agreement was not to the liking of Venn, who launched a plan to ensure her survival, while getting rid of the two factions and Candra Kitai, the newest High Lady. While Kitai had not chosen a side, Venn feared that even if she did not become the next Grand Lord, she would determine the next successor. Thus, during a Rake-riding held on Donellan's Day, the champion of the Kitais, Campion Dey was driven to attack the Grand Lord who eliminated him and put the blame for the assassination attempt on her political rivals and Candra Kitai. While Dernas and Pallima were publicly executed, High Lord Kitai and her daughter, the Sith Saber Orielle Kitai, were stripped of their titles and their properties and reduced to the status of slaves, serving as a living example for the enemies of Venn."}, {"tag": "p", "text": "Shaken by the loss of her status, Orielle fled on her uvak in the Highlands, to Jelph of Marisota, a human slave she had met a few months ago and valued for his expertise in horticulture and for the absence in him of the fearful servility which was shown by the other slaves. Thanks to the help of Jelph, Orielle understood the plot of Venn but was convinced by him to remain hidden in order to not satisfy the plans of Venn of serving as a scarecrow against her enemies. Kitai remained for several days with Jelph, developing a romantic relationship, but during the tenth day the Luzo brothers, two Sith Sabers rivals of Orielle and loyals to Venn, found her tracks while Jelph was absent and under threat, killed her uvak and took her lightsaber on the grounds that slaves could not possess these status systems. Mocking Orielle, the two brothers left after giving her a shovel from Venn for her new life. Kitai descended into a fit of rage and wrecked Jelph's house before assaulting the manure heap in the barn."}, {"tag": "p", "text": "There, the young Sith discovered an Aurek-class tactical strikefighter buried under the building. Jelph of Marisota was in reality the Jedi Knight Jelph Marrian working for the Covenant, a secret Jedi organization devoted to the tracking of all Sith influences in the galaxy, who had fled in the uncharted regions after the Covenant have been outlawed by the Jedi Order and crashed on Kesh in 3963 BBY due to a meteor storm. Seeing this discovery as a way to restore the status of her family and to liberate the Tribe from its prison, Orielle left for Tahv in order to find Candra, whom she discovered picking up the uvaks dejections in the city zoo. Broken, the former High Lady refused at first to believe her daughter, but given the insistence of Orielle gave her the means to contact the surviving High Lords and the secret phrase indicating a Kesh-shaking discovery. Having delivered the message to an intermediary, she was confronted by Jelph Marrian who had discovered the excavated ship and had followed Orielle into Tahv in order to prevent her from revealing his secret to the Sith. Conditioned by her dark teachings and using a lightsaber she had stolen from a zoo guard, Orielle engaged a duel with her lover, but was quickly disarmed by the former Covenant Shadow who revealed that the Sith Empire was defeated and attempted to convince her that she was different from the other Sith."}, {"tag": "p", "text": "Convinced by his love for her that she had perceived in Jelph through the Force, Orielle Kitai decided to abandon her project and help the Jedi to prevent her Sith brothers from discovering the starfighter, so she warned Marrian that even if the high lords didn't know about the ship, they were about to travel to the farm on her invitation. The plan was to provide the Lords with the only four functional blasters of the planet which were hidden by Jelph, then run away with the undiscovered ship which Jelph had finished to repair. They stole an uvak but arrived too late since several Sith had pursued them to the farm. These visitors turned out not to be the High Lords but consisted of Grand Lord Lillia Venn and her entourage, which included the Luzo brothers. In fact, Kitai had been betrayed by her mother who had not believed her report and had informed the Grand Lord in return for \"improved working conditions.\""}, {"tag": "p", "text": "Kitai was captured but Marrian attacked the Sith holding her. Meanwhile, Lillia Venn boarded the ship and attempted to do a take-off. However, Jelph had already planted explosives beneath the starship which detonated, killing Lillia and her followers while destroying the entire farm. Jelph and Orielle managed to escape the explosion by jumping into the Marisota River. Following the events of the so-called Night of the Upside-Down Meteor, Jelph Marrian and Orielle Kitai, exiled themselves to the virgin jungles of Keshtah where they founded their own family, having both renounced the eternal struggle between the light and dark sides after Jelph had intercepted a Republic transmission communication announcing the rise of Darth Revan. Despite the succession of Candra Kitai to the Grand Lordship after the death of Venn, almost a millennium of civil war and anarchy known as the Time of the Rot accompanied Venn's disappearance. For the next 960 years, several Sith factions emerged and battled for supremacy in a succession of Grand Lords and Anti-Lords."}, {"tag": "h4", "text": "Threat of extinction"}, {"tag": "p", "text": "For nearly a thousand years the Sith Tribe tore themselves apart and destroyed the hierarchy that had been painstakingly established by Yaru Korsin. Many Keshiri were conscripted by the various Sith factions into their armies. As a result of centuries of infighting, the Tribe had been reduced to a few thousand individuals by 3000 BBY. No longer preserved and ravaged by a millennium of civil war, Tahv itself threatened to collapse, with the exception perhaps of the Office of the Caretaker, which was built by Nida to keep track of the Tribe History and was of no importance for the rival factions. The only time that the various Sith factions met peacefully was during Testament Day, a day which fell every twenty-five years where the Testament of Yaru Korsin was read to the Sith leadership. Prior to the Testament Day ceremony in 3000 BBY, Iliana Merko and her Sisters of Seelah attempted to coerce the incumbent sixty years old Caretaker, Varner Hilts, into falsifying the Testament in order to restore Seelah's place in the Tribe's history and to advance their own interests."}, {"tag": "p", "text": "Tired of their infighting, the Sith were looking for a leader capable of uniting the Tribe and each faction leader exploited the truce established during the Testament Day to strengthen his legitimacy. However, Hilts was not able to falsify the Testament because it was read from a holocron recording of Yaru Korsin. While the Sisters held the Caretaker and his Keshiri assistants hostage for the next four days, the other Sith factions learnt of Seelah's occupation of the Kesh capitol building through their spies. These factions camped on the palace grounds. Two of these factions, the Korsinite League of Korsin Bentado and Force 57 of Neera, attacked the Sisters of Seelah. Using the calculations of his Keshiri assistant, Jaye Vuhld, who had detected a difference of one second between a day on Kesh and a Galactic Standard Day, Varner Hilts was able to legally declare the Pantheon's Peace eight days early to stop the confrontation."}, {"tag": "p", "text": "Following the reading of Korsin's Testament, the leaders of the twenty Sith factions began to fight among themselves. Hilts discovered that the Testament had been recorded over an older recording, which turned out to be a recording of Naga Sadow ordering Yaru Korsin to transport lignan crystals to his forces on Kirrek during the Great Hyperspace War. The Sith also re-discovered the true identity of the \"Red Sith\", who had been Ravilan Wroth and the \"Other Fifty-Seven.\" Seelah and Yaru had attempted to cover up the true history of the Tribe and had instead promoted the myth that the Tribe had been great conquerors who had come to Kesh willingly. This revelation shocked the Sith who decided to destroy the holo-recorder so that Keshiri would never learn that their godly masters were in reality only runaway slaves dominated by an alien species. But a spectator could not help talking about it and the truth spread like wildfire, triggering eight days later a destructive madness in humans, who killed each other and sacked everything under the frightened eye of the Keshiris who were hiding wherever they could."}, {"tag": "p", "text": "Convinced by a cryptic reference in the Testament of a hidden secret behind the throne of Korsin, Varner Hilts and his trusted Keshiri servant Jaye Vuhld traveled to the Kesh Sith Temple in order to unseal the Omen and save the Sith Tribe from a collective suicide. After crossing the ten-meter high blocks which sealed the Sith Temple, Hilt and his clerk arrived at the Temple where they discovered Iliana Merko weeping over the remains of Seelah, who had died alone in the Sith Temple. Iliana also confided that she had experienced visions of Seelah washing the feet of the ancient Sith Lord Ludo Kressh. Varner managed to recruit Iliana into his team and they explored the Omen but found that Korsin had moved his command chair, or throne, to the planetarium at the top of the temple. Meanwhile, the various Sith factions abandoned their differences and decided to work together for the last time to destroy the Omen, which now became a symbol of their enslavement and imprisonment on Kesh. Bentado, Neera, and Edell Vrai, a member of the Golden Destiny faction, managed to rally thirty other Sith from various factions for this project."}, {"tag": "p", "text": "Hilts and his companions managed to evade the other Sith and enter the planetarium. There, they found Yaru's throne which contained a letter from Takara Korsin to her son Yaru concerning her visions about him ruling over a \"great people.\" This letter was written in the Tapani language but Hilts was able to read it due to his knowledge of that tongue. However, Hilts quickly realized that this was not Yaru Korsin's secret. His suspicions were reinforced by Jaye's recollections of noticing a sealed room under the tomb containing the Omen. Hilts concluded that he would find the answers to his question there and speculated that a dying Korsin had recorded his Testament there. Ultimately, Hilts was proven to be correct and he discovered that this chamber was a map room. However, the other Sith caught up with them and Bentado killed Jaye. These Sith then surrounded Iliana and Hilts, the former of whom they intended to kill in revenge for the injuries she had inflicted on them during the \"Great Crisis.\""}, {"tag": "p", "text": "In an act of faith, the Caretaker used the Force to unhook the plates that covered the walls of the room. This revealed a large map of an unknown continent that was several times the size of Keshtah, the domain of the Sith. The Tribe's Founder Yaru Korsin had foreseen that after conquering Kestah, the Sith in accordance with their nature, would fight each other. Thus, Korsin had withheld this secret knowledge for a time when a new mission would be needed to unite the Sith. Having read Takara's letter to Yaru, Hilts argued that the Sith should abandon their differences and work together to conquer this new continent, which he dubbed \"Keshtah Major\". This would involve restoring the old ways and the Tribe's hierarchy which had collapsed during the Time of the Rot. Recognizing the old man's wisdom, the Sith submitted to Hilts and elected him as their Grand Lord. With this new project, Hilts and his new followers managed to end the \"Great Crisis\" by giving the Sith Tribe a new goal in life. He also married Iliana Merko to protect her from the other Sith leaders and to provide a powerful defender who would protect him and his mission. Hilts was aware that per tradition, the spouse of Grand Lord would be killed following the death of the reigning Grand Lord."}, {"tag": "h3", "text": "Hilts Restoration (3000 BBY)"}, {"tag": "h4", "text": "Reaching Alanciar"}, {"tag": "p", "text": "Under the leadership of Grand Lord Varner Hilts, the Tribe rebuilt Keshtah's cities and infrastructure including the aqueduct systems. The Kesh capitol building was also restored to its former glory and it remained the residence of the Grand Lord and his Grand Consort. To honor the memory of his fallen Keshiri friend Jaye Vuhld, Hilts also spearheaded a policy to allow Force-sensitive Keshiri individuals to join the Lost Tribe of Sith and to improve their social mobility. Within twenty-five years, Hilts had amassed a significant following of loyal Keshiri supporters who were willing to do the Tribe's bidding. However, Hilts' most important legacy was the annexation of Keshtah Major, which was called Alanciar by the Keshiri living there who called themselves the Alanciari. Hilts appointed the mathematician Edell Vrai as chief engineer of the Alanciari project, who later became one of the Tribe's youngest High Lords. For the next twenty-five years, the Lost Tribe committed much of their resources to developing technologies that would enable them to reach Alanciar."}, {"tag": "p", "text": "First, the Tribe experimented with long-distance uvak-flights but the oceans proved too far and wide and several pilots and their steeds never returned. Secondly, the Tribe attempted to develop boats but Keshtah's wood proved to be unsuitable for ocean-going voyages. The frail hejarbo shoots were unable to withstand the ocean waves while hardwoods like vosso proved too dense to float. Finally in 2975 BBY, Vrai succeeded in developing airships, which were held afloat by hydrogen stored in canvas gasbags. Using a simple water catalyst, this hydrogen was isolated from methane that was extracted from the volcano Sessal Spire through the use of glass vessels. These airships were propelled by packs of uvaks who were suspended in the airship's harness aft below the gondola. There, these uvaks could rest, eat, and even sleep when their services were not needed. Vrai's invention came at an opportune time since he was facing opposition from rival High and Sith Lords who were vying for Hilts' favor."}, {"tag": "p", "text": "In 2975 BBY, Edell Vrai received permission from Hilts to lead an expeditionary mission to Keshtah Major. Their plan was to fly over the Western Sea and scout Keshtah Major before returning to Keshtah Minor across the smaller Sea of Flames. Vrai's force consisted of three small scout airships, Candra, Lillia, and Dann Itra, and its crew also included three thoughtcriers who were used to communicate with the Tribe. However, the Alanciari had prepared themselves for any Sith invasion. Two millennia ago, the Keshtah Herald Adari Vaal and 300 followers had fled to Alanciar where they succeeded in warning the Keshiri living there about the threat posed by the Sith. Over the following centuries, the Alanciari developed a strong military and a large industrial base to support it. In addition, they also had two reliable continental communication systems consisting of a network of semaphore stations operated by trained signals officers and thoughtcriers, Force-sensitive Alanciari who could transmit messages through the Force."}, {"tag": "p", "text": "Vrai's expeditionary force was intercepted by several Alanciari ballista and their uvak-riders which destroyed the airships and killed four-fifths of the crew. However, Vrai and five other crew survived and they succeed in capturing the Alanciari signals office Jogan Halder and his lover Quarra Thayn, a Force-sensitive Wardmaster and former thoughtcrier. The Sith also managed to commandeer a Keshiri fishing trawler Mischance which gave them access to one of the Alanciari's maritime sailing ships. Most importantly, the Sith expedition obtained a copy of Adari Vaal's Keshtah Chronicles, a popular Alanciari history book, which gave the Tribe invaluable intelligence on what the Alanciari knew about them. Prior to her death, Vrai's thoughtcrier Tellpah managed to send a message containing emotions of surprise, shock, and confusion to the Grand Consort Iliana's thoughtcriers. The Grand Lord and his Consort feared something bad had befallen the expeditionary force but were unable to restrain High Lord Korsin Bentado from traveling to Alanciar with a large invasion fleet of airships known as the Ebon Fleet."}, {"tag": "p", "text": "Following the capture of the harvester Mischance, Edell's uvak-tenderer and pilot Peppin managed to figure out how to operate the ship's sails and steerage. Both reasoned that the Tribe would be interested in the Alanciari sailing vessel and Jogan Halder, along with his collection of books which included the invaluable Keshtah Chronicles, a popular Alanciari book which had been written by the Keshiri exile Adari Vaal. This book was compulsory reading for all Alanciari children and provided the Alanciari with information about the Tribe and Keshtah Minor. Not wanting to return to Keshtah since he feared for his position, Edell then made up new orders ordering himself to embark on a ground reconnaissance mission of Alanciar. Vrai managed to coerce Thayn into serving as his guide for a reconnaissance mission into Alanciar's interior. Thayn agreed to cooperate in return for sparing the life of Halder."}, {"tag": "p", "text": "After depositing Edell and Quarra, Edell's crew sailed with the Mischance back to Keshtah. They sailed through the Southern Passage which led to the Sea of Flames. Upon disembarking, Peppin flew on an uvak to Tahv where she informed the Grand Lord about the recent developments in Alanciar. She also showed Hilts the Keshtah Chronicles which allowed the Tribe to gain invaluable intelligence on what the Alanciari knew about them. Despite learning about the military capabilities of the Alanciari, Hilts did not share this new intelligence with Korsin Bentado because he regarded the ambitious High Lord as a rival. Knowing the superior military capabilities of the Alanciari, Hilts also intended to send Bentado and his loyal supporters, many of whom were from the former Korsinite League, to their demise."}, {"tag": "h4", "text": "Conquering Alanciar"}, {"tag": "p", "text": "Meanwhile, Edell Vrai learnt about the strong anti-Human and anti-Sith sentiment among the Alanciari from his reconnaissance mission. He also attempted to recruit Quarra to the Sith cause but the Alanciari women refused to trust the Sith. They traveled to the Western Shield where Bentado's Ebon Fleet was attacked and destroyed by the Alanciari ballista emplacements. Vrai and Quarra then traveled to the latter's hometown of Uhrar where she checked on her three children. Later, the pair traveled to Sus'mintri, the capital of the Alanciari and the seat of the War Cabinet, the military government of Alanciar. Unknown to Edell and Quarra, Bentado and several of his Sith followers had survived the debacle at the Western Shield and managed to reach Sus'mintri. There they infiltrated Vaal Hall and its adjacent signal tower where they slaughtered the War Cabinet, effectively decapitating Alanciar's highly centralized defense infrastructure. The Sith were now able to direct the Alanciari military through their semaphore system."}, {"tag": "p", "text": "Back on Keshtah Minor, Grand Lord Hilts and the Circle of Lords succeeded in winning over Jogan Halder. To create the illusion that the Sith were benevolent and that Keshtah was a paradise, Hilts arranged for his most loyal Keshiri supporters to organize a carnival on the streets of Tahv. This was designed to create the impression that the Keshiri on Keshtah lived carefree and happy lives which allowed them to devote themselves to recreational activities as opposed to the military drudgery of the Alanciari Keshiri. Meanwhile, the Sith withdrew from public view to create the impression that they did not dominate the Keshiri on Keshtah. These Keshiri convinced Halder that the Sith were indeed the Protectors, ancient gods in Keshiri mythology. The Alanciari was also allowed to visit the Kesh capitol building where the Sith pretended to contemplate in quiet mediation. ."}, {"tag": "p", "text": "Halder met the Circle of Lords, who pretended to be an egalitarian council where no man or woman ranked above the other. While the Sith Lords acknowledged that Adari Vaal, the Herald of Kesh, had been right about the presence of the \"servants of Destructors\" among the Sith, they claimed that they had put down these \"evil ones\" one day after Vaal had left for Alanciar. Thus, the militarization of Alanciari society had been unnecessary. The Lords then told Jogan that Korsin Bentado was a servant of the Destructors who had risen from among the Sith recently. Following his exile from Keshtah, this \"servant of the Destructors\" built airships and set out to conquer Alanciar. Finally, Jogan was told that Edell Vrai, the man who had kidnapped him, was a trusted friend of the Protectors who had come in search of Bentado and to make sure that the Alanciari did not serve the Destructors. Thus, the Sith were able to win over Jogan to their cause and he became their \"ambassador\" to the Alanciari."}, {"tag": "p", "text": "Ultimately, Hilts' suspicions of Korsin Bentado were proven to be correct. Regarding Hilts as an obstacle to the Grand Lordship, Bentado planned to kill the Grand Lord by ordering the Alanciari ballista and uvak-riders to engage his airship Good Omen. Bentado planned to create a \"Second Tribe\" on Alanciar and to harness the continent's immense military-industrial complex. However, he was opposed by Edell Vrai, who remained steadfastly loyal to Grand Lord Hilts, and Quarra Thayn, who condemned Bentado for murdering the entire War Cabinet. Following a pursuit and vicious duel, Bentado was stopped through the combined efforts of Vrai, Thayn, and his own Keshiri aide Squab, who was actually loyal to Hilts. Squab personally executed Bentado and handed the fallen High Lord's command to Edell Vrai, who reasserted control over Bentado's remaining followers and the signaling devices. Thus, Hilts and Halder were able to land without any difficulties at Port Melephos, a coastal port to the south of Sus'mintri."}, {"tag": "p", "text": "At Port Melephos, Halder delivered his testament to the local Alanciari and succeeded in convincing them of the Lost Tribe's benevolence. Following Hilts' arrival at Port Melephos, Edell also sent some semaphore signals updating him about the deaths of the War Cabinet and Bentado's failed uprising. The Good Omen then traveled to Sus'mintri where Halder repeated his testament to a large crowd of Keshiri who accepted his message. The only dissenter was Quarra Thayn but she kept her thoughts to herself and cooperated with the Sith authorities in order to protect her people and her family. Following Halder's testament, Hilts arrived disguised as the \"Keshtah-born minion\" of the Bright Tuash, a Keshiri god, and supported Thayn's message. He told the Alanciari that Adari Vaal had been a good albeit misguided servant of his. He apologized for the damage that Bentado and his followers had wrecked on the Alanciari and promised that relief workers from Keshtah, both Keshiri and Sith, would arrive to facilitate the peaceful \"Unification\" of the two continents. Thus, Hilts had fulfilled his lifelong ambition of conquering Keshtah Major by convincing the Alanciari to submit to Sith rule."}, {"tag": "h4", "text": "Spoils of Conquest"}, {"tag": "p", "text": "The conquest of Alanciar was an important development in the Tribe's history. As a result of its conquest, the Lost Tribe gained access to a large and wealthy continent which had substantial industrial base and was rich in lumber. This enabled the Sith to develop a large fleet of wooden sailing ships which replaced the dangerous airships as the planet's main mode of long-distance transportation. This new fleet of wooden sailing ships enabled the Sith to explore the uncharted regions and seas of Kesh including the unexplored northern hemisphere. High Lord Edell Vrai was appointed as the new de-facto governor of Alanciar. He was tasked with evaluating and cataloging Alanciari innovations that would be used by the Tribe. Vrai also presided over the demilitarization of Alanciari society. Ballista, both large and small, were destroyed in large quantities as a show of trust and reconciliation. In reality, the Sith were afraid that armed Keshiri would pose a threat to their rule. Hilts would regard the act of bringing the Alanciari Keshiri willingly into the Sith's service as a greater victory than capturing new slaves in combat. This victory was recorded in the Testament of Varner Hilts."}, {"tag": "p", "text": "Meanwhile, the Tribe's \"ambassador\" Jogan Halder became a professional hermit who visited the various cities of Alanciar in the airship Good Omen to repeat the story of his adventure. Halder's story was dramatized with the help of Keshiri actors and song-writes imported from Keshtah and gradually replaced the Observance Day plays which were based on the life of Adari Vaal, whose teachings were regarded by the new Sith authorities as outdated if not subversive. According to official rhetoric, Adari had merely been found on a rock. By contrast, Jogan had lived on a rock before his revelation to the truth. Thus, Jogan was regarded as the new \"Rock of Kesh.\" Due to his services to the Tribe, Halder gained a place of honor in their society. This prestige was also enhanced by the fact that he was the first recorded Alanciari visitor to Keshtah Minor, the domain of the Tribe."}, {"tag": "p", "text": "Halder also severed contact with his one-time lover Quarra since he was preoccupied with his new role and status. Meanwhile, Quarra Thayn returned to her husband Brue Thayn and her three children, who remained ignorant of her affair with Jogan Halder. While she declined Vrai's offer to join the Lost Tribe and become his consort, she accepted that the Sith takeover of Alanciar was inevitable. Since her countrymen did not share her skepticism of the Sith, she decided that it was better to collaborate with the Sith occupiers."}, {"tag": "p", "text": "Finally, Hilts oversaw the writing of a new Testament to replace the Testament of Yaru Korsin, which he deemed was no longer suitable and appropriate for the Tribe. This text would serve as both a manifesto and a legal document to remind the Sith of what it meant to be a Sith and outline the hierarchy of the Tribe. Unlike its predecessor, it also explored the Tapani origins of the Lost Tribe, who were descended from House Nidantha, a lesser Tapani house which had left the Tapani sector to pursue its own destiny. While these Tapani had been enslaved by the Red Sith of the Stygian Caldera, some of their descendants had managed to turn the tables on their former oppressors. These descendants exterminated the Red Sith among their number and then became the rulers of the Keshiri people. As before, only Humans were allowed to attend the reading and the Keshiri were only allowed to read a censored version."}, {"tag": "p", "text": "While Hilts was moderate and progressive compared to many of his predecessors, generational slavery was still practiced as a punishment for recalcitrant members of the Tribe. In addition, some Sith Lords like Galathos were still not above using terror and brute force to terrorize their subjects. The port town of Eorm still remained a home to thousands of disenfranchised Sith slaves and Keshiri serfs who were forced to worked for long hours and punished for failing to meet their work quotas. This ultimately sowed the seeds for the emergence of a new threat to the Tribe: the Sith vandal Parlan Spinner, a descendant of the Sith rebel Ermon Parrah who had led a failed attempt to steal the Omen and return to the stars. While his family had been condemned to eternal servitude, Spinner rejected his place in society. Instead he founded a gang of brigands known as Spinner's Web, which perpetrated acts of vandalism against the Tribe."}, {"tag": "h4", "text": "The Death Spiral and the Sith Lord"}, {"tag": "p", "text": "In 2974 BBY, the Sith outcast Parlan Spinner attempted to assassinate Grand Lord Hilts during the Founding celebrations in Tahv, which commemorated the arrival of the Tribe's ancestors on Kesh in 5000 BBY. However, Spinner failed in this attempt and he was captured by Varner Hilts' daughter Takara Hilts, who served as the Prefect of Police of the Tahv Constabulary. While Iliana and Takara wanted Spinner to be executed, the Grand Lord spared Spinner's life and sentenced him to servitude on the Alanciari vessel, the Southern Star, which was led by the Alanciari captain Chegg. Hilts justified his clemency on the grounds that Spinner was an impatient young men whose energies could be put to better uses like exploring a \"new frontier.\" Unknown to Spinner or his family, Hilts had planned to send the Southern Star to explore Eshkrene, the planet's south pole. The Grand Lord theorized that the Sith Tribe had not been the first offworlders to discover Kesh due to the Keshiri legends of the Protectors and Destructors, and the fact that the Keshiri had easily welcomed the Tribe."}, {"tag": "p", "text": "For this fateful voyage, the Southern Star's crew included Spinner and Hilts' own daughter Takara, who had secretly stowed aboard the vessel. Hilts' theory proved correct and the Tribe encountered the Doomed, the descendants of ancient Jedi and Dark Jedi who had become stranded on Kesh following the Hundred-Year Darkness. Under the leadership of the Sith Lord Remulus Dreypa, a group of Dark Jedi attempted to exit the Stygian Caldera and return to the galaxy. However, they were intercepted by a Jedi patrol consisting of veterans from the Battle of Corbos. Following a galactic-wide chase, the belligerents ended up on Kesh where they were unable to call for reinforcements due to the planet's strange magnetic waves. These Force-users initiated the Great Calamity, which would be remembered by the Keshiri as the \"Great Battle\" between the Protectors and Destructors. The Sith had merely appropriated this legend for themselves."}, {"tag": "p", "text": "Eventually, the two sides became disheartened by the devastation and destruction that they had wrought on Kesh. In the end, the two sides made peace and sealed Remulus Dreypa, who was unwilling to compromise, in an oubliette, where he would remain for four millennia. Meanwhile, the Jedi hid their last hyperspace-capable starship Last Hope beneath Tahv's Circle Eternal plaza. They then migrated to Eshkrene where they established a new Force community known as the Doomed. The Doomed committed themselves to finding a balance between the light and dark sides of the Force. They also used ice mirrors to maintain a watchful vigil over the Keshiri and the Lost Tribe. Finally, they guarded the imprisoned Dreypa. While they had planned to intervene during the Time of the Rot, they decided not to after Hilts came to power and succeeded in restoring peace and stability to Keshtah."}, {"tag": "p", "text": "While Takara was able to understand the Doomed and expressed interest in learning about them, Spinner desired to settle scores with the Tribe. After breaking himself and the Keshiri crew out of prison, Spinner stole the Doomed's \"Great Weapon\" and freed Remulus Dreypa from his oubliette. He and the Keshiri crew managed to escape their Doomed captors and sailed to the Keshtah port of Eorm. There, Dreypa instigated a slave revolt with the intention of marching on Tahv and returning to the stars. Dreypa's rebellion marked the first serious conflict to occur following the Great Crisis. In addition, Spinner and Dreypa also brought Takara and the Doomed's leader Kaliska, who had unsuccessfully tried to stop them from opening the oubliette, along as captives. However, the pair managed to escape with Eorm's entire herd of uvaks and returned to Eshkrene, where they rallied the Doomed for an assault on Dreypa."}, {"tag": "p", "text": "Dreypa's army marched on Tahv but suffered heavy casualties during the Battle of the Marisota Floodplain at the hands of the Tribe's military forces, which were led by Grand Consort Iliana Hilts. Dreypa and Spinner then retreated to the volcano Sessal Spire where Dreypa unleashed several hibernating Leviathans, reptilian Sithspawn capable of draining the life energies of sentient beings, on both his Sith pursuers and former allies. The Doomed attacked Dreypa and his Leviathans but were no match for his mastery of the dark side. In the end, Spinner and Takara joined forces to rescue the latter's mother Iliana and they managed to escape the battlefield with Kaliska. Kaliska also revealed the existence of a Jedi starship that was hidden within Tahv's burial cairns. She urged them to destroy the starship in order to deny Dreypa a chance of returning to the galaxy."}, {"tag": "p", "text": "Spinner managed to return to Tahv with Iliana but Kaliska was killed and Takara was captured by Lord Dreypa, who intended to use her as a bargaining chip with the Tribe. Spinner managed to find the Jedi starship but instead of destroying it, he took it on a joyride above Kesh. However, he returned after Dreypa threatened the life of Takara, whom he had developed a crush for. Spinner returned to Tahv where he destroyed Dreypa's leviathans and rescued Takara. In the end, Dreypa was killed when the Jedi Starship crashed into Sessal Spire. However, Spinner and Takara managed to bail out into the Southern Ocean. Following the defeat of Dreypa, Tahv was rebuilt and Spinner was admitted into the Tribe as a Grand Lord's Hand, making him a personal enforcer of the Grand Lord. As a result, the Lost Tribe of Sith was able to consolidate its influence over the rest of Kesh."}, {"tag": "h3", "text": "Return to the galaxy (41 ABY)"}, {"tag": "h4", "text": "Ship's arrival"}, {"tag": "p", "text": "By 37 ABY a festival, Presentation, had been established. This festival presented one way for any Force-sensitive Keshiri to join the Tribe. Around the time of the Second Galactic Civil War, in 41.5 ABY, the Sith made contact with Ship, a Sith Meditation Sphere awoken by Ben Skywalker on Ziost one year earlier. The vessel informed the Lost Tribe of the destruction of the Sith and the rise of the Jedi, and began to train the Tribe's apprentices for a war against the weakened galaxy. Meanwhile, it also helped them to raid starships in order to form a new armada."}, {"tag": "p", "text": "Within two years, the fleet consisted of several dozen ships, including the rebuilt Omen. Meanwhile, in the Kathol Rift, Jedi Grand Master Luke Skywalker came into contact with the Codex, an Aing-Tii artifact that enhanced his presence in the Force. His presence was felt by the Tribe, and Ship informed them of the threat that he presented to them. Grand Lord Darish Vol and Lady Olaris Rhea handpicked a strike team to hunt down and kill Skywalker, but Ship abruptly left the planet, following a mysterious call in the Force. The strike team, led by Rhea, was then tasked with recovering Ship before eliminating Skywalker and bring a crushing blow to the Jedi Order."}, {"tag": "h4", "text": "Targeting the Skywalkers"}, {"tag": "p", "text": "The strike team, which was led by Lady Rhea, eventually tracked Ship to a planet in the Maw, where they encountered a being called Abeloth. Abeloth claimed to have been stranded on the planet for the last thirty years, but in reality she was in control of the whole planet itself. Also, it was her power that had called Ship away from the Tribe, and she continued to prevent the Sith from recovering the Meditation Sphere. Rhea's apprentice, Vestara Khai, discovered the true nature of Abeloth, but the other members of the team remained unaware. Abeloth used the flora and fauna of the planet to kill many of the Sith, but after discovering Skywalker's presence beyond shadows at Sinkhole Station with his son, Ben Skywalker, she finally allowed Ship to return to them so that they could continue on their mission, under the condition that they capture the Jedi rather than killing them. Rhea, however, later changed the objective back to kill."}, {"tag": "p", "text": "The Sith ambushed the Grand Master and his son at Sinkhole Station, a space station that was home to the Mind Walkers. During the ensuing fight, Sith Master Yuvar Xal attempted to execute a coup to take over command of the team from Rhea. He attempted to kill the Keshiri Sith Saber Baad Walusari while his apprentice, Ahri Raas, attempted to kill Khai. The betrayal failed, however, and Khai killed Xal as Raas was killed by one of the Skywalkers. The skirmish wore on, and eventually the only remaining members of the team were Rhea and Khai, who dueled with Luke. They were distracted by the younger Skywalker opening fire from the Jade Shadow onto Ship in the Station's hangar, however, and Skywalker took advantage of this to kill Rhea. Khai, however, escaped and fled to Dathomir, with the two Skywalkers pursuing her. From there, Khai was able to contact the Tribe, who dispatched a team to capture the Nightsisters who dwell there, and induct them into the Tribe, especially to rid them of their anti-male bias."}, {"tag": "h4", "text": "Alliance with Jedi"}, {"tag": "p", "text": "Captured by the Skywalkers, Khai summoned the entire Sith armada to corner the Jedi in orbit of Dathomir. High Lord Sarasu Taalon offered a truce with the Skywalkers, bluffing that their apprentices were suffering from the same condition caused by Abeloth. Luke agreed to a temporary alliance. But while lying in wait for an ally of Skywalker to deliver a ship to help them navigate the Maw, Taalon secretly ordered some Sith to steal some wintrium from the Fountain of Hutt Ancients on Klatooine. But they were captured by the Hutts, who responded to the desecration of the Fountain. The Sith responsible for the theft were found guilty afterwards."}, {"tag": "p", "text": "When the Jedi-Sith alliance confronted Abeloth on her planet, the Sith betrayed the Skywalkers and attempted to use the control web technique taught to them by Khai, not to stifle Abeloth's powers, but to trap her and force her to serve them. Skywalker ultimately ended the battle by 'killing' Abeloth. Afterwards, the Skywalkers, the Khai and Taalon remained behind on the planet to investigate more into Abeloth's origins."}, {"tag": "h4", "text": "Broken alliance"}, {"tag": "p", "text": "When a scuffle ensues between the Jedi and Sith, it is revealed that it was Dyon that was killed instead of Abeloth, with Abeloth currently pretending to be Dyon in the Jade Shadow's medical bay. The Jedi and Sith alliance remains, and both parties are taken by Ship, who has returned, to the Pool of Knowledge on the planet, where the Sith see a vision of a Jedi queen in the Pool. Wanting to keep the Jedi queen's identity a secret, Ben and Luke attack the Khais and Taalon. Gavar Khai is submerged in the pool, and the Jedi escape, stealing the Sith's shuttle to get off-planet and follow Abeloth (who stole the Jade Shadow). The Skywalkers take Vestara Khai with them, leaving Talon and Gavar alone on the planet. The Sith, however, commanded Ship to take them, which it did."}, {"tag": "p", "text": "Taalon and Gavar, along with part of the Sith armada, eventually arrive at Pydyr, where the Skywalkers are looking for their ship and Abeloth. The Sith go down to Pydyr, where they join the Skywalkers once again. There, the Sith 'succumb' to a plague, which is actually an illusion created by Abeloth to generate misery for her to feed off. After locating an island with a Fallanassi village, the Skywalkers and Sith begin looking for Abeloth, with it turning out that she has possessed the body of Akanah Norand Goss Pell. The Fallanasi then use Fallanassi illusions to drive most of the Sith insane. Taalon (not affected by the illusions like the others) seeks to speak with Abeloth to find out what was wrong with him, as he was beginning to transform into a being like Abeloth from being submerged in the Pool of Knowledge. He and the Jedi follow Abeloth into a meeting hall, with a battle ensuing shortly afterwards. The Sith manage to capture the Skywalkers, but the tables are turned when Vestara kills Taalon and subdues her father. Abeloth escapes, and a StealthX wing launched by the Jedi from Coruscant arrives and engages the Sith armada. The Jedi and Vestara leave the planet intending to pursue Abeloth, with Vestara Khai defecting to them, knowing she wouldn't be welcomed amongst the Tribe for killing a High Lord."}, {"tag": "h4", "text": "The Jedi Queen"}, {"tag": "p", "text": "Later and elsewhere, a member of the Lost Tribe, Querdan Dei, is assigned to track the Hapan Queen Mother Tenel Ka Djo as part of the Jedi Queen project. It was known to the Sith that there could be a Jedi Queen in the future, due to the vision seen by Taalon in the Pool of Knowledge at Abeloth's planet, and Tenel Ka resembled her. However, they also knew it couldn't be her for various reasons, and Dei thus speculated she may have another daughter in addition to the one killed during the Second Galactic Civil War (which wasn't actually the case, since Tenel Ka's daughter, Allana Solo, hadn't died, and her 'death' was just a fabricated story to protect her). Dei and his crew of seven (counting himself) successfully follow Tenel Ka to Klatooine in a stealth ship the Tribe had captured, with Dei intending to assassinate her."}, {"tag": "p", "text": "After arriving on Klatooine, he plans to use a bomb to kill her, which a member of the crew constructs. Dei steals the Solo's protocol droid C-3PO and plants a bomb in him, unbeknownst to the droid. A significant distance away atop a ridge, Dei waits for C-3PO to enter the vicinity of Tenel Ka so he detonate the bomb. During this wait, he draws the connection between Tenel Ka and 'Amelia Solo', Han and Leia's adopted child, and realizes she is either the daughter of Tenel Ka who died, or a second one. Setting his mind back to Tenel Ka, he prepares to detonate the bomb as C-3PO gets close, only to suddenly find out his remote control is missing—taken by Allana Solo, who had a Force vision regarding her mother and the danger she would be in. As he attempts to kill her, he is attacked by Anji, Allana's pet, distracting him long enough for Leia Solo to arrive. The two engage in a duel, with Leia winning with a decapitation. The rest of the Sith team, realizing their mission is a failure, leave."}, {"tag": "h4", "text": "Nam Chorios"}, {"tag": "p", "text": "On Nam Chorios, Vestara sends a message to the Lost Tribe, alerting them that she, Luke, and his son are there, along with Abeloth, who the Jedi are hunting. Gavar Khai and the part of the Sith fleet assigned to him forcefully arrive, with numerous Sith, led by Tola Annax, going down to the planet. They attack the Skywalkers and Vestara twice, before eventually descending into a pumping station the Jedi, Vestara, and Abeloth enter. The Sith arrive as Luke defeats Abeloth, who flees, and Ben and Vestara finish with Valin Horn (still under force psychosis and called there by Abeloth). Surrounded, Vestara kills a tsil, which releases an intense death convulsion and incapacitates the Sith. The Skywalkers and Vestara, ready for the blast, aren't affected as badly, and escape the station. Above, the Jedi StealthX wing arrives and engages the Sith's ships again. Abeloth manages to get past the Jedi, and after the Sith pull back, she confronts Gavar Khai and proposes an alliance between herself and the Sith."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "The Lost Tribe was ruled by a Circle of Lords, installed in a the capitol building in the heart of the capital city of Tahv. The Circle of Lords consisted of thirteen Sith Lords, seven High Lords, and one Grand Lord, regarded as the most powerful Sith in the Tribe. The known ranks in this isolated Sith order were, from lowest to highest: Sith Tyro, Sith apprentice, Sith Saber, Sith Master, Sith Lord, High Lord, Grand Consort and Grand Lord."}, {"tag": "p", "text": "In addition to the city of Tahv and several smaller outlying settlements, the Tribe also had a Sith Temple constructed over the ruins of the Ship of Destiny, which was the name for the remains of the Omen. The Temple, a massive black edifice jutting out of the Takara Mountains where the ancient Sith ship had crashed, was constructed from the mountain peak itself. It was in the Temple that Sith apprentices were mentored and trained."}, {"tag": "p", "text": "For the Tribe, any flaw, including scars and deformities, was a strike against one's potential for advancement in the hierarchy. The Sith were firm believers in merit over birth, and though a stigma was attached to the native Keshiri of Kesh, several were admitted into the Tribe and trained in the dark side of the Force, and by 41 ABY one Keshiri Sith served on the Circle of Lords."}, {"tag": "h2", "text": "Original members of the Lost Tribe of Sith"}, {"tag": "p", "text": "Sith survivors of the Omen's crash:"}, {"tag": "h2", "text": "Members of the Lost Tribe"}, {"tag": "p", "text": "From 5000 BBY to 44 ABY: \n(†=confirmed death);"}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Some of the Humans the Lost Tribe was formed from were themselves descended from the House Nidantha, a group who hailed from what would later become the Tapani Empire, a government that would also become ruled by High Lords."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}