{"url": "Lost_Tribe_of_the_Sith:_Secrets", "categories": ["Category:Real-world articles", "Category:Lost Tribe of the Sith series"], "nodes": [{"tag": "h1", "text": "Lost Tribe of the Sith: Secrets"}, {"tag": "p", "text": "Lost Tribe of the Sith: Secrets is the eighth eBook in the Lost Tribe of the Sith series. A tie-in to the Fate of the Jedi novel series, it was written by John Jackson Miller and was released on March 5, 2012."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "In Sith teachings, nothing is more important than the individual: the glorious center of the universe, around which all other lives pale in importance. But the planetary home of the Lost Tribe of the Sith is not the center of the universe, but a backwater — and the tribe's legendary founders were little more than slaves themselves!"}, {"tag": "p", "text": "When the Lost Tribe suddenly rediscovers its forgotten origins, frustration and anger threaten to finish the society once and for all. But the past holds more secrets still — knowledge that, in the right hands, could place the evil rulers of Kesh on a path toward a greater destiny in the stars…"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Secrets is set in 3000 BBY and occurred two weeks after the events of Pantheon. It is told through the point of view of the Sith historian Varner Hilts. During the Great Crisis, Hilts and his Keshiri assistant Jaye Vuhld traveling to the Kesh Sith Temple in an attempt to discover secrets that could save the Lost Tribe of Sith from their own destruction. Nobody had visited the Sith Temple for several centuries since the Tribe's founder Yaru Korsin's daughter Nida Korsin had ordered the Tribe to evacuate the Temple. After much difficulty navigating the difficult terrain, Hilts and Jaye managed to enter the Temple's compound. Shortly later, they encounter a despondent Iliana Merko, the former leader of the Sisters of Seelah, a Sith faction which emulated Seelah Korsin, the estranged wife of Yaru Korsin."}, {"tag": "p", "text": "Hilts managed to convince Iliana to join their efforts to discover Yaru Korsin's secrets that could save the Tribe from destruction. The three explorers eventually made their way inside the derelict Omen, the ancient starship which had brought the ancestors of the Lost Tribe to Kesh. The Omen is buried beneath the Keshiri Sith Temple. However, the explorers found that Korsin's command throne has been removed from the ship's bridge. Hilts and his companions eventually discovered the presence of other Sith including Korsin Bentado, Edell Vrai, and Neera. These Sith had been vicious rivals prior to the Great Crisis but had come together after much blood-letting to destroy the Omen in order to purge the \"inglorious history\" of the Tribe."}, {"tag": "p", "text": "Hilts and his companions eventually reached the cupola above the Sith Temple's roof where they discovered Korsin's throne. They discovered that the cupola's ceiling is a planetarium and also found a piece of transparent film which contains an old cant in the Tapani language. This document was a message from Yaru Korsin's mother Takara Korsin to her son prior to his fateful mission to Phaegon III. She predicted that Korsin's descendants would rule over a great people one day and be free of the Red Sith. However, Hilts argued that this text was not actually Korsin's secret and contended that the planetarium was intended to mislead future explorers into thinking that Korsin had intended the Tribe to return to the stars."}, {"tag": "p", "text": "Using their knowledge of the Lost Tribe's history, Hilts and Jaye reasoned that the dying Korsin had recorded his final Testament in a chamber beneath the Sith Temple. Hilts and his companions eventually reached the chamber and discovered both Korsin's throne and a map room. The other Sith eventually discovered their presence and killed Jaye. Before they could kill the others, Hilts used the Force to remove the blank slates covering the room and revealed a large map which showed the existence of a second continent besides Keshtah Minor. This unknown continent was several times the size of Keshtah and was separated by a vast ocean. Hilts was able to use the discovery of 'Keshtah Major' to unite the Tribe and end the centuries-long infighting that has nearly destroyed them. In the end, the other Sith leaders elected Hilts as Grand Lord and Iliana becomes his Grand Consort. Under Hilt's leadership, the Tribe committed itself to rebuilding Keshtah Minor and discovering a way to reach Keshtah Major."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Notes and references"}]}