{"url": "Lost_Tribe_of_the_Sith:_Precipice", "categories": ["Category:Real-world articles", "Category:Cleanup", "Category:Lost Tribe of the Sith series"], "nodes": [{"tag": "h1", "text": "Lost Tribe of the Sith: Precipice"}, {"tag": "p", "text": "Lost Tribe of the Sith: Precipice is the first eBook in the Lost Tribe of the Sith series. It was written by John Jackson Miller and was released on May 28, 2009."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "For the ruthless Sith Order, failure is not an option. It is an offense punishable by death—and a fate to which Commander Yaru Korsin will not succumb. But on a crucial run to deliver troops and precious crystals to a combat hotspot in the Sith's war against the Republic, Korsin and the crew of the mining ship Omen are ambushed by a Jedi starfighter. And when the Sith craft crash-lands, torn and crippled, on a desolate alien planet, the hard-bitten captain finds himself at odds with desperate survivors on the brink of mutiny—and his own vengeful half brother, who's bent on seizing command."}, {"tag": "p", "text": "No matter the cost, Korsin vows that it will not be his blood and bones left behind on this unknown world. For the way of the Sith leaves little room for compromise—and none for mercy."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The short story Precipice occurs in 5000 BBY and is told from the point of view of Yaru Korsin, the captain of the Sith transport ship Omen and a slave to the Sith Lord Naga Sadow, one of the last rulers of the Sith Empire. The ship Omen is falling apart and Captain Korsin is trying to save his ship. He is talking to the engineer Lohjoy when she is killed by another breach in the hull. Even Gloyd, the gunnery officer, is not finding much funny today. None of the crew members have any ideas on how to save the ship and its fight against the atmosphere of the planet they are stuck in."}, {"tag": "p", "text": "The Omen is the more desirable ship of the Sith. There is the Harbinger as well, but it is run by the most recent Sith Lord, fallen Jedi Saes Rrogon, who many of the Sith do not like to trust. Both the ships leave Phaegon III earlier that day with large loads of Lignan crystals, when a Jedi starfighter attacks the defenses of the Sith. The Blades are to take out the Jedi while the Omen jumped to hyperspace, but the Harbinger is hit and before the Omen can jump, the Harbinger hits the Omen and knocks them off-course."}, {"tag": "p", "text": "The Omen ends up in a gravity well which destroys the shielding and then the armory of the ship explodes. Because it is destroyed in hyperspace it doesn't destroy the whole ship, but it seems to just vanish. Devore Korsin comes in and blames the navigator, Boyle Marcom, who worked for Yaru Korsin's father under Marka Ragnos. Yaru's father commanded for the Sith Lords for many years and he never lost a ship. He had Devore with a mother from a different planet. Yaru decided to work away from his father and in five years he was a captain, and in ten he beat out his father to command the Omen."}, {"tag": "p", "text": "As the ship enters more into the atmosphere of the planet the crew begins to see rain, but they also begin to think for a minute that they are on a gas giant. Something with wings hits the side of the ship for a second, but then disappears. Part of the ship opens up and air rushes in; breathable air."}, {"tag": "p", "text": "Seelah, Devore's wife, enters the bridge with her baby, Jariad Korsin. Devore has her go to the lifepods, but they do not work. Just then, they see land, but the ship will have to slow down considerably. The Omen opens up its torpedo doors to create drag to slow down. It works enough for them to be able to see exactly what is below: mountains. Yaru made the decision to make a landing on land to save the cargo, instead of landing in the sea. The Omen slams into a cliff and slides down an incline towards the edge of the cliff. The ship stops in time before going over."}, {"tag": "p", "text": "Most of the crew of the Omen came from what would become the Tapani Empire. Naga Sadow needed the Lignan crystals for the Battle of Kirrek. In bringing the 355 people down from the crashed ship, 21 have died on the trip. They have to evacuate the still-burning ship and about halfway down the mountain they find a grassy clearing they could stay at. Ravilan Wroth, the quartermaster, is in charge of the Massassi, who are getting sick and dying from something in Kesh's atmosphere. Already a third of their numbers have died since making their way from the ship."}, {"tag": "p", "text": "Yaru Korsin starts up the mountain with the three healthiest Massassi. They have all died before they make it to the ship. Back at the camp at night, it has gotten colder than expected and many more have died. A six-legged mammal also attacks and it takes five guards to slay it. When eaten, the person who takes a bite dies almost instantly. Another fight breaks out over a foodpak and another Sith is killed. Yaru knows the ship won't fly again, but he hopes the transmitter will be able to send out a message so that Naga Sadow will be able to get the Lignan crystals, though if that causes Naga Sadow to lose the Battle of Kirrek, he knows Sadow will take his life."}, {"tag": "p", "text": "Devore gets to the Omen before Yaru does. Inside, Yaru tries turning on the transmitter, but it doesn't work; nothing does. Yaru looks through the ship for things that will be useful for those at the camp, but there isn't much for him to take. Yaru hopes they will be able to put the blame on the Harbinger, because Naga Sadow doesn't trust Saes. Devore had talked to Sadow earlier about command of the Omen giving him the idea that Yaru Korsin was not completely in control of the ship. While Yaru thinks, Devore ignites his lightsaber. Devore uses the Force to throw objects at Yaru. In his spice-induced rage he is able to be more powerful than normal."}, {"tag": "p", "text": "Their fight on the Omen causes the ship to teeter knocking Devore out of the chair he is in. Yaru then uses the Force to shoot Devore out a window. As Yaru leaves the ship, he hurts his ankle and falls down the slope. Yaru makes his way back up and he sees another of the winged creatures that hits the ship on its crash landing. Then Devore knocks him into the side of the ship. Devore batters him along the edge of the ship, when they get to the torpedo tubes, Yaru shoots open the door hitting Devore's shoulder. Yaru helps his brother to his feet, who can no longer stand on his own. Yaru faces the sun and then lets go of his brother, who falls into the abyss below."}, {"tag": "p", "text": "Yaru Korsin doesn't make his way back down until sunset. He brings the last of the foodpaks and blankets from the Omen. Ravilan meets Yaru as he comes back, asking what was going on with the beacon. All Yaru can tell him is they have to wait. Seelah wants to know where Devore was, but Yaru doesn't have to say anything. Seelah knew what has happened. Yaru gives a speech to everyone, telling them that someone is looking for them, and that they have to make the best of the situation and make the land theirs. The Massassi have died and Yaru remembers that he had seen a rider on the winged creature at the ship and he felt the Force with them. He smiles over at Seelah and she reluctantly smiles back. She will bide her time and get revenge on Yaru Korsin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In an email interview dated to August 2013, author Jackson Miller attributes the deaths of the Massassi in response to their contact with Kesh's atmosphere to their genetic differences. The Massassi were a mutated sub-species within the wider Red Sith species which meant that they had different genetic strengths and weaknesses. While the other Red Sith possessed certain genetic traits which allowed them to survive on Kesh, the Massassi clearly did not have them anymore."}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}