{"url": "Lost_Tribe_of_the_Sith%E2%80%94Spiral_1", "categories": ["Category:Real-world articles", "Category:Star Wars: Lost Tribe of the Sith"], "nodes": [{"tag": "h1", "text": "Lost Tribe of the Sith—Spiral 1"}, {"tag": "p", "text": "Lost Tribe of the Sith—Spiral 1 is the first issue in the Star Wars: Lost Tribe of the Sith—Spiral story arc written by John Jackson Miller. The events of the comics take place around 2974 BBY, one year or less after the events of the ebook Pandemonium."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "On a planet ruled by a tribe of Sith—marooned thousands of years ago and cut off from the galaxy—the throne holder is about to be challenged by a power-hungry Sith rebel from the slums . . . and a thwarted royal Sith princess! Their few shared interests set them on a quest together—but most certainly not as partners!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The criminal gang Spinner's Web led by Sith outcast Parlan Spinner disrupts the festivities commemorating the arrival of the Lost Tribe of Sith on Kesh nearly three thousand years ago. Spinner also attempts to assassinate Grand Lord Varner Hilts but is instead apprehended by his daughter Takara Hilts, the Prefect of the Tahv Constabulary. While Spinner faces the death penalty, Lord Hilts decides to spare the life of the youth despite the protests of his wife Iliana Hilts and daughter. Spinner is put to work as a sailor aboard the Alanciari Captain Chegg's wooden sailing ship Southern Star, which is sent on a mission to explore and survey the polar continent of Eshkrene in the South Pole."}, {"tag": "p", "text": "However, Takara stows aboard the ship, intending to hitch a ride to Alanciar and unaware of the ship's real expedition. She and Spinner are put to work manning the ship's sails by Captain Chegg. After the ship lands on Eshkrene, the pair attempt to escape aboard the Southern Star but are pursued by Chegg and his men, who are intent on killing the two Humans for \"mutineering.\" Spinner and Takara are saved by a group of cloaked individuals who kill Chegg and his men with arrows. These figures introduce themselves as the Doomed."}, {"tag": "h2", "text": "Cover gallery"}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}