{"url": "Lost_Tribe_of_the_Sith%E2%80%94Spiral_5", "categories": ["Category:Real-world articles", "Category:Star Wars: Lost Tribe of the Sith"], "nodes": [{"tag": "h1", "text": "Lost Tribe of the Sith—Spiral 5"}, {"tag": "p", "text": "Lost Tribe of the Sith—Spiral 5 is the fifth issue in the Star Wars: Lost Tribe of the Sith—Spiral story arc written by John Jackson Miller. It was released December 12, 2012. The events of the comics take place around 2974 BBY, one year or less after the events of the ebook Pandemonium."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Lord Dreypa's Leviathans continue their destruction of the lost tribe of Sith, searching in vain for an ancient, well-hidden Jedi starship. Beating Dreypa to the ship, a Sith rebel finds himself on the cusp of attaining his dreams—destruction of the tribe and discovery of a way to reach the galaxy. But there could be something that would cause him to have a change of heart, and Lord Dreypa could have found it!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The main protagonist Parlan Spinner, an outcast from the Lost Tribe, goes on a joyride in the newly-discovered Last Hope. The ship takes him on a flight which ends in the atmosphere above the planet Kesh. Before he can explore the wider galaxy, the antagonist Remulus Dreypa contacts Spinner and issues an ultimatum. He demands that Spinner hand over the ship or he will hurt the Sith princess Takara Hilts, who had forged an unlikely alliance and friendship with Spinner. Dreypa presents Spinner with the opportunity to meet him at Tahv, the Lost Tribe's capital."}, {"tag": "p", "text": "Dreypa and his Leviathans reach Tahv and lay waste to much of the city. However, they are stopped in their tracks by Spinner who uses the Last Hope's turbolaser cannons to destroy most of the monsters. Dreypa brings the remaining Leviathan on top of a tall building to confront Spinner, with the captive Takara being carried in one of the monster's tentacles. However, Takara uses Force lightning to kill the Leviathan and manages to break free. She and Dreypa land on Spinner's Last Hope and he takes the vessel to the shores of the Southern Ocean. Spinner \"hands\" the Last Hope to Dreypa, before jumping into the ocean with Takara."}, {"tag": "p", "text": "Dreypa enters the ship's cockpit only to discover that Spinner had set the ship's computer for a one-way trip into Sessal Spire, a large volcano at the edge of Keshtah Minor. Dreypa and the Last Hope crash into the crater and are destroyed, depriving Kesh of any hyperspace-capable starship and thus preventing any information about the Lost Tribe escaping to the wider galaxy. Following the defeat of Dreypa, the Sith begin rebuilding Tahv and Spinner becomes a hero of the Tribe. Grand Lord Varner Hilts appoints the young man as one of his Hands and Spinner also develops a romantic relationship with his former enemy Takara."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}