{"url": "Lost_Tribe_of_the_Sith:_Sentinel", "categories": ["Category:Real-world articles", "Category:Lost Tribe of the Sith series"], "nodes": [{"tag": "h1", "text": "Lost Tribe of the Sith: Sentinel"}, {"tag": "p", "text": "Lost Tribe of the Sith: Sentinel is the sixth eBook in the Lost Tribe of the Sith series. A tie-in to the Fate of the Jedi novel series, it was written by John Jackson Miller and released on February 21, 2011."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Cast into slavery by the machinations of the Sith, Ori Kitai believes she's found her way back into the Lost Tribe—and perhaps a whole lot more. Ori's discovery of a second starship gives her the opportunity to avenge the humiliations heaped on her family by the decrepit Grand Lord. Indeed, she could turn their entire society upside down—offering escape from their planetary prison."}, {"tag": "p", "text": "But Ori encounters resistance from a surprising person: the seemingly humble farmer who took her in: a man with a secret past and an agenda of his own. He cannot allow Ori Kitai to unleash the Lost Tribe on an unsuspecting galaxy. But how can he stop the woman he loves without destroying them both?"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "Sentinel occurs immediately after the events of the short story Purgatory which takes place in 3960 BBY. This short story is told from the point of view of two protagonists: the undercover Jedi Shadow Jelph Marrian and the former Sith Saber Orielle Kitai. Earlier, Ori had lost her privileged status in the Tribe's society after her mother was accused of being involved in the attempted assassination of Grand Lord Lillia Venn. Attempting to regain her family's lost status, Ori had sought to reveal the existence of a hyperspace-capable starship at Jelph's farm to the Tribe's leadership."}, {"tag": "p", "text": "The story begins with Jelph traveling to the Tribe's capital of Tahv. While resting at the bar of a Keshiri bartender, he reflects on how his childhood experiences during the Great Sith War motivated him to join the Jedi Covenant, a secret group of Jedi Knights who were committed to preventing a return of the Sith. As a Jedi Shadow, Jelph had spent years combing the Outer Rim Territories for potential Sith threats. During the Mandalorian Wars, Jelph had become stranded on Kesh. Meanwhile, Ori arrived at Tahv's zoo where her mother had been forced to shovel manure for the past two weeks. Ori told her mother about the hidden starship she had discovered in Jelph's farm. While Candrai was skeptical that this would improve their status, she told her daughter to contact four High Lords from the Red and Gold Factions through the well-connected architect Gadin Badolfa. Ori followed her mother's advice and then fled to the city's aqueduct system, which had been her favorite haunt during her days as a Sith Saber. Before she left, Ori also stole the lightsaber belonging to the zoo's guard."}, {"tag": "p", "text": "Jelph entered Tahv and headed into the city's aqueduct system, knowing that they were Ori's favorite haunt. These aqueducts towered over most of the city's buildings and transported water across the city. There, he encountered Ori who attacked him with her Force powers, throwing him twice into the canal. After disarming Ori, Jelph admitted that he was a Jedi Knight and that he was the owner of the starship. Ori also revealed that she had revealed his \"secret\" to her mother. Jelph attempted to reason with Ori by arguing she could abandon her desire for power. When Ori related the Tribe's ambitions for galactic dominance, Jelph claimed that there were no more Sith in the wider galaxy. Despite their differences, Jelph admitted he had romantic feelings for Ori in an attempt to calm her down. Ori then revealed she had informed the other Grand Lords about an \"important discovery\" and had instructed them to meet her at Jelph's farm the following day at sunset."}, {"tag": "p", "text": "In the end, Ori and Jelph agreed to return to Jelph's farm and they stole an uvak from an aerial rider patrolling the city. During their flight, the pair agreed that Ori would claim she had discovered four functioning blasters, a technology that was not available to the Tribe. The pair rode the uvak back to Jelph's farm but were pursued by the Tribe's uvaks. Fortunately, they managed to reach the farm before their Sith pursuers could arrived. Jelph slipped out of sight while Ori headed towards the barn intending to meet the four High Lords. However, these visitors turned out to be the Grand Lord Venn herself and four of her most loyal body guards including Flen and Sawj Luzo, Ori's rivals. Unknown to Ori, Candrai had secretly informed the Grand Lord in exchange for improved working conditions."}, {"tag": "p", "text": "Grand Lord Venn then entered the stable where she discovered the starfighter. She was triumphant because she believed that she had discovered interstellar travel, something which had eluded the Tribe for millennia. Unknown to Venn and her entourage, Jelph had already rigged the starfighter with explosives; he had already hidden two proton torpedoes among thousands of kilograms of ammonia-nitrate based explosives. Prior to reassembling the starship in his stable, Jelph had installed this anti-theft system as a fail-safe in the event that his presence on Kesh was discovered. Jelph managed to distract Venn and her entourage by using the Force to levitate the four blasters towards him. He then opened fire on her bodyguards, allowing Ori to escape her captors. Meanwhile, Venn entered the starfighter's cockpit only to trigger the explosives which killed all of the Sith present and destroyed all traces of the entire farm."}, {"tag": "p", "text": "Ori and Jelph managed to escape by submerging underwater in the river. The events of that night would be remembered in Keshiri history as the \"Night of the Upside-Down Meteor\" and ushered in a power struggle which lasted almost a millennium. Little trace of Venn, her entourage, and Jelph's farm survived since the explosion had caused the surrounding riverbank to collapse into the Marisota River. After eight weeks of traveling deep into the jungle, Ori and Jelph established a remote homestead in the forest. Jelph also destroyed the last remaining evidence of his offworld origins: a transmitter. The Jedi had destroyed the machine after intercepting transmissions which revealed that the Jedi had collapsed into factions and were engaged in a civil war. Finally Jelph and Ori established a romantic relationship and eventually started a family in their new jungle home."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}