{"url": "Lost_Tribe_of_the_Sith%E2%80%94Spiral_2", "categories": ["Category:Real-world articles", "Category:Star Wars: Lost Tribe of the Sith"], "nodes": [{"tag": "h1", "text": "Lost Tribe of the Sith—Spiral 2"}, {"tag": "p", "text": "Lost Tribe of the Sith—Spiral 2 is the second issue in the Star Wars: Lost Tribe of the Sith—Spiral story arc written by John Jackson Miller. The events of the comics take place around 2974 BBY, one year or less after the events of the ebook Pandemonium."}, {"tag": "h2", "text": "Publisher's summary"}, {"tag": "p", "text": "Having set sail on a prisoner vessel to uncharted territories, a rebel and a stowaway princess find themselves in a losing battle with their crewmates against a society of strange self-proclaimed exiles. When they are taken in by the exiles, new opportunities for power within the civilization pique their interest. The rebel recklessly takes the first opening to go after a guarded weapon he believes could upend the entire tribe of Sith!"}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The two protagonists Sith outcast Parlan Spinner and princess Takara Hilts, along with the remaining Keshiri crew aboard the sailing ship Southern Star are taken captive by the Doomed who bring them into their settlement: the City of the Doomed. Takara and Spinner attempt to escape and fight with their captors but are quickly disarmed and separated. Kaliska, the S'kytri leader of the Doomed brings the two Sith into the Hall of Regret where she relates the history of the Doomed to them. She reveals that the Doomed were the descendants of ancient Jedi and Dark Jedi exiles who had become stranded on Kesh following the Hundred-Year Darkness almost four thousand years ago. After fighting each other, the two Force orders made peace and the Dark Jedi sealed away their Great Weapon within an oubliette. They then migrated to Eshkrene, where they maintained a watch over the Keshiri while striving to find a balance in the Force."}, {"tag": "p", "text": "Takara and Kaliska establish a friendship and the latter takes the former to the settlement's stables where she teaches her the Force power of animal friendship. Meanwhile, Spinner is imprisoned with the rest of the Keshiri crew after expressing an interest in seeing the Great Weapon. Spinner and the Keshiri crew however escape from their prison and steal the Great Weapon before escaping the City of the Doomed aboard the Southern Star. The Doomed discover that the Great Weapon has been stolen and that the prisoners have escaped. Kaliska and Takara managed to catch up with the Southern Star and try to convince Spinner not to open the oubliette. Spinner ignores their pleas and opens the oubliette, releasing the Dark Jedi Baron Remulus Dreypa, who had been imprisoned for four thousand years."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}, {"tag": "p", "text": ""}]}