{"url": "Lost_city_of_the_Ghorfas", "categories": ["Category:Legends articles", "Category:Cities on Tatooine", "Category:Tatooine locations", "Category:Tusken Raider culture"], "nodes": [{"tag": "h1", "text": "Lost city of the Ghorfas"}, {"tag": "p", "text": "The lost city of the Ghorfas was an ancient city built around the Desolation Canyons on Tatooine millennia before the rise of the Galactic Empire. The city was abandoned around 5000 BBY, when Human colonists deprived the native Ghorfas of their water supplies. Around the time of the Galactic Civil War, the city was in ruins and considered a legend."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Lost City was built into a cliff wall located near the Desolation Canyons, on the sun-scorched planet Tatooine. It consisted of a giant stepped structure surrounded by numerous terraces of round or square adobe dwellings. Ancient water wells were surrounded by heavy stone walls. The city's architecture was very similar to that of the slave quarters of the Mos Espa spaceport. Lines of tombstones lay at the foot of the front steps."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Thousands of years before the Galactic Civil War, Tatooine was inhabited by two sentient races, the Ghorfas and the Jawas, who both descended from the Kumumgah species. The Ghorfas were a sedentary people and competent builders. One of their settlements, later known as the Lost City of the Ghorfas, was built in the vicinity of the Desolation Canyons. Around 5000 BBY, when Human settlers stole all their water, many of the city builders died of thirst. The Ghorfas were forced to become nomadic, transforming into the Sand People, who lived an uneasy peace with the Human moisture farmers of Tatooine. Many hovels built by the Ghorfas were turned into slave quarters by the founders of the old towns."}, {"tag": "p", "text": "Three years before the Battle of Yavin, the young Luke Skywalker and his friend Biggs Darklighter accidentally rediscovered the city. The two Humans were headed for the city of Metameur, and they halted at the Douz outpost when their landspeeder needed a power charge. The old Technician of the power station advised Skywalker and his friend not to pass through the Desolation Canyons lest they run into a group of Sand People warriors. The man also told them about the legendary lost city of the Ghorfas, who was thought to be somewhere in the vicinity."}, {"tag": "p", "text": "However, Skywalker and Darklighter chose no to heed the technician's warning, and got caught into a sandstorm on their way to Metameur. Trying to escape the storm, the young men incidentally took refuge within the walls of the lost city. While exploring the place, the two Humans found many tombs engraved with ancient petroglyphs. When Skywalker tried to interprete the ancient writing on the tombstones, he understood the Ghorfas were in fact the ancestors of the Sand People, forced to abandon their city and adopt nomadic ways when colonists exhausted their water wells. Luke Skywalker intended to spread the news all over Tatooine, but his uncle Owen Lars forbade him to do so, arguing that the past was best left alone."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}