{"url": "Loth-cat", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Carnivorous creatures", "Category:Creatures of Lothal", "Category:Grassland and plains creatures", "Category:Non-sentient species", "Category:Tookas"], "nodes": [{"tag": "h1", "text": "Loth-cat"}, {"tag": "p", "text": "Loth-cats were small felines, members of the tooka family and native to Lothal, often found in the grassy plains of that Outer Rim planet. They were small, temperamental creatures, and while at times friendly, were still able hunters with sharp teeth and claws. They were carnivorous, and were known to feast on Loth-rats."}, {"tag": "h2", "text": "Behavior"}, {"tag": "p", "text": "Loth-cats were small, carnivorous felines, preying mostly on loth-rats and other small herbivores of Lothal's plains. Loth-cats were very persistent hunters, and would stalk their prey for hours, or even days. Loth-cats led solitary lives, coming together only to mate and raise kits. Loth-cats, when cornered, were very dangerous, and would fight against their would-be predators, most of the time going for the face, until they escaped or the aggressor backed off. They wouldn't typically attack creatures larger than themselves. Although it was very difficult, loth-cats could be domesticated, and they made good, albeit destructive, pets. With enough time and patience, they could even be taught to hunt and retrieve for their owners."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Loth-cats could be found in the grasslands on the planet Lothal where they used the grass as cover while hunting herbivores. A Loth-cat was once surprised by a drink carton falling on its head, seemingly from nowhere. In truth, the carton had fallen from the rebel ship Ghost, flying high above the grasslands."}, {"tag": "p", "text": "On another occasion, Kanan Jarrus attempted to teach his Padawan learner, Ezra Bridger, to feel the living Force through connection with a Loth-cat. Ezra failed the exercise, however, due to his distraction and irritation at the fact that it was Empire Day, and his own fifteenth birthday. The Loth-cat instead attacked Bridger."}, {"tag": "p", "text": "Some time later, while scouting out an Imperial Communications Center, Bridger demonstrated mastery of the same trick in causing a Loth-cat to attack an Imperial dwarf probe droid as a distraction, allowing himself and his companions to escape."}, {"tag": "p", "text": "Some time later, two Loth-cats were surprised in the grasslands by the R4 courier droid 264 falling from the sky. The droid was not destroyed, and righted itself, finding itself in curious company."}, {"tag": "p", "text": "Bridger first saw a rare white Loth-cat in a vision, and it led him to the conclusion that by following it, he would be able to find clues about his parents' fate. Later Bridger and Sabine Wren attempted to gather information about an TIE/D Defender Elite, only to have the TIE's guards attacked by a group of pair of loth-cats. A white cat also appeared with a loth-wolf."}, {"tag": "h2", "text": "Loth-cats in the galaxy"}, {"tag": "p", "text": "Around 9 ABY, a Loth-cat resided within a common house on the planet Sorgan. It snarled at Grogu from under a table as he passed by."}, {"tag": "p", "text": "Around 34 ABY, Loth-cats were imported to the planet Batuu and sold as pets in the Creature Stall at Black Spire Outpost."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}