{"url": "Lothal_Jedi_Temple", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Jedi temples", "Category:Lothal locations", "Category:Vergences"], "nodes": [{"tag": "h1", "text": "Lothal Jedi Temple"}, {"tag": "p", "text": "The Lothal Jedi Temple was an ancient and megalithic structure established and maintained by the Jedi Order prior to the end of the Clone Wars and the execution of Order 66. Located in the northern hemisphere of the planet Lothal in the Outer Rim Territories, it was one of many temples associated with the Jedi throughout the galaxy, and one of the few that was not destroyed by the Galactic Empire. Built into a natural stone spire and the caverns that sprawled out beneath it, the Temple was commissioned by the Jedi due to the vergence found at the site. It became a place where Jedi Masters would take their Padawans to determine their readiness to become a Jedi. Kanan Jarrus brought his Padawan, Ezra Bridger, to the temple several years before the Battle of Yavin as well as bringing Ahsoka Tano at one time."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Established by Jedi pilgrims of the Jedi Order in the northern hemisphere of Lothal, the Jedi Temple was constructed over a natural wellspring of Force energy which was concentrated below ground in a series of caves and tunnels. Identified by Jedi passing through the region, these members of the Order shored up the natural caverns with ornate stone pillars and adorned the walls with glyphs and paintings, and laid tile and stone artwork to form meditation halls and rooms devoted to study and contemplation. Using their mastery of the Force, the Jedi pilgrims removed the central rock spire from the ground and hollowed its interior, building a grand entrance at its base and a secondary entrance midway up its walls. Using Force-inspired architectural designs, the Jedi sunk the spire back into the ground, where it screwed into the bedrock to secure the Temple from intruders; concealing the entrances."}, {"tag": "p", "text": "Access to the Temple could only be gained by both a master and apprentice working together using the Force to lift the spire, which would rise in a corkscrew, counter-clockwise motion. If one of the pair lost focus, the outer building would sink back down into the ground. The upper entrance hall was simple and unadorned, leading into a small meditation room with a single door leading into the subterranean caverns beyond the outer wall of the spire. Once raised again to reveal the main entrance at the base of the spire, the doorways leading off of the grand entrance lined up with different halls that accessed different cave systems."}, {"tag": "p", "text": "Large, concentric circles symbolizing the light side and dark sides of the Force, were cut into the grounds of the Temple, spiraling out from the central spire and wrapping around the lesser, natural towers. Amid the symbols and circles was an ancient emblem of the Order itself, designated as the spot Master-Padawan teams should stand when attempting to open the Temple. When harnessing the Force to raise the spire, the markings on the ground were thought to give off a radiant light within the Force."}, {"tag": "p", "text": "The vergence that the Jedi had first detected at this site was quickly determined to concern the nature of attachment, and became the central aspect of the Jedi trial known as the Ordeal. Jedi would take their Padawans on a pilgrimage to the Lothal Temple to test the bond between themselves. The first challenge the pair would face involved opening the Temple to reveal the entrance. Once opened, the Master would begin meditation within the entrance hall while their Padawan entered the caverns beyond to face their Ordeal. Traveling through the tunnels, the Padawan would be visited by powerful visions that would test their attachment to their Master, friends, and the Order itself. If the Padawan could withstand the visions they would be able to find their way out back to their Master; if not, Master and Padawan alike would forever be entombed within the Temple."}, {"tag": "p", "text": "The Jedi Temple also had a painting of the Mortis gods, which served as a portal to the World Between Worlds. This was a mystical realm which could allow one to travel through time and control the fate of the universe."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lothal Jedi Temple was established by the Jedi Order long before the rise of the Galactic Empire. When the Jedi Order collapsed at the end of the Clone Wars, records of the Lothal Temple were lost to history. While some records remained detailing its location and use, only a Jedi would understand the references and clues to find its location. About four years before the Battle of Yavin, Ezra Bridger and his master Kanan Jarrus visited the Temple to complete Bridger's Jedi training. Participating in a series of trials known to the Jedi as the Ordeal, Bridger entered the Temple's caverns and experienced three different tests involving Force visions of the Grand Inquisitor killing Jarrus and the other spectres as well as the bones of long-dead Jedi. After surviving the Ordeal, Bridger encountered the incorporeal voice of Jedi Master Yoda who questioned Bridger about his motivations for becoming a Jedi. When satisfied, Yoda gave the young apprentice a kyber crystal which he used to build his lightsaber."}, {"tag": "p", "text": "A year later, Jarrus and Bridger returned to the Temple along with the former Jedi Padawan and Clone Wars veteran Ahsoka Tano in search of Master Yoda's counsel on the threat posed by the Empire's Inquisitors. While Bridger spoke with the spectral form of Yoda, Jarrus underwent his Jedi Trials at the hands of several Force manifestations which took the form of Jedi Temple Guards within one of the Coruscant Jedi Temple's dojos. Meanwhile, Tano experienced a vision of her former master Anakin Skywalker and learned that he had become Darth Vader. When Jarrus emerged from his Trials a Jedi Knight, having been knighted by the phantom of his old adversary the Grand Inquisitor, the Temple was violated by the two Inquisitors known as the Fifth Brother and the Seventh Sister. This violation by non-Jedi damaged the Temple as the darksiders forced the central spire to raise against its nature and disturbed the vergence. The Force nexus inundated the intruders with visions, with the spectral forms of the Temple Guards holding back the Inquisitors while the Jedi escaped. Soon after that, Imperial forces led by Vader arrived and secured the Temple."}, {"tag": "p", "text": "Following the Attack on Lothal, the Loth-wolves warned Bridger that the Empire was threatening the Temple, prompting the Padawan to lead a mission there. Prior to the Spectres' mission, the Emperor Palpatine had arranged for a portion of the Temple to be moved stone by stone aboard the Imperial Star Destroyer Chimaera for the purpose of unlocking the \"Gateway\" to the World Between Worlds. The Spectres discovered that the Empire and Mining Guild under Minister Veris Hydan were excavating the Jedi Temple with the hope of unlocking the Painting of the Mortis gods, which turned out to be a \"Gateway\" to the World Between Worlds. By that stage, the Imperials and Mining Guild had excavated numerous artifacts from the Temple."}, {"tag": "p", "text": "Disguised as scout troopers, Ezra and Sabine managed to infiltrate the camp. Using a key stone provided by the loth-wolves, Ezra and Sabine discovered that moving the Daughter's hand was the key to unlocking the \"Gateway.\" Though Sabine was captured, Ezra managed to unlock the portal and enter the World Between Worlds. Inside the World Between Worlds, Ezra managed to rescue Ahsoka Tano from Lord Vader. The two then escaped the Emperor's clutches. Meanwhile, Hera and Zeb rescued Sabine from Minister Hydan. In the process, Sabine learned that the Son's hand was the key to locking the \"Gateway.\" After reuniting with Ezra, the Spectres sealed the Gateway to the World Between Worlds; denying the Emperor access to the mystical realm. Sealing the Gateway caused the Temple to sink back into the ground, dragging Hydan with it."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Despite the Temple's destruction, the Emperor, with the help of Grand Admiral Thrawn attempted to use a portion of the Temple to access the World Between Worlds. However, Ezra destroyed the structure aboard the Chimaera; thwarting the Emperor's plans to control time and the universe."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lothal Jedi Temple first appeared in \"Path of the Jedi,\" the tenth episode of the first season of the animated series Star Wars Rebels. The Temple made several other appearances in the series and was featured prominently in season four.[source?]"}, {"tag": "p", "text": "The ancient script inside was based off writing seen in concept art by Ralph McQuarrie in The Illustrated Star Wars Universe."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}