{"url": "Lothal_astromech_droid", "categories": ["Category:Canon articles", "Category:Astromech droid models", "Category:Lothal astromech droids"], "nodes": [{"tag": "h1", "text": "Lothal astromech droid"}, {"tag": "p", "text": "The Lothal astromech droid was a model of astromech droid manufactured by Lothal Logistics Limited. Although they were not considered to be on par with the more advanced astromech models from Industrial Automation, Lothal astromech droids were considered to be decent enough droids. The droids had mostly white bodies, and had transparent domes that revealed some of their inner mechanisms much like Industrial Automatons R3-series Astromech droid."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Very loosely modelled after the design of the R3-series astromech droid, the Lothal astromech droid was a perfectly capable droid. Like the droids of the R-series, it consisted of a barrel shaped body with a transparent domed head and three limbs, one on both sides of the body and a shorter retractable foot beneath. Due to a lack of complex components and the low price of its construction, Lothal astromech droids were relatively light compared to other astromechs. This resulted in them being fairly easy to kick over and made them vulnerable to dust storms."}, {"tag": "p", "text": "Behind the flat lens cover of the droid's dome was a single-lens photoreceptor. Lacking the Intellex V of the R3 series, the model's very basic droid brain was also visible within its dome and was capable of holding the coordinates for a single hyperspace jump and the return journey. Its databanks could be loaded with the technical specifications of a variety of starships and vehicles. Alongside several other access ports, a port for a holocam was built into the dome, but no actual camera was included within the base model, which was obvious due to a visible lack of connections to the port within the dome."}, {"tag": "p", "text": "The boxy feet of the Lothal astromech droid offered less clearance than those the R-series, but was reliable, if somewhat noisy. The model had a clunky but reliable drive system that, like all of the systems in the Lothal astromech droid, could be easily accessed for repair or replacement. The base model came with a limited toolset hidden behind protective panels, including an arc welder, an electro-prod, a universal computer interface arm and a manipulator arm. Other toolsets were available to allow the droid to customise."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lothal astromech droid was produced by Lothal Logistics Limited and patriotically named for the planet Lothal, where their manufacturer was based. The company recognized that the majority of the world's population needed droids to help them and their businesses thrive, but could not afford the relatively exorbitant prices of even reliable secondhand droids, and so produced the Lothal astromech droid and RQ protocol droid in response. The model posed no threat to Industrial Automaton's domination of the astromech market, but was extremely successful in the Lothal sector, which included the mercantile hub Garel where the droids could be found during the Imperial Era."}, {"tag": "p", "text": "The droids light weight made them vulnerable to the dust storms that sprang up on Lothal as the Galactic Empire stripped the world of resources. The Imperial stormtroopers stationed on the world also discovered to their sadistic delight that the droids were light enough to be kicked over. An Ugnaught salesman who sold jogan fruits on Lothal had a Lothal astromech, that was kicked onto its back by stormtroopers while they harassed the Ugnaught. The duo's problems were solved when the Lasat Garazeb Orrelios beat up the stormtroopers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}