{"url": "Lott_Dod/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Galactic Republic senators", "Category:Males", "Category:Neimoidians", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Lott Dod"}, {"tag": "p", "text": "Lott Dod was a male Neimoidian member of the Galactic Senate who represented the Trade Federation. Dod, a manipulative being skilled at political maneuvering, held this position from as early as 33 BBY, when he fought against the taxation of the Federation-dominated Free Trade Zones. When this initiative failed, the Federation invaded the Mid Rim world Naboo in retaliation in 32 BBY. When Naboo's queen, Padmé Amidala, came to the Republic capital Coruscant to call upon the Senate to send much-needed aid to her beleaguered people, Dod made every effort to block Amidala's pleas, claiming that there was no proof to back up her accusations. Before the Senate could do anything about the Naboo crisis, Amidala returned to the world and oversaw its liberation, disgracing the Trade Federation and its Neimoidian leaders."}, {"tag": "p", "text": "Despite the scandal, Dod continued to represent the organization in the Senate, even during the Separatist Crisis that culminated with the Federation aligning with the breakaway Confederacy of Independent Systems. In the midst of the crisis, Dod was injured in a speeder accident, but this did not hamper his senatorial duties—the outspoken Neimoidian often participated in Senate debates from his recuperative ward at the Fobosi District Medcenter and ultimately recovered from the accident. When the Clone Wars erupted in 22 BBY, the Neimoidian senator claimed that the Federation's resources were being co-opted without the approval of its governing board. Nevertheless, Dod's true allegiance was to the Federation and the Confederacy, not the Republic. He conspired with the Separatists on numerous occasions throughout the war, and although his traitorous dealings were uncovered by members of the Republic, Dod continued to serve as the Federation's representative in the Senate on the urging of those wishing for a peaceful end to the conflict."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Senate career"}, {"tag": "p", "text": "The male Neimoidian Lott Dod was born on the Neimoidian homeworld of Neimoidia. By 33 BBY, Dod had become an influential and prominent member of the Neimoidian-dominated Trade Federation, a trade conglomerate that maintained a presence in countless star systems and possessed its own private army. The Neimoidians became more interested in representing the needs of the Federation in the legislative body of the Galactic Republic rather than the needs of their own homeworld, so Dod, a scheming bureaucrat, became the senator of the trade organization, succeeding fellow Neimoidian Nute Gunray, of whom he became a staunch supporter of.Within his senatorial office in the Senate Building, which mimicked the grub-hatcheries on his homeworld, Dod possessed a mechno-chair throne and a towering hologram of the Trade Monarch. Two competing teams of Neimoidian office drones rushed to complete the work of the Neimoidian delegation, while assistants and other employees—like diplomatic aides Mik Regrap and Lufa Danak—attended to Dod's needs."}, {"tag": "p", "text": "From his Senate pod in the Grand Convocation Chamber, Dod served the Trade Federation well, using his skill in political maneuvering to benefit the conglomerate. The Neimoidian's use of filibusters and manipulation of internal strife within the Senate prevented others from uncovering the truth behind the Federation's deceptive moves throughout the galaxy, and his actions put him at odds with the small amount of honest politicians within the Senate. At the same time, however, his machinations also earned him allies, such as Gran Senator Aks Moe of Malastare and several members of Supreme Chancellor Finis Valorum's office. Rumors abounded that they, too, were on the Trade Federation's payroll."}, {"tag": "h3", "text": "The taxation of trade routes"}, {"tag": "p", "text": "Around 33 BBY, the Trade Federation began to suffer from terrorist attacks launched by the Nebula Front, an organization that was opposed to the Federation's control over the trade routes. The Front scored a victory against the Federation above the lommite mining world of Dorvalla, where it succeeded in destroying the freighter Revenue and stealing a shipment of valuable aurodium. The Federation, fearing that the attack would be the first of many, decided to petition the Senate for assistance, as its own defense forces were insufficient to deal with the threat. Supreme Chancellor Valorum, fully aware of both the situation and the Federation's questionable dominance of the supposedly-Free Trade Zones, brought the organization's request to the Senate during a session. With other crises, such as the Yinchorri Uprising, in mind, Valorum stressed the need for diplomacy as opposed to militant expansionism, adding that conglomerates like the Federation were oppressing planets within the Free Trade Zones. Dod was quick to respond to the Chancellor's accusations, arguing that the Federation was suffering losses because the Republic refused to either establish a military force to protect the zones or allow the Federation to defend itself. Valorum attempted to dissuade Dod from continuing the argument; although the Neimoidian stopped, several other senators joined in Dod's protest."}, {"tag": "p", "text": "Valorum did not want to give the Federation more power, however, so he proposed that worlds within the Free Trade Zones—currently represented by the Federation in the Senate—should leave the Federation and instead join the Republic as full members. This move, if implemented, was expected to cause the trade routes in the area to become subject to taxation, something that the Federation did not want to deal with. Dod, unhappy with Valorum's proposal, announced his offense at what he considered to be an indirect attack against the Trade Federation, arguing that the Senate lacked the authority to tax the trade zones and was attempting to break up the Federation. Dod also stated that should the Senate refuse to intercede with the Nebula Front on the Federation's behalf, the governing body should at least give the trade consortium the appropriate means so that it could defend itself. Several other senators joined in, inserting their opinions into the debate. Finally, Valorum, on the written advice of Senator Palpatine of Naboo, proposed that some of the revenue from the taxation be used as financial assistance for outlying worlds. When this did not satisfy everyone, Palpatine suggested that a trade summit be held on the Outer Rim world of Eriadu to continue the discussion and eventually finalize the issue."}, {"tag": "p", "text": "Dod attended the Eriadu summit alongside Trade Federation Viceroy Nute Gunray and the other members of the Trade Federation Directorate. After arriving on the world, Dod informed Gunray of Senator Palpatine's stance as a potential ally of theirs after the Viceroy inquired after the man's identity. The two Neimoidians were flanked by their security droids as they walked with the rest of the Directorate. Dod stood by silently as Gunray and the others engaged in conversation regarding Chancellor Valorum and the impending taxation legislation. Unbeknownst to Dod, Gunray had entered into an agreement with the Sith Lord Darth Sidious—the secret Sith persona of Senator Palpatine—that would see the Neimoidians firmly in control of the Federation. To secure this result, Sidious had supplied Gunray with an additional battle droid, a commander that ultimately feigned a malfunction and assassinated the non-Neimoidian members of the Directorate. When the droid was added to the other security droids guarding the Neimoidians, Dod told Gunray that he thought they had only brought twelve droids, not thirteen, although he did not question the matter further. The Federation delegation entered into the summit chambers and took their seats, with Gunray making note of Dod's location."}, {"tag": "p", "text": "Before Valorum could begin his opening remarks, a Human page approached Gunray and informed him that a plasma leak had been detected in his shuttle's engines, a security matter that he needed to tend to immediately. Dod asked the Viceroy whether or not he should remain with the rest of the delegation, but Gunray told him to accompany him to handle any legalities that should arise. After they departed, blaster fire erupted within the chamber, prompting the remaining members of the Directorate to activate a force field that had been set up around their seats. Though successfully shielded from outside attacks, the Directorate members had trapped themselves inside, vulnerable to Sidious's thirteenth droid. When the time came, the commander and the twelve other droids unleashed a volley of blaster bolts that killed the remaining Directorate members as the other members of the summit helplessly watched in horror. When the two Neimoidians returned, security agents initially prevented them from entering the hall. After learning of the events, Dod and Gunray did not protest when technicians utilized field disruptors to deactivate the droids. Because of their diplomatic privileges, the pair left Eriadu without responding to any inquiries. The Republic launched an investigation into the incident, and when asked about the thirteenth droid, Dod said that both he and Gunray had been puzzled by its presence. The Republic also concluded that the reasons for the Neimoidians' absence from the massacre was legitimate, albeit somewhat mysterious, as whoever had contacted security about the plasma leak had disappeared by the time of Gunray's and Dod's arrival."}, {"tag": "p", "text": "In the end, despite all his influence, Dod was unable to prevent the passing of a bill enacting the taxation of the outlying trade routes. Senate Resolution BR-0371 became law, much to the Federation's chagrin. The Trade Federation, however, was not ready to submit to the new law without a fight. Senator Dod, from his repulsorpod in the Senate Rotunda, was fully prepared to do what was necessary to further the conglomerate's goals, despite the setback."}, {"tag": "h3", "text": "Invasion of Naboo"}, {"tag": "p", "text": "In 32 BBY, the Trade Federation blockaded and invaded Naboo as a means of protest against the taxation of trade routes. His efforts to prevent the taxation having failed, Dod used his knowledge of Congressional procedure to delay any countermeasures by the Republic until it was too late to prevent Naboo from being overrun. However, the Neimoidians had not conceived the invasion. Rather, they were instructed to do so on the advice of the Sith Lord Darth Sidious, their mysterious benefactor. On Coruscant, Sidious, in his alter ego of Palpatine, repeatedly tried to meet with Dod to discuss Naboo's situation, with no success. In response to the blockade, Chancellor Valorum dispatched two Jedi—Master Qui-Gon Jinn and his Padawan, Obi-Wan Kenobi—as his ambassadors to meet with the Federation, but before any negotiations could commence, Viceroy Gunray attempted to have them killed per Sidious's orders. The pair escaped to Naboo's surface and rescued the captive Queen Amidala and her entourage. The group fled Naboo and, after a detour to the planet Tatooine for repairs, they arrived on Coruscant, where the Queen brought news of the Federation's actions to the Senate."}, {"tag": "p", "text": "During the Senate session, Senator Palpatine revealed the Federation's invasion of Naboo to his senatorial colleagues but was cut off by Dod, who rushed his Senate platform to the center of the rotunda. The Neimoidian objected to Palpatine's insinuations and called for him to be silenced, but Valorum ignored him, ordering Dod and his delegation to retreat from the discussion. Palpatine continued and introduced the Queen to the governing body. As she began to divulge information of the Federation's invasion, Senator Dod again detached his platform from the wall of the chamber and rushed to cut off Amidala mid-sentence. Staying true to his filibustering ways, Dod objected to the Queen's accusations and suggested that a commission be formed and sent to Naboo to determine if Amidala's claims were valid. Valorum initially overruled him, but Dod pressed further, calling for an impartial observation in accordance with the rules for procedure."}, {"tag": "p", "text": "This time, the Gran Senator Aks Moe seconded the motion. Valorum consulted with his Vice Chair, the Chagrian Mas Amedda, and concluded that a commission should be established in accordance with the rules that Dod had cited. Valorum asked Amidala to defer, but she was resolute and announced that she would not suspend her plea. Having seen the bureaucratic manipulation firsthand, Amidala took Palpatine's advice and called for a Vote of No Confidence in Valorum's leadership, hoping that a new Supreme Chancellor would be able to bring order to the Senate and resolve the Naboo crisis. Following a cascade of cheers of both support and disapproval, Dod maneuvered his Senate pod close to Naboo's and briefly exchanged a glance with Palpatine before Senator Edcel Bar Gane of Roona formally seconded Amidala's motion. Dod then suggested that the motion be sent, for further analysis, to the procedures committee. Among the candidates proposed to succeed Valorum was Representative Ainlee Teem of Malastare, whom Dod had previously supported as a potential candidate for the Chancellorship. In the end, Amidala personally led the liberation of her homeworld and captured Viceroy Gunray, while Valorum was voted out of office and replaced by Palpatine. Though Gunray ultimately faced four trials before the Republic Supreme Court, he still retained his title of viceroy, and the Federation itself only faced minor setbacks in the aftermath of the Naboo incident. By 22 BBY, Gunray had pledged the Federation's support to the growing Confederacy of Independent Systems, a collection of corporations and other organizations with grievances against the Republic government."}, {"tag": "h3", "text": "Separatist Crisis"}, {"tag": "p", "text": "In 22 BBY, during the Separatist Crisis, scientists from the University of Sanbra discovered unicellular microbial life on PDC3141-02, a Mid Rim planetoid previously believed to be devoid of life that was being used for the disposal of toxic waste produced by corporations. The University was able to get an injunction stopping further dumping on the planetoid, but news of the injunction came too late for the crew of the Spotty Conveyor, a Trade Federation scow transporting radioactive waste from Federation-owned industrial worlds. With failing rad-dampening shielding and not enough fuel to leave the system, the six-being crew was faced with a perilous situation. Dod and the Federation lobbied for the injunction to be removed, hoping to allow the scow to deposit its cargo and leave the system. During a Senate session, Dod expressed his displeasure over the situation and even said that the centuries of dumping on the planetoid could have played a part in nurturing the lifeform."}, {"tag": "p", "text": "Not long after the PDC3141-02 incident, Dod was traveling along Skylane T-534D of the Fobosi District in an airspeeder when a malfunctioning Skyways Flyer automated pubtrans flitter, traveling down T-534D in the wrong direction, forced several commuters—including Dod—to collide with a water silo in their attempts to avoid the flitter. Dod was injured in the accident, and he was hospitalized at the Fobosi District Medcenter. Though somewhat disfigured from the collision, he was listed as in stable condition and had to undergo bacta therapy and reconstructive surgery. According to a HoloNet News report, Dod's lawyers intended to sue Skyways Flyer for the accident."}, {"tag": "p", "text": "Despite his injuries, Dod continued to serve as the Federation's representative in the Senate. Some of Dod's contacts were used by the Trandoshan Crovessk, chief executive officer of Revessa Global Shipping, in his appeal to the Senate requesting representation for Trandosha in the governing body. After a Republic courier ship was fired upon by droid starfighters in Andoan space, Senator Rasit Brun of Rintonne accused the Federation of supplying the Aqualish with military hardware. From his recuperative ward, Dod responded to Brun's accusations during a Senate session, calling the senator's insinuations outrageous. Dod's statements caused the session to dissolve into a series of orderless arguing."}, {"tag": "p", "text": "Around this time, Coruscant health officials began quarantining Neimoidians newly arrived to the world because of the species's notoriety for carrying the Brainworm Rot disease. This move likewise outraged Dod, as he saw the segregation as just another act of laying blame on the Neimoidian people for something that was not their fault. Senator Orn Free Taa of Ryloth made a joke about Dod's speeder accident on the Amberdawn morning show; although Taa later apologized for the move, Dod was still offended by the joke. Dod eventually recovered from his injuries and returned to his full senatorial duties."}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "War eventually broke out between the Republic and the Confederacy of Independent Systems in 22 BBY on Geonosis, and the Republic became aware of the Federation's involvement in the Separatist Alliance. However, the Republic reluctantly ignored the treasonous acts of entities like the Federation and the InterGalactic Banking Clan, as those megacorporations were vital to the Republic's economy. Senator Dod denied that his organization was a member of the breakaway alliance, stating that Federation resources had been co-opted by the Confederacy without the permission of the Federation's governing board, although he also claimed that the Separatists had legitimately bought equipment from the corporation in marketplace. He further iterated that Viceroy Gunray was an \"extremist\" who did not speak for the organization as a whole, which was steadfast to the Republic and dedicated to trade throughout the galaxy, even when the galaxy was in turmoil. The truth of the matter was that Dod knew of the Federation's active involvement with the Separatists, and he was even involved in dealings with the Confederacy. Moreover, Dod's allegiance remained to Gunray, though he was required to deny any connection to \"the Separatist\"."}, {"tag": "p", "text": "Though many suspected he was a high-ranking member of the Confederacy, and although he pursued a Confederate agenda, Dod remained as the Federation's senator at the urging of those who sought a peaceful resolution to the war. Dod even maintained a facade of helping the Senate in negotiating an end to the conflict; in actuality, the Neimoidian received a paycheck for equipping both belligerents in the war. Dod maintained a palace on Cato Neimoidia, from which he conducted dealings with the Separatists, far away from the spies of Republic Intelligence."}, {"tag": "h4", "text": "Aiding the Confederacy"}, {"tag": "p", "text": "During the course of the war, the planet Ryloth was invaded by the Confederacy, cutting off the Republic's supply lines to the beleaguered Twi'lek inhabitants. Senator Bail Organa of Alderaan and Representative Jar Jar Binks were dispatched to neutral Toydaria to negotiate with the planet's king, Katuunko, for the establishment of new supply lines. The Confederacy learned of this mission, prompting Count Dooku to send Dod to Toydaria to prevent any such alliance from forming. As the Republic's representatives pleaded their case before Katuunko, Dod, accompanied by an aide, appeared before the Toydarian king and urged him to consider both sides of the issue, as the Trade Federation had an important contract with Toydaria. Organa argued that any Toydarian assistance would not violate the world's treaty with the Federation; the compassionate Katuunko was inclined to agree, until Dod stated that the Republic representatives had failed to mention the Separatist blockade of Ryloth. The king, angered by Organa's apparent dishonesty, had no intentions of breaking Toydaria's neutrality and retired to discuss the issue with his ministers."}, {"tag": "p", "text": "When the negotiations resumed, Dod continued to manipulate the situation in the Confederacy's favor, arguing that the planet would no longer be considered neutral in the eyes of the Separatist Parliament should the Toydarians send aid to Ryloth. Dod claimed that Federation ships would fall under Separatist attack as a result, prompting the Trade Federation to end all trading operations with the Toydarians. Having again heard both sides' arguments, Katuunko dismissed the representatives while he came to a decision. At their next meeting, the king sided with Dod, believing Toydaria's neutrality to be more important. This verdict, however, did not prevent Katuunko from letting Organa depart with the small amount of provisions they currently had access to—provided the Federation did not learn of the deal."}, {"tag": "p", "text": "Organa used a subsequent formal dinner between the diplomats as cover for the transfer of supplies to awaiting transports, tasking Representative Binks with occupying Senator Dod's attention during the transaction. As the transports departed past the banquet hall's windows, Binks stacked all of the plates and cups at the dinning table into a makeshift piece of Gungan art intended to \"honor\"—but primarily distract—the Neimoidian. The transports left Toydaria undetected, providing the Twi'leks on Ryloth with their much-needed supplies. The next day, Katuunko accompanied Organa and Binks to the CR90 corvette Tantive IV as the Republic representatives prepared to depart, but an outraged Dod confronted the trio with his knowledge of the supplies reaching Ryloth. Organa suggested that Dod bring an inquiry before the Senate; Dod knew a decision from such a motion would take years to attain, and, before departing, warned the Alderaanian senator of the dangerous game he was playing."}, {"tag": "h4", "text": "Wartime investments"}, {"tag": "p", "text": "In late 22 BBY, Dod conspired with Geonosian Archduke Poggle the Lesser and Senator Rush Clovis of the InterGalactic Banking Clan, another pro-Separatist organization that also claimed to be remaining aligned with the Republic, in an agreement to strengthen the Separatist's droid army. Because Dod and the elite on Cato Neimoidia had suffered financially from the war, the senator was forced to turn over his assets to the Banking Clan, which used them as collateral in the construction of warships and droid armies for the Separatist cause. Because he had signed his assets over to Clovis for the construction of a new droid foundry on Geonosis, Dod would be rewarded with considerable wartime profits, hoping that any revenue generated would greatly benefit his people. Yet, the Jedi Order had begun to suspect Clovis's Separatist sympathies and decided to send Senator Amidala, the former queen of Naboo, to spy on the Banking Clan senator in hopes of uncovering his true loyalties. To this effect, Amidala accompanied Clovis to the Neimoidian purse world Cato Neimoidia, where he was to collect on a business transaction with the Trade Federation. In reality, Clovis would be finalizing his deal with Dod."}, {"tag": "p", "text": "Upon their arrival at Lott Dod's palace, Amidala and Clovis were greeted by the Federation senator. Dod, flanked by two BD-3000 luxury droids, expressed his surprise at Amidala's arrival but nonetheless welcomed her after an exchange of their mutual beliefs in second chances. While Amidala was led to her guest chambers, Dod and Clovis ventured to a lower level of the palace to further discuss their deal. Dod expressed his concern over Amidala's presence, whom he correctly believed was spying on Clovis. Faced with an increased risk, Dod and Poggle the Lesser—who had emerged from the shadows—attempted to negotiate a greater profit from the venture. Clovis strongly disagreed, as Dod had become too indebted to the Banking Clan to begin asking for a larger stake. The trio was forced to cut the negotiating short as Amidala approached. Poggle retreated into the shadows upon her arrival, and Dod watched silently as the two senators conversed before departing. When the pair was out of earshot, Dod and Poggle discussed the possibility of using Amidala to their advantage, as Clovis had an affection for her. The Neimoidian decided that with the Naboo senator dead, Clovis was likely to be more susceptible to agreeing to their demands, so he planned to poison Amidala. It was a win-win situation for Dod—if Clovis wanted the antidote, the Banking Clan senator would have to give him a better deal; if Clovis refused the Neimoidian's terms, Amidala would die."}, {"tag": "p", "text": "Dod caught up with his fellow senators before dinner and offered a toast to their friendship. The Neimoidian senator discreetly applied manax-root poison, a slow-acting and hard-to-detect toxin that brought about unconsciousness and death, to the brim of Amidala's glass. In taking a sip, Amidala unknowingly swallowed the poison. The trio proceeded to dinner, after which Dod departed. Amidala used this opportunity to accompany Clovis on a tour of the palace and secure the hologram containing the coordinates to the new droid foundry. Before she could depart Cato Neimoidia, however, she began suffering from the poison. Clovis recognized her symptoms and confronted Dod with his knowledge. The Neimoidian told him of Amidala's true reasons for accompanying him to the world; Clovis confirmed this by finding that the data on the droid factory had been stolen. After confronting Amidala, Clovis decided to retrieve the antidote from Dod in exchange for the stolen data. Holding Dod and his aides at blasterpoint, Clovis obtained the antidote but failed to retrieve the data before Amidala fled the planet with the antidote. Dod, accompanied by a squad of B1-Series battle droids, approached the stranded Banking Clan senator and calmly requested that they \"have a word\" with each other as the droids trained their blasters on Clovis."}, {"tag": "h4", "text": "Blockade of Pantora"}, {"tag": "p", "text": "Dod continued to assert that the Trade Federation was unaffiliated with the Separatists as the conflict progressed, a facade further exploited by Count Dooku. When the conglomerate initiated a blockade of Pantora, isolating the moon from the rest of the Republic, Dooku offered aid to the Pantoran people on the condition that they join the Confederacy. Pantoran Senator Riyo Chuchi was dispatched to Coruscant to plead before the Senate before Dod could legalize the Federation's blockade. Dod informed the Senate that the Pantoran government was in debt to the Federation, warranting a blockade until the matter could be settled. Chuchi, like others before her, accused the Federation of being a member of the Separatists; Dod was willing to admit that the Federation had done business with Dooku's Confederacy but stated that such dealings were not treasonous. The Neimoidian invoked the Commerce Treaty of 1647 to further support his claims of the organization's neutrality."}, {"tag": "p", "text": "As an added insurance policy, Sib Canay, commander of the Federation's blockade of Pantora, had both daughters of Pantoran Chairman Notluwiski Papanoida kidnapped, hoping to force the chairman to join the Confederacy in exchange for his daughters' return. This plot was uncovered by Senator Chuchi and the Papanoida family, who succeeded in rescuing the chairman's daughters. The plot uncovered, Chuchi accused Canay and his envoy of war profiteering and blackmailed them into ending the blockade. Before the Senate, Dod revealed Canay's Separatist sympathies, seemingly a result of Nute Gunray's influence, and announced the end of the Federation's blockade as a gesture of goodwill to the Pantorans."}, {"tag": "h4", "text": "Deregulation of the Banking Clan"}, {"tag": "p", "text": "In 21 BBY, as a result of high clone trooper casualty rates, a bill calling for an increase in military production was introduced into the Senate by Ishi Tib Senator Gume Saam. Several other delegates were opposed to the legislation; among them, Senator Bail Organa argued that the bill would force the Republic into bankruptcy. Dod insisted that if the legislation were to pass, the Republic could open new lines of credit with the Banking Clan to provide for the increase in trooper production—although such a move would result in the deregulation of the banks. Senator Amidala suggested that the Senate open negotiations with the Confederacy as an alternative to the increase in military spending, but not all were satisfied with her proposal. The session erupted into argument between the pro- and anti-war senators, with Tarnab Senator Mot-Not Rab initiating the call for a vote. Organa suggested that the Senate take time to weigh the benefits and detriments of banking deregulation, a move supported by Vice Chair Mas Amedda."}, {"tag": "p", "text": "Following the session, Dod and Saam met with the Muun Nix Card of the Banking Clan, who was upset that the bill had been unable to pass immediately. Dod cast the blame on Amidala, whose interference he did not expect; although Saam suggested that someone be hired to assassinate her, the Neimoidian dismissed the idea as too difficult to accomplish. Dod and Card were in agreement, however, that the business of their respective organizations was violence. The Muun suggested that they bring the war directly to Coruscant to spur the Senate to pass their legislation—he argued that a thousand years without a direct attack on the capital had given its residents a false sense of safety. Card contacted Count Dooku for assistance in carrying out the plot; Dooku tasked the cyborg General Grievous with overseeing the transfer of disguised demolition droids to Coruscant to wreak havoc and force the Senate to act."}, {"tag": "p", "text": "Before the infiltration units could succeed in their mission, Senator Amidala traveled to the Confederate capital of Raxus and convinced Separatist Senator Mina Bonteri to initiate a call for negotiations between the warring government within the Separatist Parliament, a motion supported by a majority of its senators. With the resolution passed, Dooku contacted the three conspirators on Coruscant, who were troubled by the development and wanted to know what had happened to the demolition droids' mission. The Count did not share their concern; he knew that once the droids carried out their programming, the move for peace would be halted and the war would continue. When the time came for the Republic Senate to vote on the peace initiative, the demolition units succeeded in destroying a Coruscanti power generator, knocking out power to the Senate District and setting off a series of explosions that injured many of the planet's citizens. Senator Saam used the situation to his advantage, prompting several members of the Senate—including Chancellor Palpatine—to call for the deregulation of the banks to secure the money necessary to finance the increase in troop production."}, {"tag": "p", "text": "Around 20 BBY, Dod was present in the Senate during a vote to confirm Baron Rush Clovis as the new head of the InterGalactic Banking Clan. Despite his earlier dealings with the Separatists, Clovis had brought word to the Republic that the Muun leaders of the Banking Clan were embezzling credits, an act that threatened the Republic's financial system. Though many remained suspicious of him, Clovis was nominated to assume control of the Banking Clan following the arrest of the Muun leadership, and he pledged before the Senate that he would be neutral in all financial matters. When it was noted that Clovis had the support of both the Separatist government and the Muun people, Dod demanded to hear the Chancellor's views on the matter, and Palpatine obliged him by stating that Clovis was the best candidate, given the circumstances. In the subsequent vote, the Senate confirmed Clovis as the new leader of the Banking Clan. As it would turn out, Clovis's appointment had been a result of the machinations of Count Dooku, who sought to use him to control the Banking Clan. Clovis ultimately died during the Separatists' temporary occupation of the organization's headquarters on the planet Scipio, but his treachery was enough to convince the Muuns and the Senate to hand over control of the banks to the Office of the Supreme Chancellor. Dod was present in the Senate Rotunda when this occurred."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Cunning and immoral, with a voice reminiscent of that of a snake charmer, Lott Dod was a scheming bureaucrat who often used political tactics such as filibusters, manipulative wrangling, and even bribery to further the goals of the Trade Federation. He had a skill for twisting the facts of the Federation's more questionable actions. Profit-driven and avaricious, Dod was an unsympathetic, overbearing, and arrogant Neimoidian, embodying both the pomposity that stereotyped his species and the corruption that plagued the Senate in the final years of the Republic. When needed, the accomplished statesman would stall any investigations into the Federation's actions, including the conglomerate's expansion. He usually spent his time in the company of the greedy trade barons who controlled the Outer Rim's space lanes; Dod was determined to protect their interests from his seat in the Senate. Through the use of kickbacks, he ensured that the Republic was unable to regulate the Federation. Dod found formal dinners tiresome."}, {"tag": "p", "text": "Though reviled by the few honest politicians that remained within the Senate, Dod gained the allegiances of several corrupt senators like Aks Moe and members of Chancellor Valorum's administration. The Neimoidian's influence had spread throughout the Senate, but he was unable to use his sway to defeat the bill proposing the taxation of trade routes. Following the Federation's invasion of Naboo, however, Dod successfully utilized political stalling to block inquiries into the incident and derailed democracy in the process, though the extent of the Federation's actions were soon revealed when Naboo was liberated. Even when it was learned that the Federation played a considerable role in the Confederacy of Independent Systems, Dod continued to represent the organization in the Senate, claiming that the Federation's resources were being used without approval from the governing board, or that they had been purchased legitimately. Even he himself had dealings with the Separatists. He was also secretly supportive of Nute Gunray's anti-Republic sentiment and proved himself quite obedient and flattering before his superior. After the Viceroy's fall from grace, Dod accused him of being a radical and officially distanced himself from him, though this was a ploy to benefit the Federation. On the subject of bioweapons, Dod saw them as an insult to members of his species, who were often viewed as nothing more than disease carriers."}, {"tag": "p", "text": "Because of their status-obsessed culture, Neimoidians commonly donned lavish clothing with symbolic meanings as a way of displaying one's wealth and position in society. As senator, Dod wore a large senatorial miter capped with a diplomatic ploov, which indicated his position. His clothes were made out of Tyrian violet cloth, an incredibly expensive fabric. The Neimoidian also wore a supreme representative mantle draped over his shoulders, one that indicated his high status. Dod stood at 1.9 meters in height and weighed 79 kilograms."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Portrayal and development"}, {"tag": "p", "text": "Senator Lott Dod first appeared as a minor character in the novelization of 1999's Star Wars: Episode I The Phantom Menace. In the film, he was played by Silas Carson and voiced by Toby Longworth. Though Dod only appears in the Senate scene in The Phantom Menace, he plays a major role within the legislative body in safeguarding the Federation's ambitions. Dod later received a relatively larger role in 2001's Cloak of Deception, in addition to mentions in several online HoloNet News articles serving as lead-ins to 2002's Star Wars: Episode II Attack of the Clones. On October 16, 2009—over ten years after Episode I's release—Dod was featured as a major character in \"Senate Spy,\" an episode in the second season of Star Wars: The Clone Wars. He later appeared in the season three episodes \"Supply Lines,\" \"Sphere of Influence,\" and \"Heroes on Both Sides,\" and the season six episodes \"The Rise of Clovis\" and \"Crisis at the Heart.\" In these episodes, he was voiced by Gideon Emery."}, {"tag": "p", "text": "He was named after then-GOP Senate leader in 1997 Trent Lott, in an attempt to directly connect the Trade Federation's characterization and motives with that of the Republican Revolution that occurred in 1994."}, {"tag": "p", "text": "Originally, for their Episode I debut, Dod and the Neimoidians were designed as organic versions of the Federation's B1 battle droids. This was done to suggest that the Neimoidians had modeled the battle droids after their own image. For this to work, the Neimoidians would have had to been produced by computer-generated imagery. During production, the Art Department opted to use animatronic masks to bring Dod and the Neimoidians to life. Consequently, the Neimoidians' appearances changed dramatically. Additionally, Dod's senatorial miter first appeared in rough sketches of the Neimoidian who later became Rune Haako."}, {"tag": "p", "text": "While the old StarWars.com Databank listed Neimoidia as Dod's homeworld, both the Star Wars: The Clone Wars Character Encyclopedia and the StarWars.com Encyclopedia claim Dod hailed from Cato Neimoidia. Until the discrepancy is clarified, this article assumes that the information presented in the Databank is correct."}, {"tag": "p", "text": "According to some early layout animation scenes released in Star Wars: The Clone Wars The Complete Season Two's Blu-ray \"Jedi Temple Archives\" feature, Dod originally corners Rush Clovis, Anakin Skywalker, and the poisoned Padmé Amidala outside the palace and orders a B1 battle droid squad to detain them, but only gives Clovis the antidote to the poison and allows them to leave after further threats on Clovis's part. In the final version of the episode, Dod's threats are somewhat less menacing, as he does not order Amidala and Skywalker detained."}, {"tag": "p", "text": "A deleted scene from \"Heroes on Both Sides\" has Dod confronting Bail Organa in the halls of the Senate Building, following the announcement about the Confederacy's offer for peace. Dod is adamant that they will not let any further talk of a treaty proceed with the Separatist \"terrorists,\" whereas Organa believed that the ongoing war itself, not entering negotiations, is the greater threat to the Republic. The scene was included in Star Wars: The Clone Wars The Complete Season Three's Blu-ray \"Jedi Temple Archives\" feature."}, {"tag": "h3", "text": "Possible appearance in Attack of the Clones"}, {"tag": "p", "text": "In 2002's Attack of the Clones, a Neimoidian wearing clothing similar to that of Dod appears alongside Gunray on Geonosis, spawning a debate as to who the Neimoidian was. The end credits for the film identify the Neimoidian as Lott Dod (as portrayed by Alan Ruscoe), but the Neimoidian does not resemble Dod—in voice or appearance—from The Phantom Menace. The reference book Inside the Worlds of Star Wars: Attack of the Clones even identified the occupants of Poggle's box as Nute Gunray, Boba Fett, Poggle, Dooku, and Lott Dod. A series of HoloNet News articles published before Episode II's theatrical release seem to establish a speeder accident, followed by reconstructive surgery, as the reason for his altered appearance. The behind-the-scenes explanation for this is that Daultay Dofine's mask from Episode I was given to Alan Ruscoe, who actually portrayed the Neimoidian in Episode II, with a voice provided by Chris Truswell. Nonetheless, the confusion over the character did not stop there."}, {"tag": "p", "text": "Because the Neimoidian utilized Dofine's mask, it was believed that he would be made into a new character, named Gilramos Libkath, after Gillian Libbert and Kathryn Ramos. This name was also applied for the Neimoidian in Star Wars: Attack of the Clones: The Visual Dictionary. Although Gilramos Libkath was later used as an actual Neimoidian in Boba Fett: Hunted, it was eventually established that Libkath did not appear on Geonosis. Rather, as Leland Chee revealed, Lucasfilm's official verdict is that the Neimoidian who appears alongside Gunray on Geonosis is not Dod, but Rune Haako. More recent sourcebooks, such as The Complete Visual Dictionary, also identify this character as Haako. As for Dod, the senator has since appeared in The Clone Wars series appearing much like he did in The Phantom Menace. In an interesting turn of events, several more recent publications, including The Clone Wars Comic UK 6.29, The Clone Wars Magazine 10, and The Clone Wars Comic UK 6.30, have erroneously pictured Dod when referring to Rune Haako."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}