{"url": "Lourdes", "categories": ["Category:Legends articles", "Category:Females", "Category:Individuals of unidentified species", "Category:Near-Humans", "Category:Royalty"], "nodes": [{"tag": "h1", "text": "Lourdes"}, {"tag": "p", "text": "Lourdes was the female Near-Human princess of a fairly low-tech planetoid. When her homeworld was conquered by the Yahk-Tosh Lord Gar-Oth, Lourdes joined forces with a Jedi Knight named Yoshi Raph-Elan to end the invasion and free her people."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "When Lourdes was born, her entire population of her homeworld rejoiced. Her father was a much-beloved king, renowned for his fair governing style and his noble character. Though she lived a peaceful life, Lourdes was trained in swordsmanship by her father, whom she regarded as the finest swordsman in the system. She was attended by many retainers, one of them of a different species, named Skeeter."}, {"tag": "h3", "text": "Invasion"}, {"tag": "p", "text": "In time, however, Lourdes's planet became the target of a Yahk-Tosh Lord named Gar-Oth. Gar-Oth lived in a nearby star system, and had long sought a new world to conquer. Though it would be many years before Gar-Oth would act on his desires, in 31 BBY, he invaded her world, attacking her civilization with his GX1-series battle droids and starships. Despite their less-advanced weaponry and lack of a standing army, Lourdes's people resisted Gar-Oth; in response, they were slaughtered. The king and all his people surrendered to Gar-Oth to stop the senseless killing, but Gar-Oth was not mollified, and had the king himself executed. With the death of their beloved king, Lourdes's people gave up all hope, only holding onto the vague prophecy of a vision that described a hero known as the Foreseen."}, {"tag": "p", "text": "Lourdes herself, however, held onto both hope and a deep desire for revenge. Gar-Oth's battle droids cracked down on any unwanted behavior, and patrolled the streets of the capital day and night. All offenses were met with the same punishment—death. Lourdes begged the Yahk-Tosh to stop the killing, and he responded that he would, if she would marry him in return. Disgusted but left with no other option, Lourdes relented. Gar-Oth kept a close eye on his future bride, using small hovercams to watch over her."}, {"tag": "h3", "text": "A hero"}, {"tag": "p", "text": "On the day of the wedding, however, newly knighted Jedi Yoshi Raph-Elan, entered the system of Lourdes's homeworld in his starfighter. He immediately came under fire by Gar-Oth's attack ships, and was forced to crash-land on the planet. After skirmishing with one of Gar-Oth's droids in the street, he vowed to uphold his Jedi Code and free the downtrodden people. Mostly by accident, Raph-Elan made his way to Lourdes's bedchambers, where the princess was losing her last hope at the prospect of having to endure Gar-Oth's physical attentions. She was greatly pleased when Raph-Elan proudly revealed that he was a Jedi Knight. Lourdes told Raph-Elan that he may indeed be the Foreseen her people had hoped for, and brought him to her wedding disguised as a servant."}, {"tag": "p", "text": "Upon arriving at the wedding ball, however, Raph-Elan broke from their plan and announced that he was in fact Lourdes's husband. He then he brandished his lightsaber, only to discover that it had been rendered useless in his crash landing. Enraged, Gar-Oth attacked Raph-Elan, who sought to fight off the slug-like being with the Force, only to discover that Yahk-Tosh were largely immune to Force powers. Gar-Oth then ordered the revelation of his \"wedding gift\" to Lourdes—the monstrous Goliath battle droid. He commanded the droid to kill Raph-Elan, while Gar-Oth and his Jilruan guards moved against Lourdes herself. Gar-Oth was no longer satisfied by his plan to marry her, and saw her actions as treachery."}, {"tag": "p", "text": "Lourdes attempted to defend herself with a sword, but was surprised by Gar-Oth's speed and strength. He overwhelmed her and began to crush her throat between his hands, only to be shocked as she pulled another sword from beneath her robes and plunged it into him. Though Gar-Oth's Jilruan guards sought to assist him, Skeeter held them at blaster-point, allowing Lourdes to finish the job. Gar-Oth died in a pool of blood. Raph-Elan was also able to destroy the Goliath droid, repairing his lightsaber and felling the behemoth."}, {"tag": "p", "text": "In the aftermath of Gar-Oth's death, Lourdes ascended to the throne, becoming queen of her world. A Jedi courier ship arrived to bring Raph-Elan back to Coruscant, but before he left, Lourdes spoke with him. She revealed that she was actually the Foreseen, as the prophesied hero had always been known to be a woman. With a kiss, she then asked him to return to her planet when he'd grown up a bit, saying that in time, he could become her king."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Leland Chee, on the StarWars.com Message Boards, stated that his theory is that \"all pointy-eared species are either Sephi or closely related to Sephi.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}