{"url": "Lourna_Dee", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Females", "Category:Nihil members", "Category:Twi'leks"], "nodes": [{"tag": "h1", "text": "Lourna Dee"}, {"tag": "p", "text": "Lourna Dee was a female Twi'lek who held the rank of Tempest Runner in the marauder organization known as the Nihil. One of three Tempest Runners, Dee led a Tempest and commanded a cruiser, which she named Lourna Dee after herself."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Born around 272 BBY, Lourna Dee was a female Twi'lek that was a member of the Nihil, an anarchic group of marauders. She eventually became a Tempest Runner, alongside Pan Eyta and Kassav Milliko. Lourna Dee's Tempest inherited her sadism and developed the reputation of only striking when they absolutely knew they would win."}, {"tag": "h3", "text": "The Great Disaster"}, {"tag": "p", "text": "Around 232 BBY, soon after the Great Hyperspace Disaster, Dee and Milliko's Tempests helped Eyta's in a raid on Ab Dalis and were successful for the most part. A celebration was hosted by Pan Eyta at the Great Hall of the Nihil in No-Space. Zagyar, a Storm of hers who partially ruined the raid, was questioned with Dee's permission but it is unknown if he punished for this. The Eye of the Nihil, Marchion Ro, called for a meeting between him and the Runners. Ro explained that usage of the Paths would be restricted until the heat died down after the Disaster. The Runners reluctantly agreed except for Dee, who convinced Ro to give her one Path for a quick and easy raid on Elphrona, with the goal of kidnapping the Blythe family of Alderaan and ransoming the off to their wealthy relatives."}, {"tag": "h3", "text": "Tensions flaring"}, {"tag": "p", "text": "Kassav Milliko had attempted to extort Eriadu Governor Mural Veen for credits and would exchange save Eriadu's inhabited moon from the Emergences, but failed to hold up his end of the bargain. The moon was destroyed and the ire from Eriadu and the Galactic Republic made the attention fall on the Nihil. The Runners and the Eye met at the Great Hall where Ro, in a display of dominance, brutalized Milliko and made the Runners fall in line. Dee was ordered to continue her raid and get the flight recorder of the Legacy Run."}, {"tag": "p", "text": "Lourna Dee had a brief run in with Republic forces while trying to capture the flight recorder of the Legacy Run. She managed to escape and eventually even captured Jedi Master Loden Greatstorm and Ottoh Blythe after the raid began to fail and the other Blythes were left behind. She brought them to Ro's ship, the Gaze Electric, where Ro revealed he only allowed the raid to happen because he knew he would manage to capture a Jedi as they tried to save the Blythes. Dee became terrified when Ro explained this as he practiced with his new weapon, Loden Greatstorm's lightsaber, and pointed it at her face. He also revealed that the reason Milliko and his Tempest was destroyed is because he sabotaged the entire Tempest's Path engines which caused them to collide with the Republic forces. She was subsequently intimidated into secrecy by Ro."}, {"tag": "h3", "text": "The rising storm"}, {"tag": "p", "text": "A short time later, Ro convened the remaining Nihil in the Great Hall where he showed footage of the Battle of Kur that presented Milliko and his Tempest as martyrs of the Nihil way of life who opposed the restrictions of the Republic zealously until the end. Ro convinced the gathered warriors that, with a unified front under his leadership, the Nihil could resist the Republic and the Jedi. Ro removed his mask, exposing his face to the crowd, an action that was mimicked by everyone gathered except Dee and Pan Eyta."}, {"tag": "p", "text": "The Eye quietly ordered the two Tempest Runners to also remove their masks, which they reluctantly did. Ro changed the footage of Kur into a star map as bowls filled with liquid were sent around the hall that each raider applied to their faces as a symbol of the lost Tempest's spilt blood. The Eye of the Nihil then announced that they would begin galaxy-wide operations and crush the Galactic Republic for opposing them."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lourna Dee along with her Tempest were considered to be the most sadistic and clever of the Nihil and, as a result, were feared by many of them. Dee did closely follow the rules the Nihil had such as granting permission for Pan Eyta to punish a Storm in her Tempest. Dee greatly admired intelligence and cleverness in her Tempest and believed anyone who possessed it would go far in it such as the Cloud, Belial. Lourna Dee also thought very highly herself given that she named her ship after herself and would harm anyone who asked her why. Despite her fierceness, Dee could be intimidated by those who displayed power over her."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Lourna Dee wore armored leather made from the hide of a kell dragon and a matching mask that concealed her identity and filtered the poisonous gases that the Nihil frequently made use of. She carried a single long-bladed knife that she sheathed on her thigh and a blaster that resembled the shape of a staff."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lourna Dee first appeared in the 2021 novel The High Republic: Light of the Jedi, written by Charles Soule. Prior to the book's release, Dee was revealed, albeit unidentified, on the preliminary cover for the first issue of the comic series Star Wars: The High Republic, which was illustrated by Pascalo Blanche and Gonzalo Kenny, and shown to the public during the announcement of the Star Wars: The High Republic multimedia project on February 24, 2020. In the upcoming audio drama The High Republic: Tempest Runner, Dee will be voiced by Jessica Almasy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}