{"url": "Low_Altitude_Assault_Transport/infantry", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Incomplete lists", "Category:Articles needing additional sources", "Category:Alliance to Restore the Republic vehicles", "Category:Galactic Empire vehicles", "Category:Galactic Republic vehicles", "Category:Low Altitude Assault Transport variants", "Category:Low Altitude Assault Transports"], "nodes": [{"tag": "h1", "text": "Low Altitude Assault Transport/infantry"}, {"tag": "p", "text": "The Low Altitude Assault Transport/infantry (LAAT/i), also known as the Low Altitude Assault Transport, Republic attack gunship, Republic Gunship or Assault Gunship, was one of the several models in the Low Altitude Assault Transport line of starships that mainly served as gunships and troop transports for the Grand Army of the Republic during the Clone Wars. Its role was to transport Clone troopers as well as offering air-to-ground and air-to-air support for the Galactic Republic against the Confederacy of Independent Systems. The LAAT/i gunship saw extensive use in numerous battles and campaigns of the Clone Wars. During the Imperial Era, the ships were used by both the Galactic Empire and Alliance to Restore the Republic."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Low Altitude Assault Transport/infantry gunship was a military repulsorcraft. Besides serving as an infantry transport, the LAAT/i gunship was also used to provide air-to-ground and air-to-air support for Republic forces. The front of the gunship had two double cockpit bubbles where the pilot and co-pilot/gunner sat in single file. The LAAT/i gunship had a pair of chin-mounted laser cannon turrets and a pair of dorsal rocket launchers fed by rear-mounted missile belts. Some LAAT gunships were also equipped with a pair of laser-beam turrets. When faced with overwhelming enemy fire, the gunship could close its blast shields."}, {"tag": "p", "text": "LAAT/i gunships were capable of traveling at a speed of 620 kph. They were 28.8 meters in length and 6.94 meters in height. Besides the pilot and co-pilot/gunner, an LAAT/i could carry between two to four gunners and a maximum of thirty passengers."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Clone Wars"}, {"tag": "p", "text": "LAAT/infantry gunships were first deployed during the First Battle of Geonosis in 22 BBY as part of the Grand Army of the Republic. LAAT/i gunships attacked the Petranaki Arena and rescued Senator Padmé Amidala and members of the Jedi Order from Count Dooku. LAAT/i gunships then saw action against the Separatist Droid Army alongside Low Altitude Assault Transport carriers and AT-TE walkers and proved instrumental in inflicting heavy damage on the Separatist droid forces. The Battle of Geonosis marked the beginning of the Clone Wars, the first large-scale galactic wide conflict in a millennium."}, {"tag": "p", "text": "Republic gunships saw heavy use during the conflict, deploying troops to battlefronts like Teth and Umbara. During the last days of the war in 19 BBY, LAAT/i gunships saw service on numerous worlds including Kashyyyk and Utapau. Jedi Masters Mace Windu, Kit Fisto, Agen Kolar, and Saesee Tiin traveled on an LAAT/i gunship to confront Supreme Chancellor Palpatine, who was the Sith Lord Darth Sidious. Their failed attempt to arrest Palpatine led to the initiation of Order 66 and the transformation of the Galactic Republic into the Galactic Empire."}, {"tag": "h3", "text": "Imperial Era"}, {"tag": "p", "text": "Following the formation of the Galactic Empire, the remaining Assault Transports were absorbed into the Imperial Navy. During the Galactic Civil War, some LAAT/is were used by the Alliance to Restore the Republic against Imperial garrisons."}, {"tag": "p", "text": "The Wookiees of the Kashyyyk resistance used LAAT/is leftover from the Clone Wars in defending their homeworld from Imperial subjugation; these particular gunships had their wings and missile launchers repainted yellow. By 5 ABY, a more advanced variant of the aging LAAT/i, the low-altitude Imperial transport, was in use; one of which was used by the remnant of the Galactic Empire led by Grand Moff Lozen Tolruck on Kashyyyk."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The ship first appeared in the 2002 film Star Wars: Episode II Attack of the Clones, where it was referred to as the \"Jedi attack helicopter\" in pre-production. Star Wars creator George Lucas used news footage of helicopter-based infantry deployment as an inspiration for the design. The cockpit configuration in particular was inspired by the Russian Mil Mi-24 \"Hind\" attack helicopter."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}