{"url": "Lower_City", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Cities", "Category:Taris locations"], "nodes": [{"tag": "h1", "text": "Lower City"}, {"tag": "p", "text": "The Lower City was a section of the metropolis that covered the city world Taris approximately 4,000 years before the Battle of Yavin. It was home to Taris' under-privileged classes. This was particularly true of nonhuman residents who, due to the dominant anti-alien sentiment, were confined to living there by law. The Lower City was located beneath the towering skyscrapers of the Middle City and the Upper City, but above the bowels of the Undercity. The upper-lower levels were dominated by slums with streets littered by filth and refuse."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Beginnings"}, {"tag": "p", "text": "A few centuries before Taris became a hub, the Taris Civil Authority had the Lower City constructed on top of the Undercity and eventually the Middle City was constructed above it and the Upper City above that. The Lower City was later blocked from seeing the sun and sky due to its massive skyscrapers."}, {"tag": "p", "text": "When the Rakghouls had somehow ended up in the planet's Undercity they would often use the elevators from the sewers to ascend to the Lower City and attack its residents but the locals always ended up winning the fights of the disease."}, {"tag": "h3", "text": "Segregation"}, {"tag": "p", "text": "In 4056 BBY the non-Human population of Taris was forced to live in the Lower City after the Tarisian Civil War had ended, while simultaneously, the Outcasts being banished to the Undercity due to the Tarisian Human nobles and some alien nobles emerging victorious. Taxes were then raised for the government's own use in and above the Lower City. Eventually the lower levels became beyond the law of the government but it was largely for this reason why the locals boycotted the government anyway. Many of the gangs began to oppress the common Lower City citizens."}, {"tag": "h3", "text": "Swoop Racing and Crime"}, {"tag": "p", "text": "Control over the Lower City streets was the subject of rivalry between swoop gangs. The intergalactic criminal organization known as The Exchange helped keep the Lower City in fear since 4000 BBY, except for the Black Vulkars during the swoop gang war. The most notable swoop gangs were the Hidden Beks, led by Gadon Thek, and the Black Vulkars, led by Gadon's adopted son Brejik, from 3976 BBY to 3956 BBY."}, {"tag": "h3", "text": "Mandalorian Wars"}, {"tag": "p", "text": "Later Juhani and her parents were forced to live in one of the worst slums of the Lower City after fleeing the Mandalorian attack of her own homeworld Cathar. Her species, or at least her subspecies were considered alien even among the non-humans of Taris. From Juhani's perspective it was the worst the galaxy had to offer."}, {"tag": "p", "text": "During the Mandalorian Wars, the Lower City was attacked by the Mandalorians. Many Exchange members sold their slaves to the Mandalorian Neo-Crusaders among them was the slaver Xor and the slave Juhani. The Jedi Order led by Revan liberated the slaves. The Republic led by Saul Karath succeeded in dissolving the Taris Civil Authority and driving the Exchange off the planet. The Jedi Order managed to free the slaves but the Mandalorian presence did not lift. The Taris Resistance held them off until they were defeated and retreated to the Undercity so they could escape aboard The Last Resort, which was based there. With the Exchange's withdrawal along with the Galactic Republic and the Jedi the Mandalorians governed the Lower City along with the rest of Taris. With the Mandalorians' withdrawal or possibly exiled by Revan and Malak in the aftermath of the war, the Exchange occupied the Lower City once more, with little to no difference."}, {"tag": "h3", "text": "Jedi Civil War"}, {"tag": "p", "text": "During Revan's forced stay on Taris, he and Carth found out that Bastila was being held hostage for a prize in the swoop racing competition. After gaining access to the Undercity, using the elevator to enter the Black Vulkar Base and massacring almost everyone inside, Revan and his party were able to recover a prototype accelerator, to install on a Swoop Bike. Then racing and winning for the Beks, freeing Bastila and killing Brejik, before fleeing to the Upper City Apartments and were recalled by Canderous Ordo to Javyar's Cantina. Revan could also have either lifted or collected bounties from the Hutt Zax. After the destruction of Taris by Darth Malak, the Lower City may have had a relatively large amount of survivors compared to the Upper City, most of whose inhabitants were killed. But according to the Outcasts, there weren't any."}, {"tag": "h3", "text": "Reconstruction"}, {"tag": "p", "text": "In 3 ABY the Lower City had been rebuilt by Human colonists, although without the segregation of 3956 BBY, as the Tarisian nobles and anti-alien Humans had perished in the orbital bombardment. As for 40 ABY, Boba Fett went to the Lower City seeking out stolen cloning information so that he could be cured from a serious disease."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}