{"url": "Ardon_Crell", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Males", "Category:Moisture farmers"], "nodes": [{"tag": "h1", "text": "Ardon Crell"}, {"tag": "p", "text": "Ardon \"Vapor\" Crell was a Human male moisture farmer on the planet Tatooine who had joined the local 253 sector of the Moisture Farmers of Tatooine organization by 4 ABY. A liaison between local 253 and the crime lord Jabba the Hutt, Crell was responsible for collecting the moisture farmers' money and delivering it to the Hutt for protection against Tusken Raiders. In 4 ABY, Crell was present in Jabba's Palace when several allies of Jabba's prisoner Han Solo arrived in an attempt to rescue their companion. Those events led to Jabba sentencing Solo and companions Luke Skywalker and Chewbacca to death at the Great Pit of Carkoon. Crell and other members of Jabba's court accompanied the crime lord on the luxury sail barge Khetanna in order to witness the executions. The captives fought back, however, and the Khetanna was ultimately destroyed."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The Human male Ardon Crell lived during the Galactic Civil War, a conflict between the Galactic Empire and the Alliance to Restore the Republic. By 4 ABY, he had become a moisture farmer on the planet Tatooine and joined local 253, a sector of the Moisture Farmers of Tatooine organization. He had by then also acquired the nickname \"Vapor.\" Crell was chosen by his peers to serve as a liaison between local 253 and the crime lord Jabba the Hutt. The moisture farmers agreed to pay Jabba in exchange for protection from Tusken Raiders, and Crell was responsible for both collecting and delivering the protection money."}, {"tag": "p", "text": "In 4 ABY, Crell was present in the audience chamber of Jabba's Palace on Tatooine when Alliance leader Princess Leia Organa, disguised as the bounty hunter Boushh, arrived with the intention of rescuing her ally Han Solo, who was frozen in carbonite and hanging on the wall of the palace's courtroom. Organa arrived with the Wookiee Chewbacca, ostensibly her captive, and threatened to destroy the palace with a thermal detonator. Like others in the Hutt's courtroom, Crell panicked at Organa's threat. Organa won the Hutt's favor but that night rescued Solo and attempted to escape the palace with him. Crell and others in the Hutt's palace accompanied the crime lord as he caught Organa and Solo, who were subsequently imprisoned. Their mutual ally Luke Skywalker then arrived at the palace to demand the release of all three prisoners, but the Hutt dropped Skywalker into the pit of his pet rancor. However, Skywalker killed the rancor, prompting the Hutt to sentence Skywalker, Solo, and Chewbacca to death at the Great Pit of Carkoon."}, {"tag": "p", "text": "Crell and other members of Jabba's court accompanied the Hutt on the luxury sail barge Khetanna in order to witness the execution of the captives. However, the captives fought back, leading to the death of Jabba and destruction of the Khetanna."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ardon Crell panicked when Leia Organa threatened to destroy Jabba's Palace with a thermal detonator. He had black hair, brown eyes, and fair skin."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ardon Crell wore a jumpsuit, across which he carried an ammunition bandolier. He also wore a red headband."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Ardon Crell first appeared as an uncredited extra during the Jabba's Palace scenes, as well as on the Khetanna, in the 1983 film Star Wars: Episode VI Return of the Jedi. In April 1998, Crell was first named and given a backstory on a card in Jabba's Palace Limited, an expansion set of the Star Wars Customizable Card Game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}