{"url": "Lowhhrick/Legends", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Gladiators", "Category:Guards", "Category:Kashyyyk residents", "Category:Males", "Category:Slaves", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Lowhhrick"}, {"tag": "p", "text": "Lowhhrick was a male Wookiee."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "The male Wookiee Lowhhrick was born on the forest world of Kashyyyk, the homeworld of his species. Whilst he lived on Kashyyyk he served as a warrior, but both his sister and nephew were killed by Trandoshan raiding parties, who had traveled from the nearby planet Trandosha to hunt Wookiees for sport. Swearing he would claim vengeance Lowhhrick attempted to hunt down his relatives killers, but he was instead captured and forced into slavery, fighting as a gladiator for the amusement of others. The Wookiee eventually achieved enough notoriety in battle to attract the attention of Teemo, a Hutt crime lord who worked out of the desert world Tatooine. The Hutt purchase Lowhhrick and made him regularly fight gladiators belonging to the criminal's associates as a way of asserting dominance, sometimes also using him as a bodyguard during business meetings. The Wookiee eventually became Teemo's favorite gladiator, and after any fights Lowhhrick took part in he would be regularly treated by the droid medic 41-VEX for his injuries. Lowhhrick struck up a friendship with the droid, and also befriended Oskara, a Twi'lek bounty hunter in Teemo's employ. When Oskara decided she wanted out of the Hutt crime lord's employ Lowhhrick agreed to help as long as he too was freed along with 41-VEX. The trio agreed to work together, with the droid also introducing the Teemo's pilot Pash into the scheme and Oskara bringing in a scout named Sasha and Teemo's mechanic Mathus. The group fled Teemo's palace with Teemo's Gamorrean thugs soon giving chase through the streets of Mos Shuuta. To avoid the enforcers the escapees ducked into the Mos Shuuta Grill & Cantina."}, {"tag": "p", "text": "The renegades hid themselves within the cantina and when the Gamorreans entered the group ambushed them, successfully defeating the six enforcers. After the fight ended the cantina's bartender, the Devaronian Vik, told Lowhhrick and his companions about the Krayt Fang, a YT-1300 light freighter belonging to Teemo's Trandoshan bounty hunter Trex. The freighter was parked in Landing Bay Aurek but lacked a functioning Hypermatter reactor igniter and so was unable to take off. At Vik's suggestion the group then made their way to a a junk shop in Mos Shuuta owned by the Human Vorn. They successfully acquired the necessary igniter for the junk dealer, despite the only part available already being promised to Trex. Next they gained entry to the Mos Shuuta landing control past a pair of security droids and managed to successfully deactivate the landing clutches in Landing Bay Aurek, despite the presence of a number of technicians and their overseer, Brynn. With all the preparations for leaving made, Lowhhick and his fellow escapees began to make their way to the Landing Bay, however on the way they encountered a squad of Imperial Stormtroopers. Fighting their way through the Stormtroopers, the group eventually reached the Landing Bay and after defeating Trex on board his ship they installed the igniter and fled."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lowhhrick first appeared as one of the pre-made characters in Escape from Mos Shuuta the adventure included with the beginner's game for Star Wars: Edge of the Empire a roleplaying game by Fantasy Flight Games released in 2013. He was then mentioned in the follow up adventure The Long Arm of the Hutt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}