{"url": "Lozen_Tolruck", "categories": ["Category:Canon articles", "Category:Grand Moffs of the Galactic Empire", "Category:Individuals of unspecified species", "Category:Kashyyyk residents", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lozen Tolruck"}, {"tag": "p", "text": "Lozen Tolruck was a male individual that served the Galactic Empire during the Galactic Civil War as a Grand Moff. In this position, he ruled as the governor of Kashyyyk, known as Imperial territory G5-623. He enslaved nearly the entire Wookiee population and forced them into labor camps, implanting inhibitor chips to prevent their escape. After the Battle of Endor, he locked down the planet and kept the Emperor's death a secret from his troops. He was killed during the liberation of Kashyyyk by Cracktooth, a former slave of his."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Grand Moff of Kashyyyk"}, {"tag": "p", "text": "A male individual, Lozen Tolruck served as Grand Moff of Kashyyyk, which was renamed Imperial territory G5-623, during the Galactic Civil War. Following the Battle of Endor, Tolruck claimed that Emperor Palpatine was still alive and well. He treated the indigenous Wookiees as a disposable slave labor force and kept them docile using inhibitor chips. By 5 ABY, Kashyyyk was one of the remaining Imperial holdouts in a galaxy that was increasingly controlled by the New Republic, the successor government to the Alliance to Restore the Republic. Tolruck had a difficult time accepting the authority of Grand Admiral Rae Sloane, who commanded Imperial forces in the Vulpinus Nebula."}, {"tag": "p", "text": "Following the rescue of rebel prisoners from Ashmead's Lock, Tolruck's Imperial forces on Kashyyyk came under attack from a rebel insurgency led by the smuggler Han Solo and the Wookiee co-pilot Chewbacca, who had come to liberate the Wookiee homeworld. Despite evidence to the contrary, Tolruck claimed there was no revolt on Kashyyyk and dismissed the insurgents as a \"little cancerous shadow\" clinging to the Imperial operation on G5-623. When his troops captured the New Republic soldier Jom Barell, Lozen tortured him in an attempt to extract information. When Barell proved resistant, he gouged out one of his eyes and locked him in a cage."}, {"tag": "p", "text": "Later, Tolruck remotely controlled an assassin probe with a control visor and used it to hunt down and kill a Wookiee slave named Subject 478-98 or \"Blackstripe.\" When Blackstripe proved unexpectedly difficult to kill, Tolruck threw a tantrum and smashed the visor he had used to control the assassin probe. Tolruck then met with his attache Odair Bel-Opis to discuss the threat of the rebel insurgency on Kashyyyk. Tolruck disagreed with Odair's assessment that the rebels posed a serious threat and vowed to hunt them down himself for sport. He even toyed with the idea of using the captive Barell as bait."}, {"tag": "h3", "text": "Hunting the hunter"}, {"tag": "p", "text": "Odair then informed Tolruck that they had received an emissary from Grand Admiral Sloane. As a snub to Sloane's authority, Tolruck kept the emissary waiting and instead had a conference with Commandant Theodane Sardo via hologram. Due to a drop in the demand for Wookiee slaves, Sardo proposed farming the Wookiees of Kashyyyk for their meat. When Tolruck saw an explosion in the background at Camp Sardo, Sardo claimed that they had merely lost a turret. Tolruck liked Sardo's recommendation and ordered him to explore the idea. Unknown to Tolruck and Sardo, Han and Chewie's team had landed near the former tree city of Awrathakka above Camp Sardo."}, {"tag": "p", "text": "Tolruck then went to meet with Sloane's emissary, who turned out to be a disguised Sinjir Rath Velus. The former Imperial loyalty officer had defected to the New Republic and joined Han's campaign to liberate Kashyyyk. Sinjir pretended to be lieutenant Jorrin Turnbull, an Imperial officer who had died during the Battle of Endor. Tolruck took the opportunity to chastise Sloane's Empire for abandoning the Imperial presence on Kashyyyk and not taking their Wookiee slaves offworld. Sinjir then briefed Tolruck about Han Solo's insurgency on Kashyyyk."}, {"tag": "p", "text": "Intending to free hims comrade Jom Barell, Sinjir inquired about the rebel prisoner. Tolruck then ordered Odair to bring out Jom in an iron kennel on grav-pads. Before Sinjir could leave, one of Tolruck's aides handed Odair a holoscreen, which identified the prisoner in the cage as Jom. While browsing through the holoscreen, Tolruck recognized Sinjir as a wanted enemy of the Empire. Before Sinjir could escape the chamber, Tolruck stabbed him in the calf of his leg with a kishakk blade."}, {"tag": "h3", "text": "Hubris and demise"}, {"tag": "p", "text": "Tolruck then forced a wounded Sinjir to fight Odair for his amusement. While Sinjir was a capable fighter, he was no match for Odair due to his wounded leg. After Odair bested Sinjir in the first round, Tolruck asked his prisoner whether he had come for his friend Jom. A defiant Sinjir revealed that he had come for Tolruck's control module, which he kept on his person. When Tolruck boasted that he had full control over the module and the inhibitor chips, Sinjir responded that he had hyperwave transceiver spike hidden in his heel. Sinjir then smugly informed Tolruck that his transceiver could hack into his control module."}, {"tag": "p", "text": "At that moment, the datapad in Tolruck's left hand began to flesh red. At that point, all the inhibitor chips on Kashyyyk were disabled and the Wookiees rose up in a planetwide uprising against the Empire. The freed Wookiee slaves quickly overpowered their Imperial captors. Tolruck fled but not before ordering his aide Odair to kill Sinjir. Before Odair could kill the formerly loyal officer, he was ripped apart by several enraged Wookiee slaves. Meanwhile, Han and Chewie's team destroyed the deflector shield generator at Camp Sardo."}, {"tag": "p", "text": "Having lost control of Kashyyyk, Tolruck ordered his orbiting Imperial Star Destroyers to initiate orbital bombardment of the planet. After freeing themselves, Sinjir and Jom confronted the Grand Moff at his throne. However, Tolruck smugly responded that he had orders his Star Destroyers to destroy all life on Kashyyyk's surface including himself, the Wookiees, and his rebel opponents. Sensing that Tolruck had succumbed to madness, the two abandoned the Grand Moff to his fate. While Tolruck laughed in madness, one of his former slaves Subject 6391-A (\"Cracktooth\") sneaked up behind him and broke his neck; killing him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lozen Tolruck was a ruthless and sadistic man who hunted Wookiees for amusement. Tolruck viewed the Wookiees of Kashyyyk as livestock and used inhibitor chips to keep them docile and subservient. As Grand Moff of Kashyyyk, Tolruck surrounded himself with several ruthless and sadistic killers including his Attache Odair Bel-Opis and Commandant Theodane Sardo, who shared his lust for violence and cruelty. After the Empire reduced its operations on Kashyyyk following the Battle of Endor, Tolruck came to regard himself as the de-facto ruler and god of Kashyyyk. Tolruck also idealized himself as a hunter and enjoyed inflicting harm on other beings."}, {"tag": "p", "text": "Tolruck wore a long, unkempt beard that covered his cheeks and jowls. He also wore a robe made from the pelt of an Arrawtha-dyr. Tolruck had poor standards of hygiene and did not bathe for weeks. He liked the stench of his own unwashed body and had dirty nails. Tolruck enjoyed eating wrosha-grubs whole and uncooked. Despite his overweight physique, Tolruck was fast enough to stab Sinjir on one occasion with a kishakk blade. He also had a taste for the flesh of Talz, a sentient species, and liked Commandant Sardo's idea of farming Wookiees for food."}, {"tag": "p", "text": "Tolruck was also willing to use torture to obtain results and once gouged out an eye from the New Republic operative Jom Barell and flung it into a campsite fire. Later, he forced another prisoner Sinjir to fight his attache Odair for amusement. However, Tolruck's complacency led him to underestimate Sinjir's plan to free the Wookiees by using a hyperwave transceiver to neutralize the control module controlling the inhibitor chips that kept the Wookiees docile. Tolruck was also partly insane and even ordered the orbital bombardment of Kashyyyk in an effort to deny the planet to the Empire's enemies. He was willing to order even in his own death and laughed maniacally."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lozen Tolruck first appeared as a secondary point-of-view villain in Chuck Wendig's 2016 novel Aftermath: Life Debt."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}