{"url": "Lu%27daal-ud", "categories": ["Category:Legends articles", "Category:Findsmen", "Category:Gand", "Category:Granse Confederacy members", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lu'daal-ud"}, {"tag": "p", "text": "Lu'daal-ud was a Gand findsman from the planet of Gand and the second cousin of fellow findsman Zuckuss. Like his second cousin, Lu'daal-ud was a member of the breather subspecies and heir of a centuries-old tradition of Gand findsmen and followed visions and hunches which were sent to them by the calling of the mists. These visions eventually took him away from his home planet and into the greater galaxy."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Little was known of Lu'daal-ud's past after leaving his home planet other than that he worked for a loan shark named Ne'lear some years before the Battle of Yavin, though it is assumed that he worked for several other groups before being blacklisted by them. After leaving the services of Ne'lear, Lu'daal-ud became a member of the Granse Confederacy and, since then, showed no signs of wanting to go back to the criminal underworld. It was perhaps during this time that he acquired the Mist Laden, a modified Sigma-class shuttle which he took from its owner after capturing them for running afoul of Imperial authorities in the Imberlin system. Since then, the craft was modified by Lu'daal-ud's associates and proved to be a reliable starship for both he and his associates within the Granse Confederacy."}, {"tag": "p", "text": "While working for the Confederacy, Lu'daal-ud claimed a bounty on Patel Odfath, a member of the Alliance to Restore the Republic who had with him several key datafiles. Because of this, Commander Zgorth'sth—himself a Rebel agent—issued an order for the capture of Lu'daal-ud as the files which they assumed he kept contained information pertaining to the lives of nearly a thousand Rebel operatives in the Shiwal and Cademimu sectors, including at least the Walin'or cell and the Tierfon Rebel Outpost."}, {"tag": "p", "text": "It was believed by the Alliance that Lu'daal-ud would not simply hand over the files to the Empire, but if he was able to decode them and discovered their true nature, that he would attempt to sell them. Being a member of the Granse Confederacy meant that he would be difficult to apprehend, but even so, Commander Zgorth'sth still considered forming a team of independent agents to retrieve the files."}, {"tag": "p", "text": "Because of his imminent threat to the Alliance, Lu'daal-ud was given a place in the Alliance's SecuriDex along with the rest of the members of the Granse Confederacy, and there was even a note left in the addendum stating that, if any agents or operatives thought they were up to the task of capturing him, they were to contact their task force on Alliance Security for their proposal to be discussed."}, {"tag": "p", "text": "At some point in time, a group of individuals were tasked to capture Lu'daal-ud's starship, the Mist Laden, by a former member of the Granse Confederacy. Though a dangerous job, which meant stealing the ship from under the hunters' noses, it paid a hefty sum of 15,000 credits. In another instance, a group of individuals took up Zgorth'sth's task and attempted to apprehend Lu'daal-ud as well as the files in his possession; it is unknown how either group of individuals fared."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}