{"url": "Luca/Legends", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Luca"}, {"tag": "p", "text": "Luca was a Human male who operated as a smuggler associated with the Rebel Alliance during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Luca, a Human male, was born during the time period of the ascension of the Galactic Empire. As a chlid, Luca had a toy soldier he used to play with, imagining he was a powerful warrior the boy could idolize. However, later a new toy came along and Luca cast the toy soldier aside, almost forgetting about him over the years. Decades later, Luca had become a spacer and captained his own ship, a YT-2000 light freighter named the Faithless. He flew supply missions for the Rebel starfighter squadron Wolf Squadron, which ambushed Imperials near Annamar. When the Rebels had stolen an important piece of the new Death Star, Darth Vader was sent to retrieve it. When the Dark Lord arrived at Annamar, Luca's ship was intercepted by the Executor."}, {"tag": "p", "text": "Luca found himself engulfed in a situation similar to his early childhood day dreams, as he was caught and then led by a warrior on a secret route to a Rebel base on the planetoid Annamar. Darth Vader, with all his power, but bound to the will of the Emperor, reminded Luca of him and his toy soldier. Luca alternated between helping and hindering the Sith Lord in his mission, both causing the deaths of all his wingmen, as well as helping Vader fight off a decades-old battle droid and leading him to the well-defended base, which the Sith decimated. At the moment of victory, Vader contemplated killing Luca, as he had outlived his usefulness, but spared the smuggler's life, leaving him on the planetoid as he piloted the stolen cargo ship off-world."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Luca was created by Tom Taylor for the story The Will of Darth Vader, which was the fourth volume of the Star Wars Adventures series of trade paperbacks. In the story, Luca was drawn by Brian Koschak."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}