{"url": "Lucasfilm_Story_Group", "categories": ["Category:Real-world articles", "Category:Incomplete lists", "Category:Lucas companies"], "nodes": [{"tag": "h1", "text": "Lucasfilm Story Group"}, {"tag": "p", "text": "The Lucasfilm Story Group is a division of Lucasfilm Ltd. founded in 2013 that is responsible for keeping track of Star Wars canon in order to assist writers and directors in the development of new stories. As of May 2017, the group comprises eleven individuals. Pablo Hidalgo, an author and creative executive at Lucasfilm, has been part of the Story Group since its creation, offering expertise on not only details about Star Wars, but also what Lucasfilm has done in the past as well as George Lucas' values."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lucasfilm Story Group began as an initiative from Kathleen Kennedy in 2012. Lucasfilm Vice President Kiri Hart helped form the group as its Development Lead, with the stated goal of abolishing the canon hierarchy system in favor of a single cohesive continuity. Lucasfilm Story Group—including Rayne Roberts, Carrie Beck, Diana Williams, Leland Chee, Pablo Hidalgo, and Matt Martin—participated in the making of Star Wars: The Old Republic: Galactic Starfighter, a digital expansion to the video game Star Wars: The Old Republic, being mentioned in the ending credits."}, {"tag": "p", "text": "On April 25, 2014, the Lucasfilm Story Group rebooted the Star Wars universe by retiring much of the Expanded Universe storyline and rebranding it as \"Star Wars Legends.\" Besides Lucas' six films, the only previously produced material still considered canon are the Star Wars: The Clone Wars television series and film, and the standalone comic arc Star Wars: Darth Maul—Son of Dathomir, which was based on unproduced scripts from The Clone Wars TV series. All subsequent material produced in collaboration with the Story Group including the Disney XD television series Star Wars Rebels and all novels beginning with A New Dawn are considered part of the new canonical continuity."}, {"tag": "p", "text": "Story Group members Carrie Beck and Leland Chee were involved in the production of the 2016 non-canon Disney XD animated series LEGO Star Wars: The Freemaker Adventures to ensure that the show did not contradict the new canon continuity."}, {"tag": "p", "text": "Author Jason Fry stated that one of the biggest misconceptions regarding the Story Group is that it is omniscient and should somehow be perfect. \"Of course there are going to be inconsistencies and slips here and there.\""}, {"tag": "p", "text": "According to author Delilah S. Dawson, the story group tends to encourage content creators to create new elements instead of using pre-existing ones."}, {"tag": "h2", "text": "Members"}, {"tag": "h2", "text": "Former members"}, {"tag": "h2", "text": "Bibliography"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}