{"url": "Lucent", "categories": ["Category:Legends articles", "Category:Articles from unlicensed sources", "Category:Cleanup", "Category:Pages needing citation", "Category:Arachnoid sentient species", "Category:Force-sensitive species", "Category:Lucents"], "nodes": [{"tag": "h1", "text": "Lucent"}, {"tag": "p", "text": "The crystal spiders known as the Lucents (a name Daran Tal gave them, as their own language was unpronounceable to humanoids) were sentient arachnids from an unknown world that was thought to be in the Voidfire Nebula. They were insatiably curious about all other races and their technologies. They were scientists by nature, and built the Crystal Web Station as a way to meet and interact with other members of the galactic community and, with Baron Administrator Tal's help, they have done so. Though nearly nothing was known about the Lucents or how much they knew about other races before Crystal Web was established (after all, they built the station before Tal even showed up), they have proven themselves to be trustworthy and honorable beings who honestly seem to have wanted nothing more than to learn about the other inhabitants of the galaxy. It was speculated that the Lucents in fact have a vast and highly advanced civilization beyond the nebula, but Lucents have neither confirmed nor denied these speculations."}, {"tag": "p", "text": "The spider-like Lucents had a different perception of the Force from most other sentient beings. As befitted their physicality, they called the Force \"the Life-Web\" or \"the Weave\" and are all familiar, though not many overly practiced, in its use. All Lucents could \"see\" the Weave as a web of shining crystal strands. It was rare for a member of the Lucents to actually develop Force powers, though it was not unheard of. Those members of their species that do practice its use somehow cannot use it to influence people or to read minds, and they rarely used it to affect others in any way at all. They were, however, quite adept at the manipulation of the Weave for physical effects, in particular telekinesis and other similar skills."}, {"tag": "p", "text": "All Lucents had a unique ability based on their special connection with the Force and their instinctive grasp of spatial relationships; without use of navigation computers or astromech droids, Lucents could calculate the fastest, safest, and (usually) the most convenient route through hyperspace between two points. This natural ability was much the same as the Jedi ability instinctive astrogation."}, {"tag": "p", "text": "Their technology was also rather different from that of the galaxy at large; while they did have hyperdrives, sublight drives, repulsors, and blasters, their technology employed crystalline webs and energy-charged gems rather than conventional means. Because of this, their ships were able to travel the Voidfire Nebula without suffering any of its ill effects. They were reluctant to share their technology with the galaxy at large, at first because they wanted to learn more about their neighbors, then later because they refused to add fuel to the raging fire that was the Galactic Civil War."}, {"tag": "p", "text": "However, in 4 ABY, Daran Tal managed to convince them to offer up a small piece of their technology so as to make a small mark on the galaxy. They agreed to this on the condition that they would have control of the deal. They informed Tal that they would like to offer the technology to all members of the galaxy rather than any one group. Tal proceeded to gather together a group of New Republic agents, an Imperial Admiral and his aides, and Orta the Hutt to represent the fringe groups. Though each group was reluctant to let any other get a hold of the technology, the Lucents had already decided that either all groups received it or none of them did. Despite some initial difficulties, the meeting went off quite smoothly and all groups walked away happy."}, {"tag": "h2", "text": "Sources"}]}