{"url": "Ardus_Kaine", "categories": ["Category:Legends articles", "Category:Grand Moffs of the Galactic Empire", "Category:Humans", "Category:Imperial warlords", "Category:Males", "Category:Pentastar Alignment personnel"], "nodes": [{"tag": "h1", "text": "Ardus Kaine"}, {"tag": "p", "text": "Ardus Kaine was an Imperial Moff and the successor of Wilhuff Tarkin as Grand Moff of Oversector Outer following Tarkin's death after the Battle of Yavin. His flagship was the Reaper. Following the Battle of Endor, Kaine formed the Pentastar Alignment."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Rise to prominence"}, {"tag": "p", "text": "Ardus Kaine was a Human male native to the Outer Rim world of Sartinaynian in the Braxant sector. The son of successful trader and speciesist Vilardo Kaine, Kaine had all of his father's misplaced ambitions foisted upon him, despite the fact that he was not particularly hateful of non-humans and was given more to co-operation than giving orders. However, his father saw his ascending the highest echelons of political society. Despite not particularly agreeing with his father, he worked hard to please him, eventually becoming involved in politics."}, {"tag": "p", "text": "A strong character and noted public speaker, Kaine was involved in the politics and administration of the Galactic Republic, becoming one of the earliest, most ardent supporters of Naboo Senator Palpatine, embracing his philosophy wholeheartedly after his father was killed in a pirate attack. Kaine remained at the Senator's side as Palpatine was elected Supreme Chancellor; when Palpatine reorganized the Republic into the first Galactic Empire, Kaine adopted the principles of the New Order with fanaticism. His leadership and organizational skills came to the fore in the Imperial Period, during which Kaine played a key role in administrative reform. Immediately after the Declaration of the New Order, he was instrumental in ensuring the Grand Army of the Republic's support for the new regime. Kaine worked alongside the likes of Crueya Vandron, Ishin-Il-Raz and Janus Greejatus in the formation of the Commission for the Preservation of the New Order, after concerns about the administration of Imperial Intelligence, viewing it as something his father would have been proud of. Kaine quickly became disillusioned with the COMPNOR project, however, viewing the organization's constant feuding with Imperial Intelligence as a waste of valuable Imperial time and effort. It was around this time he began a lifelong feud with Ennix Devian: he viewed Devian as a cruel, brutal thug. Devian, in turn saw Kaine as pompous and uncommitted to Human High Culture - something, ironically, that was correct."}, {"tag": "p", "text": "For his loyal and productive Imperial servitude, Kaine was appointed governor of several worlds, and later a moff. Extremely wealthy, Kaine at some point became a corporate backer of the Imperial Inquisitor Jerec. After Wilhuff Tarkin's death at the Battle of Yavin, he became Grand Moff of Oversector Outer. While this offered him a prestigious title and control over a huge region of the Outer Rim Territories, Kaine saw his promotion as a personal rebuke: he wanted to be near Palpatine on Imperial Center, assisting in important Imperial policies, not tucked away in the farthest fringes of the Empire trying to repair the damage left by Tarkin's death - even his enemy Devian had managed to be closer to the halls of power. With Kaine's new title came command of the Outer Rim Imperial Fleet and the elite Scourge Squadron, a considerable force of Star Destroyers tasked with rooting out and quelling Rebel Alliance activity in the Outer Rim. Kaine's flagship Reaper was one of the few Imperial Executor-class Star Dreadnoughts in commission. Around the time of the Battle of Endor, one of the two worldcraft in orbit around Coruscant was due to be given to Kaine for his service to the Empire: it was later stolen by Ennix Devian."}, {"tag": "h3", "text": "The stars align"}, {"tag": "p", "text": "In 4 ABY, Palpatine was killed during a Rebel attack on the second Death Star at Endor, and the Empire was thrown into a state of disarray. News of the Emperor's demise was slow to reach Oversector Outer, but Kaine was eventually informed aboard the Reaper. In previous times, the loss of his hero would have been met with great sorrow by Kaine, but, still bitter about being stationed in the Outer Rim, he merely saw it as an opportunity. Kaine still believed in the ideals of the New Order, but now the opportunity to found a new Empire state, with Kaine at its head, had been presented to him. While other Imperials in the Outer Rim initiated chaotic internecine conflicts, Kaine moved quickly to consolidate his power and form a new Imperial faction. Knowing that many corporations would struggle to keep afloat without Imperial backing, Kaine called together a gathering of corporation heads from the Velcar Free Commerce Zone and Imperial governors aboard the Reaper."}, {"tag": "p", "text": "The \"conciliatory meeting\" was attended by Imperial Governor Ib Dekeet; Commerce Master Commissioner Gregor Raquoran; Dynamic Automata Corporate Head Elta Besk; Galentro Heavy Works Representative Wyrn Otro; and Kaine himself. Kaine proposed a treaty which would unite the Imperials and corporate interests to create an isolationist political conglomerate that would practice the ideals of the New Order and allow the allied businesses to continue to trade as under the Empire, without interference from the newly-formed New Republic. Kaine was well aware that, should the Velcar Free Commerce Zone fall under New Republic jurisdiction, local syndicates use of slavery and corruption would be quickly stopped, and he used this fact as leverage during the talks, emphasizing the fact several times. The talks were fraught with paranoia and confrontation, and Kaine had to work hard to keep the participants off each other's throats. As it was, none of Kaine's colleagues particularly cared for his political theory, and Otro openly questioning Kaine's ambitions. The Grand Moff refuted claims that he would install himself as Emperor, emphasizing the need for unity and co-operation to ensure the project was a success. Ultimately, the Pentastar Alignment Treaty was signed by all parties, creating the Pentastar Alignment. Kaine dubbed it thus because there were five plenipotentiaries present on his flagship; despite mild objections from Governor Dekeet, all Pentastar vessels and soldiers were adorned with a badge, which Kaine hoped would be a symbol of both unity and fear."}, {"tag": "p", "text": "With newfound corporate backing and significant forces of capital ships and soldiers at his disposal, Kaine established the Alignment in a huge number of systems, engulfing areas with force and installing planetary overseers to carry out the will of Kaine and his allies. Many Imperial forces in Oversector Outer voluntarily joined the cause, due to Kaine's strong leadership and fervent Imperialism. The Grand Moff kept his burgeoning quasi-Empire mostly independent from the wider galaxy, refraining from any conflict with the New Republic or rival warlords. As a result, Kaine's business allies were allowed to continue operating free from interference, despite the New Republic's moral opposition to their Humanocentric, oppressive modi operandorum. Ironically, at the same time Kaine was quite happy to use large numbers of non-humans in his Pentastar Patrol - as his Human High ways were largely a sham, he was pragmatic enough to use them to shore up his military. Ultimately, aside from dissident pirate groups, the Alignment was most at risk from internal threats. Differences between various Pentastar departments and leaders threatened to destabilize the alliance; though rarely confronted, Kaine was unpopular among many of his colleagues, such as Raquoran."}, {"tag": "h3", "text": "Quietus"}, {"tag": "p", "text": "The remnants of the Empire continued to operate on Imperial Center, initially under former Grand Vizier Sate Pestage, until he was ousted by Director of Imperial Intelligence Ysanne Isard, but Kaine paid no heed. During this period, the Pentastar Alignment helped fund Jerec's search for and expedition to the Valley of the Jedi; it was ultimately an unsuccessful undertaking, and the former Inquisitor perished in 5 ABY. Kaine's new fiefdom also became the temporary residence of Grand Admiral Octavian Grant, who wished to lay low and avoid the attentions of the New Republic and old Imperial enemies, until he defected to the New Republic in 6 ABY. The Alignment began to come under increased pressure from discordant pirate groups during this period. One such group, the Red Moons, proved a particular thorn in Kaine and the Alignment's side. Led by Andrephan Stormcaller, a former Rebel Alliance and New Republic officer who had resigned his commission after the New Republic refused to intercede against Kaine, the Red Moons made incessant raids of Pentastar worlds and assassinated numerous Alignment officials. Kaine's administration claimed the Red Moons were operating with tacit New Republic support, though this was refuted."}, {"tag": "p", "text": "In 9 ABY, Grand Admiral Thrawn returned from a sojourn in the Unknown Regions in a last-ditch attempt to reunite and consolidate the faltering Empire. The Alignment contributed some forces to Thrawn's efforts but did not formally join him, preferring to continue its militarization in anticipation of conflict with the New Republic. One year later, the resurrected Emperor Palpatine began to surreptitiously reunite various Imperial splinter factions, as part of Operation Shadow Hand, an effort to topple the New Republic. The reborn Emperor was more successful than Thrawn in recruiting Kaine's ilk, with the likes of warlords Treuten Teradoc and Blitzer Harrsk joining the movement; ultimately, however, it was a failure, with Palpatine defeated for the last time on Onderon. Kaine was killed during the campaign over the planet Palanhi, when his shuttle was ambushed and destroyed by several New Republic E-wing fighters. At least one account suggests that his old nemesis Ennix Devian was involved."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The Pentastar Alignment was annexed by Gilad Pellaeon in 12 ABY, becoming part of the Imperial Remnant. Reaper became Pellaeon's flagship until its destruction at the Battle of Celanon in 13 ABY. Before 19 ABY, Kaine's homeworld Sartinaynian—renamed Bastion—became the Imperial Remnant's capital, remaining thus for over a century."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ardus Kaine was noted for his ambition and hunger for power. He cared more for actual power than titles or prestige; the office of Grand Moff did not appeal to him, nor did the title of Emperor of the Pentastar Alignment. He wanted to be at the core of the Empire, making important decisions, being involved in the day-to-day running of the Imperial machine. He was also opportunistic, taking chances as soon as they were presented to him. He moved to establish his Imperial faction post with haste after learning of the Imperial defeat at Endor, and after its founding, organized the power structure so that Kaine was a de facto autocrat."}, {"tag": "p", "text": "As one of Palpatine's earliest converts to the ideals of the New Order, Kaine was fervently loyal to the Empire and everything it stood for. He truly believed in the tenets of the New Order, and believed that enforcing them on subjugated worlds was justified. The core Imperial precepts and mandates were, Kaine felt, somewhat neglected and under enforced, and in his own Empire, they were zealously adhered to and held a more significant position."}, {"tag": "p", "text": "What few realized was that much of this was a carefully presented and maintained front - Kaine was largely indifferent to the Human High Culture that many of his contemporaries believed in and did not seek power for the sake of it. Kaine was motivated by the memory of his father, who had foisted upon him all of these ideals, and sought to impress him, even though the elder Kaine was now dead. He wanted to rule not because he genuinely wanted it, but because his father had drilled it into him from his earliest days. However, it also fostered an intense inferiority complex in Kaine: with his father dead, Kaine felt genuine fear at the prospect of power - when he established the Alignment, one of his chief, yet secret reasons for its isolation from the ongoing Galactic Civil War was that Kaine preferred to rule successfully over a smaller kingdom like the Alignment than lose it all in a fool's gamble for the position of the new Galactic Emperor. The irony of this was that some, like Grand Admiral Octavian Grant, genuinely viewed Kaine as having the leadership ability to successfully rule."}, {"tag": "p", "text": "The Grand Moff's rhetorical acumen was well known as used by the Empire. His subtle, persuasive oration was convincing; flitting between aggression, tacit intimidation, and syllogism, he was rarely dissuaded. These skills came to use after the Declaration of the New Order, when Kaine helped garner military support for Palpatine's fledgling regime. Later, during the Pentastar Talks, Kaine used this acuity in his role as arbiter to hold together the collapsing negotiations, and subtly influence proceedings in his favor. He was not a man partial to failure, and his determination ensured he often succeeded against odds others would have given up against, as in the case of the talks aboard Reaper. During the tenure of the Pentastar Alignment, Kaine's ability to exhort his colleagues ensured he was rarely opposed on any decision."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}