{"url": "Lucky_(comic)", "categories": ["Category:Real-world articles", "Category:Star Wars Tales 23"], "nodes": [{"tag": "h1", "text": "Lucky (comic)"}, {"tag": "p", "text": "\"Lucky\" is a story from Star Wars Tales 23 (later collected in Star Wars Tales Volume 6 and Star Wars Legends Epic Collection: The New Republic Vol. 2) that reveals more of the past of Wedge Antilles. The main part of the story is set in 2 BBY while the framing story is several weeks after the Battle of Endor."}, {"tag": "h2", "text": "Plot summary"}, {"tag": "p", "text": "The story centers on Wedge, showing how \"lucky\" he is, while he never gets what he really wants. The bulk of the story is a flashback, showing how Wedge first came to join the Rebellion."}, {"tag": "p", "text": "On Gus Talon, Wedge has fallen in love with a girl named Mala. But Mala's father, Rallo, is part of the Rebellion and, while Antilles is away, the Imperials wipe out Gus Talon."}, {"tag": "p", "text": "In the present, Wedge states that the he doesn't feel as lucky as others say he is, citing the incident at Gus Talon and his inability to stop it as an example."}, {"tag": "h2", "text": "Continuity"}, {"tag": "p", "text": "It was referenced in the tenth issue of the Star Wars comic series (Star Wars Volume 2: From the Ruins of Alderaan) by Wedge Antilles himself."}, {"tag": "p", "text": "The title page for Star Wars Tales 23 states that the events of \"Lucky\" take place \"approximately seven years before Star Wars: Episode IV A New Hope,\" which would correspond to the year 7 BBY. This runs contrary to the story itself, which states that its flashback events on Gus Talon take place six years before the Battle of Endor, which would correspond to the year 2 BBY. Given that the Rebel Alliance is in existence during the flashback events of \"Lucky,\" the 7 BBY date would also contradict the timeline for the Rebel Alliance's establishment in 2 BBY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "p", "text": ""}, {"tag": "h2", "text": "Collections"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}