{"url": "Lucksprite", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Lucksprites", "Category:Sentient species of Endor"], "nodes": [{"tag": "h1", "text": "Lucksprite"}, {"tag": "p", "text": "Lucksprites were sentient beings found on the Forest Moon of Endor. According to Ewok belief, the creatures were responsible for the good or ill fortune of every being on the moon. In practice, a lucksprite could indeed affect someone's luck via blasts of iridescent energy projected from a prehensile tentacle growing from the top of its head. Lucksprites were otherwise humanoid in shape, although their legs were much shorter than their arms, and their heads were large in proportion to the rest of their body. Other key physical features included large, pointed ears and drooping eyelids. The creatures were divided into two camps, those who caused good luck, and those who brought on bad luck. Lucksprites could take great pleasure in using their chance-changing abilities."}, {"tag": "p", "text": "One lucksprite made a nuisance of itself in Bright Tree Village around 3 ABY. Because the Ewok Wicket Wystri Warrick was having difficulty preparing for his warrior's test, an ordeal designed to test his aptitude to enter that profession, Warrick's friend Teebo secured the services of a lucksprite. Little did he know that it was a bad lucksprite; the creature foiled Warrick's chances and sent the Ewok into melancholy. Nevertheless, Warrick's friends forced the lucksprite to admit its meddling to their saddened comrade. An arachnid creature attacked during the confession, and the lucksprite did its best to prevent Warrick from overcoming the new obstacle. Nevertheless, the Ewok prevailed, causing the lucksprite to enter a depression of its own."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Lucksprites were sentient humanoid beings, with two arms, two legs, and a head. The arms were long and wiry, considerably lengthier than the short, thin legs that stood the beings roughly 0.66 meters from the ground. Two four-fingered hands were attached to each arm, and two long, narrow feet to each leg. These limbs surrounded the torso and abdomen, which converged in a single squat, round mass."}, {"tag": "p", "text": "Atop the lucksprite's long, thin neck sat an oversized head, wider than it was tall and with no appreciable chin. A broad, thick-lipped mouth stretched from one side of the face to the other, revealing a red interior and pink tongue when opened. Above the mouth sat a wide, oblong nose with perpetually flared nostrils. This rested below two wide-set, yellow eyes, which peered from beneath droopy lids. Both sides of the face were flanked by two huge, triangular ears with pink interiors. In at least one case, the back of these sensory organs and the rest of the lucksprite's skin was green."}, {"tag": "p", "text": "Growing from the top of the head, each lucksprite had a fat, tentacular appendage whose prehensility allowed the lucksprite to move it at will. This organ shot bolts of good or bad luck—depending on its owner's proclivities—that affected their target's performance of various tasks. These salvos of serendipity appeared as clouds of golden sparkles. Each discharge of this energy was accompanied by a zap sound."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Lucksprites were divided into two groups: good lucksprites and bad lucksprites. Each type had the ability to bestow both flavors of luck on other beings, but the lucksprites strongly preferred one or the other depending on their individual temperaments. This could prove either a help or hindrance to the target depending on whether the lucksprite conveyed helpful or harmful fortune. In some instances, a lucksprite might agree to work for someone, bestowing luck as the patron requested. Lucksprites could take great pride in such work, cuddling up to their employers and laughing as they fulfilled their duties. Should a lucksprite's target manage to overcome the weal or woe bestowed upon them—succeeding in a task that a bad lucksprite attempted to curse, for example—the lucksprite could grow despondent at the perceived failure. Lucksprites also had the ability to teleport, a tactic they occasionally employed to avoid angry victims of their luck-inducing abilities."}, {"tag": "p", "text": "Lucksprites were capable of learning and speaking Ewokese. Their large mouths expressed a wide variety of emotions, including smiling or frowning. In the folklore of the Ewoks of the Forest Moon of Endor, lucksprites were viewed as powerful beings who presided over the good or ill fortune of all creatures on the moon."}, {"tag": "p", "text": "At least one lucksprite wore a tunic over tights. This being tied this ensemble with a rope belt. The lucksprite hid its head tentacle under a pointed cap and could wrap itself in a cloth to appear as a sack, leaving only the eyes to peer out and betray its true nature."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "By 3 ABY, lucksprites had entered Ewok legend. Sometime around that year, the young Ewoks of Bright Tree Village were taking skills tests to determine their aptitude for their chosen professions. To help his friend, Wicket Wystri Warrick, who was practicing for the test to become a warrior, the Ewok Teebo secured the services of a lucksprite for the would-be warrior's test day. During a practice session, the lucksprite blessed Warrick with good fortune: not only did the Ewok fire three arrows directly into a target, he also split the target—and the tree on which it hung—in two."}, {"tag": "p", "text": "The day of Warrick's skills test, however, the lucksprite showed its true colors. When the Ewok used a pole to vault up to a tree, the pole snapped, sending him tumbling. When Warrick swung on a vine to grab a doll from a tree, the lucksprite zapped a spiny creature nearby so that the Ewok would grab it instead; the pain caused Warrick to fall from the trees, dislodge a fallen log, and topple the judges' platform where his elders were observing his performance. The blunder cost Warrick his chance to be a warrior; in fact, his village chief, Chirpa, assigned him to be an apprentice bordok stable sweeper instead. The lucksprite then admitted to Warrick's friends—Teebo, Kneesaa a Jari Kintaka, and Latara—that it was, in fact, a bad lucksprite. The creature then disappeared on the back of a bordok-driven cart, a vehicle that it caused to nearly run the Ewoks over as it passed."}, {"tag": "p", "text": "Teebo tracked the lucksprite down and brought it to confront Warrick at the Cavern of Broken Dreams, where the despondent Ewok had gone to sulk. When an arachnid creature emerged from the cave and pursued Kneesaa, the lucksprite got up to its antics again: it shot Kneesaa with ill fortune to make her drop her lasso, with which she hoped to capture the creature. Teebo and Latara attacked the mischievous creature, but the lucksprite simply teleported out of harm's way. Kneesaa, meanwhile, fell into the arachnid's web, which stretched across a deep chasm."}, {"tag": "p", "text": "With Kneesaa in danger, Warrick snapped out of his stupor. He snatched Kneesaa from the web and put her on his shoulders. As he crossed a tightrope back to the ledge, the lucksprite shot the rope and snapped it, forcing Warrick to grab the rope and swing across. Teebo sneaked up behind the lucksprite and covered it with its own hat, preventing it from using its luck-bestowing tentacle and from seeing the goings-on. Without the meddlesome lucksprite's interference, Warrick swung to safety, destroyed the web with a large stone, and caused the arachnid to plummet into the canyon."}, {"tag": "p", "text": "Afterward, the bad lucksprite was depressed to have been foiled. It claimed that no Ewok warrior had ever managed to break its bad luck, but somehow Wicket W. Warrick had. Warrick, cheered to hear that he had succeeded where others had failed, offered the lucksprite a job as an apprentice stable sweeper."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Michael Dubil wrote the first and only Star Wars story to feature a lucksprite to date, the Ewoks episode \"Just My Luck.\" The cartoon first aired on November 22, 1986, during the second season of Ewoks. Although the lucksprite has several lines in the episode, the voice actor who played him was uncredited."}, {"tag": "p", "text": "Dubil's story reveals little about the background of the lucksprite it features. However, The Complete Star Wars Encyclopedia includes an entry for the creatures, explaining that they not only have the power to alter other beings' luck, but that the Ewoks believe them to be responsible for the chance of every being on Endor. Later sources imply that lucksprites and several other species arrived on Endor from offworld. One such work, the roleplaying supplement Geonosis and the Outer Rim Worlds, lists only Ewoks and Yuzzums as native to Endor, while the article Castaways of Endor also includes Duloks as indigenous. According to these sources and the roleplaying article Endor and the Moddell Sector, most sentient species on Endor had survived crash landings induced by the nearby gas giant's massive gravity shadow and shield of space debris."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}