{"url": "Lucky_Lekku/Legends", "categories": ["Category:Legends articles", "Category:Low Altitude Assault Transports"], "nodes": [{"tag": "h1", "text": "Lucky Lekku"}, {"tag": "p", "text": "The Lucky Lekku was a LAAT gunship used during the Clone Wars, notably during the Battle of Teth."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The gunship had nose art of a blue-skinned Twi'lek female in clone trooper armor on both its sides. It had the standard armament of a LAAT/i gunship, but it lacked the two composite-beam laser turrets that were otherwise located behind the cockpit."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Battle of Teth"}, {"tag": "p", "text": "This ship was first seen during the Battle of Teth where it launched an attack on a B'omarr Monastery, which was used by the Separatists as a hiding place for the kidnapped Rotta, the son of Jabba the Hutt. The gunship took heavy fire from several of the DSD1 dwarf spider droids stationed at the monastery, but it came out of the battle all in one piece."}, {"tag": "h3", "text": "Battle of Rishi moon"}, {"tag": "p", "text": "On the Rishi moon the ship was used to search for any surviving clones after the destruction of Rishi Station."}, {"tag": "h3", "text": "Battle of Ryloth"}, {"tag": "p", "text": "During the Battle of Ryloth the gunship was briefly seen in the hangar of the Resolute, the flagship of General Skywalker."}, {"tag": "h3", "text": "Second Battle of Geonosis"}, {"tag": "p", "text": "On Geonosis the ship was used as a troop transport to quickly deploy clone troopers to the surface of Geonosis. The gunship was one of the lucky ones, as many of the other gunships were shot down by the Geonosian proton cannons, LR1K sonic cannons and starfighters."}, {"tag": "h3", "text": "Defense of Cato Neimoidia"}, {"tag": "p", "text": "During the Defense of Cato Neimoidia, the gunship was deployed to the planet to deliver Captain Rex to the battlefield. By this time it had amassed at least 88 kills."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lucky Lekku (in LEGO version) is the design set for all gunships in LEGO Star Wars III: The Clone Wars apart from multiplayer when playing Jedi Crash as it is symbolised with the Crumb Bomber."}, {"tag": "p", "text": "The nose art appears to be inspired by A B-24 Liberator Bomber \"Night Mission\" from the 30th Bomb Group, 819th Bomb Squadron of the USAAF 7th Air Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}