{"url": "Lucrehulk-class_modular_control_core", "categories": ["Category:Legends articles", "Category:Baktoid Combat Automata products", "Category:Confederacy of Independent Systems starship classes", "Category:Hoersch-Kessel Drive, Inc. products", "Category:Trade Federation starship classes"], "nodes": [{"tag": "h1", "text": "Lucrehulk-class modular control core"}, {"tag": "p", "text": "The Lucrehulk-class modular control core, also referred to as the LH-1740, was a structure which formed part of many Trade Federation vessels, including the Lucrehulk-class LH-3210 cargo freighters and Lucrehulk-class battleships."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Their design was made to be highly modular, being attached to several different ship types and used for a variety of command purposes."}, {"tag": "p", "text": "The LH-1740 was fitted with a command tower at the top of the sphere, which contained scanner arrays, command bridges and VIP vaults. In times of conflict, more and more of the spheres were fitted with an additional military control tower, which contained a transition mast for military control signals and feedback."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Control cores were made long before the Clone Wars, with the design changing little through the century before this conflict."}, {"tag": "p", "text": "After the Invasion of Naboo, the Galactic Republic ordered the Trade Federation to disband its military forces. The crafty Trade Federation pretended to comply with this command by apparently disassembling most of its battleships, only to transform their LH-1740 centrispheres into Lucrehulk-class core ships."}, {"tag": "p", "text": "The ships were capable of flying through planetary atmospheres, and landing to pick up troops and supplies. Some were converted to autonomous, hyperspace-capable warships or served as planetary command stations."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}