{"url": "Luen", "categories": ["Category:Legends articles", "Category:Females", "Category:Mon Calamari", "Category:Slaves"], "nodes": [{"tag": "h1", "text": "Luen"}, {"tag": "p", "text": "Luen was a female Mon Calamari, who after the Sith genocide on her homeworld, become a slave of a gang of pirates led by the rogue Sith Darth Luft, who had taken control of the Mon Calamari Shipyards. As a scientist, she had been lured back to Dac by false reports of a renewed Dac. Instead, she and numerous other Mon Calamari and Quarren were press-ganged by the pirates into building a fleet of pirate ships. During her captivity, Luen and her Quarren colleague Tikin encountered the junk dealer Ania Solo and the Imperial Knight Jao Assam, who were on the hunt for another rogue Sith named Darth Wredd. During an escape attempt, they were launched into an escape pod on poisoned Dac's ocean. They were subsequently rescued by Ania's companions, the Mon Calamari Sauk and the assassin droid AG-37. Following the liberation of the Mon Calamari Shipyards by the Galactic Federation Triumvirate, Luen adopted Tilin, the son of the deceased Tikin, and they settled into the flooded Mon Calamari shipyards."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Enslavement"}, {"tag": "p", "text": "Luen was a female Mon Calamari environmental engineer who lived during the time of the Second Imperial Civil War. She survived the One Sith–inspired Mon Calamari Genocide and the subsequent poisoning of her homeworld Dac's oceans with viral spores. By 138 ABY, Luen was part of the sizeable Mon Calamari and Quarren diaspora who were living as refugees offworld. Following the defeat of the One Sith, the new Galactic Federation Triumvirate faced numerous immense challenges in rebuilding the galaxy. One of the new galactic government's main challenges was resettling millions of displaced Mon Calamari and Quarren refugees, many of whom lived in abject state of poverty."}, {"tag": "p", "text": "At some point, Luen received word of a \"renewed\" Dac and that all kinds of workers were needed to rebuild society on that poisoned planet. Luen joined a large number of Mon Calamari and Quarren refugees in returning to Dac to fulfill this dream. She believed that she could put her skills as an environmental engineer to good use. Unfortunately, the \"renewed Dac\" was a ruse created by the rogue Sith Darth Luft and his pirate associates with the intent of forcibly recruiting a labor force of Mon Calamari and Quarren slaves to build a fleet of pirate starships. Once there, these unfortunate Mon Calamari and Quarrens were imprisoned aboard the Mon Calamari Shipyards above the planet Dac. There, they were press-ganged into building ships for the pirates. To ensure their cooperation, their dependents and elderly were imprisoned by the pirates as hostages. During their captivity, the enslaved workers were routinely beaten and maltreated by their pirate captors."}, {"tag": "h3", "text": "Rescue"}, {"tag": "p", "text": "In 138 ABY, Luen and a Quarren acquaintance named Tikin were cornered by two strangers, who were disguised as pirates. These strangers turned out to be the Imperial Knight Jao Assam and the junk dealer Ania Solo, who were on a quest to hunt down another rogue Sith Darth Wredd, who had instigated an insurgency against the One Sith. Mistaking them for pirates, Luen produced a knife and attempted to fight off Jao and Ania. However, Jao managed to defuse the situation by revealing that he was an Imperial Knight and that he had come to help them. When Ania asked what was going on in the Mon Calamari Shipyards, Luen related how they had been tricked by the pirates into returning to a \"renewed\" Dac and that they had been press–ganged into building a fleet of warships for the pirates."}, {"tag": "p", "text": "After hearing Luen's story, Jao Assam got his communications droid to send a distress signal to the Galactic Triumvirate authorities in Coruscant informing them of the pirate presence in the Calamari system. When Jao asked Luen and Tikin why the Mon Calamari and Quarren had returned to Dac, she commented that they had been lured by false promises and hopes. The pirates had spread misinformation about a renewed Dac among the refugee communities. As an environmental scientist, Luen thought that she could put her skills to good use. Instead, she found herself being forced to build a fleet for the criminal syndicate of Darth Luft. Meanwhile, Tikin revealed that the pirates were holding their dependents and elderly hostage and expressed his fears of losing his son Tilin to the Sith. At that point, they were interrupted by a group of armed pirates who pursued them through the shipyard's hangars."}, {"tag": "p", "text": "At the end of a tunnel, Luen, Tikin, and their rescuers were cornered by Darth Luft and his associates. After confirming that Darth Wredd was not in the Calamari system as his late henchmen Dieben had led them to believe, Luft had them dumped into an escape pod which was then jettisoned into Dac. Darth Luft hoped to kill his unwanted guests in the poisoned oceans of Dac, where one drop was enough to kill a sentient being. The waters of Dac were littered with the corpses of countless sentient beings and animals, which had perished towards the end of the Genocide. As their escape pod dived deeper into the poisoned depths of Dac's oceans, Luen commented that they had a slim chance of survival since their escape pod was only designed to withstand atmosphere pressures. In response to Luen's pessimism, a despondent Tikin told her to keep quiet. Jao's Imperial comm droid managed to reconfigure his antennae to transmit a distress signal to Ania's friends, the assassin droid AG-37 and the Mon Calamari engineer Sauk, who quickly traveled in their freighter to Dac."}, {"tag": "p", "text": "As the escape pod descended deeper into Dac's oceans, Luen commented that they would soon be in the aphotic zone, the portion of the ocean where no sunlight could reach. When Luen pondered about whether the ship's hull would be able to withstand the oceanic pressure, Tikin merely responded that he did not want to know.Ania attempted to take control of the escape pod's directional thrusters. However, Tikin revealed that the pirates had forced them to strip all propulsion systems from the pods for use in their new fleet. Tikin and his companions were rescued by Sauk and AG-37 who plucked their escape pod from Dac's oceans. AG-37's freighter towed the escape pod into an abandoned section of the Mon Calamari Shipyards."}, {"tag": "p", "text": "Once aboard the space station, Luen met Ania's companions the assassin droid AG-37 and the Mon Calamari Sauk. When Luen commented that the shipyards where the Mon Calamari and Quarren slaves had been forced to work in were awful, Tikin added that the shipyards were a horrible place. A disagreement quickly broke out between Jao Assam and Ania Solo over how to deal with the threat posed by the pirates and Darth Luft. While Jao wanted to take the fight to the rogue Sith immediately, Ania insisted that they depart and wait for reinforcements to arrive. Tikin refused to abandon his son Tilin to the depredations of the pirates and strongly objected to Jao's plan on the grounds that his son could get killed in the process. He explained that the pirates punished recalcitrant slaves by harming their family members. Worried about his son and unwilling to risk provoking Darth Luft, Tikin left returned to the shipyards. Meanwhile, Luen joined Ania and her companions aboard AG-37's freighter."}, {"tag": "h3", "text": "The Fight for Freedom"}, {"tag": "p", "text": "Luen was present aboard AG-37's freighter during a joint Fel Empire and Galactic Alliance assault on the pirate–occupied Mon Calamari Shipyards. Jao Assam's mentor Yalta Val and Admiral Gar Stazi had received word of the pirate presence on Dac from Jao Assam. They assembled a force of warships, seatroopers, and Imperial Knights to deal with the pirates and liberate the Mon Calamari and Quarren slaves. The Triumvirate force assaulted the shipyards, wiping out the pirate starfighter and pirate droid defenses. During the fighting, the Alliance tanker Trand Cappa flooded the orbital shipyards with seawater, overwhelming the pirates and allowing the Mon Calamari and Quarren slaves to gain the upper hand over their captors. Val then led a boarding party of Imperial Knights and seatroopers to apprehend the pirates."}, {"tag": "p", "text": "Under Darth Luft's orders, the pirates exposed the detention blocks housing the slaves' relatives to zero-gravity space, killing several Mon Calamari and Quarren civilians. An ice plume formed outside the space doors of the detention block, plugging the hold and saving many more from being killed Luen, along with Ania and Jao witnessed the ice plume and quickly realized that they had a narrow window of opportunity to save the captives. Ania, Sauk, and Luen attempted to close the space doors but found that the controls were covered in ice. Unable to do so, they shepherded the Mon Calamari and Quarren refugees out of the chamber. However, the ice began cracking and Ania and her companions feared that they would not be able to evacuate everyone in time. With AG-37 unable to help since he was engaged with pirate starfighters, Ania managed to get Jao's comm droid to access the shipyards control bay and shut the doors remotely. This ploy worked and Ania and her rescuers managed to save countless Mon Calamari and Quarren."}, {"tag": "h3", "text": "Liberation"}, {"tag": "p", "text": "Following the liberation of the Mon Calamari Shipyards, Luen and the surviving Mon Calamari and Quarren refugees settled into the flooded interiors of the shipyards and established a new community. Luen also adopted the late Tikin's son Tilin as a gesture of respect to her fallen acquaintance. While Luen had never imagined herself having a child, she took pride in becoming Tilin's foster parent and adopted the title \"Aunt\". Luen also tried to encourage Ania's Mon Calamari companion Sauk to settle with her in the shipyards. Knowing that Sauk was a qualified engineer, she pointed out that the shipyard could make use of the services of several top–notch engineers to make the Shipyards hospitable. There was also news that several Whaladons, another sentient species indigenous to Dac, were planning to settle in the shipyards. However, Sauk politely declined Luen's offer, citing that his friends need him. Luen and Tilin settled into their new home, secure in the knowledge that the threat of Darth Luft and his pirate associates had been vanquished."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Luen was a blue–skinned female Mon Calamari who was trained as a marine engineer. As with many Mon Calamari and Quarren, she was greatly affected by the Mon Calamari Genocide, which ended in the destruction of her homeworld Dac. Despite the odds, Luen harbored the hope of returning to a restored Dac, that was free of viral spores. Like many of her compatriots, Luen fell victim to a scam perpetuated by the rogue Sith Darth Luft and his pirate associates and ended up as their slave and captive. Due to her engineering skills, she was put to work building a fleet of starships for the pirates. Luen also knew how to wield a knife in self defense. While Luen was a single woman and had no interest in raising children, she was still compassionate enough to raise the Quarren Tilin, the orphaned son of Tikin as her own child after the former was killed by Darth Luft."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Luen first appeared as a supporting character in Corinna Bechko and Gabriel Hardman's Star Wars: Legacy Volume 2 comic series.. She first appeared in the second story arc Star Wars: Legacy: Outcasts of the Broken Ring, which ran from August 28 to December 18 2013. Luen was drawn by Brian Albert Thies, colored by Rachelle Rosenberg, and designed by Jimmy Presler."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}