{"url": "Ludwin_Katarkus", "categories": ["Category:Legends articles", "Category:Individuals of unspecified gender", "Category:Individuals of unspecified species", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Ludwin Katarkus"}, {"tag": "p", "text": "Ludwin Katarkus was a Jedi Master serving the Jedi Order during the years leading up to the Clone Wars. After having become a Master, he took a initiate named Danyawarra as his Padawan."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ludwin Katarkus became a member of the Jedi Order and was trained in the ways of the Force. Katarkus eventually passed the Jedi Trials and was knighted by the Jedi High Council. Further pursuits of knowledge of the Force earned Katarkus the rank of Jedi Master. At some point later, Katarkus chose a Jedi initiate named Danyawarra as his Padawan."}, {"tag": "p", "text": "In 23 BBY, the High Council assigned Katarkus to mediate the ongoing Virgillian Civil War between the Virgillian Free Alignment and the Aristocracy. Consisting of two Master-Padawan teams, the diplomatic envoy was made up of Katarkus and Danyawarra, and Master Everen Ettene and Halagad Ventor. As the shuttle carrying the Jedi envoy entered Virgillia 7's orbit and touched down on the planet's surface, it was attacked by terrorists and destroyed. After receiving no word from the diplomatic team for three months, the High Council announced that it presumed the Jedi to be dead and would be holding memorial services for them within the Temple's walls."}, {"tag": "p", "text": "Both Danywarra and Ventor actually survived the attack and rejoined the Order, serving as commander and general respectively in the Grand Army of the Republic during the Clone Wars."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In Katarkus' only appearance, neither gender nor species is given."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}