{"url": "Lufa_Danak", "categories": ["Category:Canon articles", "Category:Individuals of unspecified gender", "Category:Neimoidians", "Category:Trade Federation members"], "nodes": [{"tag": "h1", "text": "Lufa Danak"}, {"tag": "p", "text": "Lufa Danak was a Neimoidian who served the Trade Federation during the reign of the Galactic Republic. In 32 BBY, Danak attended a meeting of the Galactic Republic's Galactic Senate on the planet Coruscant where Queen Padmé Amidala asked for aid in stopping an invasion of her homeworld Naboo by the Trade Federation. The Trade Federation senator Lott Dod, with whom Danak shared a repulsorpod, then objected to these claims."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lufa Danak was a Neimoidian who served the Trade Federation during the reign of the Galactic Republic. After the Federation invaded the planet Naboo in 32 BBY Danak attended a session of the Republic's Galactic Senate in the Senate Building on the planet Coruscant. The Neimoidian sat in a repulsorpod with the Federation's representative, Senator Lott Dod, and another Neimoidian. During the session, Queen Padmé Amidala took to the floor to ask the senate for aid in stopping the invasion of her homeworld Naboo, but before she could even finish her plea, Dod moved the Federation's repulsorpod forward and objected, claiming that there was no proof an invasion was taking place."}, {"tag": "p", "text": "Senator Aks Moe of Malastare agreed with Dod, causing Supreme Chancellor Finis Valorum to declare the point conceded and ask if Amidala would defer her motion to be investigated by a committee. Amidala refused to defer and called for a Vote of No Confidence in Valorum. This led to Valorum ultimately being replaced by Naboo's senator Sheev Palpatine, while Amidala returned to Naboo and managed to defeat the Federation forces there."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Danak had green skin and red eyes."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Lufa Danak wore a black diplomat's hat along with several layers of blue and purple robes."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lufa Danak first appeared in the 1999 prequel trilogy film, Star Wars: Episode I The Phantom Menace. In the current canon, Danak was first identified in the 2016 reference book Star Wars: The Visual Encyclopedia, which was written by Adam Bray, Tricia Barr and Cole Horton. The name originating in the Star Wars Legends continuity, where it was first used in the \"Rogues Gallery\" article in Star Wars Insider 147 in 2014."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}