{"url": "Lujayne_Forge", "categories": ["Category:Legends articles", "Category:Females", "Category:Humans", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "Lujayne Forge"}, {"tag": "p", "text": "Lujayne Forge was a Human female from Kessel who served as a pilot for Rogue Squadron for the New Republic Defense Force. She was killed in her sleep by Imperial stormtroopers during a surprise attack on Talasea, making her the first pilot casualty in the newly reformed elite squadron."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Kessel upbringing"}, {"tag": "p", "text": "Lujayne was born on Kessel to Kassar and Myda Forge. Kassar was a teacher who volunteered to go to Kessel under a Galactic Republic program to educate inmates on how to re-enter society upon release. Her mother was one of the inmate students who fell in love with him and decided to stay with him on Kessel."}, {"tag": "p", "text": "Lujayne had multiple brothers and sisters (including Inyri), all of whom were still alive and living on Kessel in 6.5 ABY. She always told her family that she wanted to become a hero so that she could prove that something good could come out of Kessel, a goal Commander Wedge Antilles and Corran Horn said she achieved during her time on Rogue Squadron."}, {"tag": "p", "text": "She learned a number of trade skills from her father's lessons, including landspeeder repair. Her expertise in repairing and maintaining T-47 airspeeders proved particularly helpful during her time with Rogue Squadron."}, {"tag": "p", "text": "Lujayne was self-conscious and fiercely defensive of others associating her and her family with the reputation of prisoners and smugglers normally associated with the prison world of Kessel. When Corran Horn, a fellow Rogue agent and former Corellian Security Force officer, specifically targeted her ship during a training simulation, she confronted Horn about whether it was due to her Kessel background."}, {"tag": "p", "text": "Horn later cited this encounter as having a major impact on his thinking, helping him to avoid making prejudgments against people based on their backgrounds, particularly when he eventually met Inyri."}, {"tag": "h3", "text": "Rogue Squadron"}, {"tag": "p", "text": "Lujayne was chosen by Wedge Antilles as one of the inaugural pilots when he reformed Rogue Squadron in 6.5 ABY. Her call sign was Rogue Eleven. She flew in the squadron's Three Flight, which was led by Lieutenant Corran Horn."}, {"tag": "p", "text": "Her roommate and wingmate was Andoorni Hui, which proved challenging for Lujayne at first as she had seldom interacted with Rodians in the past and did not understand Rodese."}, {"tag": "p", "text": "Although she was a talented enough pilot to make the squadron, her scores were among the lowest of her fellow pilots, and she herself admitted that she was not up to the same level as fellow pilots Corran Horn and Bror Jace. She was visibly relieved when Gavin Darklighter, who secured no kills during a dogfight against Imperial TIEs at Hensara, was jokingly named \"worst pilot in the squadron\" instead of herself."}, {"tag": "p", "text": "Wedge told superiors that Lujayne was not the squadron's greatest pilot, but was a \"fighter\" and a wise pilot who was \"not one to take chances.\""}, {"tag": "p", "text": "Corran considered Lujayne the heart of the unit, always looking after the physical and emotional well being of her fellow Rogues. Gavin, the youngest pilot on the inaugural squadron, became particularly attached to Lujayne, and she took him under her wing and helped him improve his astronavigation skills."}, {"tag": "p", "text": "She also helped Corran Horn repair the engine of his X-wing starfighter and encouraged Corran, who was initially standoffish with his fellow pilots and reluctant to work with teammates, to interact with and integrate himself among the other Rogue Squadron members."}, {"tag": "h3", "text": "Death"}, {"tag": "p", "text": "Lujayne Forge was killed in her sleep during a covert assault by a stormtrooper platoon against a Rogue Squadron training base on Talasea. Although six sentries were killed and Corran Horn, Gavin Darklighter and Andoorni Hui were seriously injured during the surprise attack, Forge was the only Rogue Squadron pilot to be killed."}, {"tag": "p", "text": "Her death took a particularly heavy toll on Rogue Squadron, both because of the way she watched out for her pilots, and due to the ignominious fashion she was killed, murdered in cold blood rather than falling in combat. As Wedge predicted, her death was particularly difficult for Gavin Darklighter, because of the fact that Forge was teaching Darklighter astronavigation skills, thus they had a closer connection as a teacher and student."}, {"tag": "p", "text": "A large memorial held for Lujayne and the six fallen sentries was attended by Wedge, Rogue Squadron, Admiral Ackbar, General Horton Salm and his Defender Wing, and the crew and medical personnel of the Nebulon-B frigate Reprieve. Andoorni Hui, despite extensive injuries, was allowed to be released from her bacta tank and attend the memorial on a hover chair."}, {"tag": "p", "text": "Lujayne's sister, Inyri Forge, later joined Rogue Squadron to honor Lujayne after proving herself in the conquest of Coruscant."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}