{"url": "Luke_Skywalker%27s_fangirls", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Non-canon Legends articles", "Category:Togruta", "Category:Unidentified females", "Category:Unidentified Rodians", "Category:Unidentified Twi'leks"], "nodes": [{"tag": "h1", "text": "Luke Skywalker's fangirls"}, {"tag": "p", "text": "Shortly after the Battle of Yavin, a group of fangirls started to idolize Rebel hero Luke Skywalker, who managed to destroy the Death Star. These group of fangirls, composed of many species including Humans, Rodians, Twi'leks and Togrutas."}, {"tag": "p", "text": "During a secret mission at Naboo, the fangirls had the chance to discover Skywalker. One of the fangirls showed Skywalker that she had a picture of him in her lunchbox. After taking out three stormtroopers who were intending to kill him, the fangirls became more exited seeing Skywalker using his lightsaber, leading Skywalker to run away from them. He build a bridge over a starship to escape, but the fangirls destroyed both the ship and the bridge without difficulty. After the lost Skywalker at an alley, Skywalker and his droid R2-D2 emerged disguised from Mollo's Custome Shop as the Sith Lord Darth Vader and an Ewok, leaving Wicket Wystri Warrick surprised. However, after Skywalker retired his mask, the fangirls started to chase him again, even stomping Jedi Master Yoda, forcing Skywalker to leave the planet with his T-65B X-wing starfighter."}, {"tag": "p", "text": "Just after returning to Naboo to save his friends, during a duel with Darth Vader, Skywalker found himself besieged by his fangirls again. However, willing to find a way to help his master, the protocol droid C-3PO and R2-D2 told the fangirls that they were mopping the wrong and that though Vader could be too modest he was attractive, showing a picture of him during his youth, leading the fangirls to change their idol. Like his son, Vader was harassed from the fangirls immediately, causing him to run away."}, {"tag": "p", "text": "After both the Rebels and the Imperials left Naboo to battle in the outer space, the fangirls followed Vader with a ship, causing the Sith Lord to jump into hyperspace to escape from them, leading the fangirls to do the same. However, by doing so, both Vader and the fangirls ended up crashing against the Darth Star, which had been built by the Sith Lord Darth Maul. While Vader was thrown into Emperor Palpatine's Star Destroyer, getting Maul sucked into the space's vacuum in the process, the fangirls were left to float in the space."}, {"tag": "p", "text": "Inexplicably, through unknown means, the fangirls somehow managed to get back to the civilization and attended Vader's ceremony at the Imperial Palace at Coruscant. However, when a Rodian fangirl asked Vader to show his face, he opted to do so and left the fangirls in shock. However, as Maul laughed, the fangirls became obsessed with him and started to pursue him, much to Vader's joy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Luke Skywalker's fangirls appeared in the 2012 non-canon TV special LEGO Star Wars: The Empire Strikes Out, which loosely adapts the events of the 1980 film Star Wars: Episode V The Empire Strikes Back and the 1999 prequel Star Wars: Episode I The Phantom Menace."}, {"tag": "p", "text": "Interestingly, among the fangirls, three of them used the LEGO models of Ahsoka Tano, Aayla Secura and Shaak Ti. However, it would be very unlikely to be actually them as they were children and that both Secura and Ti were killed during the Great Jedi Purge, while Tano's fate was left ambiguous after abandoning the Jedi Temple."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}