{"url": "Luke_Skywalker%27s_scout_craft", "categories": ["Category:Legends articles", "Category:Articles with conjectural titles", "Category:Alliance to Restore the Republic starships", "Category:Corellian Engineering Corporation products", "Category:Scout starships", "Category:Unidentified spacecraft"], "nodes": [{"tag": "h1", "text": "Luke Skywalker's scout craft"}, {"tag": "p", "text": "This scout craft was a well-armed civilian-legal ship."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "The design of the ship followed that of larger Corellian gunships used throughout the galaxy, although on a smaller scale than the DP20 frigate which is in turn smaller than the CR90 corvette. It had a bank of three engines. Like other Corellian gunships, its bow was a single forward-pointing pod."}, {"tag": "p", "text": "Despite the scaling down, the ship was still rather well-armed, with seven cannons that could be fired by remote. These included forward guns and side batteries."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Luke Skywalker and Princess Leia Organa acquired this ship from Jorman Thoad, a starship dealer on the planet Centares, in exchange for Simon Greyshade's space yacht which they had acquired from The Wheel. Greyshade's ship was more valuable, but also far more identifiable, necessitating a switch."}, {"tag": "p", "text": "Luke believed the ship wasn't as sturdy as Thoad had claimed as the shields failed when they took a single hit from an explosive mine, but Leia informed him this was not necessarily the case, as the mine was a heavy duty mine, capable of collapsing the shields of even larger spacecraft. Eventually Skywalker and Organa made it back to the Rebel base on Yavin 4 where the ship was refurbished by the maintenance personnel."}, {"tag": "p", "text": "Luke took the runner on his next mission to determine the extent of the Imperial blockade of the Gordian Reach Sector, and to acquire essential parts for the Rebellion from Feriae Junction."}, {"tag": "p", "text": "Skywalker also used the craft in 3 ABY to ferry the remains of an Imperial warbot to Kligson's Moon for repairs."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}