{"url": "Luke_Skywalker%27s_yellow_lightsaber", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Articles needing illustration", "Category:Articles to be expanded", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "Luke Skywalker's yellow lightsaber"}, {"tag": "p", "text": "A single-bladed Jedi Temple Guard lightsaber was used by Luke Skywalker after discovering it within a Jedi outpost on Tempes."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The weapon had a kyber crystal at its heart that powered it, and like all Jedi Temple Guard lightsabers, it emitted a yellow-colored plasma blade when ignited."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the High Republic Era, the Jedi Order established an outpost on Tempes. Although it was eventually abandoned, several Jedi artifacts were left behind, including a single-bladed Jedi Temple Guard lightsaber that was placed on a pedestal. Shortly after the Battle of Hoth in 3 ABY, Luke Skywalker, a Jedi Padawan and Commander in the Alliance to Restore the Republic, lost his lightsaber during a duel with the Sith Lord Darth Vader on Bespin. Skywalker travelled to the outpost on Tempes to retrieve a new lightsaber after receiving directions from the partially trained Padawan Verla."}, {"tag": "p", "text": "Upon entering the abandoned outpost, Skywalker noticed the lightsaber and claimed it as his own. He was immediately ambushed by the spirit of the Grand Inquisitor that had been bound to the ruins for eternity by Vader to serve as a trap for unsuspecting travellers. Using the weapon, Skywalker defended himself against the Inquisitor's red-bladed lightsaber. Although the Inquisitor initially had the upper hand, the aspiring Jedi was able to best him by severing his hand and slicing him across the chest. Skywalker subsequently returned to the Fourth Division of the Alliance Fleet where he presented his new lightsaber to his comrades aboard an EF76 Nebulon-B escort frigate."}, {"tag": "p", "text": "Sometime later, the Fourth and Seventh Divisions engaged Imperial forces over Elessia. During the battle, Skywalker flew his personal T-65B X-wing starfighter until he received news that Princess Leia Organa's frigate had been boarded. After clearing out an Imperial fighter wing, Skywalker boarded Organa's frigate to assist with repelling Imperial forces. Using his lightsaber, the young Jedi cut through a group of stormtroopers and entered the engine room where Imperial Commander Ellian Zahra was facing Organa. Although Skywalker ordered her to stand down, Zahra was able to escape after a brief fight with the Jedi."}, {"tag": "p", "text": "In 4 ABY, Skywalker constructed a new green-bladed lightsaber that he began using instead of the Jedi Temple Guard lightsaber."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Luke Skywalker's yellow lightsaber first appeared in the sixth issue of the comic book series Star Wars which was written by Charles Soule, illustrated by Jesús Saiz, and published by Marvel Comics on September 16, 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}