{"url": "Luke_Skywalker%27s_starship_(Harix)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:Unidentified spacecraft"], "nodes": [{"tag": "h1", "text": "Luke Skywalker's starship  (Harix)"}, {"tag": "p", "text": "This starship was piloted by Luke Skywalker on a mission for the Rebel Alliance to deliver pre-Empire micro-books to the planet Harix in 1 ABY. Accompanying Luke were the droids C-3PO, and R2-D2. Skywalker avoided a TIE fighter patrol and landed near the school where Myoris Lin taught, hiding the vessel. They discovered that Lin was already the target of an Imperial raid led by Major Stafuv Rahz, who captured the teacher and her students, except Lin's own son Berd. Berd departed with Skywalker aboard the starship, meeting with Princess Leia Organa at a prearranged rendezvous. Organa approved of Berd's rescue plan, which would use target drones modified to transmit false sensor profiles to distract the Imperial forces, and Skywalker, Organa, and Berd recruited Han Solo, Chewbacca, and several other freighter pilots to assist in the rescue. The target drones were loaded aboard Skywalker's starship, and Solo and Chewbacca left behind the Millennium Falcon to accompany Skywalker, Organa, and Berd aboard the vessel. When the ship emerged from hyperspace, Skywalker's ship deployed the drones, which appeared on Imperial sensors to be a huge battle fleet. The ship landed on Harix, and Skywalker, Solo, and Chewbacca ventured forth to deal with a group of TIE fighters lying in wait behind Harix's Talhu Slotted Peaks. After neutralizing the fighters, Chewbacca returned to inform Organa, who flew with Berd aboard the starship and led the other freighter pilots to the school, where they rejoioned Skywalker and Chewbacca and rescued Lin and the children."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "This vessel was seen in a promo for the Star Wars newspaper strip for the Watertown Daily Times."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}