{"url": "Lulsla_(MC40a_light_cruiser)", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starships", "Category:MC40a light cruisers"], "nodes": [{"tag": "h1", "text": "Lulsla (MC40a light cruiser)"}, {"tag": "p", "text": "The Lulsla was a Rebel Alliance MC40a Light Calamari Cruiser."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The vessel performed an important role in the Rebel Alliance leadership's flight from Hoth, by dispatching starfighters to capture Outpost D-34, an Imperial checkpoint located along a Rebel escape route."}, {"tag": "p", "text": "After Lulsla was positively identified as the source of the forces that attacked and plundered the outpost, Imperials planned a counterattack to intercept it while under supply in the Bruanii sector. While standard Imperial doctrine would have meant sending Star Destroyers to engage it in ship-to-ship combat, the Rebels had preempted this by laying a vast minefield of Type A and Type C mines."}, {"tag": "p", "text": "From the Imperial-class Star Destroyer Hammer and the Modified Frigate Fogger, two hyperspace attacks were launched against the Lulsla."}, {"tag": "h3", "text": "Disrupt resupply"}, {"tag": "p", "text": "During the first attack, Delta-class stormtrooper transports Sigma group and Omega were tasked with destroying the resupply containers with proton torpedoes from standoff distance outside the minefield. Fighter escort was provided by two squadrons of Assault Gunboats, armed with concussion missiles."}, {"tag": "p", "text": "As one of the Rebellion's front-line cruisers, Lulsla had a full complement of modern starfighters, including X-wings, A-wings, and B-wings. The Gunboats led by Maarek Stele largely eliminated the Mon Calamari Rebel cruiser's fighter screen and a significant number of mines, though his wingmen suffered heavy losses at the hands of A-wing and X-wing reinforcements."}, {"tag": "p", "text": "With the first wave having successfully accomplished its goals, the surviving attackers escaped into hyperspace, though Stele inspected several containers and realized that they stored Imperial equipment, which he later confided to the Prophets of the Dark Side. (It was later discovered that Admiral Harkov had been selling it to the Rebellion.)"}, {"tag": "h3", "text": "Destruction of Lulsla"}, {"tag": "p", "text": "The Imperials wasted no time conducting a follow-up assault. Transports Sigma and Omega were rearmed with heavy rockets, and again would be accompanied by escorting Assault Gunboats."}, {"tag": "p", "text": "This caught Lulsla at its most vulnerable point, as it was trapped by its own minefield and reinforcements could not arrive in time. A handful of X-wings and Y-wings put up some resistance, but to no avail. The Imperials accomplished their objective with little loss."}, {"tag": "p", "text": "The officers aboard the Lulsla abandoned their doomed ship and attempted to flee. However, their shuttles were quickly caught and disabled by Stele and captured by stormtrooper transports."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}