{"url": "Lumablast_Rocket", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:BlasTech Industries products", "Category:Flash-bang demolitions", "Category:Wrist rockets"], "nodes": [{"tag": "h1", "text": "Lumablast Rocket"}, {"tag": "p", "text": "The Lumablast Rocket, or luma blast, was a type of wrist rocket produced by BlasTech that was designed to temporarily blind living creatures with a bright flash of light rather than cause lasting physical harm. The rockets were utilized in the MM9 rocket system, a wrist rocket launcher produced by Kelvarek Consolidated Arms. In 23 BBY, the Sith cultist Granta Omega used at least one of the rockets while fighting the Jedi Knight Obi-Wan Kenobi on the planet Korriban. The Mandalorian bounty hunter Boba Fett used Lumablast Rockets in his MM9 rocket system at some point during his career. The effect of a Lumablast Rocket was similar, although less intense, than that of a luma grenade."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A type of wrist rocket, the Lumablast Rocket, also known simply as a luma blast, was designed to detonate in a bright flash of orange and yellow-colored light. The flash produced by a Lumablast Rocket was bright enough to still be effective against a member of the Human species with closed eyes. A Human could take as long as several minutes to recover after being exposed to a luma blast. While the weapon did not cause any lasting physical damage, the flash of light produced by a Lumablast Rocket was capable of temporarily blinding living creatures caught within its four-meter blast radius. The rockets had a maximum range of 100 meters and made a hissing sound when launched. The flash from a Lumablast Rocket was similar, although not as powerful, as the blast from a luma grenade, which could blind a Human for thirty minutes or up to an hour if the individual was wearing night vision goggles."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lumablast Rocket was produced by BlasTech Industries by the year 23 BBY and was available around the same time as the luma grenade, which was available as early as 26 BBY. The rockets were used in the Kelvarek Consolidated Arms MM9 rocket system, a model of wrist rocket launcher. While that system was being produced, the sale and ownership of Lumablast Rockets was restricted to those with government license and approval, although they were still commonly sold for 400 credits each. In 23 BBY, the Sith cultist Granta Omega carried at least one of the rockets for use in the wrist rocket launchers he wore while on the planet Korriban. While in Korriban's Valley of the Dark Lords, Omega used a Lumablast Rocket to temporarily blind the Jedi Knight Obi-Wan Kenobi, but he was ultimately unable to defeat the Jedi with his other weaponry and was killed. The Mandalorian bounty hunter Boba Fett utilized Lumablast Rockets in his MM9 rocket system at some point during his career, which began during the Clone Wars and continued into the time of the Galactic Alliance over six decades later."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Luma blasts were first mentioned in a list of specialty rockets used by Boba Fett that was featured in The Essential Guide to Weapons and Technology, a 1997 reference book written by Bill Smith. The rocket was later identified as a Lumablast Rocket in a side bar on ammunition used with the MM9 rocket system in Arms & Equipment Guide, a 2002 sourcebook written by Jeff Grubb and Owen K.C. Stephens for the revised edition of Wizards of the Coast's Star Wars Roleplaying Game. In 2004, at least one Lumablast Rocket appeared in a fight between Granta Omega and Obi-Wan Kenobi in Jedi Quest: The Final Showdown, a novel written by Jude Watson. Other wrist rockets were fired during the same scene, but none of them were identified as Lumablast Rockets. The novel also did not identify the type of wrist rocket launcher that Omega used to fire the Lumablast Rocket."}, {"tag": "p", "text": "Jedi Quest: The Final Showdown stated that it would take several minutes to recover from the effects of the rocket, which contradicted information in Arms & Equipment Guide stating that recovery would take less than a minute. As the sourcebook only provided the recovery time as game mechanics and the novel was released afterward, this article uses the novel's recovery time of a several minutes. In Arms and Equipment Guide, the only era when the Lumablast Rockets were confirmed to be available was the Rise of the Empire era, which is the only era provided for the MM9 rocket system in the book. However, while the rockets were not featured with Boba Fett elsewhere, Fett did carry the MM9 rocket system during the Rise of the Empire era, Rebellion era, New Republic era, New Jedi Order era, and Legacy era. While the 2008 novel Coruscant Nights I: Jedi Twilight revealed that the effects of a luma grenade could be negated using polarized lenses, no source has stated that the same was true for Lumablast Rockets."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}