{"url": "Luminara_Unduli/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles in need of updating", "Category:Pages needing citation", "Category:Females", "Category:Jedi Generals", "Category:Jedi Guardians", "Category:Jedi Purge victims", "Category:Mirialans", "Category:Post-Ruusan Jedi Masters"], "nodes": [{"tag": "h1", "text": "Luminara Unduli"}, {"tag": "p", "text": "Luminara Unduli was a Force-sensitive female Mirialan who served as a Jedi Master and Jedi General in the fading years of the Galactic Republic. She was a valued adviser to the Jedi High Council, the Supreme Chancellor, and the Galactic Senate. During the Clone Wars, she fought with her last Padawan, Barriss Offee, and she was a common and formidable presence at points of crisis, on worlds such as Ilum, Nadiem, and Geonosis. She was killed during the Battle of Kashyyyk when Contingency Order 66 was enacted."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Luminara Unduli was born on the planet Mirial, a cold, dry, and despondent world oppressed by the Trade Federation. Detected to be Force-sensitive, Unduli was taken into the Jedi Order at a young age, and so lived through little of the misery known to most Mirialans."}, {"tag": "p", "text": "At the Coruscant Jedi Temple, Unduli received training in the ways of the Force, becoming skilled in manipulating it and honing her skill with a lightsaber. Selected as a Padawan by a fellow Mirialan, as had many other Mirialans for several hundred years, Unduli constructed a green-bladed lightsaber and grew strong in the Force. Upon achieving the rank of Jedi Knight, she dedicated herself to physical disciplines; her patterned tattoos were a traditional Mirialan reflection of this somatic commitment. She trained heavily to improve her corporal prowess, working over the course of years to enhance her flexibility and agility in combat and mastering the third form of lightsaber combat, Soresu. Adorning in traditional Mirialan robes, Jedi Unduli trained independently as a Jedi Guardian, though she was a skilled and respected Diplomat and adviser to high-profile senators in the Galactic Senate. She was also part of the Jedi escort accompanying then Lytton sector senator Finis Valorum to Troiken during the negotiations with Iaco Stark. She then fought against Stark's faces alongside Master Plo Koon there."}, {"tag": "p", "text": "Eventually, Jedi Unduli became a Master in the years prior to the Invasion of Naboo. When it came time to select a Padawan circa 28 BBY, Master Unduli selected the young Mirialan Initiate Barriss Offee as an apprentice, continuing the tradition of Mirialans teaching Mirialans."}, {"tag": "p", "text": "Around the year 22 BBY, Luminara Unduli and another Jedi Master named Kit Fisto served as Jedi Advisors to the Supreme Chancellor Palpatine, a position that had once been occupied by Master Jorus C'baoth when Palpatine was still the senator of the Chommell sector."}, {"tag": "h3", "text": "Mission to Ansion"}, {"tag": "p", "text": "During the Separatist Crisis, a tumultuous time of schism in the Galactic Senate, a raveled web of alliances conspired to elevate a small and unimportant world in the Mid Rim, Ansion, to a position of profound strategic significance. Recognizing the systematic precision in which Ansion was being attacked politically, the Jedi High Council dispatched Master Unduli and Padawan Offee, to the previously insignificant world, where they were met by Master Obi-Wan Kenobi and his apprentice, Anakin Skywalker. The four Jedi were charged with forestalling any incipient local separatist movement, and encouraging them to remain within the Republic."}, {"tag": "p", "text": "Their mission was made difficult by the cultural division which gripped Ansion: one part of the planet's population dwelt in cities and towns and engaged in trade with other worlds in the Republic; the other part lived in a loose confederation of nomadic clans on Ansion's vast, windy plains. The two factions were bitterly mistrustful of one another, and had been in conflict for more than a thousand years."}, {"tag": "p", "text": "Master Unduli and her Padawan were ambushed not long after they arrived in the modest Ansionian capital, Cuipernam, by employees of Soergg the Hutt, a local crime lord whose services had been retained by the Confederacy of Independent Systems. Cornered against a wall, Unduli sustained a minor blaster graze before Jedi Kenobi and Padawan Skywalker arrived and defeated her attackers, who had expected only two Jedi."}, {"tag": "p", "text": "Secure in their persons for the time being, Unduli and the other Jedi proceeded to the Ansionian council building, where they conducted initial negotiations with the Unity of Community Council, which represented the city-dwelling Ansionians. Like Ansion, the council was deeply divided. Roughly half its membership favored the Separatists, having been promised a quick and forceful end to the conflict with the prairie-dwelling Alwari nomads by the Separatist leadership and an escape from Republic taxes and regulations."}, {"tag": "p", "text": "After a particularly unorthodox demonstration of the Force on the Armalat delegate Tolut, and a promise of a very favorable settlement with the Alwari, Luminara was able to persuade the Council to provisionally agree to remain in the Republic—so long as the Jedi delivered on her promise. The quartet's new focus was interrupted when Padawan Offee was captured by two mentally disabled Ansionian gangsters in the employ of Soergg, Bulgan and Kyakhta. The young Padawan was able to convince her captors to help her escape Soergg's men by offering to heal them of their injuries. Restored to their former selves, the pair quickly aided Offee in eluding the Hutt's clutches. Unsurprisingly, Master Unduli located her escaped Padawan before Kenobi or Skywalker sensed her presence."}, {"tag": "p", "text": "Bulgan and Kyakhta, grateful to and in awe of Offee—and sensing an opportunity—appointed themselves guides to the four Jedi. Unduli and her colleagues accepted the aid of the Ansonian pair, not least because the two were both outcast members of Alwari clans. In short order, the Jedi set out on an expedition to locate the scattered Alwari clans, particularly the Borokii overclan. Unduli, Offee, their two colleagues and their guides, crossed out of Cuipernam into Ansion's vast prairie, riding on magnificent suubatar animals recommended by Bulgan and Kyakhta as much for their prestige among the Alwari as for the very practical advantages of the beasts."}, {"tag": "p", "text": "As the expedition progressed, Unduli noticed a clear tension between Offee and the confident Skywalker, and discussed the brash Padawan's unusual case with Kenobi. On the way, they had to fend off attacks by gairk at a river crossing, and seek shelter from a large flock of suicidal kyren. At the camp of the first Alwari clan they encountered, the Yiwa, Unduli and the others were welcomed, but were required to provide entertainment that evening. After gaining a deeper understanding of the Alwari sense of tradition, Unduli contrived an entertainment that would satisfy the Yiwa. Taking a handful of sand from the ground, she let it fall through her fingers, but against the wind. Turning the stream of sand into a coil with expert manipulation of the Force, Unduli lifted twirling columns of sand around her in glittering spirals. Then she also began to twirl herself, until she was rapidly whirling around with spirals of sand forming a vortex around her as she rose off of her feet into the air. Climatically, the sand was formed into a globe around her as she spun in mid-air. Her dizzying performance completed, she returned to her place among the other Jedi amid the Alwari equivalent of applause. Even her companions were impressed by this feat."}, {"tag": "p", "text": "Master Unduli again had cause to worry about Offee when the Padawan disappeared chasing a Gwurran thief, Tooqui. However, the Padawan was found, this time surrounded by rambunctious, inquisitive Gwurrans. Tooqui insisted on coming along with them, and Unduli reluctantly agreed, passing off responsibility for him to Offee. The Gwurran would prove his worth when he rescued all four Jedi and the two Alwari after the Qulun clan used a scented perfume to send the Jedi to sleep and capture them in order to receive a payment from Soergg. After they escaped with their mounts, Unduli would later save Skywalker's life when he was attacked by two predatory shanhs."}, {"tag": "p", "text": "After being led to the Borokii clan, the Jedi were required to retrieve a tuft of wool from the exceedingly rare albino surepp herd animals without modern technology. Unduli went into the herd at night, bouncing off the top of each animal and retrieved the wool. On the way back, she slipped and was knocked unconscious. The other Jedi brought her out of the herd and the negotiations proceeded. The Borokii agreed to the settlement, but the Jedi were required to deal with their traditional enemies, the Januul clan. Under the leadership of Kenobi, the Jedi agreed, although Unduli was flabbergasted. When the two clans drew up to engage each other, the Jedi went in between them and declared their intention to not fight either side. Unduli and the other Jedi then fended off attacks launched against them by both sides, but they parried only weapons, injuring and killing none of the combatants. Stunned, both clans agreed to the Jedi's proposition."}, {"tag": "p", "text": "Returning to Cuipernam to inform the Unity Council, Soergg again tried to ambush the Jedi, who were then aided by an honor guard of both Januul and Borokii clans. Unduli then proceeded to the negotiations, where Ansion—a vital hub of alliances—agreed to stay in the Republic. Her hard work, research, ingenuity and skill had helped keep a vital world in the Republic."}, {"tag": "h3", "text": "Clone Wars (22 BBY–19 BBY)"}, {"tag": "h4", "text": "Battle of Geonosis"}, {"tag": "p", "text": "Shortly after Unduli and Offee returned from the mission to Ansion, it became apparent that a full-fledged military conflict between the Galactic Republic and the Confederacy of Independent Systems would occur. Obi-Wan Kenobi was captured by the Confederacy on Geonosis, and Unduli and her Padawan joined Master Mace Windu's quickly launched rescue mission."}, {"tag": "p", "text": "Masters Windu and Unduli were the vanguard for the approaching Jedi strike team. The pair slipped past the planet's significant anti-orbital defenses and commandeered newly landed TX-130S fighter tanks which they used to destroy Geonosian gun emplacements blocking the way to the looming Petranaki arena. Housed within the packed arena were Jedi Kenobi, Skywalker, and Senator Padmé Amidala, who were to be tried and executed by the Confederacy leaders assembled on the world. As over two hundred Jedi crept into the arena, they ignited their lightsabers in challenge to Count Dooku, the leader of the Confederacy, who was personally overseeing the planned execution. Entering the arena and standing beside fellow Jedi Master Shaak Ti, Luminara ignited her lightsaber and engaged the Separatist droid forces in the heated but short battle that followed; over half of the assembled Jedi Knights fell in battle before the observing Count Dooku called a temporary halt and offered the Jedi clemency if they surrendered, only for the offer to be rejected by Master Windu, prompting the droids to resume their attack. Luminara raised her lightsaber, prepared to fight and die, but this was rendered unnecessary by the arrival of Grand Master Yoda, accompanied by the newly-created Grand Army of the Republic in several LAAT gunships. Master Unduli boarded a gunship with Masters Shaak Ti, Saesee Tiin, and Roth-Del Masona and presumably led clone troopers into battle in what would be the first conflict of the Clone Wars."}, {"tag": "h4", "text": "Jedi General"}, {"tag": "p", "text": "After the conclusion of the battle, Master Unduli reported back to Coruscant where she took up the mantle of Senior Jedi General in the Grand Army. Units under her command included the 41st Elite Corps and a Republic naval task force. During the war, Unduli commanded a Republic task force during an engagement with a Separatist fleet near the Kaliida Shoals Medical Center that had arrived to assist the Confederate warship Malevolence, which was under attack by Republic forces. This meant she was unable to reach them in time to assist in the destruction of the warship, but her help was rendered unnecessary thanks to Skywalker's tinkering with the Malevolence's hyperdrive system, causing it to crash into the nearby dead moon."}, {"tag": "h4", "text": "Assault on Ilum"}, {"tag": "p", "text": "Four months after the Battle of Geonosis, Unduli led her Padawan to the secret Jedi Temple on the icy world Ilum, where the two traveled to complete Offee's final lightsaber. Conducting the construction ceremony, Master and Padawan were attacked by cloaked Separatist chameleon droids, which had infiltrated the temple in an attempt to destroy the cavern's precious natural lightsaber crystals. Together, they were able to halt the droid assault, but much of the temple was brought down upon itself by mines the droids had set before attacking. Unduli and Offee plunged into the depths of the temple cavern as great slices of rock and small and precious crystals alike plummeted to the ceremonial floor."}, {"tag": "p", "text": "For moments, they were able to elude the stone maelstrom, but even their great powers working in concert were soon not enough to allow escape. The Jedi were trapped. Offee reached out bodily with the Force to halt the falling debris above her, and succeeded, only to glance at her Master, who sat in meditative harmony with the Force and falling stone. The apprentice joined the master in reflective poise, and, together, they calmly held up the crushing vault of stone which piled above them. Eventually, the pair were extricated by the efforts of Master Yoda, who had sensed their battle at a great distance while traveling through space."}, {"tag": "h4", "text": "The Stolen Crystals"}, {"tag": "p", "text": "As the Clone Wars continued across the galaxy, the High Council saw it safer to transport the crystals used in lightsabers to Coruscant instead of letting each Jedi travel to Ilum by themselves. Luminara Unduli was selected to oversee the transport of the crystals aboard the starship Sedawan. The ship however, was attacked by the Nightsisters of Dathomir; the group had ties to Count Dooku and intended to steal the Sedawan's cargo of crystals. Master Unduli made a standoff against the intruders in the docking bays as the Nightsisters boarded, but she was overwhelmed by their numbers. One of the Nightsisters' leaders, Yansu Grjak took Unduli as a captive and used her as a device in their crystal powered weapon on Dathomir. Two Jedi eventually came and rescued Unduli but had to fight of the Nightsister leader Sai Sircu. Exhausted and injured from the abuse, Unduli returned to Coruscant leaving the Nightsisters to be dealt with by the other Jedi."}, {"tag": "h4", "text": "Duel with Ventress"}, {"tag": "p", "text": "With Offee overseeing an operation on Geonosis, Unduli traveled to Rodia to escort captured Trade Federation Viceroy Nute Gunray to Coruscant for trial. The Jedi Master was joined by Anakin Skywalker's Padawan, Ahsoka Tano. Aboard the Venator-class Star Destroyer Tranquility, Unduli spearheaded the interrogations of the viceroy, whose denial of information cost Tano her patience. The Padawan physically threatened Gunray with her lightsaber, and though Unduli scolded the Padawan for using fear as a weapon, the viceroy agreed to \"negotiate.\" Before any information could be gleaned, the Tranquility was attacked by Dark Acolyte Asajj Ventress and a battle droid squad, who had arrived to rescue Gunray."}, {"tag": "p", "text": "After Unduli and Clone Commander CC-1004, nicknamed \"Gree,\" managed to destroy the army of B2 super battle droids, the Jedi Master sensed that Tano was in danger and rushed to meet with her. Unduli arrived to assist the Padawan in confronting Ventress, who was cornered. However, while \"surrendering,\" Ventress activated thermal detonators that she had planted in the Star Destroyer's engine room, crippling the cruiser, and escaped to the ravaged engine room. Although Tano offered to help, noting her past run-ins with Ventress and stating that the assassin was \"too powerful with any one Jedi,\" Unduli unwisely pursued the assassin on her own, leaving Tano to guard Gunray."}, {"tag": "p", "text": "Finding and engaging Ventress in a lightsaber duel, Unduli was hampered by a wound to the left eye early in the battle. but was still able to put up a fight. She acknowledged Ventress's preferred style, that of Count Dooku, but Ventress's was unrefined, amateurish, and sloppy. The enraged Ventress then pinned her under several pipes she collapsed from the ceiling and as Ventress moved to deal the killing blow. The Jedi Master was saved by the timely arrival of Tano, who had decided to disobey her orders in the interest of helping Unduli and Force-pushed Ventress away. The Mirialan accepted the Padawan's help for the continuing duel, but in the end, Ventress escaped with Senate Commando Captain Faro Argyus, who had defected to the Separatists and freed Gunray from Republic custody. Unduli and Tano transmitted the signal of the Consular-class cruiser that the Separatists had used to escape the Tranquility to Jedi Master Kit Fisto, who tracked Gunray to the third moon of Vassek. Unduli apologized to Tano for not taking her advice before the Padawan departed to rendezvous with her own Master."}, {"tag": "h4", "text": "Mission to Alzoc III"}, {"tag": "p", "text": "Shortly after her first encounter with Ventress, Unduli accompanied Jedi Aayla Secura and commanders Bly and Gree to the barren ice world of Alzoc III to investigate CIS activity reported by Jabba the Hutt. Unduli was unsure about trusting the Hutt crime lord and felt he was using Jedi to do his dirty work. She and Secura scaled nearby cliffs to open the way for the troops. Upon reaching the top they saw a massive crash site with floating wreckage. They wondered what had caused this and decide the must find out. As they made their way into the wreckage, they shortly encountered heavy CIS forces."}, {"tag": "p", "text": "After reaching the remains of the ship's bridge, Gree began to slice the vessel's data recorder as Unduli and Secura defended him from on coming battle droids. It was soon revealed that Asajj Ventress was nearby and had set the frigate to self-destruct. Unduli and Secura sparred with the Dark Acolyte after surviving the explosion. Ventress was forced to slowly back off as the two Jedi proved to be a match for her. She threw large bulks of ice at them from a distant cave, but Unduli and Secura caused it to cave in on her. They then reported to the Jedi High Council."}, {"tag": "h4", "text": "Return to Geonosis"}, {"tag": "p", "text": "Luminara was later sent to Geonosis to help Masters Ki-Adi-Mundi and Obi-Wan Kenobi destroy Poggle the Lesser's new droid foundry there. Along with her Padawan, Barriss Offee, she joined Anakin Skywalker and Ahsoka Tano in the storming of the droid factory. While she and Skywalker acted as diversions, the two Padawans Offee and Tano made their way through the vast underground catacombs to destroy the factory, not before Ahsoka contacted them explaining that they wouldn't be able to make it shortly before detonating the explosives, forcing Unduli and Skywalker to watch in horror as the factory blew up with their respective apprentices inside. After learning that the two Padawans were still alive stuck under a the rubble, Unduli and Skywalker used the force to lift the rubble."}, {"tag": "p", "text": "Following this, Unduli went in search of Poggle the Lesser, who had retreated into the catacombs of an ancient temple. While she and a trooper searched the temple, a sandstorm prohibited reinforcements from reaching their positions. While communicating with Masters Kenobi and Mundi via hologram, Unduli's clone trooper was killed by the undead hordes of the mysterious Hive Queen Karina the Great. Having been knocked unconscious and captured, the Jedi Master was taken before Karina. Jedi Kenobi and Skywalker came to her rescue; they were not far off when Luminara regained consciousness and wrestled her way out of the zombies' reach. Realizing what they were up against, she contacted Kenobi to warn him not to come after her, but was cut off as the zombies overwhelmed her. The Jedi disregarded her warnings and continued their search until they came upon Karina's abode, where they found Luminara in an energy trap for her to be infested with brain worms. Kenobi was instantly curious about the brain worms and expressed interest in how it worked, despite Skywalker's statement that Luminara probably didn't want to see how it worked, which she promptly confirmed. Kenobi said that it was better they know more about it, but Luminara quickly disagreed as the worm approached her and was put on her face, prompting her to remark that she sincerely hoped it was part of the plan. At that point, the clones and Jedi sprung into action. With Kenobi and Commander Cody delaying the zombies and the Queen, Skywalker freed Unduli and the two captured Poggle. Cody and his troops shot down the cave support, burying the Queen and taking Poggle prisoner."}, {"tag": "h4", "text": "Battle of Nadiem"}, {"tag": "p", "text": "Five months after the Battle of Geonosis, Luminara Unduli would fight against General Grievous on the pastoral Republic world Nadiem in the Outer Rim. She was tasked with evacuating a city under threat from General Grievous's approaching droid army, she dispatched a strike team under her Padawan's command to Threadneedle Canyon, a strategic choke point between the city and the Separatist column."}, {"tag": "p", "text": "She had ordered her Padawan to attempt to set off explosives to block the droid army's path, but Offee, mindful of Unduli's lessons in hiding in plain sight, decided to play dead as the droid army walked past, and then attack them from the rear. Unduli's strike team set off their explosives while the droid army was crossing through the canyon, destroying the column entirely. General Grievous' remaining forces were eventually defeated, though Grievous himself escaped Unduli, her army and a blockading naval force commanded by Master Saesee Tiin."}, {"tag": "h4", "text": "Parting with Offee"}, {"tag": "p", "text": "Soon after departing from Nadiem, Unduli and her Padawan at last parted ways. Offee had grown much as a Jedi under her instruction, and had little still to learn from her. Following a similar mission on Drongar, Offee ascended to the rank of Jedi Knight, and they saw little of each other for the remainder of the war."}, {"tag": "h4", "text": "Battle of Kashyyyk"}, {"tag": "p", "text": "Unduli was one of several Jedi generals dispatched to the Wookiee homeworld of Kashyyyk during the Outer Rim Sieges to defend the vital Republic member world from Separatist attack. The Confederacy of Independent Systems desired secret hyperspace routes recorded in the Wookiee archives that could possibly turn the war in its favor, and was threatening to overrun the planet."}, {"tag": "p", "text": "Unduli commanded the first units of the Grand Army to land on the Wookiee homeworld, including the 41st Elite Corps, led by Commander Gree. She was quickly joined by units commanded by Master Quinlan Vos and Commander Faie. Alongside sparse members of their respective clone army divisions, Luminara and Vos, as well as Wookiees led by an elder from the Palsaang tribe, Gumbaeki, infiltrated an encampment of Trandoshans, using the Separatist raiding party as an excuse to capture and enslave Wookiees. They easily and swiftly destroyed the encampment and freed the hairy simians, but an ambushing crab droid pinned down the small force until the Devaronian smuggler, Vilmarh Grahrk, a friend of Master Vos, and his young Wookiee friend, Gumbaeki's grandson, Chak, intervened by firing on the droid with their small ship's weapons."}, {"tag": "p", "text": "By the time the primary droid assault was launched, Unduli and Vos had returned to the Republic command base at Kachirho, where they had been joined by Master Yoda. Unduli's 41st Elite and detachments of the 501st Legion, supported by Wookiees, were assigned to fight on the beachfront defending the sea wall and to hold the line until Separatist forces were fully committed. When the droid army committed in full, Yoda gave the word to Unduli to charge the left flank of the droid army. Simultaneously, Quinlan Vos, alongside Chewbacca and Tarfful, was sent across the lagoon to lead an attack on approaching Separatist forces."}, {"tag": "p", "text": "The battle seemed to go back and forth until, despite the best efforts of the combined Wookiee/Grand Army of the Republic defense, Kachirho became in danger of being overrun by the Separatists. The 501st Legion was beaten back by Separatist forces, which advanced on the Kachirho seawall in an attempt to destroy a crucial oil refinery. The best efforts of Unduli's soldiers managed to keep the sea wall intact until Master Yoda could arrive to push the Confederacy back. With the foiling of this crucial mission, the droid army began to retreat. Unduli turned to the healing of wounded clone troopers and Wookiees as the battle neared its end."}, {"tag": "h3", "text": "Order 66"}, {"tag": "p", "text": "After the battle dwindled on Kashyyyk, Unduli was surrounded by her troops as she was initiating clean up procedures. While preparing to assist in the healing of the wounded, Contingency Order 66 was transmitted to the clone troopers under her command directly from the Office of the Supreme Chancellor. Unaware of her imminent danger, Unduli could not even draw her lightsaber before being shot in the chest by the troopers led by Commander Faie."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "When the Galactic Empire emerged, efforts were made to cover up the actual reasons of Unduli's death to boost up anti-Jedi propaganda. These official records, compiled by Sate Pestage, stated that Master Unduli was executed after she was discovered to be the leader of a conspiracy that plotted to overthrow the Republic. The actual reasons were never made public, but only the newly crowned Emperor Palpatine knew of Unduli's true reasons for her death."}, {"tag": "p", "text": "Eight months after the execution of Order 66, the Wookiee Chak created a memorial to the Jedi lost on Kashyyyk in one of the high caves. Her image stood above that of Quinlan Vos and adjacent to Master Yoda's."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Luminara Unduli was calm and patient, and her former Padawan, Barriss Offee, noted that she was a skilled teacher. Master Unduli sometimes scolded people but rarely actually lost her temper with them. She was confident in her abilities, but this confidence became overconfidence when she fought Asajj Ventress and almost cost her life. Unduli was grateful to Ahsoka Tano for saving her from Ventress and told her she owed the Padawan her life. Quinlan Vos thought that she was one of few Jedi to easily connect with and she complemented her companions during battle."}, {"tag": "p", "text": "Unduli greatly cared for her apprentice, Barriss Offee, nevertheless she maintained a very professional relationship with her. Keeping in mind the Jedi sense of detachment, Unduli was prepared to let go of Offee in the event of her possible death. She was also gifted with a sense of humour, as she stifled a snort of laughter at Anakin Skywalker's \"simple logic\" during the Second Battle of Geonosis."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Trained as a Guardian, Luminara Unduli possessed power that very few Jedi were able to overcome. She had amazing lightsaber skills, as she was a master of Form III and had some skill in Form V, both of which were very difficult to breach. Not only were her lightsaber skills superb, but she had also trained herself to become so incredibly flexible that she could easily twist to evade almost any attack that she did not block with her green lightsaber. These skills were often flawlessly used in tandem with her apprentice, Offee, who had long studied at her side. Master Unduli proved capable of holding her own in a duel against famed Dark Jedi Asajj Ventress, even with impaired eyesight; an impressive feat, considering Ventress was known for defeating and killing several uninjured Jedi. Unduli also proved to be a very skilled unarmed combatant as she defended herself against the undead Geonosians. When she lost her saber, she punched, kicked, and impaled them, all while handcuffed. She was also skilled enough to recognize Form II when it was applied against her by Ventress. Unduli was also familiar with Dun Moch, shown when she taunted Ventress by insulting her version of Makashi as lacking refinement, though this nearly resulted in her death when an enraged Ventress attacked her."}, {"tag": "p", "text": "Though Unduli focused mainly on her dueling skills, she was by no means lacking in strength with the Force. She was a master of using the Force to augment her bodies physical capabilities; being able to perform impressive acrobatics, leap huge heights and distances and run with incredible agility. Unduli's danger sense was also quite powerful, as she demonstrated aboard the Tranquility. During her duel with Ventress, Luminara demonstrated skill with telekinesis, using the Force to hurl debris at her enemy often. Indeed, Unduli's control of the Force push ability proved the equal of Ventress' as neither was able to overpower the other while simultaneously using the power. In addition, she was known to strike an opponent with the blunt pommel of her lightsaber. Unfortunately, despite her undoubted skill and abilities, she was unable to escape the execution of Order 66 and was murdered by Commander Faie before she could defend herself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Luminara Unduli was played by Mary Oyaya in Attack of the Clones and Fay David in Revenge of the Sith (although Oyaya's likeness remains the most commonly used in other media). A third performer is also known to have played the character at some point during the production of these films. She was voiced by Cree Summer in the 2003 Star Wars: Clone Wars cartoon, by Lori Tritel in the The Clone Wars video game and by Olivia d'Abo in Star Wars: The Clone Wars."}, {"tag": "p", "text": "The New Essential Guide to Characters and The Approaching Storm mistakenly identify Unduli as Human. Though Mirialans are near-Human, they are not part of the Human species. She is also called a Jedi Knight throughout The Approaching Storm, a designation which, while technically correct, ignores her distinction of Jedi Master, which she had earned sometime before Cloak of Deception."}, {"tag": "p", "text": "Attack of the Clones: The Visual Dictionary states that her headdress conceals extra-sensory organs sensitive to dryness."}, {"tag": "p", "text": "In the PSP, PS2 and Wii versions of Star Wars: The Force Unleashed, all lightsaber crystals can be unlocked by entering LUMINARA as a cheat code."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}