{"url": "Lumiya", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Semi-protected articles", "Category:Banite Sith", "Category:Coruscanti", "Category:Cyborgs", "Category:Dark Lords of the Sith", "Category:Emperor's Hands", "Category:Females", "Category:Galactic Alliance Guard personnel", "Category:Humans", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Jedi hunters", "Category:Martial artists", "Category:Rebel Force-sensitives", "Category:Rogue Squadron personnel", "Category:Sith Lords of Lumiya's Sith", "Category:Sith Masters", "Category:Torturers and interrogators"], "nodes": [{"tag": "h1", "text": "Lumiya"}, {"tag": "p", "text": "Lumiya, born Shira Elan Colla Brie, was a Force-sensitive Human female who went from being an agent of the Galactic Empire to Dark Lady of the Sith. Born on Imperial Center during the height of Galactic Emperor Palpatine's reign over the majority of the galaxy, Brie dedicated herself to the tenets of the Imperial New Order doctrine. This garnered the interest of Palpatine's chief enforcer, the Sith Lord Darth Vader, who sped the young woman's advancement in various Imperial-sponsored programs, including her enrollment into the Intelligence Academy of Carida. After she graduated with top honors and was promoted to the rank of major by Vader himself, Brie was given a highly classified mission to infiltrate the Rebel Alliance and either cause the death or ostracism of Rebel hero and Jedi Luke Skywalker amongst his peers. Brie achieved the latter, but the events that ended in Skywalker's disgrace also left her horribly disfigured and near death. She was recovered by Darth Vader, who rehabilitated her with cybernetic replacements much like his own. Brie then began to train in the dark side of the Force at the feet of Vader under the assumed identity of Lumiya, Dark Lady of the Sith."}, {"tag": "p", "text": "While Lumiya studied in secret as Lord Vader's Shadow Hand, she also served as one of the Emperor's Hands—Force-trained assassins who answered to Palpatine himself. She embarked on a pilgrimage to the world of Ziost, during which she crafted her own lightwhip. While on that sojourn, however, both Palpatine and Darth Vader perished in battle at Endor, and as the foremost of their pupils despite her incomplete training, she defaulted to Mistress of the Sith. Purpose-driven toward vengeance against Luke Skywalker and the Alliance for the deaths of her Sith Masters, she apprenticed an ex-stormtrooper named Flint and lent support to the extra-galactic Nagai species' war against their mortal Tof enemies. The Sith Lady suffered a critical defeat early in her campaign, the damage from which required replacement of her armor, and saw the debut of a triangular headdress that, along with her lightwhip, henceforth became her trademark. She continued to aid the Nagai, during which time she confronted and ultimately lost to her sworn enemy, Jedi Knight Luke Skywalker. As the Nagai–Tof War commenced, however, the Dark Lady escaped Skywalker's custody, with promises of mayhem for him when next they met. She subsequently ended her partnership with the Nagai in favor of the Tof opposition, but their swift defeat by the unified forces of the Alliance, Empire, and Nagai signified the end of the war. Thought by the majority of the galaxy to be dead, Lumiya retreated to the Outer Rim with retribution ever on her mind."}, {"tag": "p", "text": "While in hiding, the Dark Lady prepared a fleet in preparation for a strike against the New Republic, the successor government to the Rebel Alliance. She once again worked closely with Imperial Intelligence and took the second of her apprentices, former Imperial Royal Guardsman Carnor Jax, after the mysterious death of her first. Together Lumiya and Jax eliminated the last vestiges of the Prophets of the Dark Side cult. She then charged him with the infiltration of the Imperial Ruling Council in anticipation of a threat to her Sith Order, while she herself brokered for additional assets with Imperial Regent Ysanne Isard. However, Jax's own nascent ambitions led him into an ill-conceived attempt at betrayal against Lumiya, and another former Royal Guardsman, Kir Kanos, killed Jax, leaving the Dark Lady once again without an apprentice. She returned to the planet Korriban to plot strategy and, in possession of the ancient Sith oracle stone artifact, continued to monitor galactic events from afar. By 25 ABY, though, Lumiya had abandoned the Outer Rim in favor of the former asteroid dwelling of the ancient Sith Lord Vectivus, where she mastered the creation of his dark side–empowered Force phantoms. That same year, she considered an invitation by a new order of Sith on Korriban, who sought to bring the Dark Lady into their fold, but was delayed en route by advance scouts of the extra-galactic Yuuzhan Vong race on the eve of their galactic invasion. She eluded capture and attempted to undermine the Yuuzhan Vong offensive in her own way from the shadows."}, {"tag": "p", "text": "As the galaxy descended further into chaos, Lumiya came to believe that only the supreme will of a Dark Lord of the Sith could impose order and stability. It was while cultivating such beliefs that she met the Fosh ex-Jedi–turned–Sith Vergere, and through the latter's superior knowledge, Lumiya's training was complete. Together they conspired to restore peace to the galaxy through the creation and ascension of the next Sith Lord. Lumiya ignored a second offer of alliance from those on Korriban, as Lumiya and Vergere contrived to bring the Skywalker family's Sith legacy full circle through Jacen Solo, the grandson of Darth Vader. She and Vergere facilitated Solo's capture by the Yuuzhan Vong, to whom Vergere had ingratiated herself, and the Fosh began the training that Lumiya would eventually finish. Vergere died three years into the Yuuzhan Vong War with her role in the affair complete, but another twelve passed before Lumiya was prepared to uphold her end of the bargain. In 40 ABY, she enacted her plan to beguile Solo against the backdrop of a new war, one consequent of her clandestine instigation, by aggravating the already tepid relationship between the Galactic Federation of Free Alliances and the Corellian system's Five Worlds government. An orchestrated series of events led Solo to Lumiya's home, which resulted in his agreement to take up the way of the Sith. For months she trained him, while continuing her secret manipulations of Corellia's separatist movement and enlisting the services of the Twi'lek darksider Alema Rar in the process. Lumiya then revealed herself to the Jedi and maneuvered their determination to eliminate her into a distraction from Jacen Solo's utter embrace of the dark side as the Sith Lord Darth Caedus. Satisfied that vengeance had been cemented against her enemies, Lumiya surrendered herself to death in combat against her long-time nemesis, Luke Skywalker."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Shira Elan Colla Brie was a Human female born on the planet Coruscant, then known as Imperial Center, at the height of the Galactic Empire. A Force-sensitive, Brie's childhood was spent in the Imperial Palace of Emperor Palpatine. Brie was chosen for adolescent indoctrination via the Commission for the Preservation of the New Order, where she quickly became COMPNOR's premier inductee, and her success there saw her fast-tracked into another similar Imperial program by her superiors. Brie's impressive achievements were noticed by the Emperor's foremost servant, Darth Vader, who recommended Brie for training in the Empire's Imperial Intelligence division. The young woman soon excelled in all aspects of her training and became proficient in nearly all exotic martial arts, from Echani to Noghri Stava. Brie's body was also biologically enhanced with accelerated healing and a maximum increase in her pain threshold; furthermore, her mental faculties were improved by means of mnemonic drug training."}, {"tag": "p", "text": "As part of her training in Imperial Intelligence, Shira Brie was enrolled in the Coruscanti Pilot Institute in 2.5 BBY. As a cadet, the young woman underwent training under Commandant Mogurk. Brie struck up a friendship with her fellow trainee and bunk-mate Cadet Myrette Davani, and she soon rose to the top of the class. Throughout her three years of training, Brie also received instruction under Darth Vader during the night and in utmost secrecy. Although the Sith Lord's tutelage wearied Brie, she was able to maintain her position as the Institute's best cadet. Her time in Imperial training became one of the few instances in the young Force-sensitive's life that she felt that others truly cared for her well-being. She swore an oath of loyalty to the Emperor, to which she attached great importance."}, {"tag": "h3", "text": "Training on Carida"}, {"tag": "p", "text": "Circa 0.5 ABY, Brie's flight school class transferred from Coruscant to Carida for one last year of study at the Imperial Military Academy. There, Brie and her classmates participated in one term of stormtrooper boot camp, followed by a further two terms of strategy, survival, and tactics. As the school's finest pilot, the role of flying the personnel shuttle from Coruscant to the academy fell to Brie. The cadet refused, however, and her superiors instead selected Davani. The class arrived safely at Carida, a high-gravity world, and settled in to prepare for boot camp. The training began with two days of arduous physical conditioning in the barracks, before the cadets were dispatched on a 200-kilometer hike across one of Carida's deserts on the third day. Brie and her classmates were told by the instructors that they could pack however many supplies they wished, but the young woman perceived the exercise's true purpose. She explained to Davani that the instructors were waiting to see if the cadets would foolishly weigh themselves down with extra water and other supplies; any cadet who did would perish on the hike due to the world's high gravity. Equipped with standard supplies only, Brie and Davani completed the hike together—two of only twenty trainees to survive out of two hundred."}, {"tag": "p", "text": "The hikes proved to be a staple of the boot camp training, along with war games and long hours of hypothetical space combat in the flight simulator. Together with Davani, Brie also used simulators to put in extra practice, especially for one upcoming war game against Bantha TIE/LN starfighter training squadron, in which the two cadets would be operating the new \"bug walker\" Mountain Terrain Scout Transports, or MT-STs—the war games at the academy often served as field tests for new technology. Brie's training under Darth Vader, however, continued to take a toll on the young woman's mental state. In 1 ABY, six months into the final year of the military training, the MT-ST war game was carried out. Brie and her fellow cadets were dropped into a mountainous area known as Tarkin's Teeth, some 300 kilometers outside the academy proper. There, they boarded their MT-STs and began the exercise. While the rest of the squad formed a perimeter, Brie and Davani undertook separate reconnaissance missions in their individual walkers. Brie soon encountered the Bantha Squad walkers and opened fire—her vehicle, however, had been fitted with live weapons rather than the training lasers employed by the other cadets."}, {"tag": "p", "text": "In moments, Brie had destroyed twelve MT-STs and killed six cadets, and was in the midst of laughter when Davani arrived. Due to pressure from above, the live weapons were blamed on \"instructor error\" and the deaths passed off as training casualties. Although Davani pressured her to discuss the incident, Brie refused to do so. She trained at the academy during the day and with Vader at night, earning consistent high marks from her military superiors and developing new powers under the Sith Lord's tutelage, which continued to affect her psyche. A short time before 1.5 ABY, to celebrate their upcoming graduation ceremony, Brie and Davani headed out into the local Caridan district on their two-day leave passes. The two cadets began a cantina crawl, heading through several establishments in short order and drinking at each one. At the first bar, Brie used the Force to exert influence over the Caridan bartender so that she and Davani could enjoy certain perks unavailable to regular customers, such as discounted drinks. Four bars later, when a group of Caridans offered to buy the two women a drink, Brie once again made use of her abilities to immobilize one of the Caridans by telekinetically flattening him to the floor."}, {"tag": "p", "text": "Soon after, Shira Brie graduated from the Imperial Academy with top honors, an accolade that had been achieved by no other student as of 3 ABY. Lord Vader granted Brie the rank of a major in Imperial Intelligence. Darth Vader and Director Ysanne Isard of Imperial Intelligence arranged for the young Force-sensitive to be dispatched on a solo mission. Brie proved herself able, and Vader was further encouraged to personally field her as an operative in his attempts to rid himself of the threat of the Rebel Alliance."}, {"tag": "h3", "text": "Imperial double-agent"}, {"tag": "h4", "text": "Joining the Rebellion"}, {"tag": "p", "text": "Following the Empire's devastating loss to the Alliance during the Battle of Yavin, which saw the destruction of the Imperials' first Death Star battlestation, Shira Brie was given a new assignment by Darth Vader: to install herself as a counterspy within the Rebel Alliance with instructions to either cause the death of the individual directly responsible for the Death Star's destruction—Rebel hero Luke Skywalker—or to so severely tarnish his reputation that he would be discredited in the eyes of his fellow rebels. To that end, a plausible backstory was fabricated for Brie, which stated that she was from the city of Chinshassa on the planet Shalyvane. Although the world was home to the Em'liy species, Brie's cover story falsely identified Humans as the native race. The Em'liy were instead cast as oppressors to the Humans who warred with them and destroyed the society to which Brie supposedly belonged, killing her family in the process. According to the cover story, the supposed war between the Humans and the Em'liy lasted for years until the two species cast their differences aside to make peace with one another. All of Shalyvane's natives then gathered together at a shrine called the Circle of Kavaan to solidify their new conciliation under the guidance of alien ambassadors contracted by the Em'liy; they were instead attacked by the offworlders, who massacred all those present. Brie, purportedly a little girl at the time, was able to escape the slaughter and was left to survive into adulthood by her own faculties. Many years passed before she learned the \"truth\" of Shalyvane's sterilization from an intoxicated ex-fighter pilot; the Em'liy had allied with the Empire and also lied to them, claiming that Brie's people were members of the Rebel Alliance. Enraged by the revelation, as the fabrication went, Brie sought out the Alliance and decided to enlist. The verisimilitude of her cover story was bolstered when Darth Vader ordered the razing of Chinshassa, which had previously displayed resistance to Imperial rule. Shalyvane also became the secret location by which Brie reported her progress through a biological process that was activated when her unique blood chemistry came into contact with a transmitter embedded within the Circle of Kavaan."}, {"tag": "h4", "text": "Lieutenant Brie"}, {"tag": "p", "text": "Brie posed as a Shalyvane refugee and successfully infiltrated the Alliance, due in part to their immediate need for fighter pilots in the wake of the disastrous Battle of Hoth. Brie eventually earned the rank of lieutenant and engaged in several rebellion sorties, including work alongside fellow Force-sensitive Rebels Kyle Katarn, Corwin Shelvay, and Erling Tredway on a mission to D'rinba IV to disable the superlaser of the second Death Star."}, {"tag": "p", "text": "Brie was next assigned to Rogue starfighter squadron and was stationed at Haven Base on the planet Arbra, during which time she met and befriended her superior, flight commander Luke Skywalker. When Brie volunteered to accompany Skywalker on a mission to Bespin's Cloud City in search of his friend Lando Calrissian, her congenial demeanor and obvious affection for him spurred contemptuous feelings from Princess Leia Organa, who had been denied Skywalker's companionship on a reconnaissance drill around Haven Base. Oblivious to Organa's scorn, Brie left with Skywalker for Bespin in an X-wing starfighter as his wingmate. Upon their arrival, Brie noted that Cloud City seemed deserted, and an investigation by Skywalker's astromech droid R2-D2 determined that the installation of a series of bombs within Cloud City's infrastructure had led to the populace's evacuation. However, the bombs had soon thereafter been neutralized by a cyborg and a Human, which Skywalker surmised had probably been Lando Calrissian. Before their investigation could take them any further they were attacked by Hugo Treece, an Imperial governor stationed on Bespin by Darth Vader. They remained pinned under fire from Treece and his squad of stormtroopers until Calrissian's arrival served to distract the Imperial's attention away from Brie and Skywalker. The commander reactivated the bombs through the Force, and the resulting explosion was enough to scare the Imperials into swiftly evacuating Cloud City."}, {"tag": "p", "text": "Upon their return to Arbra, Brie stayed planetside for a time while Skywalker ventured to the Bazarre space station in the Cademimu sector with Calrissian and another Rebel Alliance hero, the Wookiee Chewbacca, to negotiate the sale of four disabled TIE Fighters with weapons dealer Orion Ferret. Brie instead took part in an experiment of Organa's that involved hiding a portion of the Rebel fleet within the primary star of the Arbran system. The expressed reservations of Organa's protocol droid C-3PO about carrying out such a hazardous plan without the presence of Luke Skywalker led Brie to volunteer to act in his stead—a request that was reluctantly granted by the princess."}, {"tag": "h4", "text": "Alliance heroine"}, {"tag": "p", "text": "The deal with Orion Ferret was successful, and Brie was selected alongside as part of Skywalker and two others to test the reconditioned TIE Fighters in actual combat during an assault on the Imperial Spindrift Station on the planet of the same name. Brie's team were mistakes for friendlies by the stationed Imperial forces, who were then captured while in possession of the specific location coordinates of a secret armada under construction by the Empire. With the mission accomplished, Brie and her companions traveled back to Haven Base."}, {"tag": "p", "text": "While Rebel forces deciphered the codes retrieved during the Spindrift mission, Brie requested personal leave to her pseudo-homeworld of Shalyvane, where she planned to secretly submit her annual progress report to Darth Vader. Brie was initially denied the specific spatial coordinates of Arbra, Organa's reason being that such knowledge was privy only to the principle and most trusted members of the Rebel Alliance leadership. However, when Commander Skywalker, who knew the map specs of Arbra, offered to accompany Brie on her pilgrimage, Organa grudgingly granted them permission. They arrived in Brie's false hometown of Chinshassa, and the lieutenant led Skywalker and fellow Rogue pilots Wald and Hanc Thorben to the Circle of Kavaan, a place of great importance to the Shalyvane natives, but also the means by which Brie was to secretly communicate with Vader. Feigning a need to perform a private ritual, Brie approached the monument and discreetly activated the embedded communications transmitter. Her message to Vader was interrupted, however, when Shalyvane's Em'liy natives ambushed the Rebels and forced them into cover. During the ensuing combat, Brie revealed several elements of her false past; that it had been the acts committed against her family and childhood home of Chinshassa by the same natives in allegiance to the Empire that led to her membership with the Rebel Alliance, and that she returned annually to Chinshassa in remembrance of her people's massacre."}, {"tag": "p", "text": "The Rebels were forced to give ground until Skywalker's astromech, R2-D2, discovered a series of underground tunnels previously mentioned by Brie that could potentially serve as an adequate means of escape. Skywalker volunteered to enter the subterranean labyrinth first but lost the opportunity to do so when Brie, who was already familiar with their existence, jumped in before him. The tunnel was then sealed by an explosion caused by the Em'liy, and the rebels, believing that Brie was lost to them, prepared to make a final stand. As the natives closed in, however, they were routed by Brie, who had successfully found and returned with her X-wing to save her comrades. She decimated the Em'liy attackers in a strafing run and afterward met up with her teammates who—especially Skywalker—expressed much relief in knowing that Brie was alive and well. A ceremony was held following their return to Haven Base in the presence of many Rebel Alliance members wherein Brie was recognized for her gallantry during the peril she and her fellow Rogues faced on Shalyvane. The prestigious Burdine Cluster award was presented to the lieutenant along with a promotion to the rank of captain by Organa, who displayed considerable gratitude for the pilot's selfless valor."}, {"tag": "h4", "text": "Mission accomplished"}, {"tag": "p", "text": "Shortly after Brie's commendation, the Rebel Alliance finally discovered the location in space of the Empire's secret armada. They also learned that following the Battle of Hoth, the Empire had captured a teezl, a non-sentient creature with a natural ability to act as a hyperspace communications amplifier. Believed to be extinct, the teezl was under escort of the Imperial armada to Coruscant where it was to be installed and made to serve the Empire as a limitless source of communications energy. The Rebel Alliance was aware of that fact and was determined to thwart the Imperials at all costs. An infiltration mission was developed wherein Brie, as a member of Flying Bantha Squadron alongside Skywalker and pilots Alph and Hanc Thorben, would disguise herself and sabotage the Imperial armada by means of the TIE fighters that had been previously obtained on Bazarre station. Just prior to their departure, Brie related to Skywalker her apprehension about the task set before her, and also made obvious her deep affection for him with a passionate kiss—much to Skywalker's surprise."}, {"tag": "p", "text": "The preliminary phase of the Rebel mission involved the Flying Banthas' interception of a pair of TIE fighters on patrol of the route by which the Imperial armada was to travel. After the two TIEs were shot down and the armada's recognition codes confiscated, the Rebels donned their own recently acquired TIEs and prepared to infiltrate the amassed enemy ships. The successful transmission of the recognition codes allowed for a seamless and unsuspected insertion of Brie's team into the ranks of the Imperial fleet, and once each of the Flying Banthas had assumed an adequate vantage point, the attacks commenced. The Imperials were confused by what seemed to be friendly fighters engaging in wanton destruction and quickly deduced that Rebel forces had penetrated their ranks with fraudulent fighters. In response, Admiral Mils Giel ordered for the teezl to cause interference on all communication frequencies except the Imperial war band with a psychic shriek in an attempt to expose the enemy forces. With no other means of communication between herself and her team, Brie seized an opportunity to complete the assignment she was originally given by Vader. Capitalizing on the forced comm silence, Brie maneuvered her TIE fighter directly into Skywalker's line of fire; with only the Force to guide him in the determination of friend from foe, Skywalker landed a direct hit that seemingly destroyed Brie's fighter. His assault also resulted in the death of the teezl and the effective end of the battle. Skywalker's return to Haven Base was met with somber greetings; he was immediately debriefed by Organa and a holocam recording from Thorben's TIE revealed that the fighter which Skywalker had shot down was not one of an enemy, but that of Captain Shira Brie. Though she had been unable to kill him, Brie's Imperial mission was a total success; Skywalker had been absolutely disgraced in the eyes of his fellow Rebels for her apparent death, and he was riddled with guilt over an error in judgment that resulted in the evident demise of both an Alliance champion and the woman for whom he had developed strong feelings. He was initially stripped of his Alliance commission, but he was later exonerated after he infiltrated the Empire-operated Krake Data Vault on Krake's Planet and discovered records that detailed the nature of Brie's true Imperial allegiance."}, {"tag": "h3", "text": "Rebirth"}, {"tag": "h4", "text": "\"Hands\""}, {"tag": "p", "text": "No longer a captain in the Rebel Alliance, Major Shira Brie of Imperial Intelligence had completed her assignment, but had suffered grievous physical injuries in the process; left adrift in her ruined TIE fighter, she could only struggle for life. Brie would have died alone in the starfighter, but the modifications made to her body during her Imperial training as well as her facility with healing and hibernation trances helped her survive the hard vacuum of space. She was discovered by Darth Vader and returned to his flagship, the Super Star Destroyer Executor, for rehabilitation, where it was determined that extensive science and cybernetics were required to save her life. The mechanical implants further enhanced Brie's body, although ultimately she was left more machine than woman. After she had been restored, Brie began to learn the ways of the Sith as Vader's Shadow Hand. Shira Brie had become Lumiya."}, {"tag": "p", "text": "Although Lumiya served the Dark Lord of the Sith, Vader was himself bound to the Rule of Two, a Sith prohibition that forbade him to take an official student of his own so long as he remained under the tutelage of his Sith Master, Emperor Palpatine. In 4 ABY, Vader brought his secret apprentice Lumiya before Palpatine. Upon their arrival at the Imperial Palace, they interrupted a meeting between Palpatine and another of his personal assassins, Mara Jade. The women crossed paths with immediate and intense animosity toward one another. Jade departed, and Lumiya was ushered into Palpatine's presence, presented by Darth Vader for consideration as an Emperor's Hand—secret agents of the Emperor whose sole purpose was to bring his will to fruition. Palpatine accepted Lumiya into his service and allowed her to continue training under Darth Vader."}, {"tag": "p", "text": "Lumiya soon thereafter was sequestered by Darth Vader on Ziost, the ancient homeworld of the Sith species. There she discovered an archaic Sith tome that detailed the process required to craft a lightwhip; a rare weapon similar to but more difficult to master than the traditional lightsaber, the lightwhip possessed a flexible energy beam in lieu of a steady blade. With such ancient knowledge, she created a unique device with a hilt of nearly indestructible Mandalorian iron from which many extensions spewed forth. Shards of Kaiburr crystal given to her by Darth Vader provided the power source for the strands of energy, while tendrils of metal and others of studded leather complemented the pliant beams of plasma to make a one-of-a-kind and deadly flail. Her final test as the Dark Lord's pupil was finally complete, but Lumiya was on Ziost when the Empire suffered a pivotal defeat over Endor at the hands of the Rebel Alliance. She returned to Imperial space and discovered that not only had the Alliance successfully toppled the Emperor, but both he and Vader had perished in the destruction of the second Death Star."}, {"tag": "h4", "text": "Dark Lady"}, {"tag": "p", "text": "With no one left to further her Sith knowledge, Lumiya proclaimed herself Dark Lady of the Sith and embarked on her own quest to progress in dark side wisdom, going first to the planet Nyssa in search of the Mecrosa Order, an organization with a historic allegiance to the ways of the Sith. Known to be in possession of many ancient secrets and artifacts, the Order's members felt a sense of obligation to Lumiya, whom they felt bore an unnerving resemblance to the late Darth Vader. She was given access to all of the Mecrosa's relics, and she was even allowed to take from them possession of the oldest of Sith holocrons—that of the legendary Sith'ari Adas."}, {"tag": "p", "text": "Shortly after the Battle of Endor, Lumiya amassed a naval fleet of Imperial starships in her efforts to consolidate power in preparation for retaliation against the Rebel Alliance. Her armada included three Imperial-class Star Destroyers, two EF76 Nebulon-B escort frigates, and four CR90 Corellian Corvettes. More than two hundred TIE/LN starfighters and TIE/sa bombers completed the fleet and were divided into several squads amongst the Star Destroyers, frigates, and one of the corvettes. The details of the fragmentation of the Empire were still unclear to many Imperial servicemen, and Lumiya sought to keep the truth hidden by depriving her subordinates of certain information, thus ensuring their complete loyalty to her and the endeavors she undertook. While in Sith space, Lumiya's fleet came into contact with a vanguard representing an extra-galactic, spacefaring species, the Nagai. The commander of the force hailed her flagship, the escort frigate Revenant, under the impression that an officer of the Imperial Navy would respond; instead, Lumiya answered. The Dark Lady learned that she shared a common enemy with the Nagai in the Rebel Alliance, and she promised the support of her resources to the invaders upon proposition of a united front."}, {"tag": "h4", "text": "Events on Herdessa"}, {"tag": "p", "text": "Under instruction from the Nagai, Lumiya set out to take action against the Alliance of Free Planets, the fledgling successor state to the Rebel Alliance. She went to the Mid Rim world of Herdessa, where she installed herself as the head of planetary security on behalf of the planet's oppressive leadership, the Herdessan Guild. Lumiya organized a Guild-sanctioned slaving ring which targeted the planet's lower-class citizens for transport off-world. However, the arrival on Herdessa of Alliance delegates Mon Mothma and Leia Organa, who promised to guarantee civil rights for the planet's citizens under the new galactic government, threatened Lumiya's covert operation. Wearing the face of benevolence, the Dark Lady and a squad of Herdessan shocktroopers apprehended several hecklers after Organa was pummeled with mud. Lumiya located the culprit, a woman named Suzu, in guild sector three and aggressively arrested her, but was interrupted by Organa—whose intervention on Suzu's behalf resulted in the woman's escape. Enraged, Lumiya attacked the princess but was betrayed by her own cumbersome cybernetic enhancements, which saw her quickly bested and slammed to the ground by Organa. As the princess fled after Suzu, the humiliated Lumiya vowed to deal with both women."}, {"tag": "p", "text": "Lumiya and her shocktroopers tracked Organa to Suzu's hideout and forcefully demanded their surrender. Organa was able to escape the firefight that ensued, and Lumiya chased her for a time before abandoning pursuit, instead choosing to round up all the Herdessan rebels in the city center for a public declaration that unless Organa was turned over to the custody of the Herdessan Guild, executions would commence. Imperial stormtroopers assisted the Herdessan shocktroopers in Lumiya's tyranny and even apprehended Organa's companion, Mon Mothma, who was counted among the nonconformists. An altercation erupted between one of the prisoners and a stormtrooper, and Lumiya decided that the prisoner would be the first to die. Suzu then conceded to Lumiya's demands and betrayed Organa's whereabouts to the authorities, but it was all a ruse; Organa instead appeared behind Lumiya and incapacitated her with several blaster shots before she eliminated the shocktroopers, freed the captives, and led them in a successful revolt against the Herdessan Guild. With her sinister benefactors overthrown and her slave trade dissolved, Lumiya quietly retreated, but not without promises to take revenge on the Alliance—namely Princess Leia Organa—for thwarting her efforts on Herdessa."}, {"tag": "h4", "text": "Upholding tradition"}, {"tag": "p", "text": "Lumiya's cybernetic enhancements had been severely damaged on Herdessa and required extensive repairs. Upon completion, she emerged sporting new armor, and donned for the first time a triangular cloth headdress that, along with her lightwhip, became thenceforth synonymous with her name. Lumiya fully intended to resume her campaign against the Alliance of Free Planets; however, a matter of greater importance that presented a considerable problem manifested itself: the continuation of the Sith. Lumiya reorganized the Order in her own image, but she maintained the core ideals of enduring elusiveness that were fundamental to the previous Order's survival. The ancient \"Rule of Two\" doctrine to which Emperor Palpatine and Darth Vader adhered stated that the power of the dark side could only be divided between two individuals in the entire galaxy at any given time: one Sith Master to personify its power, and a single Sith apprentice to covet it. Lumiya thus began to search for being who was in her eyes worthy of the Sith teachings."}, {"tag": "p", "text": "Though exceptionally strong in the Force in her own right, Lumiya had not been Darth Vader's only pupil. The Dark Lord had several students and intended to eventually pit them against one another for the right to become his true Sith apprentice. After Vader's death Lumiya sought out one of those pupils, a young Force-sensitive stormtrooper named Flint. While he was still alive, Vader had planned for Lumiya and Flint to contend with one another, but the Dark Lord's premature death at Endor left them both without their master. Lumiya located Flint in Vader's abandoned citadel on the planet Vjun, where she confronted him for the position of Sith Master. The Dark Lady's superior strength resulted in the sound defeat of Flint, and she took the Belderone native as her first apprentice."}, {"tag": "p", "text": "Plans were immediately set in motion by the new Sith to undermine all that the Alliance of Free Planets had achieved in the wake of Emperor Palpatine's death. Lumiya tasked her new apprentice with both conquering the Phelleem sector as well as exacting vengeance upon Luke Skywalker for the death of Darth Vader. Styled as the Dark Lord of Belderone, Flint's exploits led him to the planet Naldar where he was confronted by Skywalker and persuaded to forsake his devotion to the dark side of the Force. Lumiya learned of Flint's abdication and promised fatal reprisals when the opportunity presented itself. The Dark Lady had more pressing matters to attend to though, including the continued preparation with the Nagai for war against the Alliance of Free Planets."}, {"tag": "h4", "text": "Nagai–Tof conflict"}, {"tag": "h5", "text": "Laying foundations"}, {"tag": "p", "text": "As stipulated by the partnership Lumiya had previously formed with the Nagai, an attaché was sent to her in the form of Den Siva, with whom she rendezvoused and established an underground base of operations on the desolate planet Kinooine. An Alliance scouting party had recently been dispatched to Kinooine after life-forms had been detected on the otherwise unoccupied world. Lumiya ambushed them and killed all of the team's twenty members save a man named Faron Tolis, whom she spared for interrogation. She accused Tolis of being a member of the former Rebel Alliance, and attempted to torture him into disclosing the whereabouts of Princess Leia Organa, something of which he held no knowledge. Under penalty of death, Faron surprised Lumiya when he revealed that Organa had nothing to do with his team's mission; it had instead been Lumiya's sworn nemesis, Luke Skywalker, who had dispatched them to survey the Outer Rim planetoid."}, {"tag": "p", "text": "Lumiya's abduction of Tolis and company caused Skywalker himself, along with a female Zeltron named Dani and her Chuhkyvi lover Kiro, to journey to Kinooine in search of his missing reconnaissance team. While Dani and Kiro explored the area surrounding their camp, the Dark Lady caught them unawares and brutally attacked them with her lightwhip. Knowing that Skywalker would come for his comrades, Lumiya took Dani captive and, after smashing the faceplate of Kiro's rebreather helmet, left him for dead. Skywalker found Kiro and did not have to search far for the Chuhkyvi's assailant; Lumiya had been waiting for him on a nearby precipice. In a vicious duel, Lumiya unleashed the full fury of her hatred upon Skywalker, whose unfamiliarity with the dual nature of her lightwhip saw him repeatedly lashed, quickly disarmed, and eventually defeated. Lumiya took her enemy as a prisoner to her underground fortress."}, {"tag": "h5", "text": "Identity revealed"}, {"tag": "p", "text": "Meanwhile, several of Den Siva's cohorts, under command of the Nagai warrior Ozrei \"Knife\" N'takkilomandrife, intercepted a gathering of Alliance statesbeings who were scheduled to meet with Princess Organa and General Han Solo in the Mid Rim on the world of Kabray. Lumiya received word of their defeat by Organa's Zeltron escorts, but she was more concerned with the progress of the main invasion fleet and left to further prepare for their arrival. In her absence, Kiro infiltrated her underground lair and rescued Skywalker. Lumiya, who had taken up position above ground on a cliff edge, was completely surprised when the pair appeared on the crag behind her and was unable to prevent Skywalker from telekinetically reclaiming his lightsaber from her possession. Not to be deterred, Lumiya prepared to face him in combat yet again, but she failed to properly assess the significant change in circumstances; in addition to his usual weapon, Skywalker had armed himself with a lightsaber with a shorter blade, known as a shoto. Lumiya's weapon was no match for the conjunct assault of Skywalker's two sabers, which were able to counter the duality of her lightwhip's tendrils. She charged her opponent in a fit of rage after being disarmed, only to be stripped of enough armor that her face was exposed and her true identity as Shira Brie was revealed."}, {"tag": "p", "text": "The humiliated Sith Lady begged for death and blamed Skywalker for the tragedies that had befallen her thus far in life; even in defeat, she vowed that her vengeance would only be sated when Skywalker himself was dead. The Jedi attempted to reconcile the differences between them but was cut short when the Nagai fleet—for whom Lumiya had been waiting—dropped out of hyperspace into Kinooine's atmosphere. While Nagai forces descended to the planet's surface, Lumiya was bound by Skywalker and Kiro, who held her captive as they prepared themselves to rescue Dani. The rescue mission was successful, and Lumiya was abandoned by Skywalker and his companions, who were forced to flee Kinooine as the Nagai continued to swarm the planet."}, {"tag": "h5", "text": "Second battle of Endor"}, {"tag": "p", "text": "After the Nagai established a sufficient operational platform on Kinooine, they installed a double-agent among the Alliance forces in the form of the Human–Nagai hybrid Bey, who provided Alliance logistics, battle schematics, and ship formations to his kinsmen. Armed with that knowledge, Lumiya reemerged as flight leader of the Nagai's Twelfth Squadron in battle over the forest moon of Endor, the same location where both Emperor Palpatine and Darth Vader had perished nearly a month earlier. The Nagai also gave Lumiya one of their unique starfighters for her own personal use; she dubbed the craft Screamer after the teezl which had perished during battle with the secret Imperial armada. With the intelligence provided by Bey, the Dark Lady led Twelfth Squadron in a dogfight against the Alliance's Gold Squadron under the leadership of her former Rebel comrade Lando Calrissian, and Mandalore Fenn Shysa's Resurrector Squadron. Severe damage was dealt to the Alliance forces over Endor, and members of their wardroom contemplated retreat. Under command of Bey's half-brother Knife and Lieutenant Hol B'shaki, the Nagai prepared to execute coordinated strikes against several Alliance installations on Endor's surface while Twelfth Squadron made short work of the Alliance's Gold and Resurrector starfighter groups. However, Bey's duplicity was soon discovered by his childhood friend Han Solo, who was also on Endor. The Alliance fought and ultimately defeated the ground-side opposition's ambuscade, and both Gold and Resurrector Squadrons were ordered to forsake their original battle strategies; the sudden change in tactics had a detrimental impact on what seemed like Lumiya's precognitive advantage, and the tide was no longer in her favor. With the battle of Endor effectively lost to the Alliance on both fronts, Lumiya ordered a full retreat of the Nagai forces."}, {"tag": "h5", "text": "Changing sides"}, {"tag": "p", "text": "The Nagai defeat over Endor was the beginning of a turning point in both the war and the end of Lumiya's relationship with the invaders. The Tofs, enemies of the Nagai from their native galaxy, followed their rivals and defeated them in battle on the planet Trenwyth. What began as a Nagai invasion of Zeltros during a diplomatic rendezvous with the Alliance quickly turned into another battle that saw the Nagai join forces with the Alliance to face their new common foe, the Tofs. As a result, Lumiya renounced her partnership with the Nagai in favor of the Tofs. She met with their leader, Prince Sereno, at the Tof stronghold on Saijo to discuss the terms of their partnership. Unbeknownst to them was the presence of the Nagai–Alliance coalition on Saijo, which ambushed Lumiya and Sereno as they conversed. Lumiya quickly shot down the leader of the attack, Knife, but she was prevented from killing him by Organa. The Dark Lady turned her wrath on the princess, but Lumiya was shot and completely incapacitated by Bey, who had infiltrated the Tof ranks by disguising himself as a member of their species. The battle of Saijo soon came to an end with the capture of Prince Sereno. Lumiya was thought to have perished in the altercation, but had in fact survived, albeit with injuries, and slipped away unnoticed in the midst of the commotion."}, {"tag": "h4", "text": "Imperial allies"}, {"tag": "h5", "text": "Epsilon Nine"}, {"tag": "p", "text": "Despite her best efforts, Lumiya's plan to manipulate the Nagai–Tof war as a weapon against the Alliance of Free Planets resulted in utter failure. She recovered from the injuries received during the battle on Saijo, but her fleet had been left in shambles. Thus the Dark Lady sought her former Imperial Intelligence superior Ysanne Isard, who had taken stewardship over the remnants of the Galactic Empire, to access sufficient resources to replenish her depleted forces. Isard considered Lumiya a threat to her dominion, and the Imperial stewardess surmised that compliance with the Lady of the Sith's demands would eliminate any potential problems that might arise between them. She allocated two TIE fighter squadrons, Alpha and Theta, for Lumiya, as well as four platoons of stormtroopers—two of which were elite red-armored Royal Guards who had personally served in the defense of the late Emperor Palpatine. Isard's succor was not without conditions, however; in exchange for support, she asked Lumiya to inspect several top-secret Imperial research installations hidden within the Cron Drift."}, {"tag": "p", "text": "The Nebulon-B escort frigate Revenant served as Lumiya's command ship as she led her fleet to the Auril sector. Upon their arrival, she discovered that those working on the asteroid-based Epsilon Nine Communications Research Station had attempted to cast aside their Imperial mandate in favor of joining the recently-reorganized New Republic as evidenced by the reconfiguration of the station's comlink system to transmit on New Republic wavelengths. The emergence of nine T-65 X-wing starfighters from Epsilon Nine served to excite the Revenant's crew, who wondered how the New Republic had become aware of the installation's secret location within the Cron Drift; however, Lumiya was aware of the facts beforehand, and she ordered her fleet to engage the Republic forces as the Imperial forces approached the asteroid base."}, {"tag": "p", "text": "Assault shuttles launched from Lumiya's CR90 corvette, Wolf-Pack, and landed on the surface of Epsilon Nine's asteroid location to pave an opening into the base, while the remainder of her fleet dispatched the enemy X-wings and base defenses. Lumiya then went from the Revenant to the asteroid in her personal Lambda-class T-4a shuttle and entered the base, prepared to make an example of those inside. Her stormtroopers rounded up all the scientists for interrogation, and one indignant individual was immediately executed by the Dark Lady—his throat Force-crushed in response to a snide remark. Lumiya then made certain that the base staff recommitted themselves to Imperial service, and ordered a garrison to occupy the station to further ensure their cooperation. Before she departed the Cron Drift with the remainder of her fleet, Lumiya vowed to return in eight weeks to make certain her will remained uncontested."}, {"tag": "h5", "text": "Return of the Emperor"}, {"tag": "p", "text": "The Sith had become imperiled in the wake of Flint's perfidy and subsequent defection. A new prospect arose, however, in the form of a Force-sensitive Royal Guard named Carnor Jax, one whom Lumiya had come across amongst those allotted to her by Ysanne Isard. The Dark Lady took Jax as her new apprentice and, though his training was abbreviated, the Sith lived on. One of their first missions together was to the planet Bosthirda, where they completed the purge of the remaining Prophets of the Dark Side cult, a task previously undertaken but left uncompleted by the dejected Dark Jedi Azrakel."}, {"tag": "p", "text": "With her mission to Epsilon Nine complete, Lumiya began to fulfill Isard's second request: locating and returning the rogue Emperor's Hand Mara Jade to service under Isard. While she readied herself to hunt Jade, Lumiya ordered Jax to infiltrate the upper echelons of the Galactic Empire in preparation for any potential threats to the Sith. She meanwhile journeyed to the planet Caprioril, where she learned that Jade, under the assumed identity of \"Marellis,\" had gone underground as a starport hustler for a swoop gang. Lumiya located Jade and attempted to persuade her to come back into the Imperial fold, a petition that Jade refused. A duel resulted, in which Jade escaped. The Dark Lady chose not to report her failure to Isard, which led the Empire to conclude that her confrontation with Jade had somehow resulted in Lumiya's demise—a position that thus brought the Empire into agreement with the New Republic, which had maintained that Lumiya had perished at the end of the Nagai–Tof conflict."}, {"tag": "p", "text": "Through Jax's own machinations, the Dark Lady's apprentice began to secretly manipulate the Empire's ruling council. During that time, Lumiya received word from Jax that he had been approached by a mysterious individual known as Nom Anor, who represented an extra-galactic race of wayfarers interested in an alliance with her against their common enemy, the New Republic. The threat to the Sith of which Lumiya spoke also manifested itself at that time, in the form of the return of Emperor Palpatine. However, his resumed reign was brief; the clone bodies he had used to facilitate his resurrection had been sabotaged by Imperial physicians, which was the catalyst for his final death on the planet Onderon less than a year later. Carnor Jax immediately attempted to install himself as the new Emperor, but his dynasty was short-lived. After requesting audience with Lumiya in an attempt to lure her into a trap, Jax was killed in a duel by another one of Palpatine's former Royal Guardsmen, Kir Kanos. Jax's links to Anor were lost upon his death on Yinchorr, and Lumiya was unable to respond to Anor's initial advances. Three years after Jax's death, Lumiya's original apprentice, Flint, was found dead on his homeworld of Belderone. Deciding to withdraw from the forefront of galactic events, Lumiya took up residence on the planet Korriban, where she began to plot her next course of action. She continued to study Adas' holocron and used the ancient Sith oracle stone to keep an eye on the galaxy from a distance."}, {"tag": "h3", "text": "Striking from the shadows"}, {"tag": "h4", "text": "Invitation to the New Order"}, {"tag": "p", "text": "In 25 ABY, the galaxy was invaded by the Yuuzhan Vong Empire, whose advance agent Nom Anor had attempted to solicit Lumiya through Carnor Jax fourteen years prior. The New Republic suffered heavy losses in the opening months of the war to the Yuuzhan Vong, who annihilated nearly all opposition to their planned conversion of the galaxy into a biotechnological empire reminiscent of their own. That same year, Lumiya learned that although she was without an apprentice to continue the legacy of the dark side, she was not alone in its practice; a former Jedi of the Old Republic named A'Sharad Hett had been a student of Sith teaching prior to his capture by Yuuzhan Vong scouts in the Unknown Regions. While in captivity, he was approached by a Yuuzhan Vong agent named Vergere who, like Hett, was also an Old Republic Jedi–turned–Sith. The Fosh ex-Jedi imparted her own knowledge to Hett, who believed that in order to restore stability in the galaxy, the Sith needed to abandon the Rule of Two and instead adopt a Rule of One—a new axiom of many Sith who operated as a single unit."}, {"tag": "p", "text": "Vergere, a staunch adherent to Darth Bane's ancient principle, rejected Hett's idea and left him to the mercy of the Yuuzhan Vong. Hett eventually escaped captivity and returned to Korriban, where he assumed the mantle of Dark Lord, with the new name Darth Krayt, and founded his One Sith. The attention of the One Sith had fallen upon Lumiya, and she was invited by Krayt to consort with them on their namesake's ancestral homeworld. An escort for the Dark Lady was sent in the form of the Sith Master Lomi Plo and her apprentice Welk, but on the return journey, they were forestalled by the Yuuzhan Vong. Although her chaperons were captured by the invaders, Lumiya was not, and escaped to plot her next course of action."}, {"tag": "p", "text": "Lumiya then decided to strike against the Yuuzhan Vong. The New Republic suffered a defeat at Ithor in 25 ABY when Yuuzhan Vong forces laid waste to the planet. They had discovered that the pollen of Ithor's native Bafforr trees was lethal to the living armor worn by Yuuzhan Vong warriors. The New Republic had allied with the Imperial Remnant to defend the world and its valuable military asset, but to no avail. Determined to secure a sample of the now rare Bafforr pollen, Lumiya elected to strike at Yaga Minor, a fortified Imperial Remnant world that housed some of the last Bafforr pollen in the galaxy. The Sith Lady went planetside and sneaked into the laboratory where the samples were located, but she was confronted there by a band of Yuuzhan Vong who had infiltrated the facility themselves and destroyed its large munitions dump."}, {"tag": "h4", "text": "A plan for the galaxy"}, {"tag": "p", "text": "Several months later, Lumiya met Vergere. The Fosh explained her own Sith origins under Darth Sidious, and how she had encountered A'Sharad Hett—now Darth Krayt—who favored an Order of many Sith unified in the power of the dark side of the Force. During her time with Vergere, Lumiya completed the Sith training she had begun so long ago under Darth Vader, and she finally achieved full status as Dark Lady of the Sith in both name and wisdom."}, {"tag": "p", "text": "Not long afterward, Lumiya received another invitation from Krayt's agents to align herself with their Order. The message from the spokesman of the One Sith—a man with glowing white eyes—stated that another escort had not been arranged, but directions were provided on the navigation string included with the message should Lumiya decide to answer their summons. Through her time with Vergere, Lumiya had come to believe, however, that the One Sith's methods were too slow; by the time Krayt's Order had moved beyond infancy, Skywalker's Jedi would be too powerful. Unwilling to deviate from the Rule of Two, Lumiya rejected Krayt's idea and accepted Vergere's realization in the folly of Krayt's long-term affair."}, {"tag": "p", "text": "Given a new purpose through the teachings of Vergere, Lumiya retired her own desires in service of a Sith destiny. However, both women knew that neither could restore peace to the galaxy themselves; Lumiya's cybernetic implants limited her Force potential, while Vergere had become tainted by her collaboration with the Yuuzhan Vong. Together they conspired to select a new Sith champion, one who would reign as a benign dictator and impose peace and stability over a tumultuous galaxy so often plagued by war. The question of who would be chosen was one of great importance; many candidates were considered, and many discarded. Kyp Durron, a powerful Jedi Master, was considered too volatile and obstinate, while Lumiya's old rival Mara Jade Skywalker was felt to possess too many attachments. Jaina Solo, the daughter of Leia and Han Solo, was dismissed as too emotional, while Leia Solo herself was bypassed as too fearful of her father Darth Vader's legacy. Even Luke Skywalker was considered, but Lumiya declaimed him too bound in the dogma of Jedi philosophy."}, {"tag": "p", "text": "It was Jacen Solo, the brother of Jaina, who truly stirred their interests. Solo had proven his ability to wield power responsibly through his refusal to fire Centerpoint Station, an ancient space facility capable of unleashing devastating energy beams through hyperspace, against the Yuuzhan Vong, due to his belief that it would be an overly aggressive action. Solo also defeated Warmaster Tsavong Lah of the Yuuzhan Vong in personal combat, a demonstration to Lumiya and Vergere that the young Jedi dispensed power when necessary. Thus, Jacen Solo was selected as the best possible choice; his close relationship with his uncle, Luke Skywalker, however, posed problems. It was therefore decided that Vergere would return to the Yuuzhan Vong and facilitate Solo's capture by the aliens to begin his training without interference. By mid 25 ABY, she made her way back to the Yuuzhan Vong, whereupon she maneuvered her way into the confidence of Tsavong Lah himself. Vergere abducted Solo during a Jedi mission to Myrkr and exploited the young Jedi's isolation in Yuuzhan Vong captivity to begin his training."}, {"tag": "p", "text": "Vergere returned with Solo to the New Republic in 28 ABY, where he was reunited with his family. Solo's attachment to his sister Jaina was such, however, that when during a pitched battle Jaina was endangered by the forces of the Warmaster, he rushed to defend her at his own peril. Fearful that Jacen Solo would die on his mission, the Fosh sacrificed herself to preserve his destiny, killing the Yuuzhan Vong warriors threatening Jaina Solo and ensuring her protégé's survival. With Vergere dead, the execution of the Sith plan fell entirely to Lumiya. A year after Vergere's death, the Yuuzhan Vong were defeated at Coruscant and the galactic capital was reclaimed by the Galactic Federation of Free Alliances—the successor government to the New Republic. The Yuuzhan Vong War had cost Lumiya both her battle fleet and her Sith companion; although the moment to approach Solo was a decade away, the cyborg woman had the time and freedom to make preparations for that day."}, {"tag": "h4", "text": "Long preparations"}, {"tag": "p", "text": "By 40 ABY, Lumiya had taken up residence on an asteroid in the MZX32905 system near the planet Bimmiel. Formerly the abode of an ancient Dark Lord of the Sith called Darth Vectivus, \"the Home\"—as it was called by a sapient mynock-like indigenous species that had once lived there but had since gone extinct—was an opulent mansion built directly over a network of defunct mining caverns. Upon further exploration Lumiya discovered that the dark side was exceptionally strong in the mines; in fact, it pooled within the bowels of the asteroid, and Lumiya frequently basked in its power. It was in those tunnels that Lumiya encountered the spirit of Vectivus himself. The Dark Lady learned from her Sith predecessor how to tap into the dark side reservoir for the creation of Force phantoms; malevolent manifestations that could interact with and influence the physical realm."}, {"tag": "p", "text": "Lumiya also decided that year to finally convert Jacen Solo into a Sith Lord. Aware that she would have to find a way to lure Solo to a location of her choosing, Lumiya alighted upon the idea of a riddle or a puzzle that the Jedi would have to unravel. She drew on a variety of different cultures, Sith ideals, perversions of Jedi precepts, and Solo's own past, to construct a small piece of beadcraft, an artifact made up of a series of intricately designed colored tassels. Each section was unique and carried its own message. Lumiya ordered the creation of lines from the Tahu'ip culture of the Twi'lek people, the Bith Aalagar race of Clak'dor VII, the language of the Firrerreo, the prison dialect of Kessel, and numerous other sources, intent on the creation of an item that would attract Solo's attention and encourage him to explore its meaning."}, {"tag": "p", "text": "Several lines, such as the Tahu'ip tassel, referred to Solo's own life and how he had learned to strengthen himself through pain while in Yuuzhan Vong captivity. Others referred to the trials he would endure as he ascended to Sith mastery—the sacrifice of love, which Lumiya presumed would be carried out by means of the murder of a relative or friend—the ruination of those who denied justice, and the balance of peace and conflict. While several of the tassels' elements were contrived, others, such as the sacrifice Solo would have to make, were the province of the Force itself. The final line, which pertained to Solo being drawn from peace into conflict, was constructed from an ancient Sith dialect used specifically on the world of Ziost and imbued with the Force, in a last attempt to capture Solo's attention. Although Lumiya was operating in the realms of Sith prophecy, she was far from omniscient in what needed to be done."}, {"tag": "h4", "text": "Puppetmaster"}, {"tag": "h5", "text": "Initiating a war"}, {"tag": "p", "text": "Since the end of the Swarm War several years prior, the galaxy had remained at relative peace. However, the Dark Lady felt that Solo's rise to power would best occur against the backdrop of war and instability. The Galactic Federation of Free Alliances and its Chief of State, the Alderaanian Cal Omas, maintained close ties with the Jedi Order and operated alongside them to maintain peace and stability. Nevertheless, tensions had risen between the Galactic Alliance and Corellia, a planet with a people known for their independence and pride. The Corellian government, headed by Five World Prime Minister Aidel Saxan, wished to enjoy the benefits of Galactic Alliance membership while flouting the government's regulations. In order to enable the rise of Jacen Solo, Lumiya decided to plunge the galaxy into conflict by agitating the subsequent secession movement for which the Five Worlds confederacy began to muster support."}, {"tag": "p", "text": "Employing Darth Vectivus' Force phantom technique, she projected the image of Edela Klauskin, the late wife of Galactic Alliance Defense Fleet Admiral Matric Klauskin, and began to subtly coerce him to engage in a series of actions designed to further upset the already strained relations between the Galactic Alliance and the Corellians. The first of them was interwoven within the highly-classified Operation Roundabout, with Klauskin's role as that of commander over the Alliance Second Fleet's ill-fated attempt to place Corellia itself under siege. When that action failed, Lumiya influenced Klauskin to attack and occupy the nearby world of Tralus, in further aggravation of an already volatile situation. Both parties wished to bring an end to what was quickly degenerating into yet another war, and both governments sent delegates to meet on the Toryaz space station near Kuat in an attempt to negotiate a peaceful resolution to the conflict. Lumiya decided to partake in the negotiations as well, though not as an advocate of either party, but rather as a spy and saboteur. She began with an anonymous message to Corellian Head of State and Minister of War Thrackan Sal-Solo that alerted him to the secret meeting and enticed him with an opportunity to eliminate several of their mutual rivals in one fell swoop. Sal-Solo obliged and provided Lumiya with twenty commandos, most of Corellian origin, all Human, and all expendable; each was terminally ill, afflicted with various diseases that could not be cured by any known means. To hinder any interrogation attempts should any of the commandos be captured, each was injected with a powerful alkaloid poison, one that would guarantee death shortly after it was administered."}, {"tag": "p", "text": "While disguised as a Kuati mercantile princess, the Dark Lady infiltrated Toryaz station's Narsacc Habitat and accosted station captain Siron Tawaler, whom she mentally seduced through the Force into her service. She convinced the security captain that he was under consideration to be chosen as her consort, and presented him with documents that, among other things, verified her pseudo-identity. She claimed that one of the Jedi on the station was determined to kill her, and that Tawaler had to do everything in his power to prevent such an act from taking place. Under the pretense of being selected for such a prestigious Kuati honor and determined to thwart any assassination attempts on part of the \"rogue Jedi,\" Captain Tawaler was compelled to help Lumiya. He provided her with detailed schematics of the habitat, including the lodgings of each of the delegates. They then proceeded to Narsacc Habitat's docking bay to rendezvous with Sal-Solo's recently arrived commandos. After briefing her assassins on their mission, Lumiya used a Force suggestion that caused Captain Tawaler to enter an airlock under the impression that he was supposed to board the commandos' Sentinel-class shuttle and return to Kuat. That, however, was a deception on Lumiya's part; the shuttle had already disengaged from the hangar. Tawaler nonetheless initiated the depressurization sequence and died soon afterward, the victim of explosive decompression."}, {"tag": "h5", "text": "Meeting Jacen Solo"}, {"tag": "p", "text": "Lumiya's commandos were partially successful in their mission, as they were only able to assassinate one of the delegates, Five Worlds Prime Minister Aidel Saxan. As planned, each one died before interrogation ensued by the Jedi or anyone else. Aware that Jacen Solo was among those on Toryaz Station, Lumiya left the tassels—the lure through which she intended to ensnare the young Jedi—by the airlock where Captain Tawaler committed suicide, under the pretense that scrutiny into the botched attack would lead investigators there. The Dark Lady believed that Solo's curiosity into the tassels' meaning would lead him to Lorrd, a planet in the Kanz sector with a culture and history of non-verbal communication, where he would find an expert on the subject named Doctor Heilan Rotham. She then left Narsacc Habitat and pursued the commandos' shuttle to the Coronet City Spaceport in Coronet City, Corellia, where she killed the pilot, preempted the vessel for herself, and re-registered it under the alias of a Human Commenori woman named \"Brisha Syo.\" She took the shuttle to Lorrd, paid for a week's worth of parking at the Lorrd spaceport, and waited for Jacen Solo, who soon arrived with his cousin Ben Skywalker and the watchman of the system, a female named Nelani Dinn. While they met with Rotham, Lumiya secretly incited several seemingly random acts of terrorism around Lorrd City, the first of which involved a man who threatened to fire concussion missiles into the most heavily populated area of the city unless he was given audience with a Jedi. Although that crisis abated due to the intervention of Solo and his companions, subsequent Force-influenced catastrophes plagued Lorrd City in the days that followed, all at the instigation of Lumiya. Meanwhile, Ben Skywalker had ventured out into Lorrd City on his own, where he discovered the shuttle that had escaped from Toryaz Station docked in the city spaceport. He placed a homing beacon on the vessel and advised Security lieutenant Neav Samran to contact him if and when the pilot returned. Satisfied that her actions had guaranteed the continued presence of the Jedi on Lorrd, Lumiya went back to the vessel and was immediately detained by Samran. She was taken to the security station, until which time the Jedi arrived to interrogate her."}, {"tag": "p", "text": "She did not have to wait long for the Jedi, who arrived soon afterward with a number of questions. She greeted them all by name, something which startled them, and admitted to having interfered in their affairs for some time before actually meeting them face-to-face. She denied any explicit complicity in actions of the recent string of unusual events, instead claiming that she heard their plans to commit heinous acts in her dreams and that, through her dreams, she suggested to them that they somehow involve the Jedi. Unable to discern truth from lies, Solo inquired as to her connection with the events on Toryaz Station, but Syo only admitted to her presence on-station as that of an observer of Jacen Solo specifically, with her Force abilities employed to remain hidden while doing so. She claimed to have witnessed the death of Security Captain Tawaler at the hands of a hooded individual by uncontrolled decompression and decided at that point to flee, though not before leaving her tassel artifact behind in the same airlock through which Tawaler had spaced, totally intent of its eventual possession by Solo. Thus she came by Lorrd, with full anticipation of Solo's imminent arrival. In an attempt to piece the entire puzzle together, Solo demanded to know the truth, a request she agreed to only if the Jedi joined her at her home near Bimmiel. Solo initially declined, and Syo refused to divulge anything further. She was threatened with several different punishments by an exasperated Solo, even death, but nothing he said was able to sway her. She waited patiently as Solo then consulted his comrades and finally agreed to join Syo at her home."}, {"tag": "h5", "text": "Seducing a Jedi"}, {"tag": "p", "text": "\"Brisha Syo\" joined the Jedi on their shuttle during the ride to her home and assured Solo upon arrival that all the answers he sought would be found within. They were led inside as she explained the history of the mining habitat, one the Jedi recognized as a centuries-old mining station that had been abandoned at great expense. Syo commented on the habitat's former administrator, who had also been a Sith Lord, but dismissed any further conversation as they ascended four floors in a turbolift to a chamber lined with artwork and educational materials. She denied their suspicions of her status as some form of Sith adept and revealed the asteroid's permeation with both sides of the Force, something with which Solo was preoccupied. Syo then admitted to being a student of all aspects of the Force, one who focused primarily on utilization of Sith teachings for the benefit of others. She explained her beliefs about the differences between the light and dark sides of the Force, as well as the history of the Home and the semi-sentient mynock-like species that had once resided there. She also presented her example of a benevolent darksider in the form of Darth Vectivus, an ancient Sith Master who had learned to wield the dark side without malice. She explained that while many Sith Lords of yesteryear—Solo's grandfather, Darth Vader included—were already corrupt individuals prior to becoming Sith, Vectivus had been a man of solid moral stature long before his affirmation of the dark side, and he was thus able to ignore temptations of malevolence and soft-heartedness. She next revealed her own relationship with Vader, which exasperated Solo, who realized that he still knew nothing about either Syo or her motives. Although she confessed to subterfuge, she claimed that her true reason for the presence of Jedi was to confront a Sith Lord that supposedly resided in the asteroid's lowest levels."}, {"tag": "p", "text": "As the turbolift bore them to the habitat's lowest level, Syo joked about the Sith Lord's identity; the Order to which he belonged Solo believed had been eradicated with the death of Emperor Palpatine's final clone. While the last fully vested Sith Masters had died with Vader and the Emperor, Syo claimed that capable aspirants had indeed survived and upheld centuries of Sith tradition. The turbolift then opened onto a rail system that led into the mine proper, and Syo cautioned that Ben Skywalker should remain behind. Solo refused to leave his cousin, so Syo and the three Jedi boarded the railcar and descended into the depths of the mine. Shortly into their ride, Syo used the Force to hurl Skywalker and Dinn from the railcar, and sent hundreds of mynock Force-phantoms to harry them. Solo felt her Force exertion, but Syo assured him that separation had been for their own good, given the overwhelming nature of the danger that lay ahead. With Solo effectively isolated from his companions, they began to discuss the Sith Lord whom Syo claimed resided in the mine. A phantasmal man of her creation then appeared before them who, although obscured by the hood of his cloak, identified himself as that being. After a brief exchange, the apparition disappeared and was replaced by one of Luke Skywalker. While his illusory uncle entered into lightsaber combat with Solo, Syo created a phantom of Mara Jade Skywalker that simultaneously attacked Ben Skywalker, and another of Darth Vectivus to waylay Nelani Dinn, both elsewhere in the mines. Exhaustion forced her to end the assault shortly afterward, but the test she had just conducted of Solo had been successful; his refusal to tap into the abundant dark side energy of the asteroid had saved his life. Syo next led him to a door made of ebony stone—immovable, save by an exertion through the dark side. The door opened upon the slightest command of dark power by Solo, who followed behind Syo as she brought him before her estate. She then confessed that she was in fact Sith, one who had been trained by Solo's grandfather, Darth Vader; how she had been born Shira Brie, and the fateful confrontation with Luke Skywalker that resulted in her rebirth as Lumiya."}, {"tag": "p", "text": "Lumiya revealed her desire for Solo to become the next Dark Lord of the Sith, the training for which she explained had begun years ago during Solo's time with Vergere. They were interrupted by the arrival of a lone Nelani Dinn, who attempted to end the Dark Lady's seductions with the activation of her lightsaber. When the seemingly unarmed Lumiya refused to acknowledge Dinn's authority, she was attacked. Lumiya evaded Dinn to draw her lightwhip, and landed a disorienting strike to the Jedi's face. Dinn advanced, but was painfully forced into retreat by Lumiya. The Jedi telekinetically hurled two marble busts, the first of which Lumiya destroyed with her whip, and the second she caught in the Force. She lost the struggle, and the bust struck the whip from her hand. She was saved by Solo, however, who had agreed to learn her dark side teachings, after he envisioned multiple possible futures that resulted in the galaxy's descent into chaos and the death of his uncle, Luke Skywalker; only in his visions of Nelani Dinn's fall did Skywalker survive. Dinn realized that she was outmatched and fled with Solo after her, a confrontation that ended in her death. Lumiya met him shortly afterward in an airlock adjacent to the hangar where his shuttle was docked, and promised to honor the deceased with a burial suitable of a noble warrior. She noticed Solo's distress at what he had done and assured him that he had already begun to strengthen himself through his actions. As he departed with the unconscious but uninjured Ben Skywalker, Lumiya promised that upon his return to her asteroid, she would help Solo reach the level of Sith status that his grandfather had been unable to achieve. She retired to the Home's summit, where she met with the specter of Jacen's future self—her interpretation of him as a Sith. They recognized that, while the ghost was compelled to return to nonexistence, Lumiya's triumph over Solo ensured his eventual return, and that he would finally be granted a proper Sith name. The phantom disappeared, and Lumiya knew that through her victory, she had achieved balance befitting a Sith."}, {"tag": "h5", "text": "Sith Master"}, {"tag": "p", "text": "Several days later, Lumiya received a Force summons to Coruscant from Solo, which she answered immediately. Clad in a red business suit and face obscured by scarf and veil, Lumiya concealed her Force presence and located Solo with Ben Skywalker in the Plaza of the Core. Introduced as \"Shira\" to the younger Jedi, who, for some reason, thought he recognized her but abandoned the notion before his dismissal, Lumiya hesitantly accepted an invitation to the Jedi Temple. Awed by the grandeur of the edifice, she entered, hid her dark side aura, and was led to the Room of a Thousand Fountains, where Solo explained that he would arrange for a discreet apartment for her on Coruscant where he desired for her to remain. She agreed but stressed the importance of haste on his part, now that she was confident in his decision to become Sith. Both of them had sensed the beginnings of the rapid degradation of galactic peace, and Lumiya—who scoffed at his suggestion of her involvement in recent terrorist attacks—felt certain that the next few weeks would determine what specific knowledge he required. They proceeded toward the Jedi Council Chamber, just as Luke Skywalker himself approached, who acted as though he sensed something slightly amiss. He promptly departed, none the wiser to the identity of the veiled woman at his nephew's flank. She scolded him for his recklessness and bid him farewell as she left the Temple and Coruscant for her home to collect and return with her personal belongings."}, {"tag": "p", "text": "The safe house that was provided for Lumiya was numbered 712 on the three-hundredth floor of Coruscant's Zorp House apartment complex. She returned to the galactic capital with her possessions, many of them artifacts of Sith origin, with which she furnished her new yet temporary abode. Unknown to her apprentice or anyone else, however, Lumiya commandeered another dwelling on the 288th floor, which was to serve as the relay station for her observation of the comings and goings of Zorp House. She also infiltrated a set of unoccupied quarters in the building's third level, where she installed the modified and booby-trapped datapad with which she intended to splice into the building's communications system. Her datapad was also programmed to penetrate the most secure of Alliance Military databanks, and from it she obtained highly classified plans for the Alliance invasion of Commenor, a world that was slowly leaning toward Corellian allegiance. Lumiya fashioned a secret passage in one of the bedroom closets, which led to an intricate labyrinth of tunnels beneath the building and was guarded by a meter-long durasteel dart that was triggered to fire at a highly lethal velocity if ever the secrecy of her escape route was compromised."}, {"tag": "p", "text": "When next Lumiya met Jacen Solo it was in the Senate Building, just after the announcement of Admiral Gilad Pellaeon's retirement as Supreme Commander of the Galactic Alliance Defense Force. Again under the guise of \"Shira,\" she and Solo sat in lobby 513, down the hall from a meeting between members of the Jedi Council and the newly-appointed Supreme Commander, Mon Calamari Admiral Cha Niathal, whose promotion Lumiya had secretly engineered. With reports of his cousin Thrackan Sal-Solo's plans to have Centerpoint Station operable within the coming months broadcast all over the HoloNet, Jacen became increasingly determined to mitigate the repercussions of actions various members of his family visited upon the galaxy. Lumiya realized that Solo feared the similarities in his fall to the dark side and that of his grandfather, whose actions during the razing of the Jedi Temple he had witnessed during a recent flow-walking experience. Satisfied when he related his desire to still take Ben Skywalker as his eventual Sith apprentice, Lumiya was not completely in agreement with Solo's decision to remain with the Galactic Alliance Guard police force in lieu of a more influential military appointment, given his relationship with Niathal. The meeting ended just then, and as the Jedi approached, Lumiya hid her dark orientation within Solo's Force illusion. Luke Skywalker greeted but did not otherwise acknowledge her, and she too remained indifferent as he conversed with Solo. When the Jedi Master departed, Lumiya accompanied Solo to congratulate Niathal."}, {"tag": "p", "text": "Several days later, Lumiya met Solo in his apartment upon urgent request, as he had learned that his uncle was aware of the Dark Lady's presence on Coruscant. Concerned with the possibility that Skywalker might find her before her task was complete, Lumiya decided to accelerate Solo's Sith training. She projected a soothing Force illusion of deep blue, meditative light, through which the room was submerged in an underwater ambiance. Lumiya defined her role as Solo's guide on his path to Sith enlightenment and assured him that his was not the same destiny as his grandfather. When the issue of his own Sith apprentice arose, Jedi Mastery was the obstacle Lumiya felt it necessary for Solo to overcome to cement young Skywalker's tutelage under him. To that end, she planned to influence several non-Jedi supporters of Jacen Solo into lobbying with the Jedi Council on his behalf. Confident that Solo would soon reach the necessary level of understanding, the illusion ended, and she departed. Solo sought his Sith Master soon after a military engagement during the Corellian blockade, in which he destroyed a civilian freighter after his sister, Jaina Solo, refused his direct order to fire. Jacen Solo felt compelled to court-martial his sister for her insubordination, which left him extremely troubled with recurrent bad dreams. Lumiya sensed his unrest as she emerged from an adjacent room to find him in her apartment, and advised him to recognize the significance of such decisions as he prepared to make his final sacrifice; among other things, the alienation of his sister was a small part of the price to pay for his role in the institution of an ordered galaxy. His dreams were inconsequential to Lumiya, so long as he was able to differentiate between them and Force visions, the latter through which he might find answers she was unable to provide. Solo was also troubled with the diminished faith in him of Ben Skywalker, who had witnessed Jacen Solo's inadvertent murder of a prisoner during interrogation. Lumiya suggested that instead of seeking the boy's approval, Solo should place him in a situation where he had to discover the need for such extremes himself."}, {"tag": "p", "text": "Lumiya met with Solo regularly over the course of the next several weeks. On one particular day in her safe house apartment, she fondled the tassels that had initially ensnared Solo and listened as he related the frequency of his bad dreams, as well as his increasing obsession with the descent into the dark side of his grandfather. Lumiya realized that Solo's location-restrictive flow-walking technique limited his understanding of Darth Vader's fall, and she cautioned against any attempts to vindicate himself in that manner. She then handed the tassel artifact to Solo and commended his fulfillment of various aspects of the prophecy. The time was fast-approaching for the metaphoric immortalization of his love, the specifics of which Lumiya had no idea, but required the killing of a loved one whose death would bring unbearable suffering to their loved ones in turn."}, {"tag": "h5", "text": "Machinations"}, {"tag": "p", "text": "The threat of full-blown civil war became more apparent over the course of a week as assassins under the employ of the planet Bothawui's True Victory Party colluded with Corellian terrorists to wreak havoc on Coruscant. Lumiya traveled through the Coruscant Underlevels in pursuit of Jacen Solo, who had gone to meet with his friend and spy, the World Brain, to learn what the Yuuzhan Vong creature had discovered about the activities of the terrorists in the Underlevels. Unknown to Lumiya, she was preceded by the Twi'lek Dark Jedi Alema Rar, who had stalked Solo with hopes of killing him to exact revenge against his parents. The Dark Lady eliminated three feral Underlevel residents who attempted to impede her progress upon Rar's suggestion before she noticed the Twi'lek's presence. She hid with a muted Force aura on a balcony in the shadows of the fogged cesspool wherein resided the World Brain, just as Rar emerged from the corridor and prepared to fire her blowgun at Solo. Lumiya used the Force at that same moment to hurl the Jedi clear of the wayward dart, which pierced the eye of the World Brain and sent the creature into death spasms as the poison circulated. Now aware of the assassin's location, Lumiya alerted Solo to her presence, and the Sith apprentice momentarily deterred Rar's escape with a torrent of Force lighting. Lumiya rebuked any further exertion of his wrath and reminded him that preservation of the World Brain as an intelligence asset was of far greater import than revenge. He resisted, and Lumiya denounced him as a slave to his emotions for his desire to seek justice for a wounded friend. Solo relented but promised vengeance against the True Victory Party and its leader, a Bothan called Reh'mwa, whom he suspected had sent the assassin, before he and Lumiya descended into the World Brain's pool in an attempt to save its life."}, {"tag": "p", "text": "From the information Jacen Solo received from his spy, Lumiya was given a list of and asked to kill a number of influential Bothan dignitaries in conspiracy with Corellian insurgents. The terrorists had also discovered the World Brain's treachery as the Galactic Alliance Guard's spy and prepared to move their entire network against it. Despite the best efforts of the Sith, however, the World Brain succumbed to the poison and died in a week's time. Lumiya was summoned by her apprentice to meet him in the Fellowship Plaza of Coruscant's Senate District to discuss the ramifications, and she was asked to expedite the completion of the list, as Solo believed that the Corellians would not reveal themselves if they learned that the World Brain was already dead. She agreed, but openly recognized the declaration of war from Bothawui that would inevitably follow. As Solo departed for a meeting with Admiral Niathal that was to include the commission of his own Imperial II-class Star Destroyer, the Anakin Solo, Lumiya's attention shifted to a commotion behind her, between two apparently spying females: a Chev Jedi and a deformed, blue-skinned, lightsaber-wielding Twi'lek. The Dark Lady urged her apprentice to exit as she activated her lightwhip and prepared to deal with the Twi'lek, who beckoned Lumiya to stop the fleeing Jedi Master, Tresina Lobi, from reporting to the High Council details of the conversation on which she had just eavesdropped. The Dark Jedi blasted Lobi with Force lightning but was incapacitated by an urn thrown telekinetically by the Chev. Lumiya began a duel with the Jedi, but was methodically driven back by the larger woman, and forced to deactivate her weapon when the Twi'lek interposed herself between the combatants and was burned across the body by the whip's still-hot energy filaments. Lobi severed Lumiya's weapon arm just then and took position for a killing strike, but she was again parried by the Dark Jedi, which gave the Sith time to recover her lightwhip and wield it with her remaining limb. Forced into retreat and momentarily distracted by the being behind her, Lobi faltered, and Lumiya sheared both of her legs off at the knee, just before her accomplice killed her with a decapitating strike. The Twi'lek then introduced herself as Alema Rar and pledged her assistance to the downfall of Jacen Solo, an offer which Lumiya warily accepted."}, {"tag": "p", "text": "The next morning, Lumiya gave the list of Bothan ambassadors to Rar that she might complete the assassinations in her stead. She then joined her apprentice on board the Anakin Solo to the sovereign world of the Hapes Cluster, where upon arrival, Lumiya retired from the Command Salon with Solo to her own cabin in deference to the presence of Queen Mother Tenel Ka, on whose life an attempt had recently been made. The Dark Lady's involvement in Lobi's death was meanwhile uncovered an hour later when the Chev's dismembered corpse was found in Fellowship Plaza by Coruscant Security Force Detectives Gwad Raatu and Chal Tozr, who notified Jedi Masters Mara Jade and Luke Skywalker. Their subsequent investigation led them to believe that Lumiya and a female accomplice had stalked their son Ben. They discovered and conducted a preliminary search of her safe house, which yielded nothing more than an expensive gown. Under the assumption she had fled the planet, they sliced into the dwelling's computer and stumbled upon a list of names that corroborated Lumiya's complicity in the Bothan assassination affair. Further scrutiny revealed her high-level access to the records and resources of the Galactic Alliance Guard, to which they learned her apartment was a registered safe house. The Jedi surmised that Lumiya had not infiltrated the GAG at all, but had actually been working with them, possibly under the full awareness of Jacen Solo."}, {"tag": "h3", "text": "Lumiya revealed"}, {"tag": "h4", "text": "Reunion"}, {"tag": "p", "text": "Under the assumption that Lumiya had intentions of vengeance on Ben Skywalker, the Skywalkers immediately intercepted Solo, who had since received an Alliance Colonel's commission. While en route to Hapes with him on board the Anakin Solo, the Skywalkers related their discoveries and decision to remove their son from active GAG duty. Jacen Solo relented and scheduled a rendezvous between parents and child on the Roqoo Depot refueling station, deep within the Hapes Cluster. The meeting was a twofold trap, however, as Lumiya agreed to also venture to Roqoo Depot to secretly oversee Ben Skywalker's safe passage to the Anakin. Within an hour of the Skywalkers' and Queen Mother's departures, the Star Destroyer prepared to jump to the Relephon Moons to deal with the Heritage Council, the instigators of the recent Hapan coup attempt. Lumiya had returned to the vessel with Alema Rar, with whom she fashioned two dead-man relays from as many proton detonator charges, in preparation for an imminent confrontation with the Skywalkers. The devices, which Lumiya intended to serve as fail-safes should either woman fall in battle, were configured to detonate upon the cessation of the wearer's vital signs, thus ensuring the station's destruction and the deaths of those in close proximity. With the relays affixed to a combat vest for each of them, Lumiya and Rar left the Anakin Solo for Roqoo Depot."}, {"tag": "p", "text": "Dressed in dark raiment with their faces hidden behind cowls, the two darksiders entered the refueling station cantina, Force presences muted, just after the Skywalkers. Lumiya hurled a grenade at them upon sight, which detonated and scattered Jedi and patron alike. She maimed two beings with her lightwhip as they recovered and vowed to kill all remaining bystanders but for the Skywalkers' surrender. The Sith Lady redirected the cantina patrons' terror toward her opponents, but Luke Skywalker attacked nonetheless, while Mara Jade Skywalker closed in on her flank—both Jedi armed with lightsaber and shoto. She kept the civilians between them, however, and the Skywalkers were unable to mount a successful offensive without killing innocent beings. While Lumiya furiously fought with Luke Skywalker, Rar hid within a Force shadow just outside the cantina entrance and fired her blowgun at the unsuspecting Mara Jade Skywalker, who was saved by the Force-warning of her husband. In a moment's distraction, Lumiya severed the male Skywalker's weapon hand and brought him down with a critical slash across the body. As she moved to finish him, Lumiya was shot five times with a blaster rifle found by the downed Jedi. The Grand Master's determination to kill her was stayed by his wife, who revealed the same type of combat fail-safe strapped to Lumiya that Mara Jade Skywalker had discovered on the defeated Rar. The Jedi fled minutes before Lumiya and the Twi'lek, whose tracks were covered in the explosion that resulted from the abandonment of their dead man relays at Roqoo Depot."}, {"tag": "p", "text": "In the days that followed the events on Roqoo Depot, Lumiya returned to her asteroid retreat near Bimmiel, where a full staff of medical droids waited to treat her injuries. A combination of healing trances and her enhanced metabolism also assisted in her convalescence, but she remained as yet unhealed, and in pain. As she lay in recovery, Lumiya sensed the touch of Jacen Solo through the Force and responded with a phantom of herself projected to his cabin on board the Anakin Solo. With the galaxy still on the brink of war, Solo expressed concern with the direction his training was taking him and uncertainty regarding whether or not his cousin—whom he recently realized could serve as his necessary sacrifice—was the most appropriate choice for apprenticeship. To that end, Lumiya offered to coordinate a test of Solo's design for young Skywalker; a mission to Drewwa, a moon of Almania, for the recovery of a Sith artifact known as the Amulet of Kalara. She hired a Bothan called Byalfin Dyur to steal the amulet and give it to a courier named Faskus, with instructions to bring it to specific coordinates of Ziost. Lumiya's agents planted seeds of disinformation in various locations, so that if her activities were discovered by the Jedi, they would not be able to easily thwart her. When next she received report of Dyur's progress, Lumiya learned that Faskus had been killed, but his daughter, an unexpected variable in Lumiya's scheme, had since become Skywalker's responsibility. The specific instructions Lumiya gave to Jacen Solo with regard to Skywalker's mission had not accounted for the girl's presence, and she realized that his inherent benevolence went against the necessary Sith survival instinct; she therefore ordered Dyur to kill them both. In the meanwhile, both her second and third safe house apartments within Zorp House on Coruscant were discovered by the Skywalkers. Along with the secret passages of Lumiya's they learned led discreetly from the complex, the Dark Lady's explosive and poison-rigged datapad was found, with which she had intercepted various communications and hacked into the Galactic Alliance Defense network with a high-level GAG access code."}, {"tag": "h4", "text": "Interference"}, {"tag": "p", "text": "Although Bothawui continued to make secret preparations for war with the Galactic Alliance on behalf of the Corellian Confederation, the deployment of three of their fleets was hamstrung by the efforts of the Alliance forces as they closely observed the activities of the Bothans in their home system. To further agitate the situation, Lumiya disguised herself as a Hapan noblewoman and Bothan sympathizer, and contacted Bothan Deputy Intelligence Leader Tathak K'roylan via holocomm, with information that would prove vital in Bothawui's attempt to release their fleets beneath the Galactic Alliance's notice as well as an offer to assist them in that endeavor by diverting the Alliance's attention. To earn a measure of K'roylan's trust, Lumiya provided previously-undisclosed details with regard to the string of Bothan assassinations on Coruscant. While she herself had been intimately involved with the deaths, sanction had come from Colonel Solo of the Galactic Alliance Guard, to whom also belonged the classified records Lumiya had given K'roylan. Confident that the Bothans would eventually do so, she provided K'roylan with information on how to contact her when the need arose and ended the link."}, {"tag": "p", "text": "She then contacted Jacen Solo specifically, to whom was transmitted what she called the \"Syo package.\" Still in the Hapan noblewoman role, Lumiya next opened a transmission to Commenor, another world that had also recently joined the Corellian secession movement. In the subsequent conversation with Prime Minister Fyor Rodan, she provided the details of the Chasin Document, the means by which the Galactic Alliance planned to conquer Commenor. She advised that she would contact him again in several days with details of Corellian fleet movements which, with the aid of Rodan's forces, would succeed against the Alliance. Confident that Rodan's superiors would validate her information, she ended the link with the Prime Minister and created a Force phantom of herself that she sent to the Veterans' Mental Care Hospital in Coruscant's Galactic City, where she influenced a sleeping female Quarren employee into consciousness, then action. Within minutes, the Quarren accessed computer files and issued instructions to various beings for the Sith Mistress, which included the acquisition of clothing, documentation, and transportation, all to be made ready and waiting for her command. Lumiya then returned the unwitting Quarren to her office and restored her slumber, before she went in search of the recently-admitted former Alliance Defense Fleet Admiral Matric Klauskin. Capitalizing on the insanity in him she herself had created, Lumiya convinced him to leave the hospital, return to his homeworld of Commenor, and participate in the war on behalf of the Corellian insurrection, all by the means she had just provisioned. Klauskin subsequently used his credentials to board and seize command of the Alliance frigate Shamunaar, a coordination vessel for all the Alliance's reconnaissance and fighting forces in the Bothawui system. The Admiral then relinquished control of Shamunaar to the Bothans, more specifically Tathak K'roylan, who assimilated the frigate into his fleet and implemented it in an attack on Alliance forces in the Corellian system, which ultimately resulted in the end of the longstanding blockade."}, {"tag": "p", "text": "Following the battle of Corellia, wherein Bothawui and Commenor participated on behalf of the Confederation, the declaration of war that had initially been enacted against Corellia was extended to include the world's new allies. In addition, Adumar, Bespin, and Fondor withdrew their support of the Alliance in favor of the Confederacy, and a top-secret meeting was scheduled to elect an undisputed Supreme Commander of the Confederation military. The Alliance learned of the meeting's location at a resort satellite around the primary star of the Gilatter system, and they made swift preparations for an ambush. Coordinated by Admiral Niathal and Colonel Jacen Solo, the military action was to include Jedi StealthX pilots acting as reconnaissance fighters just prior to the arrival of the makeshift Alliance fleet, led by Niathal's flagship, the Galactic Voyager, and the Anakin Solo. Lumiya, who was now fully healed and had sensed Jacen Solo's anxiety over the situation, met him on Coruscant and agreed to help him infiltrate the resort, that he might act as a distraction from the Alliance forces massing in orbit around the star. She joined him on board his Star Destroyer to Gilatter VIII and, under the aliases of Silfinia and Najack Ell, the pair inserted themselves into the stronghold of the enemy. To cover more ground as they canvassed the gathering, Lumiya separated from her charge. Shortly after their arrival, however, the meeting was revealed to be a trap set for the Alliance; the Confederation had already chosen its General Turr Phennir as Supreme Commander at a previous engagement, and were also well aware of—and prepared for—the Alliance assault. Lumiya received a Force-warning from Solo and prepared to help him defend against the Corellian Security officers that had swarmed him, but was surprised to find Alema Rar also present and intent on killing Mara Jade Skywalker, who was on station with her husband, as well as the fast approaching Han Solo. Confident that their presences at the meeting would force the Solos and Skywalkers to delay their departure, the two darksiders, weapons in hand, dived into the fray."}, {"tag": "p", "text": "Lumiya confronted Luke, who was dismayed to learn that she had not died at Roqoo Depot, and the two engaged in a vicious duel. Skywalker was convinced that Lumiya's actions stemmed from a hatred nursed over decades, an assumption she vehemently denied and attempted to prove with the deactivation of her lightwhip, and an offer to kill her then and there. When the Jedi Grand Master refused, Lumiya offered her hand to him in an expression of amnesty, a gesture he hesitatingly returned. However, the momentary distraction provided Jacen Solo with the opportunity to escape and return to the Anakin Solo, just as Lumiya had intended. As they held hands, an errant YV-666 light freighter crashed through the transparisteel dome of the station's main hall, and Lumiya used her reignited lightwhip to rend an escape route through an adjacent wall. In the utter chaos that ensued as the structure collapsed and a space battle raged, the Dark Lady appropriated an abandoned airspeeder and contacted Solo, who provided landing authorization for her vessel on the Anakin Solo. She joined her apprentice in his private office and counseled him to maintain better control of the anger he radiated because of his perceived failure at Gilatter VIII. Frustrated with his own fallibility in combat, Solo desired to be unbeatable, despite its impossibility. Lumiya revealed that once he achieved full Mastery, the Sith ability to totally coordinate battle through the Force—not the rudimentary meditative invigoration akin to highly-skilled Force users—would be his to command, but not before he performed his blood sacrifice and assumed his Sith identity. In the silence that marked the next few moments, Lumiya recognized that fear of his emotions had stricken her apprentice, not indecision over whom it was he had to sacrifice. She left him to contemplate the significance of her words, disappointed by the possibility that he was not quite as ready to embrace his destiny as she had previously believed."}, {"tag": "h4", "text": "Closing in"}, {"tag": "p", "text": "Lumiya remained in her cabin on board the Anakin Solo and was soon unsettled by a disturbance in the Force that was the approach of Ben Skywalker, who had returned from his mission at the helm of an ancient Sith Meditation Sphere. The vehicle, which had searched for Solo, had instead found Lumiya—whom it recognized as Sith—and came to for instructions. Lumiya felt that it was somehow intertwined with her apprentice's destiny and offered it to him, despite her own fascination with the Sphere, or simply \"Ship,\" as it preferred to be called. Although the Force suggested the vessel's insignificance in her own future, Lumiya kept it pursuant to Solo's refusal and silently vowed to look after the craft until which time he was ready for it. Immediate haste was made from the Anakin Solo for her asteroid retreat, and Lumiya quickly noticed Alema Rar fast on her tail. She did nothing to deter the insane Twi'lek's pursuit as the Meditation Sphere approached the Home, and grudgingly allowed Rar entry but also refused her safe haven. Rar, who had nurtured an obsession with revenge against the Solo–Skywalker clan for her various disfigurements, planned to work alongside Jacen, but was sternly rebuked under penalty of death by Lumiya. The Dark Lady would not chance potential disaster wrought by Rar's madness with Solo's ascendancy nigh at hand, and channeled the Dark Jedi's reckless abandon into something useful: surveillance on the Colonel's activities in Lumiya's stead. She confiscated Rar's easily recognizable Conqueror-class assault ship and gave the Twi'lek a less conspicuous courier shuttle, with instructions to first track the Anakin Solo."}, {"tag": "p", "text": "Jacen Solo's relentless campaigns against the Confederation left his forces vastly depleted, and he faced numerous obstacles in his bids for replenished resources. To circumvent the red-tape, Solo drafted an amendment to a procurement regulation that eliminated the hindrances he so often encountered. He also capitalized on an opportunity to attach a more insidious amendment to the original one which allowed him to bypass the Galactic Senate if ever he or Admiral Niathal felt the need to change any legislation within existing budgets, quickly and decisively. Anonymity was required on his part, and Lumiya went to the Senate meeting in his place, to make certain that amendment number 357 on the 563-item agenda passed without issue. She received a silent comlink from him, and gave her assurance that everything was proceeding as planned. Via that same open connection, Lumiya was privy to a conversation between the Colonel and Mara Jade Skywalker, the latter of whom confronted Solo about Lumiya's proven involvement with GAG. From the meeting she also learned that Byalfin Dyur, whom she suspected to hear unfavorable news from soon, had been defeated by Ben Skywalker. Upon Mara Jade's departure, Lumiya related her conclusion that Ben Skywalker was definitely unfit to eventually succeed Solo as Lord of the Sith. At that moment, a sentient's rights advocate interrupted the procurement council meeting to address one part of Solo's amendment, but failed to notice the subtle wording he secretly implemented that would allow him to change other legislation. When the potential for opposition in the gallery manifested, Lumiya used the Force to persuade the participants otherwise, and amendment 357 passed. Unbeknownst to the members of the Senate, Solo planned to seize control of the Galactic Alliance with his newfound legislative power."}, {"tag": "p", "text": "A prime opportunity presented itself when GAG intelligence officers inadvertently intercepted a secret conversation between Chief of State Cal Omas and Corellian President Dur Gejjen, during which they agreed to meet personally on the planet Vulpter and plan the assassinations of Colonel Solo and Admiral Niathal. In response, Solo drafted an amendment to the part of the Emergency Measures Act which granted him the authority to detain anyone who posed a valid risk to the sanctity of the Galactic Alliance, to include Heads of State. With Niathal as his co-conspirator, Solo planned to arrest Omas on exactly those charges, and prior to his ascension to Dark Lord of the Sith—much to Lumiya's chagrin. She cautioned him against the haste of his decision, as she believed that he had not yet achieved the necessary power to rule undisputed. In the interim, Lumiya agreed to act as a distraction to the Jedi from Solo's next few moves and requested an item of young Skywalker's with which to antagonize his parents. She was given a pair of his boots, and at four that next morning, sneaked into the quarters of a sleeping Luke Skywalker to plant the evidence. Skywalker sensed her moments after her departure, utterly bewildered by Lumiya's apparently uninhibited access to his son. He contacted his wife and together they made conscious efforts to find and eliminate Lumiya. A powerful wake in the Force led Jade Skywalker to Hesperidium, a resort moon in Coruscant's orbit, and into direct confrontation with the Dark Lady of the Sith. They fought furiously, and when Lumiya was positioned to receive a killing stroke, the Sith Meditation Sphere she had traveled on intervened and throttled Jade Skywalker. Lumiya escaped with serious injury, leaving her mutually battered opponent unfinished, but determined to continue pursuit."}, {"tag": "h4", "text": "Victory"}, {"tag": "p", "text": "Immediately following the meeting between Omas and Gejjen on Vulpter, the latter was assassinated by Ben Skywalker under orders of Jacen Solo. Upon the Chief of State's return to Coruscant and on the same night his amendment became law, Jacen Solo personally arrested Cal Omas for suspicion of intended malice against the Galactic Alliance. He and Niathal then declared themselves Joint Chief of State, to serve for the duration of the investigation into Omas' treason. Fully healed from the wounds suffered in her bout with Mara Jade Skywalker, Lumiya returned to Coruscant on board the Meditation Sphere, which she hid in an abandoned warehouse, and met with Solo to discuss the implications of the recent attempts to distract the Jedi, a conversation which was secretly overheard by Ben Skywalker. Her next meeting with Solo was in his apartment, where they again mulled over the final stage of his transition, the immortalization of his love. Lumiya had begun to feel like the Force was brimming for a change, and had become increasingly disturbed by Solo's predilection with the maneuverings of non Force-users. The Colonel's recent campaigns had left him exhausted, and Lumiya agreed to keep watch over Admiral Niathal while he took an undisturbed, forty-eight hour sabbatical. After his departure, Lumiya explored the apartment for a time before she too left and returned to the Meditation Sphere, with intentions of following her apprentice on his secret journey. An eighteen-hour venture through the Perlemian Trade Route eventually ended in the Hapes Cluster, and Lumiya remained in orbit as Solo landed at the Fountain Palace of the namesake planet. Submersed in meditation, she was suddenly stricken through the Force by an outpouring of intense love, and she realized that the emotion had originated from Solo. The Sith Mistress deduced, much to her dismay, that he had gone to Hapes to be with his lover, Tenel Ka. Even more disturbing was the revelation that Solo had two loves on Hapes—the second being a child illegitimately conceived with the Queen Mother."}, {"tag": "p", "text": "It had been that same child whom Solo dreaded having to sacrifice, and Lumiya mistakenly believed that he had come to Hapes for said purpose. Actually, he had only come to spend time with his secret family. Upon his departure from Hapes, however, Solo's StealthX was attacked by another with Mara Jade Skywalker at the helm, who had recently confronted him about his descent into darkness. Lumiya intervened just then and, with a command to Ship, caused a hull-breach in Skywalker's StealthX. Battle had carried the combatants to orbit over the nearby planet Kavan, where Jade Skywalker's starfighter was forced planetside as it vented atmosphere. Lumiya assured Solo that she would make certain his business on Hapes stayed unknown and was answered with eight proton torpedoes locked and closing in on the Meditation Sphere. Ship, however, would not abide the treachery of the Dark Lord-to-be. As Solo sped after Mara Jade Skywalker, the vessel prepared to retaliate despite Lumiya's countermand, but was stayed by the dissuasion of Ben Skywalker, who had covertly joined in his mother's pursuit. Rendered helpless by the insubordination of a Sith ship that responded to a Jedi boy's orders, Lumiya was forced to the surface of Kavan and held captive within the Meditation Sphere, unable to join in the hunt for Skywalker's mother."}, {"tag": "p", "text": "Lumiya soon afterward felt the Jedi Master's death, accompanied by a subtle yet telling shift in the Force: Solo's sacrifice had been made at Mara Jade Skywalker's expense. Ben Skywalker's hold over Ship was immediately broken, and Lumiya, with a new serenity about her, commanded the Sphere to find the new Dark Lord of the Sith. They met on Ziost, where Lumiya gave Solo instructions on how to proceed. She offered to serve as one last distraction from his total consolidation of power by misrepresenting herself as Mara Jade Skywalker's killer, in full acceptance of the certainty of her own demise at the hand of Luke Skywalker, and made a return journey to Hapan space. With her Force-presence no longer hidden, Skywalker soon found Lumiya and forced her to land on the nearby planet Terephon. She removed her veil as she emerged from Ship, and with little left to say to one another due to both being exhausted, the Dark Lady of the Sith and Jedi Grand Master dueled for a final time. Lumiya was quickly forced onto the defensive as Skywalker drove her to the edge of the precipice on which they fought. When she lost her footing and fell, dropping her lightwhip into the chasm in the process, Skywalker saved her, only to ensure her death by decapitating her as she recovered."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "The prophesy of Lumiya and Vergere coalesced with the rise of Jacen Solo as the Sith Lord Darth Caedus. Despite the peace and justice she claimed to desire through Solo's transformation, nothing short of total war followed in his wake as he became more determined to bring the galaxy to heel. The importance of taking an apprentice as stressed by Lumiya was heeded by Caedus, who lured Jedi Knight Tahiri Veila to the dark side and into treachery against the Jedi Order. The battle coordination ability promised by Lumiya upon Caedus' ascension was also realized, with which the Dark Lord bewildered his enemies in the theater of war. The Sith Meditation Sphere that Lumiya had intended for him was instead inherited by Alema Rar, who also annexed the asteroid habitat that had once served as the Dark Lady's seat of power. When Lumiya's well-laid plans threatened to become unraveled by the blunders of Darth Caedus, Rar felt compelled to assist him and utilized the Dark Lady's Force phantom technique to great effect in the process. Regardless of Caedus' own exceptional powers, as well as the help he received from the insane Twi'lek, Lumiya's creation was ultimately defeated before his objectives were achieved. The galaxy began to experience a nominal time of peace and stability after his death, thus achieving the goal for which Lumiya claimed she had so long toiled. With Caedus' demise, Veila was unwilling to assume his position, and the last embers of a centuries-long Sith tradition were effectively smothered, to be replaced by the One Sith nearly a century later, exactly as alluded to by Lumiya."}, {"tag": "p", "text": "When Luke Skywalker learned that Lumiya had not been responsible for the death of his wife, he was driven into extreme despair as he attempted to cope with his vengeance-killing of the Sith Lady. Skywalker was further robbed of his peace of mind during the subsequent investigation into his wife's death, and Lumiya's last act of treachery threatened to taint him with the dark side were he to confront Mara Jade Skywalker's true killer, Jacen Solo. The compound tragedies of Mara Jade Skywalker's death, the Dark Lady's trickery, and the creation of Darth Caedus left both Luke Skywalker and Leia Organa Solo with tremendous grief in the months and years that followed, thus honoring Lumiya's decades-old vow of revenge against the Jedi Grand Master and his sister. A clone of the Dark Lady created by scientists under the command of the late Grand Admiral Thrawn was among a group that escaped from an Imperial research facility in 41 ABY and was pursued to the death by Jedi Knight Jaden Korr."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "h3", "text": "Appearance"}, {"tag": "p", "text": "Males in the presence of the petite Shira Brie were often captivated by her physical beauty; her fair complexion, high cheekbones, full lips, thin nose, and remarkably expressive almond-shaped green eyes were considered attractive by members of other species as well. Shoulder-length red hair fit neatly within the pilot's helmet that completed the traditional Rebel Alliance flightsuit Brie was often seen wearing. Aesthetically-pleasing physical qualities combined with a vivacious personality made Lieutenant Brie quite popular among her Rebel cohorts, but none so much as Luke Skywalker, in front of whom Brie often flaunted herself with bashful innocence."}, {"tag": "p", "text": "Shira Brie underwent extensive physical alterations after the battle of the secret armada, during which more than half of her body was mangled. In the months that followed her accident, Lumiya nursed a deep hatred for Skywalker, whom she held responsible for her tragedy. She was forced to rely on prostheses to effect a semblance of her former appearance; cybernetic limbs, torso, lower jaw, and a life-support girdle were all required for her survival. Her initial enhancements included a suit of full body armor, complete with a vocabulator and a stylized triangular helmet, all very similar in appearance to that of her late Master, Darth Vader. Resultant of irreparable damage sustained, her original armor required replacements that abandoned the previous version's droid-like appearance in favor of bionics that accentuated the Dark Lady's lithe physique and made apparent her Human nature, also granting her increased height, amplified pain threshold, and enhanced metabolism and healing capabilities. To prove the extent of her prosthesis on one occasion, Lumiya went as far as to plunge a vibroblade to the hilt into her cybernetic thigh without the slightest quiver of pain."}, {"tag": "p", "text": "By the time of the Second Galactic Civil War, Lumiya appeared to be a physically-fit, middle-aged woman with hair slightly turning gray. Lumiya took to a concealing scarf wrapped tightly around her lower visage, though she occasionally exposed her mutilated features when she felt so inclined. While she sometimes hid them with Force illusions or makeup, she had learned over the years to cope with her disfigurements and eventually suffered them to be so. Lumiya came to believe that her looks would have served as a hindrance to her goals in the long run. Despite the decades she spent steeped in the power of the dark side, Lumiya never manifested the yellow-orange eyes of the Sith. She donned swaddling robes in a variety of colors from time to time, but it was Lumiya's black cloak that seemed to be woven of pure shadow and triangular headdress that were recognized as her signature look."}, {"tag": "p", "text": "Throughout her life, Lumiya maintained a number of fully detailed and indiscernible false identities consequent of the anonymity required in her endeavors of intrigue. All beautiful and well-dressed, among them were Shira Brie the Shalyvane refugee, the Kuati mercantile princess, a dark-skinned smuggler named Silfinia Ell, and the curly-haired Brisha Syo of Commenor. She also preferred, and frequently disguised herself as, an extremely beautiful, blonde Hapan noblewoman. Her true identity, however, was that of Lumiya, self-styled Dark Lady of the Sith, irrespective of the different personal perspectives of others. Luke Skywalker, at different times, thought of and referred to her as a Dark Jedi, a Sith apprentice, Sith Lady, and even as the Dark Lady. Skywalker's wife Mara Jade Skywalker knew Lumiya as a fellow yet rival Emperor's Hand, and later also as some form of Sith affiliate, going so far as to mock her as their \"queen.\" The Sith Meditation Sphere Ship considered Lumiya to be the lowliest of students, for by its standards her knowledge was considerably lacking. Alema Rar repeatedly questioned Lumiya about her and her order and was met with reproach each time."}, {"tag": "h3", "text": "Personality"}, {"tag": "h4", "text": "Shira Brie"}, {"tag": "p", "text": "A streetwise girl who was trained to never let her guard down, Shira Brie was a young woman with an absolute loyalty to the Galactic Empire. Despite her brilliance—having outclassed her peers in all areas of study—dedication, and scholastic excellence, Brie had a great sense of humor and a love for practical jokes. A great motivator and dependable friend, she was thought and spoken of highly by those who knew her personally, while considered a snob by those who did not. Still, Brie's closest friend was able to sense a hidden darkness within her, though she never spoke to it. Brie remained jovial and witty, but also determined throughout her infiltration of the Rebel Alliance, traits which, along with her feminine wiles, earned the respect, adoration, and friendship of many. On the other hand, women with whom Brie socialized were less than taken by her exuberance. Brie was conditioned for a life of solitude, a disposition she maintained throughout her existence as Lumiya. In her later years, she could remember none of the things she enjoyed doing prior to entering Imperial service."}, {"tag": "h4", "text": "Lumiya"}, {"tag": "p", "text": "Upon her transformation into Lumiya, the Dark Lady of the Sith discarded her previous existence and refused to be acknowledged by her former name. She cast away all niceties in exchange for more selfish pursuits, even though Luke Skywalker, whom Lumiya blamed totally for her disfigurements, genuinely felt that she was still eligible for redemption from her dark path. Cold and merciless, she brooked neither argument nor disobedience, and repaid both with torture, sometimes death. With open assault as her initial means, however, the Dark Lady was defeated more often than not. She readily exploited the weak-minded and blindly determined with subtle manipulations, Force-assisted and otherwise. Deception was practiced as a matter of course, and she frequently capitalized on the misconceptions of her enemies. Secretive, purposely vague, and elusive, the specifics of her plans were seldom shared with anyone, and she was quick to change allegiances when it suited her purposes. While she staunchly adhered to the stipulations of the Rule of Two, Lumiya preferred to work alone, often in a hands-on capacity to ensure the successful execution of her goals. Although she briefly entertained the idea of an entire order of Sith in opposition of the Jedi, she ultimately rejected that notion for the doctrine of her predecessors—patience, cunning, and secrecy—a point she stressed with the last of her own apprentices. Like Darth Sidious before her, however, she was not above lying or manipulating power-hungry individuals in her plans, such as when she urged Chief-of-State Thrackan Sal-Solo into attacking the peace conference at Toryaz Station."}, {"tag": "p", "text": "Lumiya was a master strategist who felt that the reward was well worth a properly-assessed risk. She learned to develop well-laid, multifaceted plans, courtesy of Emperor Palpatine, complete with hidden levels of treachery interwoven into each layer, and only revealed herself upon execution of such schemes. While disgusted by politics, Lumiya engaged in their insidious manipulation whenever she deemed such action necessary. She preferred residences far removed from epicenters of galactic activity and steeped in dark-side power, from where she clandestinely arranged events to suit her purposes. Such were her designs that victory for her was a guarantee, even if she suffered a loss in the process. She eventually came to believe that the galaxy was on a rapid descent into chaos and that Jedi leadership, with its expectations far in excess of the capabilities of its constituents, was as ineffective as it had ever been. A Sith, on the other hand, according to Lumiya, had the presence of mind to recognize when intervention was required and to act accordingly. She became more of a pragmatist in her later years and forsook previous obsessions with revenge — or put them on hold — for the greater Sith purpose, one she was unable to personally realize due to the Force-restrictive nature of her cybernetic implants. It was only after the aforementioned revelation did she realize that restoration of peace and stability through rule of a Sith Lord could only be orchestrated by her. Lumiya claimed that she readily welcomed rest from the weariness that overtook her in the end, born of a life spent in relentless pursuit of Sith destiny."}, {"tag": "h3", "text": "Relationships"}, {"tag": "p", "text": "From their first meeting, there was chemistry between Shira Brie and Luke Skywalker, and what began as a flirtatious friendship rapidly developed over the course of several dangerous missions performed together, until it blossomed into a full-blown romance. Despite the expressed mutual affirmation of their feelings, the relationship was purely emotional, and never consummated physically, aside from a passionate kiss shared between them just before Skywalker departed for a mission. Deep care gave way to seething hatred as Brie, now Lumiya, named Skywalker responsible for her disfigurements. Sworn vengeance led Lumiya to harass him and his family time and again as she sought to make Skywalker suffer as she had, despite attempts made by the Jedi to persuade her to reject the dark side. Such was the terror perpetrated by Lumiya against Skywalker that he made a point to teach his future Jedi students about her. Lumiya and her former lover were reunited in 40 ABY as she secretly plunged the galaxy into a war from which only Jacen Solo could rise and rule. Even though she claimed that her hatred of Skywalker had abated years prior, the Jedi Grand Master was hesitant to believe her and was even more reluctant to agree to a momentary truce with Lumiya by way of a handshake. Nevertheless, her actions dictated otherwise, as she attempted to lure both Skywalker's son and nephew to the dark side, the latter of whom killed Skywalker's wife while on that path."}, {"tag": "h3", "text": "Interactions"}, {"tag": "h4", "text": "Darth Vader"}, {"tag": "p", "text": "Upon the hour of her hand-selection by the Dark Lord of the Sith, Shira Brie was completely loyal to Darth Vader. The injuries sustained during the catastrophe of the secret armada battle and the measures required to save Brie's life engendered a sense of kinship between the two, to whom some thought she even bore a slight resemblance. Although her service was further extended toward Palpatine, into whose court she entered as an Emperor's Hand, the apprenticeship of Shira Brie, now Lumiya, was secretly maintained with Darth Vader. Lumiya was devastated by the loss of her Masters at the Battle of Endor, and was thenceforth wary when on the rare occasion she encountered one whose claimed allegiance was to the Sith. She harbored a great hatred for those who bore responsibility for the death of her mentor and kindred spirit, the memory of whom she would later reflect on with pity. In her later years, Lumiya believed that the ascendancy of the dark side could only be realized through the line of Anakin Skywalker, and chose his grandson, Jacen Solo, as the means by which she would do so."}, {"tag": "h4", "text": "Myrette Davani"}, {"tag": "p", "text": "A friendship blossomed immediately between Brie and fellow Imperial Cadet Myrette Davani that lasted for the duration of their academic lives. From local pubs to sessions in the combat flight simulator, Brie and Davani shared many of the same interests and were often together. The two women acted as each other's support, and Brie was credited as an inspiration to Davani for many of her own personal successes at the Academy. However, as Brie's private instruction under Darth Vader became more frequent, she became withdrawn and less inclined to express herself to Davani, who was nevertheless determined to watch her more closely. Several incidents, including the deaths of Bantha Squad and the disabling of a Caridan cantina patron, caused Davani to question just how well she knew Brie. By the time of their graduation, Brie's drastically changed behavior made Davani wonder if she had ever truly known her at all."}, {"tag": "h4", "text": "Leia Organa Solo"}, {"tag": "p", "text": "During her time with the Rebel Alliance, Shira Brie was friendly with Leia Organa and displayed no animosity, feelings that were far from mutual. However, the displeasure displayed by Organa was eventually replaced with gratitude and respect for Brie's actions in battle on Shalyvane, expressed with the presentation of the prestigious Burdine Cluster and conference of the rank of captain upon Brie. Years later, Leia Organa earned the enmity of Lumiya upon their meeting on Herdessa, when the Sith Lady's slavery operation was exposed and toppled by the Alderaanian Princess. Although Lumiya swore revenge against Organa, she ultimately abandoned that promise and was indifferent to her survival. However, when the Dark Lady was certain that Organa Solo's son would indeed become a Sith Lord—that which Leia hated most—she admitted to enjoying a sense of satisfaction at causing the Princess anguish."}, {"tag": "h4", "text": "Mara Jade Skywalker"}, {"tag": "p", "text": "Immediate and intense dislike colored the initial meeting between Lumiya and Mara Jade, the latter of whom was infuriated to learn of the Dark Lady as another \"Hand\" of Emperor Palpatine. Their later encounter on Caprioril only served to agitate their mutual hatred, a rivalry compounded by Jade's later marriage to Luke Skywalker. By 40 ABY, however, Lumiya claimed that she had moved beyond the dislike she had previously harbored for Jade Skywalker and her family, despite actions that ran contrary to her assertion. The relationship once enjoyed by Luke Skywalker and Lumiya was a note of contention with his wife Mara who, before and after their marriage, had been an enemy of the Dark Lady. Lumiya slightly resented Mara Jade Skywalker in retrospect, whom she felt had been the recipient of more favorable opportunities in life, despite their similar backgrounds."}, {"tag": "h4", "text": "Jacen Solo"}, {"tag": "p", "text": "When it became apparent to Lumiya that Jacen Solo was the only viable candidate for Sith Lordship, helping him achieve what she believed was his destiny became her paramount purpose. Years of scrutiny, consideration, and collaboration went into her ultimate decision, and Lumiya was very careful to orchestrate events in such a manner that he would be compelled to agree to ally with her. She recognized that once he realized the full extent of her manipulations, he would hate her, but took comfort in the fact that he would also understand and thereby love her. Lumiya adopted the title of and asserted herself as the Master, a position challenged by Solo on several occasions but nevertheless reinforced by the Dark Lady. She repeatedly stressed the importance of Solo as the instrument of galactic stability and was willing to sacrifice herself on several occasions to prove her sincerity to him. Even though she came to understand Solo's way of thinking, the lingering humanity of his that she attributed to his flesh still caught her off-guard at times. Still, when she realized that Solo had had a child, and that it had been the child's death he had contemplated while on his path to Mastery, the Dark Lady was moved to tears. She thought Solo's choice of soap, a plain antiseptic, was both touching and funny, and she planned to teach him to indulge himself more when he became a Sith Lord. She was intrigued by how austere his quarters became each time she visited and resolved that if Solo had discarded his personal effects as a symbol of the end of his old life and the beginning of his new one, it was just as well."}, {"tag": "p", "text": "Lumiya often pondered whom it was that Jacen Solo had to sacrifice and recognized the possibility that, in the way of the Sith, she might be that individual. She also became increasingly concerned with his choice of apprentice and was adamant in her belief that Ben Skywalker was the most suitable candidate, given his hereditary Force potential and his preoccupation with impressing Solo, the latter of which she felt made Skywalker a slave to his emotions. Lumiya praised Solo's ability to control the boy, but also cautioned him to not be hindered by his affection for his young cousin. When Solo suggested that he might abandon the prospect of Skywalker as his apprentice for one whom he believed would serve him better, such as Jedi Knight Tahiri Veila, Lumiya responded with extreme disapproval. She eventually abandoned that perspective after the conclusion of Skywalker's quest for the Amulet of Kalara. She doubted Solo's commitment to the Sith from time to time and reminded him that theirs was a cause far greater than the lives of his friends and family. Despite his total mastery of the Force and potential for Sith greatness, Jacen Solo's preference to engage ordinary beings on their terms as opposed to dominating them through the Force frustrated Lumiya immensely."}, {"tag": "h4", "text": "Alema Rar"}, {"tag": "p", "text": "From the moment of their first meeting, Lumiya was aghast by Alema Rar's fragile mental state—a sentiment shared by Ship—and resolved to delicate handling more often than not, lest she provoke the wrath of a madwoman. She was especially disturbed with the fragmented hive-mind quality she discovered upon a mental probe of Rar's mind, and she likened the Twi'lek's Force presence to that of shards of broken glass in her mouth. Lumiya was initially wary of the Twi'lek's motives and made a point to reveal only the smallest of details with regard to her own plans, going so far as entertain the notion of killing Rar herself to eliminate the potential liability she posed. Frequently frustrated with Rar's short attention span, incessant questioning into the agenda of the Sith, and her obsessive desire for \"Balance,\" Lumiya nonetheless realized the benefits in Rar as an accomplice and readily exploited her unique espionage and assassination talents, even though the latter believed that Lumiya had quite the misunderstanding about the extent of their partnership. The relationship was something of a strain on the Dark Lady's patience; Lumiya refused to provide Rar safe haven, and when it seemed as though it would be impossible to otherwise reason with the Dark Jedi, Lumiya acted as insane as Rar, a tactic that immediately sobered her with fear. Lumiya was often moved to insult Rar, despite her apparent mental instability, but when her pejoratives became slightly more scathing than Rar cared to tolerate, Lumiya obliged her with a demanded apology. Although the nature of their unique deformities differed considerably, Lumiya still felt a modicum of kinship, even pity, for Alema Rar, and she urged the Twi'lek to fuel her rage with the memories of her myriad losses."}, {"tag": "h4", "text": "Ship"}, {"tag": "p", "text": "In a galaxy where the Sith had been all but extinct for more than four thousand years, Ship was overjoyed to discover the existence of Lumiya, whom it recognized as a descendant of its creators and came to for instructions. The initial sense Lumiya had of Ship unsettled her, but when she determined what it was, she was moved by its seeming care for her. Upon her appropriation of the vessel, she immediately felt a sense of comradeship with Ship and expressed many unguarded emotions—a rare thing for Lumiya—when it appeared to show her a measure of affection. Lumiya and Ship conversed frequently throughout their journeys, and the Dark Lady grew annoyed with its relentless questioning into the whereabouts of the other Sith, or \"dark ones,\" as it referred to them. Lumiya usually agreed with its character assessments of various individuals, and was pleased to learn that Ship had detected faint residual traces of darkness within both Mara Jade Skywalker, a former Emperor's Hand, and her son Ben, whom Lumiya had discounted as unworthy of Sith apprenticeship. However, when Ship later realized that Lumiya lacked sufficient Sith knowledge to be considered a Master by its standards, and therefore was unable to fully command it, Lumiya lost control of the Meditation Sphere to a mere Jedi Padawan."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "h3", "text": "Ace pilot"}, {"tag": "p", "text": "A woman with a natural talent for astrogation, Shira Brie spent countless hours in combat simulation to sharpen her piloting skills. Perseverance paid off, and Brie graduated as the top student of the Coruscanti Pilots Institute. Afterward, she maintained a consistently high record of success throughout her time at the Carida Academy. As the school's premier pilot, Brie was selected to fly an Imperial personnel shuttle to Carida, an honor she ultimately turned down and one her friend Myrette Davani could benefit from the recognition. Brie was able to fly space-bound vehicles of all kinds, and she operated their counter and defensive measures with a practiced hand. Her reputation as a crack starfighter pilot was extended to her service with the Rebel Alliance, where she flew T-65 X-wing starfighters and TIE/LN starfighters in several key engagements. When she allied herself years later with the Nagai as Lumiya, she dismayed opposing pilots in her prototype Screamer starfighter. Toward the end of her life she piloted and controlled an antiquated Sith Meditation Sphere, a Force-sensitive vehicle that received instructions via the dark side."}, {"tag": "h3", "text": "Combat skills"}, {"tag": "p", "text": "As a cadet of the Imperial Military Academy of Carida, Brie partook in the extremely-aggressive stormtrooper training regimen, where her presence of mind and top-notch survival skills allowed her to excel. She became proficient in not only armed combat but also in all forms of hand-to-hand fighting, including Echani and Noghri Stava. While knowledgeable of lightsabers, Lumiya did not wield one; she instead preferred a custom-made lightwhip, one that she utilized with lethal efficiency and that was often more than a match for potential opponents. Indeed, she fought on equal and sometimes superior ground with Jedi Grand Master Luke Skywalker, widely considered the greatest living swordsman in the galaxy. Those unfamiliar with her whip were immediately confounded, while some premeditated strategy in preparation for a confrontation with Lumiya. Others recognized their own inferiority and abandoned the idea entirely."}, {"tag": "h3", "text": "Force ability"}, {"tag": "p", "text": "Shira Brie was naturally strong in the Force, but her initial dark side training consisted of rudimentary Force applications, as her primary focus was Imperial intelligence. She entered into a hibernation trance following the battle during which she was maimed and was thus able to survive until rescue was effected. Upon her transformation into Lumiya, Brie's already advanced training reached new plateaus by way of Sith wisdom bestowed upon her by Darth Vader. However, while unlimited paths to power were made available to and explored by Lumiya, her requisite prosthetic enhancements considerably limited her ability to realize many of them. Thus, while her knowledge of battle meditation and the extremely-effective Sith battle coordination was absolute, she was unable to actually influence combat in that manner, a handicap she attributed to her prostheses."}, {"tag": "p", "text": "Lumiya nevertheless displayed a considerable mastery with mind tricks and telekinetic Force applications, although she considered her own facility with the latter to be somewhat limited. A wealth of Sith knowledge by way of ancient texts, holocrons, and other artifacts was at her disposal, including the Sith oracle stone and King Adas' holocron, the oldest such device. Among her other skills were farsight, various Force deflection applications, mental and emotional manipulation, focused resolve augmentation, and the ability to emanate waves of pure hatred. Lumiya's most prominent talent, however, lay in the creation of illusions of all kind: visual enhancements of one's appearance when viewed through reflective surfaces; concealment of her own appearance, and the reverse; dazzling alterations of reality; doppelgangers whose sustained damage was inflicted instead upon the perpetrator; phantasms born purely of the dark side. Force phantoms were of a considerable drain on Lumiya's reserves and thus required the well of dark side energy found beneath The Home to fuel the technique, as well as copious amounts of rest afterward. Diminished health elevated the strain and threatened to wrack the Dark Lady with spasms of pain and exhaustion. She nonetheless perfected the ability and was able to create and direct hundreds of them simultaneously, in different shapes and sizes, and at multiple targets—all across the galaxy."}, {"tag": "h3", "text": "Spy"}, {"tag": "p", "text": "Shira Brie was trained as an espionage agent of the highest caliber at the Intelligence Academy of Carida. She was hand-selected by Darth Vader to serve as his personal Rebel Alliance infiltrator, a job which she performed impeccably. She gave no hint of her true allegiance, and members of the highest tiers of the Alliance hierarchy had not the slightest clue of Major Brie's duplicity, even as she dwelt regularly amongst them. Brie went as far as to bring several members of the Alliance to Shalyvane, a world on which she was required to report her progress through secret means, much to their ignorance. Her spy training granted her the ability to adapt to all environments and any situation, and allowed her to hide anywhere, and indefinitely."}, {"tag": "p", "text": "Between employed agents, assumed identities, and Force illusions, Lumiya was able to infiltrate various buildings, residences, and organizations with its members none the wiser. She was an accomplished swimmer, a skilled slicer, and fluent in multiple languages, including Galactic Basic Standard, Huttese, Mon Calamarian, and Bothan."}, {"tag": "h2", "text": "Equipment"}, {"tag": "h3", "text": "Cybernetics"}, {"tag": "p", "text": "The accident that left Lumiya terribly scarred required the fitting of extensive prostheses and additional engineering that increased her strength, stamina, and pain threshold. Her original prostheses included a rather awkward full suit of light body armor, equipped with a vocabulator and blasters incorporated into the hands. The improved durasteel armor she received just prior to the Nagai–Tof conflict no longer included integrated blasters, but was impervious to vibroweapons and caused especially serious injury when an organic being connected with a physical attack. Extensive circuitry and life support systems comprised her replacement cybernetics, complete with a utility belt, stylized helmet, and life support girdle reminiscent of the late Darth Vader. A fine metallic sheen covered the surfaces of her armor and often reflected whatever light in which Lumiya found herself currently bathed. Both the original and replacement sets of armor were highly susceptible to close-range blaster fire. The Dark Lady kept replacement cybernetics, along with the lubricants and protein drinks she required, in a locked room of her asteroid habitat."}, {"tag": "h3", "text": "Weapons"}, {"tag": "p", "text": "Shira Brie learned to handle a number of weapons as a student of the Caridan Military Academy. She had extensive knowledge and experience with ranged energy blasters, throwing weapons, and projectile armaments. Brie was fully-skilled in the operation of a prototype MT-ST as well."}, {"tag": "p", "text": "In the wake of the Imperial defeat at Endor, Lumiya assumed direct control of a modest fleet of warships as she began to consolidate her resources, but eventually abandoned her considerable firepower and adopted more subtle methods of malice where brute force no longer availed. Poisons, explosive-rigged datapads, meter-long durasteel darts, vibroweapons, and lethal traps were all within her arsenal. She was able to manually disable a baradium warhead, even going as far as to extract the proton detonator charge and reinstall it as a combat fail-safe. Her signature weapon, however, was her lightwhip: an exotic device rarely seen among contemporary melee weapon handlers, constructed of Mandalorian iron and powered by shards of Kaiburr crystal. It differed from the lightwhips wielded by the Sith of old, in that it was a multi-stranded device of equal parts studded leather, strands of metal, and coherent lightsaber energy. Lumiya's lightwhip had a five meter attack radius, but she was also able to shorten the lengths of its tendrils in combat when more precise control over a shorter area was required. She could incorporate the deactivated device into one of her prosthetic limbs, and at other times, wrapped it around her waist concealed under a sash."}, {"tag": "h3", "text": "The Home"}, {"tag": "p", "text": "After she took up residence in her final home, the estate once occupied by the ancient Sith Lord Darth Vectivus, Lumiya installed countermeasures to thwart unwanted intruders in myriad ways: hidden baradium explosives and flechette discharges; a reverse airlock followed by a poison decontamination shower; even a Force illusion of Lumiya that redirected any sustained attack damage back to the assailant; all purposed with the protection of Vectivus' former abode from enemies of the Dark Lady of the Sith. Lumiya refrained from decorations in the living quarters, save for the addition of Force-influenced mirrors which always made the reflection of the beholder far more attractive than they actually were. Lumiya preferred to withdraw to the summit of her habitat—where the dark side power of the asteroid, albeit hundreds of meters below, was strongest—to project her Force phantoms."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "David Michelinie and Walt Simonson collaborated on the creation of Shira Elan Colla Brie for the fifty-sixth issue of the Marvel Star Wars comic series, Coffin in the Clouds, wherein her surname is initially spelled \"Brei.\" Following Brie's February 1982 debut, Michelinie and Simonson significantly developed her character over the course of the next ten issues. One in particular, Star Wars 63, went into considerable detail about the interaction between Brie and Darth Vader. In Glenn Greenberg's How to Do Star Wars the Marvel Way, an article written for Back Issue Magazine 9, Michelinie and Simonson expressed a desire to extend the storyline wherein Brie is supposedly killed by Skywalker, which both also regarded their personal favorite. Her first appearance as Lumiya was two years after she appeared as Brie, in writer Mary Jo Duffy's Star Wars 88, illustrated by Bob McLeod and Cynthia Martin. Martin and McLeod also penciled Lumiya in her next two appearances, Star Wars 95 and Star Wars 96. The duel between Lumiya and Luke Skywalker that began in the final pages of No Zeltrons and concluded in the beginning of Duel With a Dark Lady was counted among the 20 Most Memorable Moments of the Expanded Universe, an article written for the eighty-third issue of Star Wars Insider. Duffy and Martin continued to work together for the remainder of Lumiya's Marvel Star Wars appearances: Star Wars 97, Star Wars 100, and Star Wars 107. The StarWars.com Databank for Darth Vader referred to Lumiya as a \"proxy villain,\" one of many through whom Vader plotted throughout the Marvel Star Wars series."}, {"tag": "p", "text": "It would be nearly ten years before Lumiya appeared again in the Star Wars universe, in managing editor of Star Wars Gamer Michael Mikaelian's short story Lumiya: Dark Star of the Empire, written for Star Wars Galaxy #3. In 2001, veteran Star Wars writer Abel G. Peña wrote The Emperor's Pawns, an article included in Star Wars Gamer 5, one which expanded on many of the elements that were only touched on in previous appearances and sourcebook references. Peña confessed to an immediate interest in Lumiya as a teenager, which led to an extensive, expensive, and ultimately successful hunt for each of her comic appearances. When the opportunity presented itself for his own addition to Lumiya's history, his focus was on exploration of the depth of the bond between her and Darth Vader, foundations of which were first laid by Michelinie and Simonson, and expanded on later by Martin and McLeod. He also expressed concerns that identifying her as an Emperor's Hand would be a \"tough sell,\" but was able to nonetheless incorporate it based on the retcon given in The Essential Chronology, which first established her so. At the time he wrote The Emperor's Pawns, Peña was able to share his fondness for Lumiya with still-managing editor of Star Wars Gamer Michael Mikaelian, also a fan and one-time writer of the character."}, {"tag": "p", "text": "Beginning in May 2006, Lumiya was featured in a critical role for the nine-part Star Wars: Legacy of the Force novel series, wherein she served as the primary antagonist for the first five installments. When co-authors Aaron Allston, Troy Denning, and Karen Traviss, each of whom shared a third of the series, began their collaboration, the idea of a being known only at that point as \"the wizard\" was intended to portray Jacen Solo's Sith Master. Lumiya had not been considered; in fact, ideas for beings of other species were given, including Anzati. Executive director of Lucas Licensing Sue Rostoni, however, suggested that the trio use Lumiya as their wizard character, an idea they accepted. For the first of the nine novels, titled Legacy of the Force: Betrayal, Allston toyed around with how to feasibly associate a character of thirty or forty in-universe years prior to a character of the current era, specifically Jacen Solo. He credited the rich history of the Sith and the dark side in Star Wars with providing him enough material to create a character of utmost complexity in Lumiya for Betrayal. Traviss noted the pleasure she took in writing characters with whom she was not previously familiar, Lumiya included. She was especially fascinated with her depiction of Lumiya and Alema Rar's interaction in Sacrifice, giving special attention to their differed perspectives on their various mutilations, and their different approaches to their problems with the Solo/Skywalker family."}, {"tag": "p", "text": "When he was contracted to provide drawings for the upcoming reference book Jedi vs. Sith: The Essential Guide to the Force, artist Tommy Lee Edwards initially sketched the duel between Lumiya and Luke Skywalker on Terephon, featured in Sacrifice, with the Dark Lady on the receiving end of a decapitating strike delivered by the Jedi Grand Master. However, Lucasfilm felt as though the image was too violent, and Edwards chose instead to use one that depicted both combatants alive. Abel G. Peña later expressed his satisfaction with Exile's mention of the confrontation on Caprioril between Lumiya and Jade Skywalker and hoped that Sacrifice, Lumiya's final appearance as a living character, would spark a renewed interest in that which he originally alluded to in The Emperor's Pawns. Since its release, he has attempted to obtain licensing for the story, but to no avail. In the article Who's Who in Soulcalibur IV on StarWars.com, a grudge match was suggested between Lumiya and the character Ivy of Soul Calibur. In addition to features in a wide variety of reference and source material, several focus closely on Lumiya, including the one hundred eleventh issue of The Official Star Wars Fact File, as well as exclusive entries in both the StarWars.com Databank and 2008's Complete Star Wars Encyclopedia."}, {"tag": "p", "text": "Lumiya and her lightwhip were included in Hasbro's Legacy of the Force set of Star Wars Miniatures. In 2009, Hasbro released both a Lumiya action figure in a comic pack with Luke Skywalker and Marvel's Star Wars 96, and a Shira Brie figure as part of the Evolutions: Rebel Pilot Legacy III set."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "As Lumiya became a more popular character, many discrepancies and contradictions arose within the variety of sources that expanded her history. The Official Star Wars Fact File 111 says that Lumiya was shot down by Luke Skywalker during their mission to Cloud City, when in fact she was shot down during the battle of the secret armada, which appeared in Star Wars 61: Screams in the Void. While Lumiya's Databank entry claims that she was recovered from her destroyed TIE fighter by Darth Vader's agents, The Emperor's Pawns states that Vader himself discovered Brie in the damaged starfighter. Despite the sources that identify her eyes as green, Mara Jade describes them as \"cold gray\" in Jedi vs. Sith: The Essential Guide to the Force. Lumiya: Dark Star of the Empire lists her height as 6 ft., or 1.83 meters, as late as the battle of Endor, but The Official Star Wars Fact File 111 and The New Essential Chronology lists it as 5 ft. 2 in., or 1.6 meters. Furthermore, the novel Legacy of the Force: Tempest, written by Troy Denning, states that Alema Rar is considerably taller than Lumiya, but the New Essential Chronology has them both as the same height at 1.6 meters, and Lumiya is the taller of the two based on the 1.83 meters given for her in Lumiya: Dark Star of the Empire. Dark Star of the Empire also mistakenly identifies Lumiya as having been previously a Jedi Knight that fell to the dark side of the Force. The final duel between Luke Skywalker and Lumiya that occurs in Sacrifice describes her as having removed her cowl to fight bare-faced, while the depiction of the same confrontation in Jedi vs. Sith: The Essential Guide to the Force has the Dark Lady still clad in her trademark headdress."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}