{"url": "Lumpawaroo/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Kashyyyk residents", "Category:Males", "Category:Members of the First Wookiee Expeditionary Force", "Category:Wookiees"], "nodes": [{"tag": "h1", "text": "Lumpawaroo"}, {"tag": "p", "text": "Lumpawaroo, also known as Waroo, was a Wookiee male who emerged from the shadow of his famous father Chewbacca to become a brave, talented, and powerful warrior within the Rwookrrorro community on the planet Kashyyyk. Born Lumpawarrump in 1 BBY and known as Lumpy throughout his youth, he was raised by his mother Mallatobuck and his grandfather Attichitcuk while Chewbacca served a life debt to and traveled the galaxy with the Human smuggler Han Solo. Lumpawarrump idolized his father and constantly dreamed of the elder Wookiee's adventures while Chewbacca was away. While gathering wasaka berries in Kashyyyk's dangerous Shadowlands in preparation for Chewbacca's 200th birthday, a young Lumpawarrump hoped to be as brave as his father but ended up hiding, terrified, from the various creatures that lurked in the forest. Although his father rescued him and brought him home, the ordeal caused Lumpawarrump considerable trauma. Coupled with the absence of a father figure to help him grow into a brave young man, the experience turned Lumpawarrump into a shy and timid Wookiee who rarely left his home. Unless Chewbacca was around for Lumpawarrump to attempt to impress, he stayed away from danger and did not find his rrakktorr, the eager and defiant strength of a male Wookiee's heart."}, {"tag": "p", "text": "In 1 ABY, two years after Lumpawarrump's misadventure in the Shadowlands, he and his family were visited by members of the Galactic Empire on the Wookiee holiday Life Day. The Imperials were searching Kashyyyk for ties between its inhabitants and the Rebel Alliance and remained in Lumpawarrump's home for some time before Chewbacca and Solo arrived to celebrate the holiday. Chewbacca and Solo helped free Lumpawarrump and many other Wookiees from slavery at the hands of the Nagai Knife three years later, and in 8 ABY, Lumpawarrump and Mallatobuck visited Chewbacca at his apartment on the galactic capital of Coruscant. The three became tangled in an Imperial scheme to destroy the New Republic that Chewbacca and Solo served, and Lumpawarrump was kidnapped by several Coruscanti underdwellers and taken to a secret Imperial detention center in the planet's underlevels. After his parents rescued him, the three Wookiees were able to prevent the underdwellers from unleashing a nerve toxin at an upcoming New Republic governmental banquet."}, {"tag": "p", "text": "In 16 ABY, Lumpawarrump's coming-of-age hrrtayyk ceremony was interrupted when Chewbacca, who was guiding his son through it, learned that Solo had been kidnapped by the Yevethan Duskhan League. Lumpawarrump tagged along on the rescue mission so that he might prove himself, and father and son stormed the Yevethan Star Destroyer Pride of Yevetha and rescued the captive Solo. Lumpawarrump found his rrakktorr, passed his hrrtayyk, and earned his new name, Lumpawaroo, after receiving a blaster wound in the leg and meeting it without flinching. Chewbacca was able to spend more time with Lumpawaroo over the next several years, but when the elder Wookiee was killed in 25 ABY, Lumpawaroo and his cousin Lowbacca pledged to take over Chewbacca's life debt to Solo. Solo delayed them for four years in order to grieve the loss of his best friend, but in 29 ABY, they reaffirmed their convictions and attached themselves to Solo, although they ultimately served him for less than six years. In 40 ABY, Solo and his wife Leia Organa Solo came to Kashyyyk to speak with the planet's Rock Council, and Lumpawaroo guided them across Wroshyr trees for four days as they made their way to Council Rock. Lumpawaroo later crewed the Solos' starship Millennium Falcon and worked to extinguish forest fires that raged across Kashyyyk after an orbital bombardment by the Galactic Alliance Fifth Fleet."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Mischievous youth"}, {"tag": "p", "text": "The Wookiee male Lumpawarrump was born in 1 BBY in the Kashyyyk city of Rwookrrorro to Mallatobuck, a teacher and caregiver who worked in a nearby village's nursery ring. Mallatobuck had recently wed Chewbacca, a mechanic and co-pilot to the Human smuggler Han Solo, and the newlyweds had conceived Lumpawarrump during their honeymoon. Chewbacca had then left the planet with Solo, to whom he had sworn a Wookiee life debt of protection, and Lumpawarrump was born nearly one year later. Chewbacca and Solo returned to Kashyyyk shortly thereafter while on a supply run to the Corporate Sector, and both were overjoyed to discover Mallatobuck holding the newborn Lumpawarrump in her Rwookrrorro home. Chewbacca roared with pride as he realized that he had become a father, and the new parents immediately began to discuss baby names. They ultimately settled on Lumpawarrump, or \"Lumpy\" for short."}, {"tag": "p", "text": "Chewbacca was unable to remain with his new son for long and quickly left with Solo for the Corporate Sector, but he returned to Kashyyyk as often as he could over the subsequent years to visit his family, including a several-week-long visit in 0 BBY. Lumpawarrump, Mallatobuck, and Chewbacca's father Attichitcuk were designated as a Wookiee honor family and were looked after by Chewbacca's close friends on Kashyyyk. While Chewbacca and Solo roamed the galaxy, Lumpawarrump was raised on Kashyyyk by his mother and grandfather. Attichitcuk lived with Lumpawarrump and Mallatobuck in their treetop dwelling and was content to live out his elder years playing with his young grandson."}, {"tag": "p", "text": "Circa 0 BBY, Chewbacca was on his way home to celebrate his 200th birthday with his family, and Mallatobuck began to plan a surprise party for her husband. Lumpawarrump was dismayed when she forbade him to venture into the dangerous Shadowlands of Kashyyyk's forest floor to gather wasaka berries, an essential ingredient of Chewbacca's favorite dessert, but he was cheered up when Attichitcuk told him a story of Chewbacca and Solo battling Trandoshan slavers. Inspired, Lumpawarrump sneaked out of his house to hunt for wasaka berries in the hope of becoming as heroic as his father. The young Wookiee was unable to find any berries near his house, and he began to cautiously descend a rope ladder into the jungle's lower levels. He soon lost his footing and tumbled down a Wroshyr tree into the Shadowlands, landing in a swamp and attracting the attention of several creatures. Lumpawarrump was very frightened, but he ignored the creatures and continued to search for berries among the swamp's tree roots, confident that his father would not have give up if faced with a similar predicament."}, {"tag": "p", "text": "When a furry ball-shaped creature lunged at him, Lumpawarrump abandoned his quest and dove into a hollow log. He remained there, shaking with fear, until he heard the sound of a passing starship. Lumpawarrump poked his head out of the log and saw his father flying an explorer craft through the Shadowlands; Chewbacca had been sent to the swamps by Mallatobuck to search for their missing son. Lumpawarrump climbed into his father's craft but quickly began to cry, disheartened that he had failed to find any wasaka berries. As they sped toward their home, Chewbacca told his son that his persistence in the face of fear was a telltale sign of a hero, and Lumpawarrump immediately brightened. He avoided a scolding from his mother when they were greeted at their home by hundreds of Wookiees who had gathered for Chewbacca's surprise party. Along with Han Solo, the gathered Wookiees celebrated well into the night, dancing, playing games, eating Mallatobuck's soufflés, and watching fireworks."}, {"tag": "h3", "text": "A Life Day to remember"}, {"tag": "p", "text": "In the following years, Chewbacca and Solo became key members of the Rebel Alliance during its struggle against the Galactic Empire. Lumpawarrump's adventure in the Shadowlands become a family fable that further exaggerated the danger posed by the creatures in the Shadowlands with each retelling. In 1 ABY, Lumpawarrump was at home with his mother and grandfather on the Wookiee holiday Life Day as they prepared to receive Chewbacca and Solo for a celebration. Lumpawarrump happily ran through the house and played with a wooden model of an X-wing starfighter, but he was reprimanded by Mallatobuck for bothering his grandfather and for trying to sneak one of the Wookiee-ookiees that she had baked. Mallatobuck assigned him the task of taking out the garbage; once outside, Lumpawarrump playfully walked along the top of the railing that surrounded his home's balcony before going back inside."}, {"tag": "p", "text": "After he completed his task, Lumpawarrump was treated to a tabletop performance by some holographic tumblers, which Attichitcuk turned on for the delighted young Wookiee. After the performance, his elation was interrupted by his mother's insistence that he clean dishes in the kitchen sink. When he finished with the dishes, an Imperial officer appeared on the home's viewscreen and announced that the Empire had declared martial law on the planet due to suspected Rebel activity. Lumpawarrump grew worried and hid when he heard a knock on the front door, but the visitor was merely Saun Dann, a Human trader and a friend of the family. He brought Life Day gifts for all three Wookiees, including a mini-transmitter for Lumpawarrump. The young Wookiee rushed upstairs to his room to open the gift, but he raced down to the foyer even faster when he heard the sound of Solo's starship, the Millennium Falcon, flying overhead. When he and Mallatobuck opened the front door, they were shocked to find two Imperial stormtroopers pointing blaster rifles at them."}, {"tag": "p", "text": "Seeking evidence of ties to the Rebellion, the stormtroopers entered the house along with a technician and an Imperial commander. As the troopers searched the home, the technician asked Lumpawarrump about his father's whereabouts, only to have his fingers bitten in response. Mallatobuck and Dann prevented him from striking Lumpawarrump, and Dann was soon told to leave by the Imperials. Lumpawarrump protested when the Commander ordered his room to be searched, and when Attichitcuk attempted to block the trooper's path, the elderly Wookiee was thrown aside. The Commander then intervened and calmed a furious Mallatobuck down. The search proceeded, and Mallatobuck consoled her son by letting him watch a cartoon that featured Chewbacca, his Rebel companions, and the bounty hunter Boba Fett. When the cartoon caused him to scream, Lumpawarrump quickly changed the screen of his video book to display a simple game in order to fool the curious Commander. Although he enjoyed the cartoon, his dismay returned afterward when he discovered that the Imperials had beheaded his stuffed bantha. Alone in his room, Lumpawarrump cheered himself up by turning on his mini-transmitter and watching an instruction cassette that taught him how to assemble it."}, {"tag": "p", "text": "After Lumpawarrump followed the instructions given by the Amorphiian Dromboid, he transmitted a \"return to base\" signal to the Imperial officer's comlink. The gambit worked, and the Commander departed the home with the technician and one trooper, but, suspecting that Chewbacca was a Rebel, left the stormtrooper B4711 behind to apprehend the Wookiee upon his return. When the \"return to base\" signal continued to chime, B4711 entered his room, discovered the tricky, and broke the device. Frightened, Lumpawarrump rushed outside and into the arms of Chewbacca, who had just arrived home. B4711 pointed his blaster rifle at the Wookiees, but Han Solo snuck up behind him and batted the rifle away. B4711 then tripped over a log and fell to the forest floor below. Lumpawarrump, Chewbacca, and Solo went inside for a joyous reunion, but Solo quickly left to ensure that the Imperials did not find the Millennium Falcon."}, {"tag": "p", "text": "As Lumpawarrump and his family delighted in Chewbacca's presence, Dann returned; when an Imperial officer appeared on the viewscreen and inquired about B4711, Dann convinced him that the stormtrooper had stolen some of Mallatobuck's food and fled. Dann then departed, and Lumpawarrump and his family donned red robes, gathered Life Day orbs, and made their way to the celebratory Tree of Life to enjoy Life Day among a large gathering of Wookiees. Solo and his companions Luke Skywalker, Leia Organa, and the droids C-3PO and R2-D2 joined them, and Organa sang a song. Afterward, Lumpawarrump and his family returned home for a Life Day feast. At some point between 0 BBY and 3 ABY, a painting of them dressed in their Life Day robes was available in the galaxy."}, {"tag": "p", "text": "At some point before or during 4 ABY, Lumpawarrump drew a picture of a Wookiee surrounded by planets and stars and gave it to Chewbacca. The picture was taped to an interior bulkhead of the Millennium Falcon."}, {"tag": "h3", "text": "Enslaved"}, {"tag": "p", "text": "In 4 ABY, Solo and Chewbacca participated in the Battle of Endor, which saw Galactic Emperor Palpatine killed and the remainder of the Imperial fleet fragmented. The Rebel Alliance was reorganized into the Alliance of Free Planets. However, the Empire's Wookiee slave trade was taken over early in 4 ABY by the Nagai Ozrei N'takkilomandrife, known to the Wookiees as \"Knife,\" who teamed up with Mallatobuck's traitorous brother Vargi and began to round up Wookiees as slaves. The Nagai were from the satellite galaxy Firefist and had dispatched Knife to create a slave trade that would distract the Alliance while the Nagai invaded the galaxy. When Vargi informed Knife of Chewbacca's status as a Wookiee hero, Knife kidnapped Lumpawarrump, Mallatobuck, and Attichitcuk, hoping to use them as bait and to capture Chewbacca himself."}, {"tag": "p", "text": "Chewbacca, along with Solo and their friend Lando Calrissian, soon arrived on Kashyyyk for a visit and were brought to Chewbacca's home by Knife and Vargi under the pretense of waiting for Mallatobuck to arrive. Knife's other Wookiee companions brought Lumpawarrump and Mallatobuck inside at blasterpoint, fitted Chewbacca with stun cuffs, led all three captives to a nearby spaceport, and left Solo and Calrissian under guard inside the home. The two Humans escaped, however, and Calrissian managed to free Lumpawarrump, his mother, and his grandfather. The four of them made their way to the starship that Chewbacca and several other Wookiee captives were boarding and found Chewbacca and Solo in a brawl with Vargi. Calrissian fired his blaster at a combat knife that Knife was preparing to throw at Chewbacca, who then overpowered a distracted Vargi as his fellow captives rose up against Knife's Wookiee allies. Knife fled the planet in the Cobra, Calrissian's starship, but his attempts to subjugate the Wookiees had failed. The Nagai's invasion of the galaxy was later averted by the Alliance of Free Planets when the two groups joined forces to defeat the Nagai's oldest enemy, the Tofs."}, {"tag": "p", "text": "As Lumpawarrump grew up, his love for his father grew into an idolization. He often played as Chewbacca in the hologame \"Galactic Rebels\" and constantly boasted to his peers that he was as strong as his father. His friends grew bored of his attitude, and his enemies challenged him to back up his words. Lumpawarrump often came home bloodied after the resulting fights and grew more insular as a result. Coupled with lingering trauma from his childhood trip to the Shadowlands, these experiences caused the young Wookiee to rarely leave home, content to remain close to his house and to the Rwookrrorro nursery ring where young Wookiees were raised. Mallatobuck and Attichitcuk did not encourage Lumpawarrump to take part in the unstructured rough-and-tumble play that occurred in the nursery ring, and as such, he did not develop the fearlessly headlong fighting style that was characteristic of Wookiee males. Lumpawarrump did not become close friends with other Wookiees, and he preferred to stay at home playing hologames and dreaming of his father's adventures."}, {"tag": "h3", "text": "His father's son"}, {"tag": "p", "text": "In 8 ABY, Chewbacca and Solo were serving the New Republic, which had succeeded the Alliance of Free Planets, and Lumpawarrump and Mallatobuck visited Chewbacca at his home on the New Republic capital planet Coruscant. Lumpawarrump gathered several souvenirs during his time on the ecumenopolis, and, during the family's final hours together, Mallatobuck informed Chewbacca of their son's troubles with other young Wookiees. The two resolved that Lumpawarrump would spend one or two years with Chewbacca in order to overcome his timidity and learn that his father's life was not one constant holoadventure. As they privately came to their decision, Lumpawarrump left his father's quarters after hearing noises in the adjacent apartment of Solo and Leia Organa Solo, the former smuggler's new wife. Lumpawarrump discovered the Coruscanti underdweller Rath within, who overpowered him and drew a hold-out blaster on the young Wookiee. Rath then forced Lumpawarrump to rifle through Organa Solo's belongings in search of a datapad. When Chewbacca and Mallatobuck entered the apartment in search of their son, they located and threatened Rath, who did not understand their native Shyriiwook tongue. Lumpawarrump, eager for an opportunity to impress his father, charged at Rath, but his foe easily pulled him into a chokehold and retrieved the datapad from a garment bag on the floor."}, {"tag": "p", "text": "Rath prepared to pull Lumpawarrump into the hole in the wall through which he had entered, and claimed that he would return the young Wookiee in three minutes if Chewbacca and Mallatobuck walked away. Lumpawarrump's parents ignored him and ordered their son to attempt to escape; they then charged at Rath just as Lumpawarrump began to struggle. Rath lost both Lumpawarrump and his blaster in the ensuing chaos, but he escaped through the hole into a service run with the datapad. Chewbacca ascertained that Rath had been a spy in search of valuable information contained on the datapad, and he prepared to call New Republic Security as he praised his son for slowing the spy down. Lumpawarrump, enthused by the compliment and convinced that he was in the middle of a \"Galactic Rebels\"–like scenario, leaped into the hole in the wall. He disobeyed his parents' commands to stop and instructed them to meet him at the bottom of the service run as he climbed down after Rath. Chewbacca and Mallatobuck were too large to fit into the hole and thus made their way to its drop-off point in the Level 2012 Physical Plant below."}, {"tag": "p", "text": "At the bottom of the service run, Lumpawarrump observed Rath arguing with two of his underdweller companions about the approval of their boss. When they stated that they had only ten hours to slice the datapad and hurried away, Lumpawarrump began to follow a trail of blood left by Rath rather than wait for his parents. He left distinctive footprints in the blood puddles so that they could track him, however. When Rath and his companions entered a clean-out door on an overpressure pipe, Lumpawarrump grabbed the left feet of the last two to enter and held on, hoping to take them prisoner. Chewbacca and Mallatobuck caught up to him at that point, but desperate blaster shots fired from Rath and his companions startled Lumpawarrump, caused him to let go of the feet and to stumble away from the pipes. After Chewbacca ensured that their enemies were gone, he and Mallatobuck scolded Lumpawarrump for rushing ahead without them. Lumpawarrump told his parents what he had overheard, and as they began to plan their next move, a member of Rath's group reached out from the clean-out door, grabbed Lumpawarrump, and drew him inside the pipe and away from his parents."}, {"tag": "p", "text": "Lumpawarrump was brought into an airspeeder where Rath's boss, an Imperial IT-3 Interrogator droid nicknamed \"It,\" was waiting. The droid predicted that Chewbacca and Mallatobuck would follow them to the Imperial detention center for which they were headed, and it instructed its underlings to hold the young Wookiee in the center's hangar until his parents arrived. They then discussed a nerve toxin called zemex. After arriving at the hangar, several of the underdwellers attempted to hold the young Wookiee still. Lumpawarrump put up a fight, however, breaking noses and dislocating jaws of his captors. His parents were close behind him, and Mallatobuck chased the underdwellers off. With the knowledge that a trap had been set for them, Lumpawarrump tried to drag his parents deeper into the complex, but they interrupted his attempts to warn them and refused to budge until laser turrets appeared and fired at them. Lumpawarrump and Mallatobuck raced through a security door and into a group of underdwellers; Lumpawarrump grabbed the arms of two of them and pointed them to the floor in an effort to prevent them from accurately firing their blasters. Mallatobuck bent bodies in wrong directions, and Chewbacca entered close behind them and finished off the group with a heavy blaster."}, {"tag": "p", "text": "The three found themselves in a prisoner-processing area, and Chewbacca blasted their way into an adjacent guard station before asking Lumpawarrump what he had learned while in the underdwellers' custody. When Lumpawarrump told them about the interrogator droid, Chewbacca began to search for a way to escape that would allow them to avoid the guns of the turrets. When he climbed a ladder into a command deck overlooking the hangar, he discovered ISBy, an ISB-120 slicer droid, working on a datapad. Lumpawarrump wanted to rush up behind Chewbacca and subdue it, but a firm reprimand from his father dampened his resolve. Lumpawarrump and Mallatobuck waited as Chewbacca entered the command deck, but they eventually followed him up when they heard the sound of blasterfire. They found the droid and the datapad destroyed, Rath unconscious, and a female underdweller pointing a blaster at Chewbacca. As they silently approached, the underdweller was contacted by \"It,\" and the ensuing conversation revealed that the destroyed datapad was a decoy. Mallatobuck snuck up behind the underdweller and thieved her weapon, and Lumpawarrump used Rath's blaster to fire three shots at a desk to convince \"It\" that the underdweller had shot the three Wookiees. \"It\" ended the conversation, and Chewbacca knocked the underdweller unconscious."}, {"tag": "p", "text": "Chewbacca and Mallatobuck were ready to escape, but when Lumpawarrump mentioned that he had overheard the underdwellers talking about zemex, Chewbacca realized that they were planning to release it at an upcoming governmental banquet, about which Organa Solo's datapad had given them information. The Wookiees spotted the underdwellers loading the toxin into an airspeeder in the hangar, and Lumpawarrump offered to enter the hangar and act as bait while his parents attacked. With no better idea of his own, Chewbacca reluctantly approved, and Lumpawarrump climbed out of a hole that had earlier been blasted in the command deck and down into the hangar. After he was spotted, his parents rushed into the hangar from the corridor and downed several distracted underdwellers with their blasters. The three Wookiees cut off the return fire by taking shelter behind a row of zemex canisters; Chewbacca then lifted a canister and began to make his way to the airspeeder, with Lumpawarrump and Mallatobuck close behind him."}, {"tag": "p", "text": "Terrified of hitting the canister with their blaster bolts, the underdwellers fled into the corridor when Mallatobuck opened fire at them. \"It,\" damaged from the earlier firefight, floated over to the Wookiees and attacked Chewbacca with its fusioncutter, but Chewbacca and Mallatobuck were able to destroy it and retrieve the datapad. The Wookiees then commandeered the airspeeder and left the detention center. The incident convinced Chewbacca that his life was too dangerous for Lumpawarrump to stay with him, but he vowed to return home for several weeks and teach his son to clench fight."}, {"tag": "h3", "text": "Rite of passage"}, {"tag": "p", "text": "One year later, Organa Solo gave birth to twin babies: Jacen and Jaina Solo, who were followed by Anakin Solo another year after that. For the following seven years, Chewbacca spent much of his time helping raise and look after the Solo children, and he found less and less time to return home and visit his own family. His absence had a large impact on Lumpawarrump, who grew even more insular and timid. Lumpawarrump still idolized his father, but without Chewbacca there for him to emulate and impress, he had few reasons to seek out trouble or to rush headlong into danger. In 16 ABY, he grew to adult Wookiee height and was deemed ready to undergo his coming-of-age hrrtayyk ceremony. Completion of the hrrtayyk would grant him a new name as well as the right to wear a baldric. With the Solos' blessings, Chewbacca took a leave of absence from his service to their family in order to return to Kashyyyk and guide his son through the hrrtayyk process. The elder Wookiee took the Millennium Falcon; the Solos hoped that the legendary starship would act as a symbol of the important work he did and would help ease the pain Lumpawarrump felt at his absence. When Chewbacca returned home and rushed at his son with a growl of greeting, Lumpawarrump shied away from him in fright. Only then did Chewbacca realize that his absence had prevented Lumpawarrump from discovering his rrakktorr, the eager and defiant strength of a Wookiee's heart."}, {"tag": "p", "text": "The first task of Lumpawarrump's hrrtayyk was to construct a bowcaster, a traditional Wookiee projectile weapon. It took him nine days to complete, but the quality of the finished product greatly impressed Chewbacca. Lumpawarrump was then required to hunt kroyie birds with his new weapon; the younger Wookiee performed adequately at knocking them from the sky. The next challenge, trapping and killing a scuttle grazer, took longer than the construction of the bowcaster and caused Lumpawarrump considerable hardship. His final task was to hunt a predatory katarn in the Well of the Dead, a location deep within the Shadowlands. Chewbacca guided him there across the Rryatt Trail from Rwookrrorro into the forest depths and shared stories of his own days hunting the well's dangerous inhabitants. While they walked, Chewbacca asked questions to test Lumpawarrump's knowledge of the reasons why Wookiees hunted katarns, and he cautioned his son patience during the forthcoming challenge. As they reached the Well of the Dead, Lumpawarrump stood petrified, but he proceeded inside after he received encouragement from his father."}, {"tag": "p", "text": "After he took about one hundred steps, Lumpawarrump sought out a hiding place and sat with his back to the stump of a Wroshyr tree. He occasionally scanned his surroundings for a katarn, but he was content to stay put and hide himself from any potential predator. Chewbacca covertly followed him in to observe and had no trouble staying hidden from his son, but he was soon interrupted by the arrival of his second cousin Freyrr. The relative told Chewbacca that Han Solo had been taken prisoner in the Koornacht Cluster by the Duskhan League, the Yevethan government that had recently come into conflict with the New Republic. Chewbacca knew that his duty to Solo superseded his responsibility to his son and immediately decided to mount a rescue attempt. Lumpawarrump was startled when his father called out to him and told him to stop the hunt. It would be considered an embarrassment if Lumpawarrump returned to Rwookrrorro without having completed his hrrtayyk, but Chewbacca felt that his son was not ready and insisted on waiting until he could return and guide Lumpawarrump through the process."}, {"tag": "p", "text": "Lumpawarrump, Chewbacca, Freyrr, and Chewbacca's cousin Shoran returned to the site of the Millennium Falcon and met with Mallatobuck, who instructed her son to return to their home and retrieve a food bundle that the tracker Kriyystak had prepared for Chewbacca's mission. Lumpawarrump returned to the ship with both the food and his bowcaster, insistent that he be allowed to accompany his father on the mission. Mallatobuck protested, but Chewbacca simply asked his son's reasons why. Lumpawarrump not only wanted an opportunity to earn his baldric and new name, but also to do it at Chewbacca's side and to prove his worth to his father. Chewbacca accepted his son's reasons and allowed Lumpawarrump to join him, Shoran, and Chewbacca's cousins Jowdrrl and Dryanta on the rescue mission. Their first stop aboard the Millennium Falcon was Esau's Ridge, a private smuggler's sanctuary on the planet Tholatin open only to elite veterans of the trade. Chewbacca sought information on the Koornacht Cluster and specialized supplies for the mission, and he ordered Lumpawarrump to remain aboard the ship as he visited the information broker Formayj."}, {"tag": "p", "text": "It took Formayj several days to acquire the information that Chewbacca requested, and Lumpawarrump grew bored and impatient. He studied the Millennium Falcon and practiced his fighting skills on Chewbacca's advice. After constantly giving his father pleading looks, he was allowed out of the ship on their fifth day at the ridge. As he and Chewbacca wandered around, Lumpawarrump curiously inspected a Trandoshan's parked starship and received singed fur on his right shoulder from a blaster bolt fired by the angry owner. Chewbacca dragged him to safety and advised his son that Esau's Ridge was not a place where curiosity was rewarded. Two days later, Formayj provided Chewbacca with a navigational map of the Koornacht Cluster, a recording of an address made to the New Republic Senate by the Yevethan Viceroy Nil Spaar, and other documents that provided intelligence on the Yevetha. The information had been channeled to Formayj by the clandestine New Republic Intelligence agency Alpha Blue, which also hoped to see Solo rescued. Chewbacca returned to the Millennium Falcon and played for the others a forty-hour-old recording of Spaar addressing members of the New Republic on the HoloNet's Channel 81. The planet N'zoth was visible in the background of the recording and became the Wookiees' destination as they lifted off from Esau's Ridge."}, {"tag": "h3", "text": "Finding his rrakktorr"}, {"tag": "p", "text": "Lumpawarrump sat in the Millennium Falcon's lower quad laser cannon turret as the ship arrived in the outer reaches of the N'zoth system. Many ships orbited the planet; from the Millennium Falcon's cockpit, Chewbacca recognized the Executor-class Star Dreadnought Pride of Yevetha from the recording that the Wookiees had seen; he calculated the orbital data required to micro-jump to within one thousand meters of it. After being relieved from the turret by Dryanta, Lumpawarrump joined his father and Shoran in the cockpit, and the three of them viewed and studied new information sent to them from Formayj: a New Republic Fleet Intelligence assault plan for an Executor-class Star Dreadnought, complete with marked locations of cell blocks and points on the hull that could effectively be breached. Lumpawarrump grew excited and called Jowdrrl and Dryanta down from the turrets so that they could study the new information too. The Millennium Falcon then launched a series of firecracker mines and executed its micro-jump."}, {"tag": "p", "text": "The ship emerged from hyperspace off the Star Destroyer's starboard bow, as the light and radiation from the exploding firecracker mines masked the cronau radiation produced by its jump and flooded the sensors of the Yevethan defense grid. Chewbacca took the Millennium Falcon inside the Pride of Yevetha's shields and launched the remaining mines as Jowdrrl and Dryanta fired at Yevethan starfighters from the quad batteries. Lumpawarrump and Shoran made their way to the ship's hatch as Chewbacca landed on the Star Destroyer's hull, and Shoran used a hull-cutting ring to burn through the Pride of Yevetha's side and create a way inside. Lumpawarrump gave a blaster rifle to his father before he returned to the quad turrets and traded places with Jowdrrl. As Chewbacca and Shoran stormed the Star Destroyer and Jowdrrl guarded the hatch, Lumpawarrump and Dryanta waited in the turrets. They sat bewildered as dozens of Yevethan starfighters flew over their location but did not locate them, and as Jowdrrl reported a group of Yevethan guards who walked past her location without noticing her. The Wookiees were unaware that their presence was being disguised in the Force by Enara, a Fallanassi adept of the White Current who was being held prisoner along with Solo. Enara also placed an image inside Lumpawarrump's mind: Solo inside a large room, surrounded by beings of various species."}, {"tag": "p", "text": "When Shoran was killed by Yevethan guards, Chewbacca contacted the Millennium Falcon and requested Dryanta's assistance. Lumpawarrump raced to the hatch with several weapons in hand and insisted that he go along, citing the apparent lack of need for quad gunners and his familiarity with the map of the Star Destroyer. Jowdrrl did not argue, and Lumpawarrump led Dryanta through the Pride of Yevetha's corridors toward detention block two, where they rendezvoused with Chewbacca. Dryanta picked up Shoran's corpse and returned to the Millennium Falcon. Chewbacca searched for strength in his son's eyes before he accepted Lumpawarrump's presence and proceeded toward the next detention block with a command for Lumpawarrump to guard his back. The Wookiees met armed resistance at the entrance to detention block one but blasted their way through the six Yevethan guards; they found no prisoners inside, however, as the vessel's detention blocks had been converted into breederies for Nil Spaar's offspring. Lumpawarrump told his father of the images in his mind, and the vision manifested in Chewbacca's brain as well. He asked Lumpawarrump if he could see any markings in the room, and Lumpawarrump concentrated on the vision before he identified the words \"D TWO.\" The two Wookiees proceeded to the D2 cargo hold."}, {"tag": "p", "text": "Lumpawarrump and Chewbacca fought back-to-back through Yevethan resistance; they cut down groups of tenacious guards whose courage made them easy targets. The Wookiees fired on anything that moved, which reduced the power in their hand blasters to critical levels by the time they reached the cargo hold. Six Yevethan guards who carried portable shields guarded the entrance, which prompted Chewbacca to give his son several explosive quarrels with which to arm his bowcaster. The elder Wookiee gave Lumpawarrump several quick words of advice and rushed toward the doors as Lumpawarrump opened fire. The quarrels destroyed the portable shields and killed three of the guards; the remaining three were critically wounded and were finished off by Chewbacca in bouts of unarmed combat. Lumpawarrump received a wound in his right leg from the Yevethans' blaster fire but shrugged off the pain and kept firing—Chewbacca was impressed that his son had met his \"katarn\" without flinching and that his aim had been true, and he decided that Lumpawarrump had found his rrakktorr and completed his hrrtayyk ceremony. The Wookiees immediately entered the cargo hold, and Lumpawarrump stood guard at the hatchway while Chewbacca spotted Solo among a large group of prisoners and retrieved his friend. Save for Solo and Enara, the prisoners were all in fact Force illusions created by the Fallanassi adept—they had escaped from the Yevetha before being taken aboard the Star Destroyer, and Enara had protected them by making it appear as though they were still with her. Lumpawarrump cried out as they all vanished from sight and then reappeared with an illusory Solo among them. Enara implored Solo and the Wookiees to flee while she maintained the ruse, and they met the Millennium Falcon at a nearby flight deck, to which Jowdrrl had piloted the ship after she had been contacted by Chewbacca."}, {"tag": "p", "text": "Lumpawarrump and Chewbacca brought Solo aboard his ship and blasted off under the cover of more firecracker mines. The New Republic Fifth Battle Group was stationed nearby, and Chewbacca took the Millennium Falcon toward the Intrepid, the flagship of General Etahn A'baht. The Millennium Falcon was allowed to dock after Chewbacca's Shyriiwook hails were recognized and deciphered by Luke Skywalker, who was aboard the General's ship. Solo was immediately taken to a bacta tank, while Shoran was brought to the ship's morgue. Lumpawarrump limped off the Millennium Falcon with a second-degree blaster burn on his right calf and joined Skywalker and the other Wookiees in the medical ward. They stood by Solo's bedside as he rested in between bacta sessions, and a K-1B medical droid diagnosed Lumpawarrump's injury with the aid of a translator droid. K-1B discovered serious damage to Lumpawarrump's skin and hair cells, as well as to his fat and muscle tissue, and it prescribed a ten-hour session in a bacta tank. Lumpawarrump declined, as he found scarring to be socially desirable, but a protective Chewbacca nevertheless demanded that the medical droid use topical treatments to effectively heal his son. Lumpawarrump was granted a new name after having completed his hrrtayyk ceremony: Lumpawaroo, with Waroo, meaning \"Son of courage,\" as the familiar. Chewbacca prepared the Millennium Falcon for use in an upcoming New Republic strike against N'zoth, but Lumpawaroo was transferred to a medical frigate with Solo and other noncombatants. The New Republic was victorious, and the threat that the Yevetha posed to the galaxy was ended."}, {"tag": "h3", "text": "Loss of a hero"}, {"tag": "p", "text": "In 19 ABY, the New Republic's continuing war against the remnants of the Empire was brought to a close with the signing of a peace treaty. In the following years of peace, Chewbacca was able to spend much more time with his family than he had during the hostilities. He remained at Solo's side most of the time, however, and the two were on the planet Sernpidal in 25 ABY when its moon Dobido was drawn toward the planet as part of a military tactic employed by an extra-galactic species of religious zealots known as the Yuuzhan Vong. Chewbacca gave his life by helping usher civilians onto the Millennium Falcon—he was still on Sernpidal's surface as the ship sped away from the exploding planet with the refugees. In the wake of the tragedy, Lumpawaroo and his cousin Lowbacca were selected to assume Chewbacca's life debt, continuing their family's commitment to serve Solo until the day he died. Six months later, a funeral was held for the legendary Wookiee outside of Rwookrrorro, and Lumpawaroo was one of several dozen attendees who came to mourn. Friends and family of Chewbacca comprised the twenty-four Wookiees in attendance, who were joined by the Solo family, Luke Skywalker, C-3PO, and R2-D2. The group stood around a circular wooden table as a Wookiee named Ralrracheen gave a eulogy. Following the services, the table was covered with foodstuffs, and the guests ate and drank while they recalled fond memories of Chewbacca."}, {"tag": "p", "text": "Lumpawaroo, Mallatobuck, and several other members of Chewbacca's family approached Solo, who sat alone and dejected. Mallatobuck gave him a bowcaster that Chewbacca had crafted shortly after marrying her, and Lumpawaroo presented him with an animal-hide carry pouch that had once belonged to his father. Jowdrrl and Dryanta intended to arrange a farewell feast for Lumpawaroo and Lowbacca, but when Solo was told that they would be assuming the life debt, he refused the offer. He was not yet ready to replace Chewbacca, who had been his closest friend, and he did not want to risk the lives of Lumpawaroo and Lowbacca and ultimately feel responsible for the deaths of even more friends. Mallatobuck and Attichitcuk agreed to grant him more time to grieve, but Lumpawaroo and Lowbacca intended to assume Chewbacca's life debt as soon as circumstances allowed. The Solos, Skywalker, and the droids left Kashyyyk and continued to aid the New Republic in its war against the Yuuzhan Vong, who were intent on conquering the galaxy."}, {"tag": "p", "text": "The war raged for four years, and although the invaders laid siege to much of the galaxy and even took Coruscant, Kashyyyk remained relatively untouched. The Wookiee world was turned into a New Republic base three years into the war for further defense of the surrounding Mid Rim area of space. However, by the time that the invaders were defeated in 29 ABY, Kashyyyk still stood lush and gleaming. Seven weeks after the war's conclusion, the Solos, as well as Luke Skywalker and his wife Mara Jade, again came to Rwookrrorro, and Lumpawaroo joined them and several members of his own family as they returned to the site of Chewbacca's funeral. Solo plunged the lightsaber of his son Anakin, who had died two years previously, into a fallen tree branch at the site, and everyone afterward returned to Rwookrrorro to enjoy a celebratory feast. Lumpawaroo and Lowbacca decided that the time was right to assume Chewbacca's life debt, and they informed Solo that they would be traveling with him from then on whether he liked it or not. Solo attempted to protest but eventually gave in and began to chuckle; everyone present added their voices to the chorus of laughter that now permeated the feast. Lumpawaroo and Lowbacca's service to Solo lasted for less than six years; by 35 ABY, they were no longer with him."}, {"tag": "h3", "text": "Aiding the Solos"}, {"tag": "p", "text": "In 40 ABY, several member worlds broke away from the Galactic Alliance, the New Republic's successor state, and a war erupted between the Alliance and the newly-formed Confederation. Jacen Solo seized power within the Alliance and became one of its two Chiefs of State, and Kashyyyk's Rock Council convened at the planet's Council Rock to discuss whether they should lend him their fleet. Han Solo and Leia Organa Solo, recently declared enemies of the state by their son Jacen, traveled to Kashyyyk to persuade the council not to support the Chief of State. Lumpawaroo acted as their guide during a traditional four-day hike through the Wroshyr trees toward Council Rock. When the trio arrived at the porch which the rock overlooked, the Wookiee leader Tojjelnoot stood alone atop Council Rock and addressed a large gathering of Wookiees below. Lumpawaroo pushed through the crowd and led the Solos toward the rock, where they were met by the Sullustan Jae Juun and the Ewok Tarfang, two Galactic Alliance Intelligence operatives who were monitoring the Rock Council on behalf of the Alliance."}, {"tag": "p", "text": "Solo intended to climb the rock and address the council, and Lumpawaroo assured the two guards who protected the path to the top that the Wookiees would want to hear what he had to say. Lumpawaroo also appealed to Solo's longstanding good relationship with the Wookiee people. The guards moved aside to admit Solo, but Juun and Tarfang intervened and reminded them that the Solos were enemies of the Galactic Alliance. The Wookiees conceded the point and demanded the Solos' weapons; the Solos handed them to Lumpawaroo, but Tarfang insisted that aiding them would deem the Wookiees traitors as well. One of the guards kicked the diminutive Tarfang away, and the Ewok responded with a blaster bolt that narrowly missed Lumpawaroo's head. Organa Solo, who was a trained Jedi Knight, retrieved Tarfang's blaster with the Force and held him suspended in the air while Solo attempted to physically snatch Juun's blaster away. The Solos were then seized by several Wookiees due to their assault on duly authorized officers of the Galactic Alliance. Lumpawaroo was separated from his allies by a crowd that eagerly encroached, and the Solos were taken to a nearby prison."}, {"tag": "p", "text": "The Wookiees were sympathetic to the Solos and assigned Lumpawaroo to guard them. When Chewbacca's son took a lunch break after a short time, he told the Solos that he expected them to be in their cell when he returned. He left their weapons unguarded when he departed and fully expected Organa Solo to use the Force to open the lock and return to the Rock Council while he was gone. The Solos did just that and were joined by several Jedi at Council Rock who were led by Jedi Master Luke Skywalker. The Jedi had deserted the Galactic Alliance during a recent battle at Kuat due to the increasingly brutal tactics employed by Jacen Solo, and the Chief of State followed them to Kashyyyk—the Galactic Alliance Fifth Fleet arrived in orbit, and Jacen demanded that the Wookiees turn the Jedi over to him. When Wookiee leaders denied that there were any Jedi onworld, the Fifth Fleet began to bombard the planet's surface. The attackers were only driven away in the ensuing battle due to intervention from several Confederate fleets and of the Hapes Consortium, allies of the Galactic Alliance who withdrew their support during the battle out of disgust at the burning planet they saw below them. Kashyyyk did not join the Confederation afterward but did strike an informal coalition with the Jedi and the Hapans."}, {"tag": "p", "text": "The fires on Kashyyyk left behind by the bombardment raged across the Wroshyr forests, and Confederate and volunteer starships worked to control them. Lumpawaroo helped crew the Millennium Falcon as the Solos planted beacons throughout the forest. Several days after the battle, Solo flew the ship while Organa Solo planted the beacons, and Lumpawaroo stood ready at the Millennium Falcon's docking ring to bring her back aboard after each beacon was planted. The beacons were planted in lines across the planet and fired upon by the turbolasers of Confederate cruisers; the surgical strikes caused precise columns of forest to ignite. The volunteer vessels then controlled the blazes with fire-snuffing foam. When they were extinguished, the char left in their wake checked the advancing wildfires caused by the Fifth Fleet, which, thus contained, would eventually die out. After Organa Solo planted the final beacon of one line, Lumpawaroo was helping her aboard when the Millennium Falcon's artificial gravity failed and slammed them both against a bulkhead."}, {"tag": "p", "text": "When Organa Solo heard the laughter of the Dark Jedi Alema Rar, an old nemesis of hers, she told Lumpawaroo to make his way to the cockpit and protect her husband. Lumpawaroo leaped through the high gravity while Organa Solo ignited her lightsaber and hunted for Rar. Solo was aware of the Dark Jedi's presence and had turned off the artificial gravity to stop an attempt of hers to kill him; when Lumpawaroo reached the cockpit, Solo immediately told him to leave and go protect Organa Solo. The Confederate cruiser Lillibanca began to fire on their beacons at that instant, and Solo's evasive maneuvers caused Lumpawaroo to tumble backward through the cockpit access corridor. Organa Solo slowed his descent with the Force as he hurtled past the engineering bay, where she had engaged Rar in a lightsaber duel. After a bulkhead broke his fall, Organa Solo blocked a strike by Rar that was aimed at the Wookiee's prone form; Lumpawaroo quickly recovered and fired his bowcaster at the Dark Jedi. Organa Solo deflected it with her blade, however, having been unable to find Rar's presence in the Force—where it should have been was merely a duplicate of Lumpawaroo's presence."}, {"tag": "p", "text": "Lumpawaroo ceased firing on Organa Solo's instructions. When her opponent began to only fight defensively, Rar fled the engineering bay and disappeared from the ship entirely. Lumpawaroo and Organa Solo both pursued her before they realized that she had vanished. When the Millennium Falcon landed in a hangar in the Maitell Base spaceport, it was searched by Jaina Solo and her friends Jagged Fel and Zekk, who found no trace of Rar. The Solos later discovered that Rar had projected her presence from across the galaxy using the Force phantom technique with the use of Lumpawaroo's presence as an anchor—Rar's use of the arcane Sith technique meant that any harm caused to her phantom would have been harm caused to Lumpawaroo as well."}, {"tag": "p", "text": "The Solos remained on Kashyyyk for some time to perform more firefighting missions, and several days after the Force phantom incident, Lumpawaroo received a package that was addressed to Han Solo. He performed a routine scan on the metal case and found nothing harmful before he gave it to Solo, who was surprised to receive it. The package turned out to be Mandalorian armor and crushgaunts sent to Solo by his old enemy Boba Fett, intended as a sympathy gift for the monster that Solo's son had become and a weapon with which to kill Jacen if the need arose. Solo refused the gift and passed it on to Fel, who had formed a task force with Jaina and Zekk to hunt down Rar. Fel was able to use the crushgaunts to kill Rar while battling her on an asteroid, and both the war and Jacen's reign of terror were brought to an end when Jaina killed her twin brother weeks later."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a young Wookiee, Lumpawarrump was a mischievous, adventurous boy who loved to play with toys, eat Wookiee-ookiees, and watch holographic videos. He was very fond of his stuffed bantha but was not at all fond of cleaning dishes. The presence of Imperials in his home on Life Day greatly distressed him, and when an Imperial technician came too close to him, he responded by biting the man's fingers. The young Lumpawarrump was in awe of his father and enjoyed hearing stories of Chewbacca's adventures; early on, he came to idolize his father, a fascination that lasted for years. When he entered the Shadowlands to gather wasaka berries for Chewbacca's 200th birthday, Lumpawarrump hoped that he could be as brave as his father and pretended to be adventuring on a far-off planet. He ignored the fright that enveloped him while he searched, firm in his belief that Chewbacca would never be conquered by fear, and he was devastated when he was unable to collect any berries. Lumpawarrump was cheered up immensely when his father told him that he was a hero due to his having pressed on in the face of fear. When several Imperials searched his home during the Life Day of 1 ABY, Lumpawarrump used his mini-transmitter to trick them into leaving."}, {"tag": "p", "text": "As a teenager, Lumpawarrump tried to emulate Chewbacca rather than assert his own identity. He often played under the name \"Lumpacca\" in the hologame \"Galactic Rebels\" and boasted to his friends that he was as strong as his father. While chasing a burglar through the depths of Coruscant, he proceeded exactly how he thought Chewbacca would and was very ashamed when his plans did not succeed, feeling that he had let his father down and that he was not as strong or as independent as Chewbacca. He lost some of his energy when Chewbacca scolded him but gained it back whenever he received praise from his father. Although Chewbacca was not able to visit his family on Kashyyyk very often over the following eight years, Lumpawarrump was still deeply anxious for his father's approval during his hrrtayyk ceremony in 16 ABY. He insisted on accompanying Chewbacca to the Koornacht Cluster in that year to rescue Han Solo, eager for the chance to pass his hrrtayyk at his father's side. Lumpawarrump knew that death possibly awaited him, but the idea of failing his father was a fear that loomed larger in his mind. By this point in his life, Lumpawarrump felt the heavy burden of being the son of a legendary warrior and desperately wanted to prove his worth to both Chewbacca and to his community in Rwookrrorro."}, {"tag": "p", "text": "When in Chewbacca's presence, Lumpawarrump sought praise only from his father and ignored instructions issued to him by Mallatobuck. He was not rebellious toward his mother when at home, however, and he never yelled at her. He was considerate of her feelings and did not tell her about his plans to gather wasaka berries in the Shadowlands so as to not hurt her, as she had expressly forbidden him from going. Lumpawarrump was additionally very fond of Solo, the man to whom Chewbacca owed a life debt. He loved to hear stories from Solo whenever the smuggler visited Kashyyyk and believed Solo to be just as brave as his father. Solo in turn cared deeply for the young Wookiee, having found the chunky baby cute right from his birth. Solo thought of all of Lumpawarrump's family as his own, and in 40 ABY, he mused that Lumpawaroo and Jacen Solo could have one day inherited the Millennium Falcon from him had Jacen not fallen to the dark side of the Force."}, {"tag": "p", "text": "Lumpawarrump's early adventure in the Shadowlands was responsible for a great deal of trauma that caused him to start staying close to his home and the Rwookrrorro nursery ring. When he asserted to other young Wookiees that he was as strong as his father, his bluff was called and he was beaten up. Mallatobuck and Attichitcuk did not encourage him to participate in the nursery ring's rough unstructured play, and as such, Lumpawarrump did not develop the typically fearless fighting style of Wookiee males. Without any close friends, he grew insular and soft-spoken and rarely left home. Chewbacca felt guilty about not being able to be at home and instruct his son in the ways of the Wookiees, but Lumpawarrump did not begrudge his father. He dreamed of his father's adventures while he stayed at home, and he overcame his timidity while in Chewbacca's presence in an effort to impress him."}, {"tag": "p", "text": "The lack of a present father figure to teach Lumpawarrump Wookiee ways nearly spelled doom for him during his misadventure on Coruscant: while chasing the burglars, he constantly rushed headlong into danger without considering that real life was dissimilar to \"Galactic Rebels.\" Lumpawarrump often ran right into his enemy's line of fire, thinking only of being as brave as his father. Although he had neither Chewbacca nor any good friends to test himself against in clench fighting, Lumpawarrump did have raw talent. He constructed an excellent bowcaster during his hrrtayyk ceremony and proved adept at shooting kroyie birds with it. He did not excel at hunting a scuttle grazer, however, and while in the Well of the Dead, he chose a hiding spot that had a large blind spot—he did not detect the presence of Chewbacca, Freyrr, or a katarn, all of whom came close to him in the well. Lumpawarrump's rrakktorr bloomed late in his heart; while in the Well of the Dead, he was terrified of the katarns that awaited him."}, {"tag": "p", "text": "Lumpawarrump finally found his rrakktorr when his talent and his eagerness to prove himself manifested in displays of measured skill and fearlessness aboard the Pride of Yevetha. He and his father fought back-to-back through legions of Yevethan guards, and when a blaster bolt struck the younger Wookiee's leg, he met it without flinching or uttering a sound of complaint. Lumpawarrump maintained a steady aim, impressing his father and completing his hrrtayyk. He fought like an experienced warrior and even joked with Chewbacca in the midst of a dangerous situation. Proud of his accomplishment, he afterward wished to keep the scar on his leg. By 40 ABY, Lumpawaroo was clever, lanky, and a good and powerful warrior who had golden-brown fur and shades of Chewbacca in his face. He was strong and agile and was able to leap through the Millennium Falcon after its artificial gravity was turned off, even if he was still about 100 kilograms too light to bellow and demand his way through the Rock Council. At that time, Lumpawaroo's Shyriiwook speech often emerged as moans and groans when things were not going well for him. In addition to being able to speak Shyriiwook, Lumpawaroo could understand Galactic Basic Standard."}, {"tag": "p", "text": "As with many Wookiees, family and honor were very important to Lumpawaroo. He insisted on continuing Chewbacca's life debt to Solo after his father's death, and when Solo delayed it in order to fully grieve, Lumpawaroo did not allow himself to forget about it. After the end of the Yuuzhan Vong War, he and Lowbacca intended to continue the life debt regardless of whether or not Solo wished it. Lumpawaroo was still very dedicated to Solo and his wife in 40 ABY when he guided them to Council Rock and when he helped them break out of prison. The latter incident was done according to his own code of honor."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Creation"}, {"tag": "p", "text": "The character that would eventually be called Lumpawaroo was conceived by George Lucas in 1978 as one of the principal characters of The Star Wars Holiday Special, a television variety show that was spun off of Star Wars, Lucas's film of the previous year. Chewbacca was one of Star Wars's main characters, and Lucas crafted a plot for the Holiday Special that centered and focused entirely on his family. He named all three new Wookiee characters, christening Chewbacca's son \"Lumpy.\" The writers and producers of the special added comedy skits, musical numbers, and characters that spoke Basic to the plot, which turned the finished product into a variety show typical of 1970s television but still used the Wookiee family as its focal point. A \"Wookiee Bible\" providing backstory on Lumpy and his family was written by representatives of Lucasfilm Ltd. and given to the special's various directors; Steve Binder, the final director to come aboard the project, had no direct contact with Lucas and relied on the bible to accurately direct the Wookiees according to Lucas's vision."}, {"tag": "p", "text": "The Holiday Special's script states that Lumpy's full name is \"Lumwarrump\" and calls the character a \"plump, feisty 10-year old.\" The final draft of the script sees Lumpy, his mother, and his grandfather spend the majority of the Holiday Special awaiting Chewbacca's Life Day homecoming, but in early story treatments, Chewbacca arrives home near the beginning of the story and interacts with Lumpy. Upset about not being able to receive a Life Day gift immediately, Lumpy stows away aboard a trader's ship and ends up in the Mos Eisley Cantina on the planet Tatooine. He is then discovered by the trader and taken to a Kashyyyk-bound vessel called the Starship Musica, where he meets an entertainer, written to be played by actress Raquel Welch, who is on assignment from the Empire to sabotage the ship. Purportedly singing Lumpy a song about how a starship operates, she dances her way into the ship's control room and damages the controls. Chewbacca then takes a shuttle to the Starship Musica and pilots it safely to Kashyyyk's surface, where a Life Day celebration ensues."}, {"tag": "p", "text": "Concept art by Joe Johnston developed for the Holiday Special depicts Lumpy and Chewbacca interacting with an Environmental Transporter machine that can virtually take them to different locations across the galaxy. A painting by Ralph McQuarrie features Lumpy viewing a hologram of a Gnomish figure that resembles Father Christmas. Both concepts went unused in the finished product of the Holiday Special. Action figures of Chewbacca's family developed by the Kenner toy company also went unproduced, although prototypes were constructed. Lumpy's figure was built around a Fisher-Price family toy. An article published in Tomart's Action Figure Digest claims that the figures were not ultimately produced due to the selling window having been too small."}, {"tag": "h3", "text": "Portrayal"}, {"tag": "p", "text": "In The Star Wars Holiday Special, Lumpy was portrayed by three-feet-eleven-inches-tall actress Patty Maloney. As both Lumpy and several of the characters he interacts with in the show speak Shyriiwook, Maloney attended a class that educated her on the language so that she could better respond to cues during filming. Lumpy's voice, provided by a baby black bear named Tarik, was added during post-production by sound designer Ben Burtt, a situation that forced Maloney to convey Lumpy's emotions through the use of mime during shooting. Burtt recorded Tarik's voice at the San Jose Baby Zoo in California. He was searching for a bear with a cute growl and settled on Tarik after discovering that Pooh, the bear who had provided Chewbacca's voice for Star Wars, had grown from a toddler into a snarling adult."}, {"tag": "p", "text": "Lumpy's costume was created by makeup artist Stan Winston and two of his friends. The three constructed all three new Wookiee suits out of human hair, which resulted in the costumes being very hot for the actors to wear—Binder has speculated that Maloney lost ten pounds during filming. After Lumpy's costume was completed, it was tailored to Maloney's figure. Winston also developed Lumpy's mask, which made use of cutting-edge animatronics technology that he himself created. Wires ran from the mask down the arms of the costume, and Maloney pulled on rings at the ends of the wires to move Lumpy's nose and mouth. When Maloney was required to pick up props during closeup shots, Winston sat behind her and worked the strings. Although the area around them was painted black, Maloney's own eyes were visible through the mask; she used them to convey as much expression as she could. The tightness of the mask around her eyes prevented her from breathing anywhere save through her mouth, however; crew members were at hand to stick a straw through her mouth and provide her with oxygen after shooting scenes that required her to run. Lumpy's mask and feet are currently housed in the Lucasfilm archives, and special effects artist Don Bies has stated that the costume's entire bodysuit is as well."}, {"tag": "p", "text": "Lumpy's scenes were filmed over approximately ten days. Harrison Ford, the actor who played Han Solo, had to shoot a scene with Maloney several times due to his habit of forgetting that the character she played was male. Maloney remembers her time as Lumpy very fondly, and she has described the character as an impish and rebellious boy who is very active and curious. She has appeared at at least one autograph signing and she occasionally receives fan mail from a large Star Wars fanbase that is very interested in the character of Lumpy."}, {"tag": "h3", "text": "Character development"}, {"tag": "p", "text": "The Star Wars Holiday Special aired once on television and was almost universally panned. Much of the criticism stemmed from the opening fifteen minutes of the special, which exclusively features Lumpy and his family speaking to each other in untranslated Shyriiwook. George Lucas himself has expressed regret that it was ever produced. Lumpy has garnered mockery specific to his character—Star Wars author Jon Bradley Snyder has called him \"Adam Rich with fur, a long-haired gangly precursor to the Ewoks (of 1983's Star Wars: Episode VI Return of the Jedi),\" and Total Film magazine ranked him fourth on their 2010 list of \"30 stupidest [sic] Star Wars characters.\" Nevertheless, Lumpy has since appeared in a number of works of the Star Wars Expanded Universe. One year after the Holiday Special aired, a companion children's book called The Wookiee Storybook was released. It centers around a misadventure of Lumpy's and was being written by Eleanor Ehrhardt during the Holiday Special's production. Illustrator Patricia Wynne was unaware of what the Wookiee costumes from the Holiday Special looked like and was forced to visually construct the characters from scratch. Her sketches were sent directly to Lucas, who allowed her a large amount of creative freedom under a tight deadline. The Wookiee Storybook introduced several new elements of Wookiee culture and was the first work to establish Lumpy's full name as \"Lumpawarrump\" rather than the earlier-asserted \"Lumwarrump.\""}, {"tag": "p", "text": "Lumpawarrump's next appearance was a small role in the ninety-first issue of Marvel Comics' ongoing Star Wars series. The Expanded Universe experienced a renaissance in 1991, and early stories such as the Holiday Special and The Wookiee Storybook were only gradually accepted into canon. Lumpawarrump was mentioned in only a few sources throughout the 1990s. When author Michael P. Kube-McDowell was contracted to write The Black Fleet Crisis Trilogy of novels in 1996, he drafted a story outline that involved Chewbacca returning to Kashyyyk sixteen years after the events of the original Star Wars film in order to find a mate. He was subsequently told by Lucasfilm Ltd. that Chewbacca already had a family, and he accordingly revamped the plot to feature Chewbacca returning home to attend a coming-of-age ceremony for Lumpawarrump. McDowell has referred to the writing process as an effort to clean up the canon around Lumpawarrump, and he was pleased that he was able to \"recast and redeem\" Lumpawarrump's story. McDowell renamed the character \"Lumpawaroo,\" or \"Waroo\" for short, in the trilogy's final chapter, a name that Lumpawarrump earns after completing his coming-of-age ceremony."}, {"tag": "p", "text": "Lumpawaroo's birth was depicted in A. C. Crispin's 1998 novel Rebel Dawn at a point in time three years before the events of The Star Wars Holiday Special, contrary to the Holiday Special's script's assertion that the character was ten years old. Lumpawaroo then made two brief appearances in The New Jedi Order book series after the death of his father, and a young Lumpawarrump played a large role in the 2003 eBook novella A Forest Apart, written by Troy Denning. Although Denning found it difficult to write a story starring almost exclusively Wookiees, he enjoyed the experience. Lumpawaroo's most recent appearances have been in the novels Legacy of the Force: Inferno and Legacy of the Force: Fury, two volumes of the Star Wars: Legacy of the Force book series published in 2007."}, {"tag": "p", "text": "Several discrepancies regarding Lumpawaroo exist within Star Wars canon. The 1997 trivia book Diplomatic Corps Entrance Exam misspells Lumpawarrump as Lumpawarump, and in Before the Storm, the first chapter of The Black Fleet Crisis Trilogy, Lumpawarrump is referred to as Lumpawaroo before undergoing his hrrtayyk ceremony and earning his new name. A Forest Apart asserts that he is eleven years old in 8 ABY, which is only ten years after his birth. Leland Chee, the Keeper of the Holocron continuity database, has confirmed that this is a mistake. Although Lumpawaroo's fur is described or depicted as brown or golden-brown in color in the majority of his appearances, Inferno describes it as bronze. In the 1998 novel Vision of the Future, Han Solo makes a reference to \"Chewbacca's cubs.\" Although The Essential Guide to Alien Species states that Wookiees traditionally bear two to three children, no other canonical source has ever indicated that Lumpawaroo has any siblings. However, a non-canon picture drawn by Maya Gohill in the 2010 art book Star Wars: Visions depicts Chewbacca and a wife living in a home with three children."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}