{"url": "Lun_Rask", "categories": ["Category:Legends articles", "Category:Houk", "Category:Males", "Category:Vigos"], "nodes": [{"tag": "h1", "text": "Lun Rask"}, {"tag": "p", "text": "Lun Rask was a Houk Black Sun vigo of Arkanis sector in 137 ABY. On the gas giant Kaer in the Siskeen system, Rask made a fortress and base from an old tibanna mining platform."}, {"tag": "p", "text": "Upon hearing of his men becoming detained or killed as they attempted to steal goods from Imperial ships, Rask was eager to find out who was ripping him off. Rask confronted his information broker Naxy Screeger in his base and coaxed him to find the pirates or he would rip out Naxy's lungs. Little to Rask's knowledge was that Naxy was in direct connection with Cade Skywalker who had been responsible. Naxy soon escaped and Rask killed the alien that had been watching over him."}, {"tag": "p", "text": "After Cade met with Muz the Fence on Tatooine, Muz notified Rask of their meeting, however giving Rask the name that Cade had passed along to him: Luke Skywalker. Rask still honored the request for a reward for Muz and noted that it was that he would not kill Muz this time."}, {"tag": "p", "text": "After Gunn Yage was ordered to Tatooine by her mother Nyna Calixte to assist Morrigan Corde, she was briefed by Moff Nieve Gromia on who was really responsible for the attacks. Yage corrected Gromia that the culprit was Cade, not Luke. Soon after the meeting, Gromia retired to her living quarters where she contacted Lun Rask. Together they plotted to kill Cade and Gunn on Tatooine, with Rask supplying three assassins; a Blood Carver named Ku Vrat, and an Anzati married couple named Sint and Nakia Yoru."}, {"tag": "p", "text": "Skywalker and Yage, however, managed to defeat all three assassins, take Nakia Yoru hostage and rendezvous with Agent Corde. Yoru agreed to lead Corde, Skywalker and Jariah Syn to Rask's base of operations. There, Skywalker forced him to co-operate by holding him at lightsaber point, and offered to work together to steal from Rask's fellow Vigos and maybe eliminating them. Rask agreed to Cade's offering, however, Agent Corde decided to shoot the Houk nonetheless. She justified her actions by saying that Rask was lying and he wouldn't have allowed Cade to leave the station alive."}, {"tag": "h2", "text": "Appearances"}]}