{"url": "Lunker/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Captains", "Category:Males", "Category:Otolla Gungans"], "nodes": [{"tag": "h1", "text": "Lunker"}, {"tag": "p", "text": "Lunker was a male Gungan security captain on Naboo during the time of the Clone Wars. Around 21 BBY, he was tasked with watching Jan-gwa city, a city on Naboo. During that time, Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, came to Naboo to protect Roo-Roo Page, a Force-sensitive Gungan child, from abduction by the Duros bounty hunter Cad Bane. Lunker and Captain Gregar Typho met with Skywalker and Tano in Naboo's capital of Theed. Skywalker ordered Tano to go with Lunker to Page's house in Jan-gwa city, while he stayed with Typho. Skywalker and Tano were later able to save Page from Bane's abduction attempt."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Captain Lunker was a green–eyed male Gungan who lived during the Clone Wars. Around 21 BBY, Lunker was tasked with watching Jan-gwa city, a small city on the planet of Naboo. During that time, the Sith Lord Darth Sidious tasked the bounty hunter Cad Bane to kidnap Force-sensitive children. One of the targets of the Duros bounty hunter was Roo-Roo Page, a Gungan child living in Jan-gwa city. However, the Jedi Order discovered Bane's plan and dispatched Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, to Naboo to protect Page."}, {"tag": "p", "text": "Lunker, along with Captain Gregar Typho from the Royal Naboo Security Forces, rendezvoused with the arriving Jedi in the Royal Hangar in Naboo's capital Theed. Typho told Skywalker and Tano that Page's family had been notified, and introduced Lunker to the two. Skywalker ordered Tano to go with Lunker to Page's house in Jan-gwa city, while he stayed with Typho for sometime. Lunker brought Tano to Jan-gwa city, and soon Skywalker rejoined his Padawan. After a brief brawl between Bane and the Jedi, Skywalker and Tano were able to save Page from Bane's attempt to abduct her, and they arrested the bounty hunter."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lunker first appeared in \"Children of the Force,\" an episode in the second season of the Star Wars: The Clone Wars television series, which aired on October 9, 2009. Prior to the character's conception, \"Lunker\" was actually the name of the main Gungan character in the television series in Series Director Dave Filoni's early ideas and concept storylines for the show."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}