{"url": "Lupr%27or_Village", "categories": ["Category:Canon articles", "Category:Settlements"], "nodes": [{"tag": "h1", "text": "Lupr'or Village"}, {"tag": "p", "text": "The Lupr'or Village was located on the planet Luprora. The Lupr'or species lived in this village, which was the sole Lupr'or settlement on the planet by 34 ABY."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Lupr'or Village consisted of several cylindrical structures, a beehive-shaped structure, and a large rectangular building. The village was built on high, rocky ground and was near a lake inhabited by Tsw'ells and the R'ora's island stronghold. Most of the structures appeared to be made of wood. Some notable residents included the Lupr'or leader Jair'i, the guide Dar'en, Ali'ane, and Ali'ane's great granddaughter."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lupr'or Village was the sole remaining Lupr'or settlement on Luprora after rising sea levels and the threat of the Tsw'ells and R'ora forced the colonists to move to higher ground. In 34 ABY, Captain Phasma, the First Order TIE fighter pilot TN-3465, and the droid BB-K8 visited the village during the hunt for Lieutenant Sol Rivas, whom Phasma had framed for destroying Starkiller Base. They were hosted by Jair'i who recounted the history of his people. He also informed the offworlders that Rivas had been taken by the R'ora to their island stronghold."}, {"tag": "p", "text": "After studying the lake surrounding the R'ora stronghold, Phasma returned to the village where she noticed that a young girl was wearing a necklace. Phasma questioned the girl about the necklace and she introduced Phasma to her great grandmother Ali'ane, the oldest living Lupr'or who had lived in the stars. She told Phasma that the necklace came from the \"old world\" but refused to reveal where they could find more. Her great granddaughter, who believed that Phasma had been sent by the gods to fight the Tsw'ells and the R'ora, agreed to show Phasma where the last remaining Lupr'or ship was."}, {"tag": "p", "text": "Returning to the Lupr'or village, TN-3465 tried to get Dar'en to bring everyone. However, BB-K8 mistranslated it as men. Despite this brief mishap, Captain Phasma managed to impress the villagers by donning her armor and blaster rifle. Phasma then delivered a speech urging the Lupr'or to fight for their survival against the R'ora by using any means necessary including technology. Under Phasma's leadership, the Lupr'or used generators to electrocute the tsw'ells in the lake, allowing Phasma, TN-3465, and the Lupr'or to row across the lake and attack the R'ora stronghold."}, {"tag": "p", "text": "After killing Rivas in order to conceal her role in the destruction of Starkiller Base, Phasma then abandoned the Lupr'or to the R'ora and the rising sea levels."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lupr'or Village first appeared as a plot setting in Star Wars: Captain Phasma, a 2017 four-issue comic published by Marvel Comics as part of the Journey to Star Wars: The Last Jedi promotional material. The village was created by Kelly Thompson, illustrated by Marco Checchetto, and colored by Andres Mossa."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}