{"url": "Lurdo", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Non-canon Legends articles", "Category:Articles that are known by a nickname", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Lurdo"}, {"tag": "p", "text": "The one known as \"Lurdo\" was a Human male who lived during the Imperial Period. A wealthy individual, the Human studied at a prominent university for several years, before touring the galaxy. On the Outer Rim Territories' moon Endor, he attempted to raise the level of culture and technology possessed by the native Ewoks to a degree considered more suitable by him. To that end, he had them discard their ancient rituals and practices in favor of modern technological devices that provided entertainment value. The Human was labeled as \"Lurdo\" by the Ewoks, and he believed it to be a title of great standing and prestige."}, {"tag": "p", "text": "Lurdo later set his sights on the Wookiee world—Kashyyyk. Although he brought along a translator droid, Lurdo found it difficult to grasp Wookiee practices and cultures. The Human felt a kinship with the enslaved Wookiees, likening their cultural trauma to his student years. He greatly offended the Wookiees on ethical, religious, and societal levels, but personally believed that he was being welcomed into their way of life. To complement his new endeavors, he grew his hair out, evoking what he termed the \"Wookiee spirit.\""}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Bringer of light"}, {"tag": "p", "text": "A Human male who lived during the Imperial Period attended the most prestigious university in seven solar systems for twelve years. He found the experience akin to slave labor. The Human was independently wealthy, and saw that asset as a path to freedom in terms of exploration and pan-galactic journeying. At some point, he went spelunking on Tatooine. He also performed the act of angling while on Dagobah, and even utilized a toboggan on Hoth. He later made his way to the forest moon of Endor—a rugged world, which the Human believed would afford him the opportunity to \"commune\" with nature. He also sought to document the culture of the moon's native Ewoks."}, {"tag": "p", "text": "Hoping to evoke the primitive spirit of the \"savage\" Ewoks, the Human sought to live off the land, or in his terms, \"rough it\"—he only brought along with him what he understood to be the bare essentials of survival. The bare essentials included a form of recreational listening device, a camera, and a rotisserie. He soon came to realize, however, that he would need to maintain a degree of both decency and health that the Ewok culture fell far below. Although his arrival had attracted the attention of the Ewoks, the Human's first interaction with them was an endeavor to cover their lower halves, or what he termed their \"shame,\" with underpants."}, {"tag": "p", "text": "A second initiative arose when the Human noted that the unkempt body hair of the Ewoks raised the possibilities of lice, fleas, and all manner of other parasites. The presence of dandruff disturbed the Human further, and so he set about shaving the Ewoks. Additional problems came from the fact that the Ewoks chose to defecate aboard his starship, which the Human was required to clean up. The Human was also puzzled by the pagan rituals undertaken by the Ewoks—he firmly believed that their practices would stave off the potential for tourists in the currently conservative market. Furthermore, he was flabbergasted by the Ewok worship of trees, as it prevented Endor from developing a potentially flourishing logging trade."}, {"tag": "p", "text": "The Human set about clearing away all the sacred Ewok trinkets, instead providing the natives with a series of modern entertainment devices, such as viewscreens and sound systems. The Ewoks flocked to the new offerings with curiosity. Confident that he was progressing cultural relations with the Ewoks, the Human decided to tour the moon. Carried by Ewoks, the Human reveled at the sight of the untainted forestland, while discarding a used cola can. Satisfied with his work, after ten days on Endor, the Human returned to his starship, ready to depart. One of the Ewoks approached him with what appeared to be a set of glowing crystals. The Human believed that they were a ritual gift to mourn his departure, and supposed that they possessed a mythical power. They were in fact the shattered remains of his sublight drive."}, {"tag": "p", "text": "Another gift presented by the Ewoks was what the Human perceived to a bag of choice candies—in actual fact, they were a collection of gundark feces. Departing in his ship, the Human unwittingly consumed the fecal matter with relish, and mused on his accomplishments. He noted that the Ewoks had given him the name \"Lurdo.\" Since it was what they called him, he conjectured that it meant \"one who is infinitely wise and respected.\" While departing Endor, Lurdo's ship sustained a failure in its now non-existent sublight drive, the remains of which hung from the craft's instruments, as a memento of the Human's Endorian sojourn."}, {"tag": "h3", "text": "The getting of honor"}, {"tag": "p", "text": "Lurdo's next stop was the Wookiee homeworld. He could identify with the oppression of the Wookiees under Imperial rule—they had been essentially kidnapped and sold as slaves, an ordeal that Lurdo found his university years to be an appropriate analogue to. He brought a translator droid with him to the planet and elected to grow his hair out, hoping to evoke the \"Wookiee spirit.\" As Lurdo had his boots polished by a Wookiee, he waxed lyrical about the slave plight of the Wookiees, but was querulous as to the name of the planet he was on. The droid provided it—\"Kashyyyk\"—but Lurdo mirthfully refused to pronounce the name, finding Shyriiwook dialect to be far too awkward and ridiculous to learn."}, {"tag": "p", "text": "As Lurdo attempted to come to grips with Wookiee culture, he sat down to a meal with several of their number. He was presented with xachibik broth, which he brusquely refused, instead electing to consume Crumps™ crunchy wog clusters. The Wookiee protested, claiming that not only was it an insult to his family's grave if he were to turn down food he was offered, but that Crumps™ products were produced by child labor on the neighboring world of Kwookrrr. When the translator droid attempted to explain that to Lurdo, he laughed it off, believing that the Wookiee was merely jealous of his Crumps™ crunchy wog clusters."}, {"tag": "p", "text": "Since he was going to be staying on Kashyyyk for several days, he informed the Wookiee that he wished to perform a sacred and eternal Wookiee tradition, in order to become a part of the Wookiee's honor family. The translator droid explained that Lurdo would have to harvest the silky strands of the carnivorous syren plant. Incredulous, Lurdo struck the droid, believing it to be faulty, until he actually saw the plant itself, and the humanoid remains surrounding it. Lurdo's Wookiee companion presented him with a ryyk blade that had been passed down through generations, and which was engraved with the names of Wookiees who had died defending Rwookrrorro, the capital city of Kashyyyk. Lurdo discarded the weapon immediately and sent his droid in to collect the strands. The droid was mangled by the plant, but managed to extract the silky strands, which Lurdo collected."}, {"tag": "p", "text": "Returning with the strands, Lurdo expected some sort of prize, and began to suspect that he would be presented with a personal bantha. The Wookiees attempted to explain that he was gaining honor, a far more substantial prize than anything material, but the Human could no longer understand them, as his droid was still trapped within the syren plant. He expected at least some form of monetary prize, but he was instead told that he had not completed his honor trial fairly. Lurdo still found the Wookiee language incomprehensible, and supposed that he would be given a Wookiee wife. He accepted this concept, but only if the wife were to be trimmed slightly. The translator droid, still functioning, emerged from the syren plant, and explained that the Wookiees wanted him to leave, as his presence hugely offended them. Lurdo dismissed the translation, fully believing that he had been welcomed into Wookiee culture, even as his companion began using the sacred ryyk blade to cut the Human's hair."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "The one known as \"Lurdo\" was confident, following his adventures on Endor, that he had performed most of the activities that the galaxy had to offer. He saw his wealth as a means to broadening his coverage of the galaxy. He perceived the Ewoks of Endor as \"savages\" and \"primitives,\" and his view of living roughly, off the land, included the utilization of a great many items of leisure. Lurdo also sought to elevate the Ewoks to his level of hygiene and decency. He was annoyed by the obsolete and primitive rituals of the Ewoks, seeing instead opportunities for enterprise. He valued modern inventions and devices of entertainment much more than the sacred trinkets of the Ewoks, and believed that his innovations and progressions of Endorian culture had been highly taxing work."}, {"tag": "p", "text": "Lurdo believed he was at an ideal position to sympathize with the Wookiees, who were enslaved by the Galactic Empire, due to the strenuous environment that he had found student life to be. Although he had equipped himself with a translator droid, he refused to heed the droid's translations, and believed the device to be faulty when it in fact relayed perfectly what the Wookiees were trying to tell the Human. He was very protective of his grown-out hair, which he called his \"Wookiee spirit\"—when two young Wookiees were playing near him, he was careful to warn them not to mess with his hair. Lurdo was also not averse to the idea of being betrothed to a female Wookiee, although he would only embrace the idea should the potential wife's body fur be more properly maintained than was the status quo. Lurdo possessed wavy blond hair and pale skin."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Human identified as Lurdo first appeared in \"What They Called Me\", a short comic published in Star Wars Tales 5 (2000). It was written and illustrated by Craig Thompson, and later reprinted and expanded in Star Wars Gamer 4 (2001), thereby extending the character's exploits. The phrase “Lurdo” was first seen in 1984's “The Ewok Adventure” (also known as “Caravan of Coursge”). When Mace Towani is freed from the grasp of a hostile tree-dwelling creature by the Ewoks, an Ewok points to the creature and calls it “Lurdo”."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}