{"url": "Areta_Bell", "categories": ["Category:Legends articles", "Category:Alliance Fleet captains", "Category:Corellians", "Category:Females", "Category:Humans", "Category:New Republic Defense Fleet admirals"], "nodes": [{"tag": "h1", "text": "Areta Bell"}, {"tag": "p", "text": "Areta Bell was a red-haired Human female native from the planet Corellia, who served in both the Alliance Fleet and the New Republic Defense Fleet during the Galactic Civil War."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Captain Areta Bell was given command of the GR-75 medium transport Dutyfree, and participated in the evacuation of Hoth. Escorted by Luke Skywalker and Wedge Antilles, Captain Bell's transport ran the Imperial blockade and made it to the rendezvous point."}, {"tag": "p", "text": "Following the Battle of Hoth, Areta Bell rose through the ranks of the Rebel Alliance and its successor, the New Republic. Under the new galactic government, Areta was promoted to the rank of Admiral, and commanded the Victory II-class Star Destroyer Swift Liberty. She and her ship participated in the campaign against Prince-Admiral Delak Krennel, notably in the Battle of Liinade III, where, under her command, the Swift Liberty helped the Moonshadow to disable the Ciutric Hegemony's Direption. During the battle, the Swift Liberty was the home to Rogue Squadron."}, {"tag": "p", "text": "By 12 ABY, Areta Bell was assigned command of the Endurance-class fleet carrier Endurance, assisting General Wedge Antilles in the Battle of Orinda. Despite Antilles' orders to launch her squadrons of E-wing starfighters against the Executor-class Star Dreadnought Reaper, Bell hesitated, knowing that they were no match for the larger ship. Soon afterward, the Star Dreadnought Dominion arrived in system and joined in the attack on both Endurance and Antilles' command ship, Lusankya. Lusankya was able to retreat, but Endurance was destroyed, killing all onboard, including Bell."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}