{"url": "Lusubrin_T%27shkali", "categories": ["Category:Legends articles", "Category:Gladiators", "Category:Males", "Category:Nagai", "Category:Scouts"], "nodes": [{"tag": "h1", "text": "Lusubrin T'shkali"}, {"tag": "p", "text": "Lusubrin T'shkali, also known as Brin was a Nagai who fought in the Nagai–Tof War. Before that time he competed in the Dool Arena at The Broken Tusk as a top contender challenging the reign of champion Tull Raine."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Brin was one of many Nagai sent into the galaxy from the Firefist galaxy as an advanced scout for their eventual invasion. Brin ended up on Reuss VIII and signed up for a fight in the Dool Arena. The night went well for him, as he used his Nagai training to upend the competition. After Brin's initial success, he became one of the regularly seen fighters."}, {"tag": "p", "text": "When the Nagai and then later the Tof invaded he was part of the conflict. While many of the Nagai allied with the Mandalorians to liberate Nagi, he was one of the few Nagai to remain in Alliance space after the conclusion of the war."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Brin became well-known for his exotic look and flashy style. While other fighters would quickly stoop to less than honorable tactics, Brin continued to fight with honor. Brin's upright character and alluring mystique made him a popular fighter with the ladies. He had chalky skin, long ebony hair, and oval pupils of blue against black. He had a silver tattoo on his neck and purple tattoo around his left eye."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "Brin's rise through the fighting ranks was well deserved as he was one of the most skilled competitors. Extremely dangerous with all forms of combat, Brin showed true mastery with his Tehk'la blades. As befitting his role as an advanced scout he also was well trained in espionage and covert activities."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Brin carried a pair of Nagai Thek'la blades that he used with great skill in the arena. In addition he carried a SoroSuub QuickSnap 36T. When in the arena he would wear a light suit of electromesh armor for protection."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lusubrin T'shkali was designed by Paul Danner and Bill Smith for Wretched Hives of Scum & Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Tim Bobko."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}