{"url": "Luta", "categories": ["Category:Canon articles", "Category:Females", "Category:Twi'leks", "Category:Wardens"], "nodes": [{"tag": "h1", "text": "Luta"}, {"tag": "p", "text": "Luta was a Twi'lek female who served as the warden of the Megalox prison. She accepted bribes to allow visitors to visit the prison. Despite being bribed by Resistance General Leia Organa into admitting Poe Dameron and his Black Squadron into her prison, she accepted a larger bribe by the First Order Agent Terex to have her men abandon Black Squadron in the prison. Later, she accepted Poe's deal to escape with Grakkus the Hutt in return for restoring the controls for her prison's gravity shield."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Warden Luta ran the privately-run Megalox prison on the high gravity world of Megalox Beta. Megalox prison was considered to be home to the worst criminals in the New Republic. She regarded her prison as a business and was willing to accept bribes in order to admit visitors into her prison. Megalox prison was protected from the planet's high gravity by a gravity shield generated by a space station, that served as the prison's administrative center. Luta let the prisoners run the prison themselves and regularly ferried supplies to them in shuttles."}, {"tag": "p", "text": "In 34 ABY, Luta received bribes from both the Resistance General Leia Organa and the First Order Security Bureau Agent Terex to visit Grakkus the Hutt, who had been imprisoned since the Age of the Empire. Both the Resistance and First Order wanted to question Grakkus about the explorer Lor San Tekka, who was believed to know about the whereabouts of Luke Skywalker. Knowing that Poe Dameron and his Black Squadron had been sent by General Organa to visit Grakkus, Terex bribed Luta into abandoning the group to the tender mercies of the prisoners instead of escorting them to Grakkus' palace."}, {"tag": "p", "text": "When Poe and Black Squadron arrive, Luta greeted them at the orbital space station and briefed them about prison. She sent a squad of prison guards to escort the Resistance pilots into the prison but made arrangements to abandon them. However, Poe and his comrades managed to fight their way to Grakkus' fortress. With two parties competing for the same information, Grakkus offered to provide the information to whoever could help him escape. In response, Poe contacted his astromech droid BB-8 and got him and the other droids O-R10N, R2-HA, and R4 to deactivate the space station's gravity field. They managed to knock out the guards."}, {"tag": "p", "text": "Luta was in the space station's command center when one of her officers reported that a crowd of gangsters was congregating around Grakkus' compound. Luta commented that Papa Toren and the other crime lords had decided to take down Grakkus; not realizing that Terex had engineered the riot. When the officer asked if they should intervene since they had civilians down there, Luta replied that Black Squadron knew the risks and decided to watch how the situation unfolded. She also placed her bet on Isin winning the power struggle. When a security breach was detected in the primary security field generator, she dispatched guards to Deck Twelve to investigate."}, {"tag": "p", "text": "A security droid was dispatched to investigate and encountered Black Squadron's droids. The security droid destroyed O-R10N before being disabled by BB-8. The astromechs then deactivated the prison's gravity field, overwhelming the gangsters. Black Squadron was unaffected since they wore gravity belts. With Terex incapacitated, Poe managed to rescue Grakkus. Meanwhile, a prison officer informed Luta that someone had sliced into the prison's primary security terminals and disabled the gravity field. Poe then contacted her and managed to convince Luta to allow his group to leave with Grakkus in return for restoring control of the prison. Outmaneuvered, Luta was forced to accept Poe's terms."}, {"tag": "p", "text": "After Poe's group and Grakkus departed the prison, BB-8 restored control of the prison to Luta. She ordered her officers to restore the gravity field and to send medical teams to the surface. Luta feared that losing too many prisoners on this cycle would make her prison unprofitable. Before her men could fulfill these orders, a vengeful Terex rammed his starship Carrion Spike through the space station's generators, causing it to lose power. Fearing the loss of the prisoners, Luta dispatched shuttles to evacuate the prisoners. However, Terex began destroying the shuttles. Before he could inflict further damage, Black Squadron attacked Carrion Spike, forcing Terex to retreat."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Luta was a female Twi'lek with green skin and red eyes with cross-shaped irises. She was a profit-seeking warden who ran her prison like a business. Luta was willing to accept bribes from any party. Her avaricious nature led her to have little regard for the lives of her prisoners and guests. Luta also enjoyed seeing the prisoners fight and even placed bets on them. Since she regarded her prisoners as economic commodities, Luta panicked when Megalox's gravity shield was deactivated since the planet's high gravity would kill them. She regarded losing many prisoners in one cycle as a danger to her profits and dispatched medical teams to treat and rescue them."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Luta first appeared in Poe Dameron 4, a comic book written by Charles Soule, illustrated by Phil Noto, and published by Marvel Comics in 2016."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}