{"url": "Lutin_Hollis/Legends", "categories": ["Category:Legends articles", "Category:Humans", "Category:Males", "Category:Royal Naboo Security Force officers"], "nodes": [{"tag": "h1", "text": "Lutin Hollis"}, {"tag": "p", "text": "Lutin Hollis was a male Human and a veteran lieutenant of the Royal Naboo Security Forces on the planet Naboo. He was captured by the Trade Federation in 32 BBY but later rescued and went on to fight against the invasion."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Lutin Hollis, a male Human, spent his youth in the hills of the planet Naboo on his family's small farm. He then spent time traveling the Outer Rim Territories in search of experience and adventure. By the time of the Trade Federation invasion of Naboo, he was an accomplished pilot. Hollis was captured in the opening stages of the invasion. When he was rescued from his prison camp, he joined a resistance band led by Captain Kael. The captain was later shot down in battle, and Hollis reported this fact to his fellow resistance member, Gavyn Sykes. Hollis then joined in the search for Kael, eventually locating the captain's fighter. Kael revealed with his dying breath that their smuggler ally Borvo the Hutt had betrayed him. Sykes swore revenge against the Hutt. Hollis and his wingmate Vedd Deviss flanked the Hutt's position on Porso Hill, protecting Sykes while he engaged the Hutt's personal transport. After Borvo was forced to flee, the resistance turned their sights back to the Trade Federation."}, {"tag": "p", "text": "Acting on information provided by the mercenary pilot Kol Kotha, they planned on liberating Camp Four. Flying under cover of darkness, the pilots flew into the camp. Hollis broke formation, thinking his family might be in the camp. His actions exposed their position to the enemy. Sykes was able to infiltrate the camp and liberate the prisoners. Hollis performed a strafing run, firing on several tanks which were threatening Sykes; Hollis succeeded in blowing up part of the wall, allowing Sykes to reach a shield generator. He had a son, Reyé Hollis, who joined the Rebel Alliance."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Hollis was a capable pilot, flying the N-1 starfighter into battle. He was also rash at times, but rejoined the formation afterward. He was willing to take risks to protect his friends and family and to stop the Trade Federation. He was also the third pilot (P3) on the Queen's Royal Starship behind Ric Olié."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lutin Hollis was portrayed by Philip Delancy in Star Wars: Episode I The Phantom Menace and voiced by Steve McPartlin in the 2000 video game Star Wars: Episode I: Battle for Naboo. He later received an entry in 2008's The Complete Star Wars Encyclopedia and the Star Wars: Episode I The Visual Dictionary."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}