{"url": "Lutrillian/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Lutrillians", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Lutrillian"}, {"tag": "p", "text": "The Lutrillians were sentient humanoids indigenous to the planet Lutrillia, in the Yarith sector of the Outer Rim Territories. Members of the species had broad, wrinkled features, pointed ears, and hair growing from their heads and cheeks. Thick skin and a layer of blubber bolstered them against physical damage and harsh cold. The Lutrillians evolved a nomadic lifestyle to avoid subterranean predators and to visit oases scattered about their remarkably flat homeworld. They adapted to the introduction of galactic technology by moving into wheeled platform-cities. These mechanical beasts lumbered across the planet's equator, stripping the surface of food, water, and raw materials. Lutrillians enjoyed adventure, high stakes, and chance-taking, traits that made them natural entrepreneurs."}, {"tag": "p", "text": "In the early years of their world's introduction to the greater galaxy, traveling to Lutrillia required a time-consuming side trip from the Corellian Trade Spine in what was then considered Mugaari Space. Around 400 BBY, the explorer and entrepreneur Ecclessis Figg blazed a more direct route to the world that became known as the Lutrillian Cross. The Lutrillians found themselves with greater contact to the outside galaxy than ever before, and their influence in the Greater Javin region of the Outer Rim expanded. Lutrillians established themselves on many worlds. Some of the more successful Lutrillians included Solomahal, a general of the Clone Wars, Treva Horme, head salesbeing and executive planner for Planet Dreams, Inc., on Bespin, and Sawthawne, a crime lord of that same world."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Lutrillians were sentient humanoid bipeds who stood between 1.5 and 2 meters in height. Thick skin—in shades that varied from white or pale to red or tan—protected them from damage, and a deep layer of fat kept them insulated from frigid temperatures. Some Lutrillians had sharp, claw-like fingernails, while others had blunt nails like a Human; similar variation marked the number of digits, with Lutrillians having three, four, or five fingers per hand."}, {"tag": "p", "text": "Their faces were broad and wrinkled, with big, cleft mouths, wide, flat noses, and large, wide-set, brown, black, or pink eyes with heavy lids. In some specimens, pink lips bordered the wide mouth, which in turn held white teeth. Their pointed ears stuck straight up from the sides of their heads. Thick gray or brown hair grew from their heads and jowls. Their facial furrows deepened and changed depending on their emotional state. Lutrillians entered adolescence at thirteen standard years and were considered full adults at eighteen standard years. The average life expectancy for members of the species was ninety standard years."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Lutrillians were astute and clever with an inclination toward adventure and nomadism. They were natural risk-takers, a penchant that manifested even more strongly when personal gain—especially monetary gain—was at stake. This combination of greed and risk made them gifted entrepreneurs and hagglers. Other races generally found the Lutrillians to be friendly and easy to get along with, although the Lutrillians' experience living in overcrowded conditions made them a bit clueless as to what other beings considered personal space. Lutrillians got along well with their galactic neighbors, including various Human and Nothoiin populations. Nevertheless, the Mugaari species viewed the Lutrillians as collaborators for failing to resist the Human \"invaders\" who had \"conquered\" the region."}, {"tag": "p", "text": "On their homeworld, Lutrillia, the Lutrillians inhabited enormous wheeled platform-cities that barreled across the tundra. At any one time, there were about 100 such contraptions roaming the planet's equatorial regions, half headed east and the rest west, pausing only to gather supplies such as food, water, and raw materials from the surface. Smaller and faster transports ferried passengers and cargo between the giants. While the species had access to all aspects of galactic technology, the cities were too small to accommodate the world's 800 million Lutrillians comfortably, so conditions were often overcrowded. Each city was governed by an independent city council."}, {"tag": "p", "text": "The Lutrillians' primary export was ochroid dust. They imported high technology, especially mechanical parts to keep up and improve their wheeled cities—even these behemoth biomes could fall prey to the world's burrowing predators should they break down."}, {"tag": "p", "text": "The Lutrillians spoke a rough-edged language, also known as Lutrillian, that was replete with short grunts and snorts. Most Lutrillians could understand and speak Basic. Some Lutrillian names were Atheloe, Erathewen, Flewel, Hwarrthi, and Luthinoe."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lutrillians evolved on Lutrillia in the Lutrillia system, part of the Greater Javin region of the Outer Rim. Lutrillia was a cold, inhospitable place. The primary terrain was endless expanses of flat, dry, tundra criss-crossed by frozen rivers. Scarce oases of fresh liquid water dotted the world's equator. As the Lutrillians developed intelligence, they took to wandering between these water sources, ever watchful for burrowing predators such as chompers and nippers."}, {"tag": "p", "text": "Republic scouts made contact with the Lutrillians sometime between 3000 and 1000 BBY. Although the world briefly became part of territory controlled by the New Sith Empire during the latter phase of the New Sith Wars of 1004 to 1000 BBY, around this time, Lutrillia lay beyond the Republic outpost world of Javin at the end of the Corellian Trade Spine and the edge of the Mid Rim in what was then considered Wild Space. Kiax, the spinward half of the hazardous Twin Nebulae nearby, prevented a direct hyperlane to the world. A detour passed through Mugaari Space, where the native Mugaari demanded a hefty portion of any profits from traders heading to Lutrillia. As a result, contact between the Lutrillians and outsiders was rare, but intrepid traders did find it worthwhile to navigate the hazards of Mugaari Space and tolerate the slow route to trade with the Lutrillians. Efforts to find a more direct route to their world failed. The Republic's subsequent defeat of the Mugaari in a brief war and the annexation of their territory made Lutrillia part of the Javin sector but otherwise had little effect on their economic and political realities."}, {"tag": "p", "text": "Around 400 BBY, the explorer Ecclessis Figg launched an expedition from Gerrenthum to map the unknown regions adjacent to the Corellian Trade Spine. He was rewarded with a direct route to Lutrillia that cut through the Twin Nebulae and on to the ancient, roundabout route to Lutrillia from the Mid Rim. The route became known as the Lutrillian Cross, and its continuation west to Koda Space Station along the Koda Spur."}, {"tag": "p", "text": "Contact between Lutrillians and outsiders blossomed, and Republic investment and trade infused Lutrillia and the region around the Twin Nebulae with new life. Figg was careful to avoid conflict by keeping this arrangement beneficial to all involved, and the influx of capital and high technology caused a paradigm shift on the world. The Lutrillians used their newfound wealth and technology to create vast, wheeled cities. They continued to roam their world as they had for generations, only now, they were afforded greater speed and protection from burrowing predators."}, {"tag": "p", "text": "Over the next few decades, Figg's company of explorers blazed new hyperlanes through the region, and the Lutrillians found themselves more and more connected to the greater galaxy. The species established colonies on nearby worlds such as Kirtarkin, Gerrenthum, and Ione, and Lutrillian businessbeings set up operations across the region. For example, Lutrillian investors set up spaceports on the swamp world Mijos, although many of their structures sank into mud due to poor design. Their region's influence grew such that the Republic demarcated a new Anoat subsector in the area, and later split it into the Anoat and Yarith sectors. Worlds with significant Lutrillian populations were divided between the two sectors to limit their political clout; Lutrillia itself fell within the bounds of the Yarith sector."}, {"tag": "p", "text": "This situation persisted through the next few hundred years. Lutrillia was on the borders of the Republic during the Clone Wars, and the world became part of Grand Admiral Thrawn's holdings in 9 ABY. By 25 ABY, the Yarith and Anoat sectors were once again considered part of the Javin sector. The Lutrillians and their region were spared the atrocities of the Yuuzhan Vong invasion of the galaxy in 25 ABY. In 137 ABY, it was part of Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Lutrillians in the galaxy"}, {"tag": "p", "text": "Lutrillians who grew tired of life on their homeworld often left for greener pastures. In fact, it was quite common for Lutrillians to barter passage off their world to pursue adventure and wealth in the greater galaxy. They could be found throughout the Outer Rim, working as entrepreneurs, businessbeings, and government bureaucrats. More adventurous Lutrillians found work as fringers, scoundrels, and scouts."}, {"tag": "p", "text": "The Lutrillians were one of the four most influential species in the Greater Javin, along with Humans, Mugaari, and Nothoiins; the competition between these groups sometimes spilled over into out-and-out rivalry. Lutrillian emigrants formed colonies on other worlds, and several planets had significant Lutrillian populations. In addition to their homeworld, the beings held a sizable presence on worlds along the Corellian Trade Spine, including Kirtarkin, Gerrenthum, Zhanox, and Ione. In the Lutrillian Cross and the Loop that connected to it, Lutrillians were an important component of the population of the swamp world Mijos, where they ran several spaceports. Some 100,000 to 360,000 Lutrillians called Bespin home, making up about 6% of its population. Lutrillians were present in smaller numbers on planets such as Oseon VII and Svivren, and in locations such as Horn Station and StarForge Station."}, {"tag": "p", "text": "Several Lutrillians made a name for themselves in the galaxy at large. Solomahal was a Republic general during the Clone Wars who headed the Republic defenses on the planet Azure. Although he lost the Battle of Azure Spaceport and was captured by the Separatists, he managed to destroy an important codebreaker and escape with his life, actions that made him a hero of the conflict. After the war, he turned to mercenary work in the Outer Rim, based himself on Tatooine, and lived in hiding from the Empire. The Lutrillian Maysano had a record in a Coruscant database of criminals; during the Clone Wars, the Jedi Jocasta Nu and Ahsoka Tano briefly considered the Lutrillian a possible suspect in their search of a thief who had stolen Tano's lightsaber, and Tano viewed his file on another occasion while trying to prevent an assassination she had seen in a vision. By a later point in the war, the Republic Judiciary Central Detention Center on Coruscant held a large population of Lutrillian inmates. When the Human Jedi Knight Obi-Wan Kenobi infiltrated the prison disguised as the bounty hunter Rako Hardeen to gather intelligence about the activities of a Phindian crime lord named Moralo Eval, the Jedi's presence eventually led to a prisoner riot. One Lutrillian stole a blaster rifle from a clone trooper guard; although the prisoner was felled by a stun blast from another guard, his actions caused enough chaos for Kenobi, now working alongside Eval and the Duros bounty hunter Cad Bane, to escape the facility. The Lutrillians Atheloe and Ownellco were present at Chalmun's Spaceport Cantina in Mos Eisley the day Obi-Wan Kenobi and Luke Skywalker met Han Solo and Chewbacca in 0 BBY. Members of the species visited Mos Espa on that planet as well."}, {"tag": "p", "text": "Other Lutrillians, in contrast, established themselves in business, from a hospitality specialist on Oseon VII, to Treva Horme, who worked her way up to become part-owner and head salesbeing for Planet Dreams, Inc., a Cloud City firm that constructed vacation homes on unused, habitable worlds in the Greater Javin and even isolated asteroids. After the evacuation of the city in 4 ABY, she relocated with her business partner Wiorkettle to the Oseon asteroid belt. Finally, Sawthawne was a Lutrillian gangster who operated from Cloud City's Port Town district. His presence attracted a band of bounty hunters, scoundrels, and smugglers to the area."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first Lutrillian characters in Star Wars lore appear in the background of the cantina scene of Star Wars: Episode IV A New Hope (1977). Stuart Freeborn designed the characters after costume sketches by John Mollo; the characters were on set in London during principal photography, and they are more prominently featured in an early cut of the sequence, one of them speaking to an insectoid alien. During production, the crew referred to the Lutrillians as \"The Colonel\" and the \"Hare Mouse.\" Although both Lutrillian costumes from A New Hope are identical save for an ascot worn by one of the two actors, one of these Lutrillians was slated to be named \"Ownellco.\" One of the masks was used again in The Star Wars Holiday Special (1978). Another Lutrillian background character appears briefly during the evacuation of Cloud City in Star Wars: Episode V The Empire Strikes Back. The Marvel Comics adaptation of the film features a Lutrillian whose design is similar to that of the character in Empire, although it not known whether this is intended to be the same character."}, {"tag": "p", "text": "In 1996, game company Decipher used an image of the Holiday Special Lutrillian for its A New Hope Limited expansion to its Star Wars Customizable Card Game to create the character of Solomahal. Despite the card image's source not coming from A New Hope, later sources have established Solomahal as one of the two Lutrillians seen during the cantina sequence of that film. Nevertheless, the publication of \"Rogues Gallery: The Usual Suspects: Who's Who in Mos Eisley,\" an article in Star Wars Insider 130 written by the maintainer of Lucasfilm's Holocron continuity database, Leland Chee, establishes the A New Hope Lutrillians as Atheloe and Ownellco. Chee has since confirmed that Lucasfilm now considers Solomahal to be the Lutrillian featured in The Holiday Special, not A New Hope."}, {"tag": "p", "text": "The name \"Lutrillian\" first appeared in the second edition of the 1996 West End Games' roleplaying supplement Galaxy Guide 3: The Empire Strikes Back; however, the book includes no image of the Lutrillian character, Treva Horme, and thus leaves the species identification in doubt. The species name and image were finally paired in Decipher's 1997 Cloud City Limited expansion to the Star Wars Customizable Card Game. The Wizards of the Coast game supplement Geonosis and the Outer Rim Worlds (2004) and two online supplements for its Star Wars Roleplaying Game provided the first real looks at the species' history and culture. In the rules for this game, the Lutrillians are a playable race. They are less agile than most other species, but they are likable and have better senses."}, {"tag": "p", "text": "Lutrillians have since appeared in a few other Star Wars stories, including \"Deception,\" an episode of Star Wars: The Clone Wars that first aired on January 20, 2012. A Lutrillian appears in the trial audience in the comic story \"The Emperor's Court\", about the mother of Greedo suing Han Solo for the death of her son. The story is considered to be outside the main Star Wars continuity. Several Lutrillian sources merely repeat the backstory of Solomahal and provide no new information on the species as a whole."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}