{"url": "Lutrillian", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Lutrillians", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Lutrillian"}, {"tag": "p", "text": "Lutrillians were a sentient species of humanoids that were native to the planet Lutrillia. They were distinguished by their broad faces, fuzzy jowls, and wide-set eyes. Lutrillians lived a nomadic lifestyle and traveled around their homeworld. They loved adventure and discovery, often going off-world to explore other cultures. They were considered, by other species, to be very agreeable, but had a small problem with greed."}, {"tag": "p", "text": "At some point during the Clone Wars, there were at least eight Lutrillian detainees in the Republic Judiciary Central Detention Center on Coruscant. During the Imperial Era, the Lutrillian Secon Daree was a Rebel pilot. Shortly before the Battle of Yavin, Ownellco and another Lutrillian visited the cantina of Mos Eisley the day Obi-Wan Kenobi and Luke Skywalker met Han Solo and Chewbacca."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Lutrillians stood out for their broad faces with wide-set eyes. They had fuzzy jowls and long spiked ears that pricked up. A Lutrillian's nose had a distinctive line that went vertically through the middle and through the upper lip. Their skin was usually ruddy, but white- or brown-skinned Lutrillians also existed. Some Lutrillians had whiskers on their face."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "Lutrillians tended to live a nomadic lifestyle, traveling around their homeworld of Lutrillia and avoiding subterranean predators. They loved adventure and discovery, and often traveled off-world to explore other cultures. They were considered very agreeable, but had a small problem with greed."}, {"tag": "h2", "text": "Lutrillians in the galaxy"}, {"tag": "p", "text": "During the Clone Wars, the Lutrillian Maysano was a criminal wanted for murder. At least eight Lutrillians were in the Republic Judiciary Central Detention Center, where many became involved in a riot that saw the escape of Moralo Eval, Cad Bane, and a disguised Obi-Wan Kenobi."}, {"tag": "p", "text": "During the Imperial Era, a Lutrillian named Pomi Harchmak was a heavy-equipment inventory operations handler at Pryce Mining, a mining company on Lothal. A Lutrillian warehouse manager hid criminals from the Gray Syndicate in his warehouse. A Lutrillian named Secon Daree was a part of the Alliance to Restore the Republic by 1 BBY and fought in the attack on Lothal. In 0 BBY, two Lutrillians, one of whom was named Ownellco, were at Chalmun's Spaceport Cantina on Tatooine when Luke Skywalker met Han Solo. A short while later, Skywalker entered a cantina on Nar Shaddaa where a Lutrillian and the other residents were quick to notice him. Another Lutrillian was at a gambling table when Skywalker and Solo bet and lost the money they were meant to buy supplies with. A Lutrillian was in Cloud City when the Baron Administrator, Lando Calrissian, told the people to get out before the Galactic Empire fully occupied the place."}, {"tag": "p", "text": "During the New Republic era, a Lutrillian was at the Colossus refueling station on Castilon."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lutrillians first appeared in the background of the cantina scene of Star Wars: Episode IV A New Hope, released in 1977. Stuart Freeborn designed the characters from costume sketches by John Mollo, and they were featured more in an early cut of the sequence, where one of them spoke to an insectoid alien."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}