{"url": "Lycan", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Fallen Jedi", "Category:Individuals of unidentified species", "Category:Males", "Category:Post-Ruusan Jedi Knights"], "nodes": [{"tag": "h1", "text": "Lycan"}, {"tag": "p", "text": "Lycan was a male Jedi Knight who was the master of Sardoth until he fell to the dark side and became a dangerous Dark Jedi. He escaped from Republic custody when the shuttle carrying him to trial on Coruscant crashed on Darca Nyl's home planet."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Details on Lycan's life are scarce. It is known he was a Jedi, Sardoth's master, and was the first to introduce the Iktotchi to the dark side of the Force. At some point he left the Jedi Order and became a Dark Jedi until 32 BBY, when he was apprehended by a Jedi, who attempted to transport him back to Coruscant. Lycan, however, attempted to seize control of the transport, causing it to crash close to Darca Nyl's home. Hauling himself from the site of the crash, Lycan forced his way into Nyl's home, where Darca's son Neas was hiding. When Neas attempted to defend himself, Lycan killed him and fled. Nyl, who had learned Lycan's story from the now deceased Jedi, soon discovered his son's body and pursued Lycan in a quest for vengeance."}, {"tag": "p", "text": "Lycan, who had been injured in the crash and as a result lost his memory, knew only that he was strong in the Force and the dark side, and felt that the Force was leading him to a particular destiny. Following this call, he made his way to Molavar, with Nyl in close pursuit. Arriving at Molavar, Lycan proceeded to use his powers in the Force to win a massive amount at gambling, including a new ship. When the man he was gambling against and the bouncers of the casino accused him of cheating and attempted to detain him, Lycan slaughtered everyone except for the dealer by applying pressure on their brachiocephalic arteries with the Force. He then took the ship, heading deep into the desert."}, {"tag": "p", "text": "However, with no particular destination other than the feeling in the Force, Lycan began to wander in circles, heading nowhere in particular. As a result, Nyl had no problem tracking him. However, Lycan soon realized he was being followed. When he finally caught up with Nyl near a cave, his power in the Force overwhelmed the mercenary, injuring him. Nyl fled for the safety of the cave, with Lycan close behind."}, {"tag": "p", "text": "Lycan, however, spared Nyl, keeping him alive long enough to help him regain his memories. When Nyl told him who he was Lycan was jubilant, reveling in his own power, and prepared to strike down Nyl. He was so caught up in the revelation, however, that he failed to realize that Nyl had lured him into a trap. Nyl detonated a number of mines that he had placed, crushing Lycan beneath the surrounding tons of rock."}, {"tag": "h3", "text": "Legacy"}, {"tag": "p", "text": "Nyl recovered Lycan's lightsaber, and was still using it as his main weapon when he joined Wyl Tarson's Mission to Ahakista in 9 months ABY. Unfortunately for him, Sardoth was there as well and recognized the weapon. He eventually confronted Nyl, vowing to retrieve his dead master's blade."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Lycan possessed very advanced telekinetic Force powers. It was known that he was very proficient in using Force Crush. Additionally, he practiced in advanced levitation; he was able to levitate himself and walk over water for a long amount of time as well as levitating numerous objects at one time. He could also create visible, orange-colored Force fields, though he was only able to sustain it for a short time when Darca Nyl collapsed a cavern on him."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}