{"url": "Lynaliskar_K%27ra_Snyffulnimatta", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Elomin", "Category:Males", "Category:Navigators", "Category:Smugglers"], "nodes": [{"tag": "h1", "text": "Lynaliskar K'ra Snyffulnimatta"}, {"tag": "p", "text": "Lynaliskar K'ra Snyffulnimatta, also known simply as Sniffles, was an Elomin male who served as the navigator on board the vessel Uhumele, guiding the starship alongside the pilot, Crys Taanzer. He and the rest of the crew were grounded by Imperial forces on the planet New Plympto shortly after the declaration of the New Order in 19 BBY. After the Uhumele took aboard two fugitives seeking to escape the Empire—the Human Dass Jennir and Nosaurian resistance fighter Bomo Greenbark—the crew put together a plan to escape with the pair's help, and Snyffulnimatta successfully navigated the ship off-world when the plan came to fruition."}, {"tag": "p", "text": "After their escape, Snyffulnimatta and the rest of the crew agreed to help Greenbark rescue his wife and daughter, who had been captured and sold into slavery. The group traveled first to the slave world of Orvax IV, where they learned of the death of Greenbark's wife and the location of his daughter on the planet Esseles, to which they next traveled. On Esseles, the group attacked the villa belonging to Dezono Qua, the man who had bought Greenbark's daughter, only to discover she too was dead. After Qua was killed, Greenbark revealed to the group that Jennir was a Jedi, and Snyffulnimatta was amongst those in the ship's crew who believed that having Jedi with them would be a bad idea. The group eventually agreed to continue without the Jedi."}, {"tag": "p", "text": "The crew of the Uhumele later decided to sell Dreypa's Oubliette, a valuable piece of cargo that they possessed. The buyer for the cargo was Haka Hai, an old acquaintance of the Uhumele's captain, Schurk-Heren, who operated in the swamps of the world of Mimban. Upon meeting with Hai, though, the group became involved in a firefight when Hai betrayed them and attempted to steal the cargo. One of Hai's men then betrayed him in an attempt to claim the Oubliette. During the fight, Snyffulnimatta was killed while trying to save Taanzer, jumping between her and an incoming blaster bolt."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Trapped on New Plympto"}, {"tag": "p", "text": "By the year 19 BBY, the Elomin male Lynaliskar K'ra Snyffulnimatta had come to serve as the navigator on board the Maka-Eekai L4000 transport Uhumele. On the vessel, he served under the Yarkora Captain Schurk-Heren beside the Human Crys Taanzer, who piloted the ship and gave the Elomin the nickname \"Sniffles.\" Snyffulnimatta and Taanzer worked together to keep the ship on time during its regular transport runs. One month after the Declaration of a New Order—the political regime of the newly formed Galactic Empire—the Uhumele and its crew were visiting the planet New Plympto, landing their ship in a spaceport built in an area known as Cadgel Meadows. While the vessel was in the spaceport, all ships present were grounded by Imperial forces stationed in the area, who were engaged in a conflict with the native Nosaurian population. Schurk-Heren's crew wished to avoid Imperials searching their ship at all costs, but while trapped, Snyffulnimatta and the rest of the crew came to mistrust the crew of another grounded ship, the Valance, whom the navigator believed would inform the Imperials if any other ship attempted to leave Cadgel Meadows."}, {"tag": "p", "text": "One night during the grounding, the Uhumele was boarded by a pair of survivors from the New Plympto resistance who had escaped from a recent battle in an area known as Half-Axe Pass. The pair, seeking to avoid Imperial attention, jumped upon Taanzer after seeing her standing in the open hatch of the Uhumele, hoping to prevent her from calling out. However as soon as the pair entered the ship, the rest of the crew, including Snyffulnimatta, held the boarders at blasterpoint, causing them to release the pilot, who punched one of the boarders before the Elomin pulled her away. Schurk-Heren then introduced the crew, identifying Snyffulnimatta by his nickname, much to the Elomin's annoyance, and explained to the boarders that they too wanted to avoid Imperial attention. The boarders then identified themselves, the Human as Dass Jennir and the Nosaurian as Bomo Greenbark, and explained that they had come to the spaceport seeking the latter's family, who had evacuated to the area during the recent battle. Snyffulnimatta, however, chose to leave with Taanzer at this point instead of remaining for further introductions."}, {"tag": "h3", "text": "Hunt for the Greenbarks"}, {"tag": "p", "text": "Jennir and Greenbark were allowed to stay on the ship after the crew learned that Greenbark's family had been captured and enslaved, and the next day, the pair joined the crew in planning a way to escape the area. When Jennir suggested that they try to persuade all the grounded vessels to take off at once to avoid any individual ship being immediately shot down, Snyffulnimatta interjected that the Valance would reveal the plan when contacted about it, to which Taanzer agreed. This led to a new plan in which Jennir instead stole a set of clone trooper armor and then an Alpha-3 Nimbus-class V-wing starfighter, which he used to fire on the grounded Valance. As Jennir attacked, Schurk-Heren announced over an open comlink that the Imperials were attacking all grounded vessels, which led to every other vessel in the spaceport taking off to escape damage. Snyffulnimatta then successfully navigated the Uhumele off-world despite it coming under attack from V-wings, which Jennir, still in his stolen V-Wing, and Ko Vakier, another member of the crew on the Uhumele's turret, destroyed with their ship's weapons. Having escaped the immediate threat, the group agreed to travel to Orvax IV, where Greenbark's family had been sold as slaves."}, {"tag": "p", "text": "Once on Orvax, Snyffulnimatta remained on the Uhumele while Jennir, Greenbark, and Vakier, along with two other crew members—the Togorian Mezgraf and the Tintinna Meekerdin-maa—searched the slave markets for Greenbark's wife and daughter. The group returned without success, having found other Nosaurian women and children sold as slaves, but also having learned that Mesa Greenbark, Bomo's wife, had been killed trying to prevent their daughter Resa from being sold. Jennir, alone, then tracked down Orso Meeto, the Chagrian slaver who had sold Resa, while Snyffulnimatta and the rest of the crew stayed put, keeping Greenbark from escaping and causing trouble due to his grief. Jennir then returned and informed the group that their next destination was the planet Esseles, where a wealthy heir named Dezono Qua had Resa. On Esseles, Snyffulnimatta joined the crew in enjoying a good quality meal in the capital city of Calamar while waiting for Jennir to gather information on Qua. Having learned that the slave owner lived in his family's isolated fortress-like villa, Jennir told the group that he didn't expect them to help him and Greenbark any further due to the danger involved, but the crew of the Uhumele refused to let the pair go alone."}, {"tag": "p", "text": "Snyffulnimatta and Taanzer brought the ship to Qua's villa and dropped off the rest of the crew, before landing the ship securely. By the time they left the ship, Qua's army of droids had been destroyed or disabled. As they attempted to find the rest of the group, they heard the sound of Jennir, having learned that Qua had eaten Resa, shooting the wealthy man. The pair reached the crew just in time to hear Greenbark berate Jennir for taking a kill that was rightfully his and then revealing that Jennir was in fact a Jedi Master. Having learned this new information, Snyffulnimatta was among the crew members who, due to the bounty on all Jedi, wanted Jennir out of the crew. The Jedi Master obliged, remaining behind at Qua's home while the Uhumele left. With Jennir gone, the crew traveled to the world of Pizkoss to pick up supplies, but while there, they were chased by Imperials. Snyffulnimatta and Taanzer managed to hastily get the Uhumele off-world, but one member of the crew, the Phindian assistant mechanic and cook Janks, was captured. While on Pizkoss, however, Captain Schurk-Heren had finalized a deal to sell the Uhumele's most valuable piece of cargo, which was unbeknownst to them the Sith artifact named Dreypa's Oubliette, to Haka Hai, an old Ishi Tib colleague of Schurk-Heren's who had come to control a gang on the planet Mimban."}, {"tag": "h3", "text": "Death on Mimban"}, {"tag": "p", "text": "The Uhumele retrieved their valuable cargo from an asteroid field where it was hidden and traveled to Mimban to make their sale. Schurk-Heren, however, did not trust Hai and so instead brought a fake crate, rigged to explode if opened, with the plan to provide the location of the real crate once he'd been paid. The entire crew then transported the cargo through the swamps of Mimban before arriving at Hai's compound. Once there, Schurk-Heren's mistrust of Hai proved correct, as after greeting the crew, the Ishi Tib ordered his men to aim their blasters at Schurk-Heren and his crew. Outnumbered three to one, the crew had no chance of fighting back, and Schurk-Heren agreed to simply leave his old friend the cargo in exchange for their lives. Hai refused, but before he could give the order to shoot, one of his men, a Gotal named Lumbra, revealed that he and a large group of Hai's men were betraying him and taking the cargo for themselves. A battle quickly broke out between the two factions of Hai's men, and the Uhumele's crew saw their chance to escape. As he attempted to flee for the exit, however, Snyffulnimatta saw one of Hai's men take aim at Taanzer. The Elomin flung himself between Taanzer and the shooter, taking the blaster shot in the back and sustaining a fatal wound. As Taanzer crouched over her dying savior, Snyffulnimatta complained that his one act of charity had cost him so much before dying in the pilot's arms. Shortly after his death, Hai's surviving men captured the rest of the Uhumele's crew, and the Ishi Tib had them put to work or thrown into the dungeons to be tortured for the location of the Oubliette, while Snyffulnimatta's body was tossed into the swamps."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lynaliskar K'ra Snyffulnimatta was a male Elomin with crimson skin and white eyes. He was an able navigator and managed to work together with Crys Taanzer to get the Uhumele out of several difficult situations. Snyffulnimatta greatly disliked the nickname of \"Sniffles,\" which the rest of the crew gave to him, and complained whenever they used it. Quite pessimistic in nature, he assumed the worst outcome would occur from many of the situations in which the Uhumele found itself, believing that if the ship tried to escape the spaceport in Cadgel Meadows, they would be betrayed by the crew of the Valance. Likewise, he was among the crew members of the Uhumele who wanted to be rid of Dass Jennir after discovering he was a Jedi, claiming that one bounty on the crew's head was enough and that Jennir would only make matters worse. Despite his dour nature, Snyffulnimatta was reasonably fond of his crew mate Taanzer, shielding her from Jennir and Bomo Greenbark when they first encountered the pair as strangers. He also chose to take a fatal blaster bolt for her; although he complained as he lay dying that his first act of charity had cost him his life, he claimed he had expected something like that would occur. After the Elomin's death, the crew of the Uhumele mourned Snyffulnimatta's loss, with Taanzer becoming particularly upset."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Whilst a crew member of the Uhumele Snyffulnimatta generally wore an open green jacket with yellow lining, bracelets, and green pants. When dining on the planet Esseles, he wore blue robes instead. In combat, he used a blaster."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lynaliskar K'ra Snyffulnimatta first appeared in Dark Times 1, the first issue of the Star Wars: Dark Times series of comic books and its The Path to Nowhere story arc. The issue, released in 2006, was written by Randy Stradley under the name Mick Harrison and illustrated by Douglas Wheatley. He then appeared as a recurring character throughout the rest of the story arc, as well as in the following arc, Parallels, which was illustrated by Dave Ross and Lui Antonio, and in which he was killed. Snyffulnimatta received mentions in a number of later issues of the Dark Times series, and also received an entry in the 2008 sourcebook The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}