{"url": "Lynnori", "categories": ["Category:Legends articles", "Category:Females", "Category:Individuals of unidentified species", "Category:Near-Humans", "Category:Smugglers", "Category:Spacers"], "nodes": [{"tag": "h1", "text": "Lynnori"}, {"tag": "p", "text": "Lynnori was a Near-Human female who was the Captain and owner of the Starbound Misfit, a modified YT-1930 transport purchased for her by Talandro Starlyte and modified by his friend, Scizzic. She was romantically linked to Talandro and spent a lot of her time on or near Starlyte Station however she refused to be tied down."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A typical tramp freighter captain Lynnori lived her days out among the stars traveling from stop to stop moving cargo and passengers around the galaxy. She was not opposed to the occasional smuggling job as well provided the pay was all right. She became romantically entangled with station owner Talandro Starlyte who repeatedly requested that she to quit her wandering ways but she repeatedly refused. Concerned for her safety, Talandro ended up purchasing a new freighter and having his associate Scizzic make some custom modifications so that Lynnori would at least be safer in her travels. He bought her a YT-1930 transport that she dubbed the Starbound Misfit."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Lynnori was a very attractive female near-Human. Her features were feline, with pointed ears, slitted eyes, a long prehensile tail, clawed hands, and a down covering of striped fur. Lynnori was fiercely independent and resisted Talandro's repeated attempts to make her set up a permanent home on Starlyte Station. She was very physical and loved to flirt, much to the chagrin of Talandro."}, {"tag": "h2", "text": "Skills and abilities"}, {"tag": "p", "text": "A result of living out among the stars was that she had a variety of skills at her disposal. She could operate transports and starfighters, she could wield blasters and repair her ship when it was damaged. She was social and had decent ability with business negotiations and gambling. Finally she had a few clandestine skills as she was able to sneak around unnoticed."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Her pride and joy was the ship that she relied on to take her through the stars. She also wore a BlasTech DL-44 heavy blaster pistol and a Czerka 411 Holdout Blaster as well as a vibroknife."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lynnori was designed by Paul Danner and Bill Smith for Wretched Hives of Scum & Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. She was illustrated by Joe Corroney. Lynnori's species is given as 'near-Human' however she physically resembles the female Farghuls Breela and Mika. Farghuls were not created until 1998 which was why the species was not listed properly."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}