{"url": "Lyric", "categories": ["Category:Legends articles", "Category:Females", "Category:Force-sensitives", "Category:Jedi trainees of the New Jedi Order", "Category:Melodies", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Lyric"}, {"tag": "p", "text": "Lyric was a female Melodie Jedi trainee from Yavin 8. She was the daughter of Gyle."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Like the rest of her species, Lyric was hatched from an egg and lived the first twenty years of her life on land. She lived at Sistra, one of the moon's many purple mountains. Due to the dangerous conditions on her homeworld and that she was Force-sensitive, her parents sent her to Master Luke Skywalker's Jedi Praxeum on nearby Yavin 4."}, {"tag": "p", "text": "In 22 ABY, Lyric turned twenty and had to undergo the Changing Ceremony, in which young Melodies would change from land-dwellers to water-breathers, making them Elders (the adults of Melodie society). Since Yavin 8 was dangerous, her two fellow Jedi trainees Anakin Solo and Tahiri Veila accompanied Lyric. Shortly after the trio's arrival, they fell under attack by several native predators including an avril, a reel, a purella and several raiths. However, Anakin and Tahiri fought and killed them all."}, {"tag": "p", "text": "Having survived, Lyric participated in the Ceremony which took place at a shallow cove in Sistra which led to a series of pools that dominated much of the mountain. At the end of the ceremony, Lyric's legs were replaced by tail slits and she breathed through gills, making her an Elder. Presumably, this also limited her activities as a Jedi to her homeworld."}, {"tag": "p", "text": "During the Yuuzhan Vong War, the extra-galactic Yuuzhan Vong invaded Yavin 8 and destroyed all life. Lyric was among the dead, killed by a voxyn, a bioengineered beast created to hunt Force-sensitive individuals."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lyric's name and that of her species are presumably a pun; lyrics are the words of a song, while a melody is the tune to which they are sung."}, {"tag": "p", "text": "Walter Jon Williams originally intended to use Lyric in his book The New Jedi Order: Destiny's Way, until he was informed that she had been killed in an earlier novel. Her role was then filled by the Anx Madurrin."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}