{"url": "Lyunesi", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Lyunesi", "Category:Outer Rim Territories species"], "nodes": [{"tag": "h1", "text": "Lyunesi"}, {"tag": "p", "text": "The Lyunesi were a fragile species of humanoids, one of six that were native to the planet Ryoone. Their faculty in translating languages and capturing every nuance of body language ensured their survival on their homeworld, which was dominated by intense competition among its indigenous species. The Lyunesi also made use of their linguistic ability offworld, serving as comm handlers at communications nexuses across the galaxy. However, in their encounters with other species, their sensitivity to body language could lead individual Lyunesi to develop an all-consuming passion for another being, which compromised their rationality. The Lyunesi comm handler Oph Nar Dinnid was forced to flee his employment in the Narrant system after that condition led him to have an affair with the alpha concubine of his liege-lord. Dinnid fled to the Shell Hutts for protection but was eventually killed by the Shell Hutt Gheeta."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "The Lyunesi were a frail species of sentient humanoids."}, {"tag": "h2", "text": "Society and culture"}, {"tag": "p", "text": "The historic survival of the Lyunesi was dependent on their proficiency in inter-species translation. Their skill extended beyond translating words and meaning and came to include every nuance of body language, despite dealing with species that functioned on differing metabolic bases. So great was their ability that the Lyunesi were more effective than protocol droids. However, their hyper-sensitivity to communication occasionally manifested in a hyper-eros, or all-consuming passion, for another sentient. Frequently reciprocated by the object of their desire, this condition could leave both individuals without a shred of self-preserving intelligence, leading to a variety of unideal outcomes."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Lyunesi evolved on the backwater planet Ryoone, located near the end of the Koda Spur in the Wazta sector of the Outer Rim Territories. For millennia, the upper atmosphere of their homeworld was permeated with volcanic ash, resulting in fierce competition for survival among the world's six indigenous species. The Lyunesi would have been wiped out by these other, stronger, species had they not mastered inter-species communications. That skill made the Lyunesi irreplaceable in managing the fluid and rapidly shifting alliances, declarations of war, and swiftly terminated peace treaties that characterized relations between the planet's other species."}, {"tag": "h2", "text": "Lyunesi in the galaxy"}, {"tag": "p", "text": "Lyunesi were found throughout the galaxy, working at every communications nexus between differing sectors of the Galactic Empire, fine-tuning the messages and negotiations that passed between the regions. Lyunesi involved in these high-level diplomatic positions occasionally created major scandals when seized by an all-consuming passion for another sentient. One such crisis was created by Oph Nar Dinnid. The Lyunesi worked as a comm handler and protocol intermediary for one of the major liege-holder clans out in the Narrant system—the clans were loose confederations of genetically linked species, with complex layers of ritual obeisance and blood oaths maintaining their unity. Dinnid fell for his supreme liege-lord's alpha concubine and was caught—publicly—in a compromising position with her."}, {"tag": "p", "text": "Dinnid fled the Narrant system, seeking refuge with the Shell Hutts on Circumtore, but not without a large bounty being placed on his head. Dinnid offered the Hutts confidential information on the liege-lord's activities, which he had stored in memory augmentors surgically implanted in his cortical areas. These augmentors were programmed to periodically parcel out the information so that Dinnid's usefulness to the Hutts would endure for years. That plan, however, was foiled when the Shell Hutt Gheeta chose to negotiate with the liege-lord, favoring immediate gain over long-term advantage: in exchange for a large sum of credits, Gheeta had Dinnid killed, ensuring that the liege-lord's information would remain secret."}, {"tag": "p", "text": "Dinnid's death was largely kept secret. Consequently, a team of bounty hunters led by Boba Fett and including Bossk, Zuckuss, IG-88, and D'harhan traveled to Circumtore to capture Dinnid. They were led into the Shell Hutts' reception hall by Gheeta, who held a long-term grudge against Fett from a previous encounter. Using Dinnid as bait, she sought to kill Fett and his team with an assembled force of mercenaries. Fett, however, detonated an explosive previously hidden in the reception hall and, in the ensuing confusion, turned the tables on Gheeta, eventually killing the Shell Hutt. His party was then allowed to leave Circumtore by the surviving Shell Hutts."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Lyunesi were created by K. W. Jeter for his novel The Mandalorian Armor, published in 1998. Since then, the Lyunesi Oph Nar Dinnid has been mentioned in a number of reference books."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}