{"url": "Argazdan_Redoubt", "categories": ["Category:Legends articles", "Category:Argazdan culture", "Category:Interplanetary governments"], "nodes": [{"tag": "h1", "text": "Argazdan Redoubt"}, {"tag": "p", "text": "The Argazdan Redoubt was a seccessionist state in the Kanz sector founded by Argazdan nationalists known as the Myrialites. It lasted only the duration of the Kanz Disorders which spanned three centuries from 3970 BBY to 3670 BBY."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Myrialites were a radical sect within Vianism which believed in forcing others to serve their deity Via. Regarding the Galactic Republic as faithless and corrupt, the Myrialites under Provisional Governor Myrial staged an uprising in the Kanz Sector during the Old Sith Wars. They seceeded from the Republic and established the independent Argazdan Redoubt. The Redoubt's forces invaded and occupied other worlds and systems within the Kanz Sector."}, {"tag": "p", "text": "When the Lorrdians of Lorrd joined forces with the Amaltannan resistance in a rebellion, the Redoubt enslaved the Lorrdians. Forbidden to speak, the Lorrdians developed another form of communication known as kinetic communication which involved subtle body gestures. With the Republic preoccupied with the Old Sith Wars and the Great Galactic War, neither the Republic or the allied Jedi Order moved against the Argazdan Redoubt for three centuries."}, {"tag": "p", "text": "Around 3970 BBY, a Lorrdian Jedi Master Mari-Elan Nora was able to muster enough support in the Galactic Senate for military intervention against the Argazdans. Despite the dogged resistance of the Myrialites under Regent Torphceris, Republic and Jedi forces succeeded in liberating the Kanz Sector especially Lorrd which fell after fierce fighting."}, {"tag": "p", "text": "With their defeat, the Argazdan Redoubt ceased to exist as an independent government and was re-integrated into the Republic. By the Imperial Period, most Argazdans regarded the actions of the Myrialites and the Redoubt with shame. One notable exception was Doctor Raygar who donned the robes of an Argazdan slave master during a performance at the Performance Square on Lorrd much to the outrage of Lorrdians and Argazdans alike."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}