{"url": "M%27lindi", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "M'lindi"}, {"tag": "p", "text": "M'lindi was a human male who lived on Milvayne. He overwatched propaganda shown by the Galactic Empire, much to the disliking of his wife. When she told him to change the channel, he found a frequency showing a live feed from the eyes of the assassin droid 0-0-0. They continued watching as Triple-Zero and his accomplice Chelli Aphra evaded the Milvayne Authority and the monster hunters Winloss and Nokk."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "M'lindi lived on the Milvayne during the Galactic Civil War. One day, he overwatched a propaganda video produced by the Galactic Empire. Annoyed by this, his wife told him to change the channel. To their surprise, they discovered a live feed being broadcasted from the eyes of the fugitive assassin droid 0-0-0, who was on the run in Milvayne City's underworld with the rogue archaeologist Chelli Aphra. The pair were eventually captured by the Milvayne Authority and put on trial at a ledge. However, they were able to turn them against Tam Posla, who had helped them capture the fugitives. As the pair escaped the following the skirmish that ensued, M'lindi's wife expressed her pleasure in seeing the Milvayne Authority fighting Posla, who had once been one of their own."}, {"tag": "p", "text": "As M'lindi and his wife continued watching, Aphra and Triple-Zero reached a fuelstop which housed a repair rig, intending to repair Triple-Zero's damaged legs. As Triple-Zero still lacked trust in her, Aphra tried to change his mind and expressed Milvayne's issue with trust and claimed that when surrounded by treachery, having faith in one another was the strongest force there was. M'lindi watched this moment in awe, and Aphra deactivated the droid in order to repair him. M'lindi and his wife waited ten minutes and were glad to see that Triple-Zero was repaired. As they began to leave, though, the Trandoshan monster hunter Nokk attacked. Triple-Zero saved Aphra, and they latched onto a moving speeder."}, {"tag": "p", "text": "In the following chase, Nokk's husband Winloss was able to trap them, sparking public aggression from the viewers of Triple-Zero's live feed. The Empire's Coalition for Progress decided to quash this by firing onto the city, targeting Aphra and Triple-Zero. This caused the speeder holding them captive to fly out of control."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "M'lindi was a human male with light skin and black hair that only covered the sides and back of his head, as well as his mustache."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "M'lindi first appeared in the canon comic Doctor Aphra 28, written by Simon Spurrier, illustrated by Emilio Laiso, and published on January 30, 2019."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}