{"url": "M-3PO_(Emtrey)", "categories": ["Category:Legends articles", "Category:Articles to be expanded", "Category:3PO-series protocol droids", "Category:Antilles's Rogues", "Category:Masculine programming", "Category:Military protocol droids", "Category:Rogue Squadron personnel"], "nodes": [{"tag": "h1", "text": "M-3PO  (Emtrey)"}, {"tag": "p", "text": "M-3PO, also known as Emtreypio or Emtrey, was a masculine M-3PO military protocol droid that served as the quartermaster of Rogue Squadron. Cobbled together from parts of other military protocol droids, he served the Rogues from their reformation in 6 ABY through to the Yuuzhan Vong War. Because of his improvised nature, he had a protocol droid's body and the head of a spaceport control droid."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Emtrey was built on Hoth by a Rebel lieutenant named Losca for the purpose of procuring goods. He had special programming to assist with that purpose: a 'scrounger mode' activated when hounded about acquiring parts. He also had a strange program that disabled his normal personality and functions when told to shut up more than three times. This program essentially turned him into a 'dumb' terminal with access to Emtrey's memory banks. Both of these features were used by Rogue Squadron members during the time he served with them. After the New Republic took Coruscant for the first time, this terminal mode was disabled."}, {"tag": "p", "text": "It was later revealed that the terminal mode was actually built into Emtrey by New Republic Intelligence in order to discover if then Captain Tycho Celchu had been successfully brain washed into an Imperial Agent. Emtrey was given this and other programming that made him into a very valuable tool for a spy, which would have exposed Celchu if he was a spy if Celchu used him in that manner. Emtrey was also able to provide proof that Celchu had not met with Imperial agents as Corran Horn accused him of doing. Horn's reappearance, followed by the betrayal of Imperial mole Erisi Dlarit made Celchu's innocence obvious. The special programming was removed during the trial, and Corran Horn realized that he had been assigned to monitor Celchu when the remote mode would not work any longer"}, {"tag": "p", "text": "After Celchu's trial, and the departure of Ysanne Isard for Thyferra, Rogue Squadron members resigned to topple the puppet regime she had set up on that planet. Emtrey, along with all the squadron's equipment and fighters was surplussed out by someone in the military as a way of giving back door support to the former members of Rogue Squadron. Emtrey was acquired by the former Rogues, and he served in a variety of capacities with them. He was later named liaison on board the Valiant, a droid ship that survived the destruction of Alderaan."}, {"tag": "p", "text": "Once Isard was defeated, Emtrey returned to service with the New Republic."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}