{"url": "M-OC%27s_lightsabers", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Personal lightsabers"], "nodes": [{"tag": "h1", "text": "M-OC's lightsabers"}, {"tag": "p", "text": "M-OC's lightsabers were lightsabers used by the hunter droid M-OC."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "M-OC's lightsabers first appeared in the LEGO Star Wars: The Freemaker Adventures Season Two episode \"The Tower of Alistan Nor\", which premiered on Disney XD on July 31, 2017.  They were later mentioned in Marc Sumerak's 2018 reference book Star Wars: Droidography."}, {"tag": "h3", "text": "Description"}, {"tag": "p", "text": "The Imperial hunter droid M-OC's lightsabers were originally a single double-bladed spinning lightsaber. However, M-OC separated the lightsaber, preferring to wield them as two separate blades."}, {"tag": "h3", "text": "History"}, {"tag": "p", "text": "Following M-OC's first encounter with Rowan Freemaker on the planet Tibalt, the Emperor Palpatine outfitted the hunter droid with a double-blade spinning lightsaber. However, the droid preferred to wield them as two blades. He used the lightsabers while pursuing Rowan at the Tower of Alistan Nor but the boy fought back with his lightsaber and eluded him again."}, {"tag": "p", "text": "Later, M-OC used the lightsabers while pursuing Rowan and his family on the acidic world of Taul. M-OC later dueled Rowan on the planet Qalydon."}, {"tag": "p", "text": "M-OC later used these lightsabers when trapping Rowan on Qalydon. Though M-OC managed to capture Rowan, the droid was disintegrated by his rival Darth Vader, who took Rowan prisoner. M-OC later managed to rebuild himself."}, {"tag": "p", "text": "After stealing the Arrowhead from the Freemakers, M-OC was tasked with hunting down the Freemakers. After the Freemakers lured him into a trap on the stormy world of Shantipole, M-OC engaged in a lightsaber duel with Rowan. Though M-OC was stronger than Rowan, he abandoned the duel after learning about a flaw in the second Death Star."}, {"tag": "p", "text": "While M-OC was attempting to defend the second Death Star's reactor core, he used his lightsabers in a duel with Rowan during the Battle of Endor. Rowan managed to defeat M-OC and the Alliance to Restore the Republic managed to destroy the superweapon's reactor core, scoring a major victory for the Alliance. M-OC's lightsabers were also presumably destroyed during the Battle of Endor."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-Canonical Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}