{"url": "M-OC", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Assassin droids", "Category:Droids of the Galactic Empire", "Category:Hunter droids", "Category:Masculine programming"], "nodes": [{"tag": "h1", "text": "M-OC"}, {"tag": "p", "text": "M-OC was an Imperial hunter droid created by Emperor Palpatine and was tasked by the Emperor with locating a legendary weapon. At some point, M-OC encountered the Freemakers and chased them through several planets. Eventually M-OC failed in his mission and was defeated along with the Empire."}, {"tag": "p", "text": "M-OC was an expert pilot and wielded a pair of lightsabers with him. He also had six-retractable arms, a buzz saw, blasters, flamethrowers, missile launchers, a laser net, grappling hooks, a sonic cannon and rocket boosters."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "M-OC was first announced at Celebration Orlando in April 2017 as the new antagonist in the second season of the animated Disney XD television series LEGO Star Wars: The Freemaker Adventures. He was designed by Doug Chiang, who also designed M-OC's ship Tracker I. M-OC was voiced by James Urbaniak. The show's co-creator Bob Roth described M-OC's ship as an extension of M-OC. M-OC's name is derived from the LEGO fandom term \"MOC\", short for \"My Own Creation\" which is given to fan-made Lego models. M-OC was later canonized by the book Star Wars: Droidography."}, {"tag": "h3", "text": "Non-canon info"}, {"tag": "h4", "text": "Origins"}, {"tag": "p", "text": "Following the skirmish on Coruscant, Emperor Sheev Palpatine secretly commissioned a hunter droid called M-OC. The Emperor was frustrated with the incompetence of his minions and desired revenge against Rowan Freemaker for stealing the Kyber Saber from him. The Emperor presented M-OC to his second-in-command Darth Vader and three other Imperial officers."}, {"tag": "h4", "text": "Mission to Tibalt"}, {"tag": "p", "text": "The Emperor and Vader later watched M-OC participate in a simulated exercise against several pop-up targets. M-OC used his gadgets included a flamethrower, blades, and blasters to destroy all the targets. Impressed with M-OC's performance, the Emperor asked Lord Vader about his thoughts. Vader opined that the Emperor should not take pride in this technological terror since he was not Force-sensitive. M-OC responded that he lacked offspring that wanted to kill the Emperor. M-OC accepted the Emperor's orders to hunt down Rowan Freemaker. He used the Imperial database to deduce that the Freemakers would be scavenging on the planet Tibalt, which had seen a recent battle between the Galactic Empire and the Rebel Alliance."}, {"tag": "p", "text": "Instead of using the door to leave, M-OC blasted his way out the roof and headed towards his starship Tracker I. M-OC landed the Tracker I near the crash site and used his sleek, shiny starship to lure Rowan. When Rowan approached the ship, M-OC used a grappling arm to grab the boy and lock him in the ship's brig. After announcing that his target had been acquired, M-OC took off. He used a hologram to communicate with Rowan and told the boy that the Emperor had sent him to capture Rowan. When Rowan objected, M-OC countered that the boy's feelings were irrelevant."}, {"tag": "p", "text": "The Freemakers and Quarrie gave chase in the CT-900 freighter StarScavenger and managed to fire at one of the Tracker I's wings. Rowan used his lightsaber to break out of the brig and Force jumped into the StarScavenger's scoop. Unwilling to give up the hunt, M-OC pursued the StarScavenger and shot down the freighter. M-OC then demanded that the boy surrender. Rowan refused and the two duelled. M-OC managed to trap Rowan under a net but the boy used his lightsaber to break free. M-OC maneuvered Rowan towards the Tracker I with his various gadgets."}, {"tag": "p", "text": "Kordi and Quarrie fired a wrecked starship into M-OC and the Tracker I, damaging both. M-OC survived disintegration but was unable to stop the Freemakers and Quarrie from fleeing offworld. M-OC reported his failed mission to the Emperor but put the blame on the Imperial database for omitting the fact that Rowan had a lightsaber. He also informed the Emperor and Lord Vader that the Freemakers had joined the Rebellion because they were traveling with the shipbuilder Quarrie. The Emperor ordered M-OC to find Rowan, the rebels, and the Kyber Saber; mistakenly believing that the Freemakers still held the weapon."}, {"tag": "h4", "text": "Duel at Alistan Nor"}, {"tag": "p", "text": "Following the events on Tibalt, the Emperor outfitted M-OC with a double-bladed spinning lightsaber. Despite the gift, M-OC was still bitter over his failure on Tibalt. While the Emperor tried to humor M-OC that he was his favorite \"hunter droid\", M-OC responded that he was the only hunter droid listed in the Imperial database, making favorites irrelevant. Darth Vader was jealous of M-OC's status since he feared that the droid would supplant his relationship with the Emperor. Continuing his hunt for Rowan, M-OC informed the Emperor that he was search the Imperial database for salvage sites."}, {"tag": "p", "text": "Later, the Imperial probe droid XJ9-GM02 reported that the Freemakers' ship StarScavenger had entered the planet Alistan Nor. Rowan, Roger, and Quarrie had traveled there on a mission to seek inspiration to build the Arrowhead, a ship that Rowan believed could turn the tide of the Galactic Civil War. M-OC informed the Emperor of this news before heading to Alistan Nor. Flying the Tracker I, M-OC discovered that Rowan, Roger, and Quarrie had reached the top of the ancient Tower of Alistan Nor, which overlooked the ancient city of the Force Builders. M-OC fired on the rebels, causing them to fall from the tower. However, Rowan used the Force to cling to a vine and to stop his comrades from falling to their deaths."}, {"tag": "p", "text": "Armed with his new double-bladed spinning lightsaber, M-OC fought Rowan. M-OC also fired blaster bolts at Rowan in an effort to overwhelm the young Jedi trainee. After leaping from vine to vine, Rowan tricked M-OC into firing his blasters at a balcony, which crashed on the droid and threw him to the ground. M-OC recovered only to be run over by a pack of gundark predators. Rowan and his comrades took the opportunity to escape offworld. M-OC managed to escape the gundarks and rebuild himself. He reported his encounter to the Emperor and Lord Vader, who warned him to perform better next time."}, {"tag": "p", "text": "The Emperor demanded an update on M-OC's hunt to capture Rowan Freemaker and recover the Kyber Saber. M-OC informed the Emperor that he was monitoring multiple channels of communications while preparing in-depth profiles of his targets. While praising M-OC, the Emperor privately mocked M-OC for his lack of sarcasm. When the bounty hunter Awan Zek contacted an Imperial Star Destroyer with information that Rowan was heading to the planet Taul, M-OC picked up Awan's message and traveled to Taul in the Tracker I."}, {"tag": "p", "text": "M-OC arrived on Taul to find that Rowan, Kordi, and Zander had been left stranded by the Weequay pirate Hondo Ohnaka during their mission to obtain a proton suspension housing to build the Arrowhead. M-OC blasted the Freemakers' Mini Scavenger. M-OC ordered Rowan to surrender and mused about leaving the others behind. However, the hunter droid was crushed by a large falling rock. While M-OC freed himself with his double-bladed spinning lightsaber, the Freemakers took the opportunity to flee. M-OC gave chase and taunted Rowan that he had no ship and should surrender. Rowan fought back with his lightsaber but was driven back by M-OC's flamethrowers."}, {"tag": "p", "text": "The Freemakers and M-OC were soon caught in an acid storm. While the Freemakers fled for cover, M-OC was unaffected. Despite being crushed by a rock a second time, he managed to regenerate and pursue the Freemakers. The Freemakers managed to use a rocky bridge to cross a pool of acid and Rowan used his lightsaber to cut the bridge. M-OC was able to cross the acidic pool with his rocket boosters. Rowan managed to knock M-OC into the pool with his lightsaber. However, M-OC activated his spider legs and managed to wade through the lake. Rowan then hurled a metal pole into the lake. While M-OC thought that he had survived Rowan's attack, a bolt of lightning strung the pole, electrocuting the hunter droid."}, {"tag": "h4", "text": "Recovery aboard the Executor"}, {"tag": "p", "text": "Eventually, he was found by Darth Vader, and repaired aboard the Super Star Destroyer Executor. After his repairs were done, M-OC stayed aboard the Executor to get a lead on the whereabouts of Rowan Freemaker. He then overheard Graballa the Hutt informing Vader that he had captured Rowan at the former Freemaker garage in the Wheel space station. When M-OC questioned Vader about the location of Rowan, Vader tricked him into believing that the boy was on the other side of the galaxy, on a remote planet, beyond the Outer Rim Territories."}, {"tag": "h4", "text": "Duel on Qalydon"}, {"tag": "p", "text": "While traveling aboard the Tracker I, M-OC found that Roger's casserole recipe had been uploaded onto the Imperial database near the Qalydon system, which made him curious. Once he arrived aboard the Imperial Star Destroyer, the ship's commander insisted that a rebel could not have accessed the Imperial database. However, M-OC found traces of Freemaker activity and decided to investigate."}, {"tag": "p", "text": "After arriving on the planet Qalydon, he engaged Rowan in a lightsaber duel. Realizing Rowan's friendship with the Lurmen girl Maynar, he took her hostage and threatened to kill her. However, Zander knocked him down with a tug, allowing Maynar to escape. M-OC quickly rebuilt himself and regained the upper hand. Though Rowan was outmatched by M-OC, he used the Force to fuse pieces of machinery and wreckage into M-OC's body, entombing his body with upgrades. The Freemakers then recovered the Lurmen villagers' kyber crystals from the Imperial officers Durpin and Plumestriker. Eventually, M-OC managed to break free."}, {"tag": "h4", "text": "A botched pursuit"}, {"tag": "p", "text": "Later, M-OC caught up with the Freemakers' starship StarScavenger in space. Before M-OC could pursue them into hyperspace, the Emperor summoned him back to Coruscant for a \"dressing down\" on his lack of progress in capturing Rowan and the Kyber Saber."}, {"tag": "p", "text": "Back at the Imperial Palace, the Emperor used a video to explain the importance of the Kyber Crystal to M-OC. When the Emperor demanded why he had not captured Rowan nor the Kyber Saber, M-OC informed him that Lord Vader had blocked his application for an XX-23 S-thread tracker. The Emperor approved M-OC's request and allowed him to resume his hunt for Rowan and the Kyber Saber. The Emperor attempted to reprimand Vader but the Sith Lord took leave after reports that the rebel fleet was near Rodia."}, {"tag": "h4", "text": "The stolen victory"}, {"tag": "p", "text": "After Rowan saved the rebel fleet from being destroyed by the Imperial Navy, a furious Emperor Palpatine summoned M-OC and Darth Vader. The Emperor was furious with M-OC for not bringing him Rowan and the Kyber Saber. Though Darth Vader tried to curry the Emperor's favor by casting blame on M-OC, the Emperor was also displeased with his second in command due to delays in the second Death Star's construction."}, {"tag": "p", "text": "Demanding results, the Emperor ordered M-OC and Lord Vader to work together. However, an argument broke out when M-OC mocked Vader's belief in the Force which resulted in the two drawing lightsabers. When the Emperor walked by, Vader claimed that he was teaching M-OC some combat movements. Despite their outward show of unity, both resolved to find Rowan through their own means."}, {"tag": "p", "text": "Playing on Rowan's friendship with the Lurmen girl Maynar, M-OC lured Rowan into a trap on Qalydon using a holoprojector. M-OC trapped Rowan inside a base, besting the young Force Builder. Rowan managed to hide in the base and attempted to ambush M-OC but the droid proved unbeatable, having learnt from his previous encounters. However, M-OC was ambushed and disintegrated by Vader, who used the Force to tear the droid to shreds before beheading him. He then captured Rowan and took him back to the Imperial Palace on Coruscant."}, {"tag": "h4", "text": "Capturing the Arrowhead"}, {"tag": "p", "text": "Returning to Coruscant, Lord Vader claimed that M-OC had \"fallen to pieces\" during the mission to capture Rowan. However, M-OC was able to rebuild himself and traveled back to Coruscant on his starship Tracker I. Upon arriving, he discovered that the Freemakers had attacked the orbiting Imperial fleet with their starship Arrowhead, destroying three Imperial Star Destroyers and several TIE fighters."}, {"tag": "p", "text": "Arriving at the Imperial Palace, M-OC's Tracker I entered into a dogfight with Roger, who was flying with the Arrowhead. Seeking to settle scores with M-OC, Roger pursued the Tracker I. Unable to defeat the Arrowhead, M-OC allowed Roger to destroy his ship. However, M-OC survived the collision and managed to cling to the hull of the Arrowhead."}, {"tag": "p", "text": "When Roger arrived near the Imperial Palace's top spire to rendezvous with Kordi, Zander, and Rowan, M-OC jumped into the cockpit after Roger opened the M-OC. He then tore the droid apart and threw him down the battlements. M-OC then turned the Tracker I's weapons onto the Freemakers, causing them to fall. However, Rowan used the Force to cushion their fall. The Freemakers managed to escape offworld on a TIE \"Ugly\"."}, {"tag": "p", "text": "M-OC then contacted the Emperor via holoprojector and presented him the Tracker I as consolation for his past failures. The Emperor then sent M-OC to eliminate the Freemakers once and for all. The Freemakers flew off with M-OC on their trail. M-OC shot off both wings, but the Freemakers were rescued by Quarrie in the Starscavenger."}, {"tag": "h4", "text": "Showdown on Shantipole"}, {"tag": "p", "text": "Flying the Arrowhead, M-OC soon caught up with the Freemakers' TIE \"Ugly.\" The Freemakers including Roger tried to surrender but M-OC rejected their pleas, intending to destroy them once and for all. He shot their starfighter's solar collectors but the Freemakers managed to escape with the help of Quarrie, who picked them up in the StarScavenger. Though Quarrie and the Freemaker manage flee into hyperspace, M-OC managed to track them down with a XX-23 S-thread tracker."}, {"tag": "p", "text": "M-OC caught up with the StarScavenger in an asteroid field but Quarrie managed to convince the Freemakers to flee to the planet Shantipole, where he had a base. M-OC pursued them there but was unable to pursue them through the volatile upper atmosphere, which had electrical storms. M-OC instead circled Shantipole, waiting for the StarScavenger to turn up so he could complete his mission to destroy the Freemakers."}, {"tag": "p", "text": "At the urging of Rowan, the Freemakers decided to exploit M-OC's obsession with Rowan by luring him into a trap. They built a tractor beam projector onto the hull of the StarScavenger. After baiting M-OC, they used the tractor beam to drag the Arrowhead into Shantipole's storms. Both ships were knocked out by the lightning storms. Despite losing the tractor beam, the Freemakers had a back up plan which involved having Roger deliver Rowan to the Arrowhead using the Mini Scavenger."}, {"tag": "p", "text": "Rowan landed on the Arrowhead and used his Force powers to release the giant kyber crystal from the energy matrix activator. M-OC engaged Rowan in a lightsaber duel but failed to prevent Rowan from escaping with the kyber crystal. Zander then rammed the StarScavenger into the Arrowhead in an attempt to destroy M-OC. Though both ships were destroyed, M-OC survived and confronted the Freemakers and Quarrie on the surface."}, {"tag": "h4", "text": "A new purpose"}, {"tag": "p", "text": "Before M-OC could finish off Rowan, Rowan managed to convince M-OC that his quest to hunt him down was pointless. M-OC agreed and came to believe that there was a flaw in his creators' programming. Though M-OC no longer regarded Rowan as a threat, he decided to safeguard the Empire's new second Death Star. M-OC built a small mobile ship using parts from the Arrowhead and the StarScavenger including the giant kyber crystal."}, {"tag": "p", "text": "Traveling to Endor, M-OC flew to the Emperor's Tower and informed him that he had secured the Arrowhead kyber crystal and planned to use it to defend the second Death Star's reactor core from the rebels. However, the Emperor was preoccupied with the imminent arrival of Luke Skywalker and left M-OC to his own devices. Still loyal to his creator, M-OC went to secure the second Death Star's reactor core."}, {"tag": "h3", "text": "Last stand above Endor"}, {"tag": "p", "text": "M-OC traveled down in his starship to defend the second Death Star's reactor core. He used the Arrowhead's kyber crystal to generate a deflector shield around the structure. Rowan soon arrived with the Kyber Saber and engaged him in a lightsaber duel. Despite the Kyber Saber's power, Rowan was unable to breach M-OC's deflector shield."}, {"tag": "p", "text": "Unable to match M-OC's skill and firepower, Rowan used the Kyber Saber to summon the giant kyber crystal to him. M-OC retaliated by launching a full-scale attack with his flamethrowers, missiles and other weapons. M-OC managed to distract Rowan by using hologram recordings of his siblings Kordi and Zander, allowing him to gain the advantage over Rowan."}, {"tag": "p", "text": "Before M-OC could finish off the Force Builder, he was distracted by the sight of the Emperor plummeting to his death."}, {"tag": "p", "text": "Rowan took advantage of that momentary lapse to plunge the Kyber Saber into M-OC's kyber crystal, causing an explosion that destroyed the hunter droid. Rowan and his siblings joined the rebels on Endor to celebrate the end of the Galactic Empire."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "M-OC was an Imperial hunter droid that was equipped with various gadgets include blades, grappling arms, flamethrowers, blasters, and rocket boosters. M-OC \"lived to sever\" his master Emperor Palpatine. M-OC was solely concerned with serving his master and did not care for sentiments. He was a ruthless warrior and a skilled pilot who was programmed to fly the starship Tracker I. M-OC was able to access the Imperial database and used it to generate clues on the location of Rowan Freemaker. M-OC could also survive considerable damage."}, {"tag": "p", "text": "M-OC also knew how to fight with a double-bladed spinning lightsaber but preferred to separate the two blades, fighting using style of Jar'Kai. His combat strategy was to overwhelm his opponents with his gadgetry and taunt them. Despite his superior intellect and armaments, Rowan and his companions managed to outwit him on several occasions. M-OC had a calm and collected demeanor and used the Imperial database to gather intelligence on the movements of his opponents. He also took failure seriously and expressed frustration at inaccurate information."}, {"tag": "p", "text": "Despite his intelligence and fighting prowess, M-OC lacked sarcasm. M-OC was able to survive being crushed by giant rocks on two occasions and regenerate his body. He could also withstand acid and was equipped with a set of powerful spidery legs. Despite being able to take a lot of punishment, M-OC's circuits were vulnerable to electrocution."}, {"tag": "p", "text": "M-OC had a rivalry with Darth Vader and the two competed for the Emperor's favor. The Emperor tried to sabotage M-OC's hunt for Rowan on several occasions. However, M-OC was also crafty and once managed to deflect blame by pointing out that Lord Vader had blocked his request for an XX-23 S-thread tracker. M-OC and Lord Vader's rivalry escalated when the Emperor ordered them to work together to find Rowan after the boy succeeded in building the Arrowhead and devastated Imperial forces."}, {"tag": "p", "text": "M-OC was capable of cloaking himself and impersonating other individuals like Maynar. He was also capable of learning from past encounters with Rowan and became a more skilled duelist in the Force. M-OC did not believe in the Force, regarding it as a superstition, which only fueled the rivalry with Lord Vader. Though M-OC was disintegrated by Lord Vader, he was still able to rebuild himself."}, {"tag": "p", "text": "M-OC's drive to succeed and to make up for his failings led him to capture the Arrowhead. M-OC took advantage of Roger's over-confidence to board the Arrowhead and steal the ship from the Freemakers. M-OC used the capture of the Arrowhead to curry favor with the Emperor who sent him to hunt down the Freemakers, an opportunity which M-OC took to settle scores with his foes."}, {"tag": "p", "text": "Roger observed that M-OC was obsessed with Rowan and had few interests. Based on Roger's observations, Rowan devised a plan to lure M-OC into a trap above Shantipole. Though M-OC survived the crash, Rowan managed to convince him to cease hunting him and his family by suggesting that his programming was flawed. However, this convinced M-OC that he had to safeguard the Empire's second Death Star."}, {"tag": "p", "text": "M-OC's devotion to the Empire led him to defend the second Death Star's reactor core. The droid remained loyal even though the Emperor did not appreciate his efforts or recognize the gravity of the situation. M-OC tried to use Rowan's ties to his siblings to distract him during a duel at the second Death Star. However, he was distracted by the Emperor's death and was defeated by Rowan."}, {"tag": "h3", "text": "Equipment"}, {"tag": "p", "text": "Besides his various gadgets, M-OC flew the Tracker I, a sleek and powerful starship. In addition, M-OC was capable of cloaking himself and impersonating other beings using a holoprojector."}, {"tag": "p", "text": "Following a skirmish on Shantipole, M-OC built a small starship using parts of the Arrowhead including its proton suspension housing and a giant kyber crystal, which served as its energy source. This ship was equipped with a deflector shield generator and a hyperdrive."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h3", "text": "Non-canon sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}