{"url": "M-class_Imperial_Attack_Transport", "categories": ["Category:Legends articles", "Category:Galactic Empire starship classes", "Category:M-class Imperial Attack Transports", "Category:Troop transport classes"], "nodes": [{"tag": "h1", "text": "M-class Imperial Attack Transport"}, {"tag": "p", "text": "The M-class Imperial Attack Transport was a type of starship which saw service in the Imperial Military during the Galactic Civil War. The Regina Cayli was a known M-class Imperial Attack Transport."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The M-Class Imperial Attack Transport was a starship class employed by the Galactic Empire during the Galactic Civil War. It consisted of at least two decks; the Transport Deck was located at the bottom of the vessel, and contained a cargo bay with enough room to store two landspeeders. A security console was situated in the cargo bay, with access to the ship's layout and information. Incorrectly accessing the console would result in an internal alarm sounding throughout the ship. The Command Deck was located above the Transport Deck, and was the location of the ship's infirmary, in room B12. The infirmary was equipped with at least one pallet, a bacta tank, and was staffed by a medical droid. A security code was required to access the room. Travel between the decks was via a grav tube, where local gravity could be manipulated by microgravity controls to float individuals between decks. The M-Class Imperial Attack Transport also featured torpedo ports, and the ship's escape pods were located on the top of the vessel."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "The M-class Imperial Attack Transport was used as troop transport by the Imperial Navy. Its typical complement included at least two squads of stormtroopers."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "M-Class Imperial Attack Transports were active during the Galactic Civil War. The Regina Cayli was present at New Bakstre when Imperial Customs cruisers forced down the Dorion Discus, a freighter that was making an unscheduled delivery to the planet. The Regina Cayli landed near the crash site and investigated the scene, taking one of the freighter's crew, the injured Hawk Carrow, prisoner. Carrow's partner, the smuggler Roark Garnet, subsequently infiltrated the Regina Cayli and rescued his friend."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The M-Class Imperial Attack Transport was featured in the roleplaying adventure \"Regina Cayli\", first published in Star Wars: The Roleplaying Game by West End Games in 1987. It was subsequently reprinted in the first issue of the Star Wars Adventure Journal in 1994."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}