{"url": "M12-L_Kimogila_heavy_starfighter", "categories": ["Category:Canon articles", "Category:Hutt Cartel starfighter classes", "Category:MandalMotors products", "Category:Mandalorian starfighter classes"], "nodes": [{"tag": "h1", "text": "M12-L Kimogila heavy starfighter"}, {"tag": "p", "text": "The M12-L Kimogila heavy starfighter, often simply referred to as a Kimogila, was a heavy starfighter manufactured by MandalMotors by commission from the Hutt kajidics. The Kimogila was heavily armed and armored, making it a versatile and expensive long-range fighter. Though designed for the Hutts, the Kimogila became a favored ship for mercenaries, bounty hunters and pirates."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The M12-L Kimogila heavy starfighter was designed and produced by MandalMotors under a contract from the Hutts, and made to their specific requirements. It was created to serve as a long-range, multipurpose ship that could act as both a patrol ship and a space superiority fighter. It was larger than any other model of heavy starfighter and packed a punch being armed with three heavy laser cannons and ordnance launcher that could fire either proton torpedoes or concussion missiles. The weapons combined with its heavily armored hull and strong shields  made the Kimogila a match for nearly any other starfighter in the galaxy. It could also stand up to a beating from larger vessels while delivering a large ordnance load against any foe."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "A group of mercenary pilots called the J'kari Thunderers flew a squadron of Kimogilas during the Galactic Civil War. An Imperial Moff hired them to help destroy the Rebel Alliance threat in sector. In reality, the Moff was holding several of the pilots' families in hostage under the guise of being in \"protective custody.\""}, {"tag": "p", "text": "Word reached the Alliance to Restore the Republic that the mercenaries were being coerced and a team was sent in to rescue their families. The successful liberation of their families convinced the Thunderers to join the Rebel Alliance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The M12-L Kimogila heavy fighter first appeared in the now-Legends Star Wars Galaxies: Jump to Lightspeed expansion of the long-running MMORPG Star Wars Galaxies."}, {"tag": "p", "text": "The Kimogila made its canon debut in the 2020 Starships and Speeders sourcebook, which provided details and specifications on the ship. It also included an adventure seed for use with the Star Wars Roleplaying series. This article assumes the scenario plays out as described."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}