{"url": "M38-series_explorer_droid", "categories": ["Category:Legends articles", "Category:Exploration droid models", "Category:LesTech products"], "nodes": [{"tag": "h1", "text": "M38-series explorer droid"}, {"tag": "p", "text": "Developed by the almost unknown LesTech company, the M38-series explorer droid was created to be an all-purpose assistant to planetary scouting expeditions."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The droid was equipped with a plethora of scanning systems, ranging from visual to seismic, and was also fitted with a camera in case they were destroyed. Heavily armored, the droid could withstand hazardous environments which many organics could not. The M38 also came equipped with a five-kilogram specimen hopper to assist in collecting local plant and animal life."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "While LesTech believed they had created the ultimate scouting aid, planetary scouts thought quite the opposite. Despite the advertising campaign describing the M38 as the ultimate scouting tool, most scouts felt threatened by the droid. A number of scouts refused to work with M38s due to fear of being replaced by the droid."}, {"tag": "p", "text": "The series also suffered due to its low user-friendliness. The M38 was a very sensitive droid, and occasionally would freeze due to information overload. The droid also suffered many problems with its treadwheel locomotion drive system. The drive system of the M38 was very sensitive to changes in gravity and terrain, and would require service before and after each mission. If the unit did not receive proper maintenance, the treads would lock up or become unresponsive. Many an M38 was lost over a cliff due to a lack of proper maintenance."}, {"tag": "p", "text": "Their sensors, coupled with the units' toughened durasteel armor plating, gave them an advantage over Arakyd probe droids, but Arakyd's models had the drop on M38s—the units were slow and short range, and lacked weapons of any kind. Galactic scouts often tried arming the droids with defensive stun blasters, but the M38s did not respond well to non-spec modifications."}, {"tag": "p", "text": "All these problems coupled with a price tag of 13,000 credits diminished the line in the average scout's eyes."}, {"tag": "p", "text": "The Alliance to Restore the Republic used several of these droids to survey planet surfaces and compile lists of viable strategic firing points, which the M38s were surprisingly good at."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The picture used in The Rebel Alliance Sourcebook to represent the M38 explorer droid was used in the Death Star Technical Companion to illustrate the MN-2E general maintenance droid."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}