{"url": "MC140_Scythe-class_main_battle_cruiser", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Battlecruiser classes", "Category:Galactic Alliance starship classes", "Category:MC140 Scythe-class main battle cruisers", "Category:Mon Calamari cruiser variants"], "nodes": [{"tag": "h1", "text": "MC140 Scythe-class main battle cruiser"}, {"tag": "p", "text": "The MC140 Scythe-class main battle cruiser was the primary warship of the Galactic Alliance Defense Fleet approximately one hundred years after the Yuuzhan Vong War. Designed and produced by the famed Mon Calamari Shipyards, the Scythe was a radical departure from normal Mon Calamari starship design. In addition to the unique front blade, the Scythe-class was a mass-produced, standardized design, unlike prior generations of the Mon Calamari Star Cruiser."}, {"tag": "p", "text": "These battle cruisers saw extensive use during the Sith–Imperial War. Following the surrender of the Galactic Alliance government at the end of the Sith–Imperial War, many Scythe battle cruisers saw continued service in the Galactic Alliance Remnant during their operations against the Sith."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Scythe-class battle cruiser's name was in part due to the massive vertical blade centered on the bow of the warship. The Scythe-class was heavily armed with advanced weaponry, including three heavy turbolaser batteries, six standard turbolaser batteries, two heavy ion cannon batteries, and forty proton torpedo tubes grouped in four proton torpedo batteries with a total 160-warhead capacity. The majority of the Scythe's weapon batteries were mounted on the forward blade. This configuration was referred to as a \"cross of fire\" by Galactic Alliance officials and Mon Calamari engineers, and allowed the Scythe-class battle cruiser to focus its fire onto a singular point. While the \"cross of fire\" weapons arrangement proved deadly to almost any warship that fell into its crosshairs, this provided some drawbacks. The heavy concentration of weapons batteries on the forward hull meant that there was limited weaponry on the ship's broadsides and stern. Furthermore, massive power conduits from the ship's main reactor and numerous auxiliary reactors took up additional space."}, {"tag": "p", "text": "The Scythe's main hull followed standard Mon Calamari design patterns. The forward blade gave the warship a similar appearance to the then-ancient Republic Hammerhead-class cruiser. In addition to containing much of the ship's weapons, the blade was also the location of several hangar bays. These hangars could carry 36 CF9 Crossfire starfighters and four shuttles. A twenty-one meter-long YT-2400 light freighter could easily fly through the aperture of one of its hangars."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "As the main capital ship of the Galactic Alliance, Scythe-class was capable of engaging the Fel Empire's Pellaeon-class Star Destroyer in direct combat, despite the fact that the battle cruiser was only a third of the size of the larger Star Destroyer. The Scythe-class utilized its powerful engines to maneuver into a position where it could bring the \"cross of fire\" weapons batteries to bear on an enemy vessel. This massive barrage of turbolaser, ion cannon, and torpedo fire was capable of destroying larger vessels like the Pellaeon-class Star Destroyer. The main drawback of the cross of fire was that the Scythe's broadsides and stern were lightly armed, which forced a Scythe's crew to constantly keep the bow facing an enemy warship - though with its powerful engines, this was rarely a problem."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The Scythe-class battle cruiser was the culmination of a new design and shipbuilding philosophy undertaken by the Galactic Alliance during the years following the devastation of the Yuuzhan Vong invasion. For a time, large multi-kilometer dreadnaughts like the Star Defender saw increased use in Galactic Alliance fleets. However, economic realities changed the Defense Force shipbuilding mindset towards smaller, yet heavily armed and armored vessels. A result of the changing military doctrine, the Scythe-class first debuted in 92 ABY."}, {"tag": "p", "text": "Like the majority of Galactic Alliance warships from prior generations, the Scythe-class was designed and constructed at the Mon Calamari Shipyards. The Scythe was part of a larger shipbuilding program that included various other classes of combat starships, including the ShaShore-class frigate and the Sabertooth-class assault/rescue vessel. The success of the Scythe and the cross of fire design prompted Mon Calamarian engineers to also develop the Tri-Scythe-class frigate, a smaller sister-design with a three blade-shaped superstructure."}, {"tag": "p", "text": "As the Scythe battle cruiser was the Alliance's main warship, it saw extensive action during the Sith–Imperial War, starting in 127 ABY. Many of the battle cruisers were part of the combined Alliance fleet that fought at the Battle of Caamas. Caamas proved to be a major Imperial victory and the death knell for the Galactic Alliance government, as Grand Admiral Morlish Veed managed to force Admiral Piers Petan—the overall Alliance fleet commander at Caamas—to surrender. However, the Galactic Alliance Core Fleet, under Admiral Gar Stazi, refused to surrender. The majority of the Core Fleet, including many Scythe battle cruisers, escaped while engaged in a fighting withdrawal from Caamas."}, {"tag": "p", "text": "After the surrender of the Galactic Alliance at the end of the Sith-Imperial War, the cruisers saw continued use by the remnants of the Defense Force, via the Galactic Alliance Remnant. Scythe battle cruisers were part of the Alliance task force that engaged the Empire's Outer Rim Third Fleet during the Battle of Dac. One such vessel, Stazi's flagship Indomitable, was destroyed when the crippled warship was sacrificed in an effort to severely damage the Mon Calamari shipyards, and prevent them from being used by the Sith for new ship construction."}, {"tag": "p", "text": "Several Scythes escorted the captured Imperious-class Star Destroyer prototype following the battle. Many more battle cruisers were part of a large Alliance fleet under Admiral Stazi that participated in a joint operation with the deposed Emperor Roan Fel's forces against the Sith."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Scythe-class battle cruiser was designed by Sean Cooke, who was the designer for all of the Galactic Alliance and Imperial warships in the Star Wars: Legacy comic series."}, {"tag": "p", "text": "The name for the warship was announced by Randy Stradley on the Dark Horse Comics message boards. Stradley also revealed that the wing-like structures housed starfighter launch bays and torpedo launchers. He was also the first to hint that the Scythe battle cruiser was of Mon Calamari design. This was finally confirmed in the Legacy Era Campaign Guide."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}