{"url": "MC30c_frigate", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Frigate classes", "Category:MC30c frigates", "Category:Mon Calamari starship classes", "Category:New Republic starship classes"], "nodes": [{"tag": "h1", "text": "MC30c frigate"}, {"tag": "p", "text": "The MC30c frigate was a class of Mon Calamari-designed warship, utilized by the Rebel Alliance during the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Considered one of the most powerful mid-level frigates used in the war, the MC30c frigates utilized proton torpedoes as well as turbolaser batteries to bombard larger enemy starships in combat. In addition to this, it was also one of the fastest ships of its type."}, {"tag": "p", "text": "The greatest weakness of the ship was that it had very light armor. If heavy fire was concentrated on the frigate, it would most likely be destroyed."}, {"tag": "p", "text": "It was also common for these vessels to utilize cluster bombs that could damage enemy targets around the ship. The cluster bombs were intended as a last defense against fighters and bombers. These proved very effective against clusters of such vessels; though once the bombs were depleted the MC30c frigate the only real defense against star fighters were its laser cannons which could quickly destroy starfighters but if bombers were close enough to it the ship could be easily destroyed due to its limited armor ."}, {"tag": "p", "text": "The shield generator of the ship, like other Mon Calamari craft, was hidden within the superstructure and therefore harder to destroy. This allowed the shields to regenerate at a continuous rate, even if the weapons systems suffered damage. A characterization of the frigate would be as a fast light armored capital ship killer and a star fighter destroyer."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The MC30 class served in the Alliance Navy throughout most of the Galactic Civil War, in various configurations, and continued into the early reign of the New Republic. MC30 frigates were seen in the skies of Nar Shaddaa alongside other Republic ships such as GR-75 transports and CR90 corvettes in 5 ABY, during Kyle Katarn's visit with 8t88. At some point, a MC30c frigate and a EF76 Nebulon-B escort frigate and an X-wing starfighter were involved in a space battle with several TIE/LN starfighters, an event that was later made into a painting focusing on the X-wing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The class was based on concept art made of Mon Calamari Star Cruisers for the production of Return of the Jedi."}, {"tag": "p", "text": "The MC30 or a related design had a short cameo in Star Wars: Jedi Knight: Dark Forces II in the introduction to the Nar Shaddaa level."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}