{"url": "MC80A_Home_One_Type_Heavy_Star_Cruiser", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Alliance to Restore the Republic starship classes", "Category:MC80 Home One type Star Cruisers", "Category:Mon Calamari cruiser variants", "Category:New Republic starship classes", "Category:Resistance starship classes"], "nodes": [{"tag": "h1", "text": "MC80A Home One Type Heavy Star Cruiser"}, {"tag": "p", "text": "The MC80A Home One Type Heavy Star Cruiser, also known as the MC80A star cruiser was a model of MC80 Star Cruiser used by the Alliance to Restore the Republic and New Republic. During the Galactic Civil War, several of these ships participated in battles such as Endor and Jakku. Around 30 years after the Battle of Endor, the MC80A Star Cruiser was still used by the Resistance."}, {"tag": "p", "text": "One famous example was the ship Home One, which was a modified version of the MC80A Star Cruiser, and the most advanced vessel in the Alliance Fleet."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Meeting over Dantooine"}, {"tag": "p", "text": "After Operation Handoff, Mon Mothma decided to abandon the Imperial senate following the Ghorman Massacre, and had made a call to all rebel cells to come together and form the Alliance to Restore the Republic. Several ships, including Home One responded to the call and came to Dantooine."}, {"tag": "p", "text": "Shortly after, the Telaris rebel stardocks had began converting and retrofitting the Home One and Nautilian MC80A star cruisers, along with the MC75 cruiser, the Profundity. Colonel Anj Zavor of Rebel Fleet Command sent a report to Commander-in-Chief Mon Mothma, updating her on operations. By 0 BBY, the ships had been produced to battle-ready conditions, but were held back until they were ready for war. After the battle of Scarif, which resulted in the death of admiral Raddus and the loss of most of the rebel fleet, including the Profundity, but also the acquisition of the Death Star plans, Gial Ackbar was appointed the new leader of the Alliance Fleet and made Home One the new flagship of the fleet."}, {"tag": "h3", "text": "Mutiny on Mon Cala"}, {"tag": "p", "text": "Several MC80A cruisers were in service of the Mon Cala Mercantile Fleet during the Galactic Civil War, which was affiliated with the Galactic Empire. When King Lee-Char was killed by stormtroopers, the fleet and its crew began to rise up against the Imperials onboard their ships. As the fleet attempted to escape, the Imperial blockade of six Imperial II-class Star Destroyers prevented them from escaping. Luke Skywalker, Leia Organa, Chewbacca, and Han Solo came up to join the fleet and help out, as did Gial Ackbar with several squadrons of T-65B X-wing starfighters and BTL-A4 Y-wing assault starfighters. The MC80A cruiser Aurora Flare rammed into Admiral Meori's Star Destroyer, creating a pathway and allowing the ships to flee the system to join the Alliance."}, {"tag": "h3", "text": "Assault on the Mako-Ta Space Docks"}, {"tag": "p", "text": "Despite acquiring countless new starships for the Alliance Fleet, the Mon Calamari vessels had yet to become combat-ready warships and still required extensive modifications, such as proper armament, shielding, and hyperdrives. Queen Trios offered the Mako-Ta Space Docks and several Shu-Torun engineers to assist the new fleet in retrofitting the ships. This turned out to be a trap, as Death Squadron, lead by Darth Vader entered the system. The cruisers' hyperdrives weren't functioning and the starfighter bay doors were locked, betrayed by Trios. The Alliance scrambled but managed to break free of the malfunctions. While the rest of the fleet escaped, including Home One, Jan Dodonna's MC80A cruiser, the Republic, was destroyed."}, {"tag": "h3", "text": "Battle of Endor"}, {"tag": "p", "text": "After the Empire discovered and destroyed the main Alliance headquarters on Hoth, Home One served as a mobile command center. The cruiser hosted much of the Alliance's leaders, including Mon Mothma and Crix Madine. The planning of the battle of Endor took place here. Utilizing the secret hyperspace route known as the Sanctuary Pipeline, Home One lead the rebel fleet, consisting of at least eight MC80A cruisers, including the Nautilian and Independence, into the system. The fleet battled out the largest known Imperial fleet. Despite being heavily outnumbered, the Alliance fleet was able to destroy the second Death Star, along with a large part of the Imperial fleet, although they lost several ships including the Nautilian."}, {"tag": "h3", "text": "New Republic service"}, {"tag": "p", "text": "After the Battle of Endor, the Alliance to Restore the Republic had reformed into the New Republic and thus the MC80A star cruisers continued being used within the New Republic Defense Fleet. The MC80A continued use in battles such as Kuat and Kashyyyk. The final battle of the Galactic Civil War was the Battle of Jakku, where at least one ship, Home One, participated. Admiral Ackbar coordinated the battle with other New Republic commanders including Commodore Kyrsta Agate, General Tyben, and Lieutenant General Brockway. The Home One along with Agate's Starhawk-class battleship Concord took part in the assault on the Imperial Star Destroyers enveloping the Imperial Super Star Destroyer Ravager; which served as the Imperial command ship. From the bridge of the Home One, Ackbar watched as the Concord used its powerful tractor beam projector to drag the Ravager to Jakku's surface. The battle concluded with a victory for the New Republic."}, {"tag": "h3", "text": "Resistance service"}, {"tag": "p", "text": "Eventually, Home One was retired from service and was recruited by the Resistance."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the old Expanded Universe, the MC80a and MC80 Home One type Star Cruiser were two separate models. This was changed, however, in the canon book Star Wars: Absolutely Everything You Need to Know, Updated and Expanded, which describes both designations belonging to the MC80."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}