{"url": "MC80_Liberty_type_Star_Cruiser", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Black Sun starship classes", "Category:MC80 Liberty type Star Cruisers", "Category:Mon Calamari cruiser variants", "Category:Mon Calamari Shipyards products", "Category:New Republic starship classes"], "nodes": [{"tag": "h1", "text": "MC80 Liberty type Star Cruiser"}, {"tag": "p", "text": "The MC80 Liberty type Star Cruiser was an early type of Mon Calamari Star Cruiser put into service for the Rebel Alliance during the Galactic Civil War."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "Like most Mon Calamari designs, each vessel was individually unique, which was frustrating for Rebel technicians. As with other Calamari designs during the Galactic Civil War, all warships in this group were standardized as much as possible to aid non-Calamari crewmembers, something the artistic Mon Calamari accepted begrudgingly."}, {"tag": "p", "text": "A common variant of the MC80 Star Cruiser line was exemplified by the cruiser Liberty. It had an array of nine engines, divided into three different sizes, located at the stern. A large wing-shaped superstructure was affixed to the main hull on either side, containing weapons pods and tractor beam arrays. Some MC80 cruisers had their wing sections shortened and were equipped with an additional thruster."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "Blisters filled with turbolaser cannons, deflector shield projectors, tractor beam projectors and Ion Cannons were scattered throughout each vessel, many of which were located on the wing structures. The Turbolasers and the Ion cannons possessed advanced targeting systems and were able to track and destroy fighters and smaller craft."}, {"tag": "p", "text": "While their armaments, which varied from ship to ship, were less than those found on the Galactic Empire's mile-long Star Destroyers, their shielding capability was far more advanced. The multiple backup shields and multiple shield generators ensured that a Calamarian cruiser could not only last in combat against more heavily armed opponents but also they had more protection from spacial elemental threats."}, {"tag": "p", "text": "On Liberty type cruisers, the primary sensor array was located on the ventral side of the ship. On ships that did not have the wing shaped structures, an additional thruster replaced the sensor array."}, {"tag": "h3", "text": "Hangar complement"}, {"tag": "p", "text": "The standard fighter complement on a MC80 was three squadrons. The typical makeup of a three squadron wing on a MC80 included one X-wing, one Y-wing, and one A-wing squadron. At the Battle of Endor, it is possible that the MC80 Cruiser Home One also carried a squadron of B-wing starfighters."}, {"tag": "h3", "text": "Bridge"}, {"tag": "p", "text": "The bridge tower of an MC80 was located towards the stern of the vessel, slightly sunken into the main hull, unlike on Imperial Star Destroyers. The ship's main reactor was found right behind the bridge section."}, {"tag": "p", "text": "The vessels were crewed by various species of Rebel personnel, though the command crew was exclusively Mon Calamari, due to the nature of the bridge display screens being designed for the Mon Calamari viewing spectrum."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The origins of the design went back to the Clone Wars, when blueprints for a Mon Calamari-designed capital ship were stolen by the CIS. The vessel depicted appeared identical to the MC80 Liberty type, thus giving the subclass a military origin."}, {"tag": "h3", "text": "Rebel service"}, {"tag": "p", "text": "This class was composed of the initial group of starliners modified for combat duty by Mon Calamari and Rebel techs. The cruisers represented the first line of large capital ships deployed by the Rebel Alliance."}, {"tag": "p", "text": "The entry of the Mon Calamari into the Alliance ensured that the undergunned and outnumbered Rebel fleet would possess the firepower to deal with Imperial-class Star Destroyers, and when grouped, even heavier combatants. This was shown during the climactic Battle of Endor, when a flotilla of Mon Calamari ships attacked the massive command ship Executor and brought down its shields."}, {"tag": "h3", "text": "Later military service"}, {"tag": "p", "text": "At the Battle of Mindor, the twin of the Liberty, known as the Justice, was used by General Luke Skywalker to fight against Lord Shadowspawn's forces in the Taspan system. The cruiser stayed in frontline service for several years in the New Republic fleet, eventually getting outclassed by the MC80B, MC90, Mediator, and Viscount designs. Many were reconverted back into starliners, medical ships, evacuation cruisers, etc. During the Yuuzhan Vong War, many of the remaining ships were pushed back into service but were quickly outclassed by the enemy ships."}, {"tag": "p", "text": "By 137 ABY, the criminal organization Black Sun had at least one MC80 in service, stationed near sector Vigo Lun Rask's headquarters over Kaer. The Galactic Alliance Remnant also utilized the aging warships, with one being destroyed by Skull Squadron as it attempted to find the main Remnant fleet. Several were used during the Evacuation of Dac."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "In the game Star Wars: X-Wing Alliance, Liberty is noted as being 1,500 meters long and is presented in-game with a different thruster array. The model used for the cut-scenes however, does portray a similar thruster array to the ILM studio model."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}