{"url": "MC80_Home_One_type_Star_Cruiser", "categories": ["Category:Legends articles", "Category:Alliance to Restore the Republic starship classes", "Category:Heavy cruiser classes", "Category:MC80 Home One type Star Cruisers", "Category:Mon Calamari cruiser variants", "Category:New Republic starship classes"], "nodes": [{"tag": "h1", "text": "MC80 Home One type Star Cruiser"}, {"tag": "p", "text": "The MC80 Home One type Star Cruiser, also known as the MC80 Command Cruiser was one of the several MC80 Star Cruiser designs built by the Mon Calamari. Originally fielded before the Galactic Civil War as civilian vessels, they were modified by the Rebel Alliance, and served in command ship and battleship roles in the Alliance Fleet."}, {"tag": "p", "text": "Although the most common MC80 subclass was the MC80 Liberty type Star Cruiser, the Home One type was perhaps the most famous of all Rebel capital ship designs, as it was the class of the Home One and the Independence, which served as Admiral Ackbar's flagships in many famous battles."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "h3", "text": "Dimensions"}, {"tag": "p", "text": "No two Mon Calamari ships were identical, each being individually designed and constructed, but they were gradually standardized by the extensive refitting and adjustments made to the hulls when the vessels were converted for combat duty. Most ships were 1.2km in length, but individual ships were 1.4km or even bigger."}, {"tag": "p", "text": "Even the Home One and her sisters formed a uniform design type: cylindrical hulls, with a tapered bow, hangar-bays amidships, and bulbous stern mounting ten huge sublight thrusters: four M8.0-StarDrive main thrusters and six M4.5-StarDrive maneuvering engines."}, {"tag": "p", "text": "Home One was originally designed for deep-space exploration, and it was constructed with massive panoramic viewports, which had to be removed when she was rebuilt as a warship. This may have been true of her sister-ships as well."}, {"tag": "p", "text": "The Home One was described as the largest Star Cruiser in the Rebel Alliance fleet as it gathered for the Battle of Endor, and may indicate a slight variation in size and tonnage between the sister-ships. Taken together, ships of this type were arguably the most prominent capital ships in the Rebellion, serving in the role of command ships as well as battleships. Like most warships, all MC80s were classified as cruisers in one standard system and capital ships in another."}, {"tag": "h3", "text": "Crew complement"}, {"tag": "p", "text": "The standard crew of the Home One type consisted of 5,402 individuals, 78 gunners, and a passenger complement of 1,200 troops. A minimum operating crew of 1,230 was shared by the Home One, and by her sister-ship, the Independence."}, {"tag": "h3", "text": "Hangar complement"}, {"tag": "p", "text": "The number of starfighters carried appeared to vary: whereas the Home One is said to have carried ten squadrons, the Independence was limited to just two squadrons of X-wings, in later years under the New Republic. It is unknown whether the hangar facilities were the same on different ships, although three of the known vessels had a large hangar on the starboard side of the hull. Internal design differences may also have affected cargo capacity, which was 20,000 metric tons aboard the Home One."}, {"tag": "h3", "text": "Offensive and defensive systems"}, {"tag": "p", "text": "The Home One types had more armor and armaments than the Liberty type, and were subsequently rarer. Standard armament for the subclass included 36 turbolasers, 36 heavy ion cannons, and six tractor beam projectors. Home One types lacked the Executor's point defense laser systems because their turbolasers' tracking systems were sufficient in targeting and destroying smaller craft and starfighters. Their turbolasers were also capable of planetary bombardment, although they were seldom used in this capacity."}, {"tag": "p", "text": "Home One is known to have carried heavy hull armor and powerful shields, comparable to an Imperial-class Star Destroyer, but she is said to have carried the heaviest armor and weaponry of any ship in the rebel fleet, at the Battle of Endor, which means the other ships of the subclass were relatively less well-protected."}, {"tag": "h3", "text": "Bridge tower"}, {"tag": "p", "text": "Home One type ships appeared to have multiple command pods scattered across each ship protruding from both the dorsal and ventral areas of the hull. One of these served as the command center for the ship."}, {"tag": "h4", "text": "Main bridge"}, {"tag": "p", "text": "The commanding officer could be situated in a chair attached to a swiveling robotic arm that overlooked both the bridge crew as well as a panoramic window out into space. The bridge contained a CS-Mark 12 holoprojector table situated in the middle of a briefing room section, which crew members used to monitor events during a battle."}, {"tag": "p", "text": "The Home One, like almost all early Mon Cal cruisers, retained her original, species-specific bridge control systems, meaning that, while the bulk of the crew was drawn from the many species that made up the Rebellion, the command crew was made up entirely of Mon Calamari. There is some evidence, however, that one ship of the class was modified for a human command crew."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rebel service"}, {"tag": "p", "text": "At least, seven Home One type ships were known to be used by the Alliance, with three of them identified by name: The Home One herself, the Independence, and the Defiance. All began military service in the early period of the Galactic Civil War, some time prior to the Battle of Yavin."}, {"tag": "p", "text": "As mentioned above, the Home One was originally designed for deep-space exploration. It was among the first ships selected for militarization when the Mon Calamari joined the Rebellion, being selected by Ackbar as his personal flagship. It is probable that her sister-ships had a similar pre-war role, and they seem to have been refitted for war at around the same time, and they shared a similar prominence when they entered Rebel service."}, {"tag": "p", "text": "While all the Mon Cal vessels provided valuable capital ship firepower for the under-resourced Rebel Alliance, it appears that the Home One type served specifically as high-level command ships, with at least two of the three known ships acting as a mobile headquarters for the Alliance High Command."}, {"tag": "p", "text": "The Independence served in this role, before the Battle of Yavin, and the Home One from the Battle of Hoth onwards. The third known ship of the type, the Defiance, is less directly linked to the High Command, and seems to have served primarily as Admiral Nammo's flagship, but there are occasions where she may have been the fleet command ship in closest proximity to the Rebel leadership: in the Anoat sector immediately after the Battle of Hoth."}, {"tag": "p", "text": "During the climactic Battle of Endor, most of the Alliance's naval resources were gathered into their offensive fleet, and the Home Ones added their firepower to the effort, being the largest Rebel capital ships used in the engagement. The Independence served as communications ship, while the Defiance was placed in the rearguard, and Ackbar used the Home One as his fleet command ship. It appears that General Crix Madine also commanded a division of the fleet from a ship of the same type possibly the Independence. At least one cruiser of the type was destroyed during the battle, however, as the second victim of the second Death Star's superlaser. In the aftermath of Endor, the Defiance was used to hunt down rogue Imperial elements."}, {"tag": "h3", "text": "New Republic service"}, {"tag": "p", "text": "In the early years of the New Republic, the type remained in front-line service as command ships, with Ackbar using the Independence as his flagship at the Battle of Brentaal IV, and the Home One herself leading the fleet at the Seizure of Coruscant, the Battle of Bilbringi, and the Battle of Ciutric."}, {"tag": "p", "text": "From around 10 ABY, the veteran ships were superseded as fleet command platforms by newer warships, notably MC90 Star Cruisers. Ackbar first shifted his flag to a new MC90, the Defiance, and subsequently to the Galactic Voyager. In 18 ABY, at the Second Battle of Champala and the Battle of Anx Minor, however, Ackbar commanded from the Super Star Destroyer Guardian."}, {"tag": "p", "text": "However, this did not end the careers of the older vessels. The Home One served as a squadron command ship in 11 ABY, and remained in commission as the Supreme Commander's personal flagship until 23 ABY, while the Independence was still on active duty in the early years of the Yuuzhan Vong War, commanding a patrol force based near Mon Calamari."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "A variety of continuity inconsistencies exist concerning the Home One and her sister-ships: see here for full discussion."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}, {"tag": "h2", "text": "Notes and references"}]}