{"url": "MC80_Star_Cruiser", "categories": ["Category:Canon articles", "Category:Pages needing citation", "Category:Ship stubs", "Category:Alliance to Restore the Republic starship classes", "Category:Heavy cruiser classes", "Category:Mon Calamari cruiser variants", "Category:New Republic starship classes", "Category:Resistance starship classes"], "nodes": [{"tag": "h1", "text": "MC80 Star Cruiser"}, {"tag": "p", "text": "The MC80 Star Cruisers, were capital ships used by the Rebel Alliance during the Galactic Civil War. These immense vessels were a startling contrast to the angular-shaped Imperial-class Star Destroyers, which were favored by the Imperial Fleet. Whereas the Imperial warship resembled a pointed dagger in shape, a Mon Calamari cruiser lacked hard angles and was covered with ovoid forms suggesting an organic sculpture. There were pods attached all around the ship, containing turbolasers, sensor arrays and viewing ports, the latter fulfilling the ships' original intended role as an exploration and observation vessel. Each cruiser was of a unique design. Despite their smooth lines, these vessels were heavily armed with dozens of turbolasers, ion cannons, tractor beam projectors and shield generators. The MC80A Home One Type Heavy Star Cruiser was a variant of the MC80 star cruiser."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early rebellion"}, {"tag": "p", "text": "The MC80 Star Cruiser line was an important part of the Galactic Civil War, being the backbone of the Alliance Fleet. The first known use of the ship was in the year 18 BBY during the Invasion of Mon Cala. There, a group of MC80A and MC75 star cruisers led by Admiral Raddus and Commander Gial Ackbar broke free of the Imperial blockade and escaped into the galaxy."}, {"tag": "h3", "text": "Alliance to Restore the Republic"}, {"tag": "p", "text": "During the formation of the Alliance to Restore the Republic, the MC80A cruiser Home One was present and joined the Alliance fleet."}, {"tag": "p", "text": "After the execution of king Lee-Char was broadcasted across Mon Cala, in which he was killed by stormtroopers, the crew of the Mon Cala Mercantile Fleet began to rebel. With the help of the Alliance, the fleet escaped the Imperial blockade and retreated with the Alliance. The fleet, consisting of 12 Liberty types and 2 MC80A cruisers, along with other Mon Cala cruisers like the MC75 Star Cruiser, arrived at the Mako-Ta Space Docks to be retrofitted to become full-fledged warships. However, this was a trap and Death Squadron arrived to destroy the fleet. The rebels were able to escape, but only after most of their ships were destroyed."}, {"tag": "p", "text": "Several of these warships participated in the decisive Battle of Endor. There, ships such as the Liberty and Home One helped defeat the Empire and destroy the second Death Star."}, {"tag": "h3", "text": "New Republic service"}, {"tag": "p", "text": "Shortly after the Battle of Endor, the Alliance transformed into the New Republic, with the MC80 line continuing to be used within the New Republic Defense Fleet, participating in battles across the galaxy on planets such as Fondor, Naboo, Kuat, and Kashyyyk."}, {"tag": "p", "text": "Many MC80 star cruisers, including both the MC80A and Liberty type, participated in the Battle of Jakku. There, forces led by Ackbar on the Home One defeated the Imperial fleet, winning the Galactic Civil War.[source?]"}, {"tag": "h3", "text": "Resistance service"}, {"tag": "p", "text": "Eventually, Home One was retired from service in the New Republic fleet and was used by the Resistance."}, {"tag": "p", "text": "In 35 ABY, MC80 Star Cruisers were part of a fleet assembled by Lando Calrissian to assist the Resistance during the battle against the Sith Eternal forces over the planet Exegol."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}