{"url": "MC95A_Star_Cruiser", "categories": ["Category:Canon articles", "Category:Mon Calamari cruiser variants"], "nodes": [{"tag": "h1", "text": "MC95A Star Cruiser"}, {"tag": "p", "text": "The MC95A Star Cruiser was a model of Mon Calamari Star Cruiser that was active during the war between the First Order and the Resistance. Many MC95A Star Cruisers were present on Exegol as part of the citizens' fleet that participated in the Battle of Exegol in 35 ABY between the Resistance and the Sith Eternal."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The MC95A Star Cruiser was a Star Cruiser of Mon Calamari design. The MC95A Star Cruiser possessed two large and thin wings at the front of the vessel and was equipped with a hyperdrive which gave it the capability of entering hyperspace at lightspeed, and was equipped with engines. The MC95A Star Cruiser could be disabled when struck by powerful Force lightning. Characteristically of other Mon Calamari ship designs, the MC95A Star Cruiser had a bulbous hull with differing modules, and had several antenna on a dorsal module towards the rear along with laser cannons. The ship's bridge was located on the forward command section near the bow of the vessel. It also contained a bridge tower at the rear of the vessel."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "As a capital ship, the MC95A Star Cruiser had the ability to participate in naval warfare."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "MC95A Star Cruisers were in service by the time of the war between the First Order, a military junta that succeeded the Old Galactic Empire, and the Resistance, a paramilitary force with roots to the dissolved Rebel Alliance and the defunct New Republic. In 35 ABY, Alliance and Republic heroes General Lando Calrissian and Chewbacca were dispatched on the legendary Millennium Falcon to rally the citizens of the galaxy in order to reinforce the Resistance, which travelled to the ancient Sith redoubt world of Exegol in a bid to destroy the resurgent Sith Eternal, which allied itself with the First Order, and save the galaxy from their rule."}, {"tag": "p", "text": "As the Resistance neared defeat and suffered heavy losses, an expansive 14,000 ship strong citizens' fleet from across the galaxy arrived at Exegol and participated in the Battle of Exegol, including numerous MC95A Star Cruisers. Reinforced, the combined galactic allied force attacked the Final Order, a massive fleet of planet-killing Xyston-class Star Destroyers that numbered above 1,000 strong. As the Jedi Rey and Ben Solo confronted the Dark Lord of the Sith Darth Sidious on the surface, Darth Sidious gained Force power from the Force dyad between Rey and Solo, and unleashed a torrent of powerful Force lightning at the galactic fleet, disabling many vessels. After Rey continued her confrontation, the lightning dissipated and the fleet regained its foothold. Darth Sidious was then eventually disintegrated by his own power after Rey deflected his lightning, finally killing him. The remaining forces of the Sith Eternal on Exegol were destroyed, and an uprising against the First Order took place throughout the galaxy."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The MC95A Star Cruiser first appeared in the final installment of the Star Wars saga and the sequel trilogy, Star Wars: Episode IX The Rise of Skywalker. It was first identified in an installment of Star Wars By the Numbers on StarWarsKids.com in 2020."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}