{"url": "MC95_Star_Cruiser", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:MC95 Star Cruisers", "Category:Resistance starship classes"], "nodes": [{"tag": "h1", "text": "MC95 Star Cruiser"}, {"tag": "p", "text": "The MC95 Star Cruiser was a class of Mon Calamari Star Cruiser present in the the galaxy by the time following the Battle of Crait during the war between the First Order and the Resistance in 34 ABY. In 35 ABY, several were Star Cruisers were in service to the Mon Cala monarchy, and several formed part of the naval forces of the Resistance. Many MC95 Star Cruisers participated in the Battle of Exegol that saw the final destruction of the Sith and defeat of the Sith Eternal forces as part of the citizens' fleet."}, {"tag": "p", "text": "The MC95 class gave rise to the MC95A, MC95B, MC95C, MC95D and MC95E Star Cruiser models."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The MC95 Star Cruiser was a Star Cruiser of Mon Calamari design and was equipped with a hyperdrive which gave it the capability of entering hyperspace at lightspeed, and was equipped with engines. The MC95 Star Cruiser had a bridge, as well as two hangars. Characteristic of other Mon Calamari ship designs, the MC95 Star Cruiser had a bulbous hull with differing modules and could be disabled when struck by powerful Force lightning."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "As a capital ship, the MC95 Star Cruiser had the ability to participate in naval warfare, and could serve in the capacity of a flagship."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Resistance's mission to Mon Cala after the Battle of Crait, the Mon Cala monarchy allied with the Resistance and dispatched Aftab Ackbar and his starship along with several other Nebulon-C escort frigates, MG-100 StarFortress SF-17s, and starfighters to escape with the Millennium Falcon just as the First Order arrived. Later, two such starships were part of an attack on the Finalizer and two other Resurgent-class Star Destroyers over Batuu as part of a strike fleet. Several MC95 Star Cruisers participated in the Battle of Exegol in 35 ABY between the Resistance and the Sith Eternal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The MC95 Star Cruiser first appeared in the Star Wars comic book Allegiance 4 in 2019, and was developed for Star Wars: Galaxy's Edge. It was first identified in an installment of Star Wars By the Numbers on StarWarsKids.com."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}