{"url": "MC90_Star_Cruiser", "categories": ["Category:Legends articles", "Category:Galactic Alliance starship classes", "Category:MC90 Star Cruisers", "Category:Mon Calamari cruiser variants", "Category:New Republic starship classes"], "nodes": [{"tag": "h1", "text": "MC90 Star Cruiser"}, {"tag": "p", "text": "The MC90 Star Cruiser was a warship class designed by the Mon Calamari for the New Republic."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Produced in the Mon Calamari Shipyards, the Sluis Van Shipyards, and the Hast Shipyards, the MC90 was the first Mon Calamari Star Cruiser designed specifically as a warship. Its focus on heavy weapons and large hangars showed a realistic assessment of the firepower required to challenge Imperial-class Star Destroyers. The MC90 was the most powerful warship built for the New Republic before the Yuuzhan Vong War."}, {"tag": "p", "text": "Controls and displays onboard the ship were designed, for the first time on a Mon Calamari Cruiser, for compatibility with most major species, allowing for officers other than Mon Calamari to pilot the vessels. The command center was a clear bubble in the center of the ship, giving the bridge officers a vision of the area below as well as above. Admiral Ackbar was not pleased with the choice of constructing the bridge this way; he argued that it was too much of a weak spot that the Imperial forces could exploit."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "The MC90 represented a number of firsts that highlight the shifting military strategy of the New Republic that would eventually culminate in the New Class program. The first MC90, Defiance, was completed shortly before the Battle of Calamari."}, {"tag": "p", "text": "The MC90 became one of the most powerful warships in the arsenal of the New Republic Defense Fleet, often serving as a flagship for fleets and task forces. Due to the tremendous value of the vessels, most were stationed in the Core Worlds."}, {"tag": "p", "text": "These powerful warships remained the pinnacle of Mon Calamari ship building until the advent of the Mediator-class battle cruiser. Older vessels, like the Galactic Voyager, were kept in reserve and upgraded during the Yuuzhan Vong War, but served more as token symbols than heavy duty warships."}, {"tag": "p", "text": "Despite the predominance of newer Mon Calamari-built warships in the Galactic Alliance Defense Force by 40 ABY, such as the Mon Calamari heavy carrier and Mediator-class battle cruiser, the MC90 was still considered to be a powerful frontline combat starship. This was evident in the usage of the Galactic Voyager as the flagship of Alliance Supreme Commander Cha Niathal."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The first image of a MC90, which can be seen at the top of this page, has a striking resemblance to concept art of a Mon Calamari cruiser found in The Star Wars Sourcebook. The image in the book was noted as being of a MC80 Star Cruiser in service with the Rebel Alliance."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}