{"url": "MD-4_medical_droid", "categories": ["Category:Legends articles", "Category:MD-series medical specialist droid models"], "nodes": [{"tag": "h1", "text": "MD-4 medical droid"}, {"tag": "p", "text": "The MD-4 was a model of medical droid and a part of the MD-series that was manufactured by Industrial Automaton. It was slightly humanoid in appearance."}, {"tag": "p", "text": "This droid model had specialized appendages for performing microsurgical procedures and could perform these without assistance."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Industrial Automaton's MD-4 first-degree droid was part of the MD-series of medical droids. Related to the 2-1B surgical droid—another of Industrial Automaton's products—in terms of aesthetic design, it was 1.5 Imperial standard meters tall and had a torso unit with two arms topped by a cranial unit. The legs were shrouded in a surgical gown to protect delicate internal mechanisms. MD-4 droids were ambidextrous."}, {"tag": "p", "text": "MD-series droids generally had gray plating and green highlights. The photoreceptors were yellow. Costing 2,000 credits, MD-4s were available for purchase throughout the galaxy. The torso was the location of a connection socket to allow the droid to directly connect to a computer. The MD-4 employed reduction servomotors and actuators to give their arms slow, precise movements to perform complex surgical procedures."}, {"tag": "h2", "text": "Role"}, {"tag": "p", "text": "MD-4 droids were intended for surgical purposes, with specialized microsurgical appendages, including miniaturized vibroscapels, flex clamps, and fiber optics."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Constructed on the droid factory world of Telti, they were employed by the Empire during the Galactic Civil War. Aboard the Imperial EF76 Nebulon-B escort frigate Far Orbit, an MD-4 droid oversaw the surgical unit. Three MD-4 droids served under Doctor Momaw Mowadan aboard the luxury liner Kuari Princess. Antar Roat, Wedge Antilles' cover identity to infiltrate Coruscant in 6 ABY, was said to have been treated for battle injuries by MD-4s."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}