{"url": "ME-8D9", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Articles needing illustration", "Category:Assassins", "Category:Crymorrah syndicate", "Category:Feminine programming", "Category:Protocol droids"], "nodes": [{"tag": "h1", "text": "ME-8D9"}, {"tag": "p", "text": "ME-8D9, also known as Emmie, was an ancient protocol droid who resided in Takodana Castle on Takodana for many years. Once known to be an assassin, the droid later served criminals as a translator. Although her origins were unknown, some believed she began her life with the Jedi Order. During the Galactic Civil War, she broke up a fight between the Imperial Security Bureau Agent Romwell Krass Junior and a New Republic pilot. Emmie was later present at the castle shortly before the First Order attacked Takodana following the Hosnian Cataclysm."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Emmie was an ancient protocol droid who was charged with enforcing law and order at Maz Kanata's castle on Takodana. She once served as an assassin before working as a translator for criminals. Some believed that Emmie had begun her operational life working with the Jedi Order. Emmie was reputed to be much older than Maz Kanata and some believed that the droid was part of the ancient castle population. Emmie was a free droid who had no masters but was happy to help Maz run the castle, which served as a pub and hotel for travelers."}, {"tag": "p", "text": "In the year 5 ABY, Emmie broke up a fight between the Imperial Security Bureau agent Romwell Krass Junior and a New Republic pilot. Romwell had lost his family during a New Republic attack on the Hyborean Moon where he had worked at a black-site prison. Emmie separated the two belligerents and warned them that they had broken the Castle's law. When Romwell made a defiant remark, Emmie electrocuted him, knocking him unconscious. She then brought both to the lower levels of the castle where the two men were imprisoned in holding cells."}, {"tag": "p", "text": "After Maz had dealt with Romwell and the New Republic pilot, Emmie accompanied Maz as she walked on the parapets overlooking Nymeve Lake. Emmie informed Maz that peace had returned to the Castle. Maz thanked the droid but added that peace had not returned to her heart. She sensed that something was off balance and causing the water in the lake to be turgid. She counseled Emmie that it was wise for them to be prepared. When Emmie inquired what was going on, Maz instructed him to prepare the Stranger's Fortune for flight because she wanted to have a look around the galaxy. Emmie complied with Maz's wishes."}, {"tag": "p", "text": "In 34 ABY, ME-8D9 was still working at Maz Kanata's castle shortly before the Hosnian Cataclysm. She was delighted to see Han Solo when he arrived there, as she had not seen him for 25 years. Later, she and the other guests witnessed a dark energy beam from the First Order's superweapon Starkiller Base destroying the worlds of the Hosnian system. Shortly later, the castle was attacked by First Order forces searching for the droid BB-8, who was carrying a map which led to Luke Skywalker."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "ME-8D9 was a protocol droid with a female programming. She had an exoskeleton like burnished bronzium and peaky spikes on her legs, arms, and skull. She spoke both Galactic Basic Standard and a mechanical language. Emmie had two hands with five fingers. Each of these fingers was fitted with a thin golden filament which allowed her to electrocute troublesome patrons at Maz Kanata's castle."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "ME-8D9 was portrayed by Stephanie Silva in Star Wars: Episode VII The Force Awakens. She was not given a listing in the cast, but was attributed for her work as a \"creature & droid performer\"."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}