{"url": "MG-100_StarFortress_SF-17", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:First Order starship classes", "Category:MG-100 StarFortress SF-17s", "Category:New Republic starship classes", "Category:Resistance starship classes"], "nodes": [{"tag": "h1", "text": "MG-100 StarFortress SF-17"}, {"tag": "p", "text": "The MG-100 StarFortress SF-17, also known as the B/SF-17 heavy bomber, was a model of heavy bomber manufactured by Slayn & Korpil for use by the New Republic during the late stages of the Galactic Civil War. Following the Galactic Concordance and New Republic disarmament, the ship was primarily used in civilian applications. Several ships were used by the Resistance during its war with the First Order around 34 ABY, earning it the name Resistance Bomber."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The MG-100 StarFortress SF-17 was a heavy bomber manufactured by Slayn & Korpil. The starship featured six sublight ion thrusters, a single hyperdrive, and artificial gravity projectors. At the bottom-front of the ship strutted a targeting sensor mast, which contained a targeting sensor and active-tracking array. Two short range comms antenna were located along the top of the ship along its keel line. Jutting horizontally from the ship's profile were two stabilizer foils. In total, the ship was crewed by five individuals. A single pilot and flight engineer operated within the armored cockpit. The bombardier operated a targeting pedestal on the flight deck, and two gunners operated the rear and ventral ball turrets."}, {"tag": "p", "text": "The B/SF-17's intended purpose was to deliver a payload of 1,048 proton bombs on top of a target. The modular bombing magazine, called the \"clip\" by the bomber's crew, would drop the bombs through sequenced electromagnetic plates in the clip, which propelled the bombs to \"drop\" in microgravity environments. The bombs would then be drawn magnetically to their targets. The assembly could be programmed to drop specific sections of the payload in sequence, but the most common configuration was \"deploy all.\" To drop the ship's payload, the bombardier on the flight deck monitored a concentrated sensor feed. The system calculated the optimum time for release, and at a given prompt, or at the discretion of the bombardier, the control button on a wireless remote triggered the release of the payload. A magnetic seal retained the atmosphere when the bomb bay doors were open."}, {"tag": "p", "text": "Ball turrets on the StarFortress were encased in an armored transparisteel shell, while deflector shields protected the gunner. Despite this protection, many gunners felt exposed to enemy fire. Other turrets included a remotely operated dorsal turret of similar firepower to the EM-1919 paired repeating laser cannons installed on the ball turrets, two remote-linked cannon arrays at the rear of the vessel, two forward laser canons, and two more laser canons, one on the tip of each stabilizer foil."}, {"tag": "p", "text": "As a bomber, the MG-100 Starfortress was slow and ungainly, making it prone for starfighter attack. Resistance flight instructors taught bomber crews to fly in tight formation, opposing attacking fighters with overlapping fields of fire. The rear and ventral turrets offered a potent defense against attackers approaching from below or from the rear, but were less effective against threats from above or in front of the bomber squadron. Escort duty for starfighter pilots were difficult assignments for pilots owing to the sacrifice of their vessels speed advantage in order to stay close to their assigned bombers. Enemy fighters would try to lure such escorts away, leaving the bombers exposed."}, {"tag": "p", "text": "Poe Dameron made a note in The Rebel Files comparing the B/SF-17 heavy bomber with the A/SF-01 B-wing starfighter, stating that there wasn't a better bomber anywhere than the B-wing, at least not until the Resistance got its hands on the B/SF-17."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Dating back to the final days of the Galactic Civil War, the New Republic contracted with Slayn & Korpil for the MG-100 StarFortress, a dedicated heavy bomber that could deliver a larger payload than starfighters. Part of the ship's intent was to help capture besieged Imperial holdouts. The ship saw reduced manufacture during the decades of peace that followed. The Senate's subsequent demilitarization effort sent many StarFortresses to the scrapyard. Other decommissioned craft saw widespread civilian use. Mining companies used them to drop explosives that broke up ice and rock, local governments deployed them as rescue ships, fuel tankers, and fire-fighting craft, and scout services relied on them for celestial mapping and exploration. The modular bomb magazine could be easily repurposed for remote cargo drops."}, {"tag": "p", "text": "With the creation of the Resistance in 28 ABY, several StarFortesses found their way into the new paramilitary organization, and were absorbed into its Cobalt and Crimson Squadrons during the Cold War and First Order/Resistance War. Multiple craft were used by the Resistance during the evacuation of D'Qar to drop proton bombs onto the Mandator IV-class Siege Dreadnought Fulminatrix. All of the Resistance's bombers were destroyed during the battle, with only one reaching the target area. This lone bomber, manned by Paige Tico, managed to complete its bombing run right before being destroyed, taking out the Fulminatrix mere seconds before it could destroy the Resistance flagship, Raddus."}, {"tag": "p", "text": "In 35 ABY, StarFortresses were part of a fleet assembled by Lando Calrissian to assist the Resistance during the battle against the Sith Eternal forces over the planet Exegol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The MG-100 StarFortress first appeared in the 2017 film Star Wars: Episode VIII The Last Jedi."}, {"tag": "p", "text": "According to The Art of Star Wars: The Last Jedi,  the StarFortress was originally intended to be called the \"T-wing.\" A resemblance to the letter \"T\" can still be seen from certain angles, most noticeably from head-on."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}