{"url": "MFB-4_Mobile_Repulsor_Base", "categories": ["Category:Legends articles", "Category:Galactic Empire vehicles", "Category:Repulsorcraft"], "nodes": [{"tag": "h1", "text": "MFB-4 Mobile Repulsor Base"}, {"tag": "p", "text": "The MFB-4 Mobile Repulsor Platform was a type of repulsorlift platform that was used by the Galactic Empire. These bases were used for preliminary scouting and survey missions and played supporting roles in planetary occupations."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "During the Galactic Civil War, the Empire deployed an MFB-4 platform on the aquatic planet Alluuvia, using it as their base of operations on the planet. However, the platform was attacked by a team of Rebel Alliance agents, working in conjunction with a group of Ithorian pilgrims and some Anguilla warriors. The Imperials were subsequently driven from Alluuvia."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The exterior of the base contained most of the MFB-4's extensive and deadly defenses, especially against an aerial assault. Four laser cannons, one at each corner, had a range of six kilometers and were manned by dedicated gunners. The centrally located heavy turbolaser could hit targets thirty kilometers distant and was manned by four dedicated gunners. A pair of twenty meter-tall sensor towers at opposite ends of the base detected incoming enemy forces, while various short-range sensor arrays studding the base's exterior could detect operatives attempting to sneak in. The base's shield generators were located on the topside of the base and generated an energy field which could deflect most enemy fire. Finally there was a landing pad atop the base, which connected to the interior through a secured access hatch."}, {"tag": "p", "text": "Emergency access panels and doors allowed for access to the weaponry, sensors and shield generators, however these were secured through the use of rank cylinders. Though possible to bypass this security failure in this regard or, through sheer strength, tearing the access panels off would would trigger an alarm in the base's computer room."}, {"tag": "h3", "text": "Interior Layout"}, {"tag": "p", "text": "Each MFB-4 base was divided into three levels, accessed by the central turbolift running up to the exterior landing pad. Vitally important rooms, including the computer control room, fighter hanger, armory, detention block, and vehicle storage bays were secured by blast doors which only opened to an appropriate rank cylinder. Though it was possible for an enemy operative to bypass these safeguards, failure would sound an alarm in the computer control room."}, {"tag": "h4", "text": "Level 1"}, {"tag": "p", "text": "The top level was the personnel deck, dedicated to housing the base's support personnel along with other vital functions. The computer control room was the nerve center of the base and controlled everything from life support to the repulsorlift engines and shield generator. It was staffed at all times by four technicians and a pair of troopers."}, {"tag": "p", "text": "Next was the communications room, staffed by four technicians and one trooper, which controlled all of the base's sensor and communications equipment (including subspace communications to nearby star systems). There was also a TIE/LN starfighter hanger with space for twelve fighters and support from a half-dozen technicians; fighter launches and retrievals were facilitated by the topside launch chute."}, {"tag": "p", "text": "Four personnel quarters provided living room for the base's 120 support personnel, while two pairs of offices and meeting rooms were given over for use by high-ranking individuals at the base. Computers in these offices were connected to the ones in the computer control room, though they required the correct password to use. There were also a couple of storage rooms dedicated to common goods like food, clothing and repair parts. Finally there was a galley able to feed 300 people at once and a lounge for off-duty personnel to relax, whether by watching holovids or playing a game of sabacc."}, {"tag": "h4", "text": "Level 2"}, {"tag": "p", "text": "The barracks deck was used to house the Imperial Army presence in the base. Eight separate rooms provided living space for up to 300 troopers while separate mess and training halls saw to their daily needs. There was also a medical bay staffed by four MD-5 medical droids and containing two bacta tanks, two complete surgery suites and four recovery rooms. A droid bay provided storage racks for dozens of droids of different sizes along with power rechargers and a complete repair and maintenance shop."}, {"tag": "p", "text": "The armory stored the base's dozens of blaster rifles, pistols, grenades and heavy weapons, along with blaster power packs and a recharging station. A single trooper guarded access to the armory. Finally a detention block was used to hold any captured prisoners, with at least four troopers overseeing the prisoners at all times."}, {"tag": "h4", "text": "Level 3"}, {"tag": "p", "text": "The vehicle bay deck contained a pair of vehicle storage bays which could be used to hold a variety of vehicles; for example on an aquatic planet a bay can be fitted with racks to hold fifteen TIE fighter boats or a combination of 100 single person waveskimmers and fifteen Aquatic Scout Ships. These were launched by the base's underside launch chute, which could be angled to accommodate different vehicle types. There were also another pair of storage rooms on this deck for containing common goods and a mustering hall used to stage troops and vehicles for deployment. Finally there were a pair of research labs used for a variety of scientific endeavors. Access to these labs was controlled by simple entry code and their computers were linked to those in the computer control lab, though a password was necessary to access them."}, {"tag": "h2", "text": "Appearances"}]}