{"url": "MI-726", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Criminals", "Category:Security droids"], "nodes": [{"tag": "h1", "text": "MI-726"}, {"tag": "p", "text": "MI-726 was an MI-series security droid belonging to a board member of the Sienar Fleet Systems company. During an attack on the board member's house, the security droid went rogue and vanished, eventually resurfacing to begin attacking Imperial targets. The Imperial Office of Criminal Investigations then posted a bounty of 100,000 credits on the droid for anyone who could destroy the criminal automaton."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "MI-726 was an MI-series security droid produced by Holowan Mechanicals who was assigned to guard the home of a board member of the Sienar Fleet Systems starship production company during the reign of the Galactic Empire. While MI-726 was guarding its owner's home, a group of Alliance to Restore the Republic operatives raided the building, hoping to gain access to the schematics of TIE Series prototype starfighters produced for the Empire. As the house came under attack, MI-726 abandoned the board member and his property, going rogue and fleeing the scene. The security droid was not seen again for several years, after which it resurfaced and began attacking Imperial warehouses and factories as well as Imperial citizens. During one such attack, a security guard working at an Imperial factory encountered MI-726, who insulted the man's heritage and legitimacy before setting off an explosion that destroyed the facility but left the guard alive."}, {"tag": "p", "text": "The guard reported his encounter with the droid and claimed it was not working alone, a statement that the Imperial Office of Criminal Investigations used in a bounty posting for the droid on the Imperial Enforcement DataCore. The bounty posting offered a 100,000-credit reward for any individual holding an Imperial Peace-Keeping Certificate who could destroy the droid. The posting described MI-726 as dangerous and speculated the droid was suffering from \"deeply troubling\" glitches due to a lack of memory wipes, but it did not rule out the possibility of non-droid accomplices."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "MI-726 went rogue during an attack on its owner and then turned on those whom it had once served. The droid verbally berated at least one victim during its attacks on Imperials but did not kill the man he insulted. As well as knowledge of the Empire, the droid also had a reasonable knowledge of the Rebel Alliance. MI-726 was bipedal in stature, silver in color, and possessed a pair of large lower arms ending in three–fingered fists and a pair of smaller upper arms that ended in repeating blasters, which it used in combat, although it could also use demolitions. The droid also possessed red photoreceptors, which it could use with a degree of skill to search rooms and spot particular objects, as well as equipment that allowed it to listen. MI-726 was also equipped with silver armor, which at one stage began to rust–although this did not stop the droid from being able to move silently–and a vocabulator, with which it was capable of speaking Basic. The droid could also read and write that language."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "MI-726 was created as part of the Bounties to Die For article in the sixth issue of Wizards of the Coast's Star Wars Gamer magazine series, which were supplements for the Star Wars Roleplaying Game. The article was written by S. Mitch Ritchie and illustrated by Ramón Pérez, and it provided roleplaying attributes for MI-726 to allow for its use as an enemy or ally in the game. The article did not specify the era of play in which MI-726 was active to allow for the droid's use in multiple eras, although the Galactic Empire issued MI-726's bounty posting, so the events must take place during the Empire's existence."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}