{"url": "MK-09/Legends", "categories": ["Category:Cite web date argument usages with incorrect date formats", "Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Alliance to Restore the Republic droids", "Category:Azzameen family property", "Category:Kalibac Industries products", "Category:Masculine programming", "Category:Second-degree maintenance droids"], "nodes": [{"tag": "h1", "text": "MK-09"}, {"tag": "p", "text": "MK-09, nicknamed Emkay, was a heavily modified MK-series maintenance droid owned by the Azzameen family during the Galactic Civil War. A brash, aggressive droid with a sense for adventure, MK-09 was intensely loyal to the Azzameen family and their company Twin Suns Transport Services and considered himself a member of the family. The family droid was modified to allow him to pilot multiple types of craft, including freighters and starfighters, and operate a starship's turret gun. Emkay felt that droids were superior to organic beings; disgusted by the mistreatment of droids throughout the galaxy, he developed a dislike toward the Galactic Empire due to their callous treatment of droids and often suggested that the Azzameens join the Alliance to Restore the Republic, an organization he felt held droids in better respect."}, {"tag": "p", "text": "He originally served solely as a maintenance droid aboard Azzameen Home Base and the family's YT-2000 light freighter Otana, but was later able to put his piloting modifications to use when family head Tomaas Azzameen, owner of Twin Suns Transport Services and Alliance sympathizer, determined it time to train his youngest son Ace in the family trading business. Emkay, along with Ace's siblings Emon and Aeron, were assigned to instruct the new pilot. The droid accompanied Ace on delivery runs for the family, often encountering Viraxo Industries— an Imperial-aligned trading company and rivals to the Azzameens and their company and with whom MK-09 held great contempt."}, {"tag": "p", "text": "Following the death of Tomaas and the Imperialization of Azzameen assets after an attempted counterattack on Viraxo holdings and a failed covert delivery, the droid, along with Ace, Aeron, and Emon, sought refuge with the Alliance; Ace would eventually enlist and Emkay often visited him on his various postings aboard Alliance Star Cruisers. During these visits, the droid would track Ace's successes, maintain Ace's growing collection of souvenirs from battles, and inform Ace of upcoming family missions. The droid would again accompany Ace as he flew on these family missions, many of which were intended to assist the Rebel Alliance, albeit discreetly, as the surviving Azzameens attempted to restore their business. Emkay and the rest of the Azzameen children were betrayed by Antan Azzameen, Tomaas's brother and co-owner of Twin Suns Transport Services, after Antan forged a deal with the Empire to reclaim the family business; this trap would not be successful."}, {"tag": "p", "text": "MK-09 even assisted the Alliance directly on a number of missions. When the Alliance sought the capture of the Lambda shuttle Tydirium for use in future offensives, MK-09 flew alongside Ace in the Azzameen family's YT-1300 freighter Sabra as Ace delivered commandos to an Imperial base holding the shuttle. The droid also took part in the Alliance recapture of Azzameen Station from a mercenary group, and would even go on to serve alongside Ace—now a decorated pilot—as a gunner aboard the freighter Millennium Falcon during the pivotal Battle of Endor."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Family service"}, {"tag": "p", "text": "The Kalibac Industries MK-series maintenance droid MK-09 served the Azzameen family and their trading business, Twin Suns Transport Services, around 3 ABY; members of the family affectionately referred to the droid as Emkay. During this time, MK-09 was stationed aboard the family's YT-2000 light freighter Otana. When not aboard the Otana, the maintenance droid served on Azzameen Station monitoring shipping information, including statistics on Viraxo Industries—competitors of Twin Suns Transport Services—and maintaining the family's starships. The droid also spent time piloting craft in the family's combat simulator."}, {"tag": "p", "text": "In 3 ABY, the droid was aboard the Otana during a delivery to the Alliance to Restore the Republic's covert base on the planet Hoth, assisting family patriarch Tomaas Azzameen as Tomaas helped the Alliance's efforts in a galaxy-spanning civil war against the Galactic Empire. While making the delivery, an Imperial force led by Darth Vader entered the system and an intense battle erupted. Emkay was aboard the Otana undergoing minor updates to his systems when Tomaas and his eldest son Galin entered the ship and prepared to leave. The three escaped the invading Imperial forces with help from the Alliance and left with the first wave of Rebel evacuees. Though the Otana was damaged in the Azzameens' flight, the ship and its crew were able to return to Azzameen Station; once home, MK-09 continued his duties."}, {"tag": "h4", "text": "Training an ace"}, {"tag": "p", "text": "Following the Otana's escape at Hoth, Tomaas determined it was time to train his youngest son, Ace, how to fly for the family company. To assist Ace's tutelage, his father enlisted the help of two of Ace's siblings, Aeron and Emon, and assigned MK-09 to serve Ace directly. Ace's sister Aeron e-mailed Emkay after the droid's reassignment and told the droid he was to accompany Ace on any family missions. She also sent him data on Azzameen trade routes, starship identification material, and information on the family's modified Corellian freighters—including combat tactics and turret instructions for use aboard the ships—to prepare MK-09 for his new position. Being assigned to Ace, MK-09 displayed family mission details through his onboard holoprojector and briefed the new pilot on said missions."}, {"tag": "p", "text": "Emkay met Ace inside the cockpit of the family's YT-1300 light freighter Sabra in the hangar of Azzameen Station for Ace's first spaceflight. Aeron, in the Sabra's identical twin ship Selu, accompanied Ace and the freighters made their way to pick up a pair of cargo canisters en route to Harlequin Station. Ace piloted the craft and engaged its hyperdrive, launching both him and MK-09 into their first trip through hyperspace. Arriving at Harlequin Station, Emkay observed as Ace dropped off their cargo before retrieving the return package. However, the arrival of two Viraxo-allied Pursuer-class enforcement ships, the Enkidu and Gilgam, interrupted the training exercise. Harlequin Station, defenseless against the Viraxo raiders after the departure of its protection craft Kouerd, called upon the Azzameens for protection. Excited at the prospect of battle, MK-09 urged Ace to intercede on the station's behalf. Eventually, the two invaders were chased off; Harlequin Station was grateful, but animosity between the Azzameens and the Viraxo was beginning to build."}, {"tag": "p", "text": "For the next training mission, Ace would be led by his brother Emon through a series of targets for turret practice. With Ace in the laser cannon turret of the Sabra, MK-09 piloted alongside Emon's Firespray-31-class starship Andrasta. However, Emon instructed the droid not to fire the Sabra's forward lasers, as it was a training exercise for Ace, not MK-09; this disappointed the droid. As Ace practiced, MK-09 adapted his piloting to Ace's shooting. Emon concluded the lesson with a trip to the resort station of Dunari's Rest to celebrate. There, the Azzameens again encountered Viraxo presence in the form of the Enkidu and two Razor-class starfighters. Emon moved to engage the Enkidu, leaving Ace and Emkay to fight the starfighters. As Ace destroyed one with the Sabra's turret, MK-09 rammed the other, obliterating it without the Sabra sustaining damage. Following the dogfight, the Azzameens fled the system at the casino's request."}, {"tag": "h4", "text": "Viraxo entanglements"}, {"tag": "p", "text": "MK-09 flew his next mission with Ace when Aeron requested Ace's help after she accidentally deleted data on three areas in the family's secret cargo fields. In order to rebuild the missing data, the cargo containers located in the fields needed to be visited and inspected manually. Co-piloting the Sabra with Ace at the helm and Aeron flying the Selu offering advice, the droid helped instruct the young Azzameen on inspecting the containers. Due to his programming, MK-09 stayed silent after Ace chose a less-efficient pattern to scan the containers in the first area; instead, the droid focused on scanning the sector for any intruding forces."}, {"tag": "p", "text": "In the second field, his scanning identified the cargo ferry Raider attempting to steal one of the Azzameens' pressure tanks. After a brief skirmish that saw the destruction of the Raider, Ace, Aeron, and Emkay finished their scan and moved to the third area, where more interlopers were discovered. Again, the Enkidu and a pair of Razor-class fighters were interfering in Azzameen affairs; upon their identification, Emkay moved to the Sabra's turret and disabled one of the Razors, forcing it to crash into a container. The Enkidu, perched atop a Class-L cargo container, exited the system after the Selu approached. With the area clear, scanning resumed, eventually resulting in MK-09's discovery of contraband spice planted in the container that the Enkidu accessed. Realizing this was an effort to sabotage the Azzameens and their company, MK-09 remarked that the containers in the affected fields would have to be moved. At Emkay's suggestion, Aeron took the affected container back to Azzameen Station to allow the family to decide what to do with it and with the escalating conflict with the Viraxo."}, {"tag": "p", "text": "Eventually, Antan Azzameen, brother of Tomaas and co-owner of Twin Suns Transport Services, was informed of the recent troubles with the Viraxo and the attempted sabotage. Now in charge of the company while Tomaas and Galin were out on business, he reprimanded his brother's children for provoking the Viraxo. Still, Antan devised a plan to serve some retribution to the family's rivals by using the same illegal spice used in the sabotage attempt. Aeron was to deliver the spice to the Viraxo orbital station Viraxo 54 in a disguised Selu—now the Venix thanks to false transponder codes—and Ace, Emkay, and Emon were to subsequently cause a disturbance to attract Imperial attention; Antan hoped that the discovery of the spice Aeron left in Viraxo space would cause the rival company to fall out of favor with the Empire, effectively crippling the Viraxo. Ace, again flying the Sabra with MK-09 as copilot, and Emon, flying the Andrasta, exited Azzameen Station and flew to the Viraxo facility. The Selu and Andrasta entered the system and engaged the Razor-class starfighters emerging from the base; in the fight, MK-09 manned the turret gun on the Sabra. From his dorsal vantage point, Emkay witnessed the Andrasta engage the Enkidu to the latter ship's destruction."}, {"tag": "p", "text": "However, the plan failed as Aeron's brothers had entered the system too early. During the following argument, the droid attempted to calm the quarreling siblings to no avail. Aeron attempted to bluff her way to the planned exit vector, but the station disabled her masquerading YT-1300 and stranded the young Human female. While Emon moved his ship to retrieve her, Emkay continued firing at the Viraxo starfighters to protect Ace's flank. Emon left the system after picking up Aeron; the Sabra was forced to destroy the abandoned Selu before leaving the system to avoid Imperial identification."}, {"tag": "h4", "text": "The fall of the family"}, {"tag": "p", "text": "Once Tomaas returned from his trip, he was shocked that Antan would use his children to exact such revenge against Viraxo Industries rather than approach a diplomatic solution. In spite of this, his father recognized Ace's piloting abilities as well as MK-09's role in training. Because of Ace's skills, Tomaas enlisted him and MK-09, along with Aeron and Emon, to fly cover for the Twin Suns Transport Services' GR-75 medium transport Vasudra on a mission to collect a black market shipment of the healing substance bacta for the Alliance from a pirate group. The Azzameen flight group was escorted to the meeting grounds by the SCT Scout craft Ravenno; the Vasudra docked with the waiting Xiytiar-class transport End Run and the bacta transfer began."}, {"tag": "p", "text": "Azzameen suspicions rose as problems with the pumps were reported and technicians from the End Run were dispatched. Their suspicions were confirmed as the technicians made their way to the Vasudra's engines, intending to cripple the transport; as the family realized this, a DP20 gunship, the Loose Cannon, and its CloakShape fighter escort entered the system and engaged Azzameen forces. Ace, in the Sabra, was told to engage the technicians; Emkay, not receiving targeting commands, targeted and engaged the attacking CloakShape starfighters. After the Azzameens defeated the pirate craft, the End Run surrendered and transferred the remainder of its bacta cargo. The pirates then escaped at Tomaas's insistence, much to both Emon and MK-09's chagrin."}, {"tag": "p", "text": "When it was time to deliver some of the procured bacta, Tomaas called upon Ace and Emkay to fly as escorts for the Vasudra in the Otana—the Azzameen ship the droid most wanted to pilot— and the craft flew to the Alliance outpost Hospital. However, shortly after the family's arrival, the Imperial II-class Star Destroyer Corrupter entered the system; now under Alliance scrutiny due to the timing, the Azzameen escort ships were nevertheless called to assist Alliance starfighters to defend both the outpost and the Vasudra, now attempting to offload its bacta cargo. Emkay assisted Ace in the Otana by monitoring communications and targeting enemies. Though a majority of their personnel escaped, the Rebellion lost the battle; Hospital was destroyed, and the Otana fled the system. The Vasudra, disabled in the battle, did not return to Azzameen Station; Tomaas and Galin, both still aboard the ship, were considered lost."}, {"tag": "p", "text": "Shortly after, warrants for the Azzameen family were issued due both to their assistance at Hospital and their interference at Viraxo 54, and the family made preparations to flee their holdings. While not one of the members of the family listed in the warrant, MK-09 considered himself to be among them. Ace and Emkay, in the Otana, accompanied Aeron in the Selu to retrieve property from the family company's main base of operations, Twin Suns Station. As Ace piloted the Otana to retrieve a container of warheads intended for the Alliance, his droid copilot scanned the sector and was the first to announce the arrival of a joint Imperial and Viraxo strike force. Comprised of the Imperial Victory II-class Star Destroyer Furious, the Viraxo CR90 corvette Blast Radius, and miscellaneous escorts and shuttles, this fleet approached Twin Suns Station, intending to capture the base. The Otana, warheads in tow, held off the attackers long enough for Aeron to empty the family's safe aboard the station; their mission a success, the two freighters exited the system as the station was disabled."}, {"tag": "p", "text": "The Otana and Sabra returned to Azzameen Station. Upon arrival, Ace assessed the warhead container and found that it escaped the battle without damage. Emkay suggested a more prudent approach to the battle, which earned the droid the disabling of his communication circuits—both internal and external. The pilots of two Corellian freighters met with Emon, who had been patrolling the sector. He reported that their uncle Antan, who had just flown with Emon to one of the Azzameen's cargo facilities, had been captured after an ambush by Viraxo forces. Without Antan, the Azzameen children had no plan. Emkay, still silent due to his disabled circuits, was thankful for the sudden arrival of Admiral Garreth Holtz in the Corrupter, as he realized it kept the children from formulating a plan, as the past several had failed. With the Star Destroyer ordering the Azzameens' surrender, Aeron quickly suggested that the Azzameens seek asylum with the Alliance to Restore the Republic, hopeful that the word of family friend and Alliance pilot Olin Garn would assuage any possible suspicion from the botched bacta delivery; at some point, MK-09's communication circuits were restored, and he agreed, loading the coordinates provided into the Otana's navicomputer. Their exit vector took them through the path of the Imperial force; MK-09's communication circuits were again disabled after he called out the opposing ships. Eventually the Azzameens made their way into Alliance space in the Outer Rim Territories and approached the cruiser Defiance."}, {"tag": "h3", "text": "Aiding a rebellion"}, {"tag": "p", "text": "As suspected, Olin Garn's word allowed the Azzameens clearance to come aboard the Mon Calamari MC80 Star Cruiser. Ace made contact with Rebel trainers once aboard and enlisted in the Alliance naval forces. As Ace's siblings worked on reestablishing the family's affairs, Emkay would pilot the Otana when called to do so. Though MK-09 could not accompany Ace when the Azzameen boy joined the Rebellion—disappointing the droid—the droid would often visit Ace as he trained and would offer tips on the trials in the Alliance's proving grounds and track the new recruit's kills. MK-09 also continued to monitor Ace's growing collection of souvenirs, stored aboard one of the family's Corellian freighters. When visiting the Defiance, MK-09 would situate himself in the concourse to alert Ace to e-mails received and inform him if the family needed the Alliance pilot."}, {"tag": "h4", "text": "Family business"}, {"tag": "p", "text": "One such family brief came shortly after Ace's starfighter career began. After receiving word on the captured Antan's location from an Azzameen mole located aboard the Viraxo XQ5 Platform Viraxo Industries, Emon sent MK-09, piloting the Otana, back to the Defiance to collect Ace for a mission to rescue Antan. After the Otana rendezvoused with Emon's Andrasta, the two craft left for the platform. At Ace's command, MK-09 entered the Otana's turret and prepared to protect the YT-2000 against starfighter attacks, though the two intended to make their way to the platform without incident. However, multiple Planetary Defender starfighters intercepted both Azzameen craft, forcing the Andrasta to engage and protect the Otana."}, {"tag": "p", "text": "Once docked with Viraxo Industries, Emkay disembarked the Otana to retrieve Antan from his cell. The droid made his way through the facility, disabling security systems and eventually freeing the captive Azzameen. Once the two exited the platform and reunited with the waiting Ace, the Otana was forced to flee as a Star Destroyer entered the system. Eventually, after transferring Antan to the Andrasta, Emkay dropped Ace off at the Defiance and piloted the Otana back to the other Azzameens."}, {"tag": "p", "text": "Emkay would again pilot the Otana to retrieve Ace, now a flight officer, from the Defiance for another family mission, this time assigned by Aeron. The two would be retrieving a damaged Viper probe droid in the Saila Na system, which she suggested would prove useful in tracking Viraxo movements. Shortly after exiting hyperspace close to the probe droid pod, the Muurian transport Pelican and its escort of R-41 Starchasers entered the system with seemingly the same mission goals. The incoming starfighters intercepted the Otana and the Pelican approached and captured the probe droid. Emkay, controlling the Otana's turrets, engaged the Starchasers as Ace concentrated on destroying the transport and collecting the probe."}, {"tag": "p", "text": "With the probe retrieved, Ace and Emkay moved on to the second phase of the plan: passing through the civilian customs checkpoint Tinoon Station. While Emkay initially feared that passing the checkpoint would be the most challenging part of Aeron's plan, a pirate force consisting of Y-wings and a pair of Marauder-class corvettes entered the sector and engaged both the Otana and the station. Due to either the pressing odds, importance of the mission, or the lack of necessity in protecting the customs station, Emkay acted somewhat against his typical nature, as he suggested more than once that they fly through the screen and into hyperspace, avoiding any sort of combat entirely. However, the suggestions were ignored and Emkay was dispatched to the turret to destroy offending starfighters and incoming warheads. Once the fight ended, Tinoon Station thanked the crew of the Otana for their support in the battle and allowed them to pass the checkpoint without incident or inspection. Leaving Tinoon Station, the Otana and the probe droid pod successfully rendezvoused with Aeron, who was waiting aboard the Sabra in an asteroid field. After the exchange, the Otana returned to the Defiance."}, {"tag": "h4", "text": "Aboard the Liberty"}, {"tag": "p", "text": "MK-09 continued to visit Ace after the latter's transfer to the Alliance Star Cruiser Liberty due to the flight officer's outstanding mission performance. Some time after the transfer, Emon sent Emkay to the Liberty in the Otana to retrieve Ace for a family mission. Emon relayed that Antan had discovered that K'Armyn Viraxo, head of Viraxo Industries, would be traveling in his personal luxury yacht Highroller. Antan saw this as a ripe opportunity for vengeance against the Viraxo for their role in the Imperialization of Azzameen assets and the deaths of Tomaas and Galin."}, {"tag": "p", "text": "By now, the thrill of piloting the Otana had waned for Emkay, and he began to resent his job of shuttling Ace to various missions—though the droid was still fond of flying as copilot in battle. Nevertheless, he complied and the Otana set off to rendezvous with Emon's Andrasta. Once reunited, the two craft made their way to Destreg Spaceport in orbit around the planet Destreg II, where Antan believe the Highroller would be passing through. Indeed, shortly after the brothers' arrival, the yacht, along with an escort of R-41 Starchasers, entered the system. The fighters turned to engage an oncoming Otana, but, rather than fight them, Ace piloted the craft through the fighter screen; Emkay, expecting a fight, was impressed with the Alliance pilot's tactics. When the Otana reached the Highroller, MK-09 performed a scan for lifeforms but found none aboard the craft. Though disappointed and frustrated, Ace nevertheless destroyed the vessel and engaged the incoming R-41 fighters."}, {"tag": "p", "text": "Displeased with the exchange of fire, the spaceport called Imperial authorities and demanded the Azzameens' departure. However, before they could leave, a small collection of bounty hunters flying Muurian transports and Z-95 Headhunters entered the system to collect on the Viraxo bounty on the Azzameen brothers. Ace, Emon, and MK-09 successfully defeated this bounty hunter force and returned to the Liberty. Afterward, Ace and MK-09 received word from Antan, who apologized for his misinformation and for sending them into the bounty hunter trap."}, {"tag": "h4", "text": "Alliance suppliers"}, {"tag": "p", "text": "Following their campaign to track and destroy the TIE Experimental Project and its production facility, the Alliance was in desperate need of warheads and began looking towards external and unorthodox methods to obtain the ordnance. Aeron, noting this as an opportunity to simultaneously help the Rebel Alliance and hurt Viraxo Industries, discovered a cache of warheads stored in containers at the Viraxo storage platform 1; with Antan's permission and a collection of transports from their company, she formed a plan to steal the containers and sell them to the Alliance."}, {"tag": "p", "text": "MK-09 and Aeron traveled to the Liberty, this time flying the Sabra, and collected Ace for the mission to covertly inspect the containers. As Emkay noted, the Azzameens were not adept at clandestine maneuvers, and the covert operation was unsuccessful; Viraxo Razor-class fighters attacked the Sabra, and Ace was forced to rapidly scan the containers while under attack. With Aeron in the turret of the Sabra, MK-09 relayed information to Ace in the cockpit, and offered to control the turret in Aeron's stead when Ace's patience with the droid began to wear thin. With the scanning of the containers complete, the Sabra was free to fully engage the enemy starfighters and Gun Emplacements around the facility as the Magnum Group transports entered the system."}, {"tag": "p", "text": "Before the warhead transfers were complete, though, the intended recipients of the weapons entered the system. While MK-09 was unable to determine their origin, Aeron noted that the newcomers—the bulk freighter XTS-673 and a complement of Supa Fighters— were part of the criminal organization Black Sun. Aeron also realized that the arrival of the Black Sun flight group indicated that the Azzameens had again fallen into a trap. The Sabra moved to intercept the bulk freighter and the fighters; due to Ace's distraction, Magnum group was able to complete the transfer and return safely to the Rebel rendezvous point, and the Sabra followed shortly thereafter. Both Ace and Aeron received the Alliance Civilian Battle Award for their independent civilian actions in securing the arms and assisting the Rebellion; Ace would pin his upon Emkay when the droid was aboard the Liberty."}, {"tag": "p", "text": "During Ace's continuing tour, his squadron was called upon to investigate an Imperial sensor station and research facility located near Kuat. Antan heard of the attack on the sensor station—an Alliance success—and decided to use the confusion sown and decrease in protection to install a listening device on one of the satellites damaged by the battle. Aeron took MK-09 along in the Sabra to again meet her brother Ace aboard the Liberty, and the trio left for Kuati space. Ace and Emkay dispatched the protecting forces, consisting of the Beta-class escort transport Minelayer and an accompaniment of Alpha-class Xg-1 Star Wings, and began searching for a location for the listening device. Once a suitable satellite was found, Aeron disembarked from the freighter and began attaching the device. The Sabra was forced to protect the vulnerable Azzameen as the Gamma-class assault shuttle Omicron entered the system and deployed squads of Zero-G spacetroopers; after defeating these invaders and collecting Aeron, the group left the system. Emkay and Aeron dropped Ace off at the Liberty before departing in the Sabra."}, {"tag": "p", "text": "Some time later, Aeron once again noted an opportunity to assist the Rebellion, harm the Viraxo, and make a few credits in the process. She planned to attack and raid Viraxo Industries platform VXO-33274, stealing vital supplies, and then transport them to Vergesso Base to assist the struggling Rebel presence. Taking MK-09 along in the Otana, Aeron collected Ace from the Liberty and the Azzameen trio traveled to the repair yards of Bilbringi V, where they were to rendezvous with a motley group of freighters commanded by former employees of Twin Suns Transport Services. Following the meeting, the Otana escorted these freighters through hyperspace to VXO-33274, where the ship encountered a small Black Sun force of Supa Fighters and the IPV-1 System Patrol Craft Scylla protecting the platform. With assistance from a hired squadron of Toscan 8-Q starfighters, Ace eliminated the patrol craft from a turret aboard the Otana as MK-09 piloted the ship. While the Azzameen-allied craft attempted to dispatch the remaining Supa Fighters protecting the base, Juno group and Lara group entered the system and began making off with containers surrounding platform VXO-33274."}, {"tag": "p", "text": "Before they could escape to the Vergesso Asteroids, though, a larger Black Sun force, consisting of the Marauder-class corvette Charybdis and a complement of Razor-class and Supa starfighters, appeared. With Ace back in the pilot's seat of the Otana, he and Emkay concentrated their attention on the Razor-class starfighters, destroying all twelve between the two of them. After the elimination of all Black Sun forces in the area, Juno Group and Lara Group completed their collection assignment and made the jump to Vergesso Base; the Otana followed, as Aeron needed to be delivered to the asteroid base as well. After a brief skirmish with a number of Supa fighters, Aeron successfully disembarked and the Otana returned to the Liberty."}, {"tag": "h4", "text": "Darker times for the family"}, {"tag": "p", "text": "Shortly after the Azzameen equipment transfer at Vergesso Base, a large fleet of Star Destroyers and support craft, including the massive Super Star Destroyer Executor, attacked the rebel base. Aeron, still aboard the asteroid base, frantically contacted Emkay and informed her of her plight. The droid, sitting aboard the Otana, then alerted and retrieved Ace and the two set out for the asteroid base, reusing the course utilized in the ship's recent trip."}, {"tag": "p", "text": "Due to the presence of the immense battlecruisers, the Otana had exited hyperspace much further from the asteroid base than anticipated; this distance forced the pair to navigate through the capital ship screen in order to reach Aeron. Barely escaping attacks from the Imperial forces, Ace finally piloted the Otana to a close enough proximity to receive Aeron's panicked signal from aboard the doomed asteroid. As Ace piloted, Emkay took to the freighter's turret, protecting the Otana from incoming attacks. MK-09 managed to score several kills, though they, as usual, would be attributed to Ace. Eventually, the Otana reached the damaged but as-of-then intact base and docked with the north tower airlock; MK-09 left the transport, sought out Aeron, retrieved her, and directed her back to the ship. Once the two were aboard with Ace, the Otana fled the doomed station en route to the exit vector—again located beyond the Star Destroyers. Once clear of the Executor, Ace engaged the hyperdrive and the Azzameen trio escaped. Safely in hyperspace, Aeron congratulated her brother and playfully insulted MK-09 as the Otana returned to the Liberty."}, {"tag": "p", "text": "MK-09, having been out of the action for some time and longing to rejoin the fray, would later be contacted by Dunari, a longtime friend of Tomaas Azzameen. After picking Ace up from the Liberty, the droid relayed the message; solemnly, Dunari stated that Ace's brother Emon had been captured and was held in Quesna Base under Imperial charges. Following Dunari's plan, Ace and Emkay, flying the Otana, anonymously transported a bomb, stolen from an Imperial stockyard and disguised as a Tibanna gas container, which would detonate when approaching the station. With the station distracted by the chaos of the explosion, Dunari's Muurian transport Deadman's Hand docked with Quesna Base and Dunari made his way through the station to rescue Emon. Ace turned turret controls over to Emkay as the former protected the Deadman's Hand. As Ace took on the IPV-1 System Patrol Craft Hammer, the droid scored three kills against the attacking TIE/LN fighters. With the station's defenses extinguished, Dunari left Quesna Base with Emon aboard his transport, and departed the station completely undamaged. The two ships parted ways, Ace and Emkay returning to the Liberty and Dunari taking the beaten and injured Emon to his casino. Unfortunately for Dunari and Emon, an Imperial counterattack would force the evacuation of Dunari's Rest; Ace's squadron was called in to protect the craft leaving the doomed casino. Emkay was unable to assist in this battle, as Ace utilized his one-man Alliance fighter, but did assist in cleanup at the Azzameen outpost, where Dunari's men briefly stayed following the evacuation."}, {"tag": "h3", "text": "The Azzameens strike back"}, {"tag": "p", "text": "Emkay was contacted by Aeron shortly after the battle at Dunari's Rest after she determined that recovering files from the family's discarded datacore would assist in tracking the leak of information on family activities. After retrieving Ace in the Otana, the two met with a recovered Emon en route to Junkyard Control, a scrapyard near Tolig IV, where Aeron had tracked the datacore. After Ace identified the datacore among the refuse, Emkay left the Otana through the dorsal airlock and made his way through the short expanse of space to the junk container holding the datacore. Shortly after his exit, however, a group of T-wing interceptors entered the system and made their way to the Azzameens. Emon and Ace defended MK-09, still slicing the datacore to find the necessary files through the hail of lasers and spacecraft."}, {"tag": "p", "text": "His download complete, MK-09 detached from the container before locating Ace; realizing that the Otana was still occupied in its dogfight, Emkay began sailing into open space, sending out calls for assistance all the while. Eventually, with the fighters destroyed, Ace piloted the Otana toward the prone droid. Much to Emon's amusement and MK-09's dismay, the Otana sped towards the latter at full speed, only slowing the craft moments from impact to allow MK-09 to board. The pair of Azzameen craft exited the system, their mission a success, and Ace returned to the Liberty as Emon took the data with him to be analyzed."}, {"tag": "h4", "text": "Assistance to the Alliance"}, {"tag": "p", "text": "Emkay would begin helping the Rebellion directly soon after. A mercenary group had been constantly harassing Alliance endeavors in several systems, so the Alliance entrusted Ace, Aeron, and Emkay with locating the mercenary headquarters. The trio left in the Otana, planning to board the bulk cruiser Redhawk—known to have ties to the mercenary group and currently docked with the XQ5 Platform Cargo Station—and obtain the flight logs within its central computer in order to locate the base. This plan worked without much hassle, though an escort of Preybird-class starfighters entered the system and began attacking the docked light freighter. MK-09 expressed a desire to enter one of the turrets to fend off this threat but was unable to as he was downloading data from the bulk freighter; instead, Ace took to the turrets to repel the attacking mercenaries."}, {"tag": "p", "text": "Once Aeron had completed the download and reboarded the ship, the sliced coordinates were entered into the Otana's navigation computer and the trio set off. Unfortunately for the Azzameens, the flight log had altered, as noted by Emkay; rather than a mercenary base, the Azzameens found themselves in the midst of a collection of Star Destroyers firing their turbolasers. MK-09's sensors indicated that the YT-2000 had entered the Carida Training Facility instead of their intended destination. Ordered to stand down, the Imperial Star Destroyers continued their bombardment of the target—now including the Otana—forcing Ace into a series of evasive maneuvers to give Emkay time to create a new exit vector. In addition to finding an escape route, MK-09 managed to identify the five Star Destroyers. Once complete, Ace ignored the Imperial order to stop and instead made haste towards this exit, located behind the wall of Star Destroyers."}, {"tag": "p", "text": "After evading the turbolaser fire and fighter patrols sent to capture the Otana, the Azzameens finally exited the Carida system and returned to the XQ5 Platform where the Redhawk was stationed only minutes before. The bulk cruiser, however, was absent upon the Otana's re-arrival, as it had left the station towards the mercenary base. Aeron decided to check through the flight logs aboard the platform, leaving Ace in the gunnery station and Emkay managing the download. With the information on the Redhawk's whereabouts collected and input into the navicomputer, the Otana left, avoiding station defenses, and entered hyperspace. Upon arrival at these new coordinates the trio was stunned to find that the mercenary base holding the Hurrim mercenaries was none other than their own former home, Azzameen Station. The station had been renamed \"Falcon's Nest\" and a scattered assortment of craft and static defenses now occupied the sector; Ace flew the Otana close enough to inspect the station, prompting several mercenary fighters to engage the freighter. Though Ace immediately attempted to engage this offensive presence—feelings shared by Emkay—Aeron simply wanted to return to the Liberty and inform the Rebellion so that a proper counterattack could commence. Ace agreed with Aeron's suggestion and the trio returned to the Liberty."}, {"tag": "h4", "text": "Returning home"}, {"tag": "p", "text": "The Alliance counterattack came soon after the return of the Otana. Due to the family's familiarity with the station, Emon and Aeron were called in to assist with the Alliance attack. MK-09 would operate the ventral turret on the Otana, though the ship would be piloted by Aeron; Emkay's normal flying partner, Ace, would be instead flying a B-wing starfighter with his Alliance squadron. Together with Emon in the Andrasta, the strike team left the Liberty and made the jump back to the mercenary base. Once there, Aeron spotted uncle Antan's Action VI transport and pointed it out to the other Azzameens, though the ship fled before it could be hailed."}, {"tag": "p", "text": "Once the fighter squadrons diverged on the invaders, Aeron and Emkay targeted the incoming Preybird-class fighters and kept them occupied as the Alliance force moved to eliminate the station's defenses and disable the Falcon's Nest itself. With the main defenses destroyed, Storm Unit, the assault transport responsible for transporting the strike team intended to capture the base, approached the hangar; the arrival of the Marauder-class corvette Plague, along with its accompanying squadrons of IRD starfighters, forced the Otana, as well as the rest of the fighters in the Alliance force, to engage the corvette and protect the transport. Storm Unit successfully entered the base as the Redhawk exploded from the Rebel attack. After clearing the base of mercenaries, however, the strike force found the station filled with bombs set to explode within around three minutes."}, {"tag": "p", "text": "Aeron instructed Emkay to dock with the station. Once landed, Aeron made her way to the commandos and aided in diffusing the bomb. Skipray Blastboats entered the sector during the boarding operation; Emkay took to the immobile Otana's turret to protect the transport from the newcomers, allowing enough time for Aeron to successfully disarm the bombs. After the battle, the former Falcon's Nest was returned to the Azzameen family as thanks for their outstanding service as well as assistance in recovering the base."}, {"tag": "p", "text": "MK-09 would once again join in an Alliance task soon after the recapture of Azzameen Station. This time, the droid accompanied Ace, secretly transporting a strike team in the Sabra, to secure the Lambda-class T-4a shuttle Tydirium and Imperial codes contained within the vessel for use in future Alliance missions. MK-09 managed communications with Imperial officers as the Sabra made its way through a customs checkpoint en route to Zhar; this allowed Ace to concentrate on his piloting, as a passing patrol could identify the Sabra's mission. MK-09, successfully bluffing his way through the conversation, was granted the coordinates for the outpost where the Tydirium was docked and the Sabra left for Zhar."}, {"tag": "p", "text": "Emkay continued to managed communications upon arrival at the outpost. Ace safely docked inside the station and Emkay left the line open as the commandos made their way toward the Tydirium. Once again, Emkay managed to stall the probing Imperial officer long enough for the commandos to finish their mission. However, though the officer may not have realized the real reason for the delay, he did determine it was worth looking into. Ace didn't give the Imperials a chance as he left the hangar, TIE fighters in pursuit. As the Tydirium exited the station undetected, the Sabra hailed Rogue Squadron, which entered the system and engaged the Imperial starfighters. Once the hijacked shuttle made the jump to lightspeed, the Sabra and the Rogues broke their dogfight and exited Zhar space. Following the completion of the mission, MK-09 noted that the Sabra had taken several hits in the battle; the maintenance droid lamented that he would have to repair this extensive damage."}, {"tag": "h4", "text": "A fateful reunion"}, {"tag": "p", "text": "Shortly after the Alliance to Restore the Republic began amassing their fleet in the Sullust system in preparation for a major offensive against the Empire, Antan Azzameen called the Azzameen children to an urgent meeting. MK-09 accompanied Ace and Aeron aboard the Otana, and arrived at Azzameen Station, where Antan's Big Score and Emon awaited them. The Azzameen children and MK-09 immediately demanded answers about Antan's presence in the battle to retake the station, though the overly chatty MK-09 was later switched off at the insistence of short-tempered Emon. The droid remained off for the duration of the conversation; Antan explained that he was working with the Empire in order to restore Twin Suns Transport Services and negotiate the release of Tomaas and Galin, whom Antan revealed were alive, though imprisoned in Kessel Station. Antan insisted that the Azzameen children depart for the Kessel system at once as he had organized the captured Azzameens' release. Upon reactivation, Emkay questioned what he had missed; the Azzameens did not immediately respond, but the droid learned of the mission and was ecstatic at the prospect of rescuing the lost Azzameens."}, {"tag": "p", "text": "The Otana, Andrasta, and Big Score exited hyperspace near Kessel and the Otana docked with the station. Aeron began to slice through the prison records to find Tomaas and Galin, but was unable to find any record of either Azzameen. Building fears for the Azzameen children were soon realized; the Imperial II-class Star Destroyer Devastator arrived and demanded the surrender of the Otana and Andrasta while thanking Antan for his betrayal of the rogue Azzameens. As the Big Score left, MK-09 was tasked with finding a new exit vector, as the Star Destroyer had successfully managed to block the previously calculated coordinates. The task was made much more difficult due to the close presence of the Maw, a multitude of black holes which made quick hyperspace calculations all but impossible. It was only the timely arrival of the Deadman's Hand and Dunari that allowed the Otana to escape; Dunari provided the Azzameen ships coordinates to exit the Kessel system and reach the relative safety of an Imperial asteroid ore processing plant. As Ace sped towards a new exit vector, Emkay took to the turret to keep pursuing TIE/ad starfighters from attacking the ship. Eventually, the Otana, Andrasta, and Deadman's Hand escaped Kessel space and returned to the Liberty."}, {"tag": "h4", "text": "Aboard the Millennium Falcon"}, {"tag": "p", "text": "There was little time to recover from the shock of Antan's betrayal as the Alliance had finished preparations for their full-scale assault on a new Imperial Death Star battlestation under construction in the Endor system. Ace was assigned to the Millennium Falcon, a YT-1300 light freighter owned by Alliance General Han Solo, to be used in the assault on the vulnerable superweapon. Ace later invited MK-09 to serve alongside him aboard the freighter; MK-09, thankful and excited for the chance to destroy a Death Star, agreed. The Millennium Falcon, piloted by Alliance General Lando Calrissian, entered hyperspace with the rest of the Alliance fleet close behind. Upon arrival, MK-09 noted the impressive size of the Imperial battlestation as the Falcon and the rest of the rebel fleet closed upon the Death Star."}, {"tag": "p", "text": "However, the ground mission to destroy the planetary shield generator protecting the second Death Star on the Forest Moon of Endor had been delayed; Lando, sensing that the shield was still raised, called all craft to break their attack as waves of TIE fighters approached the Rebel starfighters. MK-09 took to the Falcon's ventral turret gun, assisting fellow turret operator Airen Cracken, to destroy the incoming starfighters. As Calrissian ordered the Alliance fleet to engage the Star Destroyers blockading the system's exit, the droid continued to work the turret gun, assisting in the destruction of the Super Star Destroyer Executor and Imperial Star Destroyer Vehement. With the shield protecting the station disabled, the Falcon entered the superstructure and destroyed the Death Star's reactor core; this led to the destruction of the station entirely and a victory for the Alliance. Following the battle, MK-09 would continue to visit Ace, now assigned to the Star Cruiser Independence, as his former home, the Liberty, was destroyed by the second Death Star's superlaser during the Battle of Endor. Some time later, MK-09 would compile an account of Ace's experiences with the Rebellion and the saga of the Azzameen family."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "MK-09 was a heavily-modified Kalibac Industries MK-series maintenance droid. Like other droids in the series, Emkay possessed a single red photoreceptor mounted on the front of his head. A telescoping neck joint allowed the droid to swivel, raise, and lower his head. Located in Emkay's torso was a holoprojector capable of displaying mission briefs and graphic representations of objectives. A pair of tracks mounted to the lower portion of the droid's chassis allowed locomotion. When in space, MK-09 could maneuver without the assistance of an external source; this allowed the droid to accomplish space-based missions, like the recovery of the Azzameen family datacore."}, {"tag": "p", "text": "As a second-degree maintenance droid, Emkay was utilized to repair vessels such as the family's YT-series freighters following missions. His knowledge also applied to in-flight jobs; for example, he knew how to correctly reattach a YT-1300's thrust vector magnets. Emkay could also use his programming to analyze situations and come to conclusions. Similarly, the droid was often tasked with calculations, including plotting safe and accurate routes through hyperspace. He was capable of simultaneous route calculation and ship identification. MK-09 possessed a communication system with both internal and external components as well as a memory bank capable of storing holofilms and experiences. An internal oil-based lubrication system ensured the proper functioning of his components. Emkay had an extensive suite of scanning equipment, including sensors for detecting life aboard starships and ship identification sensors."}, {"tag": "p", "text": "His owners, the Azzameens, heavily modified the droid to serve an expanded role in family affairs. MK-09 was capable of piloting various starships—mainly freighters and transports, though the droid could also pilot one-man starfighters—due to both internal and external modifications. When Tomaas Azzameen felt it time to teach his youngest son, Ace, Emkay was further upgraded; upon Ace's first training mission, Aeron provided the droid with instructions for operating a turret gun. Emkay used these upgrades to protect craft flown by the new pilot."}, {"tag": "h3", "text": "Personality"}, {"tag": "p", "text": "Emkay was a brash, headstrong droid with masculine programming. While copiloting with Ace, the droid frequently looked to engage in dogfights. He also expressed a great deal of enjoyment when in battle; this enthusiasm caused those familiar with the droid to often suggest toning down his aggression circuits. Even with the aggression shown towards enemies, MK-09 showed kindness and understanding to those near him. MK-09's behavioral processor did not possess an embarrassment program, but was capable of feeling pride, both at his own actions and the actions of those close to him. The droid was disappointed at being unable to join the Rebellion officially, and often suggested that enlisting MK-series maintenance droids would greatly benefit the Rebellion's efforts."}, {"tag": "p", "text": "Though he endeared his biological owners, MK-09 preferred his status as a droid and commented on this matter several times, both to Ace in an email and in his recounting of Ace's adventures. He felt that droids in general were unfairly treated throughout the galaxy, and kept notes in a personal \"Droid Abuse\" diary. In one situation, Emkay expressed his extreme displeasure at an Alliance training mission where the goal of the exercise was the perilous rescue of an R2-series astromech droid stranded in an asteroid processing plant. Though disgusted by the treatment of other droids, Emkay considered his droid model—the MK-series— to be superior to other models, including astromech droids."}, {"tag": "p", "text": "MK-09 felt that he personally was not given the credit he deserved for his efforts assisting Ace and the other Azzameens on various missions, and often attributed failures by members of the Azzameen family to their organic nature, stating that a droid could have performed the task with better success. Even so, MK-09 was programmed to be strongly loyal to his owners; this included not only the family but the family's holdings. On more than one occasion, Emkay acted as a mediator between his owner's children. However, these attempts were often rebutted back at the droid and met with failure. The droid also attempted to liven grave situations with a witty statement or question; more than once this was also met with friendly hostility, such as the disabling of his communication circuits."}, {"tag": "p", "text": "While under the care of Ace Azzameen, MK-09 would inform Ace of different missions and assignments available to him. He also managed Ace's e-mail service—which he occasionally snooped in (though with good intentions)—as well as notifying Ace of different trinkets and medals Ace received in his adventures. MK-09 regarded normal affairs, such as deliveries and cargo inspections, as mundane and boring. Indeed, he began to resent piloting the Otana—his favorite ship in the Azzameen fleet—when acting as a shuttle for Ace. However, he still performed his duties with accuracy and a sense of duty. During these runs, he would often utilize small-talk to \"encourage\" the Azzameens to join the Alliance. Eventually his suggestions were observed by Ace, and other members of the Azzameen family would often assist Alliance efforts on an unofficial basis."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "MK-09 first appeared in the video game Star Wars: X-Wing Alliance, released in 1999. MK-09's voice was provided by Daniel Hagen. In the storyline's prologue, the droid functions as a guide to familiarize players with concepts and controls featured in the game. In certain missions, the droid also acts as a voice for the player character Ace and provides feedback and mission guidelines. The game's Prima Games strategy guide greatly expands on the droid's role in Ace's adventures. This book provides a narrative, written from MK-09's in-universe perspective, which clarifies and expounds on situations experienced in missions, including mission outcomes."}, {"tag": "p", "text": "In X-Wing Alliance's final storyline mission, the in-flight model of the Millennium Falcon places Ace and MK-09 as pilot and copilot respectively. This contradicts established canon from the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, which shows Lando Calrissian and Nien Nunb at the helm. The game's Prima strategy guide helps clarify the roles of both Ace and MK-09: Ace pilots the Millennium Falcon at crucial points during the battle as General Calrissian commands the rest of the fleet, and MK-09 operates one of the turret guns. While Ace's placement is still contradicted, MK-09's placement does not contradict nor interfere with other sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}