{"url": "MS-133", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Imperial organizations"], "nodes": [{"tag": "h1", "text": "MS-133"}, {"tag": "p", "text": "MS-133 was an Imperial science team commissioned by Moff Kentor Sarne, warlord of the Outer Rim Territories' Kathol sector. The team was led by Doctor Lancer Brunou, a respected archaeologist, and was comprised of scientists, technicians, and soldiers. In 8 ABY, they were assigned to explore a series of extensive ruins on the planet Aaris III that had hosted a civilization thousands of years prior. After several months, the team uncovered a chamber known as the Place of Kastays, and discovered an artifact, the Plaque of Victory. The Plaque, a sentient inanimate lifeform, had been responsible for the civil war that had led to the downfall of Aaris society by inducing feelings of paranoia and homicidal tendencies in those around it."}, {"tag": "p", "text": "Following the discovery, MS-133 began to experience feelings of being watched from the jungle. Events took a turn for the worst as members of the team began to disappear, and the base camp came under almost nightly attack from the primitive descendants of the native Aaris. Eventually, only Doctor Brunou and Solla Deremot, a research assistant, were left alive. Both were rescued by the FarStar, a New Republic CR90 corvette, which was in the process of tracking down Sarne in the Kathol sector. The Plaque, taken aboard the FarStar, began to have a similar effect on the crew of the corvette, until it was jettisoned out of an airlock."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Expedition to Aaris III"}, {"tag": "p", "text": "MS-133 was a science team formed in 8 ABY, commissioned by Imperial warlord Moff Kentor Sarne, ruler of the Kathol sector in the Outer Rim. Sarne created the team with the intention of investigating a series of extensive ruins on the planet Aaris III. The ruins indicated the presence of a civilization that had been extinct for several thousand years, and Sarne hoped the team would be able to discover the reason that the population of the planet had died out. The personnel of MS-133 were drawn from the scientific, technical, and military staff of his forces, and were under the command of Doctor Lancer Brunou, a respected archaeologist from the University of Byblos. The mission was classified as top-secret."}, {"tag": "p", "text": "The team, which included a small detachment of soldiers and technicians, traveled to Aaris III aboard a Curich-class shuttle. A communications booster satellite was deployed in orbit, and the team made base camp in a large field of extensive ruins upon planetfall. Doctor Brunou suspected, but could not prove, that the pilot of the shuttle—who was also the commanding officer of the security team—was under orders to land at those exact coordinates. Nevertheless, MS-133 began their explorations; Brunou kept a journal of their work as they charted and excavated the ruins. On day forty-nine of the expedition, one of the team's other scientists, Grigor Tansad, found a way into one of the ruined metal structures. The structure was located away from the base camp, closer to the shuttle landing site; Brunou authorized the setting up of a secondary base camp to be staffed by Tansad, fellow scientist Jelok, two technicians, and five troopers."}, {"tag": "h3", "text": "Discoveries and hostilities"}, {"tag": "p", "text": "Examining a chamber inside the ruins, Jelok discovered that the walls were covered with square, neatly ordered bas-relief pictographs that emitted sound when touched. Jelok believed the sounds to be the key to the language of the long-dead civilization, while Tansad suspected that they were a dating system. Both scientists began translation efforts until Tansad was able to prove that his theory was correct by correlating the sounds with Aaris III's annual revolution. With this discovery, Jelok abandoned his own efforts and assisted Tansad. A day later Jelok, along with the research assistant Solla Deremot, discovered a flat metal ingot in a sealed vault in the floor of the chamber. Brunou studied the new find at the primary base camp, and determined that it was made of a metal not known to Imperial science. In addition, there were faint traces of energy emanating from the object. Brunou decided to send the discovery back to Moff Sarne's capital, Kal'Shebbol, for further study in a fully-equipped laboratory. Unbeknownst to the team, the ingot had been known to the ancient Aaris—the name of the civilization that had called Aaris III home—as the Plaque of Victory. The Plaque was an inanimate sentient lifeform that fed off the life force of other beings. Its goal was to cause the destruction of those around it, by inducing fear, paranoia, and homicidal behavior in individuals, who would become increasingly violent and turn on one another. It had precipitated the Aaris civil war in this way."}, {"tag": "p", "text": "Following the discovery of the Plaque, several troopers began to feel ill at ease, reporting that they felt like they were being watched from the jungle despite there being no evidence of intelligent life on the planet. The team was completely unaware that the Aaris has survived the downfall of their civilization, and that the primitive descendants lived in the ruins of their former cities. The commanding lieutenant led a group of five soldiers into the foliage to investigate. After an hour, the team at the base camp heard blaster fire from the jungle; none of the recon force returned. The remaining troopers immediately issued sidearms to the science and technical staff. Jelok and Tansad continued to work in the chamber—now known as the Place of Kastays thanks to Tansad's work on translating and deciphering the pictographs—although Tansad began to suspect that something was wrong with Jelok, but put his behavior down to professional jealousy. Tansad's translations had revealed how the Plaque of Victory had been responsible for the downfall of the Aaris, and how one individual—the scholar Kastays—had recorded the last days of his people in the pictographs."}, {"tag": "p", "text": "That night, the base camp came under attack by the Aaris from the jungle. The remaining troopers returned fire, although both a technician and Doctor Theda were wounded. Upon examination of the foliage line in the morning, the bodies of several troopers who had gone into the jungle the day before were found. Jelok later reported that Tansad was missing, and that two technicians had been shot by energy weapons from the jungle. Doctor Brunou ordered that the planet was to be evacuated, despite this clashing with Sarne's standing orders. He ordered Jelok to pack up the secondary camp; when the scientist refused, stating that his work was at a critical juncture, Brunou ordered some troopers to escort him to the shuttle while the base camp was packed up. That night, the team's shuttle was destroyed, and the remaining members of the team at the base camp—Brunou, Deremot, the injured Theda, two troopers, and a technician—began to dig into one of the mounds in the ruins and erected makeshift barricades and fortifications, and also mounted an E-Web heavy repeating blaster on the ramparts. Against Sarne's standing orders, Doctor Brunou transmitted a distress signal to Kal'Shebbol, requesting assistance. Two days later, the base camp was attacked again. The two troopers and the technician stormed over the barricades to engage the Aaris, leaving Brunou, Deremot, and the steadily declining Theda."}, {"tag": "h3", "text": "Rescue"}, {"tag": "p", "text": "Brunou's transmission had been received, but not by Moff Sarne or any of his forces. In the months that the team had been on Aaris III, Kal'Shebbol had fallen to the New Republic. Sarne had since fled into the depths of the Kathol sector with the remnants of his military. In an effort to track him down, the New Republic had assigned the CR90 corvette FarStar to follow him. It was the FarStar that intercepted the distress call, and the commanding officer, Captain Kaiya Adrimetrum, diverted the ship to respond, hoping that the team may have had pertinent information regarding Sarne's whereabouts. A landing party was sent down to rescue the survivors; Deremot and Brunou were initially wary of the team, believing them to be in league with the Aaris—whom they had never seen clearly and were still unaware of their survival—but eventually the New Republic personnel were able to convince them of their good intentions. Brunou and Deremot were evacuated up to the FarStar but Theda had already died."}, {"tag": "p", "text": "On the FarStar, Brunou and Deremot relayed all the information they had on the expedition and Sarne's reasons for sending them to Aaris III. Adrimetrum decided to send a second landing party to the planet to scavenge for supplies and fresh foodstuffs. Both survivors of MS-133 declined to return to the surface. The landing party also conducted an investigation into the events that had transpired on the surface. They found the body of Grigor Tansad in the pictograph chamber, hidden under rubble and having clearly been killed by a blow to the head with a large rock that was nearby. The remains of the shuttle also showed that traces of detonite had been used in its destruction."}, {"tag": "p", "text": "In orbit, the crew of the FarStar began to feel like they were being watched, much as MS-133 had on the surface of Aaris III. This was due to the fact that Brunou had brought the Plaque of Victory aboard with him. He and Deremot argued over possession of the artifact, which escalated into a physical confrontation witnessed by several crew members. Eventually, the crew realized that they were under the influence of an outside force, and rationalized that it was the artifact that Brunou had brought aboard. They managed to get the artifact away from the scientists, then ejected it out of one of the corvette's airlocks, ending the Plaque's influence on them."}, {"tag": "h2", "text": "Organization"}, {"tag": "p", "text": "MS-133 was comprised of individuals drawn from scientific, technical, and military backgrounds. The team was led by Doctor Lancer Brunou, a respected archaeologist from the University of Byblos. Rounding out the scientific team were Doctor Theda, Grigor Tansad, and Jelok, with Solla Deremot—whose primary scientific specialty was biological research—acting as a research assistant. The scientists were supported by at least three technicians, as well as a squad of ten troopers including their commanding officer, who doubled as the team's shuttle pilot."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "MS-133 was created for the adventure Artifact of Aaris in The DarkStryder Campaign, published by West End Games. In the adventure, the crew of the FarStar, a New Republic ship crewed by the players, responds to the team's distress signal. Most of the team are dead or missing prior to the start of the adventure, and the remaining members—Lancer Brunou and Solla Deremot—can die during the course of the adventure depending of the gamemaster's decisions and player's actions. If the characters do not die, then they can join the crew of the FarStar. Deremot will willingly ally herself with the crew and be pleased that her talents are being put to good use as she had no love for the Empire. Brunou, on the other, is a staunch Imperialist, and will seek to jump ship and rejoin Sarne's forces at the earliest opportunity."}, {"tag": "p", "text": "Artifact of Aaris implies that under the Plaque of Victory's direction, the members of MS-133 turned upon each other resulting in multiple deaths and the destruction of the shuttle. However, The Complete Star Wars Encyclopedia, published in 2008 confirmed that the team came under attack from the remnants of the Aaris civilization."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}