{"url": "Ma%27w%27shiye", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Alliance Intelligence members", "Category:M'shento'su'Nikto", "Category:Males", "Category:Rebel Alliance defectors", "Category:Scouts", "Category:Sharpshooters and snipers", "Category:Task Force on Alliance Security personnel", "Category:Twilight Class members"], "nodes": [{"tag": "h1", "text": "Ma'w'shiye"}, {"tag": "p", "text": "Ma'w'shiye was an expert scout, a graduate of the Galactic Outdoor Survival School and later a member of the Alliance to Restore the Republic's Eclipse Team and security task force."}, {"tag": "p", "text": "A M'shento'su'Nikto native to Kintan, he had enrolled in Barosa Warren's Galactic Outdoor Survival School during the early reign of the Empire, learning to survive in hostile environments and graduating as part of the very successful Twilight Class alongside the likes of Sisquoc, Akul Witig, Adazian Liebke and Derembus Sitnalta in 12 BBY. Several years later, Ma'w'shiye joined the Rebel Alliance with his peers, serving with distinction in the elite Twilight Squadron for six years during the Galactic Civil War. He was decorated many times by his commanding officers, and won the respect of his peers and of the recruits he trained."}, {"tag": "p", "text": "Suddenly and without explanation, Ma'w'shiye deserted his covert operation team in 4 ABY, and then initiated a series of assassinations and assassination attempts against his previous partners in the Twilight Squadron during the first years of the New Republic. New Republic Intelligence posted a bounty on Ma'w'shiye's head, under charges of treason and others, and organized a SpecForces team to track him down."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Origins"}, {"tag": "p", "text": "A M'shento'su'Nikto born on Kintan, Ma'w'shiye trained to became a scout at the prestigious Galactic Outdoor Survival School, where he underwent intense survival training, learning to survive on any kind of world. Ma'w'shiye was a member of the prestigious Twilight Class, alongside other prodiges such as Adazian Liebke, Norrion Glidamir, Xenon Nnaksta, Sisquoc, Derembus Sitnalta and Akul Witig. All the members of the Twilight Class became expert scouts under the supervision of GOSS headmaster Barosa Warren."}, {"tag": "p", "text": "In 12 BBY, the Twilight Class graduated with honors, breaking the previous GOSS record established by the Summit Class years before. Due to this, Summit veteran Lunkar An felt his ego threatened and became an enemy of the Twilight Class veterans. Although An considered himself Sisquoc's personal nemesis, he felt a particular hatred towards Ma'w'shiye; their mutual dislike caused An and Ma'w'shiye to fight each other many times."}, {"tag": "h3", "text": "The Alliance"}, {"tag": "p", "text": "Ma'w'shiye joined the Alliance to Restore the Republic around 0 BBY, prior to the Battle of Yavin. He became a Lieutenant, with the insignia being pinned to his chest by Rebel officer Airen Cracken. Ma'w'shiye was then assigned to the Alliance Special Forces elite Eclipse Team's Twilight Squadron as a marksman, along with other Twilight Class veterans including Liebke, Sisquoc, Sitnalta and Witig. Maw'shiye also performed field work, becoming a veteran in different dangerous missions, and he also worked as a weapon coordinator. Alongside Derembus Sitnalta, who had became a Commander, Ma'w'shiye trained recruits in the use of high-powered blasters. During all his years in the Alliance, Maw'shiye came to train literally thousands of them not only in the use of light artillery, but also of blaster rifles."}, {"tag": "p", "text": "Ma'w'shiye fought in the Attacks on Corint City, defending the Pirik system from an Imperial invasion. Forced to escape from the Empire through the glass window of Strak Tower's 37th floor, Ma'w'shiye almost lost his right leg during this operation. The leg was saved but, from that point on, Ma'w'shiye had a visible limp. Due to his performance in Pirik, he became a living legend in the Alliance gunnery ranks."}, {"tag": "p", "text": "He also took part in the Karideph operations, during which his friend Witig presented him a heavy overcoat that he would don on when on cold environments from that point on. Ma'w'shiye was also a member of the Alliance team that defended the two last outposts of the Dnalvec Militia on Sriluur against the Galactic Empire."}, {"tag": "p", "text": "As a member of the Task Force on Alliance Security, Ma'w'shiye wrote reports on threats to the Rebel Alliance. During this time, he worked with his previous mates Liebke and Witig, as well as with other Rebel officers including Lieutenant Alton Lochner, Lieutenant Command Sasnak Toxis and agents Tirranna, and Tynan Ryln Mei. Ma'w'shiye collaborated in the report on Barosa Warren, praising his survivalist skill and weaponry. Ma'w'shiye had witnessed his colleague Maashan's XP-38 sport landspeeder failing to provide a suitable cover for Warren's target and, as such, the Nikto reported that people opposing Warren should avoid using landspeeders as cover."}, {"tag": "p", "text": "The Alliance highly valued Ma'w'shiye's performance as a weapon coordinator, special forces operative and pathfinder in dangerous tasks, and he was known to have served courageously side to side with Liebke and Witig. Between 0 BBY and 5 ABY, Ma'w'shiye's meritorious actions led to him being commended and decored several times. Cracken awarded him with the Trand Medallion and the Platinum Valor Cross."}, {"tag": "h3", "text": "The fugitive"}, {"tag": "p", "text": "In 4 ABY, just before the Battle of Endor, Ma'w'shiye was part of a covert operation team on Sanjin, near the Core Worlds. For reasons unknown to his partners and officers, Ma'w'shiye stole the team's escape starship, deserting his squadron and leading to the failure of the operation. Ma'w'shiye's betrayal was expensive to the Alliance, as it cost more lives and gear than any other operation of its size."}, {"tag": "p", "text": "From that point on, Ma'w'shiye turned against his previous partners and allies. He unsuccessfully tried to assassinate his previous associates Liebke, Lochner, Nnaksta, Sitnalta, Tirranna, Toxis, Tynan and Witig, who had become officers of the New Republic—the galactic government created by members of the Alliance. He managed to kill other New Republic agents including Candra, Klepish and Saloor, as well as at least seventy-two non-affiliated civilians. New Republic analysts were surprised at this low figure, as Ma'w'shiye was such a skilled sniper that he could have killed many more if he wished. New Republic Intelligence confirmed that Ma'w'shiye had not joined the Galactic Empire."}, {"tag": "p", "text": "Nonetheless, the New Republic branded Ma'w'shiye as a threat to its members, offering a 70,000-credit bounty for him on the charges of assassination, assault on New Republic personnel with intention to kill, destruction and theft of New Republic property and treason. Airen Cracken, by then a General and head of New Republic Intelligence, was personally disgusted at Ma'w'shiye's attempts against the lives of his previous partners, and wanted the Nikto captured so he could take back the medals he himself had granted. A New Republic SpecForces team was formed to track and capture Ma'w'shiye, and the survivors of Ma'w'shiye's assassination attempts were assigned to lead it."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ma'w'shiye was a muscled M'shento'su'Nikto. Like others of his species, he had dark, black eyes covered with a natural cheratin-like substance that prevented blurry sight under water or during sandstorms. Ma'w'shiye's skin was rust-colored, but during his career he got a lot of white-purple scars. Unlike most M'shento'su'Niktos, Ma'w'shiye lacked the usual minute horns surrounding his face, because he had lost them in a speeder bike accident in the rock canyons on Miglar 2 at some point of his career."}, {"tag": "p", "text": "Ma'w'shiye was an excellent scout, particularly expert as a tracker and pathfinder. He was also a peerless sniper with several kinds of blaster weapons, either personal or vehicle. Should the need arise, Ma'w'shiye could resort to melee fighting, another area of expertise—to the point that he was not afraid at all of fighting the brawler Lunkar An. An accomplished speeder bike pilot, Ma'w'shiye specialized in Aratech Repulsor Company 74-Z speeder bikes. Lastly, he was an expert in demolitions and repairing blasters, particularly the BlasTech EE-3 carbine rifle and SoroSuub Corporation XC24 models."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ma'w'shiye partially changed his equipment from the moment he deserted the Alliance. When he was a rebel lieutenant, he used a loose-fitting jerking and combat trousers that had became his personal trademark. He also favored service boots, an Alliance-issue utility belt, munition straps and a special issue ammo that he could obtain as an officer of the Alliance. In cold environments, he used an overcoat that Akul Witig had gifted him with."}, {"tag": "p", "text": "During the days of the New Republic, he stopped using his previously-characteristic jerking and trousers. He had also replaced his favorite ammunition with another, more easy-to-obtain one. His weapons of choice included a force pike, a heavy blaster pistol and a heavy blaster rifle to which he had added a Tru-Vu 4 Scope."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First appearing in the article Wanted by Cracken published in Star Wars Adventure Journal #4, by C. Robert Carey, Ma'w'shiye was depicted as a M'shento'su'Nikto in an illustration by Robert Duchlinski. Ma'w'shiye was then mentioned in Alliance Intelligence Reports, co-written by Carey, and including a picture by Mike Vilardi that followed Duchlinski's previous characterization. Then, in Galaxy Guide 12: Aliens — Enemies and Allies, Ma'w'shiye is textually identified as a M'shento'su'Nikto."}, {"tag": "p", "text": "The article includes information extrapolated from his roleplaying game template from Wanted by Cracken. The stats in the non-canon video game Star Wars: Rebellion, that cannot be so easily transplanted to a textual article, show Ma'w'shiye as having excellent combat and espionage talents, but being a sub-par diplomat and leader. In the game, Ma'w'shiye could not become an officer or research new technologies, and he had an average possibility of being Force-sensitive."}, {"tag": "h3", "text": "Inconsistencies"}, {"tag": "p", "text": "Galaxy Guide 12: Aliens - Enemies and Allies also specifies that M'shento'su'Niktos lacked natural horns, but Wanted by Cracken specifically said that Ma'w'shiye had had natural horns before his stay on Miglar 2."}, {"tag": "p", "text": "In the Star Wars: Rebellion video game, his portrait corresponds to a Kadas'sa'Nikto. This game, graphically inaccurate, had also misused a portrait of Bob Hudsol to illustrate the character of Vanden Willard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "p", "text": ""}]}