{"url": "Ma%27kis%27shaalas", "categories": ["Category:Canon articles", "Category:Jedi Knights of the Jedi Order", "Category:Kajain'sa'Nikto", "Category:Males"], "nodes": [{"tag": "h1", "text": "Ma'kis'shaalas"}, {"tag": "p", "text": "Ma'kis'shaalas was a Kajain'sa'Nikto male Jedi Knight who in the Grand Army of the Republic during the Clone Wars. He attended meetings at the briefing room in the Jedi Temple regarding updates on the Galactic Republic's war with the Confederacy of Independent Systems."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Ma'kis'shaalas, a Kajain'sa'Nikto male, was a Jedi Knight active during the Clone Wars, which was the Galactic Republic's conflict with the Confederacy of Independent Systems. During the war, Ma'kis'shaalas attended meetings in the briefing room at the Jedi Temple on the galactic capital Coruscant, including one where General Grievous relayed a message to the Jedi informing them that he had captured Jedi Master Eeth Koth, a leading member of the Jedi High Council in 21 BBY. He was disturbed by this and left when they were dismissed with most of the others."}, {"tag": "p", "text": "In 19 BBY, the final year of the war, Ma'kis'shaalas, alongside fellow Jedi Melik Galerha, J'oopi Shé and Shadday Potkin, attended a meeting in the Jedi briefing room regarding the Republic's siege of the Outer Rim. The meeting was presented by Jedi Master Obi-Wan Kenobi shortly before the Supreme Chancellor Sheev Palpatine initiated Order 66, which caused most clone troopers to eliminate their Jedi Generals."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Ma'kis'shaalas had green eyes and light brown skin. He was disturbed when he saw Eeth Koth being tortured by Grievous."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Ma'kis'shaalas had a blue bladed lightsaber and wore Jedi robes."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}