{"url": "Maarek_Stele/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia Featured articles", "Category:Articles with gameplay alternatives", "Category:Aces", "Category:Emperor's Hands", "Category:Humans", "Category:Imperial Navy pilots of the Galactic Empire", "Category:Imperial Navy pilots of the Imperial Remnant", "Category:Males", "Category:Mechanics", "Category:Members of the 181st Imperial Fighter Wing", "Category:Prophets of the Dark Side", "Category:Swoop racers"], "nodes": [{"tag": "h1", "text": "Maarek Stele"}, {"tag": "p", "text": "Maarek Stele was a pilot in the Imperial Navy and one of the Emperor's Hands. A native of Kuan, he enlisted in the Imperial Navy after the Galactic Empire rescued him from Bordali agents near the end of the Taroonian Civil War. Although he initially served as a mechanic, Stele was offered the opportunity to train as a TIE pilot after saving the life of Admiral Mordon. Over the course of several campaigns, Stele fought against the forces of the Alliance to Restore the Republic, as well as those of the treacherous Imperial Admirals Harkov and Demetrius Zaarin. Stele quickly became an ace pilot and went on to be considered one of the greatest pilots in the Empire. He was also well known as a test pilot, being one of the first to fly the TIE Avenger, TIE Defender and the Missile Boat into combat."}, {"tag": "p", "text": "Stele's Force-sensitivity attracted the attention of the Secret Order of the Emperor and, after helping to rescue Emperor Palpatine from Zaarin, Stele was trained to use the Force and became one of the Emperor's Hands. He was also rewarded with the title-rank Tan. Despite Stele's position he came to question his life in the Empire, particularly after the death of the Emperor at the Battle of Endor. It was only after meeting Baron Soontir Fel that Stele felt renewed allegiance to the Empire and joined Fel in the 181st Imperial Fighter Group. Stele continued to serve the Imperial Remnant as a pilot into the Yuuzhan Vong War. Retiring at some point after the Yuuzhan Vong were defeated, he later participated in Lando Calrissian's mission to prevent the destruction of Kessel, having once served as an officer on the planet's Garrison Moon."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early life"}, {"tag": "p", "text": "Maarek Stele was a Human male born on Kuan, a forgotten backwater world in the Taroon system in the Outer Rim Territories that had been locked in a conflict with neighboring Bordal since the end of the Clone Wars—a conflict that had ruined both worlds' economies and left the people living under martial law. The only son of Marina and scientist Kerek Stele, his life changed after his father was kidnapped by Bordali agents when Stele was young—the Bordali hoped to make Kerek work for them against his own people. Marina and the young Maarek were forced to keep a low profile; if the Bordali were to capture them, they would be able to threaten their safety to ensure Kerek's cooperation."}, {"tag": "h3", "text": "The stunt"}, {"tag": "p", "text": "Maarek, however, started to take chances. He became involved with illegal swoop gangs, quickly becoming an accomplished swoop bike pilot. Under an alias, he began participating in competitions for money, undertaking dangerous stunts among the ruined high-rise buildings on his homeworld. During one of these competitions, circa 3 ABY, Stele executed a near-perfect stunt, but returned to the staging area to discover the swoop ring was being raided by the authorities. Stele, acting quickly to avoid capture, fled on his swoop, but footage of the raid was publicly broadcast and Stele was soon identified."}, {"tag": "p", "text": "Unaware of this, Stele dropped the damaged swoop off at the small hangar where he kept it, planning to conduct repairs once he could afford to buy replacement parts. Before leaving, he was visited by his friend and fellow swoop pilot Pargo, who informed Stele that some strangers had been asking questions about him at the Maze, a hangout frequented by the two racers. The two arranged to meet at the Maze to investigate, but Stele first left to visit his mother in her hideout in the old city. Marina informed Maarek that he had been shown on footage of the raid and, furthermore, that he had been identified by his real name. She was concerned that this might lead the Bordali to them and that they might need to relocate to another place to hide. Though Maarek initially thought she was overreacting, it soon became clear that Marina was right when Bordali agents stormed the apartment and the two fled."}, {"tag": "p", "text": "The escape attempt, however, had been anticipated and six armed Bordali intercepted them as they fled. Unarmed and forced to surrender, Stele and his mother were restrained and fitted with soundproof hoods over their heads before being led to a waiting shuttle bound for Bordal. Once in orbit they discovered how the Bordali had located them so quickly—after initially identifying Maarek from the raid footage they had begun a search which led them to capture Pargo who had, under interrogation, revealed Marina's location."}, {"tag": "p", "text": "When a commotion in the cockpit called all but one of the guards away, the unrestrained but apparently unconscious Pargo leaped into action, disarming and restraining the lone guard before freeing his friends. As they began to plan their next move the ship lurched suddenly and the cause of the distraction became clear—they had been caught in the tractor beam of an Imperial-class Star Destroyer. The Galactic Empire had arrived in the Taroon system to impose order and put an end to the longstanding Taroonian Civil War. The shuttle was soon boarded by Imperial stormtroopers, and the occupants, their previous animosity soon forgotten, were transported to the Star Destroyer Vengeance."}, {"tag": "h3", "text": "Recruitment"}, {"tag": "p", "text": "Upon arriving at the Vengeance Stele was separated from the others and left alone in a cell. After some time he was debriefed by an Imperial officer. His initial debriefing revealed Stele's experience as both a swoop pilot and mechanic along with his father's teachings on astrophysics, skills which caused him to be identified as potentially useful to the Empire. The next day he was one of almost two hundred Kuani and Bordali prisoners selected to be invited to serve the Empire. In a small amphitheater on the Vengeance, Admiral Mordon, the officer tasked with subjugating the Taroon system, explained the \"offer\" to the recruits, and displayed a standard holographic message from Emperor Palpatine. Stele was drawn in by the Emperor's image and chose to serve the Empire with all his being."}, {"tag": "p", "text": "Some of those who attended Mordon's speech returned to their homeworlds to help in the transition of power and, in the case of Marina, to look for her husband. Maarek, however, decided to serve the Imperial Military, a decision which was influenced not only by his belief in the Empire but also by his desire to find his father who he felt was no longer in Taroon. Stele started work as a civilian mechanic in one of the main hangars aboard the Vengeance, a repair and construction facility where he worked diligently, repairing damaged starfighters after missions."}, {"tag": "p", "text": "It was an unwritten rule that the repair staff were supposed to conduct test flights before returning starfighters to active service. Stele got his first opportunity to fly a TIE Fighter about a month after arriving on the Vengeance, having been shown the controls by the veteran mechanics."}, {"tag": "p", "text": "Stele's swoop experience made him a natural pilot and, three months after leaving his homeworld, which was long since pacified and occupied, Stele had become quite proficient at flying TIE Series starfighters on maintenance test flights. While piloting a newly repaired TIE Interceptor on a test flight above Farboon, a distress signal was broadcast from a nearby shuttle. With the Star Destroyer unable to intercept in time, Stele was instructed to assist. When he reached it he saw the debris of the shuttle's escorts and two Y-wings shooting at the shuttle. Stele moved quickly to attack the Y-wings, succeeding in drawing them away from the shuttle. Despite the arrival of two X-wings, Stele delayed the Rebel assault until reinforcements could arrive."}, {"tag": "p", "text": "Only after he returned to the Vengeance did Stele learn that the shuttle he saved was carrying Admiral Mordon. Impressed with Stele's initiative and untrained skill, Mordon nominated Stele to join the Imperial Navy and undergo pilot training."}, {"tag": "h3", "text": "Training"}, {"tag": "p", "text": "A few days later Stele boarded a transport bound for a facility where he would undergo his basic military training. He, along with several other recruits, spent the journey in the cold, uncomfortable cargo hold as the Empire attempted to break them and weed out the weak. This process would continue as Stele received an orientation in the Imperial military and basic training under Senior Master Sergeant Jona T. Stark. Over the next two months he was instructed in military procedure, put through physical training, and tested. Eventually his basic training was complete, and he was then relocated back to the Vengeance for flight training. The first week of his training was spent in simulators and, after this, he moved on to trainer starfighters under the watchful eye of Captain Trox."}, {"tag": "p", "text": "During his time on the Vengeance, Stele was brought under the wing of Mordon, who took a liking to the young pilot. The admiral gave Stele a password to use with his aides whenever he wanted to speak to him, \"There's a fog over Celadon City.\" The pair talked often in the admiral's private garden aboard the Star Destroyer, discussing history, combat techniques and the current galactic political situation. Mordon passed on some of his experiences with dogfighting, piloting and command, which Stele summarized into twenty-three rules labeled \"Some General Combat Tactics\". It was Mordon who first prompted Stele to seek out the Secret Order of the Emperor to gain advancement opportunities. He also confided in Stele his concern over disloyalty amongst some senior fleet officers and suggested that the Empire's downfall might not be due to the Rebel Alliance, but from its internecine struggles."}, {"tag": "p", "text": "During his training Stele received his first assignment, a brief stint aboard a corvette patrolling space for smugglers. Here he got his first taste of combat duty when a freighter running weapons for the Alliance was detected. When engaged, a squadron of Alliance shuttles arrived, but was routed by the Imperial patrol, and Stele destroyed three Rebel shuttles during the skirmish with the help of his wingman. During the mission Stele witnessed the death of one of the other TIE pilots as his TIE Fighter collided with a shuttle and was destroyed—the shuttle took only minimal damage. The incident highlighted to Stele that the only way to survive as a TIE pilot was to fly the better craft, an opportunity usually available only to the elite pilots; Stele resolved to be counted among this group. That same night Stele had a strange vision of the Emperor in which Palpatine said, \"You have been called upon to join us, for the good of all beings…You are mine.\" He would have several more similar visions over the coming months."}, {"tag": "p", "text": "Around the end of his training, Stele was devastated to learn that Admiral Mordon had died of \"natural causes.\" Mordon was quickly replaced by (Acting) Admiral Coross, and several crew members were interrogated by investigators, a process they were told was \"standard procedure.\" Stele was questioned about his relationship with Mordon, and offered all he knew. Unsatisfied after several hours of questioning, the investigators forced him to drink a mysterious liquid that made him forget the subsequent interrogation. Days later he received a message, supposedly from his mother, but a reference to Celadon City made him realize that something was amiss. Trying the password Mordon had given him, Stele decrypted the message to find a hidden message recorded by Mordon before his death. The admiral informed Stele that he believed he had been close to discovering the identity of the traitors within the Empire and that, fearing for Stele's safety, he had ordered the pilot to be transferred to a remote Imperial post in the event that anything happened to Mordon."}, {"tag": "h3", "text": "Battles of the Galactic Civil War"}, {"tag": "p", "text": "Following the Battle of Yavin, and his recruitment into the Galactic Empire, Maarek Stele partook in a skirmish against at least one Rebel pilot. Stele was defeated in the fight, but managed to escape alive in his crippled TIE Oppressor. Stele also participated in battles between Rebel and Imperial forces in the Naboo, Tatoo, Corellian, Dantooine, and Karthakk systems during the Galactic Civil War. These battles involved an Imperial Lancer-class frigate being pitted against a Rebel EF76 Nebulon-B escort frigate, with numerous starfighters aiding in the defense or offense of the system."}, {"tag": "h3", "text": "Defense of Outpost D-34"}, {"tag": "p", "text": "Stele was transferred from Vengeance to an Imperial outpost in the Greater Javin region. Arriving at Outpost D-34 in the Anoat sector, Stele was assigned a TIE Fighter and piloted the starfighter on daily patrol and inspection missions. D-34 was positioned along a major hyperlane, giving Stele plenty of vessels to inspect for Imperial Customs. After the recent Imperial victory at Hoth, patrols of Javin space increased on the belief that Alliance vessels would attempt to cross through one of its major hyperlanes. While on patrol, Stele identified a group of ten Alliance fugitives aboard Onece 3, disabled it for boarding, and destroyed its escort."}, {"tag": "p", "text": "Stele had found his assignment to D-34 dull, spending much of his free time in simulators, and had soon realized that this was not an assignment which was likely to lead to greater opportunities. However, after this mission Stele met a cloaked figure, his first encounter with the Secret Order Admiral Mordon had mentioned, who had already observed his skill as a pilot. He was instructed to check with one of their envoys before missions as they would often have additional tasks that required doing, beyond those set by his superiors. Were he to succeed, he would be rewarded with the opportunity of joining the Order."}, {"tag": "p", "text": "It was not long before the Alliance launched a punitive attack against D-34 in order to clear the hyperlane for more Hoth refugees. Stele aided in the defense of his temporary home, driving off the Rebel attackers and disabling the shuttle Scutz, which yielded a group of Alliance officers."}, {"tag": "p", "text": "After his success at D-34, Stele was transferred to Nebulon-B escort frigate Fogger, where he befriended Flight Officers Carith, Alimet and Ketcher. Assigned to a TIE Bomber of Alpha Squadron, Carith and Alimet flew on Stele's wing in a raid against Alliance freighters passing through a Mugaari supply depot. Stele's kills included the two massive freighters Gallon and Romold, the Alliance operative-carrying Dawn and a number of escorting Y-wings. Upon Fogger's return to D-34, it was discovered that the Alliance had seized control of the station. Stele fought to regain D-34, cutting down several X-wings, A-wings, B-wings and Delta-class JV-7 escort shuttles with a TIE Interceptor."}, {"tag": "p", "text": "It was discovered that the attack was launched from the Calamari light cruiser Lulsla, now taking on supplies in the Bruanii sector. Stele was once again called on, and flew Assault Gunboats in two missions against the cruiser: first to deplete the Lulsla's starfighter defenses, then to clear a last-ditch minefield and disable shuttles being used to evacuate the commander and officers while others attacked the cruiser. The Lulsla was destroyed, and the Battle of the Bruanii sector was won. Moreover, Stele discovered Imperial probes aboard a container during the battle, confirming the Secret Order's suspicions that somebody was leaking technology to the Rebels. Stele, for his actions during the campaign, was awarded the Medal of Redemption."}, {"tag": "h3", "text": "Sepan Civil War"}, {"tag": "p", "text": "Stele's first campaign was a success and he had quickly achieved the status of ace pilot. However, just as he was getting used to life on the Fogger, he received a sudden transfer to the Victory-class Star Destroyer Protector, serving in Admiral Harkov's campaign to end a civil war in the Sepan system. On his first mission, to rescue a Ripoblus convoy from Dimok attack, Stele discovered that one of the ships in the convoy was carrying Imperial weapons and found further weapons on a Dimok installation in a subsequent mission to stop a Ripoblus attack—on both occasions he was acting on suspicions voiced by the Secret Order. Despite his discoveries Stele's actions brought him to the attention of his superiors and he was twice disciplined by Captain Trace who warned him not to exceed his orders."}, {"tag": "p", "text": "The Imperial intervention backfired when the two sides then decided to join against the Empire, after an Imperial commando team's attempts to capture the Sepan leaders resulted in the capture of their children instead, and they had to be repelled from a transfer of new production TIE Advanced fighters from the Ton-Falk-class escort carrier Tropsobor to the VSD Protector. However, acting on instructions from the Secret Order, Stele decided to inspect the Imperial shuttle Omlaut when it arrived soon after the completion of the TIE Advanced squadron to the Protector, and found that it was carrying a Rebel adviser, who promptly met behind closed doors with Admiral Harkov."}, {"tag": "p", "text": "Stele's time on the Protector had been successful, seeing him receive two quick promotions to lieutenant and then captain and, after this final mission, the Secret Order rewarded him for his loyalty, bringing him further into their ranks. In addition, his actions during the Sepan Civil War also earned him the Medal of Unity."}, {"tag": "h3", "text": "Service under Thrawn"}, {"tag": "p", "text": "Stele soon received another transfer and, although the reasons for this were not clear, he suspected that the Secret Order had been responsible in an effort to remove him from Harkov's control while they investigated the admiral for suspected treason. He found himself stationed on the Nebulon-B2 frigate Ludwick, as part of a task force commanded by Vice Admiral Thrawn, which was charged with the construction and guarding of space station NL-1 in the Pakuuni system. On the Ludwick he was reunited with his comrades from the Fogger: Alimet, Ketcher and Carith. After the pilots sneaked into a hangar during a visit by Vice Admiral Thrawn, Commander Buckeye punished them by ordering them to help clean up a pirate base after an Imperial attack."}, {"tag": "p", "text": "With NL-1 established Stele helped defend it against a Rebel attack until Thrawn arrived in the Victory-class Star Destroyer Stalwart and was promoted to commander after the attack was repelled. It was at Thrawn's formal inspection of NL-1 here that Stele was first noticed by the vice admiral, when with most of their other fighters undergoing repairs, Stele's TIE Bomber acted as escort for Thrawn's transports to and from the VSD Stalwart. In beating back an attack by the Rebels and Pakuuni Pirates involving A-wings, X-Wings and three waves of Lambda-class shuttles, Stele impressed Thrawn with his skill in using the bomber in a defensive role it was not designed for. Because of his overall actions in the campaign, Stele was presented with the Medal of Progress."}, {"tag": "h3", "text": "The new hyperdrive technology"}, {"tag": "p", "text": "After NL-1, Stele was transferred to the service of Grand Admiral Demetrius Zaarin, aboard the Nebulon-B2 frigate Shamus, to aid him in obtaining new hyperdrive technology from the Habeen who, with the help of the Nharwaak, had achieved a breakthrough in making a new hyperdrive model that could be small and reliable enough for the new TIE Avenger. However, while the Habeen were doing business with the Empire, the Nharwaak were planning to do business with the Rebellion."}, {"tag": "p", "text": "Stele's reputation had started to grow and he found that his frequent promotions led to the other pilots leaving him increasingly isolated. As a result he was surprised when he was approached by Xeal, a young pilot who asked Stele to teach him how to survive. Although initially uncertain Stele agreed to Xeal's request and begin to share his experiences and tactics with the cadet. It soon became clear that Xeal had doubts about the Empire and why he should hate the Rebellion and, though Stele defended the Empire, he too found himself wondering if he was on the right side."}, {"tag": "p", "text": "Despite his misgivings Stele continued to do his duty, helping to stop a Nharwaak raid on a Habeen convoy carrying test hyperdrives to the Shamus. When Imperial Intelligence located the main Nharwaak base, Stele participated in an attack which destroyed several Nharwaak ships stationed at the base. He then helped thwart a Nharwaak Third Battle of Mylok IV on the Habeen research facility and protected a meeting between the Habeen and Zaarin to close the deal for the technology. He also aided in the attack on the Nharwaak when they were trying to sell the hyperdrive technology to the Alliance, resulting in the destruction of the frigate Xerxes and ensuring that the technology remained out of Rebel hands."}, {"tag": "p", "text": "Stele received his battle medal in a small ceremony after the Nharwaak meeting with the Rebels was thwarted. Unlike previous medal ceremonies Stele found it difficult to be enthusiastic—he no longer took any pleasure in destroying enemy ships, seeing it as duty alone, and part of him longed to live a simple life on Kuan."}, {"tag": "h3", "text": "Harkov's betrayal"}, {"tag": "p", "text": "Stele was then transferred back to the Protector—the Secret Order was closing in on Harkov and wanted Stele's assistance. After almost a week on the Protector he was asked to demonstrate to a pair of rookies how to destroy a minefield with an unshielded craft. The Secret Order was suspicious and informed Stele that they had arranged for reinforcements should he need them. Their suspicions were proved correct when, while Stele was in the process of destroying the mines, Harkov ordered Stele's wingmen to destroy his TIE Interceptor. Acting quickly, Stele called for backup, and Secret Order forces entered the area in the Nebulon-B2 frigate Osprey. As Stele headed for the Osprey the Mon Calamari Star Cruiser Margaret arrived and dispatched a shuttle to the Protector, which Stele identified to confirm that a Rebel officer was aboard before making his escape on the Osprey."}, {"tag": "p", "text": "Stele knew that the Secret Order would have let him die were he not useful to them. Met by one of their representatives on the Osprey, he vented his anger with the Order and announced that he was through with doing their bidding. Only the news that Harkov had been responsible for Admiral Mordon's death persuaded him to help the Order track down the renegade admiral and bring him to justice."}, {"tag": "p", "text": "Harkov's act of treason was evidence enough for the Emperor to send the Supreme Commander of the Imperial Fleet, Lord Darth Vader, to personally deal with Harkov. Stele participated in a campaign that cornered the Protector near the Rebel outpost DS 5, allowing Vader to launch an all out assault in which Stele volunteered to fly one of the newly arrived TIE Avengers. During the battle, Stele located Harkov aboard the shuttle Toten as it fled the Protector and moved to DS 5. Stele was under orders not to destroy Harkov's shuttle and, fearing reprisals from the Secret Order, resisted his desire to fire and take revenge for Mordon's death."}, {"tag": "p", "text": "However, Stele did not have to wait long to see Harkov brought to justice. With Harkov stranded on DS 5 the Imperials launched an attack during which Stele again located Harkov's escape transport, the Geddawai, and personally exacted revenge on the turncoat admiral by disabling it."}, {"tag": "p", "text": "Harkov was then taken to Lord Vader on the Star Destroyer Garrett who executed him after a brief interrogation, yet Stele was surprised that he felt no elation over the downfall of Mordon's killer. Nonetheless, he accepted the Medal of Loyalty for his actions in bringing Harkov to justice."}, {"tag": "h3", "text": "The new starfighter"}, {"tag": "p", "text": "Stele had impressed Grand Admiral Zaarin during the Habeen negotiations and soon found himself back under the command of Zaarin when he was transferred to the Grand Admiral's research facility. Among the ships in development at the facility was the TIE/D Defender, an operation in which Stele was heavily involved. He patrolled the station while six prototypes of the new starfighter were loaded into containers to be transported to Coruscant for inspection by the Emperor, helping to fend off an attack from A-wings and B-wings. The next raid was at Vinzen Neela 5 where the prototypes were being delivered to the Imperial escort carrier Hininbirg. The raid consisted of X-wings, B-wings, A-wings, Y-wings and the two CR90 corvettes Mar Duun and Vop Hui. The Rebels were again beaten back by Stele."}, {"tag": "p", "text": "Zaarin had been overseeing the development of new tractor beam technology for use on starfighters, which had reached a critical phase when the Rebels attacked again with X-Wings, B-wings, A-wings, and Delta-class DX-9 stormtrooper transports. During this latest raid, the Rebel B-wings employed a new warhead, the mag pulse torpedo. The raid was once again beaten back and Stele also disabled a B-wing containing the new warheads and guarded the capture operation. Due to his actions in retrieving the tractor beam technology, he was presented with the Medal of Destiny."}, {"tag": "p", "text": "During his time under Zaarin, the admiral took a lot of interest in Stele, greeting him upon his arrival and meeting with him several times afterwards. Eventually he offered Stele the opportunity to lead a special squadron of TIE Defenders under his command. However, after accepting Stele began to feel uncomfortable with some of what the admiral said about the Empire and the way it was run, though he decided not to share his suspicions with the Secret Order."}, {"tag": "p", "text": "His doubts about his situation grew when, shortly after learning that Carith had defected to the Rebels and the realization that he might be forced to fire on a friend, Trace revealed that he was actually Hamo Blastwell, a Rebel agent, and attempted to recruit Stele for the Rebellion. Stele was angry—between Mordon, the Order, Zaarin and now the Rebels everybody seemed to want something from him and he didn't know what to think anymore. He turned Blastwell down but didn't report him to the authorities."}, {"tag": "p", "text": "The mag pulse warheads that Stele had helped capture from the Alliance were manufactured by Galactic Electronics; more specifically, the warheads were traced back to Galactic Electronics' space station Pondut. Stele took part in the capture of the station launching from Zaarin's flagship the Star Destroyer Glory. After the raid Stele was finally reunited with his father. Kerek had left Taroon to help the Alliance fight against the Empire that he felt was oppressing his people, not liberating them. He was one of hundreds of prisoners captured in the raid on Pondut. Only thanks to Stele's old friend Pargo, now a stormtrooper, did he learn of his father's fate. Stele begged the Secret Order to see to his father's release, promising to serve them in any way they required, but the Order seemed reluctant to help."}, {"tag": "h3", "text": "The Zaarin Insurrection"}, {"tag": "p", "text": "Stele would not get the opportunity to take Zaarin up on his squadron command offer as he was soon transferred to an elite squadron based on Lord Vader's flagship, the Star Destroyer Garrett, to assist in the hunt for the remains of Harkov's fleet. There he began training on the new TIE Defenders and was reunited with his former student Xeal. Around this time, he also received a promotion to colonel."}, {"tag": "p", "text": "While mopping up the remainder of Harkov's fleet, the Garrett came under fire from forces under the command of Zaarin. The attack force consisted of three groups of Assassin-class corvettes called Arditi, Falcon and BaKaar, but the corvettes were all destroyed. Immediately after returning to the Garrett, Stele was escorted to the bridge, where Lord Vader questioned him over his association with Zaarin. Stele voiced his suspicions about Zaarin's actions and that he felt the Grand Admiral might attempt to take over the Empire, confirming Vader's own suspicions that the Emperor was in danger."}, {"tag": "p", "text": "With the damage sustained by the Garrett preventing it from reaching Coruscant in time, Vader selected a few ace pilots, Stele included, to accompany him in TIE Defenders to the Imperial capital, in the hopes of saving the Emperor. They were stalled by the Immobilizer 418 cruiser Harpago, but after the arrival of the Osprey, they were able to destroy the Harpago and resupply before proceeding to Coruscant."}, {"tag": "p", "text": "Upon arriving at Coruscant they found that Zaarin had beaten them there. The Star Destroyer Majestic was badly damaged and the Emperor had been abducted. Stele was able to locate the shuttle carrying Palpatine and disable it in time to save him from being delivered to Zaarin in the Glory. As the corvette Mescue rescued the Emperor, Thrawn arrived on the Vanguard and launched an attack on the Glory, forcing Zaarin to flee."}, {"tag": "h3", "text": "Emperor's Hand"}, {"tag": "p", "text": "Stele was rewarded for his part in rescuing the Emperor in a ceremony attended by the cream of Coruscant society. As the Emperor watched from high above, Stele was presented with the Emperor's Will by Lord Vader himself. Even as he received his medal, Stele still had doubts about the Empire and his place within it and longed to return home. However, his service to the Empire was guaranteed—Palpatine agreed to reward him by setting his father free and allowing him to return to Kuan, but in exchange Stele would continue to be his loyal servant."}, {"tag": "p", "text": "Following Stele's involvement in his rescue, the Emperor would continue to take great interest in Stele. After the Secret Order learned that he was Force-sensitive, the Emperor instructed them to begin Stele's training in the Force and, as his abilities quickly developed, he would go on to become an Emperor's Hand, a group of Force users charged with carrying out Palpatine's will. Stele continued to rise through the ranks of the Secret Order, achieving the rank of Emperor's Reach at Palpatine's request, a position only awarded once by the Order. Impressed with how quickly Stele's abilities developed, Palpatine awarded him the title-rank Tan and assigned him as commander of the Emperor's Sword, a group of elite pilots who served as Palpatine's personal escort."}, {"tag": "h3", "text": "The loss of the Omar factories"}, {"tag": "p", "text": "Even as Stele underwent his Force training the hunt for the renegade Grand Admiral Zaarin began. Thrawn was placed in command of the Imperial forces sent to track down Zaarin and Stele was assigned to Thrawn's ship, the Victory-class Star Destroyer Sceltor. Thrawn's forces were sent to the Omar system where, in an attempt to limit the Empire's ability to manufacture TIE Avengers, Zaarin had launched a major attack on the Omar Deep Space Manufacturing Facilities. Arriving too late to prevent the loss of the factories, Stele led a flight of TIE Defenders charged with holding off the Nebulon-B2 frigate Raptor long enough for the evacuation of the highly skilled personnel stationed aboard."}, {"tag": "p", "text": "Zaarin's forces next moved to loot hyperdrive technology from ZA-13, a facility formerly under Zaarin's direct control. Stele again led TIE Defenders to stop all of the craft that were looting the equipment, disabling them to allow the recovery of the stolen materials, along with the ship logs which the Secret Order hoped might lead them to Zaarin. With the loss of several TIE Avenger facilities across the Empire the recapture of ZA-13 became a top priority. Stele again saw action as he had to escort personnel to ZA-13 while repelling another attack by Zaarin's forces, led by the Carrack-class light cruiser Z-Jumimi and three CR90 corvettes from Z-Caplure group."}, {"tag": "p", "text": "Stele then escorted the convoy Rope 17 to ZA-13 when the Rebel Alliance attempted to capitalize on the Zaarin situation by attacking the convoy with multiple star fighters and corvettes. During the failed attack the Rebels deployed the new mag pulse warhead and the Empire soon discovered the facility where the technology was being produced. Under the command of Thrawn, Stele participated in an attack against the Rebel station RS-32, which led to its capture and the Empire's acquisition of the new warhead. Zaarin, however, was quick to act, launching a sneak attack on the newly captured Rebel facility and the Sceltor. Stele turned the new mag pulse warheads on Zaarin's Immobilizer 418 cruiser, the Grappler, disabling its weapons long enough for it to be destroyed by Thrawn's forces. Though Thrawn successfully escaped thanks to Stele, Zaarin succeeded in destroying the last of the TIE Avenger facilities in the Omar system. Despite the overall failure of stopping Zaarin from destroying the TIE Avenger facilities, Stele's actions were nonetheless rewarded with the Medal of Dignity."}, {"tag": "h3", "text": "Arms race"}, {"tag": "p", "text": "Stele was soon sent to the Parmel system, where Zaarin's forces were attempting to loot the research facility where he oversaw the development of the TIE Defender. Stele's TIE Defender group was tasked with eliminating Zaarin's starfighters and disabling or destroying fleeing ships, while Gamma-class ATR-6 assault transports disabled and captured the station. The Star Destroyer Adarga then arrived to hold the facility."}, {"tag": "p", "text": "However, in a mirror image of the Empire's operation, Zaarin launched his own TIE Defenders and assault transports to recapture the facility. Stele helped repel the attack, disabling several enemy TIE Defenders in the process, but the Adarga was damaged and forced to withdraw. Zaarin couldn't afford to allow the facility to be held by the Empire and launched an attack to destroy it, led by his own Star Destroyer, the Glory. Stele's TIE Defender, aided by escort shuttles from Red Knight and Dragonfly groups, fended off Zaarin's forces while the Empire was forced to evacuate the two facility's two remaining TIE Defender prototypes and personnel on the BFF-1 bulk freighter Mharsup and the shuttle G'nabgib."}, {"tag": "p", "text": "As the Mharsup rendezvoused with Assassin-class corvette group Hashim to transfer the three TIE Defenders (including Stele's), they came under attack from Rebel forces and Stele had to cover the transfer before fleeing himself. The Imperials' escape, however, was short-lived as they came out of hyperspace into an ion cannon minefield set by Rneekii pirates. Stele was once again forced to act alone to prevent the capture of the prototype-carrying corvettes. After the arrival of Assault Gunboat reinforcements, Stele was able to drive off the pirate Strike-class medium cruiser Intombe and destroy several R-41 Starchasers, preventing the capture of the prototypes. The pirates did, however, succeed in capturing the research staff on the shuttle G'nabgib."}, {"tag": "p", "text": "With the corvettes disabled the Empire commandeered cargo ferry group Mssan and began to transfer the TIE Defenders to them. The transfer was once more interrupted by the Rebel Alliance forcing Stele into combat once again. As the Imperial forces were occupied with the attacking Rebels, Nami pirates dropped out of hyperspace and captured the disabled Hashim 1 and escaped before Stele could intervene. To make matters worse, Zaarin sent his own TIE Defenders to attack the transfer. With the assistance of Assault Gunboats, Stele was able to protect the transfer and the cargo ferries finally delivered their cargo to Thrawn's Star Destroyer for delivery to Coruscant. For these actions and others, Stele was awarded with the Medal of Futility."}, {"tag": "h3", "text": "New threats"}, {"tag": "p", "text": "The Rneekii pirates offered to ransom the captured scientists. The Empire, as the highest bidder, sent a shuttle to conduct the transfer with Stele flying a lone escort in an Assault Gunboat. However, the Empire had no intention of making a deal with the pirates. As soon as the transfer was complete, Stele was ordered to disable the transport carrying the ransom. The Interdictor Red Claw came out of hyperspace to retrieve both the ransom and the freed scientists. However, while the Imperial forces routed the Rneekii, a group of Nami pirates arrived and were able to damage the Red Claw's hyperdrive before Stele could stop them, leaving the ship stranded near Kiilimaar."}, {"tag": "p", "text": "Assassin-class corvette group Chemeti was dispatched to deliver the parts needed to repair the Red Claw and to take possession of the scientists. Stele once again flew an Assault Gunboat to provide protection for the transfer, engaging TIE Defenders while the scientists were transferred to Chemeti 1, unaware that it was a fake sent by Zaarin to capture them. With the transfer complete, Zaarin sent the Strike-class cruiser Z-Kopsh to destroy the Red Claw but, after the arrival of the loyalist Strike-class cruisers Nagan and Shotel, Stele was able to assist in its destruction."}, {"tag": "p", "text": "The Empire soon learned that the Nami pirate leader Ali Tarrak was launching an assault on an Imperial cargo transfer area in the Yrrna system. More alarmingly, the Nami were using TIE Defenders and the raid was being observed by the Rebel Carrack-class cruiser Jester. The news that TIE Defenders were now in the hands of pirates represented a major threat to the Empire. Fortunately, Thrawn had been working on a new starfighter to counter the TIE Defender and, after assisting in the evacuation of the facility, Stele was quickly sent for training on the resulting Missile Boat. With his training complete, Stele was given the chance to fly the Missile Boat in its first combat mission, an operation to capture TIE Defenders which Tarrak was planning to sell to the Rebel Alliance."}, {"tag": "p", "text": "The Rebels soon mounted a major attack, led by three Carrack-class cruisers from Kingdom group, which was aimed at recovering the TIE Defenders on Admiral Thrawn's latest Star Destroyer, the Grey Wolf. Thrawn decided to make a stand, sending Stele in a lone Missile Boat to engage the enemy forces, his only support coming in the form of TIE Fighters. The overwhelming firepower of the Missile Boat proved decisive as Stele destroyed all three Rebel capital ships, crippling their operations in the area."}, {"tag": "p", "text": "Thrawn then led the Grey Wolf in a mission to destroy Tarrak's TIE Defender factory and Stele was again selected to take a single Missile Boat into battle. Stele once again proved essential to the Empire's victory, assisting in the factory's destruction and with the capture of Ali Tarrak as the pirate leader attempted to flee. Stele was later presented with the Medal of Horror."}, {"tag": "h3", "text": "The hunt for Zaarin"}, {"tag": "p", "text": "With the Missile Boat providing the Empire with the means to overcome Zaarin's technological advantage, the newly promoted Grand Admiral Thrawn began to close the net on the renegade. Due to Stele's skill, he was personally selected by Thrawn to receive the toughest assignments, being called upon to quickly respond to any leads. The Empire soon discovered a supply convoy waiting for a rendezvous with Zaarin's forces. Stele was sent as part of an assault on the convoy led by the Star Destroyer Courageous, under the command of Captain Kuuztin, designed to deprive Zaarin of essential supplies."}, {"tag": "p", "text": "Prisoners captured during the attack on the convoy revealed that Zaarin was using a refitting base as a marshaling area and Kuuztin, seeing the opportunity to severely hamper Zaarin's forces, ordered an immediate attack without consulting Grand Admiral Thrawn. Stele would again fly a Missile Boat in the mission but the Secret Order, concerned that they might be walking into a trap, informed him that, should anything go wrong, keeping his valuable ship out of enemy hands was the top priority. The Order's fears proved justified as the Star Destroyers Imperator and Thunderer, along with a group of TIE Defenders carrying heavy warheads, arrived during the attack and destroyed the Courageous. Despite this loss, Stele was able to cause heavy damage to Zaarin's forces, destroying the base and several starships before retreating into hyperspace."}, {"tag": "p", "text": "Thrawn set up a trap for Zaarin, leaking the location of a convoy supposedly carrying Missile Boats. In fact, the only Missile Boat present would be that flown by Stele. Zaarin sent five corvettes from Kormoran group to attack the convoy and Stele helped to quickly ensure their destruction. However, Zaarin's forces had been smaller than expected and Thrawn, suspecting that Zaarin had anticipated the trap, decided to try again with more tempting bait, an entire squadron of Missile Boats."}, {"tag": "p", "text": "However, while Thrawn waited for the arrival of Task Force Whirlwind, it came under attack from the Interdictor Maelstrom and several enemy fighters. Though Stele helped defend the task force and destroy the Maelstrom, the Interdictor Whirlwind was forced to go for repairs and was unable to rendezvous with Thrawn. With the attack having thrown Thrawn's plans into disarray and Zaarin's attack on the convoy beginning, Stele was ordered to take his Missile Boat and prevent the convoy's destruction until Thrawn arrived. Stele came out of hyperspace into heavy fighting but was able to save the convoy, inflicting heavy losses on Zaarin's forces. After Thrawn arrived in the Grey Wolf, along with the Star Destroyer Resolution, Zaarin ordered a retreat. The saved Missile Boats were sent to a facility where the Empire hoped to train other pilots in the craft, ultimately to form an elite squadron."}, {"tag": "p", "text": "Before Zaarin's coup, he had been one of the few individuals aware of the Vorknkx Project, the secret development of a new cloaking device. Learning from spies within the Empire that the project had achieved some sudden progress, Zaarin sent the frigate Z-Borus to attack the research facility. Stele's Missile Boat was the only craft capable of responding in time, so he was sent to slow down the attack until reinforcements could arrive. Although Zaarin's initial attack force was defeated he soon sent a larger force and Stele had to assist the evacuation of the facility and the prototype cloaking device fitted to the corvette Vorknkx. For these actions, Stele was presented with the Medal of Liberty."}, {"tag": "h3", "text": "Prelude to Endor"}, {"tag": "p", "text": "While Thrawn continued the search for Zaarin, the Empire was preparing for the anticipated attack on the Death Star II at Endor and Stele was temporarily transferred back to the Garrett under Lord Vader. He soon saw action as Rebel and Bothan prisoners, who Vader wanted to interrogate in relation to the recent theft of information relating to the Death Star from the freighter Suprosa, were being taken to Vader on the Dreadnaught-class heavy cruiser Dargon. Stele's TIE Avenger flight was sent to relieve the escort for the last leg of the journey, fending off a Rebel rescue attempt in the process. The Rebels attacked again as the Dargon came out of hyperspace near the Garrett and suffered engine failure, the result of suspected sabotage. Lord Vader sent a transport to bring the prisoners the rest of the way to his ship and Stele's group once more protected the operation."}, {"tag": "p", "text": "Soon after the prisoners arrived on the Garrett, Vader ordered an attack on a Bothan convoy. Stele flew one of several Assault Gunboats charged with disabling the freighters before the Garrett arrived to oversee their capture. After the Suprosa was traced back to the Bothan station Kothlis II, Stele participated in a mission to the station but was informed by the Secret Order that the Emperor was more interested in learning of what had happened to the freighter than recovering it."}, {"tag": "p", "text": "The Empire then learned of a meeting between the Rebel cruiser Knights and the Bothan Dreadnaught Doomer. Vader dispatched Stele to lead a Missile Boat attack on the capital ships, aiming to destroy the Doomer and assist assault transports capturing the Knights in order to discover how much the Rebels knew about the Death Star. Coming out of hyperspace in the middle of a minefield and only meters from the cruiser, Stele's TIE Avenger escorts collided with the Rebel ship. Stele fought against enemy fighters and mines, and, by the time the assault transports arrived, only Stele's Missile Boat and the two capital ships remained. Stele quickly finished off the Doomer, and the Knights was captured soon after. The Rebel frigate Tarken came to the Knights' rescue, but the Empire had anticipated reinforcements, and Stele helped to capture the Tarken too. The presence of high-ranking Rebels on the Knights confirmed that the Alliance had taken the bait and was preparing a major attack on the Death Star. The Empire, however, was gathering its own fleet near Endor to destroy the Rebel forces."}, {"tag": "p", "text": "As Rebel forces gathered in the Delfii system, Stele was sent on a reconnaissance flight to determine the extent of the Rebel fleet being committed to the upcoming battle. During the mission, Stele acted on orders from the Secret Order, destroying a Bothan escort shuttle before the computer expert on board could voice his suspicions about the stolen data to the Rebels."}, {"tag": "p", "text": "The Garrett was charged with slowing down the Rebels while the Empire completed its trap. The Empire knew that several Rebel ships would be traveling to their rendezvous near Sullust via the hyperjump point Sul-34. Stele led a group of Missile Boats who, along with Assault Gunboat escorts, were charged with destroying the first three Rebel capital ships to arrive, weakening their forces and delaying their assault while they waited for reinforcements. Furthermore, Stele destroyed several Rebel fighters, forcing them to commit reserves to the upcoming battle. Vader was impressed by Stele's skill and loyalty, considering them of value to the Empire, and requested to be kept updated on the progress of his career. Stele's actions against the Rebel Alliance were later rewarded with the Medal of Guile."}, {"tag": "h3", "text": "Further treachery"}, {"tag": "p", "text": "Soon after, the Emperor left Coruscant, bound for the Death Star, in order to personally oversee the Empire's victory over the Alliance. However, his private C-3 passenger liner, the Excalibur, came under attack from Zaarin's starfighters. With Zaarin sending additional forces and Palpatine's ship too far from Coruscant to safely return, the Secret Order sent a flight of TIE Avengers and Stele's Missile Boat to reinforce the Emperor's outnumbered escort and to ensure that the Excalibur successfully jumped to hyperspace. Stele arrived shortly before Zaarin's main attack force, comprising the Victory-class Star Destroyer Zeplin, the frigate Kimik and a number of Assassin-class corvettes. Stele quickly moved against Zaarin's forces, using his Missile Boat to destroy several corvettes. By the time the Excalibur reached its jump point, Zaarin's attack force had been decimated, although the Zeplin escaped to hyperspace. Imperial Intelligence learned later that the Assault Gunboats that attacked the Excalibur had been part of Palpatine's own special reserve guard—Zaarin clearly still had supporters within the Empire."}, {"tag": "p", "text": "It soon emerged that Zaarin had learned that the Death Star was operational. Though his hatred of the Rebels meant he would keep the information to himself, the commander of the Zeplin, Namuura Din, intended to defect to the Rebel Alliance and warn them about the Emperor's plan. Furthermore, Zaarin had acquired a Missile Boat which Din now planned to deliver to the Rebels. Stele participated in an operation to capture the Zeplin but came out of hyperspace to find the Star Destroyer had already rendezvoused with the Rebel cruiser Link. Before the Link jumped to hyperspace, Stele was able to quickly scan it and discover that the Missile Boat was already on board. After the Garrett's forces captured the Zeplin, Vader interrogated Din and learned that, in addition to the Missile Boat, the Link now carried the truth about the Death Star."}, {"tag": "p", "text": "Knowing that the Garrett was in pursuit, but not willing to risk transmitting the data, the Link's commander pushed the ships engines too hard to try and reach the Rebel fleet and the ship dropped out of hyperspace. The Link sent the captured Missile Boat to safety but was soon attacked by the Garrett. During the battle, Stele used his Missile Boat's heavy warhead load to bring down the shields on the Link, allowing Imperial forces to capture it and prevent news of the Imperial trap from reaching the Rebel fleet."}, {"tag": "p", "text": "Stele next participated in an operation to retrieve the stolen Missile Boat from the Rebel platform Enin'sd. It would be his last opportunity to fly a Missile Boat in combat—Zaarin had been attacking the Empire's Missile Boat production facilities causing the Emperor to order all of the surviving bombers into protective storage. Stele received a transfer to a TIE Avenger squadron under Thrawn to help the Grand Admiral defeat Zaarin."}, {"tag": "h3", "text": "The fall of Zaarin"}, {"tag": "p", "text": "While Stele was away, the Vorknkx Project had been moved to To-phalion Base. Thrawn anticipated that Zaarin would make another attempt to steal the Vorknkx and was positioning his forces to take advantage of this when Zaarin struck. Stele's group was sent to repel Zaarin's combined Muurian transport and TIE Defender attack force. During the battle, Zaarin's spy within the Vorknkx Project attempted to flee in a shuttle, but Stele, receiving orders from the Secret Order, quickly destroyed the shuttle before the spy could take his information back to Zaarin."}, {"tag": "p", "text": "However, Zaarin's spy had managed to sabotage To-phalion Base's defenses, leaving it vulnerable to a second attack led by corvette group Z-Rok. Thrawn, on board the frigate Maru Ki, was bringing reinforcements, but Stele's group was tasked with holding off Zaarin's forces until Thrawn arrived. Stele fought hard against Zaarin's forces, aiding in the destruction of several enemy ships, while having to evade the attacks of enemy TIE Defenders. Moments after Stele destroyed the last of Zaarin's assault transports, he was struck by a concussion missile from a TIE Defender and was forced to eject moments before his ship exploded. He awoke several hours later in a medical facility to learn that Thrawn had arrived and the second stage of the battle had been a success."}, {"tag": "p", "text": "Stele would have little chance to rest however, as Zaarin made one final attack on To-phalion, this time led by his own flagship, the Glory. Although the Star Destroyer had the advantage over the defending forces, Thrawn's plan was to lure Zaarin in and trap him with the arrival of the Interdictor Corvus and the Grey Wolf. As Stele battled Zaarin's TIE Defenders and Interceptors, the Star Destroyer struck at the base and the Maru Ki. Shortly before To-phalion Base's destruction, the Vorknkx launched but, under the control of more of Zaarin's spies, flew straight to the Glory's hangar and the Star Destroyer left the area before the Corvus arrived. However, Thrawn had prepared a contingency plan, planting a tracking device on the corvette. Despite the capture of the Vorknkx and the heavy Imperial losses, Stele and the other pilots eliminated most of Zaarin's remaining TIE Defenders."}, {"tag": "p", "text": "Unaware that he was being pursued, Zaarin fled to the Unknown Regions. There, Thrawn's forces caught up with him. While the Corvus, protected by the Grey Wolf, prevented Zaarin's escape, the Strike-class cruisers Ebolo and Daring moved against the Glory, aided by TIE Bombers. TIE Fighters were charged with stopping Zaarin's counterattacking TIE Defenders. Thrawn initially held Stele's TIE Avenger group back, timing their launch from the Ebolo for maximum surprise. Stele was under fire as soon as he launched but helped destroy Zaarin's last fighters before moving against the Glory itself, inspecting it to make sure the Vorknkx was still aboard. As the Glory's shields fell, shuttles began to evacuate but Stele destroyed them, inspecting them first to ensure Zaarin was not aboard. Zaarin instead launched on the Vorknkx moments before the Star Destroyer fell to the combined firepower of Thrawn's forces, planning to use its cloaking device to escape. However, the reports of the cloaking device's success had been doctored by Thrawn to hide a dangerous instability—as Zaarin activated the hyperdrive while cloaked, the ship was destroyed."}, {"tag": "h3", "text": "Later career"}, {"tag": "p", "text": "Stele's pursuit of Zaarin earned him the Medal of Victory but prevented him from participating in the imminent Battle of Endor. After the Empire's surprise defeat at the battle, and the death of Palpatine, Stele found himself assigned as an officer at the Garrison Moon in orbit of the Imperial prison and glitterstim mining world of Kessel."}, {"tag": "p", "text": "Following the Battle of Endor, more and more officers followed the trail Zaarin had blazed and became backstabbing warlords, leading Stele to question the Empire's worth more than ever. Baron Soontir Fel stepped in to renew Stele's faith in the Empire, recruiting the Emperor's Hand to join the legendary 181st Imperial Fighter Group. In Fel, Stele recognized the dignity and honor that had first attracted him to the Empire and, his faith restored, he served the Empire even as it dwindled into the Imperial Remnant."}, {"tag": "p", "text": "During the early stages of the Yuuzhan Vong War the Imperial Remnant was concerned about the possibility of the war spreading to their territory. In order to guard against this they increased patrols along their borders. Stele was leading one such patrol, which included an Interdictor and its compliment of TIE fighters, when they encountered a New Republic convoy attempting to pass through Imperial space. Due to being pulled out of hyperspace involuntarily, the freighter's hyperdrive was damaged, and Stele himself ordered the group to power down their weapons and prepare to be boarded."}, {"tag": "p", "text": "Stele eventually retired from Imperial service and, by 40 ABY, while compiling a history of the Jedi and the Sith, Jedi Master Tionne Solusar noted that little information on Stele's whereabouts was known to the New Jedi Order. Stele eventually resurfaced in 43 ABY, when he was approached by former Rebel general Lando Calrissian for a mission to prevent the destruction of Kessel, no longer in Imperial hands and now owned and administered by Calrissian, his wife Tendra Risant Calrissian and the Sullustan Nien Nunb."}, {"tag": "p", "text": "Around the time of the destruction of Centerpoint Station during the Second Galactic Civil War, Kessel had started to experience a series of groundquakes. The spice mine's owners had sought the help of Jedi Knight Leia Organa Solo and her husband Han Solo, who had determined that the groundquakes were being caused by the destruction of alien explosives in previously unknown underground chambers. The remaining explosives were due to detonate simultaneously, causing an explosion that would destroy Kessel itself. In order to save the planet, the group decided to fly fighters through the tunnels and launch mechanically timed thermal detonators to set off the explosives in a controlled sequence that would leave the planet intact. Not wishing to involve the Galactic Alliance government, Calrissian approached former pilots of his acquaintance for assistance. Stele's experience serving at the Garrison Moon made him ideal for the mission and he agreed to take part. Joining such other notable pilots as Wedge Antilles, Derek Klivian, Inyri Forge, Kell Tainer, Cheriss ke Hanadi, Nrin Vakil and Rhysati Ynr, Stele helped to plant detonators on the remaining explosives, which had been located by the sensor drones. The mission was a success and the explosives detonated without destroying Kessel. Calrissian held a celebration to thank all those involved in the operation before they departed the planet."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Due to Kerek's kidnapping by Bordali agents, the young Maarek Stele developed a hatred for the Bordali and grew up having to cautiously guard his identity in order to evade being captured himself. His true identity was known only to those closest to him, though even with them, Stele remained unwilling to discuss what had happened to his father. During his early Imperial service, Stele would remain somewhat insular, picking his friends and confidants with great care. Despite this, Stele developed a surprising friendship with Admiral Mordon, coming to view the older officer as something of a father figure and feeling free to speak his mind around him. After leaving the Vengeance Stele found little time to get to know his fellow pilots and frequently tired of inter-pilot banter, leading him to become even more isolated, with few others he considered friends."}, {"tag": "p", "text": "Despite the need to maintain caution, Stele found it increasingly difficult to keep a low profile. He sought the exhilaration provided by participating in swoop races and, although he raced under an alias, he was willing to take the risk of being discovered as a result. Though Stele's involvement with the swoop gangs allowed him to develop his piloting abilities, it was ultimately the cause of his discovery by the Bordali. Even so, his love of flying remained and after joining the Empire he found a sense of freedom while in the cockpit of a starfighter and that it helped him to forget his problems. As a seasoned veteran of many battles Stele grew to be a stronger, tougher man than when he left Kuan. Originally black-haired, Stele lost his hair sometime before leaving Imperial service, but Leia Organa Solo still saw him as vital, if somewhat brooding, when they met in 43 ABY."}, {"tag": "p", "text": "Stele had an understanding of science and astrophysics that he inherited from his father and, during his time as a swoop racer and later an Imperial mechanic, demonstrated his skills as an engineer in maintaining and upgrading both his own swoop and Imperial starfighters. His desire to learn helped him take quickly to his TIE pilot training and he soon became proficient. During his training Stele learned to contain his natural inquisitiveness after being given extra duty several times for asking too many questions."}, {"tag": "p", "text": "Stele knew of the Empire growing up, hearing tales of its brutal efficiency and, upon being captured by Imperial forces, he expected a short life. In this he was mistaken and, as he came to see more of the Empire, he began to feel drawn to its promises of stability and order and came to think of his former life as insignificant. At first Stele believed firmly that the Empire brought peace, order and prosperity and that the Rebels were little more than bloodthirsty pirates trying to subvert the Imperial ideal. Over time he came to develop doubts about why he should hate the Rebellion and began to see that having complete faith in a system was unwise. The excitement he once experienced in killing Rebels started to fade and he saw it as nothing more than duty. Even the death of Harkov, who he had hated for his involvement in Mordon's murder, brought Stele little pleasure."}, {"tag": "p", "text": "Though he was honored to be singled out by the Secret Order, Stele was a somewhat reluctant servant and wished that he could simply fly a starfighter and not get involved with larger events. Over time he came to think of himself as a pawn in events over which he had no control. His involvement with the Order exacerbated Stele's isolation from his fellow pilots. By the time he was transferred to the Shamus he was getting a reputation for exceeding orders as he carried out his instructions for the Order. Since he rarely got punished for his apparent lack of discipline and had been apparently rewarded with rapid promotions he started to feel resentment from the other pilots and they tended to leave him alone."}, {"tag": "p", "text": "By the time Trace told Stele the truth about who he was, Stele was almost at breaking point. He had doubts about whether the Imperial ideal truly existed, yet his opinion of the Rebellion had changed little. He started to feel that everybody wanted something from him and he didn't know what he believed anymore. His doubts only grew when he was reunited with his father, the euphoria of the moment shattered by Kerek's disapproval of Stele's career. Stele would continue to fight an internal battle over his loyalties until his father's situation ensured his continued Imperial service. Even then he would continue to question the Empire until joining the 181st rekindled his belief in the Empire."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "Stele first began to develop his piloting abilities on his homeworld, where he displayed a talent for swoop racing, performing high-speed stunts amid the high-rise buildings of war-torn Kuan. As a mechanic aboard the Vengeance, Stele had the opportunity to conduct test flights in Imperial starfighters. His experience with swoop bikes made him a natural pilot and he survived his first taste of combat against four Rebel starfighters despite having no formal training. After becoming a TIE pilot, Stele quickly became an ace and his piloting skills helped to bring him to the attention of the Secret Order of the Emperor as potentially Force sensitive. Stele was also proficient in the use of blaster pistols, blaster rifles and vibroweapons."}, {"tag": "p", "text": "On multiple occasions early in his career, Stele experienced visions and strong feelings which he could not explain. After Stele and his mother were first captured by the Galactic Empire, Stele's decision to join the crew of the Vengeance rather than return to Kuan to search for his father was influenced by an inexplicable sense that Kerek was no longer in the Taroon system and that serving the Empire would lead him to his father—a feeling that was eventually proved correct when the two were reunited aboard the Glory. In one early vision, Stele saw his future as a bright light at the end of a tunnel, though he wasn't sure whether this represented a bright future in the Imperial Navy or an explosive death. Occurring frequently as dreams while he slept, the strange images Stele saw left him confused, though one consistent factor in his visions was Palpatine's voice, seemingly filling his mind. At least one other Emperor's Hand, Mara Jade, was known to be contacted telepathically by the Emperor."}, {"tag": "p", "text": "After the Secret Order, a shadowy organization who utilized the dark side of the Force, began his official training, Stele's Force talents developed rapidly. Stele soon showed the ability to affect the minds of others, enhance his abilities, sense events around him and manipulate objects. He learned to use his affinity with the Force to enhance his piloting abilities, using it to probe the minds of enemy pilots for weaknesses and to anticipate their actions. Aided by the Force, Stele could utilize a starfighter as effectively as other Force users wielded a lightsaber."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his time with the swoop gangs on his homeworld, Stele operated a racing swoop which he used in competitions against other racers. Stele's swoop was fitted with a modified gyro-servo sensor array during his final stunt competition. After becoming a pilot in the Imperial Navy, Stele had the opportunity to fly several models of Imperial starfighter, including the widely used TIE Fighter, TIE Interceptor and TIE Bomber. Stele realized early in his career that his best chance of survival was to have a better starfighter than his enemies, and that only the best pilots were given that opportunity. As his career progressed, Stele was given the opportunity to use the more powerful Assault Gunboat and TIE Advanced, starfighters that were equipped with shield and hyperdrive systems. He also received advanced training in the TIE Defender and was among the first pilots to use the starfighter in combat. When the Missile Boat was introduced to counter the TIE Defender after it fell into enemy hands, Stele was one of only a few pilots to use it in battle before they were put into protective storage."}, {"tag": "p", "text": "In flight, Stele was equipped with the standard Imperial flight suit, a black oversuit and helmet which provided life support. When not engaged in flight operations, Stele wore an Imperial officer's uniform, complete with rank insignia plaque. When participating in ceremonies with the Secret Order of the Emperor, Stele would wear a dark-colored cloak. Stele was typically armed with a blaster pistol."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Maarek Stele is the official player character in the 1994 LucasArts video game Star Wars: TIE Fighter and its subsequent expansions Defender of the Empire and Enemies of the Empire. Although not identified by name in the game his position as the player character was established in the accompanying novella The Stele Chronicles and later TIE Fighter: The Official Strategy Guide which covered his personal story before and during the events portrayed in the game. If the player's fighter is destroyed during a mission and Stele ejects in time, the player will see one of two cutscenes depicting either Stele receiving medical treatment after being recovered by Imperial forces or being taken to a Rebel prison after being captured by the enemy. In the event that the auto ejection system fails, the player sees a cutscene showing Stele's funeral. The after-action reports in TIE Fighter: The Official Strategy Guide, which describe how each mission plays out, confirm that none of these events occur."}, {"tag": "p", "text": "Stele later appeared in the 2003 MMORPG Star Wars Galaxies: An Empire Divided as a non-player character (NPC) in Game Update 20. Rebel players who requested Tier 7 Duty Missions from certain space stations had a chance to battle an elite Imperial pilot during the mission's boss stage. One of these pilots could be Maarek Stele. If the player defeated Stele, the Imperial was not destroyed. Instead, a message was displayed to the player, indicating that they successfully defeated the pilot. The player then received a collection icon which added up to award a badge if they succeeded in destroying all ten of the elite Imperial pilots. However, elite Imperial pilots could also be found flying in various space battles, which took place in the Naboo, Tatoo, Corellian, Dantooine, and Karthakk systems. Because Stele only appeared in the space portion of Star Wars Galaxies, originally added with the Jump to Lightspeed expansion pack, he could normally only be seen inside his respective TIE Oppressor. However, a comm display could appear during the battle, displaying Stele's face. In addition, the collection icon depicted Stele's physical appearance. Although players could choose not to participate in any of the battles or collections connected to Stele, this article assumes 100% game completion."}, {"tag": "h3", "text": "Discrepancies"}, {"tag": "p", "text": "In Star Wars: TIE Fighter, Emperor's Hand is depicted as a senior rank in the Secret Order of the Emperor. After becoming an Emperor's Hand, the player can continue to achieve the ranks of Emperor's Eyes, Emperor's Voice and Emperor's Reach. However, the Hyperspace-exclusive article Evil Never Dies: The Sith Dynasties states that Merili and Triclops are the only two people to hold the rank of Emperor's Eyes, ruling Stele out from holding that rank. The Star Wars Gamer 5 article The Emperor's Pawns states that Stele became an Emperor's Hand, and Joe Corroney's accompanying illustration depicts Stele with the tattoo of an Emperor's Reach, confirming his promotion to that position. Evil Never Dies: The Sith Dynasties also states that only one Emperor's Reach ever reached the position through the Secret Order, and, since this is how Stele's promotion is depicted in the game, it can be assumed that this is referring to him. Due to the contradiction between the game and other Legends sources, it remains unclear whether Stele ever held the rank of Emperor's Voice."}, {"tag": "p", "text": "On the back cover of TIE Fighter: The Official Strategy Guide, Maarek Stele is referred to as Tan Stele. No explanation was given for the use of this name, and the character is not referred to as Tan anywhere else in the book. When Abel G. Peña wrote The Emperor's Pawns he tied this apparent mistake together with a similar reference to Anakin Skywalker as Tan Skywalker from a 1978 newspaper comic strip, introducing a retcon that established Tan as a title held by both Stele and Skywalker. Peña has stated that he considers Stele to be among a small group of \"good\" Imperials, along with Grand Admiral Osvald Teshik and Captain Xamuel Lennox, who make the most of ethically difficult situations."}, {"tag": "p", "text": "An image of Maarek Stele by Keith Carter appeared in the 1995 Topps Star Wars Galaxy Series 3 trading cards. The image showed Stele as a bald, older pilot, and bore little resemblance to the later image of him found in The Emperor's Pawns. This discrepancy was discussed in Leland Chee's blog on StarWars.com. However, Stele's appearance in Aaron Allston's 2009 novel Fate of the Jedi: Outcast reconciled this discrepancy, confirming that he lost his hair prior to 43 ABY."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}