{"url": "Mack_Jasper", "categories": ["Category:Legends articles", "Category:Corellian Security Force officers", "Category:Corellians", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Mack Jasper"}, {"tag": "p", "text": "Mack Jasper was a Human male who lived on Corellia during the Galactic Civil War. He was a proficient officer of the Corellian Security Force."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "By the time following the Battle of Yavin, Mack Jasper was a lieutenant of the Corellian Security Force, stationed in Coronet City. He was a friend of the CorSec agent Hurley Klakk."}, {"tag": "p", "text": "Working for CorSec, Jasper once tried to arrest an undercover ISB agent, who carried the Codex of Tython, an item of value for the Alliance to Restore the Republic. However, the Imperial was not ready to give the item up, and after a brief fight Jasper was disarmed and defeated. The agent was in a hurry, so he simply left Jasper sitting on the ground and went on his business."}, {"tag": "h3", "text": "The Rogue Corsec plot against the Diktat"}, {"tag": "p", "text": "Around the same time, Lieutenant Mack Jasper led an investigation to prove the innocence of the Corellian Head of State, Diktat Daclif Gallamby."}, {"tag": "p", "text": "Circa 1 ABY, Jasper went to work with a spacer who was highly recommended by Colonel Panaka of the Royal Naboo Security Forces. For a first mission, Lieutenant Jasper tasked the spacer to investigate vandalism in the Coronet Starport. The spacer identified the Ragtags as responsible, hoping to blame the Meatlumps and get them into trouble."}, {"tag": "p", "text": "Lieutenant Jasper once asked the spacer to investigate a missing shipment of starship components ordered by the company known as Ral Mundi's Starship Emporium. The spacer discovered that the shipment was stolen by the Ragtag gang and was able to retrieve it in the Coronet Capitol. More strikingly, the spacer also found a crate of illegal spice. The spacer reported to Lieutenant Jasper who decided to investigate the case. The spacer thus infiltrated the Capitol and worked for Gallura Handerin, a government aide, and Brantlee Spondoon, the aide to the Diktat. During that time, an informant contacted Spondoon to discuss a plot against the Diktat. Even if the Rogue CorSec managed to assassinate the informant in a Coronet warehouse, Lieutenant Jasper and the spacer discovered the Rogue CorSec implication in that plot. From one of Jasper's informant named Jonset, the spacer later learnt that the Rogues were working with the Ragtags. The spacer thus attacked one of their secret meeting and finally discovered in a computer an order, apparently from the Diktat himself, instructing the Ragtags to smuggle spice into the Capitol. Lieutenant Jasper immediately ordered to search the Diktat's office and the spacer found a remote relay device on the Diktat's personal data terminal. With this device, people were able to send files from a remote location and make them appear as originating from the terminal to which the device was attached. A gadget specialist easily identified the device and Jasper therefore understood that someone had sliced the Diktat's terminal to plant the orders to smuggle spice. The gadget specialist also helped Lieutenant Jasper to localize the origin of the transmission. The spacer tracked the signal to the Rogue CorSec Base and infiltrated the base. The spacer downloaded proof of the Diktat's innocence and finally killed Hiram Bish and Mtara Vinram, the Rogue CorSec commanders who were responsible for the plot. The grateful Diktat awarded the Corellian Medal for Distinguished Service to the spacer for the service and Lieutenant Jasper delivered himself the medal to the spacer."}, {"tag": "p", "text": "After those events, Lieutenant Jasper proposed to the spacer to go working for other CorSec officers, Lieutenant Joth and Major Walden."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mack Jasper appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online-role playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011."}, {"tag": "p", "text": "Mack Jasper was added to the game with the expansion Star Wars Galaxies: Trials of Obi-Wan, released on November 1, 2005. He was part of questline that featured the Rogue CorSec plot against the Diktat. This story arc was later slightly revamped with the release of the \"Publish 27\", on February 15, 2006, as the questline was integrated into the \"Legacy Quest\", the main questline in the game."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}