{"url": "Macrobinoculars/Legends", "categories": ["Category:Legends articles", "Category:Technology stubs", "Category:Binoculars"], "nodes": [{"tag": "h1", "text": "Macrobinoculars"}, {"tag": "p", "text": "Macrobinoculars were handheld viewing devices that allowed users to observe distant objects. Some models were able to see into space from the surface of a planet."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "Macrobinoculars were small devices with two cushioned eyecups and a top-mounted rangefinder. The standard pair of macrobinoculars included an internal readout that provided information on distance and elevation, and many could record and play back images. Although macrobinoculars were designed to be used either during the day or at night, some models specialized in the latter, such as the Nightview macrobinoculars introduced by Naescorcom."}, {"tag": "p", "text": "Macrobinoculars were commonly thought of as inferior to electrobinoculars, as they lacked image-enhancement chips, and some did not come with light-adjustment circuitry. However, they were cheaper than electrobinoculars and more readily available in remote areas such as the Outer Rim Territories. Their resilience made them a popular choice among mercenaries. Some macrobinoculars were worn by clone troopers over helmet visors, often with polarized lenses."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Compact macrobinoculars were used by members of the Jedi Order while on field missions across the galaxy. Obi-Wan Kenobi carried a pair of these spyglasses with him prior to and during the Clone Wars. Following the attempted assassination of Padmé Amidala, Obi-Wan tracked Jango Fett to Geonosis. There, he spied on a meeting between Count Dooku and the leaders of the newly formed Confederacy of Independent Systems. During the final days of the Clone Wars, Obi-Wan again used his macrobinoculars to spy on a Separatist meeting between General Grievous and the Separatist Council members in Pau City, prior to their escape from Utapau."}, {"tag": "h2", "text": "Notable models"}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}