{"url": "Madurrin", "categories": ["Category:Legends articles", "Category:Anx", "Category:Females", "Category:Galactic Alliance individuals", "Category:Jedi Knights of the New Jedi Order", "Category:New Republic individuals"], "nodes": [{"tag": "h1", "text": "Madurrin"}, {"tag": "p", "text": "Madurrin was a female Anx Jedi Knight who trained at Luke Skywalker's Jedi Praxeum on Yavin 4. During the Yuuzhan Vong War, she was assigned to the bridge of the Mon Adapyne due to her size making her unsuitable to fly a starfighter. As a Jedi, she was able to tap into the Force meld created by other Jedi fighting in the war and relay messages to those on her starship to coordinate attacks. In this capacity, she fought in the Second Battle of Obroa-Skai and the Battle of Ebaq. Following the conclusion of the war, she decided to continue to serve the Alliance Military under Supreme Commander Traest Kre'fey."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Madurrin was a female Force-sensitive Anx and was trained as a Jedi at the Jedi Praxeum on the moon of Yavin 4 by Luke Skywalker, a Jedi Master and founder of the New Jedi Order. In 28 ABY, Madurrin was a Jedi Knight and served aboard the Mon Adapyne, an MC80B Star Cruiser, in the Yuuzhan Vong War, an invasion by an extragalactic species known as the Yuuzhan Vong. While onboard the Mon Adapyne, Madurrin was under the command of Jedi General Keyan Farlander and used her abilities to tap into a Force meld with other Jedi on starships and starfighters to relay information on the coordination of battle plans. In this role, she also used battle meditation to focus and synchronize the attacks of New Republic forces. From the bridge of the Mon Adapyne, she served in the Second Battle of Obroa-skai, an attempt to ambush a fleet carrying the Yuuzhan Vong's leader, Supreme Overlord Shimrra Jamaane. The attack was a success, soundly defeating the Yuuzhan Vong, despite their use of two yammosks, creatures that guided and coordinated the Yuuzhan Vong forces. However, Shimrra was not with the fleet, and despite their victory, their goal of killing the Yuuzhan Vong leader failed. Believing that the defeated Yuuzhan Vong forces had signaled for reinforcements, General Farlander ordered the Mon Adapyne to retreat from the area."}, {"tag": "p", "text": "Madurrin was still on board the Mon Adapyne when it was called to the moon of Ebaq 9. The moon was a hyperspace dead end ideal for trapping starships, and the New Republic was gathering there to set up an ambush of Yuuzhan Vong forces. Madurrin and the Mon Adapyne stayed in orbit above Ebaq 9 to draw in the Yuuzhan Vong fleet, while other New Republic forces nearby waited to hyperspace jump into the system. The Yuuzhan Vong did as anticipated, drawn into the system by the Mon Adapyne and its complement. Madurrin coordinated the defense with battle meditation, drawing the Yuuzhan Vong further into the trap. Once the Yuuzhan Vong had spread out, the rest of the New Republic fleet arrived to hit them from behind. Having fallen into the trap, the Yuuzhan Vong were completely wiped out, earning a decisive victory for the New Republic."}, {"tag": "p", "text": "A year later, in 29 ABY, Madurrin was stationed aboard a capital ship defending the world of Mon Calamari. Desperate Yuuzhan Vong forces, hoping to strike a decisive victory against the newly formed Galactic Federation of Free Alliances at their capital on Mon Calamari, headed towards the planet. However, shortly after beginning their attack, the Yuuzhan Vong called a retreat due to the arrival of Zonama Sekot, a living planet revered by their people. Madurrin, alongside fellow Jedi, Cilghal, Kenth Hamner, Mara Jade Skywalker, and Luke Skywalker, boarded the starship, Jade Shadow and headed to a meeting at the planet Contruum Six, where the Alliance was organizing a plan of attack to liberate Coruscant, the former capital of the Alliance conquered by the Yuuzhan Vong. Madurrin agreed to continue to serve aboard a capital ship in the attack on Coruscant. Following the Alliance's victory at Coruscant, Madurrin headed to the Conclave on Zonama Sekot, where Grand Master Luke Skywalker spoke about a new direction for the Jedi Order. Following this, Madurrin decided to continue to serve with the Alliance military, under Supreme Commander Traest Kre'fey and General Keyan Farlander."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Madurrin was an Anx with green skin, and her height of over four meters made her tower over most other species. As a member of the Jedi Order, Madurrin fought in the Yuuzhan Vong War, aiding her fellow Jedi in attacks against the Yuuzhan Vong. She was unable to pilot a starfighter due to her substantial height, and instead served on the bridge of capital ships. Following the war's conclusion, she believed that she could do the most good by continuing to serve with the Alliance military."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a Jedi, Madurrin had access to the Force and could use it to tap into a Force meld, supporting her fellow Jedi. On board the Mon Adapyne, Madurrin was able to use battle meditation to guide ships into coordinated attacks. She was able to pour support and comfort through the Force to calm fellow Jedi that were in battle with Yuuzhan Vong forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Madurrin was created by Walter Jon Williams for use in the 2002 novel, The New Jedi Order: Destiny's Way, part of The New Jedi Order book series. In his first draft of the novel, Walter Jon Williams had Madurrin's role taken by a Melodie Jedi, who he was later told died in an earlier book (therefore, most likely Lyric). Someone at Lucasfilm Ltd. then suggested he use an Anx, which became Madurrin."}, {"tag": "p", "text": "Although no illustration of Madurrin was included in Destiny's Way, in The Essential Chronology published in 2000, an unidentified Anx was included in a picture titled, \"the Jedi Praxeum\" next to a description of the founding of Luke Skywalker's Jedi academy. Walter Jon Williams believed it was possible that the previous illustration was tied into Lucasfilm suggesting an Anx for his novel, making Madurrin a student at the Jedi Praxeum. On the StarWars.com Message Boards, Leland Chee confirmed this speculation that the original picture depicted Madurrin and stated that it is assumed by him and the Holocron continuity database that they are the same individual. This connection was referenced in Madurrin's entry in The Complete Star Wars Encyclopedia, which stated that she was \"trained by Luke Skywalker\". However, speculation that the picture from The Essential Chronology retconned Madurrin as a member of the original twelve members of the inaugural class was not confirmed in her entry, and Leland Chee has only confirmed that the picture depicts Madurrin, which is not labeled as a picture of the inaugural class."}, {"tag": "p", "text": "Another picture of an Anx Jedi appears in Jedi vs. Sith: The Essential Guide to the Force, in an illustration depicting the Conclave on Zonama Sekot. This picture was used to represent Madurrin in The Complete Star Wars Encyclopedia."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}