{"url": "Maelstrom_(warship)", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Battlecruisers", "Category:Flagships", "Category:Galactic Republic starships"], "nodes": [{"tag": "h1", "text": "Maelstrom (warship)"}, {"tag": "p", "text": "Maelstrom was a Galactic Republic warship which served in the Clone Wars."}, {"tag": "h2", "text": "Characteristics"}, {"tag": "p", "text": "The Maelstrom was a relatively large capital ship, and part of the Maelstrom-class battle cruiser line."}, {"tag": "p", "text": "The ship had a winged spaceframe, suggesting a dagger-hulled Star Destroyer design. She had a bank of main engines at the stern, and powerful bow thrusters, designed for use during atmospheric entry and planetary landing—although this was a role that she was rarely called on to perform."}, {"tag": "p", "text": "Maelstrom was described as a cruiser—sometimes a battle cruiser or command cruiser—and was capable of leading a small fleet. Although she could also be referred to as a gunship, this term was applied to at least some small cruisers, such as the contemporary Carrack-class light cruiser. Her known service history is confined to the closing stages of the Clone Wars, when she was commanded by a Jedi General with a crew seemingly composed entirely of clone troopers, making it likely that she belonged to one of the new dagger-hulled warship classes associated with the Grand Army of the Republic."}, {"tag": "p", "text": "Weapons carried by the Maelstrom included a powerful turbolaser battery, capable of devastating planetary bombardment, and also proton torpedo tubes: as many as one hundred torpedoes could be fired in a single salvo. A powerful tractor beam array, capable of grappling other large capital ships, was positioned on the dorsal hull, just above the bow, in an emplacement that also carried the forward turbolaser battery."}, {"tag": "p", "text": "Hangar bays ran along the length of the hull, normally sealed by external hatches, from which the cruiser's starfighters could be deployed, and which also contained other small vessels, such as the commanding officer's personal starfighter, and a hyperdrive-equipped combat shuttle, the Squall. Internally, the docking complex was built around a large main hangar, with subsidiary bays connected by turbolift, such as the secondary shuttle bays where the Squall was docked."}, {"tag": "p", "text": "The Maelstrom was clearly capable of deploying ground troops for surface assaults, but the ground force she carried may not have been large. Her primary missions seem to have been space combat and orbital bombardment and the only infantry unit explicitly mentioned in her crew is a squad of elite ARC troopers, assigned as the Jedi General's personal guard."}, {"tag": "p", "text": "Gunships with clone pilots formed part of the fleet led by Maelstrom at the Battle of Kromus, possibly LAAT/i troop transports, but perhaps space-combat blastboats like the Skipray, or even small capital ships."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "When the Jedi Masters and Padawans of the Almas Academy were ordered to the front line during the Clone Wars, the Maelstrom was sent to the Cularin system to collect them. A number of the senior Jedi took the Right of Denial, resigning their status rather than serve in a war, leaving Jedi Master Darrus Jeht as the ranking member of the Order among those who boarded the Maelstrom and left the system."}, {"tag": "p", "text": "While the other Jedi were deployed to various military postings, Jeht took command of the Maelstrom and a fleet of smaller warships, assuming the rank of Jedi General in the Grand Army of the Republic, and possibly also the position of captain aboard the cruiser itself."}, {"tag": "h3", "text": "Battle of Kromus"}, {"tag": "p", "text": "After a few months of combat, Maelstrom was ordered to the Kro'eval system, where the Confederacy of Independent Systems were developing a superweapon platform known as Starkiller."}, {"tag": "p", "text": "In the opening stages of the battle, Jeht used a feint to draw away the defending CIS fleet, so that Maelstrom could enter orbit above Kromus unopposed, and bombard the Separatist facility on the surface, where the Starkiller was being constructed. At this point, however, the crew of the cruiser discovered that the data on Kromus had been swapped with the neighboring planet, Kromol. Rather than a facility on an uninhabited rock, the shipyard was in a city of two million people on a planet with a population of 1.3 billion."}, {"tag": "p", "text": "When the ship's sensors registered the Starkiller lifting off from the surface, Jeht gave the order to fire. The destruction of the superweapon obliterated the city and its population in less than a minute, and triggered a cataclysm that engulfed Kromus, igniting the atmosphere and shattering the crust, and ultimately killing more than a billion sentients."}, {"tag": "p", "text": "The Maelstrom and her fleet were recalled to Coruscant in order for General Jeht to account for his actions. This, he discovered, consisted of only a private interview with Supreme Chancellor Palpatine, who surprised Jeht by praising his resolve and his ability to take difficult decisions. Flattered, but somewhat confused, Jeht took his flagship back to Cularin, to consult with the other Masters of the Almas Academy."}, {"tag": "h3", "text": "Battle of Cularin"}, {"tag": "p", "text": "Subsequently, the Maelstrom continued to serve on the front line, with Jeht continuing to be impressed by the accuracy and insight of Palpatine's leadership, but still plagued by memories of the destruction of Kromus. On the 22nd of Fifth Month, 19 BBY, the cruiser was ordered to attack the CIS mining planet of Corlax 4. The primary objective of the mission was to bombard the planet itself, and wipe out its civilian population of three hundred million: the destruction of the orbital processing facilities and the defending fleet were secondary goals."}, {"tag": "p", "text": "As the Maelstrom prepared for the attack, however, General Jeht learned that the Academy on Almas had been wiped out, and he ordered the cruiser to return to Cularin, inwardly relieved by the decision to defy his orders, but puzzled to learn that the ship was being trailed by a cruiser-sized sensor ghost."}, {"tag": "p", "text": "At this point, Palpatine issued Order 66, initiating the destruction of the Jedi Order. Alerted through the Force by the death of his friend Aayla Secura, General Jeht defeated an ambush by his own ARC troopers, and managed to disrupt long-range communications aboard the Maelstrom, preventing the rest of the crew discovering the situation, and thus retaining command."}, {"tag": "p", "text": "Maelstrom returned to the Cularin system, where she encountered the Republic cruisers Primal and Undaunted, destroying a flotilla of Jedi ships above Almas. Jeht managed to persuade his crew that the cruisers had been taken over by Separatist forces, and defeated them both, only for another ship to drop out of hyperspace on the edge of the system. This was the sensor ghost from Corlax 4, the Shadowblade—apparently the same Starkiller superweapon that they had thought they had destroyed at Kromus."}, {"tag": "p", "text": "Jeht realized how completely he had been manipulated and betrayed, and learned that the Shadowblade was heading for Cularin, presumably with the intention of wiping out the planet. He ordered the Maelstrom to pursue the Shadowblade through the system's asteroid belt, but her turbolasers were out of action after the battle with the cruisers, and her engines were damaged."}, {"tag": "p", "text": "After attempts to ram the enemy ship and attack it with torpedoes failed, the Maelstrom used its powerful bow tractor beam to capture the Shadowblade, dragging into one of the space-time rifts that threaded the Cularin system. In an instant, both ships disappeared from that point in time."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Maelstrom appears in Wizards of the Coast's Living Force (roleplaying campaign) saga."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}