{"url": "Magda_Keto", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Females", "Category:Humans", "Category:Keto family", "Category:Rulers of the Empress Teta system", "Category:Tetans"], "nodes": [{"tag": "h1", "text": "Magda Keto"}, {"tag": "p", "text": "Magda Keto was a Human female who ruled as Queen Mother of the Empress Teta system with her brother, Lord Keto, in the years leading up to the Great Sith War. Keto had a daughter named Aleema Keto who, along with Lord Keto's son Satal, was the heir to the Tetan throne. The Ketos were forced to share their dominion over the system with the commercial interests that controlled carbonite mines in the Empress Teta system. Eventually, Satal and Aleema Keto, filled with anger and resentment and possessing much free time, learned the secrets of dark side Sith magic and formed an organization known as the Krath, determined to wrest control of the system from their parents. The Krath struck while Magda Keto and her brother were on an inspection tour of one of the orbiting Tetan carbonite smelters over the planet Empress Teta. Keto and her brother were caught by surprise, as Satal and Aleema used Sith magic to overpower their protectors. Magda and Lord Keto were then frozen in carbonite by Satal and Aleema, killing them; Satal and Aleema hung the former rulers as decorations in the Iron Citadel, their former palace—and the Krath's new headquarters."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A Human female, Queen Mother Magda Keto was, along with her brother, Lord Keto, the ruler of the Empress Teta system around four thousand years before the Battle of Yavin. Keto and her brother were descendants of Empress Teta, the famous woman warrior who unified the seven worlds of the then-Koros system a thousand years previous. The Empress Teta system was a major source of raw carbonite, and the Ketos were forced to share their power with the commercial interests that ran carbonite mines in the system. Eventually, Magda had a daughter named Aleema. Along with Lord Keto's son, Satal, Aleema was the heir to the Tetan throne. The younger Ketos, filled with anger and resentment toward their elders and with much free time on their hands, formed a darksider organization called the Krath, and learned to wield dark side Sith magic. The Krath launched a rebellion in 3997 BBY, while Magda and Lord Keto were on an inspection tour of an orbiting Tetan carbonite smelter over the planet Empress Teta."}, {"tag": "p", "text": "Magda Keto and her brother met with Bearus, the chairman of the Carbonite Guild. As they exchanged pleasantries, Aleema and Satal, along with their royal tutor Korus, arrived in a shuttle. There, Satal and Aleema revealed that they had turned Korus' tongue into an Adegan eel with Sith magic, and attacked Magda Keto, her brother, and the mining executives. Lord Keto ordered his Royal Protectors to apprehend Satal and Aleema, to Magda's horror; she was outraged that her brother would arrest their own children, but Keto responded that he had no choice. However, Aleema's Sith illusions overpowered the Royal Protectors, leaving Magda Keto and her brother defenseless. They were led by Satal and Aleema toward a vat of molten carbonite, where they were frozen, killing them. The frozen bodies of Magda and Lord Keto went on display as wall decorations in their former palace, the Iron Citadel."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Magda Keto was horrified by her daughter and nephew's attack on the carbonite smelter and their use of Sith magic, but still was opposed to her brother ordering the Royal Protectors to arrest them. She was overcome with fear when she saw what her daughter had done to Korus, asking if it was a disgusting joke."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Magda Keto first appeared in Star Wars: Tales of the Jedi - Dark Lords of the Sith, a story arc of the Tales of the Jedi comic book series, written by Kevin J. Anderson and Tom Veitch and released from late 1994 to early 1995. Magda Keto made her sole appearance in the arc's first issue, where she was killed; she was also indirectly mentioned in Dark Lords of the Sith's second and third issues. In her appearance, Keto was illustrated by Christian Gossett."}, {"tag": "p", "text": "Although she appeared in the comic version of Dark Lords of the Sith, Magda Keto was absent from the Dark Lords of the Sith audio drama. In the audio version her lines were attributed to her brother, Lord Keto. Magda Keto's entry in The Complete Star Wars Encyclopedia incorrectly listed Lord Keto as her husband, not her brother."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}