{"url": "Magick", "categories": ["Category:Canon articles", "Category:Stub", "Category:Culture of Dathomir", "Category:Force philosophies"], "nodes": [{"tag": "h1", "text": "Magick"}, {"tag": "p", "text": "Magick, also known as Shadow Magic, Force magic, or Force sorcery, was a supernatural technique that allowed a practitioner to wield great powers connected to the dark side of the Force. The Nightsister witches of Dathomir were wielders of magick, of which Daka was the most powerful."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The supernatural technique known as magick, which offered great powers from the dark side of the Force, was known for being used by the Nightsisters of Dathomir. Unlike the Jedi, who used the Force to serve the galaxy, the powers of the Nightsisters' magick focused on deception, illusion, and manipulation, serving only themselves. They regarded magick as a living thing which arose from blood, trees, and mist and flowed through their veins as well. Nightsister magick was also called Shadow Magic."}, {"tag": "p", "text": "Mother Talzin was one of the Nightsisters' most powerful witches. Talzin was able to use her magick to heal Asajj Ventress, create a blackroot drink, and transform Savage Opress into an unnatural monster. Talzin was able to combine her magick with voodoo to torture her enemies from afar and communicate with them from afar. Old Daka, who was regarded as the most powerful magick user, was able to use her magic use the Chant of Resurrection to resurrect numerous Nightsisters mummies and bring them back as zombies."}, {"tag": "p", "text": "Following the massacre on Dathomir, Talzin used a great deal of her magick to heal her son, Maul's mind, memories, and equip him with new metal legs. She was successful but soon became trapped in the spirit world. Talzin attempted to return to the physical world by using a sphere supplied by the Frangawl Cult but failed due to interference from Jedi Master Mace Windu and Naboo representative Jar Jar Binks. Despite the setback, Talzin was able to stay in contact with Maul by appearing as a green mist. Talzin attempted to regain her physical body by using Dooku as a sacrifice. At first, she was successful, but she was ultimately killed by General Grievous."}, {"tag": "p", "text": "When Jedi Padawan Learner Cal Kestis explored Dathomir in search for a Zeffo Astrium, Nightsister Merrin used magick to reanimate her dead sisters in an attempt to stop him from trespassing. She used it again to immobilize Fallen Jedi Master Taron Malicos and bury him alive in the Tomb of Kujet. She also possessed the ability to teleport through the use of magick."}, {"tag": "p", "text": "The last Nightsister, Shelish, described Nightsister magick very similarly to the Force: as a living thing that arises from blood, trees, and mist. Anyone could learn to use magick, so long as they were Force-sensitive, as demonstrated by the Smuggler; however, first, they must breathe in a special energized mist which transforms the blood into ichor. The ichor, which appeared as a green mist, could then be used in the magicks. A special talisman was used during the ritual to energize said mist."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}