{"url": "Magma_pebble", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Projectiles", "Category:Yuuzhan Vong weapons"], "nodes": [{"tag": "h1", "text": "Magma pebble"}, {"tag": "p", "text": "Magma pebbles were non-organic thrown weapons utilized by the sentient Yuuzhan Vong species during their invasion of the galaxy in the Yuuzhan Vong War. Consisting of a shell filled with a thumbnail-sized glob of magma, the pebbles were primarily used to counter the battle droids that the Yuuzhan Vong warriors encountered while fighting, as the magma contained within could heavily damage the circuits and armor of droids."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Magma pebbles, unlike the majority of weapons of the sentient Yuuzhan Vong species, were inorganic in nature and consisted of a hard shell containing a thumbnail-sized glob of magma. Small enough to fit in the palm of a humanoid's hand, magma pebbles heated up due to any agitation, such as throwing them, which would cause them to shed their shell and unleash their payload of molten rock. The magma contained within the white and orangey–red pebble was potent enough to eat through the outer casing of a YVH-Series battle droid and destroy the inner circuits within minutes."}, {"tag": "h2", "text": "Usage"}, {"tag": "p", "text": "Magma pebbles were the most utilized non-organic weapon for the warriors of the Yuuzhan Vong and were mainly used as thrown weapons against droids. The magma contained within the pebble was effective at eating into the armor of droids and disabling and destroying them. Magma pebbles were hurled at the opponent, with the shell dissolving in midair or breaking open on impact to release the magma. In addition to their effectiveness against droids, magma pebbles could also be used on organic lifeforms, as the molten payload could cause extensive and severe burns."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In use by 27 ABY, during the Yuuzhan Vong War, when the extra-galactic Yuuzhan Vong invaded the galaxy of the New Republic, magma pebbles were used by the warrior caste against the droids that were deployed against them in battle. That year, the bridge crew of the Yuuzhan Vong frigate Exquisite Death employed magma pebbles and organic thud bugs in a fruitless attempt to stop the YVH-Series battle droid 2-1S during a seizure of the ship by members of the New Jedi Order, though the assault left the droid's laminanium armor pitted. Magma pebbles nevertheless proved very effective during the war in damaging YVH droids, which were designed specifically to combat Yuuzhan Vong warriors."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Magma pebbles first appeared briefly in Troy Denning's novel Star by Star, a 2001 installment of The New Jedi Order series. Although magma pebbles were mentioned in 2002's The New Jedi Order Sourcebook, the subject was only later fleshed out in issue 111 of The Official Star Wars Fact File, released in 2004. The weapon also received an entry in The Complete Star Wars Encyclopedia, published in 2008. However, the encyclopedia entry states that magma pebbles were filled with plasma, rather than magma, as stated in the Fact File. This articles treats the Fact File information as being correct, considering it goes into more detail regarding magma pebbles."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}