{"url": "Magnetic_pulse_(warhead)", "categories": ["Category:Legends articles", "Category:Galactic Electronics products", "Category:Ion weaponry", "Category:Missiles"], "nodes": [{"tag": "h1", "text": "Magnetic pulse  (warhead)"}, {"tag": "p", "text": "The Magnetic pulse, also known as the Mag Pulse Warhead or Mag Pulse Torpedo, was a highly specialized missile-type projectile that inflicted no permanent damage upon impact but instead disabled its target's weapons systems to leave it vulnerable."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Its capabilities relied on a highly concentrated magnetic core. Upon impacting an enemy ship, an electromagnetic pulse drained most of its weapon subsystems' power, leaving it operating at only 25% efficiency for an extended period of time. While similar to an ion cannon in this regard, the mag pulse warhead's advantage was that it could bypass full-strength shields to incapacitate targets. However unlike ion weapons, a mag pulse warhead left a craft's propulsion intact"}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Magnetic pulse warheads were developed by Galactic Electronics for the Rebel Alliance to use on modified B-wing starfighters after the Battle of Hoth. The firm violated Imperial law by developing new weapons without informing the Imperials first, and selling these to the Rebels was treason. Admiral Zaarin led a force spearheaded by Maarek Stele which captured the firm's Pondut research facility. However the Imperial forces did not seem to be successful in harnessing the mag pulse weaponry for own use after that engagement."}, {"tag": "p", "text": "Zaarin later attempted to overthrow the Emperor and launched a series of attacks in the Omar system to destroy the TIE Avenger production facilities. During this campaign, Rebel forces in the area used mag pulse warheads against the loyalist Imperial \"Rope 17\" convoy which was resupplying factory ZA-13. Admiral Thrawn and Stele traced the Rebel raiders back to space station RS-32 and launched a successful assault to capture it, gaining the valuable mag pulse technology."}, {"tag": "p", "text": "Zaarin used this opportunity to trap Thrawn's flagship Sceltor and sent the Strike Cruiser Serpent to destroy his nemesis. While Thrawn's Victory I-class Star Destroyer was nominally the more powerful vessel, Zaarin's cruiser had the advantage since it approached from the rear where most of the Star Destroyer's turbolasers had a poor firing arc. However this move backfired when Stele used a Mag Pulse torpedo to disable the Serpent just as it moved into firing range of the Sceltor. The Strike Cruiser instead found itself temporarily incapacitated and its shields gradually worn down by the hammering of Thrawn's flagship. By the time the mag pulse effects had worn off, Stele eliminated the remainder of the Serpent's shield and disabled it with his TIE Defender's ion cannons. With the main threat to the Sceltor eliminated, Stele then used the remaining mag pulse warheads against the Interdictor Grappler and the Nebulon B2 Modified Frigate Shadow, disabling each warship and then surgically destroying their turbolaser turrets, making them easy targets for the Sceltor's three TIE Bombers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}]}