{"url": "Magnus_(Galactic_War)", "categories": ["Category:Legends articles", "Category:Males", "Category:Rakghouls"], "nodes": [{"tag": "h1", "text": "Magnus  (Galactic War)"}, {"tag": "p", "text": "Magnus was the captain of the cruiser Stardream during the Galactic War between the Galactic Republic and the Sith Empire. Serving on Taris before he commanded the Stardream, Magnus and his crew were ferrying passengers from Ord Mantell when an outbreak of rakghoul plague caused the ship to crash on Tatooine. Transformed into a rakghoul, the captain prowled the wreckage of the ship in the Dune Sea until he was killed by an unknown individual."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Before he assumed command of the starliner, Magnus was stationed on the ruined world of Taris, where he encountered the vicious rakghouls. Some point in his life, he met a woman named Yllen, and the two married and had a daughter named Amy."}, {"tag": "p", "text": "By 3639 BBY, Magnus had become the captain of the passenger liner Stardream. He and his crew were ferrying 492 passengers from Ord Mantell when Zama Brak, one of the passengers, smuggled a risp hatchling aboard. The risp had been infected with the rakghoul plague on Ord Mantell by Doctor Sannus Lorrick—an insane Tionese scientist who had released the virus on Kaon—and the rist infected Brak and several other passengers on Deck 2."}, {"tag": "p", "text": "During the journey, Magnus sent several communications to his wife and daughter, telling Amy that a passenger had given him a stuffed orokeet for her. By the fifth day of the voyage, several passengers had fallen ill with what they believed was food poisoning. However, by the seventh day the illness had spread across passenger decks 1 through 5, and the patients were feverish and incredibly strong. Magnus recognized the signs of the rakghoul plague, and told his wife Yllen not to tell his daughter anything. Magnus himself was infected two days later, and became paranoid when the doctors suggested that he rest. He accused the crew of mutiny and locked himself on the bridge, sending the Stardream off-course. By day 12, the infected passengers had begun to gather near the ship's core, and the remaining crew attempted to stop Magnus and retake control of the ship."}, {"tag": "p", "text": "The crew failed, however, as the Stardream crashed-landed on the Outer Rim planet of Tatooine. As the liner broke up over the desert and slammed into the northern end of the Dune Sea, pieces of the wreckage were scattered across the nearby area. Dozens of escape pods were launched, but everyone inside was already infected. Magnus and many other passengers and crew, now completely transformed into rakghouls, survived the crash and haunted the wreckage of the ship, attacking and infecting anyone in the area. Magnus was killed, however, by an unknown individual who took the captain's access codes from his mutated corpse and recovered the captain's logs."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Magnus was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He appeared in the limited time World Event \"Rakghoul Pandemic\" on Tatooine, as part of the Daily Area mission \"Wreck of the Stardream\", available to both Imperial and Republic players from April 15 to April 24, 2012."}, {"tag": "p", "text": "After the player has recovered security access codes from infected security, recovered the ship's security logs, and salvaged two power cores from the wreck, they are asked to lure out and kill Captain Magnus, then take his access codes from his corpse. Magnus could be summoned by accessing a security console at the northeastern end of the wreck, and his level will match that of the player who summoned him. Successfully defeating the captain grants the player the Codex Entry \"Rakghoul Pandemic 2 - Captain Magnus\", a record of Magnus's communications with his wife Yllen and daughter Amy."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}