{"url": "Magus_Jocle", "categories": ["Category:Legends articles", "Category:Articles with gameplay alternatives", "Category:Dark Jedi", "Category:Devaronians", "Category:Males"], "nodes": [{"tag": "h1", "text": "Magus Jocle"}, {"tag": "p", "text": "Magus Jocle was a male Devaronian Dark Jedi leader who lived during the time of the Galactic Civil War. By the time following the Battle of Yavin in 0 BBY, Jocle based himself out of a hideout in the Swamp of Fallen Stars, an area of Yavin 4 which served as a graveyard for much of the debris of the destroyed DS-1 Orbital Battle Station, better known as the Death Star. Eager to learn more about the Rebel pilot who destroyed the Death Star, Darth Vader tasked an Imperial agent with delivering a piece of the Death Star debris to Magus Jocle so that he and his Dark Jedi underlings could use their abilities to read the debris for an imprint of the Force. Not willing to draw the ire of the Dark Lord of the Sith, Jocle agreed to help, and concluded that the debris was giving off strong emanations of the Force. With his usefulness exhausted, Vader instructed his agent to kill Magus Jocle thereafter, in order to eliminate any trail of his inquiries. Regardless, the information gleaned from this investigative work eventually helped Darth Vader reach the conclusion that the Force-user responsible for destroying the Death Star was none other than his own son, Luke Skywalker."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A male Devaronian Dark Jedi by the name of Magus Jocle lived during the time of the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. When the famed Rebel Alliance hero Luke Skywalker destroyed the Death Star during the Battle of Yavin in 0 BBY, debris of the DS-1 Orbital Battle Station rained onto the nearby moon of Yavin 4. Much of the debris ended up in a swamp which became known as the Swamp of Fallen Stars. Magus Jocle, along with a sizeable retinue of fellow Dark Jedi underlings, inhabited a hidden enclave within the swamp. Meanwhile, Dark Lord of the Sith Darth Vader was on assignment at the Emperor's Retreat on Naboo, where he became obsessed with discovering the identity of the Rebel pilot who destroyed the Death Star."}, {"tag": "p", "text": "To that end, Darth Vader enlisted the help of an Imperial operative to chase down various leads. During the course of the investigation, the Imperial operative traveled to Yavin 4 to confront two Rebel pilots, Captain Demaia Maru and Major Osto Elrad. Before being killed by the Imperial agent, the Rebels told a story of a young boy from Tatooine who possessed the powers of a Jedi. Darth Vader dismissed this as a hoax as he himself had scoured the planet years earlier and found no trace of anyone with the slightest Force-sensitivity. Regardless, Vader was interested in pursuing this lead, and instructed his operative to collect a fragment of the Death Star which entered through Yavin 4's atmosphere. Knowing of the nearby enclave of Dark Jedi, Vader further instructed his operative to deliver the debris to their hideout, and convince the Dark Jedi to pool their abilities and read the debris of the Death Star for an imprint of the boy who had been given credit for its destruction. This was no simple task, as the Dark Jedi were aggressive, and attacked the Imperial agent as soon as they entered their enclave. However, Lord Vader's agent was a capable fighter, and managed to fight their way through the Dark Jedi minions to the lower, inner sanctum of the hideout, where Magus Jocle could be found."}, {"tag": "p", "text": "Unlike his accomplices, Magus Jocle was pragmatic, and unwilling to die at Vader's hand. He refrained from attacking Vader's agent, did as he was asked, and inspected the Death Star debris, which he claimed gave off strong emanations of the Force. Jocle had fulfilled his purpose, but Vader was unwilling to show any mercy to the Devaronian. Not wishing to leave a trail of his inquiries, Vader instructed his agent to kill Jocle once his usefulness had been exhausted. As soon as the agent began attacking him, Jocle expressed his dismay, admitting that he should have expected such treachery. Jocle ignited his single-bladed red lightsaber and began fighting back, but to no avail. Despite his knowledge of the Force, and his skill with the lightsaber, Jocle was bested by his Imperial adversary and killed."}, {"tag": "p", "text": "With Jocle eliminated, Vader's operative returned to the Emperor's Retreat on Naboo to report news of the success. Vader felt certain that the Force emanations Magus Jocle detected from the fallen Death Star debris must have been caused by his own presence during the Battle of Yavin. However, Vader admitted that it would have been foolish not to be certain. Vader eventually dispatched his agent to Ben Kenobi's hut on Tatooine, the former home of legendary Jedi Master Obi-Wan Kenobi. There, a strong lingering of the Force was detected through the use of a Nightsister crystal recovered from Dathomir. The crystal detected not just the strong lingering of the Force from Obi-Wan, but also another yet unidentified Force imprint from none other than Vader's own son, Luke Skywalker. Vader was at first puzzled by this revelation, and gave much thought regarding the identity of the mysterious Force-user."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Magus Jocle had red skin, and yellow colored eyes. A proud individual, Jocle did not wish to submit to anyone. However, unlike his underlings, he could be pragmatic. When the operative sent by Vader asked for his services, Jocle did not decline, realizing that opposing the Dark Lord of the Sith would not be a sensible solution. However, his professed sense of pragmatism would actually prove to be his downfall. Despite obliging the demands of Vader and his agent, he was still killed off, in order to eliminate any trail of inquiries."}, {"tag": "h2", "text": "Powers and abilities"}, {"tag": "p", "text": "As a practitioner of the dark side of the Force, Magus Jocle was capable of using Force lightning. He was also a capable duelist, as evidenced by his use of a lightsaber. However, neither his use of the Force nor his skill with a lightsaber were enough to save him from an untimely demise at the hands of Vader's Imperial operative."}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "During his time as a Dark Jedi, Magus Jocle possessed and made use of a one handed lightsaber with a glowing red energy blade. The cylindrical handle of Jocle's hilt was strongly reminiscent of the one fashioned for Anakin Skywalker's second lightsaber. During his time at the hidden enclave on Yavin 4, Jocle wore a Dark Acolyte robe and dark colored boots."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Magus Jocle was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. With the release of Chapter 6.12: Masters of the Wild on September 12, 2007, the Imperial Theme Park was revamped with new quests and content. Magus Jocle was featured in one of these new quests, titled \"Darth Vader's Inquiries: Part II.\" In the quest, Darth Vader tasked players with traveling to Yavin 4 to complete a number of tasks, including fighting and killing Jocle. In the conversation prompt with Jocle, it was possible for players to select an option to peacefully leave Jocle alone. However, the quest progression necessitated killing Jocle, therefore this article assumes 100% game completion. Originally, Jocle was known to spawn under a randomized \"som_dark_jedi_minion\" template, which included various depictions, including a male Nautolan, Mon Calamari, Weequay, Twi'lek and Kajain'sa'Nikto, and a female Zabrak, Trandoshan and Rodian. Some point later, Magus Jocle's appearance template was updated to permanently appear as a male Devaronian. This article assumes the updated depiction to be canon in the Star Wars Legends continuity."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}