{"url": "Magus", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Creatures of Reopi", "Category:Desert creatures", "Category:Hunted creatures", "Category:Insectivorous creatures", "Category:Non-sentient species", "Category:Predatory creatures", "Category:Vertebrates"], "nodes": [{"tag": "h1", "text": "Magus"}, {"tag": "p", "text": "Magus were a peaceful non-sentient species found in the deserts of the planet Reopi. They were hunted for their hide, which they used along with noxious secretions to defend themselves from predators. They hunted reptiles and insects by burrowing."}, {"tag": "h2", "text": "Biology and appearance"}, {"tag": "p", "text": "Magus were a species of non-sentient browsers found in the equatorial red deserts of the planet Reopi, a world in a star system of the Inner Rim. Peaceful and solitary by nature, they survived on a diet of insects and small reptiles, which they hunted by burrowing rapidly through shifting sands using their two rubbery, webbed hind feet. When fully extended, members of the species measured fifty-eight centimeters in length, but they sometimes stood with a hunched posture on their hind limbs, not using their two smaller front limbs for support."}, {"tag": "p", "text": "Besides burrowing, magus possessed several other methods of avoiding or deterring predators like the Reopi sand crusher, including a tough and durable hide, claws on all four limbs, and a gland capable of releasing noxious oil secretions. These secretions were used to maintain suppleness in the outer layers of the creature's hide but also drove off most predators within three or four meters of the magus."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Magus hide was valued as a material on many less technologically advanced worlds, and the creatures were legally hunted for the resource, although under quota regulation and only by private businesses based on Reopi. As one of the last animals hunted for commercial value in the Inner Rim, magus were most vulnerable to hunters while drinking at oases. Their natural defenses and the strict regulation of their hunting protected the magus population from diminishing."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Magus was first featured in Creatures of the Galaxy, a sourcebook for West End Games' Star Wars: The Roleplaying Game released in 1994. The concept and illustration of a magus was provided by Mike Vilardi, while it was designed by Rick D. Stuart."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}