{"url": "Mahara_Kesh", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Je'daii Temples"], "nodes": [{"tag": "h1", "text": "Mahara Kesh"}, {"tag": "p", "text": "Mahara Kesh, the Temple of Healing, was one of the nine Je'daii Temples established by the Je'daii Order on the planet Tython. Constructed between 36,453 BBY and 36,019 BBY, Mahara Kesh was built in the Deep Ocean around the Tho Yor pyramid ship that had brought the first Force-sensitive pilgrims to the sea. The Je'daii who studied at Mahara Kesh focused on the healing arts, and Je'daii Journeyers—young Je'daii who were completing their Great Journey across Tython to visit each of the temples—learned about healing both with and without the Force there. During the conflict in the year 25,805 BBY known as the Despot War, laser cannons were installed on the temple as defensive measures, and by 25,793 BBY the mated Selkath couple of Naro and Calleh were serving as the Temple Masters of Mahara Kesh."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A floating structure in the middle of the Deep Ocean on the planet Tython, Mahara Kesh was constructed around the Tho Yor pyramid ship that had brought the first pilgrims to the Deep Ocean. A rectangular stone island with smooth, steep walls was built around the Tho Yor, with triangular extensions jutting out from each corner that hosted laser cannons. The portion of the temple above that base consisted of several flat platforms that formed a gray-green step pyramid structure, and the tip of the Tho Yor that jutted above the pyramid was topped with a blue crystalline tower."}, {"tag": "p", "text": "Eight smaller pyramids with their own blue towers ringed the Tho Yor, and portions of Mahara Kesh also extended underwater. A number of towers jutted down from the underside of the temple, with a central prong that was larger than the others. The interior of the temple was filled with advanced medical facilities and chambers, as well as various meditation rooms. Many of the rooms that lined the exterior of the temple had wide windows that allowed their occupants to gaze out into the depths of the Deep Ocean."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In the year 36,453 BBY, the Tho Yor Arrival occurred—the eight Tho Yor pyramid starships brought Force-sensitive philosophers, warriors, scientists, artists, and scholars of many species from across the galaxy to the planet Tython and scattered the pilgrims across the surface. One of the Tho Yor traveled to the Deep Ocean, where it sank partially into the ocean and floated there. By the year 36,019 BBY, Mahara Kesh—the Temple of Healing—had been constructed around the Tho Yor by the Je'daii Order, as the pilgrims called themselves, and it was one of the nine Je'daii Temples that had been constructed around or near the eight other Tho Yor. By that time, the Je'daii had established the tradition of the Great Journey, which saw young Je'daii known as Je'daii Journeyers travel the surface of Tython and visit each temple. Mahara Kesh's inhabitants focused their studies on the healing arts, learning and teaching both healing through the Force and healing without it."}, {"tag": "p", "text": "During the Despot War, a conflict that erupted in the Tython system in 25,805 BBY, laser cannons were installed on Mahara Kesh to protect the temple. In 25,802 BBY, the Je'daii Journeyer Lanoree Brock visited Mahara Kesh on her Great Journey sometime after her brother Dalien Brock disappeared while the two were studying at Anil Kesh, the Temple of Science. By the year 25,793 BBY, the mated Selkath couple Calleh and Naro were serving jointly as Mahara Kesh's Temple Masters, and Anil Kesh's Temple Master Quan-Jang was brought to Mahara Kesh along with the Force-sensitive off-worlder Xesh and several other Je'daii who had helped capture Xesh. Mahara Kesh's healers set to work tending to the wounded. Ten days after Xesh and the others were brought to the temple, the Je'daii Council decided to exile Xesh to the moon of Bogan so that he could bring himself back into balance, and despite the protests of the Journeyers who had helped capture him, Je'daii Rangers Rori Fenn and Hawk Ryo took Xesh from Mahara Kesh to Bogan in their Peacemaker-class cruiser."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mahara Kesh was first pictured in the preview issue 0 of the Star Wars: Dawn of the Jedi comic series, and it first appeared in the series' fifth issue. It also received mentions in the tie-in novel Dawn of the Jedi: Into the Void, which was written by Tim Lebbon."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}