{"url": "Mag%C3%A9", "categories": ["Category:Canon articles", "Category:Wookieepedia Good articles", "Category:Administrators", "Category:Females", "Category:Governors of the Galactic Empire", "Category:Individuals of unspecified species"], "nodes": [{"tag": "h1", "text": "Magé"}, {"tag": "p", "text": "Magé was a female governor of the Galactic Empire who worked as an administrator on the planet Allst Prime. When the Rebel Alliance's 61st Mobile Infantry attacked the Imperial outpost on the planet, the governor identified the company's starship and spoke about the rebels over her comlink before being incapacitated by the rebel soldier Brand. Captain Micha Evon and Brand then spoke in the presence of Magé's unconscious body when Brand, who was in reality a bounty hunter, attempted to kill the captain."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "During the Imperial Era, Magé served as the governor and administrator of the planet Allst Prime, leeching off the Galactic Empire while the other residents of the planet were left impoverished. At some point between 2 BBY and 0 BBY, the Rebel Alliance's 61st Mobile Infantry, more commonly referred to as Twilight Company, attacked Allst Prime's Imperial outpost. During the fighting, Micha Evon, Twilight Company's captain who was better known as Howl, entered Imperial headquarters accompanied by the soldier Brand. Magé was able to identify Twilight Company's CR90 corvette, the Thunderstrike, realizing that the company was present on the planet."}, {"tag": "p", "text": "While her aide guarded the door, Magé spoke over her comlink at her office, reporting the presence of Twilight Company and the Thunderstrike. Before she could finish her sentence, Brand, having defeated the aide, entered the office and shot the governor with a dart that left her unconscious and drooling in her chair. Howl had Brand push Magé out of her chair before he looted the governor's desk of her Nabooian whiskey. At that point, Brand pointed her blaster at the captain, intending to reveal her true identity as a bounty hunter and kill Howl for the bounty on his head. The captain, however, was already aware of that fact and dissuaded Brand from bringing him in, making her join Twilight Company permanently. During his exchange with Brand, Howl also jibed Magé's neglect of the people of Allst Prime, jutting at the governor's unconscious body while she snored."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Magé had olive skin and long dark hair, which she wore in a tightly woven bun. She worked out of a wealthy office in the Imperial headquarters, while the other occupants of Allst Prime lived in poverty, with Howl considering the governor a leech with a taste for luxury. When Twilight Company was at the planet, Magé disregarded what the company was attacking when reporting its presence, calling the rebels \"scum.\""}, {"tag": "h2", "text": "Equipment"}, {"tag": "p", "text": "Magé utilized a comlink during the battle on Allst Prime and also owned a bottle of Nabooian whiskey."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Magé appeared in \"Inbrief,\" a short story written by Janine K. Spendlove that was first published in Star Wars Insider 161 on November 10, 2015."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}