{"url": "Main_Vault", "categories": ["Category:Canon articles", "Category:Structure stubs", "Category:Confederacy of Independent Systems locations", "Category:Galactic Republic locations", "Category:InterGalactic Banking Clan locations", "Category:Scipio locations"], "nodes": [{"tag": "h1", "text": "Main Vault"}, {"tag": "p", "text": "The Main Vault, also known as the Main Vault of the Banking Clan or Main Vault of Scipio, was the primary structure of the InterGalactic Banking Clan's fortress on Scipio, which hosted the Core Five and their guests. It was capped with an office tower which Rush Clovis used before his death during the Republic's invasion."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "A politically neutral zone, believed to be immune to galactic or personal conflicts, the Main Vault on the planet Scipio was a city-sized mountaintop installation established by the InterGalactic Banking Clan for use as the repository of their wealth. While in reality, the bulk of Banking Clan's business was conducted on the nearby planet Muunilinst, the Main Vault also served as the official headquarters across the Bank's millennia-long history."}, {"tag": "p", "text": "Standing on curved support struts that seemed to have grown like roots from the mountain itself, the installation was set across a multitude of levels, with landing platforms of various sizes serving each part. The Vault was accessible by either shuttle or spacecraft, or by groundcar via transit tubes in the support struts, many of which ran directly out to the distant settlements and estates of wealthy Banking Clan board members."}, {"tag": "p", "text": "Despite there being multiple buildings across the many levels, the ones that drew attention upon approach of the Vault, and that dominated even when in the city, were the tall, smooth towers with curved tops and, looming centrally over everything, the bulk of the Vault itself. Any visitors who were deemed important enough to visit the Main Vault were faced on arrival with an imposing entryway, designed deliberately to intimidate."}, {"tag": "p", "text": "Though it was heavily shielded, the Main Vault was not armed with anti-aircraft batteries or an aerial defense fleet. The buildings that housed the wealth of the galaxy were impenetrable, and the Banks were so crucial to the galaxy's survival that none would attempt an assault upon them—the immediate military response from every other planet in the galaxy would be crushing."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}