{"url": "Arik_Uvis", "categories": ["Category:Canon articles", "Category:Bureaucrats", "Category:Humans", "Category:Males"], "nodes": [{"tag": "h1", "text": "Arik Uvis"}, {"tag": "p", "text": "Arik Uvis was a human male individual from the Core who worked for the office of Governor Ryder Azadi. He attempted to purchase twenty-one percent, adding on from the thirty percent he already owned, of the mining company Pryce Mining, but Arihnda Pryce, heir to the company, refused his offer."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "Early Life"}, {"tag": "p", "text": "Arik Uvis, a human, was born and grew up in the Core, but by the time he reached his mid-thirties he was living on Lothal working for the office of governor Ryder Azadi. He was assigned to work with the company Pryce Mining six months prior to the discovery of a doonium vein in the mine. During this time he developed a friendly relationship with Talmoor Pryce."}, {"tag": "h3", "text": "Attempted Takeover of Pryce Mining"}, {"tag": "p", "text": "Six standard months after he was assigned to work with Pryce Mining, Uvis and Azadi stumbled upon the fact that a vein of doonium had been uncovered in the mine belonging to Pryce Mining on Lothal. Wanting to gain control of the doonium vein before Lothal Senator Domus Renking and the Empire could, Azadi dispatched Uvis to attempt to purchase another twenty-one percent, a controlling interest when combined with his and Azadi's current thirty percent, of the company from Arihnda."}, {"tag": "p", "text": "Finding Arihnda in the Pryce Mining corporate building, Uvis was quick to determine the veracity of the rumors that Pryce had discovered doonium. Having confirmed the existence of the doonium, Uvis shifted into his bid for a controlling interest in Pryce Mining. He warned Arihnda that the presence of a doonium vein in her mine would draw unwanted attention, offering Azadi's protection from megacorporations in exchange for the controlling interest. Arihnda dismissed his warnings as nothing more than a takeover attempt and turned down his offer. When she threatened to call guard droids on him, Uvis reluctantly left the premises."}, {"tag": "p", "text": "In retribution for Arihnda's refusal of the offer, Uvis and Azadi falsified embezzlement charges in order to incarcerate Elainye Pryce in an attempt to blackmail Arihnda into selling her company. Talmoor, oblivious to Uvis' role in the attempted takeover, suggested that Arihnda try talking to him to get Elainye released."}, {"tag": "p", "text": "Uvis and Azadi's attempt failed later that day when Arihnda made a deal with Senator Renking to give control of Pryce Mining over to the Empire in exchange for her mother's release, a new job for her parents, and a job working for Renking on Coruscant for her."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Arik Uvis was a human man with blonde hair and brown eyes. In his mid-thirties, Arik was about the same age as Arihnda Pryce but the latter opined that he was in a \"far worse shape than her.\" On behalf of Governor Azadi, Arik was willing to resort to dirty tricks including harming Arihnda's mother Elainye in order to force her to cede control of Pryce Mining to Governor Azadi. However, Pryce outmaneuvered Azadi by selling her company to the Empire."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Arik Uvis first appeared in Timothy Zahn's 2017 novel Thrawn, a rebooted Canonical origins story of the eponymous character. Most of his lines are told through the point of view of the tritagonist Arihnda Pryce."}, {"tag": "p", "text": "He was first illustrated in the Marvel Comics Thrawn 3, a comic adaptation of the novel which debuted on April 11, 2018. Arik was drawn and inked by Luke Ross, and colored by Nolan Woodard."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}