{"url": "Mak_Plain/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Financial professionals", "Category:InterGalactic Banking Clan members", "Category:Males", "Category:Muuns"], "nodes": [{"tag": "h1", "text": "Mak Plain"}, {"tag": "p", "text": "Mak Plain was a Muun male banker who lived during the years prior to the rise of the Galactic Empire. Plain worked as an official within the Muun-run InterGalactic Banking Clan and represented the Clan's loan policies and practices on the Galactic Republic's capital world of Coruscant during the Clone Wars between the Republic and the separatist Confederacy of Independent Systems. Around 21 BBY, in the aftermath of a failed peace initiative to end the war and a devastating terrorist attack on Coruscant, Republic Senator Halle Burtoni introduced a bill before the Galactic Congress that would appropriate a loan from the InterGalactic Banking Clan to fund the addition of five million clone troopers to the Grand Army of the Republic. Senators Padmé Amidala and Onaconda Farr, both of whom opposed the bill, met with Plain to discuss the cost of such a loan. During the meeting, Plain revealed that in light of a recent decision by the Senate to deregulate the banking industry, the Banking Clan's interest rate on government loans would increase from the original ten percent to a new rate of twenty-five percent. Due to Burtoni's campaigning and the fact that the Confederacy had already secured such a loan from the Banking Clan, the military enhancement bill was approved."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mak Plain was a Muun male who lived during the final years of the Great Peace of the Republic. Like many other members of his species, Plain worked as a banker for the Muun-run InterGalactic Banking Clan—the galaxy's largest and most politically powerful financial institution. During the Clone Wars between the dominant government of the Galactic Republic and the breakaway Confederacy of Independent Systems, Plain served the Banking Clan as a loan officer and executive representative on the Republic's capital planet of Coruscant. There, the Muun worked out of his office and negotiated government loan settlements with Republic leaders. Around 21 BBY, the Galactic Senate of the Republic debated a bill that would deregulate the galaxy's financial institutions so that the government could secure larger loans to further fund the war effort. The legislation, which was partially sponsored by Banking Clan lobbyist Nix Card, passed with an overwhelming majority following a Confederate terrorist attack on Coruscant's power generators and the failure of a fledgling peace movement."}, {"tag": "p", "text": "Immediately after the passage of the deregulation bill, Senator Halle Burtoni of Kamino drafted and introduced a bill that would secure a loan from the InterGalactic Banking Clan to fund the growth and training of five million new clone trooper soldiers. Unbeknownst to many senators, given the recent implementation of lender deregulation, Plain and the Banking Clan would be able to offer the loan with a twenty-five percent interest rate—a dramatic hike from the previous government rate of ten percent. While the debate over the bill raged on Coruscant, the Confederacy, to which the Banking Clan also lent, accepted the new interest rate and secured their own loan to finance the creation of three million more battle droid units."}, {"tag": "p", "text": "Two senators opposed to the Republic appropriations bill—Padmé Amidala of Naboo and Onaconda Farr of Rodia—met with Plain to investigate the Banking Clan's new loan policies and the details of the proposed loan. To the senators' shock and disgust, Plain divulged that the loan would carry a twenty-five percent interest rate. The Muun tried to temper their revulsion by revealing that the Confederacy had no problem paying at the new rate, but Amidala only questioned Plain's motives for allowing the Confederacy to acquire more forces. Although Plain made his home on the Republic capital, he assured the Senator that the Banking Clan had no stake or bias in the war between the Republic and Confederacy. Shortly after his meeting with Amidala and Farr, Plain met with Burtoni in the Republic Executive Building. Despite an impassioned plea to reject the appropriations bill from Amidala to the Senate days later, the legislation passed, and the Republic secured the loan. Although Amidala continued her quest to repeal the bill and cancel the loan, Burtoni's legislation stood and the order for the clone troopers went forward."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "A Muun, Mak Plain was exceedingly tall for a humanoid, easily towering over the Human Padmé Amidala and the Rodian Onaconda Farr, who stood at 1.65 and 1.73 meters, respectively. He spoke Galactic Basic Standard with a nasally inflection, and, as was typical of Muuns, he was fair-skinned and lacked head or facial hair. His eyes were yellow in color. During his meeting with Senators Amidala and Farr, he garbed himself in a tight-fitting red shirt underneath a dark vest and floor-length skirt, and crowned his tall head with a banded headdress."}, {"tag": "p", "text": "Plain was typical of many Muuns—greatly concerned with financial affairs and eager to reap great profit on behalf of the InterGalactic Banking Clan. Although he lived and worked on the Republic capital planet, Plain had no qualms about operating with both the age-old democracy and its opposition, the upstart Confederate movement. This political apathy was widespread in the Banking Clan management and practiced by other Coruscant-based officials, such as Senator Rush Clovis and lobbyist Nix Card. When the Muun was visited by Amidala and Farr, he gladly informed them of the Banking Clan's drastic rate hike and used the threat of new Separatist war matériel to convince them of the Republic's need for a new loan. After Amidala questioned his loyalty to the Republic, Plain claimed that he and the Clan had no stake in the war—a thinly veiled lie to hide the reality of the profitability of further conflict and bloodshed."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Mak Plain was introduced to Star Wars canon in the eleventh episode of the Star Wars: The Clone Wars television series' third season. The episode, titled \"Pursuit of Peace,\" first aired on December 3 of 2010 and featured the voice talents of Stephen Stanton in the role of Mak Plain. On December 2, 2011, the twelfth episode of Season Four of The Clone Wars, titled \"Slaves of the Republic,\" featured a number of Muun background characters on the Confederate-allied Outer Rim world of Zygerria, outside the Zygerrian Royal Palace in a slave market. At least two of these Muuns were identical to Plain's appearance in \"Pursuit of Peace,\" but due to the fact that there were multiple instances of the character model being utilized in the same scene, Plain's presence in the episode is uncertain, and has not yet been confirmed by official sources."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}