{"url": "Makem_Te/Legends", "categories": ["Category:Legends articles", "Category:Confederacy of Independent Systems planets", "Category:Fortress worlds", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:Imperial Remnant planets", "Category:Makem Te locations", "Category:Mining planets", "Category:Nilgaard sector planets", "Category:Perlemian Trade Route", "Category:Spice producing worlds", "Category:Xim's empire"], "nodes": [{"tag": "h1", "text": "Makem Te"}, {"tag": "p", "text": "Makem Te was the dry homeworld of the Swokes Swokes species, on the Perlemian Trade Route."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Originally an independent world ruled by the Congress of Caliphs, Makem Te was conquered by the Xim the Despot, being absorbed into his ever expanding empire. Upon its collapse in 25,096 BBY, the world once again was left on its own. Eventually discovered by the Republic between the Kymoodon Era and Rianitus Period, Makem Te quickly joined the galactic government, gaining representation in the Galactic Senate."}, {"tag": "p", "text": "During the Great Sith War, the Krath fled to the planet driven away from Thule. In 3963 BBY, the world was invaded by the Mandalorians during the Mandalorian Wars. During the Jedi Civil War, Makem Te aligned with the Sith Empire,which had offered freedom from the Mandalorians. During the Cold War, there was a brief battle in Makem Te's upper atmosphere between the Imperial Navy and the Republic Navy, in which the Republic emerged victorious. Upon the death of Darth Malak, the world stayed neutral until the New Sith Wars began in 2000 BBY. Located in Sith Space, which had expanded from Korriban, the planet did not suffer any major battles during the war."}, {"tag": "p", "text": "After years of alignment with the Sith, the world rejoined the Republic, with Senator Yeb Yeb Adem'thorn representing the Swokes Swokes in the galactic Senate. As the mining coorperations of the Republic moved in on the world, the rebel sect known as the Temple of the Beatific Razor. In 42 BBY, the Galactic Republic stopped a bloody civil war between the Temple and the reigning Caliphs on the planet; young Jedi Padawan Anakin Skywalker met a veteran pilot of the battle in 32 BBY. Eventually the world seceded from the Republic again during the Clone Wars and joined the Confederacy of Independent Systems as Count Dooku had revealed plans to destroy the resurgent Temple group."}, {"tag": "p", "text": "With the end of the Clone Wars, Makem Te was quick to rejoin the newly formed Galactic Empire. Within the Empire's second decade of exsistence, the Galactic Civil War swept the Outer Rim, with battle coming to Makem Te. As the Empire won the Battle of Makem Te, the planet continued to thrive, continuing to provide lasting support to the Imperial Remnant after the Battle of Endor, though the world was isolated from the Remnant after a Mon Calamari victory at Emmer. An Imperial fortress world during the Ssi-ruuvi and Nagai invasions, General Zsinj held off advances by the invaders and the New Republic until his death. Taken swiftly by Grand Admiral Thrawn, the world continued its Imperial service until forced to help the New Republic during the Yuuzhan Vong War. Injured but not devastated by the Yuuzhan Vong, Makem Te was eventually absorbed into Darth Krayt's Galactic Empire."}, {"tag": "h2", "text": "Society"}, {"tag": "p", "text": "Every Swokes Swokes who died was afforded a plot in the Tract of Makem Te, an enormous graveyard which covered ten percent of the planet's surface."}, {"tag": "p", "text": "The spice trade was of high market value across the galaxy, with Makem Te providing a notable production line for smugglers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}