{"url": "Mal%27aa%27s_Kitchens", "categories": ["Category:Legends articles", "Category:Dining establishments", "Category:Ryloth locations"], "nodes": [{"tag": "h1", "text": "Mal'aa's Kitchens"}, {"tag": "p", "text": "Mal'aa's Kitchens was a dining establishment in Kala'uun on Ryloth. It catered to both locals and natives and was a useful source of information."}, {"tag": "h2", "text": "Design"}, {"tag": "p", "text": "The restaurant was opposite the main landing area in Kala'uun, across the \"Procession\"—a long thoroughfare. Built into a large cave complex, it was designed to look like a cantina from the outside. The main dining room was set in a large cave and was filled with long tables and benches. It was lit mostly by fungus lanterns, although some of the natural red light did filter in through high narrow windows, designed to maximize privacy. Behind this were several other caves, including storage rooms and living quarters for Mal'aa, her immediate family, and the numerous Twi'lek serving maids."}, {"tag": "p", "text": "The kitchen itself had four large furnaces and served every kind of food, condiment and seasoning. Most meals cost around five credits, with second helpings available for a further credit. Meals included Rycrit stew, fermented fungus ale, munch-fungus bread, and raw munch-fungus soaked in a warm broth."}, {"tag": "h2", "text": "Clientèle"}, {"tag": "p", "text": "Mal'aa's Kitchens was one of the few places to allow offworlders to eat there, and Mal'aa also provided accommodation to spacers who wanted some time away from their ships. It was a useful place to pick up information, both from other customers and from Mal'aa herself."}, {"tag": "p", "text": "Mal'aa once used the caves behind her kitchen to shelter her friend Platt Okeefe. A group of Twi'leks suspected Okeefe was going to try and establish Tru'eb Cholakk as leader of his clan and wanted to attack her. Mal'aa protected Okeefe until they stopped looking for her."}, {"tag": "h2", "text": "Sources"}]}