{"url": "Mala_(planet)", "categories": ["Category:Legends articles", "Category:Arboreal planets", "Category:Atravis sector planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Mala  (planet)"}, {"tag": "p", "text": "Mala was a remote planet in the Surd Nebula in the Outer Rim Territories of the galaxy. It was home to an unidentified near-Human species with white hair. By the end of the Sith–Imperial War, Mala's inhabitants had developed a primitive iron age civilization consisting of both sedentary communities and a barbarian people known as the Schor-Goya. The One Sith used Mala as a testing ground for a new biological weapon, which exterminated all life on the planet and knocked the planet from its orbit. The sole survivor of the Mala genocide was the Sith Darth Wredd, who would play an important role in the destruction of the underground One Sith movement in 139 ABY."}, {"tag": "h2", "text": "Description, society, and culture"}, {"tag": "p", "text": "Prior to its destruction, Mala was a terrestrial planet with a breathable atmosphere, forests, and hills. It was home to an unidentified near-Human species with white hair. It was also home to an unidentified ungulate non-sentient species whose skulls were used by the humanoids as helmets. Following the deployment of One Sith viral spores, Mala was reduced to bleak, rocky planet. The explosion which delivered the viral spores was so strong that it knocked Mala out of its orbit, turning the planet into a floating world."}, {"tag": "p", "text": "Prior to its destruction at the hands of the One Sith, Mala had developed an iron-age civilization where swords and axes were the standard weapons of combat. Some of its inhabitants lived in small sedentary villages while others known as the Schor-Goya were nomadic. There was sporadic conflict between the settled peoples of Mala and the Schor-Goya. The One Sith bioweapon destroyed all life and civilization on Mala, with the exception of the man who became the rogue Sith Darth Wredd."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Destruction"}, {"tag": "p", "text": "By the time of the Sith–Imperial War, Mala had developed an iron-age civilization consisting of both sedentary communities, who lived in villages, and a barbarian people known as the Schor-Goya. The man who would become Darth Wredd was a Force-sensitive hunter and swordsman who became renown as the champion of his village for defending them against attacks by the Schor-Goya. Despite his Force talents, this man was unable to join the Jedi Order since it had been driven into hiding following the Massacre at Ossus in 130 ABY. This man eventually became respected throughout his community and eventually started a young family."}, {"tag": "p", "text": "Towards the end of the Second Imperial Civil War, Mala was invaded by the One Sith. Mala's champion fought against the Sith but was defeated in combat, with his sword being split by the lightsaber of his Sith opponent. Mala's champion was taken aboard the Sith flagship, a Pellaeon-class Star Destroyer, and surrendered to the Sith. However, the One Sith scientist Vul Isen decided to use the planet as a testing ground for a new biological weapon. The biological weapon not only succeeded in destroying all organic life on Mala but the power of its blast knocked Mala from its orbit. As a result, Mala became a rogue planet which drifted aimlessly throughout the galaxy."}, {"tag": "p", "text": "The sole survivor of the genocide was Darth Wredd, who was apprenticed to the Sith master, who had bested him in combat. Despite being pressed into the service of the Sith, Wredd harbored a desire for vengeance against the One Sith and bidded his time for the right opportunity. Following the death of Darth Krayt, the One Sith were driven underground and a Galactic Federation Triumvirate, consisting of the Fel Empire, the Jedi Order, and the Galactic Federation of Free Alliances, assumed power over the galactic capital Coruscant. By 138 ABY, the floating world of Mala had entered the Surd Nebula. People in the neighboring Carreras system had no knowledge of its existence."}, {"tag": "h3", "text": "Darth Wredd's Insurgency"}, {"tag": "p", "text": "Around that time, Galactic Empress Marasiah Fel had dispatched the Imperial Knight Yalta Val on a mission to the Carreras system to supervise the completion of a new communication array. Darth Wredd and his master intercepted and shot down Val's ship, causing it to crash-land on Mala. Val and his crew were ambushed by the two Sith, with only Val surviving. Taking the opportunity to rebel against the One Sith, Wredd killed his master, imprisoned Val on Mala, and took on his identity and armor when he traveled to Carreras Major."}, {"tag": "p", "text": "Before being shot down, Val's crew had activated a commdroid. After the ambush, it retrieved his lightsaber, but became damaged. It was found and repaired by Ania Solo and Sauk, and when Jao Assam came to their aid, the coordinates for the planet were found in the commdroid. After viewing a holo-recording showing Master Val fighting Wredd's Sith master, they realized that Master Val had been replaced by an impostor. They decided to use the coordinates to locate Mala and rescue the real Master Val. However, they were captured by the Carreras security forces, which had come under the control of Darth Wredd, who was masquerading as Yalta Val."}, {"tag": "p", "text": "After being exposed by Jao Assam, Ania, and her associates, Darth Wredd fled back to Mala. By that stage, he was able to remotely control the station and bring it towards Mala's orbit. There, Wredd attempted to use the communications array to make a live holo-broadcast to the wider galaxy where he would also execute the captive Yalta Val. However, he was thwarted by Ania, who also succeeded in rescuing Val and escaping offworld with her associates and Jao Assam before the Carreras communications array collided with the rogue planet. Meanwhile, Wredd's henchman Dieben also managed to escape Wredd's base prior to the collision. He was later picked up in an escape pod an extradited back to his home planet of Nalyd, where he was executed for various felonies."}, {"tag": "h3", "text": "Battle of the Floating World"}, {"tag": "p", "text": "Meanwhile, Darth Wredd launched an insurgency against the One Sith and succeeded in killing many Sith. He also made contact with Jao Assam, a maverick Imperial Knight who had learnt of Wredd's plot to assassinate Empress Marasiah Fel through a Force vision. After tricking Assam and his associates into killing the One Sith Darth Luft in the shipyards above Dac, Wredd tempted Jao with the offer of joining his new Sith Order, which would adhere to Darth Bane's Rule of Two. In 139 ABY, Wredd freed Jao from prison in Coruscant and brought him to Mala. There, he related the story of the destruction of Mala and his enslavement by the One Sith."}, {"tag": "p", "text": "Wredd also tricked Assam into transmitting the coordinates of Mala's location to his associates and the Imperial authorities. Wredd's plan was to lure Empress Fel to Mala and kill her, in order to bring Assam over to the dark side of the Force. However, the One Sith also intercepted Wredd's transmission and gathered all of their forces to seek and destroy Darth Wredd. This culminated in a massive three-way battle on Mala which saw the apparent destruction of the entire One Sith Order. Wredd also attempted to assassinate Empress Fel, but was thwarted and killed by Jao and his associate Ania Solo. While Wredd succeeded in exacting revenge against the Sith for the destruction of his homeworld, he failed to turn Jao into his second Sith apprentice."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The planet Mala first featured as a plot device and location in Corinna Bechko and Gabriel Hardman's Star Wars: Legacy Volume 2, the sequel to Dark Horse's Star Wars: Legacy comic series. The planet was drawn by Gabriel Hardman and Brian Albert Thies and colored by Rachelle Rosenberg and Jordan Boyd."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}