{"url": "Mala_Mala", "categories": ["Category:Legends articles", "Category:Articles that are known by a nickname", "Category:Character stubs", "Category:Bounty hunters", "Category:Females", "Category:Imperial Intelligence personnel of the Galactic Empire", "Category:Sephi", "Category:Spies"], "nodes": [{"tag": "h1", "text": "Mala Mala"}, {"tag": "p", "text": "Mala Mala was a crippled and burned spy of the Sephi species."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Early in her life, Mala Mala was betrayed by the handsome bounty hunter Nikk Zavod who seduced her, stole her ship and left her body for dead after he burned it in the afterburners of her ship."}, {"tag": "p", "text": "She only managed to survive by her fortuitous encounter with Chewbacca, who carried her to the sick bay of a ship in which she received life-saving medical attention from a medical droid. From that moment on, she never trusted men again—only droids, and built them as friends. This was also the critical moment in her life where she received her moniker after hearing Chewbacca mumble the name of his wife, Mallatobuck, in bed. She started her new life as Mala Mala."}, {"tag": "p", "text": "Mala later was a part of a group of bounty hunters, including Brazzo and Selle, on Centares. She was the only survivor from there who knew the identity of Luke Skywalker as the destroyer of the first Death Star from Thurlow Harris. She was able to evade Vader long enough to reach Coruscant and provide the name to Emperor Palpatine."}, {"tag": "p", "text": "Among her droids were Fordee and Beesix. The Emperor did allow her to leave Coruscant alive. She was alive as of the Yuuzhan Vong War for R2-D2 and C-3PO to record her memories of Chewbacca following his death."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Before she was burned, Mala Mala appeared to be Human, but with pointy ears. Leland Chee, on the StarWars.com Message Boards, stated that his theory is that \"all pointy-eared species are either Sephi or closely related to Sephi.\""}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}