{"url": "Malachi_Throne", "categories": ["Category:Real-world articles", "Category:Star Wars voice actors", "Category:Deceased actors", "Category:Actors"], "nodes": [{"tag": "h1", "text": "Malachi Throne"}, {"tag": "p", "text": "Malachi Throne (December 1, 1928 - March 13, 2013) was an American actor, most noted for his roles on Star Trek and the 1968 TV series It Takes a Thief. He voiced the narration of the first trailer for the original Star Wars film. The son of Samuel and Rebecca Throne, who had emigrated to America from the Austro-Hungarian Empire, he began performing at an early age at the New York World's Fair, which opened in 1939 and closed after the 1940 season."}, {"tag": "p", "text": "During World War II, the young Throne quit school to work in theater, though he later returned and got his high school diploma."}, {"tag": "p", "text": "When he was 21 years of age, the \"Korean Conflict\" broke out when North Korea invaded South Korea, and Throne was attached to an armored unit as part of the infantry. Upon returning, Marlon Brando had achieved success in 1951 playing in A Streetcar Named Desire. \"Marlon Brando's influence had changed everything,\" Throne recalled with some amusement. \"The actors who mumbled got the lead roles.\" However, having a deep, classically trained voice, Throne was cast in the parts of characters much older than his actual age. His clear enunciation also made him a natural for live television."}, {"tag": "p", "text": "In addition to TV, he continued to work on the the stage, appearing in the landmark off-Broadway production of Eugene O'Neill's \"The Iceman Cometh\", in support of Jason Robards."}, {"tag": "p", "text": "He had memorable appearances as \"Falseface\" on the Batman TV series and provided the voice of \"The Keeper\" for \"The Cage\", the pilot episode of the 1966 Star Trek series. He turned down an offer to be a regular cast member on that show, rejecting the part of Dr. McCoy as he did not want to play third fiddle to William Shatner and Leonard Nimoy. Producer Gene Roddenberry, who had offered him the role of \"Bones\" McCoy, was not offended by Throne turning him down, and cast him as \"Commodore Jose Mendez\" in two-part episode \"The Menagerie\" of the original 1966 Star Trek, which included most of the original pilot."}, {"tag": "p", "text": "Throne was a popular guest star on many television shows of the 1960s and 1970s, including The Defenders, Naked City, Ben Casey, The Untouchables, and also co-starring, with Robert Wagner, on the ABC TV show It Takes a Thief."}, {"tag": "p", "text": "He made two appearances in the CBS TV series Mission: Impossible, in seasons 1 and 4, in the late 1960s. He also appeared twice in the Irwin Allen series The Time Tunnel, most notably in the episode \"The Death Merchant\", as Machiavelli, lost in time at the Battle of Gettysburg as well as co-starring in the episode \"Night Of The Long Knives.\""}, {"tag": "p", "text": "Throne returned to the Star Trek universe to portray Romulan Senator Pardek in Star Trek: The Next Generation."}, {"tag": "h2", "text": "\"A long time ago…\""}, {"tag": "p", "text": "An extremely distinctive voice in sci-fi, Malachi Throne's voice narrated the very first Star Wars trailer that announced \"somewhere in space… this may all be happening right now.\""}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "External links"}]}