{"url": "Malachor_Sith_Temple", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Malachor V locations", "Category:Sith temples", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Malachor Sith Temple"}, {"tag": "p", "text": "The Malachor Sith Temple was a Sith temple located on the planet Malachor, in a large cavern covered by a crust of stone and surrounded by extensive ruins. Inside the temple, in a chamber that could be reached only through the combined efforts of a Sith master and apprentice, was a Sith holocron containing an entity called the Presence. The temple also contained a superweapon, which could be activated by placing the holocron in the obelisk at the top of the building and was, according to the Presence, powerful enough to destroy life."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Millennia before the rise of the Galactic Empire, the Sith constructed a pyramidal temple on the bleak world of Malachor. The infernal machine at the heart of the Sith temple, a superweapon powered by a giant kyber crystal, was capable of destroying life. The Jedi soon caught wind of the Sith's plan and launched an assault on the temple. During the battle, the superweapon fired, killing and petrifying all combatants—Jedi and Sith. This event later became known as the Great Scourge of Malachor."}, {"tag": "p", "text": "Three years before the Battle of Yavin, the temple was visited by Jedi Knight Kanan Jarrus, his Padawan Ezra Bridger, and former Jedi Ahsoka Tano as they sought knowledge for how to defeat the Sith Lord Darth Vader and his Inquisitors. While there, they encountered the former Sith Lord Maul, who also sought to destroy the Sith. Maul and Ezra worked together to enter the temple and ultimately retrieved a Sith holocron, which was essential to reactivating the temple."}, {"tag": "p", "text": "When Kanan and Ahsoka were attacked by the Inquisitors known as the Fifth Brother, the Seventh Sister, and the Eighth Brother, Maul and Ezra arrived and assisted them in driving the Inquisitors away. He then convinced the group to work together in order to venture into the Temple and find the knowledge necessary to destroying the Sith. The Inquisitors regrouped and attacked the four travelers. After having killed the Seventh Sister, Maul sent Ezra to place the holocron inside the temple's obelisk. After they had dealt with the rest of the Inquisitors, Maul turned on Kanan and Ahsoka. He was able to blind Kanan but was stopped from killing him by Ahsoka. Once Kanan had recovered, he proceeded to fight Maul and managed to throw him off the edge of the temple. During their confrontation, Ahsoka went to look for Ezra."}, {"tag": "p", "text": "Meanwhile, Ezra had arrived at the top of the temple and placed the Sith holocron into the central obelisk. He encountered the voice of the entity called Presence, who revealed that the temple was in fact an ancient Sith superweapon capable of destroying all life. When Ezra refused to use the weapon, the Presence announced the arrival of Darth Vader. Before Vader could finish Ezra off, Ahsoka arrived and fought with her former master. Kanan and Ezra managed to remove the holocron, which triggered a chain reaction that led to the temple's explosion. The two Jedi managed to escape with Chopper on the Phantom before the temple imploded. Both Vader and Ahsoka survived the explosion and parted company, with the latter venturing into the depths of the Sith temple."}, {"tag": "p", "text": "This experience proved to be a turning point for Ezra. His grief over what had transpired on Malachor allowed him to access the Sith holocron that he had discovered on Malachor, and with its influence, he began to unlock the secrets contained within it. This temptation of power began to corrupt him, leading to a strained relationship with his master Kanan. It was not until the intervention of Bendu that their relationship finally managed to repair itself."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Malachor Sith Temple first appeared in the Star Wars Rebels episode \"Twilight of the Apprentice.\" The temple, just like everything from Malachor's surface, was sketched out by Dave Filoni. Chris Glenn later created the chamber's final look and Pat Presley painted wide views from the city surrounding it."}, {"tag": "p", "text": "In an interview with IGN, Star Wars Rebels executive producer Dave Filoni provided some insight into what he saw as the backstory of the Presence. In his mind, the voice of the Presence is the voice of the ancient Sith Lord who built the Malachor temple. Filoni said that he liked the idea of an ancient and powerful woman, who had domination that the audience has not yet heard of, who was creating the weapon when it was attacked by the Jedi Order and everyone is turned to stone. Filoni further said that he has a name for the character, but he could not yet reveal it."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}