{"url": "Malachor_superweapon", "categories": ["Category:Pages needing citation", "Category:Canon articles", "Category:Structure stubs", "Category:Malachor V locations", "Category:Sith culture", "Category:Superweapons"], "nodes": [{"tag": "h1", "text": "Malachor superweapon"}, {"tag": "p", "text": "The Malachor superweapon was an ancient Sith superweapon constructed 3966 years before the destruction of the Death Star,[source?] by the ancient Sith Lord, Darth Tanis.  It required a giant kyber crystal to be powered, and it was housed in a temple on Malachor. It had the power to petrify living beings. During the Great Scourge of Malachor, the weapon fired, petrifying the warriors battling there. In 3 BBY,[source?] Maul tricked Ezra Bridger and his friends into activating the superweapon by making them believe that putting a Sith holocron, which was found inside the temple, on top of the structure would reveal the secrets of defeating the Sith. The Inquisitors attempted to stop the Jedi and Maul from using the holocron, but were killed during their encounter. When Ezra put the holocron in the weapon's obelisk, it activated and began firing a huge beam of laser into the sky. Shortly afterwards, Darth Vader arrived to take the Sith temple's power for Emperor Palpatine. Before he could kill Bridger, Ahsoka Tano intervened and battled the Sith Lord outside the temple's obelisk. While the two dueled, Bridger and his master Kanan Jarrus—who was blinded by Maul, but was able to defeat the Dark Sider by pushing him off the temple's cliff—prevented the machine from completing its firing cycle by removing the holocron from the obelisk, causing the whole temple to collapse. Ezra and Kanan Jarrus managed to escape before the temple exploded. Darth Vader and Ahsoka survived the explosion and parted company. The apparent loss of Ahsoka on top of Maul's betrayal affected Ezra, causing him to drift closer to the dark side."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}