{"url": "Malastare/Legends", "categories": ["Category:Legends articles", "Category:Pages needing citation", "Category:Articles in need of updating", "Category:Arboreal planets", "Category:Galactic Alliance planets", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:High-gravity planets", "Category:Hydian Way", "Category:Infinite Empire planets", "Category:Malastare locations", "Category:Malastare system planets", "Category:New Republic planets", "Category:Type I atmosphere planets"], "nodes": [{"tag": "h1", "text": "Malastare"}, {"tag": "p", "text": "Malastare was the high-gravity homeworld of the quadrupedal Dug race, on the Hydian Way."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Malastare had a variety of terrains including forests, deserts, methane lakes, and rivers. This made the planet a favorite podracing location. There, local and interstellar stars such as the Dug Sebulba competed in events such as the Malastare 100, the Dug Derby, Sebulba's Legacy, the Phoebos Memorial Run and the Vinta Harvest Classic."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Early history"}, {"tag": "p", "text": "This planet had long been plagued by monstrous Zillo Beasts that fed on the native Dugs. The Dugs gained the upper hand and eventually eradicated all the Zillo Beasts, when it was discovered that Malastare's natural fuel resources were toxic to them."}, {"tag": "p", "text": "Circa 8000 BBY, the Galactic Republic established an outpost on Malastare since it was located at a key spot along the Hydian Way trade route.[source?]"}, {"tag": "p", "text": "During the Cold War between the Galactic Republic and the reconstituted Sith Empire, the local authorities wanted to smash the spice trade which caused the price of spice to inflate. Due to this, the Hutts began hiring individuals to deliver a shipment of glitterstim."}, {"tag": "h3", "text": "Gran settlement"}, {"tag": "p", "text": "In circa 1000 BBY, a contingent of Gran colonists settled on the planet. The first meeting between the Gran and the Dugs was bloody, and a long, brutal war ensued in its aftermath. Because of the power and influence the Gran wielded in the Galactic Senate, the Republic settled the violence in the Gran's favor."}, {"tag": "p", "text": "The Gran Protectorate was established circa 1000 BBY, and, as a consequence, the Dugs were demilitarized and stripped of political power, with the unemployed ones being relocated to the western continent of their own planet."}, {"tag": "h3", "text": "The fall of the Republic"}, {"tag": "p", "text": "In the Galactic Republic, Malastare was represented in the Galactic Senate exclusively by Gran politicians such as Pax Teem, Aks Moe, Ainlee Teem, Baskol Yeesrim, and Ask Aak. Around 65 BBY, the planet's economy was heavily dependent on both podracing and fuel exports, and its finances suffered when Gardulla the Hutt restored a spectacular course on Tatooine with the support of Damask Holdings, and a vast plasma source was discovered on Naboo and was exported by the Trade Federation."}, {"tag": "p", "text": "In his quest to become the prime clone, the bounty hunter Jango Fett visited Malastare in search of the crime lord Sebolto, thought to be in league with the Bando Gora crime syndicate."}, {"tag": "p", "text": "Malastare remained loyal to the Republic during the Clone Wars, its senators serving on the Loyalist Committee. An organization called Dugs-for-Democracy opposed the Military Creation Act and fought for the civil rights of Dugs."}, {"tag": "h3", "text": "The Clone Wars"}, {"tag": "p", "text": "In 22 BBY, the planet's vital fuel reserves captured the attention of both the Republic and the Confederacy of Independent Systems. During the Battle of Malastare, the Separatists deployed a large droid army that overwhelmed the local Dug and Republic defenders. In response, Republic forces deployed a new superweapon, the electro-proton bomb, which quickly obliterated the droid forces but awakened an ancient monstrous Zillo Beast. The Zillo Beast devastated the Republic and Dug lines, resulting in heavy losses."}, {"tag": "p", "text": "In exchange for Republic protection and access to Malastare's valuable fuel, the Dugs demanded that they destroy the Zillo Beast. However, Supreme Chancellor Palpatine and Jedi General Skywalker secretly arranged for the beast to be stunned in order to obtain its hide for scientific research while appeasing the Dugs. It was knocked out by particle cannon fire from Republic stun tanks."}, {"tag": "p", "text": "With the Separatist droid forces neutralized and the Zillo Beast ostensibly eliminated, the Dugs signed their treaty with the Republic. The unconscious beast was then taken to the galactic capital, Coruscant, to be studied in a contained environment. However, shortly after arrival, the Zillo Beast escaped and proceeded to wreak havoc, endangering the lives of millions and forcing the Jedi to eliminate it."}, {"tag": "h3", "text": "Under the Empire"}, {"tag": "p", "text": "Following the Clone Wars and the Great Jedi Purge, Captain Ozzik Sturn was installed as the Chief Magistrate of Malastare after the Galactic Empire took over the planet. An avid hunter, he took to hunting the native non-sentient animals but quickly became bored. Instead, he had political prisoners released into a private hunting reserve, where he stalked and killed them. Though hidden, the hunting reserve was eventually discovered by the planet's native Dugs and Grans. Outraged, they revolted against Imperial rule, and the Empire suffered a high casualty rate as a result. This resulted in Ozzik Sturn being transferred to Kashyyyk."}, {"tag": "p", "text": "Around 1 BBY, General Rahm Kota of the Rebel Alliance was given passage to Malastare, where he ended up recruiting several people for a new squad, including a Cerean medic who also had some experience with cloning."}, {"tag": "h3", "text": "The Galactic Civil War and after"}, {"tag": "p", "text": "The system joined the New Republic sometime between 4 ABY and 9 ABY. It was a New Republic stronghold during the Thrawn campaign."}, {"tag": "p", "text": "The planet was conquered by the Yuuzhan Vong, but the invaders spared Malastare's infrastructure to establish an orbital rendezvous point for their warships. The planet was liberated and had senatorial representation in the Galactic Alliance, but since many worlds had suffered worse damage from the Yuuzhan Vong, the Alliance largely left the planet to rebuild on its own, to the ire of both Dugs and Gran."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "With several lines referencing it in The Phantom Menace and in a deleted scene from Attack of the Clones, Malastare is one of the most profiled planets in the Star Wars movie saga, yet never seen in any of the six Legends films."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}