{"url": "Maldo_Kreis", "categories": ["Category:Canon articles", "Category:Articles in need of updating", "Category:Arkanis sector planets", "Category:Ice planets", "Category:Outer Rim Territories planets", "Category:Terrestrial planets"], "nodes": [{"tag": "h1", "text": "Maldo Kreis"}, {"tag": "p", "text": "Maldo Kreis was a terrestrial ice-covered planet located in the Outer Rim Territories where ravinaks lived below the surface. Locations such as a bar and a port were found on the surface. Around 9 ABY, the Mandalorian bounty hunter Din Djarin arrived at Maldo Kreis aboard his personal starship and captured a Mythrol at the bar after defeating the trawlers there. He departed the planet after a brief struggle with a ravinak."}, {"tag": "p", "text": "Djarin later crash landed on Maldo Kreis after being pursued by two New Republic pilots. While repairing his ship, he was attacked by knobby white ice spiders, but was rescued by the New Republic pilots, who left the Mandalorian with his damaged ship. Djarin thus departed the planet for his intended destination."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Located in the Outer Rim Territories, Maldo Kreis was a terrestrial ice-covered planet where ravinaks dwelled in the waters below the plains from where they erupted often. The planet also had canyons with caves below, home to knobby white ice spider nests and hot water baths. Maldo Kreis had a breathable atmosphere and a frigid climate. When viewed from space, Maldo Kreis had a light blue surface."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 9 ABY, the Mandalorian bounty hunter Din Djarin arrived at the planet aboard his personal starship, the Razor Crest, to hunt down and capture a Mythrol. Using a tracking fob, he tracked the Mythrol's whereabouts to a bar. Within the bar, the Mythrol was harassed by a group of trawlers until the bounty hunter entered the bar. Shortly after, a brawl ensued between Djarin and the trawlers, with the former emerging victorious."}, {"tag": "p", "text": "Djarin then confronted and placed the Mythrol under his custody before exiting the bar to return to his ship. He approached a ferryman and hired a landspeeder pilot to transport the bounty hunter and the Mythrol to the Razor Crest. After dropping off Djarin and the Mythrol, the landspeeder pilot was killed by a ravinak, which quickly approached the Razor Crest. The creature held on to the starship's landing gear with its jaws while it attempted to take off. Djarin stunned the ravinak using his Amban phase-pulse blaster before departing the planet with the Mythrol in tow."}, {"tag": "p", "text": "While transporting \"Frog Lady\" and her unfertilized spawn to the estuary moon of Trask, Djarin fled from a pair of New Republic T-65B X-wing starfighters and crash landed on Maldo Kreis. While making repairs to the Razor Crest, the group was attacked by a swarm of ice spiders, which invaded the ship and forced Djarin, \"Frog Lady,\" and Grogu to seal themselves into the cockpit. Eventually, the group would be saved by the two New Republic pilots, Carson Teva and Trapper Wolf. The two pilots helped Djarin repel the spiders and decided to let him go, leaving Djarin to continue his journey to Trask in his damaged ship."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "p", "text": "Species residing on Maldo Kreis included Dyplotids, humans, Kubaz, Mythrol, Onodones, and Quarrens."}, {"tag": "h2", "text": "Locations"}, {"tag": "p", "text": "Various structures populated Maldo Kreis' surface, including a bar, run by a human bartender, and a port. At one location, a ferryman worked with landspeeder pilots to provide transportation to customers for a fee. The port was known for having an issue with ravinaks, as crews would dump their Gray Holds out, which became a source of food for the carnivores."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Maldo Kreis first appeared in the first episode of the television series The Mandalorian, which was titled \"Chapter 1: The Mandalorian,\" directed by Dave Filoni, and aired on November 12, 2019. Prior to the episode's release, the planet was shown in a trailer released on August 23, 2019. The planet's landscape was illustrated by Doug Chiang and Nick Gindraux."}, {"tag": "p", "text": "The planet was named in an interview conducted by the American Cinematographer magazine with showrunner Jon Favreau and series cinematographers Baz Idoine and Greig Fraser. During the filming process, Maldo Kreis' environment was created with a combination of a practical set and a 360-degree LED screen on which the backgrounds were projected to give the illusion of a physical environment."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}, {"tag": "h2", "text": "External links"}]}