{"url": "Malevolence_(cult)", "categories": ["Category:Legends articles", "Category:Articles in need of updating", "Category:Sith cults"], "nodes": [{"tag": "h1", "text": "Malevolence  (cult)"}, {"tag": "p", "text": "Malevolence was a cult of dark side practitioners who resided on Prakith, in the dilapidated fortress of the ancient Sith Lord Darth Andeddu. The cult survived for thousands of years after Andeddu's death."}, {"tag": "p", "text": "Originally recruited by Darth Andeddu to serve as his disciples, the cultists secluded themselves in Andeddu's Keep after his death, studying and harnessing the power of the dark side of the Force. They had sent some of their members out to recruit new guardians to replace those who died of age while waiting for their master's resurrection. Owing to Prakith's isolation from the galaxy after the expiration of the hyperspace lane leading to the planet, the cult's existence remained largely unknown to the galaxy, until 137 ABY, when chief lieutenant of the One Sith Order, Darth Wyyrlok III arrived."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 980 BBY, Darth Bane, the last surviving Dark Lord of the Sith after the New Sith Wars, visited Prakith to retrieve Andeddu's holocron, which, as he had learned from an ancient manuscript, contained the secret of immortality. At the time, the inhabitants of Prakith appeared to be very apprehensive towards the cult, as a local treated Bane with hostility after he revealed that he was looking for them. The Dark Lord killed many cultists, and took the holocron back to his home on Ciutric IV."}, {"tag": "p", "text": "In 137 ABY, Darth Wyyrlok III came to the planet. At least eight of the members of the Malevolence fell victim to Lord Wyyrlok's illusions, which made them see each other as their enemy. Only their leader Gerlun was spared by Wyyrlok, only to be drained of his life force by Darth Andeddu's holocron."}, {"tag": "p", "text": "The Malevolence cultists attempted to deny the Chagrian Sith Lord entry, but when Wyyrlok displayed his superior mastery of Sith abilities, many of the present cultists were defeated, and killed. The sole surviving cultist, Gerlun (who killed his own brother, Demtri, in the confusion), respected Wyyrlok's power and swore allegiance to him, leading the Sith Lord further inside their domain. However, Gerlun seized an opportunity to betray Wyyrlok when he stole from him the Sith holocron of Lord Andeddu. Unbeknownst to Gerlun, Andeddu's holocron was a key to reviving the ancient Sith's body; it drained his life force and with it reanimated Andeddu's corpse. With Gerlun's death, the Malevolence cult was no more."}, {"tag": "p", "text": "Their training in the dark side of the Force included the use of telekinesis, and the construction of lightsabers."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}