{"url": "Maleling", "categories": ["Category:Legends articles", "Category:Culture of Dathomir", "Category:Slang"], "nodes": [{"tag": "h1", "text": "Maleling"}, {"tag": "p", "text": "Maleling was a slang term the Nightsisters of Dathomir used to describe male individuals from a patronizing standpoint. On the witches' planet, matriarchy was taken to an extreme, and male individuals were relegated to the status of slaves and breeding stock."}, {"tag": "h2", "text": "Use of the term"}, {"tag": "p", "text": "In the Nightsisters witches' culture, males were only used as slaves or mating partners, whence their other name of \"breeder\". The breeders usually were healthy Humans (or Near-Humans), while aliens were most often turned into mere \"labor units\". Malelings were usually contained behind proximity shields. Breeders were generally killed after mating, though it was not always the case."}, {"tag": "p", "text": "The more benevolent Witches of Dathomir would only refer to men in non-derogatory yet pragmatic terms such as \"males\" or \"mates\". They still considered them their servants and viewed them as property. For example, if a witch from a rival clan stole a male slave to take as a husband, it was considered unseemly for the man's initial owner to try and recover him. Male servants, however, could win their freedom by saving the life of a clan sister. \"Male witches\" or \"male spellcasters\" were considered a great prize."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "In 31 BBY, the Jedi Knight Quinlan Vos, a Kiffar, was captured by a group of Nightsisters. Though the Sisters initially considered him \"chain-gang material\" only, some of the witches like Yongti expressed interest in mating with him. The leader of the Nightsisters, Queen Zalem herself, offered Vos to become one of her personal bodyguards—a position that seemed to imply carnal pleasures. As he seemed reluctant, Zalem canceled her offer and made him a Lizard Keeper instead."}, {"tag": "p", "text": "After the defeat of Queen Zalem, the Shaman of the Nightsisters Talzin reunited the covens under her banner, and she decided to restrict the use of males to the Dathomirian Zabrak known as the Nightbrothers."}, {"tag": "p", "text": "Years later, in 8 ABY, the young Teneniel Djo captured Prince Isolder of Hapes and the Jedi Luke Skywalker. She intended to bear Skywalker's children as she had sensed his exceptional connection with the Force."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}