{"url": "Malevolence/Legends", "categories": ["Category:Legends articles", "Category:Cleanup", "Category:Articles in need of updating", "Category:Confederacy of Independent Systems starships", "Category:Flagships", "Category:Subjugator-class heavy cruisers"], "nodes": [{"tag": "h1", "text": "Malevolence"}, {"tag": "p", "text": "The Malevolence was a Subjugator-class heavy cruiser active during the Clone Wars. It served as the flagship of the Confederate General Grievous. The massive ship was longer than four Venator-class Star Destroyers and sported massive ion cannons, capable of disabling enemy ships, mounted on both sides of its hull. The ship was first spotted by Republic forces around 22 BBY by Jedi General Ares Nune and Clone Commander Kite, who were on an inspection in the Phu system. Grievous took the opportunity to fire the ion cannons on Nune's fleet, destroying it. High Jedi General Plo Koon led a fleet to engage the Malevolence after losing contact with Nune."}, {"tag": "p", "text": "After destroying Koon's fleet, the Malevolence was revealed to the Republic after Koon was rescued by Jedi General Anakin Skywalker. Dooku assigned the Malevolence to a major clone trooper medical center near the Ryndellia system. En route to the Kaliida Shoals Medical Center, the Malevolence destroyed a Republic medical convoy passing through the Ryndellia system. Before the warship could attack the medcenter, however, a group of BTL-B Y-wing starfighters led by General Skywalker intercepted the massive ship near the medcenter and disabled its ion cannons and hyperdrive with proton torpedoes."}, {"tag": "p", "text": "Senator Padmé Amidala was taken hostage aboard the Malevolence, and Skywalker and High Jedi General Obi-Wan Kenobi left to rescue Amidala. Prior to escaping the warship, Skywalker tampered with the ship's navicomputer. Grievous fled on his starfighter after noting that the battle had been lost. The battle droids stationed on the Malevolence believed that the hyperdrive had been fixed; however, the sabotaged navicomputer caused the Malevolence to crash into the Dead Moon of Antar."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The Malevolence was a Subjugator-class heavy cruiser. It was 4,845 meters long and possessed two twin ion cannons. Once fired, the wave from the cannons would expand over great distances and disable any spacecraft upon impact. After the ion cannon had disabled an enemy warship, approximately 500 turbolasers mounted on the ship's enormous hull could fire upon the disabled vessel. The vessel's power plant operated by recapturing waste heat and propulsion by-products. The design required a gigantic hull and was required to vent its stored energy on a regular basis, which was adopted to the ion cannons. A panel of experts debated the warship's size on the HoloNet News, as many predicted how large the ship was."}, {"tag": "p", "text": "The massive ship was designed with an internal rail jet system, which served as a hovertrain that transported ammunition, supplies, and sometimes troops throughout the ship. Its cars looked similar to the Multi-Troop Transport. Its computer systems were built with parts from KynachTech Industries. Equipped with sixteen massive sublight engines, the Malevolence also had a powerful hyperdrive, and at one point, its commander, the Confederate General Grievous, was told that the Malevolence was fast enough to outrun Republic forces. The ship carried two tractor-beam batteries that could pull any freighter or small vessel aboard one of the Malevolence's docking bays. Complementing the ship, Vulture-class droid fighters were on board to eradicate enemy fighters. At least one Droch-class boarding ship, nicknamed a \"pod hunter,\" was aboard the Malevolence, and was often deployed with rocket battle droids to seek and destroy jettisoned enemy escape pods. The Malevolence also held General Grievous' personal starfighter."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Rise of the Malevolence"}, {"tag": "p", "text": "The Malevolence was designed by Ruggle Schmong and built by Quarren Separatists on Pammant. It was the first of its class. The Separatists acquired the design after SoroSuub Corporation rejected it. The vessel was constructed in a huge drydock that Republic operatives could not penetrate. When the Malevolence was launched, the operatives were captured. Count Dooku named the Malevolence meaning \"wishing evil to others.\" It served as General Grievous' flagship prior to his use of the Invisible Hand and destroyed dozens of Republic task forces, including the Galactic Republic Fourth Fleet. It was known that the Malevolence possessed at least one sister ship, the Devastation."}, {"tag": "p", "text": "The massive Malevolence was first spotted by Jedi General Ares Nune and Clone Commander Kite as they took three Venator-class Star Destroyers to the Phu system for an inspection. Commanding the Malevolence, Grievous took the opportunity to fire upon the Republic forces. The first wave from the cannons obliterated the shields of the Star Destroyer Laudable. Nune and Kite tried to evacuate their flagship, though the ship was doomed as the intense fire from the Malevolence progressed. After the Jedi Order received word of the new superweapon, Jedi Master Plo Koon volunteered to take several Venator-class cruisers to find and destroy the \"mystery weapon,\" as the Malevolence had been dubbed. Aboard the Venator-class cruiser Triumphant, Koon tracked the Malevolence to the Abregado system."}, {"tag": "h3", "text": "Battle of Abregado"}, {"tag": "p", "text": "When Koon tracked the massive Malevolence in the Abregado system, he intended to report as much information as possible on the weapon in case of his defeat. After the Confederate Head of State, Count Dooku, arrived aboard the Malevolence to watch General Grievous' progress, he ordered the general to jam the Republic task force's transmissions. Koon and Clone Commander CC-3636 reported information to Jedi General Anakin Skywalker and his Padawan Ahsoka Tano via hologram. However, the nearby Malevolence cut their communications."}, {"tag": "p", "text": "While the Malevolence was out of firing range of the advancing Republic fleet, Grievous nevertheless ordered the battle droids to fire its ion cannon, which passed over the fleet and neutralized the Star Destroyers' shields. As the battle continued, the intense fire from the Malevolence's numerous turbolaser cannons soon engulfed the vulnerable Republic Star Destroyers. After Koon and several clones jettisoned their fleet in escape pods, Dooku ordered the battle droids to deploy the \"pod hunters\" to track down and eliminate the survivors."}, {"tag": "p", "text": "Using the last known report from Koon, Skywalker and Tano emerged from hyperspace in Skywalker's commandeered freighter, the Twilight, to look for Koon. Both Jedi noticed the large debris field the battle had produced. The pod hunters had destroyed all but Koon's pod, but Koon and his clone troopers destroyed those battle droids. Skywalker and Tano rescued Koon and the surviving clones, after which the Twilight detected the approaching Malevolence, and Koon ordered Skywalker to shut down all of the freighter's systems. However, the group left a 2-1B surgical droid active, and the Malevolence detected the Twilight. Koon, Skywalker, and Tano reactivated their ship and fled the area. Grievous ordered the ion cannon to be fired, but failed to stop the Jedi before they entered hyperspace. Thus the Republic learned of the warship and its ion cannons, and despite most of Koon's forces being eradicated, Dooku considered the battle a defeat. The Sith Lord was most displeased with Grievous' failure to prevent the Republic from learning of the warship. His trust in Grievous shaken, Dooku left to discuss plans with his Sith master."}, {"tag": "h3", "text": "Ryndellia conflict"}, {"tag": "p", "text": "In the Ryndellia system, the Malevolence intercepted several Republic Pelta-class frigates that were passing through the system. A Venator-class Star Destroyer that was escorting the frigates tried to protect the medical convoys; however, Grievous attacked the Republic medical convoy with the Malevolence's numerous laser cannons. After the Malevolence destroyed the small fleet, one of the frigates evaded the fire and began to escape. Grievous ordered the ship's ion cannons to be fired at the fleeing frigate. The electrical ion surge decimated the frigate's power, and the Malevolence then directed heavy fire at the frigate, destroying it."}, {"tag": "p", "text": "Count Dooku, who had been watching Grievous' progress through a hologram transmission, told the cyborg general of the Republic's Kaliida Shoals Medical Center, treating over 60,000 wounded clones near the Naboo system. Dooku assigned the medical center as the Malevolence's new target. Grievous was pleased with this new assignment, as it showed that the Count had not lost all faith in him since the defeat at Abregado."}, {"tag": "h3", "text": "Destruction of the Malevolence"}, {"tag": "p", "text": "En route to the medical facility, Dooku contacted Grievous through a hologram transmission, after he received intelligence from his master, Darth Sidious, that the Republic had launched a small group of fighters to attack the Malevolence. Grievous noted that the Malevolence's hyperdrive was not fast and the warship's navicomputer was forced to recalculate its coordinates in order to go around the Kaliida Nebula. In an attempt to stop him, Skywalker and Tano retrieved brand-new BTL-B Y-wing starfighters, nimble bombers manufactured by Koensayr Manufacturing. Their squadron soon left and entered the Kaliida Nebula as a shortcut to arrive at the medcenter before the Malevolence, while High Jedi General Obi-Wan Kenobi and his fleet went around the nebula. The massive ship arrived near the medcenter and began to fire on the departing medical frigates. Upon emerging from the nebula, Skywalker led the Republic squadron to engage the Malevolence. Vulture droids were dispatched from the Malevolence and attacked the Republic group. As they engaged Skywalker's bombers, Grievous ordered the battle droids to fire the ion cannon at the approaching group. The ion wave deactivated the Vulture droids and three of Skywalker's bombers. However, the Republic squadron managed to damage the two heavy ion cannons, causing them to overload and explode and damaging the ship's hyperdrive in the process."}, {"tag": "p", "text": "After the Republic disabled the Malevolence, Count Dooku contacted Grievous and informed him that his master had sent a senator to the warship's location. Sidious, using his alter ego of Supreme Chancellor Palpatine, sent Padmé Amidala and her protocol droid, C-3PO, who were to negotiate a peace treaty with InterGalactic Banking Clan officials. However, Amidala wasn't fully aware of the situation, and she and her droid were captured by the Malevolence's tractor beam, but evaded capture after destroying their ship inside the warship's hangar. Firefighting battle droids that were stationed aboard rushed to the scene of the destroyed ship and began to extinguish the flames. Skywalker and Kenobi planned a rescue and left on the Twilight to board the Malevolence through an emergency airlock. Grievous and a squad of B2 super battle droids and B1-Series battle droids soon left the bridge while Amidala contacted Skywalker via a transmission box inside the Malevolence. The senator waited until Grievous and his entourage passed by her before entering the internal rail jet room. Noticing that there were intruders, Grievous ordered the battle droids to protect the internal systems of the massive warship and to fix the hyperdrive."}, {"tag": "p", "text": "Inside the internal rail jet room, battle droids began to attack Amidala and C-3PO. Skywalker and Kenobi met up with Amidala inside the room, and Skywalker rescued Amidala on a separate rail cart while Kenobi went to rescue her droid, C-3PO. After Kenobi Force-pushed C-3PO onto storage containers outside the jet railings, Kenobi entered the hyperdrive room. Grievous confronted Kenobi, though the Jedi Master escaped to the rail jet room. Unbeknownst to Grievous, Skywalker and Amidala entered the bridge and destroyed all stationed battle droids there. As Amidala hid the destroyed battle droids inside a storage room, Skywalker tampered with the warship's navicomputer before the two left. Grievous followed Kenobi and engaged the Jedi in a lightsaber duel, but Kenobi escaped again and met up with Skywalker, Amidala, C-3PO and R2 in the Twilight. Seeing that the battle had been lost, Grievous left the Malevolence in his personal starfighter, the Soulless One. Meanwhile, the droid crew aboard the Malevolence, believing the hyperdrive to be fixed, prepared to jump to Sector Four in Confederate space. However, the droids, who were destroyed by Skywalker and Amidala, did not contact the squad of B1 battle droids that were preparing to jump to hyperspace. The battle droids realized that the massive warship wasn't responding to the coordinates they entered and contacted Grievous. The general frantically ordered the droids to reset the navicomputer, but they failed to do so, resulting in the destruction of the ship. Grievous managed to escape, and the Twilight returned to the waiting Republic ships. The Malevolence's threat was over."}, {"tag": "p", "text": "After the vessel's destruction, a squad of Republic clone troopers under the command of Captain Lock was assigned to investigate the wreckage. CT-8863 found computer parts which originated from Kynachi. The squad was later assigned to investigate Kynachi."}, {"tag": "h3", "text": "Rebuilding of the Malevolence"}, {"tag": "p", "text": "Around 21 BBY, the Malevolence was rebuilt at Pammant Docks. Before it ever left the docks, however, this successor vessel was destroyed by a Jedi Knight."}, {"tag": "h2", "text": "Commanders and crew"}, {"tag": "p", "text": "General Grievous was the leading commander of the Malevolence, and it served as his flagship. Battle droids maintained and controlled the bridge. Grievous commanded the battle droids; however, the relationship between Grievous and battle droids was shaken during his time commanding the Malevolence."}, {"tag": "p", "text": "Count Dooku was on board at the time of the Battle of Abregado and acted as an advisor for Grievous. The Sith Lord also served as another commander, and often contacted Grievous via hologram to check in on the general's progress. He helped Grievous by orchestrating battle plans, as well as exploiting the maneuvers and attacks of the Republic forces."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The Malevolence was originally based on concept art for a Separatist communications ship meant to be used in Star Wars: Episode III Revenge of the Sith. Designed in 2004, the warship was originally Grievous' flagship during the Battle of Coruscant, with a design similar to that of the Invisible Hand. The idea of the massive warship was dropped, and the Invisible Hand became Grievous' flagship in Revenge of the Sith."}, {"tag": "p", "text": "According to Dave Filoni, supervising director of Star Wars: The Clone Wars, the Malevolence and its story were based in part on the real-life German battleship Bismarck, which the British Royal Navy hunted relentlessly during World War II. The finished version of the Malevolence was designed by Russell Chong and was based upon the GR-75 medium transport. Originally, the iconic train-like transport system in the center of the Malevolence was created so large that the Malevolence, to scale, could be flown inside its own train system."}, {"tag": "p", "text": "In the The Clone Wars episode \"Shadow of Malevolence,\" Anakin Skywalker commands the Y-wing bombers to attack the starboard ion cannon, but the port cannon is the one destroyed. Anakin may have meant the cannon on the bombers starboard side. The explosion takes out both cannons, however. It is possible that the cannons either use the same power generator or are really just one big two-way cannon that can fire from either side; this may have caused the destruction of one side to produce a chain reaction destroying both guns, as well as causing extensive damage to most of the ship."}, {"tag": "p", "text": "Henry Gilroy has suggested that the reason the Malevolence is able to receive holographic communications while in hyperspace is related to the size of the ship's internal gravity field."}, {"tag": "p", "text": "The firing-channel design of the Malevolence's ion cannon is almost identical to the firing channel of the Death Star in Star Wars: Episode IV A New Hope."}, {"tag": "p", "text": "In 2012, LEGO released a Malevolence warship set."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h3", "text": "Non-canon appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}