{"url": "Malik_Carr", "categories": ["Category:Legends articles", "Category:Domain Carr", "Category:Males", "Category:Yuuzhan Vong senior officers"], "nodes": [{"tag": "h1", "text": "Malik Carr"}, {"tag": "p", "text": "Malik Carr was a male Yuuzhan Vong warrior who fought during the Yuuzhan Vong War. A skilled tactician and leader, Carr was promoted to the rank of commander shortly before the invasion, and took his flotilla to the conquered world of Obroa-skai. There, he became caught up in Executor Nom Anor's plot to infiltrate a deception sect priestess into the New Republic and use her to assassinate the Jedi Order. Carr's involvement in the scheme was minor, and thus when it failed he went unpunished, unlike the other architects of the ploy."}, {"tag": "p", "text": "With the majority of senior Yuuzhan Vong officers still in transit from the Outer Rim, Supreme Commander Nas Choka placed Malik Carr in command of the push towards the Core Worlds. Working alongside Nom Anor once again, Carr entered into a specious alliance with the Hutts, and manipulated the flow of intelligence to the New Republic in preparation for a strike on the vital shipyards at Fondor. The ruse was successful, and the New Republic Defense Force was caught off guard. While the Yuuzhan Vong were attacking Fondor, however, elements at Corellia associated with the New Republic fired Centerpoint Station upon Malik Carr's forces, wiping out half of the Yuuzhan Vong fleet present."}, {"tag": "p", "text": "Disgraced and demoted, Malik Carr spent three years guarding Galactic Alliance prisoners on Selvaris, before he demonstrated his worth once again by saving much of a Yuuzhan Vong convoy from destruction and capture. For his actions, Carr was escalated to the rank of supreme commander, and on Warmaster Nas Choka's orders assaulted the planet Caluula in preparation for an attack on the Galactic Alliance capital of Dac. Malik Carr's forces took Caluula with ease, once the defenders had been routed and the governess capitulated. Unfortunately for Supreme Commander Carr, however, the Galactic Alliance utilized the planet as a testbed for their anti-Yuuzhan Vong bioweapon, Alpha Red. Infected by the pathogen along with the rest of his forces, the supreme commander died on Caluula."}, {"tag": "h2", "text": "Biography"}, {"tag": "h3", "text": "The defection plot"}, {"tag": "p", "text": "Born into Domain Carr, Malik Carr rose through the ranks of the warrior caste, his scars and escalation markings demonstrating his military prowess. Shortly before the Yuuzhan Vong War of the galaxy began in 25 ABY, Carr was escalated to the rank of commander."}, {"tag": "p", "text": "Once the invasion was fully underway, Carr was dispatched by his superiors to Obroa-skai, a world recently conquered by the forces of Tla, a fellow commander. He arrived at the head of his sizeable flotilla in mid 25 ABY, and met with Tla and his staff to discuss the progress of the invasion. Tla's tactician, Raff, apprised Carr of the military situation; the Yuuzhan Vong were poised on the threshold of the Inner Rim, having cut a swath through the Outer Rim Territories from Belkadan. Malik Carr informed his fellows of the ships under construction at the shipwomb housed in the ruins of Sernpidal, a world destroyed in the opening stages of the invasion, and advocated a subtle approach to Coruscant, the galactic capital, through Hutt Space. The Hutt kajidics had already been approached by Executor Nom Anor. Carr approved of the specious negotiations with the Hutt Grand Council, eager to take command and conquer the territories that the Council ruled over. Carr had, however, arrived at a crucial stage in the plans of Commander Tla and several of his confederates, the priest Harrar, Nom Anor and Raff. Anor and Harrar had hatched a scheme which would see a deception sect priestess, Elan, falsely defect to the New Republic before assassinating as many Jedi as possible. The Jedi Order had been seen as a significant threat to the progress of the Yuuzhan Vong, and the plan had been long in the making, and yet, almost immediately upon Malik Carr's arrival, news was received that complications had arisen in the false defection. An organization collaborating with the Yuuzhan Vong, the Peace Brigade, had discovered Elan's location at Bilbringi and in good faith had sought to return her to the Yuuzhan Vong. At the request of Nom Anor, Carr provided his personal vessel, an advanced frigate, to the executor, and the intendant rushed to the nearby Bilbringi system to salvage the situation."}, {"tag": "p", "text": "While Anor raced to Bilbringi, the priest Harrar explained the plan to Malik Carr, who expressed serious doubts on the convoluted and costly nature of the scheme. Harrar assuaged the commander's fears with the promise that the success of the plan would see Carr escalated to the position of Supreme Commander, and the two contacted Anor via villip to remain updated on the battle which unfolded in the Bilbringi system. Elan had been being transported on the passenger liner Queen of Empire by New Republic Intelligence operatives—before the misguided Peace Brigade had ambushed the liner and boarded it. Carr and Harrar believed that all Anor had to do was dispatch a dovin basal to prevent the Peace Brigade gunship from leaving the Queen of Empire, but the arrival of the New Republic Quasar Fire-class bulk cruiser Thurse further complicated the situation. Carr's frigate, loaned to Anor, was damaged by New Republic forces even as it used its powerful dovin basals to microjump around the system; Anor was desperate to ensure that the New Republic recaptured Elan from the Peace Brigade so that his scheme did not fail, and so attempted to fight convincingly while keeping his erstwhile allies at arm's length. At Obroa-skai, as they observed the confused skirmish, Tla complained to Carr that alienating the Peace Brigade was self-defeating, and only served to muddy the waters with their newfound collaborators. Carr asked Nom Anor if he would relinquish command of the frigate to the worried Tla, but the executor refused. The farce at Bilbringi only worsened as the Peace Brigade, despite Anor's best efforts to impede their progress, rushed Elan towards the Yuuzhan Vong frigate, and eventually the defector was discovered and killed. With the entire complement of yorik-et starfighters lost, Malik Carr saw the phony defection as a ludicrous error. He accompanied Anor, Harrar, Tla and Raff to deliver a report to Supreme Commander Nas Choka, Carr's immediate superior. While the priest and Commander Tla were recalled in disgrace to the Outer Rim Territories, Nas Choka bestowed command of the invasion of Hutt Space upon Carr. Nom Anor was spared punishment by Prefect Drathul of the intendant caste, and Malik Carr joined the executor on a diplomatic envoy to meet the Hutts' nominated leader, Borga Besadii Diori, on Nal Hutta."}, {"tag": "h3", "text": "Manipulating the Hutts"}, {"tag": "p", "text": "Before traveling with Anor to meet the Hutt, Malik Carr had been briefed by the executor on the nature of the species; devious, amoral and practiced negotiators, according to the intendant. Carr was disgusted by the world of Nal Hutta, and equally disgusted by Borga and what he saw as her thinly veiled duplicity. Nevertheless, the Hutts served Carr's purpose. Following a brief discussion concerning their new alliance, which Anor and Carr mostly spent mocking Borga in their own tongue, Carr advised Borga, at the Hutt's request, to end spice shipments to the Tynnani system, Bothan Space and the Corellian system. By doing so, Carr and Anor were weaving an intricate deception within their vacuous deal; they knew, and expected, that either Borga would inform the New Republic of the now obviously impending strikes on Tynna, Bothawui and Corellia, or that New Republic Intelligence would notice the discrepancy in the spice trade, alerting the New Republic Defense Force to the threats. In fact, the true target was Fondor and its shipyards, although Tynna actually remained an objective so as to provide the spice trade intelligence with its own verisimilitude. Thus, while Borga and her allies believed they were duping Malik Carr into providing them with vital information, they were in fact being used themselves, while granting the Yuuzhan Vong worlds to inhabit—such as Runaway Prince—and offering their services as slavers."}, {"tag": "p", "text": "Yuuzhan Vong politics extracted Carr from the Hutt project, as Supreme Commander Nas Choka arrived in Hutt Space to be welcomed to the war. Malik Carr received his superior officer aboard his own flagship, the Yammka, though it was Nas Choka who addressed the assembled Yuuzhan Vong, and who escalated several subalterns. Nom Anor then informed a doubtful Nas Choka of the plan to manipulate the Hutts, requesting that the supreme commander accompany him and Malik Carr to Tynna. There, Choka and Carr coordinated the conflict, well aware as they wiped out the defense forces and terraformed the world for later use that a hidden New Republic vessel was observing the battle—this vindicated Carr's plan, as it proved that the New Republic were aware of the fluctuations in the spice trade, and believed that the Yuuzhan Vong did not possess knowledge of an apparently vital flaw in their invasion plan. Returning victorious to the flotilla assembled over Runaway Prince, Carr and Choka apprised Warmaster Tsavong Lah of the scheme. Carr had already begun preparing coralskipper pilots for suicide runs on Fondor's shipyards, and the hyperspace lanes between Bothawui and Fondor, as well as those between Corellia and Fondor, were seeded with dovin basal mines."}, {"tag": "p", "text": "Before the assault on Fondor, Malik Carr returned with Anor and Nas Choka to Nal Hutta for another meeting with Borga Besadii Diori. Although Choka was less facetious than Carr in his dealings with Borga, preferring instead to threaten the Hutt with invasion and death, both he, Carr and Anor were shocked when they discovered that a Jedi Knight had been captured at Gyndine, and had since then been aboard the Crèche, a vessel which was transporting a yammosk—telepathic creatures used by the Yuuzhan Vong to coordinate warfare—vital to the battle soon to be waged at Fondor. This sudden turn of events—Choka was desperate to lay his hands on a Jedi—excited the supreme commander to the extent that he insulted and threatened Borga; Malik Carr and the Yuuzhan Vong present readied themselves for a fight. The situation was defused when Choka made contact with Chine-kal, who commanded the Crèche. Although Carr and Choka ascertained that the vessel was currently in the Kalarba system, in doing so they revealed the Crèche's location to Borga. The Hutt, already alarmed by the nature of the deal with the invaders, betrayed Malik Carr and the Yuuzhan Vong. By means of a series of Hutt contacts, a New Republic starfighter squadron was informed of the presence of the lost Jedi Knight at Kalarba and engaged the Crèche, forcing Chine-kal to take the vessel to Fondor ahead of schedule."}, {"tag": "h3", "text": "The disaster at Fondor"}, {"tag": "p", "text": "The unforeseen attack on the Crèche prompted Choka and Carr to advance their plans, and the Yuuzhan Vong armada sped to Fondor at all haste. The Yuuzhan Vong bypassed both Bothawui and Corellia, the targets Carr had advertised his intentions for to the Hutts, and arrived at Fondor to conduct a relentless assault on the shipyards and the New Republic First Battle Group which guarded them. The thirty prize New Republic vessels nearing completion were destroyed by Carr's forces, and yorik-et pilots drove their craft into the shipyards and orbital defenses. Thanks to Carr's strategy, the elements of the New Republic Fifth Battle Group which launched from Bothawui were unable to reach Fondor in time, as the hyperspace lanes had been seeded. Fortunately for Carr and Choka, the Crèche arrived at the same time their armada did, although the vessel was boarded by the squadron which had pursued it from Kalarba, and the yammosk was killed. Nevertheless, the attack on Fondor and its shipyards, vital to the New Republic war effort, continued, with the First Fleet beaten back to the planet and Fondor itself bombarded."}, {"tag": "p", "text": "At the same time as a task force of Hapan warships arrived from nearby Commenor to defend Fondor, Centerpoint Station was fired upon the system. Dormant in the Corellian system since its last firing in 18 ABY, Centerpoint Station was a construction of unparalleled power, capable of swatting entire fleets out of the sky with repulsor waves or inducing supernovas with a massive pulse of gravitic energy. Malik Carr had been aware that Corellia was a trap for the Yuuzhan Vong, and thus the target had remained Fondor, but he had possessed no intelligence indicating the extraordinary abilities of the ancient space station. When it was fired upon his fleet, it obliterated half of the Yuuzhan Vong ships in an instant, along with three quarters of the newly arrived Hapan forces. Malik Carr could only stare at the carnage and voice stunned comments while Choka attempted to communicate with a dying Chine-kal on the Crèche. Shocked but partially successful in their original goals, Choka and Carr retreated the remnants of the armada, aware that the Hutts had betrayed the location of the Crèche at Kalarba. Malik Carr became a supreme commander nonetheless."}, {"tag": "h3", "text": "Relegated to obscurity"}, {"tag": "p", "text": "Following the failure at Fondor, both Choka and Carr were blamed, but while the former managed to campaign tirelessly in his destruction of the Hutts and eventually gain redemption, Carr was demoted from his newly acquired rank of supreme commander to the level of a prison warden, guarding captives on the backwater world of Selvaris, in the Tantara system. A prison was constructed, high-walled and dotted with watchtowers, guarded by a host of warriors—testimony, in Carr's opinion, to the poor progress of the war against the reconstructed New Republic. Commander Malik Carr lived out long days in Selvaris' blistering heat, while in his absence Nas Choka was escalated to warmaster, Harrar to high priest, and Nom Anor to prefect of conquered Coruscant, itself renamed Yuuzhan'tar. During his time on the planet, however, Carr learnt to speak fluent Galactic Basic, and was well respected by the lesser warriors. Nevertheless, he watched over the captives with disinterest. Depressed and miserable, Carr allowed food to be brought in to the sickly prisoners from the outlying settlements, and left the running of the camp most to his subordinate, Subaltern S'yito. By 29 ABY, over three years after the disaster at Fondor, the prison was full of high-ranking Galactic Alliance officials and soldiers; with the failure of the Galactic Alliance's Operation Trinity at Bilbringi, Carr's camp saw the arrival of Judder Page and Pash Cracken, leading Galactic Alliance soldiers who quickly organized the prisoners and spent months planning an escape with local aid. The prisoners' subterfuge remained outside both Carr's and S'yito's notice; Carr was accustomed to spending his time inside his quarters, brooding upon his failings."}, {"tag": "p", "text": "Eventually, Carr received word that a sacrificial ceremony to be conducted on Yuuzhan'tar would require hundreds of prisoners. A Yuuzhan Vong and Peace Brigade convoy was visiting the Yuuzhan Vong prison planets in turn, and Selvaris was the final stop for the vessels before the Yuuzhan Vong capital. Thus, when a few days before the convoy's scheduled arrival four prisoners managed to escape the camp through a tunnel, board swoops and race out through Selvaris' jungles, Carr first contemplated suicide, aware that Warmaster Nas Choka's wrath would be too much for him to take. Before long, however, Carr regained his composure and sent out search parties to recover the fleeing captives. Yorik-et, bissop hounds and Tsik-Vai scout craft were dispatched to intercept the prisoners; two were killed, one was captured, and one escaped—a Jenet, taken off the planet by the light freighter Millennium Falcon. Angry and vengeful, Carr had the remaining prisoners drugged, ordered several of S'yito's guards kill each other as a form of punishment, and tortured the surviving escapee, a Bith, to death with a tkun in front of the assembled prisoners. Carr was unable to determine the content of the intelligence the Bith and his fellow escapees had been fleeing with, only that it was a code. To punish the captives further, he forced Cracken, Page and the others to spend a day of stifling suffocation in an immolation pit; fifty of the prisoners died. Lastly, Carr sent S'yito and his warriors to the surrounding villages to execute every local they could find; the warrior surmised correctly that someone local had abetted the prisoners in their escape. Having failed to extract the information on the code's contents from Judder Page, Malik Carr awaited the arrival of the prison convoy."}, {"tag": "h3", "text": "The Battle of Selvaris"}, {"tag": "p", "text": "Commander Bhu Fath and the convoy reached Selvaris several days later, and the surviving prisoners were loaded onto the vessels. As a guest, Malik Carr boarded Fath's Uumufalh gunship, the Sacred Pyre, and gloomily watched as the Yuuzhan Vong ships docked with those of the Peace Brigade, transferring the prisoners throughout the convoy. Carr felt disgusted by consorting with the Peace Brigaders and their inorganic ships, and loathed the idea of meeting Nas Choka on Yuuzhan'tar. It was not long, however, that he discovered the contents of the code the captives had escaped with; coordinates for the convoy's route. A flotilla of Galactic Alliance warships exited hyperspace and engaged the convoy; without a yammosk Malik Carr realized that he needed to react, or face further demotion. Giving orders on instinct, Carr called for reinforcements, demanded that the Peace Brigade vessels flee to Yuuzhan'tar, and deployed the convoy's yorik-et starfighters—Commander Fath deferred to the judgment of the more experienced warrior. As the Galactic Alliance force coped with the escaping Peace Brigade freighters, Carr moved across to the Brigade freighter tethered by an oqa membrane to the Sacred Pyre to take the prisoners back onboard the Yuuzhan Vong gunship. The Galactic Alliance, however, had numerical superiority, and their agents among the Peace Brigade had disabled the hyperdrives of several of the convoy vessels. Before long, coma gas was fired via boarding harpoons into the freighter; the Galactic Alliance strike troops moved through the organic cofferdam and defeated the warriors aboard the Sacred Pyre. Carr and Fath were captured in the Sacred Pyre's aft hold. Once Carr's nemesis, Judder Page, was freed by his rescuers—Han and Leia Organa Solo—both he and Carr had a brief conversation. Fortunately for Malik Carr, Page turned down Solo's offer of a blaster with which to exact his revenge, deciding instead to leave the prison commander to his fate on Yuuzhan'tar. At that moment, however, reinforcements arrived from Yuuzhan'tar in the form of slayer ships, and the Galactic Alliance forces retreated. Before Page left, Carr called out to his former charge, promising that he would see the captain die. With under half the prisoners required for the ceremony, Fath and Malik Carr led the remnants of the convoy to the Yuuzhan Vong capital."}, {"tag": "h3", "text": "Escalation and end"}, {"tag": "p", "text": "On arrival on Yuuzhan'tar, the Peace Brigaders were taken captive, and Bhu Fath explained himself to High Priest Jakan. Malik Carr remained silent, until Nas Choka summoned him before the ruler of the Yuuzhan Vong, Supreme Overlord Shimrra Jamaane, citing Carr's actions at the Battle of Selvaris as exemplary. At an order from the Supreme Overlord, a cloak of command was affixed to Malik Carr's shoulders. After three years in obscurity, Carr was reinstated as a supreme commander. The planned ceremony still had a dearth of sacrificial victims, and thus Supreme Commander Carr was dispatched to Caluula, a world being prepared as a staging area for an assault on the Galactic Alliance capital of Dac, in order to acquire more captives for sacrifice. Assigned a full battle group, an ychna warbeast—towed into position by special dovin basals grown on Tynna, one of Carr's first conquests—and hundreds of warriors, Carr led his forces to Caluula and immediately assaulted the planet's defense station. Although a complement of Mandalorian Protectors and the station's defenders put up a fierce struggle, Malik Carr's forces overwhelmed them, and the supreme commander's vessels were soon loaded with captives to be returned to Shimrra Jamaane on Yuuzhan'tar. Pash Cracken, one of the leading inmates on Selvaris, was recaptured—the Millennium Falcon, one of the ships which had raided the convoy, had fled straight to Caluula from the Tantara system, and therefore several of the prisoners liberated from the convoy over Selvaris were returned to Yuuzhan Vong custody."}, {"tag": "p", "text": "Nas Choka had ordered Malik Carr to install a yammosk on Caluula, so that when the armada retreated or returned from Dac, their passing through the Caluula system would be coordinated. Therefore when the governess capitulated to his invasion force in return for concessions to the populace, Carr set up the yammosk in a well-guarded minshal in the heart of Caluula City, and the population, once their technology had been disposed of, was free to live alongside their conquerors. In fact, Malik Carr even allowed a scientific exploration team to come and observe the Nocturne of the Winged-Stars, a phenomenon specific to Caluula which occurred every three hundred years. First, however, Carr had to receive permission from Jakan, High Prefect Drathul of the intendants, and Nas Choka. The warmaster contacted Malik Carr and informed the supreme commander that the scientific exploration team should be allowed to land on Caluula. Carr was unaware that Caluula was a testbed for Galactic Alliance Intelligence; Chiss scientists and Alpha Blue, an Intelligence organization, had been working on a Yuuzhan Vong specific pathogen, highly contagious and lethally efficient. Caluula Station had fallen as part of the Galactic Alliance plan, and the planet's government had been ordered to capitulate so that the Alpha Red virus could be seen in action upon the world. From the team of scientists recently arrived on Caluula, only one member was sincere; the others had been tasked with destroying the yammosk—in reality, unknown to even the majority of the strike team members, they were also to act as observers of Alpha Red's effects upon Carr and his troops. The virus began to ravage the Yuuzhan Vong present on Caluula; yorik-et became sluggish and crashed, and biots began to struggle to perform the simplest of tasks. Lethargy and sickness were soon prevalent among Carr's forces, although the supreme commander still possessed enough of his wits to ascertain that the scientist team was a Galactic Alliance force; he had the strike force ambushed and captured by Slayers, and discovered to his pleasure that Judder Page, a Jedi Master and the Solos were among its members."}, {"tag": "p", "text": "Although Malik Carr was rapidly dying—he was supported at most times by two other warriors—he went managed to survive for some time in the rotting, diseased minshal. All around him, Yuuzhan Vong and their technology were expiring; the yammosk itself was in its death throes, but the supreme commander was still certain that he would sacrifice Page and the others to the ailing war coordinator, as he had vowed to do over Selvaris. After sending the minshal's shaper back to Yuuzhan'tar with the dying Slayers to apprise Supreme Overlord Jamaane of the virus which was afflicting the Yuuzhan Vong, Malik Carr went to visit his prisoners. By this time, the supreme commander had lost all energy; he asked Page calmly what it was about Caluula which was killing him and his species, before admitting that in this weakened state he could not bring himself to hate his opponents. As the yammosk and the guards died, Carr made a final effort. Standing unsteadily, Supreme Commander Malik Carr offered Page his respect before collapsing dead to the ground."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "Malik Carr was shrewd and cunning, as befitted a commander in the Yuuzhan Vong fleet. He was able to see the dangers of the defection scheme, and refrained from involving himself too heavily in the plan; this allowed him to be nominated as the leader of the attack upon the Hutts, where his propensity for manipulation and subterfuge demonstrated itself once again. A sound tactician, Carr's use of yorik-et as suicide weapons was devastating for the Fondor Shipyards and his order to have the vital Peace Brigade freighters retreat from the Battle of Selvaris instead of remaining to fight showed flexibility and initiative. Carr was often prone, however, to underestimate his opponents; pride and shortsightedness cost him the fleet at Fondor, and facilitated the prison escape. Along the same lines, the supreme commander was not alerted by the ease with which Caluula fell and capitulated, and allowed the phony scientific research team to infiltrate the planet."}, {"tag": "p", "text": "Following his demotion and disgrace, Carr became prone to fits of anger and regret—he often contemplated suicide. A streak of sadism emerged in the warrior's personality, along with a dark sense of humor, best demonstrated in the interrogation and torture of the Bith captive. Malik Carr also lost a certain degree of faith and devotion to his superiors, loathing Nas Choka and killing fifty of the prisoners in the face of their known value to the Yuuzhan Vong on Yuuzhan'tar. Once Carr was escalated, his steadfast loyalty returned; he oversaw the conquest of Caluula and remained to guard the yammosk personally. The advent of the Alpha Red pathogen saw another change in Malik Carr's personality. With all his energy sapped and expended, the supreme commander found it difficult to hate his enemy, claiming that he only \"pitied\" the denizens of the galaxy. Indeed, Carr used a blaster without any compunctions shortly before his death, and exhaustedly sat by his captives with apparent respect, before he died."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Role"}, {"tag": "p", "text": "Malik Carr first appeared toward the final third of James Luceno's The New Jedi Order: Agents of Chaos I: Hero's Trial, and though he played little part in the last stages of the Elan defection, he was set up at the end of the novel as the officer in charge of conquering Hutt Space. The second novel in the Agents of Chaos Duology, Jedi Eclipse, deals with Malik Carr as one of the primary Yuuzhan Vong antagonists. The last Yuuzhan Vong activity in the novel is the reaction of Nas Choka and Malik Carr to the Battle of Fondor; Carr's demotion following the battle is not addressed in Jedi Eclipse. Malik Carr went unmentioned for the rest of The New Jedi Order series before emerging once again in The New Jedi Order: The Unifying Force, Luceno's third New Jedi Order novel and the last in the series."}, {"tag": "h3", "text": "Rank discrepancy"}, {"tag": "p", "text": "In Agents of Chaos I: Hero's Trial, Malik Carr is stated throughout to be a commander; this remains the same in Agents of Chaos II: Jedi Eclipse, and whenever Nas Choka and Malik Carr are together during the novel, only Choka is referred to as a supreme commander. Choka indicates himself as Malik Carr's superior during the negotiations with Borga the Hutt, and no mention of Carr holding any rank higher than commander is present in the text. In The Unifying Force, however, Malik Carr has been demoted to \"commander\", a rank he seemingly already held. Furthermore, both Bhu Fath and Nas Choka apparently refer to Carr as having held the rank of supreme commander before his demotion. This article assumes that Malik Carr attained the rank of supreme commander after the Battle of Fondor, only to be demoted from the position shortly afterward by the Yuuzhan Vong hierarchy. While this is supposition, it serves to explain Luceno's contradictory statements in his three novels."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}