{"url": "Malinth", "categories": ["Category:Legends articles", "Category:Wookieepedia Good articles", "Category:Humans", "Category:Imperial Navy officers of the Galactic Empire", "Category:Males"], "nodes": [{"tag": "h1", "text": "Malinth"}, {"tag": "p", "text": "Malinth was a Human male Imperial Fleet Commander who was stationed on the Outer Rim planet Honoghr during the Galactic Civil War. He was killed when forces of the Zann Consortium attacked Honoghr. Malinth's death lessened Imperial influence on the planet, allowing the Consortium to gain a foothold in the region."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Malinth was a brown–haired Human male who served the Imperial Navy during the Galactic Civil War. Around 0 BBY, Malinth held the rank of Fleet Commander and was stationed on the Outer Rim planet Honoghr, the homeworld of the Noghri, a species allied with the Empire. During that time, the Zann Consortium, a criminal organization led by Tyber Zann, tried to reestablish its previous dominance of the criminal underworld after the escape of their leader from the Imperial prison on Kessel. To this end, the Consortium tried to get a foothold by gaining influence on Honoghr. Zann sent a team of soldiers, including his second-in-command, Urai Fen, to attack Honoghr and kill Commander Malinth. Upon landing on the planet, Consortium troops engaged the Imperial and Noghri forces in battle, during which Malinth was killed. The Commander's death lessened the Imperial influence on the planet, allowing the Consortium to undermine the Imperial command on Honoghr."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Malinth first appeared in the 2006 video game Forces of Corruption, an expansion for the game Star Wars: Empire at War. While the player's object for the Honoghr mission is to kill Malinth, the game gives several choices how to eliminate him. In the game's Prima guide, the player is advised to kill Malinth by sending a cloaked Urai Fen."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}