{"url": "Mallohe", "categories": ["Category:Legends articles", "Category:Wookieepedia former Good articles", "Category:Articles with gameplay alternatives", "Category:Females", "Category:Humans", "Category:Military officers of the Sith Empire"], "nodes": [{"tag": "h1", "text": "Mallohe"}, {"tag": "p", "text": "Mallohe was a Human female lieutenant who served in the Imperial Navy during the Cold War, which saw the reconstituted Sith Empire pitted against the Galactic Republic. Around the year 3643 BBY, Mallohe had been stationed on the Sith capital planet of Dromund Kaas for six months, at which time she was assigned to prepare encoded reports on recent Cold War conflicts for a Sith Lord named Kras. Kras wanted Mallohe to send him an Imperial individual who had been part of the recent fighting so that he could interview the individual inside the Imperial Citadel's Sith Sanctum in Kaas City, the capital of Dromund Kaas. After she completed the reports, Lieutenant Mallohe was able to meet with an individual who had been involved in a attack made by the Imperial transport Black Talon on the Republic warship, Brentaal Star. The individual took Mallohe's reports to Lord Kras and was interviewed by him."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "A female Human, Mallohe served in the Imperial Navy of the Sith Empire during the time of the Cold War, a period of unrest between the Empire and the Galactic Republic. At one point in her career, Mallohe was assigned to serve on Dromund Kaas, the capital world of the Sith Empire. Around the year 3643 BBY, Mallohe had attained the rank of lieutenant and had served for six months on the Sith capital world. Unrest had brewed during that time between the Empire and the Republic, and many skirmishes were fought between the two sides. However, with her position being on Dromund Kaas, Lieutenant Mallohe did not take part in the combat.\nIn response to the fighting, a Sith Lord named Kras ordered Lieutenant Mallohe to produce coded reports that detailed the events of the skirmishes. Mallohe aided Kras in his preparations for a meeting with the Imperial Minister of War who would be presented with recommendations from the Sith Lord. Mallohe was also instructed to send an individual who had been involved in the recent fighting to the Sith Sanctum of the Imperial Citadel, a large fortress in the center of Dromund Kaas's capital, Kaas City. There Lord Kras could interview the combatants and obtain first-hand information on the battles with the Republic. After she completed the reports, Lieutenant Mallohe waited for recent combatants to arrive at Kaas City's spaceport."}, {"tag": "p", "text": "Eventually, an individual affiliated with the Empire arrived who had taken part in a recent battle where the Imperial Gage-class transport, Black Talon, attacked and boarded the Republic Thranta-class warship, Brentaal Star. Mallohe presented the order to the individual, who accepted the assignment, took the reports to Lord Kras, and was interviewed.by him."}, {"tag": "h2", "text": "Personality and traits"}, {"tag": "p", "text": "As a Sith military officer, Lieutenant Mallohe had experienced the nature of members of the Sith so that she treated them with respect—something which she advised other non-Sith to do as well. She also viewed the Sith as the sole way to defeat the Galactic Republic, which Mallohe viewed with hatred. The lieutenant had sufficient skills to write reports on combat operations fought between the Empire and the Galactic Republic. Mallohe had brown eyes, black hair, and was dark-skinned. She carried a blaster pistol and wore the uniform of a Sith military officer."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "Lieutenant Mallohe first appears in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare. In the game, Mallohe is featured on Dromund Kaas, the Sith capital planet, in the Kaas City spaceport. She gives a quest to Imperial players who completed \"The Black Talon\", the first multiplayer flashpoint mission for Imperial players in the game. In the flashpoint, the players are assigned to capture or kill an individual codenamed \"The General\" who had defected from the Empire to give military secrets to the Galactic Republic. The quest requires the player to take a coded message and report on the battle to Lord Kras, a Sith Lord who is located in Kaas City's Imperial Citadel, in an area of the fortress known as the Sith Sanctum. The quest is available to all of the Imperial classes and has some differences in dialogue from class to class. Also, the quest does not have any effect on the player character's light side or dark side alignment. While the players do not have to meet with Mallohe and can refuse the quest, this article is written with the assumption that at least one of the four Imperial characters speaks with Lieutenant Mallohe and delivers her reports to Lord Kras. The player is also not required to give an interview to complete the quest and can refuse to do anything with Lord Kras other than present the reports."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Notes and references"}]}