{"url": "Malorm_family", "categories": ["Category:Legends articles", "Category:Criminal organizations", "Category:Families"], "nodes": [{"tag": "h1", "text": "Malorm family"}, {"tag": "p", "text": "The Malorm family was a group of five Humans who cultivated a notorious reputation as a family of deranged killers. The family comprised three men—Shalla, Rek and Jez—and two women—Sheyna and Star. Though the full extent of their sinister exploits remains unknown, they pulled off a successful raid on a luxury spaceliner and nearly murdered a high-ranking government bureaucrat. Their life of crime was ended by a team of mercenaries on Matra VI."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "One of the Malorm family's more well-known crimes was their raid on the luxury spaceliner Galaxy Wanderer. After hijacking the Galaxy Wanderer in the Corporate Sector, they looted its vaults and spaced 30 passengers while holding off the forces of the Corporate Sector Authority's Security Police. The debacle ended with the Malorms escaping from both the eventual destruction of the Galaxy Wanderer and the clutches of the law."}, {"tag": "p", "text": "The beginning of the end for the Malorm family started with the appointment of Odumin as a Corporate Sector Authority Territorial Administrator. Odumin's tough approach to criminal activities in the Corporate Sector earned him their ire, and they targeted him for death. They came closest to killing Odumin when they discovered him spying upon them. However, since the Malorms, like the general public, didn't know what Odumin looked like, the wily Tynnan deceived them into believing that he was just someone's pet."}, {"tag": "p", "text": "Upon returning to more familiar surroundings, Odumin assembled a team of mercenaries to kill the Malorms. He made a professional gunman named Gallandro the leader of the team and promised them a significant amount of money, as well as a general amnesty that would be good in both the Corporate Sector and the Galactic Empire, as a reward for completion of their objective. Gallandro and the team of mercenaries disguised themselves as a Corporate Sector Authority Counterterrorist Security Team and lured the Malorms into an ambush on Matra VI, killing them."}, {"tag": "p", "text": "Gallandro's success would have unforeseen consequences for him, since Odumin had not been the only being who wanted the Malorm family dead. Some time after their deaths, Gallandro was accosted by a Malkite Poisoner who was a member of the Assassin's Guild. The woman informed Gallandro that his killing of the Malorms meant that she would be unable to fulfill her contract by killing them and that he would suffer the consequences for what he did. Gallandro killed her, an action that began his decade-long feud with the Assassin's Guild."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}