{"url": "Mama", "categories": ["Category:Canon articles", "Category:Articles to be expanded", "Category:Females", "Category:Hutts", "Category:Nal Hutta residents"], "nodes": [{"tag": "h1", "text": "Mama"}, {"tag": "p", "text": "Mama was an elder obese female Hutt of the Hutt Clan prior to and during the Clone Wars. She was the mother of Ebor, Ziro, and Jabba Desilijic Tiure's father. She was also the grandmother of Jabba, and the great-grandmother of Rotta and Gorga."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mama, an elder Hutt, was born sometime before 1021 BBY, and sometime after became the wife of Papa. Together, they had three children: Ziro Desilijic Tiure, Ebor, and another male child. However, Ebor would eventually die. She was also the grandmother of Jabba Desilijic Tiure, and the great-grandmother of Jabba's son Rotta, and his nephew Gorga Desilijic Aarrpo. At some point before the start of the Clone Wars, Papa ran away, later dying and being buried on Teth. This information was known only to Ziro, who didn't have the heart to tell his mother that Papa had perished."}, {"tag": "h3", "text": "Hunt for Ziro"}, {"tag": "p", "text": "Years later, during the Clone Wars, Ziro was broken out of Republic Prison during a hostage situation brought on by the Bounty hunter Cad Bane, who had been hired by the Grand Hutt Council to liberate Ziro, due to the information he held on them, incriminating files on all the nefarious dealings of the Council over the years. Having been taken to Nal Hutta by Bane, Ziro was held by the Council while they decided what to do with him. During this time, Ziro's ex-lover Sy Snootles broke him out, and fleeing Gardulla and the Council, Ziro sought refuge at his old home, reuniting with Mama. Mama was not pleased to see him, having not seen him for years, only for him to return at dinner time. Despite Ziro claiming he was happy to see her again, Mama saw through his false flattery and simply asked him what he wanted. Ziro wanted to trade his Swamp Speeder for Mama's Starship, citing that Gardulla was after him. Mama decided to let Ziro take the ship, and Ziro and Snootles headed for Teth."}, {"tag": "p", "text": "Not long after their departure, Cad Bane and his droid Todo 360 arrived at the home, demanding to know where Ziro had gone. Mama pointed them in the direction of Teth, and they left after Ziro. No sooner than the Bounty Hunters had left, Mama had her third visitors for the night, two Jedi, Obi-Wan Kenobi and Quinlan Vos, who were also hunting Ziro. Mama was displeased with Quinlan's entrance into her home, the Jedi having broken down her door. Nethertheless, she helped the two Jedi, telling them that Ziro was headed for Teth. The two Jedi then left, Mama calling back to them, wanting her door repaired. Ziro would die on Teth, betrayed and murdered by Snootles, both Bane and the Jedi too late to claim Ziro for themselves. Ziro' death left Mama the last one left of their family."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The character of Mama was partly inspired by the character Pearl, a massively obese Vampire from the 1998 superhero film Blade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}