{"url": "Mama/Legends", "categories": ["Category:Pages needing citation", "Category:Legends articles", "Category:Females", "Category:Hutts of the Desilijic clan", "Category:Nal Hutta residents"], "nodes": [{"tag": "h1", "text": "Mama"}, {"tag": "p", "text": "Mama was an elder Hutt with a feminine personality, who lived during the final years of the Galactic Republic. She was the mother of several prolific Hutts of the Desilijic kajidic, including Ebor, Zorba Desilijic Tiure, Pazda Desilijic Tiure, Jiliac Desilijic Tiron and Ziro Desilijic Tiure. At one point she was married to Ziro's father. She lived in the middle of the swamps on the planet of Nal Hutta."}, {"tag": "h2", "text": "Biography"}, {"tag": "p", "text": "Mama was a Hutt with a feminine personality, and a member of the Desilijic kajidic; by the final years of the Galactic Republic, she was considered to be quite old. Over the previous centuries, Mama gave birth to several children, including Ebor, Zorba Desilijic Tiure, Pazda Desilijic Tiure, Jiliac Desilijic Tiron and Ziro Desilijic Tiure. She was the grandmother of Jabba Desilijic Tiure, and great-grandmother to his son, Rotta. Mama appeared to favor her son Ebor, who was deceased by circa 21 BBY, over his younger[source?] brother, Ziro, who had brought numerous bumbling disgraces to their family. She also seemed to be unaware that her husband had disappeared, nor that he had died and was entombed on Teth."}, {"tag": "p", "text": "Circa 21 BBY during the Clone Wars, she lived on the planet of Nal Hutta. For roughly 27 years Mama Desilijic was a respected member of the Hutt Grand Council and left the council in 21 BBY less then a month before the escape of her son Ziro, because of the strain the clone wars brought. Despite her offspring's successes, Mama chose to live in a modest hut in the swamps of that world. During the Clone Wars, a war which raged across the galaxy between the Republic and the secessionist Confederacy of Independent Systems, Ziro was imprisoned by the Hutt Grand Council within Gardulla's Palace on Nal Hutta. Ziro, who had been arrested by the Republic and only recently escaped, was held captive by the Grand Council, who knew he had made attempts to usurp Jabba's position within their clan and had a role in the kidnapping of Rotta. In addition to his crimes against his family, Ziro also possessed a datapad which contained details of the Hutt Cartel's criminal dealings. If he were to be killed, he vowed that it would be released to the authorities. Thus, they decided to keep him under their control."}, {"tag": "p", "text": "Ziro, however, had an accomplice in his lover, a singer named Sy Snootles. Snootles, who had been performing for the Grand Council, subsequently helped Ziro escape from his cell. The pair made their way to Mama's hut, where the elder woman coldly greeted her son. Ziro believed that her dislike for him would allow him to elude the Council's notice by heading somewhere they wouldn't expect. Though their conversation was strained, Mama finally agreed to trade her starship for Ziro's Pongeeta-class swamp speeder."}, {"tag": "p", "text": "Shortly afterward, Mama was visited by a bounty hunter named Cad Bane, who was working for the Council. Bane had previously secured Ziro's release from Republic custody, but the Hutts wanted him returned to them, and Bane was once more on their payroll. After Ziro left, Bane and his droid, Todo 360, arrived at Mama's hut and demanded to know where her son was going. With no love for her son and under the threat of Bane's menacing presence, she provided the bounty hunter with the information."}, {"tag": "p", "text": "Not long after this, Mama received a third set of visitors, as Jedi Masters Obi-Wan Kenobi and Quinlan Vos arrived under orders from the Jedi Council to retrieve Ziro for the Republic. Vos, a headstrong Master, made a terrible first impression when he burst through Mama's front door after slicing it apart with his lightsaber and subsequently expressed his revulsion of the elderly Hutt. Kenobi, however, apologized for the disturbance. Mama was less than pleased over the repeated and unpleasant visits, and gave the Jedi the information they desired as well. The Jedi left in a hurry, leaving Mama to call after them about who would pay for the door."}, {"tag": "p", "text": "Ultimately, reaching his father's tomb on Teth, Ziro retrieved the datapad containing the incriminating evidence against the Council. He now planned to turn it over to the Republic in exchange for both immunity and the Council's dissolution. Snootles, however, pulled a blaster on her lover because she was now working for his nephew, Jabba. Ziro was horrified by her betrayal and begged for his life, but she enacted revenge for his previous treachery and shot him in the chest, killing him."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "First appearing in the Star Wars: The Clone Wars television series episode \"Hunt for Ziro,\" Mama was voiced by Angelique Perrin."}, {"tag": "p", "text": "Mama's character was partly inspired by the character Pearl, a massively obese Vampire from the 1998 film Blade."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}