{"url": "Mamkoda_spaceport", "categories": ["Category:Canon articles", "Category:Articles with conjectural titles", "Category:Spaceports"], "nodes": [{"tag": "h1", "text": "Mamkoda spaceport"}, {"tag": "p", "text": "A spaceport was located on Mamkoda, a world located in the Cassander sector. Around 34 ABY, a local group of pirates, backed by the First Order, took control of the spaceport and fortified it converting it to their base of operations."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "The spaceport was located on Mamkoda, a world located in the Cassander sector, a part of the Trans-Hydian Borderlands region."}, {"tag": "h2", "text": "History"}, {"tag": "p", "text": "Around 34 ABY, during the Cold War between the First Order, the successor state of the Galactic Empire, and the Resistance, a paramilitary group led by New Republic senator Leia Organa, a local group of pirates, based on Sheh Soahi and backed by the First Order, seized the spaceport on Mamkoda and fortified it converting it to their base of operations on the world."}, {"tag": "p", "text": "When the Resistance learned about the First Order intentions of taking control of the sector by supplying weapons and starships to the pirates, they sent a group of A-wing starfighters and MG-100 StarFortress bombers to defend the sector from the pirates. The Resistance first objective was to take out the spaceport, turned base of operations, on the world of Mamkoda. After a battle with the pirates, Resistance bombers of Crimson and Cobalt Squadron were able to destroy the spaceport."}, {"tag": "p", "text": "Some time after the battle, Resistance gunner Paige Tico wrote about the spaceport subsequent battle in her journal, which would end up in possession of her sister Rose Tico after her death during the Battle of D'Qar."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "p", "text": "The spaceport was first mentioned in the the 2017 canon replica journal book The Last Jedi: Bomber Command, written by Jason Fry."}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}