{"url": "Manaan/Legends", "categories": ["Category:Legends articles", "Category:Wookieepedia former Featured articles", "Category:Articles in need of updating", "Category:Articles with gameplay alternatives", "Category:Pages needing citation", "Category:Galactic Empire planets", "Category:Galactic Republic planets", "Category:High-gravity planets", "Category:Infinite Empire planets", "Category:Manaan locations", "Category:Pyrshak system planets", "Category:Type I atmosphere planets", "Category:Waterworlds"], "nodes": [{"tag": "h1", "text": "Manaan"}, {"tag": "p", "text": "Manaan was an aquatic planet in the Pyrshak system. It was home to the Selkath, an amphibious species. The planet was completely covered in water and was the only known source of the medicinal substance kolto in the galaxy. Controlled by the Rakata during pre-Republic history, it became independent following the collapse of their Infinite Empire. In the years leading up to and during the Jedi Civil War, kolto was so important to the galaxy that the Selkath were able to use their monopoly to enforce their policy of neutrality and autonomy. The only above-surface settlement on Manaan was the floating Ahto City, built above Hrakert Rift, an abundant source of Kolto. Hiding in the depths of the rift lay a station where the Republic was trying to harvest Kolto at its source, aided by rebellious Selkath who saw the evil of the Sith Empire. This station fell in ruins when a Giant Firaxan Shark believed to be the source of Kolto and Selkath on the planet made the Selkath in the station go mad and rapidly kill the rest of the Crew. Eventually, Revan would find one of the star maps leading to the Star Forge. The map completed other maps found on Kashyyyk, Dantooine, Korriban, and Tatooine. During the Jedi Civil War, both the Sith Empire and the Galactic Republic attempted to get an upper hand in the war by creating secret deals that would give them more kolto. Since the selkath preferred to stay neutral, they did not favor the Republic or the Sith, however some rebelious Selkath did. Ultimately, however, the Selkath banned the Sith from Manaan for trying to overthrow the government."}, {"tag": "p", "text": "When kolto was replaced in favor of bacta, the Republic abandoned Manaan, and the Selkath left Ahto City for their ancient cities in the depths of the planet's oceans. Manaan did not have further contact with the galaxy until the Selkath were enslaved by the Galactic Empire sometime during the Galactic Civil War. Under the manipulation of Darth Vader, the Order of Shasa later overthrew their Imperial masters, only to become servants to Darth Vader and Emperor Palpatine. It also later became a flashpoint during the Yuuzhan Vong War."}, {"tag": "h2", "text": "Description"}, {"tag": "p", "text": "Manaan was the second of three planets that orbited the star Pyrshak. Located in the Inner Rim portion of \"the Slice,\" it had no moons, and the entire surface of the planet was covered with water. Ahto City served as the capital of the planet, and was the only surface city and spaceport. Since it was the only settlement accessible to offworlders, the only method of transit to the true surface of the planet was through a submersible from Ahto City."}, {"tag": "p", "text": "Canyons and rifts lined the ocean floor. At least one of the major rifts, the Hrakert Rift, had deposits of kolto, which was harvested as it drifted to the surface. The Hrakert Rift was also home to a giant firaxan shark known as the Progenitor and other, smaller sharks. Deep undersea caverns also served as homes to the native aquatic species, and the sentient Selkath built their cities, deep-sea pods, far beneath the surface. Much of the underwater area of Manaan was uncharted and unknown, even to the native Selkath."}, {"tag": "h2", "text": "History"}, {"tag": "h3", "text": "Infinite Empire"}, {"tag": "p", "text": "Thousands of years before the creation of the Galactic Republic, Manaan was invaded and conquered by the expanding Infinite Empire. The native Selkath were among the numerous species enslaved by the Rakata, and their language was among several spoken by an ancient droid that Revan encountered many millennia later. Some Selkath slaves were sent off-world to places such as Dantooine and Lehon. As slaves, they were used to construct large structures across the Rakatan empire, including temples and the Star Forge. When their empire began to collapse, however, the Rakata abandoned Manaan. By the Jedi Civil War, the only known evidence the Rakata left behind on the planet was an incomplete Star Map in the Hrakert Rift on the ocean floor."}, {"tag": "h3", "text": "Jedi Civil War"}, {"tag": "p", "text": "Manaan was rediscovered by the broader galactic community by the beginning of the Great Manifest Period, which began in 20,000 BBY. By the time of the Jedi Civil War, Manaan had established itself as one of the most important planets in the galaxy. As the sole provider of kolto, Manaan's resources were in high demand. In order to serve the needs of non-Selkath visitors, the Selkath built Ahto City, which was so large that it could be seen from orbit. Since kolto was in high demand during the war—due to its powerful healing properties—Manaan's entire economy revolved around its exportation. During the years prior to the Mandalorian Wars, Manaan's main client was the Galactic Republic, though Manaan itself was not a member of the Republic. Instead, Manaan adopted a state of neutrality. As the Jedi Civil War began, the Selkath established a series of laws to preserve their neutrality, sovereignty, and protection. Both the Galactic Republic and the Sith Empire had to abide by these laws, or risk full kolto sanctions. If any faction decided to invade the planet, the Selkath threatened to destroy the kolto supply."}, {"tag": "p", "text": "Despite the laws, both the Sith Empire and the Galactic Republic were constantly looking for ways to gain the advantage. A few of the Selkath recognized the potential consequences of a Sith victory and made a secret deal with the Republic, allowing them to build their own kolto harvesting base on the ocean floor. Unfortunately, the location chosen for the station was the Hrakert Rift, and the Progenitor was not pleased by the invasion of her territory. Through what was described as a telepathic scream, she drove the Selkath in the base and the firaxan sharks outside the base insane, and they attacked and killed nearly all of the Republic personnel. The operation was a disaster, and for some time the Republic Embassy did not know what had happened."}, {"tag": "p", "text": "When Revan arrived in Ahto City in search of the ancient Star Map, he was asked by Roland Wann to investigate the facility. In his exploration of the station Revan discovered that the kolto harvesters were what had disturbed the giant firaxa. He needed to get past the Progenitor if he planned to uncover the Star Map, so he weighed his options. He decided to destroy the harvesters, rather than risk tainting the kolto by trying to poison the creature. This plan worked and the Progenitor swam aside, allowing Revan to pass. The Republic lost its harvesters, but the kolto supply was safe and the Selkath commended Revan for his actions."}, {"tag": "h3", "text": "Autonomy"}, {"tag": "p", "text": "As the Jedi Civil War ended, Ahto City opened up to the galactic movement to give refuge to those displaced by the war. With sporadic wars and conflict, the Selkath established the Order of Shasa, a Force-sensitive cult, to protect them from invasion. The Order of Shasa continued to exist even through the Galactic Civil War."}, {"tag": "p", "text": "In the years after the Jedi Civil War, Manaan continued to extract kolto, but the supply mysteriously started to decline. As a result, the price of kolto sky-rocketed and the galaxy abandoned kolto in favor of a new healing agent: bacta. The new competition forced the Selkath to lower their prices, resulting in the collapse of the Manaan economy. This disrupted interstellar relationships and commerce. The decline of the kolto market meant the Selkath were forced to work much harder to re-establish themselves in the galactic arena. The Selkath attempted to join the Galactic Republic at this time, but corruption and complex interests barred the aquatic world from entering the interstellar union."}, {"tag": "p", "text": "During the Great Galactic War, the Selkath attempted to maintain their neutrality as a supplier of kolto to all who would buy. But the reconstituted Sith Empire refused to accept their neutral stance, and destroyed Manaan's surface cities. The Selkath fled beneath the oceans in a mass exodus from the surface.[source?] Later when war reemerged, the Selkath built the Mercantile Plaza, their first surface city and kolto distribution center since the bombardment. The Selkath once again extended their offer of neutrality and gave both the Sith Empire and The Republic a kolto trade agreement and a presence on Manaan."}, {"tag": "p", "text": "Despite their claim to neutrality, Manaan was a key planet in the later Republic-aligned Rift Alliance, with Shuuru as its representative. Originally separatist, Manaan, along with the rest of the Rift Alliance, was brought to be Republic supporting status by the Jedi Master known as the Barsen'thor, though its trading with the Sith Empire continued. At some point later, Ahto City was rebuilt as a surface city once more, with a specific mercantile district that both Republic and Imperial dignitaries could access. Due to the advanced medical technology and secrecy, Manaan became one of the key staging points for the Revanites, as Colonel Rian Darok, Sith Lord Darth Arkous and the Selkath Gorima performed experiments to build an \"Infinite Army\" using Rakata technology. This work was done in an underwater facility, which was later destroyed by Arkous and Darok."}, {"tag": "p", "text": "Ahto City was eventually abandoned by the Selkath some time after the New Sith Wars, and they returned to their underwater cities beneath the surface. Due to Manaan's isolation, the Selkath began to grow primitive, warring as rival factions."}, {"tag": "p", "text": "Nevertheless, kolto continued to be exported from Manaan. It would continue to be used even through the years of the Galactic Civil War, though it was considered less effective than bacta, but offered a cheaper alternative."}, {"tag": "h3", "text": "Galactic Empire and beyond"}, {"tag": "p", "text": "When the Galactic Empire was formed, Emperor Palpatine understood Manaan's potential, and sent an assault force to conquer the planet. The force consisted of thousands of aquatic assault stormtroopers and two Star Destroyers. Many Selkath were frightened by the Imperial force and surrendered. Just to be on the \"safe\" side, the Imperial forces released a huge deposit of orbital depth charges, which destroyed numerous undersea cities, forcing the Selkath to the surface. Once in Ahto City, the Empire enslaved the Selkath, and crushed any resistance."}, {"tag": "p", "text": "The Empire built a huge luxury resort in Ahto City, and the Selkath were made to serve the rich Human guests. The kolto was exploited by the Empire, and by the time the Empire withdrew, most of the kolto had been taken by the Imperial Army. Industrial pollution also tainted Manaan's blue skies and clear waters. Finally, the Order of Shasa could not hide any longer. The Order was secretly manipulated by Darth Vader, and under his guidance overthrew the Empire's forces. In return for his help, Vader commanded the Shasans to swear loyalty to him and Palpatine. Vader also instructed several Selkath in the ways of the dark side of the Force."}, {"tag": "p", "text": "By around 25 ABY, the population of Manaan had swelled to over 100 billion beings, although the area of space around the planet was only scarcely populated. Yet ultimately, Manaan became another flashpoint in a galactic war. As the Yuuzhan Vong War erupted across the galaxy, Manaan fell under siege. During the conflict between the invading Yuuzhan Vong and the New Republic, both the Yuuzhan Vong and the Ailon Nova Guard attacked the planet."}, {"tag": "h2", "text": "Inhabitants"}, {"tag": "h3", "text": "Selkath"}, {"tag": "p", "text": "The only known sentient species on Manaan were the Selkath. The Selkath had formed a civilization that dated to at least the Infinite Empire. As a species, the Selkath were amphibious in nature. Young Selkath were confined to living underwater in order to survive, as they were not able to breathe without being submersed. Adult Selkath, on the other hand, were able to breathe both in and out of the water. Over the millennia, they built Ahto City and became involved in Galactic affairs through the exportation of kolto. As Manaan lost its importance in the galaxy, the Selkath abandoned the city and retreated to their underwater pods. The society regressed into clans and factions that fought. Some Selkath, however, did go off-world in the millennia between the Jedi Civil War and the Galactic Civil War. A few Selkath Jedi fought against Darth Bane in the New Sith Wars."}, {"tag": "p", "text": "Ever since recorded history began on Manaan, the Selkath were known to be pacifists, refusing to condone violence of any sort. This resulted in the birth of their long-lived and brutally enforced neutrality policy. Their settlements were protected by Mark IV assault droids. The Ahto City Civil Authority ruled the planet, and employed war droids to enforce their laws. Competition, however, was not eliminated. The Selkath enjoyed swoop racing and various aquatic sports. Swoop racing was conducted on a track in the large, open center of the city, which was filled with water."}, {"tag": "p", "text": "During the Jedi Civil War, the Selkath were also strict environmentalists. If the environment was threatened or harmed, the parties responsible were held accountable. Possible punishment could be banishment, imprisonment, or even execution, if the crime was severe enough. Working to preserve the natural state of Manaan was met with praise from the Selkath, however, as demonstrated with Revan's destruction of the Hrakert Station."}, {"tag": "h3", "text": "Immigrated species"}, {"tag": "p", "text": "As Manaan grew in importance during the Jedi Civil War, both the Republic and the Sith established embassies on the planet in Ahto City. With this, each organization brought with them personnel to work in the embassies. During the peak of the war, individuals from across the galaxy traveled to Manaan, either to work for the competing governments, for leisure, or to take part in their sport. Others came as mercenaries looking for work or to temporarily fall out of sight."}, {"tag": "p", "text": "In the era of kolto's importance, some individuals, such as the Twi'lek Casandra Mateil and the Ithorian Queedle Molto, were prominent swoop racers on Manaan. Others, such as the Nikto Jolan Aphett and the Human Firith Me had come to the planet to play the game of pazaak. Immigrants also came to Manaan for commerce. Tyvark Luowan was a Rodian who owned a store which sold Aratech equipment, and Yortal Ixlis was an Ithorian who also owned a small shop."}, {"tag": "p", "text": "During the Galactic Civil War, Ahto City became resettled by the Galactic Empire and reestablished as a luxury resort. Numerous Humans, under the bankroll of the Empire, lived on Manaan to run the resort and numerous other Humans traveled to and visited the planet. The Selkath were enslaved at this time and made to serve the Human visitors."}, {"tag": "h3", "text": "The Progenitor"}, {"tag": "p", "text": "Manaan, being an oceanic planet, hosted numerous aquatic species in its vast seas. The Selkath were originally aquatic beings, having lived in the oceans in their earlier, prehistoric eras. As the Selkath developed and evolved the ability to live outside of water, various other species prospered in the depths of the Manaan oceans. The firaxan shark became a prominent species, though several other aquatic animals and plants could be found within the waters. The planet was also home to several avian species, flocks of which could usually be seen flying over Ahto City."}, {"tag": "p", "text": "The Progenitor was the largest of the firaxan sharks, and may have been the ancestor of sentient life on Manaan. She was a legend to the Selkath, who not only believed her to be the source of the kolto, but perhaps even the origin of their species. As a result, they regarded her with much respect. The Selkath believed that the Progenitor, with her firaxan shark offspring, was also the protector of kolto and guardian of the ecosystem. The dark side energies emitted from the Star Map combined with the presence of kolto may have contributed to the Progenitor's tremendous size and longevity. It was also believed that the Progenitor was semi-sentient."}, {"tag": "h2", "text": "Government"}, {"tag": "p", "text": "Manaan was governed by the Ahto High Court, though the Ahto City Civil Authority was the policing arm of the court at the time of the Jedi Civil War. The High Court consisted of twelve justices (five chief justices, five associate justices, and two alternate justices). Shelkar was the presiding chief justice during the Jedi Civil War, and as such, had a large proportion of control over Manaan. The Ahto High Court tried to remain impartial to all cases that came their way. Often, as was during the Jedi Civil War, many judges had strong biases, specifically regarding allegiance, whether to the Sith Empire, the Republic, or pure neutrality."}, {"tag": "p", "text": "As the ruling body, they issued orders to the Ahto City Civil Authority and kept the peace on Manaan. Disturbing the peace, or committing acts of violence, usually rendered someone imprisoned or executed. During the Jedi Civil War, the Sith attempted to undermine Manaan's system of government by kidnapping Selkath youth and training them to overthrow it. After the plot was exposed by Revan, the Ahto High Court banished the Sith from Manaan."}, {"tag": "p", "text": "After Manaan became isolated, it possessed no centralized government. Rather, the Selkath society had dissolved into rival factions and cities. During the Galactic Civil War, the Empire took control of Manaan, becoming the occupying government."}, {"tag": "h2", "text": "Locations"}, {"tag": "h3", "text": "Ahto City"}, {"tag": "p", "text": "The only city above the surface of Manaan's oceans, Ahto City was the meeting place between the Selkath and off-world visitors. It was a tremendous, shell-shaped structure that floated on top of the water's surface using a buoyancy system that seemed to incorporate the city's massive center. Kolto would be gathered here from undersea vents and shipped off to those who requested it. Indeed, much of Ahto City was a series of hangars and distribution centers. Exotic and beautiful fountains dotted the many courtyards of Ahto City. There were also many cantinas, shops, and other recreational facilities present. Other than kolto, tourism was also a major part of Manaan's economy. All visitors were given a free map and guide upon arrival. The Sith Embassy and Republic Embassy were located in Ahto as well, and were the center of each respective faction's interests on Manaan."}, {"tag": "h3", "text": "Hrakert Rift"}, {"tag": "p", "text": "The Hrakert Rift was the largest source of kolto on Manaan. It was home to thousands of firaxan sharks and the Progenitor. The rift also contained a Star Map, excavated by Republic scientists. The Hrakert Station, which secretly mined kolto for Republic uses from this location, was built on the edge of the rift. The machinery disturbed the Progenitor, who screeched loudly, driving firaxan sharks—and Selkath alike—insane. Most of the Republic scientists were killed by the crazed Selkath, and production ceased. Republic diplomat Roland Wann hired teams of mercenaries to investigate the facility, but they too were killed. The station remained shrouded in mystery until Revan arrived on Manaan, searching for the lost Star Map. Revan destroyed the Hrakert machinery to calm the Progenitor, and rescued the surviving scientists. The Hrakert Rift was later used as the base of operations for the Order of Shasa."}, {"tag": "h2", "text": "Behind the scenes"}, {"tag": "h3", "text": "Creation and development"}, {"tag": "p", "text": "Manaan first appears in the 2003 computer game Star Wars: Knights of the Old Republic. It is a planet that is visited by the player as part of the journeys throughout the game. The planet and its kolto production have a subsequent appearance in Star Wars: Empire at War. In the game, all infantry units tasked with the defense of Manaan receive an automatic healing bonus due to the presence of kolto on the planet. This does not apply to the troops of attacking forces. It has since been mentioned in numerous sources, including Prima Games' Empire at War game guide, the Knights of the Old Republic Campaign Guide, The Complete Star Wars Encyclopedia, and The Essential Atlas. Details about the planet, however, have mostly been canonically explained in the 2004 Wizards of the Coast Star Wars Roleplaying Game supplement Manaan: Depths of History by Cory J. Herndon."}, {"tag": "p", "text": "The name 'Manaan' is likely based on an Irish mythological deity called 'Manannan mac Lir' who was god of the sea and who also appears in Scottish and Manx legend."}, {"tag": "p", "text": "In early publications about the game Star Wars: Knights of the Old Republic, the Umber pod was listed as one of the closest to Ahto City. This pod, in spite of being under water, contained breathable air rather than water even though young Selkath were unable to breathe without being submersed. This information, however, has not been confirmed in a canonical source. It is also notable that this publication lists Manaan in the Syrak system with a population of 18 million during the Jedi Civil War."}, {"tag": "h3", "text": "Galactic location"}, {"tag": "p", "text": "The Wizards of the Coast Star Wars Roleplaying Game supplement Manaan: Depths of History was the first publication to indicated Manaan's location in the galaxy, placing it in the Mid Rim. The Empire at War Official Game Guide (2006) echoed this, identifying the planet as a Mid Rim world. Contrarily, a map published in 2006 by Dark Horse Comics and LucasArts Entertainment Company indicated that Manaan was located in the Inner Rim. The Wizards of the Coast 2008 publication Knights of the Old Republic Campaign Guide, confirmed the Dark Horse Comics location, in the Inner Rim. Manaan was once again illustrated throughout 2010 publication of The Essential Atlas as an Inner Rim planet, and graphically showed its astrographical relationship with the rest of the galaxy. The online companion to the Atlas, however, only reiterated the location in the Inner Rim and did not define a sector in which the planet resides."}, {"tag": "h3", "text": "Gameplay options in Knights of the Old Republic"}, {"tag": "p", "text": "In the gameplay of Knights of the Old Republic, the player has the option to destroy the Hrakert Station or release a chemical into the water and kill the Progenitor. If the player chooses to follow the dark side story-line, Revan releases the chemical resulting in the death of the Progenitor, but with the side-effect of the kolto becoming polluted and turning black. For killing the Progenitor and damaging the kolto supply, Revan is banned from visiting Manaan again on pain of death."}, {"tag": "h2", "text": "Appearances"}, {"tag": "h2", "text": "Sources"}, {"tag": "h2", "text": "Notes and references"}]}